[{"id":"comment-1607","author":"adrie","post":"Incidentally, I was preparing this consideration, about cellulose having been affected in image fibers without having being colored, and about the increased brittleness of the nodes in image fibers: In an e mail (cited by Carreira, p. 30) Rogers wrote: “I studied the chemical kinetics of the impurity materials and concluded that it was improbable that the impurities had been scorched by heat or any radiation source: the crystal structure of the flax image fibers was no more defective than non image fibers.” This is incorrect reasoning: as you have often said, Colin, “impuritiy materials” (starch, hemicellulose, lignin) may have been scorched at a temperature at which cellulose is not scorched yet (doesn’t lose hydrogen and make cross links yet). At that temperature the cellulose may have only recrystallised: heat/warmth makes water escape from the cellulose and makes dislocations/defects in the crystal structure move to the edges of the crystal. Thus, the bulk of the crystal becomes more perfect and less brittle (this is called annealing in metallurgy). But the edges of the cellulose crystal, where the crystal is connected to its surroundings and where the dislocations concentrate, would become more brittle. This would be not only at the surrounding non crystalline regions and at the (scorched) linen of the cylindrical primary cell wall, but also at the cell joints/‘growth nodes’, I think. Also loss of water may have rendered the image fiber more brittle and make it break more easily, as linen “is a very durable, strong fabric, and one of the few that are stronger wet than dry” (Wikipedia). It seems possible/likely that a sealing coating of retrograded starch (end of this comment) still more or less protects the non image fibers from drying/aging. Antonacci noted “the soft, pliable and excellent condition of the Shroud (a condition confirmed by STURP)” in his Reply to Rogers, p. 3. On image fibers, which look more corroded than non image fibers (Adler), this sealing would have been disturbed/crackled by the image formation process, allowing water to escape faster from the linen, either immediately through heat that not scorched the celluse (at a glass transition temperature, well below 300 C) or while aging after image formation. I’m very curious what you will discover with the microscope. Congratulations on the purchase. Have fun!.","date":"2012-12-31","mins":"4:37 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/29/end-of-year-brain-teaser-for-shroudies-i-challenge-you-to-explain-this-apparent-contradiction/","cat":"brain-teaser","title":"End-of-year brain-teaser for Shroudies: I challenge you to explain this apparent contradiction…"},{"id":"comment-1605","author":"adrie","post":"Thanks Colin. I found the 200 nm +/ 200 nm range here..","date":"2012-12-31","mins":"1:55 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/29/end-of-year-brain-teaser-for-shroudies-i-challenge-you-to-explain-this-apparent-contradiction/","cat":"brain-teaser","title":"End-of-year brain-teaser for Shroudies: I challenge you to explain this apparent contradiction…"},{"id":"comment-1514","author":"adrie","post":"Hello Hugh, just some thoughts: – As far as I know, it is unknown to which temperature the background of the Shroud has been heated. It needn’t have been the 220 C of the scorches. – As to the UV photo: “The film was to record only radiation emitted in the visible region of the spectrum, and none of the reflected, exciting UV. Consequently, the light source had to be free of visible radiation. To achieve these conditions special excitation filters were constructed to fit on the 15 cm diameter strobe sources.” (M&P p.73) They probably saw the fluorescence was weak and exposed the film a long time. – The molten silver hypothesis has already been refuted by Guerreschi and Salcito. – I think you’ll get red fluorescence if you anaerobically scorch/bake unbleached linen that fluoresces lignin blue. Some furfural lignin polymer doing the trick. – Have you scorched any non fluorescing cotton yet?.","date":"2012-12-19","mins":"8:50 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","title":"“Let’s poke ’em with hokum…”"},{"id":"comment-1500","author":"adrie","post":"Hope this helps: I started with an ordinary b&w paper copy from a university library. Three weeks ago I bought a digital color copy at the Journal of Biocommunication for $25 USD, by mailing Ms. Carol Gray (it indeed got subsumed into this journal). I got color photograps of poor quality of yellowed journal pages, but it is better than nothing. Miller and Pellicori’s article is: Journal of Biological Photography, Vol 49, No 3, 1981, p. 71 85, but there are other important articles on Shroud fluorescence, for instance Gilbert, R., and M.M. Gilbert, Ultraviolet visible reflectance and fluorescence spectra of the Shroud of Turin, Applied Optics, Vol. 19, No. 12, June 1980, pp. 1930 1936 Pellicori, S.F., Spectral Properties of the Shroud of Turin, Applied Optics, Vol. 19, No. 12, 1980 pp. 1913 1920 They are behind paywall here. I haven’t found any of them free online, but I’ve quoted quite a few pieces of them in my comments on this site: Oct 24 on red and green Shroud scorches and a reply Oct 25 on non fluorescing Shroud ‘scorches’ and its note Oct 25 on the background fluorescence Nov 13 also on the background fluorescence Nov 20 on furfural and the background fluorescence And, as Colin said, there are also quotes in my article Internal selvedge in starched and dyed temple mantle, especially in paragraph 2.3. On (fluorescent) Madder dye, and paragraph 4.2.5. On the fluorescence shift between background and image, and in their endnotes..","date":"2012-12-17","mins":"3:36 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/07/lets-poke-em-with-hokum/","cat":"hokum","title":"“Let’s poke ’em with hokum…”"},{"id":"comment-1563","author":"adrie","post":"Merry Christmas to you, Colin.","date":"2012-12-24","mins":"11:27 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/19/guest-posting-from-hugh-farey-yipee-another-science-bod-heres-a-snapshot-of-his-current-studies-of-scorching-and-uv-fluorescence/","cat":"hugh_farey","title":"Guest posting from Hugh Farey (yipee – another science bod!): here’s a snapshot of his current studies of scorching and uv fluorescence."},{"id":"comment-1717","author":"adrie","post":"For the color difference between ghost and substrate, see the photomicrographs of a locally abraded image layer in three different views (one of them also in Fanti’s fig. 17 p. 13, where the caption says the dark lines in the colored area are cracks in the surface). Re the ghosts of non image fibers: they were colored too, says evidence A3, in which “Zugibe and Rogers 1978” = “collection of 86 photomicrographs, archived by Barrie Schwortz 1978, 1985” (p. 19). Adler called the color of the background “fibrils” “pale yellow”, while he called the color of the image fibrils “yellow” and that of the 1534 AD backing cloth’s fibrils “very pale” (not yellow) (Heller&Adler, A Chemical Investigation, table 2, reproduced in Heimburger, A detailed critical review, p. 12). Elsewhere Adler called the color of the image fibers “straw yellow” (The Nature of the Body Images, p. 2). Of a “yellow patina on one surface of many Roman period papyri from Tebtunis” it is said that it is “possible that the basic overall yellow shade is due to the natural ageing of a layer of paste on the surface”, viz. “the light paste wash mentioned by Pliny” (Ancient Egyptian Materials and Technology, p. 238). Alas, no visualisation by photomicrographs, perhaps Barrie can help … Sorry about the starch ….","date":"2013-01-14","mins":"8:04 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?"},{"id":"comment-1718","author":"adrie","post":"Drat, another wrong link. Here’s the right one: The Nature of the Body Images, p. 2..","date":"2013-01-14","mins":"8:32 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?"},{"id":"comment-1707","author":"adrie","post":"Hello Colin, To answer your question: “Al Adler mounted image fibers in plastic and cut sections normal to the length of the fibers. He did not see any color in the cellulose.” (Dan in his posting of May 7, 2012; see also my comment). It was the second of “Adler’s observations” (plural) mentioned by Rogers in FAQ 12, p. 11, of which he only described the first one (the ‘diimide observation’). I haven’t found the ‘cross section observation’ in the compilation of Adler’s articles in The Orphaned Manuscript. BTW, ‘ghosts’ were also pulled from non image fibers of the Shroud: “Phase contrast photomicrographs show that there is a very thin coating on the outside of all superficial linen fibers on Shroud samples named “Ghost”; “Ghosts” are colored (carbohydrate) impurity layers pulled from a linen fiber by the adhesive of the sampling tape and they were found on background, light scorch and image sticky tapes (Zugibe and Rogers 1978, Rogers 2002).” (Evidence A3, p. 4 of Evidences for testing hypotheses)..","date":"2013-01-14","mins":"10:51 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?"},{"id":"comment-1725","author":"adrie","post":"Prompted by Thibault’s reply on the Other Site, I searched the Superficiality paper, now online for free. Figures 9 B and C and 10 2 (p. 8) show that the color really is superficial: the uncolored substrate still connects the two parts of the broken image fiber..","date":"2013-01-15","mins":"9:04 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?"},{"id":"comment-1760","author":"adrie","post":"I forgot to stress that the seam rejoins two sections cut from the same cloth (Flury, Proceedings Turin 2000, p. 24 and fig. 3 a, drawing and photo of open TS seam, of which the drawing is also in Soons’ presentation, slide 11). This, and the transverse hems being rolled and stitched across the longitudinal seam (A detailed critical, p. 3 fig. 15), renders the option that the seam was made to hold a supporting rod for display purposes improbable. Thank you, Colin, for reminding me of it..","date":"2013-01-21","mins":"5:16 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/05/raymond-n-rogers-sturp-supremo-chemist-rip-who-sadly-lost-the-plot-due-to-an-apparent-blind-spot-it-would-seem-for-those-ultra-thin-and-highly-superficial-primary-cell-walls-of-flax-and-linen/","cat":"checker_illusion","title":"Raymond N Rogers: STURP supremo chemist (RIP) who sadly lost the plot (due to an apparent blind spot,  it would seem,  for  those ultra-thin and highly superficial primary cell walls of flax and linen fibres)."},{"id":"comment-1780","author":"adrie","post":"Actually, the letter ayin ( Y ) means 70 and ayin aleph ( X Y ) means 71. Hebrew is written from right to left. The nun mark ( l ) on the Shroud is not a final nun (completely straight: | ), so it isn’t the end of a three letter word, but rather an abbreviation..","date":"2013-01-23","mins":"1:43 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/05/raymond-n-rogers-sturp-supremo-chemist-rip-who-sadly-lost-the-plot-due-to-an-apparent-blind-spot-it-would-seem-for-those-ultra-thin-and-highly-superficial-primary-cell-walls-of-flax-and-linen/","cat":"checker_illusion","title":"Raymond N Rogers: STURP supremo chemist (RIP) who sadly lost the plot (due to an apparent blind spot,  it would seem,  for  those ultra-thin and highly superficial primary cell walls of flax and linen fibres)."},{"id":"comment-1759","author":"adrie","post":"Hello Colin, Would you please be so kind again to paste another e mailed comment here? Thanks. Reply: with pleasure Adrie. Here it is (I’ll read and, if need be, comment later): Here’s a comment to FAQ 15 on first century features, and FAQ 13 on starch evidence: STARCH Both Kohlbeck and Rogers found starch in an image area and a non image area. They both got a positive standard starch test (deep red) from non image fibers. These fibers were from 14 Raes threads – not C14 threads –, which Rogers got from Gonella in 1979 (A Chemist’s Perspective, p. 64), and which I assume authentic and not part of a repair). Kohlbeck’s photo slide #42 shows that all ca. 15 fibers in view are completely red brown; better visible on the third slide on this HSG page (HSG password request form). Also Mc Crone and Adler independently reported the presence of starch on the Shroud. For details see Internal Selvedge, 2.2 and 4.2.1. Rogers found that the starch was insoluble in concentrated H Cl = hydrochloric acid and that the coating completely surrounded all surface fibers of his Raes sample and even was sometimes inside the fiber, as if wiped on as a viscous paste (Scientific Method, p. 17 20, cf. My comment of Jan 3 and the SEM fiber cross sections in Brown, Microscopical Investigation, p. 7 8, and, if you like, Baldan’s SEM photos of Shroud fibers furnished by Riggi di Numana on Fanti’s homepage). So, the starch indeed did not have the shape of an uneven exsiccation layer or of a trace contamination. However, the use of a “warp sizing paste” of starch during weaving is not specific for the first century, for it is still used today (products 2 1 and 2 2). SAPONINS Saponins from Saponaria (soap weed) is more specific for ancient technology. For some reason, Rogers didn’t search for saponins (the washing molecules) but only for certain hydrolysis products of Saponaria saponins: reducing pentose sugars. He didn’t find them on non image non scorch fibers (A Chemist’s Perspective, p. 40). Schwalbe&Rogers reported that saponins were not found by PMS (Physical and Chemical, p. 14), but PMS was not really done on controls – the only control was a Raes sample (PMS paper, p. 2) which released early furfural, the Raes corner being a scorch area ( Internal Selvedge, 2.5.1.). On image or scorch fibers the saponins could or would have been broken down by image formation or scorching. So, in fact, we don’t know whether there are saponins on the background of the Shroud. SEAM AND STITCHING Technique “Dr. Flury Lemberg found the cloth’s finishing, at its hems, and in the joining seam to have been done using an unusual type of stitching very nearly invisible on one side, and as such closely resembling that of ancient Jewish textiles as found at Masada, the Jewish palace fortress that was overthrown by the Romans in AD 73, never to be occupied again” (BSTS newsletter 51). In the Proceedings of the 2000 Turin symposium, Flury Lemberg shows a drawing of the type of seam (visible in Soons’ presentation, slide 11), and calls it ‘seam type Masada’: “Abb. 3 a Zeichnung: Nahttyp Masada” (Proceedings, p. 34). It might be described as a kind of rolled seam, secured with two lines of tiny overcast stitches. It is interesting that the ancient Egyptians specifically used two lines of overcast stitches to sew on a fringeless braid along an edge of a garment: “Only a limited range of structural details, such as seams and hems, were used in ancient Egypt. The most common of these were: simple hems, rolled and whipped hems, simple (open) seams, and lap over seams. Other seams known from the Dynastic period include a form of run and fell seam and overcast seams (see Fig. 11.11), but these were rarely used on items of clothing. When a braid was added to a garment, one of several techniques was used, depending on the nature of the braid and the place where it was to be attached. If it was a fringed braid placed at the lower edge of a garment, it would normally be secured with one line of overcast stitching (e.g. Carter no. 367i; Cairo JE 62625). On the other hand, two lines of overcast stitching were used to sew on fringeless braids, whether along an edge of a garment or down the middle” (Ancient Egypt materials and technology, p. 282 283). The type of seam for the Egyptian fringeless braids is not described or depicted, nor is the Masada type seam among the depicted seams (Fig. 11.11, p. 283). The Egyptian mending stitches – whipped stitch and running stitch (p. 283) – are different from the non whipped overcast stitches of the TS seam. Note that the cloth of the Egyptian braids were woven differently from the garment they were sewn on to, as they were meant to be clearly visible decorative elements ( p. 276, figure 11.6). Moment and reason of seam application X ray photography showed “the absence of any evidence of any frayed thread ends along either side of the seam image” and a “detailed thread matching” across the seam (Adler&Whanger, Concerning the Side Strip, with X ray photos). Also Miller&Pellicori reported the near perfect match in UV, backlight and X ray (Ultraviolet Photography, p. 85). Flury said that the seam was applied before the lateral hems were, and both were stitched by the same professional hand probably in a single operation (Proceedings 2000, p. 24). Also, the stichting was done from the backside of the cloth (the weft side, where also the hems are), in such way that on the front side the stitches are hardly visible and the seam is invisibly flat (p. 24 25). Moreover, the seam was already planned before weaving, for it is in an internally woven in selvedge of warp threads that have spun in cotton (Internal Selvedge, 2.1). The seam thus would have been made at manufacture. It wouldn’t have been a mending, or a rejoining of the two outer parts of the cloth from which an inner third strip had been removed, or even the adding of a decorative braid: it was merely done to have been done. This deliberate extraordinary procedure fits with the strict observance of the religious law of Nu 15,38, which in the Bible that was generally used in first century Judea literally read that a margin (‘kraspeda’) had to be added to every robe (Nu 15,38 LXX). The first century Gospel of Matthew says it was custom for Pharisees to “enlarge the borders (‘kraspeda’) of their garments” (Mt 23,5 KJV and WH). ONE TIME DYE As a yellow plant dye was found in the starch/starch gum coating (Scientific Method, p. 17 20), and Madder lake particles on the main Shroud (Internal Selvedge, 2.3 and 2.4), it is probable that the Shroud was starched, washed, and then dyed as cloth, without completely removing the starch first. The starch would protect the cloth from wear and tear, but it would not allow warm laundering the dirty cloth without removing the starch and dye together at once. Bleaching or laundering was not allowed for Jewish temple garments – they would simply be cut into wicks for the temple’s oil lamps (Mishneh Torah, Kli Hamikdasch 8, Halacha 4 5) – and the temple was destroyed in 70 AD. PETALON 3 D displays of the TS show a flat, more or less oval object beneath the chin, with protuberant marks that can be read as the Hebrew characters ayin aleph nun, almost similar to l X Y in Times New Roman characters (cf. The 1978 photo 210×250 pixels and its 3 D display with isolines showing the flatness and the three protuberent characters). The object may be a ‘petalon’ (Ex 28,36 LXX): the distinctive petal shaped golden ornament of the Jewish high priest (see third century AD mural) and probably all members of the ruling Jewish Council, the Sanhedrin, consisting of 71 members. The characters l X Y may be the Hebrew numerals 7 and 1 and letter N, an abbreviation of “71 Nesiim” = 71 rulers. First century historian Josephus said the petalon still existed in the first century (Jewish Antiquities 3,7,6 and 8,3,8). The Jerusalem Gemara (a 350 400 AD commentary on the Mishnah, a 220 AD written version of oral traditions dating from Pharisaic times = 536 BCE – 70 AD) said it was two fingers broad and reached from ear to ear and had protuberant letters (book Kli Hamikdash 9,1 2). Epiphanius said it was worn by James the Just, brother of Jesus (Panarion 29,4,4, p. 125), and Polycrates, stressing the Jewish origin of the Christian Passover date by referring to the evangelist John’s Jewish authority, said in 189 199 AD that the petalon was worn by the priest John the evangelist (Eusebius, Church History 3,31,3), apparently with a different inscription than the two words reserved for the liturgical high priest. The petalon with three letters would be exclusively first century (6 70 AD), as before 6 AD the petalon was still only worn by the king and the high priest (Epiphanius, Panarion 29,3,3 6 p.124) and after 6 AD the Jews didn’t have a king anymore and the high priest’s liturgical petalon was kept locked up by the Romans (Jew. Antiq. 15,11,4 ad 18,4,3). After 70 AD Jerusalem was devastated by the Romans and there wasn’t a temple or Sanhedrin that ruled Judea anymore. A petalon on the Shroud would strongly associate it with Jesus, for no other crucifixion victim is known to have been buried in the presence of one, let alone two or three members of the Sanhedrin: Joseph of Arimathea, Nicodemus and John the evangelist. Only John – not Peter – believed Jesus had risen because he saw the shroud (his own temple mantle) rolled up and placed at the head end of the stone bench of the tomb, just as a priest’s temple mantle was always rolled up and placed at the head end of the stone bench in the dormitory of the temple (see my articles The seam and missing corners of the Turin Shroud as characteristics of John Mark’s temple mantle and John Mark – Author of the Gospel of John with Jesus’ mother)..","date":"2013-01-21","mins":"3:16 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/05/raymond-n-rogers-sturp-supremo-chemist-rip-who-sadly-lost-the-plot-due-to-an-apparent-blind-spot-it-would-seem-for-those-ultra-thin-and-highly-superficial-primary-cell-walls-of-flax-and-linen/","cat":"checker_illusion","title":"Raymond N Rogers: STURP supremo chemist (RIP) who sadly lost the plot (due to an apparent blind spot,  it would seem,  for  those ultra-thin and highly superficial primary cell walls of flax and linen fibres)."},{"id":"comment-1784","author":"adrie","post":"Yes, Colin, I played the settings in Image J, to find the best view for the l X Y. But also the plain STERA photo clearly shows the marks in white, which simply corresponds to the highest level in 3 D relative to the surrounding noise. I think it is improbable that the marks themselves are noise..","date":"2013-01-23","mins":"2:43 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/05/raymond-n-rogers-sturp-supremo-chemist-rip-who-sadly-lost-the-plot-due-to-an-apparent-blind-spot-it-would-seem-for-those-ultra-thin-and-highly-superficial-primary-cell-walls-of-flax-and-linen/","cat":"checker_illusion","title":"Raymond N Rogers: STURP supremo chemist (RIP) who sadly lost the plot (due to an apparent blind spot,  it would seem,  for  those ultra-thin and highly superficial primary cell walls of flax and linen fibres)."},{"id":"comment-1782","author":"adrie","post":"The Shroud’s fabric has ca. 40 warp threads and 25 weft threads per square cm (Rinaldi, Autogol a Tucson). Each thread (ca. 0.25 mm diameter) consists of 70 120 fibers of 10 20 micrometer diameter (Evidences list, introduction p. 2, and evidence A6), spun in a Z twist, as opposed to the ordinary Egyptian S twist (Tyrer, Looking at the Turin Shroud as Textile, p. 20). The white linen of the temple priest’s garments had to be “bysso retorta” (Ex 39,2.8.22.28 Vulgate), in which “bysso” means the finest/whitest linen or cotton, and “retorta” means ‘twisted backwards’, viz. In a Z twist, either for a 2 ply twined thread or a 1 ply single thread (The Seam and Missing Corners, p. 16 note 36). The ancient Egyptians were capable of making incredibly fine linen garments, e.g. The girdle of Ramses III has 107 134 warp threads per cm. Textial expert Vial noted during the 1988 sampling of the Shroud, that “faults in the preparation of the shafts point to a specifically ancient twill weave manufacturing method” and said that “the only European 3.1 chevron twill in linen that stands some comparison to the Shroud is the canvas of a late 16th. Century ‘Last Supper’ painting attributed to Martin de Vos – and even so its weave is much simpler than that of the Shroud. In effect, he concludes, the Shroud weave is ‘incomparable’” (BSTS newsletter 26,9, p. 2). Also a sample of a herringbone weave of Z twisted threads from ca. The second half of the fourteenth century (Victoria & Albert museum), has only 22 warps and 12 wefts per square cm and coarser yarns than those of the Shroud, and thus “is not a candidate for a parallel to the fabric of the Turin Shroud” Tyrer, The textile said to be similar in weave to the Turin Shroud ..","date":"2013-01-23","mins":"1:55 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/05/raymond-n-rogers-sturp-supremo-chemist-rip-who-sadly-lost-the-plot-due-to-an-apparent-blind-spot-it-would-seem-for-those-ultra-thin-and-highly-superficial-primary-cell-walls-of-flax-and-linen/","cat":"checker_illusion","title":"Raymond N Rogers: STURP supremo chemist (RIP) who sadly lost the plot (due to an apparent blind spot,  it would seem,  for  those ultra-thin and highly superficial primary cell walls of flax and linen fibres)."},{"id":"comment-1785","author":"adrie","post":"Word Press is playing tricks on me: the link to “Tyrer, Looking at the Turin Shroud as Textile” must be http://www.sindone.info/TYRER1.PDF , including the http://. Otherwise it links to a non existing bookmark in the main posting..","date":"2013-01-23","mins":"2:59 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/05/raymond-n-rogers-sturp-supremo-chemist-rip-who-sadly-lost-the-plot-due-to-an-apparent-blind-spot-it-would-seem-for-those-ultra-thin-and-highly-superficial-primary-cell-walls-of-flax-and-linen/","cat":"checker_illusion","title":"Raymond N Rogers: STURP supremo chemist (RIP) who sadly lost the plot (due to an apparent blind spot,  it would seem,  for  those ultra-thin and highly superficial primary cell walls of flax and linen fibres)."},{"id":"comment-1691","author":"adrie","post":"As a response I invite you to take a look at this photo of a corona discharge or at fig. 3 of the CD paper (p. 5). They show deflecting streamers. The streamers are initiated by electrons, hitting air molecules/atoms, knocking out a free electron and leaving a positively charged ion behind. The positive ion and the negative electrons will subsequently preferrably move along the electric field line at the point of collision, but in opposite directions. When somewhere on its pathway one of the new free and electrostatically accelerated electrons collides with another air molecule, this molecule will in its turn ionise and produce a new free electron and ion, which start a new path way, in the direction of the field line at the point of this second collision. Then, somewhere on this new pathway a next collision will occur to the next air molecule, and so on. The glow of the corona is caused by electrons recombining with positive ions to form neutral atoms, which are not accelerated by the electric field (Mechanism of corona discharge). The streamer is not a long continuous flow of molecules, but a chain of short pathways of separating and recombining ions and electrons along the local electric field line. The air pressure effects are minimal and wavelike: a corona discharge produces accoustic emissions. Your responses to Rogers’ FAQ paper are thorough and in a way necessary, Colin. Nevertheless, I have a few more points I have to address, among which one about first century Jewish provenance..","date":"2013-01-10","mins":"4:12 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/05/raymond-n-rogers-sturp-supremo-chemist-rip-who-sadly-lost-the-plot-due-to-an-apparent-blind-spot-it-would-seem-for-those-ultra-thin-and-highly-superficial-primary-cell-walls-of-flax-and-linen/","cat":"checker_illusion","title":"Raymond N Rogers: STURP supremo chemist (RIP) who sadly lost the plot (due to an apparent blind spot,  it would seem,  for  those ultra-thin and highly superficial primary cell walls of flax and linen fibres)."},{"id":"comment-1692","author":"adrie","post":"I’m sorry, it’s fig. 3 of Fanti’s second CD paper of 2008..","date":"2013-01-10","mins":"4:27 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/05/raymond-n-rogers-sturp-supremo-chemist-rip-who-sadly-lost-the-plot-due-to-an-apparent-blind-spot-it-would-seem-for-those-ultra-thin-and-highly-superficial-primary-cell-walls-of-flax-and-linen/","cat":"checker_illusion","title":"Raymond N Rogers: STURP supremo chemist (RIP) who sadly lost the plot (due to an apparent blind spot,  it would seem,  for  those ultra-thin and highly superficial primary cell walls of flax and linen fibres)."},{"id":"comment-1686","author":"adrie","post":"Hello Colin, here’s a comment on FAQ 17 point 3 on electromagnetic radiation vs corona discharges: In an electrostatic field the locations of preferred discharge are the most protruding and pointed places: a lightning bolt will rather strike a bell tower than a house standing beside it. “A discharge may exist in the vicinity of a sharp point, or other place with a small radius of curvature where the electric field is increased significantly from its average value” (Dr. Calvert on electrical discharges). The electrostatic field lines are not straight but curved lines that bend to the most protruding, most pointed points, also if these are threads or even fibers that are just slightly more protruding than others (see again fig. 5 p.7 of CD paper). The geometry of the cloth surface determines the distribution of the “surface electrostatic stress (surface electric field intensity)” (CD paper p. 4, points 3, 4 and 6) and therefore determines the distribution of the filamentary streamers of electric charge toward the cloth. Electrostatic field lines and discharge streamers are not the same as electromagnetic radiation that ‘fires’ along straight lines. Discharge streamers don’t penetrate the cloth either. In the CD model and experiments “The glow CD layer is interrupted by the presence of the TS and re starts on the outer surface of the TS” (CD paper p. 9). Any discharge that hit the reverse of the Shroud would have come from the reverse side, from the outside of the doubled Shroud. In a corona discharge, the accompanying UV luminescence is generated inside the streamer, also where it hits the cloth: it would not radiate from the body itself. A CD is also accompanied by heat and “aggressive chemical by products” (CD paper p. 18 19)..","date":"2013-01-10","mins":"1:23 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/05/raymond-n-rogers-sturp-supremo-chemist-rip-who-sadly-lost-the-plot-due-to-an-apparent-blind-spot-it-would-seem-for-those-ultra-thin-and-highly-superficial-primary-cell-walls-of-flax-and-linen/","cat":"checker_illusion","title":"Raymond N Rogers: STURP supremo chemist (RIP) who sadly lost the plot (due to an apparent blind spot,  it would seem,  for  those ultra-thin and highly superficial primary cell walls of flax and linen fibres)."},{"id":"comment-11280","author":"adrie","post":"Hi Yannick, I took a closer look at Rogers’ answer to question #12 (http://shroud.com/pdfs/rogers5faqs.pdf ). It was based on Adler’s two observations, quoted by Dan from Rogers: 1) diimide rendered the fibers colorless and undamaged again, and 2) cross sections of the fibers didn’t show color in the cellulose. (https://shroudofturin.wordpress.com/2012/05/07/the body image is created by molecular change of linen fibres really/ ) Then, Rogers didn’t say that the colorlessness of stripped fibers confirmed that diimide treated fibers were colorless and undamaged again, but that it confirmed that “the cellulose” was not colored. I agree with you that Rogers’ words suggest the primary cell wall was not colored, but he didn’t and couldn’t say it, because Adler’s two observations plus the colorlessness of the stripped fibers don’t prove it. They only imply the colored layer could have been linen and/or impurities. At your point 11 : The continuity of the cloth’s banded appearance through the image does not prove there are impurities that influenced the image formation. Because the image consists of colored and not colored fibers as in a pixel image, the bands of the background simply ‘shine through’ the image via the not colored fibers in it (addition to http://jesusking.info/Internal%20selvedge.pdf p. 32). Nevertheless, I agree with you and Ron that there were impurities, based on other scientific observations..","date":"2012-05-11","mins":"2:25 pm","url":"https://shroudstory.com/2012/05/11/sentence-one-in-the-richard-dawkins-challenge-is-wrong-period/","cat":"challenge","title":"Sentence One in the Richard Dawkins Challenge is Wrong. Period."},{"id":"comment-11282","author":"adrie","post":"Yannick’s point 11 , got changed into point 16 , so he added at least 5 points, after I printed Yannick’s first guest posting..","date":"2012-05-11","mins":"3:38 pm","url":"https://shroudstory.com/2012/05/11/sentence-one-in-the-richard-dawkins-challenge-is-wrong-period/","cat":"challenge","title":"Sentence One in the Richard Dawkins Challenge is Wrong. Period."},{"id":"comment-11283","author":"adrie","post":"Also his address to me, personal, about Rogers’ answer to question #12, disappeared..","date":"2012-05-11","mins":"3:49 pm","url":"https://shroudstory.com/2012/05/11/sentence-one-in-the-richard-dawkins-challenge-is-wrong-period/","cat":"challenge","title":"Sentence One in the Richard Dawkins Challenge is Wrong. Period."},{"id":"comment-11299","author":"adrie","post":"Yannick’s first published guest posting also said it was his reply to my comment https://shroudofturin.wordpress.com/2012/05/07/wheres the beef/#comment 11244 to him..","date":"2012-05-12","mins":"2:41 am","url":"https://shroudstory.com/2012/05/11/sentence-one-in-the-richard-dawkins-challenge-is-wrong-period/","cat":"challenge","title":"Sentence One in the Richard Dawkins Challenge is Wrong. Period."},{"id":"comment-1463","author":"adrie","post":"Well, as I said, it seems it could have been serum that somehow flowed further down over the wrist than the red part. After death, when the heart has stopped pumping, the blood starts to separate into a red part and a serous part. This is called livor mortis, which “starts twenty minutes to three hours after death”; rigor mortis “commences after about three to four hours”. The unflattened dorsal side in 3 D suggests rigor mortis had already started before burial. Plasma/serum is less viscous than the red part. So, perhaps the serous part flowed down just a little bit further than the red part and concentrated largely at the tip, creating an orange margin. After all, some separate serum has been found on the Shroud..","date":"2012-12-14","mins":"9:03 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/06/no-mr-breault-the-blood-is-on-the-hair-because-thats-where-the-artist-intended-it-to-be/","cat":"medieval_forgery","title":"No Mr. Breault – the blood IS on the hair (because that’s where the artist intended it to be)"},{"id":"comment-1448","author":"adrie","post":"Yes, I agree with you that the entire hand looks rather bony and a medieval painter could have made a mistake. And you’re also right that a palm wound isn’t anatomically incorrect after all if the victim had foot support. Because of the Shroud, Barbet did tests on the palm, and, without factoring foot support, concluded that the palm is too weak. Zugibe did other experiments including foot support and concluded that the palm is anatomically correct after all (e.g. New Experimental Studies in Crucifixion)..","date":"2012-12-12","mins":"7:39 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/06/no-mr-breault-the-blood-is-on-the-hair-because-thats-where-the-artist-intended-it-to-be/","cat":"medieval_forgery","title":"No Mr. Breault – the blood IS on the hair (because that’s where the artist intended it to be)"},{"id":"comment-1446","author":"adrie","post":"These are some of my considerations, Colin : 1) It could be authentic post mortem blood because some would have come out after removal of the nail (Zugibe), and the wrist is a body sheet contact zone. 2) There almost must be (or have been) authentic blood on the wrist because a medieval artist most probably wouldn’t have painted it on the wrist but on the palm (De Wesselow), unless he already saw traces of blood on the wrist and touched them up. 3) It almost couldn’t have been only painted fresh blood or blood substitute because the wrist blood has margins that are lighter than the surrounding image. Some are lighter in both ordinary and UV light (e.g. At the bottom and around the broad tip of the stain), and one, around the narrow tip, is lighter only in UV (your contrast enhanced close up shows no lighter margin here, but zooming in on the UV photo, it does). This margin that is lighter only in UV, seems to be part of the red orange stain in ordinary light, and could have been formed by orange plasma/serum (that flowed to the tip of the red flow during the post mortem efflux). Serum is fluorescent (e.g. Its minimal constituent lipofuscin fluoresces blue: 402 nm under 366 nm) and would have prevented fluorescence quenching in image formation. Lighter margins in both UV and ordinary light could have been formed by a)perhaps a very clear plasma/serum that prevented image formation (in that case the plasma/serum would be pre image); a post image painted on ‘serum’ would not have created lighter margins in ordinary light. B)blood (or plasma) that flaked off (in that case the blood or plasma would have been pre image and preventing image formation). C)a kind of ‘tenting effect’ (in that case the welt or elevated clot would be pre image): electrostatic field lines ‘tent away’ from concave surfaces such as those surrounding a welt or dry elevated blood clot, but concentrate on convex or pointed surfaces: see CD paper, fig. 5 and especially fig. 13, which shows that the CD marks of concave hollows are light, and those of convex hills are dark with a light surrounding halo because of their concave margins; scorch tenting from a bas relief would need the medieval artist to have made a welt or clot bas relief on the wrist, and to have painted its dark mark red later. 4) There is at least some separate plasma/serum on the Shroud. The sticky tape sample of the narrow tip of the wrist blood (3 EF) belonged to the tape set used for blood tests by Heller&Adler (A Chemical, Table 1). In this set, they found both red particulate coated fibers (which particulates were non birefringent) and gold yellow coated fibers, and both coatings could be completely dissolved by proteases (Ibid. P. 40 41). On the gold fibers they got a positive Bromcresol Green test for serum albumin (Ibid. P. 40). I understand that in medicinal leeches the serum is excreted rapidly (your posting). The only scourge sample taken (1 FB = “Image: Blood on Scourge Mark”, from one of the calves) did not belong to the set tested for blood by H&A. As to the Word Press system: I don’t mind waiting for your approval. And thanks for the link!.","date":"2012-12-12","mins":"6:08 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/06/no-mr-breault-the-blood-is-on-the-hair-because-thats-where-the-artist-intended-it-to-be/","cat":"medieval_forgery","title":"No Mr. Breault – the blood IS on the hair (because that’s where the artist intended it to be)"},{"id":"comment-1591","author":"adrie","post":"Above, in 3b) I forgot to mention that the blood and the image layer may have flaked off together. In that case the blood needn’t have been pre image..","date":"2012-12-28","mins":"2:18 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/06/no-mr-breault-the-blood-is-on-the-hair-because-thats-where-the-artist-intended-it-to-be/","cat":"medieval_forgery","title":"No Mr. Breault – the blood IS on the hair (because that’s where the artist intended it to be)"},{"id":"comment-1413","author":"adrie","post":"Hello Colin, I agree with you that the blood on the frontal head doesn’t prove there was a real corpse and that clotted blood doesn’t flow at all. There seems to be no “fibrinolysis” on a dead man, or even on a living man, within the “less than 40 hours” that the uncorrupted body would have been inside the cloth (Brillante, 2002, p. 1), and on hair or intact skin it is entirely impossible: “Tissue plasminogen activator (t PA) and urokinase are the agents that convert plasminogen to the active plasmin, thus allowing fibrinolysis to occur. T PA is released into the blood very slowly by the damaged endothelium of the blood vessels, such that after several days (when the bleeding has stopped) the clot is broken down. This occurs because plasminogen became entrapped within the clot when it formed; as it is slowly activated, it breaks down the fibrin mesh.” (Fibrinolysis) De Wesselow suggested that the blood on the head is postmortem blood that got released at the removal of the crown of thorns, and on the frontal side perhaps dripped from the crown unto the face and unto the hair that had already adhered because of dry clotted blood in it (The Sign, end of ch. 10). My view, for now, is that the Shroud has both authentic postmortem blood (e.g. On the wrist) and painted on ‘blood’ (e.g. In scourge marks). I’m still thinking and searching..","date":"2012-12-08","mins":"10:48 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/12/06/no-mr-breault-the-blood-is-on-the-hair-because-thats-where-the-artist-intended-it-to-be/","cat":"medieval_forgery","title":"No Mr. Breault – the blood IS on the hair (because that’s where the artist intended it to be)"},{"id":"comment-1245","author":"adrie","post":"Thank you very much, Colin, for the posting and flagging up of my comment. It’s very kind of you. I guess I should have mentioned it earlier, as my name Adrie doesn’t betray it, but I’m a woman. But I also listen to “his” 🙂.","date":"2012-11-22","mins":"5:43 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/23/thibaults-principle-true-for-a-stepped-template-maybe-but-not-an-artistic-bas-relief-with-rounded-contours-and-gentler-relief/","cat":"medieval_forgery","title":"Thibault’s Principle: true for a stepped template, maybe – but not an artistic bas relief with rounded contours and gentler relief"},{"id":"comment-1181","author":"adrie","post":"Thank for adding the comment up here, Colin. I’m glad to see the links are there. If you wish to display it as a new posting, I wouldn’t mind..","date":"2012-11-13","mins":"12:01 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/23/thibaults-principle-true-for-a-stepped-template-maybe-but-not-an-artistic-bas-relief-with-rounded-contours-and-gentler-relief/","cat":"medieval_forgery","title":"Thibault’s Principle: true for a stepped template, maybe – but not an artistic bas relief with rounded contours and gentler relief"},{"id":"comment-1175","author":"adrie","post":"Thanks for your e mail address, Colin. I tried posting the comment again, and now I received the error message: “Duplicate comment detected; it looks as though you’ve already said that!” So, it’s probably on its way… The second post still would be enough… (ed: Adrie’s comment below has now arrived at last by email): Hello Colin, This is a late and long reply to your comment about essentially anaerobic conditions for a new scorch from under a heated template. I’ve been pondering on it as well, and thought that the ‘green’ scorches on the Shroud may have been aerobic, even though at the bottom of the reliquary, because the bottom layer of the folded cloth was only about half the length of the folded package. There was a furrow with oxygen rich air under the cloth (see top right figure on p. 3 of G&S). The heated object scorched the upper layers “in an oblique manner” (G&S p. 2) (probably initially aerobic, but when the object moved down more and more anaerobic), but when it reached the bottom layer it reached the furrow with oxygen and scorched the donut shaped marks with green fluorescence. The object couldn’t move further down, as it had reached the bottom of the reliquary, so any new lack of oxygen would not have resulted in replacement of the ‘green’ donuts by larger holes with ‘red’ scorch borders. And the reliquary at some point opened up, admitting the water that caused the small watermarks and eventually new air. Rogers’ book says that Pellicori reported that “the margins of the scorches fluoresced in the green, entirely different than the background of the Shroud”, but doesn’t give a reference (A Chemist’s Perspective on the Shroud of Turin, p. 20). Pellicori’s observation would corroborate Miller’s experiments, in which the ‘red’ scorches were anaerobic, and the ‘green’ ones aerobic. “Modern linen can be artificially aged by baking at high temperature (125º 150º C) to the point where its reflected color and fluorescent emission approach those of the Shroud”; “a 5 h air bake at 150ºC. […] the time/temperature exposure used reproduces the color of the Shroud” (M&P, Ultraviolet fluorescence, p. 84; Pellicori, Spectral properties, p. 1916 17, 1919). Here Miller and Pellicori refer to the background color of the Shroud, so, the obtained visible color was lighter than that of the Shroud image, but the obtained green fluorescence was stronger than the fluorescence of the image: the image fluorescence is much less and peaks at a slightly longer wavelength than that of the background (Gilbert&Gilbert, Utraviolet visible reflectance and fluorescence spectra, p. 1934). Adler wrote: “The background cloth shows a light greenish yellow emission not typical of other known old linen cloths and perhaps suggesting the presence of some type of thin coating of a fluorophore on the original linen” (Chemical and Physical Aspects, p. 13). Rogers and Schwalbe wrote in 1982: “Miller and Pellicori produced light sources [sic] on modern linen in an atmospheric environment with a hot soldering iron. They found that scorches produced at various temperatures on both dampened and dry cloth all fluoresced yellow green under ultraviolet radiation. Further experiments showed that the fluorescent compounds were quite water soluble, although even after repeated rinsing, the scorched areas retained their fluorescent properties. In addition, they demonstrated the stability of the fluorescent compounds by baking the samples at 145ºC for six hours. Pellicori recalls that the Shroud image itself does not fluoresce measurably. In view of the results of these scorch studies, he feels that it is unlikely that the image was produced by scorching, for otherwise there should have been some characteristic fluorescent behavior observed. These results draw the “air” scorch hypothesis into serious question; however, it was chosen to leave the matter as an open question for now. Before the non fluorescent property of the image is taken as conclusive evidence against scorch hypotheses generally, the conditions and reactions that are involved in the formation of these compounds must be better understood. Future studies should include many of Miller and Pellicori’s original experiments on actual Shroud threads” (Physics and Chemistry, p. 27). FURFURAL In 2004 Rogers’ book revealed that furfural was found in Shroud scorches but not in image areas. “A positive Seliwanoff’s test for pentoses or furfural was obtained from scorched fibers of the main Shroud, while non scorched non image fibers gave a negative Seliwanoff’s test” (Rogers, A Chemist’s Perspective, p.40). STURP’s sample mappings show that no tape samples were taken from the green donuts, three from light scorches, perhaps partly from their green margins, one from a light or dark scorch, and one from a dark scorch. Rogers: “If the image had been formed by a scorching type, high temperature reaction, some pyrolysis products of linen, including furfural, might still be present. The detection of pyrolysis products would have been fairly conclusive evidence for an image formation mechanism; however, the absence of such products would prove nothing. I got no test with Bial’s reagent, so I also tried Seliwanoff’s test for furfural. […] I could not prove the presence of furfural on image areas; however, it was worth the effort to try” (Ibid. P. 39 40). Rogers said furfural polymerises over time: “I also tried Seliwanoff’s test for furfural. It gives a nice, bright red color with furfural, but it gave no test with fibers from a light Shroud scorch. Furfural polymerises over time to form a dense, dark polymer that does not give the test. Polymerization is faster when the reaction is catalyzed with some common impurities, and it can be slowed with inhibitors. I could not prove the presence of furfural on image areas” (Ibid. P. 39 40). As he also said “A positive Seliwanoff’s test […] was obtained from scorched fibers of the main Shroud” (p. 40), an explanation Rogers deems possible for the absence of chemically detectable furfural in image areas is complete polymerisation there, as in one unspecified light scorch, but not in all scorch areas. The question it raises is whether polymerised furfural fluoresces, and if so, which color. This liquid furfural absorption spectrum peaks at 92 nm, and this furfural solution absorption spectrum peaks at 270 nm. For comparison, this (liquid) vanillin absorption spectrum peaks at 230 nm and from 280 320 nm, but this fluorescence emission spectrum of a vanillin solution under 360 nm UV excitation peaks at 425 nm (violet): “Fig. 3: […] The excitation wavelength was 360 nm. […] For comparison, the fluorescence emission spectra of 200 μM vanillin (spectrum d), 8 μM free enzyme (spectrum e), and […] are shown in B” (subscript of Fig. 3). Likewise, because a substance cannot emit a shorter wavelength than it absorbs, a furfural solution under 360 nm excitation would also have to fluoresce at longer wavelengths than 360 nm or equal to it. Such a spectrum would be comparable to the UV/Vis spectra of the Shroud made under 366 nm excitation, and to the photos taken under 335 375 nm excitation (Pellicori, Spectral properties, p. 1919). Then, furfural’s being embedded in scorched linen, and polymerisation of furfural, would change the molecular orbitals and their energy levels, so it would change the absorption and fluorescence wavelengths too. I suppose this change is toward longer wavelengths, as for example this absorption spectrum of a furfural and potassium biphthalate polymer (Fig. 12 c) shows it peaks at a longer wavelength than the spectrum of simple furfural (Fig. 12 a). This furfural naphthol resin (fig. 4) emits a 680 nm red fluorescence under an “assigned excitation” of 680 nm (table 1). And these “carbon dots” of polymerised and aromatised furfural compounds – a “furan resin” (p. 2) – strongly fluoresce blue under 405 nm violet excitation and green under 488 nm blue excitation (photos p. 11 12). Mere furan, the fluorescing ring in all these substances, absorbs from 200 230 nm when liquid. So, furfural in linen, also polymerised furfural, does fluoresce and might fluoresce green or perhaps even red (as I see it now, but I’m not a chemist). As there are red fluorescing scorches (with green yellow margins) in the image area (Adler, Chemical and Physical aspects, Fig. 2), only a fluorescence quencher that was applied after image formation and removed by the 1532 AD scorches might explain the absent/weaker fluorescence of the image, but this seems improbable (but again, I’m not a chemist). When trying to prove that the Raes/radiocarbon sample was from a repair in the main Shroud, Rogers wrote that the anearobic pyrolysis mass spectrometry data of five different image areas showed no early furfural release (it appeared only when hydroxymethylfurfural appeared, or near to that, “For example, figure VIII 3 shows a mass spectrum that was taken when the first decomposition products started to appear over a sample of image fibers.” Rogers, A Chemist’s p. 54; Fig. VIII 3 is Fig. 1 in Pyrolysis/Mass Spectrometry; furfural is at m/e 96, HMF at 126), whereas the (lightly scorched) Raes sample did show early furfural release without HMF: “furfural appears relatively early, and it disappears quickly” (Rogers, A Chemist’s, p. 57, and Fig. VIII 4 which is Fig. 2 in the online PMS article). That the Raes corner is lightly scorched is shown by 1. Its fluorescence (Antonacci, 2005, p. 5 6: “After studying ultraviolet fluorescent photographs taken of the Shroud, STURP’s chief photographer Vernon Miller and Alan Adler confirmed over 15 years ago that the radiocarbon site was in the midst of a scorch mark and at the edge of a water stain.”) 2. The FTIR data of the radiocarbon sample having scorch characteristics (Adler, Selzer and De Blase, Further Spectroscopic, p. 98) 3. Its positive Bial’s reagent test for furfural/pentoses (Rogers, A Chemist’s, p. 39) 4. Its starch gum coating – not gum Arabic for lack of proteins (Rogers, Scientific Method, p.17 20 – Adler, p. 4). The Raes thread’s early release of furfural without HMF could be explained by it having been scorched at a temperature above the pyrolysis threshold of hemicellulose (which produces furfural from xylose) but below the pyrolysis threshold of cellulose (which produces HMF from glucose), i.e. Below ca. 315ºC, as you suggested in this blogpost (see also these TGA pyrolysis curves of hemicellulose, cellulose, and lignin; btw “lignin was more difficult to decompose, as its weight loss happened in a wide temperature range (from 160 to 900 °C) and the generated solid residue was very high (∼40 wt.%)” Fuel article). Note that not even one irrefutable scorch sample from the main Shroud was tested with PMS: the tested 6 BF sample is classified as “light scorch” by Rogers (PMS article, p.2), but is called “Blood Flow (Approx. Test Point)” by the STURP sample list, and “Blood image, front, lance area” by Heller&Adler, who called sample 6 AF, taken a bit closer to the scorch than 6 BF, “Blood scorch image margin” (A Chemical Investigation, p. 49). Assuming that Rogers managed to find a lightly scorched fiber on sample 6 BF – distinguishable by a scorched medulla (Scientific Method, p. 8 9) –, it would have showed the simultaneous furfural and HMF release (or perhaps even later furfural release if polymerised) of a linen fiber scorched above 315ºC (all its hemicellulose plus overabundant cellulose being scorched), for in his comparison of all tested samples, including the one from the “Edgerton modern” linen, which was lightly scorched by ironing, and then bleached again (Rogers on Maillard reaction, p.3), Rogers doesn’t talk about temperatures anymore, but only says that among all “product ratios” (furfural/HMF) the Raes sample “was unique” (PMS article, p. 6). In fact, Rogers doesn’t give any absolute temperature. Anyway, for testing the scorch hypothesis the question is: could a very high degree of furfural polimerisation in image fibers have retarded its furfural release to near that of HMF from unscorched cellulose? For the above mentioned furfural polymer (“a furfural and potassium biphthalate based resin”) “The highest temperature at which the polymer melting process occurred was found to be 202.01 °C, which far exceeds the boiling point of pure furfural (161.7 °C)” (par. 3.1.7.). So, it seems the answer is: yes, it might perhaps have retarded the furfural release that far. But then, the furfural polymer would probably still be fluorescent… RECAPITULATING 1) Anaerobic model (red fluorescence): (red) Shroud scorches with the same visible color as the image fluoresce red, even in the image area, while the image doesn’t fluoresce noticably. So, sensitising the cloth is no option in the anaerobic model. An ‘image only’ fluorescence quencher to explain the difference seems improbable. Assuming it’s not there, the scorch image would have to have lost its fluorescence, by oxidation or evaporation, in 200 or more years after having kept some or all of it in 500 years. Anaerobic Shroud scorches fluoresce red + anaerobic PMS of linen produces furfural and hydroxymethylfurfural + furfural is fluorescent (and HMF probably too because of its furan ring) => furfural and/or HMF in scorched linen probably fluoresces red. The image doesn’t contain free furfural or HMF, while some light Shroud scorches do contain furfural. So, the image would have to have lost its free furfural. Rogers says furfural would rather polimerise than disappear by oxidation or evaporation, but polimerised furfural probably fluoresces. 2) Aerobic model (green fluorescence): the Shroud image fluoresces much less and a slightly warmer color than the ‘greenish’ background. On pure non fluorescing modern linen the Shroud’s visible image color cannot be reproduced immediately without producing green yellow fluorescence (Hugh 1). This fluorescence even appears at lower temperatures than a visible scorch color (Hugh 2). The green scorch fluorescence doesn’t disappear with aging (air baking/500 years). As air baking/scorching produces green fluorescence ánd simulates aging, aging would rather intensify green scorch/age fluorescence. So, a scorch image should never have had green fluorescence (or at least scorching should have produced less than it took away). Pure linen becomes green fluorescent by air baking above ca. 125ºC (M&P and Hugh 3). To produce a Shroud like image color without (too much) green fluorescence one might use a sensitiser, as possibly present on the Shroud, and scorch below a certain temperature, perhaps below ca. 125ºC. But, as air scorching and aging are basically the same process, in the centuries of aging the scorch would always be ahead of the background in this process, and have more green fluorescence than the background, until some kind of saturation takes place. Only a relatively strong cool fluorescent coating would allow a scorch to take away this fluorescence and have a permanently weaker and warmer fluorescence than the background. Am I mistaken somewhere…? An alternative for a low temperature contact scorch is a (low temperature) electrostatic discharge (aka corona discharge or St. Elmo’s fire). Its image is dark/light inverted, 3 D encoded, and superficial, as the Shroud image link1, link2, link3, link4, link5). The fourth article concludes: “From the IR results, we can say that C O C and C O bonds are produced when CD is present and C H bonds disappear. We propose that a kind of slow combustion process occurs during CD that forms the image on linen” (p. 2589). It is said that a new CD image, that still has to become visible by aging/air baking, has a “lack of fluorescence” compared to the blue fluorescing background of “new, but not bleached linen”, i.e. “manufactured as the old linens were” (link2, p. 17; link1, p. 12; cf. Link1, p. 9 fifth , and p. 19 at 1), but its image fluorescence does look green yellow (see link1, Fig. 15). It seems that a very light aerobic contact scorch and a CD are mutually not all that different in terms of fluorescence. After an initial inversion from the relatively strong blue linen background fluorescence to the weaker green yellow fluoresence of the ‘undeveloped’ CD image, the developed visible image would later, after air baking or aging, probably have a stronger green fluorescence than the background. In that case, also a CD would need a cool greenish fluorescent coating to explain the weaker and warmer fluorescence of the image when compared to the background after centuries of aging. POLISHED STARCH MADDER COATING A coating of retrograded starch including a dilute acidic Madder dye (as batch uniforming color and optical brightner) might keep most of its fugitive fluorophores alizarin and purpurin, if it was glazed by firmly rubbing it with a glass ball or slickstone, such as this Viking type linen smoother or the Dutch smoothing balls from the 8th and 9th centuries (“bollen uit de 8e en 9e eeuw”), to render it more dense and sealing, and thus dirt repellant and lustrous. Number B14 of the Shroud evidence list says “The TS linen has a lustrous finish (Rogers, 1978 1981).” This is another corroboration for the Shroud being a robe as Herod’s ‘estheta lampran’ (Luke 23,11 WH), literaly “shining robe” (Bible in Basic English), “brilliant robe” (HCSB), “glistening clothing” (LEB), also translated as “white cloak” (WYC) and “kingly robe” (NCV) (Bible Gateway). The sealing starch finish would also have retarded the aging of the very tightly woven linen Shroud (evidence B5). Saponaria Officinalis, also called struthium, was not detected on the Shroud: “I could not prove that the cloth had been washed in S. Officinalis. Only the fluorescence evidence remains to suggest the use of struthium” (Rogers, A Chemist’s, p. 40), but Madder was chemically detected on the Raes sample (which isn’t a repair) inside the coating and as lake particles, and microscopically recognized as lake particles on the main Shroud (Internal selvedge in starched and dyed temple mantle, par. 2.3 and 2.4 (updated))..","date":"2012-11-13","mins":"10:58 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/23/thibaults-principle-true-for-a-stepped-template-maybe-but-not-an-artistic-bas-relief-with-rounded-contours-and-gentler-relief/","cat":"medieval_forgery","title":"Thibault’s Principle: true for a stepped template, maybe – but not an artistic bas relief with rounded contours and gentler relief"},{"id":"comment-1173","author":"adrie","post":"Hello Colin, Just now I tried to post a very long comment, twice, but they didn’t appear. If you’ve received them, could you only post the second one? Thanks..","date":"2012-11-13","mins":"11:17 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/23/thibaults-principle-true-for-a-stepped-template-maybe-but-not-an-artistic-bas-relief-with-rounded-contours-and-gentler-relief/","cat":"medieval_forgery","title":"Thibault’s Principle: true for a stepped template, maybe – but not an artistic bas relief with rounded contours and gentler relief"},{"id":"comment-1004","author":"adrie","post":"Hi Hugh. Miller&Pellicori’s paper only said “laboratory produced scorches” emit reddish fluorescense “if produced under conditions of limited available oxygen.” From Heller’s book we learn: “Vern Miller’s experiment at the acadamy with burning linen in a limited oxygen atmosphere had produced a furfural type material, which fluoresced in the ultraviolet. This jibed with the ultraviolet reflectance spectra [sic] of the Shroud itself.” (J.H. Heller, Report on the Shroud of Turin, p.175). It doesn’t say how he produced the scorches, or whether the “furfural type material” in them was experimentally determined..","date":"2012-10-25","mins":"9:36 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/23/thibaults-principle-true-for-a-stepped-template-maybe-but-not-an-artistic-bas-relief-with-rounded-contours-and-gentler-relief/","cat":"medieval_forgery","title":"Thibault’s Principle: true for a stepped template, maybe – but not an artistic bas relief with rounded contours and gentler relief"},{"id":"comment-993","author":"adrie","post":"Re: Hugh 4) (I guess you mean the reddish fluorescence of most Shroud scorches). STURP members Miller and Pellicori wrote: “Laboratory produced scorches emit a bright greenish yellow fluorescence if they were produced in air and reddish if produced under conditions of limited available oxygen. The scorches associated with the fire of 1532, during which the Shroud was involved, attest to the rapid consumption of the available oxygen. Their reddish emission is probably due to furfurals, which can be produced under such conditions. Linen lightly scorched by a soldering iron in air shows the green yellow emission, often distributed in plumes of deposited pyrolysis products. We demonstrated in one experiment that the material of the plumes could be transported by water, but the underlying scorched cellulose retained a bright yellow green fluorescence.” (Miller, V.D., and S.F. Pellicori, Ultraviolet Fluorescence Photography of the Shroud of Turin, Journal of Biological Photography, Vol. 49, No. 3, July 1981, pp. 71 85, p. 84) It seems the Shroud also has some green fluorescing scorches: “At E and B and at patches 11 and 12, red fluorescing scorched areas are obvious. The brightly fluorescing yellow green donut shaped areas to the right of patch 11 12 at E and B appear to be scorches. They are mirrored elsewhere at symmetrically located fold sections.” (Ibid., p. 80) It still is confusing why you didn’t reproduce the reddish fluorescence. Perhaps because there was too much water around, that could not escape from the tinfoil and that was driving out the air in the testtube?? Just guessing….","date":"2012-10-24","mins":"1:02 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/23/thibaults-principle-true-for-a-stepped-template-maybe-but-not-an-artistic-bas-relief-with-rounded-contours-and-gentler-relief/","cat":"medieval_forgery","title":"Thibault’s Principle: true for a stepped template, maybe – but not an artistic bas relief with rounded contours and gentler relief"},{"id":"comment-1019","author":"adrie","post":"Hi Matthias and all. The green fluorescing donut shaped burnmarks, located at 11 12, that is in the middle of the cloth on both sides of the two longitudinal scorched folds (see http://www.shroud.com/maptap2d.htm ), were indeed from the 1532 fire. Guerreschi and Salcito determined that they were in the bottom layers of the folded cloth when it lay in the reliquary (http://www.shroud.com/pdfs/aldo4.pdf ). They reproduced the entire scorch pattern with one single scorch motion on a Shroud wise folded cloth, and their lightest scorches appeared where the green fluorescing ones are on the Shroud (p. 1 3 with figures). The difference in color of the ‘red’ and ‘green’ scorches seems to be the result of a different combination of oxygen, water, contact time, pressure and temperature. Guerreschi and Salcito wrote “We also observed that, due to the weight of the object, the pyrolysis tended to diminish in the part directly in contact, continuing in the free terminal part due to the supply of new oxygen, leading to the enlargement and therefore the triangular shape of the burns.” (p.3).","date":"2012-10-27","mins":"10:27 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/23/thibaults-principle-true-for-a-stepped-template-maybe-but-not-an-artistic-bas-relief-with-rounded-contours-and-gentler-relief/","cat":"medieval_forgery","title":"Thibault’s Principle: true for a stepped template, maybe – but not an artistic bas relief with rounded contours and gentler relief"},{"id":"comment-1003","author":"adrie","post":"Hi Hugh and Colin. Re 3: Miller&Pellicori reported non fluorescing scorches (or stains resembling scorches): “There is a series of holes through the Shroud cloth (through which the reinforcing backing cloth sewn to the Shroud after the fire can be seen). The densely burned borders of these burned holes show no emission. Where the more lightly scorched material matches the appearance of other scorched areas (around patches, for example), the fluorescent appearance is quite different, that is, no emission is seen. The different appearances might relate to different generation mechanisms. […] around the patches, the scorches display shading in red emission. These scorches appear different from the burn holes.”(Ultraviolet fluorescence photography of the Shroud of Turin, p.77, fig 5 dorsal area B E, 4 6). I don’t know whether they mean the so called ‘poker holes’ or the tiny holes visible in the middle of the buttocks area. In the next area: “Two small circular stains at C 7 and D 7 are mirror images and visually resemble weak scorches. In fluorescence these stains are absorbing.”(p.79, fig 6 dorsal midsection area B E, 7 9) In still another area: “Scorches show red fluorescence except for those associated with the sets of three holes which have heavily burned borders. Plumes of pyrolyzed materials pointing toward the feet are seen associated with the burned holes. At 19 the plume pointing toward the hands fluoresces red. Some shading from red to yellow fluorescence can be seen.”(p.82, fig. 9, ventral hands and thighs B E, 16 19). Here the three ‘poker holes’ are definitely meant. For locations see: http://www.shroud.com/maptap2d.htm and http://www.shroud.com/maptap2v.htm (lowest row is A, highest row is F). The explanation for the ‘poker holes’ is not definitive. Legrand thought about incence causing them, Flury Lemberg about concentrated acid (http://www.shroud.com/pdfs/aldo4.pdf p. 9). The acid idea has been contested, says Barta (http://www.shroud.com/pdfs/n56part6.pdf p.1) (I read this contestation once, somewhere, but didn’t bookmark it). Rogers said the borders looked like pitch, but did no chemical analysis; “his term “pitch” was intended to apply to pine sap or something of a balsamic origin” (http://www.shroud.com/restored.htm ). “The hypothesis that these holes were burned through with a hot poker is probably incorrrect. Close inspection of the peripheral areas reveals a foreign material there, resembling pitch. The radiographs also show high density structures that supports this observation. This earlier damage may have resulted from burning pitch that perhaps fell onto the Shroud from a torch.” Schwalbe, L. A., and R. N. Rogers, Physics and Chemistry of the Shroud of Turin, a Summary of the 1978 Investigations, Analytica Chimica Acta 135 (1982), pp.3 49, p. 47, note 7..","date":"2012-10-25","mins":"9:29 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/23/thibaults-principle-true-for-a-stepped-template-maybe-but-not-an-artistic-bas-relief-with-rounded-contours-and-gentler-relief/","cat":"medieval_forgery","title":"Thibault’s Principle: true for a stepped template, maybe – but not an artistic bas relief with rounded contours and gentler relief"},{"id":"comment-1023","author":"adrie","post":"Note: the cited “At 19 the plume pointing toward the hands fluoresces red. Some shading from red to yellow fluorescence can be seen.”(M&P, p.82, fig. 9, ventral hands and thighs B E, 16 19) does not refer to the ‘poker holes’ at the height of the hands (= at 16 17), but to the fold scorched in1532 at the heigth of the thighs (= at 19) (see http://www.shroud.com/maptap2v.htm )..","date":"2012-10-27","mins":"2:24 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/23/thibaults-principle-true-for-a-stepped-template-maybe-but-not-an-artistic-bas-relief-with-rounded-contours-and-gentler-relief/","cat":"medieval_forgery","title":"Thibault’s Principle: true for a stepped template, maybe – but not an artistic bas relief with rounded contours and gentler relief"},{"id":"comment-1224","author":"adrie","post":"No, it’s not urgent. It can easily wait a couple of days. Have a nice trip! (ed: here is the comment that Adrie sent that was apparently rejected by Word Press software on account of its length. I’m copying and pasting it from his her email that I have finally been able to open, now I’m back on my own laptop): “It seems to me that furfural in scorched linen isn’t comparable to a fluid that evaporates. In newly scorched linen furfural is ‘in solution’ in its surrounding other pyrolysis products and other non pyrolysis products (all organic substances), and there, its very reactive aldehyde group would sooner or later polymerise with them. I found a number of quotes about furfural evaporation, showing that it is most prominent when furfural is in water or is a pure fluid on/in moist soil, and less prominent and even uncertain when it is a fluid on/in dry soil (which would contain little organic material): “With the water vapor can be volatile, benzene aldehyde odor” (Chinese entry); “Furfural is produced from annually renewable agricultural sources /containing pentosans[…] In all processes, raw material is charged to the digestor and treated with strong inorganic acid. High pressure steam is introduced through the mass and, after attaining operating temperature and pressure, furfural is steam distilled”; “If released to soil, furfural is expected to have very high mobility based upon an estimated Koc of 40. Volatilization from moist soil surfaces is expected to be an important fate process based upon an estimated Henry’s Law constant of 3.8 X10 6 atm cu m/mole. Furfural may volatilize from dry soil surfaces based upon its vapor pressure”, “Volatilization from water surfaces is expected to be an important fate process based upon this compound’s estimated Henry’s Law constant” (Pub Chem, Methods of Manufacturing; Environmental Fate and Exposure Potential). So, in dry scorched linen, containing only carbohydrates and other organic material, furfural would evaporate (at best) slowly and have the chance to polymerise immediately. Furfural “Forms condensation products with many types of cmpd, phenol, amines, urea, etc” (Ibid., Chemical and Physical Properties; condensation is polymerisation by losing a small molecule). As regards the speed of polymerisation: Rogers said that after a “burn test” on modern linen “Condensed cellulose pyrolysis products form an intensely fluorescent ring around the center of heating” (Scientific Method, p. 3 4, caption fig. 2). He meant ‘cellulose’ that had been pyrolysed and then had chemically condensed. In the text he speaks about “the chemically reducing and reactive pyrolysis products (formaldehyde, furfural, organic acids, CO, etc.)” (p. 4). Here Rogers’ use of “cellulose” and “furfural” should include hemicellulose and hydroxymethylfurfural. (Besides, it seems to me the fluorescent ring was scorched aerobic.) Anyway, Rogers here says polymerisation/condensation of furfural takes place very soon after scorching (not only after decades of evaporation), and that such a polymerisation doesn’t inhibit fluorescence. Also, furfural’s chemical structure shows that furfural after polimerisation by bonding at its aldehyde group would still fluoresce. The aldehydegroup of furfural is its only difference with furan, which has just a single hydrogen atom instead of the aldehyde group. The ring of furfural is equal to the ring of furan, and this ring has only two double bonds. So, as furan fluoresces, a furfural polymer, having changed or lost its complete aldehyde group but still having this same furan ring, would also fluoresce. At least some furfural polymers, bonded by furfural’s aldehyde group, fluoresce measurably, such as the furfural biphthalate resin: its chemical structure shows a resin of furfural bound by its aldehyde group (Scheme 2). Its fluorescence is a bit weaker than that of pure furfural, but still much stronger than the hardly fluorescent biphthalate (Fig. 12). Also in the furfural naphthol resin the aldehyde group of furfural has bonded to naphthol (Scheme 3), and then there was condensation of the naphthol furfural molecules at the oxygen atom of the (former) aldehyde group, so, also here the furan ring has been preserved (Scheme 5). This “condensed furfurylol Naphthol pigment” fluoresces and, as its relative intensity is stronger than that of mere naphthol (Fig. 4), the furan ring still contributes to the fluorescence of the polymer. RED FLUORESCENCE So, from the above, it seems that furfural in scorched linen polymerises before evaporating, and it is certain that polymerised furfural still fluoresces. But, in order to not only search where the light is, let’s assume there are more fluorophores in anaerobic scorched linen than only the furan type. The question then is, whether the furan type causes the red fluorescence of the anaerobic scorches. Furfural is produced in an anaerobic (= red) scorch/pyrolysis (PMS article, p. 2) and was detected in Shroud scorches, probably red (= anaerobic) ones (Seliwanoff’s test, A Chemist’s, p. 40). Pellicori, Rogers, and Soran, implicitly said furfural fluoresces red: “The fluorescence in the scorched areas is apparently due to the furfural pyrolysis products. (R.N. Rogers and D. Soran, Los Alamos Scientific Laboratories; personal communication” (Spectral properties, 1980, p.1919). Miller and Pellicori wrote “The scorches associated with the fire of 1532, during which the Shroud was involved, attest to rapid consumption of the available oxygen. Their reddish emission is probably due to furfurals, which can be produced under such conditions”, and also wrote “The visually dark brown burns fluoresce brownish red. The color reddens as the scorch density decreases. Comparable to pyrolysis products, produced under limited oxygen combustion, such as furfurals” (Ultraviolet fluorescence, 1981, p. 84, 75). The chemist Heller finally did declare that Miller’s experiment “with burning linen in a limited oxygen atmosphere had produced a furfural type material, which fluoresced in the ultraviolet. This jibed with the ultraviolet reflectance spectra of the Shroud of Turin” (Report on, 1983, p. 175). So, according to Pellicori, Rogers, Soran, Miller, and Heller a furfural/furan type material in anaerobically scorched linen fluoresces red or comparable to red. If furfural doesn’t cause the red fluorescence of the Shroud scorches, there would have to be a stronger red fluorescence of another unknown fluorophore produced by anaerobic pyrolysis of linen. In order to produce “highly fluorescent carbon dots” from “hydrothermally treated” orange juice the fluorescent products (“Furfural like compounds, aldehydes, ketones”) were separated from the non or less fluorescent products (“Acetic acid, Lactic, Propenoic, Levunilic and formic acid”) (p. 1 2, Fig. P. 2): “The aqueous solution was centrifuged at 3000 rpm for 15 min to separate the less fluorescent deposit” (p. 1). When discussing the PMS of linen, Rogers said “The major products of the thermal decomposition of cellulose and other carbohydrates in the absence of oxygen are formaldehyde, carbon monoxide, furfural (2 furaldehyde), hydroxymethylfurfural (5 hydroxymethyl 2 furaldehyde), levulinic acid (4 oxopentanoic acid), and 3 pentenoic  anhydride” (PMS article, p. 2). Except the furfural types, non of these have rings, let alone aromatic rings (except perhaps the 3 pentenoic  anhydride, which chemical structure I haven’t found, but which is probably similar to pentanoic anhydride, which is not a ring). So, these other products probably wouldn’t be (strongly) fluorescent. Levulinic acid was indeed separated as less fluorescent than furfural in the carbon dots production. Either formaldehyde (“formaline solution 37%”) or a “Formaldehyde pigment” fluoresces or both do (note the inconsistencies between table 1 and fig. 4), but if formaldehyde fluoresces it apparently doesn’t fluoresce enough to be detectable by its fluorescence without this “fluorogenic dye”. Besides, formaldehyde, having only one double bond, would fluoresce less than formic acid, which has two double bonds and fluoresces less than furfural (see carbon dots production). The five carbon plus one oxygen rings from pyrolysed xylan/hemicellulose, that you showed, only have one double bond, and thus probably don’t fluoresce stronger than furfural either. So, it seems to me that it is very likely that the red fluorescence of the anaerobic Shroud scorches is caused by their detected furfural type fluorophore. SCHEMATIC SUMMARY An anaerobic scorch produces a) red fluorescence and b) furfural that c) fluoresces red. The red fluorescence (a) and the furfural (b) don’t disappear in 500 years, and furfural will always fluoresce, also when polymerised (c), and most probably causes the red fluorescence of the Shroud’s anaerobic scorches. The image has neither red fluorescence (a) nor detectable furfural (b) nor polymerised furfural for lack of red fluorescence (c). The image has a reflectance of the same visible color and intensity as anaerobic scorches, and in some areas is replaced by them, so, 1) a sensitizer – which lowers the temperature at which the chromophore can be produced – would have affected image and scorch equally and thus, by itself, can’t explain the different fluorescence and furfural content 2) an ‘image only’ fluorescence quencher – i.e. That can be removed by scorching –, even if it existed and had been applied, wouldn’t explain the different furfural content 3) if the chromophore can be produced anaerobically (perhaps even latently) at a lower temperature than that at which the fluorophore furfural is produced, a lower anaerobic pyrolyis temperature and longer pyrolysis time for the image might produce the image’s different (less red) fluorescence and (lower) furfural content in combination with a visible color and intensity equal to that of the red scorches. But even then, to be consistent with the Shroud, both the image scorches and the red 1532 AD scorches should also have a much weaker and slightly warmer fluorescence and darker visible color than the background after centuries of aging. REMAINING QUESTIONS Still complex. I wish I knew what is the green yellow aging fluorophore and how its production depends on temperature/time. And it would be great to know if anaerobic scorching takes away (some of) the light blue fluorescence of lignin, and also to know the temperature/time dependency of this process, and also that of the loss of blue fluorescence in aerobic scorching. On the other hand, PMS did not detect lignin in Shroud samples (not only single fibers from the main Shroud but also “Raes fibers” = “ample material from the Raes sample”, and from the main Shroud’s ‘Zina thread’, see A Chemist’s, p. 57, PMS article p. 2, and Studies on, p. 192). But the same PMS did detect lignin in modern primitive linen: “Mass spectrometry […] There is a significant difference between the Shroud and the modern primitive samples. The latter were found to contain lignin” (Physics and Chemistry, p. 14). Also microchemical spot tests for vanillin (present in and slowly disappearing from fresh lignin (Scientific Method, p. 16), did not detect vanillin in Shroud samples (“No samples from any location on the shroud gave the vanillin test”, Studies on, p. 191), but “The Holland cloth and other medieval linens gave a clear test” (Ibid. P. 190). Nevertheless, the peak at ca. 435 nm of the fluorescence spectra of lignin solutions probably under 337 nm excitation (p. 10, and p. 3, Fig. 1; “337 nm was used as an excitation source for the experimental data shown in FIGS. 2 and 3”) coincides with the peak at ca. 435 nm of the fluorescence spectra of all Shroud samples, especially those of the background: “Figure VIII 2: Spectral fluorescence of four clear areas of the Shroud with excitation at 365 nanometers. Maximum fluorescence is at about 435 nanometers” (A Chemist’s Perspective, p. 51) ; “When the photoelectric data are convolved with the scotopic response curve and normalized (Fig. 9), it becomes obvious that the background linen itself is responsible for the measured response on the blood and image areas, since there is an identical wavelength characteristic” (Spectral properties, p. 1919). Absence of lignin and of its fluorescence would lead us back to (the necessity of) a fluorescent coating on the Shroud (cf. Comment Nov. 13). The absorption spectrum of alizarin – the main colorant of Madder – also has a peak at ca. 435 nm, and “For many fluorophores the absorption spectrum is a mirror image of the emission spectrum. This is known as the mirror image rule.”.","date":"2012-11-20","mins":"6:40 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/23/thibaults-principle-true-for-a-stepped-template-maybe-but-not-an-artistic-bas-relief-with-rounded-contours-and-gentler-relief/","cat":"medieval_forgery","title":"Thibault’s Principle: true for a stepped template, maybe – but not an artistic bas relief with rounded contours and gentler relief"},{"id":"comment-1217","author":"adrie","post":"Hello Colin, Again I tried to post a comment that is too long for posting directly. I’ll send it to you be email. Could you please paste it in this comment? Thanks..","date":"2012-11-20","mins":"10:54 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/23/thibaults-principle-true-for-a-stepped-template-maybe-but-not-an-artistic-bas-relief-with-rounded-contours-and-gentler-relief/","cat":"medieval_forgery","title":"Thibault’s Principle: true for a stepped template, maybe – but not an artistic bas relief with rounded contours and gentler relief"},{"id":"comment-1196","author":"adrie","post":"Good idea to add the comment to your earlier fluorescence post! Thanks for that. And yes, I see what you both mean about the ‘big picture’. I’ll think about how to clarify things and make it ‘punchier’ (better not make it longer, I guess)..","date":"2012-11-14","mins":"12:01 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/23/thibaults-principle-true-for-a-stepped-template-maybe-but-not-an-artistic-bas-relief-with-rounded-contours-and-gentler-relief/","cat":"medieval_forgery","title":"Thibault’s Principle: true for a stepped template, maybe – but not an artistic bas relief with rounded contours and gentler relief"}]
