[{"id":"comment-38073","author":"sheona","post":"No one is spitting on you, you silly little man. You can call yourself Winnie the Pooh (Winnie l’Ourson) for all I care but should not expect people to take you seriously. The title of teacher to which you cling so desperately was no longer applicable after 1978. As you say, at that time you had your whole life ahead of you. What happened? No publications, no qualifications you admit to, no Palmes Académiques after a successful career. Just a self taught archeocryptomedievalpsychphysiotherapist, with metal detector. BTW, don’t tell me about my French since I know precisely how good it is. I’ve got a degree, you see..","date":"2013-06-25","mins":"5:32 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","title":"Colin Berry:  a hunch – just that – that Rogers may have been used"},{"id":"comment-37985","author":"sheona","post":"Le pauvre peit vieux qui n’a pas de diplômes dont il veut nous parler ,mais qui prétend avoir droit au titre de “professor” après deux ans passés à participer “à la création du Centre for European Languages and Translation – CELT … et à la création de la section française de la bibliothèque de la Faculté des Lettres de Ryad” ou plutôt à l’Ecole Normale là bas, entre 1976 et 1978. Mais ce n’est pas croyable. Et depuis qu’est ce qui s’est passé? Des diplômes, des thèses doctorales, des livres et des articles publiés, des universités qui se bousculent pour lui offrir des emplois comme cela se ferait s’il était vraiment un “professor”? Entre 1978 et 2005 il paraît qu’il y a ce que Goethe appelerait “die grosse Lücke” dans la carrière académique de Monsieur Hamon. Monsieur Hamon, tout le monde a le droit de se nommer comme il veut, mais personne n’a le droit de s’attendre à ce que les autres le croient, faute de preuves. “Mais puisque je le dis …”, cela ne marche pas..","date":"2013-06-24","mins":"5:38 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","title":"Colin Berry:  a hunch – just that – that Rogers may have been used"}]
