[{"id":"comment-210062","author":"sheona","post":"Good grief. What does one have to do to make some folk here see the difference between a contact imprint and a free hand painting? Making an imprint may take skill, but if taken from a real human being, as distinct from bronze bas relief etc, then it is NEVER a work of art. It is what the name implies – simply an imprint with the properties of an imprint (correctly spaced ventral v dorsal surfaces, negative character, 3 D properties etc). It’s the difference between a sand sculpture and a footprint in the sand… It is exceedingly tiresome to have Charles Freeman continuing to drone on about a “painting” when it’s so abundantly obvious – or should be – that the TS is an IMPRINT, and consequently NOT a work of art, at least where the body image is concerned. Blood additions are a different matter. They may well be considered “artistic”..","date":"2015-09-10","mins":"2:33 pm","url":"https://shroudstory.com/2015/09/03/colin-berrys-latest-and-greatest-is-it-enough/","cat":"3d","title":"Colin Berry’s Latest and Greatest. Is it Enough?"},{"id":"comment-10093","author":"sheona","post":"Oh Colin, if you seriously expect any comments, let alone an intelligent or relevant one, from characters like those who turned up at Pasco, you are deluded. They just sat there listening to the same old stuff over again. They can’t cope with anything new or outside their blinkered vision..","date":"2017-10-18","mins":"12:46 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc)."},{"id":"comment-8510","author":"sheona","post":"Sorry to read you are no longer posting. I don’t say much, but I enjoy reading..","date":"2017-02-19","mins":"10:22 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/01/04/testing-my-flour-imprint-hypothesis-might-those-be-solid-gluten-flecks-one-sees-on-the-shroud-scope-body-image/","cat":"medieval_hoax","title":"Might those be flecks of congealed wheat gluten one sees on the Turin Shroud? Evidence for unique one-off white flour imprinting?"}]
