[{"id":"comment-19155","author":"andy_weiss","post":"Ray Rogers’ work in the 2005 Thermochimica Acta paper did provide us with an alternate way to date the Shroud: by the amount of vanillian left. Read the paper and decide for yourself if it is a valid way to date the Shroud – http://shroudnm.com/docs/2004 09 12 Rogers.pdf..","date":"2012-11-17","mins":"1:48 pm","url":"https://shroudstory.com/2012/11/14/berry-no-matter-where-he-or-she-considers-themselves-to-be-on-the-scale-of-infallibility/","cat":"carbon_14_dating","title":"Berry: No matter where he or she considers themselves to be on the scale of infallibility"},{"id":"comment-19091","author":"andy_weiss","post":"The Shroud has already been completely contaminated. This is more of a pipe dream than anything..","date":"2012-11-15","mins":"9:28 pm","url":"https://shroudstory.com/2012/11/14/berry-no-matter-where-he-or-she-considers-themselves-to-be-on-the-scale-of-infallibility/","cat":"carbon_14_dating","title":"Berry: No matter where he or she considers themselves to be on the scale of infallibility"},{"id":"comment-33284","author":"andy_weiss","post":"It s interesting, no doubt. We’ve had it up on http://Shroud NM.com/library.html since the day it came out. I think Joe Nickle really shows his lack of openness & curiosity and his own bias. Perhaps he has an axe to grind? I don’t know him, but it sure does sound like he has his mind made up no matter what the evidence. I don’t know how it is possible to have verifiable evidence from the first century. Is there this kind of evidence for anything for this many centuries other than religions?.","date":"2013-05-08","mins":"7:30 pm","url":"https://shroudstory.com/2013/05/08/best-news-article-on-fantis-methods/","cat":"carbon_14_dating","title":"Best News Article on Fanti’s Methods"},{"id":"comment-19154","author":"andy_weiss","post":"I am not referring to the contamination from the fires (there were at least two in 1531 & 1998). I am referring to the encasement of the Shroud with thymol which, according to Chemist Ray Rogers has completely contaminated the Shroud. Has this chemically not completely contaminated the Shroud? We need a world class chemist and Ray Rogers has unfortunately passed on. Know any world class chemists? Until I hear from one contradicting the veracity, Ray’s chemistry is beyond reproach..","date":"2012-11-17","mins":"1:44 pm","url":"https://shroudstory.com/2012/11/14/berry-no-matter-where-he-or-she-considers-themselves-to-be-on-the-scale-of-infallibility/","cat":"carbon_14_dating","title":"Berry: No matter where he or she considers themselves to be on the scale of infallibility"},{"id":"comment-35666","author":"andy_weiss","post":"Thank you, Maria. I think Fanti’s work sounds interesting. Anything legitimate that forwards Shroud research sounds good to me. Warmest regards, Andy Weiss i SEAM.","date":"2013-06-01","mins":"10:13 pm","url":"https://shroudstory.com/2013/05/08/best-news-article-on-fantis-methods/","cat":"carbon_14_dating","title":"Best News Article on Fanti’s Methods"},{"id":"comment-10951","author":"andy_weiss","post":"With respect to Mr. Antonacci’s critique of Raymond Rogers’ 2005 paper, I do have a couple thoughts. His refutation is visual and Roger’s analysis is chemical. If there was an invisible french reweave, visual analysis would be inadequate to reveal the repair. Roger’s work revealed the presence of cotton, gums, dyes and resin. My question is what is cotton doing in a flax linen Shroud? Further, I wonder in what way a lawyer is qualified to dispute the results of a peer reviewed Chemist?.","date":"2012-04-29","mins":"9:33 am","url":"https://shroudstory.com/2012/04/29/carbon-dating-the-shroud-of-turin-again/","cat":"carbon_14_dating","title":"Carbon Dating the Shroud of Turin Again?"},{"id":"comment-10952","author":"andy_weiss","post":"About another carbon dating, would the 2002 chemical treatment pointed out by Rogers affect the dating? Does anyone know in what way that would affect a carbon dating?.","date":"2012-04-29","mins":"9:36 am","url":"https://shroudstory.com/2012/04/29/carbon-dating-the-shroud-of-turin-again/","cat":"carbon_14_dating","title":"Carbon Dating the Shroud of Turin Again?"},{"id":"comment-11129","author":"andy_weiss","post":"Wow, that looks fabulous. I cannot wait to order a copy. Thanks so much for the blog, Dan..","date":"2012-05-04","mins":"2:17 pm","url":"https://shroudstory.com/2012/03/08/clarification-on-the-much-anticipated-documentary-the-night-of-the-shroud/","cat":"carbon_14_dating","title":"Clarification on the much anticipated documentary, The Night of the Shroud"},{"id":"comment-51538","author":"andy_weiss","post":"Not a bad idea. I kind of doubt it will happen, but not a bad idea. Thanks Colin..","date":"2013-11-15","mins":"8:41 pm","url":"https://shroudstory.com/2013/11/14/colin-berry-is-writing-to-the-vatican/","cat":"carbon_14_dating","title":"Colin Berry is Writing to the Vatican"},{"id":"comment-1242","author":"andy_weiss","post":"Wow, I wasn’t aware you were paying my comments that much attention, Colin. Thank you. If you want to talk about carbon dating, perhaps you ought to ring up Bill Meachem. He has extensive experience and is an expert on this as you surely know. What Ray Rogers did for us, among many things, is give us an alternate dating technique in the absence of vanillian. His testing indicates the Shroud is between 2000 3000 years old. Do you have a derogatory comment to make about this work as well? It just seems like you simply do not like Ray Rogers, his work or the fact that he was a preeminent scientist..","date":"2012-11-22","mins":"3:14 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/11/16/draft-document-discovered-in-the-paper-skip-at-my-local-recycling-centre-ten-killer-arguments-for-opposing-any-re-run-of-the-radiocarbon-dating/","cat":"killer_arguments","title":"Draft document discovered in the paper-skip at my local recycling centre: “Ten killer arguments for opposing any re-run of the radiocarbon dating.”"},{"id":"comment-1255","author":"andy_weiss","post":"Thank you, Colin S. Berry. Very nice of you..","date":"2012-11-24","mins":"6:04 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/11/16/draft-document-discovered-in-the-paper-skip-at-my-local-recycling-centre-ten-killer-arguments-for-opposing-any-re-run-of-the-radiocarbon-dating/","cat":"killer_arguments","title":"Draft document discovered in the paper-skip at my local recycling centre: “Ten killer arguments for opposing any re-run of the radiocarbon dating.”"},{"id":"comment-40784","author":"andy_weiss","post":"By closing his eyes, holding his hands over his ears and repeating loudly “I’m not listening”?.","date":"2013-08-08","mins":"10:44 pm","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","title":"How can any true scientist unconditionally defend the C14 dating?"},{"id":"comment-48837","author":"andy_weiss","post":"Guess the dinosaurs messed up their calendars. They probably didn’t have mobile devices to keep their schedules straight. As for the content… 1. “Jesus’ body would have been washed and prepared according to Jewish burial law. . . This would then, supposedly, preclude blood stains from Jesus’ wounds appearing on the linen shroud,. . .” Yet is one reads the text of the Gospels, one learns there is not near enough time to do the complete Jewish burial ritual. The body was not completely cleaned, but I think the cloth itself shows the body was cleaned somewhat. I would expect from the beatings this man took that the Shroud would be full of blood without an image at all. 2. “the Shroud of Turin is a single rectangular piece of linen, which the video author(s) argue, would not have been the case.”. . . I didn’t watch the video, yet according to Dr. Petrus Soons and others, burial cloths have been made this way for several thousands of years. Who are they? 3. “the Bible makes no mention of an image appearing on Jesus’ shroud,. . . No such image therefore exists.” An argument from silence is no argument at all. This is just a failure to reason correctly. 4. “that God would not allow a graven image to be made of himself.” The concept of graven images does not include every image. One can easily find a myriad of images commanded by God to be made. This iconoclasm was addressed and resolved by the Church over a millennium ago. I recommend some study of the history of images..","date":"2013-10-26","mins":"8:39 pm","url":"https://shroudstory.com/2013/10/24/meanwhile-part-1/","cat":"carbon_14_dating","title":"Meanwhile, Part 1"},{"id":"comment-48839","author":"andy_weiss","post":"I wouldn’t give a Gnostic text the same credibility as the Ritual text from a valid Rite or from the Pope. Aside from that, this is an interesting textual history. I would image one affected the other or perhaps one we don’t have affected all of them, perhaps?.","date":"2013-10-26","mins":"8:46 pm","url":"https://shroudstory.com/2013/10/24/meanwhile-part-2-works-for-me/","cat":"carbon_14_dating","title":"Meanwhile, Part 2:  “Works for Me”"},{"id":"comment-48840","author":"andy_weiss","post":"Not “would”, wonder..","date":"2013-10-26","mins":"8:47 pm","url":"https://shroudstory.com/2013/10/24/meanwhile-part-2-works-for-me/","cat":"carbon_14_dating","title":"Meanwhile, Part 2:  “Works for Me”"},{"id":"comment-48841","author":"andy_weiss","post":"Let’s type it over since I cannot edit, “I wonder if one textual reference affected the other or perhaps one we don’t have affected all of them, perhaps?,” (wow that original typing was really bad, apologies)..","date":"2013-10-26","mins":"8:49 pm","url":"https://shroudstory.com/2013/10/24/meanwhile-part-2-works-for-me/","cat":"carbon_14_dating","title":"Meanwhile, Part 2:  “Works for Me”"},{"id":"comment-22409","author":"andy_weiss","post":"With some verbal acrobatics, we could charge this event with the Shroud fake (as some might purport). :o) jk.","date":"2013-01-22","mins":"9:06 pm","url":"https://shroudstory.com/2013/01/22/not-that-this-has-anything-to-do-with-the-c14-dating-of-the-shroud/","cat":"carbon_14_dating","title":"Not that this has anything to do with the C14 dating of the shroud"},{"id":"comment-50453","author":"andy_weiss","post":"Since no measurements were made, attempting to carbon date the Shroud once again cannot really be relied upon to date it. That is the point of Rogers’ work and of Barrie’s caution. To carbon date it might be of interest, but really cannot accurately predict the age since this chemical was administered with no measurements..","date":"2013-11-08","mins":"2:00 pm","url":"https://shroudstory.com/2013/11/05/overheard-behind-us-during-barries-talk-thats-only-listerine/","cat":"carbon_14_dating","title":"Overheard behind us during Barrie’s Talk: “That’s only Listerine”"},{"id":"comment-33817","author":"andy_weiss","post":"I submit while Colin may be a fine Scientist, he knows nothing of relics and believer’s care for them. I find his statement you included to lack that connection. That is ignoring the physical evidence Rogers proved from the remainder of the samples & in his paper..","date":"2013-05-16","mins":"7:02 pm","url":"https://shroudstory.com/2013/05/16/paper-chase-nobody-goes-to-the-trouble-oh-yes-they-might/","cat":"carbon_14_dating","title":"Paper Chase:  Nobody Goes to the Trouble. Oh, Yes They Might."},{"id":"comment-13931","author":"andy_weiss","post":"No doubt STURP should not have been left out considering their scrupulous science, Dan..","date":"2012-07-17","mins":"7:51 pm","url":"https://shroudstory.com/2012/07/17/paper-chase-sturps-fascinating-1988-draft-protocol-for-future-examinations-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Paper Chase:  STURP’s Fascinating 1988 \"Draft Protocol for Future Examinations of the Shroud of Turin\""},{"id":"comment-48466","author":"andy_weiss","post":"I am unsure Stephen’s assertion that most journalists and their readers are Christian. That’s a fairly large claim and I have no idea how he can justify it..","date":"2013-10-22","mins":"8:42 pm","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","title":"Quote for Today: Stephen Jones on journalists and their readers"},{"id":"comment-61198","author":"andy_weiss","post":"Bravo Al! Bravo..","date":"2013-12-17","mins":"8:22 pm","url":"https://shroudstory.com/2013/12/17/quote-of-the-year-al-adler-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Quote of the Year:  Al Adler on the Carbon Dating of the Shroud of Turin"},{"id":"comment-1414","author":"andy_weiss","post":"Just an historical note of correction. Pete Schumacher was the Production Engineer for the VP8 Image Analyzer that he produced in 1972. Thanks..","date":"2010-09-01","mins":"12:31 am","url":"https://shroudstory.com/2010/08/10/reverend-know-it-all-do-you-really-think-jesus-rose-from-the-dead/","cat":"carbon_14_dating","title":"Reverend Know-it-all: Do you really think Jesus rose from the dead?"},{"id":"comment-1685","author":"andy_weiss","post":"Just want to clarify, Pete Schumacher was the Production Engineer for the VP8 that was produced in 1972, not the 1960s..","date":"2010-11-13","mins":"11:42 am","url":"https://shroudstory.com/2010/08/10/reverend-know-it-all-do-you-really-think-jesus-rose-from-the-dead/","cat":"carbon_14_dating","title":"Reverend Know-it-all: Do you really think Jesus rose from the dead?"},{"id":"comment-33417","author":"andy_weiss","post":"Thanks for that in depth look, Joe. Interesting..","date":"2013-05-10","mins":"12:37 pm","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?"},{"id":"comment-35663","author":"andy_weiss","post":"Matthias : “Nor would the leaders of the movement live, die, suffer torture and martyrdom for an invented story. I used to think this, now I am not 100% sure. Plenty of downtrodden individuals / groups have risked their lives over the centuries in the name of just social causes. I think it is conceivable that the early supporters might have risked their lives because they believed in Jesus and his movement and its cause, even if they knew that the story of his resurrection was metaphor. However, whether the supporters of Jesus were downtrodden enough to make this theory potentially compelling is a big question. If Jesus’s early supporters in the 30s and 40s came from extremely downtrodden backgrounds then this might be feasible, but my understanding is that they were not oppressed in an extreme sense, in a way that would be motivating to risk their lives for a revolutionary cause. So on balance, although interested in the “invented myth”, I am not compelled by it. Until you read the stories of those who went to their deaths for the so called myth. Then there can be no doubt they had an actual experience with a person, not a myth..","date":"2013-06-01","mins":"9:58 pm","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?"},{"id":"comment-33364","author":"andy_weiss","post":"Disclaimer: This post in no way is intended to disparage anyone, nor do I have anyone in mind. It is written about the 1988 testing and the Shroud with its implications as I see them. ~ Andy ————– Since the carbon dating of 1988 has been shown in several ways to fail to represent the date of the Shroud and since they abandoned their protocols, I don’t see the point of continuing to discuss this unreliable dating. It is essentially meaningless and has no bearing on the Shroud. Considering the abandoning of the scientific protocols, it would seem logical it was done purposefully for whatever reason, most likely to cast doubt on the Shroud and to try to influence many to disregard it altogether as a hoax despite the fact that 99% of the evidence points to its authenticity and evidence to the contrary is minimal, at best. The test itself is unreliable and when the other evidence contradicts a carbon dating of just about any artifact, the carbon dating is always set aside, except with regard to the Shroud. This is not surprising considering the controversy it naturally engenders. After all, it is a relic of not only history, science, art, etc., but also of religion. That last category makes many squirm because it requires something of the one who faces it. If it is truly the burial cloth of Jesus Christ, then one is responsible for what one does with that information. Suppressing it is much easier than admitting the possibility and facing it and its implications. Yet I have always found honesty with myself and whatever I face is the best policy for me to take..","date":"2013-05-09","mins":"6:55 pm","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?"},{"id":"comment-54305","author":"andy_weiss","post":"So, the question that comes to my mind is: what do they have to hide?.","date":"2013-12-01","mins":"11:17 am","url":"https://shroudstory.com/2013/11/10/the-mysterious-arizona-piece/","cat":"carbon_14_dating","title":"The Mysterious Arizona Piece"},{"id":"comment-15585","author":"andy_weiss","post":"Sounds like a stretch of conjecture. If not, someone explain why..","date":"2012-08-29","mins":"7:52 pm","url":"https://shroudstory.com/2011/02/11/the-question-of-cotton-in-the-shroud-of-turins-yarn/","cat":"carbon_14_dating","title":"The Question of Cotton in the Shroud of Turin’s Yarn"},{"id":"comment-70504","author":"andy_weiss","post":"I can’t imagine any test being less accurate than the 1988 dating of the Shroud..","date":"2013-12-31","mins":"8:52 am","url":"https://shroudstory.com/2013/12/31/this-may-be-the-shroud-of-turin-story-of-the-year/","cat":"carbon_14_dating","title":"This may be the Shroud of Turin Story of the Year"},{"id":"comment-70872","author":"andy_weiss","post":"Guess she looks pretty good for her age, eh Dave?.","date":"2014-01-01","mins":"3:12 pm","url":"https://shroudstory.com/2013/12/31/this-may-be-the-shroud-of-turin-story-of-the-year/","cat":"carbon_14_dating","title":"This may be the Shroud of Turin Story of the Year"},{"id":"comment-70874","author":"andy_weiss","post":"Sigh. I recommend you try some study of actual material than an unsubstantiated comment. Now if you would have quoted actual facts, that would have made for an interesting comment..","date":"2014-01-01","mins":"3:15 pm","url":"https://shroudstory.com/2013/12/31/this-may-be-the-shroud-of-turin-story-of-the-year/","cat":"carbon_14_dating","title":"This may be the Shroud of Turin Story of the Year"},{"id":"comment-70870","author":"andy_weiss","post":"I understand, Dan. Other scientists should do some good science to either validate or discredit Fanti’s methodology and new work. That will bring real value to the study of the Shroud if it be validated or not..","date":"2014-01-01","mins":"3:06 pm","url":"https://shroudstory.com/2013/12/31/this-may-be-the-shroud-of-turin-story-of-the-year/","cat":"carbon_14_dating","title":"This may be the Shroud of Turin Story of the Year"},{"id":"comment-70871","author":"andy_weiss","post":"Hugh, do you mean aside from the fact that they dropped their scientific protocols for non scientific ones?.","date":"2014-01-01","mins":"3:08 pm","url":"https://shroudstory.com/2013/12/31/this-may-be-the-shroud-of-turin-story-of-the-year/","cat":"carbon_14_dating","title":"This may be the Shroud of Turin Story of the Year"},{"id":"comment-12696","author":"andy_weiss","post":"I’d have to agree with your assessment. He obviously knows very little about these books, except they have been translated and transliterated. These facts do not hardly disparage its message..","date":"2012-06-19","mins":"8:00 am","url":"https://shroudstory.com/2012/06/19/who-is-evolving-into-stupid/","cat":"carbon_14_dating","title":"Who is Evolving Into Stupid?"},{"id":"comment-15517","author":"andy_weiss","post":"To Gabriel ~ Considering the peculiar sample and the abandoning of the protocols for this testing, I suspect foul play just on that basis alone. As Joe Marino shows, the page was not removed, only moved..","date":"2012-08-27","mins":"7:14 pm","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","title":"Was this page removed because it was just too political?"},{"id":"comment-15521","author":"andy_weiss","post":"Ron : Gabriel, how or what have you actually read on the issue of the C14 testing done in 1988? If you were to read several papers and books on the matter, you will find that much of what is written in the linked page above is FACT. I won’t state that a ‘switch’ was performed but alot of the other points made, are in fact, TRUE. As I’ve stated several times before on this blog, the c14 testing was a complete fiasco and I arrived at this conclusion not on my own, but by researching and reading. All or most of where I acquired this info can be found at shroud.com or you can read “The Rape of the Shroud” by William Meacham. I don’t believe there is any proof to a substitution, but there is evidence of a stunning lax in protocols, procedures etc; Things such as the samples being split into smaller pieces by the labs, and actually too “below minimum threshold weight for proper testing”, no official photos of said samples when received at the labs, no proper examination of the samples before cleaning, BASIC cleaning methods used, “not neccessarily efficient for linen samples of a unknown provenance or history” , and finally to the unorthodox communications between labs before results were published or even while testing was in progress!! Moreover, and yes to the non peer reviewed release of the Nature paper. In actuality the final results have still not been released, even till this day, to the Turin Archdiocese! Papers you may want to read; ‘Evidence is not proof: A Response to Timothy Jull’ by Mark Oxley and ‘Radiocarbon Dating the Shroud of Turin: A Nature report’ by Remi Van Haelst, just to name a couple. These amongst others can be found at Shroud.com under scientific papers. R They completely ignored their protocols, Ron. The carbon dating was not science, but voodoo magic to shed a disparaging light on the Shroud. This has since been pointed out astutely by Sue Benford and Joe Marino and proven from the physical evidence by Ray Rogers. Mechem’s book is excellent in this regard and he is an expert on carbon dating..","date":"2012-08-27","mins":"7:35 pm","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","title":"Was this page removed because it was just too political?"}]
