[{"id":"comment-19891","author":"andy_weiss","post":"Wonderful except the nose was not fractured..","date":"2012-12-05","mins":"11:32 pm","url":"https://shroudstory.com/2012/12/05/a-pilgrimage-to-turin/","cat":"news_&_views","title":"A Pilgrimage to Turin"},{"id":"comment-38313","author":"andy_weiss","post":"Thanks Dan. Perhaps you should have done this some time ago. I’m not trying to complain, I’m just happy you are putting your foot down now..","date":"2013-06-28","mins":"8:20 am","url":"https://shroudstory.com/2013/06/28/a-new-rule-and-this-blogs-raison-detre/","cat":"news_&_views","title":"A New Rule and this Blog’s Raison d’etre"},{"id":"comment-15207","author":"andy_weiss","post":"Thanks for those insightful comments, James. Do you have a background in this specialty?.","date":"2012-08-19","mins":"8:33 am","url":"https://shroudstory.com/2012/08/16/a-winning-shroud-of-turin-expository-speech/","cat":"news_&_views","title":"A Winning Shroud of Turin Expository Speech"},{"id":"comment-15455","author":"andy_weiss","post":"I added this video to our Multimedia Library (http://shroudnm.com/library.html)..","date":"2012-08-24","mins":"8:21 pm","url":"https://shroudstory.com/2012/08/16/a-winning-shroud-of-turin-expository-speech/","cat":"news_&_views","title":"A Winning Shroud of Turin Expository Speech"},{"id":"comment-15209","author":"andy_weiss","post":"Dan, that’s an excellent presentation. I liked her board. Unique use of low tech media..","date":"2012-08-19","mins":"8:37 am","url":"https://shroudstory.com/2012/08/16/a-winning-shroud-of-turin-expository-speech/","cat":"news_&_views","title":"A Winning Shroud of Turin Expository Speech"},{"id":"comment-15456","author":"andy_weiss","post":"James Redford : Not in the Shroud of Turin and the Sudarium of Oviedo. I was (somewhat) raised as a Protestant (I say “somewhat”, because really I was raised by a rather free thinking mother who believed in Jesus, but she never pushed any belief system upon me other than reading Bible stories to me from a set of children’s books of Bible stories and occasionally going to a Lutheran church until I was around age five, when we stopped going, and she was nominally Lutheran; and after that I don’t recall her ever talking to me about religion until after my own conversion to Christ), and so I have tended to regard interest in these artifacts as being a part of the Catholic obsession and worship of relics. My conclusion as to Jesus’s divinity isn’t influenced in the least as to the status of these relics. So it doesn’t affect me if they are fakes, but obviously they are very important if they are real…. Thanks James for your lengthy answer. I meant do you specialize in DNA, Physics or the other areas to which you refer? Andy.","date":"2012-08-24","mins":"8:24 pm","url":"https://shroudstory.com/2012/08/16/a-winning-shroud-of-turin-expository-speech/","cat":"news_&_views","title":"A Winning Shroud of Turin Expository Speech"},{"id":"comment-15208","author":"andy_weiss","post":"Yannick, presuming Jesus truly came only from Mary, his body wouldn’t be just like anyone else for the mere fact of what a virgin birth indicates. I imagine you said that to point out that he had a human body and so, was like us..","date":"2012-08-19","mins":"8:35 am","url":"https://shroudstory.com/2012/08/16/a-winning-shroud-of-turin-expository-speech/","cat":"news_&_views","title":"A Winning Shroud of Turin Expository Speech"},{"id":"comment-10978","author":"andy_weiss","post":"That’s pretty funny. Fortunately Jesus didn’t tell us people would like us..","date":"2012-04-29","mins":"8:56 pm","url":"https://shroudstory.com/2012/04/29/and-i-dont-like-p-z-myers-either/","cat":"off_topic","title":"And I don’t like P. Z. Myers, Either"},{"id":"comment-15687","author":"andy_weiss","post":"Great story except there’s no evidence supporting it and a plethora of evidence supporting the Christian story..","date":"2012-09-01","mins":"9:56 am","url":"https://shroudstory.com/2012/08/31/another-jesus-survived-the-cross-legend-another-tomb-of-course/","cat":"news_&_views","title":"Another Jesus Survived the Cross Legend: Another Tomb, of Course"},{"id":"comment-20320","author":"andy_weiss","post":"It is far easier to just dismiss things with specious reasoning than to face what you don’t understand in wonder..","date":"2012-12-12","mins":"8:36 pm","url":"https://shroudstory.com/2012/12/12/asking-randi-what-do-so-many-people-have-against-science/","cat":"news_&_views","title":"Asking Randi what do so many people have against science?"},{"id":"comment-22264","author":"andy_weiss","post":"Yes, it suggests the beatific vision when we see God as he is. He certainly is not referring to the Shroud image..","date":"2013-01-19","mins":"1:11 pm","url":"https://shroudstory.com/2013/01/19/benedict-xvi-jesus-shows-us-the-face-of-god/","cat":"news_&_views","title":"Benedict XVI: Jesus Shows Us the Face of God"},{"id":"comment-19115","author":"andy_weiss","post":"Actually, Dave, deaconesses to which you refer were never ordained and had only one task: to oil down the female catechumens before baptism, since all were received into the Church without garments in the first few centuries. There is no evidence to support your assertion..","date":"2012-11-16","mins":"10:06 am","url":"https://shroudstory.com/2012/11/14/bishop-justin-welby-chosen-to-lead-anglican-communion/","cat":"off_topic","title":"Bishop Justin Welby Chosen to Lead Anglican Communion"},{"id":"comment-19153","author":"andy_weiss","post":"What a sad comment, Yannick. It’s not sad because we disagree, but it is sad because Catholics ought to have their consciences formed by the Church and not secular society. Your argumentation as well as Dave’s come from a secular viewpoint. The Church has stated Jesus did not fail to ordain women due to cultural constraints as you claim, but he did so from intent as the Son of God. My view cannot be classified as conservative or liberal which really misses the point, but if it needs a classification, it ought to be called in line with Tradition and practice of the Church over nearly 2000 years. I do have some interesting studies which demonstrate there were never any women ordained in the history of the Church. I do not have an agenda, but rather just want to think and believe with the Church. That’s one of the many things it means to be Catholic..","date":"2012-11-17","mins":"1:33 pm","url":"https://shroudstory.com/2012/11/14/bishop-justin-welby-chosen-to-lead-anglican-communion/","cat":"off_topic","title":"Bishop Justin Welby Chosen to Lead Anglican Communion"},{"id":"comment-19272","author":"andy_weiss","post":"This is from the new story below I referenced with the Church speaking: “The letter also cited his “diffusion of teachings” opposed to the “definitive teaching of John Paul II and the Magisterium of the Catholic Church as well as the “grave scandal” he has caused to the people of God, to the Church, and to many Maryknoll priests and brothers.” There doesn’t have to be an ex cathedra statement for this to be normative for Catholics. All there has to be is the ordinary magisterium teaching. This statement from the Church refers to this normative teaching..","date":"2012-11-20","mins":"9:16 pm","url":"https://shroudstory.com/2012/11/14/bishop-justin-welby-chosen-to-lead-anglican-communion/","cat":"off_topic","title":"Bishop Justin Welby Chosen to Lead Anglican Communion"},{"id":"comment-19199","author":"andy_weiss","post":"Why then, Dave, did not Jesus ordain women?.","date":"2012-11-19","mins":"9:23 am","url":"https://shroudstory.com/2012/11/14/bishop-justin-welby-chosen-to-lead-anglican-communion/","cat":"off_topic","title":"Bishop Justin Welby Chosen to Lead Anglican Communion"},{"id":"comment-19273","author":"andy_weiss","post":"Was Paul referring to the roles in the Church? I think not. Then again, you have to take all of Paul, like where he is paraphrased to say (two separate statements) that women should not teach, and should have their heads covered in Church because of the angels..","date":"2012-11-20","mins":"9:19 pm","url":"https://shroudstory.com/2012/11/14/bishop-justin-welby-chosen-to-lead-anglican-communion/","cat":"off_topic","title":"Bishop Justin Welby Chosen to Lead Anglican Communion"},{"id":"comment-19266","author":"andy_weiss","post":"Who said we needed a NT reference of Jesus ordaining for the ordination to have taken place? If you reference the Gospel, you will see Jesus giving the 11 the power to fogive sins while breathing on them. Ordination. In reading the following news story, I think you are in contradistinction to the Church on this issue. Http://m.catholicnewsagency.com/new.php?n=26096.","date":"2012-11-20","mins":"8:44 pm","url":"https://shroudstory.com/2012/11/14/bishop-justin-welby-chosen-to-lead-anglican-communion/","cat":"off_topic","title":"Bishop Justin Welby Chosen to Lead Anglican Communion"},{"id":"comment-19327","author":"andy_weiss","post":"Dave ~ I have to say I do enjoy conversing with you because you are quite well reasoned and reasonable. Thanks for that. To reply to your first sentence, I don’t think I claimed any authority at all, but rather took your statement and reviewed it critically. I wish instead of that sentence you would address the critical review. There’s absolutely no doubt John Bourgeous was quite out of place. Thanks for that clarity. There’s no doubt doctrine evolves. I would challenge you though on this issue because never has a woman been ordained in the history of the Church. I have read some (not all) of the anathemas from Trent. Some were a bit over the top, but if the Church would have been able to reform itself before of from the thesis, I am unsure Trent would have even been necessary. There were some serious abuses. Not everything Catholics believe comes from an ex cathedra statement. Lex orandi, lex credendi..","date":"2012-11-21","mins":"9:51 pm","url":"https://shroudstory.com/2012/11/14/bishop-justin-welby-chosen-to-lead-anglican-communion/","cat":"off_topic","title":"Bishop Justin Welby Chosen to Lead Anglican Communion"},{"id":"comment-19271","author":"andy_weiss","post":"Your arguments from silence do not have any meaning, Dave. You want us to accept that (last supper and breathing on them authority to forgive sin), because it doesn’t rule women being present out that they are or might be there, therefore the argument that they weren’t there is silenced? You’ll have to do far better than that. That is flimsy at best. I find it best to go with what we know and avoid this kind of worthless speculation. Recommend you reconsider your opinion if that is all it rests upon. Who is John Gill? Does he have a place in the teaching office of the Church? You are on shaky ground here, Dave..","date":"2012-11-20","mins":"9:11 pm","url":"https://shroudstory.com/2012/11/14/bishop-justin-welby-chosen-to-lead-anglican-communion/","cat":"off_topic","title":"Bishop Justin Welby Chosen to Lead Anglican Communion"},{"id":"comment-19264","author":"andy_weiss","post":"With respect for your opinion, your point makes no sense..","date":"2012-11-20","mins":"8:42 pm","url":"https://shroudstory.com/2012/11/14/bishop-justin-welby-chosen-to-lead-anglican-communion/","cat":"off_topic","title":"Bishop Justin Welby Chosen to Lead Anglican Communion"},{"id":"comment-19267","author":"andy_weiss","post":"I don’t find it to be a point at all that has any merit. See my reply to Dave above..","date":"2012-11-20","mins":"8:45 pm","url":"https://shroudstory.com/2012/11/14/bishop-justin-welby-chosen-to-lead-anglican-communion/","cat":"off_topic","title":"Bishop Justin Welby Chosen to Lead Anglican Communion"},{"id":"comment-19090","author":"andy_weiss","post":"There are many reasons why many are leaving the Anglican communion to join their Catholic brothers and sisters. The so called “women priesthood” and now the push for women bishops is one of them. The Church doesn’t have female clergy, Dave, because they have never had female clergy – pointed to by many authorities due to the fact that Jesus did not ordain women. That is the bottom line. Yet there is no one in the Church more highly honored than Mary, the Theotokos. Men and women are different and have different callings..","date":"2012-11-15","mins":"9:26 pm","url":"https://shroudstory.com/2012/11/14/bishop-justin-welby-chosen-to-lead-anglican-communion/","cat":"off_topic","title":"Bishop Justin Welby Chosen to Lead Anglican Communion"},{"id":"comment-19270","author":"andy_weiss","post":"That is hardly the main or the only argument in favor of the Church’s teaching on ordination, Yannick. You are barking up the wrong tree. This is an error of reason: assign a fallacious argument to the other side and then show how the argument is filled with holes. That’s not very convincing to anyone except yourself and those who have already made up their minds without listening to the Church who does have the authority to state the teaching. Ironic. We could easily trace the barring of women’s ordination to the priesthood back to the fall of Eve and go from there. There’s no doubt Jesus was a human being – a MALE human being. God chose to incarnate himself as a man, not a woman. This is quite telling. The Holy Spirit cannot contradict Church teaching on ordination or any other subject, Yannick, for the Church is guarded against error on faith and morals. This subject most certainly fits into these categories. Your statements show a serious lack of knowledge of Church teaching and how the Church works. Attempting to ‘do church’ from a secular viewpoint leads one somewhere the Church will not go, your opinion notwithstanding. There are obviously men and women and both are different and complementary – this is a misuse of Paul’s statement which had nothing to do with roles in the Church. Your arguments are secular in nature and fall far short of really addressing the issue of ordination. Perhaps it doesn’t matter to you that the Church has never ordained women, but the constant practice of the Church is a major contributor to this teaching..","date":"2012-11-20","mins":"9:01 pm","url":"https://shroudstory.com/2012/11/14/bishop-justin-welby-chosen-to-lead-anglican-communion/","cat":"off_topic","title":"Bishop Justin Welby Chosen to Lead Anglican Communion"},{"id":"comment-19269","author":"andy_weiss","post":"So true. Claiming apostolic succession or being apostolic, whatever that might mean, doesn’t mean one has it. One has to have it in fact as well as in claim. Without any malice or ill will toward anyone, the Anglican Church simply does not have this..","date":"2012-11-20","mins":"8:49 pm","url":"https://shroudstory.com/2012/11/14/bishop-justin-welby-chosen-to-lead-anglican-communion/","cat":"off_topic","title":"Bishop Justin Welby Chosen to Lead Anglican Communion"},{"id":"comment-19268","author":"andy_weiss","post":"With respect to your opinion, it simply flies in the face of know history. Since the Anglican Church was created by Henry VIII after breaking with the Catholic Church, no one in the Anglican Church can claim apostolic anything, Dan..","date":"2012-11-20","mins":"8:47 pm","url":"https://shroudstory.com/2012/11/14/bishop-justin-welby-chosen-to-lead-anglican-communion/","cat":"off_topic","title":"Bishop Justin Welby Chosen to Lead Anglican Communion"},{"id":"comment-19276","author":"andy_weiss","post":"Yannick Clément : If I follow your line of thoughts Andy, then the Church should let the priest free to decide whether they want to be married or not (note that it would be a VERY good thing) ! Remember that the obligation for celibacy only came very late (during the Middle Ages) !!! All the Apostles were probably married… So, following my argumentation Andy, I ask you the question: Do you agree with me that it’s about time that the Church let the priest free to decide whether they want to get married or not ??? That’s a false statement, Yannick. Read the following which shows clearly how the requirement of celibacy was from the times of Paul or before: The Apostolic Origins of Priestly Celibacy by Christian Cochini, SJ (doctor of tehology and taught in many univeristies) & Celibacy in the Church: The Beginnings of a Discipline of Obligatory Continence for Clerics in East and West by Stefan Heid (German theologian consulted by the German bishops on many occasions). Jesus never ordained women simply because women in his patriarcal society were considered on the same level than a dog (and this is not a joke!). THIS IS THE HISTORIC TRUTH ! How in the world he could have taken a women in the group of the twelves ? Never ! As I said, he would have been stone to death in Galilea on the first day and would never have reached Jerusalem !!! This argument of yours Andy (which is the official argument of the Vatican that I have heard many times) is not fair at all for women because it does not take account of the historical context of Jesus time. Sad to say but it’s an argument of men FOR men. You would rarely see a free women agreeing with such an argument ! Refusal to accept teaching of the Church means you are choosing to be outside the Church, my brother. Why would you choose this? But the main thing to understand is that such a question only concern the discipline inside the Church. In the end, it’s not that important because this is not what’s at the heart of Jesus message, which is : 1 Love God and 2 Love every humans. Sticking too much on these disciplinary questions while not allowing any possibility of change can make people look like the Pharisees of Jesus time (i.e. Close minded people who preferred to follow the human tradition instead of God’s law, which is the law of LOVE and MERCY best described in the Sermon of the mount) and this closeness of mind is exactly what Christ has denonciate the most during his lifetime ! And the fact is this : all those questions of disciple are free to EVOLVE with the evolution of mentality (I prefer to say “with the evolution of our humanity”) !!! It’s wrong to think that all these questions are stuck in concrete and could never change !!!! Remember that contesting the authority and the discipline of his Jewish religion was at the heart of Jesus message… Let’s evolve and stop thinking entirely and do whatever we want. That is the thrust of your argument, my friend. And here’s the most important thing: Once you put love into your reflection, things become very clear ! With the eyes of love, I think it becomes evident that there is no good reason why Women should not be ordained… And here’s my main argument in favor of such a thing: THERE ARE WOMEN WHO RECEIVE THE CALL FOR PRIESTHOOD !!!! Andy, don’t you understand that this is a sign from the Holy Spirit that it is about time that the Church allow the ordination of women ??? Do you mean aside from the fact that the Church which does have the authority to teach on faith and morals without error (there does not need to be an ex cathedra statement) teaches the contrary of what you are stating here? This is the Traditional and Scriptural truth for the Church is the ground and bulwark of truth. Women cannot receive the call to priesthood because by definition, the very Church you claim needs to ordain women teaches this is not possible. These views are nonsense for Catholics. And this is the same thing with the marriage of priests. It is about time that the Church allow the freedom of choice ! This is untrue that all the priest are also called for celibacy… One don’t necessarily goes with the other. I’m truly confident that one day (maybe not far from us) a new Pope (certainly not Benedict !!!) will make a great reform in the Church concerning all those disciplinary question that are truly secondary versus what’s at the heart of Jesus message. I’ll end my comment with this important truth: Believing that Jesus was the Son of God who revealed the true God of Love and Mercy is what makes us Christians, not our personal opinion on some disciplinary questions… Married priests is a discipline of some of the Eastern Churches in union with the Pope and there is no issue with it. But the fact remains as the two authors to which I refer above, celibacy was established very early in the Church. May have this mistaken notion which is a pipe dream, not reality..","date":"2012-11-20","mins":"9:42 pm","url":"https://shroudstory.com/2012/11/14/bishop-justin-welby-chosen-to-lead-anglican-communion/","cat":"off_topic","title":"Bishop Justin Welby Chosen to Lead Anglican Communion"},{"id":"comment-19329","author":"andy_weiss","post":"Thanks Dave for the in depth look at the Anglican ordination and the additional information. Obviously I need to do more reading on the subject. I appreciate the time you took in elucidating this point. Concerning your interpretation of Gal 3:28, I wish you would explain how you come to this conclusion. Paul is not referring here to any kind of ordained ministry, so this kind of application does not seem warranted. Your rationale as to how you come to this conclusion would be of the highest import in showing how your opinion has any merit in this regard..","date":"2012-11-21","mins":"10:22 pm","url":"https://shroudstory.com/2012/11/14/bishop-justin-welby-chosen-to-lead-anglican-communion/","cat":"off_topic","title":"Bishop Justin Welby Chosen to Lead Anglican Communion"},{"id":"comment-19274","author":"andy_weiss","post":"Actually Dave, there are several problems with your post here that need direct response. 1) there is no myth of the male dominated church. This is false, period. 2) It is irrelevant that there have been effective Anglican women bishops – this has nothing to do with the issue (I have no doubt you speak the truth, I only state it has no bearing on the case) 3) There were never any deaconesses who were ordained in the Catholic Church – there were women deaconesses who oiled down the women catechumens since they were baptized sans clothing 4) Being a missionary and being ordained are completely different and so have no bearing on the case 5) The Church has ruled that the society did not determine that males were ordained and women were not, but that this was Jesus choice as Son of God 6) Being an ‘altar server’ does not a priest make – having them or women lectors really has no bearing on the issue. I have known excellent women lectors and excellent girl altar servers and I have known many that were terrible, but it is irrelevant to the point itself..","date":"2012-11-20","mins":"9:26 pm","url":"https://shroudstory.com/2012/11/14/bishop-justin-welby-chosen-to-lead-anglican-communion/","cat":"off_topic","title":"Bishop Justin Welby Chosen to Lead Anglican Communion"},{"id":"comment-19331","author":"andy_weiss","post":"This is a good summary and shows the weakness of your position. I sill summarize your positions and provide responses. 1) The teaching of the magisterium on this issue is not infallible and therefore open to discussion. Response: We are required to hold the ordinary and extraordinary magisterial teachings of the Church. The Vatican letter in reference to the recent removal of John Bourgeous makes clear John Paul II gave definitive teaching on the subject in his letter. As such, one cannot validly dissent or hold a position other than this one. 2) Not all traditions are immutable and therefore this one can change. Response: As definitive teaching, this is not changeable. 3) Christ chose to be male because it was the only way for him to exercise a ministry in the culture, otherwise he could have chosen either, so this is solely culturally conditioned (Gal 3:28). Response: God knows all things and yet chose to come as a man, not a woman. Jesus was not culturally bound which you have demonstrated well in showing how he broke with many Jewish restrictions. This actually weakens your case and supports the fact that the choice to choose male disciples and following to ordain them to ministry (aforementioned breathing and giving the power to forgive sins only recorded to be given to the 11 & Matt 28:18 20 ‘teach all nations. Baptizing…’). Obviously this has nothing to do with cultural conditioning and has to do with the choice of the Son of God. Your use of Gal 3:28 is arbitrary since the passage is not referring to any ordained ministry in the Church, but rather is general in scope and intent, 4) Because the gospels were written by men and only record men being disciples, therefore this is biased and ought to be dismissed. Further, Jesus has many interactions with women that broke with the norm and there are instances in Scripture where it might be implied that women were there. Response: A charge that there was male bias has no grounds to substantiate itself and Gal 3:28 disproves the presumption. Jesus interactions with women prove that what Jesus did was not culturally conditioned and actually disproves your point. The insinuation that when women are not mentioned that they are most likely there is an error called argument from silence. This is not a valid point and will be completely disregarded and not considered again. This a fantasy, flimsy as ever to support your desired notion that women ought to be ordained. Any knowledgeable Catholic is aware the constant practice of the Church makes it unthinkable to question or change this practice. It is well known that no woman has ever been ordained in the Catholic Church for any purpose. This can also be seen in practice in the case of abortion, artificial means of contraception and many others. 5) John Bourgeous was disciplined and this does not support the immutability of this teaching. Response: I agree, but I never made that point (straw man). I refer you to the letter from the Vatican claiming [his “diffusion of teachings” opposed to the “definitive teaching of John Paul II and the Magisterium of the Catholic Church” as well as the “grave scandal” he has caused]. It is this definitive teaching to which I refer. Definitive is as it states, nothing more and nothing less..","date":"2012-11-21","mins":"11:04 pm","url":"https://shroudstory.com/2012/11/14/bishop-justin-welby-chosen-to-lead-anglican-communion/","cat":"off_topic","title":"Bishop Justin Welby Chosen to Lead Anglican Communion"},{"id":"comment-19325","author":"andy_weiss","post":"Yannick Clément : Chris, you get me completely wrong, the so called “ordination” I referred to was when he choose his 12 disciples ! I dare say no one would consider Jesus’ call to his disciples as an ordination in any sense of the word, Yannick..","date":"2012-11-21","mins":"9:42 pm","url":"https://shroudstory.com/2012/11/14/bishop-justin-welby-chosen-to-lead-anglican-communion/","cat":"off_topic","title":"Bishop Justin Welby Chosen to Lead Anglican Communion"},{"id":"comment-19332","author":"andy_weiss","post":"I think in responding to Dave I have laid out the reasons why his rationale are specious and without foundation in reality. By all means respond to my content. I am enjoying this discussion/debate..","date":"2012-11-21","mins":"11:21 pm","url":"https://shroudstory.com/2012/11/14/bishop-justin-welby-chosen-to-lead-anglican-communion/","cat":"off_topic","title":"Bishop Justin Welby Chosen to Lead Anglican Communion"},{"id":"comment-19328","author":"andy_weiss","post":"Dan : Andy, you do realize that since 1980, Anglican priests who choose to become Roman Catholic priests are re ordained (new formation) as opposed to being ordained for the first time because their first ordination is recognized as apostolic by the Pope and the Vatican. The provisions established by Pope John Paul II also allows for married or unmarried male Episcopal priests (now extended to male priests and bishops in the Church of England and the Church of Ireland). These priests may use Anglican worship traditions from the Book of Common Prayer for Mass, which acknowledges apostolic succession. But it is not important. Really! Whatever layman Henry VIII did or did not do (really, it was Elizabeth I who was important here) has no bearing on apostolic succession. Succession is by laying on of hands and cannot be nullified by laity. ‘ It is significant, too, that Benedict XVI considers ++Rowan Cantuar, namely the Most Reverend and Right Honorable Rowan Douglas Williams, to be the 104th Archbishop of Canterbury. That is 104 since Augustine of Canterbury. Thanks Dan. I stand corrected..","date":"2012-11-21","mins":"9:55 pm","url":"https://shroudstory.com/2012/11/14/bishop-justin-welby-chosen-to-lead-anglican-communion/","cat":"off_topic","title":"Bishop Justin Welby Chosen to Lead Anglican Communion"},{"id":"comment-19360","author":"andy_weiss","post":"I’m sorry you are not willing to engage in your use of Gal 3:28 supporting your position when this does not mean what you state it does mean in light of Paul’s restrictions on women in liturgy. As such, Godspeed, my friend..","date":"2012-11-22","mins":"10:17 am","url":"https://shroudstory.com/2012/11/14/bishop-justin-welby-chosen-to-lead-anglican-communion/","cat":"off_topic","title":"Bishop Justin Welby Chosen to Lead Anglican Communion"},{"id":"comment-19443","author":"andy_weiss","post":"What a sad commentary “male power” on a theory that cannot be proven, only asserted to the detriment of the very Church you claim to follow. The historical FACT that Jesus appeared to women first actually works against your argument that women ought to be ordained. Women were not chosen by the risen Christ for this role as is seen from the risen Christ instructing his apostles in the 40 days he remained with them after the resurrection and going down through history in which there has never been a woman ordained in Jesus’ Church. This also being a FACT, your theory that women ought to be ordained goes against the wishes of the risen Christ. If he didn’t choose women, what makes us think we can?.","date":"2012-11-24","mins":"12:32 pm","url":"https://shroudstory.com/2012/11/14/bishop-justin-welby-chosen-to-lead-anglican-communion/","cat":"off_topic","title":"Bishop Justin Welby Chosen to Lead Anglican Communion"},{"id":"comment-19530","author":"andy_weiss","post":"Yannick, Your comment about being Christian has nothing to do with the issue we are discussing. What makes us Christian is we were baptized and continue to strive to life a Christian life in imitation of Jesus. Through Baptism we enter into the Body of Christ and through our perseverance we follow Christ to the end in charity. I have demonstrated in this exchange throughout that Christ both before and after the resurrection did not fail to choose women for ordained ministry because of some societal norms or issues, but rather because it was not his plan as God. I have stated that men and women have equal but differing roles in the Church and society. I have argued from historical practice, Scripture and magisterial teaching on the issue to show how your position does not have a leg to stand upon. I have researched this and read books by experts in the field of which I have referenced a couple in the thread. Furthermore, when the Anglican Church was considering this novelty in the 1970s, they asked for the opinion of Pope Paul VI who wrote this was not a possibility. Pope John Paul II wrote eloquently and definitively on the issue. Both were extremely clear on this issue and if you are interested you can download and read both of them from the Vatican or other websites. After all my research and reading over the years, all you can come to me with this unsupported, circular reasoning: “it doesn’t go against the wishes of the Risen Christ because his Holy Spirit is really calling some Christian women to be priest.” Let me get this right and correct me if I am misstating your position. It doesn’t go against the wishes of the risen Christ because of an unsupported claim – God is calling women to the priesthood! Does the magisterium agree with your opinion? No. Do you have any Scriptural support for your view? No! Do you have any previous practice of the Church to support your opinion? No. It’s true because you have stated it! Then you make the biggest blunders in all your unsupported statements: “the Holy Spirit know very well that it would have been TOTALLY IMPOSSIBLE in the first century A.D.” You further state this is the ONLY reason women were not chosen by God sooner. This is a ludicrous statement because of the Scriptural injunction: “with God all things are possible.” If nothing is impossible for God, in what way is this impossible for God. In light of this Scriptural rule (God is the Creator and can do as he pleases), in what way would it be impossible for God not to call women to a leading role in the Church? And this is ONLY reason, you say? You provide no support for your unsubstantiated statement because there is none. In light of your failure to support any statement you have made, I ask this of you: either support your opinions or just stop arguing and state you believe it no matter the evidence that contradicts the veracity of your claim. In light of your lack of support for Church practice and teaching, it would seem your disagreement with the Church is a dangerous opinion for you to take. It’s not dangerous in and of itself, but if this is how you figure out whom to believe, what other teachings of the Church do you so carelessly disregard? I do not ask to shame you, but out of concern for your welfare, my friend. I ask you to consider the evidence and consider upon what rests your opinion. I have considered the basis from which my belief on the issue comes and have attempted to state it clearly. If you pin your hopes on Gal 3:28 (I realize this is not your argument) which has nothing to do with the liturgical practice, you will have to take into consideration the other of Paul’s statements in which he does limit the participation of women in liturgy. Godspeed, Andy.","date":"2012-11-26","mins":"10:39 pm","url":"https://shroudstory.com/2012/11/14/bishop-justin-welby-chosen-to-lead-anglican-communion/","cat":"off_topic","title":"Bishop Justin Welby Chosen to Lead Anglican Communion"},{"id":"comment-19572","author":"andy_weiss","post":"Your synopsis leaves much to be desired, Yannick. I have nothing else to say, except, God bless you..","date":"2012-11-27","mins":"9:15 pm","url":"https://shroudstory.com/2012/11/14/bishop-justin-welby-chosen-to-lead-anglican-communion/","cat":"off_topic","title":"Bishop Justin Welby Chosen to Lead Anglican Communion"},{"id":"comment-19114","author":"andy_weiss","post":"Dave ~ With respect to your point of view, there are theological objections which is the precise reason why there will never be females ordained in the Catholic Church. It’s not a question of the effectiveness of women. That’s where you have gone off the beaten path. It has nothing to do with power or male domination. Those are only unproven assertions that cloud the real issue which is theological in nature and quite simple as previously stated..","date":"2012-11-16","mins":"10:02 am","url":"https://shroudstory.com/2012/11/14/bishop-justin-welby-chosen-to-lead-anglican-communion/","cat":"off_topic","title":"Bishop Justin Welby Chosen to Lead Anglican Communion"},{"id":"comment-12236","author":"andy_weiss","post":"That’s funny..","date":"2012-06-11","mins":"8:10 pm","url":"https://shroudstory.com/2012/06/11/breaking-news-abraham-lincoln-shot/","cat":"news_&_views","title":"Breaking News: Abraham Lincoln Shot"},{"id":"comment-26990","author":"andy_weiss","post":"Your equality/capability argument in regard to permitting women to become priests is not impressive nor convincing in any respect Dave. We already had that conversation, but you have introduced it anew nonetheless, so I felt obliged to respond. God bless..","date":"2013-03-10","mins":"10:41 am","url":"https://shroudstory.com/2013/03/09/but-they-didnt-ask-about-the-shroud-of-turin/","cat":"news_&_views","title":"But they didn’t ask about the Shroud of Turin"},{"id":"comment-26908","author":"andy_weiss","post":"I would love to see a real poll on the Shroud. You would get varied answers, I suppose, if asked of 1. Dedicated, regularly attending Christians, 2. All Christians & 3. All people. As to the Catholic poll, if one does not know, the Catholic Church is not a democratic institution so polls only show personal opinions and might indicate practices. It could reveal a small window into the lack of catechesis & evangelization of many American Catholics. A well catechized Catholic, if they are truly dedicated to the Church submit to the Church regardless of their opinion, so in that sense, an opinion poll really does not reveal the state of American Catholicism. A poll to reveal that would have to contrast opinions with obedience questions, such as: A. Are you in favor of women priests? & B. Do you submit to the Church in their teaching there have never been nor can there ever be women priests?..","date":"2013-03-09","mins":"1:25 pm","url":"https://shroudstory.com/2013/03/09/but-they-didnt-ask-about-the-shroud-of-turin/","cat":"news_&_views","title":"But they didn’t ask about the Shroud of Turin"},{"id":"comment-26986","author":"andy_weiss","post":"A news story Dan & Yannick might overlook… Hamden, Conn., Mar 9, 2013 / 04:03 pm (CNA). A majority of Catholics who attend services weekly oppose same sex “marriage,” according to a poll by Quinnipiac University, even though it’s release suggested that Catholics largely support the practice. Among Catholics who are registered to vote and who attend services weekly, 36 percent support “gay marriage,” while 55 percent oppose it, according to figures provided to CNA by April Radocchio, Quinnipiac University Polling Institute’s associate poll director. The release announcing the poll, by contrast, said that among all registered voters who identify as Catholic – 11 percent of whom never attend religious services – 54 percent support same sex “marriage,” while only 47 percent of all registered voters are supportive of it. Based on this finding, Peter Brown, Quinnipiac’s assistant director, said that “Catholic voters are leading American voters toward support for same sex marriage.” Brown’s assertion drew criticism from some Catholic circles, with many suggesting that the poll was flawed in some way. Pia de Solenni, an ethicist who holds a doctorate in sacred theology from the Pontifical University of the Holy Cross, emphasized that the poll, with a sample of less than 500 Catholics, was “hardly representative” of Catholics in America. “When you ask someone if they’re Catholic, you have to further specify, do they attend church regularly or not,” she noted. Survey results are often vastly different between Catholics who do and do not regularly attend Mass. The poll surveyed 497 Catholics from Feb. 27 to March 4, and had a margin of error of plus or minus 4.4 percent for questions asked of Catholics. In the release announcing the poll’s results, Quinnipiac provided figures for several questions pertinent to Catholics in America. Most of these were issues particular to Catholics, and the answers were broken down so that readers could compare the differences between those Catholics who attend religious services weekly and less than weekly. However the question asking about support or opposition to same sex marriage did not have this distinction, merely showing Catholics as a whole. Radocchio explained the discrepancy, telling CNA that the question about same sex marriage was asked in the “general issues section” of the poll, and the question was posed to all registered voters. “We reported them with the breakdowns we generally used with registered voter releases,” she explained. She said that the remaining questions were all “Catholic issues” which were asked only of Catholic respondents, regardless of their voter registration. Among Catholics who are registered to vote and who attend services weekly, a mere 36 percent support “gay marriage,” while 55 percent oppose it, the poll found. Among those who attend services less than weekly, 63 percent support “gay marriage” and 29 percent oppose it. The margin of error for those figures is plus or minus 4.7 percent. Fewer than 497 Catholics were asked the question, because not all of the Catholic respondents were registered voters, though Radocchio said the number of Catholic respondents about “gay marriage” was “not much less” than 497. Brown told CNA that the breakdown of the same sex “marriage” results was not in the initial poll release because “we only have so much space, and can only do so many things up front.” It was “certainly not malicious,” he said, and was a “completely benign decision.” The poll also found that while 52 percent of respondents think the Church is “moving in the right direction,” 55 percent think the next Pope “should move the Church in new directions.” Sixty four percent said the next Pope should “relax the church ban on contraception,” and 62 percent responded that he should support allowing women to become priests. The responses to these questions consistently showed a stark contrast in the opinions of those who attend Mass weekly, and those who attend less than weekly. For example, of those who do not attend services weekly, 73 percent support the priestly ordination of women. Of those who do attend weekly, that figure is only 38 percent. De Solenni said the poll “shows the importance of more effective teaching” in the Church. She noted that “when you ask a question of those who attend Mass regularly, the ratios are almost inverse.” “So if they really want to do a survey that has some integrity, let us know what the standard is for identifying someone as Catholic.” De Solenni added that these issues are not of interest solely to Americans, but to Catholics worldwide. “It’s really important that we take a global perspective on this, and look at what people are saying around the world.” She said that polls such as the one conducted by Quinnipiac can be useful in terms of “knowing the audience you’re speaking to” and “how much teaching needs to be done.” Such polls, however, are not helpful guides “in terms of telling us which policies we should pursue.” http://m.catholicnewsagency.com/new.php?n=26752.","date":"2013-03-10","mins":"10:05 am","url":"https://shroudstory.com/2013/03/09/but-they-didnt-ask-about-the-shroud-of-turin/","cat":"news_&_views","title":"But they didn’t ask about the Shroud of Turin"},{"id":"comment-26989","author":"andy_weiss","post":"Actually Yannick, you have misquoted me from our personal correspondence. I didn’t say you needed to be catechized because you were liberal. I said you needed to be catechized because you are not knowledgeable about the Catholic faith and I did so as charitably as possible in private. Since you placed that here, it’s no longer private. There’s nothing 21st century or modern about homosexuality. It is ancient and disordered. I guess you just call St. Paul ignorant for writing that those who practice such things cannot enter the kingdom of God. Please note it is the practice that is the sin, not the self identification. And the sin is no different than any other sin in that it offends God. It is a fact that homosexuals generally do not have monogamous relationships with the same person for life, which is precisely it’s definition between one man and woman. But redefining marriage to please those who so demand is absurd. It’s the complementarity of the sexes that produces life. In other words, only when you have a man and a woman is a child produced. All children deserve a Mother and Father. There is no such thing as women or men fulfilling both roles naturally. Neither of the same sex can produce a child except by taking the missing ingredient from someone else, hence the child needs to know and be raised by both his or her Mother and Father. The change you seek has nothing to do with the Holy Spirit. The change you seek breaks with the 2000 year Catholic tradition. The very reason for the name Catholic (universal) is because all believed and practiced the same things. These beliefs did not include homosexuality or abortion. Your beliefs inasmuch as they vary with the church’s teachings are not Catholic in any sense of the word as applied to the Catholic Church..","date":"2013-03-10","mins":"10:34 am","url":"https://shroudstory.com/2013/03/09/but-they-didnt-ask-about-the-shroud-of-turin/","cat":"news_&_views","title":"But they didn’t ask about the Shroud of Turin"},{"id":"comment-17643","author":"andy_weiss","post":"Relics according to Catholics cannot be bought or sold, only given away. This is a hoax that should be ignored..","date":"2012-10-14","mins":"9:39 pm","url":"https://shroudstory.com/2012/10/14/buy-a-piece-of-the-shroud-of-turin-true-proper/","cat":"news_&_views","title":"Buy  a piece of the Shroud of Turin. True? Proper?"},{"id":"comment-11594","author":"andy_weiss","post":"With respect to Calvin’s point of view, I would have to say in fairness it would have to be admitted as is obvious in Scripture (Acts) that these followers of the way were not only rejected, but the leaders of the Jews, of which they were an original part, were thrown into prison and given stripes for speaking in the name of Jesus. To not publicize the Shroud is not even close to any kind of proof that it is a fake and wasn’t there at the resurrection. I would point Mr. Calvin to the end of John’s gospel in which the disciple Jesus loved, John, peered into the empty tomb before Peter went in and he came to believe. What does that mean? Well, he was there for the crucifixion and was most likely present for the burial. He saw a dead Jesus enshrouded and then on the third day he saw either a tied Shroud without a body or an untied Shroud with an image on it. Both of these conclusions to his involvement with Jesus’ crucifixion would certainly cause one to believe. This joined with the possibility that Jude took the Shroud to Edessa early could account for a lack of Scriptural evidence of this event. It certainly wasn’t core to the resurrection event. If it was core, obviously it would have been written down by one of them, unless they were instructed not to do so. The glorified Jesus taught them for some time after the resurrection. Based on all these unknowns, I don’t think Calvin’s skepticism can be taken very seriously..","date":"2012-05-25","mins":"1:24 pm","url":"https://shroudstory.com/2012/05/25/calvinists-and-the-shroud-of-turin/","cat":"news_&_views","title":"Calvinists and the Shroud of Turin"},{"id":"comment-49569","author":"andy_weiss","post":"It’s an obvious mistake. Perhaps they can edit to correct..","date":"2013-11-02","mins":"8:58 am","url":"https://shroudstory.com/2013/11/01/catch-of-the-day-minimally-scientific-testing/","cat":"news_&_views","title":"Catch of the Day:  Minimally Scientific Testing???"},{"id":"comment-33148","author":"andy_weiss","post":"We have some videos & Schumacher audio on our library page – http://shroudnm.com/library.html. Russ Breault has a good audio/video selection – http://www.shrouduniversity.com/ You can also use the You Tube Video Channel – http://www.youtube.com/lijkwade/.","date":"2013-05-07","mins":"8:10 am","url":"https://shroudstory.com/2013/05/07/enhance-the-blog/","cat":"news_&_views","title":"Enhance the Blog"},{"id":"comment-18903","author":"andy_weiss","post":"I wonder if distinctive pattern recognition is a valid way to find “images”?.","date":"2012-11-08","mins":"10:00 pm","url":"https://shroudstory.com/2012/11/03/face-of-the-man-of-the-shroud-of-turin-encoded-in-sistine-chapel/","cat":"news_&_views","title":"Face of the Man of the Shroud of Turin Encoded in Sistine Chapel?"},{"id":"comment-14828","author":"andy_weiss","post":"Some truth. I think they need better biblical exegesis. Let’s ignore the fact they are completely ignorant of any Shroud studies that have been done starting with Pia’s discovery. Agreed, daveb..","date":"2012-08-12","mins":"9:21 am","url":"https://shroudstory.com/2012/08/12/forget-the-improved-translation-rely-on-the-kjv/","cat":"news_&_views","title":"Forget the improved translation. Rely on the KJV."},{"id":"comment-19974","author":"andy_weiss","post":"This is extreme disrespect to the man pictured thereon. Don’t buy them!.","date":"2012-12-07","mins":"9:08 am","url":"https://shroudstory.com/2012/12/07/for-your-shroudie-friends-at-christmas/","cat":"news_&_views","title":"For your Shroudie friends at Christmas"},{"id":"comment-73575","author":"andy_weiss","post":"Wow, we’re 6th. Thanks Dan..","date":"2014-01-18","mins":"1:10 am","url":"https://shroudstory.com/2014/01/17/fyi-the-big-thirteen/","cat":"news_&_views","title":"FYI: The Big Thirteen"},{"id":"comment-13579","author":"andy_weiss","post":"It is ironic how he painted himself into a corner. If one wants to consider “proofs” of God, I recommend Thomas Aquinas..","date":"2012-07-07","mins":"9:14 am","url":"https://shroudstory.com/2012/07/07/higgs-boson-and-religion-and-science/","cat":"off_topic","title":"Higgs Boson and Religion and Science"},{"id":"comment-73577","author":"andy_weiss","post":"Dan ~ the link for sindone.it does not go anywhere..","date":"2014-01-18","mins":"1:39 am","url":"https://shroudstory.com/2014/01/17/fyi-the-big-thirteen/","cat":"news_&_views","title":"FYI: The Big Thirteen"},{"id":"comment-70507","author":"andy_weiss","post":"I would expect Rogers, Adler & Zugibe would be doing tests based on statements and challenges made in this blog and other places..","date":"2013-12-31","mins":"8:56 am","url":"https://shroudstory.com/2013/12/31/i-think-this-was-my-favorite-comment-from-a-reader-during-2013/","cat":"science","title":"I think this was my favorite comment from a reader during 2013"},{"id":"comment-46008","author":"andy_weiss","post":"Computers only do what they are programmed to do. They cannot exceed their programming. People can be programmed and can exceed their programming. So the comparison is that while people can be programmed (brainwashing night be a more accurate description), then can and oftentimes do decide apart from that programming. Computers are of course not sentient beings, much less beings at all. People are..","date":"2013-10-02","mins":"8:36 am","url":"https://shroudstory.com/2013/10/01/if-a-computer-says-im-aware-how-do-you-know-if-it-is-telling-the-truth/","cat":"news_&_views","title":"If a computer says, “I’m Aware,” how do you know if it is telling the truth?"},{"id":"comment-21777","author":"andy_weiss","post":"This is a waste of space, Dan. The myth that keeps on popping up without meaning or substance..","date":"2013-01-09","mins":"9:14 am","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","title":"Jesus’ Wife Papyrus Update"},{"id":"comment-18720","author":"andy_weiss","post":"With respect, Max, I think I see on a photo of the Shroud is absurd. Stuff can happen with any photo so to rely upon this is not really reliable without objective verification of the “think I see.” I completely agree with Barrie Schwortz on this..","date":"2012-11-01","mins":"8:18 pm","url":"https://shroudstory.com/2012/08/17/les-fredettes-crucifixion-nail-why-i-am-skeptical-about-it/","cat":"news_&_views","title":"Les Fredette’s Crucifixion Nail: Why I am Skeptical About It"},{"id":"comment-15163","author":"andy_weiss","post":"Very well written, Dan. I am of the opinion of Ray Rogers through Barrie Schwortz (I would have loved to have met Ray, I think I would have really liked him, but his death was far before I got involved in SEAM and created the website, which caused me to start my own study in 2009). There has to be objective criteria by which to verify these observations to something provable by actual measurement. I don’t pretend to know how that could be done for that is not my area, but it seems to me that experts in that area might come up with something. Necessity is the mother of invention..","date":"2012-08-17","mins":"8:29 pm","url":"https://shroudstory.com/2012/08/17/les-fredettes-crucifixion-nail-why-i-am-skeptical-about-it/","cat":"news_&_views","title":"Les Fredette’s Crucifixion Nail: Why I am Skeptical About It"},{"id":"comment-21888","author":"andy_weiss","post":"“That is simply not true. Ninety Seven per cent of Planned Parenthood activities are devoted to women’s health issues, a part of the 97% does include contraception services, BUT, the number one way to prevent abortions is contraception.” You need to do your research better, Dan. Your statement is simply false from P Ps own records..","date":"2013-01-11","mins":"11:36 am","url":"https://shroudstory.com/2013/01/11/living-free-the-thomas-aquinas-and-pierre-teilhard-de-chardin-part/","cat":"uncategorized","title":"Living Free: The Thomas Aquinas and Pierre Teilhard de Chardin Part"},{"id":"comment-21992","author":"andy_weiss","post":"Sorry, John, that’s false. See below. The numbers are taken from PP’s own report. Get it and read it if you will. Relying on a sardonic article is doing you a disservice..","date":"2013-01-14","mins":"9:31 am","url":"https://shroudstory.com/2013/01/11/living-free-the-thomas-aquinas-and-pierre-teilhard-de-chardin-part/","cat":"uncategorized","title":"Living Free: The Thomas Aquinas and Pierre Teilhard de Chardin Part"},{"id":"comment-16055","author":"andy_weiss","post":"Sounds so inane, attempting to “prove” everything from the bible (or so it sounds), for it can “only be explained as a deception of Satan, just as the word declares.” I agree with daveb. I am unsure it would be worth the time it would take to read it..","date":"2012-09-09","mins":"9:24 am","url":"https://shroudstory.com/2012/09/09/lyingwonders-com-satan-is-behind-it/","cat":"news_&_views","title":"LyingWonders.com:  Satan is behind it"},{"id":"comment-21990","author":"andy_weiss","post":"Sorry Dan. I misread it. The facts don’t lie, John. Read these numbers and then dispute their numbers if you wish. Planned Parenthood recently released its 2011 2012 annual report indicating this non profit government funded (over $500 million) performed a record high 333,964 abortions during 2011. – 92 percent of Planned Parenthood’s pregnant clients received abortions – Prenatal care patients accounted for 7 seven percent – Adoption referrals were less than one percent.","date":"2013-01-14","mins":"9:28 am","url":"https://shroudstory.com/2013/01/11/living-free-the-thomas-aquinas-and-pierre-teilhard-de-chardin-part/","cat":"uncategorized","title":"Living Free: The Thomas Aquinas and Pierre Teilhard de Chardin Part"},{"id":"comment-34673","author":"andy_weiss","post":"Since not everyone can see the supposed coins on the eyes, you’d have to come up with an objective way to measure values that would prove this. I cannot imagine how this would be done, but while I cannot see the coins on the eyes, one certainly cannot use Enrie’s photos since they do not show what is really there but are enhanced and actually lose image information in the enhancement..","date":"2013-05-24","mins":"5:09 pm","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","title":"Max thinks I’m a half-blind arch-skeptic"},{"id":"comment-11526","author":"andy_weiss","post":"Yes, I agree, bravo daveb! The Vulgate in e Sword provides the following: Acts 12:7 is manibus & John’s passage is as follows: Joh 20:25 dixerunt ergo ei alii discipuli vidimus Dominum ille autem dixit eis nisi videro in manibus eius figuram clavorum et mittam digitum meum in locum clavorum et mittam manum meam in latus eius non credam Joh 20:26 et post dies octo iterum erant discipuli eius intus et Thomas cum eis venit Iesus ianuis clausis et stetit in medio et dixit pax vobis Joh 20:27 deinde dicit Thomae infer digitum tuum huc et vide manus meas et adfer manum tuam et mitte in latus meum et noli esse incredulus sed fidelis The nails in the wrists not agreeing with sigmatist’s wounds has nothing to do with the issue, unless of course you believe the stigmata is intended to be an exact representation of the wounds of Christ. I would reject that interpretation as nonsensical. Otherwise they would have wounds at the base of the palm into the wrist on the back. Yet the Greeks considered the entire thing the wrist. Where’s the difficulty understanding that?.","date":"2012-05-21","mins":"8:06 pm","url":"https://shroudstory.com/2012/05/21/medjugorje-and-the-shroud-and-what-mark-shea-wrote/","cat":"news_&_views","title":"Medjugorje and the Shroud and What Mark Shea Wrote"},{"id":"comment-11527","author":"andy_weiss","post":"As far as Mr. Shea poo pooing the Međugorje apparitions, is he aware the Communists were actually instrumental in spreading deceit and lies concerning this? This would speak volumes for me about the event..","date":"2012-05-21","mins":"8:10 pm","url":"https://shroudstory.com/2012/05/21/medjugorje-and-the-shroud-and-what-mark-shea-wrote/","cat":"news_&_views","title":"Medjugorje and the Shroud and What Mark Shea Wrote"},{"id":"comment-67539","author":"andy_weiss","post":"Merry Christmas!.","date":"2013-12-25","mins":"12:37 pm","url":"https://shroudstory.com/2013/12/24/merry-christmas/","cat":"news_&_views","title":"Merry Christmas"},{"id":"comment-40901","author":"andy_weiss","post":"Dan ~ Please remove the link to the private subscribers page..","date":"2013-08-10","mins":"11:43 am","url":"https://shroudstory.com/2013/08/10/more-on-the-shroud-affair/","cat":"crowdfunding","title":"More on The Shroud Affair"},{"id":"comment-16683","author":"andy_weiss","post":"I simply find the subject fascinating and have been touched by my own studies, little though they may be when compared to others..","date":"2012-09-21","mins":"11:04 am","url":"https://shroudstory.com/2012/09/20/mount-everest-is-only-29000-feet-high/","cat":"news_&_views","title":"Mount Everest is only 29,000 feet high"},{"id":"comment-13347","author":"andy_weiss","post":"Do you mean smug? I find it useless to insult others who differ from me. My response here is probably something he will not read, but his responses to my post would be interesting. Be he fully intelligent or full of himself, that would become clear from an exchange of ideas. I enjoy intelligent conversations, even with those with whom I disagree..","date":"2012-07-02","mins":"8:02 pm","url":"https://shroudstory.com/2012/06/28/noahs-ark-the-shroud-of-turin-and-the-grand-canyon/","cat":"news_&_views","title":"Noah’s Ark, the Shroud of Turin and the Grand Canyon"},{"id":"comment-13148","author":"andy_weiss","post":"This is an interesting article and I find that the short quotation from Mr. Coyne provided shows some glaring errors for the following response for you, Dan, and perhaps him if he is interested. 1. Sure some fringe elements in Christianity expect perhaps to prove the existence of God through the rediscovery of Noah’s ark, for example. 2. Concerning the Shroud, with what I know of it, I understand that it is not possible to prove that the image is of Jesus of Nazareth, yet there is much evidence to support that thesis. There is a world of difference between evidence and proof and I speak of the Shroud’s evidence. We do not have his DNA for comparison, no driver’s license, dental records or any other way to positively identify Jesus as the man on the cloth with 100% certainty. There are similarities that are uncanny between the image of the man on the linen and the records of what was done to Jesus of Nazareth, the King of the Jews. But aside from these kinds of things about which Mr. Coyne could read up, I have something else to offer. I consider the affect the Shroud has had on those who study it and I offer that as interesting evidence. One can read my own reflection on its affect on my own life at http://shroudnm.com/, “Why is the Shroud important?,” in either English or Spanish. Shroud.com also has some great Shroud researchers (I do not include myself in that list, but am more of a generalist and am unsure I have an expertise that I could offer in its study) and their own experiences with the Shroud. I have heard the effect it has had on some of my friends such as Barrie Schwortz, Dr. John Jackson, Dr. Petrus Soons, Pete Schumacher and Larry Schauff. I would suggest to Mr. Coyne that he should consider this evidence in his calculations concerning this linen cloth if he chooses. There’s no doubt he might find that study of interest. 3. There have been healings and other evidences of inexplicable “miraculous” cures that he perhaps is unaware. There is a lady in Italy who has no corneas, yet can see. I would love to hear a rational explanation for this inexplicable event in this woman’s life. 4. I can state unequivocally that my prayers have been answered over my years. But I am unsure that Mr. Coyne can test those in a lab or in reason, yet I have no doubt whatever what has happened in my life. The mere fact that I remain vertical and breathing is proof there is a God, in my estimation. I can cite several instances in my life from which I should not have been able to recover, yet I am still here living on this patch of earth. 5. There are things that exist, such as the winding staircase in a decommissioned church in Santa Fe, NM which was built and is a marvel. No one knows who built it and it is built using techniques that are perhaps uncommon to human engineering. There are no nails. (I am not an engineer, so I cannot claim these methods are unknown.) If I were to posit “proof” for the existence of God (which I would not do anyway since I prefer evidence), I would offer the complexity of the human body, the complexity of the earth and all its preciseness and the truth of the Big Bang and the expanding universe and its implication that in order to have a big bang, logically there has to have been a first cause..","date":"2012-06-28","mins":"2:35 pm","url":"https://shroudstory.com/2012/06/28/noahs-ark-the-shroud-of-turin-and-the-grand-canyon/","cat":"news_&_views","title":"Noah’s Ark, the Shroud of Turin and the Grand Canyon"},{"id":"comment-19842","author":"andy_weiss","post":"The National Catholic Reporter is not known for its excellence in journalism or Catholicism. This kind of story is useless. God is not calling women to ordination..","date":"2012-12-04","mins":"9:28 pm","url":"https://shroudstory.com/2012/12/04/national-catholic-reporter-ordain-women-as-priests/","cat":"off_topic","title":"National Catholic Reporter: Ordain Women as Priests"},{"id":"comment-21961","author":"andy_weiss","post":"Great. Thanks Dan..","date":"2013-01-13","mins":"12:08 pm","url":"https://shroudstory.com/2013/01/13/now-free-to-public/","cat":"uncategorized","title":"Now Free to Public"},{"id":"comment-38132","author":"andy_weiss","post":"A welcome change, Dan. You ought to take that approach with everyone when you notice ad hom attacks..","date":"2013-06-26","mins":"8:38 pm","url":"https://shroudstory.com/2013/06/26/personal-attacks-on-others/","cat":"news_&_views","title":"Personal Attacks on Others"},{"id":"comment-22577","author":"andy_weiss","post":"Correct me if I am misreading this, but it sounds like an educated way to say one should approach religion cafeteria style: take what one wants and ignore or dispose of the rest. This is completely illogical. If the religion is worth anything, one cannot just take a religion piecemeal because it ought to be integral – everything in the religion should fit together. If it doesn’t, it isn’t much of a religion..","date":"2013-01-24","mins":"9:31 pm","url":"https://shroudstory.com/2013/01/23/philosophy-the-way-of-the-agnostic-and-the-shroud/","cat":"news_&_views","title":"Philosophy: The Way of the Agnostic (and the Shroud)"},{"id":"comment-16685","author":"andy_weiss","post":"Just because someone ‘found’ a papyrus is completely meaningless. From where did it come? When & by whom was it written? It is a fact that there were many specious writings n the first 3 4 centuries of the Church. That’s the precise reason why it was the Church which canonized (selected and identified) Scripture as early as the 360s and as late as the early 400s. Theologically and historically speaking, this ‘find’ means nothing..","date":"2012-09-21","mins":"11:13 am","url":"https://shroudstory.com/2012/09/21/really-we-must-come-to-god-by-faith-not-by-sight/","cat":"news_&_views","title":"Really? We must come to God by faith, not by sight?"},{"id":"comment-20278","author":"andy_weiss","post":"I am interested in the Shroud on many levels. The brightness encoding that translates to depth. The gruesome image with it’s historical congruence with what is said to be a Roman crucifixion. The interesting historical tracing of Wilson. The blood studies of Adler. The forensics of Zugabie, etc. The congruence of the biblical story with the Shroud. It is not doubt that causes me to look at the Shroud and wonder. It is the wonders of the Shroud that make my faith more relevant to me and the world around me. Perhaps that is the core reason why there is so much doubt about things that have already been established about the Shroud. M. Yves Delage the Atheist & Barrie Schwortz the Jew are honest to admit they believe in the authenticity of the Shroud based upon the scientific evidence. Makes me wonder if those who refuse are not doing so not from scientific evidence but from some other reason..","date":"2012-12-12","mins":"9:23 am","url":"https://shroudstory.com/2012/12/12/reading-the-shroud-backwards/","cat":"news_&_views","title":"Reading the Shroud Backwards"},{"id":"comment-17257","author":"andy_weiss","post":"I wasn’t aware Rogers did this study on the Sudarium. Thanks for that information, Gabriel. I will go to the one source who will probably know: Barrie Schwortz and will let you know what I find. Perhaps Guscuin’s work was the first on the Sudarium in English. I would like to get that as I told Mark a couple days ago after being introduced to him by Yannick. There have been others since such as Janice Bennett’s work, referenced here #3 (http://shroudnm.com/docs/SEAM Turin Shroud Presentation References.pdf) published in 2001 in English. I have used this information in my talks on the Shroud since reading this most delightful book..","date":"2012-10-06","mins":"9:09 am","url":"https://shroudstory.com/2012/10/06/relic-authenticates-shroud-of-turin/","cat":"news_&_views","title":"Relic authenticates Shroud of Turin?"},{"id":"comment-17259","author":"andy_weiss","post":"Check out this interesting article spurred on by a search for Mark Guscuin’s book originally from “Ireland’s Own” magazine. Http://www.mysticsofthechurch.com/2010/03/sudarium of oviedo and shroud of turin.html.","date":"2012-10-06","mins":"9:19 am","url":"https://shroudstory.com/2012/10/06/relic-authenticates-shroud-of-turin/","cat":"news_&_views","title":"Relic authenticates Shroud of Turin?"},{"id":"comment-17260","author":"andy_weiss","post":"Gabriel ~ Is this the paper you are looking for? http://www.shroud.com/pdfs/rogers9.pdf I found it using http://shroudnm.com/search.html to search Shroud.com. If not, I’ll e mail or better yet call Barrie..","date":"2012-10-06","mins":"9:26 am","url":"https://shroudstory.com/2012/10/06/relic-authenticates-shroud-of-turin/","cat":"news_&_views","title":"Relic authenticates Shroud of Turin?"},{"id":"comment-17261","author":"andy_weiss","post":"I was humorously thinking Colin Berry wouldn’t like this since he obviously has no respect for Ray Rogers. Ray was known for being politically incorrect. Who would be more politically incorrect, Ray or Colin?.","date":"2012-10-06","mins":"9:28 am","url":"https://shroudstory.com/2012/10/06/relic-authenticates-shroud-of-turin/","cat":"news_&_views","title":"Relic authenticates Shroud of Turin?"},{"id":"comment-17262","author":"andy_weiss","post":"To my mind, this proves to anyone who is even partially objective that the NY Times and the Washington Post are biased anti Christian rags not worth the paper they are printed on, be that physical or electronic. And people ask me why I ignore these publications!.","date":"2012-10-06","mins":"9:32 am","url":"https://shroudstory.com/2012/10/06/rutler-the-mainstream-media-falls-for-the-latest-hoax/","cat":"news_&_views","title":"Rutler: The Mainstream Media Falls for the Latest Hoax"},{"id":"comment-17204","author":"andy_weiss","post":"Here’s a clue. When they start talking about Jesus’ wife, roll your eyes. This is so tired as to not be worth responding..","date":"2012-10-03","mins":"10:02 pm","url":"https://shroudstory.com/2012/10/03/rolling-my-eyes-the-news-cycle-of-jesus-wife/","cat":"news_&_views","title":"Rolling My Eyes: The News Cycle of Jesus’ Wife"},{"id":"comment-17342","author":"andy_weiss","post":"Louis : Why didn’t Rogers write more on what he called “different kinds of radiation”? That would be impossible to answer unless Ray left us one before he passed away..","date":"2012-10-08","mins":"6:28 pm","url":"https://shroudstory.com/2012/10/06/relic-authenticates-shroud-of-turin/","cat":"news_&_views","title":"Relic authenticates Shroud of Turin?"},{"id":"comment-38694","author":"andy_weiss","post":"At times that respect and freedom are not wanted by many because they have their conclusion and try to fit the study into the conclusion, like putting the cart in front of the horse..","date":"2013-07-07","mins":"9:46 am","url":"https://shroudstory.com/2013/07/07/saint-john-paul-ii-and-the-shroud-of-turin/","cat":"news_&_views","title":"Saint John Paul II and the Shroud of Turin"},{"id":"comment-18704","author":"andy_weiss","post":"I have friends and family up and down the coast from Florida to Rhode Island. I certainly understand..","date":"2012-11-01","mins":"8:05 am","url":"https://shroudstory.com/2012/11/01/sandys-effect-on-this-blog/","cat":"off_topic","title":"Sandy’s Effect on this blog"},{"id":"comment-15034","author":"andy_weiss","post":"Or one could use our expanded search capability http://shroudnm.com/search.html. This gives the user a choice of a variety of Shroud sites. The person just selects the radio button to the left of the site they want to search, enter the search criteria and click search (or press enter). Using this will provide a search of only the site you selected since there are many sites that do not have search capabilities and permits you to limit results to see what each site has for what you are looking..","date":"2012-08-15","mins":"7:31 pm","url":"https://shroudstory.com/2012/08/15/searching-the-blog/","cat":"news_&_views","title":"Searching the Blog"},{"id":"comment-13109","author":"andy_weiss","post":"Sounds like the writer’s conclusion is if he’s a Catholic priest, he could not possibly be right, no matter what he says. Impressive argument. I’ve heard the claim and it may or may not be true. Honestly I have not put too much time into learning about that. Most assuredly, the authenticity of the Shroud does not rest on this claim, be it true or not. This is actually secondary or tertiary to the issue of the authenticity of the Shroud and interesting as it might be..","date":"2012-06-27","mins":"2:01 pm","url":"https://shroudstory.com/2012/06/27/shroud-of-turin-why-no-proof-can-ever-suffice/","cat":"news_&_views","title":"Shroud of Turin: Why No Proof Can Ever Suffice"},{"id":"comment-19361","author":"andy_weiss","post":"“I think I see” just simply isn’t enough to elicit interest. Even more so when using the Enrie images since they are pushed contrast images that distorted the image to make it clearer..","date":"2012-11-22","mins":"10:21 am","url":"https://shroudstory.com/2012/11/22/sinister-clowns-in-the-shroud-of-turin-burn-marks/","cat":"uncategorized","title":"Sinister Clowns in the Shroud of Turin Burn Marks"},{"id":"comment-21959","author":"andy_weiss","post":"Max Patrick Hamon : Typo: “it might have been dismissed long ago as a MICHEY MOUSE THEORY”. That would Be MICKEY, not MICHEY, Max..","date":"2013-01-13","mins":"11:30 am","url":"https://shroudstory.com/2013/01/12/stop-taking-cudgels-to-each-other/","cat":"news_&_views","title":"Stop taking cudgels to each other?"},{"id":"comment-21960","author":"andy_weiss","post":"Good to see Colin is willing to be nearly reasonable. That’s an excellent start. As to his expertise, I have no idea what his specialty is, though his statements reveal he believes he is more expert in a wider variety of subjects. That only means he has lots of opinions. Don’t we all..","date":"2013-01-13","mins":"11:49 am","url":"https://shroudstory.com/2013/01/12/stop-taking-cudgels-to-each-other/","cat":"news_&_views","title":"Stop taking cudgels to each other?"},{"id":"comment-19688","author":"andy_weiss","post":"It is certainly not evidence of the authenticity of the cloth. No doubt about that. But there is a preponderance of evidence for the authenticity and not much against it. We certainly need a theory or theories that fit all the data. Agreed anoxie. No pet theories will work..","date":"2012-11-30","mins":"3:14 pm","url":"https://shroudstory.com/2012/11/30/strong-ignorance-is-not-strong-evidence/","cat":"news_&_views","title":"Strong ignorance is not strong evidence"},{"id":"comment-23126","author":"andy_weiss","post":"There’s no sleeping when one is correcting another on the internet about anything. That’s a good old one, Dan..","date":"2013-01-31","mins":"10:30 pm","url":"https://shroudstory.com/2013/01/31/teaser-of-the-day-front-and-back-images-show-almost-the-same-color-intensity-or-do-they/","cat":"teaser_of_the_day","title":"Teaser of the Day: Front and back images show almost the same color intensity. Or do they?"},{"id":"comment-23172","author":"andy_weiss","post":"I would say the following… The appearance of the image on the cloth resembles the characteristics of a photo negative in some ways and a negative view of the image appears to have photo positive characteristics in some ways, but color is not one of the resemblances. In terms of a photograph of the Shroud, a positive looks similar to a negative and a negative looks similar to a positive. Both have some characteristics of reverse photos but are obviously not photos. The coloring of positive and negative views of the Shroud image appear reversed from the normal coloring of a photo if one can overlook the coloration the cloth gives the image..","date":"2013-02-01","mins":"2:11 pm","url":"https://shroudstory.com/2013/02/01/teaser-of-the-day-under-the-guise-of-being-an-objective-established-observation/","cat":"teaser_of_the_day","title":"Teaser of the Day:  Under the guise of being an objective “established” observation."},{"id":"comment-73345","author":"andy_weiss","post":"Meacham’s paper is quite interesting. We have it in PDF here: http://shroudnm.com/docs/2010 02 24 Shroud Restoration Eval.pdf.","date":"2014-01-14","mins":"8:26 pm","url":"https://shroudstory.com/2014/01/14/the-questionable-restoration-of-the-shroud-of-turin/","cat":"news_&_views","title":"The Questionable Restoration of the Shroud of Turin"},{"id":"comment-13110","author":"andy_weiss","post":"Now that is good humor…:o).","date":"2012-06-27","mins":"2:03 pm","url":"https://shroudstory.com/2012/06/27/the-poetic-skepticism-of-russell-blackford/","cat":"news_&_views","title":"The Poetic Skepticism of Russell Blackford"},{"id":"comment-35057","author":"andy_weiss","post":"Thanks Larry. Very interesting indeed..","date":"2013-05-27","mins":"6:39 pm","url":"https://shroudstory.com/2013/05/26/the-shroud-of-turin-exhibit-museum-in-alamogordo/","cat":"news_&_views","title":"The Shroud of Turin Exhibit & Museum in Alamogordo"},{"id":"comment-35158","author":"andy_weiss","post":"I’m not a big fan of “I think I see.” Some sort of objective measurement would go a long way, but I have yet to read anything that includes this kind of study. Max?.","date":"2013-05-28","mins":"9:26 pm","url":"https://shroudstory.com/2013/05/28/the-vagaries-of-human-visual-perception-and-individual-judgment/","cat":"news_&_views","title":"The vagaries of human visual perception and individual judgment"},{"id":"comment-35159","author":"andy_weiss","post":"Dan ~ Would you please update the phone number in your re posting from (575) 446 2113 to (575) 415 5206? Thanks if you’d be so kind. That old number no longer is being used and has been turned off. That’s what Pete was requesting above..","date":"2013-05-28","mins":"9:30 pm","url":"https://shroudstory.com/2013/05/26/the-shroud-of-turin-exhibit-museum-in-alamogordo/","cat":"news_&_views","title":"The Shroud of Turin Exhibit & Museum in Alamogordo"},{"id":"comment-72728","author":"andy_weiss","post":"You may want to consider USB drive. You can get a 16 GB for almost nothing which holds twice what a dual layer DVD does. I went on our site one day to do some updates and it was not there. It was not a hacker, but the provider had performed server maintenance and inadvertently wiped out our site. If I didn’t make some changes, it would have been operational again in the amount of time it takes to upload everything. Offline backup is essential in this connected world..","date":"2014-01-09","mins":"9:21 am","url":"https://shroudstory.com/2014/01/09/they-dont-do-it-just-for-the-credit-card-numbers/","cat":"uncategorized","title":"They don’t do it just for the credit card numbers"},{"id":"comment-48467","author":"andy_weiss","post":"According to Dr. Petrus Soons and other medical experts such as radiologists and doctors I have personally spoken to who have come to our museum from the local hospital, there are absolutely no broken bones on the body, contrary to some who claim so. The cartilage is separated from the bone in the nose, not broken..","date":"2013-10-22","mins":"8:46 pm","url":"https://shroudstory.com/2013/10/22/todays-how-do-we-know-the-mans-bones-were-not-broken/","cat":"how_do_we_know","title":"Today’s How do we know: the man’s bones were not broken"},{"id":"comment-17787","author":"andy_weiss","post":"If the doctype is any indication, this comes from facebook….","date":"2012-10-18","mins":"7:49 am","url":"https://shroudstory.com/2012/10/18/top-10-relics-of-christ/","cat":"news_&_views","title":"Top 10 Relics of Christ?"},{"id":"comment-17788","author":"andy_weiss","post":"Html xmlns:og=”http://opengraphprotocol.org/schema/” xmlns:fb=”http://www.facebook.com/2008/fbml” lang=”en”.","date":"2012-10-18","mins":"7:50 am","url":"https://shroudstory.com/2012/10/18/top-10-relics-of-christ/","cat":"news_&_views","title":"Top 10 Relics of Christ?"},{"id":"comment-42707","author":"andy_weiss","post":"Sorry Dan. Barrie told me it was a link to the sign up page. My apologies..","date":"2013-09-02","mins":"7:11 pm","url":"https://shroudstory.com/2013/08/31/update-to-shroud-com-2/","cat":"news_&_views","title":"Update to Shroud.com"},{"id":"comment-42575","author":"andy_weiss","post":"Dan ~ Please remove the private subscriber’s page link. Thanks. ~Andy.","date":"2013-09-01","mins":"10:27 am","url":"https://shroudstory.com/2013/08/31/update-to-shroud-com-2/","cat":"news_&_views","title":"Update to Shroud.com"},{"id":"comment-42706","author":"andy_weiss","post":"Do you have the script that provides that capability?.","date":"2013-09-02","mins":"7:09 pm","url":"https://shroudstory.com/2013/08/31/update-to-shroud-com-2/","cat":"news_&_views","title":"Update to Shroud.com"},{"id":"comment-51516","author":"andy_weiss","post":"Hardly complimentary. Either you are doing something really good or really bad, Dan. You choose..","date":"2013-11-15","mins":"6:55 pm","url":"https://shroudstory.com/2013/11/15/vinny-the-mystery-of-the-shroud-of-turin-has-been-solved/","cat":"tinfoil_hats","title":"Vinny: The mystery of the Shroud of Turin has been solved"},{"id":"comment-33626","author":"andy_weiss","post":"I cannot comprehend how this is possible since no one knows for certain whose image in on the Shroud. Further, since the DNA is degraded, how do they propose to even test anything? Good answer Dave..","date":"2013-05-13","mins":"10:03 pm","url":"https://shroudstory.com/2013/05/12/what-else-doth-passeth-all-understanding/","cat":"humor","title":"What Else Doth Passeth All Understanding?"},{"id":"comment-12140","author":"andy_weiss","post":"Thanks Dan. I took a snippet (enough to arouse the curiosity) of your explanation with links to your blog and to Mario’s great work in our multimedia library (http://shroudnm.com/library.html)..","date":"2012-06-10","mins":"9:17 am","url":"https://shroudstory.com/2012/06/10/useful-and-fun-the-absolutely-fantastic-shroud-scope-tool/","cat":"news_&_views","title":"Useful and Fun: The Absolutely Fantastic Shroud Scope Tool"},{"id":"comment-65594","author":"andy_weiss","post":"Awesome, but why is it on a Shroud blog?.","date":"2013-12-23","mins":"9:08 am","url":"https://shroudstory.com/2013/12/23/what-hath-the-internet-wrought-dont-forget-the-links/","cat":"off_topic","title":"What Hath the Internet Wrought?  Don’t Forget the Links"},{"id":"comment-15574","author":"andy_weiss","post":"I think I see…Bullwinkle and Rocky on the Shroud!.","date":"2012-08-29","mins":"6:40 pm","url":"https://shroudstory.com/2012/08/29/what-if-joseph-of-arimathaeas-laundry-mark-was-found-on-the-shroud/","cat":"news_&_views","title":"What if Joseph of Arimathaea’s laundry-mark was found on the shroud"},{"id":"comment-16886","author":"andy_weiss","post":"The point, I believe, is the piece of cloth doesn’t even come close to anything authentic in the Christian tradition of any stripe. Before this was written, we have a clear Christian canon from the 360s through the early 400s, everything else being regarded as good pious writings (but not Scripture) through heresy. Even if it were proven authentic writing, it would an authentically heretical writing, at best, from a Catholics vantage point. It would prove what we already know without doubt. Why is that so amazing?.","date":"2012-09-25","mins":"12:26 am","url":"https://shroudstory.com/2012/09/24/when-asses-flew/","cat":"news_&_views","title":"When Asses Flew"},{"id":"comment-73267","author":"andy_weiss","post":"Are you saying, Dave, that the use of relics in Christianity does not come from itself but from practices of other religions?.","date":"2014-01-13","mins":"11:32 pm","url":"https://shroudstory.com/2014/01/13/when-is-a-relic-not-a-relic/","cat":"news_&_views","title":"When is a relic not a relic?"},{"id":"comment-73268","author":"andy_weiss","post":"Thanks for the credit, Dan. Unsure I deserve it, though. Your questions are interesting inasmuch as Christian relics have been treated the same since the first century, I would assert, so all Christians ought to respect, honor and imitate that treatment..","date":"2014-01-13","mins":"11:35 pm","url":"https://shroudstory.com/2014/01/13/when-is-a-relic-not-a-relic/","cat":"news_&_views","title":"When is a relic not a relic?"},{"id":"comment-52265","author":"andy_weiss","post":"Seems to me the Shroud was and is explored just when we have enough matured science, etc. To really dig into this subject as, ironically, the matured world is also extremely skeptical and has difficulty with the concept of faith, which, in fact, is not antithetical to science..","date":"2013-11-21","mins":"9:19 am","url":"https://shroudstory.com/2013/11/21/where-to-begin-first-pour-two-cups-of-coffee-or-a-full-pint-or/","cat":"uncategorized","title":"Where to begin?  First pour two cups of coffee or a full pint or . . ."},{"id":"comment-14478","author":"andy_weiss","post":"Congratulations Dan. I have been enjoying this blog and all the stuff you post is most interesting. Thank you..","date":"2012-08-04","mins":"10:43 am","url":"https://shroudstory.com/2012/08/04/while-you-were-sleeping-a-million-page-views/","cat":"news_&_views","title":"While you were sleeping: A million page views"},{"id":"comment-72586","author":"andy_weiss","post":"Nice looking page. Also check out http://shroud4kids.com/..","date":"2014-01-08","mins":"8:55 am","url":"https://shroudstory.com/2014/01/08/wonderful-pam-moons-new-shroud-of-turin-exhibition-website/","cat":"news_&_views","title":"Wonderful:  Pam Moon’s  New Shroud of Turin Exhibition Website"},{"id":"comment-57972","author":"andy_weiss","post":"Ooooh, the shroud of duckie…:o).","date":"2013-12-11","mins":"9:18 am","url":"https://shroudstory.com/2013/12/11/yeah-thats-how-it-all-starts/","cat":"humor","title":"Yeah, that’s how it all starts."}]
