[{"title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?","post":"Hi Eddie (and Colin, again!),\nI didn’t know this site was still alive until tracking it down again via Colin’s latest comment on shroud story.com. In its heyday I was a keen contributor, and a number of well informed people also took part, although there was sporadic acrimony. If you were interested you could do worse than start at the beginning (https://shroudofturinwithoutallthehype.wordpress.com/2012/page/12/) and follow it through, especially the comments. That was how I rejoined mainline shroud research after several years of neglect.\nAs to the Mark 1/Mark 2 hypothesis. There is much to be said for it. However, it doesn’t adapt well to an ‘evidence for versus evidence against’ kind of trial, so just consider what follows as a fairly off-th-cuff collection of ideas thrown into the meting pot!\nThe shroud does look like something left behind after something else has gone. I have a piece of Indonesian batik framed on my wall. Although I have no intention of taking it apart, I wonder if, if the covering glass and the batik was removed, there might be some sort of image on the paper backing? The vague appearance of the shroud image owes much to its faintness, its monochromaticity, and its superficiality, all characteristics that could be a result of it being either a backing cloth, or a deliberate transfer experiment of some kind.\nSo what might have been Mark 1, and what happened to it? Perhaps a medieval painting. Might the pigment have remained on the original and the solvent stained the backing? Was it destroyed in the 1532 fire? Destroyed by accident elsewhere? Destroyed deliberately when it was discovered that the ‘backing’ was more ‘realistic’? Or separated from the backing, only to turn up a few years later as the Shroud of Besançon?\nOr was Mark 1 an original relic, which, as you suggest finally deteriorated to the point of falling part, leaving the backing? Of course that opens the can of worms which even authenticists can’t agree on, namely how the Mark 1 image was made, whether the shroud was wrapped, draped or horizontal over the body, and so on.\nAs for the C-14 date, doubts about its accuracy fall into three general areas. The first suggestion was contamination by oil, paint, smoke, grime, fibres from vestments, a ‘bioplastic’ coating, bacteria, etc. etc. This has largely been discredited even by authenticists; it is clear that all this extraneous gunk would have been completely washed away by the cleaning processes carried out by the labs. The current argument is about the possibility that the sample was actually made of 16th century interpolation, either a patch or a clever reweaving. It would mean that about 70% of the C-14 sample was new, and only 30% original. It’s a sensible idea, but it seems unlikely that such an interpolation would be completely invisible, even after intense scrutiny. The final idea is that the original cloth somehow had its C-14 content changed. Apart from wild speculation, two proper experiments have been carried out. The first did demonstrate that intense neutron radiation can indeed change C-12 to C-14 in a piece of cloth. Whether this was likely as a feature of the resurrection is question of religious faith rather than science. A more realistic experiment, to find out if ‘modern’ carbon monoxide could be incorporated into an ‘ancient’ cloth during an episode of intense heat, thus changing the C-14 proportion, was a complete failure.\nFinally – the naked Jesus. Well why not? Most medieval paintings of the resurrection show him naked, albeit with the odd wisp of random material to prevent sacrilege. The ‘physics of the supernatural’ is to me a complete oxymoron, but some people speculate. Jesus almost literally exploded in a nuclear blast (mysteriously leaving the rest of Jerusalem intact) and reappeared in a completely different assemblage of matter elsewhere, with or without clothing. Jesus simply miraculously ‘healed,’ woke up, drew aside the bedclothes and walked out (naked or draped in a spare bit of gravecloth). Jesus suddenly dematerialised, leaving a body-shaped vacuum which collapsed with an audible pop, the shroud falling down through the space, and then reappeared elsewhere, in whichever form he chose. All good fun. Other scenarios are possible.\nThat should give you food for thought!\n","date":"August 20, 2013 at 10:29 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","id":"comment-2250","author":"Hugh Farey","site":"colinberry"},{"title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?","post":"Hello again Eddie (and welcome back Hugh)\nThere’s really not a lot I can add to Hugh’s detailed reply – and I’m not sure there’s a great deal I could have said anyway, having no ready shoot-down-out-of the-sky-in-flames answers to hand.\nAll I would say is that science proceeds best from the facts, especially the ones that have curious unexplained oddities that no-one else has seen fit to pursue.\nLike for example: the Shroud image is said to be highly superficial. 200nm is the figure that is usually quoted, which is a guesstimate (odd that it’s  not known with greater precision, and still depends on that Rogers experiment with the sticky tape where he says he cannot see the ghosts in cross-section – the latter being the yellow “coating” on the fibres after the fibres are pulled away from adhesive, and must therefore be thinner than the smallest wavelength in visible light). Let’s take 200nm as the thickness. Is that really a starch-coating as Rogers claimed, quoting (or misquoting) Pliny and with scarcely a shred of experimental evidence to support that assumption. Suppose Rogers were correct and it was a sizing coat of starch. Then you would not expect a chemical reaction on that coating to affect the mechanical strength of the thread.  But we are told that image-bearing fibres are mechanically-weaker than non-image fibres – they  break more easily. Why should that be? There is an alternative to the image being in an added coating. It might be intrinsic to the fibre itself, needing no starch. That is most likely to be the primary cell wall of flax fibres. While I have no definite information re their thickness, 200nm seems the right ball park, which is still exceedingly thin, compared with the diameter of the entire fibre. So it’s still uncertain why chemical change in so thin a surface layer, comprising a mix of non-crystalline cellulose and hemicelluloses.\nMechanical weakening  suggests that the image fibres must have weakened cellulose cores as well, not enough to be visible, and not enough (according to Rogers) to disturb their crystallinity as judged by birefringence under cross-polaroids.\nWell, my hunch is that has to be some subtle kind of damage to weaken the entire fibres, and if that’s the case then it was caused by something that did more than leave its signature purely on a 200nm surface coating. That would tend to rule out any mild chemical agents that came into contact with the linen. Thus my focus in the past on scorching, where that term has been seen mainly in terms of thermally-induced pyrolysis, i.e. chemical dehydration of carbohydrates. But there are other ways of producing chemical dehydration, for example by contact with dilute involatile acids (sulphuric being the best known, though there are others) which become concentrated as the water evaporates, and then able to abstract water chemically from carbohydrates.\nSo while scorching from a heated template is an obvious mechanism, it’s possible to envisage alternative that are a little more subtle. Garlaschelli’s imaginative modelling of  the shroud image used ochre (iron oxide) to capture and imprint the 3D features of real people onto linen, but if you read his paper carefully you’ll see that the ochre-imprinted cloth was subsequently baked in an oven. Hot ochre may have produced local scorching at the points of contact. Or maybe the ochre had acid contaminants that produced a local dehydration/pyrolysis at points of contact, leaving the rest of the linen relatively unscathed.\nThere are entirely different models too, as Hugh has pointed one. One that I’m currently thinking about was the practice of embalming Crusaders who had died in combat and transporting them back to Europe in a preserved state. Might that have generated an image on linen, either during transport or at a later drying-out stage, again via a chemical dehydration mechanism?\nAnyway, I have chuntered on for far too long, and shall now break off to see what kind of flak awaits me on the other websites I frequent. Bye for now.\n","date":"August 20, 2013 at 4:41 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","id":"comment-2251","author":"colinsberry","site":"colinberry"},{"title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?","post":"Hi Colin and Hugh,\n                             Thanks for all your efforts ,it looks like the mystery of the TS will take a long long time to resolve .I still have the very impressive dignified “face” of the Shroud  on the front of a Times magazine from 1978 !It’s always fascinated me ,making me wonder if I was looking at Jesus Christ himself !Eddie.\n","date":"August 20, 2013 at 5:21 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","id":"comment-2252","author":"Edward Wagner","site":"colinberry"},{"title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?","post":"Far from wasting my time, you are providing much food for thought (to say nothing of posing new scenarios to which instant answers do not spring to mind). Give me time, give me time (well, a day or two at least).\n","date":"August 19, 2013 at 9:19 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","id":"comment-2248","author":"colinsberry","site":"colinberry"},{"title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?","post":"“The “original” I’m referring to is the Mark 1 ,the one in Turin being an impression of it ( a “blotting paper”copy of it ) Eddie.”\nThanks for clarifying on that Eddie. But can you describe more fully how and when a blotting paper copy might have been made, why, by whom, the mechanism of image transfer, needing or not needing wet-dabbing  etc etc, and what happened to the Mark 1 original. Without that info it’s difficult to know what to assume, where to start etc etc.\n","date":"August 19, 2013 at 12:29 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","id":"comment-2246","author":"colinsberry","site":"colinberry"},{"title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?","post":"Hi Colin,\n            If the TS cloth is a cloth from the 13th or 14th century as indicated by the radiocarbon dating then the only way,that I can see ,such a detailed image could be produced is by getting a “blotting paper” copy of it from the original (which would at that time be 1300 years old and hence deteriorating )I have no idea how that could have been done .If on the other hand the radiocarbon dating is unsound because of contamination by carbon 14 from smoke sources such as burning cloth or incense ,then the cloth could be a genuine shroud of a scourged and crucified man.( from the 1st century as indicated by the weave of the cloth)Thanks again for replying I hope I’m not bothering you too much .I have no detailed knowledge of the TS and feel as if I’m wasting your time.Eddie.\n","date":"August 19, 2013 at 3:36 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","id":"comment-2247","author":"Edward Wagner","site":"colinberry"},{"title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?","post":"Hello again Eddie. You are certainly keeping me on my toes re the science. \nAre you sitting comfortably? Yes? Then I shall begin. For most chemical reactions, bar a few exotic ones at high temperature involving free atoms or free radicals, then there’s a simple principle that has to be kept in mind. Before one can have a chemical reaction that requires forming new chemical bonds, existing chemical bonds have to be broken. Think of it as a Lego construction kit, not a new one straight out of the box with separate pieces, but the recycling of one construction – a house say – to make a different one – e.g. a ship. There’s some pulling apart to be done first, which in the case of chemical compounds requires energy. The difference is that making new chemical bonds releases energy, which is not modelled with Lego, but is if you use magnets say (they come together with a crash if you bring unlike poles together).\nNow then, if the energy needed to break the existing bonds is greater than the energy released when you form the new ones, then the reaction is endothermic, meaning that heat has to be absorbed from the surroundings for the reaction to proceed. That heat might come from a Bunsen burner say. If on the other hand the energy needed to break existing bonds is less than the energy released when new ones are formed, the reaction is exothermic, releasing heat into the environment.\nThe ice/salt is a special case in which the endothermic reaction can proceed without applying external heat from a Bunsen burner, where the energy comes instead from the warm surrounding air resulting in a drop in temperature system itself, ie. the kinetic energy of the atoms, ions and molecules initially at room temperature. As the energy is abstracted, the particles vibrate or move more slowly, the temperature drops, then later returns to room temperature as heat from the surroundings is absorbed. How can that happen spontaneously (just as well it doesn’t happen often or none of us would be here)? It’s on account of entropy. In some systems the increased disorder or randomness of the products is so much greater than the more ordered nature of the reactants that the reaction proceeds without the need for a Bunsen burner, by abstracting energy from the surroundings (fast moving air molecules etc become slow moving). It is entropy change that determines  whether or not reactions proceed spontaneously. If the overall entropy change of system AND surroundings is positive (more disorder) then yes, the reaction is spontaneous (but may still need a kick start). If negative the reaction is not spontaneous, and will not respond to a kick start. \nThe ice/salt system is a case in point, because there one has ordered solids (ice and salt crystals initially) whereas one has a highly disordered salt solution at the end – liquids with scattered molecules and ions). Hope that helps.\nThe TS a fake?  Possibly,  but I’m more inclined to think it was produced initially as some kind of visual metaphor for a dead hero or martyr (Crusader? Knight Templar?), possibly the victim of death in battle or by burning /slow-roasting at the stake. Maybe it was intended to portray the idea of how  someone taken down from the stake prematurely – dead but not charred – might have left a scorched imprint on both contact sides of an up-and-over burial shroud. The blood could have been added later to morph that Crusader/Templar(?) image into that of the crucified Christ, not necessarily (in the first instance) to “fake” Christ’s burial shroud, so much as to draw a parallel between two martyrs – one 1st century, the founder of Christianity, the other medieval – a soldier of Christ, or alleged heretic who had fallen foul of the Church, whether for doctrinal or other reasons. \nI’m sure I don’t need to remind you of the motives of Philip-the-so-called-Fair of La Belle France for liquidating the Knights Templar, thus filling his coffers to pursue the 100 Years War against the English monarchy. He had papal support for his hideous pogrom, roasting thousands of Templars after having first divested them of their wealth via torture, though some present-day Vatican spokespersons would have us believe otherwise, telling us it was not as simple as that. Well, they would say that, wouldn’t they?\n","date":"August 14, 2013 at 3:48 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","id":"comment-2235","author":"colinsberry","site":"colinberry"},{"title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?","post":"Hi Colin,\n             Thanks for your excellent answer to my question re.endothermic /exothermic reactions and for explaining your belief re. the TS.I’l leave you in peace now! Eddie.\n","date":"August 14, 2013 at 4:26 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","id":"comment-2236","author":"Edward Wagner","site":"colinberry"},{"title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?","post":"Nice talking to you. Feel free to pop by any time Eddie. It’s been interesting to see how you have latched on to the details that are often left unexplained in textbooks.\n","date":"August 14, 2013 at 4:48 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","id":"comment-2237","author":"colinsberry","site":"colinberry"},{"title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?","post":"Hi Colin,\n            I’m taking up your offer to “pop in at any time”,as I was walking to the library to check my e-mails an idea came into my mind concerning the TS .Could the TS be literally an impression of the original? the two cloths being pressed together to form a mirror image of the original on the new cloth.Thanks again for answering all of my e-mails .Eddie.\n","date":"August 18, 2013 at 1:02 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","id":"comment-2243","author":"Edward Wagner","site":"colinberry"},{"title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?","post":"Sorry, not clear what you mean by “the original”. Is that a Mark 1 shroud, the one in Turin being some kind of facsimile, or the 3D subject, human or effigy-like, from whom or which the TS was imprinted via direct body contact?\n","date":"August 18, 2013 at 5:30 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","id":"comment-2244","author":"colinsberry","site":"colinberry"},{"title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?","post":"Hi Colin,\n              The “original” I’m referring to is the Mark 1 ,the one in Turin being an impression of it ( a “blotting paper”copy of it ) Eddie.\n","date":"August 19, 2013 at 12:13 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","id":"comment-2245","author":"Edward Wagner","site":"colinberry"},{"title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?","post":"For those of us who believe that the linen is of 13/14th century provenance, who consider the invisible weaving/patch story to be totally lacking in credibility (intact banding under uv light etc), the question does not arise. Maybe you should put it to the regulars on The Other Site. It would provide yet another bone of contention, for days and days of better-read-than-thou one-upmanship.  \nSpeaking for myself, if I had found myself coming round from a swoon in a rock tomb from which I then wished to escape, reluctantly leaving behind the upmarket herring- bone shroud with my curiously imprinted image (with or without the thought that it would intrigue scholars for millennia, especially if there really were bloodstains under my body image) while still wishing to preserve modesty (until able to lay my hands on, say, some surplus-to-requirements jobbing gardener’s garb) I’d maybe try to fashion something out of those 100lbs of myrrh and aloes, a botanical overkill if ever there was, while trying scrupulously to avoid contact with xerophytic prickles on the more sensitive parts of the anatomy.\n","date":"August 13, 2013 at 2:14 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","id":"comment-2231","author":"colinsberry","site":"colinberry"},{"title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?","post":"Hi Colin,\n             Thanks again for your very witty reply ,I’d like to ask you yet another ,possibly my last, question that has puzzled me over many years .Why is it that in an endothermic reaction the temperature of the reactants  drops (as in the salt-ice mixture reaction) if energy is absorbed from the surroundings ?and then in the Thermit reaction the temperature of the reactants increases with energy being given out from the reactants in the exothermic reaction .(I suspect the answer will involve potential energy but I would really like to finally find out once and for all.) Ps. from your answer above I’ve just realized that you believe the TS to be a fake am I right ? Eddie\n","date":"August 14, 2013 at 1:02 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","id":"comment-2234","author":"Edward Wagner","site":"colinberry"},{"title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?","post":"Hi Colin,\n           I’m taking up your offer to “pop by any time”,as I was walking to the library to check my e-mails an idea came to mind about the TS.Could the TS be literally an impression of the original? the two cloths being pressed together to produce a mirror image on the new cloth .Thanks again for taking the trouble to answer all of my e-mails.Eddie.\n","date":"August 18, 2013 at 12:53 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","id":"comment-2242","author":"Edward Wagner","site":"colinberry"},{"title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?","post":"Sorry Eddie, but I can’t help with the “jump” problem. But there’s a twist to the quantized mass problem,  not so much at the very small end of the range, but at the very large where one might least expect it. While the neat provision of mass in single atoms and molecules can be viewed as “quantization”, that is mass that is at rest, i.e. with zero velocity, relative to other mass in the neighbourhood,  what about relativistic mass, you know, the kind that photons have by virtue of velocity? What about the additional exponential increase in mass that a body acquires as it approaches the speed of light? It could well be that the extra relativistic mass is added in discrete quanta. \nGlad to see I have still not stunned you into silence with my scratch-the-surface musings, as I did the other day when I inflicted my Theory of Everything onto Guardian readers.\nhttp://www.theguardian.com/science/2013/aug/06/higgs-boson-physics-hits-buffers-discovery#comment-25803748\n","date":"August 9, 2013 at 10:43 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","id":"comment-2221","author":"colinsberry","site":"colinberry"},{"title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?","post":"Hi Colin ,\n            Thanks for the reply ,I must admit I never thought of relativistic mass !I have to pick up my beautiful daughter and beautiful grand-daughter very soon so I can’t write everything that I would like to .Relativistic mass is equal to the rest mass times one over the square root of 1-(the velocity squared over the the velocity of light squared) and hence if velocity is not quantised the relativistic mass would also not be quantised .Ps. very impressed with your Guardian comments/contributions .PPs.can I ask you questions about ancient Egypt?\n","date":"August 9, 2013 at 3:22 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","id":"comment-2222","author":"Edward Wagner","site":"colinberry"},{"title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?","post":"Ancient Egypt? A bit of a far cry from physics, but closer to the TS. I’m all ears, but you may be dismayed to discover how little there is between those ears on this particular topic.\nNow go and do your grandfatherly duties. My 3 year old grandaughter, having spotted me yesterday making small talk with her father, enquired of my wife out of earshot if her (own) Dad and I were sort of friends with each other.\n","date":"August 9, 2013 at 3:41 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","id":"comment-2223","author":"colinsberry","site":"colinberry"},{"title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?","post":"Hi Colin,\n             I have a few questions but I’d like to start with this one .Why during the 5000 years of the Ancient Egyptian civilization not one pyramid was depicted in any of their paintings? Thanks again for your early replies .I’m not used to getting rapid replies from anyone .I sent an e-mail to Classic fm to inform them of the correct pronunciation of Polish composers names but never got a reply .All they have to do is pronounce “i” as “ee”and “w” as “v”.Ps. your granddaughter ( I can’t believe it’s a double “d”) asked a very interesting question ,she must be a very clever girl! Eddie.\n","date":"August 11, 2013 at 12:08 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","id":"comment-2227","author":"Edward Wagner","site":"colinberry"},{"title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?","post":"One thing I learned while at the University of Wikipedia (5 minutes ago) was the following::\nDuring the early years of Egyptian history, the bodies of the pharaohs were placed in “pyramids,” massive stone structures built on the edge of the desert, near the high flood level of the Nile. The pyramids were both royal tombs and religious temples, where the spirit — or “ka” — of the dead pharaoh could be worshipped.\n…  besides making pottery, the people of the ancient world also enjoyed painting. Evidences of early paintings can be found in the tombs of Egypt. These tombs contained statues and paintings of servants, who were believed to come alive when certain prayers were recited, thus extending their service to the pharaoh even into the next world. Images of daily life were also painted on the walls of the tombs and these images were believed to come alive in the next world. For this reason, the scenes depicted the pharaoh as young and healthy and in pleasant surroundings.\nThese tomb paintings and statues represent the most extensive treasury of ancient Egyptian art. Artists of ancient Egypt were taught, not to be original, but to follow rigid conventions. As a result, the artwork reveals a simple and formal style. For instance, in painting the human figure, various parts of the body are represented from their most characteristic angle. The head is shown from the side, the top half of the torso from the front, the legs from the side, and so on.\nMethinks there may be a possible answer, or rather two, to your intriguing question, based on:\n1. Artistic convention. There were some things one was allowed to paint, some that one was not (think grave-robber danger).\n2. Location. There may have been nothing but pyramids to see in the lonely arid situations they were constructed-  not even a date palm or camel. There were no tourist postcards either for making one’s work known to a wider audience. So art was restricted to what one’s sponsor wanted to see … life, maybe, not death, or monuments constructed to house the dead.\nYup, granddaughter (sic), spelt as such despite few adding an extra ‘d’ to grandad, is gradually sussing out relationships, but the thought that I am her dad’s dad has not quite occurred to her yet.\n","date":"August 11, 2013 at 12:47 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","id":"comment-2228","author":"colinsberry","site":"colinberry"},{"title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?","post":"Hi Colin,\n             Thanks for your 2 interesting suggestions,if I may I’d like to ask you a somewhat controversial question about the Turin Shroud .If the TS is genuine does that mean that Jesus left the tomb naked?None of the Gospels have any mention of this startling fact.Eddie\n","date":"August 13, 2013 at 1:11 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","id":"comment-2230","author":"Edward Wagner","site":"colinberry"},{"title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?","post":"Yes, but there are many who believe that mass is quantized, and thus momentum too (regardless of whether velocity is quantized). So kinetic energy would also be quantized.\nTry googling mass quantized as I have just done and you’ll see any number of listings, all saying the same thing in different ways.\n","date":"August 8, 2013 at 3:59 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","id":"comment-2219","author":"colinsberry","site":"colinberry"},{"title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?","post":"Hi colin,\n            Thanks again for your usual rapid reply ,you have “hit the nail on the head ” and solved my problem! I can easily see mass being quantised just by considering a glass being filled with water 1 molecule at a time . I’m so glad your answer did not involve Schrodinger’s Operator !The one last problem that I have is in understanding how a body can ” jump” from rest to some velocity  Although it can be seen happening on a simple velocity-time graph of an accelerating body at the origin ! Are these “jumps” different for different accelerations ? Ps. Many congratulations on solving my problem.\n","date":"August 9, 2013 at 10:23 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","id":"comment-2220","author":"Edward Wagner","site":"colinberry"},{"title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?","post":"If you look at the banner of this blog, you’ll see how a scorch from a heated template can produce a negative image, and I see no reason why the image should not  be exceedingly superficial if, as suggested previously, it were to be confined to the primary cell wall of flax/linen fibres.\nThat’s the principle. Whether it is feasible in practice is another matter. I personally do not have the resources to investigate with life size templates, and am in any case interested primarily in the theory, especially when one reads that the TS “defies scientific understanding” on account of allegedly peculiar properties (superficiality, 3D properties etc) when there is in fact nothing about those properties that should occasion surprise if the image is merely a superficial scorch.\nIn fact I don’t put all my theoretical eggs into one basket. The Garlaschelli method, using rubbing of ochre pigment with a live volunteer as initial template may well be a “scorch/template” model when one notes that the linen with the ochre negative is subsequently roasted in an oven. Scorching may occur selectively where the ochre is in contact with linen.\nSorry, I don’t understand the second part re velocity. Perhaps you could explain further what point is being made.\n","date":"August 6, 2013 at 6:58 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","id":"comment-2213","author":"colinsberry","site":"colinberry"},{"title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?","post":"Hi Colin ,\n            Thanks for your reply ,I did’t expect to hear anything so soon ,.In the second part of my message I am trying to get an answer to something that has puzzled me for a long time .How can the velocity of a body jump from nothing to something, .If it can, what’s it doing in between these states ?This question has implications for the Quantum theory .Ps. this question has nothing to do with the Turin Shroud ,I only asked you as I was very impressed with the extent of your scientific knowledge in your blog ..Eddie.\n","date":"August 7, 2013 at 12:55 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","id":"comment-2214","author":"Edward Wagner","site":"colinberry"},{"title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?","post":"Basic physics: if you apply a force F to an object of mass m, you make it accelerate:\nF=Ma\nNote that is an acceleration – a change in velocity. Once you remove the applied force, the object does not stop moving. It continues at the velocity it had acquired up to removal of the force. To slow down, another force would need to be applied, even a non-obvious one like friction.\nSo what is the nature of the force that produces acceleration? If you look at what is happening at the atomic level, it is electrostatic repulsion. The contact is between the electron clouds in the outermost atomic orbitals, so it’s negative-negative repulsion.\nOne could model the process using two magnets, bringing two like poles together (N/N or S/S). Just watch the target magnet jump away (“accelerate”) when you bring up the other. If you had a lubricated surface you might even be able to see the velocity of departure maintained for a few seconds.\nEven now I’m doubtful as to whether I have answered your question. Nobody’s ever asked me it before!\nPS :On reflection, I’ve realized that electrostatic repulsion cannot be the entire story, because one could make a neutron move by colliding it with another, or simply pushing it (my physics is somewhat rusty) and I have been overlooking one of the most basic laws of physics – conservation of momentum. If one moving object is brought to a halt by contact/collision with another, then the momentum of the first (the product mv) is completely transferred to the second. Kinetic energy (half mv squared) can be dissipated through friction, heat etc. Momentum cannot. It is completely conserved.\n","date":"August 7, 2013 at 1:12 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","id":"comment-2215","author":"colinsberry","site":"colinberry"},{"title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?","post":"Hi Colin ,\n             Thanks again for such a rapid reply! I know that to move from rest the body has to have a  resultant force on it producing an acceleration ( a change of velocity per second) my question refers to the minimum change of velocity .That is from zero to the next velocity (ie from nothing to something) Ps. momentum is only conserved if the resultant external force is zero.Eddie\n","date":"August 7, 2013 at 3:08 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","id":"comment-2216","author":"Edward Wagner","site":"colinberry"},{"title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?","post":"You seem to asking if velocity is quantized, right, i.e. that is comes in discrete packages like electromagnetic energy? I’ve never heard it described as such, and can’t think of any obvious, read simplistic, reasons why it should be, except maybe for sub-atomic particles like electrons,  not cars or planets.  But don’t take my word for it – I’m just a test-tube man…\n","date":"August 7, 2013 at 3:23 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","id":"comment-2217","author":"colinsberry","site":"colinberry"},{"title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?","post":"Hi Colin,\n            You have got to the heart of the matter ! If velocity is not quantized then kinetic energy (half m v squared ) would not be quantized this would contradict Quantum Theory .I’m so glad you have understood my problem .I now know that I chose the right man to ask ! even though you claim only to be a “test-tube man! Eddie .Ps. I’m so surprised that I’m getting such rapid replies !\n","date":"August 8, 2013 at 11:14 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","id":"comment-2218","author":"Edward Wagner","site":"colinberry"},{"title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?","post":"Could  a life size statue ,heated ,and wrapped with the “shroud” ,have produced the image ?Ps.what is the next velocity after zero of an object that has moved?I’l be very very interested in the answer!\n","date":"August 6, 2013 at 1:29 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","id":"comment-2212","author":"edward wagner","site":"colinberry"},{"title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?","post":"Under normal circumstances I’d be flattered James. But I see that your particular string of words crops us again and again on internet forums, suggesting you are a cog in the wheel of some kind of marketing campaign, or maybe an operation to boost rankings in internet search engines. Forgive me if I have misjudged you.\nPS: How come this blog appears nowhere if I enter simply ‘Shroud of Turin’ but can be at or near the top of returns by adding just one extra term, like ‘scorch’?\n","date":"September 27, 2012 at 6:03 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","id":"comment-842","author":"colinsberry","site":"colinberry"},{"title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?","post":"Thanks for the post. You should take part in a contest for one of the best blogs on the web. I will recommend this site!\n","date":"September 27, 2012 at 5:07 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","id":"comment-841","author":"James moarkal","site":"colinberry"},{"title":"Who says the Shroud is not a scorch mark – and more to the point, WHY?","post":"Here’s a comment I have just placed on another site – one with Richard Dawkins being roundly abused:\n“Speaking personally, I can’t think of any scientists I would want to burn at the stake, but I can think of quite a few I’d like to excommunicate – well, send on a reorientation course, anyway.\n Dawkins I hasten to add would not be  one of them – but those Italians who reckon it takes intense beams of coherent uv light from an excimer  laser to stand any chance of duplicating the “unique” characteristics of the Turin Shroud image – cue miraculous flash of light –  would be prime candidates in my  book.”\n","date":"February 16, 2012 at 11:07 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/13/who-says-the-shroud-is-not-a-scorch-mark-and-more-to-the-point-why/","cat":"permalink","id":"comment-11","author":"colinsberry","site":"colinberry"}]
