[{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"here is a comment i made before that might answere some questions .the mechanics of a crucifixation. relying on a statics class from a long time ago here are some thoughts on the forces in play on the body of crucified man.To put maximum pain on the body the arms need to be nailed straight out with no slack at all and where the nails have no give towards the end of the hand. . I am sure the Romans were aware of this since they were experts in pain. assume the body weighs 160 lbs a fbd (free body diagram) of the forces on the nail in the wrist at an angle 15 degrees with the crossbeam and the arms caused when  the body slouches would be 80 lbs straight down and a force pulled by the arm of 309 lbs which equals 80 lbs divided by the sine of 15 degrees or .2588. so each arm is feeling a pull of 309 lbs, also assuming a 72 inch arm span each arm would be stretched 1.22 inches which equals 1minus the cosine of15 degrees times 36 inches assuming no stretch in the shoulders but all in the arms. note as the body slouches more, the force pulling on the arms decreases but the stretching has to increase. This may explain why some people have commented that the arms seem too long; for normal arms are not long enough to cover the genitals which I seemed to have read somewhere\n\n","date":"September 5, 2012 at 8:46 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-15908","author":"Paul","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"The whole technical business of crucifixion, both generally and specifically that of Jesus Christ, is graphically described by Pierre Barbet in his classic work “A Doctor at Calvary”.  Barbet was a French surgeon who studied the photographs of the Shroud in great detail.  In addition he seems to have been a competent Latin & Greek scholar, and draws on several ancient works which describe the usual practices.  Furthermore he had access to the distressing reports of witnesses to crucifixion experiments carried out under the Nazi regime in the Dachau death camps.  His original work was published in French in 1950 under the title “La Passion de N.S. Jesus Christ selon le Chirurgien” by Dillon & Cie.  It was translated into English by “The Earl of Wicklow” under its own title.  The edition I have access to was published in paperback by Image Books, New York 1963. \nThe usual practice after scourging was for the condemned person to carry (not drag) the ~120 lb patibulum (cross-beam) to the place of execution where the upright (stipes) was permanently set in place.  Barbet estimates the stipes at not much more than 2.5 m high, based on the fact that an unmounted infantryman would sometimes dispatch the victim with a spear to the heart.  (This might be an underestimate by Barbet as it seems that the ~2m lancea was used which would allow some further height).  In Jesus’ case the carrying of the patibulum was assisted by Simon of Cyrene.  It was usual for the victim’s arm to be bound to the patibulum during this portage. \nBarbet’s sources suggest to him that nailing was the more usual practice rather than binding for fastening the victim to the cross, although in one particular region (not Palestine) binding was more usual.  The victim would lie on the ground and his “arms” (not his hands) would be stretched out along the line of the patibulum and be nailed to it.  It would then be an easy task for four soldiers to raise the patibulum with the victim attached (say 220 lbs) and fasten it to the stipes, either as a T (Tau) or t, depending on whether the stipes was notched or end-bearing.  The body would sag under its own weight, and the feet would then be nailed. Sometimes a foot pedestal would be provided, allowing the victim to exercise a see-saw motion allowing him some breathing, but this would prolong the agony. \nThe blood flows from the wrists would follow gravity, and thus Barbet measures the angle of the arms at between 65 and 70 degrees to the horizontal, quite a steep angle.  \nBarbet also deals with the apparent lengthening of the arms on the Shroud image.  He discounts joint dislocation as a cause of this, as dislocation usually results in a shortening of the arms due to muscle contraction (Ask anyone who’s had a dislocated shoulder).  The humerus can however be separated from the shoulder blade a little if it is violently stretched.  Barbet says that the maximum stretch is only 2 inches, and this conforms with the triangulation commencing with the arm stretched out horizontal and then lowered to 65 degrees from body sag.  \nI feel that this account may be inadequate to explain the apparent lengthening of the arms that we see on the Shroud image.  My own view of this is that it will depend very much on the disposition of the cloth when the image was formed, its folds, creases etc, and I see this as a problem in projective geometry, which I have endeavoured to raise on this site from time to time.  If the cloth lay at some angle to the quasi-plane of the arms, then the projection of the arms on to the cloth will appear to be lengthened. \nRegarding Paul’s point that he had read that the hands cannot reach the genital area as shown on the Shroud:  This is only true if the legs are straight out.  Rigor mortis would hold the knees bent, and this is shown on 3-D imaging on the thierrycastex.blogspot.fr site.  The genital area is then easily reached.\n\n","date":"September 5, 2012 at 11:42 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-15913","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Nice write-up Daveb, but lets not forget the man in the Shroud would have been ‘posed’ in the final crucifixion state from the onslaught of an immediate and strong rigor-mortis! Meaning his back would not be flat, as in a surpine position; The back would have been bent slightly forward, the arms outstretched and slightly to the back. The arms would then have had to been ‘broken’ out of their rigor positioning, this could have or in most probability, WOULD have caused a dislocation of the shoulders, [as attested to by ‘several’ forensic experts]. This dislocation combined with a bent forward posture of the upper abdomen can, in itself, explain the seemingly elongated arms and the fact they can cover the genitalia.\nThis notion of the arms being ‘stretched’ or ‘the hands not possibly being able to cover the genitals’, is a common misconseption, mentioned quite often by those who have done very little research on the matter or lack much common sense. One must ‘always’ keep in mind the ‘positioning’ of the body resulting from the process of death occuring on a cross by crucifixion and further, strongly set in rigor-mortis.\nR\n\n","date":"September 6, 2012 at 3:15 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-15942","author":"Ron","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Im sorry Carlos.  I have no Spanish at all.  Perhaps someone can translate.\n\n","date":"September 6, 2012 at 4:28 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-15945","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Response to Ron: Notwithstanding Barbet, I would surmise that if the shoulders were dislocated after death and in rigor mortis, muscle contraction might not operate and the arms might be thus lengthened.  But it would require considerable strength to do this and it seems rather an extreme action, when the corpse is wrapped up decently anyway.\n\n","date":"September 6, 2012 at 4:34 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-15947","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"I’ve got a few technical errors in my posting above at Sep 5, 11:42pm; I did it on the run from memory without checking as I went along.  Errors are corrected in later posting below Sep 7, 5:17pm, which I checked more carefully. Description there is more comprehensive and as reliable as I can make it from Barbet and elementary Statics.\n\n","date":"September 10, 2012 at 7:38 am","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16090","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"A further point raised by bloggers from time to time:  Barbet mentions that family would sometimes petition to recover the body.  This would usually be granted as a matter of form, but the guard would ensure that the victim had been dispatched (lancea).  The only exceptions were the worst offences such as treason, when the bodies were left on the cross for predators, as a further discouragement, or when the authorities wished to make an example in cases of a popular revolt or civil unrest.  In the case of Jesus, it was then normal for Joseph of Aramathea to approach Pilate for the body of Jesus.  Perhaps the fact that the following day was a special sabbath may be less relevant than we may have previously thought.\n\n","date":"September 6, 2012 at 12:15 am","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-15915","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Hay propuestas MUY ESTÚPIDAS que siguen manteniendo su ECO en las páginas escépticas :\n¡ No poder ALCANZAR con las manos los genitales, estando tumbados.!\nNo conozco si existe un origen anterior de esa estúpidas propuesta. La leí por vez primera en la revista del CSICOP “Pensar”:\n“Cualquier persona que quiera simular la posición del supuesto”cadáver”, puede hacer lo siguiente: acostarse en el suelo boca arriba, dejar reposar los codos sobre el suelo, tomar una de las muñecas con la otra mano, Y SIN DESPEGAR LOS CODOS DEL SUELO, tratar de ocultar los genitales… lograr esta posición es tan imposible como morderse el codo. Es claro que el falsificador que pintó la imagen tuvo bien claro que sería poco decoroso mostrar los órganos genitales del Nazareno en un lienzo que se iba a exponer públicamente para atraer peregrinaciones.” “Las anomalías ignoradas del “sudario” de Turín”. Hernan del Toro.”Pensar”.Volumen 1 Número 1 Enero/Marzo 2004\n[PENSAR era una publicación del CSICOP de Colombia, en idioma español (castellano)\nCommittee for the Scientific Investigation of Claims of the Paranormal Center for Inquiry International Presidente: Paul Kurtz .Director Ejecutivo: Barry Karr] \nhttp://www.pensar.org/2004-01-turin.html\nEscribe el autor del artículo, y lo RESALTA en letra “itálica” ( yo lo he escrito aquí con letra “mayúscula”).\n” …..Y SIN DESPEGAR LOS CODOS DEL SUELO……”, \nEs condición “sine qua non” ( condición necesaria e imprescindible) que la articulación del codo quede FIJA contra el suelo para así no poder alcanzar los genitales……¡ ni la BOCA, ni la NARiZ, ni la OREJA,  etc,etc,!\nHay que ser MUY TORPE para no advertir la TRAMPA, y la mayoría de los “copistas escépticos” prescinden de esa frase (“….Y SIN DESPEGAR LOS CODOS DEL SUELO……”,) causando estupor en los lectores NORMALES, que alcanzan sus genitales con las manos estando tumbados sin el menor problema…….\n¿Por qué tendrían que estar los CODOS del Hombre de la Sábana PEGADOS al suelo?\nEs una ESTUPIDEZ de los escépticos “organizados”, en realidad ateos cristófobos.\nCarlos Otal\n\n","date":"September 6, 2012 at 3:45 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-15943","author":"Carlos Otal","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Hi Carlos,\nThese idiotic ‘notions’ probably come from the same ‘mysterious’ source that claimed ALL blood types reverted to AB over time, or that AB blood was of a more recent type, which ‘unbelievably’ permeated for decades. This, we are all now aware of, is COMPLETE HOGWASH!\nAnyone with even the slightest ‘visual perception abilities’ when viewing the front an dorsal images on the Shroud, should be able to make out that the body is not lying flat in the supine position, but most certainly it is contorted, with head bent slightly forward, upper abdomen bent slighty forward, needs bent slightly, one more then the other…this is quite evident to me anyways and has been extensively covered by the likes of Madam Piczek, renowned artist and theoretical physicist.\nR\n\n","date":"September 6, 2012 at 4:43 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-15949","author":"Ron","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Sorry error above, shoudl read as; Knees bent slightly, one more then the other.\n\n","date":"September 6, 2012 at 5:11 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-15952","author":"Ron","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"My comment above got mislocated.  My apology to Carlos that I have no Spanish at all.  Perhaps someone would be kind enough to translate.\n\n","date":"September 6, 2012 at 4:30 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-15946","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"\ndaveb of wellington nz :Response to Ron: Notwithstanding Barbet, I would surmise that if the shoulders were dislocated after death and in rigor mortis, muscle contraction might not operate and the arms might be thus lengthened. But it would require considerable strength to do this and it seems rather an extreme action, when the corpse is wrapped up decently anyway.\nHi DaveB,\nI’m am not exactly sure what you meant by this last comment, could you rephrase it maybe?\nAs to your issue with translating Carlos’s comments; What version of Internet explorer are you using, if that is your software? I have version IE 8 and have found I can simply highlight the comment, then right click on it, which brings up a menu, I then click ‘Translate with Live Search”, it works quite well for me.\nR\n\n","date":"September 6, 2012 at 4:58 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-15950","author":"Ron","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Daveb, el navegador Google Chrome traduce automáticamente TODOS (casi todos) los idiomas.\nSon traducciones malas, pero suficientes casi siempre para entender los comentarios.\nCarlos Otal\n\n","date":"September 6, 2012 at 5:08 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-15951","author":"Carlos Otal","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Thanks for the hint Ron.  I had to do it in two bites, as Google Translate couldn’t handle it all in one go.  \nYes, I’ve seen Carlos’ reference before, which I think Dan posted some months back.  The Thierry-castex.fr 3D image shows the figure with knees bent, and other flexing.  I like Carlos term “cristofobos” which I think describes sceptics very well..  I think he’s on to something there.   \nRon: I’m not aware that other “forensic experts” have claimed that shoulders were dislocated.  Barbet says “No!” on the basis that muscle contraction would in fact shorten the arms. But would muscle contraction operate in a case of rigor mortis? I wouldn’t know. Barbet says you can only get a 2 inch extension from stretching the shoulder ligaments. Otherwise the action of dislocating the shoulders during the laying out of a body seems to me unduly violent, merely to place the hands in that position,  \nNevertheless the arms do appear unusually long.  That is why I suggest it may be a projective geometry property regarding the angle between placing of the arms and the disposition or folds in the cloth at the time of image formation. Think about the analogy of a lengthened winter shadow.\n\n","date":"September 6, 2012 at 6:42 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-15956","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Well Dave I couldn’t presume to answer your question on contraction during the breaking of rigor, as I have no idea. But to your issue with dislocating the shoulders during the breaking of the rigor, this has been stated. Unfortunately, as I read it amongst so much other readings, I cannot remember where, nor can I at the moment give you a reference. Rest assured, I would not make it up. Nevertheless, let’s assume the shoulders did not dislocate during the breaking of rigor, still one must consider the position of the abdomen and it’s relation to where the arms and hands will lie if they are brought down. I’ve tried to link a picture of Madam Piczek’s rendition of the body’s posture, which I think would explain much better then with words, but I’m not able to post it.\nMaybe Dan could help out here if he wishes.\nR\n\n","date":"September 7, 2012 at 4:47 am","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-15978","author":"Ron","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Ron:\n“También hay que tener en cuenta que en la fase de estado, la rigidez es de tal intensidad que puede originar desgarros el forzarla y, añade el propio Gisbert, que en la segunda fase o período de estado, la rigidez es prácticamente invencible sin producir desgarros o fracturas. \nHoy se sabe,y la experiencia lo confirma, que cuando la rigidez está establecida el esfuerzo que debe aplicarse es considerable, pudiendo originarse roturas fibrilares, luxaciones o malposiciones articulares, fenómeno repetitivo en las salas de autopsia cuando se vence la rigidez para iniciar la necropsia.\nEs éste un punto que debe considerarse también en el caso que estudiamos porque la subluxación del hombro, cuya explicación se ha intentado de tantas formas, tiene claramente este origen. ”\n“MOMENTO EN QUE SE PRODUJO LA IMAGEN SINDÓNICA.VALORACIÓN DE LA MEDICINA LEGAL”. Prof.Dr.José Delfín Villalaín Blanco .Catedrático de Medicina Legal.\n[ la Medicina Legal es la medicina forense] \nCarlos Otal\n\n","date":"September 7, 2012 at 11:36 am","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-15991","author":"Carlos Otal","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"think of a gymnest doing an iron cross on the still rings as he slowly lowers his body to a hanging straight down position,  the rings will come from an extended position to shoulder width at the hanging postion. On a cross with the arms nailed where there is no GIVE of the arms against the nails the arms have to stretch to have any slouching of the body. the amount of lenghtening of the arms is in direct proportion to the degree of slouching of the body. Remember the shortest distance between 2 points is a straight line (between the 2 nails) any degree of slouching will cause the distance to increase. since the nails can not move the arms must get longer no if ands and buts.\n\n","date":"September 6, 2012 at 10:42 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-15964","author":"Paul","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"\nCarlos Otal :Ron:\n“También hay que tener en cuenta que en la fase de estado, la rigidez es de tal intensidad que puede originar desgarros el forzarla y, añade el propio Gisbert, que en la segunda fase o período de estado, la rigidez es prácticamente invencible sin producir desgarros o fracturas.\nHoy se sabe,y la experiencia lo confirma, que cuando la rigidez está establecida el esfuerzo que debe aplicarse es considerable, pudiendo originarse roturas fibrilares, luxaciones o malposiciones articulares, fenómeno repetitivo en las salas de autopsia cuando se vence la rigidez para iniciar la necropsia.\nEs éste un punto que debe considerarse también en el caso que estudiamos porque la subluxación del hombro, cuya explicación se ha intentado de tantas formas, tiene claramente este origen. ”\n“MOMENTO EN QUE SE PRODUJO LA IMAGEN SINDÓNICA.VALORACIÓN DE LA MEDICINA LEGAL”. Prof.Dr.José Delfín Villalaín Blanco .Catedrático de Medicina Legal.\n[ la Medicina Legal es la medicina forense]\nCarlos Otal\nThank you Carlos for your input and reference…I am no expert by any means, but the thought of adjusting the arms (bringing them down) so as they may rest in the position we see on the Shroud, to me anyways, made sense that much damage could or would have been caused in doing so. I think it may also be evident in that it has also been mentioned that one shoulder seems dislocated in comparison to the other. The evidence that the body is in rigor (agreed by most all experts), only goes to back this point.\nThanks again.\nR\n\n","date":"September 7, 2012 at 3:03 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-15998","author":"Ron","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Sorry above comment should read as “that one shoulder seems ‘displaced’ in comparison to the other, not dislocated.\nR\n\n","date":"September 7, 2012 at 3:06 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-15999","author":"Ron","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Further to my comment #2 above, Sep 5, 11:42pm, and ensuing discussion:\nI went back to Barbet to check out some of his technical details more carefully.  Interestingly, I discovered that in his youth, Barbet had been a sapper, working on railway construction, and was familiar with men carrying railway sleepers (cross-ties) on their shoulders, and occasionally tripping during this.  This relates to the carrying of the patibulum which he estimates at 120 lb.  He postulates that Jesus was not bound to the patibulum, but carried it on his right shoulder in much the same way, and then was easily assisted by Simon of Cyrene.  He has an interesting discussion on injuries to his back and knees during his falls.\nHe considers that the full cross was Tau shaped T, and was not more than about 6ft 8 in in height.  After being nailed to the patibulum with arms fully outstretched while lying horizontal, a ladder would be placed against the stipes, which the victim would then mount with his back to the stipes, while four soldiers would then easily lift the patibulum with the victim attached and place it on the top of the stipes.  Weight of the patibulum and the body would not be more than 286 lb, so he is estimating the body weight as 166 lb. \nFrom the blood flows he measures that the arms in the crucified position are 65 degrees to the vertical, which is 25 deg to the horizontal.  He considers that the normal distance between shoulder blade and wrist is slightly less than 24 inches.  In the suspended position, this gives a hypoteneuse of 24 / cos 25 = 26.48 inches, giving a lengthening of the arm of about 2.46 inches.  This is close to his maximum limit of 2 inches from ligament stretch.  \nFrom the triangle of forces, it can be calculated that the tension in each arm must be:\nT = 166 / (2 x sin 25) = 196 lbs, a fairly traumatic tension to hold for 3 hours.  Severe cramps would rapidly ensue, together with the issues of asphyxiation and other trauma.  Whether this tension would be sufficient to cause eventual shoulder dislocation, I am unable to say, but Barbet apparently discounts it.  If the image is considered by some to show shoulder dislocation, as has been commented, this may have resulted from repositioning of the arms in a state of rigor mortis during the eventual laying out. \nI am still holding to the view that the apparent lengthening of the arms on the image may be a matter of projective geometry, involving the angles between the cloth and arms during image formation.  This may be an issue that needs further consideration.\n\n","date":"September 7, 2012 at 5:17 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16003","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Daveb, your comment  ‘may be a matter of projective geometry’ may atleast in part, be quite plausible, as I believe that exact reasoning has been speculated as a cause for the seemingly long fingers on the right hand over the left thigh we see on the Shroud.\nR\n\n","date":"September 8, 2012 at 9:38 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16029","author":"Ron","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Further to my arm tension calc above.  It’s essentially based on elementary equilibrium statics.  The 196 lb tension in each arm provides a vertical component of 83 lbs each countering half the weight of the body.  This 196 lb is near the maximum tension in the arm.  The victim would engage a seesaw sort of action to maintain breathing as long as he was able, transferring some of his weight to his nailed feet, thus momentarily relieving some of the arm tension.\nThe 196 lb arm tension has a 178 lb horizontal component, maintaining his sideways equilibrium, and at the nails should transfer a net compression of 178 lb along the beam of the patibulum.  (Timber stresses are tricky to assess accurately because of the grain)\nI don’t know the particular art work Max mentions or how it might relate to crucifixion trauma.  However I believe I have read that the two shoulders on the TS do show some significant difference, various ones suggesting that it might have been occupationally incurred, such as frequently working with heavy timbers.  I am not sure about shoulder damage during his falls without rechecking in Barbet.  If I find anything, I may comment again.\n\n","date":"September 8, 2012 at 11:37 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16035","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"One of the TSM’s shoulder  does look dislocated in the miniatuture of the Baptism of Christ, from the ‘Psautier d’Ingeburg de Danemark’, c.1210  Ms 9/1695 fol.19 T.\n\n","date":"September 8, 2012 at 3:39 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16022","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Sorry for the slip of the tongue. I meant “in the miniatuture of the Baptism of Christ, from the ‘Psautier d’Ingeburg de Danemark’, c.CE 1210 Ms 9/1695 fol.19 T, one of Yeshua’s shoulders look dislocated.\n\n","date":"September 8, 2012 at 4:22 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16023","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Actually and all likelihood,  both “the unsually long arms” and “seemingly long fingers on the right hand” are a matter of “complex VARIABLE/VARIFOLD projective geometry” (long inner burial cloth pressure release – during the Sindon image formation process – in conjunction with adducted-abducted arms counteracted rigor mortis).\n\n","date":"September 9, 2012 at 5:03 am","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16043","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Max, I’m reading into your last comment here, with GRADUAL pressure release, that you’re envisaging a process maybe analgous to a long exposure on a film giving multiple fuzzy images of the same object creating an impression of long arms.  But I’m not sure if that’s what you mean or not, and maybe the definition is too good for that to be the reason.  The analogy I envisage is more like shadow lengthening from a low winter sun.  That is, I’m thinking instead of the cloth and arms being at an angle to each other resulting in a lengthened picture of the arms.\n\n","date":"September 10, 2012 at 10:41 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16125","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Dave you wrote: “with GRADUAL pressure release, that you’re envisaging a process maybe analgous to a long exposure on a film giving multiple fuzzy images of the same object creating an impression of long arms.”\nThe fact is my specific reconstruction doesn’t involve any “multple fuzzy images of the same object” at all but the collimation of an elongated HD image subjected to the mechanic twill weave linen return forceS of the long inner burial cloth through drying-up, counteracted arms rigor mortis and the resulting process of getting taut again.\n\n","date":"September 11, 2012 at 4:48 am","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16130","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Max, I’m trying to get a clear picture in my mind as to your hypothesis on this, but I need it in clear plain language so as to understand it.  From your other postings you’ve placed, I’ve got the idea that you’re saying the Shroud and other cloths have been moistened during a ritual process, and then it is tied up firmly (tightly?), and that then it dries out and this drying loosens it.  Are you maybe saying that the moistening results in it shrinking, that the image process then proceeds, that the Shroud when drying out then returns to its natural size and shape, and this is what gives the impression that the arms are too long.  If that’s the case, then you’d also have to say that the shrinking and stretching is uneven, otherwise the whole image would be affected the same way and we wouldn’t see any distortion at all.  Have I got it right this time?  I’m only trying to understand how you envisage the effect on the cloth.\n\n","date":"September 11, 2012 at 5:24 am","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16132","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Sorry I myispost my repy…\nDave,\nWithout getting into all the particulars of my reconstruction of the TSM’s burial, here are a\nfew main points:\nIt needed a minimum of 4-5 buriers.\nFirst the  deceased’s eyes were closed or covered.\nSolely the long inner burial sindon (Heb. sovev) was moistened with alkaline waters.\nThen it was tautly wrapped lengthwise around the stiff rigid body while the legs and torso were tightly wrapped up widthwise with two long linen strips and/or a shawl (Heb. thalith) and the head tightly wrapped up (on top of the sovev) with a veil and a skullcap to both honour the deceased and counteract the head rigor mortis and keep the mouth shut (three wooden pieces were used to make a “small jaw box ” in conjunction with the two burial head dresses)\nDuring the image formation process, the sovev didn’t quite return to its natural size and shape as it got sort of taut again lengthwise through shrinking.\nThe uneven recording of the two arms imprint on the inner side of the burial cloth is due to the fact the deceased’s arms had been forced in rigor mortis from adduction to abduction thus creating sort of a counter-pressure to wrapping-up pressure. This resulted in a specific image distortion not to be extended to the whole body imprint.\nThe ritual fumigation allowed the latent body imprint to be revealed onto the long inner ancient burial cloth.\n\n","date":"September 11, 2012 at 7:54 am","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16139","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Mistyping: sorry I misposted my reply\n\n","date":"September 11, 2012 at 7:54 am","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16140","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Thanks Max:  (Briefly: “adduction” to pull a limb towards the central median axis of the body; “abduction” to pull a limb away from the central median axis)\nSo the buriers bring the arms (in rigor mortis) from the outstretched position towards the centre of the body with the hands over the pelvis, probably needing some effort to do this.  Very likely they tie them together at the wrists so they don’t flex out again.  But you could still get some abduction with movement at the shoulders and elbows, as the wrists are not anchored.  This abduction causes a pressure on the tightly wrapped cloth stretching it, as the tension in the two binding strips eases.  I think I’ve got your picture now. (Sorry, unintentional pun).  Thank you.\n\n","date":"September 11, 2012 at 5:24 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16155","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Typing errors:\n“The uneven recording of the two arms imprint on the inner side of the burial cloth is due to the fact the deceased’s arms had been forced in rigor mortis from aBduction to aDduction thus creating sort of a counter-pressure to wrapping-up pressure. THROUGH DRYING UP AND CLOTH TO BODY PRESSURE RELEASE, THE ARMS MECHANICALLY TENDED TO SLIGHTLY FLEX OUT AGAIN, this resulted in a specific image distortion not to be extended to the whole body imprint.\nThe ritual fumigation AND/OR BODY HYPERTHERMIA allowed the latent body imprint to be revealed onto the INNER SIDE OF THE long inner ancient burial cloth.\n\n","date":"September 12, 2012 at 3:17 am","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16161","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"+ Mistyping: THE ARMS MECHANICALLY TENDED TO SLIGHTLY RAISE AGAIN\n\n","date":"September 12, 2012 at 3:26 am","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16163","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Sorry again to you all for all my typing errors. Most of the time I am writing in haste. Beside, I took up to wrinting in English only two years ago after a nearly 25 years of total non-practice.\n\n","date":"September 12, 2012 at 4:43 am","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16164","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"If you only took up writing in English two year ago, Max, you’re doing very well;  I have very little problems understanding your English, but I just find your ideas and the way you express them (not the English) a little obscure at times.  I think I now have a clear idea of your theory and I know you’re insistent about it.  I couldn’t be so dogmatic.  You have a clear idea on what was supposed to happen, but my view is that what was supposed to happened might not have happened quite that way.  There are various theories how the image was formed, I have problems with most of them, mostly based on geometry, minimum distortion and clarity,  That’s why I’m prepared to believe maybe it was a miracle, not was, just maybe.  If you can’t accept a miracle, that’s fine and I have no problems with that.  If it was a natural process, then I suspect we are nowhere near the answer yet,  Best wishes.\n\n","date":"September 12, 2012 at 7:50 am","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16173","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"If you can’t accept a non-miracle, that’s fine and I have no problems with that. If it was a supernatural process, then I suspect we are nowhere near the answer yet, Best wishes.\n\n","date":"September 12, 2012 at 10:01 am","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16183","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Natural or supernatural, there’s still a long way to go.  I saw my first picture of the face-image in the 1940s in my Nana’s cottage; I saw my first slide presentation of the Shroud by my University Dominican chaplain in 1960.  Now I’m in my early 70s.  I don’t think I’ll see a definitive explanation in my life-time.\n\n","date":"September 12, 2012 at 11:23 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16212","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Just think of the Jospice mattress…\n\n","date":"September 12, 2012 at 10:15 am","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16184","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"I’ve checked out what I can of the Jospice mattress, 1981.  Fr Francis O’Leary’s story on shroud website at:\nhttp://www.shroud.com/pdfs/imprint.pdf\nLouis C. de Figueiredo paper “Can the Jospice Mattress Imprint be compared to the Image on the Shroud?” seems too speculative to me, refers to “telurgy” and a lot of metaphysics:\nhttp://holyshroudguild.org/uploads/2/7/1/7/2717873/can_the_jospice_mattress_imprint.mht_2.pdf \nSome peculiar comparisons: West Indian pancreatic cancer case, not particularly religious;  mattress cover nylon – not linen;  Patient seems to have had some religious experience beforehand if report is accurate.  Body Insulated from mattress cover by pyjamas, sheet, thin tranparent polyurethane cover. Face also insulated from mattress cover  by pillows.  Arm, buttocks, body, jaw shows only in outline;  No myrrh, no aloes nor other plants; Only sweat, possibly urine(?), maybe excrement(?).  No scientific explanation as yet; Didn’t see any reference to 3D encoding. As the mattress cover was insulated from the body by polyurethane cover, would seem to argue strongly against a chemical process!\n\n","date":"September 12, 2012 at 11:42 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16213","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Dave, \nAs long as you’ll think the Shroud was not wrapped around the body, there’s nope you can have a clear idea of my theory and on what is most likely to have happened,\n\n","date":"September 12, 2012 at 10:31 am","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16186","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"I recall your earlier postings where you say the body was packed with various herbs and plants.  Nicodemus brought 100 lb of myrrh and aloes, that’s a lot of herbiage. \nScenario 1:  If the package wasn’t used, but Shroud was tightly wrapped around the corpse, and the image process was chemical, then we would also see the sides of the body, and image would be distended widthwise.  We don’t see that – scenario 1 not valid.\nScenario 2:  Herbs and spices are packed along the sides of the body, concealing the sides, and creating a box-shape.  But to get orthogonal undistorted portrait onto the Shroud by chemical means, the frontal and dorsal lay of the Shroud has to be almost flat, like box-shaped.  Problem: If Jospice image relevant, then herbs and spices may be insufficient insulation, as Jospice image still appeared despite being insulated. Scenario 2 – maybe, maybe not. \nScenario 3:  Imaging has little to do with a natural chemical process penetrating insulation layers.  But is some unknown physical process associated with death / resurrection event.  In that case all options are open.\n\n","date":"September 13, 2012 at 12:03 am","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16214","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Reminder: on August 18, 2012, I wrote:\n“We also can create a very good fake with a tortured corpse covered in urine (BTW prolonged exposure to moisture from sweat, urine and/or faeces + hyperthermia might well be the key factors to account for the Jospice top side mattress image).”  \nMoistened cloth + prolonged exposure in extra height to ritual fumigation and/or hyperthermia + cloth and body complete drying out could well account for the image formation process as far as my reconstruction of the TSI is concerned.\n\n","date":"September 12, 2012 at 11:04 am","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16189","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Note: Lying in supine position, the backside of the Jospice corpse was COMPRESSED against the top side of the mattress.\n\n","date":"September 12, 2012 at 11:16 am","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16191","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Max, I believe from ‘results of several comparisons performed’, between the Jospice mattress image properties and those of the image found on the Shroud; It HAS been found that they were quite different and cannot seriously be compared or presumed to be formed in the same manner whatsover. Furthermore I’m with Daveb here, I have tried to understand your hypothesis of the image formation but have had difficulty in understanding it! Particularly in view of your writing style, being it is often VERY cryptic…Anyways from what I can gather, and I am NOT saying I understand it perfectly or that it may be wrong, but from what I CAN gather in your formulation; I believe several steps of ‘speculation’ are required in such a process and to the conclusion. Several assumptions are made, with very little evidence actually, to back them up!…Nevertheless, as I’ve mentioned previously, it is possible I still don’t grasp your hypothesis entirely.\nR\n\n","date":"September 12, 2012 at 4:48 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16202","author":"Ron","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"The body was insulated from the nylon mattress cover (which received the person’s naked image) by:  pyjamas, sheet, and transparent polyurethane cover.  In addition head was also insulated by pillows.  Also See my other replies and comments above. I can’t see a chemical process working under the conditions stated.  It looks like some other unknown process to me.\n\n","date":"September 13, 2012 at 12:08 am","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16215","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Dave, \nIF you really think that the Jospice matteress man was lying in his pyjamas etc when the image formation process occurred, then no wonder you believe in miracles!\n\n","date":"September 13, 2012 at 1:37 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16232","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"I’m relying on the accuracy of the O’Leary report, referenced above: Quote:\n“The face, of course, was lying on two pillows, a large one\nand a small one. For this image to penetrate on to the mattress cover, it would, of necessity, be required to go through a pillow slip, a pillow, the under-covering of the pillow slip, through a second pillow and again through a cotton sheet to fix itself indelibly into, or through, the very\nthin layer of polyurethane which lies on top of the mattress cover.”\n\n","date":"September 13, 2012 at 4:31 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16236","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Figueiredo adds: Quote:\n“Les was wearing a pyjama top, but as reported by Father O’Leary, the face image, “would, of necessity, be required to go through a pillow slip, a pillow, (etc)”\n\n","date":"September 13, 2012 at 4:34 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16238","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Dave,\nHave you ever worked in a hospital in the 70s or 80s in Europe and/or shared any nurse’s or medical doctor’s most edifying professional secrets? \nBetter a pious/outright lie than bad publicty (an unattended patient letf dead and naked in his urine – and other body fluids? – right on a bed matterass for hours)\n\n","date":"September 13, 2012 at 5:59 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16245","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"What was happening then in some hospitals, however, was in fact even worse.\n\n","date":"September 13, 2012 at 6:12 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16246","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"That’s the only way it could work with chemistry.  Francis O’Leary was a pious man (check his credentials) and wouldn’t be the source of the lie if that’s what it was.  But it looks as if the polyurethane cover would need to be removed as well.  Interestingly, the mattress cover itself is siad to be nylon, not linen! I don’t know that nylon fibres can be equated with cellulose.\n\n","date":"September 13, 2012 at 7:13 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16249","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Dave you wrote: \n “Francis O’Leary was a pious man (check his credentials) and wouldn’t be the source of the lie if that’s what it was.”\n In the 70s-80s, It was very easy to manipulate a report and even a bona fide witness such as Father O’Leary. What time did the patient die? When did O’Leary see him alive for the last time? When did O’Leary see him dead? When was the deceased’s body removed from his hospital room? Is the nurse’s report really accurate and reliable? When was her report written up?  When was Father O’Leary’s? Were the deceased’s pyjamas, pillows etc forensically examined or weren’t they? Etc.\n\n","date":"September 14, 2012 at 4:47 am","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16259","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Mistyping: In the 70s-80s, It was very easy to falsify a report and manipulate even a bona fide witness such as Father O’Leary.\n\n","date":"September 14, 2012 at 6:17 am","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16267","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Well, Daveb, you have touched a crucial question. If we assume a tightly wrapped linen around a body -even Yannick agrees with this-  chemistry, even Maillard reaction, becomes more complicated because Maillard reaction yields water as a subproduct that inhibits further development of the reaction itself. That would not happen with a more open configuration of the linen around the body, since water could evaporate in a dry environment. For other chemical reactions, a chemical model should be basically be anaerobic.\n\n","date":"September 13, 2012 at 8:43 am","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16224","author":"Gabriel","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"I don’t agree with the idea that the corpse was tightly wrapped at the moment the image formation process was going on !  All I said is that during a short period of time PRIOR to the image formation, the Shroud MUST have been manually compressed (this is the hypothesis I favored the most) or tightly wrapped around the body in order for the bloodstains to formed everywhere we see them on the Shroud.  This is pure logic since we know that all these bloodstains came from a DIRECT contact transfer from the body to the cloth.  But if the Shroud would have stayed compressed or tightly wrapped around the body at the time the image formation process was active, no way we would see the kind of image that is on the Shroud (i.e. a body image that got no evident distortions but just minor ones in some places).  A Shroud compressed or tightly wrapped around the body would have produced an highly destorted image.  NO DOUBT ABOUT THAT.  This is pure logic.\n\n","date":"September 13, 2012 at 4:52 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16240","author":"Yannick Clément","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Ok, Yannick, I think I misunderstood your point. Sorry for that. Any explanation on the process from being tightly wrapped (bloodstains transfer) to loosely falling on the body (image formation)?\n\n","date":"September 13, 2012 at 5:35 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16242","author":"Gabriel","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Yannick you wrote: \n“All I said is that during a short period of time PRIOR to the image formation, the Shroud MUST have been manually compressed (this is the hypothesis I favored the most) or tightly wrapped around the body”. \nI am GLAD you (almost) can hear me NOW and start taking into account my idea  (the TSM’s stiff rigid body was first tightly wrapped up with burial linens).\nShall I endlessly write the same thing though: \n1/first the in-soaked/moistened long inner burial cloth was first tautly wrapped lenghtwise around the stiff rigid corpse,\n2/ then the latter was compressed widthwise with other burial linens.\n3/ the tightly wrapped up stiff rigid body placed in extra height was then subjected to a ritual (myrrhic aloetic) fumigation (acting in conjunction with body hyperthermia?).\n4/ finally the compressed long inner burial cloth gradually came unstuck from the skin till it got sort of taut again through shrinking (contact then gradual loss of cloth to body contact through gradual pressure release).\nThus the long inner burial cloth was no longer compressed widthwise but sort of taut again through shrinking. Get the idea?\n\n","date":"September 13, 2012 at 5:40 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16243","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Gabriel, please don’t ou rely on Dave to misinterpret me. \n  In the hypothesis the TSM is Yeshua’s, my reconstruction of his burial implies that between about two hours and a half and three hours after his death, 3.00-5.30/6.00p.m. or 3.30-6.00/6.30p.m., the reaction of Maillard was interrupted via his corpse fumigation. This is totally consitent with the evidence that supports a low-temperature image-color-formation process. \n  Or to put it in other words, the appearance of the decompostion amines (that would otherwise slowly appear at the surface of the skin under normal circumstances during the time in the tomb) was temporarily delayed. In this scenario, the Maillard reaction has nothing to do with the TSM’s image formation process.\n\n","date":"September 13, 2012 at 12:45 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16229","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Dave you wrote: \n“I recall your earlier postings where you say the body was packed with various herbs and plants. Nicodemus brought 100 lb of myrrh and aloes, that’s a lot of herbiage.” \nSorry to tell you, you recall badly.\n\n","date":"September 13, 2012 at 12:52 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16230","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Are you saying that the 100 lb package brought by Nicodemus was packed on the outside of the wrapped corpse? In that case we have Scenario 1, but there’s no lateral distortion of the image and we don’t see TSM’s sides.  The image that we have is not the image we would get!\n\n","date":"September 13, 2012 at 4:42 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16239","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"I never wrote either the 100 lb package brought by Nicodemus was packed on the outside of the wrapped corpse…\n\n","date":"September 13, 2012 at 4:52 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16241","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"If the herbs, spices, and other accompaniments weren’t packed inside the Shroud, and weren’t packed around the wrapped corpse, what did Nicodemus and Joseph of A do with all this 100 lb of impedimenta?  Surely they didn’t just strew it around the tomb?  It looks to me then that you’re saying that the Shroud was in direct contact with the body, tightly wrapped, front and back and along his sides.  Why don’t we get to see his sides, if it’s Maillard?  This scenario is making me more sceptical that it’s a chemical reaction caused by body fluids!\n\n","date":"September 13, 2012 at 6:52 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16247","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"You can’t have this simplistic reasoning :\n\nGabriel :\nMaillard reaction yields water as a subproduct that inhibits further development of the reaction itself. That would not happen with a more open configuration of the linen around the body, since water could evaporate in a dry environment.\n\nWater, is just one parameter among many others. It may be a major or secondary parameter.\nAnd the way water influences Maillard reaction kinetics must be determined for each model. This water/Maillard reaction kinetics relationship is not necessarily linear, and you may have a bell-shaped curve with a maximum rate at intermediate/high relative humidity values for most models.\n\n","date":"September 13, 2012 at 1:14 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16231","author":"anoxie","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Anoxie; Ok with your comment. I just wanted to point out that for the same initial water production rate, having a tightly wrapped configuration for the linen where water is more likely to accumulate or a gently falling sheet -evaporation rates higher- makes a difference. Do you know or anybody else knows if Rogers ever addresed this issue?\n\n","date":"September 13, 2012 at 1:43 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16233","author":"Gabriel","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"If he’s tightly wrapped, why don’t we get to see his sides if it’s Maillard, or for that matter any other chemical process caused by body fluids?  It’s postulating an orthogonal projection of a body, tightly wrapped, on to the cloth, undistorted image.  It can’t work this way!\n\n","date":"September 13, 2012 at 6:57 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16248","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Dave, \nA couple of months ago I already replled to the same question you are now asking me again (absence of lateral body images)… Cannot you remember?\nCannot you remember too my previous postings about the funerary use of spices and spicy perfumes in the Judean ethnic milieu? \nCannot you still figure out gradual pressure release just front and back before the long inner burial cloth first compressed against the stiff rigid corpse, got sort of taut again to account for undisturbed blood clots and body image ID as the long cloth sligthly came unstuck from skin through drying out and shrinking? \nShall I endlessly repeat what you keep forgetting just because it doesn’t fit or is at cross variance with your belief?\n\n","date":"September 14, 2012 at 4:21 am","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16258","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Max: Thank you for your patience in responding to my queries.  I now propose to look into the question of evidence of geometrical distortions.  I note that Dr Mario Latendresse has addressed this issue and published a paper on some of the aspects I’ve mentioned.  I’ll also search to see if there’s anything else on the web.  If you’re not already aware of Latendresse’s work on this, you may find the following links of interest as a starter:\nEvidence that the Shroud Was not Completely Flat During Image Formation\nDr. Mario Latendresse  [slide presentation]:\nhttp://www.sindonology.org/papers/latendresse2005aSlides.pdf\nThe Turin Shroud Was Not Flattened Before the Images Formed and no Major Image Distortions Necessarily Occur from a Real Body Mario Latendresse, Ph.D. Full paper PDF:\nhttp://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.160.656   and Click on Download Links.  Best wishes, daveb.\n\n","date":"September 14, 2012 at 4:17 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16298","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Thank you Dave. I already read Marios’s paper (in 2010) It is not inconsistent with my reconstruction. Best wishes. Max patrick Hamon\n\n","date":"September 14, 2012 at 4:59 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16302","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Unfortunatetly, several of Mario’s major & minor assumptions are biased (i.e. non-archaeological e.g. model’s head tilted backward not forward etc).\n\n","date":"September 15, 2012 at 7:48 am","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16316","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"I think it was a reasonably adequate pioneer effort.  He made some of the points that I felt needing bringing out in some of my recent posts over the last few months relating to a 3-D body surface versus a 2-D image on a cloth.  His conclusions advocate taking it much further with a variety of body dispositions and burial cloth arrangements, which would hopefully better identify both credible and unlikely processes and arragements.  There’s yet a long way to go, and I don’t know how much attention from other investigators his paper attracted.  It needs to be taken further.  Not only chemistry and physics, but geometry also has an important role in our understanding of “how it happened”.  Your point about the possibility of the changing dimensions of the cloth, damping and drying, also need to be take into account.\n\n","date":"September 16, 2012 at 12:08 am","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16327","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A different approach to what some see as problems with the image on the Shroud of Turin","post":"Dave, I do agree with you, Mario’s work was “a reasonably adequate pioneer effort”.\n\n","date":"September 16, 2012 at 1:49 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-16350","author":"Max Patrick Hamon","site":"shroudstory"}]
