[{"title":"A flow chart summary of the “hot Templar/hot template”model of the Shroud of Turin","post":"same hypothesis was proposed in new thriller, “The Linen God”. Great read.\n","date":"February 10, 2014 at 2:47 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2014/02/10/a-flow-chat-summary-of-the-hot-templarhot-templatemodel-of-the-shroud-of-turin/","cat":"crucifix","id":"comment-2965","author":"norman","site":"colinberry"},{"title":"A flow chart summary of the “hot Templar/hot template”model of the Shroud of Turin","post":"Sorry, haven’t read the book, and am not a great fan of novels, certainly not of the Dan Brown genre (which I found tedious and all too often predictable with those little puzzles imposed on the grand-daughter).\nI’ve looked at the reviews of Jim O’Shea’s  “The Linen God” but  they don’t give much away re storyline, so it’s difficult to know what to read into your “same hypothesis”. \nIf it’s a Templar connection, then I’m aware  that others got there before me, notably Knight and Lomas with their “Second Messiah”. But I did not see the image as Jacques de Molay, at least initially, but as Geoffroi de Charney, who occupies one of the boxes in my flow chart. That was through learning of the Lirey badge and its history (which can be written on the back of a postage stamp) and following the De Charny lineage back from nephew to almost-identically named uncle, assisted by the late genealogist Noel Currer-Briggs. Only then did I learn that de Charney and de Molay had been burned at the stake on the very same day in 1314. When it transpired that both had in fact been sadistically slow-roasted, bells started to ring, given the scorch-like nature of the TS image (see previous posting for the way in which numerous lines of evidence seemed to converge and reinforce each other).\n","date":"February 10, 2014 at 3:45 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2014/02/10/a-flow-chat-summary-of-the-hot-templarhot-templatemodel-of-the-shroud-of-turin/","cat":"crucifix","id":"comment-2966","author":"colinsberry","site":"colinberry"}]
