[{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"“Manos negras”?\nLos investigadores de la Sábana (pro-autenticidad y anti-autenticidad) debieran tomar el acuerdo de hacer un documento público dirigido al Papa en aras de “clarificar” la reliquia más importante de la cristiandad.\nCarlos\n\n","date":"January 25, 2015 at 3:43 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-186101","author":"Carlos","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"Google Translation:\n“Black hands”?\nThe researchers of the Shroud (pro-authenticity and anti-authenticity) should take the agreement to make a public document addressed to the Pope in order to “clarify” the most important relic of Christianity.\nCarlos\n\n","date":"January 26, 2015 at 4:49 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-186335","author":"Dan","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"Dan,\nSpeculating on why the images haven’t been shared is pointless since all we have is speculation. does anyone know the dots per inch of the images.\n\n","date":"January 25, 2015 at 4:35 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-186113","author":"John Klotz","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"The reason is not technical. The Turin’s diocese (in agreement with the Holy See, perhaps) does not want to allow the circulation of high definition images of the Shroud. And Haltadefinizione (who made the images freely) cannot share nor sell his images without the authorization of the the Turin’s diocese. The diocese does not allow researches to be conducted on the shroud without their authorization, and to see the images is considered research. So, practically, the original images of Haltadefinizione are useless because they remain closed in their computers, and will remain so.\nThis is not my speculation.\n\n","date":"January 25, 2015 at 5:23 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-186120","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"Thank you Andrea for your response. I would still like to know the precise definition of the images.\nFrankly we have a political problem. How do we influence Turin to move which really resolves to how do we influence the Pope to move?\n\n","date":"January 25, 2015 at 5:45 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-186123","author":"John Klotz","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"This will produce suspicion. What do church authorities not want us to know?\n\n","date":"January 25, 2015 at 5:50 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-186124","author":"Paulette","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"For the resolution, see the camera they used. http://en.wikipedia.org/wiki/Nikon_D3\nFor the rest, all is coherent: no seeing the shroud, no seeing images of the shroud, no studying the shroud, etc. etc.\n\n","date":"January 25, 2015 at 6:05 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-186128","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"It will have to be solved the same way as the dating of the Horses of St.Marks, where analysis of similar metal artefacts with gilding on them ( in the British Museum)  pinned the date down to not earlier than the second century AD. Up to shortly before learned professors were arguing with a mass of evidence that the horses were third or fourth century BC but once they were matched with other examples the later than second century date was confirmed and I don’t think there are now any doubters. What was already known about the horses was sufficient and they did not need further examination to confirm the date. Similarly the Turin authorities may well find themselves outflanked by research on other linens.\n\n","date":"January 25, 2015 at 7:30 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-186141","author":"Charles Freeman","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"Ouftlanked implies us versus them. I try not to think that way. But I do think the folks in Turin will find themselves increasingly left out of discussions and much research.\n\n","date":"January 25, 2015 at 8:34 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-186152","author":"Dan","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"Many of them find themselves increasingly left out of discussions and much research, but really they like it, because they think that… there is not discussions and research.\nI think so, because discussions and researches about the Shroud while the Shroud is closed in a casket, are often fantasies, hopes, conjectures, like discussions about Atlantis.\n\n","date":"January 25, 2015 at 8:55 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-186156","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"ONE factor is missing from discussion : Pope Francis who apears to have a commitment to ecumenism.\nLike I wrote above. This is a political problem with a small “p”.\n\n","date":"January 25, 2015 at 9:36 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-186163","author":"John Klotz","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"The access to the high definition images of the Shroud, conducted by the diocese of Turin, is something I have been looking forward for many years. As Andrea Nicolotti has pointed out, this is not a technical problem. It has never been a technical problem. \nThe main argument raised by the diocese of Turin is two-fold: \n1) Reproduction of the full size of the Shroud with a high level of fidelity should be under their control (for example, ordering a full-size Shroud image from Haltadefinizione requires the authorization of Turin), \n2) Research on the Shroud should be under the control of the Turin authorities.\nPoint 2 appears to be extended to the high definition images as if you were conducting research directly on the Shroud. \nPoint 1, of course, cannot be fully under their control as other high definition images are available to create full-size Shroud replica. \nI understand the reluctance of the Turin authorities to see these images treated in a cavalier manner or attitude. On the other hand, there is currently no researcher that have published any study using these images. And there is no clear channel of discussion to have access to them. It is as if no researcher in the world is worth looking at them.\n\n","date":"January 25, 2015 at 1:56 pm","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-186197","author":"Mario Latendresse","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"Mario, I must add a point 3:\n3) Turin authorities want to be payed for any use of their images, even if in a low definition.\n\n","date":"January 25, 2015 at 2:04 pm","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-186201","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"Regardless of reasons, real or speculative, here’s a heartfelt plea. Can anyone reading this who has the slightest influence with the Vatican and/or Turin authorities please use it to get some or all of that archive released to those of us who seek answers to the Turin Shroud. \nIt’s not as if we are coming from another planet. There’s been a kind of strip-tease already with that archive. First there was the BBC’s  “detailed” view of the Shroud based on Halta’s 2008 HD scan. There was also the face-only and whole-body image that accompanies Haltadefinizione’s own website promotional material, and, though I’m loath to mention it, the less-than-helpful Shroud 2.0 app for iPhones.  There are serious discrepancies between the three of those when one compares RGB constitution in simple photoediting programs as I can demonstrate. That would be tolerable except for the hints that the “faint sepia” image is not as homogeneous as often claimed, with suggestions of two types of “brown” with differing RGB, one with a remarkable strong red component. See also Ray Schneider’s monograph for the Ohio conference. (Links can wait for now).\nIt’s simply not fair to tease researchers, amateur, professional, or a mix of the two, with the present peek-a-boo routine. Let’s have ALL the 2008 scan data out in the public domain right now! To withhold it while ‘tutoring’ 150 journalists in the run-up to the 2015 Exposition on the correct way to interpret the Shroud smacks of the worst kind of news management, dare one say manipulation and control-freakery.\n\n","date":"January 25, 2015 at 2:47 pm","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-186208","author":"Colin Berry","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"It was the confluence of several processes and individuals that got the STURP examination done.\nI might point out that the “Turin Authorities” report to the Pope who owns the Shroud and has the ultimate authority. The current Pope is not above doing things his own way. In Chapter 17 of my book, that Pope Francis is virtually a prophet of an Apocalypse of Selfishness. He is also the most ecumenically minded Pope in recent history.\nI have posted the Chapter 18 of my book at  http://quantumchrist-jck.blogspot.com/ states the challenges the Shroud poses for the Church, Science and Humanity. It includes a quotation from Fr. Anthony Delessi: “We Roman Catholics have been its custodians for the last eight hundred years after stealing it from the Greeks (i.e. Orthodox) who performed that function for the first twelve centuries. But in truth, it belongs to no one denomination – maybe not even to Christianity. Rather, it is in actuality ’God’s love letter in linen to all mankind.’”\nI have appended a paper by Kim Dreisbach  on the ecumenical implications of the Shroud which may be  read on Shroud.com at http://www.shroud.com/pdfs/dreisbach4.pdf\nPope Francis is giving more than lip service to ecumenism INCLUDING THE GREEK ORTHODOX  WHO MAY BE NURSING A CLAIM OF THEIR OWN that has been on the back burner for 900 years or so.\nIs there anyone with the slightest experience with either politics or academic intrigue that does not see a picture here? \nThere is a tide flowing. Let me close with a bit of Shakespeare: “There is a tide in the affairs of men. Which, taken at the flood, leads on to fortune; Omitted, all the voyage of their life. Is bound in shallows and in miseries.”\nIf you wish to order The Coming of the Quantum Christ:\nCreateSpace\nhttps://www.createspace.com/5049060\nA hard copy full color version can be order from CreateSpace:\nSmashwords\nhttps://www.smashwords.com/books/view/509210\nThere are eight different formats that you can download on Smashwords and actually read a free sample. Epub can be read by Nook and Adobe Digital Editions.  Mobi can be read by Kindle.\nYou can also  order the print version or E-Book from  Amazon and Barnes and Noble\n Search for “Quantum Christ and Klotz” on their web sites:\nhttp://www. Amazon.com and\nhttp://www.barnesandnoble.com/\n\n","date":"January 25, 2015 at 5:08 pm","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-186229","author":"John Klotz","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"If anyone might convince Francis to provide more access it may be Barrie.\n\n","date":"January 26, 2015 at 9:51 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-186391","author":"David Goulet","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"Good idea in principle David. There’s a risk however that the esteemed BS of STURP/STERA might find himself in pot/kettle territory:\nWhy? Here’s an extract from STERA’s own website (re its gallery of copyrighted images – my italics).\n“These images are provided as a convenient online catalog from which authors, publishers, picture researchers and producers can select and license high resolution, reproduction quality 300dpi images for use in books, magazines, television programs, etc. We do not permit our high resolution files to be published on the internet but can provide 72dpi versions for such uses.\nhttps://shroud.com/gallery/index.htm\n\n","date":"January 26, 2015 at 10:29 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-186400","author":"Colin Berry","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"David,\nNo one has more respect for Barrie than I do. Seriously. However, when STURP got approval there was a confluence of factors that created the impetus. Foremost was Fr. Rinaldi who bridged the world of Turin and the US. Although some in STURP may be reluctant to recognize it, there was also the impact of Silent Witness which was screened on Italian TV before the final approval was given for STURP (and there was extraordinary support for Silent Witness by Fr. Rinaldi who opened doors in Turin for David Rolfe.)\nI am curious as to whether the wild card in this deal might indeed be the Greek Orthodox. If we win the support of the Greek patriarchs for renewed testing, that might be a voice that Francis would listen too. Their position might be “You can keep the Shroud but you have to allow more scientific examination for you hold it in trust for humanity.” That might be a pipe dream but, maybe not. And there are also other ecumenical leaders who might be recruited. \nFrankly, I am clueless how and who to do that. But its the kind of strategy that might have promise.\nThe argument that the Shroud is held in trust by the Pope for all humanity is the foundation for further testing. It is also an argument which might appeal to Pope Francis.\nThink ecumenical.\n\n","date":"January 26, 2015 at 10:34 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-186402","author":"John Klotz","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"Think ecumenical.\nOr simply think ecu.\nhttp://en.wikipedia.org/wiki/European_Currency_Unit\n\n","date":"January 26, 2015 at 10:42 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-186404","author":"Colin Berry","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"Have to agree with John for the most part..but think John Paul was even more ecumenical …..not sure i’m as conspirasy minded as some in this thread though….\nWhy stop at Christians?…remember from an  earlier post on this blog?”…How about Muslims?\n“The figure of Jesus as seen through the symbol of the Holy Shroud, will be the focus of the dialogue between Msgr. Ghiberti and Imam Pallavicini”\n\n","date":"January 26, 2015 at 10:52 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-186408","author":"rick","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"I was thinking ecumenical in that Barrie is not Christian. He also has the trust and respect of most Shroud parties. He’s one of the last men standing from STURP – which may appeal to the idea of providence acting in this. I like the Greek Orthodox approach as well.\n\n","date":"January 26, 2015 at 10:58 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-186410","author":"David Goulet","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"often wonder that if barrie thinks the shroud is real…why he is not a Christian…..wanted to ask him that one of these days\n\n","date":"January 26, 2015 at 5:47 pm","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-186493","author":"rick","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"In my idea (perhaps) someone (= UTET) in Turin wanted to sell a book…\nWhy not?\nPerhaps that book (and that book may not have been printed unnecessarily, if we have to pay a certain price this means that was a valid book…) was also designed for “a small elite of researchers”.\nI am amazed about Nicolotti, he is an Italian academic… or not ?\nSo…\nWhat is the exact meaning for the strange claims\n(= … does not want to allow the circulation of high definition images of the Shroud…,\netc. …) that seemed to be directed against the Holy See and Turin?\nYou’ve got to be kidding!\nIs a research the simple fact to read a book (published by UTET) and observe the images?\nNot, this is only the first step.\nBut, before to start with a research, we have (at least) to read the books\nin order to increase our knowledge …\n… thus: we have to be better prepared about the discussion around\nthe question of high definition Haltadefinizione images.\nNow I ask:\nHave you bought that book ?\n… Why none of the bloggers thinked in that simple manner?\nWhy (perhaps often) on this interesting blog I turn near alone with only my horsewhip?\nPlease, read under the address:\nhttp://www.haltadefinizione.com/en/news/145-the-holy-shroud-a-provocation-to-intelligence-mirror-of-the-gospel-introduction-of-the-valuable-volume-with-the-images-by-haltadefinizione.html\n>The images of Haltadefinizione are the main protagonists of a new publishing enterprise. On the occasion of the Solemn Ostension of the Holy Shroud in 2010, UTET, the historical Publishing House of Turin, realized a short run valuable volume using the stunning pictures fruits of the campaign of very high resolution shots made by HAL9000-Haltadefinizione. …\n— — —\nSo…\nDear forced noncombatants (…an artistic evidence of Atlantis…),\nHave you discovered a similar useful example (ie: from NY Metropolitan Museum?)?\n— — —\nI hope in your attention …\nHere another reference:\nhttp://www.mondosindone.com/Site/documenti/DSS001_01%20-%20Bibliografia.pdf\nSindone (2010)\n>Sindone, presentazione card. Severino Poletto, Torino, UTET [De Agostini], 2010, 380×420 mm, testi di Bruno Barberis, Gian Maria Zaccone, Timothy Verdon, Edizione di pregio, rea-lizzata in 599 esemplari, dei quali 499 in cifre arabe [51/499 il numero del volume acquisi-to], 80 in cifre romane, 20 fuori commercio di cui il primo esemplare offerto al Santo Padre, con foto ad altissima definizione realizzata da Haltadefinizione, con 3 tavole a 4 ante di grande formato (1460×420 mm) e 4 tavole a pagina intera (355×40 mm), applicate manual-mente, stampata su carta Hahnemühle con tecnica IJFA (Ink Jet Fine Art) con sistema d’in-chiostro a pigmenti a 12 colori.\nRough translation =\n= Shroud (2010)\n> Shroud presentation card. Severino Poletto, Torino, UTET [De Agostini], 2010, 380×420 mm, texts by Bruno Barberis, Gian Maria Zaccone, Timothy Verdon, Edition fine, realized in 599 specimens, of which 499 in Arabic numerals [51/499 the volume number acquisi-to], 80 in Roman numerals, 20 out of the market when the first model offered to the Holy Father, with high definition pictures made by Haltadefinizione, with 3 tables with 4 doors large format (1460×420 mm) and 4 tables full page (355×40 mm), applied by hand, printed on Hahnemühle paper with IJFA technique IJFA (Inkjet Fine Art) system with in-cloister in 12-color pigment.\n\n","date":"January 26, 2015 at 10:43 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-186405","author":"piero","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"Piero, I do not know why you are amazed. The UTET’s book was sold for 3790 euros (=4270 US dollars), so a normal person will not buy it. It is one of those books that are a piece of art rather books. The texts inside have nothing new or special. The images, very nice, are not useful for research and are printed. So that book with those images cannot be used for scientifical purposes.\n\n","date":"January 26, 2015 at 11:05 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-186412","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"Andrea: might it be worth an approach to your Accademia dei Lincei (“Lincean Academy”) with a view to getting the 72GB image scan into the hands of researchers, or indeed the public domain?\nI see from wiki that the Academy is hailed as Italy’s premier scientific society. Its origins can be traced back to 1603, but its remit also extends to “humanistic studies: history, archaeology, philosophy etc”. \nhttp://en.wikipedia.org/wiki/Accademia_dei_Lincei\nSadly sindonology was not in the list, but maybe something can be done about that.\nInterestingly I see it “underwent a true revival in 1847 when Pope Plus IX reformed it …” (still wiki). Its constitution allows it to have a substantial number of foreign as well as Italian members making it truly international. Past members that are name-dropper friendly are: Galileo, Albert Einstein, Louis Pasteur, Enrico Fermi, Max Plank, some of all of whom may tinkle a tiny bell.\nThe important thing is to bypass the secretariat. Maybe you have contacts with one or more of its Members, Andrea, able maybe to have a quiet word in the ear of the Academy’s Presidente?\n\n","date":"January 26, 2015 at 11:42 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-186418","author":"Colin Berry","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"PS: I see that Andrea is the author of 5 books and 17 papers. \nhttp://unito.academia.edu/AndreaNicolotti\nI say Dr. Nicolotti is just the man to set about liberating Halta’s 72GB of HD image data from the grasping hands of its over-possessive custodians. Didn’t he say not so long ago that he lives just a few blocks from where the TS is housed?\n\n","date":"January 26, 2015 at 12:07 pm","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-186419","author":"Colin Berry","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"“”I say Dr. Nicolotti is just the man to set about liberating Halta’s 72GB of HD image data from the grasping hands of its over-possessive custodians””””.\njust tried, and failed.\n“””Didn’t he say not so long ago that he lives just a few blocks from where the TS is housed?”””\n120 meters.\n\n","date":"January 26, 2015 at 12:39 pm","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-186426","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"“…just tried, and failed….”\nHow? In person? Over the phone? That was quick – possibly too quick.\nMaybe the ghost of Galileo will visit you in the night, and instruct you on how best to pursue the logic and justice of your case…\nSweet dreams.\n\n","date":"January 26, 2015 at 12:53 pm","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-186430","author":"Colin Berry","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"In person\n\n","date":"January 26, 2015 at 12:58 pm","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-186431","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"Se in un primo momento non ci riesci, prova a riprovare …\n\n","date":"January 26, 2015 at 1:07 pm","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-186434","author":"Colin Berry","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"Colin, I know someone at the Lincei Academy, but… if they do not want to give the images, so… they will not give them. They give not the images to sindonologists, and do you think that will do this with an indipendent academy?\nThe problem is only one: on 1946, end of the Italian kingdom, the State forgot (or avoided) to confiscate the Shroud. So,if the pope is his owner, the scientifical academy has not possibilities to be heard.\nAs the Shroud is owned by the Church, the scientifical problems are a detail of secondary importance.\n\n","date":"January 26, 2015 at 12:15 pm","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-186421","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"Andrea: I would have thought that one of your country’s  learned societies, the premier one we’re told where science is concerned, counts for more than the battling pro- v anti-authenticity camps of those who research and/or comment on the Shroud. \nIt’s not for me to give you advice on dealing with your countrymen. All I’d say is that you may be underestimating the prestige of learned societies, scientific ones especially, and the esteem in which they are held by those not ideologically anti-science, both within and outside Italy. All it take sometimes is a word in the right (respected) ear to overcome obstruction and inertia – to shame people into action.\nThere are those who are just naturally lazy, and given to doing nothing rather than something. They need to be given a prod…\n\n","date":"January 26, 2015 at 12:40 pm","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-186427","author":"Colin Berry","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"See for example:\nLa lettura del Telo, Bruno Barberis e Gian Maria Zaccone, at pp. 21-69.\nStoria, devozione e scienza, di Bruno Barberis e Gian Maria Zaccone,, at pp. 71-136.\netc.\n\n","date":"January 26, 2015 at 11:23 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-186414","author":"piero","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"IMHO the book contains valuable information (= not known to the generic public).\nIn any case it would be interesting to know how they (= Haltadefinizione) run their\nangle shooting for different photographs.\nLighting for Texture.\nThe most important thing to think about when photographing any fabric is texture. No matter what type of fabric you’re shooting. The light needs to be directional to bring out textures … And these expedients apply to the classic way to photograph textiles…\n— —\nTo study the optical properties of materials, one needs a complete set of the angular distribution functions of surface scattering from the materials…\n— —\nHere another question:\nHow to investigate the transparency and the luster of the yarns using a Nikon apparel?\n— —\nDo you know the value of your (previous) exchange’s intellectual property?\nI don’t think that your (previous) exchanges of messages are a discussion valid to utterly dismiss erroneous and simply wrong informations that have a life of a book..\nIn any case I believe that the time-factor is a fundamental element of intellectual property rights. …  But I hope that this message will not be turned in a sort of attempt to foist a preconceived approach against an interesting and costly book …\n\n","date":"January 27, 2015 at 9:18 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-186633","author":"piero","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"“… grasping hands of its over-possessive custodians”???\nSorry, I think we are not yet fallen into an Internet-communist world\nor in an Shroud freaks dispotic domain…\n(…and then Charles Freeman is still free to speak about a very strange idea)\n… And then:\nhere my poor counselling service (I didn’t tried to contact the ghost of Galileo):\nThe proper way where to start with an academic request seems to be the Pontifical Academy…\nPerhaps I am too harsh in my comments,\nbut here I want to add:\nWhy you disregarded that respectable Academy?\nFor example:\nThe previous Pope (Pope Benedetto XVI) before the election to the papal charge\nwas honorary member of this Academy.\nI remember that, in the past (near ten years ago), I tried to send a Letter\nto the open-minded President of the Pontifical Academy of Sciences\n(at the time the President was the well known prof. Nicola Cabibbo.\nNow he is deceased, he passed away years ago…) and this was an attempt done\ntogether other researchers… (but [IMO] there was something of bad about\nthe question of a warranty for true analyses … before the request of a new 14 C.\nSee also: the possible eternal destruction of the samples !\nAnd then: all vanished!) \nIn any case, before to bother the high Pontifical Academy,\nthere is the Commission in Turin (unfortunately I don’t know who is the\ntrained counsellor of Card. Nosiglia)…\n— —\nAnother strange question:\nI am curious about a possible attempt to involve of the\nWorld Federation of Scientists regarding this 72GB question.\nWhat is your opinion?\nNow I hope in your interesting answers.\n— — —\nB.T.W. : I was a bit curious about the (presumed) problem regarding the property\n(= what has been indicated us by Nicolotti), perhaps some action by Riggi di Numana can be revisited\nunder that particular light…\nWhat is your idea on that old hot argument?\n-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-\nUnder:\nhttp://en.wikipedia.org/wiki/Juan_Maldacena\nWe can read:\n>Juan Martín Maldacena (born September 10, 1968) is a theoretical physicist born in Buenos Aires, Argentina. Among his many discoveries, the most famous one is the most reliable realization of the holographic principle – namely the AdS/CFT correspondence the conjecture about the equivalence of string theory on Anti-de Sitter (AdS) space, and a conformal field theory defined on the boundary of the AdS space.\n>In 2013, Maldacena co-authored an analysis of the 2012 black hole firewall paradox with Leonard Susskind, arguing that the paradox can be resolved if entangled particles are connected by tiny “wormholes.”\n[B.T.W. : See also Wim Ubachs and the wormhole under the addresses:\nhttp://www.nat.vu.nl/~wimu/\nhttp://www.nat.vu.nl/~wimu/Pictures/invito.jpg ]\nHere there are other links about Ubachs:\nhttp://arxiv.org/abs/1501.05533 (=  A constraint on a varying proton–electron mass ratio 1.5 billion years after the Big Bang)\n… then the deviation from the current laboratory value of Δμ/μ and see= http://en.wikipedia.org/wiki/Proton-to-electron_mass_ratio\nKeck telescope constraint on cosmological variation of the proton-to-electron mass ratio\nhttp://onlinelibrary.wiley.com/doi/10.1111/j.1365-2966.2009.16227.x/abstract\nat the end of the Abstract we can read:\n… …To assist future μ-variation analyses of this kind, and other astrophysical studies of H2 in general, we provide a compilation of the most precise laboratory wavelengths and calculated parameters important for absorption-line work with H2 transitions redwards of the hydrogen Lyman limit.\nUnfortunately I have not another time…\n\n","date":"January 28, 2015 at 9:59 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-186947","author":"piero","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"Extract from  the wiki entry on the Pontifical Academy of Sciences( which incidentally I did not “disregard”, alluding as I did (above)  to the start of its complex historical  intertwining with the much longer-established Lincean Academy):\nMy italics:\n“The (Pontifical) Academy has its origins in the Accademia Pontificia dei Nuovi Lincei (“Pontifical Academy of the New Lynxes”), founded in 1847 intended as a more closely supervised successor to the Accademia dei Lincei (“Academy of Lynxes”) established in Rome in 1603, by the learned Roman Prince, Federico Cesi (1585–1630) who was a young botanist and naturalist, and which claimed Galileo Galilei as its president. The Accademia dei Lincei survives as a wholly separate institution.\nQuite what’s meant by “more closely supervised” is anyone’s guess. Is  that merely administrative supervision – which somehow I doubt?  Or is suggesting that science is prone to be a loose cannon, needing to be restrained by many safe pairs of hands?\nPersonally, I prefer the concept of the Mark 1 pre-1847 Lincean Academy, the one in which scientists were free spirits,  kindred spirits of Galileo, but, unlike him, not having to look nervously over their shoulders, not fearful of crossing invisible red lines…\nForgive me if I say that’s my last word on the Pontifical Academy. It may be reassuring to certain  scientists, inside and outside Italy,  to know that their scientific endeavours are considered by the Vatican to be entirely compatible with their religious beliefs. Some of us manage to function as scientists without needing that reassurance. Science is in essence a methodological approach, requiring no outside patronage or approval and indeed better off without that kind of spiritual input and/or invigilation except maybe post-publication.\n\n","date":"January 28, 2015 at 2:26 pm","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-187000","author":"Colin Berry","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"Colin, Sorry!\nI was a bit puzzled about your words…\nand your hasty decision:\n“Forgive me if I say that’s my last word on the Pontifical Academy. …”\nTry to consider, for example:\nthe experiments performed into the lager…\nYes, they were not “great scientists” (…surely!), but …\n… and what about the flies of V1 and V2 ?\nand then see also the reverse side of the medal:  Von Braun …, etc.\n…So, in my opinion, we have to try to be a bit more careful in our particular statements\nabout Science or presumed neutrality of Science, etc. …\nThe Man can perish with the effects of Technique\nthat himself develop through scientific research.\nThat phrase (written by Pope JP II) was built with iron over the entrance of the “Eugene Wigner Institute” (in Erice)…\nTry to show your opinion about the work done by Zichichi, who is a great scientist.\nHere I refer to the famous: “International Seminars on Nuclear War” (since 1981) and Planetary Emergences…\nBut, perhaps you don’t love Zichichi…\n…and the Pope John Paul II (who visited Erice and the scientist of WFS in 1993\n[= meeting of May 8, 1993])!\nOK.    But Science (= the Study of the presumed Logic of Create) and\nTechnique (= the use of Science, for good or bad things!) have to be considered separately.\n…and then …\nWhat is the meaning of certain horrible perspectives opened with the manipulations\nin order to create an alternative with respect the natural law of God?\nSo… You can raise questions about that “presumed connection” (with God!)…\nOK. I will be happy to understand where (exactly) you want to go…\nProbably I also have to be more refined and try to revisite Immanuel Kant\non Religion and Science…\nIn any case Pontifical Academy seemed to me in a good condition, a certain free ambient (one of  the members is Hawkings!) where (perhaps) you can\nshow a certain approach toward the Science and Progress or where you can discuss your ideas…\nI think you have to show where is the failure of that idea.\nThank you in advance! …\n——————————————\nAt the end before to leave, two poisoned lines: \nUnfortunately I don’t know what are the exact conditions for the researches\nby Fazio and Mandaglio with respect the high scientist Zichichi…\n… and this last part is defined with a Latin saying :\n“In càuda venenum”,\ninspired the scorpion, which has the sting at the tail end. It is used in various ways …\nCheers!\n\n","date":"January 30, 2015 at 11:17 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-187464","author":"piero","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"Errata corrige\n… and this last part can be defined with a Latin saying :\n“In càuda venenum”, inspired from the sting of the scorpion, he has the sting at the tail end.\nInstead of:\n>… and this last part is defined with a Latin saying :\n“In càuda venenum”,\ninspired the scorpion, which has the sting at the tail end.\n\n","date":"January 30, 2015 at 11:24 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-187466","author":"piero","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"So what’s a Pontifical Academy for, piero? Is it maybe to, er, pontificate – about science ? Fair enough. One can understand why the Pontiff and his Vatican staff might wish to pontificate about science. Lots of people do it. But why would scientists  need to be a member of the Pontifical Academy?  I would include in that your Stephen Hawking, though I’ve always had my doubts about classifying all cosmologists as scientists as distinct from mathematicians or philosophers.). What do they need to pontificate about in that rarified gathering? Philosophy? Theology? The mystery of the cosmos? Frankly I don’t see that any of that has much to do with the day-to-day business of doing science. Personally I’d find it a bit of distraction. Others might not, but the important thing is not to read too much into one’s failure to endorse or heap praise on associations that one has no motive or desire to join. I have no motive or desire to join lots of societies and associations, and my failure to laud them should not be seen as tacit criticism, far from it. I just like a quiet life, focused on the things that interest me. The Pontifical Academy does not interest me in the slightest, not having the faintest clue as to why it exists or needs to, unless as I say, it’s merely to allow the Pontiff to pontificate.\nAnyway, having no doubt bored you senseless with my non-views on an organization to which I’m totally indifferent, I wish you well, and shall now turn my attention to other things, like planning my motoring holiday to Spain and Portugal, starting at the Bilbao ferry port, and taking in Salamanca, the Douro valley and Porto. Santiago de Compostela is not on the itinerary, it not interesting me in the slightest (as before, that’s not to be taken as a criticism).\n\n","date":"January 30, 2015 at 11:55 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-187473","author":"Colin Berry","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"Colon,\nSpare the ignorant insults.\nYour evident disdain for everything Roman Catholic gets in the way of your presumed scientific judgment. The Pontifical Academy is in fact ecumenical. The conference last Spring on climate change  included the Nobel prize winner who discovered the Antarctic Ozone hole and at least postponed that Apocalyptic event. The person selected to give the final summing-up to the conference was a NY Times reporter (of Jewish heritage, I believe.) Indeed, the most strident and listened to voice warning that human greed is threatening humanity’s extinction is, gasp, a Pope no less, the one named named Francis..\nIf it wasn’t for the House of Savoy and the Catholic Church the Shroud would have vanished centuries ago. It certainly would not have survived the Reformation and/or the French Revolution. Most of its copies were in fact lost. None of this excuses the debaucheries of the Medici popes or the persecution of  schismatics. But it was Henry the Viii  who executed Sir Thomas Moore. The excesses of Catholic Queen Bloody Mary were more than matched by those of her Protestant successors and Cromwell. \nGiven your attitude, I doubt that you will ever get within a country mile of individuals engaged in serious research on the Shroud with little time for  self-involved navel gazing speculations.\n\n","date":"January 30, 2015 at 12:26 pm","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-187476","author":"John Klotz","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"Colin,\nStrangely, the French Wiki entry of “Academie Pontificale des sciences”, does not contain the words ” ..a more closely supervised successor…”.\nMoreover, look at: http://www.casinapioiv.va/content/accademia/en/about/history.html\n“Relationship to the Holy See:\nThe Pontifical Academy of Sciences is an independent entity within the Holy See. Although its rebirth was the result of papal initiative, and though it is placed under the direct protection of the reigning Supreme Pontiff, the Academy defines its own goals with regard to its statuted mission: “…to promote the progress of the mathematical, physical and natural sciences and the study of epistemological problems relating thereto” (Statutes 1:2). Pius XII underlined the Academy’s freedom of inquiry in an address of 1940 to the Academicians: “To you noble champions of human arts and disciplines the Church acknowledges complete freedom in method and research…”. Since the deliberations and studies which it undertakes are not influenced by any one national, political or religious point of view, the Academy constitutes an invaluable source of objective information upon which the Holy See and its various bodies can draw.”\n“Complete freedom in method and research”.\nEither the author of the English version of Wiki can demonstrate that the Academia is “a more closely successor” (of the Accademia dei Lincei) or you must ask him to remove this sentence.\nIncidentally, I have seen that 2 of my teachers when I was a young (!!) student are members of this prestigious academy.\n\n","date":"January 30, 2015 at 4:26 pm","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-187512","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"My position re the Pontifical Academy of Sciences would be exactly the same if instead it had been an imaginary Archbishopric of Canterbury Academy of Sciences, TH. It wouldn’t matter to me how many distinguished member it had. Why does it exist? What possible purpose is served by this marriage of church and science, especially if, as you say the members retain total freedom of action and speech. It looks to me like nothing more than a public relations exercise on the part of the Church.  “Look how modern and open-minded we are”. As for the members, I cannot see for the life of me what the scientists and other scholars get out of it, especially when some, notably Stephen Hawking, make no secret of their atheism. The expression ‘strange bedfellows’ springs to  mind. \nAs for expecting me to correct the UK wiki entry, I feel no obligation to do so, knowing little and caring less about the peculiar history you cite TH.\nHowever, there is one entry In the UK wiki I’d like to see corrected. It’s this one in the “Shroud of Turin”:\n“Instead of painting, it has been suggested that the bas-relief could also be heated and used to scorch an image onto the cloth. However researcher Thibault Heimburger performed some experiments with the scorching of linen, and found that a scorch mark is only produced by direct contact with the hot object – thus producing an all-or-nothing discoloration with no graduation of color as is found in the shroud.[193]”.\nBut the pdf paper in question did not use a bas relief. It used a  very basic template consisting merely of two flat planes only. So while there may have been no gradation of intensity in your tests with that template, as I pointed out back in 2012, those findings are totally irrelevant (and frankly misleading). Bas relief templates and especially fully 3D ones (like my brass crucifix) produce a very satisfactory gradation of image intensity which respond well to 3D rendering (impossible if there had been no gradation).  It’s that entry above I’d like to see removed from wiki, TH. However, I leave that to you or others, having neither the time nor patience to deal with faceless and all too often abrasive wiki editors operating under their pseudonyms.\n\n","date":"January 30, 2015 at 5:16 pm","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-187521","author":"Colin Berry","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"Colin,\nRegarding the Pontifical Academy of Sciences, you have perfectly the right to do what we call here “un proces d’intention”. \n“Why does it exist? What possible purpose is served by this marriage of church and science, especially if, as you say the members retain total freedom of action and speech. It looks to me like nothing more than a public relations exercise on the part of the Church.”\nIt exists because the Church does consider that Science with its own magisterium has something to tell that is important to consider when the Church (with its own magisterium) has to think about some fundamental questions.\nIt is not at all a question of “marriage”. \nAs long as science does not consider itself as a religion (I mean science as being allegedly able to give the final and complete sense of the Reality) , which occurs too often, even today, science is an approach that can’t be ignored by the Church.\nThe best example is that of the theory of Evolution (which is more than a theory, according to Pope John-Paul II).\nThis theory, as well as the critical studies of the texts etc. has completely changed the understanding of the Revelation.\nYou have the right to consider the existence of the PAS as a “public relation exercise”.\nI will not discuss this point more later since everybody (you included) understand what I mean. \nRegarding the Wiki entries about the Shroud, I am not the author.\nHowever, I still do consider that ”  a scorch mark is only produced by direct contact with the hot object ” and that there is no gradation of intensity similar to that observed on the shroud.\n\n","date":"January 31, 2015 at 4:45 pm","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-187845","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"I’ve just discovered this through googling – 4 pages from 2008 giving the Vatican’s raison d’etre for the existence of the Pontifical Academy of Sciences (and Culture etc etc). \nhttp://discovermagazine.com/2008/sep/18-how-to-teach-science-to-the-pope/\nEven the Turin Shroud gets a mention on Page 4 (“We might set up our own research effort” or words to that effect). \nHaving read it carefully, I still maintain what I said earlier: the Pontifical Academy of Sciences should not in my view exist, and I simply do not understand why any scientist outside of the Roman Catholic church would need or wish to be a Member (which is not intended as a criticism  of the RC church, more of non-RC scientists). \nScience and religion can coexist without attempting to fuse or blur the distinction between the two. Science is, or should be a free spirit. Nothing should be set up by way of formal institutions etc that might threaten, endanger or in any way constrain the independence of science and that of working scientists.  \nI shall re-read your first scorch paper again before commenting further in detail, except to say that there is a world of difference between saying: ” … there is no gradation of intensity” and  “…there is no gradation of intensity similar to that observed on the shroud(my italics).” One needs always to separate the essential scientific principles from the morass of technical detail.\n\n","date":"January 31, 2015 at 5:59 pm","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-187863","author":"Colin Berry","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"Colin, excuse the typo in your name. I assure it was not intentional.\n\n","date":"January 30, 2015 at 12:27 pm","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-187477","author":"John Klotz","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"To those here who share my irritation at seeing the term ‘apocalyptic’ bandied around by those with no thorough grounding in the sciences –  lab-based or environmental –  I recommend the start of this Popular Science article. \nhttps://books.google.co.uk/books?id=mwEAAAAAMBAJ&pg=PA4&lpg=PA4&dq=ozone+hole+worst+case+scenario&source=bl&ots=n_NcjzqSYe&sig=gPCLGEZNkga1oJP_iq-buwF5PeY&hl=en&sa=X&ei=T8HLVIyyF4z3PNjzgfAK&ved=0CFMQ6AEwCQ#v=onepage&q=ozone%20hole%20worst%20case%20scenario&f=false\nI discovered it a few minutes ago, simply by googling “ozone layer worst case scenario”.\nAccording to that article, it’s not a case of Apocalypse averted,  even with a hypothesized total destruction of the ozone layer. Excessive uv is undesirable, certainly,  increasing rates of skin cancer, decreased crop yields etc, But we already know and protect ourselves from excessive exposure to sunshine.  So let’s not go scare mongering, even retroactively, or devaluing the term “apocalypse”. Or maybe that term is linked in with another agenda. \nI’m always somewhat suspicious of those who consider their opinions to justify the writing of an entire book, especially the vanity-self-published variety.  If it’s a really good and original idea, it should need no more than a 1000 words or so at most. \nI personally try to limit my ideas to blog postings, and even (more recently) to comments on other people’s sites. Whether the ideas are good or bad remains to be seen.  Dan and his postings seems to see some use for them, if only as eye candy. The truth will out, as they say. I’m happy to wait and see, having no book, or even magazine article in the offing.\n\n","date":"January 30, 2015 at 1:03 pm","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-187481","author":"Colin Berry","site":"shroudstory"},{"title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers","post":"archaeometric research and investments\nI beg your pardon about the confusing end of my message\n(= “two poisoned lines”) …\nPerhaps yesterday I wrote in that hasty and erroneous loathsomely manner because\nI was loath to accept a contradiction :\nthe big difference about the Great Theory by Zichichi (= try to think how interesting idea is the Superworld!   … a presumed scientific reality with 43 dimensions: 11 of the “boson” type and 32 of a “fermion” nature, … etc. …)  and the “poor way” followed  by Fazio and Mandaglio (with no true experiments!)…\nThen…\nOn one side this is puzzling, on the other side we can guess something\nabout the distance for these scientists from the textile world …\n… and also clearly we are aware for the connection\nabout the stimulus to start with studies\n(on our old textile repert) as originated from\nthe need of a development strategy starting with (for example)\nthe question of poorness of resources dedicated to the advanced textile controls …\nBut, as you can easily remember, in one of the past messages I indicated the good conditions for creativity:\na certain degree of obsession is required and cannot be generated in a diffuse group\nand it is required some isolation from standard thinking … (in order to start with new thoughts…)…\nThere is a great problem to bypass : the lack of combinatory experiences\nin order to start with the Evolution of Non-Destructive Dating (= ENDD)…\n For example:\nProf. Fanti (and Malfi) was the first to open the way of mechanical tests\nwith comparisons on old linen samples and samples coming from the Shroud,\nbut that work was still in the realm of destructive controls…\nIn any case at the end the trivial question to solve will be:\nWho wants to pay for new tests?\nThis cannot be an unsolved problem (this is due to the highest interest involved in that\narchaeometric research…).\n\n","date":"January 31, 2015 at 6:20 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","id":"comment-187724","author":"piero","site":"shroudstory"}]
