[{"title":"Flow chart summarising a novel hypothesis for how the Shroud of Turin came into existence (and fooled generations of scholars)","post":"I see that the roving eye of David Goulet has spotted this posting, and flagged it up across the way:\nThe C-14 date range actually poses a problem, imo, for the forgery theory. Why would a forger go to the trouble to make something look 1st century but use ‘fresh’ linen? Wouldn’t you try and obtain older linen?\nColin, if you’re following this, I can see why you have suggested the image was first your Templar, then later revised to be Christ. This hypothesis would explain why the linen was fresh but then needed to be artificially aged to look ancient.\nAnd before John and Yanonymous pipe in about the absurdity of that hypothesis, I’m not promoting it here. I’m merely pointing out how it is at least consistent in dealing with the problem of a forger brilliant enough to make something look so 1st century, yet failing to make it on older linen.\nIf the linen were subjected to all those treatments listed by Antoine de Lalaing, whether for the reasons he gave, or as I believe to artificially age, then there’s another problem for the authenticity-promoters. What about the bloodstains if there from the start? They would end up substantially degraded. Yet Rogers claimed the blood showed no signs of having been heated (leaving aside the questionable nature of his improvised ‘hydroxyproline’ test). Methinks we are seeing negative evidence for the absence of blood on the Mk1 or even Mk2 shroud.  Had it been present, would any sensible Shroud custodians have launched into otherwise bizarre tests with boiling oil, for whatever reason?\n","date":"February 22, 2014 at 10:14 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2014/02/21/flow-chart-summarising-a-novel-hypothesis-for-how-the-shroud-of-turin-came-into-existence-and-fooled-generations-of-scholars/","cat":"medieval_forgery","id":"comment-3105","author":"colinsberry","site":"colinberry"}]
