[{"title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?","post":"Hello there I am so happy I found your web site,\nI really found you by accident, while I was researching on Google for something else, Regardless I am here now and would just\nlike to say cheers for a incredible post and a all round interesting\nblog (I also love the theme/design), I don’t\nhave time to look over it all at the moment but I have saved it and also added in your RSS feeds, so when I have time I will be back to read a great deal more, Please do keep\nup the excellent job.\n","date":"June 21, 2017 at 1:50 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","id":"comment-9544","author":"how Effective is ivf","site":"colinberry"},{"title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?","post":"Ah, but it will be ignored, David – see the narrative-driven prospectus for next year’s Shroudie jamboree (Pasco, Wa) – mentioned with link in my latest posting this morning. Tunnel-vision (with bright light at end) pro-authenticity sindonology has no time for anyone or anything that is off-message.\nYes, my message will get through, eventually, but it may take years rather than months, given the unstoppable momentum built up by those who are still totally fixated by the initial impact made on them by that luminous other-wordly tone-reversed TS image (yup, assisted by the Secondo Pia magic wand, converting a somewhat unattractive sepia negative imprint to an anachronistic  ’20th century B/W positive image’ – or so it might seem to those who let their hearts rule their heads …\nI blame their schools myself, failing to inculcate the timeless principle that ‘appearances -first impressions especially- can be deceptive’. While it may look at first sight like a modern-day photograph, it ain’t a photograph.  It’s a contact imprint in the first instance – a centuries-old precursor of the photograph deploying entirely different physics. Yup, a body IMPRINT that can be quickly and simply enhanced with modern-day physics (ay, there’s the rub) to make it look like a photograph – and, glory be, a highly luminous one – all explainable in terms of light/dark inversion and other boring ol’physics.\nLate addition to illustrate my point, albeit crudely, with a stick of charcoal and ImageJ software (from this site, May 2, 2012!):\n https://shroudofturinwithoutallthehype.files.wordpress.com/2012/05/before-and-after-cropped2.png?w=640&h=332\n","date":"September 19, 2016 at 3:00 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","id":"comment-7825","author":"Colin Berry","site":"colinberry"},{"title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?","post":"Having read over that paper, it appears their conclusion is that the blood stains are indeed blood stains, but there may be evidence they were touched up ‘revived’ at some point with dye/paint. Not a new idea, but this time with some evidence. Is this your takeaway from the the paper as well?\n","date":"September 19, 2016 at 2:31 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","id":"comment-7824","author":"David Goulet","site":"colinberry"},{"title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?","post":"David. In the second of your two comments today, you write:\n“Having read over that paper, it appears their conclusion is that the blood stains are indeed blood stains, but there may be evidence they were touched up ‘revived’ at some point with dye/paint. Not a new idea, but this time with some evidence. Is this your takeaway from the the paper as well?”\nAnswer: yes.\nPS See the new addition, David,  to my current posting (“Surely the most cunning, dastardly etc), one which provides an entirely new perspective on that ‘blood-before-image’ conundrum*.  IT throws in a mention to initial real v later fake touch-up blood for good measure as flagged up in your comment.\n *Nope, not blood-before-image, but blood onto prearranged image-free zone (pale outer fringe and central patches still visible!)\n","date":"September 19, 2016 at 5:37 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","id":"comment-7826","author":"Colin Berry","site":"colinberry"},{"title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?","post":"Yes, just saw this as well via the Shroud.com latest website. Also some other good papers. I agree with what you say with the 1/12 modeling. I find it compelling. I would think other scientists would as well. What the full scale model brings to the table is everyone else. For better or worse. Onward, sir. You are reaching a point where your work cannot be ignored much longer.\n","date":"September 19, 2016 at 2:06 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","id":"comment-7823","author":"David Goulet","site":"colinberry"},{"title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?","post":"Have just come across this paper from a French group through googling:\n\nhttp://file.scirp.org/pdf/OJAppS_2016091615555039.pdf\nLooks interesting and informative. Shame about the second sentence in the Introduction… Maybe the authors need to google too, English as well as French language…\n","date":"September 17, 2016 at 9:59 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","id":"comment-7813","author":"Colin Berry","site":"colinberry"},{"title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?","post":"Who needs full-scale modelling when one has this (approx.1/12th scale)?\n\nThat’s the same Galaxy Warrior as the one on this site’s banner – and previous comment. The primary flour imprint (before the final wash) is to its left, and that same image after 3D-rendering in ImageJ is shown on the right.\nNo, the TS image is not a photograph, nor a proto-photograph or indeed any kind of photograph. It’s almost certainly a non-photographic flour/oil-imprinted thermograph, or ‘biothermograph’ for short!\nPS Have just added the above photograph to the start of the current posting, which needed more by way of immediate visual impact. \n","date":"September 16, 2016 at 2:47 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","id":"comment-7811","author":"Colin Berry","site":"colinberry"},{"title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?","post":"The problem that I and other non-authenticists face, David, is that the MSM sets the bar far higher for us than it does for the miraculists. One has only to see this headline  (“Scientists say  Turin Shroud is supernatural”) in the Independent from Dec 2011. \nhttp://www.independent.co.uk/news/science/scientists-say-turin-shroud-is-supernatural-6279512.html\nThose ENEA guys didn’t even generate an image, merely a brown patch on linen, and indeed went on to admit that lasers woud never have sufficient energy to generate an entire image. Yet they then have the gall to tell us all to reflect on philosophy and theology, then going onto Dan’s site to haughtily chide and lecture those far better qualified than they are to discuss likely chemical mechanisms for colour-production.\n\nI produce images of my hand, or figurines that tick numerous boxes re negative character, 3D properties etc, effectively disposing of all those claims that the TS image is beyond known science, and am then told that nothing short of a full scale image needing one or more naked volunteers and yards and yards of expensive herring-bone weave linen is required before I can expect to be listened to. \nTHE MSM operates a double-standard, one that panders to those hooked on “mystery”, and indifferent or actively hostile to science.\nIt’s been called the ghettoization of science, and I’ve watched it get steadily worse with time, not better. It’s the result of the MSM having been hijacked by a liberal arts mafia with an anti-science, anti-scientist agenda.\nPS  That imprint above from the ‘Galaxy Warrior” should be sufficient to reject the oft-cited objection to imprinting-by-contact from a 3D figure, namely that there would always be lateral distortion due to a wrap-around effect. That assumes that the imprinting medium has been applied to the sides (NOT IN MY MODEL with flour sprinkled from above) and that the linen is then pressed round against the sides (NOT IN MY MODEL).\n","date":"September 16, 2016 at 6:23 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","id":"comment-7808","author":"Colin Berry","site":"colinberry"},{"title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?","post":"I really don’t care what medium the peer review occurs in. Replace ‘paper’ with ‘blog’. But what you need is some form of peer review and a way to attract more is if a bunch of fresh faced students adopt your model and run with it. It would actually make for a cool documentary. Maybe a James Randi foundation would back it. Funny thing – if Dan’s blog was still around and he was posting about your latest model you’d have loads of responses – some wheat and a ton of chaff to be sure. Am I the only one from that crew that is keeping an eye on your work? Not everyone on Dan’s blog was so pro-authenticity they rejected your ideas on sight. Where’s Thibault? Hugh? Thomas? Is Google to blame? Keep blogging, eventually something has to budge.\n","date":"September 15, 2016 at 8:09 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","id":"comment-7807","author":"David Goulet","site":"colinberry"},{"title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?","post":"Yes, David, but did you see what Hugh Farey had to say about the conventional oh-so-de riguer peer review process in his most recent BSTS newsletter (re the demise of Dan Porter’s shroudstory site):\nhttp://www.shroud.com/pdfs/n82part9.pdf\nI agree with him entirely.\n For certain topics at least, (among which I’d include modelling the TS image via simple medieval-era–appropriate technology)  the internet beats the stultifying chum-approved hide-behind-a paywall route entirely.\nOne now needs to work on the MSM – spreading the message that the old ways are not necessarily the best ways.\n","date":"September 15, 2016 at 3:35 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","id":"comment-7806","author":"Colin Berry","site":"colinberry"},{"title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?","post":"What I’d like to see is a group of science students take your model and further the experiments, documenting their findings and submitting to a peer review paper. They might even have a go at the full size model. The strong point of your model is that it could be done on a shoe-string budget. No lasers needed! Wish we knew a science teacher somewhere…hmmmm.\n","date":"September 15, 2016 at 3:14 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","id":"comment-7804","author":"David Goulet","site":"colinberry"},{"title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?","post":"I don’t even know how I stopped up right here, but I believed\nthis put up was once great. I do not recognise who you’re\nbut certainly you’re going to a well-known blogger in the event\nyou aren’t already. Cheers!\n","date":"September 14, 2016 at 10:05 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","id":"comment-7800","author":"Nigel","site":"colinberry"},{"title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?","post":"Hello Nigel\nIntriguing comment, though maybe not quite so intriguing as YOU KNOW WHAT.\nTo any of those semi-paranoid detractors who consider opposition to Shroud authenticity to be a carefully orchestrated campaign, I say NO, Nigel is not a plant, and NO, this blogger does not do planted comments.\nIn fact, I’ve been in contact with a journalist recently about the possibility of some publicity re this blogger’s take on the TS (he’d contacted me previously re a totally different topic on my sciencebuzz site).\nThe gist of his argument was that it was premature to place the flour-imprinting hypothesis on a pedestal. ie  into the protected public domain,  unless or until it had been tested on a real life-size human being. \nFair point, albeit one I’ve addressed before on this site.\nYes, it would be nice (?) to go in there and blast the pro-authenticity view to smithereens with one graphic that EXACTLY matched the Turin Shroud body image (blood stains to come later).\nSorry, but is that not expecting too much, given we have no info  whatsoever on what technology was employed (or might have been employed) in the mid 14th century?\nLet’s stick to the science, shall we, and leave the details of the whole-body imaging technology to another day?  Science is generally content to MODEL –  not provide exact replicas of historical artefacts manufactured centuries ago. Science does ideas, not forgery.\nSuppose a visitor from Mars were to visit Planet Earth and spot  a famous painting.\n “How on Earth did your folk manage to achieve that? ” they might ask? \nGiven the answer that it was all done with Earth’s  ground-down minerals, dispersed in oil as “paint”; would one be expected to reproduce Leonardo’s “Mona Lisa”, exact in every tiny detail, in order to prove one’s point?\nNo, of course not. Let’s try, shall we, to separate the scientific from the aesthetic and artistic?\nYes,  I know I’m talking to myself here. Sindonology is not interested in anything I have to say here, and we all know why.\nMight the MSM finally provide this suppressed , dare one say stifled voice of SCIENCE (the genuine variety, that is, not pseudo-science) with an entry, a platform, into the BIG WIDE WORLD?\nThank you Nigel. You gave me a cue for saying what I’ve wanted to say for a LONG, LONG TIME.\n","date":"September 15, 2016 at 2:40 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","id":"comment-7803","author":"Colin Berry","site":"colinberry"},{"title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?","post":"Made a significant discovery today (experimental), one that should assist anyone with a microscope, wishing to compare the final imprints from the hugely promising oil/flour model system with the Mark Evans photomicrographs from the 1978 STURP investigation.\nOne can’t tell very much from looking at the intact fabric, since the coloured fibres that comprise the image are all bunched-up together, making it impossible to decide where colour starts on a particular fibre and where it ends.\nI tried the Rogers’ technique of pressing sticky tape down on the fabric, then pulling off again. But the yield of fibres was very small, and there were surprisingly few coloured ones.\nHere’s the answer. Get some fine grade abrasive paper (“sandpaper” in common parlance) and draw it once or at most twice across the fabric. Go with the direction of the threads – weft or weave. Don’t go diagonally. Note the  instant accumulation of detached fibres on the paper. Then harvest them with sticky tape. They come away cleanly, indeed quantitatively – and the tape surprisingly does not “stick” to the abrasive paper. Lay the tape sticky-side down on a glass slide and examine at leisure.\nOne will find a sizeable number of coloured fibres that demonstrate the two unusual properties of Shroud fibres: the half-tone effect (where image fibres all have approx the same degree of coloration) and abrupt discontinuities of colour on particular fibres, i.e sudden change from yellow to colorless.\nOne can also look at the fabric that has been abraded. Here and there one will see tufts of threads  that have been sheared, and be able to see the stumps of coloured fibres.\nThe model not only reproduces the look of Shroud fibres in the two respects flagged up, but provides an explanation too (something sindonology appears not to have done). It’s due to the colour entering the fibre in the form of oily coloured LIQUID that seeps into the fibres when the flour imprint with its attached oil ‘micro-fries’ at the oven-heating stage. The colour stays on or within the fibres at the final vigorous washing with soap and water to dispose of the encrusted surface material, leaving just the final resilient ‘ghost’ image.\n","date":"September 10, 2016 at 11:07 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","id":"comment-7787","author":"Colin Berry","site":"colinberry"},{"title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?","post":"Note please the novel concept that has crept into this site’s tagline, indicated by use of the term “micro-fry”. Yes, I believe that ‘micro-frying” is the key to understanding the subtle characteristics of the Shroud image. How? Why?\nFirst, it’s necessary to flag up the existence of two variants of the flour-imprinting technology. The first, the simpler of the two, is oil-free. One simply sprinkles flour from an overhead sieve onto a recumbent subject until it forms a thick layer, then drapes with wet linen, then presses to mould the linen to the most superficial topology. That’s what I believe was used for what I call the Mark 1 shroud, the one depicted on the Lirey badge.There is nothing subtle about the Mark 1 image, as indicated earlier, though spectacular seems a fair description when one looks at the effect of adding water to the image post removal from the oven – it plumps up like a bas relief, giving a new insight to the Lirey badge!\nThe second variant was deployed for a postulated Mark 2 Shroud, the one that has survived to this day using subtly different technology. The skin was coated first with vegetable oil, then flour sprinkled from above, and the EXCESS FLOUR SHAKEN OFF leaving just a light dusting of flour on its oil-base. Imprinting was then as before, but the final image, after removal from the oven, was vigorously washed with soap and water, so as to detach all encrusted material, leaving just the ‘iconic’ ghost image.\nWhere does micro-frying enter the picture?\nEach flour particle that attaches to the wet linen in the Mk2 model takes with it a little oil from the skin. In the oven that oil heats up and fries its associated flour particle to a rich golden brown colour. Most of that colour remains in the flour, but a small proportion of the oil, loaded with coloured material, ‘sweats’ into the underlying fibres of the linen for a short distance, giving rise to those image ‘discontinuities’ and the so-called ‘half-tone’ effect, i.e, all-or-nothing coloration seen at the fibre-level, i.e. the unusual microscopic  properties that my model accounts for.  It’s that sweated-out liquid (and that only) one sees after vigorous washing. Thus the faint fuzzy character, so entirely different from the pre-washed image.  So Sam Pellicori and Joe Accetta were right in my estimation when they began to think about models that involved liquid penetration accounting for the image (e.g. sweat, real or simulated, dyes, inks, etching acid contaminants etc etc). Sam’s early researches even deployed an oven-heating step, as mentioned briefly in John Heller’s book, used to darken his lemon juice and other models for ‘sweat’. \nI now believe it was the substitution of a Mark 2 oil-imprinted shroud for the Mark 1 water-only model, with a change in the accompanying narrative (and striking of a new pilgrim’s badge, for which sadly we have only the incomplete Machy mould) that caused the local bishop to go ballistic! He considered he’d been conned, as indeed he had. In fact, I wouldn’t be surprised if for a while there were two shrouds in existence at Lirey. Mark 1 was displayed when the Bishop or one his chaplains looked in, obviously with no pretensions to being  ‘authentic’.  But as soon as the bigwigs were safely on their way back home, the Mark 2 version was brought out, ready for the next contingent of impressionable pilgrims…\nThis site slipped overnight from Page 4 to Page 6 of Google listings. Why? Methinks there’s something rotten in the state of sindonology, the latter posturing as if an academic discipline. But academics discuss new findings relevant to their field, whether supportive of generally-held preconceptions or not. They do not tempt to freeze out dissenting viewpoints and/or operate as a closed fraternity (“Shroud Science Group” etc).\nIn passing, a full year has now passed since this researcher unveiled his flour-imprinting model on the now lapsed shroudstory site, and if he’s not mistaken, the model (excluding Hugh Farey’s BSTS Newsletter) has never received so much as a single mention elsewhere by a ‘sindonologist’, including those who host internet sites that routinely challenge science to explain the shroud image – see earlier. Is it any wonder that my model is slipping off Google’s radar? If it weren’t for the occasional posting and comments on this site, my own included, it would probably be well nigh invisible on a Google search by now. Meanwhile, ‘popular’ MSM outlets  like “History Today” provide a means for cynics like Charles Freeman to deliver their ‘post-emptive’ strike (ignoring or haughtily dismissing all that has gone before).  Such is the self-sustaining nature of internet-assisted click-bait  journalism that these self-promoters, gratuitous offence intended, are able to sit at the top of Google rankings, misleading themselves and the rest of the world,  in this instance with their cute ‘just a painting’ fantasy, all carefully packaged as if sound scholarship (which it most definitely ain’t).\n","date":"September 1, 2016 at 7:37 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","id":"comment-7742","author":"Colin Berry","site":"colinberry"},{"title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?","post":"Next posting? It won’t be for a while, probably weeks rather than days.\n Provisional title: “An Open Letter to Paul Lay, Editor of “History Today”,\nThe historian/journalist in question has been sent a preliminary email, flagging up the gist of what to expect, and why I consider it necessary, despite almost 2 years having elapsed since the appearance of that excruciatingly under-informed and misleading article by Charles Freeman, claiming the TS to be just an age-degraded painting.\n","date":"August 28, 2016 at 10:54 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","id":"comment-7725","author":"Colin Berry","site":"colinberry"},{"title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?","post":"Am still tweaking that ‘tagline’ that appears top right of the Home Page, next to the title (it being what Google sees and reports).\nIt now reads:\n“The greatest conjuring trick in history, achieved with DISAPPEARING white flour/oil to imprint an entire body onto wet linen? First the imprint’s particles were micro-fried to a golden-brown in a HOT OVEN. Soap and water then removed the surface encrustation, leaving, hey presto, that tenacious ‘enigmatic’ ghost image. See banner below.”\nYes, it’s too long and detailed, but is the first, or maybe second step, in getting across the idea that the TS represents a staggeringly ingenious conjuring trick. The mere fact that it presents the first-time viewer with a visual puzzle to solve (like why are there two figures, head-to-head?) is evidence in itself of an out-of-the-ordinary design genius at work. What he was doing of course was to signal that the image was to be seen as an imprint, i.e. a contact imprint, between body – a certain body – and linen- a certain length of linen,  with further visual hints – bloodstains especially-  to consult scripture, notably the first THREE (not four)  books of the New Testament, i.e the transport of a crucified body from cross to tomb.\n How strange that modern sindonological ‘scholarship’ should not only neglect the cues to contact imprinting, but attempt to dismiss imprinting-by-contact  entirely. Well, not so odd perhaps when there are other agendas to pursue, inspired no doubt  by the other parts of the NT focused on the final stages of interment and (especially) resurrection, post the arrival of a linen-enshrouded  body at the tomb, ready for removal of that TEMPORARY linen shroud, the latter NOT intended as final burial garment.\nThe TS serves as a monument to how science, or rather so-called science – can be selected and manipulated to serve an agenda.The term ‘pseudoscience’ fails to do justice to the systematic attempt to harness “science” for the purpose of mind-control, not critically testing hypotheses but instead sugar-coating them for the carefully targeted sweet-tooth. Let’s provisionally label it as “candy-coated science”, designed to elicit mental sugar rushes in the susceptible.\n","date":"August 26, 2016 at 5:04 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","id":"comment-7707","author":"Colin Berry","site":"colinberry"},{"title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?","post":"You’ve studied the Shroud image in more detail than I have. Do you see any evidence that the dorsal and frontal images had any major difference in contact pressure? I’m considering how the forger made the imprint, i.e. was the floured body laying flat on the linen (dorsal image formed by gravity and body’s weight) while the top of the linen was folded over the front of the body and pressure applied from the exterior (hands or soft weights applied). Or, could the frontal image have been done first, then the body rolled over onto its stomach and the dorsal image done in a similar fashion (not therefore relying on gravity and its own weight). Let’s go one step further – could the image have been made with the subject in a vertical position? Would there be any clues in the image that betray any of these scenarios?\n","date":"August 26, 2016 at 6:23 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","id":"comment-7708","author":"David Goulet","site":"colinberry"},{"title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?","post":"Hiya DavidG\nI used to struggle with this frontal v dorsal thing, for a whole number of reasons (e.g. the reported length difference, albeit quite small, 2.0m dorsal v 1.95m frontal as I recall.  Fanti et al? Approx 2010? I got blasted on Dan’s site early 2012 when I said there seemed to be a size difference…  😦\nIt was Paolo di Lazzaro’s challenge to account for how the two images were aligned so perfectly on the long axis that recently got me thinking.\nAnswer: there wasn’t just one subject/volunteer/corpse being imprinted, but two simultaneously, approx same height and build. One lay down on his back, the other on his front, carefully lined up on the same long axis with the ‘right’ gap between the two heads. They were then both smeared with vegetable oil, sprinkled with white flour, draped with a single sheet of wet linen (best quality). The overlay was then pressed down by helpers to capture a negative imprint, seemingly of the two sides, frontal v dorsal of the same individual in an ‘up-and-over’ shroud. (Non-burial shroud). \nThe rest as they say is history (not the Charles Freeman version thereof), assisted by hot oven and soap.  Shame there were no iPhones, FB or Twitter at the time to capture for posterity exactly how the ‘conjuring trick’ was pulled off…\n","date":"August 26, 2016 at 6:59 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","id":"comment-7710","author":"Colin Berry","site":"colinberry"},{"title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?","post":"Yes, contact-imprinting can account for other unusual, unexpected detail, in addition to ‘apparent’ beard and moustache.  One can imprint one’s hand with fingers together, no gaps, but fingers appear slightly separated on the imprint AND LOOK SPINDLY, as per TS. The reason is obvious – the imprinting is restricted to the flat, highest parts that overlie the bone – giving that skeletal look. That bridging of the linen prevents the imaging of the crevices between the fingers, the crucial giveaway to the TS body image being a contact imprint – by design rather than accident –  not as so many pro-authenticity advocates would like us to believe – a proto-photograph, the world’s first selfie etc.\n","date":"August 24, 2016 at 5:08 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","id":"comment-7678","author":"Colin Berry","site":"colinberry"},{"title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?","post":"One cannot hope to imprint frontal view head hair directly David, since sides and top of head make little or no contact with linen (unless one ‘wraps around’ in which case there would be hideous distortion).\nBut one doesn’t have to imprint to get head hair, which is just as well, given I don’t believe the frontal hair was imaged via imprinting (only the prominent flesh-over-bone parts). The facial imprint was made first, and the hair added later by brushing on flour manually (dry painting!). The flour imprinting technology is VERY accommodating – given one can add and with care maybe even remove flour until one is happy with the look of the imprint before oven-heating.\nIn contrast, longish dorsal side head hair can be imprinted directly, having a hard base (skull) behind it. It could be tidied up manually, again by dry powder brushing. I doubt whether imprinted hair would look any different from imprinted skin, given the imprinting medium spreads pretty evenly over both surfaces, and is thus unable to capture the difference in texture. Wet-imprinting, say with a flour slurry, might  however capture texture (strands, curls etc). The lack of skin/hair texture differences on the TS might be seen as consistent with dry powder imprinting, but it’s not an area where I have hands-on experience, having been more concerned  with the challenge of frontal-side imprinting, where head hair becomes something of a side-issue (literally). \nBeard? Moustache?  Sorry, having neither I can’t say whether they are imaged or not (though my eyebrows were poorly imaged in one experiment,, the preliminary oil smear being a great equaliser).  But I do know that the strong imprinting of the bony chin and teeth-backed upper lip can make it seem as if there’s a beard and moustache respectively! I’m far from convinced that the Man on the TS possesses either!\n","date":"August 22, 2016 at 10:42 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","id":"comment-7657","author":"Colin Berry","site":"colinberry"},{"title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?","post":"” I’m far from convinced that the Man on the TS possesses either!”  Was it not common belief in the Medieval period that Jesus sported a beard and moustache? I would think that a forger would want those features on the image.\n","date":"August 24, 2016 at 3:05 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","id":"comment-7675","author":"David Goulet","site":"colinberry"},{"title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?","post":"Let’s imagine you’re a medieval artist/artisan, DavidG, and you’ve received a top secret commission from one of the most powerful men in in the country – Geoffroi de Charny, close consort  and confidante of the KIng himself. The commission is to produce a whole body representation of the crucified Jesus, as might be left in sweat and blood on J of A’s fine linen. \nSuppose you have done some preliminary experiments with white flour as your inspired and resourceful choice of imprinting medium, starting with the easy bits like hands, and then moving onto the tricky bit – the head, mainly on account of the nose, eye sockets etc etc.\nYou look at your pilot imprint, and the first thing you notice is the lack of head hair in the frontal view (for reasons mentioned earlier). OK, one can get around that by brushing on white flour manually to the primary imprint to represent lank sweat-soaked hair. It’s not the most natural-looking hair in the world, but it’s supposed to be an post-mortem imprint of a highly traumatized, recently-deceased individual, a rare commodity in the world of art, probably with few capable or willing to pass judgement on realism or otherwise.\nBut what about the beard and moustache, assuming that was regarded as obligatory in the mid-14th century, as no doubt was the case.\nThere’s an immediate problem. The chin and upper lip imprint so well that the final image looks for all the world as if there’s already a beard and moustache (as I know, having previously shown that to happen when imprinting my own face).\nSo why bother any further? OK, one could maybe brush on some additional flour in all the right places, but maybe that was tested and found wanting. Maybe too much flour gave rise to problems with the facial hair looking too prominent, or ‘not quite right’ maybe inviting sceptics to question whether facial hair would imprint so well given it might be predicted to lie flat on sweat-drenched skin.\nSo maybe our artist/artisan didn’t lose sleep over facial hair. He simply let the effects of super-imprinting of chin and upper lip create an impression (literally!) of facial hair, not too token, not too prominent, maybe somewhat patchy and incomplete, and left it at that.\nMaybe there was a medieval version of Marshal McLuhan, who instead of insisting that “the medium is the message”  came up with the reverse: “the message is the medium”. Flour power was recognized to have its limitations. Solution: exploit wherever possible those limitations, and where that was not possible, then simply work around them…\n","date":"August 24, 2016 at 4:42 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","id":"comment-7676","author":"Colin Berry","site":"colinberry"},{"title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?","post":"This may be. What confused me is your observation/belief that there’s no beard/moustache. There clearly is, but I understand now your belief in what you deem has caused it – not actual hair but a bump. Thanks for clarifying your position.\n","date":"August 24, 2016 at 4:51 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","id":"comment-7677","author":"David Goulet","site":"colinberry"},{"title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?","post":"Fair enough. But what about the hair? Does it pose problems for image formation in your model? Perhaps there are signs in the hair in the image that might prove support your model?\n","date":"August 22, 2016 at 9:40 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","id":"comment-7656","author":"David Goulet","site":"colinberry"},{"title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?","post":"If one’s modelling began with the decision that no attempt would be made to introduce “wounds” into the body image (too ambitious)  that ” the impression of wounds” would rely entirely upon bloodstains in all the appropriate locations, then it hardly matters one would think whether the subject was alive or dead . There’s no major trauma involved in merely being smeared with oil, dusted with flour, then imprinted onto wet linen. \nIt’s also worth noting that in the flour-imprinting model, the blood does NOT have to be painted onto the body before the flour, OR  onto the linen after imprinting. One can dust with flour, then apply blood (when it might be helpful to have a living subject adopting the right posture for simulated crucifixion so that blood trickles in all the right directions). Since the last added blood makes first contact with the linen, then the correct Adler/Heller blood-before-body image geometry is assured. But that is not the whole solution I grant you – since the temperarure needed to develop the flour imprint (approx 200 degrees C) would seriously degrade the blood, making it brown or black.  But might not the same be said for the 1532 fire? It too would have degraded the original bloodstains, requiring them to be topped up with fresh blood (or blood substitute) which would then be on top of the body image, contrary to Adler/Heller.\n One possibility, as Hugh Farey pointed out, is that Adler/Heller could not have known they were testing “image fibres”  simply bacause they were stripped from an image-bearing region, given they were selected for being blood-coloured, obscuring any image colour if present.  (Have I made that clear?)  Why not?  Because they were restricted to working with individual fibres, taken from  Rogers’ sticky tape samples but with no guarantee that a particular fibre selected had image as well as blood, whether on top or underneath.. According to the half-tone effect, only a minority of fibres would have had the out-of-sight sub-blood image coating. The chances that a “blood-coated” fibre selected at random from an image zone also had image would have been slim! \nTakeaway message: one cannot be 100% confident in the blood-before-image mantra, based as it was on that statistically-dubious test with individual fibres selected for blood  – NOT for image colour!\nYes, it’s a can of worms…  Maybe new solutions will occur to one or other of us in the fullness of time.\n","date":"August 22, 2016 at 8:57 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","id":"comment-7655","author":"Colin Berry","site":"colinberry"},{"title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?","post":"You’ve answered my question, sort of. You contend there are no wounds, only blood marks suggesting wounds. You also contend these were added after the image formation. Would it matter in your model then if the subject was alive or dead?\nOne further question comes to mind. Your flour model works very well with smooth surfaces, like the space action figures and crucifix. And you’ve done your hand as well. But have you tried it with hair? Does it pose any special problems?\n","date":"August 22, 2016 at 8:11 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","id":"comment-7654","author":"David Goulet","site":"colinberry"},{"title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?","post":"Sorry to be a stick-in-the-mud on the subject of those perceived  “wounds”, David, but I assert there is no imaging of wounds of any description anywhere on the body image.  If you think otherwise, then please state their location, and we’ll examine the relevant Shroud Scope images.\nWounds have been inferred solely from the location of bloodstains, but one then sees the terms “wounds” and “bloodstains” used interchangeably as if both were present..\nHere’s a typical passage from the Bucklin ‘autopsy’:\n“As the back image is examined, it becomes quite clear that there is a series of traumatic injuries which extend from the shoulder areas to the lower portion of the back, the buttocks, and the backs of the calves. These images are bifid and appear to have been made by some type of object applied as a whip, leaving dumbbell-shaped imprints in the skin from which blood has issued. The direction of the injuries is from lateral toward medial and downward suggesting that the whip was applied by someone standing behind the individual.”\nBut there is no imaging of “injuries” . Everyone is agreed that the scourge marks are simply blood imprints, and the same is true for the wrist (inferred nail site), the pectoral region (inferred lance site) the scalp (inferred crown of thorns site)  etc etc. But what we see is entirely blood, rendering Bucklin’s use of terms like “puncture wounds” etc entirely misleading. Yet senior members of the STURP team swallowed the notion of “forensic evidence” and “wounds”  hook, line and sinker. It entirely coloured their thinking about the TS, causing them to think there was a rich store of forensic evidence in the body image (as distinct from blood) that simply wasn’t/isn’t\nthere. I believe the expression is “seeing what one wants to see”, like the rich imagery one’s elderly aunt claims to see in the tea leaves on the side of her cup.\n","date":"August 22, 2016 at 7:49 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","id":"comment-7653","author":"Colin Berry","site":"colinberry"},{"title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?","post":"Colin, your model would require a human subject for the image formation – covered in the flour base from which then the imprint was made. This person would be either living or dead. Which do you think it was: a living subject or a dead one? If it was a cadaver then one might expect that they would have added post-mortem wounds so these would add to the realistic nature of the relic. Is there evidence of this in the wound markings? If the subject was live they would either have had to fake the wounds, or add them post-image formation. We do agree that there are wounds on the figure in the image? How and when were they created is the question I have.\n","date":"August 22, 2016 at 7:09 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","id":"comment-7652","author":"David Goulet","site":"colinberry"},{"title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?","post":"There are some interesting points there, David, too many to do justice to in a single reply. \nLet’s start by taking up just two. You refer to the forensic evidence regarding crucifixion.  That area in the hands of pathologist Robert Bucklin MD was clearly a major influence on a number of STURP investigators even before they travelled to Turin. That includes, notably, John Heller, though you have to go almost to the last page of his book to see the evidence of his being enamoured of the Bucklin “autopsy” report (shame it was done on an Enrie black-and-white negative theatrically placed on a mortuary trolley or similar).\nThe fact is, David, that there is NO forensic evidence whatsoever. Why not? Because the entire evidence for crucifixion and associated torture and trauma rests entirely on those bloodstains, and the TS body image is NOT a photograph, so cannot be “read” as if one when the mechanism of imaging is unknown.  What’s more, there is no imaging of the punctured or torn flesh whatsoever. That includes all those 372 alleged scourge marks. All are said to be represented by blood imprints only, amazingly uniform ones, while displaying in amazing detail the details of 3 or so different classes of flagrum tips (lead spheres etc).How can the image of a real victim of crucifixion be so perfectly imprinted, with just the right amount of blood for imprinting, not too little, not too much?\nThen there’s your reference to a “burial” shroud. I see no evidence in scripture that Joseph of Aramathea’s “fine linen” was ever used, or intended to be used as a “burial” shroud. It was used simply for respectful transport of a naked bloodied corpse from cross to tomb, where it was then replaced with more specialized burial garments (John’s account, differing from the synoptics since it restricts itself to what happened post arrival at the tomb).\nI maintain that the fabricators of the Shroud (14th century France)  were influenced by the legend of the Veil of Veronica, then attracting hordes of pilgrims (Avignon presumably) and wished to trump it by representing a sweat/blood imprint of an entire body, front and back on linen, which visiting pilgrims would view (with verbal prompts) as Joseph of Arimathea’s fine linen used in transport mode, NOT as a burial shroud.  Their  perceived task was clear: to simulate a sweat/blood imprint, and that they did brilliantly and near flawlessly, provided one does not go looking for imprints of wounds as distinct from blood, or evidence of sides or top of head, or hair imprinting differently, whether macro- or microscopically, from bare skin etc etc. \nThank you for your interest David. You are of course right about the lack of curiosity re details on the part of the sceptics, though whether they  really comprise your 99.99% is maybe open to question  I would have put it at 80-85% myself, with a sizeable number believing there is still room for doubt, especially as rarely a year goes by without some new claim for authenticity based on a new “scientific” insights, and not just a trashing of the radiocarbon dating. Indeed, it was Paolo Di Lazzaro’s laser pulse modelling that got me actively involved, some 30 years after reading that Sunday Times colour supplement that appeared at the same time as your “Silent Witness”, attempting to give scientific credulity to the case for authenticity (and most persuasive it was too, though less so now). \nYes, the TS is good. That’s the trouble. It’s simply too good, too manicured in so many ways to be genuine. And it can now be modelled after a fashion, as I hope my researches demonstrate, while acknowledging there’s a lot of detail still to be resolved re  precise mechanism of imprinting, especially the order in which blood and body image were acquired (or kn the case of blood, re-acquired in centuries of repair and restoration).\n","date":"August 22, 2016 at 5:35 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","id":"comment-7651","author":"Colin Berry","site":"colinberry"},{"title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?","post":"PS: your contribution here is not really a response to my model, is it David? It’s a speech, and a grandiloquent one at that, one that basically says “You’ve  merely scratchhed the surface, chum” (which is an improvement I guess on “You’re just a Johnny Come Lately, and will always be a Johnny Come Lately”).\nCan this really be the same individual who issued a challenge, correction, “Enigma Challenge” to Richard Dawkins, one in which Christian theology’s great bogeyman was required to state precisely how the Shroud image could be reproduced, to be recorded for posterity by one or more of David’s documentary-making cameras? \nYet when this admitted nonentity delivers the required recipe, with no help from Richard Dawkins or anyone else for that matter, what’s the response? Is it: “No, you’ve still to  demonstrate this or that property of the Shroud”?  No. What we see is  a wholesale moving of the goalposts from the specifics of the body image to the entire “impression” created by the Shroud to one man’s eyes, or should that be documentary-making camera,  one that displays a breathtaking number of starry-eyed assumptions,notably. that the bloodstains, assumed to be original and un-retouched, represent real wounds, despite the absence of any evidence for the latter in the body image (at least from scrutinizing every part of Shroud Scopewith restored levels of contrast – don’t ask!).\nSorry David. While I thank you for taking the time and trouble to visit my site, this began with my emailing you to say I was unable to post a comment to yours,  having overlooked the small print that requires one to be signed up with a particular social media site to leave comments.\nWere your site pitched at scientific rather than – or as well as –  social media, i.e. seriously researched internet-based contributions, as mine are, then I’d be pressing you to respond to the specifics of my flour-imprinting model, despite lacking Richard Dawkins’ impressive credentials,  and ask you to save the speechmaking for another day.\n","date":"August 24, 2016 at 7:10 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","id":"comment-7671","author":"Colin Berry","site":"colinberry"},{"title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?","post":"My background is in photography. My first job was to photograph 10″ steel plates that had been coated with the latest battleship grey and then subjected to the equivalent of 10 years at sea. My (5×5) plates had to capture every nuance and minute crack that may have been present. The development process required mechanical agitation to ensure that it matched the precision of the photography. Even then, it was difficult to ensure an even graduation over that small size.  The Shroud confronts us with a 14ft cloth with an image (not a photograph, admittedly, at least not in any normal sense) that has an entirely even graduation over the entire length.  When you consider this in the light of all its other attributes, and, bearing in mind, if it is authentic, then you might expect something “miraculous” or, at least, mystifying, any open minded person would, at least, give that possibility a fair hearing. You seem hell-bent on ignoring the wood and only focussing on the trees. It’s the big picture, in every sense, that is key to understanding this mysterious cloth. Step back a bit. The view is always better. When you can, I would be delighted to continue this discourse.\n","date":"August 24, 2016 at 11:41 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","id":"comment-7673","author":"shroudenigma","site":"colinberry"},{"title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?","post":"So, it’s the evenness of the image that is now the crucial property that has to be accounted for (with no mention of all those other ‘enigmatic’ properties one’s been challenged to account for, like image superficiality, 3D properties, half-tone effect etc etc).\nAs I say, what we see is a constant moving of goalposts, one that takes the attention away from what has been achieved in the best part of 5 years of research, all reported in real time, warts an’all.\nForgive me if decline to play this game of moving goalposts. I’ve set out my stall, and am entitled to ask that you comment on MY research findings, not your increasingly woolly speculation DavidR (the R being needed to distinguish from the other David on these threads).\nAs it happens my model DOES account for the evenness of the body image. Why do you think I introduced the initial smear with vegetable oil? It’s to provide a surface onto which the flour can lightly attach, but not too strongly. Why not? Because the next step is to shake off the surplus of flour, to leave a mere dusting of flour. Look at one of the figures in this posting and you will see an image of my hand taken immediately after shaking off the excess of flour. You are seeing an explanation for why the Shroud image is so even and homogenous. It’s a reflection of the balance of two forces – adhesion and gravity. Those forces are approximately the same all over the body during the coating process. The evenness is then captured in the thermal development of image in the oven.\nThe approach I have taken is one of experimental model building, one you yourself challenged Richard Dawkins to perform. So why are you now belittling the very instrument that you theatrically claimed was needed to support a medieval provenance of the Shroud, above and beyond ‘mere’ radiocarbon dating. Oh, and let’s not forget the final laundering with soap and water, leaving the Stage2 TS-like ‘ghost’ image. That too creates an initial impression of image homogeneity (though fortunately not too homogeneous: if that were the case there could be no 3D properties, given the latter depend on differences in image density, something to bear in mind before setting up “homogeneity” as a crucial characteristic of the TS. Let’s not confuse general faintness with homogeneity).\nSorry, I’m not impressed with your style of advocacy, DavidR, eloquent thought it may be. I believe it to be excessively influenced by your religious convictions, of which I have no problems per se, having been brought up in a church-attending family. It’s just that science and religion do not mix. Science is a means of tackling problems via falsification of hypotheses, not an ideology. So let’s hear how you think the flour-imprinting model can be falsified if this dialogue is to continue. I don’t need to to “stand back”, if as I suspect that means taking on board non-scientific propositions that are incapable of being tested and potentially falsified.\n","date":"August 24, 2016 at 12:07 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","id":"comment-7674","author":"Colin Berry","site":"colinberry"},{"title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?","post":"Hello Colin\nYou must not be too downhearted about a lack of comment. Now that Dan Porter has hung up his mouse there is no one to whistle up much of a controversy.  The other thing to bear in mind is that, as far as 99.99% of the population is concerned, what you are attempting to prove they already believe. i.e. the Shroud is some kind of clever fake. And, frankly, while that remains the case they are not that interested in the details.\nWhat would get some attention is how you might explain how the medieval forger used something like invisible ink to create the image he did and bestow it with so many other features that give the semblance of authenticity. I have taken the liberty of setting out my description of them below:\nA letter of congratulation to the medieval forger who created The Shroud of Turin\nYour choice of an image left on a Shroud is a perfect encapsulation of the mystery that surrounds him. After all, it is the reporting of his death by crucifixion that is the principal independent corroboration that Jesus lived at all.  Congratulations.\nHere lies a man that died in the most vile and cruel way yet devised by mankind.  The awful details reveal it was what we now know to be a Roman crucifixion.  This is uncanny because when you were commissioned you had no knowledge of these details.  Congratulations. \nYour depiction makes real the one description we have of the man’s death in that it bears the minute forensic details that makes sense of what is written. Congratulations.\nYou have echoed the bare facts we have about the man’s life by making it ethereal but perceptible enough for it to be recognised for what it is by crowds at a distance on a glaring hot day when thousands flock to see it held aloft in the open air. Congratulations.  \nBy restricting yourself to a monotone you have emphasised the singularity involved in the event of this man’s life and death. Indeed, the image is its own singularity as it has no comparison or equal. Congratulations.\nThis tone, so sparsely applied, has, centuries after your work was completed, yielded to the new science of photography an image of even greater perceptibility just when the world had almost forgotten it. Congratulations. \nYou have maintained such evenness of hand of the single tone along its entire length and breadth that stellar science has been able to translate your pains into a homogenous lifelike three-dimensional representation of the man in death.  Congratulations. \nSomehow, although making sense as a two dimensional depiction, you have applied the blood and arranged the position of the limbs to enable it to make sense when wrapped around a corpse even to the soles of the feet. Congratulations.\nBy applying the blood first and leaving no image beneath you have confounded further anyone who might seek to imitate you. Congratulations.\nYou have been faithful by depicting him unmistakably in the likeness as the Jew he was. Congratulations.\nYour canvas has been a linen cloth of dimensions used at the time and woven on a loom that worked under the laws that governed the man’s world.  Congratulations. \nThe cloth is nothing like the rough linen grave clothes discovered in the excavated tombs in the hills of Jerusalem. Its quality matches the esteem in which those who followed held the man it must have wrapped.  Congratulations. \nDespite our preference you have been brave enough to leave him naked and kept him devoid of any artefact that would allow one group above another to claim him for themselves.  Yet, you have kept his dignity and repose. Congratulations. \nIndeed you have excelled even this. This savagely tortured man in death is at peace with himself and with us. Indeed, he appears, somehow, to have transcended his fate and cheated death.  Congratulations.\n","date":"August 22, 2016 at 4:20 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","id":"comment-7650","author":"shroudenigma","site":"colinberry"},{"title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?","post":"I have just googled  “the greatest conjuring trick in history” to find one, just ONE return. It’s used by one of the characters in a novel by Michael Asher entitled: “Death or Glory (II) – The Flaming Sword”.  \nhttps://books.google.co.uk/books?id=ucSsshRpqLMC&pg=PT164&lpg=PT164&dq=%22greatest+conjuring+trick+in+history%22&source=bl&ots=zq6k_uXGZI&sig=vQmzUhobmeAe-NnSNFqfNstOuY8&hl=en&sa=X&ved=0ahUKEwijz9O24NHOAhXrDMAKHS9TAmEQ6AEIHDAA#v=onepage&q=%22greatest%20conjuring%20trick%20in%20history%22&f=false\nWell, folk googling that same phrase will shortly be seeing a second return, hopefully in a day or two, once my new site ‘tagline’, or as I prefer to call it, ‘credo’ gets picked up! The phrase was arrived at independently needless to say. “Conjuring trick” seems preferable to the more pejorative “hoax” or “forgery”.\nThe site credo is important (if supplied) because it’s that which the world’s favourite search   engine displays immediately after one’s site title, NOT, as one might assume, the title of one’s latest posting. So that credo is a vital part of a blogger’s ‘shop window’ to the big wide world. It has to be worded as a bit of a ‘come on’, or as they say, ‘click-bait’ in internet-speak.\nHopefully, my new credo, with help from search engines,  will assist in promulgating this investigator’s out-of-the-box thinking, backed up it has to be said with some 5 years of patient, systematic hands-on research.\n","date":"August 21, 2016 at 6:44 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","id":"comment-7639","author":"Colin Berry","site":"colinberry"},{"title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?","post":"More thoughts on isolating the yellow-brown liquid that seeps/sweats from white flour when heated: while my crude sieve (needle-punctured aluminium foil) hold back virtually all the particulate flour, allowing only the exudate through the perforations, it occurs to me that the design can be improved still further. Instead of using ordinary plain flour, which may self-filter/absorb to some extent allowing only a small fraction of exudate to reach the perforations, one uses a dried pasta e.g. spaghetti instead. \nYes – seriously. Pasta is 100% durum wheat semolina – made from the inner part of the durum wheat grain, so essentially no different from ordinary flour in terms of composition, except for a somewhat higher protein content. To ensure better drainage, one crushes the pasta in a pestle and mortar, sieves out and discards the finer particles, then uses the resulting grit as one’s substitute for fine flour. As that bed starts to ‘sweat’ on heating, any liquid exudate should find it easy to drain through the large spaces between the grits, down to those perforations and out into one’s collecting vessel.\nThe ultimate aim I guess is to collect the exudate and deploy it as a kind of paint or dye on linen to see how closely or otherwise the result resembles or differs from the TS body image in terms of superficiality, microscopic properties etc. The uv/visible reflectance spectrum would be of interest too, providing I can find a lab prepared to collaborate, to compare with the STURP data.\nIncidentally, I’m toying with the idea of sending a link to this posting to the big beasts of sindonology, some dozen or so for starters,  so there’s some assurance that each is aware of current progress on the flour-imprinting model. Neither the search engines nor WordPress’s site meter provide any evidence far less reassurance that the internet works as a means of broadcasting one’s hot-from-the-press research results and conclusions  …\n","date":"August 20, 2016 at 7:13 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","id":"comment-7623","author":"Colin Berry","site":"colinberry"},{"title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?","post":"Was pasta prevalent in France at the time the forgery was being ‘cooked’ up?\n","date":"August 22, 2016 at 2:09 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","id":"comment-7648","author":"David Goulet","site":"colinberry"},{"title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?","post":"A couple of clicks, David,  and one sees a wiki entry under (pasta history) that starts with:  “Pasta is a staple food of traditional Italian cuisine, with the first reference dating to 1154 in Sicily.” So on that admittedly less-than-solid foundation, I could have made a case for the TS being manufactured a few hundred miles away, two centuries later,  in the neighbouring state. It is after all only formed wheat flour dough that has been shaped and dried,  But I shan’t, since the exoperiment designed to substitute pasta for flour was not about modelling the TS body image as such.. It was designed to explore the mechanism of imaging, in particular whether a liquid exudate might account for the peculiar microscopic properties of the image (superficiality, half-tone effect, discontinuities etc).. My fear was that my perforated tray, designed to let liquid trickle through onto linen or cotton wool might let too many solid flour particles through as well – thus the suggestion of using chunky ground up pasta that is still 100% wheat flour in composition (ignoring small amounts of water).\n In fact I need not have worried, Such is the tendency of flour particles to clump together that very few fall through the perforations, and the model system is starting to work as predicted, with the top layer of cotton wool acquiring a yellow or brown coloration that might be due to egress of liquid, as predicted, or there again maybe vapour or a combination of both. The next step is to test my top layer of discolored cotton wool etc. with my new chemical reagent, see second update at top of posting, one that turns image areas on linen from brown to yellow, and see whether or not I get the same colour chage in the filtered system where the flour has scarcely if any direct contact with the fibres during the oven-heating stage. What I’m doing in essence is attempting to differentiate between a contact scorch and an action-at-a-distance chemical stain/thermally-generated dye.\nMatching the microscopic properties of the TS body image has to be seen as the ultimate test of any model system, dare one say prize, since authenticists as far as I’m aware have advanced no explanation, unless it’s “Well, that’s what flashes of radiation/putrefying amine vapours/corona discharges/ neutron emissions from the bowels of the earth etc/etc do, don’t they”, to which the answer is “Where’s the evidence?”.\nThanks for the interest, David.  Commentators are thin on the ground these days, as I’ve just said to Luigi Garlaschelli in an email.\n","date":"August 22, 2016 at 2:43 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","id":"comment-7649","author":"Colin Berry","site":"colinberry"},{"title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?","post":"Pardon me if I prime my own comments on this latest posting. I’m tempted to post the current experiment, it having given very promising results, but the photos would add still further to the length. Here in words is what was done. I wanted to test the “heat sweat” hypothesis by placing some kind of porous barrier between the heated flour (with a little oil) and the fabric. If the plant fibres discolored similar to the previous work with direct contact, it would support the idea of a hot migrating liquid being the true imaging medium.  So cotton wool (for starters) was placed in a shallow glass bowl. Aluminium foil was then perforated with a hundred or so tiny pricks from a needle, and placed on top of the cotton wool, with the edgesof the Al foil raised to make a shallow tray. The tray was loaded with white flour and a few drops of oil added on top. After heating to 200 degrees C approx, and removal from oven, the flour was dark brown, as expected, and the top 1cm or so of the cotton wool was considerably discolored (a brownish colour). This was the hoped-for result needless to say, but I shall be having to ring the changes some  more on oil v water, cotton wool versus linen etc to ensure that the interpretation fo today’s result is sound. So far, so good.\n","date":"August 19, 2016 at 5:09 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","id":"comment-7618","author":"Colin Berry","site":"colinberry"}]
