[{"title":"More thoughts on the fragility of image-bearing fibres on the Shroud of Turin","post":"Good evening Hugh. May I deal with your last paragraph first, and perhaps ignore everything that precedes it (no disrespect intended). \nYou see, I think the ‘starch story’ to be a total diversion from the relevant science re the Shroud image. I believe that story (fantasy?) came about because a chemist – and a highly competent one at that – tried to take on too much, and strayed into areas outside his expertise. He failed to consult with scientists in other relevant specialities. Had he done so, and consulted with botanists about the strippable image layer, he might have picked up on the existence of something called the ‘primary cell wall’ (PCW). I  have read quite a lot of Rogers’ work, and secondary reports thereof, and do you know – I cannot find a single scrap of  evidence that Rogers was aware of its existence as the most superficial component of the bast (stem) fibres of flax. That’s why he tried to explain strippability in terms of an acquired layer of impurities – but was content to give second-hand evidence for the presence of “traces” of starch e.g. from the work of McCrone etc, and what’s more, starch from image regions, when he should have concentrated on non-image regions that should have had more (unreacted) starch according to his hypothesis. \nSorry, I can’t be bothered to think about starch or saponins etc etc when every single bast fibre from flax has a primary cell wall that is choc- a- bloc full of chemically reactive , easily-pyrolysable non-cellulosic hemicelluloses, lignin etc.  If Rogers were here today i would tell him to his face to drop his fixation with starch, saponin and the rest of Pliny’s ragbag of  1st century AD processing additives etc until he had conclusively proved that the imaging did NOT involve the carbohydrates etc of the PCW.\n","date":"January 2, 2013 at 6:56 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/01/more-thoughts-on-the-fragility-of-image-bearing-fibres-on-the-shroud-of-turin/","cat":"anoxie","id":"comment-1621","author":"colinsberry","site":"colinberry"},{"title":"More thoughts on the fragility of image-bearing fibres on the Shroud of Turin","post":"And another thing…\nThere seem to be three possible coatings (and combinations thereof), and I don’t think most scientists make clear which one (or more) they are using. To clarify:\na) the flax fibres were coated with something before they were spun into threads, perhaps as part of the purification process. If this were the case, and the image forming mechanism is strong enough to affect this layer, but not the rest of the fibre, I would expect the image forming mechanism to colour all around the fibres it affected, probably quite deeply into the thread, and by conduction along the coating, be visible on the back of the cloth. (The PCW hypothesis would produce a similar result). The appearance would look a bit like cloth does after it has been kept in an oven for a while – rather uniform.\nb) the threads were treated after they had been spun, perhaps as part of the weaving process. If this were the case, then ‘interior’ fibres, or the interior parts of fibres if they disappear into the middle of a thread would not be affected by the mechanism, but the image would appear at least deep into the valleys between the warp threads. It could also appear on the back by capillary action.\nc) the whole cloth was treated after being woven, perhaps as part of a washing process. In this case, the solutes appear prominently on the external faces of the cloth, and less, possibly much less, in the middle. This seems to be the basis of Rogers’s ammonia experiments, which were done on whole cloth.\nI too am not crazy about starch, as I don’t find it reacts as well as plain linen to heat or chemicals. Does it depend what sort of starch you use? I have wheat flour and maize flour. I was going to try mashed potato…\n","date":"January 2, 2013 at 6:30 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/01/more-thoughts-on-the-fragility-of-image-bearing-fibres-on-the-shroud-of-turin/","cat":"anoxie","id":"comment-1620","author":"Hugh Farey","site":"colinberry"},{"title":"More thoughts on the fragility of image-bearing fibres on the Shroud of Turin","post":"Good morning anoxie (good of you to look in).\nI’ll leave it to Adrie to comment on your first point re retrograded starch – despite my being closely acquainted with it from a previous research project on enzyme-resistant starch.\nWhen I started this topic, quoting the multi-author Fanti et al paper, my thoughts were more on image superficiality in quantitative terms – notably that 200nm thickness – or as Adrie has pointed out – 200+/- 200 nm. The chemical nature of the substrate – PCW as against  Rogers’ largely hypothetical starch coating – was not in my mind. What was in my mind was the insistence of Fanti, Di Lazzaro and others that an image layer that was a mere 200nm thick was not explainable in terms of conventional energy sources and required exotic energy inputs – corona discharges, coherent short wave energy from uv excimer lasers etc. I initially looked at ‘thermostencilling’ with infrared/visible radiation, using charcoal as a photosensitizer, but quickly dropped that in favour of plain old heat conduction from a hot template, zero air gap (stiill my position). But since starch coatings have been invoked (endlessly and indeed monotonously),largely  irrelevant in terms of Maillard reactions, and of dubious relevance in terms of simple pyrolysis, I’d simply say this. Neither Rogers nor his modern day disciples, one in particular, should ever have embraced the starch coating idea without first marshalling convincing arguments why the PCW is not the prime candidate as superficial image-bearing layer. \nAll this banging-on endlessly about starch is seriously distracting and seriously tedious.  What’s more I believe it to be agenda-driven, and as such is the thing I truly abhor – bent science, aka pseudoscience. No prizes for guessing the agenda (clue – it requires an a priori rejection of the radiocarbon dating, it requires belief in a 1st century AD Palestine provenance, and much else besides when you add in the “blood” story). It requires moving heaven and earth to discredit the radiocarbon dating (as Raymond Rogers attempted to move heaven and earth with that laughable re-weaving/end-to-end splicing/re-dying fantasy). What an appalling way to end an otherwise respectable scientific career, the latter testing the shelf-life and storage characteristics of chemical high explosives (someone had to do it).\n","date":"January 2, 2013 at 8:44 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/01/more-thoughts-on-the-fragility-of-image-bearing-fibres-on-the-shroud-of-turin/","cat":"anoxie","id":"comment-1615","author":"colinsberry","site":"colinberry"},{"title":"More thoughts on the fragility of image-bearing fibres on the Shroud of Turin","post":"Ok for this clarification. But Adrie wrote in a comment :\n” It seems possible/likely that a sealing coating of retrograded starch (end of this comment) still more or less protects the non-image fibers from drying/aging ”\nIs it a personnal view or a quote ?\nAnyway, speculations will go on as long as we don’t have definite arguments.\nMeanwhile studying the microstruture of flax fibers and dislocation bands maybe more productive.\nHappy new year !\n","date":"January 2, 2013 at 8:16 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/01/more-thoughts-on-the-fragility-of-image-bearing-fibres-on-the-shroud-of-turin/","cat":"anoxie","id":"comment-1614","author":"anoxie","site":"colinberry"},{"title":"More thoughts on the fragility of image-bearing fibres on the Shroud of Turin","post":"WordPress seems to be playing up today. My reply to anoxie’s comment has disappeared from the list of Recent Comments, so I’m posting this, now Comment No.3,  in the hope of correcting the fault.\nSuccess: posting this has returned my previous comment to the list. I’ve noticed before that “Recent Comments” can temporarily drop the most recent comment, here and on Dan Porter’s shroudstory.com site. There’s presumably a conflict or some other software fault somewhere that needs sorting, probably to do with using the email inbox system for managing comments or those “pingbacks” that I personally find surplus to requirements. WordPress please note.\n","date":"January 2, 2013 at 10:13 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/01/more-thoughts-on-the-fragility-of-image-bearing-fibres-on-the-shroud-of-turin/","cat":"anoxie","id":"comment-1616","author":"colinsberry","site":"colinberry"},{"title":"More thoughts on the fragility of image-bearing fibres on the Shroud of Turin","post":"Hi anoxie,\nIn my article Internal selvedge in starched and dyed temple mantle – No invisible repair in Turin Shroud – No Maillard reaction I describe the evidence for starch on the Shroud (par. 2.2) and how it may have got there and why (par. 1.1 and 2.5, with confirmation by the extraordinary seam, par. 4.3) and how it may have retrograded twice (par. 4.2.3).\nStarch retrogrades when it is allowed to cool down slowly and rest after having been gelatinised (e.g. boiled in water). It is insoluble in water: water hardly gets into it at room temperature because of its semi-crystallinity. On the Shroud, in retrograding twice, the starch coating may have got the shape of a continuous insoluble film around the surface fibers (par. 4.2.1). Polishing the cloth with a glass ball would have made the coating even more dense and waterproof (par. 2.3.2 Permanent Madder fluorescence). It is said that “The Shroud cloth is tightly woven, it is relatively thick, and it does not readily absorb water” (Scientific Method, p. 32).\n","date":"January 3, 2013 at 6:26 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/01/more-thoughts-on-the-fragility-of-image-bearing-fibres-on-the-shroud-of-turin/","cat":"anoxie","id":"comment-1629","author":"Adrie","site":"colinberry"}]
