[{"title":"Paradigm Collapse Trauma","post":"This is not really fresh news and Jacobovici is dreaming, unable to get over the fact that most academics and archaeologists, both in Israel and abroad, have rejected his claims. One important academic who initially supported almost his claims does not even mention his name now, realising the mistake he made and observing what he is getting at.\nPauline theology is stronger than ever, the apostle was the topic of important books by James Dunn, Alan Segal and Father Jerome Murphy O’Connor, and we now have the Annotated Jewish New Testament. \nThere are three important scholars Jacobovici would have to read, something written by two American authors also, if he does not know about these things. Once he finishes reading them he will necessarily have to change his mind if he is intellectually honest. If he doesn’t, then his agenda becomes even less hidden and we are led to what Zias drew our attention to: media hype, publishers and TV channels filling their coffers with money. The same old story…\n\n","date":"April 3, 2014 at 7:30 pm","url":"https://shroudstory.com/2014/04/03/paradigm-collapse-trauma/","cat":"news_&_views","id":"comment-96266","author":"Louis","site":"shroudstory"},{"title":"Paradigm Collapse Trauma","post":"They’re not in it for the message. They’re in it to make money from the Wow! factor. But some of the time it’s just narcissistic “Look at me!”\n\n","date":"April 4, 2014 at 5:48 am","url":"https://shroudstory.com/2014/04/03/paradigm-collapse-trauma/","cat":"news_&_views","id":"comment-96438","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paradigm Collapse Trauma","post":">>They’re not in it for the message. They’re in it to make money<<\nSounds like the opposite of Heath Ledger's Joker. ;) \"It's not about the money, it's about sending a message\". I'm sorry that BAR is now a mouthpiece for the views of Jacobovici, which are clearly flawed and biased, obvious even to a layman like myself. Whensomeons starts saying that an archeological find verifies claims made in a Dan Brown potboiler, you know there's something wrong.\n\n","date":"April 7, 2014 at 9:47 am","url":"https://shroudstory.com/2014/04/03/paradigm-collapse-trauma/","cat":"news_&_views","id":"comment-97386","author":"Larry","site":"shroudstory"}]
