[{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"Here’s another recent pdf from  G.Lucotte and T. Thomasset.\nhttp://jaanet.info/journals/jaa/Vol_5_No_1_June_2017/3.pdf\nThe title is “An Osseous Remain on the Face of the Shroud”.\n“Osseous remain” is another term for bone, human bone, composed of calcium phosphate etc. \nThe authors attempt to explain it in pro-authenticity terms (injury inflicted on the nose of the crucified Jesus).\nI have an alternative explanation.\nThe trickiest aspect of imprinting off a real person is the face, due mainly to the angularity of the nose. It creates creases in the fabric. Prof. Luigi Garlaschelli (not my favourite scientist – he fails to respond to my emails!) has suggested that a bas relief was used for the face, and for the face only, and up till now I have aligned myself with that view – albeit somewhat reluctantly. .\nAn alternative possibility now presents itself, but be warned, it’s not for the faint-hearted. \nA corpse was used to imprint the entire body, head as well as torso and limbs. How did they get round the problem of the nose? \nThey flattened it – with a heavy object, and in the process damaged bone and cartilage, one – but only one – fragment of which was left on our simulated sweat/blood imprint of medieval provenance, as per the radiocarbon dating, the one that was originally the Shroud of Lirey, near Troyes, France,  now the Shroud of Turin.\nSo that’s two useful inputs from our  highly observant and methodical microscopy friends in Paris, both from that sticky tape sample taken from a “bloodstain” on the right eyebrow – reddish-yellow  clay serving as Mark 1 blood (see comments immediately preceding this one) AND now a fragment of bone that allows this modeller to ditch, or at any rate shelve, Luigi Garlaschelli’s bas relief suggestion.\nReplace “bas relief” with “bash relief” ? 😉\nPS (added Sat Nov 4): extract from Mark Antonacci’s pro-authenticity book, 2000:page 17\nUnder “Facial and Head Wounds”\n“On close examination, his nose, which is bruised and swollen, shows a slight deviation that indicates the cartilage may be separated from the bone. Microscopic study also reveals that scratches and dirt are on the nose. The areas above and below each eye, especially the right eye, look swollen, and the face appears to have been beaten with a hard object (such as a fist or  stick) and/or injured in a fall.”\nOne does not get a fragment of bone on a face by beating it with a fist of even a stick. One gets it by smashing it, as if porcelain, using something rather more substantial – an iron bar or a brick – creating what the paramedics call an “open fracture”…\nI reported an anomaly with the nose as long ago as October 2014, finding it did not respond to 3D-rendering in ImageJ’s ‘thermal LUT’ mode, as one might expect for prominent relief, compared with surrounding features like brow ridge etc.\nhttp://colinb-sciencebuzz.blogspot.co.uk/2014/10/continued-modelling-of-turin-shroud.html\nWell, it wouldn’t, not if it had been a real face, a real nose, one where the latter had been hammered flat post mortem!\nWe now have an explanation for why the SIDES of the nose are imprinted, a detail that has been alluded to time and time again in the past as crucial evidence against imprinting by physical contact. Here’s an instance from Antonacci’s book – though there are several more I could have cited:\nFrom Page 63, under “Direct-Contact Theories”\n“… the Shroud body image was imprinted even where there must have been some distance between the cloth and body (for example the sides of the nose). When the investigators pressed the cloth onto those surface points where contact was not made during the natural draping over the face mold, the resulting image was greatly distorted…”\n","date":"November 3, 2017 at 7:03 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10209","author":"Colin Berry","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"Have just added this quickie schematic to the end of the current posting. See the caption there and my comments immediately preceding this one for details (while latter still visible in side margin).\n\nI’d normally go to a bit more trouble with artwork etc, But it’s simply not worth the bother, the internet being a dead loss as regards reporting of experimental data/ideas development in real time (says he after banging head against brick wall for the best part of six years)..\nAfterthought: I did a whole series of postings in 2012 using my (then) new toy – ShroudScope – looking closely at the bloodstains.\nE.g. this one from June 11, 2012\nShroud Scope 1: Let’s take a closer look at the bloodstains on the Shroud of Turin. Correction – the images that are interpreted as bloodstains.\n I suggested there had been extensive flaking off of blood, while puzzling that unflaked-off blood was congregated sludge-like on the highest ribs of the herringbone weave, which does not happen when one dabs on real blood (which soaks into the weave). More to the point I puzzled the yellow-brown patches that accompanied the blood, having their own distinctive stain-like appearance, suggesting two entirely different components were present, apparently superimposed, which would not preclude one being underneath or on top of the other.\nI shall now go back and take another look, with the ‘new model’ proposed above firmly in mind, namely that the Mark 1 blood on the Shroud was a slurry of reddish-coloured clay in water.  That was later touched up, probably decades later, with Mark 2 blood (or “blood”) of a brighter, redder hue. It’s Mark 1 blood that has given rise to the McCrone mineral/iron oxide contributions not just to body image but to the blood ‘story’ and the latter (probably) to Adler/Heller’s  “blood too red/porphyrin/protein” one. In short we seem to be dealing with hybrid two-tone blood!\n","date":"November 1, 2017 at 3:03 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10205","author":"Colin Berry","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"I hesitate to say it, but after some 6 years of getting nowhere in challenging sindonology’s fond illusions, dressed up as science, it’s time to tell it the way it is.\n Sindonology is a pseudoscientific cesspit…\n","date":"October 30, 2017 at 6:01 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10192","author":"Colin Berry","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"Just make a Shroud. Simple for you to do.\n","date":"October 30, 2017 at 6:15 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10193","author":"James Bond","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"Kindly supply me a 4.4 x 1.1 m length of top quality 3/1 weave herringbone linen. Kindly supply me 1, or better still, 2 naked adult male volunteers to serve as subjects, willing to be coated with oil and flour, then to have wet linen pressed against them to  model and capture their “simulated sweat imprints”, frontal and dorsal. \nKindly supply a remote farmhouse deep in the countryside where the imprinting can be done  behind closed doors and blanked-out windows without risk of being overlooked by nosey neighbours. Kindly supply a largish open charcoal fire over which that twice-folded piece of linen can be slowly roasted, still a sizeable 2.2 x 0.55m\nBetter still, find me someone else to do your ‘clincher’ experiment, the substantial bill for expenses to come to you, not me.\nI’m only here for the science – not the showbiz….\n","date":"October 30, 2017 at 6:38 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10194","author":"Colin Berry","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"Well Sir, your science is flawed then.\n","date":"October 30, 2017 at 6:48 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10195","author":"James Bond","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"If you say so. End of conversation.\n","date":"October 30, 2017 at 6:50 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10196","author":"Colin Berry","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"Ask as much as you want, James, but I’m not in the business of re-forging what seems indicated – via numerous lines of scientific evidence – as simply (or in this case – not-so-simply) an ingenious one-off medieval forgery…\nWhat bothers me – and has done so for years, nay decades – is the intrusion of agenda-driven pseudoscience into the debate, correction, non-debate. Agenda-driven pseudoscientists shrink from debate… One might almost describe it as their defining characteristic …\n","date":"October 30, 2017 at 5:16 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10190","author":"Colin Berry","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"Well I have been following your scientific method(s) of trying to disprove the Shroud and to compliment you, you’ve done a good job giving alternatives and I use them to compare what the other side has for their evidence. It’s still an on-going process and finding other websites that agree with your findings/experiments is an on-going process.\nRegards,\nJames\n","date":"October 30, 2017 at 7:54 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10198","author":"James Bond","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"I’m content to model James, not reproduce in every detail. Why? Because that’s what scientists do, whether you like it or not – they model. They do not feel compelled to reproduce the results of forgers – merely to show that forgery techniques were deployed, as described earlier for the Piltdown Man.\nEarlier in this thread I showed the kind of negative image I get with flour-imprinting from a 3D figurine. The same technology works, IN PRINCIPLE, from my hand, face even. I leave it to others to fine- tune the details. If that means continuing scientific obscurity  – then so be it.  Working scientists are accustomed to obscurity. One does not go into scientific research for fame and glory.\nBut one has a reasonable expectation of being noticed and responded to by those describing themselves to the media as fellow “scientists” – sindonologists included.\n If ignored by those same fellow “scientists” , media-hogging ones especially,  then it’s a fair bet they are not real scientists, but in it for something else – agenda pushers, pseudoscientists, brain-washers  etc etc … Sorry to be so blunt…\n","date":"October 30, 2017 at 4:28 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10188","author":"Colin Berry","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"You showed but you’ve not created a Shroud. Create one is all I’m asking.\n","date":"October 30, 2017 at 5:05 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10189","author":"James Bond","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"I thought I’d list some of the oddities re the Shroud, ones  that pro-authenticity advocates rarely if ever address in detail, ones I CAN account for in the ‘simulated sweat imprint’ model.  I imagined at the outset I might be able to summon up a dozen or so. I’m currently up, to 37!  Here they are, as they came to mind, i.e. in no particular order.  \n1. The half tone effect, discontinuities etc\n2. The bulbous look of the man on the Lirey pilgrims’ badge and the rope across the waist…\n3. The image chromophore – melanoidin/simulated sweat\n4. The 4 symmetrical sets of poker holes’\n5  The non-unique so-called 3D properties (Year 1532 burn holes etc)\n6. The lack of sides on the body image/face\n7. The imaging of soles, not tops of feet\n8. The diimide bleaching, at odds with McCrone’s “iron oxide” pigment\n9  The chin/neck “crease”, same coloration etc as body image.\n10.The ref to SUAIRE and accompanying vignette face on the Machy mould\n11.The early historical references  to blood AND sweat (15th16th centuries)\n12.The unexpected brittleness of image fibres – melanoidins are polymeric solids\n13.The second face/hints of reverse-side image etc\n14. The alleged imaging of “water” as well as blood from side wound\n15. The cuts and scratches on linen from scourge\n16. The superb condition/longevity of the linen (heated and washed)\n17.The so-called xray features (skull, teeth, fingers etc)\n18. The unusual location for the blood belt accumulation\n19. The artefactual coins on eyes – misapplication of 3D-rendering software\n20. The alleged traces of starch\n21. The de Charny links with French Court of King John,  the financing of his humble wood-built ‘private chapel’, its staffing by 5 ‘dean and clerics’. its independent collegiate status…\n22.The so-called misidentified sedilli – additional  burn holes close to poker holes\n23.  The improbable position of crossed hands, missing thumbs – live volunteer.\n24. Small height difference, approx 4cm, frontal v dorsal.\n25. The hair looks  brown in the negative, silver in the positive, not as expected – from a photographic negative – the other way round.\n26. The quality side of J of A’s “fine linen”   i.e. herringbone weave does not face out, as might be expected, but inwards (imprinting side).\n27.Body image not altered in appearance by heat from the 1532 fire, even from nearby burn holes.\n28.Custodians content to fold the Shroud AND  face longitudinally  in half for storage! The face could have been kept free of fold marks.\n29. Wound sites indicated by bloodstains only. No imaging of wounds in the body image.\n30 Imaging of neck, indeed underside of chin, not expected in “loosely draped linen”\n31.Dorsal side approx intensity body image as frontal. Buttocks not noticeably flattened.\n32 Considerably paler junction area where two crossed hands meet, as expected of imaging via contact only.\n33. Linen turns around head, not feet, contrary to what might be expected of a “burial” shroud .\n34.No evidence of myrrh or aloes, as might be expected of a  genuine “burial” shroud.\n35. Image restricted to a few fibres on the crowns of threads, ie. highest point of the cylinder as viewed in cross section, and possibly the crowns of fibres too.\n36.Early shroud reported to have been laundered many times, boiled in oil etc etc as test of image permanence.\n37 No  convincing demonstration of red corpuscles, no obvious blood clots, atypical porphyrin spectrum. \n(Not bad eh, for my “flour, sweat and little models” ?)\n","date":"October 30, 2017 at 1:55 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10182","author":"Colin Berry","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"Could it be a Forgery?\nThe two most common explanations of the Shroud are: 1) It is a forgery made between 1260 to 1390 AD, based on the C14 dating, probably made in northern France, and 2) It is the authentic burial cloth of Jesus from about 33 AD. Note that several of the above items are inconsistent with the Shroud being a forgery from the Middle Ages. A forger would not have known to:\n    Place invisible serum rings around the blood exudate of the scourge marks.\n    Add pollen to the Shroud that is unique to the Jerusalem area.\n    Add pollen around the head that is from a plant with long thorns.\n    Put a microscopic amount of dirt in abrasions on the nose and one knee.\n    Put bilirubin into the blood.\n    Locate the nails in the wrists or fold the thumbs under, contrary to paintings from the Middle Ages.\n    Put microscopic chips of limestone from Jerusalem into dirt near the feet.\n    Use a stitch unique to the first century to sew the three-inch wide side strip to the main shroud.\n    Create a negative image with 3D information content in the image.\n    Create an image based on a change in the covalent bonding of the carbon atoms in the cellulose molecules.\n","date":"October 30, 2017 at 2:01 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10183","author":"James Bond","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"It’s not acceptable for adherents of pro-authenticity sindonology – whether recent  (as is apparently the case with yourself) or long-established ones – to go producing that same dogeared  checklist, year after year, expecting folk like myself to respond laboriously  ,  point by point, and then responding in turn with the Big Stunned Silence.\nYes, that’s what happened again and again, starting close on 6 years ago on Dan Porter’s shroudstory site. \nYou see, I happen to know quite a lot about bilirubin,  admittedly just one – point 5-  in your checklist, having researched bilirubin  full-time  for 2 years  as Research Specialist  – 1970-72 – at the University of Pennsylvania Hospital Medical School AND published several papers with my colleague – the late Don Ostrow MD.. Dan Porter invited me to write a summary of my thinking  re bilirubin and Shroud ” blood” for the closed shop SSG (Shroud Science Group) which I promptly did. \nResult – total silence. Later one of sindonology’s respected figures, an MD who shall  remain nameless, asked me to expand on the details, which I did. Result – again, silence.\nSorry, I’m no longer  willing to respond to detailed questions re the science if all I get in return is silence. My time is better spent in picking up on neglected details, going boldly etc …\nThat’s what I and other pressed-for-time  scientists do, We go boldly where no man has been before. We have no time for ancient dog-eared checklists that get pushed under our noses time and time and time again, making inroads on precious time…\nNow if you want to select a particular item from your checklist,  James, then spend some time, researching  just a single point in detail. Then by all means come back better-informed with a searching question or two, addressed to one or  more crucial details, selected if you wish  to put me on the spot.  Then I’ll respond (bring it on!) but  not before.\nSorry, but  I have no further time for dusted-off checklists…Let’s be seeing some new original thinking please….\n","date":"October 30, 2017 at 3:53 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10186","author":"Colin Berry","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"The thing is Colin I have. I’ve checked both sides of the controversy and so far you’ve come up short a bit. All you’ve done so far is show different ways the Shroud was made but by your own “scientific” research haven’t been able to produce the equivalent of the Shroud. I keep stating: make a Shroud using your scientific components you’ve devised and create an identical Shroud.\n","date":"October 30, 2017 at 4:01 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10187","author":"James Bond","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"I really don’t see any point in continuing this conversation James, and must ask you politely to vacate this Comments thread if you are unable or unwilling to be more constructive.\nI have placed my cards on the table by proposing the Shroud to be a simulated sweat imprint of medieval manufacture, intended to be a bigger and more lucrative draw for pilgrims than the then-fabled Veil of Veronica. I have shown how that sweat imprint could and probably was manufactured using simple homely materials – white flour, vegetable oil, an open charcoal fire, soap and water. The only costly input was the linen with the herringbone weave, designed to cement a link in pilgrims’ minds with the Joseph of Arimathea narrative.\nIt’s simply not on for you to come here making dismissive comments about my unique science and technology that has taken 6 years to develop (although it’s arguably no worse than the silence from sindonology in general). My simulated sweat narrative is coherent, i.e. hangs together, and at least for me ticks any number of  boxes.\n  I shan’t mince my words.  I say to you and mantra-intoning sindonologists  everywhere with no realistic or credible model worth speaking of for explaining the ‘enigmatic’ body image : it’s time to put up or shut up… (especially a Pasco attendee whom one would expect to be bursting with the latest ideas and findings from pro-authenticity sindonological research). \nOops,I forgot:sindonological research = SIN! DO NO LOGICAL RESEARCH  😉\n","date":"October 30, 2017 at 6:31 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10177","author":"Colin Berry","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"Okay, well  model a Shroud indistinguishable from the real one since you’ve all this six year experience with flour and sweat and your little models.\n","date":"October 30, 2017 at 1:30 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10181","author":"James Bond","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"PS: But here’s one of my results from yesterday (click to enlarge).\n\nThe experiment was NOT intended to show I could replicate the TS image in every detail. (That could take hundreds of experiments, tweaking this, tweaking that, which is  suck-it-and-see technology, not science. I leave that to others with more of a publicity-hungry showbiz approach to sindonology (naming no names!).\nIn fact I was checking out the possibility of employing twice-folded imprints on linen at lower temperatures (160 degrees C for 60 mins).  As can be seen from the final (unwashed) imprint, the altered technique worked fine,  provided the imprints were not folded inwards on themselves (I suspect that direct infrared radiation from a hot element is needed for image development , at least at lower temperatures).\nI have now evolved a very flexible technique, where one air-dries the fresh imprints first, before putting in oven. One can then remove the linen at will, as many times as one wishes, to check on progress. If the imprint is less intense than one wishes, then one simply puts it back for a longer time, a higher temperature or both. If the imprint is uneven as a result of compact folding-up for the oven, then one simply re-folds in a different way and puts it back in the oven. Where there’s a will …\n","date":"October 29, 2017 at 12:11 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10171","author":"Colin Berry","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"Again I say: Make a shroud just like the ST and I’ll be a believer. You’ve all the expertise so make one, call on all your experts to create an exact duplicate. All you’ve been doing so far is pointing in all different direction on how “possibly” it could have been done but you’ve not created one yourself that is indistinguishable from the original. So far you and all the other Shroud deniers have not come up with their own shroud to show to the public an exact duplicate. PS: Can’t use flour or sweat.\nRegards,\nJames Bond\n","date":"October 29, 2017 at 7:28 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10172","author":"James Bond","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"When the cobbled-together skull of the Piltdown Man was declared a forgery, the scientists who arrived at that (now unchallenged) conclusion, based on damning evidence re filed-down teeth, artificial bone-colorants etc, were not required to assemble a new forgery!  That’s not how science operates…\n","date":"October 29, 2017 at 7:32 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10168","author":"Colin Berry","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"There was no need to remake the Piltdown Man since it has been proven to be a fake. Your organization on the other hand just gives “possible ways ” the Shroud could have been made. You’ve not duplicated any portion of the Shroud whereas it’s real easy to duplicate the Piltdown Man. Make a Shroud that’s indistinguishable from the original. Should be easy, right?\n","date":"October 29, 2017 at 11:49 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10173","author":"James Bond","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"Here’s the current ‘model’ of original heat-development of Shroud flour-imprint over a charcoal fire. \n\n The twice-folded linen, this time with flour imprints on the INSIDE, not directly facing the original charcoal embers, will be slung horizontally such that the closest side to my modern fan oven radiant heat source (+ hot convected air) will be 1, followed by 2, 3 and 4 (i.e., in the same decreasing order of burn intensities as the so-called pre-1532 “poker holes” which, as indicated yesterday, I suspect were acquired at the time of manufacture. Indeed, it may have been the perceived risk of damage from flying embers that would have prompted the TS artisans to opt for the above design with imprints supposedly tucked away ‘safely’ (!) on the inside of twice-folded linen.\n","date":"October 28, 2017 at 9:48 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10159","author":"Colin Berry","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"Well if you and your associates and your lab can replicate exactly the Shroud I will be the first to join your camp. I want to see your replication side by side with the real Shroud and the experts could not detect the difference.\n","date":"October 28, 2017 at 2:51 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10160","author":"James Bond","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"Well, I’m working on it James. That’s me, I hasten to add, and me alone, a retired science bod, interested in any number of puzzles and enigmas (Stonehenge, Silbury Hill, biogenesis, smoke pollution from domestic fires, etc etc).  No associates, no lab, just an enquiring mind… The difference is that I report my thinking and ideas via internet blogs in real time – if only to counter the increasing invasion of agenda-driven misinformation…\nThis is just one of my 3 websites I maintain (though admittedly the other two have been neglected of late, due to my ‘homing in’ I believe on the means by which the TS body image was fabricated  via flour-imprinting in the mid 14th century…. \nToday’s experiments with folded linen and low-temperature image development, which I summarize tomorrow,  have proved most encouraging to my central hypothesis : flour imprinting, followed by thermal development to create a faint but resistant melanoidin-based chromophore, aka ‘half-tone’ yellow image…\n I bet you didn’t hear about melanoidins at your carefully-choreographed Pasco conference –  with its light-at-end-of-tunnel obsession  with ‘resurrectional incandescence’…. That’s despite STURP chemist Ray Rogers having flagged them up – albeit in his authenticity-friendly narrative…\n","date":"October 28, 2017 at 3:17 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10162","author":"Colin Berry","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"As I mentioned before: You create a shroud that can’t be detected from the original and I will be your most vociferous adherent and supporter.\n","date":"October 28, 2017 at 3:46 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10163","author":"James Bond","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"I’m in correspondence as we speak with a prominent pro-authenticity figure in ‘Shroudology”. Yesterday I presented this major figure with my list of criteria that needed to be explained, if not exactly reproduced (being interested only in explaining the underlying principles of the science/technology of the Shroud  – dispelling the hugely over-hyped mystique one might say).\nHere’s my list  of criteria re the supposedly ‘enigmatic’ body image which are said to challenge and indeed confound modern science:\n1. negative (tone-reversed) character,\n2. 3D so-called “properties” (disputed)\n3. faintness/ alleged superficiality.\n4. lack of sides to body image, precluding any  wrap-around “lateral image distortion” arising from curvature in a whole body template.\n5. uniformly faint yellow colour\n6. indistinct fuzzy edge to body image\n7. alleged ‘half-tone’ effect and discontinuities.\n8. lack of uv fluorescence, allegedly ruling out any kind of thermal imprinting process (“scorch”)\n9. image homogeneity\n10. brittleness of image fibres\n11.heat and water resistance\n12. absence of evidence for any substantial change (birefringence etc)  in the cellulose of flax fibres.\nAny thoughts?\n","date":"October 28, 2017 at 3:58 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10164","author":"Colin Berry","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"Just replicate so that scientists are unable to tell the difference. That’s all.\n","date":"October 29, 2017 at 12:32 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10165","author":"James Bond","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"Here’s a graphic of those famous so-called L-shaped poker holes, culled from the newgeology site. (Saves me having to do my own!).\n\nI’ve printed it out on A4, speared the site of the so-called poker holes with a hot needle, and confirmed that the 4  L-shaped sets of holes line up almost perfectly if one first folds the paper lengthwise along its long axis, and then breadthwise along its short one. The lined up holes on all 4 layers then coincide very closely with the geometrical mid point of the twice-folded paper.\nThose “poker holes” preceded the 1532 fire, but display the same (to my mind) unexpected feature namely that a revered ‘holy relic’ was folded up at least twice with a crease running right down the centre of the face of the Man on the Shroud! (Well, not quite the centre, but approx vertically through the subject’s left eye).  I commented as much on that years ago when looking at the same symmetry of the 1532 holes, with the word “cavalier and disrespectful” in the title. At the time, I focused attention on those 1532 burn holes, giving little thought to the “similarly symmetrical “poker holes”, while thinking how improbable was that ‘official’ rarely-if-ever-challenged poker-inflicted explanation. The way the charring falls off rapidly as one goes through the 4 layers of cloth, labelled 1-4 above, hardly fits with the thrust from a hot poker, but maybe better with some kind of briefly incandescent red hot embers as also suggested, assumed to have dropped from above, e.g. a censer.\nAh yes – red hot embers.\nHere’s an alternative explanation that you won’t have read before elsewhere. The 4 sets of “poker holes” were acquired during Shroud manufacture when the flour-imprinted linen was folded in 4, and then slung horizontally , supposedly at a “safe height” (!) over a bed of red hot charcoal for image development. Embers flew up from the fire and hit the lowest part of the hammock-like arrangement, i.e. the dead centre of the folded-up ensemble. Damage was most severe at the first point of contact, decreasing rapidly through the next 3 layers.\nI’ve been experimenting with gentler roasting routines that might arguably work better if our medieval artisans had indeed folded the linen in 4 for heating and colour-development. Success! One does not need 180-200 degrees C as used previously. 30-60 mins at 160 degrees is just as effective, and may avoid uneven colour with a folded sheet ( though still to be tested). It’s also much easier to wash of the  detachable surface encrustation with soap and water from low-temperature roasting, leaving that faint, ghostly Shroud-like negative image – see blog banner…\n","date":"October 27, 2017 at 8:33 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10155","author":"Colin Berry","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"Those “poke holes” were caused by melting lead when the Shroud was folded in a  case in a church that caught fire, the holes were caused by lead in the case melting as the fire grew hotter and the lead burned the holes. The reason they all lined up was because the Shroud was folded up.\n","date":"October 27, 2017 at 2:43 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10156","author":"James Bond","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"I think, James,  you have the 1532 Chambery fire, with burn holes from molten silver (not lead) dripping down onto the twice-folded shroud  from a melting storage casket/reliquary, confused with an earlier episode that somehow created the smaller L-shaped burn holes. \n But the L-shaped holes were NOT from the later 1532 fire, since they are shown in the 1516 Lier copy of the Shroud, painted some 16 years  before the 1532 fire, showing the  L-shaped holes ONLY! \nThat does not mean, needless to say, that the L-shaped burn holes appeared in 1516. They could have been there from the very beginning,  an accident of ‘manufacture’  using  a bed of hot charcoal as heat source to develop a flour imprint, as I’ve suggested here (an original ‘brainwave’  if I’m not mistaken!). \nThank you all the same for your comment, albeit one I consider to have two entirely different Shroud-damaging events confused…\n","date":"October 27, 2017 at 4:18 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10157","author":"Colin Berry","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"We’ve all heard of the so-called ‘voyage of discovery’ . For this shroudie sleuth, the last few days might be described as a voyage of rediscovery. Yes, I’ve been going back to features that were the subject of postings 4 or 5 years ago, and realizing that I did not do full justice previously to what was staring me in the face. The latest example is that Lirey Pilgrim’s badge, with that curious coiled rope-like structure that is strung horizontally across the small of the back on the dorsal side AND then extending off-body to both sides of the linen.\n\n Historian  Ian Wilson interpreted it as the “blood belt” in which case one must ask: why show that “blood” only – in bas relief no less – and no other blood, e.g from the lance wound?\nMaybe it does represent a rope. But there’s no obvious rope, or depiction thereof,  on the Shroud body image itself, at most a blood belt with a chain-like appearance in places – hardly a coiled rope. And why does it extend across the whole width, off the body image?\nBut aren’t we overlooking something? The designer of the Lirey badge went to a lot of trouble to show both the body and (?) rope in bas relief (which involved a lot of meticulous internal scooping out and sanding of the small stone template/mould (UK)/mold (US) used for casting the lead/tin alloy).\nWhy did he do that, given the TS image is 2D, not a bas relief, far less a 3D? Why not just show the TS image as if a painting, say of the founder of Christianity on his final burial shroud, whether pre- or post-Resurrection?\nI say there are two main reasons. First he wanted to ‘educate’ the first time viewer into seeing the ‘two-fold’ image as an actual body IMPRINT (most definitely NOT a painting that could be misconstrued as that of  the crucified Jesus on his final burial shroud, the fabric being mistaken as mere artist’s canvas, albeit upmarket as regards intricate weave pattern). Would the negative (tone-reversed image) be sufficient, and be correctly interpreted?  Probably not – an the badge alone could not be used to convey a negative image. Consequently, a visual aid was considered a worthwhile insurance policy, indeed necessity, to guard against misinterpretation of the Shroud’s faint body image and/or the material on which it is placed!  Repeat: the body image had to be seen as an IMPRINT, not a painting. \nSecond , the badge designer  wanted to hint at the time and place the unique imprint was acquired, i.e transport to the cross, not afterwards in a rock tomb with all the attendant ambiguity and complications (post mortem changes, resurrection). Thus the addition of a rope, yes ROPE, used to assist in the so-called “Deposition”, i.e.transferring a crucified body from cross to the spread-out receiving linen, herringbone weave face up – see earlier comment). The bas relief can be viewed as ‘artistic licence’ which allowed the badge designer to indicate  what was there BEFORE the imprint, whether it left an imprint (the BODY) or not (a temporary lifting ROPE). \nIn short, the rope was a way of saying: see the Shroud imprint as one acquired en route from cross to tomb, not the tomb itself. It is a transport shroud, possibly allegorical like the Veil of Veronica, and NOT be seen as the final burial shroud (to which some might take umbrage, the local bishop in the first instance, and who knows, maybe the Pope himself!). The Lirey badge ploy may have done the trick, at least for the first year or two of lucrative public displays of the ‘ailment-curing’ Shroud  of Lirey. Shame about its successor – for which we have the so-called Machy mould only. The Mark 2 badge designer  pushed his luck with that additional face and ESPECIALLY the somewhat ambiguous word SUAIRE  (sweat cloth? burial shroud?) directly underneath! First bishop, then Pope, went ballistic, banning further displays of the money-spinning Lirey shroud for 30 years!\n","date":"October 26, 2017 at 8:09 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10153","author":"Colin Berry","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"Detailed imagery? Earlier you were telling us that the loss of detail if/when one viewed at too short a distance was a reason for considering the image was not man-made. Now you’re saying the image is detailed…How can a vanishing image be detailed  if one cannot view it at  sufficiently close quarters in order to discern detail?\nThis might be an opportunity to make a point: there’s not just one but two competing shrouds in the literature. There’s the one that is in the glass argon-filled case in Turin, the one that elicits comments like “I can scarcely see a thing!”. “Try reproducing that level of image subtlety and superficiality” they say! Then there’s the other shroud in all the archive photos, which has been given oodles of extra contrast by one means or another.  “Try reproducing that level of detail and definition” they say!  (The 1931 Enrie photo was, incidentally, said to have employed a special photographic emulsion to give high contrast. These days one can do the same with digital software such that scarcely visible images leap right out the page!).\nSorry, but I also reject outright the idea that one has to reproduce every detail in order to make a case for the image being man-made.  One has merely to show that it’s possible to produce an image that is faint yellow, superficial (or apparently so!), negative (tone-reversed), exhibits the half-tone effect and discontinuities under the microscope etc. In other words, one shows there’s nothing irreproducible IN PRINCIPLE, i.e. nothing beyond known science and technology.  You would’t expect a modern day forger to reproduce the Mona Lisa in every single detail, so why expect the same of the Shroud?\nI’ve patiently and laboriously ticked all those”unique” criteria  boxes listed above with flour-imprinting/thermal development/water washing technology as displayed on my site banner  – and what happens?  Goalposts get moved, like a sindonology bigshot who shall remain nameless,  telling me not so long ago (on this very site)  that the crucial characteristic was the unique ‘homogeneity’ of the body image! Yeah, right… Sprinkle flour from above,  shake off the excess – homogeneity is assured!\n","date":"October 25, 2017 at 10:15 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10152","author":"Colin Berry","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"PPS: that list of 20 reasons for thinking the TS was originally positioned as a transport, not burial  shroud, has now grown to 27, so the best strategy right now is probably one of seeing if any more ideas come to mind before adding a new posting.  (New postings will almost certainly get the same treatment from ‘sindonology’ as the previous 500 or thereabouts, so i make no apologies for dragging my heels).\nIdea no.27 has given a particular sense of satisfaction, linking together as it  has a seemingly disparate collection of features: the symmetrical distribution of the  L-shaped so-called “poker holes” about the vertical midline,  the repeated resort to ‘disrespectful’ folding of the TS down its vertical (longitudinal) midline for compact storage (as distinct from rolling up) , creating a crease down the centre of the supposedly ‘revered’ face, the method of manufacture/ image development of the body image assuming medieval provenance, the manner of compact folding of the linen during proposed thermal image development, the risks of deploying a bed of hot charcoal for image development etc etc. \nYes, there’s a way of linking them all into a simple, coherent, internally-consistent narrative – and not before time. All will be revealed soon – not that it will make a blind bit of difference to the scenery out there…\n","date":"October 25, 2017 at 8:35 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10150","author":"Colin Berry","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"Well Sir, so far all you’ve proved (maybe) on how it could have been done but you’ve not actually produced one that is exactly the same as the Shroud with all the detailed imagery and all. You make an accurate duplicate and I’ll be in your court.\n","date":"October 25, 2017 at 9:44 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10151","author":"James Bond","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"PS: I’ve decided that the next posting – see  previous comment – will list at least 20 reasons for regarding the linen as primarily a pre-burial TRANSPORT shroud, and that the image – whether genuine or more likely simulated – was not only acquired notionally in the transport phase immediately post-crucifixion, but likely to have been seen as such by the first cohorts of pilgrims descending on Lirey. \nThere will be what I regard as a new addition to that list – a feature that I don’t recall having been flagged up elsewhere. It’s to do with the briefly-Gospel-appearing J of A’s decision to have expensive ‘fine linen’ delivered to the cross to receive a blood and sweat-covered body.\nThe TS certainly fits the description “fine linen”, given its 3/1 herringbone weave. But that fancy-patterned weave is only visible on one side (the side with visible threads being 75% warp-origin)  – the opposite side being allegedly much less attractive (75% weft threads). So the herringbone weave would need to have been visible to spectators on the OUTWARD non-body contact side  right? \n But which side was visible to spectators, given the image is imprinted on the herringbone weave? NOT the herringbone weave!. \nSo the choice of herringbone weave was unlikely to have been J of A’s (authenticity scenario).  It was more likely that of the medieval artisans who decided to model/simulate his improvised-stretcher  means of transport – having discovered no doubt that  apart from the quality-look (“fine linen”), one can get a much better imprint onto a herringbone weave with those more elevated flat-top multi-platform warp threads than on a simple 1/1 weave! One just has to be careful to imprint onto the correct side of that herringbone weave!\nSee this series of postings from the retired shroudstory site for the difference between the two sides of a herringbone weave.\nhttps://shroudstory.com/category/news-views/page/288/\n","date":"October 24, 2017 at 7:33 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10134","author":"Colin Berry","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"One of the FEW advantages of being blackballed by mainstream so-called sindonology (and Google too – the two probably being connected) is that one’s postings no longer have to be pre-prepared in detail. One can put up a title, and a mere introduction for starters, giving a hint of what’s to follow in bite- size instalments.\nThat’s what I shall now proceed to do. The title of the next posting?\n“The Turin Shroud – conceived and manufactured in the mid 14th century as a vastly more REALISTIC Relics-U-Like upgrade of the celebrated Veil of Veronica.”\nBut that’s not saying anything I haven’t said before these past 3 years of a 6 year hands-on project to unearth the truth regarding that so-called burial shroud. (Which it’s not, being better described as a simulated TRANSPORT shroud – modelled on the Joseph of Arimathea intervention, i.e.his providing fine linen to receive a newly deceased victim of crucifixion straight from the cross while blood AND sweat were still reasonably fresh and thus EACH able simultaneously to deposit an IMPRINT, one bold, the other faint).\nHowever, this worm has finally turned. This worm will no longer be content to idly observe that his off-message explanation for the Shroud has failed to gain traction, despite 6 years of posting on this internet site,  on his sciencebuzz site too, despite numerous postings to say nothing of some 2000 comments to the retired Dan Porter shroudstory site, despite a handy summary by (sadly now departing)  Editor Hugh Farey in his May 2015 BSTS Newsletter, making reference to the ‘simulated sweat imprint’. The issue is no longer about where the message has appeared. It’s about where it has NOT appeared and WHY!\nNo prize for guessing btw which sites are within my sights, so to speak. Like, you know, shroud.com, like shroudenigma.com, like the TS wiki entry, where I appeared briefly only to be quickly edited out …  need I continue?\nNo, to be ignored so completely for so long, such that an internet search under (shroud turin simulated sweat imprint) brings up for the most part my postings only, with scarcely if any secondary listings to others’ sites, newsletters, blogs, conferences etc  can surely be no accident. What we see quite clearly is a determined effort to suppress what is seen as a dangerous threat to sindonology’s protected, regularly and assiduously puffed-up little bubble of certainty, all the while pretending to be based on physics, medicine, pathology etc  etc. – though, in passing,  scarcely any worthwhile image chemistry worth speaking of!\nSo, as indicated two days ago, I’ll also be listing sindonology’s prime movers and asking – what role if any has each of them played –  either by their words, or  in most cases incomprehensible silence – in keeping this highly active investigator’s ideas and researches OFF the internet. The time for pussyfooting around the issue of positive OR negative exclusion, i.e BLACKBALLING is over …\n","date":"October 23, 2017 at 7:14 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10131","author":"Colin Berry","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"James Bond says:\nOctober 22, 2017 at 3:38 pm\nAnd supposedly all those Middle Ages artists knew about different techniques you’re bring up? Why weren’t there a deluge of fake Shrouds made since that era was very very religious making all sorts of icons and producing paintings with all sorts of religious themes, why not more Shrouds?\nWhat you propose might make sense if one subscribed to the notion, proposed by Hugh Farey and others, that the TS was a kind of liturgical prop, an accompaniment maybe to a recumbent wood carving of the crucified Jesus. Were that the case, there would surely be something in the historical record about churches or cathedrals performing such Easter rituals with much duplication of the imprinting technology. But pilgrims in the mid 1350s were not flocking to a major centre with a church or cathedral. They were descending on a remote hamlet with a humble private chapel belonging to the Lord of Lirey and his wife, added to which there’s written evidence (d’Arcis memorandum etc) that the Shroud was claimed from the very beginning to be the genuine article, with no suggestion that there were other ‘genuine’ shrouds elsewhere.\nWhat that says is that the Shroud was manufactured using highly secret, newly devised technology strictly as a one-off.  It would have needed only a single duplicate elsewhere to call into question the perceived ‘genuinness’ of the faked relic. That’s why the TS is/was a one-off – it had to be, since there could only be one piece of linen purporting to be that taken to the cross by J of A to receive a particular crucified body.\n","date":"October 22, 2017 at 3:53 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10127","author":"Colin Berry","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"Still no response to my request for feedback (except for ‘sheona’, who shares my sense of ‘non event’ as regards the Pasco proceedings (thank you sheona!).\nOne cannot continue in this fashion – posting new ideas, month after month, year after year- eliciting virtually zero feedback (while one’s sitemeter suggests one is being followed closely!)\nIt’s time for a long-overdue change of gear, after some 6 years or so of having one’s original ideas, hands-on-research being systematically ignored, especially post Dan Porter’s  shroudstory site-shutdown – Dec 2015 – at least in terms of mentions. flaggings-up, internet links etc,. (Thank you btw DanP, despite our many differences).\nWarning to you brazen self-serving  propagandists out there: I have just this minute mapped out an action plan –   one that (I regret to say, not caring for confrontation) has to NAME NAMES!\nI shall announce it in a few days or so, maybe less,  if I continue to be treated as the Invisible Man of sindonology! \n  I shall also append a list of my heroes too (though it’s short compared with those attempting to hide or distort the TRUTH!). \nOne or two past protagonists might be surprised to find themselves on my roll of honour… Science , to say nothing of the world of ideas generally, makes steady progress  via open-minded, well-motivated, truth-seeking  protagonism, even if getting one’s back up in the short term!\n","date":"October 21, 2017 at 6:33 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10107","author":"Colin Berry","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"I have just added this as a ‘pre-script’ to the start of the current posting, with lots of red ink (not deployed here)\nLate addition (October 20) : this is not the first posting on this site to have “simulated sweat imprint” in its title. I did an earlier one with those same three words in the title as long ago as November 2014 – yes, almost three years ago!\nI referred to my posting, somewhat tongue-in-cheek, as representing something of a ‘paradigm shift’, not only for me personally (having previously been hung up on the idea that the TS was a scorch imprint off a hot metal template – Model 2) but for sindonology too – having failed to find the concept of a simulated sweat imprint  i.e.of medieval manufacture – anywhere in the literature. \nResponse: I was instantly criticized by one of sindonology’s elder statesmen for deploying that term ‘paradigm shift’, though reasons were not given.\nHowever, give the ZERO RESPONSE from sindonology to the arrival of a brand new ‘take’, i.e. concept,  these last three years and indeed longer (starting early 2014 in fact) I now feel fully vindicated and justified in claiming to have introduced a ‘paradigm shift’. \nIt hardly speaks well of sindonology as a supposedly academic discipline, indeed a self-styled branch of ‘science’ if/when  it continues to ignore a significant new addition to the world of ideas. I’ve invited comments to this current posting on a long-established open-access site, one that still gets on average 20-30 visits a day from all over the world. So far, there’s been one only. Hopefully there will be more in the coming days and weeks. However, there seems little point in continuing to post new content unless or until sindonology wakes up to the presence of the ‘simulated sweat imprint’ concept, nay paradigm shift  in its own back yard.\nRest assured I will continue to do hands-on research with a view to improving the performance of my current Model 10 (use of white flour imprinting medium to simulate an ancient, dried-on, yellowed sweat imprint), and plan new postings.  But the first priority is to elicit feedback, whether positive or negative. One cannot be expected to operate in a vacuum, especially if/when one suspects that the vacuum is no accident – that mainstream sindonology is deliberately pretending one does not exist.\nLate postscript: here’s a list of the model numbers 1-10 in chronological order, starting with Model 1 (thermostencilling in Dec 2011) and ending in current Model 10 (midsummer, 2015)\nModel 1. Thermostencilling (the one and only ‘pure’ radiation model, quickly dismissed as impractical).\nSee this from Dec 2011:\nhttp://colinb-sciencebuzz.blogspot.co.uk/2011/12/turin-shroud-could-it-have-been.html\nModel 2. Scorching off a heated metal template, with nothing else apart from linen. (Finally abandoned for mainly practical reasons, but it gave valuable insights into the 3D properties of thermal imprints).\nSee this from Nov 2013.\nhttps://shroudofturinwithoutallthehype.wordpress.com/2013/11/14/a-challenging-scorch-assignment-that-i-had-been-putting-off-and-off-and-off/\nModel 3. As above, with thermosensitizer coating, notably white flour (a forerunner of the final Model 10). I had initially tested starch, glucose etc , surprisingly with little success. it may have been this which sowed the idea that there needed to be something else present. Ray Rogers’ focus on Maillard reactions helped, substituting protein for his volatile putrefaction amines.\nSee this from Oct 2014:\nhttp://colinb-sciencebuzz.blogspot.co.uk/2014/10/modelling-shroud-of-turin-image-with.html\nNB: There was a brief jump in Model 3 to current Model 10! (a horse brass was smeared in oil, dusted with white flour, then pressed onto dry linen. Shame it wasn’t wet linen, that would have given a better imprint, and allowed one to skip Models 4-8! But scientific models, let’s remind ourselves, are for using, not believing. Even models one knows to be deficient or even downright wrong can lead to new experimentation, new insights, better models…)\nModel 4. Wet imprinting with natural dyes, notably tannins, with added viscosity agents, essentially as described by Joe Accetta.\nSee this from March 2015\nhttp://colinb-sciencebuzz.blogspot.co.uk/2015/03/can-that-weird-and-wonderful-turin.html\nModel 5. Sulphuric acid, flagged up by any number of previous investigators – Luigi Garlaschelli, Joe Nickell, Hugh Farey (private communication) , the idea being that acids might have etching/discoloring effect on linen. Result: negligible discoloration, profound weakening of fabric at ordinary temps, no obvious coloration without applied heat.\nSee this from April 2015:\nhttp://colinb-sciencebuzz.blogspot.co.uk/2015/04/what-happens-if-you-spill-battery-acid.html\nModel 6: Substitution of nitric for sulphuric acid, first with plain linen, then flour-coated linen  (another forerunner of final model 10). Probably the most informative experiment of all, assisted by critical input from Adrie van de Hoeven, inasmuch as protein was implicated as a potential source of image chromophore, focussing initially on the traces of protein intrinsic to linen, then moving onto extraneous sources of protein coating, then finally dispensing altogether with nitric acid as developing agent, and replacing with oven-heating to produce Maillard reactions. (Yes, an echo there of Rogers, but in his pro-authenticity thinking, he had perforce to introduce some less probable sources of amino nitrogen and reducing sugars (decaying corpse and 1st century technical starch or soap coatings as a somewhat improbable source of reducing sugars).\nSee this from May 2015:\nhttp://colinb-sciencebuzz.blogspot.co.uk/2015/05/modelling-turin-shroud-my-flournitric.html\n\nModel 7. Quicklime. A longshot, using the thermochemical reaction between CaO and water as source of in situ heat, but quickly abandoned.\nSee this from June 2014:\nhttp://colinb-sciencebuzz.blogspot.co.uk/2014/06/first-test-of-quicklime-hypothesis.html\nModel 8. Lemon juice, with ascorbic acid (not citric acid) as the active ingredient – basically invisible ink methodology.  Probably operates via a Maillard reaction between (a) a constituent 4- carbon reducing sugar – threose – derived from thermal decompostion of ascorbic acid- and (b) amino compounds.\nSee this from October 2014:\nhttp://colinb-sciencebuzz.blogspot.co.uk/2014/10/modelling-shroud-of-turin-image-with.html\nModel 9: Imprinting with wet flour slurry onto dry linen then oven-roasting. Criticized for giving imprints that were too well-defined at edges.\nSee this from June 2015:\nhttp://colinb-sciencebuzz.blogspot.co.uk/2015/06/a-new-and-simple-thermal-imprinting_20.html\nModel 10: Imprinting with dry flour onto wet linen. Fuzzier imprints, negative, 3D response in ImageJ software, right thread and fibre properties at the microscopic level – i.e. halftone effect, discontinuities etc. Eureka!\n","date":"October 20, 2017 at 10:56 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10100","author":"Colin Berry","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"I haven’t watched all the  Pasco videos yet, Sheona.  But from those I’ve seen, one can only hope for their sake that attendees were provided with a couple of matchsticks on arrival – to keep the eyelids propped open. That and a couple of yawn-suppressing pills in the mid-morning and afternoon coffee…\n","date":"October 18, 2017 at 4:04 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10094","author":"Colin Berry","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"Oh Colin, if you seriously expect any comments, let alone an intelligent or relevant one, from characters like those who turned up at Pasco, you are deluded. They just sat there listening to the same old stuff over again. They can’t cope with anything new or outside their blinkered vision.\n","date":"October 18, 2017 at 12:46 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10093","author":"sheona","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"It goes both ways Sheona. The anti-Shroud crowd is the same way. You’re blinded to the fact that the Shroud is a fake then go about proving it is.\n","date":"October 21, 2017 at 7:37 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10109","author":"James Bond","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"I hope Sheona won’t object if I get in first, that being the blogmeister’s prerogative.\nNeither Geoffroy de Charny nor his wife Jeanne de Vergy, first recorded owners/displayers of the unique two-fold image we call the TS, ever gave the slightest clue as to how they came to acquire the ‘relic’. So how can anyone be expected to PROVE the TS is a fake, except by  open-to-dispute, non-foolproof radiocarbon dating? (If one considers the disputed 1260-1390 date, consistent I might add with that first display at Lirey in approx 1355, to be in error, for whatever reason, then there’s a simple answer – repeat the testing on more widely distributed samples instead of just the one corner!).\nTo insist on “proof” one way or the other is a counsel of perfection. In science at any rate one generally has to be content with amassing evidence for or against, unless it’s to prove that water is H2O (even then, it was later discovered that some of what we call water is D2O- deuterium oxide, “heavy water”).  When presented with a single unique specimen of unknown origin, there is and can be no burden of proof on either side of the argument, at least not absolute proof. What matters is the weight of evidence (oh, and the quality too, Stephen E.Jones please note, he being someone who seems to regard an ounce of feathers as worth the same as an ounce of gold dust).\n","date":"October 22, 2017 at 9:28 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10120","author":"Colin Berry","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"But so far no evidence to prove the Shroud a fake has been presented; just innuendo that it’s not and all sorts of demonstrations to create the equivalent have failed.\n","date":"October 22, 2017 at 2:49 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10124","author":"James Bond","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"Paolo di Lazzaro creates a brown discoloration on linen with his uv excimer lasers, and grabs newspaper headlines all over the world. I generate tone-reversed (negative) images from figurines (see blog banner)  my hand, my face even with similar or better response to  that of the TS in 3D-rendering software, with uniformly intense yellow coloration in some fibres with uncoloured adjacent ones (i.e. the mysterious half-tone effect) AND abrupt discontinuities, as apparent in the Mark Evans photomicrographs.  And what’s the response from   pro-authenticity sindonology, yourself included?  That my 6 years of research have produced nothing of  interest or importance! You and your fellow true believers carry on year after year mouthing your mantras to the effect that science has never reproduced the TS body image AND NEVER WILL. You attend your pseudoscience congresses, wrapping yourselves in the cloak of “science”  while totally trashing the scientific method which operates on the basis of putting up and then testing hypotheses. You and your true believers do nothing of the sort – you simply trawl for anything that’s in the slightest bit different between the TS image and a conventional photograph, negative or positive, and then go invoking your ‘resurrectional incandescence”(pseudoscience does not get much worse!).\nI have news for you. The TS image is not any kind of photograph. It’s a contact imprint, more specifically a simulated sweat imprint, one designed to provide a whole-body counterpart to the Veil of Veronica, via the same imagined principle . That’s why the TS image is a  tone-reversed negative. It’s an imprint, a CONTACT-ONLY imprint with no imprinting across air gaps.  Sindonology does not want to hear about imprints. It doesn’t want its narrative based on magical mystery flashes of radiation to be undermined, either by the application of science – REAL science- or even  by plain simple, no nonsense commonsense.\n","date":"October 22, 2017 at 3:23 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10125","author":"Colin Berry","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"And supposedly all those Middle Ages artists knew about different techniques you’re bring up? Why weren’t there a deluge of fake Shrouds made since that era was very very religious making all sorts of icons and producing paintings with all sorts of religious themes, why not more Shrouds?\n","date":"October 22, 2017 at 3:38 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10126","author":"James Bond","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"It goes without saying – or should do – that a simulated sweat imprint that is what we now call the TS body image  has had plenty of  time to dry  – many centuries – and was created from the word go so as to resemble a body imprint that looked as if it had had 13 centuries prior to that to become not just dry but yellowed with age.\n","date":"October 9, 2017 at 10:58 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10056","author":"Colin Berry","site":"colinberry"},{"title":"Pro-authenticity Shroud investigators should have considered the body image as a SIMULATED sweat imprint – before rushing to their pseudoscience (‘resurrectional incandescence’ etc).","post":"Sweat print? Like that’s going to last hundreds of years not drying out?\n","date":"October 9, 2017 at 10:38 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/10/09/pro-authenticity-shroud-investigators-should-have-considered-the-body-image-as-a-simulated-sweat-imprint-before-rushing-to-their-pseudoscience-resurrectional-incandescence-etc/","cat":"bas_relief_face","id":"comment-10055","author":"James Bond","site":"colinberry"}]
