[{"title":"\nRe: Middle Eastern Features on Shroud Image\n","post":"\n\nDespite the arguments of pseudo skeptics like colinsberry that Alan. D Adler didn't prove the blood is real they must be able to explain these results and the presence of human serum albumin chidi\n\n","author":"Anonymous","date":"July 22, 2012 at 10:38 PM","url":"http://theshroudofturin.blogspot.com/2008/07/re-middle-eastern-features-on-shroud.html","site":"moore"},{"title":"\nRe: Middle Eastern Features on Shroud Image\n","post":"\n\nchidi>Despite the arguments of pseudo skeptics like colinsberry I don't know what Colin Berry's latest arguments are on this topic, because I don't read his blog.He has been permanently banned from this blog because of his repeated off-topic, offensive and sub-standard comments, so I would appreciate it if his comments not posted here, giving him a proxy presence on my blog.>that Alan. D Adler didn't prove the blood is real they must be able to explain these results and the presence of human serum albumin Agreed. But then Berry's position on the Shroud is \"invincible ignorance\":\"There does remain, nonetheless, a cast of mind which seems peculiarly closed to evidence. When confronted with such a mind, one feels helpless, for no amount of evidence seems to be clinching. Frequently the facts are simply ignored or brushed aside as somehow deceptive, and the principles are reaffirmed in unshakable conviction. One seems confronted with what has been called `invincible ignorance.'\" (Fearnside, W.W. & Holther, W.B., \"Fallacy: The Counterfeit of Argument,\" 1959, p.113).because for NO amount of evidence would be sufficient to convince him that the Shroud is authentic.Stephen E. Jones-----------------------------------Comments are moderated. Those I consider off-topic, offensive or sub-standard will not appear. I reserve the right to respond to any comment as a separate blog post.\n\n","author":"Stephen E Jones","date":"July 23, 2012 at 3:26 AM","url":"http://theshroudofturin.blogspot.com/2008/07/re-middle-eastern-features-on-shroud.html","site":"moore"}]
