[{"title":"So then, why is there an image?","post":"How much attention does the sudarium of Oviedo gets from scientists and the believers? Most people don’t even know anything about it even with recorded history more than 600 years before the shroud, the pollen and the real human blood. The sudarium only has the blood, no image. Examining the shroud would answer all the questions listed above.\n\n","date":"March 21, 2014 at 8:27 am","url":"https://shroudstory.com/2014/03/21/so-then-why-is-there-an-image/","cat":"news_&_views","id":"comment-91523","author":"Mike M","site":"shroudstory"},{"title":"So then, why is there an image?","post":"Dan,\nYour comment underscores one important point: It is the image that makes the Shroud unique, a singular object. There is no other burial cloth with such an image. While I have not  made an exhaustive study, blood stained cloths on a murder victims are probably not a singular item. All the stains do is indicate that  he bled and the extent of his torture. That’s not unique.\nIt’s the image that is a specific witness to the crucifixion, and circumstantial evidence of the resurrection. Given its unique characteristics and superficiality, there is no other such image.\nSkeptics, please cite an existing image and not a hypothetical one. The shroud is not a hypothetical object.\n\n","date":"March 21, 2014 at 8:27 am","url":"https://shroudstory.com/2014/03/21/so-then-why-is-there-an-image/","cat":"news_&_views","id":"comment-91524","author":"Johyn Klotz","site":"shroudstory"},{"title":"So then, why is there an image?","post":"Because it’s a miracle.\nHow do we know ther’s no image on the sudarium of ovedio?\nThere might be some form of image on it that isn’t readily discernable.\nThoughts?\n\n","date":"March 21, 2014 at 9:20 am","url":"https://shroudstory.com/2014/03/21/so-then-why-is-there-an-image/","cat":"news_&_views","id":"comment-91541","author":"Gerard","site":"shroudstory"},{"title":"So then, why is there an image?","post":"Why is there an image? A lovely question to be answered on many different levels, but in essence not different from why do the stars twinkle or leaves go yellow in autumn. As a scientist, I say these things are all inevitable consequences of the immutable Laws of the Universe; as a human, they are there to provoke awe and wonder and to stimulate curiosity about the universe and our place in it. As a Christian, they are all manifestations of the complexity of God, whose motives are not always (one might even say not often) as clear as we would like! And as me, I say that all these reasons are perfectly true and not at all incompatible with one another.\n\n","date":"March 21, 2014 at 2:28 pm","url":"https://shroudstory.com/2014/03/21/so-then-why-is-there-an-image/","cat":"news_&_views","id":"comment-91630","author":"Hugh Farey","site":"shroudstory"},{"title":"So then, why is there an image?","post":"Nice one Hugh. For a different down-to-earth (dare I say  terrestrial) response, see my sciencebuzz site in the next day or two. Thermal imprinting (medieval artefact) leaves its tell-tale signatures, especially when creases in the fabric gets trapped under the hot template.\n\n","date":"March 21, 2014 at 2:50 pm","url":"https://shroudstory.com/2014/03/21/so-then-why-is-there-an-image/","cat":"news_&_views","id":"comment-91636","author":"colinsberry","site":"shroudstory"},{"title":"So then, why is there an image?","post":"Warning (again): the Enrie and Durante photographs are sometimes misleading.\nMrs Flury-Lemberg published in “Sindone 2002” (p.45) an extraordinary photograph of the TS man face (oblique light).\nThe crease at the base of the chin (“V-shape groove”) is similar to many other creases found in other parts of the image areas. Particularly it is similar to the vertical imprint of the ” V-shaped center fold”\nAll these creases have nothing to do with the image formation process. They are related to the folding of the TS.\n\n","date":"March 21, 2014 at 4:51 pm","url":"https://shroudstory.com/2014/03/21/so-then-why-is-there-an-image/","cat":"news_&_views","id":"comment-91673","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"So then, why is there an image?","post":"Thierry you wrote: “All these creases have nothing to do with the image formation process. They are [implicitly ALL, my upper cases] related to the folding of the TS.” WARNING: Re e.g. the main/deepest creases framing the TS man’s head, they can be related to a tighlty wrapping-up as well… not just “folding”.\n\n","date":"March 21, 2014 at 5:07 pm","url":"https://shroudstory.com/2014/03/21/so-then-why-is-there-an-image/","cat":"news_&_views","id":"comment-91679","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"So then, why is there an image?","post":"If the creases were made subsequent to image formation, then flattening out the shroud, as was largely carried out during the 2002 restoration, should render them more or less invisible. If they were made before the image was formed, perhaps as part of the wrapping process, or before some artificer rendered it, then some evidence of this will still be present. Sadly I am currently in Gibraltar, with a laptop but not my iPad, and cannot check Shroud 2.0 for which of these is actually apparent. Anybody?\n\n","date":"March 21, 2014 at 5:29 pm","url":"https://shroudstory.com/2014/03/21/so-then-why-is-there-an-image/","cat":"news_&_views","id":"comment-91682","author":"Hugh Farey","site":"shroudstory"},{"title":"So then, why is there an image?","post":"Why would flattening them make them invisible? Lost me there. If I have a crease in my denim jeans and then flatten it out I may still see a crease line – it depends if the crease affected the colour uniformity.\n\n","date":"March 21, 2014 at 10:01 pm","url":"https://shroudstory.com/2014/03/21/so-then-why-is-there-an-image/","cat":"news_&_views","id":"comment-91740","author":"David Goulet","site":"shroudstory"},{"title":"So then, why is there an image?","post":"It’s true that a crease in an oil painting, say, can seriously affect the painting and still be very visible even if flattened out again completely. Creases in cothes, however, can usually be ironed out invisibly. It would be interesting to compare creases on the shroud through blood stsains with those through ‘ordinary’ image.\n\n","date":"March 22, 2014 at 2:45 am","url":"https://shroudstory.com/2014/03/21/so-then-why-is-there-an-image/","cat":"news_&_views","id":"comment-91820","author":"Hugh Farey","site":"shroudstory"},{"title":"So then, why is there an image?","post":"I’m busy right now, Hugh,  composing my third missive on the subject of creases (a vital spy clue I believe as to mechanism of imaging). One has to distinguish between (a) intentional creases, V-shaped in cross-section,  tidy ones that probably pre-dated the image, and were somehow incorporated adventitiously into the image, and (b) unintentional untidy creases, S-shaped (or reverse Z-shaped) in cross-section that arrived with the imaging process via accidental linen entrapment. The two types of crease, when modelled in my makeshift laboratory, aka kitchen, behave differently under secondary contact scorching as my snapshots will reveal. TH please note.\nJust thought I’d clear the ground, so to speak, re nomenclature. As ever, the devil is in the detail.\n\n","date":"March 22, 2014 at 3:16 am","url":"https://shroudstory.com/2014/03/21/so-then-why-is-there-an-image/","cat":"news_&_views","id":"comment-91826","author":"colinsberry","site":"shroudstory"},{"title":"So then, why is there an image?","post":"\nThibault HEIMBURGER :\nWarning (again): the Enrie and Durante photographs are sometimes misleading.\nMrs Flury-Lemberg published in “Sindone 2002″ (p.45) an extraordinary photograph of the TS man face (oblique light).\nThe crease at the base of the chin (“V-shape groove”) is similar to many other creases found in other parts of the image areas. Particularly it is similar to the vertical imprint of the ” V-shaped center fold”\nAll these creases have nothing to do with the image formation process. They are related to the folding of the TS.\n\nMy case is based on the fine structure of the photographic evidence, backed up with ‘kitchen-lab’ experimentation. It will take more than Thibault’s “warning” to deter me from publishing my evidence.\n\n","date":"March 21, 2014 at 5:55 pm","url":"https://shroudstory.com/2014/03/21/so-then-why-is-there-an-image/","cat":"news_&_views","id":"comment-91690","author":"colinsberry","site":"shroudstory"},{"title":"So then, why is there an image?","post":"The fact is CB’s sight-&-brain coordinating system can be easily misled by the Enrie and Durante photographs not to mention that of the Lirey badge…\n\n","date":"March 22, 2014 at 4:41 am","url":"https://shroudstory.com/2014/03/21/so-then-why-is-there-an-image/","cat":"news_&_views","id":"comment-91847","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"So then, why is there an image?","post":"…or even his.\n\n","date":"March 22, 2014 at 4:48 am","url":"https://shroudstory.com/2014/03/21/so-then-why-is-there-an-image/","cat":"news_&_views","id":"comment-91849","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"So then, why is there an image?","post":"CB: “I’m busy right now, Hugh, composing my third missive on the subject of creases (a vital spy clue I believe as to mechanism of imaging). One has to distinguish between (a) intentional creases, V-shaped in cross-section, tidy ones that probably pre-dated the image, and were somehow incorporated adventitiously into the image, and (b) unintentional untidy creases, S-shaped (or reverse Z-shaped) in cross-section that arrived with the imaging process via accidental linen entrapment. The two types of crease, when modelled in my makeshift laboratory, aka kitchen, behave differently under secondary contact scorching as my snapshots will reveal. TH please note.\nJust thought I’d clear the ground, so to speak, re nomenclature. As ever, the devil is in the detail.”\nI note and I am waiting for your missive.\nHowever, I already disagree with what you wrote above.\nFirst question: how can you distinguish V-shaped  from S-shaped creases with the pictures you have ?\nPS: Dan, how is it possible to include a photograph in a comment ?\n\n","date":"March 22, 2014 at 4:13 pm","url":"https://shroudstory.com/2014/03/21/so-then-why-is-there-an-image/","cat":"news_&_views","id":"comment-92013","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"So then, why is there an image?","post":"TH: I’ve done the experiments with three types of modelled crease (Type 1A and 1B) which are V-shaped concave furrow and inverted-V convex ridge respectively, and Type 2, which is a S-shaped entrapment. of an invaginated fold of linen. By “done” I mean applied a hot template to each to get imprints that can all be matched up (approximately) with what one sees on the TS in different locations. (Type 1A and 1B are your longitudinal mid-line locations, frontal v dorsal respectively). Yes, there seems to have been a reversal of fold sense, frontal v dorsal, due to the linen having been folded first across its centre short axis before being folded along the vertical midline PRIOR to the imprinting event, resulting in different configurations of  subsequent ‘baked-in’ creases.\nIt’s not an easy posting to write and illustrate, but I hope to get something up in the next 24 hours or so.\n\n","date":"March 22, 2014 at 4:35 pm","url":"https://shroudstory.com/2014/03/21/so-then-why-is-there-an-image/","cat":"news_&_views","id":"comment-92019","author":"colinsberry","site":"shroudstory"},{"title":"So then, why is there an image?","post":"there is no image on the shroud and there was not one until it was photographed. No person would have made the shroud in the 13 th. century and expected it to be accepted as from the death of Christ. It would be like Leonardo painting the Mona Lisa in the same manner and presenting it and expecting payment from whomever commissioned it. To me this shows that the shroud had a continuous verifiable history from the time of Christ that was accepted by everyone who had possession of it starting from the beginning. Just my opinion.\n\n","date":"March 22, 2014 at 5:32 pm","url":"https://shroudstory.com/2014/03/21/so-then-why-is-there-an-image/","cat":"news_&_views","id":"comment-92029","author":"paul","site":"shroudstory"},{"title":"So then, why is there an image?","post":"Er… no. “There is no image on the shroud” and “there was not one until it was photographed” are directly contradictory statements. The image on the shroud before that is attested to by countless engravings and paintings from the 15th century onwards.\n“No person would have made the shroud in the 13th century and expected it to be accepted as from the death of Christ.” Really? How do you know? Although the 13th century is indeed towards the end of the heyday of the fake relic, the industry was massive, and many of the products are considerably less convincing than the Shroud.\n“To me this shows that the shroud had a continuous verifiable history.” No, again. Even if the manufacture of the Shroud in the 13th century were vastly improbably, that does not of itself verify its previous history.\n“Just my opinion.” Well, everybody is entitled to that, even if it involves the simultaneous belief in two logically contradictory views, so my best wishes to you.\n\n","date":"March 22, 2014 at 7:00 pm","url":"https://shroudstory.com/2014/03/21/so-then-why-is-there-an-image/","cat":"news_&_views","id":"comment-92062","author":"Hugh Farey","site":"shroudstory"},{"title":"So then, why is there an image?","post":"well to be specific and blunt it is a crappy image of a human being in its natural state . all the images that were on engravings and paintings look nothing like the shroud only their unreal idea of the shroud. it is like at a  blue print, and a very bad one, and saying its a finished picture of a building.\n\n","date":"March 22, 2014 at 9:48 pm","url":"https://shroudstory.com/2014/03/21/so-then-why-is-there-an-image/","cat":"news_&_views","id":"comment-92106","author":"paul","site":"shroudstory"},{"title":"So then, why is there an image?","post":"I have been avoiding this discussion because of my work on my project. However, Hugh seems to be suggesting that creases may have been “ironed” out. Oy Veh! Not even Mechtilde would have done  something so dense.  Maybe they sent it out to a local laundry. Or perhaps a fancy “French Cleaners” for dry cleaning, Do they have French Cleaners in Turin?\nThe concept that anyone with custody of the Shroud would have taken an iron to it to remove creases beggars the imagination. And Colin Berry is doing more kitchen science experiments to prove something?? Really??\nI have to leave right now. Trying to shape up my narration of the “first” but not “original sin”. Anybody want to guess what it is?\n\n","date":"March 22, 2014 at 5:35 pm","url":"https://shroudstory.com/2014/03/21/so-then-why-is-there-an-image/","cat":"news_&_views","id":"comment-92030","author":"Johyn Klotz","site":"shroudstory"},{"title":"So then, why is there an image?","post":"First sin? Cain envying Abel\n\n","date":"March 22, 2014 at 8:11 pm","url":"https://shroudstory.com/2014/03/21/so-then-why-is-there-an-image/","cat":"news_&_views","id":"comment-92081","author":"Mike M","site":"shroudstory"},{"title":"So then, why is there an image?","post":"You betcha\n\n","date":"March 22, 2014 at 8:39 pm","url":"https://shroudstory.com/2014/03/21/so-then-why-is-there-an-image/","cat":"news_&_views","id":"comment-92090","author":"Johyn Klotz","site":"shroudstory"},{"title":"So then, why is there an image?","post":"No, Hugh does not seem to be suggesting anything of the kind, as a more-than-cursory reading of this conversation would have made obvious. As I understand it, the restoration of the Shroud in 2002, although not necessarily actually involving an iron, did flatten it out considerably, to the extent of increasing its length by 10cm or so. Anyone who wants to compare a ‘crease-before-the-image with a crease-after-the-image would do well to look at the creases bracketing the top and bottom of the face on the Shroud on shroudScope. On the “Enrie negative” page they are both very prominent, although the lower one is both brighter and has a faint ‘twin’ image just below. On the “Durante 2002” page, the top crease has all but vanished, while the lower one has widened considerably and resolved itself into two distinct lines (the upper darker than the lower) with a channel between them which is paler than the cloth above and below the crease marks. It is likely that the appearance of the upper crease in the Enrie photo is merely an artifact of the direction of the light and shadow, which is almost negated by the new flatness of the Shroud, while the colours of the lower crease are genuine linear discolourations of the cloth (no doubt enhanced by the light and shadow in the Enrie photo, but not removed by smoothing out the crease).\nJohyn (a typo or some atavistic ethnicity emerging?) is in good company in thinking that flattening the Shroud ‘beggars belief.’ John Jackson and several other students of the cloth were furious that the evidence of the creases was well-nigh destroyed as part of the new configuration of the Shroud.\n\n","date":"March 22, 2014 at 6:47 pm","url":"https://shroudstory.com/2014/03/21/so-then-why-is-there-an-image/","cat":"news_&_views","id":"comment-92057","author":"Hugh Farey","site":"shroudstory"},{"title":"So then, why is there an image?","post":"I thought I would check on Barrie’s site, Hugh’s comment “although not necessarily involving an iron”.\nhttp://www.shroud.com/restored.htm\nprovides several experts’ comments on the 2002 ‘restoration’, nearly all extremely depressing.  What was done to the Shroud in 2002 by a small ill-informed group, with no consultation, absolutely beggars belief. Barrie correctly makes the comment that’s it done, and there’s no now turning the clock back. There are stages in grief, and I guess eventual acceptance is supposed to be the final resolution. But I’m not ready for that yet, even having known most of the details over the past year.  It is well over time that the so-called guardians were served a set of obligatory protocols and compelled to observe them. It is not the property of the diocese of Turin to do with as they think fit!\n\n","date":"March 23, 2014 at 6:27 am","url":"https://shroudstory.com/2014/03/21/so-then-why-is-there-an-image/","cat":"news_&_views","id":"comment-92240","author":"daveb of wellington nz","site":"shroudstory"},{"title":"So then, why is there an image?","post":"No doubt the Turin Shroud controversy will never settle.  However any artist capable of doing this would have loved an acknowlegment. Also despite the level of scientific advancement today. it will take many generations before something close to a feat like this could be achieved. Whatever view anyone holds today will remain personal.\n\n","date":"March 23, 2014 at 9:33 am","url":"https://shroudstory.com/2014/03/21/so-then-why-is-there-an-image/","cat":"news_&_views","id":"comment-92270","author":"Leye","site":"shroudstory"},{"title":"So then, why is there an image?","post":"Daveb,\nDave,\nI agree with the priest quoted by Rev. “Kim” Dreisbach in the 2007 presentation read after his death at the Shroud conference in Perugia, Italy. http://www.shroud.com/pdfs/dreisbach4.pdf\nHe quotes a Catholic priest on page 10 of the PDF:\n“Fr. Anthony Delessi of the Monastery of the Holy Spirit in Conyers, Georgia has so\nwisely observed: “We Roman Catholics have been its custodians for the last eight\nhundred years after stealing it from the Greeks (i.e. Orthodox) who performed that\nfunction for the first twelve centuries. But in truth, it belongs to no one denomination –\nmaybe not even to Christianity. Rather, it is in actuality ‘God’s love letter in linen to all\nmankind.” \nThe Shroud does not belong to the Church, it holds it in trust for all humanity. I hope that the Pope Francis agrees.\n\n","date":"March 23, 2014 at 10:14 am","url":"https://shroudstory.com/2014/03/21/so-then-why-is-there-an-image/","cat":"news_&_views","id":"comment-92284","author":"John Klotz","site":"shroudstory"}]
