[{"title":"The Making of the HD Image for the Shroud 2.0 App","post":"Analyzing 72 Gigabytes is not an easy task. Most probably, a supercomputer would be needed with parallelization strategies for calculation purposes.  This means, that commercial softwares would not work and specific developments in purpose- oriented software would be needed. I think that few previous examples (or none at all) of a similar research are recorded so in my view, a whole research plan should be designed from the scratch.\n I understand that topography-like info has been used to store the images so applying state-of-the-art and already fully validated techniques are likely to yield an enormous amount of useful results, regarding image formation mechanisms, letters, coins and so on.\nThey do not mention whether they have images only in the visible spectrum but if UV and IR images had also been taken, a very promising material would be available.\nAddressing such a research would definetively require a serious planning and implementation by a group of scientists and the outcomes would represent an important step forward in Shroud research.\nI will also say that I was not aware of the amount of gigabytes of these images and now I understand that releasing the images for free research is not an easy task and should be done in the frame of a serious research plan.\n\n","date":"April 14, 2013 at 8:58 am","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","id":"comment-30748","author":"Gabriel","site":"shroudstory"},{"title":"The Making of the HD Image for the Shroud 2.0 App","post":"Can anyone tell me how a “few hundredths of a millimeter” relates to  something “13-μm diameter thick” I have read that is the diameter of a linen fiber.\n\n","date":"April 14, 2013 at 9:25 am","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","id":"comment-30750","author":"John Klotz","site":"shroudstory"},{"title":"The Making of the HD Image for the Shroud 2.0 App","post":"http://en.wikipedia.org/wiki/Micrometre\nmicron, or a micrometer is 1×10-6 where a millimeter is 1×10-3\n\n","date":"April 14, 2013 at 9:34 am","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","id":"comment-30752","author":"jesterof","site":"shroudstory"},{"title":"The Making of the HD Image for the Shroud 2.0 App","post":"micron is one-thousandth of a millimeter, 0.001 mm, so 13 microns are in the few hundredths of a millimeter\n\n","date":"April 14, 2013 at 9:36 am","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","id":"comment-30753","author":"jesterof","site":"shroudstory"},{"title":"The Making of the HD Image for the Shroud 2.0 App","post":"0.013 mm to be precise\n\n","date":"April 14, 2013 at 9:37 am","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","id":"comment-30755","author":"jesterof","site":"shroudstory"},{"title":"The Making of the HD Image for the Shroud 2.0 App","post":"Dear all,\nThanks for your response. The reason for the question was just how far into the Shroud you could go with the new App. Does a “few hundred’s of a millimeter cover .013mm. I wo9uld guess not quite.\nI feel like Heller trying to figure out how to measure particles for blood that are too small for analysis. Of course first I have to get an I-Pad or I-Phone which I do not anticipate doing.\n\n","date":"April 14, 2013 at 11:44 am","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","id":"comment-30765","author":"John Klotz","site":"shroudstory"},{"title":"The Making of the HD Image for the Shroud 2.0 App","post":"The Shroud 2.0 app (available on iOS devices) from Haltadefinizione (the paid version with the highest definition images offered) does NOT provide the high definition of the 2008 scan. \n1) The 2008 Haltadefinizione scan is 12 billion pixels over 1100×4300 mm (~ size of Shroud), which is about 2500 pixels per mm square, that is 50 pixels by 50 pixels covering 1 square millimeter.  This is 0.02 mm (20 micrometer, that is, 20µm) per pixel. That is, one pixel on that scanned image covers 20 µm, vertically and horizontally.  \nNote that one such pixel is not enough to recognize particles of 20 µm in size. (A linen fibril varies from 10 µm to 50 µm in diameter). You need at least several if not over 10 such pixels to be able to identify something of size 20 µm, but that varies depending on the object to identify.\nIn the US, a more familiar unit is the inch: the scanned image is about 1200 dpi (dots per inch).\n2) The Shroud 2.0 app image resolution does not offer that high resolution of 20 µm per pixel, it offers a lower one. The app highest resolution offers an image of about 13300 pixels wide over the width of the Shroud. This is about 12 pixels per mm. This is about 4 times less resolution that the scanned image of 2008. \nThat is, Haltadefinizione could offer images of the Shroud with at least 4 times more resolution than the Shroud 2.0 app is offering at the highest resolution.  \n3) Having said that, the Shroud 2.0 app offers a very high definition image of the Shroud and an app of very good quality.\n\n","date":"April 14, 2013 at 5:53 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","id":"comment-30807","author":"Mario Latendresse","site":"shroudstory"},{"title":"The Making of the HD Image for the Shroud 2.0 App","post":"\nJohn Klotz :\nDear all,\nDoes a “few hundred’s of a millimeter cover .013mm. I \nwo9uld guess not quite.\n\nyou are wrong – this is a precise description. If you round up 0.013 to 0.01 it will actually be one hundredth. not few, but if you extend and round it up to 0.02, it will be 2 hundredths of a millimeter\n\n","date":"April 14, 2013 at 3:26 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","id":"comment-30791","author":"jesterof","site":"shroudstory"},{"title":"The Making of the HD Image for the Shroud 2.0 App","post":"\nMario Latendresse :\n2) The Shroud 2.0 app image resolution does not offer that high resolution of 20 µm per pixel, it offers a lower one. The app highest resolution offers an image of about 13300 pixels wide over the width of the Shroud. This is about 12 pixels per mm. This is about 4 times less resolution that the scanned image of 2008.\nThat is, Haltadefinizione could offer images of the Shroud with at least 4 times more resolution than the Shroud 2.0 app is offering at the highest resolution.\n3) Having said that, the Shroud 2.0 app offers a very high definition image of the Shroud and an app of very good quality.\n\nBut could it be enough to identify (after digital processing to remove noise, weave and improve contrast) letters found by Marion in the 90s (about 1 cm high), and coin images claimed by Filas and others (circa 1 mm in size)?\n\n","date":"April 15, 2013 at 5:22 am","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","id":"comment-30850","author":"O.K.","site":"shroudstory"},{"title":"The Making of the HD Image for the Shroud 2.0 App","post":"In my view, trying to replicate Marion’s work, published in a serious peer-review journal could be one of the first objectives in the frame of a major research plan. In the case of Filas’s coins or Dannin’ s flowers, the methodology would be the same.\nBut as I mentioned before, currently the major limitation to start a serious study is that most probably, a supercomputer would be needed.\n\n","date":"April 15, 2013 at 9:03 am","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","id":"comment-30866","author":"Gabriel","site":"shroudstory"},{"title":"The Making of the HD Image for the Shroud 2.0 App","post":"\nGabriel :\nBut as I mentioned before, currently the major limitation to start a serious study is that most probably, a supercomputer would be needed.\n\nWhy? Do you know how “primitive” was Marion equippment compared with what we have today? In his 1997 book he complains 16-bit 1024×1024 pixels is too much for 1.44 MB floppy… Compare it with today’s possibilities. Many advanced processing of tens, or hundred images (for example astronomical images from CCD plates) are performed on normal, commercially available PC computers. I don’t see any problems here.The only problem is quality and availability of images, and finding a proffesional guy to do the job, and present it in peer-review. And good will of scientific community not to ignore his results due to bias and misconceptions.\nPlease try to search ‘Marion’ in shroud.com browser. You will find very little, criticism of his findings by Guscin, for whom the inscriptions make no sense (but he isn’t image proccessing expert, so his opinion is not valid), and a few sceptical comments by Barrie Schwortz (which cannot be considered as serious refutation of Marion’s results). nothing more. Not even obituary or in memorian for Marion, who died in 2009!\n\n","date":"April 15, 2013 at 12:59 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","id":"comment-30883","author":"O.K.","site":"shroudstory"},{"title":"The Making of the HD Image for the Shroud 2.0 App","post":"Well, as I have frequently commented here, actually I think that Marion’s work was serious. To the best of my knowledge, I think he was the first one to use Principal Component Analysis to deal with the fact that most the images he worked with, were taken in the analogic era. Very clever approach since with the first PC he was able to capture the most relevant information common to the all the images he worked with, including UV.\nHowever, now a strategy aiming at elucidating whether letters are present or not, involves using this supersize image and an intensive search of patterns which I am afraid it can only be addressed properly if a supercomputer is available\n\n","date":"April 15, 2013 at 1:30 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","id":"comment-30888","author":"Gabriel","site":"shroudstory"},{"title":"The Making of the HD Image for the Shroud 2.0 App","post":"Why? We know what to look for. Just process the new images (with many different algorithms preferably), as well as the old 1931 Enrie, 1978 Miller, perhaps even 1898 Pia for additional control, and check whether allegedly seen letters (coins and flowers as well) are in the places where they were claimed to be.\n\n","date":"April 15, 2013 at 3:19 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","id":"comment-30903","author":"O.K.","site":"shroudstory"},{"title":"The Making of the HD Image for the Shroud 2.0 App","post":"BTW: link to the abstract of Marion article: http://opticalengineering.spiedigitallibrary.org/article.aspx?articleid=1075454\n\n","date":"April 15, 2013 at 3:20 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","id":"comment-30904","author":"O.K.","site":"shroudstory"},{"title":"The Making of the HD Image for the Shroud 2.0 App","post":"If letters would really be on the Shroud, that would mean there would be some ink residues or another substances there that make them visible.  This is not imagery techniques that could determine if there is something or not in these spots, it is a proper chemical analysis of some tiny samples of fibers taken in these areas (which could be, of course, backed-up by a proper imagery analysis but only as a confirmation tool for the first set of analysis).  That’s what I think and, personally, I have great doubts about the presence of such letters on the cloth.  But that’s just my feeling of course.\n\n","date":"April 15, 2013 at 3:34 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","id":"comment-30905","author":"Yannick Clément","site":"shroudstory"},{"title":"The Making of the HD Image for the Shroud 2.0 App","post":"\nYannick Clément :\nIf letters would really be on the Shroud, that would mean there would be some ink residues or another substances there that make them visible.  \nActually, Barabra Frale in her book “Shroud of Jesus of Nazareth” makes a hypothesis that those letters are indeed imprinted by ink residues. She speculates (quite reasonably for me, but I don’t claim she must be right) that those letters were some form of ID card for a corpse, written on reused fragments of papyri, and reflected on the Shroud. Being so faint, currently they are observable only on close-ups of negative image.\n\nYannick Clément :\nThis is not imagery techniques that could determine if there is something or not in these spots, it is a proper chemical analysis of some tiny samples of fibers taken in these areas (which could be, of course, backed-up by a proper imagery analysis but only as a confirmation tool for the first set of analysis).\n\nActually imagery techniques (that means photografy) had determined that the corpse of crucified man was wrapped in the Shroud. From 1898 to 1973 there was no access to the Shroud, no samples, no chemical analysis. Just the pictures to analyse. To determine whether or not there are letters, we don’t need chemical analysis. Just clear images to identify the letters without subjective interpretation and argues whether one sees the things or not. Determining their nature (how they were formed) is the other thing, of course.\n\nYannick Clément :\nThat’s what I think and, personally, I have great doubts about the presence of such letters on the cloth.  But that’s just my feeling of course.\n\nSo let’s dispel the doubts. Give us definite answer: are they there or not.\nI think it is probable. The letters are too big (circa 1 cm high) and, in some cases (PEZo, and SB) too clear to be just artifacts or optical illusion.\n\n","date":"April 15, 2013 at 4:10 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","id":"comment-30906","author":"O.K.","site":"shroudstory"},{"title":"The Making of the HD Image for the Shroud 2.0 App","post":"André Marion’s paper “Discovery of inscriptions on the Shroud of Turin by digital image processing” (1998) can be obtained from deepdyve for a fee:\nhttp://www.deepdyve.com/lp/spie/discovery-of-inscriptions-on-the-shroud-of-turin-by-digital-image-wU0fS990mw\nThe first page is free for viewing and a monthly subscription will allow you to read the entire paper. Actually, if you take the free 14-day trial, you can read that paper and many others for free.\n\n","date":"April 15, 2013 at 11:07 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","id":"comment-30923","author":"latendre","site":"shroudstory"},{"title":"The Making of the HD Image for the Shroud 2.0 App","post":"There is no need for any “ink” or “substances” to be left on the Shroud for these (letter) inscriptions to exist. Inscriptions can be formed by \n1) Removing coloration of the surrounding environment similar to scrapping paint off a wall. For the Shroud, it can be discoloration of some regions.\n2) Deforming a surface such as writing in the sand with your finger. For the Shroud, it can be deformation of the linen fibrils.\nAnd the inscriptions found by André Marion appears to have no substances left on the Shroud.\nThe presence of detected inscriptions does not mean it proves an intentional writing on the Shroud. I think this is the main issue: searching thoroughly over the entire surface of the Shroud, with a systematic objective image analysis technique, many hard to discern inscriptions could be detected. These writings have to have a very low probability to exist to be considered intentional. As far as I know, this search has never be done. See also the paper by Lazzaro, Murra and Schwortz at http://www.sciencedirect.com/science/article/pii/S0031320312005377.\n\n","date":"April 15, 2013 at 11:45 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","id":"comment-30924","author":"latendre","site":"shroudstory"},{"title":"The Making of the HD Image for the Shroud 2.0 App","post":"It seems strange that although Marion noticed a small NN immediately below the face, and a large ESOU a little below that, he completely missed the three Hebrew letters between them, spotted by Thierry Castex. I’m afraid I’m not convinced by either of them, and note that Marion spends more time on interpreting the letters he thinks he sees than explaining how he sees them in the first place, which I find curious for a digital analyst. His methodology, in a scientific journal specifically devoted to optical engineering, is extremely sketchy. It is not clear why he chose that particular part of the shroud to analyse, unless he had already decided that the dark U-shapes he selected were likely to carry inscriptions. He does not say whether he examined any other part of the shroud, or whether there were any parts of what he did examine that yielded no result. In my own, albeit limited experience, people who are buried with objects tedn to have them placed on their chests, not as a “support used to wedge up the head,” whatever that means. Marion does not say that he even considered this a possible place to look at.\n\n","date":"April 16, 2013 at 6:30 am","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","id":"comment-30946","author":"Hugh Farey","site":"shroudstory"},{"title":"The Making of the HD Image for the Shroud 2.0 App","post":"And I’m pretty sure Marion did not detect also the Hebrew inscription supposedly found by the holographic work of Petrus Soons under the chin that would mean “sheep”.\nTo me, all these imagery analyses represents very good examples of the “I think I see” syndrom.  It’s not because some forms on some images of the Shroud looks like letters that they are really letters.  Only direct testing of the areas where these supposed letters are supposed to be present could shed some lights about that.  If there is some residues of some substances (like ink for example) or some unusual discoloration or abrasion of the fibers in these areas, direct testings (chemical and microscopic) could detect these “anomalies” for sure and find out their real nature. Then, scientists could start building serious hypotheses to explain their presence there.  I seriously doubt we could achieve that with only imagery analyses.\n\n","date":"April 16, 2013 at 10:50 am","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","id":"comment-30966","author":"Yannick Clément","site":"shroudstory"},{"title":"The Making of the HD Image for the Shroud 2.0 App","post":"To answer to all your doubts and concerns:\n1. Marion writes in his book (co-authored with Courage), that they had only images of the front face of the Man of the Shroud.\n2. They were asked to verify previous claims of Marastoni, Ugolotti and others, about inscriptions around the face.\n3. They used certain criteria to eliminate pareidolia effects. For example, the letters must have been at least 1 cm large (which eliminated alleged Hebrew letters, and coin inscriptions, which are smaller), they must be present in groups of at least two, similar size, similar intervals between them, positioned in straight lines, and so on. So the probability that they are photographic artifacts, wevae imperfections or similar effects is small.\n4. Marion and Courage devoted more than 20 pages for descriptions of technicalities and their methods of numerical processing. In the article, adressed to his colleagues , Marion didn’t have to explain in detail his methods, just the results.\n5. Barbara Frale claims that the inscriptions were written on strips of papyri, sticked to the head with primitive glue, made from flour and water \nWhat I would like is if someone tries to reproduce Marion’s results, using much better computer devices and software, and utilizing Haltadefinizione images. To confirm, or disprove previous claims. To show whether there are those letters and/or coins, flowers etc. (so everyone can “see” them, just like they see the body image, and not just “think they see”) , or to prove that they are just pareidollia. That’s all. It doesn’t need chemical analysis to do so. One doesn’t have to wait 20, or 50 years, until they allow to re-examin the Shroud to check whether there is an ink or not, in the places where purported letters are expected to be. I think some don’t see the wood for trees.\nBTW: I’m from Poland and I have both Marion-Courage, and Barbara Frale’s books edited in Polish. Have they ever been edited in English? Did anyone had opporunity to read them?\n\n","date":"April 16, 2013 at 5:30 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","id":"comment-30993","author":"O.K.","site":"shroudstory"},{"title":"The Making of the HD Image for the Shroud 2.0 App","post":"Hugh, I don`t agree at all that Marion`s methodology is sketchy.\nA quick consultation, indicates that in the field of Optics in 1998 there were 47 journals and Optical Engineering was in position #24. This means quite a good position in the ranking  and you can bet that the paper by Marion went through a strict filter and was only published because the methodology followed was -at that time- a standard one, widely used and accepted by the rest of the scientific community in the fields of optics and image analysis.\nIn this paper, I see a serious attempt to overcome the difficulty of the gap between analogic/digital material while using a mathematical tool like Principal Component Analysis (PCA).\n“Many photographs of the face were digitized: a reproduction on film of the Enrie photograph (I931) and several others (negatives, slides, and paper prints) made by Vernon Miller in 1978 under various lighting conditions and in different wavelength bands (red, green, blue, IR).”\nAfter digitizing, he used PCA as a way to combine and extract the meaningful information from different wavelengths and sources. The outcome is a set of inscriptions obtained in an area around the face.\n“Before interpreting the graphical signs that the digital processing highlights, let us note that these signs are much larger (1.5 to 3 cm) than the fibers of the cloth (about 0.7 mm wide). This size is evidence of the fact that the letters are not artefacts due to the weaving of the cloth.”\nAs an expert, he was well aware of the things that usually happens with images\n“But the digitizing and processing techniques can create their own artefacts, especially aliasing effects. Precautions must be taken to minimize such effects in digitizing and processing periodic structures. such as a cloth. Note also a subjective artefact, called the Rorschach effect, which, for instance, makes shapes appear in randomly located stains on a paper. This effect is dangerous in interpreting inscriptions.”\nTo avoid this:\n“To avoid false interpretations, we used criteria for deciding whether the signs that we see can correspond to real writings:\nl. The signs are not isolated but they form groups.\n2. Their gray values are similar.\n3. They have approximatively the same size, thickness, slope, and fashion.\n4. They are correctIy aligned and periodically spaced.\n5. They have a significance because they form a word or a piece of word in a known language.\nIf these five conditions are simultaneously verified, the probability of an artefact becomes very small. “\nA final check:\n“To eliminate this possibility completely we made a final check: if we apply the same processing to a neighboring similar region and if this operation does not cause any graphical signs to appear, we finally decide that the group of signs must correspond to writings.”\nTwo additional results from Marion’s paper:\nAgainst having been painted\n“It is an isotropic image. The Fourier transform of the image shows no preferential frequencies, proving that no preferential direction exists in the image itself. Consequently, it is difficult to imagine that this image could have been made directly by a human hand.”\nThe letters are originated the same as the rest of the image\n“Although the physical nature of the letters is not known, curiously their fine structure in the photos is the same as that of the body image: the letters are also formed by the variations of the size and the intensity of the rods. This characteristic is difficult to explain, but it shows that the useful information required to decipher the inscriptions is entirely contained in the image pattern. This observation is fundamental to understanding the image processing method.”\n\n","date":"April 17, 2013 at 12:33 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","id":"comment-31082","author":"Gabriel","site":"shroudstory"},{"title":"The Making of the HD Image for the Shroud 2.0 App","post":"It does not look like we are reading the same paper. \n1) You wrote “His methodology, in a scientific journal specifically devoted to optical engineering, is extremely sketchy”. \nAndré Marion described in details the technique he used to reconstruct the images he shows in his paper. What is sketchy about it?\n2) You wrote “It is not clear why he chose that particular part of the shroud to analyse, unless he had already decided that the dark U-shapes he selected were likely to carry inscriptions.”\nIn Section 3, he referenced the work of Marastoni and Coero-Borga on inscriptions previously found on which he is focusing his work. \n3) You wrote “He does not say whether he examined any other part of the shroud, or whether there were any parts of what he did examine that yielded no result.”\nHe does write that he analyzed the surrounding of the inscriptions for other inscriptions and failed to find any other presented in his paper.\n\n","date":"April 17, 2013 at 1:13 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","id":"comment-31085","author":"latendre","site":"shroudstory"},{"title":"The Making of the HD Image for the Shroud 2.0 App","post":"The fact that you can obtain the coin’s image on both, Enrie’s and Vern Miller photos, tells me more about the  tensile strength and the elasticity of the linen characteristics than how the image was manipulated to create the coin’s relief.\nMario what is your opinion about the validity of the coin’s existence on the Shroud?\n\n","date":"April 16, 2013 at 3:34 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","id":"comment-30983","author":"Giorgio","site":"shroudstory"},{"title":"The Making of the HD Image for the Shroud 2.0 App","post":"The imagine analysis of determining the presence of faint images such as the coin on the eye, the lettering, flowers, and more, lacks a sound foundation. Essentially, this is what I wrote at #18: “The presence of detected inscriptions does not mean it proves an intentional writing on the Shroud. I think this is the main issue: searching thoroughly over the entire surface of the Shroud, with a systematic objective image analysis technique, many hard to discern inscriptions could be detected. These writings have to have a very low probability to exist to be considered intentional.”\nIf one look at the references of André Marion’s paper, one can readily see that no such study has been referenced. As far as I know, it has never been done even on some other images. André Marion was very careful about this aspect of low probability of any inscription found, but it was not done in a systematic manner. He wrote that he searched around the inscription to try detecting similar inscriptions. But that is not enough since it depends on his visual acuity, which is not systematic and reproducible.\n\n","date":"April 17, 2013 at 11:52 am","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","id":"comment-31078","author":"Mario Latendresse","site":"shroudstory"},{"title":"The Making of the HD Image for the Shroud 2.0 App","post":"3. They used certain criteria to eliminate pareidolia effects. For example, the letters must have been at least 1 cm large (which eliminated alleged Hebrew letters, and coin inscriptions, which are smaller), they must be present in groups of at least two, similar size, similar intervals between them, positioned in straight lines, and so on. So the probability that they are photographic artifacts, wevae imperfections or similar effects is small.\nWould we all agree that the pareidolia  theory shouldn’t be applied to Father Filas’ method since the coin’s relief wasn’t visible until he created several generations of the first generation print of the 1931 Enrie print?  Without the new generation of prints reducing the resolving power each time, we wouldn’t have a relief in the first place.\n\n","date":"April 16, 2013 at 11:02 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","id":"comment-31016","author":"Giorgio","site":"shroudstory"},{"title":"The Making of the HD Image for the Shroud 2.0 App","post":"I do not think you can eliminate pareidolia from any faint images you might found. Pareidolia is a high level phenomena that is related to intentionality and real objects. That is, we call it a pareidolia if the image perceived was not intentionally created by its author or by a real object that existed. Obviously, if you see an elephant in a cloud, that cannot be an elephant and it cannot be an elephant that left its mark in the cloud. But if you see some inscriptions on the Shroud, how do we determine that it was intentional or related to a real object? You cannot eliminate these faint images as pareidolia unless you have the author of these images telling you so. The face on Mars, what was its probability to occur over a sample of images? I do not think it was close to zero, say, below 10^-6. For example, DNA matching, it has to be very close to zero, such as 10^-20, to be considered non accidental. There is a clear model to evaluate these probabilities (it has a simple model that works very well). This is what the probability has to be to be considered a non accidental image: pretty close to zero. You need a model to come to such an evaluation. We have no such model and it does not look simple to create such a model. And in the case of the coin: pareidolia may still be present since there is an interpretation by a human reconstructing the image. The fact that Father Filas looked deeper at copies of images does not matter: he was doing an interpretation looking at the images.\n\n","date":"April 17, 2013 at 12:27 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","id":"comment-31081","author":"latendre","site":"shroudstory"},{"title":"The Making of the HD Image for the Shroud 2.0 App","post":"Yes, your statement is true about interpretation of the relief via pareidolia but if one states that pareidolia is the reason we have to except the possibility of the coin’s existence based on Fr. Filas’ work, that can be very problematic to many.  His whole hypothesis was based on the interpretation of what Jackson, Stevenson, and Eric Jumber’s  paper (Forgot the title) in 1978 detailing the possible existence of an object over the eye. The paper further states the removal of artifacts and noise would be needed to further advance their studies.  So far, so good. However, Father Filas’ reproduction method to expedite the study using an analog approach, can be explained to a degree of almost certainty where he went wrong with his methodology and interpretation.  The reason maybe a hard to sell  to some Sindonolgist but to Eastman Kodak, they have my back on this one.\n\n","date":"April 17, 2013 at 1:24 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","id":"comment-31086","author":"Giorgio","site":"shroudstory"},{"title":"The Making of the HD Image for the Shroud 2.0 App","post":"\nlatendre :\n But if you see some inscriptions on the Shroud, how do we determine that it was intentional or related to a real object? You cannot eliminate these faint images as pareidolia unless you have the author of these images telling you so. The face on Mars, what was its probability to occur over a sample of images? I do not think it was close to zero, say, below 10^-6. For example, DNA matching, it has to be very close to zero, such as 10^-20, to be considered non accidental. There is a clear model to evaluate these probabilities (it has a simple model that works very well). This is what the probability has to be to be considered a non accidental image: pretty close to zero. You need a model to come to such an evaluation. We have no such model and it does not look simple to create such a model.\n\nYes, but even if you have a model, you need some criteria. How low probability that those images are created randomly do you accept? 10^-6, 10^-10? Or lower?\nIt is hard to say how much improbable must be the results, to exclude the possibility of pareidolia. Going into absurd, one may say that the whole body image on the Shroud may be pareidolia. Optical illusion.\nIf one sees the clear structure of letters, say “OF NAZARETH” or “SHROUD”, does he/she have to calculate the probability that the inscription he/she sees has formed in result of random process? And check whether it is below stated significance level? Not everything may be calculated. \nThe main question is: could someone re-verify Marion, Filas and others results using the latest HD images, and modern hardware, software and more advanced methods? To check whether those old claims may be refuted, or are still valid, or even increase the chances of them to be actual objects.\n\n","date":"April 17, 2013 at 2:33 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","id":"comment-31090","author":"O.K.","site":"shroudstory"},{"title":"The Making of the HD Image for the Shroud 2.0 App","post":"O.K. if we use pixels, the exact values of probabilities for a given letter can be assessed mathematically.\nFor example, if the whole image of the Shroud is analyzed in squares of let’s say, 10 cm, depending of the resolution, we have inside a certain number of pixels. Pixel values oscilate between 0 and 255, so at  a initial stage, we can increase contrast inside each square by assigning 0 value to any pixel with initial value below 255/2 and 255 to any above 255/2.\nImagine that in that square of suppose 100 pixels, we have ten black pixels aligned resembling an “I”.\nBy calculating the number of configurations in a square that 90 white pixels and ten black pixels can adopt, you can easily estimate the probability that by pure chance ten black pixel align forming the  “I” that you see. The same for any other letter,  symbol, coin or whatsoever and applying the same for different square sizes. The results obtained would be consistent and could be expressed in terms of probabilities.\nThis can very easily be programmed in C++, FORTRAN or R but it would need parallelization strategies in a supercomputer if a 70Gb image is to be used\n\n","date":"April 17, 2013 at 4:02 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","id":"comment-31095","author":"Gabriel","site":"shroudstory"},{"title":"The Making of the HD Image for the Shroud 2.0 App","post":"This is a minor point. But supercomputers of yesterday are workstations of today. You can now buy a 256GB static ram computer with 12 cores for about $5000. This is not a supercomputer and you can process that image with such a machine. You could also use an uncompressed version of the image.\nIt is unclear to me which stitching technique they use to assemble the 1649 images. Was the hardware used (the robot) giving also the locations of the image so that stitching could be based on these locations (that would require very high mechanical precision), or was it done based on overlapping sections of the images and a software was used to automatically stitch. In the latter case, it appears difficult to do since many sections on the Shroud look very alike. I did stitch together the face from the high definition images of the Shroud 2.0 app, and it is very time consuming to do.\nI did not see any specification of the computer they used. That would be interesting to know.\n\n","date":"April 17, 2013 at 4:25 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","id":"comment-31097","author":"latendre","site":"shroudstory"},{"title":"The Making of the HD Image for the Shroud 2.0 App","post":"Mario, if you got some time, it would interesting to look closely at various bloodstains with the 2.0 app and see if you can detect signs of wrenching in the fibers of each area.  Barbet, while looking at pictures from Enrie, said that there was no visible signs of wrenching everywhere in the bloodstains on the Shroud, which is not normal in the context of an enshrouded corpse with humid blood clots that, most probably, would have had time to dry completely before he was taken out of the cloth.  If this is confirmed that there is not visible signs of wrenching in the bloodstained areas, then I think the only rational explanation for this is to think that the blood clots were still humid at their surface when the body left the Shroud.  Or else, we must extrapolate on supernatural explanations that, by definition, are out of the scientific realm.\nAt least, from the close-up of the E-shaped bloodstain that we can see on this blog (I’m not a hi-teck guy so I don’t have this 2.0 app), I don’t detect any visible signs of wrenching…\n\n","date":"April 17, 2013 at 4:43 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","id":"comment-31099","author":"Yannick Clément","site":"shroudstory"},{"title":"The Making of the HD Image for the Shroud 2.0 App","post":"I see we have moved on quite a lot since Gabriel and latendre replied to my comment, but I cannot let them go unchallenged. Marion used “many” photographs taken in “various lighting conditions and “used PCA” to derive his final results. The filters he used are listed, but whether they were used objectively or specifically to enhance letters which he already assumed were there (having been told what to look for by Marastoni and Coero-Borga), is not clear. There is no indication of where or how any negative results were obtained. The famous three Hebrew letters are bigger than some of his observations (well over 1cm in height), and placed exactly between two of them. It would be interesting to know whether that area was processed. In spite of apparent detail, it would be impossible impartially to replicate his method using this description alone, however well versed one was in using PCA. That is what I call sketchy. If the single set of illustrations leading to PEZw is a good example of a successful process, then I find them unconvincing, and would have liked similar photographs of several of the others for comparison.\nIn order to exclude pareidolia, five criteria are listed for the verification of his inscriptions: “If these five conditions are simultaneously verified, the probability of an artefact becomes very small.” – Remarkably, perhaps, not one of his inscriptions adheres to all five, and all have to be heavily ‘interpreted’ to make any sense of them at all.\nNo doubt Optical Engineering was impressed with the skill with which Marion was able to derive his letters, and perhaps more so by the dexterity with which they were manipulated to reach his conclusions – I’m impressed myself – but in spite of all the science I still find no objective evidence that any of them is actually there at all.\n\n","date":"April 17, 2013 at 7:31 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","id":"comment-31112","author":"Hugh Farey","site":"shroudstory"}]
