[{"title":"\nThe Shroud of Turin: 2.6. The other marks (1): Burns and water stains\n","post":"\n\nThere are various opinions and researches of the shroud of Turin. Some people say that it is the genuine and some that it is the fake and the hoax. The fact is that the shroud of Turin doesn't present Jesus of the Bible. If we can find even one evidence, which disprove the shroud of Turin theory, so the whole story shall be invalidated. We can find a large number of evidence from the Bible, which show that the shroud of Turin cannot be the shroud of the Lord Jesus.http://koti.phnet.fi/petripaavola/shroudofturin.html\n\n","author":"Anonymous","date":"April 7, 2013 at 1:51 PM","url":"http://theshroudofturin.blogspot.com/2013/02/the-shroud-of-jesus-26-other-marks-1.html","site":"moore"},{"title":"\nThe Shroud of Turin: 2.6. The other marks (1): Burns and water stains\n","post":"\n\nAnonymous>There are various opinions and researches of the shroud of Turin.That is a truism, i.e. \"... a claim that is so obvious or self-evident as to be hardly worth mentioning ...\" (\"Truism,\" Wikipedia, 27 February 2013).>Some people say that it is the genuine and some that it is the fake and the hoax. Another truism, except you should have added \"...and some don't say anything about it\" to cover the entire range of possibilities! >The fact is that the shroud of Turin doesn't present Jesus of the Bible. The fact is that you are WRONG on that. As I shall demonstrate when I get to \"3. The Bible and the Shroud\" which should be in the near future.>If we can find even one evidence, which disprove the shroud of Turin theory, so the whole story shall be invalidated. Another truism. OBVIOUSLY if the Shroud of Turin were \"disprove[d]\" then it would have been \"invalidated\"! >We can find a large number of evidence from the Bible, which show that the shroud of Turin cannot be the shroud of the Lord Jesus.Again you are WRONG. There is NOTHING in the Bible which shows that the Shroud of Turin is not the burial sheet of Jesus. Indeed, the image of a naked crucified man on the Shroud of Turin is so CLOSELY COMPLEMENTARY to the Gospel accounts of Jesus' passion, death, burial and resurrection, that the Shroud has been aptly called \"the fifth Gospel\":\"Is this remarkable cloth-with its clearly visible images of a man who was scourged mercilessly, humiliated by a crown of thorns, forced to bear his own cross, and finally crucified and gashed in his side to assure his death, all in accord with the Gospel descriptions of the Holy Passion-is this yellowed cloth the true burial shroud of Jesus Christ? ... If it is authentic, the Holy Shroud is unquestionably the greatest religious relic known to Christianity and one of the most fascinating antiquities known to mankind. If it is authentic, THE SHROUD CAN RIGHTFULLY TAKE ITS PLACE AS `THE FIFTH GOSPEL,' for what it reveals of Jesus and his suffering far exceeds the scant Gospel words of the evangelists. If it is authentic, and if no completely satisfactory natural explanation can account for its unusual physical properties, then the Shroud is indeed the most miraculous of Holy Miracles-an enduring, self-made portrait of the man who would be called Savior by millions of Christians throughout the world. ?\" (Humber, T., \"The Fifth Gospel: The Miracle of the Holy Shroud,\" 1974, pp.11-12. My emphasis).But since comments on the topic of whether or not `the Shroud of Turin presents Jesus of the Bible' is off-topic under this post about \"Burns and water stains\" on the Shroud, it is your last comment under this post.If you want to comment further on this topic then do so when I begin posting on \"3. The Bible and the Shroud\" which, as I said, should be in the near future.Stephen E. Jones-----------------------------------Comments are moderated. Those I consider off-topic, offensive or sub-standard will not appear. I reserve the right to respond to any comment as a separate blog post.\n\n","author":"Stephen E Jones","date":"April 7, 2013 at 5:11 PM","url":"http://theshroudofturin.blogspot.com/2013/02/the-shroud-of-jesus-26-other-marks-1.html","site":"moore"},{"title":"\nThe Shroud of Turin: 2.6. The other marks (1): Burns and water stains\n","post":"\n\nStephen you need to see this a hologram photo has been processed from the back second face of the Shroudhttp://ireport.cnn.com/docs/DOC-954016\n\n","author":"Anonymous","date":"April 10, 2013 at 11:34 PM","url":"http://theshroudofturin.blogspot.com/2013/02/the-shroud-of-jesus-26-other-marks-1.html","site":"moore"},{"title":"\nThe Shroud of Turin: 2.6. The other marks (1): Burns and water stains\n","post":"\n\nAnonymous>Stephen you need to see this a hologram photo has been processed from the back second face of the Shroud>>http://ireport.cnn.com/docs/DOC-954016Thanks. There has been some recent comments about the \"second face\" on the underside (which was the top side) of the Shroud under my post, \"New tests by Prof. Giulio Fanti show the Shroud of Turin could date from the time of Christ.\"As I commented there:\"I have been advised that this `second image' may not be actually there, in a confidential email by a Shroud scientist, therefore I will look into it when I get to that part of my series, probably \"8. Major features of the Shroud's Image.\"\"Although there is a photo of it on one of Dan Porter's pages: `What is the second face and what does it mean?'\".Stephen E. Jones\n\n","author":"Stephen E Jones","date":"April 11, 2013 at 4:57 AM","url":"http://theshroudofturin.blogspot.com/2013/02/the-shroud-of-jesus-26-other-marks-1.html","site":"moore"}]
