[{"title":"Topic of the Day (#7): Vertical Mapping of a Human Form","post":"To me, this is one of the most intriguing properties of the image. If it is true, leaves little room for a diffusion mechanism associated to a chemical reaction (Maillard or other) with amines heavier than air.\nIn this case, only the presence of a thermal gradient between body and cloth in the frame of a laminar flow with very very low Reynolds number, could be an explanation in the frame of a chemical reaction model for the image.\nHowever, beyond a general approach, even so, describing the exact mechanism for the motion and reactions of amines/sweat/vapors from the body to the impurities of the cloth seems to be a very difficult task if the image exhibits this vertical preferential direction beyond any doubt. A lot of research would be needed.\nIn this sense, if the image is truly anisotropic, this certainly challenges the model by Rogers, not in the chemical part of it but yes in the motion of reactants and how they get in contact with each other. For this reason I think that making compatible the vertical direction of the image and a comprehensive model for motion of amines, currently represents a major challenge for the supporters of Rogers approach.\n\n","date":"February 7, 2013 at 7:34 am","url":"https://shroudstory.com/2013/02/07/topic-of-the-day-7-vertical-mapping-of-a-human-form/","cat":"topic_for_today","id":"comment-23676","author":"Gabriel","site":"shroudstory"},{"title":"Topic of the Day (#7): Vertical Mapping of a Human Form","post":"Again the “body” is assumed, and poor old J&J have to jump through hoops to rationalise the image with it. If, on the other hand, the image were a photo, a painting, a hot bas relief scorch or I dare say various other mechanisms, then this particular obstacle simply melts away.\n\n","date":"February 7, 2013 at 8:00 am","url":"https://shroudstory.com/2013/02/07/topic-of-the-day-7-vertical-mapping-of-a-human-form/","cat":"topic_for_today","id":"comment-23678","author":"Hugh Farey","site":"shroudstory"},{"title":"Topic of the Day (#7): Vertical Mapping of a Human Form","post":"1/ Vertical mapping implies borders.\n2/ Image density is constent with shortest path.\n3/ What is the side of a sphere ?\n4/ There are image distorsions.\nVertical mapping has not been properly established.\n\n","date":"February 7, 2013 at 12:57 pm","url":"https://shroudstory.com/2013/02/07/topic-of-the-day-7-vertical-mapping-of-a-human-form/","cat":"topic_for_today","id":"comment-23698","author":"anoxie","site":"shroudstory"},{"title":"Topic of the Day (#7): Vertical Mapping of a Human Form","post":"Well said!  If there were many bags full of a mix of aloes and myrrh in powder placed all around the body and over the head inside the Shroud while the corpse was resting there, then there would be no need to call for a vertical projection of the image from the body. In other words, there are some rational explanation that can account for the fact that there is no image of the sides of the body and no image of the top of the head and a vertical projection is only one among them.  That surely doesn’t mean this is the most probable.\n\n","date":"February 7, 2013 at 2:01 pm","url":"https://shroudstory.com/2013/02/07/topic-of-the-day-7-vertical-mapping-of-a-human-form/","cat":"topic_for_today","id":"comment-23701","author":"Yannick Clément","site":"shroudstory"},{"title":"Topic of the Day (#7): Vertical Mapping of a Human Form","post":"I don’t think the difference between a vertical projection and a diffusion mechanism would be striking at first sight. Differences would be slight.\nA very good argument for a diffusion mechanism are diffuse borders of the image.\nIf you look at the hands and the fingers, you can’t really see the sides either, but part of the diffuse boder may come from the sides. It is like Rogers’ test with a rope, one can see a kind of “projection” of the rope with diffuse borders, but mechanism was gas diffusion.\nI really don’t see any serious argument pointing to a vertical projection mechanism in this item. Question is : what was the body-cloth configuration ?\n\n","date":"February 7, 2013 at 3:16 pm","url":"https://shroudstory.com/2013/02/07/topic-of-the-day-7-vertical-mapping-of-a-human-form/","cat":"topic_for_today","id":"comment-23704","author":"anoxie","site":"shroudstory"},{"title":"Topic of the Day (#7): Vertical Mapping of a Human Form","post":"Concerning the absence of an image of the sides and the top of the head, I think the hypothesis involving the presence of many bags of aloes and myrrh in powder all around the body inside the Shroud to remove bad smelling in prevision of a return to the tomb on Sunday morning to complete the burial rite is one of the most rational way to explain this very striking feature of the Shroud’s image.  Of course, we will never be certain of that, but that’s truly one interesting scenario.  Those bags would have been placed on the dorsal part of the cloth (the one which was laid on the stone bench of the tomb) all around the body (in direct contact with it or very very close to it) and finally, the other part of the Shroud would have been folded over the top of the body and over the bags, which would have created a good space between the Shroud and the sides of the body and the top of the head.  This would have been enough to prevent the formation of an image in those areas.  To me, this kind of logical scenario is truly plausible, especially in the particular context of Jesus’ hasty burial.\n\n","date":"February 7, 2013 at 4:43 pm","url":"https://shroudstory.com/2013/02/07/topic-of-the-day-7-vertical-mapping-of-a-human-form/","cat":"topic_for_today","id":"comment-23712","author":"Yannick Clément","site":"shroudstory"},{"title":"Topic of the Day (#7): Vertical Mapping of a Human Form","post":"Additional comment: Your last question Anoxie will never be answer and that’s just one of many unknown factors regarding the Shroud that can easily explain why it would be very difficult (if not a mission impossible) for a scientist to reproduce the Shroud and his image, even though it probably come from a natural interaction between the cloth and the dead body it covered…  And most of the ancient Shroudies were well aware of this.  You just have to read the beautiful paper written in 1934 by Father Rinaldi to be convinced of this.\n\n","date":"February 7, 2013 at 4:44 pm","url":"https://shroudstory.com/2013/02/07/topic-of-the-day-7-vertical-mapping-of-a-human-form/","cat":"topic_for_today","id":"comment-23713","author":"Yannick Clément","site":"shroudstory"},{"title":"Topic of the Day (#7): Vertical Mapping of a Human Form","post":"Ok, we agree, the absence of a clear side image may not be explained by the image formation mechanism (which could be isotropic) but the body-cloth clearance.\nNow the absence of “side images” should be explained more clearly.\nIf you take a picture of someone, do you see “side images” ? This is misleading, and the conclusion to a “vertical mapping” is confusing too.\n\n","date":"February 7, 2013 at 6:06 pm","url":"https://shroudstory.com/2013/02/07/topic-of-the-day-7-vertical-mapping-of-a-human-form/","cat":"topic_for_today","id":"comment-23718","author":"anoxie","site":"shroudstory"},{"title":"Topic of the Day (#7): Vertical Mapping of a Human Form","post":"Dr Mario Latendresse has done some interesting work on the question of orthogonality of the image, using a mapping technique with a model covered in a cloth.  Recommended reading for those interested in this particular issue.  \n“The Turin Shroud Was Not Flattened Before the Images Formed and no Major Image Distortions Necessarily Occur from a Real Body”  Mario Latendresse, Ph.D. latendre@iro.umontreal.ca.  \nTwo URLs to check out:\nhttp://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.160.656\nSlides:  http://www.sindonology.org/papers/latendresse2005aSlides.pdf   \nIn order to get the 3-D properties, it seems to me that the molecules emanating from the body (gases?) must be undergoing some time-dependent stabilisation process as they travel from the body to the cloth, so that the image appears more “diluted” the further the molecules have to travel.  This implies that there are fewer image forming molecules when the gases arrive at the cloth, with the further distances.  That is, only if the image can indeed be shown to have been formed by some chemical process as postulated by Rogers.  \nI don’t follow Hugh’s line of reasoning at all.  His comment suggests that he is open to the possibility of the image not being formed by a real body, but by some other fraudulent means, not specified.  The weight of evidence I’ve seen, persuades me that the Shroud is indeed an authentic burial cloth, originating in Jerusalem.  I think his vision is too narrow, in that he is ignoring evidence which does not match his assertions.  (pollens and even the limestone).\n\n","date":"February 7, 2013 at 3:29 pm","url":"https://shroudstory.com/2013/02/07/topic-of-the-day-7-vertical-mapping-of-a-human-form/","cat":"topic_for_today","id":"comment-23706","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Topic of the Day (#7): Vertical Mapping of a Human Form","post":"” This implies that there are fewer image forming molecules when the gases arrive at the cloth, with the further distances.”\nIt decreases exponentially with distance, and it’s correlated to the radius of a cylinder. Btw it may explain why resolution is better on fingers vs legs.\nMario Latendresse’s article is very interesting and is an independant argument for an isotropic mechanism.\n\n","date":"February 7, 2013 at 6:18 pm","url":"https://shroudstory.com/2013/02/07/topic-of-the-day-7-vertical-mapping-of-a-human-form/","cat":"topic_for_today","id":"comment-23721","author":"anoxie","site":"shroudstory"},{"title":"Topic of the Day (#7): Vertical Mapping of a Human Form","post":"On the contrary, daveb, you follow my line of reasoning impeccably. I am open to the possibility that the image was not formed by a real body, or even a real body shape – not convinced, by any means, but certainly open to the possibility. I would hardly have spent the last few months singeing linen if I had rejected the possibility of a scorch. However, in this case, my personal views are irrelevant. We are constructing a critical summary of “A critical summary of … hypotheses” and surely, any such document that begins by denying the possibility of half the hypotheses it seeks to summarise deserves a certain amount of criticism. I agree that the pollen, the limestone and the artistic archaeology are evidence in favour of authenticity, but all of them have been sensibly queried, and are not as persuasive to me as they are to you.\nMario Latendresse’s paper is excellent in its way, but I think fails to comment on some things and fails to notice others. He suggests that the biggest distortions of image should lie where the covering cloth is most steeply angled away from the horizontal. These include the sides of the arms (not commented upon), the hips, and the sides of the legs (not noticed). The width of the hips ‘photographically’ (without distortion) can be calculated as line B + line D + the distance between them (11 squares x 1.11cm) – about 27.2cm. By counting squares, the ‘image’ of the hips has a width of 36.6cm. This 35% increase is charmingly dismissed with “some observable widening of the hip is expected” and “such an apparent widening has been observed.” However the widest part of the front of the body (hips) corresponds in the rear to the buttocks. Measurements using Shroud Scope give about 36cm across the hips, and, not too surprisingly, about 34cm across the buttocks. Now if we assume that the hip-image is distorted by draping cloth, and the buttock image is not, it is clear that the front would be far too thin.\nAs for the legs, Latendresse’s photos show his cloth draping the legs quite closely, but he does not explore the distortion thus caused. If I measure the bottom edge of his photo with a ruler, and then in his cloth squares, I get an undistorted width of about 24.7cm, and an image width of 33.3cm, an increase of 35% across the width of the image, not borne out by the image on the shroud. I do not think Latendresse has proved his point.\n\n","date":"February 7, 2013 at 7:48 pm","url":"https://shroudstory.com/2013/02/07/topic-of-the-day-7-vertical-mapping-of-a-human-form/","cat":"topic_for_today","id":"comment-23726","author":"Hugh Farey","site":"shroudstory"},{"title":"Topic of the Day (#7): Vertical Mapping of a Human Form","post":"Hugh Farey wrote:\n “This 35% increase is charmingly dismissed with “some observable widening of the hip is expected” and “such an apparent widening has been observed.”\nIt has not been “charmingly dismissed” as you wrote. In the paper it is written (p. 13, second column, last paragraph)\n“Some observable widening of the hip is expected — it has been measured at 5.1 centimeters on one side in our experiment — and such an apparent widening has been observed for the Shroud by the work of Ercoline et al. [1].”\nYou have obviously chopped off the paragraph so that the reference to the work of Ercoline is no longer mentioned. So your claim that it has been “charmingly dismissed”  looks more like you misquoted the paper.\nThere is even another sentence (p. 13, second column, end of first paragraph) that reads:\n“This is con\ffirmed by Ercoline et al. [1] for the Shroud (see\nalso Jackson [4]): a statistical analysis shows that the\nbody image of the Man of the Shroud, at hip level, is\nwider than normal by several centimeters.”\nSo, a second reference is made to a paper that determined that there is observable widening at the hip level, but you squarely forgot to mention it. \nMoreover, you simply have not pointed out that simple fact: you report a measurement of 36 cm using the Shroud Scope at hip level (and you did not provide the image used, the zoom level nor the end points of this measurement, so there is no possible verification of where you did your measurement on the image) is quite close to the measurement of 36.6cm reported in the paper! Your reasoning based on the measurement of 34cm across the buttocks assumes that no distortion is occurring there. \nYou wrote:\n“As for the legs, Latendresse’s photos show his cloth draping the legs quite closely, but he does not explore the distortion thus caused.”\nAs pointed out in the paper, the sheet covers only 3/4 of the body. That meant that, approaching the knee, the sheet no longer covers the body as if a full sheet was covering it. In particular, the sheet starts tucking closely to the side of the body which is not the configuration assumes in the paper. I would say that the measurement of line D (Fig 7 II, p.11) is the lowest we can go without breaking that assumption. It is probably even a bit too low (creating a bit more distortion) at that point if a longer sheet had been used.\nFinally, you wrote:\n“I do not think Latendresse has proved his point.” \nI am not sure which point you are referring to as there are several points being discussed in the paper.\n\n","date":"February 8, 2013 at 2:28 am","url":"https://shroudstory.com/2013/02/07/topic-of-the-day-7-vertical-mapping-of-a-human-form/","cat":"topic_for_today","id":"comment-23742","author":"Mario Latendresse","site":"shroudstory"},{"title":"Topic of the Day (#7): Vertical Mapping of a Human Form","post":"Unfortunately more work needs to be done on the pollens and the limestone before they can be used as hard evidence.\n\n","date":"February 7, 2013 at 8:05 pm","url":"https://shroudstory.com/2013/02/07/topic-of-the-day-7-vertical-mapping-of-a-human-form/","cat":"topic_for_today","id":"comment-23728","author":"Louis","site":"shroudstory"},{"title":"Topic of the Day (#7): Vertical Mapping of a Human Form","post":"I consider it an honour for the author of such an excellent paper to comment on my comment. His sort of experimentation is exactly what the shroud world needs, and his explanation of how he derived his findings is a model of clarity. Nevertheless, I do not think that the principle point of the paper – that the image on the shroud is compatible with a draped rather than a horizontal shroud, has been established. The places where distortion would be most visible would be the places where the shroud dropped furthest away from horizontal, such as the back of the head, the sides of the arms, hips and legs, and not across the face or along the arms. Carefully laying his sheet across his model, there are several places (lines B and D being his best examples) where he finds that a draped cloth would produce an image up to 35% wider than the ‘photographic’ image which might be expected from a horizontal cloth. I do not find this distortion in the shroud. Where the front and back images can be directly compared, i.e. across the widest part of the body in the hip region, the distances are very similar. It doesn’t matter at what magnification or what image of the shroud you use. Either one finds that the ventral image is 35% wider than the dorsal image, or one does not, and I do not. I do find it a few centimetres wider, as, no doubt did Ercoline, although quoting him as a supporter without stating whether he agrees with Latendresse (that the widths differ by 35%) or me (that they differ by less than 10%) is a trifle unfair, I think. To write off the discrepancy – some widening “is expected” and “has been observed” rather than compare the proportions, is indeed a charming dismissal of an important counter-observation.\n\n","date":"February 8, 2013 at 7:44 am","url":"https://shroudstory.com/2013/02/07/topic-of-the-day-7-vertical-mapping-of-a-human-form/","cat":"topic_for_today","id":"comment-23759","author":"Hugh Farey","site":"shroudstory"},{"title":"Topic of the Day (#7): Vertical Mapping of a Human Form","post":"Is there a published study on the anatomical measurements of the shroud and how they compare to modern human measurements?\n\n","date":"July 8, 2013 at 11:37 pm","url":"https://shroudstory.com/2013/02/07/topic-of-the-day-7-vertical-mapping-of-a-human-form/","cat":"topic_for_today","id":"comment-38767","author":"archaeon","site":"shroudstory"},{"title":"Topic of the Day (#7): Vertical Mapping of a Human Form","post":"In a word – yes and no. Dozens of people have attempted to determine the size of ‘the man in the shroud’ from photographs and the wonderful shroudscope online, and there have been three or four direct measurements of the cloth itself. They all differ in detail, and some quite markedly. For start the cloth itself has been pulled about a bit, distorting the image slightly, but most of the differences are caused by different ideologies rather than different measurements. If the man in the shroud was laid flat, and the shroud was laid flat, and the image arrived like a couple of photographs, projected vertically up and down, then all you need to do is measure, as best you can, the marks on the cloth. If, on the other hand, the man was laid with his head on a pillow and his legs bent at the knee, and the bottom of the cloth was flat but the top was draped along his body and folded down the sides, then the bottom image would show much shorter legs than the top, and the upper image would be much wider than the bottom. There are a number of variations on these themes, none of which are completely satisfactory, as they all have inconsistencies. You were best, quite honestly, to try it yourself, but for a start, try http://www.shroud.com/pdfs/marineli.pdf which is extremely detailed and mathematical, and with which I disagree completely!\n\n","date":"July 9, 2013 at 3:48 am","url":"https://shroudstory.com/2013/02/07/topic-of-the-day-7-vertical-mapping-of-a-human-form/","cat":"topic_for_today","id":"comment-38781","author":"Hugh Farey","site":"shroudstory"},{"title":"Topic of the Day (#7): Vertical Mapping of a Human Form","post":"Thanks Hugh for the reference. I’m new to this subject. Is there a reason why you disagree with Marinelli?\n\n","date":"July 9, 2013 at 7:21 pm","url":"https://shroudstory.com/2013/02/07/topic-of-the-day-7-vertical-mapping-of-a-human-form/","cat":"topic_for_today","id":"comment-38802","author":"archaeon","site":"shroudstory"},{"title":"Topic of the Day (#7): Vertical Mapping of a Human Form","post":"Yes; several. Although I don’t really disagree with his conclusions – the man is quite an ordinary man – I think the mathematical calculations give a wholly unwarranted precision, given the subjective nature of almost all the measurements, and the assumptions made about angles of the head, knees and ankles and so on.\nEarly on in the paper, there is quite an interesting diagram of the two images superimposed on one another. It is worth trying this out for yourself, using either a shroudscope image or, better for this purpose, the photos at http://shroud.wikispaces.com/PROPERTIES. The two images are, indeed superimposable. However, if the man had bent knees, and the bottom of the shroud was laid flat, and the top was draped over the body, the bottom image should show a) considerable foreshortening, and b) no image between the buttock and the heels. If (as Marinelli speculates) the bottom of the shroud was held up by pillows so that it makes contact with the legs, the legs would still appear shorter underneath than on top, as the top surface has to drape over the knees, while the bottom surface does not.\nOther uncertainties concern the width of the image, which might be extended on top by some factor due to being draped across the body, and extended on the bottom by the weight of the body flattening out the buttocks, etc.\nGiven these speculations, look at Marinelli’s Section 5 – Uncertainty Analysis. My interpretation…\n1) We don’t know whether the image is rounded slightly over the top of the head, or is a flat image. Guess 3% error.\n2) We don’t know if the head was bent on not. Guess plus or minus 3cm.\n3) We don’t know if the linen has stretched. Guess 2% error.\n4) We don’t know if the draping of the cloth makes the front image too long in respect of the back. Guess 7.5% too long. [In my opinion it would make more sense to call the dorsal image 7.5% too short, but that’s by the bye]\n5) We don’t know if the back of the sheet was brought up to make contact with the legs. Guess 1% too long. [This doesn’t mean anything to me]\n6) We don’t know if wrinkles on the sheet mean the images occupy a greater length than they should. Guess 2% too long.\n7) We don’t know if the S-bend of the backbone may be relevant. Guess add 1cm. [Nor does this]\n8) A man lying down is longer than him standing up. Guess 2cm too long.\n9) We don’t know if the linen has shrunk. Or not. Guess let’s leave it as it is.\nIf we take the uncertainty extremes of all Marinelli’s guesses, we have to accept the man in the shroud was between about 4 feet and 10 feet high, with arms and legs roughly in proportion.\nAs I say, if you want to compare the man in the shroud to any modern set of anthropomorphic standards, you were much better to do it yourself.\n\n","date":"July 10, 2013 at 5:12 am","url":"https://shroudstory.com/2013/02/07/topic-of-the-day-7-vertical-mapping-of-a-human-form/","cat":"topic_for_today","id":"comment-38816","author":"Hugh Farey","site":"shroudstory"},{"title":"Topic of the Day (#7): Vertical Mapping of a Human Form","post":"Thanks for the image of a 10 foot high man.\nI still am confused on why there is no image of the top of the head. If the shroud is wrapped across the head, why is there either no image or no gap?\n\n","date":"July 10, 2013 at 11:20 pm","url":"https://shroudstory.com/2013/02/07/topic-of-the-day-7-vertical-mapping-of-a-human-form/","cat":"topic_for_today","id":"comment-38877","author":"archaeon","site":"shroudstory"},{"title":"Topic of the Day (#7): Vertical Mapping of a Human Form","post":"As usual with the shroud, there is no consensus about what happened, although there are lots of possibilities. Perhaps the simplest is that the cloth was not wrapped around, but draped over the body. Imagine a body lying on a length of cloth on a slab, with a lot of extra cloth beyond the head. If two men stood, head and foot, holding that bit of cloth horizontally between them and lowered it over the body, then the length connecting the top and bottom would be loose, and flop down beyond the top of the head. Another possibility is that the whole body was encased in blocks or bags of spices (100 pounds of myrrh and aloes, perhaps), and the cloth drawn over the blocks around the head. This would also explain why there is no image of the sides of the body. The forgery hypothesis has similar explanations, but in that case the body is replaced by a model, bas relief or whatever.\n\n","date":"July 11, 2013 at 4:55 am","url":"https://shroudstory.com/2013/02/07/topic-of-the-day-7-vertical-mapping-of-a-human-form/","cat":"topic_for_today","id":"comment-38884","author":"Hugh Farey","site":"shroudstory"},{"title":"Topic of the Day (#7): Vertical Mapping of a Human Form","post":"Thanks Hugh. I can see how the draping over the body with bags of spices can possibly lead to lack of side images. However the dorsal and ventral part of the head is one continuous sheet. If there was something that was blocking the image formation, there would be a space between the dorsal and ventral image. If there was some sort of vertical mapping image formation, I would still think there would be a space between the dorsal and ventral images. The sides are free of this restriction.\n\n","date":"July 11, 2013 at 9:02 pm","url":"https://shroudstory.com/2013/02/07/topic-of-the-day-7-vertical-mapping-of-a-human-form/","cat":"topic_for_today","id":"comment-38908","author":"archaeon","site":"shroudstory"}]
