[{"title":"Topic of the Day (#8):  The body image disappears at a distance","post":"This observation really requires the actual shroud for substantiation, as photographs are often described as overly contrasting. However, when did a little thing like that stop me rushing in where angels fear to tread? Measure a distance between two features on Shroud Scope, draw a line the same length on a whiteboard, and project the image so that the line correctly occupies the space between the features, and we have a life-size image of the shroud on the wall. Even with the lights on it is clearly discernible from well within a metre.\nBut, as I say, that may be thanks to the photograph.\nI’m intrigued by the ‘resolution’ of 4.9mm ± 0.5mm, and wonder what it means (especially the 0.5mm error bars). If it were true, would we not see nipples, say? or navel? or fingernails? toes? Can anyone explain?\n\n","date":"February 8, 2013 at 12:13 pm","url":"https://shroudstory.com/2013/02/08/topic-of-the-day-8-the-body-image-disappears-at-a-distance/","cat":"topic_for_today","id":"comment-23789","author":"Hugh Farey","site":"shroudstory"},{"title":"Topic of the Day (#8):  The body image disappears at a distance","post":"I don’t know how they got this resolution. I don’t think resolution is homogeneous and it may depends on local conditions.\nBut the best resolution around 5 mm doesn’t seem unrealistic, if you consider the distance between two points with a significant different color density it may even be lower.\n\n","date":"February 9, 2013 at 6:04 am","url":"https://shroudstory.com/2013/02/08/topic-of-the-day-8-the-body-image-disappears-at-a-distance/","cat":"topic_for_today","id":"comment-23850","author":"anoxie","site":"shroudstory"},{"title":"Topic of the Day (#8):  The body image disappears at a distance","post":"Dan; “The fact that the image seems to disappear beyond a meter or so is interesting, but what, if anything, does it really mean?” …It simply means to me and many others, that it would be practically impossible an artist could have produced the image, especially the details…simple.\nHugh, this ‘observation’ has been attested to by ‘many’ who have viewed the Shroud first hand and in different lighting. So no question about this being fact. As to actual details not being viewable; navel etc; Try considering for a moment that this is an actual burial cloth and that it wrapped a severely tortured body. A body covered in blood and dirt,…maybe just maybe these finer details would be indicernable through such?\nR\n\n","date":"February 8, 2013 at 5:49 pm","url":"https://shroudstory.com/2013/02/08/topic-of-the-day-8-the-body-image-disappears-at-a-distance/","cat":"topic_for_today","id":"comment-23808","author":"Ron","site":"shroudstory"},{"title":"Topic of the Day (#8):  The body image disappears at a distance","post":"Thanks, Ron, I was afraid someone would say that. Has anybody taken a good picture of the shroud “as is” I wonder? There is one in Rogers’s “Chemist’s Perspective” but it is such a poor photo that even the bloodstains become invisible at any magnification.\nAs to the resolution issue, it seems strange that we can quote a figure of half a centimetre when features of the body much bigger than that cannot be detected at all. It’s as if an aerial photographer announced that they had taken photos with a resolution of half a metre, say, and then apologised that in fact the entire image was invisible because of cloud. If almost every body detail is obscured, how do we know what the resolution is?\n\n","date":"February 8, 2013 at 6:48 pm","url":"https://shroudstory.com/2013/02/08/topic-of-the-day-8-the-body-image-disappears-at-a-distance/","cat":"topic_for_today","id":"comment-23814","author":"Hugh Farey","site":"shroudstory"},{"title":"Topic of the Day (#8):  The body image disappears at a distance","post":"Dear Hugh,\nRon is right regarding the many testimonies about the very strange impression left by the “disappearance” of the image when viewed beyond about one meter.\nThis simply means that beyond one meter, if you look for example at a part of the TS face, you’ll not be able to recognize it as a part of a human face.\nOr, in other words, for your mind to be able to see with certainty a human face, you have to be about one meter away from the TS.\nYes a good picture of  the TS face “as is” can be found in the book “Sindone 2002” by Flury-Lemberg. The photo was certainly taken with the best “white light” uniform illumination.\nThe face is much fainter than all the photographs I ever saw, including the Durante’s photographs.\nMoreover, an oblique view of the same area is shown (p.45).\nWhile the creases and the blood marks are very well seen, one can literally “see” here the incredible superficiality of the image. \nPhotographs available at request..\nThibault.\n\n","date":"February 9, 2013 at 5:07 pm","url":"https://shroudstory.com/2013/02/08/topic-of-the-day-8-the-body-image-disappears-at-a-distance/","cat":"topic_for_today","id":"comment-23888","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Topic of the Day (#8):  The body image disappears at a distance","post":"I truly don’t this property of the image is anything spectacular or special once you understand the correct nature of it, which is a diffuse image. Note that such a particularity of the image is totally compatible with a natural and pretty mild interaction between the heat and/or the vapors (water vapors, ammonia, etc.) coming from a recent dead body and a linen cloth, especially when consider the fact that this image is discontinuous at fiber level (this can be understand as a stochastic effect). \nSince the last update of Shroud.com, we have the pleasure to be able to read the first few issues of the excellent publication called Shroud Spectrum International.  In the #4 issue (September 1982), there is a pretty good summary article written by Robert Dinegar concerning the STURP team work of 1978.  Here’s the link:  http://shroud.com/pdfs/ssi04part3.pdf\nNow, if you go to page 7 of that paper (which is in reality page 6 of the PDF version), here’s the excellent description of that particular characteristic of the image made by Dinegar: “The image is best (most vividly) seen at a distance. It fades as the observer approaches and is difficult to locate under magnification. THERE IS NOTHING MYSTERIOUS ABOUT THIS PROPERTY; IT IS A WELL-KNOWN PHENOMENON. In diffuse-image situations, the human eye discriminates better when more area of the image can be seen at one time.”\nI think Dinegar’s quote says it all and nothing else need to be added here.  Final note: Dinagar was a colleague of Ray Rogers at the Los Alamos National Scientific Laboratories.\n\n","date":"February 10, 2013 at 7:20 pm","url":"https://shroudstory.com/2013/02/08/topic-of-the-day-8-the-body-image-disappears-at-a-distance/","cat":"topic_for_today","id":"comment-23936","author":"Yannick Clément","site":"shroudstory"},{"title":"Topic of the Day (#8):  The body image disappears at a distance","post":"I forget a word in the first line of my comment.  You should read “I truly don’t THINK this property…”  Excuse me.\n\n","date":"February 10, 2013 at 7:23 pm","url":"https://shroudstory.com/2013/02/08/topic-of-the-day-8-the-body-image-disappears-at-a-distance/","cat":"topic_for_today","id":"comment-23937","author":"Yannick Clément","site":"shroudstory"},{"title":"Topic of the Day (#8):  The body image disappears at a distance","post":"Haha just noticed an error inmy comment and  Dan’s comment. It should read as ” The fact that the image seems to disappear [within] a meter or so is interesting…” This is what as been attested to by many people.\nR\n\n","date":"February 9, 2013 at 9:19 pm","url":"https://shroudstory.com/2013/02/08/topic-of-the-day-8-the-body-image-disappears-at-a-distance/","cat":"topic_for_today","id":"comment-23894","author":"Ron","site":"shroudstory"},{"title":"Topic of the Day (#8):  The body image disappears at a distance","post":"I’m becoming increasingly disenchanted with this so-called “Critical Review” with its fuzzy ideas and poorly expressed text.  Why bother to comment or even notice it?  Like Hugh, I do not understand what is meant by a resolution of 4.9mm and its alleged tolerance of 0.5mm.  It is more scientific to express resolution as a ratio or an angle.  Thus the normal human eye has a limiting resolution of about 2 minutes of arc.  Yet distance units are given.  Does this mean that no image on the cloth is more distinct than half a centimetre across – I doubt it – the eyes for example clearly have better definition than 5mm.  Some have claimed to discern lettering on coins say 1mm.  Yet other parts of the body are quite indistinct.  Clearly the question of resolution is not a constant across the cloth, but it varies, and its pointless to ascertain a single value as applying to the whole cloth.  The fact that the image tends to disappear on observation closer than about a metre or so, is a matter of human perception, rather than being an objective property.  A most unsatisfactory paper – I’ve seen better scientific writing in undergraduate reports.\n\n","date":"February 9, 2013 at 4:08 am","url":"https://shroudstory.com/2013/02/08/topic-of-the-day-8-the-body-image-disappears-at-a-distance/","cat":"topic_for_today","id":"comment-23842","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Topic of the Day (#8):  The body image disappears at a distance","post":"Why bother ?\nBecause this is the kind of review which convey “established” misconceptions about the shroud.\n\n","date":"February 9, 2013 at 6:27 am","url":"https://shroudstory.com/2013/02/08/topic-of-the-day-8-the-body-image-disappears-at-a-distance/","cat":"topic_for_today","id":"comment-23852","author":"anoxie","site":"shroudstory"},{"title":"Topic of the Day (#8):  The body image disappears at a distance","post":"Did anyone notice that Fanti used the exact same words in his JIST paper last year: “The body image has a resolution of 4.9±0.5mm but no well-defined contours. This means that human details such as the nose, lips, and beard are clearly defined, but that the body image seems to disappear if someone looks at it from a distance closer than about 1 m.”\nThis is not the only instance of whole complicated sentences with identical wording appearing in both similar papers. Can we assume that this just a coincidence? I wonder if the Colorado authors can explain what the wording means.\n\n","date":"February 9, 2013 at 10:41 am","url":"https://shroudstory.com/2013/02/08/topic-of-the-day-8-the-body-image-disappears-at-a-distance/","cat":"topic_for_today","id":"comment-23873","author":"Paulette","site":"shroudstory"},{"title":"Topic of the Day (#8):  The body image disappears at a distance","post":"Actually, Paulette, the Siefker and Spicer paper includes the following:\n“In order to build upon the work of other Shroud research colleagues not associated with TSC, we have included, as a literal benchmark, the image characteristics that are most often mentioned in the corpus of empirical studies on the Shroud and also enumerated in an important paper by Giulio Fanti published in the Journal of Imaging Science and Technology. (See reference 1.) The cardinal numbered items in this table correspond to the characteristics listed in Fanti’s paper. There are additional items included in the table that augment Fanti’s\nlist . These items are supported by multiple sources including the research team of TSC. These additionally listed image characteristics, like the benchmark characteristics, place restrictions on proposed image formation hypotheses. The additional items are inserted into the table at what we believe are the proper logical points and are identified with a decimal fraction number.”\nSo credit is given. Your point about whether or not the authors can explain the resolution statement is, however, a good one.\n\n","date":"February 9, 2013 at 11:15 am","url":"https://shroudstory.com/2013/02/08/topic-of-the-day-8-the-body-image-disappears-at-a-distance/","cat":"topic_for_today","id":"comment-23876","author":"Dan","site":"shroudstory"},{"title":"Topic of the Day (#8):  The body image disappears at a distance","post":"The visual phenomenon is only due to the cloth specific weave pattern as image background. Such an image background strongly inhibits the sideways connectors/optic nerves (these help with image analysis) thus impairing the body image as visual signal to be transmitted to retina (the retina and optic nerves being recognized as actually parts of the brain). Reminder: the Shroud body image resolution is not as high as that of the blood imprints.\n\n","date":"February 11, 2013 at 6:19 am","url":"https://shroudstory.com/2013/02/08/topic-of-the-day-8-the-body-image-disappears-at-a-distance/","cat":"topic_for_today","id":"comment-23963","author":"Max Patrick Hamon","site":"shroudstory"}]
