[{"title":"Until man can explain how the image got on the Shroud using his own technology, he really won’t believe it wasn’t his technology.","post":"the church is in the faith business which needs a place and structure that presents and converts and reinforces that faith on a ongoing basis. That is why the church is not interested  in proving genuineness of the shroud.\n\n","date":"June 22, 2014 at 11:37 am","url":"https://shroudstory.com/2014/06/22/until-man-can-explain-how-the-image-got-on-the-shroud-using-his-own-technology-he-really-wont-believe-it-wasnt-his-technology/","cat":"news_&_views","id":"comment-132303","author":"paul","site":"shroudstory"},{"title":"Until man can explain how the image got on the Shroud using his own technology, he really won’t believe it wasn’t his technology.","post":"“Man keeps trying to explain his existence with unproven hypothesis”? Should we say that when he has religion he also has faith, which to him explains his existence,and if he has no religion and no faith that, too, is an unproven hypothesis? Even RD is having second thoughts after the big noise he made.\nIan Wilson is right about the the pope’s homily but the Church is divided over something that is not an article of faith. Criticism was generated with the attitude of two papal custodians, Cardinal Anastasio Ballestrero, photographed leaning over the Shroud, and Cardinal Giovanni Saldarini, who referred to it as an “icon”.\nTwo recent popes have indeed also referred to it as an “icon”, but that does not necessarily mean that they think it was an “icon” that was painted. The Shroud is exposed as a relic, a genuine one, as seen in the words of Pope John Paul II, which IW rightly called our attention to.\nIt is obvious that Rome and Turin have not accepted the carbon dating, however, given the controversy, and no consensus both within the realm of Shroud studies and beyond it, there is not much it can do. The topic is complex and Ian Wilson’s book is the right one for anyone who really wants to know what it is all about and why fresh carbon dating may not solve the problem.\n\n","date":"June 22, 2014 at 12:35 pm","url":"https://shroudstory.com/2014/06/22/until-man-can-explain-how-the-image-got-on-the-shroud-using-his-own-technology-he-really-wont-believe-it-wasnt-his-technology/","cat":"news_&_views","id":"comment-132312","author":"Louis","site":"shroudstory"},{"title":"Until man can explain how the image got on the Shroud using his own technology, he really won’t believe it wasn’t his technology.","post":"Somewhat like C.G. Jung, Ludwig Wittgenstein did not have to “believe” in God, he “knew”, call it pistis in the Pauline sense. Paul, who,Hannah Michaels refers to, was extremely deep, he is a force to be reckoned with even today.\nBecause he was seriously ill Wittgenstein could not make it to Blackfriars Priory, in the Midlands, England where Father Conrad Pepler had arranged for him to live as a brother. He did not feel like a stranger in monasteries. he did not act as if his faith was an unproven hypothesis:\nhttps://www.academia.edu/6085481/Why_was_Wittgensteins_burial_attended_by_a_religious_ceremony\n\n","date":"June 22, 2014 at 1:10 pm","url":"https://shroudstory.com/2014/06/22/until-man-can-explain-how-the-image-got-on-the-shroud-using-his-own-technology-he-really-wont-believe-it-wasnt-his-technology/","cat":"news_&_views","id":"comment-132320","author":"Louis","site":"shroudstory"},{"title":"Until man can explain how the image got on the Shroud using his own technology, he really won’t believe it wasn’t his technology.","post":"The need to explain existence instead swimming in the middle of “unproven hypotheses” is important, it led the Nazi holocaust survivor Viktor Frankl to dwell on the topic in logotherapy. The great German Jesuit scholar Karl Rahner found it useful:\nhttps://www.academia.edu/7343768/Viktor_Frankl_and_the_Human_Search_for_Meaning\n\n","date":"June 23, 2014 at 12:47 pm","url":"https://shroudstory.com/2014/06/22/until-man-can-explain-how-the-image-got-on-the-shroud-using-his-own-technology-he-really-wont-believe-it-wasnt-his-technology/","cat":"news_&_views","id":"comment-132537","author":"Louis","site":"shroudstory"}]
