[{"title":"One very good reason why the Turin Shroud could not POSSIBLY have been produced by scorching onto linen – and 10 even better ones why it could.","post":"Have just added this comment to the same thread:\n(Your comment is awaiting moderation).  Thank you for that Dan Porter.\n“Anyone would think this banding hypothesis (neat, plausible but wrong) had been written on tablets of stone.\nA few moments of thought about the imprinting of a certain transverse crease should be sufficient to demolish any notion that vertical banding was the cause of the gaunt-looking features. There is another explanation for the cut-off peripheries of the face, and it’s nothing to do with colour variations in the yarn, and everything to do with the mechanism of image imprinting,\nBut I’m not here to debate technical matters – not any more.\nI’m thinking of setting up a new site that will specifically address this and the rest of Shroudology’s received wisdom, which all too often strikes me as little more than tendentious pseudo-scientific twaddle. And no, I will not be intimidated by “Fourier transforms” and similar injections of computer mumbo-jumbo, which in this instance has contributed precisely nothing.\nI’ll give you a link when my new site is ready.”\n","date":"March 14, 2012 at 8:17 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/23/one-very-good-reason-why-the-turin-shroud-could-not-possibly-have-been-produced-by-scorching-onto-linen-and-10-even-better-ones-why-it-could/","cat":"barrie_schwortz","id":"comment-60","author":"colinsberry","site":"colinberry"},{"title":"One very good reason why the Turin Shroud could not POSSIBLY have been produced by scorching onto linen – and 10 even better ones why it could.","post":"Correction:  “Firstly, the image shown is NOT the as-is Shroud image (a pseudo-negative)…”\n","date":"March 13, 2012 at 5:36 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/23/one-very-good-reason-why-the-turin-shroud-could-not-possibly-have-been-produced-by-scorching-onto-linen-and-10-even-better-ones-why-it-could/","cat":"barrie_schwortz","id":"comment-57","author":"colinsberry","site":"colinberry"},{"title":"One very good reason why the Turin Shroud could not POSSIBLY have been produced by scorching onto linen – and 10 even better ones why it could.","post":"Here’s a comment I have just this minute placed on my other site,  science buzz \n“A post has just appeared on the Shroud of Turin site which as ever is being highly dogmatic, and in all probability wrong, wrong, wrong about “banding” in the linen.\n link to banding \nIt claims that the gauntness of the face is due to the presence of “darker” bands of linen that effectively narrow the image (presumably by obscuring image).\nFirstly, the image shown is the as-is Shroud image (a pseudo-negative) but light/dark restored positive obtained on a silver salt emulsion, so the putative bands are not darker bands, but lighter bands, contrary to what is stated.\nBut more importantly, the blogger has omitted to consider the implications of the scorched-in crease mark at approx beard level. If a band had influenced the intensity of the image, making part of it seem to be invisible, or scarcely visible, then it should have affected the scorched-in crease mark too. But it did not – the latter with its twin track appearance looks roughly the same all the way acroos, including the right and left cheeks.\nWhat seems more probable is that the non-imprinted regions are little if anything to do with the colour of the yarn. They represent parts of a statue or bas relief template that failed to imprint – the most likely reason being that plane of the metal was sub-optimal relative to linen to have pressure and close contact, and consequently less intense scorching.\n","date":"March 13, 2012 at 5:24 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/23/one-very-good-reason-why-the-turin-shroud-could-not-possibly-have-been-produced-by-scorching-onto-linen-and-10-even-better-ones-why-it-could/","cat":"barrie_schwortz","id":"comment-56","author":"colinsberry","site":"colinberry"}]
