[{"title":"\nMy theory that the radiocarbon dating laboratories were duped by a computer hacker #5 \n","post":"\n\nAnonymous Thanks again for your comment under part #6. I have re-posted it under this part #5 post where the calibration chart is.>I am looking at your calibration chart, especially at the two yellow \"Oxford\" lines, which you say represent 780 and 720 years Before Present. These reflect off the calibration line and arrive, you say, at 1214 to 1266 AD. I'm afraid I don't see that. The 780 BP line seems correctly placed, but the corresponding vertical line arrives well after 1250 AD, and nowhere near 1214. Thanks. I have rechecked Oxford's dates and there was an error in both the placement and calculation of its 720 BP and 780 BP date. The correct calibrated year corresponding to 780 BP, should have been 1210, not 1214.>The 720 BP line seems to be far too high on the y-axis, close to 750 BP. If it were correctly placed, it would correspond to a calendar date rather later than 1266. Is that right, or am I missing something?Thanks again. The correct calibrated year corresponding to 720 BP, should have been 1279, not 1266. That still leaves Oxford's maximum date below the minimum dates of both Zurich (1286) and Arizona (1290).I will recheck all three laboratories' calibrated dates and replace my calibrated table and bar chart above with corrected ones.And if there is any need to change my conclusions above, apart from the dates, I will do that too. But at this stage it appears the changes are comparatively minor and don't necessitate a change to my conclusions.The Nature paper should have included calibrated dates for each laboratory, but it didn't. I assume that was deliberate to avoid it being obvious that the dates were markedly different. If you can find the actual calibrated dates for the three laboratories (I Googled for them but could not find them) I will replace my dates with those in my above post.Thanks again for your comment.Stephen E. Jones---------------------------------Reader, if you like this my The Shroud of Turin  blog, and you have a website, could you please consider adding  a hyperlink to my blog on it? This would help increase its Google PageRank number and so enable those who are Google searching on \"the Shroud of Turin\" to more readily discover my blog. Thanks.\n\n","author":"Stephen E Jones","date":"June 28, 2014 at 10:37 AM","url":"http://theshroudofturin.blogspot.com/2014/06/my-theory-that-radiocarbon-dating_13.html","site":"moore"},{"title":"\nMy theory that the radiocarbon dating laboratories were duped by a computer hacker #5 \n","post":"\n\n>I will recheck all three laboratories' calibrated dates and replace my calibrated table and bar chart above with corrected ones.I have replaced the calibrated graph, table and bar charts with corrected ones.As can be seen, Oxford's years still do not overlap Arizona and Zurich, and the latter two only overlap by 8 years.This is INEXPLICABLE if these were real dates, given that, as the 1989 Nature paper admits: \"the agreement among the three laboratories for samples 2, 3 and 4 [control samples] is exceptionally good.\"But as I point out in my post above, in each laboratory's dating runs, the Shroud and control samples were all on the same ~1 inch (~26 mm) diameter carousel wheel, and each sample was irradiated in turn by the same caesium beam, for a minute, the entire run taking only 10 minutes.However, these results for Sample 1 (the Shroud) ARE EXPLICABLE if they were bogus dates generated by a hacker's (Timothy W. Linick's) computer program!Stephen E. Jones\n\n","author":"Stephen E Jones","date":"June 29, 2014 at 12:12 AM","url":"http://theshroudofturin.blogspot.com/2014/06/my-theory-that-radiocarbon-dating_13.html","site":"moore"},{"title":"\nMy theory that the radiocarbon dating laboratories were duped by a computer hacker #5 \n","post":"\n\nThank you. That's clearer.\n\n","author":"Anonymous","date":"June 29, 2014 at 3:30 AM","url":"http://theshroudofturin.blogspot.com/2014/06/my-theory-that-radiocarbon-dating_13.html","site":"moore"}]
