[{"title":"\nMy theory that the radiocarbon dating laboratories were duped by a computer hacker #10: Summary (2)\n","post":"\n\nBesides, if they thought the Shroud was a medieval fake[42] why would they switch samples to ensure the Shroud's radiocarbon date was medieval?Precisely because they thought it was NOT medieval, but from the time of Jesus, that they may have wanted to do the fraud. Bonnet-Aymard hypothesis makes sense. And the fact that there is a mismatch in the reported weights and sizes of the samples provides support to his accusation.\n\n","author":"DH","date":"June 8, 2015 at 4:58 AM","url":"http://theshroudofturin.blogspot.com/2014/12/my-theory-that-radiocarbon-dating_8.html","site":"moore"},{"title":"\nMy theory that the radiocarbon dating laboratories were duped by a computer hacker #10: Summary (2)\n","post":"\n\nDHThanks for your comment.>>Besides, if they thought the Shroud was a medieval fake[42] why would they switch samples to ensure the Shroud's radiocarbon date was medieval?You have omitted the other reasons why the radiocarbon dating laboratories would not have switched the Shroud sample with a medieval control sample:1. \"But Ian Wilson personally knew Tite and most of the other the radiocarbon dating project leaders and he dismissed as \"absurd and far-fetched as it is unworthy\" accusations that \"one or more of these men may have `rigged' the radiocarbon dating\" by switching samples[39]. 2. \"It is also highly unlikely that leaders of the radiocarbon dating project like Dr. Tite would commit major scientific fraud by switching control and Shroud samples, since they would have too much to lose if the fraud was discovered[40],\"3. \"as it would have been because of the Shroud's distinctive weave[41].\">Precisely because they thought it was NOT medieval, but from the time of Jesus, There is NO evidence that these mostly non-Christian atheist/agnostics laboratory leaders and their staff \"thought it [the Shroud] was NOT medieval, but from the time of Jesus,\">that they may have wanted to do the fraud. Even if they HAD \"wanted to do the fraud\" (and there is no evidence that they did) the fact that the fraud would have been \"discovered ... because of the Shroud's distinctive weave\" rules out fraud by sample switching.>Bonnet-Aymard hypothesis makes sense. It indeed \"makes sense\" that there HAD to have been fraud in the 1st century Shroud (according to the OVERWHELMING weight of the evidence) having a 13th/14th century radiocarbon date, when the probability of that was \"astronomical\" (Tite, Hall Hedges); \"about one in a thousand trillion\" (Gove) and indeed \"totally impossible\" (Hall). But where those who pointed that out went wrong is that they considered only ONE form of fraud, sample-switching, which is highly implausible; and did not consider a much more likely form of fraud for the FULLY COMPUTERISED process of AMS radiocarbon dating, namely COMPUTER HACKING.[continued]\n\n","author":"Stephen E Jones","date":"June 8, 2015 at 9:56 AM","url":"http://theshroudofturin.blogspot.com/2014/12/my-theory-that-radiocarbon-dating_8.html","site":"moore"},{"title":"\nMy theory that the radiocarbon dating laboratories were duped by a computer hacker #10: Summary (2)\n","post":"\n\n[continued]Even though Gove's book was not available until 1996, which stated that the AMS radiocarbon dating process was FULLY COMPUTERISED:\"The first sample run was OX1. Then followed one of the controls. Each run consisted of a 10 second measurement of the carbon-13 current and a 50 second measurement of the carbon-14 counts. This is repeated nine more times and an average carbon-14/carbon-13 ratio calculated. ALL THIS WAS UNDER COMPUTER CONTROL and the CALCULATIONS PRODUCED BY THE COMPUTER were displayed on a cathode ray screen.\" (Gove, H.E., 1996, \"Relic, Icon or Hoax?,\" p.264. My emphasis);Sox's book stated it in 1988:\"The CALCULATIONS WERE PRODUCED ON THE COMPUTER, and DISPLAYED ON THE SCREEN. Even the dendrochronological correction was immediately available. All eyes were on the screen. The date would be when the flax used for the linen relic was harvested.\" (Sox, H.D., 1988, \"The Shroud Unmasked,\" p.147).So there really was NO EXCUSE for those who correctly realised that there HAD to have been fraud in the 1st century Shroud having a 13th/14th century radiocarbon date, not considering computer hacking as another form of fraud.Although they mean well, like police investigators who focus only on the wrong suspect in a crime, and ignore other suspects, one of whom actually did the crime, those who claim the fraud was sample switching are unwittingly protecting the actual perpetrator, a computer hacker (allegedly Timothy W. Linick).>And the fact that there is a mismatch in the reported weights and sizes of the samples provides support to his accusationThe photograph of the various Shroud radiocarbon dating samples in Wilson's 2010 book, \"The Shroud,\" which is online, shows that there is no \"mismatch in the reported ... sizes of the samples.\" So any \"mismatch in the reported weights ... of the samples\" is readily explained by human error.Stephen E. Jones----------------------------------MY POLICIES Comments are moderated. Those I consider off-topic, offensive or sub-standard will not appear. Except that comments under my latest post can be on any Shroud-related topic without being off-topic. I normally allow only one comment per individual under each one of my posts.\n\n","author":"Stephen E Jones","date":"June 8, 2015 at 9:59 AM","url":"http://theshroudofturin.blogspot.com/2014/12/my-theory-that-radiocarbon-dating_8.html","site":"moore"}]
