[{"title":"\nMy theory that the radiocarbon dating laboratories were duped by a computer hacker #9\n","post":"\n\nIts very interesting that Koch and Linick were both dead within so close time intervals of each other. Suicide was the typical liquidation methods of intelligence agencies and they were very good at what they did.Its interesting that not much information can be found on Linick's death.Something smells funny here about these 2 deaths.\n\n","author":"bippy123","date":"September 6, 2014 at 9:15 AM","url":"http://theshroudofturin.blogspot.com/2014/09/my-theory-that-radiocarbon-dating.html","site":"moore"},{"title":"\nMy theory that the radiocarbon dating laboratories were duped by a computer hacker #9\n","post":"\n\nbippy123 Thanks for your support. I have had little (or no) expressions of support for my theory from pro-authenticists. Perhaps Porter's \"conspiracy theory\" scare campaign against my theory is working? No matter, I am not intimidated by the likes of Porter. I will leave it to the Lord to repay (Rom 12:19) Porter and his ilk for the personal attacks and nastiness that they have directed at me.>Its very interesting that Koch and Linick were both dead within so close time intervals of each other. Yes. I initially thought that my theory was weakened when I re-calculated that Koch was killed sometime between 23 and 30 May 1989 (since Koch went missing on 23 May and a farmer called the police after he noticed Koch's car abandoned three days in a row), which was between 12 and 6 days before Linick's `suicide.' But then I remembered that the police would havehad  to formally identify the charred body as Koch's:\"The body was LATER IDENTIFIED as that of the twenty-four-year-old Karl Koch.\" (Clough, B. & Mungo, P., 1992, \"Approaching Zero,\" p.163. My emphasis).before they could release the news to the public, which would presumably take at least a few days.So the KGB would probably not have known that Koch's body, which they had tried to hide so it would not be found for a long while:\"Koch left his workplace in his car to go for lunch; he had not returned by late afternoon and so his employer reported him as a missing person. Meanwhile, German police were alerted of an abandoned car in a forest near Celle. When they went to investigate, they found an abandoned car, that LOOKED LIKE IT HAD BEEN THERE FOR YEARS, AS IT WAS COVERED IN DUST. Near to the car they found a burned corpse (Koch). His shoes were missing and have never been found. There was a patch of burned ground around him, which although it had not rained in some time and the grass was perfectly dry, was controlled in a small circle around the corpse. It is thought to be highly unlikely that this type of controlled burning could have been achieved by Koch himself which leads many to believe that his death was not suicide.\" (\"Karl Koch (hacker),\" Wikipedia, 30 May 2014. My emphasis).had been found until they read, or heard it, via the news media. And then it was BIG news:\"The news of Hagbard's [Koch's] death brought the case of the hacker spies once again into public view. West German magazines and newspapers carried lengthy, speculative articles about the death. Just how sensitive was the material that landed in the hands of the KGB? And just who might have had an interest in seeing Hagbard dead? Could such a hideously painful death really have been the result of suicide? Unlike a drug overdose or suicide by gunshot, death by burning usually leaves the cause more ambiguous.\" (Hafner, K. & Markoff, J., 1991, \"Cyberpunk,\" pp.302-303).But the police did not find Koch's body until \"NINE days later\" than 23rd May, i.e. 1st June, or it could have been 31st May if the day Koch went missing was included in the 9 days:[continued]\n\n","author":"Stephen E Jones","date":"September 6, 2014 at 9:39 PM","url":"http://theshroudofturin.blogspot.com/2014/09/my-theory-that-radiocarbon-dating.html","site":"moore"},{"title":"\nMy theory that the radiocarbon dating laboratories were duped by a computer hacker #9\n","post":"\n\n[continued]\"Karl Koch was last seen alive on 23 May 1989. That morning he had turned up to work as usual at the Hannover office of Germany's ruling Christian Democratic party. Just before twelve o'clock he drove off alone to deliver a package across town. He never arrived. In the late afternoon, his employers notified the police of his disappearance. NINE DAYS LATER the police went to a wood on the outskirts of the small village of Ohof, just outside Hannover, on a routine inquiry. They were investigating a report of an abandoned car, its roof, hood and windscreen thick with dust. In the undergrowth near the car, the police stumbled on a charred corpse lying next to an empty gasoline can. The vegetation around the body was scorched and burned. The police noticed that the corpse was barefoot - but no shoes were found in the car or in the surrounding area. The investigators were perplexed. There had been no rain for five weeks and the undergrowth was as dry as matchwood. But the scorched patch around the body was contained, as if the fire that consumed the victim had been carefully controlled. The body was later identified as that of the twenty-four-year-old Karl Koch. The police assumed he had committed suicide. But still there were questions: principally, if Koch had killed himself, how had he been able to control the fire? Why had it not spread outside the confined perimeter?\" (Clough & Mungo, 1992, p.163. My emphasis).So, since Linick was found dead of \"suicide in mysterious circumstances\" on 4th June, then that would have been IMMEDIATELY AFTER the KGB learned that Koch's body had been found. >Suicide was the typical liquidation methods of intelligence agencies and they were very good at what they did.Indeed. The coincidence seems too great that a KNOWN hacker for the KGB (Koch) was killed, presumably by the KGB (who else?), for no apparent reason, and then immediately after his body was found, a THEORISED hacker for the KGB (Linick) was found dead of \"suicide in mysterious circumstances.\">Its interesting that not much information can be found on Linick's death.Yes. You would think that the sudden death of a 42 year-old local scientist in Tucson, would at least be mentioned in the local media. But the Library of Congress could only find a death and funeral notice. It is consistent with the US security agencies having suppressed the news. Although it is possible that the suicide was in a category that the media don't report, to avoid copy-cat suicides, like jumping in front of a moving train. Which of course the KGB could have arranged. But when Koch was found dead by simulated suicide presumably the US security agencies took note of it, because Koch had hacked US secrets and sold them to the KGB. Then when Linick committed \"suicide in mysterious circumstances\" only days later, since the Arizona radiocarbon dating laboratory is a US Government funded facility:\"Arizona Accelerator Mass Spectrometry Laboratory focuses on the study of cosmogenic isotopes, and in particular the study of radiocarbon, or Carbon-14. ...Established in 1981, this facility is a National Science Foundation research facility.\" (\"Arizona Accelerator Mass Spectrometry Laboratory,\" Wikipedia, 9 August 2012)it is possible that the US security agencies put two and two together, and had the news of Linick's death suppressed on national security grounds.[continued]\n\n","author":"Stephen E Jones","date":"September 6, 2014 at 9:46 PM","url":"http://theshroudofturin.blogspot.com/2014/09/my-theory-that-radiocarbon-dating.html","site":"moore"},{"title":"\nMy theory that the radiocarbon dating laboratories were duped by a computer hacker #9\n","post":"\n\n[continued]>Something smells funny here about these 2 deaths.Agreed. Apart from my theory, there is no known reason for Koch's simulated suicide. He had ~9 months before finished confessing his hacking of computer secrets for the KGB and so had his fellow hackers. But none of the latter were killed. Besides, the KGB would not be unduly upset that news of it's sponsored hacking of the computer secrets of OTHERS became known. It would only be the KGB's OWN hacking, e.g. ensuring the C14 dating of the Shroud returned a 1st century date, that the KGB would kill to ensure it remained secret.  What also seemed strange was when Hugh Farey copied my early comments on Porter's blog, proposing that the 1988 radiocarbon dating of the Shroud were the result of a computer hacking, to Profs. Timothy Jull and Prof. Christopher Ramsey, Directors of the Arizona and Oxford radiocarbon laboratories respectively, who both were signatories to the 1989 Nature paper, they both responded promptly. I thought that \"smells funny\" because why would they respond AT ALL to an unknown blogger (Farey said he did not tell them my name)?But what also smelled even funnier is that they were both very defensive and Prof. Ramsey effectively LIED, claiming that I was \"someone who does not know what computers were like in the 1980s\":\"This would seem to be a suggestion FROM SOMEONE WHO DOES NOT KNOW WHAT COMPUTERS WERE LIKE IN THE 1980S. In the case of Oxford the AMS had no connection to any network (and indeed even today our AMS control computers have no network connections). The software was very simple just outputting counts of 14C and currents measured. Age calculation was done offline and COULD JUST BE DONE WITH A CALCULATOR, or by a simple program into which you typed the numbers from the AMS\" (my emphasis).when in fact I was there at the beginning of the personal computer revolution of the 1980s and grew with it, becoming a SYSTEMS ADMINISTRATOR of a Health Department of Western Australia wide-area network of 7 hospital UNIX computers in the late 1980s/early 1990s.And besides it MADE NO SENSE because Prof. Ramsey KNEW that the AMS System computer at Arizona, Oxford and presumably Zurich, was a very powerful DEC PDP or VAX MINICOMPUTER. So what was Ramsey's POINT, if it was not to MISLEAD? And mislead it did, with those on Porter's blog interpreting Ramsey's \"The software was very simple ... Age calculation was done offline and could just be done with a calculator,\" as saying that the AMS computer was little better than a calculator, and Porter himself questioned whether it was even programmable!So I assume that Profs Ramsey and Jull know things that would support my hacking theory, but are trying to cover it up. Which is not to say that they KNOW they were hacked. Linick could, and probably did, include in his program that it would erase itself on the three  laboratories AMS computers after it had been run, and then was not run again for (say) three months, when all dating of the Shroud would have finished. But Jull and Ramsey may SUSPECT that they COULD have been hacked, but they wouldn't want that to be known. [continued]\n\n","author":"Stephen E Jones","date":"September 6, 2014 at 10:27 PM","url":"http://theshroudofturin.blogspot.com/2014/09/my-theory-that-radiocarbon-dating.html","site":"moore"},{"title":"\nMy theory that the radiocarbon dating laboratories were duped by a computer hacker #9\n","post":"\n\n[continued]I am quietly confident that my theory is basically correct, because it explains, and takes account of. as no other theory does, so many different things:1) how the 1st century Shroud had a C14 midpoint of 1325, only 25-30 years before the Shroud's first appearance in undisputed history at Lirey, France in the 1350s;2) other pro-authenticist explanations of 1) don't work, e.g. contamination; neutron flux; sample switching, because: a) it would require 60% of the Shroud samples to be contamination when Arizona's undated sub-sample sample clearly isn't; b) it would be a MIRACLE if a neutron flux `just happened' to reset the Shroud's 1st century date to 1325; and c) if the Shroud samples were switched the Table 2 of the 1989 Nature would not have wide variances between laboratories (see below), since they would be real dates.3) why Linick was quoted surprising in Sox's 1988 book as an extreme anti-authenticist and in direct contact with Sox, in breach of his signed undertaking not to communicate with anyone outside the lab;4) that Linick therefore was probably the leaker of Arizona's 1350 first run date to Sox who leaked it to the media;5) the otherwise inexplicable wide variances between the laboratories' Shroud samples C14 dates in Table 2 of the 1989 Nature paper, i.e. they are not real dates but computer-generated;6) that the entire process of C14 dating and displaying the results was under the AMS computer's control, so a hacker COULD install a program on it, at each of the three AMS laboratories, Arizona, Zurich and Oxford, to substitute the Shroud's 1st century date with dates that clustered around 1325;7) that Linick wrote the paper describing in detail Arizona's AMS C14 dating system, including its computer control, so he was probably thoroughly familiar with the AMS computers at Arizona and indirectly at Zurich and Oxford since they were `clones' of each other.8) that university laboratories (as the three AMS laboratories are) were insecure, both physically and computerwise, in 1980s;9) that the laboratories' AMS DEC computers' operating system, would probably have been VMS, which in the late 1980s had a huge hole, known to and exploited by hackers, including Koch, which allowed a hacker to enter the computer and become a superuser, after which he could install a program that would come between the output of the AMS C14 dating system and the AMS computer's display of the C14 dating results; 10) why Koch was killed, probably by the KGB, between 23 and 30 May, in a simulated suicide and Linick was killed, by a \"suicide in mysterious circumstances, again probably by the KGB, at most only 4 days after Koch's death became public; to ensure that the hacking of the Shroud's C14 dates, sponsored by the KGB, remained a secret.[continued]\n\n","author":"Stephen E Jones","date":"September 6, 2014 at 11:33 PM","url":"http://theshroudofturin.blogspot.com/2014/09/my-theory-that-radiocarbon-dating.html","site":"moore"},{"title":"\nMy theory that the radiocarbon dating laboratories were duped by a computer hacker #9\n","post":"\n\n[continued]I am therefore quietly confident that more information will come to light that will support and even confirm my theory. Although being a theory, not a fact, I am open to any evidence that might require it to be modified, or even abandoned as wrong (although I think the latter is unlikely).But if I WAS wrong, in Science there is no shame in that, despite what Porter, who has no science qualifications (unlike me) might think. Most scientific theories have been wrong and all science theories are potentially wrong. Scientists ADMIRE (albeit often grudgingly) when someone sticks their neck out and proposes a bold theory which attempts to explain much. What is DESPISED in Science are those who sit on the fence (like Porter) and propose NO bold theories (or even a theory AT ALL) but hold an UNFALSIFIABLE position that is \"not EVEN wrong,\" e.g. \"Is the Shroud of Turin real? Probably\"!But as I have written before, Koch is not essential to my theory, since Linick could have done all the hacking himself. It would not have been too difficult for Linick to take a week off work and fly to Oxford and Zurich and install clandestinely his program on their AMS computers, as he had done on Arizona's (although if Linick did not know how to break into Zurich and Oxfrord's computers, then that would explain Koch's involvement). It is not even essential to my theory that the KGB was involved, as Linick could have done the hacking alone (again assuming that he could break into Zurich and Oxford's AMS computers) for no financial gain but just out of his extreme anti-authenticism. However, I believe that my theory should try to explain as many facts as possible (the mark of a good theory), which is why I have stuck my neck out, giving Porter and anyone else, the opportunity to chop it off!Stephen E. Jones---------------------------------Reader, if you like this my The Shroud of Turin  blog, and you have a website, could you please consider adding  a hyperlink to my blog on it? This would help increase its Google PageRank number and so enable those who are Google searching on \"the Shroud of Turin\" to more readily discover my blog. Thanks.\n\n","author":"Stephen E Jones","date":"September 6, 2014 at 11:53 PM","url":"http://theshroudofturin.blogspot.com/2014/09/my-theory-that-radiocarbon-dating.html","site":"moore"}]
