[{"title":"\nMy theory that the radiocarbon dating laboratories were duped by a computer hacker #6\n","post":"\n\n\"If we show the material to be medieval that would definitely mean that it is not authentic. If we date it back 2000 years, of course, that still leaves room for argument. It would be the right age - but is it the real thing?\"You seem to think that statement is somehow logically invalid. Why?Proving the shroud is 2000 years old wouldn't prove it wrapped Jesus, for the same reason proving it 1000 years old wouldn't prove Jesus didn't exist.\n\n","author":"No serious shroud research would even think of making such a claim. Why do you think the shroud anti-authentisists want so bad to date the shroud from the middle ages.Because a \"shroud from the middle ages\" fits their PERSONALLY CONVENIENT naturalistic, anti-Christian, worldview.That's why the hacker's (whom I allege was Timothy W. Linick) first date of the Shroud, \"1350 AD... the time its historic record began\": \"The first sample run was OX1. Then followed one of the controls. Each run consisted of a 10 second measurement of the carbon-13 current and a 50 second measurement of the carbon-14 counts. This is repeated nine more times and an average carbon-14/carbon-13 ratio calculated. ALL THIS WAS UNDER COMPUTER CONTROL AND THE CALCULATIONS PRODUCED BY THE COMPUTER were displayed on a cathode ray screen. The age of the control sample could have been calculated on a small pocket calculator but was not-everyone was waiting for the next sample-the Shroud of Turin! At 9:50 am 6 May 1988, Arizona time, the first of the ten measurements appeared on the screen. We all waited breathlessly. The ratio was compared with the OX sample and the radiocarbon time scale calibration was applied ... At the end of that one minute we knew the age of the Turin Shroud! The next nine numbers confirmed the first. It had taken me eleven years to arrange for a measurement that took only ten minutes to accomplish! Based on these 10 one minute runs, with the calibration correction applied, THE YEAR THE FLAX HAD BEEN HARVESTED THAT FORMED ITS LINEN THREADS WAS 1350 AD-the shroud was only 640 years old! It was certainly not Christ's burial cloth BUT DATED FROM THE TIME ITS HISTORIC RECORD BEGAN.\" (Gove, H.E., 1996, \"Relic, Icon or Hoax?: Carbon Dating the Turin Shroud,\" p.264).was uncritically accepted by all present. They were all nuclear physicists, indoctrinated in Scientific Naturalism, and ignorant of the OVERWHELMING HISTORICAL and ARTISTIC EVIDENCE for the Shroud having existed CENTURIES before \"1350.\"They were sitting ducks for a hacker (who allegedly was Timothy W. Linick), having installed a program on Arizona's AMS control console computer (and also on Zurich's and Oxford's) which replaced the Shroud's actual C14 dates with computer-generated dates, which when calibrated, and averaged across the three laboratories, Arizona, Zurich and Oxford, `just happened' to be 1260-1390, or 1325 +/- 65, which `just happened' to be \"from the time its [the Shroud's] historic record began\" i.e. the Shroud's first appearance at Lirey, France in the 1350s.Stephen E. Jones\n\n","author":"Stephen E Jones","date":"July 3, 2014 at 8:55 PM","url":"http://theshroudofturin.blogspot.com/2014/06/my-theory-that-radiocarbon-dating_24.html","site":"moore"}]
