[{"id":"comment-21679","author":"giorgio","post":"Max I totally agree with your assertion that the work can be a very polarizing depending on the image science methodology used to quantify your conclusion. The fact is I’m learning to understand the protocol on peer review work and dismiss my own bias when I see the main foundation of the premise flawed compared with my own perspective. However, I’m still mystified why after 30 plus years we’re still wrestling with this topic about the Lepton coin..","date":"2013-01-06","mins":"8:18 pm","url":"https://shroudstory.com/2013/01/06/paper-chase-why-there-are-probably-no-images-of-coins-lettering-flowers-and-whatnots-on-the-shroud-of-turin/","cat":"news_&_views","title":"Paper Chase: Why There Are Probably No Images of Coins, Lettering, Flowers and Whatnots on the Shroud of Turin"},{"id":"comment-21816","author":"giorgio","post":"I think I already have your g mail account let me know if you received my test e mail addressed to you. Thank you.","date":"2013-01-10","mins":"2:04 am","url":"https://shroudstory.com/2013/01/06/paper-chase-why-there-are-probably-no-images-of-coins-lettering-flowers-and-whatnots-on-the-shroud-of-turin/","cat":"news_&_views","title":"Paper Chase: Why There Are Probably No Images of Coins, Lettering, Flowers and Whatnots on the Shroud of Turin"},{"id":"comment-21744","author":"giorgio","post":"Being privileged to have in my possession the actual Enrie photo Father Filas used to extract the image formation of the Lepton Coin, I’m confident with the conclusion derived by the three authors. However, I do agree with all of your concerns that paper itself seems more like branding rather than a true scientific research and their quantifying methods can definitely be manipulated. But as Andy pointed out, it’s still premature so lets wait and see..","date":"2013-01-08","mins":"1:00 pm","url":"https://shroudstory.com/2013/01/06/paper-chase-why-there-are-probably-no-images-of-coins-lettering-flowers-and-whatnots-on-the-shroud-of-turin/","cat":"news_&_views","title":"Paper Chase: Why There Are Probably No Images of Coins, Lettering, Flowers and Whatnots on the Shroud of Turin"}]
