[{"id":"comment-23880","author":"giorgio","post":"“Okay, I can spend the rest of my weekend playing pin the tail on the citation donkey or I can ask if anyone can explain what 4.9±0.5mm resolution means”. Can someone explain this for real. I was always under the assumption this data detailed a focal point that at this distance obtain the sharpest image..","date":"2013-02-09","mins":"1:17 pm","url":"https://shroudstory.com/2013/02/09/another-question-from-the-siefker-and-spicer-paper/","cat":"image_theory","title":"Another Question from the Siefker and Spicer paper"},{"id":"comment-23891","author":"giorgio","post":"@ anoxie, Correct me if I’m wrong, one use of MTF In the photographic world is to measure the resolving power of a lens to see how faithful the lens reproduces the details of the object. How then does this relate to the Shroud when we discuss the Shroud’s MTF? are we simply talking about diffraction from the body to cloth? Or are we talking about the comparison of maximum intensity to minimum intensity to each frequencies that make up the image?.","date":"2013-02-09","mins":"7:20 pm","url":"https://shroudstory.com/2013/02/09/another-question-from-the-siefker-and-spicer-paper/","cat":"image_theory","title":"Another Question from the Siefker and Spicer paper"},{"id":"comment-23922","author":"giorgio","post":"Thank you. @anoxie. I was embarrassed to admit I have the Fanti’s paper hidden on my website and reviewing it again and again I still couldn’t understand what is meant by MTF. At least I’m not alone..","date":"2013-02-10","mins":"9:52 am","url":"https://shroudstory.com/2013/02/09/another-question-from-the-siefker-and-spicer-paper/","cat":"image_theory","title":"Another Question from the Siefker and Spicer paper"},{"id":"comment-33567","author":"giorgio","post":"I believe It’s unique because of the TS image is imaged on a herringbone zigzag pattern. If the image was created on a more continuous tight uniform weave the image resolution would be sharper but the apparent edge sharpness would be lost. To me, the fact the image is on this specific weave is what makes it unique. To be honest I’m not so impressed about the 3 D visual. Since the weave and the TS image both posses AM frequencies (dots) and screen angles converging onto itself, this pattern simulates the technology I use in printing for secured documents against counterfeiting. As far as the Enrie photo, The photograph in question is very sharp. We don’t need to concern ourselves about the minuscule patterns that are captured in the print. If one observes very closely the first generation print of Enrie, you will see the area of the threads that created the “so called lepton coin”..","date":"2013-05-12","mins":"4:47 pm","url":"https://shroudstory.com/2013/05/12/dear-stephen-e-jones/","cat":"image_theory","title":"Dear Stephen E. Jones"},{"id":"comment-33631","author":"giorgio","post":"“Processing the Enrie photos with their orthochromatic film and their raking light” No issue there. The Pantone family that makes up the hues on the TS excluding the blood stains are almost linear to each other so all that is required is a small exposure compensation. And the 33 degree lighting directed at each opposite corners of the TS is the correct lighting situation for museum art. Since the print that was used only captured the face area the raking wasn’t so much the issue rather the tensity of the cloth itself when photographed. 5 successive generations of “enhancement” There’s the problem. (Resolving Power) Fr. Filas was mistaken if he thought by creating 5 generations he would reduce the banding making the coin more visible. His technique failed since it doesn’t isolate banding from the rest of the image..","date":"2013-05-13","mins":"11:32 pm","url":"https://shroudstory.com/2013/05/12/dear-stephen-e-jones/","cat":"image_theory","title":"Dear Stephen E. Jones"},{"id":"comment-131854","author":"giorgio","post":"Daveb, Start here and watch Simon Browns’ video. The link is on my home page. Http://www.holyshroudguild.org/ From there go to this link http://www.holyshroudguild.org/sister damian of the cross ocd.html There are 3 link pages to see. I also have the original VHS tape she created for the Guild about the experiment. Http://www.holyshroudguild.org/video clips.html This might be on the Simon Brown site as well..","date":"2014-06-20","mins":"6:15 pm","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","title":"Maybe a New Image Hypothesis?"},{"id":"comment-131644","author":"giorgio","post":"Thermochemical is much more plausible image mechanism than scorching. Discussing the many possibilities of image formation on the Shroud with color scientists at Eastman Kodak and on Linkedin who believe that this is man made, many concluded that lensing was a key element for the formation. This means that a source was perpendicular to the Shroud. One way to achieve this would be to add an accelerator (High alkaline substance) by applying the substance using a flue type mechanism. With the accelerator in place, a chemical reaction now can take place, creating a plate type image. The idea might have been used to mass produce cartoons. (Carpets). I’m only the messenger so don’t direct any hate mails at me. However, if Colins would like to investigate further, I would be willing to share any notes I may have if I can find them..","date":"2014-06-20","mins":"6:59 am","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","title":"Maybe a New Image Hypothesis?"},{"id":"comment-49732","author":"giorgio","post":"In my opinion, tit is the lensing affect of the image caused by the herringbone pattern we see such a distinct 3 D pattern..","date":"2013-11-03","mins":"9:49 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","title":"Maybe the 3D data doesn’t mean what we think it does"},{"id":"comment-49712","author":"giorgio","post":"What would the 3d characteristics be on the Shroud if the image were imaged on a modern day bed sheet?.","date":"2013-11-03","mins":"8:41 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","title":"Maybe the 3D data doesn’t mean what we think it does"},{"id":"comment-49721","author":"giorgio","post":"Are you saying that the herringbone weave plays an important roll in creating the 3 D affect or the heringbone pattern is considered a 3 D distortion between body and the cloth?.","date":"2013-11-03","mins":"9:25 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","title":"Maybe the 3D data doesn’t mean what we think it does"},{"id":"comment-49788","author":"giorgio","post":"Is there a difference in spatial information between a scan from an offset print to a continuous tone photograph?.","date":"2013-11-03","mins":"3:10 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-49747","author":"giorgio","post":"Convection can work if there is a receptor that isolates the theromal exchange. This is why I don’t agree with the assertion that the Shroud’s image is continuous tone or a smooth gradation of grayscale. What Enrie’s images detailed is on the contrary. It is a low resolution image that appears to have a lensing affect imaged the surface of the herringbone pattern. If I’m not mistaken, Collins successfully demonstrated a carton with 3 D characteristics which is represented with approximately 65 dpi. That is why I asked, how would the 3d characteristics appear on the Shroud if the image were imaged on a modern day bed sheet?.","date":"2013-11-03","mins":"10:46 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","title":"Maybe the 3D data doesn’t mean what we think it does"},{"id":"comment-23926","author":"giorgio","post":"Until further explained I have to agree with @anoxie.","date":"2013-02-10","mins":"11:22 am","url":"https://shroudstory.com/2013/02/10/paper-chase-mtf-resolution-4-90-5-mm-and-all-that/","cat":"image_theory","title":"Paper Chase: MTF Resolution, 4.9±0.5 mm and all that"},{"id":"comment-49881","author":"giorgio","post":"Mario, I’m sorry to say I’m a bit lost. Is the image on the Shroud itself encoded and the substrate plays no roll in the 3 D characteristics? If so, would you agree Divisionism or Pointillism will alway produce a better 3 D than compared to a continuous tone?.","date":"2013-11-04","mins":"7:50 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-49929","author":"giorgio","post":"Mario, I understand that luminosity is playing a roll in the 3 D encoding data on the Shroud. Where I’m lost is through my observation, the Enrie’s image is formed by lensing that’s because I believe is due to the image being imposed on the twill pattern. Suppose the image was imposed on smooth pattern? Would you expect as good of a 3 D affect as we see today?.","date":"2013-11-04","mins":"3:09 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-49966","author":"giorgio","post":"Bon soir, Mario. I guess I’m still lost, please be patient. Maybe the misunderstanding is steamed to the fact you may not agree with my assertion that the image is lensing during the image process because the image was imposed on a twill pattern. Because it is lensing the image resembles dot frequency that is very similar in AM printing screens. Removing the twill pattern after the fact (Fourier transform) doesn’t change the initial mechanics of the image. Allow me to rephrase my question, do you agree that the twill pattern did affect the mechanics of the image when formed?.","date":"2013-11-04","mins":"9:53 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-49975","author":"giorgio","post":"Based on this S.O.P. NASA states “The interpreter or VP 8 machine operator selects the color assignments for different densities and also determines, in part, the spatial distribution of density levels”. If you read on you will notice that prints are made from positive film that has no intragal mask so not only will the image be reversed but it will reduce the tonal range considerably. This in affect will also limit the amount of interpretation the operator has. (Excellent idea for continuity between different technicians interpitation.) Here is the excerpt from the document I found from the HSG archive. “Can we consider this as a possible working solution to landuse mapping? I believe so but with reserved optimism. First, consider the ways in which we analyze imagery. The human interpreter basically looks at tonal variations in terms of light or dark signatures to interpret black and white ERTS imagery. Tonal variations reflect densities which can be measured, sorted, and displayed by the VP 8 system. Thus, the VP 8 distinguishes between light, gray, or dark toned areas and displays mappable areas to which we assign landuse interpretation. The VP 8 can only reconstitute and sort density levels for us. We must interpret those levels in terms of landuse categories. The interpretation can only be as good as the interpreter. His subjective and objective knowledge of the area enters a bias which the VP 8 cannot override. The interpreter or VP 8 machine operator selects the color assignments for different densities and also determines, in part, the spatial distribution of density levels. He can combine density levels into a common color unit and thus obliterate detailed information. Conversely, the interpreter can display up to 8 density color slices and combinations with highly “The simplification of the imagery from hundreds of shades and tones into only a few dark tones on the light toned surface simplify the interpretation of the image. However, not all imagery should be used with the black and white negative print technique. Imagery for which subtle differences between intervening shades of gray must be interpreted is not usually suited to the technique. The technique operates best in high contrast situations. For example, the better contrasts are exhibited by light toned cultural features on dark forested backgrounds such as may be found in the humid, eastern United States and in areas where dark toned irrigated farms appear on light colored desert surfaces such as the arid western United States”..","date":"2013-11-04","mins":"11:40 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-49969","author":"giorgio","post":"Hello Thibault, on the contrary VP8 is operator dependent. Contact Deacon Peter he’s a great resource for VP 8..","date":"2013-11-04","mins":"10:19 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-49976","author":"giorgio","post":"(Excellent idea for continuity between different technicians interpretation.) Interpretation.","date":"2013-11-05","mins":"12:17 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-49717","author":"giorgio","post":"What is your interpretation why it is difficult to obtain Shroud like 3 D properties on normal photographs?.","date":"2013-11-03","mins":"9:14 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","title":"Maybe the 3D data doesn’t mean what we think it does"},{"id":"comment-49785","author":"giorgio","post":"Hi David, I don’t know if you can do it directly from the Shroud because it would produce a moiré pattern unless you reduce the optical resolving power. Capturing the Shroud on a photo inherently reduces the resolving power, which will eliminate the moiré pattern. However, I believe the photograph is a registered image in a sense that the image frequencies are in register to the convergent screen lines produced from the herringbone twill pattern. So I would conclude that the photo does accurately produces the 3 D affect that is inherent from the original source..","date":"2013-11-03","mins":"2:47 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-49967","author":"giorgio","post":"Agree.","date":"2013-11-04","mins":"10:10 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-49968","author":"giorgio","post":"Agree to #39.","date":"2013-11-04","mins":"10:11 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-50033","author":"giorgio","post":"David Mo : 3 D theory is sustained on two hypotheses. 1. Radiation or vapour there was once an orthogonal (vertical) projection from body to image. 2. Different colour intensities are produced by distance between body and cloth. 5 cm is the standard distance at which the image disappears (sindonist say). “3 D information could not have been captured by some kind of radiation that is projected onto a sheet.” That’s what I think, for reasons given above. But the 3 D information could not have been caused by some kind of contact with the shroud, because large deformations would be visible. Then we have just an alternative: Or the Shroud was manufactured with a process we don’t exactly know (paint or heating or some degradation due to time) or we are in front a miracle. About miracles you can see what I think in my blog (if you read Spanish or you have a good translator on line): Here: http://sombraenelsudario.wordpress.com/2013/01/17/milagro/ , and here http://sombraenelsudario.wordpress.com/2013/09/03/que es un milagro/ and following entries. As Rogers I’m not favourable to recourse to miracles as explanations. If miracle is done everything is possible and “scientific” explanations are irrelevant. Sindonology would be irrelevant because in front to “Dieu le veult!” reason go out. Wow, Thank you David excellent explanation. In your opinion could this be an attempted by an artist to produce a plate or historical cartoon barring of coarse this image is truly a miracle?.","date":"2013-11-05","mins":"7:28 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-50042","author":"giorgio","post":"Hugh, I like the assertion David makes and I quote, “manufactured with a process we don’t exactly know (paint or heating or some degradation due to time) or we are in front a miracle”. If the 3 D image of the Shroud is measured between body and cloth, I would conclude that the likelihood that a natural occurrence created the image without obstructions or contaminates to distort the 3 D isn’t likely. Last year I discussed with Deacon Pete, (Schumacher) how uncomfortable I was with the explanation of Jackson and other Sindonolgist claiming that the 3 D characteristics are like no other image and supports the authenticity of the Shroud. For me it was the contrary.; it supports a controlled environment that even included the substrate that the image was imposed on..","date":"2013-11-05","mins":"10:35 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-54379","author":"giorgio","post":"Good anolgy of the meaning of interpertation is let’s suppose you have a 16 bit file and your printing on an 8 bit printer. That means, 8 bits of information will be discarded. How would you make that decision which information to discard? You don’t; you rely on the printer’s profile to do that for you. The negative photographic technique employed in this case discarded much of the information so interpretation won’t vary between operators. IMHP it was a good idea..","date":"2013-12-01","mins":"1:33 pm","url":"https://shroudstory.com/2013/11/29/this-may-be-the-biggest-mystery-of-all/","cat":"image_theory","title":"This may be the biggest mystery of all?"},{"id":"comment-54297","author":"giorgio","post":"Interpretation for mapping gray levels to 8 slices that in this case defines streets, water, vegetation and so on. VP 8 measures a density, that is all. How you want to interpret it, that becomes your hypothesis. I for one do not understand how a reproduction photograph records molecular weight of diffusing molecule, autocatalytical reaction and so on that can be used for quantitative analysis. Can you explain.","date":"2013-12-01","mins":"10:44 am","url":"https://shroudstory.com/2013/11/29/this-may-be-the-biggest-mystery-of-all/","cat":"image_theory","title":"This may be the biggest mystery of all?"},{"id":"comment-54367","author":"giorgio","post":"If that is the case, the gray levels caused by the Maillard reaction or some type of acceleration from an alkaline, in all probability was done in a controlled environment. Unless there is studies about cellular structures of flax cell walls being stable enough to record perfect gray tones to measure the reaction or for that matter any such natural organic material. And if you find that, please explain how the cloth was draped over the corpse to maintain the perfect correlation of gray tones made by the reaction. Anoxie : Let´s say you’re looking to an experiment on a linen with different level of completion of maillard reaction, EDTA applied chronogically. Grey level will refer to degree of reaction completion, not to a heightmap..","date":"2013-12-01","mins":"1:20 pm","url":"https://shroudstory.com/2013/11/29/this-may-be-the-biggest-mystery-of-all/","cat":"image_theory","title":"This may be the biggest mystery of all?"},{"id":"comment-54485","author":"giorgio","post":"Personal bias we’re all guilty of I imagine. Anoxie : I didn’t think of this interpretation. You’re talking of a selection biais of the data. I was talking of how one could interpret the data according to his own subjective hypothesis (eg how STURP team determined cloth body distance).","date":"2013-12-01","mins":"4:56 pm","url":"https://shroudstory.com/2013/11/29/this-may-be-the-biggest-mystery-of-all/","cat":"image_theory","title":"This may be the biggest mystery of all?"},{"id":"comment-54381","author":"giorgio","post":"Draped or staged? That is the question! Shakespeare I believe. Then again I stimulated my brains with Mad Magazine is growing up so it might have been Alfred E. Newman..","date":"2013-12-01","mins":"1:36 pm","url":"https://shroudstory.com/2013/11/29/this-may-be-the-biggest-mystery-of-all/","cat":"image_theory","title":"This may be the biggest mystery of all?"},{"id":"comment-54504","author":"giorgio","post":"Guilty of it……… Macs!.","date":"2013-12-01","mins":"5:22 pm","url":"https://shroudstory.com/2013/11/29/this-may-be-the-biggest-mystery-of-all/","cat":"image_theory","title":"This may be the biggest mystery of all?"},{"id":"comment-54242","author":"giorgio","post":"Archive from the Guild. A new procedure utilized in Phase III was based on experiments conducted on a VP 8 Image Analyzer, a microdensity and image color enhancer maintained by the Electrical Engineering Department A negative photographic technique in image enhancement was begun early in Phase III and continued to be used effectively throughout the research period. Although details of the technique are covered on pages 30 40 in this report, the principle of the technique involved the production of negative photographic prints from color and black and white positive transparencies. Originally designed as an expedient photo printing process by this investigator in 1971, the negative print technique was applied to the ERTS imagery for image enhancement. With the negative print technique applied to band 5, cultural landscapes in terms of urban and suburban areas, shopping centers, highway construction sites, strip mines, and agricultural areas were enhanced in dark tones against a light background. On band 7 negative prints, water and topographic surfaces were enhanced in light tones and light shaded enhancements on dark surfaces displayed as tone reversals in the negative prints (see Figure 4). The mapping of photomorphic regions and examples of landscape change occupied the majority of the Phase III activities. Can we consider this as a possible working solution to landuse mapping? I believe so but with reserved optimism. First, consider the ways in which we analyze imagery. The human interpreter basically looks at tonal variations in terms of light or dark signatures to interpret black and white ERTS imagery. Tonal variations reflect densities which can be measured, sorted, and displayed by the VP 8 system. Thus, the VP 8 distinguishes between light, gray, or dark toned areas and displays mappable areas to which we assign landuse interpretation. The VP 8 can only reconstitute and sort density levels for us. We must interpret those levels in terms of landuse categories. The interpretation can only be as good as the interpreter. His subjective and objective knowledge of the area enters a bias which the VP 8 cannot override. The interpreter or VP 8 machine operator selects the color assignments for different densities and also determines, in part, the spatial distribution of density levels. He can combine density levels into a common color unit and thus obliterate detailed information. Conversely, the interpreter can display up to 8 density color slices and combinations with highly detailed definition. It is this kind of subjectivity in the choice of density combinations which alarms some investigators. No single interpreter, interpretation system, or for that matter data gathering device, or sensor can possibly meet the needs of every investigation. The VP 8 must be used with caution with the understanding that it produces color coded densities which the interpreter must choose to display. Giorgio I like to add that the negative print Technique allows less deviation between operators because you’re basically producing a high contrast image with limited gray scales. Another limitation can be the aperture of the microdensitometer used to gather the sampling. In this program above, a 25 microdensitometer was used. 10 micros is the minimum for Stochastic reproduction. However based on the negative print technique that proably would not be condusive to the VP 8 system..","date":"2013-11-30","mins":"10:23 pm","url":"https://shroudstory.com/2013/11/29/this-may-be-the-biggest-mystery-of-all/","cat":"image_theory","title":"This may be the biggest mystery of all?"},{"id":"comment-30983","author":"giorgio","post":"The fact that you can obtain the coin’s image on both, Enrie’s and Vern Miller photos, tells me more about the tensile strength and the elasticity of the linen characteristics than how the image was manipulated to create the coin’s relief. Mario what is your opinion about the validity of the coin’s existence on the Shroud?.","date":"2013-04-16","mins":"3:34 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","title":"The Making of the HD Image for the Shroud 2.0 App"},{"id":"comment-31016","author":"giorgio","post":"3. They used certain criteria to eliminate pareidolia effects. For example, the letters must have been at least 1 cm large (which eliminated alleged Hebrew letters, and coin inscriptions, which are smaller), they must be present in groups of at least two, similar size, similar intervals between them, positioned in straight lines, and so on. So the probability that they are photographic artifacts, wevae imperfections or similar effects is small. Would we all agree that the pareidolia theory shouldn’t be applied to Father Filas’ method since the coin’s relief wasn’t visible until he created several generations of the first generation print of the 1931 Enrie print? Without the new generation of prints reducing the resolving power each time, we wouldn’t have a relief in the first place..","date":"2013-04-16","mins":"11:02 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","title":"The Making of the HD Image for the Shroud 2.0 App"},{"id":"comment-31086","author":"giorgio","post":"Yes, your statement is true about interpretation of the relief via pareidolia but if one states that pareidolia is the reason we have to except the possibility of the coin’s existence based on Fr. Filas’ work, that can be very problematic to many. His whole hypothesis was based on the interpretation of what Jackson, Stevenson, and Eric Jumber’s paper (Forgot the title) in 1978 detailing the possible existence of an object over the eye. The paper further states the removal of artifacts and noise would be needed to further advance their studies. So far, so good. However, Father Filas’ reproduction method to expedite the study using an analog approach, can be explained to a degree of almost certainty where he went wrong with his methodology and interpretation. The reason maybe a hard to sell to some Sindonolgist but to Eastman Kodak, they have my back on this one..","date":"2013-04-17","mins":"1:24 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","title":"The Making of the HD Image for the Shroud 2.0 App"}]
