[{"id":"comment-29479","author":"giorgio","post":"I am convinced Guilo’s paper will be reviewed and accepted. But why do we place such importance on peer review papers. Here in Dr. Gove’s hometown, Rochester NY, The University of Rochester and Strong hospital relies on peer review papers for grants. Without such economic distribution of funds to our largest employer, where do you think Rochester NY would be today if we still relied on Kodak, Xerox and Bausch and Lomb?.","date":"2013-04-05","mins":"8:31 am","url":"https://shroudstory.com/2013/04/05/a-committee-far-removed-from-padua/","cat":"news_&_views","title":"A Committee Far Removed from Padua"},{"id":"comment-34126","author":"giorgio","post":"I never really spent much time on the process of the quad mosaic and what does it mean. If I’m not mistaken it was panchromatic film exposed with primary colors, R.G.B. The image itself is very warm so I’m assuming that the three different exposures were not gray balanced to each other. ( there might be a reason for that) I believed I used a 7 step gray wedge when I made separations for proper exposure of each of the primary colors. (It’s been a very long time). For me, looking at the final color transparency of the quad image, I’m not sure what you can determine from the results, especially chemically. Strictly talking about the film characteristics, I can conclude the panchromatic film for each exposure is experiencing exposure deficiency from obstruction during the back lighting when photographing the TS. All I can conclude is the reproduction of the final image on the transparency demonstrates color crossovers..","date":"2013-05-20","mins":"11:21 am","url":"https://shroudstory.com/2013/05/18/because-it-needed-to-be-said-contaminated-in-the-weavers-workshop/","cat":"uncategorized","title":"Because it Needed to be Said: Contaminated in the Weaver’s Workshop"},{"id":"comment-51069","author":"giorgio","post":"Fr. Rinaldi was one of a kind. So instrumental in making it possible for the 1978 study..","date":"2013-11-13","mins":"7:06 am","url":"https://shroudstory.com/2013/11/13/catching-up-on-my-reading/","cat":"news_&_views","title":"Catching Up on My Reading"},{"id":"comment-29501","author":"giorgio","post":"Well said “Jesterof”..","date":"2013-04-05","mins":"11:38 am","url":"https://shroudstory.com/2013/04/05/a-committee-far-removed-from-padua/","cat":"news_&_views","title":"A Committee Far Removed from Padua"},{"id":"comment-34159","author":"giorgio","post":"Thank you Joe. I also have Mc Crone’s slides that Paul mentioned in his presentation at the 2008 Ohio conference. On the slide mounts and letters Mc Crone sent to Fr. Otterbein, Mc Crone mentions many more slides than the 3 AB and the 3 CB that contains iron oxide an inorganic substance. Nitowski has photographed and archived over 500 slides and has indicated many more area’s that contained iron oxide. If you recall Kohlbeck analyzed sticky tape 6 BF which is the front area of the spear wound where he made his observation and refuted Dr. Mc Crone’s claim that the blood was Iron oxide. I still think the major problem has been the nomenclature in the TS research defining what is present on these sticky tape. The term “The yellow amorphous tubular flaked like material resin” means what? Iron oxide, Myrrh, starch, biocoating, or blood? Below is an excerpt of http://holyshroudguild.org/dr raes problematic threads 3.html Joe if you can elaborate further please do. “A wonderful observation occurred on the day that Dr. Kohlbeck reexamine the sticky tapes. Because of Dr. Kohlbeck observation after 3 months in Cargille oil, he deemed the red particles that Dr. Mc Crone claimed as Iron Oxide was in fact an organic substance and presumed it was blood based on Dr. Heller’s findings. Dr. Kohlbeck did tell Dr. Mc Crone about his observation. Sadly, Dr. Mc Crone never did mentioned that in his book “Judgement day of the Turin Shroud”, published in 1997. Dr. Mc Crone had 15 years to refute Dr. Kohlbeck’s finding but undoubtedly didn’t. Why? I had the pleasure speaking with Dr. Kohlbeck on August 26th 2011. I contacted him so I could ask him if he had any knowledge of the Raes thread. He explained to me that he had no knowledge of Dr. Nitowski’s claim that the thread was switched. We then began to discuss the red particles. Dr. Kohlbeck explained to me that Sue Benford contacted him and requested if he could send her his microscopic photographs of the lance wound area where Dr. Kohlbeck made his observation. (6 BF). She explained to him that she believes what Dr. Heller thought was blood is actually the gum,dye,mordant coating which Dr. Kohlbeck simply referred in his findings as Starch. Sue Bedford continued to explain the invisible weave theory to Dr. Kohlbeck which he found to be very fascinating. Sue Bedford’s explanation was very plausible to him and would easily concede that the theory that it was blood was wrong”..","date":"2013-05-20","mins":"11:54 pm","url":"https://shroudstory.com/2013/05/18/because-it-needed-to-be-said-contaminated-in-the-weavers-workshop/","cat":"uncategorized","title":"Because it Needed to be Said: Contaminated in the Weaver’s Workshop"},{"id":"comment-34206","author":"giorgio","post":"What you stated is very plausible as well as Sue Benford’s hypothesis that the “blood” (Kohlbeck), “Iron Oxide” (Mc Crone) is actually the gum,dye,mordant coating. Iron Oxide is found everywhere until you add a few drops of Cargille oil and let it sit for three months. Keep in mind, Paul had to answer to the critics of Dr. Ray Rogers paper notably, Steven Schafersman. Steve is correct to point out that Mc Crone was the first to mention madder root. Until we clarify each researcher’s interpretation of Dr. Ray Rogers sticky tape everything becomes speculative. Now for the most important question to my buddy up north, What the heck happened to the Islanders?.","date":"2013-05-21","mins":"9:39 am","url":"https://shroudstory.com/2013/05/18/because-it-needed-to-be-said-contaminated-in-the-weavers-workshop/","cat":"uncategorized","title":"Because it Needed to be Said: Contaminated in the Weaver’s Workshop"},{"id":"comment-50551","author":"giorgio","post":"“As I understand it, the STURP teams did not have a single member with experience of examining ancient textiles and how to take samples from them in a non invasive way”. Gove reminded Robert Dinegar of the above statement and nasty exchanges between the two commenced. Keep in mind Gove is also “dissed about his experince in 1978 since he felt he was kept out of the project. At this point, it wasn’t tough for Gove to side with the Pontifical Academy and add fuel to the reason to keep STURP out..","date":"2013-11-09","mins":"9:24 am","url":"https://shroudstory.com/2013/11/08/cementing-over-central-park/","cat":"news_&_views","title":"Cementing Over Central Park"},{"id":"comment-50512","author":"giorgio","post":"“It was hidden in a monastery under the altar and when the Nazi’s came to monastery to search they found the monks praying around the altar and did not disturb them. They left emptied handed perhaps feeling it was a wild goose chase”. The Story of Montevergine. By the way John, why no mention of Prof Carlos Chagas for STRUPS demise? Instead you insist it was Dr. Gove who posioned the well for STRUP. The Pontifical Academy was one of the major force of STRUP’S demise. The Pontifcal Academy felt “dissed” during the 1978 examination. Collectivly, the real underlying issue was that it was an Italian relic and preservation of the Shroud was the most important priority for the Church, more so then the testing. And this time, the Pontifical Academy was going to make sure they have their say..","date":"2013-11-09","mins":"1:45 am","url":"https://shroudstory.com/2013/11/08/cementing-over-central-park/","cat":"news_&_views","title":"Cementing Over Central Park"},{"id":"comment-46247","author":"giorgio","post":"You’re missing http://www.facebook.com/groups/61488680305/ Amici della Sindone Hosted by Emanuela Marinelli and her assistant Veronica Triulzi..","date":"2013-10-05","mins":"3:00 pm","url":"https://shroudstory.com/2013/10/05/facebook-and-the-shroud-of-turin/","cat":"news_&_views","title":"Facebook and the Shroud of Turin (Updated)"},{"id":"comment-47223","author":"giorgio","post":"Birra Peroni! Paga te sig. Collins? When it comes to alcoholic beverages that’s sure to get a response from me everytime..","date":"2013-10-12","mins":"10:43 am","url":"https://shroudstory.com/2013/10/12/comment-exchange-of-the-day-yesterday/","cat":"news_&_views","title":"Comment Exchange of the Day Yesterday"}]
