[{"id":"comment-48168","author":"giorgio","post":"I can’t imagin what bleaching has to do with the banding. The Herringbone weave pattern which is reproduced as a screened line in contrast with the image which is represented by dots, I believe is what causes the banding effect. As diverging screen lines alter in opposing angles banding will occur. And adding to the mix, a superimposed image imprinted on the linen that is represented by dots, banding becomes more obvious. Here is a basic explanation I found on line. In commercial printing, continuous tone is simulated by dots (called halftone dots) printed in rows (called lines or line screens). Lines are printed at different angles to make the rows less noticeable. This explanation is also the basis for security printers to stop forgeries from using copiers to reproduce images simply by adding line frequencies with dot frequencies..","date":"2013-10-20","mins":"7:01 pm","url":"https://shroudstory.com/2013/10/19/todays-how-do-we-know-banding-patterns-and-what-they-might-mean/","cat":"uncategorized","title":"Today’s How do we know?  Banding patterns and what they might mean?"},{"id":"comment-48209","author":"giorgio","post":"If fluorescencing was the cause that was made from individual threads bleached, sewn together that resulted in such a uniform pattern, that in itself is a mystery. I like your “Urban Myth” analogy..","date":"2013-10-21","mins":"6:56 am","url":"https://shroudstory.com/2013/10/19/todays-how-do-we-know-banding-patterns-and-what-they-might-mean/","cat":"uncategorized","title":"Today’s How do we know?  Banding patterns and what they might mean?"},{"id":"comment-48247","author":"giorgio","post":"I assume this image has already gone through the Fourier transform filters. The key function of the Fourier transform filters is to manipulate specific frequencies. Using this method to conclude chemical analysis to me is very confusing. I would think using a spectrometer would be a better tool. The uniformity of the banding is throughout the shroud. Let me clarify what I mean by uniformity. Today, paper mills adds whiteners to brighten the paper’s white. Printing over these inexpensive papers causes havoc. Because opaque inks such as spot colors printed on these papers does cause the ink to fluoresce, viewing in different color temperatures these inks will shift hues accordingly to the light source because of the chemical make up of the ink. However having said that, because of the different frequencies and angles that the spot color inks are laid down on the paper, fluorescing becomes very erratic. For this reason I would expect the Shroud’s variegated markings to have sharp breaks and erratic pattern shapes not uniform or smooth transitions where strips go up and down throughout the shroud. We also have to expect that contaminates have been introduced throughout the Shroud’s history which should caused more erratic patterns. This is why I believe the banding is caused by the linen’s converging screen angles and frequencies. And using the Fourier transform filter is a tool to filter unwanted screen frequencies and should not be used to reach a chemical analyze conclusion. Keep in mind, I’m not saying that bleach was not used on the linen. I have no clue. All I’m saying is Fourier transform filters prints can’t tell you that bleach was used..","date":"2013-10-21","mins":"10:36 am","url":"https://shroudstory.com/2013/10/19/todays-how-do-we-know-banding-patterns-and-what-they-might-mean/","cat":"uncategorized","title":"Today’s How do we know?  Banding patterns and what they might mean?"}]
