[{"id":"comment-175740","author":"nabber","post":"Dan: Yeah, Yeah, Yeah…...","date":"2014-12-11","mins":"3:09 pm","url":"https://shroudstory.com/2014/12/11/because-maybe-you-wanted-to-know-but-probably-didnt/","cat":"art","title":"Because maybe you wanted to know but probably didn’t"},{"id":"comment-132540","author":"nabber","post":"I find it incredible that skeptics can deny that the 4 holes in an L shape is not a conclusive proof. The probability that this is a definite link is staggeringly high. A skeptic is required to show other artwork of the Middle Ages with such a pattern was common, or at least beyond one coincidence. Also, to deny that the artist’s design was to simulate the herringbone weave is an insult to the intelligence of the vast majority of Shroud aficionados. Repeating over and over that “it is not a herringbone pattern” is not an effective counter..","date":"2014-06-23","mins":"1:00 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132565","author":"nabber","post":"Freeman’s Oculi: None of your examples pertain. The first example had 3 circles in a row; the second had 4 circles in a square; the third example had numerous holes but none in the shape of 4 in an “L” (nor any “L”), and the last had numerous holes in a large circle. And none of those had anything to do with a tomb. Constantine and the tomb: again, 3 holes; in fact 3 LARGE holes. Again, 4 holes in an L shape is so unique in HPM that it defies normal probability, and yes, they are in the middle of a herringbone weave. The artist didn’t need a magnification of the cloth to see enough detail to make a rough imitation of the weave..","date":"2014-06-23","mins":"4:39 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-205172","author":"nabber","post":"IMO, Max’s comment is meaningless re: the placement. The Epsilon shape is clear, and is too specific a match to be anything else but an attempt at being as accurate as possible, to resemble the Shroud..","date":"2015-07-10","mins":"4:36 pm","url":"https://shroudstory.com/2015/07/10/dirk-bouts-the-entombment/","cat":"art","title":"Dirk Bouts’ The Entombment"},{"id":"comment-134534","author":"nabber","post":"Thanks to Hugh. I’ll just comment on the one, the lintel over the south portal of west facade of Saint Gilles at Arles: 3 holes in the side of the tomb, not 4, no “L”, and certainly not in the Shroud, which is shown hanging out of the tomb. Seems like the 3 holes would have come from the Constantine 3 holed tomb..","date":"2014-06-30","mins":"3:37 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134535","author":"nabber","post":"Ditto the Mont San Angelo, same 3 holes, and as a side comment, these are 3 huge holes a la Constantine and not small “poker” holes (4) as in HPM..","date":"2014-06-30","mins":"3:41 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134720","author":"nabber","post":"O.K.: I will confirm your point. Not only have you pointed out the bench in green lines, but the “third” line that you did not highlight in green is actually the dividing line between the bench with plain background, and the Shroud with wavy (herringbone) background..","date":"2014-07-01","mins":"1:35 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134717","author":"nabber","post":"Louis: “The burial cloth only got passing mention in the gospel and that was because the risen Christ was more important.” Disagree, partly. The fact that made some Disciples believe in the Resurrection, before they met the Risen Christ, was specifically the Empty Shroud, not the Empty Tomb. The “Empty Tomb” was really just a generic description of the scene (IMHO). I would not say the Shroud got “passing mention” — it was mentioned in all 4 Gospels, with details of it provided. That said, the Shroud was then kept secret because Jews were not supposed to make or keep images, nor were they supposed to have bloody items associated with death..","date":"2014-07-01","mins":"1:27 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134867","author":"nabber","post":"David: “And I remember [sic] you that there is not any L shape in the Pray Codex.” Incredible. Absolutely incredible. For O.K.: this is the kind of skeptic that gives skeptics a bad name. You should disregard this guy completely..","date":"2014-07-02","mins":"8:59 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134987","author":"nabber","post":"David: “And I remind you that there is not any L shape in the Pray Codex. There is a pair of L+P. It is a significant difference. Now you get it or not yet?” That, my friend, is ridiculous. This whole matter must be challenging your World View to the max, for you to put up such a silly objection..","date":"2014-07-02","mins":"10:22 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135084","author":"nabber","post":"Daveb: “The fallacious assumption is that the image was visible soon after the resurrection. Even assuming authenticity it is still not known how long the image took to form.” I would like to add to that, dave. Even if the image was formed immediately, it may simply have not been seen because it was on the inside of the Shroud. The Apostle who collected the Shroud (Peter?) went over to the Shroud (the image not visible, being on the INSIDE of it), rolled it up, and probably soon put it in a box, leather pouch, etc. How can you determine when somebody unrolled it and looked at the inside of the Shroud, to see an image? You can’t. To add to that, the “insiders” (the new Christians), were almost all Jews and would have been reluctant to handle a bloody object related to death, and reluctant to handle something related to the Divine. If anybody saw the Shroud at all, it was probably when Peter (or the next Custodian) opened the box and said, “See?”. Then closed it right back up. IMHO..","date":"2014-07-03","mins":"8:50 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-136770","author":"nabber","post":"The DELIBERATELY stilted language is a dead give away that this David Mo is playing games: “This is why the aspiration to deduce imitative effects only on the basis of isolated features is doomed to failure.” Seriously? I would bet dollars to donuts that sentence is a cut and paste..","date":"2014-07-10","mins":"9:01 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192301","author":"nabber","post":"Tomb lid? If it’s a tomb lid, why is the tomb (to the right) not shown empty? Shouldn’t the area with the red crosses instead be black and show an empty tomb? It isn’t. Therefore, No tomb lid..","date":"2015-03-03","mins":"2:49 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192302","author":"nabber","post":"CF: “The basic point has always been that the Shroud shows extensive bloodstains and scourge marks. Anyone who had seen it would have shown something of these on the body of Christ” “I don’t think it’s any surprise that Jesus’ body and the sheet lack the wounds of the nails, of the scourging and of the spear. It’s clear the artist reported, in a stylized way, the details that had impressed him; nor can we expect that he, while portraying the risen Christ, would continue portraying Him with thumbs bent.” (E. Marinelli).","date":"2015-03-03","mins":"2:58 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192399","author":"nabber","post":"Charles, you forgot “The rest of us see paint where there is none.”.","date":"2015-03-04","mins":"12:24 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192306","author":"nabber","post":"No, Skeppie, your argument makes no sense, and if you had given it much thought, you would realize this: If the area with the red crosses is the “wall of the sarcophagus” as seen from the side, then your fanciful “tomb lid” would be hanging magically on the side of the sarcophagus with no support. The right side of your “tomb lid” would then be off the ground and have no support. WHETHER ONE THINKS IT IS THE SHROUD OR A TOMB LID, NEITHER CAN BE ON THE SIDE OF A SARCOPHAGUS, SUSPENDED BY NOTHING. THEREFORE IT IS A CLOSED SARCOPHAGUS, MEANING THE TOP OF THE SARCOPHAGUS HAS RED CROSSES. THEREFORE THE OBJECT TO THE LEFT IS THE SHROUD. Q.E.D..","date":"2015-03-03","mins":"3:13 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192309","author":"nabber","post":"Wrong again, skeppie…I’ve looked at all your scenes, and in each and every case the tomb lids are propped up by either the ground and a column, or the ground and an angel, or the like. Every time. And, “strangely”, every one of your tomb lids depicted has no design. (yeah, a look of granite or marble doesn’t count, don’t bother….). Evidently in the Pray Illustration, a “tomb lid” with a design = a shroud. Talk about lacking…..","date":"2015-03-03","mins":"3:50 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192312","author":"nabber","post":"Well, no, skeppie. The other tomb lids in your linked scenes ARE INDEED propped up on either end by either ground or angel or column or top of the sarcophagus, but your imagined Pray “tomb lid” is propped up by nothing, and even saying that one end is on the ground would be a kindness. Evidently your “side of the sarcophagus” is able to be a “magnet” for your “tomb lid,” and hold it fast. And oh BTW, your tomb lids have no designs, unlike the Pray shroud, which clearly has a herringbone design…...","date":"2015-03-03","mins":"4:22 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192319","author":"nabber","post":"Actually you could try all day and prop up the other end of a heavy tomb lid on the side of a sarcophagus, but I know from Physics that it wouldn’t stay there. Evidently you have not tried this experiment, and lack some basic science knowledge. And further, NONE of your linked pictures of tomb lids have designs. Thus, the Pray herringbone shroud of 1192, among other clues you cannot absorb, shows that the Pray Codex Illustrator had either seen or been told first hand about the Shroud of Constantinople,a delegation having visited there in 1150. All in all, the connection puts the lie to the carbon dating of 1260 1390..","date":"2015-03-03","mins":"5:03 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192336","author":"nabber","post":"It’s OK, homes, you’ve been schooled more than once here today, esp. Well so by daveb below. None of your examples of tomb lids had designs, so if you don’t want to appear to be continuing to lie about it, you’d better proffer up some more lids, some that have designs. And as daveb states, “The sides of the rectangle are not straight as one would expect a tomb lid to be, nor are they symmetrical about their centre line. It would be the only tomb lid ever drawn with four poker holes drilled in it in the shape of an L.” BTW, you still haven’t answered how your “tomb lid” right side is suspended magically in the air, up against the “side of the sarcophagus”. Nice try, though. All the available facts say: The Shroud. Live with it. I’m sure there are some nice skeptic sites somewhere where you could survive quite nicely..","date":"2015-03-03","mins":"10:09 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192377","author":"nabber","post":"“There’s at least one case of a purely geometrical design.” So then, two cases? Link? Representation of granite or marble texture is far, far different than herringbone design, and you know it. Since the comparison with medieval illustrations leaves almost no supporting evidence that this is a “tomb lid”, it leaves no doubt this is a shroud. So Sorry for you..","date":"2015-03-04","mins":"8:28 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192406","author":"nabber","post":"Idiotic. Representation of granite would be an attempt to show how a natural object looks. OTOH, showing the herringbone design of the shroud is an attempt to show how man makes a design out of the creative mind–that is in fact why we call it a design, and not a “natural feature.” Therefore, granite is not a design. We know from the comparison with medieval illustrations that the Pray Codex is very, very unlikely to show a tomb lid. Such tomb lids have no design other than natural granite or marble — and yet the Pray Codex shroud clearly shows a design from the human mind. Only your misled mind could think that a shroud could not change shape. Do you think that the crumpled Shroud that St.Peter found in the tomb was the same shape as the way the Shroud is stored today? You’re right, though, your case is surely closed..","date":"2015-03-04","mins":"12:44 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192549","author":"nabber","post":"““designs” being completely irrelevant to the issue” : That’s funny, Skeppy. The Pray shroud has a design, you know, like cloths do. Your tomb lids don’t — geometrical designs? Ha. Post the picture here and let’s let everyone decide. If there were one, though, it would be a sample set of one, because the rest of your cited tomb lids have nothing of the sort. And as O.K. Pointed out, your “tomb lid” does not have a matching scheme to the sarcophagus. Meanwhile, explain how your magical “tomb lid” in the P.C. Sticks to the side of a vertical side of a sarcophagus. Overall, I can’t believe you’ve ever taken and/or passed a Logic course..","date":"2015-03-05","mins":"3:02 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192407","author":"nabber","post":"Wow….What a scathing response. Awesome..","date":"2015-03-04","mins":"12:47 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192413","author":"nabber","post":"To David G: although you say “The case for authenticity does not rely on the Codex”, I would just respond that the accumulation of clues from the Pray Codex Shroud/Jesus illustration imply an older date (1150 to 1192) for the Shroud of Constantinople than does the flawed carbon dating, at the very least delivering a technical knock out (TKO) for any 14th century hypothesis; this, in turn, opens the door for a host of other clues such as the vanillin residue, among others..","date":"2015-03-04","mins":"1:28 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192554","author":"nabber","post":"OK, O.K…….. ; ^ }.","date":"2015-03-05","mins":"3:18 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192565","author":"nabber","post":"“Sounds” American to me. It was peculiar to me that he should try to call texture “a design”, though..","date":"2015-03-05","mins":"6:16 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192649","author":"nabber","post":"Do tell…..","date":"2015-03-06","mins":"3:02 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192639","author":"nabber","post":"Skeppy: as Yogi said, “It ain’t over ’til it’s over”. Most of your claims are far, far from proven. Your Admiral Akbar reference finally betrayed you as a 20 something/30 something frustrated atheist, who acts like a teenager..","date":"2015-03-06","mins":"1:44 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-193087","author":"nabber","post":"A skeptic is a person who questions all beliefs but his own…..","date":"2015-03-10","mins":"8:46 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192669","author":"nabber","post":"[deleted].","date":"2015-03-06","mins":"7:38 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-193118","author":"nabber","post":"…and you would be wrong, JG. Believers in Shroud authenticity do not question the essential truths to be found in Jesus’ Life, Crucifixion, and Resurrection — regardless of the existence of an authentic or nonauthentic Shroud. Something which you and your ilk cannot aspire to..","date":"2015-03-11","mins":"8:02 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-193119","author":"nabber","post":"…and, authenticists certainly question and ponder all the points made on this blog..","date":"2015-03-11","mins":"8:05 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-198467","author":"nabber","post":"I like the Downing “Face”, but I still prefer the 1935 Ariel Agemian “Face”…..","date":"2015-05-06","mins":"7:51 am","url":"https://shroudstory.com/2015/05/05/ray-downing-writes/","cat":"art","title":"Ray Downing Writes"}]
