[{"id":"comment-200511","author":"nabber","post":"Hugh: “Belief in the resurrection is irrelevant to the Shroud.” Let me fix that for you: “I, Hugh, believe that Belief in the resurrection is irrelevant to the Shroud, but I could be wrong.”.","date":"2015-05-29","mins":"7:16 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","title":"Colin Berry is not Seeing Red"},{"id":"comment-200510","author":"nabber","post":"1 Corinthians 15: “And that he was buried, and that he rose again the third day, according to the scriptures: [5] And that he was seen by Cephas; and after that by the eleven. [6] Then he was seen by more than five hundred brethren at once: of whom many remain until this present… [7] After that, he was seen by James, then by all the apostles. . [12] Now if Christ be preached, that he arose again from the dead, how do some among you say, that there is no resurrection of the dead? [13] But if there be no resurrection of the dead, then Christ is not risen again. [14] And if Christ be not risen again, then is our preaching vain, and your faith is also vain..","date":"2015-05-29","mins":"7:12 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","title":"Colin Berry is not Seeing Red"},{"id":"comment-200335","author":"nabber","post":"I felt that Colin’s inserted picture of Kim Kardashian (a few weeks back) was too red, but perhaps he used MS Office Picture Manager…...","date":"2015-05-27","mins":"7:22 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","title":"Colin Berry is not Seeing Red"},{"id":"comment-208858","author":"nabber","post":"Statement #1: “…assume that “The Man of the Shroud” was not dead, but was merely unconscious; that is, that he did not die as a result of his ordeal; ….the only blood stains on the Shroud are pre mortem blood stains.” Question #1: Why exactly would they drape with a shroud, a man near death that they were trying to keep alive? Counter intuitive and very counter productive. Statement #2: “a new study has concluded that oils were on the Shroud … contrary to what was concluded by STURP. And those oils were burned off in 1532, at the fire, which is why STURP found no oil residue.” Question #2: ALL OF THE OILS were burned off in the Fire of 1832? Impossible, or maybe just extremely unlikely. Statement #3: “a couple of the scientists were wearing crucifixes.” Question #3: How could a couple of scientists wearing crucifixes have swayed a group of 33 independent scientists/technicians? There were atheists and agnostics in the mix. Just for starters…..","date":"2015-08-24","mins":"7:25 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-175237","author":"nabber","post":"Berry said: “the TS body image was (as I have proposed here a number of times) skilfully engineered as a ‘Veil of Veronica’ like sweat imprint.” Again, what sources are you quoting who ever observed the Veil of Veronica as a “sweat imprint”? The only person who has seen (close up) what the Vatican says is the Veronica was Jesuit art historian Joseph Wilpert who saw only “a square piece of light coloured material, somewhat faded through age, which bear two faint rust brown stains, connected one to the other”. (Nothing about looking like a sweat imprint). Further, all of the probable copies and all of the suspected copies of the Veronica from the Middle Ages (from all over Europe) attempted to portray a full color face, not a sweat imprint. You can see them on line. No one attempted to portray, in their copy, a “sweat imprint.” Therefore, NO ONE would have attempted to “engineer” a TS body image as a “sweat imprint”. Is there a burial shroud anywhere in Europe that would have inspired a hoaxer to try such a scheme, and have other people (who had also not seen such a thing) believe it?.","date":"2014-12-08","mins":"12:03 pm","url":"https://shroudstory.com/2014/12/08/yannick-clment-on-paul-maloneys-st-louis-paper/","cat":"blood_studies","title":"Yannick Clément on Paul Maloney’s St. Louis paper"},{"id":"comment-175390","author":"nabber","post":"CB: 1.You have cited no other sweat prints during medieval times–do so or abandon your Veronica and TS as sweat prints theories. 2. You have cited no one who ever described the Veronica as a sweat print (except you). 3. You have described a magical concept in which medieval artists (and oh by the way, ALL of them) turned a sweat print into a painting rather than what really happened, simply turned a painting into a copy of a painting..","date":"2014-12-09","mins":"12:51 pm","url":"https://shroudstory.com/2014/12/08/yannick-clment-on-paul-maloneys-st-louis-paper/","cat":"blood_studies","title":"Yannick Clément on Paul Maloney’s St. Louis paper"},{"id":"comment-175391","author":"nabber","post":"P.s., Colin, you’re not helping your case but responding like a pompous ***.","date":"2014-12-09","mins":"12:54 pm","url":"https://shroudstory.com/2014/12/08/yannick-clment-on-paul-maloneys-st-louis-paper/","cat":"blood_studies","title":"Yannick Clément on Paul Maloney’s St. Louis paper"},{"id":"comment-175402","author":"nabber","post":"I was looking for articles about the discoveries of Thomas Loy. Let me search again and get back to you. It was first mentioned by Kelly Kearse, who had seen it in Ian Wilson’s writings..","date":"2014-12-09","mins":"2:55 pm","url":"https://shroudstory.com/2014/12/08/yannick-clment-on-paul-maloneys-st-louis-paper/","cat":"blood_studies","title":"Yannick Clément on Paul Maloney’s St. Louis paper"},{"id":"comment-175408","author":"nabber","post":"Loy et al. (1990) reported on material found at rock art site DMP6 from Laurie Creek, Northern Territory, Australia. The material was described as a brown red “pigment” that had naturally exfoliated from a rock shelter. The material was dissolved in water and applied to an Ames Hemastix test strip and gave a positive reaction for the presence of blood. The solution was then subjected to a dot blot test using SP A and produced a positive identification for Ig G. The substance was then examined with a sandwich ELISA test. The first antibody was supposed to bind primate serum albumin in the residue; the second antibody was monoclonal for human serum albumin. The test was positive for human blood. The AMS radiocarbon date on the material was 20,300 yrs +3100yrs 2300yrs B.P. Loy (who died in 2005) found lots of Red Blood Cells on lots of artifacts — the problem we are talking about, though, is whether the observed color was red, or brown/black, of any of the discovered Red Blood Cells. I couldn’t find any more of the “observed red”. Source: A Consumer’s Guide to Archaeological Science, 2011.","date":"2014-12-09","mins":"4:19 pm","url":"https://shroudstory.com/2014/12/08/yannick-clment-on-paul-maloneys-st-louis-paper/","cat":"blood_studies","title":"Yannick Clément on Paul Maloney’s St. Louis paper"}]
