[{"id":"comment-173893","author":"nabber","post":"Hugh says: “which is disputed by the a very large proportion of shroud scholars”. Could you cease tossing out these general statements in a flippant attempt to discount legitimate studies? NUMBER ONE: What is the size of group, “the Shroud scholars”? 100? 200?. NUMBER TWO: What does the term “VERY LARGE proportion” mean, and how did you come up with that amount? 30% ? 60% ?. NUMBER THREE: What does “disputed” mean? “disagree with, but have performed no studies to the contrary” or “disagree with because they are anti authenticists”?.","date":"2014-11-30","mins":"5:00 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"id":"comment-174321","author":"nabber","post":"Let’s see, so that would be 70% of “no idea”, which I’m pretty certain equals to ZERO. I respect Mr. Porter and Mr. Schwortz immensely (“both have surely studied the matter in considerable detail” — and you know this is true to what degree?) , I don’t know that they have performed direct counter studies to Prof. Danin’s investigations, but I have heard a lot of tossing out of simple comments about “Pareidolia”. That’s not an effective counter. And, BTW, you have done it again, “even committed authenticists find…hard to swallow”, which is obviously an attempt to generalize. OF COURSE SOME authenticists find it hard to swallow. Far more, I believe, have signed on to it. Red Herring Alert: There is some conflict with Danin and Frei, and why wouldn’t there be some, but that cannot possibly affect whether there are images on the photos..","date":"2014-12-02","mins":"1:07 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"id":"comment-174464","author":"nabber","post":"Where’s your logic, Hugh. This blog represents hundreds of scholars? It probably represents anti authenticists unfairly, if anything. Straw man much? “Hundreds of flowers” an easy target. How about “a lot of flowers”. And yes, the Farey Red Herring still lives despite denials. Danin’s views of flowers don’t depend on exact matching of locations with pollen, in fact just the existence of both in ANY location is significant enough. Where are the opposition studies? They are almost all Pareidolia type comments. Your article referenced above is so heavily tilted by what you DON’T ADMIT, as to be useless..","date":"2014-12-03","mins":"9:05 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"id":"comment-193120","author":"nabber","post":"CF: “The flax with which the Shroud was woven was spun in a place where cotton was also being spun (we know that this happened).” No, you don’t know this happened at the place where the Shroud was woven. Source, please, Mr. F..","date":"2015-03-11","mins":"8:10 am","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-185793","author":"nabber","post":"“It takes considerable imagination to see the shroud in the pray codex.” PHPL It takes considerable imagination to see PHPL comments as anything but cynical and jumping on a (very small) bandwagon. You’re considerably outnumbered by keen observers..","date":"2015-01-23","mins":"4:23 pm","url":"https://shroudstory.com/2015/01/21/bsts-article-by-hugh-farey/","cat":"carbon_14_dating","title":"BSTS Article by Hugh Farey"},{"id":"comment-185372","author":"nabber","post":"“To a non authenticist, of course, there is no surprise at all to find that the shroud radiocarbon dates to exactly the time when its history begins.” Except the evidence is clear: there is plenty pointing to an earlier existence than the date of 1356. The nay saying on this blog by anti authenticists against the Pray Codex is downright embarrassing. Oh yes, ” the 4 L shaped holes on the Codex shroud actually hearken back to architectural practices on many ancient buildings….” Indeed, rank poppycock. Just one example of bad scholarship..","date":"2015-01-22","mins":"8:26 am","url":"https://shroudstory.com/2015/01/21/bsts-article-by-hugh-farey/","cat":"carbon_14_dating","title":"BSTS Article by Hugh Farey"},{"id":"comment-198025","author":"nabber","post":"Hugh, you are trying to couch it in the terms you prefer, but that is a false reading. JP2 said, “The Holy Shroud is the most splendid relic of the Passion and Resurrection”, and that is hardly a “personal opinion” in the ears of any fair minded, religious person. It speaks to spiritual matters, and the Pope is the head of all spiritual matters for R Cs, speaking ex cathedra or not. The best that anyone could say about the 2 statements is that the Pope was conflicted, but he indeed spoke on matters of faith both times. I think he would have been right at home participating on this blog…..","date":"2015-04-30","mins":"10:54 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-139800","author":"nabber","post":"“NOT” …….","date":"2014-07-22","mins":"10:41 am","url":"https://shroudstory.com/2014/07/22/another-segment-of-stephen-jones-conspiracy-theory/","cat":"conspiracy_theory","title":"Another Segment of Stephen Jones’ Conspiracy Theory"},{"id":"comment-216139","author":"nabber","post":"HF: “Part of the point of the paper is that a dye was rubbed onto the ‘mended’ Shroud in order to match the colours. Well it was a pretty poor shot, wasn’t it, since the dye is, according to both Rogers and Pam, so conspicuously different from the cloth it was supposed to emulate.” A little specious on that argument. There’s an even chance that when the dye was applied, that it in fact DID match the cloth. The colors could very well have progressed unevenly in their fading..","date":"2015-12-10","mins":"11:38 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-216142","author":"nabber","post":"HF, thanks for your “expert” comments on dyes: ” Linen may be more difficult to dye than cotton, but that’s a relative term. Furthermore, ‘encrustations’ are not evidence of dye.” “Defects Caused by Deposits and Encrustations on Fiber” by Karl Mahall. (Springer Link) Abstract: “Oils, greases and waxes which are not removed before dyeing can cause reserving and, as with sizing residues, lead to dyeing unlevelness. Precipitated dye or UNDISSOLVED DYE PARTICLES cause dye stains. Inappropriate finishes lead to the FORMATION OF CHALKY MARKS when the fabric is scratched.” Lime deposits are mentioned as types of encrustations..","date":"2015-12-10","mins":"11:56 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-193893","author":"nabber","post":"“As I wrote above, two drawings depicting the same subject can obviously share a few similarities, but this doesn’t mean that there is any connection between these two drawings as such.” –PHPL To repeat yourself as if no one had said anything doesn’t mean your statements will stand up. The similarity of the four holes (in an “L” shape) between the two has created a probability of one copying the other that approaches, very closely, certainty. The problem of some other details not being copied (especially after 4 decades) has nothing logically to do with that first probability. You don’t know my qualifications, by the way, and evidently you are purposedly ignoring those of John Klotz..","date":"2015-03-20","mins":"3:47 pm","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","title":"John Klotz Delivers the Knockout"},{"id":"comment-193852","author":"nabber","post":"An astounding lack of logic. If you were drawing a white horse with four brown, round, and connected spots, the resemblance would certainly indicate you had seen that horse drawn before. The probabilities that it would be a coincidence are staggeringly small, as to be meaningless..","date":"2015-03-20","mins":"7:35 am","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","title":"John Klotz Delivers the Knockout"},{"id":"comment-177827","author":"nabber","post":"Should have said, “Know nothing”…..","date":"2014-12-19","mins":"3:38 pm","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","title":"Just Published:  What Went Wrong with the Radiocarbon Date?"},{"id":"comment-197293","author":"nabber","post":"Now you’ve done it, anoxie. You’ve attracted Piero to this thread — watch out for interminably long responses of scientific fol de rol…….","date":"2015-04-23","mins":"7:30 am","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","title":"Look at what happened between 1988 and 2015"},{"id":"comment-193122","author":"nabber","post":"Admittedly an artist would have to have had an very precise brush; however, I can see places where the iris border is portrayed over at least 3 threads. Do able..","date":"2015-03-11","mins":"8:15 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"}]
