[{"id":"comment-216046","author":"nabber","post":"Max said: “in Greek the cursive ‘t’ can easily be mistaken for a cursive ‘i’ and iairos turn into iatros, “physician”.” There is far more to Luke’s physician status than an argument over a word translation. The choice of medical language proves that Luke was a physician. There are clear indications of his medical profession throughout his writings. In Hobart’s “The Medical Language of St. Luke”, he points out numerous words and phrases identical with those employed by classic medical writers such as Hippocrates and Galen. The argument is cumulative. When doubtful cases and expressions common to the Septuagint are set aside, a large number remain that are unassailable. It is as good as certain from the subject matter, and more especially from the style, and for everyone who can appreciate proof, that Luke’s work was by a man practiced in the scientific language of Greek medicine–in short, a Greek physician..","date":"2015-12-09","mins":"4:06 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"id":"comment-216157","author":"nabber","post":"Daveb’s first para: “it has been asserted this epistle [Colossians] is pseudonymous”? By whom? How authoritative? “It was a common enough practice”? And that proves what? The four Captivity Epistles were written by Paul during his first imprisonment in Rome — Colossians, Ephesians, Philemon and Philippians, sometime between A.D. 61 and 63. When Paul appealed to Caesar, Luke accompanied him from Caesarea, and was with him during the stormy voyage from Crete to Malta. They went on to Rome, where, during the two years that Paul was kept in prison, Luke was frequently at his side. He was present when the Epistles to the Colossians, Ephesians and Philemon were written, and is mentioned in the salutations given in two of them: “Luke the most dear physician, salute you” (Colossians 4:14); “There salute you. . . Mark, Aristarchus, Demas, and Luke my fellow laborers” (Philem., 24). Second para: “only late 2nd century traditions claim that Paul was the guarantor of Luke’s Gospel”? Paul himself quotes Luke twice in his Epistles. Paul quotes Luke 10:7 in his letter to Timothy (1 Timothy 5:18). Paul actually calls this 1 Timothy quotation a “Scripture”, “graphe” , meaning the written word, not an oral saying. Paul also used wording in describing the Lord’s Supper in 1 Corinthians 11:24 25 that is unmistakably from Luke 22:19, plus, the words are not found in any other gospel. So Paul must have had access to a copy of Luke when he wrote 1 Corinthians, about AD 55. Proof well before the “late 2nd century”… third para: “References are often made to Luke’s medical language, but there is no evidence of such language beyond that to which any educated Greek might have been exposed.” Wow — big assumption. Are you “up” on the status of the educated Greek of the first century? Further, there is a striking resemblance between the prologue of the Gospel and a preface written by Dioscorides, a medical writer who studied at Tarsus in the first century. The words with which Hippocrates begins his treatise “On Ancient Medicine” should be noted in this connection. It is believed that Luke met Paul at Tarsus. Also third para: “Of more import is the fact that in the writings of Luke specifically Pauline ideas are significantly missing”. For starters, of the characteristic words and phrases which mark the three Synoptic Gospels, a little more than half are common to Matthew and Paul, less than half common to Mark and Paul, but two thirds common to Luke and Paul. Ideas: Justification by faith: Luke: It is easier for a camel to go through the eye of a needle than for a rich man to enter the Kingdom of God. They asked, “Who then can be saved?” Jesus replied, “What is impossible with man is possible with God.” “Truly I tell you, no one who has left home or wife or parents or children for the sake of the kingdom of God [true faith] will fail to receive many times as much in this age, and in the age to come, eternal life.” (Luke 18:25). Paul: “Therefore having been justified by faith, we have peace with God through our Lord Jesus Christ,” (Rom. 5:1). The Sacrifice: The death of Jesus was associated with the Passover sacrifice in the context of the Lord’s Supper. This conclusion can be drawn from I Corinthians 5:7. If this is so, then for the Gospel, a connection is established between the significance of the Passover and the Last Supper (Luke 22:7 20)..","date":"2015-12-10","mins":"2:22 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"}]
