[{"id":"comment-152303","author":"nabber","post":"Colin said: “Wrong. The STURP summary does not use the word ‘scorch’ at all.” Then he says, “[STURP] points out that such changes can be the result of thermal OR chemical treatments, which in most people’s books would be described as “scorches.” So you destroy your own argument by quibbling about the specific word “scorch”. Shame on you. Colin said, “The STURP summary makes no mention whatsoever of cloth body distance. The reference in the STURP summary to the capture and encoding of 3 D information has possible explanations that do NOT obligatorily require any postulates re ‘cloth body’ distance.” But the Report says, “Computer image enhancement and analysis by a device known as a VP 8 image analyser show that the image has unique three dimensional information encoded in it … the image of the face with the high resolution has been amply demonstrated by photography.” The nose is darkest because it is closest to the linen, the eye sockets are lightest becasue they are furthest away, i.e., cloth to body distance made the 3 D effect. Colin said, “The energy of the uv CAN be dissipated safely in other forms, notably as thermal energy.” Kohler at Ohio State, whose work was sponsored by the National Institutes of Health and was performed at Ohio State’s Center for Chemical and Biophysical Dynamics, which is funded by the National Science Foundation, stated, “Eventually, the energy does turn into heat, but the important point is that the energy is retained within the molecule for much longer times,” he added. “This can cause all kinds of photochemical havoc.” Colin said, “I may indeed be wrong.” Yep..","date":"2014-09-18","mins":"4:15 pm","url":"https://shroudstory.com/2014/09/18/colin-berry-ok-ive-made-a-start-on-that-di-lazzaro-pdf/","cat":"conference","title":"Colin Berry:  OK, I’ve made a start on that Di Lazzaro pdf"},{"id":"comment-153710","author":"nabber","post":"I think Berry quibbles about the word “scorch”, especially after all his endless and fruitless theories about bas relief, etc., etc., etc. I think we all know what each other means by scorch, by now. Hugh says: “Nabber finds a quotation which parallels Colin’s statement about UV , but seems to think it means the opposite. Kohler’s mention of ‘photochemical havoc’ refers specifically to the damage caused by UV radiation to human cells”. Hugh, your personal knowledge of the effects of UV radiation leads you to imply that photochemical reactions only affect human cells, and not the cells of linen fabric? Hugh says, “Kohler, like Colin, is well aware that most materials are unaffected by UV radiation.” I didn’t realize that you personally knew what Kohler is “well aware of.” And that statement is poppycock, anyway. All fabrics are affected by UV radiation, as well as many other materials. It’s also pedantic of you and him to insist that the STURP summary said nothing about cloth to body distances, when STURP members (Jackson, et.al.) have put out reams of articles on the subject ever since the STURP report..","date":"2014-09-22","mins":"2:43 pm","url":"https://shroudstory.com/2014/09/18/colin-berry-ok-ive-made-a-start-on-that-di-lazzaro-pdf/","cat":"conference","title":"Colin Berry:  OK, I’ve made a start on that Di Lazzaro pdf"},{"id":"comment-205881","author":"nabber","post":"By the same token, you should not let Piero get away with his lengthy cut and paste entries. He should just let a link stand for his unusually obtuse entries..","date":"2015-07-15","mins":"2:01 pm","url":"https://shroudstory.com/2015/07/14/does-it-matter-if-the-shroud-is-a-fake/","cat":"presentation","title":"Does it Matter if the Shroud is a Fake?"},{"id":"comment-152305","author":"nabber","post":"“A local expert on the Shroud of Turin, the piece of linen believed by some to be the burial cloth of Jesus,” (editorial BS) A local expert on the Shroud of Turin, the piece of linen believed by millions to be the burial cloth of Jesus, There, fixed it…..","date":"2014-09-18","mins":"4:19 pm","url":"https://shroudstory.com/2014/09/18/five-things-the-shroud-of-turin-made-number-three/","cat":"conference","title":"Five Things:  The Shroud of Turin Made Number Three"},{"id":"comment-199149","author":"nabber","post":"Thanks for the announcement…duh….","date":"2015-05-15","mins":"2:03 am","url":"https://shroudstory.com/2015/05/10/picture-for-today-getting-ready-for-the-shroud-exhibition-in-1931/","cat":"exhibition","title":"Picture for Today:  Getting Ready for the Shroud Exhibition in 1931"},{"id":"comment-194885","author":"nabber","post":"Louis: “I believe that the Shroud is authentic, however I don’t think anyone can be dogmatic when it comes to this. Not even the Church is.” I’m a little tired of this argument, Louis, which is problematic when you consider the statements of the last 7 popes, who head the Church (and they are quite clear and straightforward): Pope Pius XI (1922 1939): “… certainly not the work of any human hand.” Pope Pius XII (1939 1958): “The linen in which Joseph of Arimathea enveloped the sacred remains of our Lord Jesus Christ.” Pope John XXIII (1958 63): “This can only be the Lord’s own doing.” Pope Paul VI (1963 78): “…The image from the Holy Shroud reveals to us the human and divine personality of Christ.” Pope John Paul II (1978 2005): “The Holy Shroud is the most splendid relic of the Passion and Resurrection.” Pope Benedict XVI (2005 2013): “…should be seen as a photographic document of the darkest mystery of faith — that of Christ’s crucifixion and resurrection.” Pope Francis I (2013 ): “By means of the Holy Shroud, the unique and supreme Word of God comes to us”.","date":"2015-03-30","mins":"4:42 pm","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin"},{"id":"comment-194610","author":"nabber","post":"Don’t stop Piero, he’s on a roll…...","date":"2015-03-27","mins":"10:18 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin"},{"id":"comment-194986","author":"nabber","post":"My understanding is that, of the 9 aragonite type samples from Israel offered up for examination, only the Jerusalem sample aragonite had a close match with that found on the Shroud. Until you state some more details about French aragonite, I don’t see the relevance. It would seem to be of the same relevance of the 8 Israel samples that did not match the Shroud very closely..","date":"2015-03-31","mins":"2:52 pm","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin"},{"id":"comment-158605","author":"nabber","post":"“Don’t make me stop this car…..”.","date":"2014-10-02","mins":"8:42 am","url":"https://shroudstory.com/2014/10/02/impatience/","cat":"st_louis_2014","title":"Impatience"},{"id":"comment-195097","author":"nabber","post":"Thank you, dave b.","date":"2015-04-01","mins":"9:42 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin"},{"id":"comment-162866","author":"nabber","post":"By such comments, CB has embarrassed himself, his allies, and members of this blog. Of course, he has no idea that he has done so — and has no capacity for embarrassment, anyway..","date":"2014-10-16","mins":"10:39 am","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-162984","author":"nabber","post":"Hey MPH: You apppear amazingly unaware of the details of the NT. Mary Magdalene clearly did not recognize Jesus because she was looking for His body, not looking for Him, which is why she did not recognize the gardener. And Jesus in that form did not yet have a glorified body, as he told MM not to touch Him because He had not yet ascended to the Father..","date":"2014-10-16","mins":"8:56 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-193442","author":"nabber","post":"Tonto is from the Spanish, “stupid”, or “simple”…...","date":"2015-03-15","mins":"4:12 pm","url":"https://shroudstory.com/2015/03/15/the-lone-ranger-in-phoenix-later-this-month/","cat":"presentation","title":"The Lone Ranger in Phoenix Later This Month"},{"id":"comment-150710","author":"nabber","post":"Factoid alert: No need to get gold from the sea — there is plenty in mines in Colorado; it’s just not economical to get it out of there, any more. So they told me in Cripple Creek..","date":"2014-09-13","mins":"10:12 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"}]
