[{"id":"comment-200515","author":"nabber","post":"Mario states: “the dissertation refers to documents that never mention that Othon received a shroud or owned any shroud.” Absence of Evidence does not mean Evidence of Absence. Otto could have hid the Shroud based on a fear that either the Pope or the King of France would force him to turn it over. As an analogy, Bishop Athanasius wrote in the 300s that the “Icon of our Lord” (the Shroud) was secreted away to Syria (Antioch) upon the attack of the Romans on Jerusalem. From 70 A.D. Until 540 A.D (date of the destruction of Antioch by Chosroes), the Shroud was not displayed in Antioch, due to the fear of the Arian Christians (and later the Monophysites) that the Churches in Constantinople and Rome would either take it away from them or destroy it. Absence of Evidence is not Evidence of Absence..","date":"2015-05-29","mins":"8:12 am","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","title":"Challenging the Othon de la Roche Story"},{"id":"comment-167905","author":"nabber","post":"Wait, Mike M…. You’re asking Freeman to actually READ the evidence? You cad… The guy is an embarrassment….even CB reprimands him…..","date":"2014-11-02","mins":"10:13 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-165151","author":"nabber","post":"With all due respect, “don’t hurry back” …..","date":"2014-10-24","mins":"8:55 am","url":"https://shroudstory.com/2014/10/23/the-guardian-notes-the-history-today-article-by-charles-freeman/","cat":"history","title":"The Guardian Notes the History Today Article by Charles Freeman"},{"id":"comment-174612","author":"nabber","post":"Just goes to show: one person’s hoity toity is another’s blazing truth…..","date":"2014-12-04","mins":"8:55 am","url":"https://shroudstory.com/2014/12/03/the-shroud-of-turin-is-not-the-image-of-edessa/","cat":"history","title":"The Shroud of Turin is not the Image of Edessa?"}]
