[{"id":"comment-175387","author":"nabber","post":"Mario said, ” we know the VP8 has nothing to do with NASA” That is INCORRECT. The VP 8 Image Analyzer was used to interpret NASA LANDSAT 1 Earth Resources Satellite Program images, for an example, see ntrs.nasa.gov, Technical Report #19760010448..","date":"2014-12-09","mins":"12:34 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175411","author":"nabber","post":"NASA financed the Natural Resources Management Corporation to do this work with the VP 8. The information was not only “filed” with NASA Scientific and Technical Papers, it was also presented at a NASA Conference in 1976. You know, Hugh, just in case you were trying to distance the NASA – VP 8 connection. Too, too obvious..","date":"2014-12-09","mins":"4:30 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175450","author":"nabber","post":"Yes, Hugh, NASA did most certainly use the VP 8 image analyzer, by paying subcontractors on a host of LANDSAT projects, including in Serbia, Canada, and Thailand, to name a few. You have missed the point by dismissing it as a “vegetation analyzer”; actually, the ability to process hundreds of different grayscale tonalities allowed it to enhance LANDSAT visual to near IR band images in order to provide an improved, “super” look at a vastly increased number of high contrast areas and low contrast areas, both of rock and vegetation, alone or together. This is indeed analogous to what was done with the Shroud with the VP 8, allowing an intensity to distance capability..","date":"2014-12-09","mins":"10:17 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175530","author":"nabber","post":"C.B. Said, “Passive sensing cannot give any encoded information.” On the other hand, I don’t believe anyone has made a final official declaration that the TS image occurred by passive sensing…. Hugh: obviously you don’t understand how Government works — in the U.K. And the U.S., “paying for someone to do something for you is the same as doing it yourself” is exactly how it works. If they’re paying, The Government owns all processes and results from your work, therefore it is Their work. As far as contrasting image densities producing topographical images, that is exactly what was produced with the “3 D” TS Image. And if they didn’t think that they were going to come up with something significant when they ran the TS info through the VP 8, why did they even start? According to your reasoning, they would not even have bothered to look — therefore, something is wrong with your reasoning. Unless of course you are calling Schumacher, Jackson, Jumper, et. Al., “hoaxers.”.","date":"2014-12-10","mins":"9:02 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175541","author":"nabber","post":"C.B.: “photographs of the TS image … taken with a camera with no active scanner but merely passive reception of reflected light, cannot possibly pick up encoded 3 D information, even if it was there in the TS image.” CANNOT POSSIBLY — so you say, yet others say something seemingly impossible is associated with the TS. “[And] Yet the image on the Shroud of Turin yields a very accurate dimensional relief of a human form. One MUST conclude from this that the image density on the cloth is directly proportionate to the distance it was from the body it covered.” (Schwortz) C.B: “That’s why it works on photographs of scorch imprints too, as good as if not better than the TS image.” No, I don’t agree that they look as good, plus the scorches proffered up thusfar do not sit on the top 1/500th of an inch of the fibrils..","date":"2014-12-10","mins":"10:13 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175415","author":"nabber","post":"The Veil of Veronica legend OF COURSE started out as a woman wiping the SWEAT and blood off of the face of Jesus. But as I said, any Medieval person would have been thinking that the act of wiping sweat and blood off of anyone’s face would produce nothing but a huge smudge, and using the SUDARIUM word making no difference. That is why the Veronica was thought to be a miraculous production of Jesus’ face, in color, and not a “sweat imprint”. That is why all the Medieval artists painted their copies of it in color. That is why the Medieval hoaxers were not able to get anyone to buy into the concept of a “sweat imprint” — NO ONE HAD SEEN ONE, and Colin Berry can’t cite an instance of anyone in Medieval times having seen a painting of a sweat imprint, or even having seen a real burial cloth with a sweat imprint. So naturally, any Medieval bishop, cleric, or common man would not be able to buy into the thought of a TS as a “sweat imprint”. If anything, they would have gone for a nice color body/blood imprint. Whether Pre or Post Crucifixion imprint, the people would not have been “marketed” into a “sweat imprint”. They’d never heard of one or seen one! (except for the big smudge, that is!).","date":"2014-12-09","mins":"4:57 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175589","author":"nabber","post":"And why, exactly, would the hoaxer care about how superficial the scorch was, to go through serial imprinting of wads of llinen? A heavy scorch would not fool anyone, but a light scorch would? Through what thought process would the hoaxer be trying to lead the Bishop, Cleric, Common Man? At what point would the hoaxer have known he was finished? Maybe he did some polling?.","date":"2014-12-10","mins":"2:43 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175780","author":"nabber","post":"“From a scientific standpoint, the gesso vermillion hypothesis is simply too flaky.” Awesome..","date":"2014-12-11","mins":"6:40 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-151167","author":"nabber","post":"You tried to mask it, but it stands as an ad hominem attack. Sorry for you..","date":"2014-09-15","mins":"9:26 am","url":"https://shroudstory.com/2014/09/14/a-defense-of-ray-rogers-on-the-image-at-the-thread-and-fiber-level/","cat":"guest_posting","title":"A Defense of Ray Rogers on the Image at the Thread and Fiber Level"},{"id":"comment-206231","author":"nabber","post":"Always use the instant “sniff test” on this website: Hmmmm…. Rogers or Berry, Rogers or Berry, “geez, no contest”. Nuff said. (For the weak of mind: It’s “Rogers” every time)..","date":"2015-07-20","mins":"4:08 pm","url":"https://shroudstory.com/2015/07/20/in-the-weeds-vanillin-and-the-age-of-the-shroud/","cat":"science","title":"In the Weeds:  Vanillin and the Age of the Shroud"},{"id":"comment-205964","author":"nabber","post":"Well said, Louis: “It would be like asking what sort of power emanated from him when the woman with the haemorrhage (Mark 5:25 34) was cured instantaneously.” I’ll throw in that it also would be like asking what sort of power emanated from him during the Transfiguration…...","date":"2015-07-16","mins":"1:44 pm","url":"https://shroudstory.com/2015/07/16/a-reason-to-doubt-the-image-was-formed-by-radiation/","cat":"image_theory","title":"A Reason to Doubt the Image Was Formed By Radiation"},{"id":"comment-191509","author":"nabber","post":"Sorry, but I find it incredibly illuminating that you should advertise yourself as “high on the Google lists”. It’s sad that you have to aggrandize yourself this way. But at least it lets everyone here know about your true motivation. BTW, “pompous a$$” gets 210,000 hits….","date":"2015-02-21","mins":"4:00 pm","url":"https://shroudstory.com/2015/02/21/colin-berry-stop-calling-the-faint-image-a-faint-image/","cat":"image_theory","title":"Colin Berry:  Stop Calling the Faint Image a Faint Image"},{"id":"comment-191652","author":"nabber","post":"Charles , you are pointing out about yourself here on this blog as being “high on the Google lists”. You are obviously crowing about your ability to attract attention. We have a name for that in this modern age, and the first word is “attention      ”…...","date":"2015-02-23","mins":"10:49 am","url":"https://shroudstory.com/2015/02/21/colin-berry-stop-calling-the-faint-image-a-faint-image/","cat":"image_theory","title":"Colin Berry:  Stop Calling the Faint Image a Faint Image"},{"id":"comment-207560","author":"nabber","post":"Dan, please explain to me, on “2) Colin’s supposition that the shroud is meant to be thought of not as a burial cloth in the tomb but as a stretcher of sorts to transport the body to the tomb.” Would not such a shroud, used as a stretcher, contain smeared blood all over the place? There is not such an effect on the So T, true?.","date":"2015-08-06","mins":"7:34 am","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-207891","author":"nabber","post":"As you so blithely try to pass off…incorrectly. Lazarus is the only resurrected person that Jesus personally refers to as “dead.” Jesus said the daughter of Jairus was “sleeping”, but this could have been a use of “sleeping” as a synonym for death. From John: When Jesus arrives in Bethany, he finds that Lazarus is dead and has already been in his tomb for four days. Martha laments that Jesus did not arrive soon enough to heal her brother and Jesus replies with the well known statement, “I am the resurrection, and the life: he that believeth in me, though he were dead, yet shall he live: And whosoever liveth and believeth in me shall never die”. From Luke: “Soon afterward, Jesus went to a town called Nain, and his disciples and a large crowd went along with him. As he approached the town gate, a dead person was being carried out—the only son of his mother, and she was a widow. When the Lord saw her, his heart went out to her and he said, “Don’t cry.” Then he went up and touched the bier they were carrying him on, and the bearers stood still. He said, “Young man, I say to you, get up!” The dead man sat up and began to talk, and Jesus gave him back to his mother.” Wrong again, DG.","date":"2015-08-10","mins":"2:03 pm","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-207860","author":"nabber","post":"Hugh says: “If I were compelled to say what a Resurrection miracle might ‘probably’ be, I would look towards those other examples of people raised from the dead by Jesus, namely Lazarus, Jairus’ daughter and the son of the widow of Nain. No suggestion of transferring bodies into other dimensions there, upwards or downwards.” Excellent point. Thank you. This is a case of where Logic and Precedence combine to actually become Science, IMHO. No machines, calculators, test tubes, but still Science..","date":"2015-08-10","mins":"8:21 am","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-207967","author":"nabber","post":"Totally accept..","date":"2015-08-11","mins":"8:02 am","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-200804","author":"nabber","post":"Dave, don’t hold back, tell us how you really feel … ; ^ } (and thanks!).","date":"2015-06-01","mins":"4:36 pm","url":"https://shroudstory.com/2015/06/01/is-charles-freeman-emerging-as-the-worlds-leading-shroud-skeptic/","cat":"image_theory","title":"Is Charles Freeman Emerging as the World’s Leading Shroud Skeptic?"},{"id":"comment-200780","author":"nabber","post":"Charles Freeman hangs out on every skeptic blog message board known to man. Bottom line: Freeman’s world view is severely threatened by an authentic and unexplainable Shroud. He is not adding anything of value to the discussion on this board. And the only thing I agree with Colin on…..","date":"2015-06-01","mins":"9:07 am","url":"https://shroudstory.com/2015/06/01/is-charles-freeman-emerging-as-the-worlds-leading-shroud-skeptic/","cat":"image_theory","title":"Is Charles Freeman Emerging as the World’s Leading Shroud Skeptic?"},{"id":"comment-197836","author":"nabber","post":"Would not the thumbs have been fastened together somehow, under the palms, out of sight? How else could the hands have stayed in that position? It seems that otherwise, with the elbows not on the body and off to the side, the weight of the upper arms would cause the hands to continuously slide backward off of the pubis area..","date":"2015-04-28","mins":"8:25 am","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","title":"Might tactile chemography prove to be the super-model?"},{"id":"comment-214656","author":"nabber","post":"“People were not usually buried in shrouds.” At Qazone, Jordan, near the Dead Sea, numerous graves were discovered dating to the 2nd Century AD; 42 pieces of shrouds were taken from 50 graves, including one intact shroud. “Secondly, even if they were, we may simply not have any other shrouds with images because of the passage of time.” That doesn’t make sense. In my readings on archaeology and shrouds, it is stated often that archaeologists have found hundreds of shrouds over the centuries. Only one, from Egypt, had a partial outline, but it was caused by embalming fluids. The Shroud remains the only one with an image..","date":"2015-11-16","mins":"8:59 am","url":"https://shroudstory.com/2015/11/13/nevertheless-the-images-are-real-enough/","cat":"image_theory","title":"Nevertheless, the images are real enough!"},{"id":"comment-156083","author":"nabber","post":"Unbelievable you would proffer that up and it’s very revealing what you don’t say. If you know of such a painting that sits on the top one five hundredth of an inch of the linen, show us where to find it! You cannot! If you don’t like that measurement, pick your own, as long as it is somewhere close to that..","date":"2014-09-25","mins":"4:53 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-167265","author":"nabber","post":"Hugh sez: “As he was not present at Turin, he must have got it from another source, possibly Eric Jumper or Sam Pellicori. THE STORY HAS BEEN AT LEAST SLIGHTLY EMBROIDERED.” Non sequitur. Judgmental. Absolutist. Unsubstantiated..","date":"2014-10-31","mins":"11:36 am","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","title":"Those Dark Specks in the Mark Evan’s Photographs"},{"id":"comment-167210","author":"nabber","post":"The Aragonite found in 1978 from spectroscopic “hits” were found also in the nose area — close enough to the eyelid, so what are you fussing about. I thought I had read that the 9 Aragonite samples from parts of Israel (from Dr. Nitowski) had a match with the Shroud Aragonite only in the case of the 1 sample from Jerusalem, and I thought the Dr. Levi Setti examination (from Fermi Institute) had resulted in an unusually close match between the two above. Exclusive match, maybe not, but the fact that the other 8 Nitowski samples did not match, has to account for a pretty positive indicator. And, as Dr. Kohlbeck stated, skeptics have to account for Aragonite being on the Shroud at all, and then, on such indicative places, feet, knee, nose..","date":"2014-10-31","mins":"8:44 am","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","title":"Those Dark Specks in the Mark Evan’s Photographs"},{"id":"comment-167264","author":"nabber","post":"Hugh sez: “The suggestion that the aragonite found on the shroud can be identified exclusively as that found in Jerusalem is wholly unsubstantiated.” Tearing down strawmen, are you? Who maintains that the evidence shows or has to show exclusive identification? What, no one has ever gone to prison based on circumstantial evidence? It’s the preponderance of evidence we’re looking for here, not exclusivity. 1 out of 9 aragonite samples from Israel match the Shroud aragonite, and it is the sample from Jerusalem. You are the editor of a journal that looks at evidence, and your standard is exclusivity?.","date":"2014-10-31","mins":"11:32 am","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","title":"Those Dark Specks in the Mark Evan’s Photographs"},{"id":"comment-195094","author":"nabber","post":"PHPL: “Some here pretend that the forensic experts who examined it unanimously say that the shroud is authentic. That’s not true. Some pathologists like Lee or Baden disagree with this.” You have to do better than that — Baden and Lee did not examine the Shroud, only looked at photographs of the Shroud — not the same thing at all. We don’t even know which version/quality of photos of the Shroud they examined. You can say it — “if a commission of forensic experts examine the shroud, most will say that it’s a fake”, but that’s your opinion and an unsupported one at that. The longer you post to this blog, the weaker your comments become. Pity..","date":"2015-04-01","mins":"9:33 am","url":"https://shroudstory.com/2015/03/31/whats-to-like-over-on-colins-blog-right-now/","cat":"image_theory","title":"What’s to like over on Colin’s blog right now?"}]
