[{"id":"comment-159829","author":"nabber","post":"“the reality of reincarnation, a notion popular in Jesus’ day, accepted by Him and by some early Church fathers, comes into focus. ” Pure poppycock…. Prove it..","date":"2014-10-06","mins":"10:53 am","url":"https://shroudstory.com/2014/10/06/a-different-perspective-on-the-shroud/","cat":"news_&_views","title":"A Different Perspective on the Shroud"},{"id":"comment-159871","author":"nabber","post":"“Elias and other were dead so some believed that they came back as Jesus.” Not a big fan of the OT, huh, John? Elias = Elijah, who did not die, but was “taken up”. And, p.s., they were not talking about reincarnation, but the return of a prophet(s)..","date":"2014-10-06","mins":"1:04 pm","url":"https://shroudstory.com/2014/10/06/a-different-perspective-on-the-shroud/","cat":"news_&_views","title":"A Different Perspective on the Shroud"},{"id":"comment-160723","author":"nabber","post":"John Green quotes: ” He asked his disciples, saying, Whom do men say that I the Son of man am?” I agree with Dave B. Jesus, aware of “undoctrinal” talk about who he might be, was setting up a straw man in order to knock such arguments down (and later, the evangelists wrote it). And He did.There may have been illiterates who believed in reincarnation, but no one steeped in the teachings of the mainline rabbis…..","date":"2014-10-09","mins":"1:16 pm","url":"https://shroudstory.com/2014/10/06/a-different-perspective-on-the-shroud/","cat":"news_&_views","title":"A Different Perspective on the Shroud"},{"id":"comment-203115","author":"nabber","post":"Sampath, where have you been? Pope Francis I: “By means of the Holy Shroud, the Unique and Supreme Word of God comes to us.” Just how clear would you like him to be? As they say, “you could Google it.”.","date":"2015-06-21","mins":"6:08 pm","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","title":"A Memorable Photograph Worth a Thousand Words"},{"id":"comment-203193","author":"nabber","post":"But Pope Francis was not talking about OTHER sculptures, paintings, icons, relics, nor has he said anything similar about them. HF is a either thick, or purposely dissembling. Let’s rearrange the Pope’s statement for those unable to diagram sentences: “The Unique and Supreme Word of God comes to us by means of The Holy Shroud.” He was as clear as he could be, except to those who desperately need to change the meaning of what the said…...","date":"2015-06-22","mins":"7:47 am","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","title":"A Memorable Photograph Worth a Thousand Words"},{"id":"comment-203249","author":"nabber","post":"Evidently it does mean that. It’s too bad that an American has to explain English to a Brit. The UNIQUE and Supreme Word of God comes to us by         (fill in the blank). Theologically, the answer could only be “Jesus” or “the Bible”, or as Pope Francis opines, “the Holy Shroud.” Any other answer here would be some secular nonsense. Now you are repeating nonsense again, re: his predecessor Popes have failed to express an opinion? Unbelievable. Pope Pius XI “… certainly not the work of any human hand.” Pope Pius XII “The linen in which Joseph of Arimathea enveloped the sacred remains of our Lord Jesus Christ.” Pope John XXIII “This can only be the Lord’s own doing.” Pope Paul VI “…The image from the Holy Shroud reveals to us the human and divine personality of Christ.” Pope John Paul II “The Holy Shroud is the most splendid relic of the Passion and Resurrection.” Pope Benedict XVI “…should be seen as a photographic document of the darkest mystery of faith — that of Christ’s crucifixion and resurrection.” As we say in America, read ’em and weep…..","date":"2015-06-22","mins":"3:54 pm","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","title":"A Memorable Photograph Worth a Thousand Words"},{"id":"comment-203346","author":"nabber","post":"You may want to try your hand at interpreting English, David. Pope Paul VI “…The image from the Holy Shroud reveals to us the human and divine personality of Christ.” Clearly, Paul VI is saying here, the Holy Shroud reveals to us the human and divine personality of Christ and that theologically, then, nothing other than the Shroud and the New Testament reveal to us the human and divine personality of Christ. So being on an equal footing with the New Testament [according to Paul VI], the Shroud is Truth. If a 14th century relic or other relic could have revealed such a thing, you would have had a declaration of such by another Pope. You do not have such. Pope John Paul II “The Holy Shroud is the most splendid relic of the Passion and Resurrection.” If you knew what the term “relic” meant to JP II, David, then you would understand what he meant by this statement. Pity. He also stated it as “THE most splendid relic” and not just “A relic”. Pope Benedict XVI “…should be seen as a photographic document of the darkest mystery of faith — that of Christ’s crucifixion and resurrection.” “A Photo of Christ’s Crucifixion and Resurrection.” Couldn’t be any more clear, and you’re saying that it is not is the height of disingenuousness..","date":"2015-06-23","mins":"7:57 am","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","title":"A Memorable Photograph Worth a Thousand Words"},{"id":"comment-203352","author":"nabber","post":"In this case, I am the judge. “..this relic is the authentic burial cloth of Christ” is equal to “this is the most splendid relic of the Passion and Resurrection”, and if you can’t see it, you are in serious denial. But then again, what would you care about what the Popes say? They are nothing to you, or so the evidence shows..","date":"2015-06-23","mins":"9:36 am","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","title":"A Memorable Photograph Worth a Thousand Words"},{"id":"comment-203377","author":"nabber","post":"Got it, Dan. But it’s seems peculiar that a member of the skeptic crowd really cares about what the Popes say, up until the point they think they can use the words…..","date":"2015-06-23","mins":"2:30 pm","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","title":"A Memorable Photograph Worth a Thousand Words"},{"id":"comment-203113","author":"nabber","post":"Louis, where have you been? Pope Francis I: “By means of the Holy Shroud, the Unique and Supreme Word of God comes to us.” Just how clear would you like him to be? As they say, “you could Google it.”.","date":"2015-06-21","mins":"6:07 pm","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","title":"A Memorable Photograph Worth a Thousand Words"},{"id":"comment-178395","author":"nabber","post":"We’re so sure of what we know, aren’t we? ” like the necessity that tells us, for example, that only a female who has been impregnated by the sperm of a male of the same species can give birth to offspring. That necessity reigns supreme, without exception, in nature.” Mr. Linker, a female shark not too long ago underwent parthenogenesis, and had never been in the same tank as a male shark — marking the highest order form of life to ever have this happen. There’s one exception for you. Has occurred often in various types of reptiles and fish..","date":"2014-12-22","mins":"8:47 am","url":"https://shroudstory.com/2014/12/22/a-miracle-debate/","cat":"news_&_views","title":"A Miracle Debate"},{"id":"comment-150709","author":"nabber","post":"You’re kidding, Charles. Gonella’s penultimate sin was to go along with not videoing the placement of the samples into the metal cylinders. This was reportedly the only part of the process that was not video’d. If Ballestro was manipulated, as he said, then it was Tite plus Gonella in that back room against Ballestro..","date":"2014-09-13","mins":"10:07 am","url":"https://shroudstory.com/2014/09/11/a-reason-to-not-do-more-scientific-testing-on-the-shroud/","cat":"science","title":"A Reason to NOT DO More Scientific Testing on the Shroud"},{"id":"comment-199001","author":"nabber","post":"Immediately, one can see a different mustache, duh…..","date":"2015-05-13","mins":"4:03 am","url":"https://shroudstory.com/2015/05/12/a-touch-of-the-ludicrous-for-a-tuesday-morning/","cat":"humor","title":"A Touch of the Ludicrous for a Tuesday Morning"},{"id":"comment-199086","author":"nabber","post":"Mustache definitely not full, unlike Shroud image..","date":"2015-05-14","mins":"5:40 am","url":"https://shroudstory.com/2015/05/12/a-touch-of-the-ludicrous-for-a-tuesday-morning/","cat":"humor","title":"A Touch of the Ludicrous for a Tuesday Morning"},{"id":"comment-191332","author":"nabber","post":"Louis, I had previously assumed you understood what sarcasm is…. That was hilarious, although here in the Southern U.S., much of this goes as truth about “those Papists”..","date":"2015-02-18","mins":"9:44 am","url":"https://shroudstory.com/2015/02/18/ash-wednesday-2015/","cat":"uncategorized","title":"Ash Wednesday 2015"},{"id":"comment-199148","author":"nabber","post":"You are truly confused….","date":"2015-05-15","mins":"2:01 am","url":"https://shroudstory.com/2015/05/12/a-touch-of-the-ludicrous-for-a-tuesday-morning/","cat":"humor","title":"A Touch of the Ludicrous for a Tuesday Morning"},{"id":"comment-207033","author":"nabber","post":"We can only hope that CB is so offended that he won’t return…...","date":"2015-07-31","mins":"8:31 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","title":"Cherry Jam, the Metaphor"},{"id":"comment-142777","author":"nabber","post":"Not a Christian..","date":"2014-08-07","mins":"9:14 am","url":"https://shroudstory.com/2014/08/07/christian-piatt-jesus-told-me-that-the-shroud-of-turin-was-his-photograph/","cat":"news_&_views","title":"Christian Piatt: Jesus told me that the Shroud of Turin was his photograph."},{"id":"comment-214808","author":"nabber","post":"Daveb: Paul’s letters set down at an earlier time than the gospels? Very much not a consensus view: Luke was a traveling companion of Paul, and is mentioned in three of Paul’s letters as “Luke the beloved physician.” Luke joined Paul on his second missionary journey in Troas. During Paul’s third journey, Luke joined him in Philippi (Acts 20:6) and went with him to Jerusalem (Acts 20:16). Paul quotes Luke as Scripture: When Paul wrote to Timothy (1 Timothy 5:18) he quoted a passage from Luke as Scripture: “FOR THE SCRIPTURE SAYS, ‘You shall not muzzle an ox while it treads the grain,’ and, ‘the laborer is worthy of his wages’.” The first verse quoted is from Deuteronomy 25:4. However, the second is a quotation of Jesus recorded by Luke: “The laborer is worthy of his wages” (Luke 10:7). THIS SAYING IS NOT FOUND IN THE OLD TESTAMENT. Paul uses the exact same Greek words that Luke used. Consequently, Paul must have known of Luke’s Gospel at this time and considered it Scripture..","date":"2015-11-19","mins":"8:27 am","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"id":"comment-214759","author":"nabber","post":"The word “vanished” is the Greek “ginomai” which has a number of similar meanings but the best appears to be “became”, as in “became out of their sight”. Vanished = Dematerialized What that dematerialization would do to cloth, aye — there’s the rub..","date":"2015-11-17","mins":"5:10 pm","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"id":"comment-214732","author":"nabber","post":"Here ya go, Dan, your dematerialization: “They had a lengthy discussion, including inviting Jesus to their house, preparing a meal, and after the blessing, when he broke the bread, “their eyes were opened and they recognized him; and he vanished from their sight.” (Luke 24:30 31)(the road to Emmaus).","date":"2015-11-17","mins":"9:15 am","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"id":"comment-214809","author":"nabber","post":"Daveb: C’mon Dave: “There seems to be no specific evidence that Paul was familiar with Christ’s earthly mission or had even encountered him.” Most theologians would say the Paul encountered Christ on the road to Damascus; in fact, most would say it was a physical encounter (light, sound)..","date":"2015-11-19","mins":"8:36 am","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"id":"comment-214735","author":"nabber","post":"Also, w.r.t. Verse 26 not offering any support to the idea that Jesus passed through anything: “‘A week later his disciples were again in the house, and Thomas was with them. Although the doors were shut, Jesus came and stood among them and said, ‘Peace be with you.’ “: You are missing the logic of the author including specific words. If there wasn’t something miraculous going on, the author would simply have said, “A week later his disciples were again in the house, and Thomas was with them. Jesus came and stood among them and said, ‘Peace be with you’ “. But that’s not the way the passage was written: the author included the words, “Although the doors were shut.” Words have meaning and words have purpose. The author clearly intended to convey that something very special happened..","date":"2015-11-17","mins":"10:09 am","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"id":"comment-214760","author":"nabber","post":"For the proper way to prepare a Critical Summary of Silliness, you should contact the Ministry of Silly Walks….","date":"2015-11-17","mins":"5:17 pm","url":"https://shroudstory.com/2015/11/16/dematerialization-101/","cat":"news_&_views","title":"Dematerialization 101"},{"id":"comment-196514","author":"nabber","post":"As I said, Charles, there is no way the Shroud was at the foot of the Cross..","date":"2015-04-16","mins":"8:51 am","url":"https://shroudstory.com/2015/04/15/fra-giovanni-angelicos-lamentation-to-be-displayed-with-the-shroud/","cat":"2010","title":"Fra Giovanni Angelico’s ‘Lamentation’ to be Displayed with the Shroud"},{"id":"comment-196401","author":"nabber","post":"Note that this Angelico “shroud” is shown at the foot of the Cross. It has been theorized by many that there was a sheet of some kind used at the Cross to lay His body down on, and used as well to transport Him to the tomb — which of course could not have been The Shroud used in the Tomb. This other sheet would have been greatly smeared by blood in the process, and could not have been the same sheet as The Shroud. Therefore, Angelico did not have to have been trying to portray The Shroud..","date":"2015-04-15","mins":"7:50 am","url":"https://shroudstory.com/2015/04/15/fra-giovanni-angelicos-lamentation-to-be-displayed-with-the-shroud/","cat":"2010","title":"Fra Giovanni Angelico’s ‘Lamentation’ to be Displayed with the Shroud"},{"id":"comment-196625","author":"nabber","post":"Hugh, a past artist showing the Cross (or not), they probably were not engaged at all in any discussion over the existence of one/multiple shrouds, as we are today. I’m just making the point that a “carrying stretcher” type shroud would have been quite smeared with blood and therefore could not have been the Shroud of the Tomb. It seems to me that we in retrospect should not be wondering about why this particular representation has so little similarity to the So T..","date":"2015-04-17","mins":"7:49 am","url":"https://shroudstory.com/2015/04/15/fra-giovanni-angelicos-lamentation-to-be-displayed-with-the-shroud/","cat":"2010","title":"Fra Giovanni Angelico’s ‘Lamentation’ to be Displayed with the Shroud"},{"id":"comment-201083","author":"nabber","post":"2 Corinthians, Chapter 12, verses 8 9: (Paul’s Thorn and God’s Grace) …8 Concerning this I implored the Lord three times that it might leave me. 9 And He said to me, “My grace is sufficient for you, for power is perfected in weakness.” Paul, telling us the words of Jesus…...","date":"2015-06-04","mins":"12:56 pm","url":"https://shroudstory.com/2015/06/03/homeless-from-rome-visit-shroud-of-turin/","cat":"2015","title":"Homeless From Rome Visit Shroud of Turin"},{"id":"comment-201128","author":"nabber","post":"Sampath, the entire New Testament is inspired by God. If Matthew says that Jesus said something, the words of the Son of God, we take it as truth. If Paul says that Jesus said something, the words of the Son of God, we take that as truth also. There is no priority. This is mainstream Catholic and Protestant theology..","date":"2015-06-05","mins":"7:23 am","url":"https://shroudstory.com/2015/06/03/homeless-from-rome-visit-shroud-of-turin/","cat":"2015","title":"Homeless From Rome Visit Shroud of Turin"},{"id":"comment-215191","author":"nabber","post":"Dr. Soons acknowledged my email to him back in April on this matter, and I assumed he would then take that picture down as an example of superficiality of the image. He never did. I’m a little embarrassed for him..","date":"2015-11-27","mins":"3:13 pm","url":"https://shroudstory.com/2015/11/27/i-hope-this-helps/","cat":"reader_inquiry","title":"I Hope This Helps"},{"id":"comment-172819","author":"nabber","post":"Conspire, yes. Fact: Oswald visited (or attempted to visit) the Soviet Embassy in Mexico City. Because he passed out “Fair Play for Cuba” leaflets in New Orleans, there is just no way to completely know who his contacts were, for that..","date":"2014-11-24","mins":"12:08 pm","url":"https://shroudstory.com/2014/11/24/ignoring-the-weight-of-the-evidence/","cat":"news_&_views","title":"Ignoring the Weight of the Evidence"},{"id":"comment-172813","author":"nabber","post":"I get your analogy using Oswald. But for the sake of accuracy, let’s be clear: the operation of that bolt rifle in the agreed upon amount of seconds when JFK was in vew has been tested many times. It was clearly easily repeated in a number of tests. Facts are facts..","date":"2014-11-24","mins":"11:14 am","url":"https://shroudstory.com/2014/11/24/ignoring-the-weight-of-the-evidence/","cat":"news_&_views","title":"Ignoring the Weight of the Evidence"},{"id":"comment-204180","author":"nabber","post":"Dan, don’t ever forget that the Catholic Church does not recognize the apostolic succession of priests of the Anglican and/or Episcopal churches. Therefore, even if you believe in transubstantiation (and I, a non Catholic, happen to), the RC Church does not believe it is legitimate even in a properly conducted Anglican Mass. So they really have no problem being in the same church area or preaching there while the Protestant charade (sorry, but accurate) goes on, in the name of ecumenism. Their minds are made up and there is no change possible; especially about women priests. (Pope JP II spoke ex cathedra on this subject). And, there is this: http://catholicexchange.com/ten facts most catholics don%e2%80%99t know but should #7: There is No Salvation Outside the Catholic Church: This dogma was declared at the Fourth Lateran Council and is a source of confusion for Catholics and non Catholics alike. It does not mean that non Catholics cannot achieve salvation. “Individuals who are unaware that the Catholic Church is the one, true Church may still achieve salvation through the merits of the Church, despite their lack of knowledge.”.","date":"2015-06-30","mins":"2:21 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","title":"Off Topic Warning:  About the Eucharist and Then Some"},{"id":"comment-151171","author":"nabber","post":"Dan, NEVER use “never”, “ever”, or “never ever” in a (philosophical) argument….","date":"2014-09-15","mins":"9:42 am","url":"https://shroudstory.com/2014/09/13/mystery-is-never-ever-proof-of-anything/","cat":"science_and_religion","title":"Mystery is never ever proof of anything"},{"id":"comment-204195","author":"nabber","post":"Daveb, I remain hopeful for Unification. I went to RC school for 8 9 10 11 grades, did very well in the Catechism (as an Episcopalian) and still have a fondness for the RC Church. I do find them to be very inclusive. The list of 10 things that Catholics ought to know that they “believe”, is, however, in concrete..","date":"2015-06-30","mins":"5:08 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","title":"Off Topic Warning:  About the Eucharist and Then Some"},{"id":"comment-204188","author":"nabber","post":"David, you are to believe whatever floats your boat. The point is that the RC Church does not believe in the priesthood of Protestant priests, and so most certainly DOES NOT recognize the consecration of Protestant Eucharist(s). The Protestant religions don’t even believe in transubstantiation anyway (officially). Once they are Roman Catholic priests, there is no longer any issue. But they still have to have a RC Bishop “lay hands” upon them..","date":"2015-06-30","mins":"3:12 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","title":"Off Topic Warning:  About the Eucharist and Then Some"},{"id":"comment-204450","author":"nabber","post":"Let’s make it clear what JP 2 was saying: he was witnessing to an infallible dogma by the ordinary and universal Magisterium of the Roman Catholic Church. So, while Jim Carney is correct about the 2 official Papal ex cathedra statements, a Papal Statement attesting to an infallible Magisterium, is, in effect, infallible. And Jim needs to read: http://catholicexchange.com/ten facts most catholics don’t know but should And Jim can spare me all the “peace and love” between cafeteria Catholics and the rest. And I’m not RC..","date":"2015-07-03","mins":"10:54 am","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","title":"Off Topic Warning:  About the Eucharist and Then Some"},{"id":"comment-204261","author":"nabber","post":"So, Jim, you are a lifelong and devout Catholic. How do you so quickly cast aside JP II’s ex cathedra statement on women priests? You are some kind of Catholic, but my good friend Juan Carlos would label you a “cafeteria Catholic.” “God loves all of us ….and welcomes all those with good hearts into His eternal kingdom regardless of their religious affiliation or even if they have any religious belief at all. ” Sounds good–and goes over very well down at the corner Unitarian Church (the guys who believe, you know, that Jesus was a good teacher.) Your quote is not what the RC Church teaches. But I guess as a RC, you get to make up your own rules. It’s a Brave New World..","date":"2015-07-01","mins":"2:07 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","title":"Off Topic Warning:  About the Eucharist and Then Some"},{"id":"comment-204452","author":"nabber","post":"I think you may have misunderstood what was going on with your Protestant friend. His refusal to receive Catholic communion, out of acting on his own will, was invalid. The RC priest is forbidden to give communion to Protestants..","date":"2015-07-03","mins":"10:57 am","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","title":"Off Topic Warning:  About the Eucharist and Then Some"},{"id":"comment-204511","author":"nabber","post":"AONU said, ” The image on the shroud isn’t made obvious in the text, particularly John’s Gospel”. True enough, but there are parts of the background to the New Testament and its authors, that were left behind by other sources such as the early Church Fathers. Spain’s Mozarabic Rite Easter Week Liturgy is documented back to the late 500s AD – “Peter ran with John to the tomb and saw the recent marks of the dead and risen Man on the linen.” — St. Isidore, the Bishop of Seville, Spain, is considered the author; he visited Constantinople in 582..","date":"2015-07-04","mins":"9:35 am","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","title":"Off Topic Warning:  About the Eucharist and Then Some"},{"id":"comment-204508","author":"nabber","post":"You seem to be under the impression that RC priests forbid things because they are enforcing some vague doctrine. That couldn’t be further from the truth. They are enforcing the Magisterium that makes up what the Church is and what it stands for. Individuals by themselves cannot receive the Inspired word, regardless. If you are not willing to enforce it in your own life, then “you may be a cafeteria Catholic.”.","date":"2015-07-04","mins":"9:27 am","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","title":"Off Topic Warning:  About the Eucharist and Then Some"},{"id":"comment-204129","author":"nabber","post":"Multiverses: the last gasp of atheist/agnostic scientists to avoid the God of the Big Bang. The universal acknowledgement of the Big Bang in the 20th Century was the biggest blow to Atheism (a religion, ironically) in History. Some of the atheist leaders immediately set to work on multiverses. Multiverses, string theory, 17 dimensions: absolutely no physical proof. Nice mental exercise. Even allowing for multiverses, they are still stuck with the Ultimate Cause. There is no approaching those scientists who cannot allow for both Natural and Supernatural levels of existence (I suggest reading Paul Davies). An endless argument ensues…..","date":"2015-06-30","mins":"7:50 am","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","title":"Off Topic Warning:  About the Eucharist and Then Some"},{"id":"comment-195728","author":"nabber","post":"Yikes, Kelly. Dr. Soons is using this photo on the shroud3d website to supposedly illustrate the superciality of the IMAGE, not of BLOOD (which of course can soak all the way through the entire cloth). It appears I will need another, different photo to show how the image lies on the very top of the fibrils….. Thank you..","date":"2015-04-08","mins":"8:48 am","url":"https://shroudstory.com/2015/04/07/seeking-help-to-identify-an-image-called-superficiality/","cat":"reader_inquiry","title":"Seeking Help To Identify an Image Called Superficiality"},{"id":"comment-206751","author":"nabber","post":"Always with the negative waves, Moriarity…..","date":"2015-07-28","mins":"7:04 am","url":"https://shroudstory.com/2015/07/28/posting-for-a-slow-news-day/","cat":"uncategorized","title":"Posting For a Slow News Day"},{"id":"comment-195938","author":"nabber","post":"Thank you so much, Dr. Heimburger..","date":"2015-04-10","mins":"9:37 am","url":"https://shroudstory.com/2015/04/07/seeking-help-to-identify-an-image-called-superficiality/","cat":"reader_inquiry","title":"Seeking Help To Identify an Image Called Superficiality"},{"id":"comment-196544","author":"nabber","post":"I received an acknowledgement finally from Dr. Soons, on 16 April..","date":"2015-04-16","mins":"12:14 pm","url":"https://shroudstory.com/2015/04/07/seeking-help-to-identify-an-image-called-superficiality/","cat":"reader_inquiry","title":"Seeking Help To Identify an Image Called Superficiality"},{"id":"comment-195604","author":"nabber","post":"Some have told me that the dark spots could be from the blood areas of the Shroud. Dr. Soons seems to be saying on his shroud3d website that these spots are where the image is, hence, “Superficiality”. Does anyone have the answer? If the photo is originally from Baima Ballone, and thinking about his work, then perhaps it is blood?.","date":"2015-04-07","mins":"8:08 am","url":"https://shroudstory.com/2015/04/07/seeking-help-to-identify-an-image-called-superficiality/","cat":"reader_inquiry","title":"Seeking Help To Identify an Image Called Superficiality"},{"id":"comment-195599","author":"nabber","post":"Thank you so much, Kelly..","date":"2015-04-07","mins":"7:25 am","url":"https://shroudstory.com/2015/04/07/seeking-help-to-identify-an-image-called-superficiality/","cat":"reader_inquiry","title":"Seeking Help To Identify an Image Called Superficiality"},{"id":"comment-197170","author":"nabber","post":"Nice hatchet job by someone who is surely having his world view challenged…...","date":"2015-04-22","mins":"7:43 am","url":"https://shroudstory.com/2015/04/22/short-shrift-article-at-huffpo-uk/","cat":"2015","title":"Short Shrift Article at HuffPo-UK"},{"id":"comment-197171","author":"nabber","post":"“Recent Popes have been careful to avoid pronouncing on the issue … opting to highlight its more symbolic resonance.” Uhhhhh….NO. That’s an out and out lie. There is little to nothing of the symbolic in these words: Pope Pius XI (1922 1939): “… certainly not the work of any human hand.” Pope Pius XII (1939 1958): “The linen in which Joseph of Arimathea enveloped the sacred remains of our Lord Jesus Christ.” Pope John XXIII (1958 63): “This can only be the Lord’s own doing.” Pope Paul VI (1963 78): “…The image from the Holy Shroud reveals to us the human and divine personality of Christ.” Pope John Paul II (1978 2005): “The Holy Shroud is the most splendid relic of the Passion and Resurrection.” Pope Benedict XVI (2005 2013): “… a photographic document of the darkest mystery of faith — that of Christ’s Crucifixion and Resurrection.” Pope Francis I (2013 ): “By means of the Holy Shroud, the unique and supreme Word of God comes to us”.","date":"2015-04-22","mins":"7:49 am","url":"https://shroudstory.com/2015/04/22/short-shrift-article-at-huffpo-uk/","cat":"2015","title":"Short Shrift Article at HuffPo-UK"},{"id":"comment-172970","author":"nabber","post":"Oh dear, You’re right, CB, the message is not getting through — to you. How exactly does a hoaxer come to think up a simulation of a sweat imprint, if there has never been one seen on a shroud? Can you cite an instance of even one, medieval or non medieval? If no one has seen one, how does a hoaxer think he will raise up a certainty in the the medieval mind that that it is a sweat imprint?.","date":"2014-11-25","mins":"1:42 pm","url":"https://shroudstory.com/2014/11/24/social-encyclopedia-ing-the-shroud-of-turin-and-channel-5/","cat":"wikipedia_content","title":"Social Encyclopedia-ing, the Shroud of Turin and Channel 5"},{"id":"comment-172950","author":"nabber","post":"Archaeologists have found, it is said, “thousands” of shrouds over the many decades. Let’s say it was only “hundreds.” What percentage of those bodies were sweaty? How manyof those left a sweat imprint? One sweaty imprint is an Impossibility..","date":"2014-11-25","mins":"11:06 am","url":"https://shroudstory.com/2014/11/24/social-encyclopedia-ing-the-shroud-of-turin-and-channel-5/","cat":"wikipedia_content","title":"Social Encyclopedia-ing, the Shroud of Turin and Channel 5"},{"id":"comment-173112","author":"nabber","post":"It was not a sweat imprint, and here’s why: As the Wiki says, “there is no doubt that there was an image displayed in Rome in the thirteenth, fourteenth and fifteenth centuries which was known as the Veil of Veronica. The history is, however, PROBLEMATIC.” Nowhere can you reliably document that the image was a sweat print. The only inspection: in 1907 in St. Peter’s when Jesuit art historian Joseph Wilpert inspected the image, he saw only a piece of light colored material, faded, with two faint rust brown stains. On the contrary, all the medieval paintings of the Veronica intended to show an actual colored portrait of Christ’s face (miraculously imprinted, they thought) and were not portrayals of a sweat print, leading any honest analyst to conclude that the Veronica was originally a PAINTING. Even the common medieval “rube” would have known that a face print is not created from someone rubbing the sweat and blood off of a man’s face–only a messy blob. Therefore, anyone, cleric, artist, common man, would have supposed the Veronica was a miraculous image and not a sweat imprint..","date":"2014-11-26","mins":"9:47 am","url":"https://shroudstory.com/2014/11/24/social-encyclopedia-ing-the-shroud-of-turin-and-channel-5/","cat":"wikipedia_content","title":"Social Encyclopedia-ing, the Shroud of Turin and Channel 5"},{"id":"comment-216857","author":"nabber","post":"Dan, the days won’t be the same without you and your “baby.” Thank you, thank you, thank you. I’ll even miss Hugh and Colin. May God bless your future endeavors. Don’t be a stranger….","date":"2015-12-19","mins":"11:36 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-202653","author":"nabber","post":"David: “It is a test, for some, of our own faith – to see what is it exactly we do believe in: Jesus or an icon.” False choice/analogy by you. There is clearly another outcome: we believe in Jesus AND in the icon/relic. “OR” is a false choice. But thanks for the poke in the eye made in the guise of reasonable ness..","date":"2015-06-18","mins":"11:34 am","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","title":"The Masters of Comedy in Piedmont"},{"id":"comment-196689","author":"nabber","post":"Actually, a better and more accurate quote by John Paul II was, “The Holy Shroud is the most splendid relic of the Passion and Resurrection.”.","date":"2015-04-18","mins":"7:37 am","url":"https://shroudstory.com/2015/04/18/the-shroud-of-turin-in-the-wall-street-journal/","cat":"2015","title":"The Shroud of Turin in the Wall Street Journal"},{"id":"comment-196857","author":"nabber","post":"JP2 did say that the “Church” (i.e., Vatican so called scientists) has no specific competence to pronounce. But JP2’s comment re: “The Holy Shroud is the most splendid relic of the Passion and Resurrection” stands as an Absolute on the matter. He can pronounce the Truth as he sees it, while a bunch of Vatican bureaucrats are indeed incapable. The Cardinal’s Scientific Advisor in the matter of the C 14 testing did such a “great job” of advising on the science, didn’t he? Ha..","date":"2015-04-19","mins":"4:27 pm","url":"https://shroudstory.com/2015/04/18/the-shroud-of-turin-in-the-wall-street-journal/","cat":"2015","title":"The Shroud of Turin in the Wall Street Journal"},{"id":"comment-196858","author":"nabber","post":"Have you seen Roman first century depictions of Israelites, such as Josephus? Have you seen Agemian’s portrait of Jesus from the Shroud of Turin? What the heck do you think 1st Century Israelites looked like?.","date":"2015-04-19","mins":"4:30 pm","url":"https://shroudstory.com/2015/04/18/the-shroud-of-turin-in-the-wall-street-journal/","cat":"2015","title":"The Shroud of Turin in the Wall Street Journal"},{"id":"comment-196953","author":"nabber","post":"Angel, I’d like to know your basis for saying Christ’s complexion was “more than likely olive”. I haven’t seen depictions of First Century Jews that would back that up. Attempts to equate today’s Middle Easterners with First Century Jews is misguided at best. It doesn’t appear to me that Roman depictions of Flavius Josephus (a.k.a. Joseph ben Matityahu in Hebrew) could be considered olive complected. Thomas Heaphy’s book, (1880), The Likeness of Christ, shows early drawings / paintings from the catacombs of Rome, dated First or Second Century which show Christ and the Apostles with normal whitish faces, and certainly not olive..","date":"2015-04-20","mins":"2:56 pm","url":"https://shroudstory.com/2015/04/18/the-shroud-of-turin-in-the-wall-street-journal/","cat":"2015","title":"The Shroud of Turin in the Wall Street Journal"},{"id":"comment-198277","author":"nabber","post":"Do you see me in the future? May 18th?.","date":"2015-05-04","mins":"7:36 am","url":"https://shroudstory.com/2015/05/04/tweeted-picture-for-today-are-we-there-yet-almost/","cat":"2015","title":"Tweeted Picture for Today:  Are We There Yet? Almost!"},{"id":"comment-204148","author":"nabber","post":"Http://www.drroyspencer.com/research articles/ Better read this first about “global warming”. Then we all can talk…...","date":"2015-06-30","mins":"11:01 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-204155","author":"nabber","post":"Wow, you are so open minded. And quoting a super liberal website. Nice. I happen to know Roy Spencer, and know that the piece “debunking” Spencer is itself bunk..","date":"2015-06-30","mins":"11:32 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-204159","author":"nabber","post":"Truth in advertising: the figure of 97% consensus has been thoroughly debunked, and yet there it is on the NASA website. NASA has been compromised by liberal fascism. 49 former NASA scientists and astronauts sent a letter to NASA Administrator Charles Bolden in 2012 admonishing the agency for its role in advocating a high degree of certainty that man made CO2 is a major cause of climate change while neglecting empirical evidence that calls the theory into question. The group, which includes seven Apollo astronauts and two former directors of NASA’s Johnson Space Center in Houston, are dismayed over the failure of NASA, and specifically the Goddard Institute For Space Studies (GISS), to make an objective assessment of all available scientific data on climate change. They charge that NASA is relying too heavily on complex climate models that have proven scientifically inadequate in predicting climate only one or two decades in advance. Select excerpts from the letter: •“The unbridled advocacy of CO2 being the major cause of climate change is unbecoming of NASA’s history of making an objective assessment of all available scientific data prior to making decisions or public statements.” •“We believe the claims by NASA and GISS, that man made carbon dioxide is having a catastrophic impact on global climate change are not substantiated.” •“We request that NASA refrain from including unproven and unsupported remarks in its future releases and websites on this subject.”.","date":"2015-06-30","mins":"12:20 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-204162","author":"nabber","post":"P.s., anoxie: It is unwise of you to latch onto a weblink using the term “denier” for Dr Roy Spencer and his colleagues. They are honest skeptics. “Denier” was coined by the super liberal columnist Ellen Goodman, specifically to liken them to the term “Holocaust Denier”, which she readily admitted. Subsequently adopted by the whole Global Warming crowd. This propaganda technique is so typical of liberal fascism. In response, Dr Spencer coined or perhaps popularized the term “Green Nazis”, which is ironic in the extreme. The type of ad hominem attack on Dr Spencer is not what we expect of scientists responding to skeptics who have data that they disagree with..","date":"2015-06-30","mins":"12:33 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-204164","author":"nabber","post":"Try to follow along. The letter is just one example to show how NASA has drifted away from Science. OTOH, it is easy in the extreme to debunk the 97% horse puckey….","date":"2015-06-30","mins":"12:52 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-204168","author":"nabber","post":"Oh, I don’t know anoxie, why don’t you read the following, and then you decide: http://wattsupwiththat.com/2014/12/19/97 articles refuting the 97 consensus on global warming/ And, there’s not a person on this blog who can’t see the humor in this little piece of NASA front page data: Global temperature Up +1.4 degrees F since 1880. Right. Data coming from what? And if it were accurate, coming from human activity? Data? …and I haven’t considered your being serious even once…..","date":"2015-06-30","mins":"1:15 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-204187","author":"nabber","post":"Again, you don’t get it. There is no way to know whether global temperatures are rising now, because natural year to year variability in global temperature is so large, with warming and cooling occurring all the time. The magnitude of recent warming is somewhat uncertain due to problems in making long term temperature measurements WITH THERMOMETERS without those MEASUREMENTS BEING CORRUPTED by a variety of non climate effects. There is no way to know if temperatures are continuing to rise now. If we look at a more recent period of time, since the record warm year of 1998, one could say that it has cooled in the last 17 years. We still don’t know whether warming is happening now or will happen in the future. In the longer term, hundreds to thousands of years, there is considerable indirect, proxy evidence (not from thermometers) of both warming and cooling. Since humankind can’t be responsible for these early events, it is evidence that Nature can cause warming and cooling. If that is the case, it then opens up the possibility that some or most of the warming in the last 50 years has been natural, too..","date":"2015-06-30","mins":"3:05 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-204170","author":"nabber","post":"Fracking dangerous? Data? http://www.spiked online.com/newsite/article/ten big fat lies about fracking/13944 I like consumerism. Good luck without your T.P., David…..","date":"2015-06-30","mins":"1:27 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-204174","author":"nabber","post":"No, the easiest position in the world is to be a sycophantic liberal blindly following bad science..","date":"2015-06-30","mins":"1:35 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-204173","author":"nabber","post":"David: we need to stop having so many children, or else we will run out of global resources. Malthus proved it, right? Maybe a good policy like they have in China would help. BTW, about 15% of recycling in the U.S. Comes from residential areas, 85% from corporations. Our residential effort is trivial. Meanwhile we are throwing into the garbage the new Eco light bulbs full of mercury — wow, that made sense…...","date":"2015-06-30","mins":"1:33 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-204181","author":"nabber","post":"Gee, whiz, Dave, I wish my big brother was here to help me beat up on you….. P.s. You using the term “you of all people” — you don’t know me nor do you know “squat all” about me. And you wouldn’t know “Irony” if it ran over you..","date":"2015-06-30","mins":"2:32 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-204190","author":"nabber","post":"That was indeed a nice turn of a phrase..","date":"2015-06-30","mins":"3:17 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-197172","author":"nabber","post":"Not exactly true, Andy, about an official position. Who cares that some Vatican bureaucrats have not stated a position, when the Popes have in fact been clear: Pope Pius XI (1922 1939): “… certainly not the work of any human hand.” Pope Pius XII (1939 1958): “The linen in which Joseph of Arimathea enveloped the sacred remains of our Lord Jesus Christ.” Pope John XXIII (1958 63): “This can only be the Lord’s own doing.” Pope Paul VI (1963 78): “…The image from the Holy Shroud reveals to us the human and divine personality of Christ.” Pope John Paul II (1978 2005): “The Holy Shroud is the most splendid relic of the Passion and Resurrection.” Pope Benedict XVI (2005 2013): “… a photographic document of the darkest mystery of faith — that of Christ’s Crucifixion and Resurrection.” Pope Francis I (2013 ): “By means of the Holy Shroud, the unique and supreme Word of God comes to us”.","date":"2015-04-22","mins":"7:53 am","url":"https://shroudstory.com/2015/04/22/ye-shall-know-them-by-their-photographs/","cat":"2015","title":"Ye shall know them by their photographs"},{"id":"comment-197295","author":"nabber","post":"I think the Popes say what they mean. “The Vatican” says all kinds of things, some of which it retracts a few weeks later…..","date":"2015-04-23","mins":"7:36 am","url":"https://shroudstory.com/2015/04/22/ye-shall-know-them-by-their-photographs/","cat":"2015","title":"Ye shall know them by their photographs"}]
