[{"id":"comment-216135","author":"nabber","post":"Reading the verbatim words of the sermon is not “reading into” the sermon…..","date":"2015-12-10","mins":"11:08 am","url":"https://shroudstory.com/2015/12/10/allusions/","cat":"guest_posting","title":"Allusions"},{"id":"comment-213500","author":"nabber","post":"Hatfield: “after all, Jesus refused to use spectacular signs to authenticate himself.” Does this guy really read the New Testament? Or is he just unbelievably selective in doing so? John 14:11. Believe me when I say that I am in the Father and the Father is in me; or at least believe on the evidence of the miracles themselves. Acts 1:3 — “after His suffering, He presented Himself to them and gave many convincing proofs that He was alive.” Spectacular signs? How about raising people from the dead?.","date":"2015-10-24","mins":"10:14 am","url":"https://shroudstory.com/2015/10/24/and-now-you-have-something-to-do-this-weekend/","cat":"other_blogs","title":"And now you have something to do this weekend"},{"id":"comment-208070","author":"nabber","post":"David: That is the worst logic I have seen and I cannot believe you wrote that in public. The “divinely inspired Scriptures” are de facto not human constructs, because they were directed by the guiding hand of the Holy Spirit. If you don’t understand this, you have a limited understanding of Christianity. One does not have the unique and supreme Jesus Christ come to him from a human construct. I believe that the importance of the Shroud (if authentic) comes from the Blood, not the image. Was Christ’s blood sacrifice for the sins of the world just a spiritual act? Or was it both a spiritual and physical act? [Yes]. In other words, it was necessary that His blood had also to be physically spilled. Because His sacrifice extends from the Cross infinitely in both directions, Past and Future, the Blood on the Shroud has special significance. He is still with us, bodily — as he said in Matthew, and also from the evidence of the Ascension. Perhaps the Blood on the Shroud is a reminder of that..","date":"2015-08-12","mins":"11:09 am","url":"https://shroudstory.com/2015/08/12/does-pope-francis-believe-the-shroud-is-real/","cat":"other_blogs","title":"Does Pope Francis Believe the Shroud is Real?"},{"id":"comment-208076","author":"nabber","post":"We’re not talking of the physically produced Bible(s), and that is a red herring. But we do take our faith from the Gospels (and letters), and analogous to ink on parchment, the Shroud is a sort of Photograph on linen, and if authentic, represents a Fifth Gospel (IMHO). Again, the Blood is the Key..","date":"2015-08-12","mins":"11:37 am","url":"https://shroudstory.com/2015/08/12/does-pope-francis-believe-the-shroud-is-real/","cat":"other_blogs","title":"Does Pope Francis Believe the Shroud is Real?"},{"id":"comment-208073","author":"nabber","post":"OK, Louis, you’re going to get hit with it again, because you are not considering the quotations of the Popes: Pope Pius XI (1922 1939): “… certainly not the work of any human hand.” Pope Pius XII (1939 1958): “The linen in which Joseph of Arimathea enveloped the sacred remains of our Lord Jesus Christ.” Pope John XXIII (1958 63): “This can only be the Lord’s own doing.” Pope Paul VI (1963 78): “…The image from the Holy Shroud reveals to us the human and divine personality of Christ.” Pope John Paul II (1978 2005): “The Holy Shroud is the most splendid relic of the Passion and Resurrection.” Pope Benedict XVI (2005 2013): “…should be seen as a photographic document of the darkest mystery of faith — that of Christ’s crucifixion and resurrection.” Pope Francis I (2013 ): “By means of the Holy Shroud, the unique and supreme Word of God comes to us.” The Popes could not say those things above and not believe in authenticity..","date":"2015-08-12","mins":"11:13 am","url":"https://shroudstory.com/2015/08/12/does-pope-francis-believe-the-shroud-is-real/","cat":"other_blogs","title":"Does Pope Francis Believe the Shroud is Real?"},{"id":"comment-208047","author":"nabber","post":"Since I was there in May, Hugh, let me say that you really have no idea, in your “imagining”..","date":"2015-08-12","mins":"8:02 am","url":"https://shroudstory.com/2015/08/12/does-pope-francis-believe-the-shroud-is-real/","cat":"other_blogs","title":"Does Pope Francis Believe the Shroud is Real?"},{"id":"comment-208046","author":"nabber","post":"Pope Francis: “By means of the Holy Shroud, the unique and supreme Word of God comes to us.” This statement really could not be any clearer..","date":"2015-08-12","mins":"8:00 am","url":"https://shroudstory.com/2015/08/12/does-pope-francis-believe-the-shroud-is-real/","cat":"other_blogs","title":"Does Pope Francis Believe the Shroud is Real?"},{"id":"comment-208048","author":"nabber","post":"Let me translate for the theologically confused: “the unique and supreme Jesus Christ comes to us.” (Jesus Christ = Word of God)..","date":"2015-08-12","mins":"8:04 am","url":"https://shroudstory.com/2015/08/12/does-pope-francis-believe-the-shroud-is-real/","cat":"other_blogs","title":"Does Pope Francis Believe the Shroud is Real?"},{"id":"comment-201470","author":"nabber","post":"Hugh, reference yr comment on “intact” blood stains. I admit that the meaning of “intact” may be in the eye of the beholder; however, consider the Shroud blood clots in the area off of the left elbow and the blood clot on the wrist: most people who have pulled band aids off of “scabs” probably remember that the pattern left on the fabric and that left on the skin show a number of internal “holes” that is formed completely randomly. Even with the passage of time, you do not see that on those two Shroud blood clots..","date":"2015-06-10","mins":"9:04 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","title":"Guest Posting by Yannick Clément"},{"id":"comment-196688","author":"nabber","post":"Be sure to aim for a 12 foot image with about the same body and facial details as the Shroud. Otherwise, small approximate representations avail nothing…...","date":"2015-04-18","mins":"7:31 am","url":"https://shroudstory.com/2015/04/18/god-does-whatever-he-feels-like/","cat":"other_blogs","title":"God Does Whatever He Feels Like"},{"id":"comment-201335","author":"nabber","post":"Yannick, as to the “manual extraction”, what about the blood clots? Dr. Pierre Barbet, Chief Surgeon at St. Joseph Hospital in Paris, stated in his book, A Doctor at Calvary (1956): “The undisturbed aspect of the blood clots cannot be explained scientifically.” A blood clot must be moist to transfer to linen. On Friday evening, if the linen had been lifted off of the body, moist clots would have smeared the linen. By early Saturday, any blood clots would have dried up and been attached firmly to both skin and cloth. At that point, lifting the linen off of the body would have broken up many, if not all, of the dry blood clots. However, blood clots on the Shroud show up perfectly intact, not smeared or broken. The Gospels record that the Body was gone by Sunday morning, and that undisturbed linens were left behind. Therefore, the BLOOD EVIDENCE shows that NO ONE lifted the Shroud off of the Body..","date":"2015-06-08","mins":"10:58 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","title":"Guest Posting by Yannick Clément"},{"id":"comment-159833","author":"nabber","post":"Do the historical doubters ignore the Talmudic sources (2) also? Why would the Jews proliferate the idea that a mythical figure was a real historical figure? Why would the Apostles and the key disciples accept martyrdom for an idea supposedly emanating from a mythical figure? Are there any parallels to that?.","date":"2014-10-06","mins":"11:21 am","url":"https://shroudstory.com/2014/10/06/jerry-coyne-once-again/","cat":"other_blogs","title":"Jerry Coyne Once Again"},{"id":"comment-155228","author":"nabber","post":"This is not a new objection, but I’ll raise it again: How many 14 by 4 ft pieces of linen (let’s assume they’re fairly valuable, and time consuming to make) would you have to ruin before you “scorched” it just right (the image being a whole body length, front and back)? 50? ???.","date":"2014-09-24","mins":"4:18 pm","url":"https://shroudstory.com/2014/09/22/samuel-johnson-meets-his-match/","cat":"comments_promoted","title":"Samuel Johnson Meets His Match"},{"id":"comment-208609","author":"nabber","post":"The Pope says, “God whom we know as Allah…” ? Insanity. The “Allah” of the Koran is nothing like God. If Allah exists, it is some other entity..","date":"2015-08-20","mins":"7:57 am","url":"https://shroudstory.com/2015/08/20/the-end-if-near/","cat":"other_blogs","title":"The End if Near"},{"id":"comment-149910","author":"nabber","post":"Charles: ” Wilson’s theory only works if you have three doublings and this cannot fit with any plausible definition of tetradiplon.” How disingenuous. Charles’ main role is as a “grenade thrower” on this blog, because his world view is threatened at its core by the idea of an authentic Shroud. Here’s “plausible” mister: Looking at the full length of the Shroud “back in the day”, one would see enough evidence of folds to realize that the Shroud as folded for display in Edessa would have appeared as eight rectangles. Rectangles 1 and 2, with a fold between them, can easily be thought of as a “doublet”, and so on down with Rectangles 3 and 4, 5 and 6, 7 and 8. Four doublets. To hang on to “Tetradiplon” as the “act of physically making four folds in half” is disingenuous — Tetradiplon would have been used to describe an appearance, not an act..","date":"2014-09-10","mins":"11:02 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-208670","author":"nabber","post":"That is pure horse puckey. “Most scholars concur”? “Most ‘scholars’ named David Goulet”. Prove it. And, that’s NOT to what the Pope refers, anyway. Stay with the subject..","date":"2015-08-21","mins":"7:34 am","url":"https://shroudstory.com/2015/08/20/the-end-if-near/","cat":"other_blogs","title":"The End if Near"},{"id":"comment-149965","author":"nabber","post":"Hugh, you are a frequent contributor to the message board of the James Randi Educational Foundation (JREF), who abhors the Shroud and who is the world’s leading skeptic on everything (congratulations, BTW, on your finding of a messiah), and also of the message board of Godand Science.org, where you represent well the Darwinists. There is no way that you have a smidgin of neutrality about you on the subject of the Shroud. In this case, guilt by association actually works quite well. There is plenty wrong with your evidence, and there are many on this board who have pointed out the problems, no need for me to start now..","date":"2014-09-10","mins":"3:03 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-149915","author":"nabber","post":"No, in this case, “we cannot desist”. To paraphrase Daveb, a grenade thrower is a grenade thrower is a grenade thrower. Or, as the kids say, “it is what it is”. Hugh, on the other hand, just plants land mines…...","date":"2014-09-10","mins":"11:34 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-149951","author":"nabber","post":"That’s one of the most convoluted flows of logic seen on this blog. You didn’t come close to answering why Tetradiplon wouldn’t logically represent the state of the Shroud in Edessa (and maybe before); further, why the mythic face cloth that Jesus wiped his face on is ever discussed seriously here, I don’t get it. Objections to “tetradiplon” and “oh that pattern on the Codex does not represent herringbone” are laughable on their face and does not represent serious skepticism. Perhaps doubting of coins and flowers is somewhat serious skepticism. Naturally “Jesus’ Shroud” doesn’t threaten your world view, just the Shroud of a Divine Messiah (think: undisturbed blood clots). I’m pretty sure from your books, that wouldn’t fit in your world view. Like Hugh, you’re not really “anti Shroud”, you’re anti supernatural, anti Divine. Not neutral, ever; in fact your agenda demands that you check it before commenting here..","date":"2014-09-10","mins":"1:55 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-149957","author":"nabber","post":"Footnote 11 (quoting Charles) in the wiki is asinine. When you start maintaining that Jesus’ disciples would be fooled by Temple Priests outside the Tomb posing as angels, you have lost all credibility. I think the disciples knew Temple Priests, don’t you?.","date":"2014-09-10","mins":"2:28 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-150280","author":"nabber","post":"David, nothing about these discussions challenges my worldview. I am quite serene about the Resurrection, the “proof” for which consists mainly in the sacrifice of the Apostles of their fortunes and their lives to spread the Word, something they (nor anyone) never would have done for a lie. And of course, faith is key, so the eventual truth about the Shroud, one way or the other, has no effect on my worldview. The same cannot be said of the skeptics, who, although they deny it every time, live in dread fear that the Shroud will be proven true and in addition, the Resurrection. This does challenge their worldview, which is why so many of them spend so much time here..","date":"2014-09-11","mins":"5:07 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-149961","author":"nabber","post":"I think this review of Holy Bones, Holy Dust says it all: “I would not, however, recommend this book to my university students of medieval history because it is full of too many conclusions lightly arrived at and ill defended, provocative teasers with little substance to back them up… Freeman’s claim that Gothic architecture was a child of the relic business needs a lot more proof than he is willing to furnish.” “Provocative teasers” : has this reviewer been reading this blog? Perhaps Charles’ Amazon book ranking of #323,413 was way too high. A retired military friend of mine, not a writer, who wrote a book (really a pamphlet) on how to transition into military retirement, had a higher Amazon book ranking than that…..","date":"2014-09-10","mins":"2:40 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-205399","author":"nabber","post":"Why do you even bother?.","date":"2015-07-12","mins":"1:34 pm","url":"https://shroudstory.com/2015/07/12/the-meaning-of-solid/","cat":"other_blogs","title":"The Meaning of Solid"}]
