[{"id":"comment-198533","author":"nabber","post":"He’s deluded. Only a fuss budget would quibble about tetradiplon. If one could see 8 sections, which one could, any common man would say tetradiplon — what would you expect him to say upon seeing 8 sections — tri diplon? At U.S. Military academies, there is an Honor Code. “Quibbling” is still considered as breaking the Honor Code, i.e., lying..","date":"2015-05-07","mins":"8:12 am","url":"https://shroudstory.com/2015/05/07/charles-freeman-on-tetradiplon-and-the-video-on-shroud-com/","cat":"comments_promoted","title":"Charles Freeman on Tetradiplon and the Video on shroud.com"},{"author":"nabber","post":"Stephen, Excellent post. There is certainly more that could be pointed out about Freeman's deceptiveness, and I hope you will do so at some point..","date":"2014-10-29","mins":"4:03 AM","url":"http://theshroudofturin.blogspot.com/2014/10/my-critique-of-charles-freemans-claim.html","title":"\nMy critique of Charles Freeman's claim that the Turin Shroud was made for a medieval Easter ritual\n"},{"id":"comment-146808","author":"nabber","post":"Nice “Zinger”, anoxie, that should leave Colin speechless…..","date":"2014-08-28","mins":"11:11 am","url":"https://shroudstory.com/2014/08/28/a-response-to-a-comment-by-colin-berry/","cat":"uncategorized","title":"A Response to a Comment by Colin Berry"},{"id":"comment-148327","author":"nabber","post":"It seems to me that the mouth is open so teeth can be seen theory goes directly against the mouth is held closed by a jawband theory..","date":"2014-09-03","mins":"2:07 pm","url":"https://shroudstory.com/2014/09/03/you-might-think-st-louis-was-all-about-gary-habermas/","cat":"press_coverage","title":"You might think St. Louis was all about Gary Habermas"},{"id":"comment-148335","author":"nabber","post":"You’re right. I held my jaw in the locked position and was still able to make a toothy grin (of sorts), but ir requires that the muscles of the cheek and chin area both retract a little (rigor mortis?).","date":"2014-09-03","mins":"3:03 pm","url":"https://shroudstory.com/2014/09/03/you-might-think-st-louis-was-all-about-gary-habermas/","cat":"press_coverage","title":"You might think St. Louis was all about Gary Habermas"},{"id":"comment-148325","author":"nabber","post":"Ya gotta love that anoxie….nicely done….","date":"2014-09-03","mins":"2:01 pm","url":"https://shroudstory.com/2014/09/03/you-might-think-st-louis-was-all-about-gary-habermas/","cat":"press_coverage","title":"You might think St. Louis was all about Gary Habermas"},{"id":"comment-213436","author":"nabber","post":"“which clearly isn’t there”….according to Hugh’s prejudice. Said as a fact, when it CLEARLY is an opinion that varies among different contributors to this site. He must be a lot of fun in the classroom…..","date":"2015-10-23","mins":"1:14 pm","url":"https://shroudstory.com/2015/10/22/available-critical-summary-version-3-0/","cat":"critical_summary","title":"Available: Critical Summary Version 3.0"},{"id":"comment-213437","author":"nabber","post":"Of course, you are talking about the same sort of folks who dismiss the “Four Holes in an L shape” pattern on the Pray Codex illustration of 1192 AD as either a coincidence or that it represents some sort of architecture pattern….. That is the one they really would die for, in defense of their skepticism, because they go to embarrassingly extreme lengths to fantasize an answer. 1192 being outside of the possible range of their “precious” C 14 dating, don’t you know…...","date":"2015-10-23","mins":"1:22 pm","url":"https://shroudstory.com/2015/10/22/available-critical-summary-version-3-0/","cat":"critical_summary","title":"Available: Critical Summary Version 3.0"},{"id":"comment-213445","author":"nabber","post":"Then inexactly call them fantasies. Either way…..","date":"2015-10-23","mins":"2:54 pm","url":"https://shroudstory.com/2015/10/22/available-critical-summary-version-3-0/","cat":"critical_summary","title":"Available: Critical Summary Version 3.0"},{"id":"comment-213420","author":"nabber","post":"I have just put the two negatives side by side, the Enrie photo from Shroud Scope, and the Pia negative from the Musée de l’Élysée, Lausanne – there is a clear match of the Enrie markings found below the throat, with the Pia negative in the same location. It SIMPLY IS PRESENT in the Pia photo, and any fair minded person with normal eyesight can see it. But, there is none so blind as he who will not see…. Dan: please post the photos side by side…..","date":"2015-10-23","mins":"9:43 am","url":"https://shroudstory.com/2015/10/22/available-critical-summary-version-3-0/","cat":"critical_summary","title":"Available: Critical Summary Version 3.0"},{"id":"comment-213425","author":"nabber","post":"Not really confident about how to post a picture here, but you can go this website and see the 2 negatives side by side….. Http://www.pbase.com/nabber/image/161658524.","date":"2015-10-23","mins":"10:41 am","url":"https://shroudstory.com/2015/10/22/available-critical-summary-version-3-0/","cat":"critical_summary","title":"Available: Critical Summary Version 3.0"},{"id":"comment-213434","author":"nabber","post":"David, I wouldn’t say trick of the lighting, I would say that you can’t dismiss lighting conditions, as Hugh did. Lighting: On the Pia photo, the large crease (running across the beard) has a prominent “gleam” on the left end which the Enrie photo doesn’t have. Also, when both are magnified further, that Pia “large crease” meanders and curves its way across the neck, while the Enrie “large crease” is much more straight, which might mean the Shroud was hanging differently during the 1898 and 1931 sessions. Hugh also plays fast and loose with his blue lines and orange lines. I see it differently: Pia before and after (orange arrows): http://www.pbase.com/nabber/image/161660093 Enrie before and after (blue arrows): http://www.pbase.com/nabber/image/161660095 The real question is, what did the coin minters see on the Shroud positive image and how dark was it then? Obviously they were not allowed to see the whole object, because if they had detected it was a burial shroud, they would have known that Jesus would have been naked. Just what the two lines on a naked body really were has been the subject of several papers..","date":"2015-10-23","mins":"1:07 pm","url":"https://shroudstory.com/2015/10/22/available-critical-summary-version-3-0/","cat":"critical_summary","title":"Available: Critical Summary Version 3.0"},{"id":"comment-214140","author":"nabber","post":"I cite the 945 AD coin, not the 692 AD coin: 1. The Constantine VII 945 AD coin had two unmistakeable signs of the Shroud: the distinctive “Lock of Hair” (hair as seen by several artists), an exact match to the “3” blood mark on the forehead of the Shroud man; and the swollen cheek. Two other things add less convincing matching: the similar beard and the hair parted in the middle. 2. Constantine VII almost certainly had seen the Shroud image as full length. 3. Constantine VII knew the Shroud body image was naked. 4. Therefore, Constantine VII knew the “wrinkles” below the neck on the Image were not part of a tunic. 5. Constantine VII commissioned the image of Christ as clothed, and merely added the wrinkles below the neck as a typical tunic feature, as used before on other images in other times. 6. The “3” mark plus the swollen cheek taken together are a sure lock that the Shroud was the model and therefore the Shroud existed well before the Middle Ages. 7. The wrinkles are probably a distraction in this whole argument..","date":"2015-11-03","mins":"9:40 am","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)"},{"id":"comment-214256","author":"nabber","post":"Piero, “the Epsilon seems to be mislocated” — on a coin of this size (or any size), the ability of the “artist” to precisely locate something like the Epsilon would have been difficult indeed..","date":"2015-11-05","mins":"12:48 pm","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)"},{"id":"comment-214156","author":"nabber","post":"Here’s an enlargement of a different gold solidus of Constantine VII: http://www.pbase.com/nabber/image/161767140 It’s amazing that the die maker was able to portray such small features on the coin. One can see that the “hairs” and the swollen cheek and the eye are all similar in size, and that all were able to be captured by the die maker..","date":"2015-11-03","mins":"3:39 pm","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)"},{"id":"comment-214255","author":"nabber","post":"And you’re one of those that deny the 4 L shaped holes, herringbone weave, and blood mark on the forehead from the Pray Manuscript. You folks really undermine the anti authenticist case. (and watch your manners….).","date":"2015-11-05","mins":"12:42 pm","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)"},{"author":"nabber","post":"Stephen, there is so much political BS going on at Google that I suspect they are subtly (or not so subtly) doing this because of your first two blogs' subjects....","date":"2014-07-10","mins":"9:35 PM","url":"http://theshroudofturin.blogspot.com/2014/07/stephen-e-jones-home-page-wont-harm.html","title":"\nStephen E. Jones' home page WON'T harm your computer!\n"},{"id":"comment-201782","author":"nabber","post":"“IGNORE those anonymous art historians behind the curtain!”.","date":"2015-06-13","mins":"6:15 am","url":"https://shroudstory.com/2015/06/12/thomas-de-wesselow-on-why-the-image-is-unlikely-by-an-artist/","cat":"video","title":"Thomas De Wesselow On Why the Image is Unlikely by an Artist"},{"id":"comment-201781","author":"nabber","post":"Freeman = Oscar “Humbug” Diggs…...","date":"2015-06-13","mins":"6:13 am","url":"https://shroudstory.com/2015/06/12/thomas-de-wesselow-on-why-the-image-is-unlikely-by-an-artist/","cat":"video","title":"Thomas De Wesselow On Why the Image is Unlikely by an Artist"},{"id":"comment-201731","author":"nabber","post":"We would say in America, “Charles Freeman can’t even carry De Wesselow’s jockstrap….”.","date":"2015-06-12","mins":"3:26 pm","url":"https://shroudstory.com/2015/06/12/thomas-de-wesselow-on-why-the-image-is-unlikely-by-an-artist/","cat":"video","title":"Thomas De Wesselow On Why the Image is Unlikely by an Artist"}]
