[{"id":"comment-102808","author":"david_bowman","post":"On “Heaven is for Real” Two questions: Were Colton Burpo’s experiences while in the coma state veridical? This question must be asked since the mere having of an experience is no guarantee of the reality of its object. The second question is whether the experiences, veridical or not, occurred wholly independently of brain functioning. The two questions are connected. If it could be shown that the experiences were generated by a minimally (mal)functioning brain, then then this would be a reason to doubt the veridicality of the experiences. (Analogy: if I know that my unusual experiences are the result of the ingesting of LSD 25, then I have reason to doubt the veridicality of the experiences.) Another concern of mine is this. How does Colton Burpo’s father know that son’s wonderful experiences didn’t suddenly arise just as the cortex was coming back into action just before his eyes popped open? So even if his cortex was for a long time completely nonfunctional, the experience he remembers could have been simply a dream that arose while the cortex was coming back ‘on line.’ My point is not that the book has not given us evidence that mental functioning occurs in the absence of brain activity; I believe he has. My point is that the evidence is not compelling (as of now)..","date":"2014-04-23","mins":"12:00 pm","url":"https://shroudstory.com/2014/04/21/heaven-is-for-real-the-akiane-prince-of-peace-the-isa-mosaic-and-the-shroud-of-turin/","cat":"akiane_kramarik","title":"Heaven is for Real, the Akiane Prince of Peace, the ISA Mosaic and the Shroud of Turin"},{"id":"comment-102811","author":"david_bowman","post":"Corrected Sentence: I believe IT has..","date":"2014-04-23","mins":"12:05 pm","url":"https://shroudstory.com/2014/04/21/heaven-is-for-real-the-akiane-prince-of-peace-the-isa-mosaic-and-the-shroud-of-turin/","cat":"akiane_kramarik","title":"Heaven is for Real, the Akiane Prince of Peace, the ISA Mosaic and the Shroud of Turin"}]
