[{"id":"comment-99308","author":"david_bowman","post":"If your curiosity was piqued, here are the subdivisions of holographic photography: “120° Integral Stereogram (Multiplex) A type of white light transmission hologram which is formed by recording multiple photographs onto a single hologram. The resulting image usually only provides horizontal parallax, and often provides the effect of an animated three dimensional image. 120° integral stereograms are not complete cylinders 360° Integral Stereogram (Multiplex) A type of white light transmission hologram which is formed by recording multiple photographs onto a single hologram. The resulting image usually only provides horizontal parallax, and often provides the effect of an animated three dimensional image. 360° integral stereograms are complete cylinders, and are often mounted on a motor driven base which allows them to rotate at a constant speed. Computer Generated Stereogram Hologram produced from multiple 2 d perspective recordings of computer generated images. Images can be analog, animated, reduced or enlarged. This is an alternative to the analog hologram process, in which the subject is imaged directly onto the film with a laser exposure. Dichromated Gelatin (reflection) Dichromated Gelatin (DCG) is a chemical gelatin mix that produces very bright images in a golden yellow color. The images have the least range of depth, but they are viewable in normal room light without special spotlights. Embossed Mylar Foil (white light transmission) Holograms stamped on foil in large numbers, from a transmission hologram master, and often used in applications where high security is desired. Embossed holograms are transmission holograms with a mirror. The holographic information is transferred from light sensitive glass plates to nickel embossing shims. The holographic images are “printed” by stamping the interference pattern onto plastic and then backing the images with a light reflecting foil. The resulting hologram can be duplicated millions of times for a few cents apiece. Holographic Stereogram Hologram produced from movie footage of a rotating subject. Images can be computer generated, animated, reduced or enlarged, or photographed on site. This is an alternative to the original hologram process, in which the subject is imaged directly onto the film with a laser exposure. Embossed holograms Embossed holograms are used in the security industry because they are difficult to counterfeit. Laser Transmission A type of hologram which is constructed by causing the object beam and reference beam to interfere from the same side of the holographic film or plate. In order to view the reconstructed image, semi coherent filtered light or very coherent laser light is transmitted to the viewer through the hologram. Other types of holograms use a laser transmission hologram as the master, from which copies are made. This is the earliest type of hologram developed by Leith and Upatniks in 1962. Transmission holograms are lit from the rear (like a photographic transparency) and bend light as it passes through the hologram to your eyes to form the image.Rainbow Holograms See “White Light Transmission Holograms.” Reflection Holograms Reflection Holograms are lit from the front, reflecting the light to you as you view it, like a painting or photograph hung on a wall. Different film emulsions produce images with different characteristics. (Silver Halide, Dichromated Gelatin, Photo Polymer) White Light Transmission Holograms White light transmission holograms are illuminated with incandescent light (white light) and produce images that contain the rainbow spectrum of colors. The colors change as the viewer moves up and down and are often called “rainbow” holograms. Holographers have developed considerable control over the colors displayed in this type hologram to produce images in a specific color or in near full, natural color. Transmission holograms are lit from the rear (like a photographic transparency) and bend light as it passes through the hologram to your eyes to form the image.”.","date":"2014-04-14","mins":"5:22 pm","url":"https://shroudstory.com/2014/04/12/petrus-soons-to-present-his-scientific-research-at-the-uninversity-of-miami/","cat":"event","title":"Petrus Soons to Present His Scientific Research at the University of Miami"},{"id":"comment-99616","author":"david_bowman","post":"1) Well, Soons image seems to be on axis, and, the biggest challenge of the on axis holography are the twin images: a conjugate image locating right in front of the true image. Instead of sending the reference beam and object beam in line, it has been proposed that separating and sending them at diff erent angles. However, to separate the beam was di\u000efficult in practice at that time, when the best coherent source was the high pressure mercury lamp, with coherent length of only about 0.1mm. The first o ff axis hologram worked until two men, Leith and Upatnieks, came up an optical trick: to choose one line of the mercury lamp and send it to a grating. Two di fferent orders of the light after the grating are used as the reference and object beam, which are automatically propagating at di fferent angles. With this off axis hologram it is possible to detect the object wave without being disturbed by the reference beam which propagates along another direction. Off axis holography requires the use of a laser for coherence requirement. Soons should give us the off axis conjugate image. 2) The fundamental di fference between a transmission hologram and a refection hologram lies in the direction of the interference fringes that are recored inside the photosensitive emulsion. In a transmission hologram, the reference wave and object wave entering the emulsion from the same side produce interference fringes in planes that are perpendicular to the plane of the emulsion; while in a reflection hologram, the reference wave and object wave entering the emulsion from di fferent sides produce interference fringes in planes that are parallel to the plane of the emulsion. Observation of the image in a transmission hologram requires the same reference beam that exposed it, and viewing through the plate; while in a reflection hologram, a spot light or sunlight is good enough and the image is observed by viewing the reflection from the plate. We should anticipate Garlaschelli’s Shroud to then, obligingly, to give quality results in the diffracted interference fringes in planes that are perpendicular to the emulsion plane. This phenomenon may happen in X rays, photographic techniques as well. P.S. The hyperboloidal surfaces inside the thin emulsion layer of holographic film, approach flat planes and are perpendicular to the film surface, like venetian blinds in the “open” position. However, because of the inherent characteristics of this family of hyperboloid “mirrors”, each successive reflection will have a precise phase shift of 2p because the optical path is increased by precisely the distance of one wavelength. All the reflected waves are precisely in phase and, therefore, add in amplitude, resulting in a strongest possible wave front representing the object beam. Thus, we may anticipate the phenomenon in other Shroud images like Garlaschelli’s..","date":"2014-04-15","mins":"1:38 pm","url":"https://shroudstory.com/2014/04/12/petrus-soons-to-present-his-scientific-research-at-the-uninversity-of-miami/","cat":"event","title":"Petrus Soons to Present His Scientific Research at the University of Miami"},{"id":"comment-99709","author":"david_bowman","post":"If you want to ascertain potential “holographic” qualities within X rays or photographs for instance, I’ll give you a short “lesson”. The low cost of equipment makes it possible for many of the following exercises to be performed as “homework.” All the experiments require the use of a laser and chemicals for processing the holograms. And duly observe all safety rules concerning lasers and chemicals. Generally, the developer and bleach solutions are mixed by the instructor. Since the photochemistry of holography is an ongoing research, it will change as improvements are found. Thus, no particular regime is discussed here. Use according to the detailed instructions that accompany each processing kit provided by the manufacturer. Similarly, the holographic plate or film used will change with time. Use them in accordance with the instructions of the supplier. The exposure time and the appropriate processing scheme are also provided. Equipment and facilities Holograms are made in darkened areas free from drafts, vibration, and noise. Because of the relatively low sensitivity of the recording material, sufficient light is allowed so that one can see comfortably after dark adaptation. To achieve this, use a 25 watt green light bulb in a lamp. Place the lamp under the table, cover it with aluminum foil to adjust the light, and direct it toward the floor. Do not allow direct light to shine on the holography system or on the developing station. If the room has windows, cover them with black plastic sheets. Enough light can leak through to allow minimum vision after dark adaptation. In case of doubt, leave a holographic plate on a table and expose it to the ambient light for ten minutes. Develop it. If it turns dark, there is too much light. Flowing tap water is desirable but not necessary. A large tray of clean water can be used to rinse the developed hologram. White trays are desirable because they allow continual inspection. An alternative is to use glass trays resting on white paper. Make sure all fire codes are observed. A. Reflection hologram Equipment requirement: Darkened room with green safe light, sturdy table or counter, optical table supported by “lazy balls,” mounted diode laser system, object on platform with three point support, shutter, processing trays with chemicals, and holographic plates. Figure 10 15—shown earlier—indicates the setup for making a “one beam reflection hologram,” sometimes called a Lippmann (Nobel Prize in physics, 1908) or Denisyuk hologram. Procedure A. Choose a solid object that looks bright when illuminated with laser light and whose size is not bigger than the hologram to be made. Mount (hot glue) it on a small platform made of wood or sheet metal (15 cm × 15 cm) with three round head short screws underneath (to prevent rocking). Mount the laser on a stand about 25 cm high and direct the light down at 45° at the object, with the light spreading horizontally. The distance between the laser and the object is about 40 cm. Now turn on the safe light and turn off the room light. B. After the laser has been warmed up for at least five minutes, block the light from reaching the object using a self standing black cardboard. (We will call this the shutter.) C. Lean a holoplate directly on the object, with the sticky side touching it. Wait at least 10 seconds. D. Lift the shutter, but still blocking the light, for 2 seconds, to allow any vibration to subside. Then lift the shutter away completely to allow the light to pass through the holoplate. The exposure is usually about 5 seconds. (Consult the instructions that accompany the plates.) Then block the light again. E. Develop the hologram according to instructions from the manufacturer. After the hologram is dried, view it with a spot light such as a pen light, projector, or direct sunlight. Optional: Spray paint the sticky side (emulsion side) with a flat (or “antique”) black paint to provide a darker background and greatly improve the visibility of the image. B. Transmission holograms 1. Without a mirror Equipment requirement: Same as for the “reflection hologram” in section A. Above. In addition, a stand alone plate holder is needed. Make one exactly the same way as the object platform described above. Instead of the object, install two long (12 cm) screws on top with a separation less than the width of the holoplate to be used. Paint the screws a diffused black color. Procedure A. Set up the system as shown in Figure 10 19. The diode laser is mounted 5 cm above the optical table with the beam spreading horizontally. One side of the beam illuminates the object or objects, and the other side serves as reference beam. Figure 10 19 The simplest configuration for making a transmission hologram B. Block the beam with the shutter, turn off the room light, and, on the stand alone plate holder, lean a holoplate vertically against the black screws with the sticky side facing the object(s). Wait 10 seconds. C. Lift the shutter and expose for about 30 seconds. Note: If there is a draft across your system, the long exposure time of 30 seconds requires you to put a large box over the entire system during the exposure. D. Develop and dry as before. E. This hologram must be viewed with laser light. To do so, lean the finished hologram back on the black screws the same way as during exposure. Cover or remove the objects and look through the hologram toward the location of the objects. A virtual image can be seen as if the object is still there. F. To observe the real image: − Relocate the finished hologram in the position where it was exposed. − Remove the object and, in its place, position a vertical white screen (cardboard) facing the hologram. − Darken the room and direct a collimated laser beam through the center of the hologram in a direction that is 180° from the original reference beam, i.e., back toward the location of the diode laser used for making the hologram. All light paths are now reversed and a two dimensional image is projected onto the screen. Move the laser beam to different locations of the hologram and observe the changing perspectives of the image. As must be said, this is a mere synopsis. I have not presented every facet. Regards, David Bowman.","date":"2014-04-15","mins":"9:19 pm","url":"https://shroudstory.com/2014/04/12/petrus-soons-to-present-his-scientific-research-at-the-uninversity-of-miami/","cat":"event","title":"Petrus Soons to Present His Scientific Research at the University of Miami"},{"id":"comment-99720","author":"david_bowman","post":"Hmm… in the posting there were a few images therein. They must not have registered, sorry..","date":"2014-04-15","mins":"9:39 pm","url":"https://shroudstory.com/2014/04/12/petrus-soons-to-present-his-scientific-research-at-the-uninversity-of-miami/","cat":"event","title":"Petrus Soons to Present His Scientific Research at the University of Miami"},{"id":"comment-99297","author":"david_bowman","post":"There are many types of holograms, and there are varying ways of classifying them. We can divide them into two types: reflection holograms and transmission holograms. A. The reflection hologram The reflection hologram, in which a truly three dimensional image is seen near its surface, is the most common type shown in galleries. The hologram is illuminated by a “spot” of white incandescent light, held at a specific angle and distance and located on the viewer’s side of the hologram. Thus, the image consists of light reflected by the hologram. Recently, these holograms have been made and displayed in color—their images optically indistinguishable from the original objects. If a mirror is the object, the holographic image of the mirror reflects white light; if a diamond is the object, the holographic image of the diamond is seen to “sparkle.” Although mass produced holograms such as the eagle on the VISA card are viewed with reflected light, they are actually transmission holograms “mirrorized” with a layer of aluminum on the back. B. Transmission holograms The typical transmission hologram is viewed with laser light, usually of the same type used to make the recording. This light is directed from behind the hologram and the image is transmitted to the observer’s side. The virtual image can be very sharp and deep. For example, through a small hologram, a full size room with people in it can be seen as if the hologram were a window. If this hologram is broken into small pieces (to be less wasteful, the hologram can be covered by a piece of paper with a hole in it), one can still see the entire scene through each piece. Depending on the location of the piece (hole), a different perspective is observed. Furthermore, if an undiverged laser beam is directed backward (relative to the direction of the reference beam) through the hologram, a real image can be projected onto a screen located at the original position of the object. Small semi transparent object is illuminated by a light source. The object scatters the light and creates a second wave which superposes on the recording medium with the reference wave originating from the source. Of course, the idea of a holography is to encode the phase information into intensity variation. In an amplitude hologram, the phase information is recorded as transmission variation (optical density variation). When the Silver Halide lm is exposed to light and developed, the grains of silver halides are changed into metallic silver and the transmittance of the lm is altered. The amplitude transmittance ~t(x; y) = t0 􀀀 I(x; y)T varies spatially the same way as the exposure intensity. But, in a phase hologram, the phase information is recorded as index variation. Thus the amplitude transmittance has magnitude equals to 1 and a varying phase ~t(x; y) = e􀀀i\b(x;y)..","date":"2014-04-14","mins":"4:39 pm","url":"https://shroudstory.com/2014/04/12/petrus-soons-to-present-his-scientific-research-at-the-uninversity-of-miami/","cat":"event","title":"Petrus Soons to Present His Scientific Research at the University of Miami"},{"id":"comment-99301","author":"david_bowman","post":"Irrespective, we could not presume a scorch to not have similar qualities..","date":"2014-04-14","mins":"5:03 pm","url":"https://shroudstory.com/2014/04/12/petrus-soons-to-present-his-scientific-research-at-the-uninversity-of-miami/","cat":"event","title":"Petrus Soons to Present His Scientific Research at the University of Miami"}]
