[{"id":"comment-97731","author":"david_bowman","post":"If there is any evidence for this palaver, (i.e. That the Gnostics did it) then by all means, present it. Otherwise it is simply that: nonsense..","date":"2014-04-08","mins":"8:31 pm","url":"https://shroudstory.com/2014/04/08/lawrence-e-schauf-for-the-prosecution-the-trial-of-the-shroud/","cat":"article","title":"Lawrence E. Schauf for the Prosecution: The Trial of the Shroud"},{"id":"comment-97751","author":"david_bowman","post":"David Roemer : The evidence is 1) There were a lot of Gnostics in Edessa; 2) Gnostics said that Pilate painted a picture of Jesus; 3) a tomb in Rome contains a Shroud like painting probably owned by Gnostics; 4) Gnostics were morally capable of crucifying someone to get an image. Nonsensical. 1) The fact of there being “a lot of gnostics in edessa” ,when scrutinized, reveals itself as piddling. This is merely concomitant to the Shroud’s torturous path. 2) “Pilate painted a picture of Jesus”? Again, this is a specious anecdote. Of course, this largely hinging upon mere structural similarities. 3)”[…] owned by the Gnostics”. Anecdotal. Once again, this is a mere (once again) structural similarity. Also, inform yourself on the substratal logical fallacies, with special observance on “non sequitur” and “red herring”. 4) No. Inform yourself on necessities of Gnostic theology. Which, of course, requires some basic knowledge of Neo Platonism and Platonism. But, let me state here, (courtesy of http://www.theopedia.com/Gnosticism): “Lastly, as far as most scholars know, Gnostics considered themselves Christians and saw Jesus as a heavenly messenger. However, they rejected the idea of God becoming incarnate (God becoming a man), dying and rising bodily. “These beliefs were considered unspiritual and against true wisdom because they entangled spirit with matter.” Most Gnostics believe that whoever entered Jesus at his baptism left him before he died on the cross.”.","date":"2014-04-08","mins":"10:37 pm","url":"https://shroudstory.com/2014/04/08/lawrence-e-schauf-for-the-prosecution-the-trial-of-the-shroud/","cat":"article","title":"Lawrence E. Schauf for the Prosecution: The Trial of the Shroud"},{"id":"comment-97903","author":"david_bowman","post":"Once you have presented a cogent, unambiguous argument (unlike the one you presented me) for this palaver, then I may consider it. Thank you..","date":"2014-04-09","mins":"11:57 am","url":"https://shroudstory.com/2014/04/08/lawrence-e-schauf-for-the-prosecution-the-trial-of-the-shroud/","cat":"article","title":"Lawrence E. Schauf for the Prosecution: The Trial of the Shroud"},{"id":"comment-99774","author":"david_bowman","post":"Sadly for me, as I fail to see it. I’m also not aware of a single Shroud scholar that had that same perception. How was that conclusion come to?.","date":"2014-04-16","mins":"12:02 am","url":"https://shroudstory.com/2014/04/15/new-book-the-tem-plar-mandylion/","cat":"books","title":"New Book: The Templar Mandylion"}]
