[{"title":"An Interview with Paolo Di Lazzaro","post":"It is worth noting that the ” C.R. Bronk” among the signatories to the 1989 Nature paper declaring that the radiocarbon dating of a three postage stamp size samples of the 4 x 2 metre Shroud was “conclusive evidence that the linen of the Shroud of Turin is mediaeval”: \n———————————————————————\nRadiocarbon Dating of the Shroud of Turin by P. E. Damon,1 D. J. Donahue,2 B. H. Gore,1 A. L. Hatheway,2 A. J. T. Jull,1 T. W. Linick,2 P. J. Sercel,2 L. J. Toolin,1 C.R. Bronk,3 E. T. Hall,3 R. E. M. Hedges, 3 R. Housley,3 I. A. Law,3 C. Perry,3 G. Bonani,4 S. Trumbore,5 W. Woelfli,4 J. C. Ambers,6 S. G. E. Bowman,6 M. N. Leese6 & M. S. Tite6 Reprinted from Nature, Vol. 337, No. 6208, pp. 611-615, 16th February, 1989\n———————————————————————\nis none other than Professor Christopher Bronk Ramsey!\nSo Prof. Ramsay is far from being a disinterested party in the defence of that now increasingly discredited radiocarbon dating of the Shroud to 1260-1390 AD. \nIf Prof. Ramsey was quoted correctly that, the “radiocarbon dating results which put the Shroud at around 800 years old, which Prof Christopher Ramsey of the Oxford Radiocarbon Accelerator Unit tells me we have no reason to doubt” then his continued unscientific dogmatism is itself highly significant.\nIndeed, the very fact the scientists involved did not then, and still do not now, preface their conclusions with something like: \n“If the tiny 1.2cm x 8cm = 0.00096 sq m. sample of the Shroud we were given, cut from the one bottom corner of the 4.4 x 1.1m = 4.84 sq. m. cloth, and therefore being only 0.02% of the whole cloth, is representative of the whole cloth, then, and only then, can we extrapolate our 1260-1390 AD date of that sample, to the Shroud as a whole” \ntells me that they were, and still are, trying too hard to discredit the Shroud.”\n\n","date":"December 30, 2011 at 9:32 am","url":"https://shroudstory.com/2011/12/30/an-interview-with-paolo-di-lazzaro/","cat":"news_&_views","id":"comment-6290","author":"Stephen E. Jones","site":"shroudstory"},{"title":"An Interview with Paolo Di Lazzaro","post":"Very well said Mr. Jones, and may I had to your very last statement; “and to protect thier reputations”.\nAs I mentioned quite forcefully in an earlier blog; Anyone with scientific or archaeological training, could not deny and would acknowledge, “any sample tested must be representative of the whole” and also that “ALL evidence pertaining to the sample must be taken into account” …As we all know neither was followed by ANY of the labs or those that came to the conclusion of the medieval dates…It is a shameful and derelict act on thier part, to say the least…Reputable Labs; My  *** !\nR\n\n","date":"December 30, 2011 at 5:08 pm","url":"https://shroudstory.com/2011/12/30/an-interview-with-paolo-di-lazzaro/","cat":"news_&_views","id":"comment-6315","author":"Ron","site":"shroudstory"},{"title":"An Interview with Paolo Di Lazzaro","post":"My friend Ron, I hope (I know) you can apply the same high standard regarding the samples used by M. Di Lazzaro and his team than you do for the 1988 C14 sample !  If (the “if” is important here) the samples used by M. Di Lazzaro are not fully representative of the real linen we found on the Shroud, then his results are irrelevant to the Shroud of Turin…  If it is so (again “if”), then their results cannot be related directly to the Shroud…\n\n","date":"December 30, 2011 at 8:17 pm","url":"https://shroudstory.com/2011/12/30/an-interview-with-paolo-di-lazzaro/","cat":"news_&_views","id":"comment-6326","author":"Yannick Clément","site":"shroudstory"},{"title":"An Interview with Paolo Di Lazzaro","post":"Of course I do, I have stated my opinion “quite clear” on the Di Lazzaro experiments and it’s relevant FACTS! I am also quite aware of it’s shortcomings, but I am not biased in my opinions that I would say they carry no weight, such has you. Whether you like it or not Yannick, the experiment does show something important. I will not dismiss it because of bias nor promote it for the same reason. You should think about that. Furthermore, My scrutiny of the carbon dating is well founded; Are you implying it is not? People should really review the true facts on the procedures of such then maybe the c14 tests would not carry so much weight. Please don’t mix the two tests together either. As the fiasco of the C-14 dating done in 1988 is of far more importance.\nR\n\n","date":"December 31, 2011 at 8:22 am","url":"https://shroudstory.com/2011/12/30/an-interview-with-paolo-di-lazzaro/","cat":"news_&_views","id":"comment-6370","author":"Ron","site":"shroudstory"},{"title":"An Interview with Paolo Di Lazzaro","post":"Ron, you said : “My scrutiny of the carbon dating is well founded; Are you implying it is not?”  I don’t where you take this idea.  It wasn’t my intention.\nNow, for Di Lazzaro, I just hate how much Pro-Shroud and Pro-Supernatural people (I’m not talking about you) are willing to do any kind of extrapolations in order to link those experiment with the Shroud.  THE FACT IS :  THERE’S NO DIRECT LINK.  People have problem to understand that (again, I don’t talk about you personally).  The only link that exist is when people are willing to do some extrapolations.  \nAnd also, we have to remember :\n1- Those results have not been confirmed yet by an independent researcher.\n2- In the present state of our knowledge about the Shroud, nobody can be sure if Di Lazzaro’s experiments were done with linen samples that are the same as the linen of the Shroud and nobody know if the chromophore for his coloration is the same than we see on the Shroud of Turin.\nThat’s all I say.  There’s a lot of questions that still need to be resolve before even thinking those experiments can be related at all to the Shroud of Turin…  And that will only be possible to resolve them once the Vatican will permit a new series of direct chemical tests on the Shroud.  Before that, all we’re left with is speculations.  And I don’t think we can go too far, scientifically speaking, with speculations.\n\n","date":"December 31, 2011 at 8:51 pm","url":"https://shroudstory.com/2011/12/30/an-interview-with-paolo-di-lazzaro/","cat":"news_&_views","id":"comment-6391","author":"Yannick Clément","site":"shroudstory"},{"title":"An Interview with Paolo Di Lazzaro","post":"Actually, the Shroud enigma is symptomatic of many many researchers’ intelligence being misled by appearances.\n\n","date":"December 30, 2011 at 6:07 pm","url":"https://shroudstory.com/2011/12/30/an-interview-with-paolo-di-lazzaro/","cat":"news_&_views","id":"comment-6317","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Interview with Paolo Di Lazzaro","post":"True…  And I think it’s even more true if we say : being misled by their “beliefs” (we could use another word like “agenda” or “preconceived ideas”).  I think there’s a lot of that in the Shroud research, but not only in the Shroud research.  It’s surely true elsewhere in the scientific world.  But maybe there’s more of that in the Shroud world because of the polemic nature of the subject.\n\n","date":"December 30, 2011 at 9:14 pm","url":"https://shroudstory.com/2011/12/30/an-interview-with-paolo-di-lazzaro/","cat":"news_&_views","id":"comment-6344","author":"Yannick Clément","site":"shroudstory"},{"title":"An Interview with Paolo Di Lazzaro","post":"Yannick;  Absolutely! We must wait for  Peer-Review~ We all realize that, I’m sure! \nThe fact that the Linen used in the experiment was not equal in composition to the linen found on the Shroud means very little; (AT THIS POINT ONLY). The thing to realize is that the experiment ‘proves’, that linen can be ‘marked’ with a ‘relatively similar’ colour to the one found on the Shroud but, more importantly, marked; SUPERFICIALLY, using UV laser light…it’s simple! This IS not speculation or hogwash, it is important news!…That said, we recognize we must wait for peer-review and hopefully further on down the road, they can repeat the experiment on Linen reminiscent of the Shroud….then the scientific truth will be unquestionable.\nR\n\n","date":"January 1, 2012 at 10:37 pm","url":"https://shroudstory.com/2011/12/30/an-interview-with-paolo-di-lazzaro/","cat":"news_&_views","id":"comment-6439","author":"Ron","site":"shroudstory"},{"title":"An Interview with Paolo Di Lazzaro","post":"Their results are not speculation, I agree with you.  But to link them with the Shroud of Turin, that’s where you need some extrapolations.  And the question of the validity of their samples is really important to judge the importance of their findings.  We have to maintain a real critical view regarding those experiments, just like we do regarding the validity of the sample used in 88 for carbon dating.  It’s not sure at all that what was accomplished by Di Lazzaro and his team is quite relevant with the Shroud.  That’s all I say.  Rogers made his Maillard reaction experiments on linen samples that were specially prepared the old fashion way as describe by Pliny the Elder in Antiquity.  I don’t think we can say the same thing regarding Di Lazzaro’s samples.  In reality, the fact that they colored the primary cell wall of the cellulose of the linen fiber instead of a thin layer of impurity (as proposed by Rogers) tell you a lot about the fact that their linen samples were not the same than what Rogers said for the Shroud.  Of course, Rogers could have been wrong, I know.  But the fact is that he was a top notch in his field of chemistry and he knew the Shroud better than maybe anybody in the world, and surely better than M. Di Lazzaro and his team (even if I don’t doubt their professional quality).  The fact is : we can’t be sure for the moment if Di Lazzaro’s experiments can be related at all with the Shroud of Turin.  That’s why I think it is prudent to wait a bit before screaming :  Hurrah !  They found the solution to the mystery !  I think Ron, you are prudent like that (even if you seem to give them more credit than me) but I also think many people will not be as prudent as you regarding this kind of news.\n\n","date":"January 2, 2012 at 12:38 am","url":"https://shroudstory.com/2011/12/30/an-interview-with-paolo-di-lazzaro/","cat":"news_&_views","id":"comment-6447","author":"Yannick Clément","site":"shroudstory"},{"title":"An Interview with Paolo Di Lazzaro","post":"I think Di Lazzaro’s work is in the right direction.  There is a mysterious, well documented phenomena in Tibetan Buddhist culture called the Rainbow Body.  It is where the bodies of adepts who have achieved a high degree of spiritual awareness simply disappear at death, vanishing in a shower of multi-colored light.  Hence the name Rainbow Body.  Jesus, being fully developed spiritually by following the same ascetic, selfless, compassion laced life style as the Buddhist counterparts,  may have attained a Rainbow Body (Resurrection in the Christian tradition.)  Typically the Buddhist adept’s body dissolves in seven days.  Jesus’ body dissolved in thirty-six hours or less.  This could point to a higher frequency radiation in the Resurrection than in the Buddhist tradition.  The point is, the human body can be a source of light, adding credibility to the notion that the image on the Shroud was somehow produced by a sudden burst of radiation.\n\n","date":"December 6, 2012 at 10:05 am","url":"https://shroudstory.com/2011/12/30/an-interview-with-paolo-di-lazzaro/","cat":"news_&_views","id":"comment-19915","author":"Tom Devins","site":"shroudstory"}]
