[{"title":"Di Lazzaro’s Gambit","post":"Christopher Ramsey Bronk’s problem is that he probably was the scientist at Oxford who actually did the test. His name appears first on the 1989 Nature article of those from Oxford: “… C.R. Bronk,3 E. T. Hall,3 R. E. M. Hedges, 3 R. Housley,3 I. A. Law,3 C. Perry,3 … 3 – Research Laboratory for Archaeology and History of Art, University of Oxford, Oxford, OX1 3QJ, UK …”\nAs such he would have been aware that a 200X microscope examination of the Shroud sample provided to Oxford revealed that it contained cotton which “may have been used for repairs at some time in the past”:\n“COTTON ON THE OXFORD CARBON DATING SAMPLE Kindly brought to our attention by the Revd. Kim Dreisbach of Atlanta is a hitherto unnoticed report in the journal Textile Horizons of December 1988 concerning the Shroud sample supplied to the Oxford radiocarbon dating laboratory. Apparently the British company Precision Processes (Textiles) Ltd of Ambergate, Derbyshire was asked by the Oxford laboratory to help identify certain ‘foreign’ fibres observed, isolated and extracted from the Shroud sample prior to its destruction during the carbon dating process. According to Precision Processes managing director, Peter South: `It was while the sample was undergoing tests at the radiocarbon acceleration unit in Oxford that Professor Edward Hall noticed two or three fibres which looked out of place. He mentioned this to his friend Sir James Spooner, chairman of Coats Viyella, to which our firm belongs. Consequently, after several telephone calls, the minute samples, which looked like human hair, were sent to us.’ Magnified two hundred times by a Precision Processes microscope the fibres became immediately identified as cotton. … Unfortunately it is impossible to say how it ended up on the Shroud, which is basically made from linen. It may have been used for repairs at some time in the past, or simply became bound in when the linen fabric was woven.” (Wilson, I., “Cotton on the Oxford Carbon Dating Sample,” British Society for the Turin Shroud Newsletter, No. 26, September/October 1990, pp.7-8). \nBut Oxford’s problem was that the Tucson Arizona lab had already run its carbon dating test on 6 May 1988, which dated the Shroud at 1350 AD. Then the Zurich lab had run its test nearly 3 weeks later on 26 May, which agreed with Tucson’s date. Oxford eventually submitted its results on 8 August, over 3 months after Tucson’s. \nSo if the cotton was part of a medieval repair and Oxford had removed it, and then dated the remaining pure linen, and the result then was that the date of Oxford’s sample was now much older than that of the other two labs, it would be a major scientific embarrassment, and a public relations disaster for the new AMS method of radiocarbon dating. \nIn that case, what would a young scientist entrusted with such a major radiocarbon dating do? Announce that the other two labs had badly bungled their tests? Or run a carbon dating on another of their several sub-samples, complete with cotton, which would give a date broadly in agreement with the other two labs?\nIf something like this did happen, it would explain why Ramsey/Bronk would have to defend the consensus radiocarbon dating of 1260-1390AD, unless something like Jackson’s carbon monoxide contamination theory gave all three labs an honourable way out. \nBut to admit that the labs tested a cotton-contaminated patch of the Shroud would not be an honourable way out. Especially as Oxford knew that their sample was contaminated with cotton.\n\n","date":"January 1, 2012 at 9:23 am","url":"https://shroudstory.com/2012/01/01/di-lazzaros-gambit/","cat":"news_&_views","id":"comment-6410","author":"Stephen E. Jones","site":"shroudstory"},{"title":"Di Lazzaro’s Gambit","post":"To bad Booby Fisher, the late demented chess genius, is no longer available to assist Prof. Ramsay to devise a counter. Then again, maybe there is no counter.\nBy the way, has Professor Ramsey quantified his statement that medieval repairs are “unlikely”? I mean 49% unlikely or 99% or 5% unlikely and what is the factual basis for his conclusion of “unlikely? Is that how scientific conclusion are explained explained at Oxford?\n\n","date":"January 1, 2012 at 9:30 am","url":"https://shroudstory.com/2012/01/01/di-lazzaros-gambit/","cat":"news_&_views","id":"comment-6412","author":"John Klotz","site":"shroudstory"},{"title":"Di Lazzaro’s Gambit","post":"Even admitting that the part of the Shroud that was chosen for radiocarbon dating did not belong to the original linen, strong difficulties remain so as to the capability of the C14 method to yield an accurate result. Some works (*) have very clearly shown that the effect of a bioplastic coating on Egypt linens is very difficult to avoid and therefore, although an original part of the linen were chosen for a new C14 test, results are most likely not to be conclusive. In this sense, I would say that the true scientifc challenge –and I connect here with Russ’s previous post- is developing an ad-hoc methodology for dating ancient Middle East linens. I mean, at this moment, addresing the problem of the dating of the Shroud requires at this moment to develop a specific methodology which –unfortunately- at this moment does not exist.\nThis would need a major international and coordinated effort with a high number of ancient linens and then develop specific and accurate methodologies. The main point would be to find a set of indicators in the linen composition which could only be associated to a specific period or area. The composition of the ground where the linen was grown has a specific chemistry that most surely can be tracked to the composition of the linen , through rare isotopes. Additionally, in the composition of the atmosphere of the 1st century there are certain compounds in proportions that can be known analyzing ancient ice cores. This also should leave a specific track in a 1st century linen. All this means promising methodologies to be fully developed yet. In my opinion, efforts should move in this direction and not on trying to get new C14 tests.\n(*) H.E. Gove, S.J. Mattingly, A.R. David, L.A. Garza-Valdes. A problematic source of organic contamination of linen.Nuclear Instruments and Methods in Physics Research B 123 (1997) 504-507\n\n","date":"January 1, 2012 at 7:51 pm","url":"https://shroudstory.com/2012/01/01/di-lazzaros-gambit/","cat":"news_&_views","id":"comment-6436","author":"Gabriel","site":"shroudstory"},{"title":"Di Lazzaro’s Gambit","post":"Here’s a little commentary of mine not scientific at all but with some wisdom in it anyway :  I KNOW the C14 conclusion of 88 is wrong.  WHY ?  Just because deep in my heart, I KNOW the Shroud is the authentic Shroud of Christ…  I know it.  So, I don’t need the C14 to give me the answer.  \nHaving said that with my heart, of course, it’s important that we could confirm this with scientific facts.  But all in all, we have to understand one thing :  C14 dating is not 100% sure (see the paper on the C14 written by Meacham : http://www.shroud.com/meacham.htm\nAlso, C14 is not everything.  Like my friend Barrie Schwortz often told :  With the Shroud, we have around 99 evidences and clues that point out toward authenticity, and then we have this single test that point out toward a fake.  In this context, what someone intelligent would do ?  Of course, he will be really suspicious regarding the dissonant result !  And that’s exactly what Benford-Marino did around 2000 and after that, Rogers check out their ideas more deeply and his findings were confirmed by John L. Brown.  I think now we know FOR A FACT that this C14 conclusion of 88 is incorrect because the dating was done on a non-representative sample.  PERIOD.  Of course, that doesn’t tell us with 100% confidence that the Shroud is 2000 years old, but almost every evidences and observations about the Shroud point out in that direction…  So, to me, this C14 result of 88 is far from being something that I consider a true scientific fact that, without a doubt, can tell me the real age of the Shroud.  There’s plenty of other evidences that are more solid in my opinion (scientifically speaking) and all them point our in the direction of authenticity.\n\n","date":"January 1, 2012 at 10:34 pm","url":"https://shroudstory.com/2012/01/01/di-lazzaros-gambit/","cat":"news_&_views","id":"comment-6438","author":"Yannick Clément","site":"shroudstory"},{"title":"Di Lazzaro’s Gambit","post":"Following with my previous comment, a recent research (*) has shown that using a set of 11 trace elements (Al, Ti, Ni, As, Rb, Y, Mo, Ag, Cd, Ba, and La) and not just a dubtious one like C14, it is possible to identify the region of the world a linen comes from. The authors have achieved to distinguish linens from Poland, Italy and JApan using those 11 trace elements.\nI think it would really be helpful to carry out the same analysis on the Shroud and clearly establish whether its linen comes from the Middle East (one point for authenticity) or from let’s say France. In case the linen came from France, we could once and for all rule out the possibility of an authentic relic. In case, it came form the Middle East it wouldn`t mean that the Shroud is authentic 100%, but would represent a very strong point in its favour.\n(*)Takako Inoue, Kengo Ishihara and Kyoden Yasumoto.International Journal of Clothing Science and Technology Vol. 22 No. 2/3, 2010 pp. 174-186\n\n","date":"January 2, 2012 at 8:28 am","url":"https://shroudstory.com/2012/01/01/di-lazzaros-gambit/","cat":"news_&_views","id":"comment-6462","author":"Gabriel","site":"shroudstory"}]
