[{"title":"Bruno Barberis Interview: ‘The only serious and honest behavior’","post":"“… the Shroud remains inaccessible to scientists? ”\nBarberis’ reply to this question is self-contradictory and arguably hypocrite.\n\n","date":"February 22, 2015 at 8:14 am","url":"https://shroudstory.com/2015/02/22/bruno-barberis-interview-the-only-serious-and-honest-behavior/","cat":"news_&_views","id":"comment-191551","author":"PHPL","site":"shroudstory"},{"title":"Bruno Barberis Interview: ‘The only serious and honest behavior’","post":"I agree with the prof. Barberis on the obvious fact that\ncontrol tests on the samples must be non-destructive…\nAnd already in 1998, I had proposed the application of SPM controls\non linen samples already taken from the Shroud in the past.\n— — —\nFor example:\nread my past message (June 2014) on\n“Anticipating the Conference: Giulio Fanti on SSG”\nLink:\nhttps://shroudstory.com/2014/06/14/anticipating-the-conference-giulio-fanti-on-ssg/\n>… The atomic force microscope (AFM) was developed by Binnig, Quate and\nGerber in 1986, following its predecessor, the scanning tunnelling microscope\n(STM).\n>Both instruments belong to a family of microscopes broadly known as\nScanning Probe Microscopes (SPM).\n>The primary use of AFM is to quantitatively determine surface morphology\nat the nano-scale …\n>The sharpness of the tip is the key determinant in the resolution of AFM imaging. …\netc. … etc. …\n\n","date":"February 22, 2015 at 8:34 am","url":"https://shroudstory.com/2015/02/22/bruno-barberis-interview-the-only-serious-and-honest-behavior/","cat":"news_&_views","id":"comment-191552","author":"piero","site":"shroudstory"},{"title":"Bruno Barberis Interview: ‘The only serious and honest behavior’","post":"The mantra again, updated. We need data ,more tests and what happens next?\n\n","date":"February 22, 2015 at 10:22 am","url":"https://shroudstory.com/2015/02/22/bruno-barberis-interview-the-only-serious-and-honest-behavior/","cat":"news_&_views","id":"comment-191561","author":"Louis","site":"shroudstory"},{"title":"Bruno Barberis Interview: ‘The only serious and honest behavior’","post":"AFM microscopy is an useful  tool …\nAdvanced microscopy permitted to observe interesting features.\n— — —\n>Working with ancient DNA is very challenging, both in terms of finding sufficient material to work with after decomposition has occurred, and in terms of eliminating modern human contamination. Distinguishing between modern human and ancient genetic material is particularly difficult when the ancient DNA comes from close relatives of modern humans.\nLink:\nhttp://humanorigins.si.edu/evidence/genetics/ancient-dna-and-neanderthals/sequencing-neanderthal-dna\n— — —\nThe genetic issue is very interesting ….\nDo you know Svante Pääbo ?\nPääbo  (born 20 April 1955) is a Swedish biologist specializing in evolutionary genetics. One of the founders of paleogenetics, he has worked extensively on the Neanderthal genome.\nlinks:\nhttp://en.wikipedia.org/wiki/Svante_P%C3%A4%C3%A4bo\nhttp://en.wikipedia.org/wiki/Neanderthal_Man:_In_Search_of_Lost_Genomes\nhttp://www.nybooks.com/articles/archives/2014/apr/03/most-us-are-part-neanderthal/\nHere the title of a book:\n“Neanderthal Man: In Search of Lost Genomes “\nby\nSvante Pääbo\nBasic Books, 275 pp., $27.99\n——————-\nToday I have found a paper :\nNanomechanical DNA origami ‘single-molecule beacons’ directly imaged by atomic force microscopy\n•Akinori Kuzuya,\n•Yusuke Sakai,\n•Takahiro Yamazaki,\n•Yan Xu\n•& Makoto Komiyama\nlink:\nhttp://www.nature.com/ncomms/journal/v2/n8/full/ncomms1452.html\n\n","date":"February 23, 2015 at 11:17 am","url":"https://shroudstory.com/2015/02/22/bruno-barberis-interview-the-only-serious-and-honest-behavior/","cat":"news_&_views","id":"comment-191655","author":"Piero","site":"shroudstory"},{"title":"Bruno Barberis Interview: ‘The only serious and honest behavior’","post":"Do you know direct imaging of DNA sequence by atomic force microscopy ?\nlink:\nhttp://www.nature.com/nbt/journal/v26/n10/full/nbt1485.html\n\n","date":"February 23, 2015 at 11:20 am","url":"https://shroudstory.com/2015/02/22/bruno-barberis-interview-the-only-serious-and-honest-behavior/","cat":"news_&_views","id":"comment-191657","author":"Piero","site":"shroudstory"},{"title":"Bruno Barberis Interview: ‘The only serious and honest behavior’","post":"Ancient DNA is a controversial argument.\nThe genetic problems are complex and I think that to be sure to get credible results then we should start\nfrom material not contaminated.\nBut the Shroud passed through many hands, and then there are also genetic fingerprints do not belong to Jesus.\nRead what wrote Fanti in the book … \nWe can presume that all of Jesus’ genetic material would have come from his mother Mary and then we can try to test this hypothesis.\nWe can presume that all of Jesus’ genetic material would have come from his mother Mary and then we can think to test this hypothesis using the samples that we can obtain. But I think that is very difficult to obtain something from what should be at disposal if we are not true expert in the specific field with an adequate Lab and a scientific team supporting the difficult enterprise.\n— — —\nI wrote the previous messages only to test the level of attention about the “Genetic Problem”…\nI don’t believe in hasty works of laboratory on genetic materials coming from the Ancient Shroud.\nAlso the findings and ideas by Svante Paabo are controversial since there  is not a complete consensus (if I a m right in my knowledges on that biogenetic argument)… This question is also connected with the problem of “Neanderthal mankind” (= Homo Sapiens neandertalensis) .\nSee also:\nA mitochondrial genome sequence of a hominin from Sima de los Huesos\nNature 505, 403–406 (16 January 2014) \nhttp://www.nature.com/nature/journal/v505/n7483/full/nature12788.html\n>Excavations of a complex of caves in the Sierra de Atapuerca in northern Spain have unearthed hominin fossils that range in age from the early Pleistocene to the Holocene. One of these sites, the ‘Sima de los Huesos’ (‘pit of bones’), has yielded the world’s largest assemblage of Middle Pleistocene hominin fossils, consisting of at least 28 individuals dated to over 300,000 years ago. The skeletal remains share a number of morphological features with fossils classified as Homo heidelbergensis and also display distinct Neanderthal-derived traits. Here we determine an almost complete mitochondrial genome sequence of a hominin from Sima de los Huesos and show that it is closely related to the lineage leading to mitochondrial genomes of Denisovans, an eastern Eurasian sister group to Neanderthals. Our results pave the way for DNA research on hominins from the Middle Pleistocene.\n— —- —\n>Denisovans or Denisova hominins are an extinct species of human in the genus Homo. In March 2010, scientists announced the discovery of a finger bone fragment of a juvenile female who lived about 41,000 years ago, found in the remote Denisova Cave in the Altai Mountains in Siberia, a cave which has also been inhabited by Neanderthals and modern humans.[1][2][3] Two teeth and a toe bone belonging to different members of the same population have since been reported.\n>Analysis of the mitochondrial DNA (mtDNA) of the finger bone showed it to be genetically distinct from the mtDNAs of Neanderthals and modern humans.\n>Subsequent study of the nuclear genome from this specimen suggests that this group shares a common origin with Neanderthals, that they ranged from Siberia to Southeast Asia, and that they lived among and interbred with the ancestors of some present-day modern humans, with about 3% to 5% of the DNA of Melanesians and Aboriginal Australians deriving from Denisovans.\n>DNA discovered in Spain suggests that Denisovans at some point resided in Western Europe, where Neanderthals were thought to be the only inhab\n— — —\nPerhaps the account of Eve is an interesting and important segment of our genetic history. The Bible says that God put Adam into a deep sleep, took one of Adam’s ribs, and made a woman (Genesis 2:21-22). Adam named her Eve and proclaimed that she was “bone of my bones and flesh of my flesh” (Genesis 2:23-24).  … So, how does modern science line up with this account?\nWere Adam and Eve  identical twins?\nHad  they each two copies of every gene: one dominant and one recessive gene? …\nI am not a fundamentalist, and therefore I believe that the Bible is not to be taken literally when you enter the field of Science…\nAnd you?\n— —\nWe can fantasize about original sin as long as we want, Abel and Cain, etc., etc. In the past I read things like that.\nThose are particular issues, what seems to be interesting is what you might get from the DNA sequence of the “Man of the Shroud”.\nBut it is difficult to hope to get something meaningful from those genetic fingerprints remained on Linen for centuries… \nHere I stop my long speech (sorry!) and then I stay on hold.\n\n","date":"February 24, 2015 at 8:57 am","url":"https://shroudstory.com/2015/02/22/bruno-barberis-interview-the-only-serious-and-honest-behavior/","cat":"news_&_views","id":"comment-191729","author":"piero","site":"shroudstory"},{"title":"Bruno Barberis Interview: ‘The only serious and honest behavior’","post":"I have just seen that I wrote twice the phrase:\n>We can presume that all of Jesus’ genetic material would have come from his mother Mary and then we can think to test this hypothesis using the samples that we can obtain\nI wrote in a bad manner because I was disturbed …\nThe working hypothesis about the DNA of Jesus is a controversial topic and it was done only to indicate problems…\n— — —\nAnother thing:\nKelly Kearse (= DNA Analysis and the Shroud of Turin:\nDevelopment of a Shroud CODIS) indicated the study by Green, R.E.:\n“The Neandertal genome and ancient DNA authenticity”, EMBO J. 28: 2494 (2009).\n— —\n>The Neanderthal genome project is a collaboration of scientists to sequence the Neanderthal genome.\n>It is coordinated by the Max Planck Institute for Evolutionary Anthropology in Germany and 454 Life Sciences, a biotechnology company based in Branford, Connecticut in the United States. Founded in July 2006, the project published their results in the May 2010 journal Science detailing an initial draft of the Neanderthal genome based on the analysis of four billion base pairs of Neanderthal DNA. The study determined that some mixture of genes occurred between Neanderthals and anatomically modern humans and presented evidence that elements of their genome remain in that of modern humans.\n>In December 2013, scientists reported, for the first time, a high coverage genome of a Neanderthal. The genome was extracted from the toe bone of a Neanderthal from over 50,000 years ago, found in a Siberian cave.\nLink:\nhttp://en.wikipedia.org/wiki/Neanderthal_genome_project\n— — —\nHere another link (2010) about Svante Paabo:\nhttp://www.eva.mpg.de/neandertal/press/presskit-neandertal/pdf/PR_MPI_Neandertal_EN.pdf\n\n","date":"February 24, 2015 at 9:14 am","url":"https://shroudstory.com/2015/02/22/bruno-barberis-interview-the-only-serious-and-honest-behavior/","cat":"news_&_views","id":"comment-191730","author":"piero","site":"shroudstory"},{"title":"Bruno Barberis Interview: ‘The only serious and honest behavior’","post":"‘Destructive tests’, including C14 tests, can be done without any additional destruction of the Shroud, because there are still a number of unused samples out there. Especially the smaller piece that has been given to the Tucson lab: this sample should be used to test whether the age gradient observed in the 1988 measurements (Oxford old, Zürich in between, Tucson young) is real or not. This gradient is an objective, unusual and very disturbing aspect of the 1988 C14 dating, and the publication in Nature looks as if the phenomenon has been swept under the rug by the authors on purpose (I say: ‘looks as if’; this is not an accusation). In order to set the record straight, the authors should use the samples that they still possess  to clear out this point. They should present a research plan, including a description of the samples that still exist, and a scheme of the statistical tests to be performed for checking the  existence vs. non-existence of the gradient. Why is this not done? Where are these residual samples right now? Why the silence?\n\n","date":"February 22, 2015 at 11:52 am","url":"https://shroudstory.com/2015/02/22/bruno-barberis-interview-the-only-serious-and-honest-behavior/","cat":"news_&_views","id":"comment-191568","author":"Jos Verhulst","site":"shroudstory"},{"title":"Bruno Barberis Interview: ‘The only serious and honest behavior’","post":"The sample is not representative and I would see little point in testing it.  Until truly representative samples are taken complying with proper protocols, there is no point in testing pieces which might well be merely patches.\n\n","date":"February 22, 2015 at 2:48 pm","url":"https://shroudstory.com/2015/02/22/bruno-barberis-interview-the-only-serious-and-honest-behavior/","cat":"news_&_views","id":"comment-191581","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Bruno Barberis Interview: ‘The only serious and honest behavior’","post":"In 1998 I wanted to draw attention to the new advanced microscopy techniques (see also their use in explorations performed by space probes …).\nI have found the following title:\n“Structure by Feel”\n> … …Applying the sensitive touch of atomic force microscopy to DNA, cells, and proteins…\n>One major benefit of AFM is that destructive agents like fluorescent proteins need not be applied. A consequence, however, is that researchers may mistake the wrong molecule for their sample because both it and contaminating particles that get in the way are too small to see.\n>One way to ensure specificity is to lend the sample a “fingerprint” by engineering your protein of interest with a polypeptide that has a unique and well-known repeated sequence of amino acids. As the AFM pulls the protein, one section of it will unravel in a pattern consistent with that polypeptide alone …\nLink:\nhttp://www.the-scientist.com/?articles.view/articleNo/34793/title/Structure-by-Feel/\nI’m not really an expert in molecular biology and genetics, however, I see that no one is able to achieve something concrete in this difficult field.\nPerhaps we still have to wait.\nThe speeches of Kelly Kearse are very interesting, but at the moment I do not see appear new analyzes on samples from the Shroud … and this is what we all very interested.\nSo you need to review what is the meaning of all references to genetics\nthe humanity of the past (including relations with Neanderthals and Denisovians) and genetic heritage that has come down to modern man.\nIf Jesus was immune from original sin (as was his mother) then his DNA could be different, but this is a long and complex speech …\nand then we face the problems of accurate analysis on ancient DNA.\nThis is the key point, see also: the degradation of the genetic material and the degree of probability of correctly interpreting the data obtained.\n— — —\nHere an example :\n“Separating endogenous ancient DNA from modern day contamination\nin a Siberian Neandertal”\nPontus Skoglund et al.\n(Edited by Richard G. Klein, Stanford University, Stanford, CA,\nand approved December 27, 2013)\nLink:\nhttp://www.pnas.org/content/111/6/2229.short\nSignificance:\n>Strict laboratory precautions against present day human DNA contamination\nare standard in ancient DNA studies, but contamination is already present\ninside many ancient human fossils from previous handling without specific precautions.\n>We designed a statistical framework to isolate endogenous ancient DNA sequences\nfrom contaminating sequences using postmortem degradation patterns\nand were able to reduce high-contamination fractions to negligible levels.\n>We captured DNA sequences from a contaminated Neandertal bone from\nOkladnikov Cave in Siberia and used our method to assemble its\nmitochondrial genome sequence, which we find to be from a lineage basal\nto five of six previously published complete Neandertal mitochondrial genomes.\n>Our method paves the way for the large-scale genetic analysis of\ncontaminated human remains.\n— — —\nProbably, in my opinion, the case of the Holy Shroud is a bit different\n(= no bones…) with respect the problems of\n“genomic analysis of contaminated fossil material”…\n\n","date":"February 25, 2015 at 10:55 am","url":"https://shroudstory.com/2015/02/22/bruno-barberis-interview-the-only-serious-and-honest-behavior/","cat":"news_&_views","id":"comment-191809","author":"piero","site":"shroudstory"},{"title":"Bruno Barberis Interview: ‘The only serious and honest behavior’","post":"Here what we can read (at the end of the article I mentioned earlier) under the address:\nhttp://www.the-scientist.com/?articles.view/articleNo/34793/title/Structure-by-Feel/\n>… When using AFM to image molecules, researchers typically leave the tip alone and rely on sterile laboratory techniques and their knowledge of the sample. “You have to know that the only thing on the surface is DNA,” says Fletcher. “And, if you are scanning DNA but you see things that are larger than it should be and rodlike in shape, you need to know that it is not DNA\nBelow the image (photo) we can read:\n> In this representation of an atomic force microscopy experiment, a single polyprotein (green) is tethered between a gold-coated cover slide (yellow) and a cantilever tip (blue). The protein consists of identical immunoglobulin domains that unfold independently when a stretching force is applied. Unfolding one of the middle domains has exposed its cysteine residues, which can then form complexes with oxidase enzymes (white). Researchers in the Fernandez lab use the technique to study the process of protein folding.\n— —\n… These are special tests.\nDo you remember the interesting questions of structural mechanics?\n— —\nDo you know protein engineering ?\nDo You know anyone who is able/accustomed to using the AFM techniques for analyses?\n\n","date":"February 25, 2015 at 11:17 am","url":"https://shroudstory.com/2015/02/22/bruno-barberis-interview-the-only-serious-and-honest-behavior/","cat":"news_&_views","id":"comment-191810","author":"piero","site":"shroudstory"},{"title":"Bruno Barberis Interview: ‘The only serious and honest behavior’","post":"Sorry.\nYesterday I was in a hurry.\nI was blocked perhaps because I was entering in biological-genetic issues\nI was stuck going out of my field of expertise (textiles)\nI lost time by not talking about mechanical analyses…\nSee, for instance:\n“Analysis of Indentation: Implications for Measuring Mechanical Properties\nWith Atomic Force Microscopy”\nJ Biomech Eng 121(5), 462-471 (Oct 01, 1999) (10 pages)\nLink:\nhttp://biomechanical.asmedigitalcollection.asme.org/article.aspx?articleid=1402091\nHere a short excerpt from the abstract:\n>Indentation using the atomic force microscope (AFM) has potential to measure detailed micromechanical properties of soft biological samples. However, interpretation of the results is complicated by the tapered shape of the AFM probe tip, and its small size relative to the depth of indentation. … …\nAlso the question of particular claims about the nuclear irradiation is interesting\n(but we know that Ray Rogers denied that irradiation).\nIn the past (rejected paper for Dallas Conference, 2005) I proposed the use of AFM and SSNTD to testify the level of radiations during the experiments (simulations)…\nReflections on nuclear power and levels of safety in our world (and concrete steps to enhance nuclear safety for our future) are also connected to the studies about\nthe effect of radiation on materials.\nA nuclear war is a catastrophic event… For example:\nHave you seen the effect of nuclear bomb on a cathedral in Japan (Nagasaki)?\n— —\nLinks:\n\nhttp://www.ccwatershed.org/blog/2013/aug/9/1949-mass-ruins-nagasaki-cathedral/\nhttp://www.schola-sainte-cecile.com/2013/08/09/et-dieu-essuiera-toutes-les-larmes-de-leurs-yeux-nagasaki-9-aout-1945/\n— —\nSo…\nWe have to show (using linen fibrils…) what happens after\nthe use of nuclear bombs.\nFor example:\nNow the situation in East-Ukraine is bad but I don’t believe that the rebels or\ngovernment of Ukraine or new political and economic characters who want to revive “the glorious czarist past” want to use nuclear weapons to solve their difficult geopolitic-economic problems .\nBut sometimes the History gets out of hand its protagonists.\nSee what happened after the famous attack in Sarajevo in 1914 (= WWI).\nPerhaps the irradiation work can be difficult to obtain\n(…when we are not high level scientists or true experts in the matter).\n— — *** — —\nHere I return on my previous message.\nUnfortunately I don’t know what are the complete results obtained by\nProf. Andy Merrywheater (a world-class expert on ancient blood)\non degraded DNA coming from the Shroud.\nDo you know what was obtained (working on small segments of DNA\navailable for replication)?\nSo…\nHere (avoiding biogenetic derives and vague protein engineering ideas…)\nI want to underline which were the adequate words (about linen fibrils =\nlignocellulosic material) to quote (speaking from a textile perspective):\n>… When measuring elasticity or other mechanical properties of a sample,\nyou’ll want a softer cantilever with a low spring constant so that\nthe cantilever can detect small change in force. \nAnother point:\n>Good data depends on the quality of your experimental setup.\nIf the sample is inert, measurements can be made\nwith the sample exposed to air.\n—- —-\nBefore to leave I have a very short note:\nPerhaps UV photographs were taken during the past operations\non Holy Shroud. If there was any important information in them, I am\ncertain that this can be useful to observe.\nHere an old reference:\nR. Gilbert Jr. and M Gilbert,\n“Ultraviolet-visible reflectance and fluorescence spectra of the\nShroud of Turin,” Applied Optics 19, 1930-1936 (1980).\n— — —\nHere the last question:\nHave you (included our friend Charles Freeman) observed the so-called\nRogers-Zugibe photomicrographs?\nThese photographs were all taken by Dr. Fred Zugibe at the Leitz facility,\nusing the best equipment available …\n\n","date":"February 26, 2015 at 8:58 am","url":"https://shroudstory.com/2015/02/22/bruno-barberis-interview-the-only-serious-and-honest-behavior/","cat":"news_&_views","id":"comment-191884","author":"piero","site":"shroudstory"},{"title":"Bruno Barberis Interview: ‘The only serious and honest behavior’","post":"The development of DNA analysis in our era\npermits some interesting controls.\nBut the Lab works on ancient DNA are difficult.\nSo …\nI cannot be the healer of “DNA Lab” workers\nbecause I am not an expert about the mitochondrial DNA\n(if Jesus inherited the mitochondrial DNA of his Mother Mary) …\nBut I can be the healer about “the irradiation analyses” works\nbecause they cannot can be too difficult to obtain…\n\n","date":"February 26, 2015 at 9:18 am","url":"https://shroudstory.com/2015/02/22/bruno-barberis-interview-the-only-serious-and-honest-behavior/","cat":"news_&_views","id":"comment-191885","author":"piero","site":"shroudstory"},{"title":"Bruno Barberis Interview: ‘The only serious and honest behavior’","post":"Sorry\nabout the mistake:\n> they cannot can be too difficult to obtain\nInstead of\n>they cannot be too difficult to obtain\n\n","date":"February 26, 2015 at 9:19 am","url":"https://shroudstory.com/2015/02/22/bruno-barberis-interview-the-only-serious-and-honest-behavior/","cat":"news_&_views","id":"comment-191886","author":"piero","site":"shroudstory"}]
