[{"id":"comment-205470","author":"paulette","post":"Thought experiment: “Show me a miracle,” the 14th century alchemist prayed. There was a flash of light and an image appeared on the cloth. “What good is that. No one will believe it. If you could turn it into real gold thread, that they would believe.”.","date":"2015-07-13","mins":"5:16 am","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","title":"Beg Your Pardon (Comment Promoted)"},{"id":"comment-131221","author":"paulette","post":"Good enough for me means you can only prove something to someone who agrees with you in the first place. In other words your comment to Colin is pointless so why even say it..","date":"2014-06-19","mins":"8:53 am","url":"https://shroudstory.com/2014/06/18/catching-up-yannick-to-hugh-anoxie-and-all-of-us/","cat":"paper_chase","title":"Catching Up:  Yannick to Hugh, Anoxie and All of Us"},{"id":"comment-7520","author":"paulette","post":"The author of science buzz tells us that his blog is primarily about his “scepticism re media hyped gee whizz science, especially ‘pseudo science’, as previous postings will demonstrate, NOT religion…” Well it certainly isn’t about science, either. Consider his 5th item in which he tells us, “Dorsal and ventral imprints may have been obtained from two different templates. Some claim dorsal and ventral images are not consistent. A quick play around with my laptop would suggest as much.” He is out of his league. Look at the picture of the dorsal and ventral images that he put together in his blog. This isn’t scientific thinking. As a science teacher I would have given one of my 9th graders a failing grade if he turned in something like this. He has lined up the rightmost and leftmost edge of the cloth as though the feet were aligned to those edges. The best he can do is write, “some claim.” Who? What documentation? Forget the fact that hundreds of scientists spent thousands of hours studying the images on the shroud. Compare his “quick play around with my laptop” with the fifteen page paper, “Computerized Anthropometric Analysis of the Man of the Turin Shroud” detailing the real scientific work of Giulio Fanti, Emanuela Marinelli and Alessandro Cagnazzo of the Interdepartmental Center for Space Studies and Activities at the University of Padua. They are consistent. Almost all of his 37 points are like point 5, not researched, not carefully thought out. Joe Nickell move over. You have competition..","date":"2012-01-25","mins":"12:20 pm","url":"https://shroudstory.com/2012/01/24/hes-back-and-its-a-doozy/","cat":"other_blogs","title":"He’s back and it’s a doozy"},{"id":"comment-35342","author":"paulette","post":"Hey, Guys, I think Dan wanted us to see the humor in this “reasoning.” It is too ridiculous to comment on..","date":"2013-05-30","mins":"9:03 am","url":"https://shroudstory.com/2013/05/30/how-can-you-argue-with-this/","cat":"other_blogs","title":"How can you argue with this?"},{"id":"comment-201606","author":"paulette","post":"After three years reading this blog I have come to believe that of all the hypotheses ever proposed for how the image came to be Charles Freeman’s comes closest to the mark even as his arrow misses the target by a country mile..","date":"2015-06-11","mins":"7:06 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","title":"Guest Posting by Yannick Clément"},{"id":"comment-158581","author":"paulette","post":"Limit this to papers and agenda items, please..","date":"2014-10-02","mins":"7:08 am","url":"https://shroudstory.com/2014/10/01/new-discussion-facility-on-the-st-louis-conference-site/","cat":"other_blogs","title":"New Discussion Facility on the St. Louis Conference Site"},{"id":"comment-56320","author":"paulette","post":"I agree. I can’t see how to remove it..","date":"2013-12-04","mins":"11:07 am","url":"https://shroudstory.com/2013/12/03/the-science-of-logical-forensics/","cat":"other_blogs","title":"The Science of Logical Forensics"},{"id":"comment-190375","author":"paulette","post":"Trickster Excuses Theology (TET) is like playing poker with 52 wild cards..","date":"2015-02-09","mins":"9:00 am","url":"https://shroudstory.com/2015/02/09/maybe-the-trickster-did-it/","cat":"other_blogs","title":"Maybe the Trickster Did It"},{"id":"comment-56292","author":"paulette","post":"Why do I feel like I am eating a dinner that someone else picked out for me from the most tempting tidbits in Golden Corral buffet line. [Video removed by Dan].","date":"2013-12-04","mins":"6:50 am","url":"https://shroudstory.com/2013/12/03/the-science-of-logical-forensics/","cat":"other_blogs","title":"The Science of Logical Forensics"},{"id":"comment-172923","author":"paulette","post":"I think the KGB hacked the Gospel of the Hebrews..","date":"2014-11-25","mins":"7:07 am","url":"https://shroudstory.com/2014/11/25/st-john-of-the-shroud-priest-servant-of-the-priest-cousin-to-jesus/","cat":"other_blogs","title":"St. John of the Shroud: Priest, Servant of the Priest, Cousin to Jesus"},{"id":"comment-58844","author":"paulette","post":"Michael, you say, “I claim to understand the mechanism involved and all of its ramifications and all that it entails.” That’s nice..","date":"2013-12-13","mins":"10:32 am","url":"https://shroudstory.com/2013/12/13/update-at-the-holy-shroud-guild/","cat":"other_blogs","title":"Update at The Holy Shroud Guild"},{"id":"comment-58822","author":"paulette","post":"I couldn’t access some of the archives without a password..","date":"2013-12-13","mins":"9:47 am","url":"https://shroudstory.com/2013/12/13/update-at-the-holy-shroud-guild/","cat":"other_blogs","title":"Update at The Holy Shroud Guild"},{"id":"comment-57243","author":"paulette","post":"At the risk of hurting your feelings, it is VEAL. Can’t you get anything right?.","date":"2013-12-08","mins":"9:49 am","url":"https://shroudstory.com/2013/12/08/hurting-peoples-feelings/","cat":"other_blogs","title":"Hurting People’s Feelings"}]
