[{"id":"comment-16228","author":"paulette","post":"I actually agree with Colin’s criticism of the statement in a previous posting that “Drs. Jackson, Rogers, Di Lazzaro and Heimburger, all independently at different times, have adequately shown that. . . Heat cannot form a physically superficial discoloration of linen fibers.” They four have not. Not one of them has. Colin is right. But I must point out that Colin is completely wrong to attribute that statement to Dan Porter. Dan is quoting a reader who wrote to him just as Colin did. It is so obvious. How did Colin get this so wrong. Dan is very good about letting any of us have our say here, right or wrong. He does so whether or not he agrees. That letter was an example and this letter from Colin is an example. So are the articles by Yannick. Sometimes Dan will comment and sometimes he doesn’t. What the “4 named investigators” have done, however, is show that heat could not have produced the sort of superficial discoloration that exists in the shroud image. “Sort of” are the operative words here. If Colin can get this matter before the Royal Society it will be wonderful for shroud science. I say go for it..","date":"2012-09-13","mins":"12:39 pm","url":"https://shroudstory.com/2012/09/13/an-email-from-colin-berry/","cat":"other_blogs","title":"An Email from Colin Berry"},{"id":"comment-195166","author":"paulette","post":"The attraction of the circus side show..","date":"2015-04-02","mins":"5:10 am","url":"https://shroudstory.com/2015/04/02/barrie-schwortz-to-appear-on-coast-to-coastradio/","cat":"news_&_views","title":"Barrie Schwortz to Appear on Coast to CoastRadio"},{"id":"comment-166560","author":"paulette","post":"CB besmirched Rogers and STURP. He insulted everone involved with the St. Louis Conference He mocked the Enea scientists. He expects respect. Why?.","date":"2014-10-29","mins":"10:30 am","url":"https://shroudstory.com/2014/10/29/an-apology-to-colin-berry-and-some-comments/","cat":"other_blogs","title":"An Apology to Colin Berry.  And Some Comments."},{"id":"comment-16335","author":"paulette","post":"As I wrote before, if Colin can get his complaint about shroud science before the Royal Society it will be wonderful for shroud science. It does seem to me, however, that what Colin is doing, in trying to argue that a faint image is superficial is very unscientific. For the jpeg he has created ( http://shroudofturinwithoutallthehype.files.wordpress.com/2012/09/scorching with time as independent variable1.jpg ) he provides the following caption. “Effect of decreasing temperature v contact time on scorch intensity and likely degree of superficiality”. Likely? Why not examine it with a microscope? “Lacking as I do a microscope,” he writes, “I cannot check for superficiality at a microscopic level, but I see no reason why a scorch image should not show the same superficiality. . .” He then invites others to disprove him. “If anyone who has a microscope disagrees, then they are at liberty to check that assumption.” This would be like a man who upon looking at the surface of a vast lake declares the world is flat and invites anyone who has the means to disagree. This is not how science is done. The ball is in his court. Who does he think he is fooling? He goes so far, doing half of an experiment here and half of an experiment there, without even a microscope, to say that his hypothesis is worthy of being called a theory. Such arrogance is astounding. Dr. Colin Berry, Ph D, lifelong chemist, retired biomedical researcher, “previously Head of Nutrition and Food Safety at FMBRA,” certainly knows someone with access to all manner of microscopes to examine his linen experiments. He could mail his samples to any number of people. Would he trust capable people in the shroud community. If not, there are any number of scientists at CSICOP or JREF who would be delighted to help him. He could, with an index card and a thumb tack, or with the power of Twitter, find dozens of capable college students who would be delighted to prepare some photomicrographs in order to advance the cause of skepticism. Colin could tease apart a lightly scorched thread and see if the image is confined to the top two or three fibrils. He could show us how he is able to remove the discoloration with adhesive tape. And, of course, with photographic images of the coloration, he could show us how truly superficial, and on a scale like the shroud, a heat produced colorization is. Colin alludes to the work of others in his draft of a letter to the president of the Royal Society to complain about the state of shroud science. He alludes to the work others. That is fine. Let me just mention two. Dr. Nicholas P L Allen was quite convinced that the image was a proto photograph. He explained how “after immersion in an ammonia solution, most of the silver is removed from the linen cloth, and the resultant straw yellow image is formed not by the presence of silver but by a structural (chemical) alteration to the linen (cellulose) itself. He championed his hypothesis. He did the work to satisfy himself and to try an convince others. Unfortunately, the full sized image he created does not meet all of the characteristics of the image on the shroud and very few people buy into his hypothesis. Nonetheless, curiously perhaps or because of human nature or something like that, I think he still believes he is right. But he is to be applauded for his efforts. Dr. Luigi Garlaschelli argued that a forger used powdered ochre and a combination of three techniques (frottage, free hand and bas relief rubbing) to form the image. He thought that trace amounts of humic acids, salts and other organic compounds in the ochre chemically etched the cloth leaving an image as the powdered ochre fell away over time. Unfortunately, the full sized image he created does not meet all of the characteristics of the image on the shroud and few people buy into his hypothesis. Nonetheless, curiously perhaps or because of human nature or something like that, I think he still believes he is right. But he is to be applauded for his efforts. By way of contrast Colin writes, “Let me now briefly explain why I feel the time has come for RS members to get involved – as adjudicators between a broad separation in to two rival camps – the major pro authenticity camp that rejects any idea of the Shroud being a thermal scorch, and the “voice crying in the sindonological wilderness” camp – with a present membership of 1 – name appended at end – that says the Shroud image IS simply a thermal imprint, due to direct contact and passage of conducted heat between template and linen.” Curiously perhaps or because of human nature or something like that, I think he believes he is right even though he can do little more than say it seems likely, dare others to prove him wrong or claim to be the new Isaiah of shroud science..","date":"2012-09-16","mins":"5:21 am","url":"https://shroudstory.com/2012/09/13/an-email-from-colin-berry/","cat":"other_blogs","title":"An Email from Colin Berry"},{"id":"comment-47740","author":"paulette","post":"Why do I feel we are the victims of a super troll?.","date":"2013-10-17","mins":"5:50 am","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","title":"Colin Berry: The 1532 fire  was no accident"},{"id":"comment-27126","author":"paulette","post":"Colin Berry has resorted to mean and nasty personal attacks. What is he trying to achieve?One needs to load up the ridiculous http://bit.ly/Y Wrf KJ posting of his and scroll down 4/5 of the way to his personal attacks on Jones and Jackson and the whole of STURP. Did he mention that the rating of a professor that he shows was 1 of 1 and that such ratings are often by disgruntled students. “no Limeys. Frogs, Krauts, Itals, Dagos, Polaks, Ruskies etc? You know, those dodgy unassimilated foreigners with their strange accents,” he writes of STURP. Yeah, right. The Royal Society is going to listen to this elitist, angry man. I say it is time to boycott his blog altogether..","date":"2013-03-12","mins":"6:51 am","url":"https://shroudstory.com/2013/03/12/colin-berry-offers-a-definition-of-pseudoscience/","cat":"other_blogs","title":"Colin Berry offers a definition of Pseudoscience"},{"id":"comment-9414","author":"paulette","post":"Correction, last paragraph: change the evidence must be set aside to the carbon 14 test results must be set aside..","date":"2012-03-18","mins":"5:24 am","url":"https://shroudstory.com/2012/03/17/welcome-to-colin-berrys-new-straw-shedder-blog/","cat":"other_blogs","title":"Welcome to Colin Berry’s new Straw Shedder blog"},{"id":"comment-9413","author":"paulette","post":"Colin, how dare you say, “Just don’t expect me, a seasoned science bod, to believe that all this hot under the collar special pleading represents objective science. Don’t try to draw me into your denialist flat earther world, because, if the truth be told, I have seen this kind of thing over and over again, and it makes not the slightest impression on me.” You were speaking of course about the carbon dating. I recently served on jury duty. First the prosecution made their case. The police evidence was clear. He was guilty, it seemed. Then the defense brought forth some excellent chemists. They disassembled the prosecutions case, piece by piece. For all the world it was clear now, he was not guilty. We retired to deliberate. But an stuborn, retired “police bod” could not accept the possibility that the police labs had been wrong. He held out for four days before the judge declared a mistrial. An innocent man will be retried because of jury nullification by irrational denialism. Colin, you are clearly the xxx denialist, here. The evidence that the carbon dating was messed up is overwhelming. At the very least there is reasonable doubt and the evidence must be set aside. Seasoned science bod, ha. Questioning is what science is supposed to be about. (xxx represents editing. Dan).","date":"2012-03-18","mins":"5:20 am","url":"https://shroudstory.com/2012/03/17/welcome-to-colin-berrys-new-straw-shedder-blog/","cat":"other_blogs","title":"Welcome to Colin Berry’s new Straw Shedder blog"},{"id":"comment-25021","author":"paulette","post":"Why would anyone post comments on Colin’s blog, much less read his obnoxious, arrogant, insulting postings? Dan, did you actually read what he wrote in that long ridiculous posting? Here is what he previously wrote to Dr. Thibault Heimburger when Dr. Heimburger tried to make comments on Colin’s blog. Dr Heimburger, by the way, is one of the nicest people in the field of shroud research. “That is simply unscientific Thibault, and defies commonsense too” “With reluctance I have to say this Thibault – you don ‘t have the first clue as to the scientific modus operandi. Everything you write confirms that again and again”. ““Much more interesting”? Have you any idea how condescending and arrogant you sound, Thibault? What gives you the right to decide what is or is not interesting? For your information I find little of that section above interesting at all, and of dubious relevance.” “You are seriously testing my patience with your barracking and false insinuations…” “PS: And I see you have repeated your ridiculous allegations on Dan Porters’ site. Contemptible. And you have the nerve to bandy around the term “gentleman”. It is you, Thibault, who needs to look at the way you interact with others online. You need to stop talking down the whole time, or posturing as if you know all the answers. You don’t.” “” Is the banding effect (which is a fact) consistent with the scorch hypothesis? I wonder.. Thibault. You feel free to wonder,Thibault. Every second spent wondering is a second less spent promulgating your goal directed brand of pseudo science”. Dr. Heimburger wrote, “No more comment on this blog.” Meaning, of course, Colin’s blog. And that is why so few people visit Colin’s blog. It has nothing to do with style..","date":"2013-02-20","mins":"8:30 am","url":"https://shroudstory.com/2013/02/20/colins-new-blogging-style/","cat":"other_blogs","title":"Colin’s New Blogging Style"},{"id":"comment-28610","author":"paulette","post":"Given that the Archbishop’s official website tells us, “Recent experimental studies (by Leoncio A. Garza Valdes in San Antonio (Texas) and by Dmitrij A. Kouznetsov and Andrej Ivanov in Moscow) have furthermore opened the sientific debate about the tissue dating once again, with results seeming to prove a possible and considerable chemical and biological contamination of the tissue and therefore making it fundamental to start a wider research program to study and value the problem of introduction of a correction factor to the radio carbon date,” who would you trust? It’s a mindset. A canonically unauthorized scientific experiment cannot produce results..","date":"2013-03-28","mins":"10:36 am","url":"https://shroudstory.com/2013/03/28/an-inevitable-dispute-fanti-and-the-archbishop/","cat":"news_&_views","title":"An Inevitable Dispute?  Fanti and the Archbishop?"},{"id":"comment-10547","author":"paulette","post":"What does this sentence mean? “The challenge is already accepted and made possible is scientific terms by Prof. Giulio Fanti, of Padua University.” That is an actual sentence from David Rolfe’s challenge page. Has Dawkins accepted? I would think this would be big news. I suspect it is a typo. The letter to Dawkins still reads, “In your Shroud blog …” But Dawkins doesn’t have a Shroud blog. He has a Richard Dawkins Foundation blog. Within that blog he has a single posting about the Shroud. How is this challenge to be taken seriously with such errors? I will say it again. It is regrettable that Rolfe used Fanti’s paper for image criteria. The paper might be useful were it not for a sophomorically subjective, arbitrary and obviously biased scoring method put forth as an attempt to convince everyone that the image was formed by corona discharge. It was a serious mistake to make this very unscientific paper so readily available on Rolfe’s website. Will anyone take this challenge seriously? I agree with simplifying the image criteria statements to remove any assumptions about the image being formed by a real body. You cannot ask Richard Dawkins or anyone to solve the mystery of the image with such a blatant imposition of religious belief into what should be simply scientific facts. This challenge, if poorly implemented, will reflect poorly on Shroud science..","date":"2012-04-18","mins":"3:28 pm","url":"https://shroudstory.com/2012/04/18/an-email-from-david-rolfe-to-the-shroud-science-group/","cat":"news_&_views","title":"An Email from David Rolfe to the Shroud Science Group"},{"id":"comment-29107","author":"paulette","post":"Reputable scieentific journals don’t like to publish scientific work that has already been published in books or elsewhere. It used to be that shroud science was published in good journals with solid JCR ratings. Lately, much has been published in dubious journals like JIST or open access vanity journals like those from Academic Journals, which charge authors..","date":"2013-04-02","mins":"6:30 am","url":"https://shroudstory.com/2013/04/01/alan-boyles-cosmic-log-on-fantis-new-book/","cat":"news_&_views","title":"Alan Boyles Cosmic Log on Fanti’s New Book"},{"id":"comment-29111","author":"paulette","post":"This is all one step removed from TV ads that proclaim “scientists have discovered” this or that that will make you thin or grow some hair. After all this publicity, this is one time that we need enough public information from Giulio Fanti to enable other scientists to confrim his work..","date":"2013-04-02","mins":"6:36 am","url":"https://shroudstory.com/2013/04/01/alan-boyles-cosmic-log-on-fantis-new-book/","cat":"news_&_views","title":"Alan Boyles Cosmic Log on Fanti’s New Book"},{"id":"comment-57269","author":"paulette","post":"Ronaldi says: “One is led to suppose that Fanti for his test has selected the most deteriorated fibres from the Riggi debris!” And therefore the Fanti’s work is suspect. Habermas, Jones and others would be well advised to speak of the need to reject these tests. SSG is too much a world of Lone Rangers and glory seekers. We need a new STURP..","date":"2013-12-08","mins":"1:17 pm","url":"https://shroudstory.com/2013/12/07/revisiting-fantis-dating-methods/","cat":"science","title":"Revisiting Giulio Fanti’s Dating Methods"},{"id":"comment-57275","author":"paulette","post":"VEAL.","date":"2013-12-08","mins":"1:32 pm","url":"https://shroudstory.com/2013/12/07/revisiting-fantis-dating-methods/","cat":"science","title":"Revisiting Giulio Fanti’s Dating Methods"},{"id":"comment-57272","author":"paulette","post":"But the point is suspicion and lack of controls..","date":"2013-12-08","mins":"1:27 pm","url":"https://shroudstory.com/2013/12/07/revisiting-fantis-dating-methods/","cat":"science","title":"Revisiting Giulio Fanti’s Dating Methods"},{"id":"comment-49353","author":"paulette","post":"I notice Antonacci has dropped his claim that his article in the Chinese (or is it Nigerian) internet only, Brooklyn Bridge vanity journal was peer reviewed. Try to find a real physical address for the journal. I doubt Antonacci has any substantive support from any scientists in the shroud community. I hate to think what this is about when you see the same organization of his sponsoring the St. Louis conference..","date":"2013-10-31","mins":"3:35 pm","url":"https://shroudstory.com/2013/10/31/press-release-marino-endorses-antonacci-petition-and-proposal/","cat":"news_&_views","title":"Press Release:  Marino Endorses Antonacci Petition and Proposal"},{"id":"comment-49369","author":"paulette","post":"Marino signed the petition on May 9th. So this press release is stretching the truth a bit. There are about 20 duplicates, as many anonymouses, a few stupid names like Bippy123 and a dozen or more Antonaccis. I trust the pope will not be fooled. We should not be..","date":"2013-10-31","mins":"5:52 pm","url":"https://shroudstory.com/2013/10/31/press-release-marino-endorses-antonacci-petition-and-proposal/","cat":"news_&_views","title":"Press Release:  Marino Endorses Antonacci Petition and Proposal"},{"id":"comment-175203","author":"paulette","post":"Interestingly, the paper in question is not filed with the other conference papers but on Jackson’s own Colorado site. IOW do what we say not what we do..","date":"2014-12-08","mins":"5:54 am","url":"https://shroudstory.com/2014/12/07/a-response-to-the-critical-summary-presentation/","cat":"uncategorized","title":"A response to the Critical Summary presentation"},{"id":"comment-49354","author":"paulette","post":"Why is Antonacci’s book publisher putting out this press release?.","date":"2013-10-31","mins":"3:39 pm","url":"https://shroudstory.com/2013/10/31/press-release-marino-endorses-antonacci-petition-and-proposal/","cat":"news_&_views","title":"Press Release:  Marino Endorses Antonacci Petition and Proposal"},{"id":"comment-162539","author":"paulette","post":"Jackson’s name appears 104 times in 106 pages..","date":"2014-10-15","mins":"6:19 am","url":"https://shroudstory.com/2014/10/14/dj-vu-squared/","cat":"critical_summary","title":"Déjà vu Squared"},{"id":"comment-163962","author":"paulette","post":"Come to think of it, I’ve never seen anything but a drawing of the fold marks. Where are these photographs?.","date":"2014-10-20","mins":"4:42 am","url":"https://shroudstory.com/2014/10/20/in-the-belly-of-the-beast/","cat":"critical_summary","title":"In the Belly of the Beast"},{"id":"comment-213689","author":"paulette","post":"Scientific Fact: A dematerializing human body does not damage bloodstains on cloth falling through it,.","date":"2015-10-27","mins":"6:09 am","url":"https://shroudstory.com/2015/10/27/its-the-curmudgeon-in-me/","cat":"critical_summary","title":"It’s the Curmudgeon in Me"},{"id":"comment-22984","author":"paulette","post":"This paper silly and unscientific.. It is overly biased and omits so much. It is as big an embarrassment as Giulio Fanti’s attempt at doing something similar. . You remember David Rolfe’s attempt to use Fanti’s image characteristics before he settled in on that rushed up cabalistic Valencia “consensus”? Example: “No image can be found under the bloodstains, because they formed before the body image.” Give me a break: a scientist would never write “because” in an observation statement, particularly one that is not all that well confirmed. He or she might say is that the observation suggests a possible conclusion, never that it is explained by a conclusion. Example: “There are images of teeth and bone structures associated with the face. . .” Completely junky “I think I see.” Maybe there is something that looks like teeth and bones for which there are alternate explanations. This ought to wake up Colin Berry and Yannick Clement. Why did Jackson allow this on his website?.","date":"2013-01-29","mins":"10:54 am","url":"https://shroudstory.com/2013/01/29/paper-chase-new-the-shroud-a-critical-summary-of-observations-data-and-hypotheses/","cat":"news_&_views","title":"Paper Chase (NEW): The Shroud: A Critical Summary of Observations, Data and Hypotheses"},{"id":"comment-163975","author":"paulette","post":"Ice time at the skating rink..","date":"2014-10-20","mins":"5:14 am","url":"https://shroudstory.com/2014/10/20/in-the-belly-of-the-beast/","cat":"critical_summary","title":"In the Belly of the Beast"},{"id":"comment-163995","author":"paulette","post":"Is that it? Picture postcards of little squiggles? Where are these razor sharp lines at this size?.","date":"2014-10-20","mins":"7:04 am","url":"https://shroudstory.com/2014/10/20/quick-reaction-to-in-the-belly-of-the-beast/","cat":"critical_summary","title":"Quick Reaction to In the Belly of the Beast"},{"id":"comment-54435","author":"paulette","post":"Hi Colin. I thought you left us for the last time the last time. Will you be leaving us for the last time again? Or merely so?.","date":"2013-12-01","mins":"3:29 pm","url":"https://shroudstory.com/2013/12/01/remembering-shroud-blood-scientist-dr-john-h-hellera-guest-posting-by-kelly-kearse/","cat":"uncategorized","title":"Remembering Shroud Blood Scientist Dr. John H. Heller–A Guest Posting by Kelly Kearse"},{"id":"comment-49581","author":"paulette","post":"So you are the best scientist we have? Wow!.","date":"2013-11-02","mins":"10:25 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-84061","author":"paulette","post":"Jones’s “overwhelming evidence” is significantly his personal interpretations of scripture or unsupported beliefs in images of coins and plants on the cloth. That is a big problem. To get at real truth more testing is essential..","date":"2014-03-02","mins":"7:47 am","url":"https://shroudstory.com/2014/03/02/jones-the-turin-shroud-is-authentic-get-over-it/","cat":"other_blogs","title":"Jones:  The Turin Shroud is authentic. Get over it!"},{"id":"comment-97137","author":"paulette","post":"The study is flawed. Ever worked as an EMS? On sweaty, grimy, warm skin someone’s blood will run every which way, even in nearly horizontally rivulets. It flows. It gushes. It spurts. It mixes with sweat. I’ve been sprayed with blood from flailing limbs. Put a few drops of blood on your arm and jerk it hard to mimic a spasm. You can never reproduce violent outdoor traumatic blood flow on a body in pain with plastic tubing, air conditioning, calm and shower fresh skin..","date":"2014-04-06","mins":"2:20 pm","url":"https://shroudstory.com/2014/04/06/more-on-the-y-from-stephen-jones/","cat":"news_&_views","title":"More on the Y from Stephen Jones"},{"id":"comment-46386","author":"paulette","post":"I agree completely with Hugh. I was astounded when I read Stephen’s words. I thought Dan had misquoted him. But that was not the case. Why just the Roman Catholic Church? In 1998, John Paul II addressed the authenticity of the shroud by saying, “The Church does not have specific competence to pronounce on these questions. It entrusts to scientists the task of continuing to investigate to find suitable answers to the questions regarding the Shroud”. Those words could well suffice if an “official statement” was needed. JPII’s message was both forthright and reasoned. Stephen should reconsider what he wrote and clarify or issue a retraction..","date":"2013-10-07","mins":"2:24 pm","url":"https://shroudstory.com/2013/10/07/what-did-stephen-jones-just-say/","cat":"news_&_views","title":"What did Stephen Jones just say?"},{"id":"comment-141230","author":"paulette","post":"When people get together to play Bridge there is always a joker who wants to play another game. STURP stayed the course with what they set out to do. Sorry, Colin, negativity is another subject. What you have to say is interesting but your unscientific bias against STURP is showing..","date":"2014-07-30","mins":"9:10 am","url":"https://shroudstory.com/2014/07/30/a-significant-criticism-of-sturp/","cat":"other_blogs","title":"A Significant Criticism of STURP"}]
