[{"id":"comment-87316","author":"clublu22014","post":"Right… I get your point Hugh… someone in the patchwork department back then had a case of bad nerves. The blood being on the model first before the shroud is also interesting. But what about the case of rigor mortis that so many medical doctors determined was apparent when studying the TS. Would you say that was cause and effect of a statue or of a dead man?.","date":"2014-03-11","mins":"7:24 am","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","title":"Of Google Doodles and Other Coincidences"},{"id":"comment-87318","author":"clublu22014","post":"Mike M : Clublu22014, thank you for the nice words, I don’t think I deserve them. The image on the back of the cloth is still debated. A poor photograph of the backside of the shroud is available in the following link (hat tip to Hugh) http://shroud.wikispaces.com/PROPERTIES As you can see, ( or can’t see) it doesn’t look that there is an image there. G. Fanti believes there is, and has published a paper describing that image. He used filters to decrease background noise and increase contrast, according to him the image on the back is: 1 superficial (i.e doubly superficial) 2 only for the ventral figure not the dorsal one. 3 three dimensional. 4 corresponds to the front image location. 5 slightly different from the front image (e.g. The nose on the back presents “the same extension of both nostrils, unlike the front side, in which the right nostril is less evident.” I believe the church has in its posession high definition images for the backside that has not been published yet, lets hope they release it sometime in the future. I personally believe the veil of Manoplello to be a painting. There is clearly brush strokes evident around the lips and the eyes. To me, it looks like a work of art. However, I believe the Sudarium of Oveido to be the facecloth that was mentioned in (John 20:7) “and the face cloth which had been on His head, not lying with the linen wrappings, but rolled up in a place by itself.” Mark Guscin has done a great Job bringing the sudarium to light. This video from You Tube explain a lot about the sudarium. Http://m.youtube.com/watch?list=P Lb Bb BRYEF Bb3h Po c SF 9eikve1p E Nm5k&v= ojy ZX5 iy U&feature=plpp Mike M: You well deserve many kudos! Thanks for responding and answering to all my neophytic questions..","date":"2014-03-11","mins":"7:30 am","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","title":"Of Google Doodles and Other Coincidences"},{"id":"comment-87321","author":"clublu22014","post":"Clarification of above in addressing Hugh’s gracious explanation of the TS image formation: I meant to ask: Would you say the image formation was the cause of a statue or of a dead man?.","date":"2014-03-11","mins":"7:45 am","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","title":"Of Google Doodles and Other Coincidences"},{"id":"comment-86919","author":"clublu22014","post":"Mike this is an amazing reconstruction from your insight into Dr. Jackson’s research! Thank you for making us realize how lucky we are to view the Shroud more true to form! (Just wondering, if you could help me out on answering if the patches and the Holland Cloth backing sewn on after the fire in 1532 were of cotton or of linen. I read conflicting reports.) Thanks again, Mike! I’m not too sure what Hugh means by the Church removing (burn) marks showing signs of fakery. How does cleaning up the Shroud show signs of fakery?.","date":"2014-03-10","mins":"8:41 am","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","title":"Of Google Doodles and Other Coincidences"},{"id":"comment-86930","author":"clublu22014","post":"Thank you so much Mike… (You’re amazing!) You’ve help me so much in understanding the Shroud better! Do you have any insight into the slight image formation found after the Holland Cloth was removed? Was it only surface fibers affected and was it an image suggesting the face? And, what do you think of Sr. Blandina’s theory of multiple funerary cloths used at the time of this burial, cf: Sr. Blandina Schlöemer: Website: Sudarium Christi.com/uk/tomb/compare.htm, Barrie doesn’t relate well to this. He thinks the Shroud was the only burial cloth used. What is your opinion? Again, I am deeply grateful for any and all of your insights, Mike..","date":"2014-03-10","mins":"9:29 am","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","title":"Of Google Doodles and Other Coincidences"},{"id":"comment-86967","author":"clublu22014","post":"Hugh, this is a most interesting theory! I’m wondering what’s the source… Picknett & Clive?’ And, what then about the blood being placed first on the Shroud precluding the rendering of any artistic manipulation of the image?.","date":"2014-03-10","mins":"11:57 am","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","title":"Of Google Doodles and Other Coincidences"}]
