[{"id":"comment-122102","author":"clublu22014","post":"Thanks Max! Can I find your paper on Shroud.com?.","date":"2014-05-20","mins":"1:14 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","title":"Documented Pieces Removed from the Shroud"},{"id":"comment-98343","author":"clublu22014","post":"Good deduction, Joe. It leaves me frustrated how those in academia can collaborate and get a C14 date just the way they want it out to the public and close the door to further questioning of a non sequitur (400 years anon) reference to the Jesus of the Gospels while those in a conspiratorial circle can confound the real reference to Jesus (the 1st century Shroud) and keep the door open to controversy..","date":"2014-04-11","mins":"8:16 am","url":"https://shroudstory.com/2014/04/10/carbon-dating-problems-with-the-jesus-wife-fragment/","cat":"carbon_14_dating","title":"Carbon Dating Problems with the “Jesus’ Wife” Fragment"},{"id":"comment-122118","author":"clublu22014","post":"Max, this editorial of yours is so magnificent, so thoroughly thought out and researched! Why don’t you publish it in English on Barrie’s Shroud.com?… It’s overdue for a wider audience! Do you plan to attend the St. Louis Shroud Convention this October? Your paper should be presented there in any case!.","date":"2014-05-20","mins":"1:41 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","title":"Documented Pieces Removed from the Shroud"},{"id":"comment-122141","author":"clublu22014","post":"Too bad, Max. The work you’ve done is BRILLIANT! I’d like your autograph!.","date":"2014-05-20","mins":"2:11 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","title":"Documented Pieces Removed from the Shroud"},{"id":"comment-122223","author":"clublu22014","post":"Hi Max, Google translates your excerpt well: “ Non detection zone (if not both) has undergone invisible to the naked eye repairs All this set of direct and indirect evidence is a consistent body of evidence: it tends to testify in said steeper and darker area, an intervention by a special technique inspired by the technique of ” reweaving the French “(well known master – weavers as well as experts in the history of tapestry); technique he should not however be confused with that of a simple ” entissage ” a medieval patch, spotted, meanwhile, to the naked eye and natural daylight by a specialist. The technique in question here is more precisely that of a ” reweaving by splice ” without seams or knots, made , apparently , in a shaving light and under a strong magnifying glass. It requires a lot of patience and great dexterity. It consists in, first, the foundations and the basic chain. To do this, either the weaver begins by identifying the fiber material constituting the son of the chain then provides either systematically uses cotton fibers. Then these fibers are spun to obtain the thickness of the original son then carefully twisted on themselves and on site fiber son string extracted from the hidden part of the tissue to be repaired. Son of the replacement frame are then placed on top and below the chain son reconstituted fibers then are twisted on themselves, again with care, fiber of the son original frame so as to reproduce exactly texture or pattern of the fabric and so close, without knots, the hole or severely sheared zone. Finally to make this wire restoration wire completely invisible and consolidate splices, dyeing gum base resin is applied topically to the frame and rebuilt before it , from which the effect of texture or pattern is based on the original (in this case the yellowed patina ivory canvas by centuries ). This intervention under grazing illumination and a magnifying glass, if it is well done and well hidden, can actually be visible on both sides of a piece of cloth to the point of sometimes escape even by hand and eye exercised by a skilled person who, to the naked eye and under inadequate light, tends to confuse these reconstructions with irregularities occurred during weaving. In fact, small scale structure of the original linen of the Shroud, its strong enough and its tightly woven herringbone caliber are likely to perfectly integrate this type of intervention. As for sample Zurich (and hence ” Sample 1 Arizona “) alleging the clear part of the official band of C14 Shroud , although it does not appear to have any or very little trace contamination any teinture14 , not least should be covered with a patina of microorganisms. By the abnormal appearance of the area where it was taken, it strongly suggests, in any case, a second type of response undetectable to the naked eye as done, too, it seems, under a grazing lighting and under a strong magnifying glass “to mending a loss.” This technique is very specific to insert, between the son of weft and warp, the son (cotton here), which in each case are cut off at both ends without knots, thus leaving literally lost in the fabric existing flax. These two specific types of intervention (one in the sense of a replacement carbonaceous material, the other in both a replacement and a slight contribution) would account for the wide dispersion of observed results (1238 1407) on a small distance (just four centimeters of tissue). The coating of gum arabic is soluble in water and present in this area of the upper left corner, there could not have been applied to the surface samples Raës son and C14 after the fire of the Holy Chapel of Chambéry 1532 dyeing had she been before, it would not have hidden the end of the upper edge of the large jagged halo because the water from the fire had driven the products of pyrolysis at the heart of local son. This late addition colored coating due to the lack of fluorescence observed in this particular area of the UV sheet. The conservation history of the Shroud in 1532 after dating allows, in a very precise manner, at least one or both interventions. Only, in fact, the four sisters Clare in 1534, and Princess Clothilde of Savoy Bonaparte, in 1863/8, which intervened on the extended relic way, could make such repairs invisible hands as experts. Poor Clare sisters are entrusted with the views very specific spot repair and strengthen the damaged piece of cloth in the fire of 1532 , the Princess of Savoy Bonaparte thus proves to be for these delicate restoration work, the most highly probable candidate ( assisted or not it upholsterer master of the royal court at the time). This all in 186, it was already more than five centuries at each exposition with bare hands, the relic is found to be stretched horizontally. This explains (or explain ) why , when cutting the sample and lack of adequate lighting (UV light or grazing ), both local variants passed completely unnoticed textile experts to oversee the levy the official dating from 1988. All their attention was then absorbed either by the technical study of the sheet (they saw for the first time) by the annoying presence of the son of the thick seam bound residue of the upper Shroud fabric cutting. Thus they forgot to make a careful examination of the heart of the textile to collect site. The had they looked , they could not have missed, in fact, be identified early reconstruction of serpentine form , dyeing concealing the end of the upper edge of the large halo of water and the indented character more stiff and darker area. In principle, an “invisible” restoration cannot escape the account over and a fortiori when the binocular eye behind is competent. Photos that show Francesco Testore and Gabriel Vial ( † 2005) Prs bustling with various instruments , however, it is little misleading in that they suggest that such experts were engaged in preliminary integrity checks said area when in fact their audits were not extended to the heart of the sample but were confined to one edge of the sheet. And believing he released the sample to any foreign frayed wire edges , they left to the operator, Giovanni Riggi di Numana ( † 2008), ” care ” to reduce to a slightly more regular rectangular strip coarse rectangle thereof, using scissors surgeon, had just extracted without protective gloves and more or less uneasily at the main room. Obviously, this engineer (who fell the responsibility and choice of location and the sampling)! Textile expert was not any more than it was carbonologue or archéologue 15. It seemed indeed to ignore how, on radiocarbon, high technology Accelerator Mass Spectrometer (suitable for measurements on microarrays) appears to be susceptible to contamination including that of human sebum. This choice of an area that had been, over the centuries, many manipulations with bare hands during exhibitions was thus already, from that point of view, anything but wise. “.","date":"2014-05-20","mins":"4:33 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","title":"Documented Pieces Removed from the Shroud"},{"id":"comment-122570","author":"clublu22014","post":"Well stated, Sir Dave B. Of Wellington!.","date":"2014-05-21","mins":"8:12 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","title":"Documented Pieces Removed from the Shroud"},{"id":"comment-98360","author":"clublu22014","post":"Loved reading your well informed insights Dave re GJW… and wholeheartedly agree!.","date":"2014-04-11","mins":"10:02 am","url":"https://shroudstory.com/2014/04/11/more-on-the-carbon-dating-of-the-gjw-gospel-of-jesus-wife-fragment/","cat":"carbon_14_dating","title":"More on the Carbon Dating of the GJW,  ‘Gospel of Jesus’ Wife’ Fragment"},{"id":"comment-98382","author":"clublu22014","post":"I’ve seen this video a few times but it is always nice to refresh the memory especially with the Shroud pioneers of a young Barrie Schwortz, Vern Miller, Don Lynn, Alan Whanger. Portrayed with awe, continuity, and conviction..","date":"2014-04-11","mins":"12:08 pm","url":"https://shroudstory.com/2014/04/10/ray-schneider-why-is-the-carbon-dating-wrong-i-dont-know-that-it-is-wrong-i-am-quite-certain/","cat":"carbon_14_dating","title":"Ray Schneider: Why is the carbon dating wrong? I don’t know. That it is wrong I am quite certain . . ."}]
