[{"id":"comment-173615","author":"clublu22014","post":"Me too… we must be in the same light, Dave..","date":"2014-11-29","mins":"11:31 am","url":"https://shroudstory.com/2014/11/29/a-warning-about-what-we-perceive/","cat":"science","title":"A warning about what we perceive"},{"id":"comment-111392","author":"clublu22014","post":"Right on Dan! Peter Berger was revered at Boston College when I was a student there in the 1970’s… I rather thought he might have petered out. Nice to see he’s still going so strong and leading a charge for a Social Construction of Reality at age 85!.","date":"2014-05-05","mins":"12:28 am","url":"https://shroudstory.com/2014/05/04/everyone-goes-to-heaven/","cat":"news_&_views","title":"Everyone Goes to Heaven?"},{"id":"comment-111395","author":"clublu22014","post":"Just tempted to quote Augustine, Confessions: “Our hearts are restless”… (uncomfortable, diseased, in hell).. Until they rest in Thee… Augustine believed in a Trinitarian God: Holy Spirit Son Father….","date":"2014-05-05","mins":"12:37 am","url":"https://shroudstory.com/2014/05/04/everyone-goes-to-heaven/","cat":"news_&_views","title":"Everyone Goes to Heaven?"},{"id":"comment-97886","author":"clublu22014","post":"I agree wholeheartedly with Dan! I never knew how to respond to such lack of love and care as the camp of Colin Berry shows. I’m in favor of letting the Dan camp handling it. I’m sure Barrie would never sue Colin for libel or slander. Barrie has too much genuine love and care going for him!.","date":"2014-04-09","mins":"10:29 am","url":"https://shroudstory.com/2014/04/09/i-too-can-be-a-practitioner-of-peudocience/","cat":"news_&_views","title":"I, too, can be a practitioner of p$eudo$cience"},{"id":"comment-124141","author":"clublu22014","post":"Irritatingly insane… starts in the dark… then pretends to throw some light on it with false C2 (info) then wraps it up with more insanity… And, how is the Shroud related to the JFK assassination in front of the book repository? Did someone die for this insanity?.","date":"2014-05-24","mins":"4:55 pm","url":"https://shroudstory.com/2014/05/24/insanity-break-it-is-about-the-shroud-or-maybe-well-i-cant-be-sure/","cat":"tinfoil_hats","title":"Insanity Break:  It is about the shroud or maybe, well I can’t be sure"},{"id":"comment-216575","author":"clublu22014","post":"Oh Dan, thank you sincerely for making the Shroud come alive for me all these 7 years. What a marvelous person you are! And, just as you will never truly “know” whether or not the Shroud is ‘authentic’ but believe it to be, so you will never really “know” the depth of goodness and grace, curiosity and intelligence, insight and esteem, you have given to all those participating in your beautiful and enriching blog: Shroud Story.com! I feel as if I am losing a ray from the Light of Christ in losing you now. But I shall the rest of my days bask in the Light you have allowed to shine! Annette Cloutier, a devoted fan.","date":"2015-12-15","mins":"9:37 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-173299","author":"clublu22014","post":"But we know the TS Image was not made from sweat and blood, so why the supposition? Why bring up the Besancon Shroud when there is no current comparison?.","date":"2014-11-27","mins":"8:30 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"}]
