[{"id":"comment-154379","author":"david_goulet","post":"As usual your cryptic notes are useless. Whom are you quoting? The link to Dan’s other site has some meaning? A point can only be made if everyone understands the context. Presuming everyone else functions on the same wavelength as you is the height of hubris. Next, indeed..","date":"2014-09-23","mins":"3:00 pm","url":"https://shroudstory.com/2014/09/23/a-bold-conclusion-the-blood-the-image-the-man/","cat":"blood_studies","title":"A Bold Conclusion:  the Blood, the Image, the Man"},{"id":"comment-154395","author":"david_goulet","post":"The article is 250 pages, I’ve barely had a chance to read through the table of contents. The post itself is merely pointing out an intriguing article. Even so, when I give my opinion I will provide more context than you. Spewing out sentence fragments may pass for ‘giving your opinion’ in your world, but in the real world it’s just useless drivel..","date":"2014-09-23","mins":"3:28 pm","url":"https://shroudstory.com/2014/09/23/a-bold-conclusion-the-blood-the-image-the-man/","cat":"blood_studies","title":"A Bold Conclusion:  the Blood, the Image, the Man"},{"id":"comment-154428","author":"david_goulet","post":"I appreciate the clarification. If I am terse it’s only because I am eager to hear the opinions of more expert commenters, like yourself, and it’s frustrating to not have you provide more detailed counter points. A good insight is a valuable thing..","date":"2014-09-23","mins":"4:12 pm","url":"https://shroudstory.com/2014/09/23/a-bold-conclusion-the-blood-the-image-the-man/","cat":"blood_studies","title":"A Bold Conclusion:  the Blood, the Image, the Man"},{"id":"comment-36800","author":"david_goulet","post":"I’ll second that request..","date":"2013-06-12","mins":"2:38 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-200564","author":"david_goulet","post":"Without access to new studies of the shroud itself, shroud ‘science’ (whether pro or con authenticity) is becoming little more than farce..","date":"2015-05-29","mins":"10:00 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","title":"Colin Berry is not Seeing Red"},{"id":"comment-85196","author":"david_goulet","post":"Good posting, Yannick. Much to ponder indeed..","date":"2014-03-05","mins":"1:22 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-89644","author":"david_goulet","post":"Max, what was the purpose of placing coins, Roman or otherwise, in a Jewish burial shroud/tomb?.","date":"2014-03-16","mins":"12:58 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-89798","author":"david_goulet","post":"That’s what perplexes me. Were these non practising or fallen away Jews who were hedging their bets by adopting pagan customs? What is the motivation of a devout Jew to adopt a pagan burial custom? It also seems odd that anyone would place a coin on Jesus’ body given his Gospel actions of cleansing the Temple of the money changers (the symbolism being clear that the Holy of Holies was to have no admission price) and the ‘render under Ceasar’ teaching that showed complete indifference to the importance of earthly currency. There may have been Jews who ended with coins in their tombs, but for this particular Jewish rabbi it makes no sense. Possible yes, probable no. Of course Max (and a few others) claim to see the coins there. If they are right then it’s a mystery to me why they were put there..","date":"2014-03-16","mins":"10:14 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-85531","author":"david_goulet","post":"I don’t either…but Max says flowers were used in Jewish burials, as they were in pagan ones. The crown of thorns is – as far as we know – a torture unique to Christ. I believe as Mike notes that there’s no way they left it on Jesus’ body. And as he was dead, removal – while ‘messy’ – is not going to harm the corpse. If I saw the terrible wounds left by this mocking crown, I’d be moved to replace thorns with flowers – for both symbolic reasons and the practical (smell, insect repellent, etc). It’s total conjecture, I know, but Occam’s Razor can’t always account for the poetry that is human behaviour..","date":"2014-03-06","mins":"11:17 am","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-90486","author":"david_goulet","post":"Max, you do know that this is not Twitter. You can put all your ideas in one longer post rather than 7 thousand short ones..","date":"2014-03-18","mins":"4:36 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-90562","author":"david_goulet","post":"It’s a fair point, Daveb. But we don’t consider ourselves ritually unclean because we touched a tax collector either. We have to be mindful of the differences in our cultural contexts as well as the similarities. I for one won’t rule out coins on Yeshua’s eyes, but it just doesn’t gel with what the Gospel’s imply — of course they don’t tell the whole story (historically speaking) either. As with so much of the Shroud, it is mystery wrapped in mystery..","date":"2014-03-18","mins":"9:59 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-90776","author":"david_goulet","post":"The idea that the coins on eyes, on Jesus, were a rebus is novel. I could see Joseph placing Pilate coins on Jesus to echo Jesus’ teaching “render unto Caesar” — in other words “these coins belong to this world, just like this corpse” but Jesus’ spirit belongs to God and heaven. Pilate can have the flesh, God takes the soul. The human reflex for symbolism can never be underestimated..","date":"2014-03-19","mins":"9:48 am","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-91649","author":"david_goulet","post":"Not sure if I’m one of ‘them shroudies’ but I did comment above that your theory that the coins on the eyes may be a rebus was interesting. If Joseph, or other burier, placed Pilate coins on Jesus’ eyelids with symbolic irony in mind, this gels with the Gospel context. Or, if the coins are there and it’s following mere custom, then perhaps the Gospel accounts exaggerate the Jewish distaste for pagan imagery. My main problem with the coins is not so much philosophical. Everything we can see (that we all agree that we see) on that image is organic based: blood, human flesh, hair. However the image was formed (gases, light, heat) it appears to be connected to the body itself. How then did the coins, which are metal and not organic, leave an image? If anything they should have blocked image formation over the eyes or wherever they fell. Flowers…maybe…as they are organic might have allowed for image transfer. But here’s another question, as long as we are musing. I think of how microwave radiation can cook meat yet leave the paper towel covering it unaltered. Could some form of exterior light or radiation discharge have altered the body inside the linen, leaving the image without affecting the linen itself. I suppose this is merely a reverse idea to Fanti’s corona discharge hypothesis – where (if I’m correct) the thought is that the energy started inside and progressed outward..","date":"2014-03-21","mins":"3:42 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-91661","author":"david_goulet","post":"Thanks for backtracking to that one, I missed it. A blood imprint…hmmm…that at least would be consistent with what we do know about possible image formation..","date":"2014-03-21","mins":"4:15 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-88235","author":"david_goulet","post":"The ‘fresh’ stage of decomposition often has no obvious sign beyond rigor. But the process begins once the heart stops beating. Better to say there are no signs of advancing decomposition. The alkaline solution theory…could this be tested somehow?.","date":"2014-03-13","mins":"9:24 am","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-200234","author":"david_goulet","post":"Great stuff! One suggestion for the video. After you unwrap Jesus (Ken) can you have Mary Magdalene (Barbie) enter the scene? ;) Would have been good to have wrapped one of the classic GI JOE figures — more facial hair than our man Ken! Can’t wait to see the results of this experiment..","date":"2015-05-26","mins":"6:55 am","url":"https://shroudstory.com/2015/05/26/fascinating-video-from-dave-hines/","cat":"blood_studies","title":"Fascinating Video from Dave Hines"},{"id":"comment-97625","author":"david_goulet","post":"Mike M : …And the size of the nail. For all I know those mock crucifixions are all done under medical supervision and they avoid hitting major blood vessels and nerves in the process. Some of those people has been crucified >20times, the scars from the previous events used as a guide. It doesnt compare to what Jesus went through, It’s not an execution. I agree. A relatively thin nail through a hand is not, usually, a catastrophic injury. Painful, I’m sure, and there could be nerve damage and the danger of wrecking veins. There are side show folks who pierce themselves to a similar degree. When one knows the pain is temporary and the experience controlled there is none of the psychological trauma that a truly condemned person experiences. Look at professional wrestlers who have themselves thrown into barb wire, have staples fired into their flesh, or fall from great heights. They experience great pain but they maintain control of the situation, brutal though it be. Take those same wrestlers and have them experience this involuntarily, at the hands of a sadist, and they would know a very different level of trauma. Roman crucifixion is not something any modern doctor would sign off on for reenactment..","date":"2014-04-08","mins":"9:24 am","url":"https://shroudstory.com/2014/04/07/garlaschelli-and-borrini-study-flawed/","cat":"blood_studies","title":"Garlaschelli and Borrini Study Flawed"},{"id":"comment-97640","author":"david_goulet","post":"That’s the million dollar question isn’t it?.","date":"2014-04-08","mins":"11:44 am","url":"https://shroudstory.com/2014/04/07/garlaschelli-and-borrini-study-flawed/","cat":"blood_studies","title":"Garlaschelli and Borrini Study Flawed"},{"id":"comment-40126","author":"david_goulet","post":"I think your reasoning is logical and has a good probability of being correct. However may I ask you, and everyone else here, to stop appealing to Occam’s Razor. There are too many unknowns and variables with the Shroud to apply Occam’s Razor. When both sides of an opposing argument can appeal to it it demonstrates its irrelevance to the discussion. Sorry, it’s a small pet peeve..","date":"2013-07-30","mins":"1:42 pm","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40154","author":"david_goulet","post":"I’ve brought this up before, so please indulge me. But what would be the effect on the body if it was not washed but had been rained on? Perhaps the rain lands more heavily on some areas than others. It leaves the head wetter because the hair retains moisture. The rain washes some blood away, but perhaps causes other wounds to moisten and weep. The rain may have made the body cleaner, though not as clean as a manual washing. It would be sporadic compared to human washing. But it also may have meant the mourners did not feel as obliged to manually wash the body since it had been rain washed. Just thinking out loud here. Total conjecture. But the Gospel does mention a storm (which may not even have been a rain storm) but if it was a rain storm what effect would rain have on a body on a cross, on the wounds? Any thoughts?.","date":"2013-07-30","mins":"4:56 pm","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40151","author":"david_goulet","post":"It’s not a detective story in a pulp fiction sense, but it does share elements found in real police detective work. One gathers evidence, one analyzes it, and forms conclusions accordingly. The Shroud is a mystery and we are trying to solve it – hopefully relying on science and reason, though faith plays its part by adding intuition that can guide science and reason. Being open minded means ‘me’ being open to others’ theories not just them being ‘open’ to mine. This has been a good thread though, very thought provoking..","date":"2013-07-30","mins":"4:45 pm","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40190","author":"david_goulet","post":"Excellent analysis, Yannick. Some of it made me reflect again on the idea of rain being involved. One of the reasons I’d felt rain wasn’t a good theory is because it would have created mud at the foot of the cross and this mess would likely have found its way onto the body and Shroud. But if it was mostly rocky, as you point out, this is another matter. The rain may have been short lived, just enough to ‘wash’ the body to some degree (the rain’s angle, intensity and position of the body relative to it are the unknown variables). It dries up again by the time Jesus is removed from the cross. I don’t think your sweat wash idea works. I have lived in very humid countries and played sports in them. I would sweat like crazy. But the sweat never acted the same as a ‘wash’. If it anything it merely further cakes any dirt on your body. I also wonder if a severely dehydrated body, as Jesus’ surely was, would have been able to produce that much sweat anyway. By the way, I’m not convinced the reference to a storm is a literary device. We accept so many other details of the Gospel Passion accounts as mostly factual. The detail about there being an earthquake is considered a possible fact by some (including the damage to the veil in the Temple), so I don’t see why the storm detail couldn’t be factual as well. Perhaps I should apply Occam’s Razor to my rain theory? :).","date":"2013-07-31","mins":"9:22 am","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40201","author":"david_goulet","post":"Though I have not put the hours of research into this, as both you and jesterof have, I do find the washing theory less compelling. You have raised good points about Jesus being clothed in a tunic when he trudged (and fell) to Golgotha. This would have indeed kept the dust of the city streets off much of his body, and rock paths are not as prone to producing grime as sandy ones. The sweat wash I’m still not sold on but certainly sweat would have been a contributing factor. So many variables, most of which we can never know one way or another. What details might the Gospels have missed, or left out for some reason? God must love jigsaw puzzles..","date":"2013-07-31","mins":"1:31 pm","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40246","author":"david_goulet","post":"I suppose if there had been a significant rain this would have been mentioned in the Gospels more specifically – simply because it would have been, as we’ve said, very dramatic. I mean if Gibson added it because of its incredible symbolism, I’m sure the Gospel writers would have certainly put it front and center too. When reality provides a perfect symbol, you use it in the foreground. When it doesn’t, you add it artistically to the backdrop..","date":"2013-08-01","mins":"9:51 am","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40256","author":"david_goulet","post":"You raise a good point about the ground and removal of the body. Was the body lain on the ground itself, or perhaps another cloth different than the shroud (the already soiled tunic from the march to Golgotha), or a piece of wood? Dabbing indeed is much different than washing. I agree that if it was Jesus’ followers who removed him from the cross and prepared his body they would not have cared about any prohibition regarding cleaning the corpse of a man condemned as a criminal. To them he was no criminal. As always more questions than answers..","date":"2013-08-01","mins":"12:28 pm","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-196435","author":"david_goulet","post":"If the image is a man made forgery, then the blood flows were added for effect. In fact all the blood on the Shroud is added for effect. Much has been made of the scourge marks — too perfect, too artistic – claim some. It’s a valid observation, the scourge marks are very symmetrical and one would almost expect an artist’s hand at work (if one doesn’t consider a Roman scourger an artist of sorts). But then why would an artist add extraneous blood flows? Why not more blood along the forehead – or in the spot where the spear pierced his side – the places an audience would expect to see blood? Why odd arm blood flows and epsilons? Ultra realism from a medieval artist? Not likely..","date":"2015-04-15","mins":"12:38 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-209482","author":"david_goulet","post":"It’s Heimburger, Gerry..","date":"2015-09-02","mins":"10:44 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209126","author":"david_goulet","post":"Religious harmony begins with listening to what your neighbour believes and respecting his free will to believe it. Discussion can begin when he reciprocates. The Truth will reveal itself in the process..","date":"2015-08-27","mins":"10:35 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209129","author":"david_goulet","post":"I shall respond to that question the same as Jesus responded to Pilate. :).","date":"2015-08-27","mins":"11:09 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209134","author":"david_goulet","post":"Then let us pray discussion flows from the harmony..","date":"2015-08-27","mins":"12:55 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209139","author":"david_goulet","post":"It is your contention then that certain Islamic groups would like to use the Shroud as a wedge against Christians, using it to deny the Resurrection ever happened. As such, you see the Ahmadiyya event as a means to that end, and thus any prominent Shroudies that attended (like Hugh and Barrie) as unwittingly aiding and abetting that agenda. This in turn will make Church officials more nervous as to the direction Shroud thought is heading and make them less open to new study of the relic. Have I summarized this correctly?.","date":"2015-08-27","mins":"1:34 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209142","author":"david_goulet","post":"Fair enough. I’ll do so this evening..","date":"2015-08-27","mins":"2:01 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-208862","author":"david_goulet","post":"Excellent questions..","date":"2015-08-24","mins":"8:20 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209152","author":"david_goulet","post":"Thanks for bring us back on point with this important post..","date":"2015-08-27","mins":"3:33 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209282","author":"david_goulet","post":"Then why don’t you respond to some of the rebuttals and questions raised by John, Louis, Nabber, and Barrie. And Carlos’s quotes also are not doctrine but Gospel evidence that Jesus died….yeah as in his heart stopped beating and he was decidedly deceased. And don’t be givin’ me no jive, now. ;).","date":"2015-08-29","mins":"10:40 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209322","author":"david_goulet","post":"Not enough room on this ‘little blog’ for detailed defences of theory, but room enough for a personal rant. Go in peace..","date":"2015-08-30","mins":"4:51 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209372","author":"david_goulet","post":"If nothing else, I feel Ron has brought to the surface an underlying motivation for the ‘Jesus in Kashmir’ theory: it eliminates all traces of European culture from the Christian story. There is, not without warrant, a deep resentment in Asia, Africa, the Americas of European empire making which so often was hand in hand with the Church. Certainly there’s a huge disconnect between the message and life of Jesus and the impact so called Christian nations have left on the Earth. Gandhi said it well, “‘I like your Christ, I do not like your Christians. Your Christians are so unlike your Christ.’ By finding alternative narratives for Jesus, those with an axe to grind against European Christianity can lay claim to Jesus as their founder too. They can boast that the Jesus they follow is unsullied by Western thought. It is unfortunate that non Europeans feel this aversion to European Christianity, but given the history of the Holy Roman Empire and beyond, I can sympathize with the sentiment..","date":"2015-08-31","mins":"12:06 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209399","author":"david_goulet","post":"But Louis you act like religious belief springs from a vacuum. Even the belief of the first believers in Jesus, in Judea, was formed by their experience of Roman colonialism. Your comment about Gandhi proves my point. There is an internal yearning for what Jesus of Nazareth is offering us, but too often it comes packaged by those who have expropriated it for their own ends. Truth is, we do not know how and why exactly the Jesus in Kashmir myth took root. A host of variables were likely in play. To dismiss the cultural context of the time seems rather short sighted..","date":"2015-08-31","mins":"8:16 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-73942","author":"david_goulet","post":"Well done, Dr. Kearse. So for us science challenged Shroudies, the gist of the paper is: DNA is such a complex element to work with that all existing conclusions (re: the Shroud) should be considered unconfirmed at best. We have new technologies and methodolgies that would allow us to provide much more accurate and confirmable conclusions. It would be nice if these someday could be utilized. This paper is a great audtion for Dr. Kearse to be a member of any STURP II..","date":"2014-01-21","mins":"10:43 am","url":"https://shroudstory.com/2014/01/21/paper-chase-dna-analysis-and-the-shroud-of-turin-development-of-a-shroud-codis/","cat":"blood_studies","title":"Paper Chase:  DNA Analysis and the Shroud of Turin: Development of a Shroud CODIS"},{"id":"comment-102306","author":"david_goulet","post":"Agreed. The psychosomatic element could account for much of the stigmata characteristics. The body experiences what it expects to experience..","date":"2014-04-22","mins":"7:27 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","title":"Stigmata and the Shroud of Turin"},{"id":"comment-102749","author":"david_goulet","post":"They said the same thing about alchemy but thankfully that never stopped Merlin!.","date":"2014-04-23","mins":"9:10 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","title":"Stigmata and the Shroud of Turin"},{"id":"comment-102856","author":"david_goulet","post":"I bet you’re one of those cryptoarchaeologists who always looks down on archaecryptologists!.","date":"2014-04-23","mins":"2:15 pm","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","title":"Stigmata and the Shroud of Turin"},{"id":"comment-103575","author":"david_goulet","post":"Mike M…trying to argue with a archeocryptologist is like wrestling with the wind. And about as purposeful. :).","date":"2014-04-25","mins":"9:15 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","title":"Stigmata and the Shroud of Turin"},{"id":"comment-102908","author":"david_goulet","post":"I get the sense that once Dan has had a chance to sit down and check on his blog a lot of these posts are going to get scorched..","date":"2014-04-23","mins":"4:12 pm","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","title":"Stigmata and the Shroud of Turin"},{"id":"comment-102392","author":"david_goulet","post":"Would this then be an “exercise” that could be videotaped?.","date":"2014-04-22","mins":"11:55 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","title":"Stigmata and the Shroud of Turin"},{"id":"comment-56340","author":"david_goulet","post":"It’s not a ‘3’! The body would have been viewed not straight on and from above, but from the side. So clearly it is either a lower case cursive ‘m’ or a ‘w’ – depending on which side you are viewing from. The ‘m’ of course stands for ‘Messiah’, the ‘w’ for ‘Wisdom’. This is a fun game!.","date":"2013-12-04","mins":"1:58 pm","url":"https://shroudstory.com/2013/12/04/the-big-3-issue-or-jesus-simply-misspoke/","cat":"blood_studies","title":"The Big 3 Issue or  “Jesus simply misspoke”"},{"id":"comment-212384","author":"david_goulet","post":"Unless it rained at some point. :).","date":"2015-10-12","mins":"2:20 pm","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","title":"Was Jesus’ Body Washed?"},{"id":"comment-212386","author":"david_goulet","post":"Or it rained at some point..","date":"2015-10-12","mins":"2:23 pm","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","title":"Was Jesus’ Body Washed?"},{"id":"comment-212387","author":"david_goulet","post":"I keep mentioning the possibility of rain ‘washing’ the body prior to it’s being wrapped. The Gospel does mention a storm (may just be a literary device or it could have been a sand storm). Thought experiment (pro authenticity model): what if it rained while Jesus was carrying the cross to Golgotha? If the rain was heavy enough it may have washed much of the topical blood from his body. If the rain occurs while he is on the cross, this too may wash away topical blood. How does blood flow on wet skin vs dry? Is this why we have dirt on the toes (where even rain water would have trouble washing away the caked in dirt) but less so on the nose and knees where rainwater could have more effect? If Jesus was removed from the cross wet, some of the topical blood may have wiped itself onto the transport linen (not the Shroud). When the body is then placed on the dry burial linen moist wounds may have continued to ooze blood. It’s interesting that a few movies about the Passion have a rainstorm occurring — again this is artistic license but who is to say it is not based on actual events? How would rain affect the blood images we see?.","date":"2015-10-12","mins":"2:36 pm","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","title":"Was Jesus’ Body Washed?"},{"id":"comment-187224","author":"david_goulet","post":"What was your rationale for the monks using leeches theory? I thought you went down that route (an ingenious one) because the blood evidence did not support either paint or normal human blood. Have you had a rethink about the evidence on those counts?.","date":"2015-01-29","mins":"9:31 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-187246","author":"david_goulet","post":"Sorry I should have been more clear. I believe Colin utilized the leech theory because the blood evidence seemed to disprove fresh, typical human blood – and certainly non primate blood. Certain anti coagulants and serums (I forget the medical terminology) had to be accounted for – hence the leech theory. I was not precluding that the blood was first century and human — having very unique characteristics that may be explained by your burial practice theory. I was hoping Colin would provide an update on where he sees the leech theory in the overall picture now..","date":"2015-01-29","mins":"11:29 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-187290","author":"david_goulet","post":"It is not in credible to imagine someone using human blood (let’s at least throw out the notion it is monkey or ape blood) to touch up an icon of this significance. Not at all..","date":"2015-01-29","mins":"3:43 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-187293","author":"david_goulet","post":"Aka the Holy Hand Grenade of Antioch!.","date":"2015-01-29","mins":"3:53 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-138133","author":"david_goulet","post":"Do you think the force that caused the impact came from outside of the cloth or the inside?.","date":"2014-07-14","mins":"10:57 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-138114","author":"david_goulet","post":"Try Vegemite next time. Never waste Nutella — even for science..","date":"2014-07-14","mins":"10:07 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-138197","author":"david_goulet","post":"Anoxie, you sound like someone who knows more than the casual Shroudie about the science being discussed. It would be helpful if you provided more background on what you feel the image is or isn’t. It’s rather unsporting to take pot shots at Colin (and others) without offering your own ideas up for target practice..","date":"2014-07-14","mins":"1:46 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-138486","author":"david_goulet","post":"Keep on, Colin. I suspect you’re on the right track. But I believe that track leads to an image theory that lies in the ‘let’s not go there’ territory you mentioned in a post above. Every insight you’ve shared recently points in that direction. Fascinating stuff to be sure..","date":"2014-07-15","mins":"9:49 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-138776","author":"david_goulet","post":"What do make of this paper by Power re: the side strip: http://www.shroudscience.info/index files/The%20 Side%20 Strip.pdf.","date":"2014-07-16","mins":"4:49 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-46537","author":"david_goulet","post":"I asked Colin, ‘what is truth’, to better understand what exactly he seeks from this blog. His answer was revealing. The majority of his reply was what I would expect from a retired scientist and there’s nothing wrong in that. But it was also infused with assumptions of my motivation for even asking the question. It reminded me of Groucho Marx’s take as Rufus T Firefly who works himself into a lather imagining the insult that his opponent is about to deliver (when it fact the man was about to shake his hand). We went off track from there. My apologies for the unhelpful diversion..","date":"2013-10-08","mins":"5:01 pm","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","title":"You guys are brutal"},{"id":"comment-46642","author":"david_goulet","post":"I actually liked Colin’s leech theory. It was an example of creative problem solving backed by attempted science on his part. It’s that type of creative science that leads to unexpected insights. Give me more of that and less of the haranguing and it’s all good..","date":"2013-10-09","mins":"9:48 am","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","title":"You guys are brutal"},{"id":"comment-46512","author":"david_goulet","post":"Colin, what is ‘truth’?.","date":"2013-10-08","mins":"2:52 pm","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","title":"You guys are brutal"},{"id":"comment-46532","author":"david_goulet","post":"You, sir, are a drama queen. Dan, you can delete this if it is an ad hom. However to me it’s simply an observation..","date":"2013-10-08","mins":"4:03 pm","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","title":"You guys are brutal"},{"id":"comment-46534","author":"david_goulet","post":"You see that was an experiment I just did. Real science! Thanks for confirming my hypothesis..","date":"2013-10-08","mins":"4:41 pm","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","title":"You guys are brutal"},{"id":"comment-98094","author":"david_goulet","post":"“Dribbled on later”….can you clarify the theory? Dribbled onto the cloth? Dribbled on to the body?.","date":"2014-04-10","mins":"9:31 am","url":"https://shroudstory.com/2014/04/07/garlaschelli-and-borrini-study-flawed/","cat":"blood_studies","title":"Garlaschelli and Borrini Study Flawed"},{"id":"comment-98670","author":"david_goulet","post":"Hugh Farey : If blood came out of a wrist wound while the arm was on the ground it still wouldn’t flow along the arm. The point about the plug is that on any first aid course, one is told never to try to extract an obect (such as broken glass or a bit of metal) from the wound, as while it is in place it prevents bloodloss by literally plugging the hole. Cutting yourself on a knife or protusion, or scraping your knee or bashing your head in a car crash all produce masses of blood, but driving a stake through yourself and leaving it there, perhaps counterintuitively, does not. Perhaps the blood on the arms isn’t coming from the nail wounds. Perhaps the victim’s hands were cut from falling. Could blood be splattering onto the arms from the head (crowned with thorns) as the head lolls back and forth in pain? However, I don’t imagine the nail wounds would remain plugged for long, not with the spasms of the victim and gravity putting tearing force on the wound. Stick a nail in your thigh and it may not bleed much if you remain fairly calm and still. But yank back and forth on the nail while jumping up and down….","date":"2014-04-12","mins":"9:01 am","url":"https://shroudstory.com/2014/04/07/garlaschelli-and-borrini-study-flawed/","cat":"blood_studies","title":"Garlaschelli and Borrini Study Flawed"}]
