[{"id":"comment-173683","author":"david_goulet","post":"“I really do not see any good arguments against a second radiocarbon dating.” Riddle me this Batman: what other object from antiquity has possibly travelled the unique journey that this relic has? Where is the C 14 baseline for such an anomalous item? This is a relic without precedent or antecedent. We still haven’t discerned the means of image formation. So how do we know C 14 dating, regardless of what date it produces, is the definitive method for dating such an anomalous object? Of course if one assumes the cloth is medieval it’s trajectory through the last few hundred years can be accounted for better. C 14 seems an obvious method to use. But if one assumes it is 1st century, the question marks one encounters are exponentially multiplied..","date":"2014-11-29","mins":"8:22 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"id":"comment-173597","author":"david_goulet","post":"I hate the optics on this debate. The non authentic camp’s strongest piece of evidence is the C 14 dating. Even though all the criticisms of the C 14 result are valid, it so often comes from authentists that it appears to be a desperate attempt to pull the rug out from the non authentic argument. Until a Colin Berry or Hugh Farey starts dismissing/doubing that C 14 result that perception will remain..","date":"2014-11-29","mins":"8:59 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"id":"comment-173857","author":"david_goulet","post":"For the record I don’t fear the C 14 tests. I just think that many here are putting way too much stock in the method when this relic may have been subject to elements that skew the C 14 readings. But I am not a scientist, so I’ll defer to your collective wisdom on the merits of C 14 dating (which would appear to be as rock solid as the law of gravity)..","date":"2014-11-30","mins":"1:31 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"id":"comment-173649","author":"david_goulet","post":"Something can be valid and not be correct..","date":"2014-11-29","mins":"4:45 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"id":"comment-192813","author":"david_goulet","post":"Hugh, is there any evidence of a repair, reweave in the sample area? Do we have any valid reason to claim the sample area was anomalous?.","date":"2015-03-08","mins":"2:15 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-192828","author":"david_goulet","post":"A fair short answer. I know you prefer to give contextual details so I thank you for the brevity..","date":"2015-03-08","mins":"4:27 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-193140","author":"david_goulet","post":"They didn’t realize the mastodon hair had been patched with more modern yak hair?.","date":"2015-03-11","mins":"3:15 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-47895","author":"david_goulet","post":"I’m all for re testing (with improved protocols and different labs). But as I stated, C 14 – in my layman’s ignorance – is but one indicator of the age. It is not infallible. And would you, if the new testing pointed to an older date feel that was definitive? I’m not anti science, just keenly aware that science is but a tool wielded by us imperfect apes..","date":"2013-10-18","mins":"11:38 am","url":"https://shroudstory.com/2013/10/18/again-joe-marino-sue-benford-and-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Again:  Joe Marino, Sue Benford and the Carbon Dating of the Shroud of Turin"},{"id":"comment-47885","author":"david_goulet","post":"So what did Rogers see that you didn’t?.","date":"2013-10-18","mins":"9:14 am","url":"https://shroudstory.com/2013/10/18/again-joe-marino-sue-benford-and-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Again:  Joe Marino, Sue Benford and the Carbon Dating of the Shroud of Turin"},{"id":"comment-47897","author":"david_goulet","post":"I keep reading from Colin how the C 14 scientists have been dragged through the mud and borderline slanderous accusations thrown at them. I’ll go one further, their professional reputations have indeed been called into question. They are the victims of slander/libel, perhaps John Klotz could confirm this, and could rightly take legal action against those making such claims. I’ve seen cases go to court over much less. Given the stakes, their professional reputations, why haven’t these individuals taken legal action?.","date":"2013-10-18","mins":"11:50 am","url":"https://shroudstory.com/2013/10/18/again-joe-marino-sue-benford-and-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Again:  Joe Marino, Sue Benford and the Carbon Dating of the Shroud of Turin"},{"id":"comment-47886","author":"david_goulet","post":"Your defense of the labs is so absolute that it weakens your case. You see no issues at all with the C 14 testing, no issues with the protocols? No possibility of bias? That’s rather unscientific reasoning in my opinion. I’m not an academic or scientist but I have ‘lived among them’. And I’ve learned two things about them: firstly they are indeed human beings who put their socks on one foot at a time like the rest of us. Secondly the academics reputation, his stature among his peers, his mojo, is directly tied to being able to defend his theories. To be proven to be in the wrong is no trifling matter. It can scuttle one’s professional esteem. This sword is two edged of course and we see this pressure on both sides of the Shroud debate. I can see in many sindonologists the need to be right, to fanatically defend a theory even when others raise reasonable doubts. I have no reason to think it would be any different for the C 14 scientists. Do scientists take some secret oath when they get their degrees that states they will only serve the truth and forsake any personal ego in their careers? I know doctors take oaths and they still botch it up. And even if further C 14 testing was permitted, are we so certain that even with more rigorous protocols that the results would be any more accurate? This cloth is unlike any other we’ve seen. Did the image formation process itself (whether it occurred by some bio process 2000 years ago, or by a yet unknown medieval process) affect the cloth and its carbon reading? Are there other infusion elements (aside from threading) that may skew the results? Even if new C 14 data pointed to a 40 AD year date I wouldn’t be using that as my smoking gun. C 14 is only one cog in the wheel..","date":"2013-10-18","mins":"9:34 am","url":"https://shroudstory.com/2013/10/18/again-joe-marino-sue-benford-and-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Again:  Joe Marino, Sue Benford and the Carbon Dating of the Shroud of Turin"},{"id":"comment-33263","author":"david_goulet","post":"Is the interwoven threads/patch hypothesis accepted by the majority of Shroud experts? If it is then I again have to question why anyone would accept the carbon dating as evidence at all – whether it was done rigorously or not is immaterial if the sample was ‘compromised’. At best the dating proved a useful trial run and exposed pitfalls to account for in future tests..","date":"2013-05-08","mins":"4:02 pm","url":"https://shroudstory.com/2013/05/07/an-email-from-professor-christopher-ramsey/","cat":"carbon_14_dating","title":"An email from Professor Christopher Ramsey"},{"id":"comment-33193","author":"david_goulet","post":"Can someone, less a novice on this issue then me, explain the ramifications of this latest revelation on the carbon dating. If we already have reasonable doubt about the dating due to improper sampling, what difference does it make if the resulting samples are 7 mg or 20 – if in fact 2mg might be sufficient for dating? In football terms it almost feels like piling on at this point. The ’88 dating is essentially useless, does it make much difference to know to what degree it was useless?.","date":"2013-05-07","mins":"4:20 pm","url":"https://shroudstory.com/2013/05/07/an-email-from-professor-christopher-ramsey/","cat":"carbon_14_dating","title":"An email from Professor Christopher Ramsey"},{"id":"comment-35011","author":"david_goulet","post":"I think YC was being cheeky about ‘the French connection’ – I didn’t read his comment as implying you had an anti French bias, rather that he may be a bit too pro French. It’s not a lack of goodwill, more like a lack of posting too hastily on his part. That’s how it read to me anyway..","date":"2013-05-27","mins":"9:31 am","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35042","author":"david_goulet","post":"Yannick you sometimes presume to know the motivation of others. That’s not good science. As Kelly has rightly pointed out, it’s best to keep to the facts. I also think it a good habit to reread others’ posts at least twice before commenting on them (I try to do this but don’t always succeed). At times it feels like you post too quickly, in the excitement of the debate. I would hate for people to start ignoring your posts because you always ask excellent questions and share solid theories..","date":"2013-05-27","mins":"4:17 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35067","author":"david_goulet","post":"There is an expression that the wise man can learn more from the fool, than the fool from the wise man. I’m not directing that at anyone in particular, just thought it was a truism to keep in mind when exploring the the good, the bad and the ugly of Shroud scholarship..","date":"2013-05-27","mins":"8:57 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-48109","author":"david_goulet","post":"Max, this is a very intriguing article and obviously you have put much time and work into it. Hugh’s comments are also fair observations and he made them objectively and respectfully. However your rebuttals to him – which should stand on their own – are filled with patronizing asides that really detract from your presentation..","date":"2013-10-20","mins":"9:26 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon"},{"id":"comment-48153","author":"david_goulet","post":"No art historian am I, but I don’t see how any artists, medieval or otherwise, could have used the Shroud as a subject model to any great detail. For starters the image is so faint, able to be seen only at a distance in any detail, that I can’t imagine an artist getting much forensic detail from it. Some basic insights into body form, some facial features, a few blood lines – that’s about it. To suggest that artists prior to our modern time were able to discern dumbbell scourge marks seems a stretch. They would have been dealing with ‘the big picture’ and not the details we enjoy today with our technology. I also suspect the Shroud spent much time being seen by very few people at all — hidden away, or seen only by the residents of select towns where it was displayed by its owner at the time. I sit on the authentic side of the debate but I’m left asking, when presented with all crypto images, why is there not one example of an artist portraying the Shroud clearly. Even the Pray Manuscript, which is by far the most intriguing, is not definitive. Now there may have been such pieces of art but they have been lost, or remain to be found. If the Shroud was widely displayed there should be more examples of artists representing it. Which circles back to my assumption that the Shroud was mostly hidden away for much of its existence..","date":"2013-10-20","mins":"4:14 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon"},{"id":"comment-48276","author":"david_goulet","post":"Colinsberry : The fact that the palm wound was seen as standard can be taken as evidence that no artist had seen the Shroud prior to its display at Lirey, sufficient to influence their art. I believe Matthias (sorry I can’t recall exactly who) pointed out once that the wounds in wrist on the Shroud are not conclusively on the wrist. In fact, depending on one’s view, it could be the palms. I concur. To the casual viewer, pre modern tech, the nail wounds would have been assumed to be in the palms and I don’t see an artist being that meticulous, or trained, to discern it may have been the wrists..","date":"2013-10-21","mins":"1:28 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon"},{"id":"comment-48293","author":"david_goulet","post":"I agree, mostly. I believe there was some general influence of the Shroud on art (the facial points of congruence for example), as only the face of the TS man was likely seen by most people (the Mandylion theory). Again, I personally don’t believe the Shroud was seen, or as widely displayed, as others assume. Why it wasn’t? History knows, I don’t. Colin is right in that it’s not fair to flip flop on the impact of the Shroud on artists. There is a lack of clear evidence of Shroud influence on ancient artists — apart from the facial points mentioned above..","date":"2013-10-21","mins":"2:33 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon"},{"id":"comment-48914","author":"david_goulet","post":"Hugh, Mr Brown passed way not too long ago. This was rather central to Dan and Barrie’s postings..","date":"2013-10-27","mins":"3:27 pm","url":"https://shroudstory.com/2013/10/26/another-in-case-you-missed-it-on-steras-facebook-page/","cat":"carbon_14_dating","title":"Another In Case You Missed it on STERA’s Facebook Page"},{"id":"comment-84574","author":"david_goulet","post":"The theory is reasonable. But he needs to demonstrate it actually works. He hasn’t done that through any true peer review. He might be onto something that has value well beyond just the Shroud, so all the more reason to pin that down with all the mundane and boring experimentation required. What makes him double frustrating, for me, is that he actually seems to have the resources to do the bull work. So what’s ‘spectacular nonsense’ is not the idea but rather what he presents as proof. And he can use all the hand gestures he wants, it won’t change that. :).","date":"2014-03-03","mins":"5:14 pm","url":"https://shroudstory.com/2014/03/03/as-long-as-these-results-are-not-refuted-they-have-scientific-validity/","cat":"carbon_14_dating","title":"As long as these results are not refuted . . . [they] have scientific validity?"},{"id":"comment-84508","author":"david_goulet","post":"Spot on! And if you sound a bit like Colin here, it’s the subject matter that demands it. Fanti’s over reaching is dangerous to credible Shroud science. He needs to focus one dating method, refine it, and establish it as a legitimate method that others can duplicate before he applies it to the Shroud. He’s working ass backward way too often to be considered credible..","date":"2014-03-03","mins":"12:59 pm","url":"https://shroudstory.com/2014/03/03/as-long-as-these-results-are-not-refuted-they-have-scientific-validity/","cat":"carbon_14_dating","title":"As long as these results are not refuted . . . [they] have scientific validity?"},{"id":"comment-78941","author":"david_goulet","post":"That is a very good question..","date":"2014-02-13","mins":"5:03 am","url":"https://shroudstory.com/2014/02/12/breaking-news-another-day-another-solution-to-the-image-and-the-carbon-dating/","cat":"carbon_14_dating","title":"Breaking News:  Another Day, Another Solution to the Image and the Carbon Dating"},{"id":"comment-185179","author":"david_goulet","post":"Sorry, carbon dating for dummies here, but is Hugh suggesting in this article that the C 14 points to a 1290 AD average date? This puts it much earlier than the current medieval proponents’ theories, but what is the significance of that? If one believes it is a man made artifact, the technology exists at any time in history to have made it – 1290 included, no?.","date":"2015-01-21","mins":"3:09 pm","url":"https://shroudstory.com/2015/01/21/bsts-article-by-hugh-farey/","cat":"carbon_14_dating","title":"BSTS Article by Hugh Farey"},{"id":"comment-74333","author":"david_goulet","post":"Pope Francis, if you are reading this blog, please allow new testing of the Shroud. I’ll put a little something extra in the collection basket — anything to get us over this soul sucking impasse..","date":"2014-01-23","mins":"11:54 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74377","author":"david_goulet","post":"Colin’s following the theory that the Shroud made on a heated bas relief of some kind and the resultant image was intended to represent a slow roasted Templar. He is not claiming that the actual roasted body was used. That would be tinfoil hat territory..","date":"2014-01-24","mins":"9:15 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74003","author":"david_goulet","post":"Why not use all cotton then if cost is such a factor? Wh o would care?.","date":"2014-01-21","mins":"5:27 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74760","author":"david_goulet","post":"Rogers was not a giant. He was a very good man and a very capable scientist. He advanced our knowledge of the Shroud, but he had some blind spots too (we all do). I don’t think putting anyone on a pedestal is helpful. Comparing one scientist to another and judging them based on how much they agree with our own beliefs is unwise..","date":"2014-01-26","mins":"9:26 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74011","author":"david_goulet","post":"But a medieval French artisan wouldn’t be concerned with that because the plebes wouldn’t know the difference anyway. Though your explanation would make sense for Joseph of Arimethea. Or are you suggesitng that the artisan was thinking like Joseph?.","date":"2014-01-21","mins":"5:43 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74757","author":"david_goulet","post":"A TV host and a botanist — wow really heavyweights there. Heavier than me I guess. But what happened to stepping into the unknown for the greater glory of science? Noble when you do it, but absurd when others do it..","date":"2014-01-26","mins":"9:02 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74038","author":"david_goulet","post":"Hugh is not insulting anyone. He’s bending over backwards not to offend scientists (especially those not here to defend themselves). He’s pointing out gaps he sees between observations and conclusions. Can we get back to evidence based discussion and stop with the judgements..","date":"2014-01-21","mins":"10:12 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-73967","author":"david_goulet","post":"I’m transplanting my question from another thread in case you missed it. “Hugh, you seem quite convinced the C 14 testing, and subsequent results, are impeccable. Do you see any problems at all for the C 14 data? Any potential Achilles heel at all?’ Is it possible to clean a C 14 sample too well?.","date":"2014-01-21","mins":"2:12 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74039","author":"david_goulet","post":"That’s why I was curious about the control samples. Were they linen, cotton or a mix of both?.","date":"2014-01-21","mins":"10:14 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74040","author":"david_goulet","post":"Colinsberry : Sorry, but your medieval pilgrims were not plebs. They were your first generation Thomas Cook tourists, who did their research before setting of. They expected to see linen, as per NT, but would probably not have been able to distinguish between pure linen and a cheaper linen cotton blend. Most of those pilgrims never even had access to a Bible, let alone had any clue what Jesus’ burial cloth would have been made of. They would have believed the Bishop if he said ‘This is the Shroud of Christ on the very shower curtain provided by Joseph of Arimethea.’.","date":"2014-01-21","mins":"10:17 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74275","author":"david_goulet","post":"You appear to be the exception to that 150 radius theory..","date":"2014-01-23","mins":"2:43 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-51372","author":"david_goulet","post":"Where’s the original listing? If you’re game to write the Pope I don’t mind writing the ACS. Good to get a 3rd opinion..","date":"2013-11-14","mins":"7:51 pm","url":"https://shroudstory.com/2013/11/14/colin-berry-is-writing-to-the-vatican/","cat":"carbon_14_dating","title":"Colin Berry is Writing to the Vatican"},{"id":"comment-51273","author":"david_goulet","post":"It won’t if no one asks. As I’ve said before, our current pontiff is very open to this type of discussion. It’s definitely worth a shot..","date":"2013-11-14","mins":"10:37 am","url":"https://shroudstory.com/2013/11/14/colin-berry-is-writing-to-the-vatican/","cat":"carbon_14_dating","title":"Colin Berry is Writing to the Vatican"},{"id":"comment-51376","author":"david_goulet","post":"Done. Here’s hoping their interest is piqued..","date":"2013-11-14","mins":"8:24 pm","url":"https://shroudstory.com/2013/11/14/colin-berry-is-writing-to-the-vatican/","cat":"carbon_14_dating","title":"Colin Berry is Writing to the Vatican"},{"id":"comment-51274","author":"david_goulet","post":"I’m with you Dan. If we’re going to have a new STURP let’s go after all the data we can. C 14 can be part of the mix to be sure but there’s a raft of other investiagtions, non invasive, that would be must have’s, imo. Now any chance we could, at the same time, petition the 1988 C 14 labs for a new study of their surviving samples?.","date":"2013-11-14","mins":"10:41 am","url":"https://shroudstory.com/2013/11/14/colin-berry-is-writing-to-the-vatican/","cat":"carbon_14_dating","title":"Colin Berry is Writing to the Vatican"},{"id":"comment-37592","author":"david_goulet","post":"Interesting theory. But how then was this victim executed? If the bloodstains are possibly later additions, and as you point out there appear to be no major wounds, what was the cause of death? A roasted victim would show some signs of ‘being cooked’. And if there were multiple victims, why not multiple shrouds?.","date":"2013-06-21","mins":"9:28 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","title":"Colin Berry:  a hunch – just that – that Rogers may have been used"},{"id":"comment-37593","author":"david_goulet","post":"Are you basing your conclusions on studies done of scourging techniques? Just curious as to how you’ve come to feel the marks are too this or too that. I could imagine an experienced Roman scourger might just see his task as a morbid art from, painting stripes on a human canvass — the same reflex to pattern that a medieval painter would have..","date":"2013-06-21","mins":"9:40 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","title":"Colin Berry:  a hunch – just that – that Rogers may have been used"},{"id":"comment-37490","author":"david_goulet","post":"Throw out Rogers’ work and everyone else’s work that has pointed to a tainted sample. All of it. And let’s say the 1988 C 14 dating is above reproach. There is no mystery other than figuring out how the forger accomplished his task. Colin, what’s your best guess there?.","date":"2013-06-20","mins":"3:29 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","title":"Colin Berry:  a hunch – just that – that Rogers may have been used"},{"id":"comment-37594","author":"david_goulet","post":"But if a pathologist’s (and that’s not to say there wouldn’t be a quack or two among them) analysis cannot be said to carry any weight because we’re dealing with an image of unknown origin, what weight can we assign to your observations about scourge marks and wounds which are based on that same image?.","date":"2013-06-21","mins":"9:49 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","title":"Colin Berry:  a hunch – just that – that Rogers may have been used"},{"id":"comment-37597","author":"david_goulet","post":"Every case for sainthood needs a devil’s advocate. Colin fulfills this role very well. He says things about Shroudologists that most of us would not think. I actually see his posts as excellent challenges to debunk the debunker. The more damning his claims the more I look forward to the responses from others here. If the Shroud can stand up to Colin’s fierce debunking attempts then the case for authenticity only grows (and grow it has in my opinion). That being said, the back and forth name calling and one up manship really detracts from the discussion (entertaining as it may be occasionally)..","date":"2013-06-21","mins":"9:59 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","title":"Colin Berry:  a hunch – just that – that Rogers may have been used"},{"id":"comment-37609","author":"david_goulet","post":"This line of reasoning, which is similar to Colin’s, leaves us with a 14 century cloth with the imprint of a corpse. Was it created accidentally or deliberately? It would appear it would have to have been accidental otherwise why are there no others? Again, if the victim was not crucified (the signs for that having been later embellishments) how did he die? How come no one recognized his features as that of a lost (executed) Templar or otherwise. Who was the opportunist who thought to take this enigma and turn it into a faux relic of Christ? If authenticity is cloaked in mystery, so too alternate explanations. On a side note (not related to your comment) , I find Occam’s Razor and Sherlock Holmes “when all other possibilities…” quote are useless in Shroud studies. They tend to cancel each other out as there are simply too many unknown variables..","date":"2013-06-21","mins":"12:19 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","title":"Colin Berry:  a hunch – just that – that Rogers may have been used"},{"id":"comment-37493","author":"david_goulet","post":"So your theory, if I’m reading you correctly, is that the Shroud is not a forgery, but a natural image that was formed around the 14th century?.","date":"2013-06-20","mins":"4:17 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","title":"Colin Berry:  a hunch – just that – that Rogers may have been used"},{"id":"comment-37630","author":"david_goulet","post":"I thought the problem with the Jacques de Molay theory was that he was burned beyond recognition and he was over 60 yrs old at the time of his death, while the Shroud man is 30 something. This whole theory is a bit disjointed because on one hand it purports that de Molay was scourged and crucified on a door, even cut in the side, in a deliberate mocking of Jesus’ death. While this would support the theory nicely, Colin actually calls into question that there are any wound marks at all. That would undercut the theory, unless it is assumed that de Molay was only burned at the stake..but then we’re back at the problem I mentioned above. If there’s a genius involved here it is that of the creative person who can come up with a theory like this..","date":"2013-06-21","mins":"2:17 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","title":"Colin Berry:  a hunch – just that – that Rogers may have been used"},{"id":"comment-37655","author":"david_goulet","post":"They were macabre, that’s for sure. But why a bas relief? And by what method? Every other image process known to that time can be replicated by reverse engineering, but this one can’t (not to the same precision as the Shroud). Surely who ever cottoned on to this scorching technique would have created others, or shared the technique. Any why create a figure with such an odd pose? Is he dead or alive in the image? And if you’re going for realism, which they were if they’re showing him naked and trussed, why portray him as a young man? You see, if you tell me someone was trying to fake a relic of Christ I can see why they’d go with a naked man in his 30’s. You want the shroud to look like the resurrection cloth. But Jacques never had a resurrection (recorded anyway). Or are you saying the forger’s intent was to double down and make a relic that could honour them both? His inspiration was Jacques, but it could double as Jesus. But that still seems odd because a relic of Christ trumps a relic of a Templar (just check Craigslist)..","date":"2013-06-21","mins":"4:01 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","title":"Colin Berry:  a hunch – just that – that Rogers may have been used"},{"id":"comment-37802","author":"david_goulet","post":"Your first paragraph is very close to Colin’s theory of the blood being a later embellishment (but on a manufactured shroud)..","date":"2013-06-22","mins":"7:07 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","title":"Colin Berry:  a hunch – just that – that Rogers may have been used"},{"id":"comment-37803","author":"david_goulet","post":"Just realized that Colin misunderstood your theory. Or I have. I take it you are suggesting the blood being added later belonged to someone other than Christ?.","date":"2013-06-22","mins":"7:09 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","title":"Colin Berry:  a hunch – just that – that Rogers may have been used"},{"id":"comment-37801","author":"david_goulet","post":"Colin your theory is that the Shroud is a fabricated bas relief to which has been ADDED blood (via leeches). Matthias is theorizing here that the Shroud could be authentic but that the blood was added later as an artistic touch up. Nearly identical theories. Are you saying both theories then make no sense?.","date":"2013-06-22","mins":"6:53 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","title":"Colin Berry:  a hunch – just that – that Rogers may have been used"},{"id":"comment-33437","author":"david_goulet","post":"We should wait for the best non intrusive technology to become available to do the testing. We humans instinctively desire an answer to riddle sooner than later – and this is especially true of a relic like the Shroud. But just because we live now doesn’t mean we must be the ones to solve the riddle. The Shroud has perplexed people for centuries, it can do so for a few more decades if need be..","date":"2013-05-10","mins":"4:20 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating."},{"id":"comment-74241","author":"david_goulet","post":"They are now too validly contested to be meaningful. If we say the same for the C 14 dating then we must be consistent and say the same of the quads..","date":"2014-01-23","mins":"10:33 am","url":"https://shroudstory.com/2014/01/22/comment-promoted-are-the-quad-mosaics-meaningless/","cat":"carbon_14_dating","title":"Comment Promoted: Are the Quad Mosaics Meaningless?"},{"id":"comment-75791","author":"david_goulet","post":"In science, I’m assuming, the ideal is to always work with a level playing field. This was more of a ski hill..","date":"2014-02-01","mins":"5:17 pm","url":"https://shroudstory.com/2014/02/01/comment-promoted-not-so-fair-or-unethical-goings-on-at-radiocarbon/","cat":"carbon_14_dating","title":"Comment Promoted: Not so Fair or Unethical Goings On at Radiocarbon?"},{"id":"comment-38039","author":"david_goulet","post":"And not only that, cotton gloves made from Egyptian cotton! If only you had been there Colin with your trusty latex gloves and raincoat, and this whole mystery would have been put to bed, for good, in 1988. Tsk tsk..","date":"2013-06-25","mins":"11:56 am","url":"https://shroudstory.com/2013/06/25/cotton/","cat":"carbon_14_dating","title":"Cotton"},{"id":"comment-104892","author":"david_goulet","post":"Is there the possibility that Rossman was appropriating the work of Wasserburg? Perhaps Rossman knew Wasserburg had done the work but Rossman for some reason was going to take the heat (or the glory) for the prohibited tests? Way to much speculation involved with this whole avenue of though for my liking. Doesn’t mean there wasn’t some skullduggery afoot, but like the lab hacking theory — a few crumbs of hard evidence would go a long way to making this all matter..","date":"2014-04-28","mins":"9:38 am","url":"https://shroudstory.com/2014/04/28/did-a-single-thread-get-tested-in-1982-is-it-important-to-know-and-why/","cat":"carbon_14_dating","title":"Did a single thread get tested in 1982. Is it important to know? And why?"},{"id":"comment-124765","author":"david_goulet","post":"You make a valid point, Hugh. However using your very observations we can also ask. So are dumbbells inconsistent with the techniques used by the Romans? Er, no. Is there evidence of medieval flagrum using dumbbell tips? If ‘yes’ this would support a forgery hypothesis. If ‘no’ this would undermine a forgery hypothesis as where would the idea to add dumbbell tips have come from? This all is based on the assumption that we are even interpreting the marks correctly as dumbbell tips. Could the effect have been caused by knots? Were they even caused by a flagrum at all? Perhaps the marks are actually the butt end marks of some form of prodding instrument..","date":"2014-05-26","mins":"9:22 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","title":"Dissent of the day:  I’ll say one thing for Jones"},{"id":"comment-124907","author":"david_goulet","post":"Why people can’t take two seconds to questions their assumptions, if only to reaffirm that those assumptions are indeed valid, is beyond my understanding. ..","date":"2014-05-26","mins":"9:10 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","title":"Dissent of the day:  I’ll say one thing for Jones"},{"id":"comment-194171","author":"david_goulet","post":"For the record, I don’t for a second believe Hugh is trying to mislead anyone. Hugh sees the data and argument differently and he argues from that position. It is a sincere position and not one without some foundation. Personally, I thank God for intelligent, reasonable, skeptics like Hugh – for without whom the Shroud discussion would be an echo chamber filled with unsubstantiated assumptions. The Devils’ Advocate, if you will, serves God too..","date":"2015-03-23","mins":"2:54 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"id":"comment-194286","author":"david_goulet","post":"It could come down to this. The section that was tested was correctly dated to the medieval period because it was indeed entirely medieval linen. Not spliced, not contaminated — pure medieval linen. BUT, here’s the problem – was it part of a much broader patch. Maybe the ‘invisible’ mending is along a boarder encompassing a much larger area than we are assuming. This is why until the entire relic is restudied with non destructive methods and the true boundaries of its homogeneity can be discerned – we are spinning our collective wheels..","date":"2015-03-24","mins":"1:26 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"id":"comment-194361","author":"david_goulet","post":"Very interesting article. Thanks, Louis..","date":"2015-03-25","mins":"9:09 am","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"id":"comment-122885","author":"david_goulet","post":"This is becoming tedious. Max, your facts are unsubstantiated therefore they are not facts but supposition. You have no more claim to certitude than Hugh and no amount of bluster will change that..","date":"2014-05-21","mins":"9:04 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","title":"Documented Pieces Removed from the Shroud"},{"id":"comment-122919","author":"david_goulet","post":"I happen to think the reweave theory has legs, but the evidence is not bullet proof as Hugh points out. What I find tedious is Max’s inability to see any point of view beyond his own and his preponderance for patronizing asides (not to mention his refusal to condense his comments into fewer posts). This whole discussion about bishops’ fingernails is bordering on the absurd..","date":"2014-05-21","mins":"10:29 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","title":"Documented Pieces Removed from the Shroud"},{"id":"comment-122602","author":"david_goulet","post":"Reminder to Max: it is Hugh who is attempting to remove the red herrings around here. Your understanding of the term perhaps needs reviewing..","date":"2014-05-21","mins":"9:22 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","title":"Documented Pieces Removed from the Shroud"},{"id":"comment-33801","author":"david_goulet","post":"For what’s it worth, Colin, I do not question your scientific credentials – they’re better than mine that’s for sure. What I question is your seeming ability to read minds, particularly those of other scientists (even those now deceased). Your theories on Rogers strain reason. You accuse authentists of building a house of cards debunking the C 14 tests, but you then do the same when it comes to Rogers’ research on the weave theory — in particular his motivations. Knowing the man was respected by just about everyone — those involved with the Shroud or not — you are trying to build a case against his integrity. The samples were obtained in shady fashion, his peer review was shady, his peers are shady…etc. I have found no evidence, anywhere, that points to Rogers ever being anything but a scientist, and a man, of integrity. But I suppose since he is not here to defend himself you can keep building your house of cards..","date":"2013-05-16","mins":"4:37 pm","url":"https://shroudstory.com/2013/05/16/dog-in-this-fight-or-pony-in-this-race/","cat":"carbon_14_dating","title":"Dog in this fight or pony in this race?"},{"id":"comment-33823","author":"david_goulet","post":"“Rogers was not a crook. He was simply out of his depth in trying to be a master of all trades (physical, chemical, biological, historical)..” Pot meet kettle. Riddle me this Batman, Rogers brought his ‘dogmatic’ and ‘keen to crush’ attitude to bear on the weave theory. He wanted to destroy the theory. He ends up accepting it. Why would a man who thought the theory was ridiculous do that – especially IF he had the ‘out’ of saying ‘well, this proves nothing because the samples aren’t legit”? Was his original belligerence to the theory merely an act? Was Rogers suckering us all in to this final scam that would impress his STURP peers…because as a dying man that’s the first thing I’d want to do..","date":"2013-05-16","mins":"7:41 pm","url":"https://shroudstory.com/2013/05/16/dog-in-this-fight-or-pony-in-this-race/","cat":"carbon_14_dating","title":"Dog in this fight or pony in this race?"},{"id":"comment-33858","author":"david_goulet","post":"“In the meantime, keep pressing for a repeat of the radiocarbon dating.” No thanks, Colin. As others have pointed out the C 14 process is not the ideal method for dating the shroud. The list of preconditions that would now have to be accounted for is longer than Santa’s on Christmas Eve. I’ll definitely press for better, more fool proof, technology which is on the cusp of being available. As for your impression of Rogers, you may be right. But often we dislike in others the weaknesses which are our own as well..","date":"2013-05-17","mins":"6:27 am","url":"https://shroudstory.com/2013/05/16/dog-in-this-fight-or-pony-in-this-race/","cat":"carbon_14_dating","title":"Dog in this fight or pony in this race?"},{"id":"comment-210132","author":"david_goulet","post":"Huzzaah!.","date":"2015-09-11","mins":"12:58 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-208942","author":"david_goulet","post":"As imperfect as this blog is, it remains the best Shroud site for on going discussion. Dan does try to be objective (but yes he’s human). If you and Hugh and others who lean non authenticity left to do your own site it would result in two echo chambers. The fact that this blog is contentious is a good thing. I just wish the personal jabs would take a holiday, especially against Hugh, as he is the most restrained commenter I’ve seen. If we could all stay ‘on point’ it would be more productive. One cannot expect Dan to be kindergarten cop..","date":"2015-08-25","mins":"8:45 am","url":"https://shroudstory.com/2015/08/22/food-for-thought-an-important-paper-on-radiocarbon-dating/","cat":"carbon_14_dating","title":"Food for Thought: An Important Paper on Radiocarbon Dating"},{"id":"comment-81164","author":"david_goulet","post":"Penn and Tellar are famous professional magicians and ardent skeptics who follow in the footsteps of James Randi. They have a documentary out called Tim’s Vermeer and here’s the synopsis: “Tim Jenison, a Texas based inventor, attempts to solve one of the greatest mysteries in all art: How did 17th century Dutch Master Johannes Vermeer (“Girl with a Pearl Earring”) manage to paint so photo realistically — 150 years before the invention of photography?” Tim is an out of the box thinker like you and he’s demonstrated convincingly with experiments how Vermeer ‘did it’. You’re attempting to do the same thing with the Shroud, hence my sequel suggestion..","date":"2014-02-21","mins":"10:38 am","url":"https://shroudstory.com/2014/02/19/from-fraud-to-computer-hacking-in-carbon-dating-the-shroud-of-turin/","cat":"carbon_14_dating","title":"From Fraud to Computer Hacking in Carbon Dating the Shroud of Turin"},{"id":"comment-80886","author":"david_goulet","post":"I agree 100%. Your hypotheticals demonstrate a need for consistency. I’m an authentist but I realize that what’s good for the goose is good for the gander. There are valid criticisms levied against the C 14 dating, none of which require the leap to fraud. Prove it, or retract the insinuation..","date":"2014-02-20","mins":"10:39 am","url":"https://shroudstory.com/2014/02/19/from-fraud-to-computer-hacking-in-carbon-dating-the-shroud-of-turin/","cat":"carbon_14_dating","title":"From Fraud to Computer Hacking in Carbon Dating the Shroud of Turin"},{"id":"comment-80905","author":"david_goulet","post":"Colinsberry : Thank you for the challenge to try a more 3 D template, David. It got me out of a rut (through making me deploy that “awkward” brass crucifix). Have since moved on considerably and think I’ve cracked it (SUAIRE on the Machy Mould being the “spy clue,”) Seek and ye shall find… Yup, methinks I’ve finally found what I was looking for – a rationale for a 14th century fabricated TS (after 2 years of hard unremitting slog with over 200 postings). Dan and his shroudstory.com has churlishly used me for a wholenumber of mocking posts, largely for entertainment value. Time now for me to use his site to flag up my breakthrough (two step evolution of the Shroud image first scorch (Templar era) then attempt (Lirey era) to re invent as a ‘super suaire’ – a whole body version of the Veil of Veronica. Looking forward to your work. You should check out Penn and Tellar’s new doc “Tim’s Vermeer” – which reminds me very much of your quest. I think “Colin’s Shroud’ would make for a nice sequel. Seriously..","date":"2014-02-20","mins":"12:34 pm","url":"https://shroudstory.com/2014/02/19/from-fraud-to-computer-hacking-in-carbon-dating-the-shroud-of-turin/","cat":"carbon_14_dating","title":"From Fraud to Computer Hacking in Carbon Dating the Shroud of Turin"},{"id":"comment-98426","author":"david_goulet","post":"Funny that Jesus chose mostly married men to be his apostles. The Orthodox Church seems to have survived quite nicely with married priests. As did the early Church. A “priest’s life is to be dedicated to God” — and the life of every believer isn’t called to be dedicated to God? We’re straying well off the Shroud as topic here. Probably not a wise idea.There are other forums for these kind of discussions..","date":"2014-04-11","mins":"3:31 pm","url":"https://shroudstory.com/2014/04/11/funny-that-when-it-comes-to-the-shroud-of-turin-the-carbon-testing-must-be-considered-watertight-scientific-proof/","cat":"carbon_14_dating","title":"Funny that when it comes to the Shroud of Turin the carbon testing must be considered watertight scientific proof."},{"id":"comment-95540","author":"david_goulet","post":"I do recall back in 1984 when my computer class ran a Valentine’s Day fundraiser in which students filled out a survey and we did some matchmaking. I had the task of filling out a few hundred computer cards (with the big black pencils). A friend of mine asked me to ‘adjust’ his card to match that of a certain gal he fancied. I did so and he ended up on top of her list of ‘best matches’. Obviously our security protocols were less robust than the C 14 labs, but where there is a will there is a way. What is needed here is a late confession, similar to the one I just gave..","date":"2014-04-01","mins":"12:52 pm","url":"https://shroudstory.com/2014/04/01/developing-a-hacking-theory/","cat":"hacking","title":"Developing a Hacking Theory"},{"id":"comment-216041","author":"david_goulet","post":"Joe is YC, agreed. Joe Marino is not Joe..","date":"2015-12-09","mins":"3:30 pm","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-216126","author":"david_goulet","post":"Judge? Well my confirmation name is Samson. :) I think the realm of Shroud studies is indeed so contentious, at a personal level, that indeed ‘the powers that be’ have no interest to stir the pot further with new testing. But if the world can’t see Christ in the actions of those of us who call ourselves His followers, I doubt they’d see Him in the Shroud even it was proved authentic..","date":"2015-12-10","mins":"9:40 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-76206","author":"david_goulet","post":"Dangerous waters from both a legal standpoint and a Christian one, in my opinion. The growing bitterness between many involved in this debate is disheartening. C’mon guys, we have a tantalizing mystery here — let’s enjoy it together!.","date":"2014-02-03","mins":"12:06 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-76762","author":"david_goulet","post":"Absence of evidence is not evidence of absence. This also applies to medieval scorch technology. It applies both ways. Just saying….","date":"2014-02-05","mins":"11:54 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-76492","author":"david_goulet","post":"I hear you..","date":"2014-02-04","mins":"10:55 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-76743","author":"david_goulet","post":"But why are your putdowns healthy to the discussion yet when putdowns come your way “it’s a pox upon them”? If you’re going to charge in here like Andy Capp on a Saturday night then expect a dustup. Why not come in on a Wednesday afternoon and share a quiet pint once in awhile?.","date":"2014-02-05","mins":"10:50 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-76839","author":"david_goulet","post":"So based on your findings it seems the Shroud, based on the weave, cannot be 1st century. Is this your conclusion?.","date":"2014-02-05","mins":"6:28 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-197303","author":"david_goulet","post":"All of the above..","date":"2015-04-23","mins":"9:33 am","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","title":"Look at what happened between 1988 and 2015"},{"id":"comment-194391","author":"david_goulet","post":"There is also the theory mentioned by Fanti that IF the image formation involved radiation in some form, that this may have effected the C 14. Is there scientific foundation for this idea? If an object has been irradiated, does this effect its C 14?.","date":"2015-03-25","mins":"1:58 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-192498","author":"david_goulet","post":"“He did indeed. And he removed them, in case they were contaminants.” Then what became of them? I would hope they were retained to further study if they were indeed contaminants or if they possibly part of the original linen. Please tell me they weren’t thrown in the dumpster..","date":"2015-03-05","mins":"9:14 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-192523","author":"david_goulet","post":"Pity..","date":"2015-03-05","mins":"12:09 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-48617","author":"david_goulet","post":"What is your source for that assertion?.","date":"2013-10-24","mins":"12:19 pm","url":"https://shroudstory.com/2013/10/24/meanwhile-part-2-works-for-me/","cat":"carbon_14_dating","title":"Meanwhile, Part 2:  “Works for Me”"},{"id":"comment-48619","author":"david_goulet","post":"A fair point, Charles, but those thousands of images sound like artworks and I assume those that held them accounted them as such (though they were still considered holy). The Shroud related images hint at an object that is something different. There’s almost an inability to explain/describe the image as it is so unique. That’s my take on the quotes, you obviously would see them differently..","date":"2013-10-24","mins":"12:24 pm","url":"https://shroudstory.com/2013/10/24/meanwhile-part-2-works-for-me/","cat":"carbon_14_dating","title":"Meanwhile, Part 2:  “Works for Me”"},{"id":"comment-48620","author":"david_goulet","post":"What is your source for that assertion? You can see my book “Dal mandylion di Edessa alla Sindone di Torino”, pp. 121 127. Would this be available online anywhere? I’m assuming then your assertion is based on original research..","date":"2013-10-24","mins":"12:28 pm","url":"https://shroudstory.com/2013/10/24/meanwhile-part-2-works-for-me/","cat":"carbon_14_dating","title":"Meanwhile, Part 2:  “Works for Me”"},{"id":"comment-48597","author":"david_goulet","post":"These quotes, combined, are more impressive to me than the possible visual metaphors like the Pray Manuscript, Stuttgart Psalter, etc. Where did these ancient writers ever come up the concept of mirror images and imprints of dead Christ if not after witnessing the Shroud? It just all seems to spot on to be explained away as a coincidence of creative writing..","date":"2013-10-24","mins":"7:24 am","url":"https://shroudstory.com/2013/10/24/meanwhile-part-2-works-for-me/","cat":"carbon_14_dating","title":"Meanwhile, Part 2:  “Works for Me”"},{"id":"comment-50201","author":"david_goulet","post":"Would the sabotage you are mentioning lead to ‘unfakable’ evidence? If there is a way to skew the evidence then doesn’t this demonstrate the evidence is indeed fakable? And now that skeptics like yourself are aware of the possibility of sabotage, this would undermine authenticity claims based on said testing. For myself, I share your fear. There is a segment of Christianity that pushes a Christian triumphalism and the Shroud could be be exploited by them. The thought that Christians would use the Shroud to proselytize turns my stomach. It has been called the Silent Witness…that is exactly how it should be seen. If God wanted it to preach he would have added audio to it. Hmmm, that makes me wonder… could there be audio properties encoded in it? Who needs flowers and coins when you could have music and soundbites. :).","date":"2013-11-06","mins":"1:40 pm","url":"https://shroudstory.com/2013/11/05/overheard-behind-us-during-barries-talk-thats-only-listerine/","cat":"carbon_14_dating","title":"Overheard behind us during Barrie’s Talk: “That’s only Listerine”"},{"id":"comment-44845","author":"david_goulet","post":"You hit the nail on the head..","date":"2013-09-20","mins":"10:24 am","url":"https://shroudstory.com/2013/09/20/paper-chase-giulio-fantis-new-flax-fiber-dating-machine/","cat":"carbon_14_dating","title":"Paper Chase:  Giulio Fanti’s New Flax Fiber Dating Machine"},{"id":"comment-33779","author":"david_goulet","post":"So up until the 2005 paper Rogers shows no dog in this fight. He stands by the science. He even expects to debunk the invisible weave theory. To everyone’s surprise, including his own, Rogers agrees with the theory based on his scientific findings. Who got to him, Colin? The Illuminati? God? The Mafia? Maybe it wasn’t cancer that killed him…hmmm..","date":"2013-05-16","mins":"11:38 am","url":"https://shroudstory.com/2013/05/16/paper-chase-nobody-goes-to-the-trouble-oh-yes-they-might/","cat":"carbon_14_dating","title":"Paper Chase:  Nobody Goes to the Trouble. Oh, Yes They Might."},{"id":"comment-33788","author":"david_goulet","post":"So if I buy into your narrative, Rogers was looking for a way to discredit the C 14 dating all along (perhaps to safeguard his potential legacy/work with Maillard reactions or perhaps bowing to peer pressure). Desperate to achieve this before he passed away, he compromised his scientific principles, as well as his personal integrity, by accepting evidence he knew was inadmissible and giving authentists the ‘published’ results they had already set up in advance. Is there a scientist(s) involved with Shroud research you do find above reproach?.","date":"2013-05-16","mins":"1:09 pm","url":"https://shroudstory.com/2013/05/16/paper-chase-nobody-goes-to-the-trouble-oh-yes-they-might/","cat":"carbon_14_dating","title":"Paper Chase:  Nobody Goes to the Trouble. Oh, Yes They Might."},{"id":"comment-33595","author":"david_goulet","post":"Deliberate or not, the fact that carbon dating has been compromised could be a good thing. It forces researchers to consider alternate, read more foolproof, methods (which may or may not be available yet). Fanti’s textile tests, while woeful on proper scientific documentation, are an example of new such methods. Better ones are on the way..","date":"2013-05-13","mins":"9:11 am","url":"https://shroudstory.com/2013/05/13/paper-chase-shroud-material-lost/","cat":"carbon_14_dating","title":"Paper Chase:  Shroud Material Lost"},{"id":"comment-81484","author":"david_goulet","post":"The C 14 date range actually poses a problem, imo, for the forgery theory. Why would a forger go to the trouble to make something look 1st century but use ‘fresh’ linen? Wouldn’t you try and obtain older linen? Colin, if you’re following this, I can see why you have suggested the image was first your Templar, then later revised to be Christ. This hypothesis would explain why the linen was fresh but then needed to be artificially aged to look ancient. And before John and Yanonymous pipe in about the absurdity of that hypothesis, I’m not promoting it here. I’m merely pointing out how it is at least consistent in dealing with the problem of a forger brilliant enough to make something look so 1st century, yet failing to make it on older linen..","date":"2014-02-22","mins":"5:40 pm","url":"https://shroudstory.com/2014/02/22/part-3-is-up-did-stephen-jones-make-the-case/","cat":"carbon_14_dating","title":"Part 3  is up:  Did Stephen Jones make the case?"},{"id":"comment-142217","author":"david_goulet","post":"Excellent summation of the C14 monkeyshines…I mean, “irregularities”..","date":"2014-08-04","mins":"9:24 am","url":"https://shroudstory.com/2014/08/04/photo-rich-wonderful-presentation-by-emanuela-marinelli/","cat":"carbon_14_dating","title":"Photo Rich, Wonderful Presentation by Emanuela Marinelli"},{"id":"comment-48214","author":"david_goulet","post":"Even if the Shroud is proven to be authentic then it merely is a proof that the historical Jesus did exist. It does not prove the Resurrection. It does not prove he was God. It does lead to some pretty big implications of course..","date":"2013-10-21","mins":"7:19 am","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","title":"Quote for Today: Stephen Jones on journalists and their readers"},{"id":"comment-48518","author":"david_goulet","post":"Define ‘evidence’..","date":"2013-10-23","mins":"12:03 pm","url":"https://shroudstory.com/2013/10/23/quote-for-today-on-carbon-dating/","cat":"carbon_14_dating","title":"Quote for Today on Carbon Dating"},{"id":"comment-48243","author":"david_goulet","post":"How about Shroggers — we can trademark it and sell t shirts. :).","date":"2013-10-21","mins":"10:17 am","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","title":"Quote for Today: Stephen Jones on journalists and their readers"},{"id":"comment-48262","author":"david_goulet","post":"Max, you’ll live longer (and happier) if you would just ignore Colin’s posts..","date":"2013-10-21","mins":"12:01 pm","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","title":"Quote for Today: Stephen Jones on journalists and their readers"},{"id":"comment-48288","author":"david_goulet","post":"Not trying to be third man in here (hockey reference, sorry) but I gotta side with Colin on this one. He’d been ignoring Max’s asides for some time but Max kept pushing it..","date":"2013-10-21","mins":"2:22 pm","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","title":"Quote for Today: Stephen Jones on journalists and their readers"},{"id":"comment-48237","author":"david_goulet","post":"If the image was formed by a natural process, yet to be discovered, then we may not be talking about a paranormal event per se. Look, if the Shroud is authentic I don’t foresee masses of atheists accepting that ‘Jesus is Lord’. They will move to the next stage of mental gymnastics which is, “Something unique happened to this Jesus’ body, that’s all.” It’s essentially what de Wesselow has done. You know the same kid of mental dodge us authentists have done with the C 14 results. ;).","date":"2013-10-21","mins":"10:06 am","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","title":"Quote for Today: Stephen Jones on journalists and their readers"},{"id":"comment-48240","author":"david_goulet","post":"Agreed, Colin. Jesus spoke of how the kingdom of God was here and now, not just some future reality. His ‘miracles’ were proofs of that. He was not an Essene – at this point anyway. Jesus, in the Gospels, is a man who has one foot in this world and one in the next. Both are a part of the Kingdom, both matter..","date":"2013-10-21","mins":"10:15 am","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","title":"Quote for Today: Stephen Jones on journalists and their readers"},{"id":"comment-74828","author":"david_goulet","post":"The Church has at its disposal many truly scientific minds. The Pope, as a Jesuit, would have likely know and have personal connections to many of them. A qualified appraisal team could be formed to do the heavy lifting on accepting/rejecting proposals. It’s a tender like any other, just based more on scientific process than costs. The great value to the Church would be to demonstrate that faith and reason are not mutually exclusive. What better way to engage in dialogue with a skeptical world than to work together on this project. The whole journey would make for a fascinating documentary….Mr Rolfe?.","date":"2014-01-27","mins":"10:39 am","url":"https://shroudstory.com/2014/01/27/shroud-pope-francis-call-for-new-test/","cat":"carbon_14_dating","title":"Should Pope Francis Call for New Test?"},{"id":"comment-89642","author":"david_goulet","post":"Yes it these types of odd, unprofessional behaviours that give life to the conspiracy theories. The labs have done themselves no favours in failing to be transparent about the surviving samples. Many of these theories could be debunked in a day if the labs responded with the vigour one would expect, given the accusations. The more they do not, the bigger the question mark grows over their heads. Perhaps they do not wish to ‘dignify’ the question with a response…but the question is being asked by some reasonable people just looking for the facts/truth. As such the lack of response is bringing indignity to the labs anyway. Perhaps those involved are too ‘retired’ to really care anymore. Who knows..","date":"2014-03-16","mins":"12:55 pm","url":"https://shroudstory.com/2014/03/16/so-was-the-small-arizona-piece-in-doug-donahues-custody-ever-made-available-to-barrie-schwortz/","cat":"carbon_14_dating","title":"So, was the small Arizona piece in Doug Donahue’s custody ever made available to Barrie Schwortz?"},{"id":"comment-144269","author":"david_goulet","post":"Hold on a second, Colin. I like your scorch experiment but when you claim, “It’s time to demolish the myth that a contact scorch can never be as superficial as the TS image. Anyone can disprove that for themselves at home, with little more than a piece of linen, a lump of metal, a hotplate, tweezers and a hand lens,” this is slightly misleading. Your scorches were done with a model far smaller than the one that would have been needed to produce the TS. It’s one thing to prove that one can create a superficial scorch that matches what we’ve seen on the TS, but it’s quite another to produce an image of the scale of the TS. Don’t fall into the trap of overstatement that you so passionately revile in others..","date":"2014-08-16","mins":"7:46 pm","url":"https://shroudstory.com/2014/08/13/stephen-jones-wants-bsts-to-remove-hugh-farey-as-editor-of-the-newsletter/","cat":"carbon_14_dating","title":"Stephen Jones Wants BSTS to Remove Hugh Farey as Editor of the Newsletter"},{"id":"comment-144426","author":"david_goulet","post":"I like your answer. As to your question at the end. I do see the scaling up as a problem because, though it is likely doable (given time and resources I’m confident you could achieve it), it wasn’t necessary. By that I mean the TS – if a scorch – is one of amazing precision. To replicate it today has proven quite a task. There was no need for a medieval artisan to be that precise. If he could affect a reasonable facsimile of a sweat imprint, as per your theory, then he had it made in the shade. I can’t imagine that artisan making upteen attempts, ensuring the scorch was at the surface level of the threads. No one had microscopes back then, who would have been able to tell if it was a man made scorch? I applaud your work because you are challenging some sacred cows: only the Shroud has 3 D properties, the Shroud could not be a scorch, etc. You are forcing Shroudies (the good ones) to think and rethink. Whether your Templar theory is correct or not, your work in trying to support it is having a positive impact on other chains of thought. That, to me, is superb science. I actually think that your demonstrating that the Shroud’s properties are not so unique makes the icon more unique. Say what? Well, if it does not have that many unique properties then one should expect to see other examples of this kind of object. We are presented with an ordinary piece of linen, marked with an ordinary image (it’s just a man) that could be explained by an ordinary mechanism (contact scorch, biochemical reaction) and found in an ordinary context (medieval relic). And yet we have only one such Shroud — extraordinary!.","date":"2014-08-17","mins":"7:48 pm","url":"https://shroudstory.com/2014/08/13/stephen-jones-wants-bsts-to-remove-hugh-farey-as-editor-of-the-newsletter/","cat":"carbon_14_dating","title":"Stephen Jones Wants BSTS to Remove Hugh Farey as Editor of the Newsletter"},{"id":"comment-144744","author":"david_goulet","post":"So what you’re saying here, making sure I have it right, is that a medieval artisan was not trying to make a uniform scorch of upper thread depth. If the TS has a uniform scorch it’s because whatever process created the image — uniformity was a by product of it to begin with. In other words, the uniform superficiality is an accident of the image process, not an intended characteristic..","date":"2014-08-19","mins":"9:00 am","url":"https://shroudstory.com/2014/08/13/stephen-jones-wants-bsts-to-remove-hugh-farey-as-editor-of-the-newsletter/","cat":"carbon_14_dating","title":"Stephen Jones Wants BSTS to Remove Hugh Farey as Editor of the Newsletter"},{"id":"comment-143700","author":"david_goulet","post":"Sometimes tension is a healthy thing; sometimes not. Shroud debate seems to be moving more and more to the ‘not’. For the sake of peace, the Church (aka the custodian) should allow a new round of direct (but non destructive) investigations of the icon. The Truth will set you free..","date":"2014-08-13","mins":"10:04 am","url":"https://shroudstory.com/2014/08/13/stephen-jones-wants-bsts-to-remove-hugh-farey-as-editor-of-the-newsletter/","cat":"carbon_14_dating","title":"Stephen Jones Wants BSTS to Remove Hugh Farey as Editor of the Newsletter"},{"id":"comment-144773","author":"david_goulet","post":"Have we seen this kind of effect (uniformity of superficiality) elsewhere? In art methods? In nature? In food preparation? In a Chinese laundry where the irons run hot? Has anyone even looked for it outside of Shroudology?.","date":"2014-08-19","mins":"11:41 am","url":"https://shroudstory.com/2014/08/13/stephen-jones-wants-bsts-to-remove-hugh-farey-as-editor-of-the-newsletter/","cat":"carbon_14_dating","title":"Stephen Jones Wants BSTS to Remove Hugh Farey as Editor of the Newsletter"},{"id":"comment-144784","author":"david_goulet","post":"Did you mean ‘toasting bread’? Why would I grill toast if it’s already ‘toasted’?.","date":"2014-08-19","mins":"12:18 pm","url":"https://shroudstory.com/2014/08/13/stephen-jones-wants-bsts-to-remove-hugh-farey-as-editor-of-the-newsletter/","cat":"carbon_14_dating","title":"Stephen Jones Wants BSTS to Remove Hugh Farey as Editor of the Newsletter"},{"id":"comment-144822","author":"david_goulet","post":"Anoxie, you are very good at reading other people’s hands, but never seem to lay your own cards on the table. You can’t lose the hand that way, of course, but neither can you win it..","date":"2014-08-19","mins":"4:00 pm","url":"https://shroudstory.com/2014/08/13/stephen-jones-wants-bsts-to-remove-hugh-farey-as-editor-of-the-newsletter/","cat":"carbon_14_dating","title":"Stephen Jones Wants BSTS to Remove Hugh Farey as Editor of the Newsletter"},{"id":"comment-94890","author":"david_goulet","post":"To claim Jesus will avenge verbal attacks on you, when our Lord himself never took vengeance on those that crucified him, betrays a hubris that only damages your credibility. You are not the only one to whom the Holy Spirit speaks..","date":"2014-03-30","mins":"9:08 am","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","title":"Stephen Jones’ Revised Hacking Theory Part I is Available"},{"id":"comment-94631","author":"david_goulet","post":"I think if the Shroud is ever proven authentic it means the non believer has to concede that the Christian faith is at least based on flesh and blood and that something unique happened to Jesus. It means the Christian faith is not merely based on composite myths or outright lies. This doesn’t mean a single non believer will ever convert, but it does remove their ability to dismiss the Christian faith as irrational and founded on wishful thinking. It would be the equivalent of a Bigfoot researcher finding the bones of a sasquatch in the Oregon forest. It doesn’t prove Bigfoot currently exists, but one could not then dismiss every sighting as mass delusion. Some folks sleep better knowing Bigfoot isn’t really there..","date":"2014-03-29","mins":"4:05 pm","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","title":"Stephen Jones’ Revised Hacking Theory Part I is Available"},{"id":"comment-94887","author":"david_goulet","post":"At least he isn’t afraid to be identified..","date":"2014-03-30","mins":"8:58 am","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","title":"Stephen Jones’ Revised Hacking Theory Part I is Available"},{"id":"comment-155026","author":"david_goulet","post":"Nicely done, Josie. :).","date":"2014-09-24","mins":"9:51 am","url":"https://shroudstory.com/2014/09/24/superparamagnetism/","cat":"carbon_14_dating","title":"Superparamagnetism"},{"id":"comment-72917","author":"david_goulet","post":"He’s wise to qualify his ‘fraud’ charge to a softer form of ‘scientific fraud’ but it’s still, for academics, a cannon shot across the bow. I will expect the lab(s) to take serious legal action against Jones to protect their integrity. Failure to respond to this public charge would be tantamount to admitting he was right. Mr Jones best be prepared to spend some time in court where the stakes will be much greater than winning opinions on a blog..","date":"2014-01-10","mins":"2:33 pm","url":"https://shroudstory.com/2014/01/10/surely-youre-joking-mr-jones/","cat":"carbon_14_dating","title":"Surely You’re Joking, Mr. Jones"},{"id":"comment-210368","author":"david_goulet","post":"Or perhaps it’s a tea stain. Hmmmm..","date":"2015-09-14","mins":"10:36 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","title":"The Chemist Rogers and Plastic Bags"},{"id":"comment-126281","author":"david_goulet","post":"Not to stir up a tempest here, but would it be fair to say that your skepticism of the Shroud’s authenticity is rooted in a logical assumption — that being: the Church was likely carried out it’s own secret tests and it’s reticence in having more public tests done points to it having discovered the relic is medieval..","date":"2014-06-02","mins":"10:52 am","url":"https://shroudstory.com/2014/05/30/the-collapse-of-the-fraud-theory/","cat":"carbon_14_dating","title":"The Collapse of the Fraud Theory"},{"id":"comment-89638","author":"david_goulet","post":"Even if we concede that the KGB of that era, under an atheist Soviet system, had motive to perpetrate this conspiracy, why have none of these conspirators since revealed what happened. Russia is now returned to being proudly Orthodox. What motivation is there to keeping up the game of the rigged dates via hacking? Surely there must be someone at the Kremlin who would have spilled the beans in the decades since glasnost. To be honest, Stephen, I feel you truly believe there was a conspiracy between the labs themselves to present a medieval date. But prudence, lack of evidence or legal fear prevents you from outright accusing them of fraud, therefore you are using this hacking theory as the thin edge of the wedge. There are lots of clues and oddities in the whole C 14 business that do raise some question marks but what no one has presented yet is hard evidence of any date fudging or sample switching. A single whistleblower, or late confession, or damning email would go a long way to exposing the crime. Until then they are just theories, conspiracy theories, and accordingly given the gravity they warrant..","date":"2014-03-16","mins":"12:47 pm","url":"https://shroudstory.com/2014/03/14/the-computer-hacker-hypothesis-is-short-on-factual-material/","cat":"carbon_14_dating","title":"The Computer Hacker Hypothesis is Short on Factual Material"},{"id":"comment-88738","author":"david_goulet","post":"And this is why they made you editor of a certain journal. Well put, sir..","date":"2014-03-14","mins":"11:15 am","url":"https://shroudstory.com/2014/03/14/the-computer-hacker-hypothesis-is-short-on-factual-material/","cat":"carbon_14_dating","title":"The Computer Hacker Hypothesis is Short on Factual Material"},{"id":"comment-90380","author":"david_goulet","post":"Thanks for taking the time for clarifying your position. I don’t think the term ‘conspiracy theory’ is pejorative. It does imply that someone is taking something on conjecture, rather than fact, that is all. There can be reasonable conspiracy theories (JFK, Hoffa) and there are outlandish ones (faked moon landings). Where your proposal lays depends on the logic of your clues. You have a few, but need many more. I don’t know who else belongs to my ‘ilk’ but I am not going to apologize for having doubts, and expressing them, about your conjecture. I’m not trying to discredit you, poison your well (which is a poor defense and I’d advise you to drop it) or insult your intelligence. Keep digging. I’m happy to eat crow if you can find hard evidence..","date":"2014-03-18","mins":"10:03 am","url":"https://shroudstory.com/2014/03/14/the-computer-hacker-hypothesis-is-short-on-factual-material/","cat":"carbon_14_dating","title":"The Computer Hacker Hypothesis is Short on Factual Material"},{"id":"comment-88671","author":"david_goulet","post":"Stephen, no one likes to admit they were wrong (I sure don’t) but sometimes we just have to man up and do so. Take a deep breath and let this one go..","date":"2014-03-14","mins":"7:45 am","url":"https://shroudstory.com/2014/03/14/the-computer-hacker-hypothesis-is-short-on-factual-material/","cat":"carbon_14_dating","title":"The Computer Hacker Hypothesis is Short on Factual Material"},{"id":"comment-88707","author":"david_goulet","post":"Several people have pointed out how your theory is dependent on technology that was not advanced enough to support the hacker’s scheme. You have provided no countering evidence that refutes this. Can you blame us for disbelieving? If the KGB was involved it would have been far easier for them to blackmail the labs (the KGB were very, very good at that) than hack the systems under the labs’ noses. At least apply Occam’s Razor to your own theory..","date":"2014-03-14","mins":"9:27 am","url":"https://shroudstory.com/2014/03/14/the-computer-hacker-hypothesis-is-short-on-factual-material/","cat":"carbon_14_dating","title":"The Computer Hacker Hypothesis is Short on Factual Material"},{"id":"comment-50626","author":"david_goulet","post":"The Pope does not have a public access email account. But you can send a snail mail to: His Holiness Pope Francis Apostolic Palace 00120 Vatican City I’ve written to the pope before, Benedict, not Francis. I received a reply within a few weeks from the Nuncio’s office. So the address does work – I have no illusions that my letter was ever read by Benedict. However, I think you could succeed in reaching Francis. He’s a man who prefers to read and reply to his own mail. As I’ve mentioned before Francis is showing that he is willing to engage in the public square with skeptics, atheists, etc. A respectful, rational challenge to the Church to open the Shroud to new testing might just get traction with this pontiff. Won’t know unless you try, right? Only Nixon could go to China, well maybe only Colin can go to Rome?.","date":"2013-11-10","mins":"9:34 am","url":"https://shroudstory.com/2013/11/10/the-mysterious-arizona-piece/","cat":"carbon_14_dating","title":"The Mysterious Arizona Piece"},{"id":"comment-74087","author":"david_goulet","post":"Fun article to read. And it does point to what makes the Shroud such a unique relic. Whereas it’s reasonably easy to copy the Titulus, the nails, a bloody cloak — it’s proven to be quite another matter to copy the Shroud. Therein lies the double edged sword of ever proving the Shroud was a crafted scorch — someone could then logically suggest that it may be a copy of the original. Indeed, if that linen cotton cloth is ever proven medieval the scorch hypothesis might suddenly find it has some very unexpected champions..","date":"2014-01-22","mins":"10:25 am","url":"https://shroudstory.com/2014/01/22/titulus-crucis-a-fascinating-guest-posting-by-o-k/","cat":"carbon_14_dating","title":"Titulus Crucis:  A Fascinating Guest Posting by O.K."},{"id":"comment-215032","author":"david_goulet","post":"Are there examples of acid tainted paint being used in other artifacts? Though acid paint may provide better results than Colin’s flour based experiments, his model (to my knowledge) has the advantage of being ‘within the grasp’ of a medieval artisan than Garlaschelli’s..","date":"2015-11-23","mins":"4:00 pm","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-74245","author":"david_goulet","post":"But in Jewish belief of that time blood was the life essence (still is to this day). The first followers of Jesus formed eucharistic communities – this is not a later development – it’s from the beginning. Receiving the flesh and blood of Christ (in bread and wine) is central to their understanding of who He was and who they are to be. Again this is from the beginning. If Jews think blood is important enough to collect and bury with a corpse, why wouldn’t they put even more importance to the blood spilled from a resurrected Messiah? However, I still feel it would have been a great challenge to find all these relics with blood on them, apart from the ones the disciples had access too — the burial items and possibly the crown of thorns if it was kept with the body. The only way they would have gotten that Roman lance is if a Roman soldier procured it. Which is a possibility. In the end neither of us was there. We likely will never know the answer and our theories will have to wait until the next life to be proven or disproven..","date":"2014-01-23","mins":"10:52 am","url":"https://shroudstory.com/2014/01/22/titulus-crucis-a-fascinating-guest-posting-by-o-k/","cat":"carbon_14_dating","title":"Titulus Crucis:  A Fascinating Guest Posting by O.K."},{"id":"comment-74247","author":"david_goulet","post":"I should add that I agree that the disciples themselves are unlikely to have collected these relics. They had the experience of the risen Lord, who needs a relic after such a thing. What is a nail when one has seen the nailed!.","date":"2014-01-23","mins":"11:27 am","url":"https://shroudstory.com/2014/01/22/titulus-crucis-a-fascinating-guest-posting-by-o-k/","cat":"carbon_14_dating","title":"Titulus Crucis:  A Fascinating Guest Posting by O.K."},{"id":"comment-74089","author":"david_goulet","post":"Sorry I should amend that to say “ever proven without a shadow of doubt”. One could argue it has already been proven medieval by the C 14 dating. And here’s a can opener to go with your worms..","date":"2014-01-22","mins":"10:48 am","url":"https://shroudstory.com/2014/01/22/titulus-crucis-a-fascinating-guest-posting-by-o-k/","cat":"carbon_14_dating","title":"Titulus Crucis:  A Fascinating Guest Posting by O.K."},{"id":"comment-74136","author":"david_goulet","post":"I’m inclined to agree. The burial cloths they had access to. But the cross, nails, sponge, lance etc would have been in Roman hands to be used again. There is the possibility of a believing Roman soldier – the centurion perhaps – obtaining them. But here’s thought experiment: if Jesus’ execution happened today would anyone think to make a relic of the noose that was around his neck, or the electric chair he sat on, the syringe that injected him with poison? Our customs are not 1st century ones, but if you had the risen Lord appearing to you, if you could reach out and touch his side — why would you bother with the instruments that killed him? On the other hand, if you believed that His blood was a lifeforce like no other, then maybe you would be obsessed with retaining anything that blood stained. There’s a lot of mystery in His history..","date":"2014-01-22","mins":"5:09 pm","url":"https://shroudstory.com/2014/01/22/titulus-crucis-a-fascinating-guest-posting-by-o-k/","cat":"carbon_14_dating","title":"Titulus Crucis:  A Fascinating Guest Posting by O.K."},{"id":"comment-51117","author":"david_goulet","post":"The C 14 labs (two of them anyway) are ‘alleged’ to still have pieces of their original samples. These samples could be reinvestigated, if not retested. Much to be learned from them. And as I said in another thread, the scientists linked to these labs have impeccable credentials. I would assume that when presented with new theories and observations about the samples (invisible weave theory, etc) these professional scientists would have jumped at the opportunity to confirm or deny these new theories — using the samples they had in their possession. Ray Rogers did, whatever critics may opine about his methodology and results. I’ll reiterate: sindonologists ‘diss’ the C 14 labs not because they came up with the ‘wrong’ answer but because when the answer was challenged (with new discoveries) the labs decided to remain pat. For whatever reason they stopped being scientists and started being apologists. Now if we’re not going to brook such behaviour from ‘Shroudies’ then the labs shouldn’t be given a free pass either. Those surviving samples (if they do exist) should be made available for new investigation. That is indeed how science works, regardless of how apologists on either side wish to then spin the results. The spin is bound to happen, but you don’t stop doing science because of it..","date":"2013-11-13","mins":"11:26 am","url":"https://shroudstory.com/2013/11/13/what-lab-director-is-so-crazy/","cat":"carbon_14_dating","title":"What Lab Director is So Crazy?"}]
