[{"id":"comment-50305","author":"david_goulet","post":"It’s interesting to see the detail in the shadowing in the cleft of where the top hand meets the bottom hand. And between the fingers. You have three levels actually: top hand, lower hand, body trunk underneath. How would one accomplish such nuanced detail with a bas relief scorch? If I was going to attempt such a thing I’d have made it easier on myself and placed the two hands side by side at least. But I’m no master scorch artist..","date":"2013-11-07","mins":"10:46 am","url":"https://shroudstory.com/2013/11/07/a-guest-posting-by-o-k-on-the-allegedly-too-long-fingers/","cat":"guest_posting","title":"A Guest Posting by O.K. on the Allegedly Too-Long Fingers"},{"id":"comment-48999","author":"david_goulet","post":"Max, please, is there one person among your cryptoarcheology peers who can corroborate your assertions? You simply can’t keep proving your work by quoting yourself. Even if you are some kind of pioneer in this field, and thus have no peers, you must then accept the skepticism that all pioneers face from others — and accept it with a smile, instead of tirades. Knowing in your heart that you are right should be consolation enough, no?.","date":"2013-10-28","mins":"12:27 pm","url":"https://shroudstory.com/2013/10/22/stephen-jones-on-the-stuttgart-psalter/","cat":"flagrum","title":"Stephen Jones on the Stuttgart Psalter"},{"id":"comment-49332","author":"david_goulet","post":"Just a side note observation of the devil’s horns hand gesture. It is indeed an ancient sign but interestingly enough it was reintroduced into modern usage by the late Ronnie James Dio, heavy metal singer of Black Sabbath and Dio. He drew on his childhood experience of his grandmother using the sign. Contrary to what many critics of heavy metal have assumed, Dio used the symbol as his grandmother had – as a symbol of warding off evil and not to curse. Though he was agnostic at best, Dio was fascinated by mythology and hidden symbolism. I think, Max, you would have enjoyed chatting with him..","date":"2013-10-31","mins":"10:57 am","url":"https://shroudstory.com/2013/10/22/stephen-jones-on-the-stuttgart-psalter/","cat":"flagrum","title":"Stephen Jones on the Stuttgart Psalter"},{"id":"comment-49471","author":"david_goulet","post":"Max, if you don’t want the term ‘mad archaeocryptanalyst’ added to the lexicon (a la mad scientist) I’d recommend you stop with the unwarranted personal taunts and just present your evidence. It should stand on its own..","date":"2013-11-01","mins":"3:33 pm","url":"https://shroudstory.com/2013/10/22/stephen-jones-on-the-stuttgart-psalter/","cat":"flagrum","title":"Stephen Jones on the Stuttgart Psalter"},{"id":"comment-49559","author":"david_goulet","post":"Max, passion for one’s work is a good thing. But when one repeatedly throws in derogatory jabs it makes one look insecure about oneself. This then undermines credibility. This is my concern because you, like everyone else here, bring new insights and it would be a shame for them to be dismissed because of the prickly presentation at times. I’ll say no more on the matter now, I didn’t come here to be anyone’s confessor. ;).","date":"2013-11-02","mins":"7:31 am","url":"https://shroudstory.com/2013/10/22/stephen-jones-on-the-stuttgart-psalter/","cat":"flagrum","title":"Stephen Jones on the Stuttgart Psalter"},{"id":"comment-181644","author":"david_goulet","post":"I’ll look forward to the results of your experiments..","date":"2015-01-06","mins":"11:35 am","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"}]
