[{"id":"comment-102059","author":"david_goulet","post":"I just noticed Klingon is included in that list. :) Old Elvish is missing though..","date":"2014-04-21","mins":"4:36 pm","url":"https://shroudstory.com/2014/04/20/alleluia-christ-is-risen-he-is-risen-indeed-alleluia/","cat":"history","title":"Alleluia! Christ is Risen! – He is risen indeed! Alleluia!"},{"id":"comment-210935","author":"david_goulet","post":"So a medieval artisan goes to great lengths to create this relic using a medium that, to date, has not been replicated — yet uses a very common, locally sourced linen? Kind of like making a counterfeit painting of the Mona Lisa but using modern canvas. Very odd..","date":"2015-09-22","mins":"9:00 am","url":"https://shroudstory.com/2015/09/21/another-overwhelming-evidence-argument/","cat":"history","title":"Another Overwhelming Evidence Argument?"},{"id":"comment-43464","author":"david_goulet","post":"I don’t know what he’s talking about at all. Pontius Pilate wasn’t governor?.","date":"2013-09-09","mins":"9:30 am","url":"https://shroudstory.com/2013/09/09/articles-on-the-shrouds-history/","cat":"history","title":"Articles on the Shroud’s History"},{"id":"comment-166909","author":"david_goulet","post":"You’ve said this many times before Max and I do find it an intriguing claim. Do you have any psychologists who support this observation? As the Rorschach is an accepted psychology tool, I’m sure this must be an easy claim to corroborate..","date":"2014-10-30","mins":"10:44 am","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science"},{"id":"comment-166919","author":"david_goulet","post":"As vehemently as Colin despises pseudo science, I despise pseudo Biblical scholarship and archeology. They only thing they prove is the old adage ‘there’s a sucker born every minute’..","date":"2014-10-30","mins":"11:58 am","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science"},{"id":"comment-40249","author":"david_goulet","post":"A strange thing happens when you google that church name. You get links to sites mentioning rape – it seems the word means rape in Eastern languages. One site does mention a book called The Rape of the Shroud of Turin. Very odd. The image itself is intriguing. It could be a coincidence but I wonder if the artist may have seen or heard of the Shroud and was struck by its composition and was inspired to use it for his fresco..","date":"2013-08-01","mins":"10:34 am","url":"https://shroudstory.com/2013/08/01/bible-archeology-the-mystery-continues/","cat":"history","title":"Bible Archeology: The mystery continues"},{"id":"comment-40258","author":"david_goulet","post":"I’d take Luke over Dan Brown that’s for sure. :).","date":"2013-08-01","mins":"12:29 pm","url":"https://shroudstory.com/2013/08/01/bible-archeology-the-mystery-continues/","cat":"history","title":"Bible Archeology: The mystery continues"},{"id":"comment-144208","author":"david_goulet","post":"This discussion between Dave B, Dave H and Charles is a model for how I wish we all interacted on this blog all the time. Respectful, points granted, points challenged and in the end rich food for thought for all. Thank you gents!.","date":"2014-08-16","mins":"12:17 pm","url":"https://shroudstory.com/2014/08/15/comment-promoted-looking-beyond-an-edessa-constantinople-route/","cat":"history","title":"Comment Promoted:  Looking Beyond an Edessa-Constantinople Route"},{"id":"comment-169615","author":"david_goulet","post":"Hugh and Mike both responded to your skull/eyeline angle. Those responses pointed out flaws in your thinking. The deafening silence may represent agreement with those replies. If you search through this blog site you will find a few postings about the lack of top of head image and theories about this..","date":"2014-11-07","mins":"11:52 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-169655","author":"david_goulet","post":"If an artist created the TS, why would he have left the top of the head ‘unfinished’? The fact that there are so many irregularities with this image is a good reason this could not have been a painting. Who paints like that? Stick around here long enough and you’ll come to appreciate just how vexing this icon is…especially to those who think they’ve got it all figured out (either pro or con authenticity)..","date":"2014-11-07","mins":"4:19 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-77277","author":"david_goulet","post":"Thanks for the gracious answer, John. I was asking because the answer may actually be problematic for the scorch theory..","date":"2014-02-07","mins":"11:57 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-77515","author":"david_goulet","post":"Good question. I would think that rigor would not have set in until the body had been laid in the tomb. But could it be something other than rigor that accounts for rigidity when the body is taken down from the cross? Did crucifixion cause the muscles to go taut (advanced dehydration and over exertion causing severe cramping/tautness)?.","date":"2014-02-08","mins":"1:33 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-78065","author":"david_goulet","post":"Your assuming the body was resting on the slab itself and not on something between the body and the slab. And that the slab was flat..","date":"2014-02-10","mins":"11:29 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-77253","author":"david_goulet","post":"How does the rigor/not rigor arguement affect the bas relief scorch theory – if at all?.","date":"2014-02-07","mins":"10:24 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-78100","author":"david_goulet","post":"I agree. He’s made some fair observations. Hardly the kind of stuff one finds coming from under a bridge..","date":"2014-02-10","mins":"2:56 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-73221","author":"david_goulet","post":"Any Monsignor who believed he had apiece of the Shroud in his possession and did not provide for it being given to the Church for all the faithful to enjoy upon his demise…well, that’s an interesting Monsignor.","date":"2014-01-13","mins":"8:26 am","url":"https://shroudstory.com/2014/01/10/how-many-more-purported-pieces-are-out-there/","cat":"history","title":"How many more purported pieces are out there?"},{"id":"comment-72883","author":"david_goulet","post":"If this relic truly belongs to a monsignor in Rome then what is he doing selling it online? That’s simony. He should be handing it over to the Vatican. This smells very fishy..","date":"2014-01-10","mins":"8:39 am","url":"https://shroudstory.com/2014/01/10/how-many-more-purported-pieces-are-out-there/","cat":"history","title":"How many more purported pieces are out there?"},{"id":"comment-72903","author":"david_goulet","post":"Why was it not bequethed to the Church then? Unless it was and the Church recognized it was a fake and refused it. As I said, fishy as fishy gets. I’d take my chances with a vial of Elvis sweat on Ebay over this one..","date":"2014-01-10","mins":"11:52 am","url":"https://shroudstory.com/2014/01/10/how-many-more-purported-pieces-are-out-there/","cat":"history","title":"How many more purported pieces are out there?"},{"id":"comment-72904","author":"david_goulet","post":"Exactly Hugh. Which supports my belief that the Shroud was kept hidden, protected, for centuries for that very reason. It is one of the few relics where it only really holds its spiritual value if it is kept intact. This is the mother of all Christian relics, I would expect it was treated with the mother of all cautions..","date":"2014-01-10","mins":"11:56 am","url":"https://shroudstory.com/2014/01/10/how-many-more-purported-pieces-are-out-there/","cat":"history","title":"How many more purported pieces are out there?"},{"id":"comment-172072","author":"david_goulet","post":"Every crime requires a motive and the opportunity. Colin is using a detective’s approach to his theory. In this case the opportunity is the technological ability — which means he must demonstrate that the medieval crafter of the TS had that opportunity. Thus far I’d say the evidence is not conclusive to proving this. But neither is there conclusive evidence that the crafter did not have the opportunity. As establishing opportunity is difficult with this case, the detective naturally considers if there is a strong motive. Here the challenge is that, on the surface, it is very difficult to establish and prove there was a motive to create the TS — in the form and detail that we see. However, sometimes a detective must take what clues he has to try and build a narrative that fits those clues, in an effort to piece together a motive. I don’t find Colin’s narrative irrational. But neither would I expect a jury to convict based on what evidence we’ve been presented thus far. The investigation is ongoing, however..","date":"2014-11-19","mins":"10:44 am","url":"https://shroudstory.com/2014/11/19/i-think-he-sees/","cat":"history","title":"I think HE sees?"},{"id":"comment-172079","author":"david_goulet","post":"Just don’t build a moat for those castles, as it might rain on someone’s parade. ;) What we must be mindful of is that we humans tend to presume narratives when none exist. We’re hardwired for narrative and that’s a good thing — but it does often take us down some paths that weren’t truly paths at all. Other times what we didn’t think was a path turns out to be the way home. Unfortunately the only way to discover which is which is to step into the unknown. Pack a torch and some lunch and see where you end up..","date":"2014-11-19","mins":"11:21 am","url":"https://shroudstory.com/2014/11/19/i-think-he-sees/","cat":"history","title":"I think HE sees?"},{"id":"comment-44195","author":"david_goulet","post":"What constitutes intellectual dishonesty, as opposed to plain dishonesty? I’m not sure I get the nuance and how you can prove ‘intellectual dishonesty’. I think you should set out some parameters so a poster knows what kind of proof is acceptable. That being said I agree completely with your decision to protect the integrity of the blog..","date":"2013-09-14","mins":"9:21 am","url":"https://shroudstory.com/2013/09/14/intellectual-dishonesty-in-shroud-of-turin-research/","cat":"history","title":"Intellectual Dishonesty in Shroud of Turin Research"},{"id":"comment-144433","author":"david_goulet","post":"I rather doubt the early Christian community used the Shroud as an icon of worship, or even evangelization – for the very reason you point out. The Shroud depicts Jesus defeated, not victorious. I would think that the burial linens must have been a source of confusion for the apostles as in what to do with them. They had seen the risen Christ, so what need of ‘unclean’ burial linens. But neither could they destroy the linens for they were marked with the Lord’s blood and image. The Shroud, for those that had seen a resurrected Jesus, would have been more like a memento or a keepsake. Too precious to lose, but not significant (to them) to promote or venerate. But as the first witnesses eventually die off, the Shroud and other relics become critical in proving the corporality of Jesus. At that point these relics become pearls of great price, venerated and priceless. Now they must be kept secret and shown only to the select. It may seem an odd comparison but I recall watching an episode of Hanna Montana with my daughter (when Miley was still a likeable young celeb). In the episode, Miley’s best friend finally discovers the truth that Miley is Hanna. The friend, who had until then obsessed over a scarf she had received from the pop star, gives the item to another girl (also a Hannah fan but oblivious that it’s Miley). The friend had no use for the Hanna relic for she had something better, her friend is a pop star and she now shares this great secret with her. I imagine Peter and Mary M felt much the same..","date":"2014-08-17","mins":"8:13 pm","url":"https://shroudstory.com/2014/08/15/jack-markwardts-antioch-theory/","cat":"history","title":"Jack Markwardt’s Antioch Theory"},{"id":"comment-121914","author":"david_goulet","post":"Max, I often find your linguistic theories a bit like playing Six Degrees of Separation. I’m certain you personally could take any passage of the New Testament and find a link to the Shroud. However I think this idea that the ‘light wrap’ could be the Shroud is compelling. Your reasoning about the need for Paul to code his words makes sense and your breakdown on the word itself points to a deeper mystery. Where there is smoke there’s fire. If the light wrap is not referring to the Shroud, what else might it be?.","date":"2014-05-20","mins":"6:32 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","title":"Jesus’ Long Hair Again and Again and Again"},{"id":"comment-123095","author":"david_goulet","post":"Could the ‘roll case’ have held the Shroud? Perhaps the Shroud was rolled like a scroll for easier keeping and held inside a scroll cloak. Thus Paul’s unusual word use, a slight play on words that ensured the reader that he was inferring the Shroud’s scroll cloak..","date":"2014-05-22","mins":"7:34 am","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","title":"Jesus’ Long Hair Again and Again and Again"},{"id":"comment-114619","author":"david_goulet","post":"I’ve often wondered why an artist, working with ivory or paint, would make a point of representing the herringbone weave. Why is the weave worth representing in the artwork? It seems an odd detail to capture or even notice. Unless there is a lost source artwork that did capture it (for a reason) that all others are merely copying – similar to how ‘Q’ was a source for the synoptic gospels. Another question: among all these pieces of art is there a pattern of consistency of the right hand being shown above the left (or vice versa)? Or is it more or less random?.","date":"2014-05-08","mins":"10:04 am","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-114743","author":"david_goulet","post":"My point was rather muddled so I don’t blame you. I was wondering if the original ‘Q’ artist made note of the weave for the very reason you mentioned – unique rare etc. Centuries later the Pray artist may not have thought anything much of a weave at all but was simply reproducing from ‘Q’ faithfully. Just thinking out loud, not exactly coherently..","date":"2014-05-08","mins":"1:17 pm","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-117802","author":"david_goulet","post":"Hugh, Are you saying that you feel the Vignon markings are a red herring? Or do you feel there is something to them however the case tends to be overstated?.","date":"2014-05-12","mins":"10:06 am","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-71359","author":"david_goulet","post":"Can we compare the Shroud with other linens of known ages to see if it’s pollen load is consistent with an older linen or more modern one? Do most medieval linen have 58 plant types represented?What density per inch on the linen itself?.","date":"2014-01-02","mins":"10:51 pm","url":"https://shroudstory.com/2014/01/01/paper-chase-z-twist-again/","cat":"history","title":"Paper Chase:  Z Twist Again"},{"id":"comment-143092","author":"david_goulet","post":"Remain calm? Patient? Are we reading the same posts?.","date":"2014-08-09","mins":"9:32 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143380","author":"david_goulet","post":"It is you who is also projecting into the gospel a scourging narrative that suits your theory. Which is fine, what’s good for the goose…but let’s not pretend your version of what may have happened on Good Friday is any more ‘gospel’ than anyone else’s. We’re all dealing with conjecture on this topic..","date":"2014-08-11","mins":"7:42 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143414","author":"david_goulet","post":"Colin’s comments on the scourging of Jesus remind me of a comment a friend made after seeing Mel Gibson’s The Passion. “A person couldn’t survive that kind of punishment.” My reply, “Well, he didn’t, did he?” Surely Jesus did not suffer to the degree we saw in The Passion, for that kind of scourging would have been an execution unto itself. But Jesus, according to all four gospels, dies within hours of being nailed to the cross — thus no need to break his legs. The wounds on the TS point to a scourging that went, at some point, beyond mere punishment. They were severe enough to stress his body to the point that he falls thrice on the way to Golgotha and then lasts but a few hours on the cross. Why was Jesus scourged so severely, when the object of crucifixion is prolonged agony? I don’t know, but why did the Romans crucify anyone on a day when they knew they’d be cutting their victims’ suffering short anyway (i.e. The thieves)? Perhaps Roman/Judean bureaucracy was much like our own, even when it came to executions, the right hand didn’t know what the left was doing..","date":"2014-08-11","mins":"1:21 pm","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143420","author":"david_goulet","post":"From what cursory reading I’ve done on the matter, there’s two trains of thought here on the offering of the ‘sour wine’. One was that it was an act of mercy by a Roman soldier who offered his own ration of ‘sour wine’ (the drink of lower echelon individuals) intending to dull Jesus’ suffering (this would favour the argument that Jesus was in such grievous pain that even a hardened soldier was moved to pity him). The other take is that it was an act meant to mock him. In any event, he is relcuctant to accept the ‘gift’. Whatever the gall and vinegar was, you are correct in that the effect would be a quickening of the dehydration of a crucified victim..","date":"2014-08-11","mins":"2:18 pm","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-143567","author":"david_goulet","post":"I believe the conventional thinking is that the face cloth was removed by the burial group and thus was not on his face at the time of the image formation..","date":"2014-08-12","mins":"12:23 pm","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-88195","author":"david_goulet","post":"These guys could potentially be recussitating people, they certainly are not resurrecting anyone.But until they have independent documentation of their claims, keep the tin foil handy..","date":"2014-03-13","mins":"7:30 am","url":"https://shroudstory.com/2014/03/13/tinfoil-hat-warning-chance-to-experiment-with-resurrection/","cat":"news_&_views","title":"Tinfoil Hat Warning:  Chance to Experiment with Resurrection"},{"id":"comment-39017","author":"david_goulet","post":"Point 7) You’ve mentioned the Philippines scourge comparison before and I’ve taken a look at the images. They are very different than the Shroud, but did you notice that the majority of flagellation practitioners there use some kind of palm frond? A completely different tool will produce a different result, no? Many of them self flagellate and this will obviously create a different wound than one imposed by someone else. After doing a broader search on Google on flagellation I find a myriad of methods and wound results. Some do look like the Shroud pattern. Point 4) Do you have scientific evidence that the blood on the Shroud was ‘dripped” onto it? As opposed to dabbed or seeped? I’m assuming pathologists are familiar with the difference in blood made images, has someone spoken to this – one way or another? Point 6) Even if a forger was aware of Roman flagrum designs, was he also creative enough to make the scourge marks asymmetrical so future admirers of the Shroud could deduce that the victim was scourged by two men, one taller than the other? Or do you contest that observation as well (you didn’t mention it but I’ll assume a ‘yes’)..","date":"2013-07-15","mins":"8:52 am","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series"},{"id":"comment-39071","author":"david_goulet","post":"“Jesus hung on the cross for hours and according to scripture a storm brewed up.” Is there any indication (on the shroud) that the body might have been ‘washed’ by rain? Just a thought that your comment sparked, Ron..","date":"2013-07-16","mins":"12:48 pm","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series"},{"id":"comment-39122","author":"david_goulet","post":"I have no idea if rain was common in Palestine at the time of year the crucifixion occurred and I agree it is more likely that the ‘storm’ was dust and wind. Perhaps there was no storm at all and it is a literary device. How can we ever know? But could we extrapolate there was a rain storm by the blood stain evidence? If it had rained would this explain why some blood stains are not evident but others (post rain) are? I think the bit of evidence that works against a rain theory is the dirt evidence on the feet. If it was raining hard enough to wash blood from the body, would it not have washed the feet as well? Unless the dirt had already caked too heavily to be removed? Or the feet became soiled again when the body was placed again on the ground (in the mud)? Just thinking out loud here. From what I’m reading here there is heavy debate on the washing of the body theory – was it washed or not, wholly or in part, the evidence seems to support both sides of the debate. Could the evidence be reconciled if we consider the possibility that the body was indeed washed, while still on the cross by a rain storm, just prior to being taken down from the cross hastily and transferred to the tomb? Could the shroud linen have been wet when it wrapped the body? Perhaps its the romantic in me that simply likes the idea of God sending the rain to wash the body of His Son..","date":"2013-07-17","mins":"10:04 am","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series"},{"id":"comment-39083","author":"david_goulet","post":"It rained pretty hard in Gibson’s movie. :).","date":"2013-07-16","mins":"4:39 pm","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series"},{"id":"comment-39123","author":"david_goulet","post":"Very solid theory, Yannick. The idea that infected earlier wounds could then leave more ‘recent’ stains goes a long way to explain some of the anomalies..","date":"2013-07-17","mins":"10:16 am","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series"},{"id":"comment-39025","author":"david_goulet","post":"I think you raised two important points: that we should not speak in absolutes and we should not underestimate the skills of people who lived in antiquity. This leads to a Von Daniken view that says ancient peoples could not have built pyramids, moved the statues of Rapa Nui, or sailed across the Pacific — without the aid of extraterrestrials. Just because we can’t conceive of how a person living centuries ago accomplished something doesn’t mean they weren’t smarter than us and did just that. My caveat to this though is the singularity of the Shroud. There isn’t just one pyramid (or type thereof), there wasn’t one Hokulea type vessel that sailed Polynesia, and there wasn’t just one statue on Easter island. But we only have one Shroud. I would expect to see other Shroud like works if the ability was there. Or perhaps earlier works honing the method. But what we have is a one shot of an unknown technology, creating a unique relic (when the technology could have been used to generate shrouds of kings, queens and saints). It comes out of nowhere and returns to nowhere. This isn’t to say that it couldn’t have been created thus, but that singularity is perplexing..","date":"2013-07-15","mins":"12:10 pm","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series"},{"id":"comment-171099","author":"david_goulet","post":"Always good to hear of any form of Shroud related experimentation. The results of the project should be fascinating. Thanks for the scoop, Charles (and Dan)..","date":"2014-11-13","mins":"3:38 pm","url":"https://shroudstory.com/2014/11/13/the-14th-century-3-in-1-herring-bone-weave/","cat":"history","title":"The 14th century 3 in 1 herring bone weave"},{"id":"comment-165158","author":"david_goulet","post":"Completely uncalled for and uncharitable..","date":"2014-10-24","mins":"9:30 am","url":"https://shroudstory.com/2014/10/23/the-guardian-notes-the-history-today-article-by-charles-freeman/","cat":"history","title":"The Guardian Notes the History Today Article by Charles Freeman"},{"id":"comment-165160","author":"david_goulet","post":"The wise man can learn more than the fool, than the fool from the wise man. If you can’t see the value of De Wesselow’s work, you have sealed yourself in an echo chamber..","date":"2014-10-24","mins":"9:42 am","url":"https://shroudstory.com/2014/10/23/the-guardian-notes-the-history-today-article-by-charles-freeman/","cat":"history","title":"The Guardian Notes the History Today Article by Charles Freeman"},{"id":"comment-165167","author":"david_goulet","post":"What is the negative value? That it could convince a person that the Shroud itself spawned the Jesus movement? It’s an interesting theory but one that, if a person does any kind of further research and reflection, crumbles quickly. The value (to the authentist) in his book is his acknowledging that the Shroud does not fit, from an art history perspective, a medieval artisan’s handy work. Again, if a reader comes away from that book thinking the author has explained away the origins of Christianity — that reader has only themselves to blame for their new found ignorance..","date":"2014-10-24","mins":"9:56 am","url":"https://shroudstory.com/2014/10/23/the-guardian-notes-the-history-today-article-by-charles-freeman/","cat":"history","title":"The Guardian Notes the History Today Article by Charles Freeman"},{"id":"comment-164956","author":"david_goulet","post":"But if his conceptions are absurd and long compromised why worry if they are published?.","date":"2014-10-23","mins":"4:22 pm","url":"https://shroudstory.com/2014/10/23/the-guardian-notes-the-history-today-article-by-charles-freeman/","cat":"history","title":"The Guardian Notes the History Today Article by Charles Freeman"},{"id":"comment-165187","author":"david_goulet","post":"These are excellent resources, Louis. Thanks..","date":"2014-10-24","mins":"11:03 am","url":"https://shroudstory.com/2014/10/23/the-guardian-notes-the-history-today-article-by-charles-freeman/","cat":"history","title":"The Guardian Notes the History Today Article by Charles Freeman"},{"id":"comment-165159","author":"david_goulet","post":"Max, you’ve commented many times how you resent having to “spoon feed” people — that we should all do our own research. If people are misinformed and gullible, and drinking from poisoned wells, it is no one’s fault but their own..","date":"2014-10-24","mins":"9:39 am","url":"https://shroudstory.com/2014/10/23/the-guardian-notes-the-history-today-article-by-charles-freeman/","cat":"history","title":"The Guardian Notes the History Today Article by Charles Freeman"},{"id":"comment-95868","author":"david_goulet","post":"To be honest, I don’t think either did. I don’t think Indy chose poorly. One can make the case that a fine cup would have been used for such an important occasion as the Passover supper, but I’m inclined to believe it was a simple cup. A seemingly ordinary vessel containing something extraordinary, like Jesus’ human body, the symbolism is perfect. In the end it matters little, for each of us is called to be a holy grail — of greater worth than any ornate goblet..","date":"2014-04-02","mins":"12:21 pm","url":"https://shroudstory.com/2014/04/02/the-holy-grail-found-in-spain/","cat":"history","title":"The Holy Grail Found in Spain?"},{"id":"comment-73943","author":"david_goulet","post":"Hugh, you seem quite convinced the C 14 testing, and subsequent results, are impeccable. Do you see any problems at all for the C 14 data? Any potential Achilles heel at all?.","date":"2014-01-21","mins":"10:47 am","url":"https://shroudstory.com/2014/01/20/the-idea-of-something-being-authentic-is-just-too-powerful/","cat":"history","title":"The idea of something being authentic is \"just too powerful\""},{"id":"comment-114021","author":"david_goulet","post":"I’ll second that..","date":"2014-05-07","mins":"4:48 pm","url":"https://shroudstory.com/2014/05/07/the-letter-from-alexius-comnenus/","cat":"history","title":"The Letter from Alexius Comnenus"},{"id":"comment-76498","author":"david_goulet","post":"I hate to get in between you two heavyweights here, but I don’t really care if Colin is a Mason, a Templar or a Mouseketeer. The Molay theory exists because it is one of the only non authentic explanations (thus far) that has a snowball’s chance in hell of being true. It doesn’t surprise me that Colin is following this angle because he has already chucked out all other possibilities based on the evidence he accepts as valid. I also base my belief in the Molay theory on the evidence it’s proponent’s provide. If they happen to greet each other with a secret handshake it doesn’t affect my discernment in the least..","date":"2014-02-04","mins":"11:09 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-76522","author":"david_goulet","post":"John Klotz :David, If you believe that you meant something opposite to what your metaphor implies. . Hell may be a very cold, cold place indeed. Here’s hoping none of us find out what Lucifer calls ‘room temperature’. As for your bridge, I already bought it years ago on an online auction. So it’s not yours to sell. ;).","date":"2014-02-04","mins":"12:26 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-77085","author":"david_goulet","post":"I see nine characters on that HD photo at the bottom. How many do you see and can you identify them for me? And which one has the ‘E’ inside?.","date":"2014-02-06","mins":"5:21 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-72447","author":"david_goulet","post":"Much appreciated, Dave. This whole thread has made for fascinating reading. While I find it extremely doubtful that Jesus ever wrote any letter to anyone (when he never left so much as a post it for his own apostles) the legend of the letter, as a allegory, is very intriguing..","date":"2014-01-06","mins":"10:43 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"}]
