[{"id":"comment-127648","author":"david_goulet","post":"Every time Dan offers you an olive branch you somehow are able to find thorns in it..","date":"2014-06-07","mins":"7:53 pm","url":"https://shroudstory.com/2014/06/07/colin-berry-is-up-with-an-interesting-posting-about-3d-enhancement/","cat":"3d","title":"Colin Berry is up with an interesting posting about 3D enhancement"},{"id":"comment-209529","author":"david_goulet","post":"What would be interesting is to find a scientist, or two, who is not a Shroudie and present him Colin’s linen/shroud and see how long it takes him/her to discern how the image was formed. This would provide a baseline of sorts. If the scientist quickly deduces that flour/oil and heating was used then we would have to ask ‘how is it the mechanism was more easily observed on Colin’s shroud vs the actual one?” If Colin’s model is ‘the answer’ what tell tale signs would we have to find on the Shroud to corroborate his theory? Or is my presumption wrong here and Colin is not saying this model is exactly how the Shroud image was created, but rather his model merely demonstrates that a simple mechanism can account for certain Shroud properties, which had previously been attributed only to complex mechanisms (lasers, etc). Just trying to wrap my head around the various repercussions of the theory..","date":"2015-09-03","mins":"9:26 am","url":"https://shroudstory.com/2015/09/03/colin-berrys-latest-and-greatest-is-it-enough/","cat":"3d","title":"Colin Berry’s Latest and Greatest. Is it Enough?"},{"id":"comment-210011","author":"david_goulet","post":"Colin has never proposed a painting forgery, but a contact image. And the forger in this case would not want to reveal his secret because that would ruin the whole project..","date":"2015-09-09","mins":"8:52 pm","url":"https://shroudstory.com/2015/09/03/colin-berrys-latest-and-greatest-is-it-enough/","cat":"3d","title":"Colin Berry’s Latest and Greatest. Is it Enough?"},{"id":"comment-210052","author":"david_goulet","post":"I agree that a lack of any evidence of the technique being used beyond the Shroud is problematic. Colin has reasonable arguments for why that is. You can check those out on his blog if you have time. I’m not defending the theory, just trying to clarify based on your comment. Colin’s experiments have, in the end, had a specific purpose — not to prove that Theory A or B is how the Shroud was fabricated, but simply that medieval technologies can produce an image with qualities like the Shroud. He did not match all the criteria of course. But even his harshest critics here would admit that this work cannot be dismissed as baloney. If it is baloney, then so is Rogers work…because they followed similar paths..","date":"2015-09-10","mins":"1:18 pm","url":"https://shroudstory.com/2015/09/03/colin-berrys-latest-and-greatest-is-it-enough/","cat":"3d","title":"Colin Berry’s Latest and Greatest. Is it Enough?"},{"id":"comment-212040","author":"david_goulet","post":"Funny you mention Circulus, because that’s how I feel about Hugh’s claims that his face images are better than the Shroud’s. If it is, I don’t see it..","date":"2015-10-08","mins":"8:18 am","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"id":"comment-212069","author":"david_goulet","post":"In this example, they both look about the same. Yours being brighter. The one you posted above is not as good. Eye of the beholder?.","date":"2015-10-08","mins":"12:39 pm","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"id":"comment-145815","author":"david_goulet","post":"Divine Mercy – wonderful devotion. But these artistic renderings of the good Sister’s vision are pointless as corroborating evidence for the TS image. Why? Because we Christians now have an image burned into our collective consciousness of what Jesus looks like, based on centuries of art. Ask anyone to draw a picture of Jesus and 99% of the time you’ll get a Jesus that we all recognize as the ‘standard Jesus’. It’s the same with Mary. In fact it is the same with aliens and the chupacabra. Once the convention is set, every sighting thereafter seems to be modelled on the prototype. The TS could be the original model for the convention, but ironically because this convention is so prolific it rules out, as corroborative evidence, modern visions of Jesus — Jesus looks like ‘that’ because ‘that’ is what we expect to see. Oddly enough, if a person had a vision of Jesus and He looked different than expected, I’d be more curious to investigate that vision. I’m not saying the visions are real or not, simply that it is pointless to use them to bolster any case. The Divine Mercy images make for beautiful devotional art, but lousy scientific evidence..","date":"2014-08-24","mins":"9:42 am","url":"https://shroudstory.com/2014/08/22/another-overlay-divine-mercy-image-and-the-shroud-of-turin/","cat":"news_&_views","title":"Another Overlay:  Divine Mercy Image and the Shroud of Turin"},{"id":"comment-206628","author":"david_goulet","post":"I don’t recall Hugh every claiming the Shroud was a painting, but he has mused that it was artisan created as an altar cloth, or other such liturgical item. Hugh is the one person here who avoids making a declaration on what created the icon’s image. His mantra, which I appreciate, is “I don’t know for sure but I’ll look at all angles until I do.”.","date":"2015-07-26","mins":"9:32 pm","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","title":"1999 Interview with Isabel Piczek"},{"id":"comment-35947","author":"david_goulet","post":"You miss my point Yannick. It was a ‘crazy’ (i.e. Out of the box) experiment – poorly done too – but it has led to some real insights. So in that sense I think it has great value. You obviously do to. But if the person performing the experiment was Fanti (whom I’m no big fan of) I suspect you’d be dismissing the findings as biased. Like I said in another post, insights can be found in what may seem odd experiments – not just the ones we are predisposed to. And for the record, I agree with 90% of your posts. I believe the shroud image was caused by natural, but very extraordinary, processes. I sleep quite well under my Shroud replica sheets. :).","date":"2013-06-03","mins":"4:55 pm","url":"https://shroudstory.com/2013/06/03/a-completely-inappropriate-experiment-nice-white-lab-coats-anyway/","cat":"image_theory","title":"A completely inappropriate experiment. Nice white lab coats, anyway"},{"id":"comment-35940","author":"david_goulet","post":"Funny how when a crazy experiment supports one’s argument it is taken seriously, but if it does not then it is considered junk science and dismissed..","date":"2013-06-03","mins":"4:34 pm","url":"https://shroudstory.com/2013/06/03/a-completely-inappropriate-experiment-nice-white-lab-coats-anyway/","cat":"image_theory","title":"A completely inappropriate experiment. Nice white lab coats, anyway"},{"id":"comment-177262","author":"david_goulet","post":"Perhaps because Jesus method of entering the tomb was not unique, but his method of exiting it was?.","date":"2014-12-17","mins":"9:42 am","url":"https://shroudstory.com/2014/12/17/a-gedankened-image-forming-process/","cat":"image_theory","title":"A Gedankened Image Forming Process"},{"id":"comment-172217","author":"david_goulet","post":"“As such, it makes more sense to claim that the Crown of Thorns (or the Shroud) were products of the artistic development, rather than that the artistic development was derived from the relics.” Or perhaps neither had any influence on each other at all..","date":"2014-11-20","mins":"9:09 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-207969","author":"david_goulet","post":"Even loup garou! Very nice setting in la belle province..","date":"2015-08-11","mins":"9:00 am","url":"https://shroudstory.com/2015/08/11/a-guest-posting-by-yannick-clment/","cat":"image_theory","title":"A Guest Posting by Yannick Clément"},{"id":"comment-193619","author":"david_goulet","post":"I’d think a side by side image would be even stronger in making the direct link that these images belong to one man — here’s his face, here’s his buttocks. However, for displaying the relic, the current linen allows for a much grander, panoramic view. This would have been a logical decision for whoever created it for the purpose of massive pilgrimage displays. A curious pilgrim asking “Why’d they put the linen on Him like that for?” could easily be dismissed by a cleric with “You ignorant sod, that’s how the Jews buried their dead!” Who’d have known? It’s not an insurmountable question, and yet it’s one of the many little questions about the relic that leave me scratching my head. Odd fold, odd fold….","date":"2015-03-17","mins":"12:48 pm","url":"https://shroudstory.com/2015/03/17/a-shift-drift-in-colin-berrys-thinking/","cat":"image_theory","title":"A Shift-Drift in Colin Berry’s Thinking?"},{"id":"comment-193624","author":"david_goulet","post":"They are not the same height. The dorsal is ‘taller’. One wouldn’t notice that with the current linen of course. That would support the reason a forger might have went with that configuration, assuming a side to side imprint produces the same size mismatch..","date":"2015-03-17","mins":"2:00 pm","url":"https://shroudstory.com/2015/03/17/a-shift-drift-in-colin-berrys-thinking/","cat":"image_theory","title":"A Shift-Drift in Colin Berry’s Thinking?"},{"id":"comment-193630","author":"david_goulet","post":"Quite so. What is the most accepted explanation for the size mismatch?.","date":"2015-03-17","mins":"3:18 pm","url":"https://shroudstory.com/2015/03/17/a-shift-drift-in-colin-berrys-thinking/","cat":"image_theory","title":"A Shift-Drift in Colin Berry’s Thinking?"},{"id":"comment-193635","author":"david_goulet","post":"Cheeky..","date":"2015-03-17","mins":"3:52 pm","url":"https://shroudstory.com/2015/03/17/a-shift-drift-in-colin-berrys-thinking/","cat":"image_theory","title":"A Shift-Drift in Colin Berry’s Thinking?"},{"id":"comment-193625","author":"david_goulet","post":"Upside down – you mean if displayed vertically end to end. But wasn’t it publically displayed horizontally?.","date":"2015-03-17","mins":"2:02 pm","url":"https://shroudstory.com/2015/03/17/a-shift-drift-in-colin-berrys-thinking/","cat":"image_theory","title":"A Shift-Drift in Colin Berry’s Thinking?"},{"id":"comment-193629","author":"david_goulet","post":"I like the creativity in that stretcher idea. Though it seems to be stretching (!) it a bit. I do like giving our forbearers credit for being outside the box (tomb) thinkers. BTW, could the dye method have worked with an actual corpse, rather than a woodcut? It is the medieval period afterall…people got murdered for less..","date":"2015-03-17","mins":"3:16 pm","url":"https://shroudstory.com/2015/03/17/a-shift-drift-in-colin-berrys-thinking/","cat":"image_theory","title":"A Shift-Drift in Colin Berry’s Thinking?"},{"id":"comment-193649","author":"david_goulet","post":"Just when it was getting interesting. Sigh..","date":"2015-03-17","mins":"7:42 pm","url":"https://shroudstory.com/2015/03/17/a-shift-drift-in-colin-berrys-thinking/","cat":"image_theory","title":"A Shift-Drift in Colin Berry’s Thinking?"},{"id":"comment-193606","author":"david_goulet","post":"Wonderful stuff from the sciencebod! Now, this seems a rather complex dye job. Do we have precedent in the medieval period for the application of the method – whether in art work or commercial use? And are we still speaking of a contact image (dye was placed on a model then pressed on the linen) or was the dye applied by an artist – because it would have taken a master artist working with such an ‘enigmatic’ medium..","date":"2015-03-17","mins":"10:15 am","url":"https://shroudstory.com/2015/03/17/a-shift-drift-in-colin-berrys-thinking/","cat":"image_theory","title":"A Shift-Drift in Colin Berry’s Thinking?"},{"id":"comment-193610","author":"david_goulet","post":"Right, I refreshed my memory on the woodcut theory. I found this comment you’d made in one of the discussions: “If a woodprint had been used as template, would it not have been possible to get a more realistic differentiation, say between hair and skin?” That’s still a very good question. The woodcut method actually should have produced a much sharper image, even allowing for fading. Or did the artist realize, as do Bigfoot hoaxers, that you must leave the image deliberately out of focus for best effect..","date":"2015-03-17","mins":"11:01 am","url":"https://shroudstory.com/2015/03/17/a-shift-drift-in-colin-berrys-thinking/","cat":"image_theory","title":"A Shift-Drift in Colin Berry’s Thinking?"},{"id":"comment-193816","author":"david_goulet","post":"Hugh, I’m not sure where I stand on the C 14 dating but if we do acknowledge that the Shroud could be as young as 1150 AD, doesn’t this only cloud the issue of how it was made? The historical record is 1355 AD, how does one explain a gap of two centuries. It’s pushing the bounds of reason to explain how it was made in 1355 AD, move that date back two centuries and you’re into the twilight zone — at least with any hoax theories. Naturalistic theories may still work. Sure wish Turin would allow some more non invasive testing/observation..","date":"2015-03-19","mins":"7:13 pm","url":"https://shroudstory.com/2015/03/17/a-shift-drift-in-colin-berrys-thinking/","cat":"image_theory","title":"A Shift-Drift in Colin Berry’s Thinking?"},{"id":"comment-193613","author":"david_goulet","post":"I have one tiny problem with the man made contact print theory (woodcut, scorch, etc). It’s the in the fold. Who folds a death shroud from top to bottom? In all my years helping my dad collect corpses (he was a mortician I should add lest you think we were graverobbers) we never placed a blanket over a body from head to toe. It was always from side to side. It’s the most logical way to cover a body that has been placed on a linen. Unless of course one was forced to use a linen that was not meant for this kind of purpose. Why would a medieval forger use the head to toe method? Was this the common burial practice of the time? Perhaps a historian could provide insight there. The Gospels mention the burial linens Jesus was wrapped in — unless ‘wrapped’ is a bad translation, do we not usually associate wrapping as something done side to side? Would that not be the expectation of pilgrims looking at the relic? It may seem a rather minor detail, but it’s one that perplexes me..","date":"2015-03-17","mins":"11:59 am","url":"https://shroudstory.com/2015/03/17/a-shift-drift-in-colin-berrys-thinking/","cat":"image_theory","title":"A Shift-Drift in Colin Berry’s Thinking?"},{"id":"comment-171059","author":"david_goulet","post":"I agree with you and Colin. A medieval person is most likely to have accepted the TS as a miraculous image, or some kind of contact print – sweat/blood. It’s medium does not look like anything else common to the era, not a painting, woodcut, or stained glass. Their best guess, ironically, isn’t much farther off than our own today..","date":"2014-11-13","mins":"11:23 am","url":"https://shroudstory.com/2014/11/13/a-sweat-imprint-that-is-a-negative-which-is-comparable-to-a-brass-rubbing/","cat":"image_theory","title":"A sweat imprint that is a negative which is comparable to a brass rubbing"},{"id":"comment-206027","author":"david_goulet","post":"The problem is that the science in this presentation is well beyond layman level. Before I get too excited I’d like to see some summarized peer review by objective physicists. Colour me intrigued until then..","date":"2015-07-17","mins":"9:48 am","url":"https://shroudstory.com/2015/07/17/another-reaction-to-ray-rogers-paper-on-radiation/","cat":"image_theory","title":"Another Reaction to Ray Rogers’ Paper on Radiation"},{"id":"comment-39451","author":"david_goulet","post":"Here’s my take on this: our Christian faith is predicated on a miracle – the Resurrection – a supernatural event. This was the belief of the early Christian witnesses. If the event is supernatural then it is not illogical to consider that there could be a supernatural image formation process involved with the Shroud. However neither is it illogical to posit that the image was a naturally caused by product of the supernatural event. Being open to both possibilities is good ‘science’..","date":"2013-07-21","mins":"8:53 pm","url":"https://shroudstory.com/2013/07/20/any-good-reasons-for-associating-anything-supernatural-with-the-shroud/","cat":"image_theory","title":"Any good reasons for associating anything supernatural with the shroud?"},{"id":"comment-39523","author":"david_goulet","post":"Here’s a theory, could Jesus’ resurrected body have been restored to his zenith genetic point. This is the point in which a human body stops ‘growing’ and then begins diminishing – on the cellular level. I read once that we reach this zenith point around the age of 21 or so. Thereafter our cells diminish, at greater speed as we age. The disciples did not recognize Jesus because the last time they’d see him he was in his 30’s, weathered by time and age – and of course his suffering. Now they encounter a young man, full of life – indeed life at its fullest point. There is a familiarity to him, yet a strangeness. Is this what our resurrected bodies might be like? Each of us restored to the zenith point forever, all imperfections in our DNA repaired. Look yourself in the mirror, then imagine yourself in the full bloom of youth, all physical imperfections gone. Would your friends and family recognize you? Just musing of course. This is one mystery we shall never solve in this life..","date":"2013-07-22","mins":"11:26 am","url":"https://shroudstory.com/2013/07/20/any-good-reasons-for-associating-anything-supernatural-with-the-shroud/","cat":"image_theory","title":"Any good reasons for associating anything supernatural with the shroud?"},{"id":"comment-92345","author":"david_goulet","post":"Actually Dan has a point, the creases could have been caused by scorching – or by other image formations processes. What fits your hypothesis may also fit others. But once again your experiments have brought attention to bear on significant details and will spur on more thought and experimentation. I would never have thought a simple crease might reveal so much…keep advancing the conversation, Colin..","date":"2014-03-23","mins":"3:00 pm","url":"https://shroudstory.com/2014/03/23/baked-in-creases-really/","cat":"image_theory","title":"Baked-In Creases. Really?"},{"id":"comment-146554","author":"david_goulet","post":"Is the photo you provided (posted 11:58 pm) reflected light or transmitted light?.","date":"2014-08-27","mins":"1:11 pm","url":"https://shroudstory.com/2014/08/27/banding-is-it-real/","cat":"image_theory","title":"Banding? Is it Real?"},{"id":"comment-146563","author":"david_goulet","post":"So why is Hugh’s observation list worthy? He doesn’t mention reflected light in his reply..","date":"2014-08-27","mins":"1:23 pm","url":"https://shroudstory.com/2014/08/27/banding-is-it-real/","cat":"image_theory","title":"Banding? Is it Real?"},{"id":"comment-146557","author":"david_goulet","post":"Yes, because you post with such vagaries that I require precision to understand your replies. I doubt I’m alone..","date":"2014-08-27","mins":"1:16 pm","url":"https://shroudstory.com/2014/08/27/banding-is-it-real/","cat":"image_theory","title":"Banding? Is it Real?"},{"id":"comment-146493","author":"david_goulet","post":"Can you provide a Top Five list of CB’s Distorted/Ignored/Select Facts? If you are going to make a claim like this you need to back it up with ‘facts’ yourself. Otherwise you are guilty of one CB claim – that you are a troll..","date":"2014-08-27","mins":"7:27 am","url":"https://shroudstory.com/2014/08/27/banding-is-it-real/","cat":"image_theory","title":"Banding? Is it Real?"},{"id":"comment-146572","author":"david_goulet","post":"Well this posting began with confusion over Colin’s article, perhaps it’s appropriate it all ends in a morass. Let’s try to get back on solid ground by discussing just one point. Hugh did suggest that the backing cloth would affect what we see in the transmitted light photo – thus affecting the banding effect. This seems logical, to me, is there a good reason why the backing cloth is not relevant at all?.","date":"2014-08-27","mins":"1:40 pm","url":"https://shroudstory.com/2014/08/27/banding-is-it-real/","cat":"image_theory","title":"Banding? Is it Real?"},{"id":"comment-146576","author":"david_goulet","post":"Using my powers of ESP I am going to extrapolate an actual answer from this three word cryptogram. Anoxie is saying that the reflected light image of the Shroud is more important than the transmitted light image re: banding conclusions..","date":"2014-08-27","mins":"1:49 pm","url":"https://shroudstory.com/2014/08/27/banding-is-it-real/","cat":"image_theory","title":"Banding? Is it Real?"},{"id":"comment-146581","author":"david_goulet","post":"Good luck Hugh. You Brits still have that Enigma machine so you may have better results than me..","date":"2014-08-27","mins":"2:01 pm","url":"https://shroudstory.com/2014/08/27/banding-is-it-real/","cat":"image_theory","title":"Banding? Is it Real?"},{"id":"comment-146573","author":"david_goulet","post":"Hey, we’re on the same page. Excellent..","date":"2014-08-27","mins":"1:40 pm","url":"https://shroudstory.com/2014/08/27/banding-is-it-real/","cat":"image_theory","title":"Banding? Is it Real?"},{"id":"comment-146585","author":"david_goulet","post":"Excuse my need for a general refresher here. The banding is important because, if it exists, it is problematic for the scorch theory because there is no way an artisan could have achieved this effect, therefore it must point to some other image formation process. Is this the gist of why banding matters? Colin’s investigation points to another possible cause for the banding effect — it not being banding at all. Anoxie is countering that the banding is obviously there. Hugh is not ruling out banding, but is not as convinced as Anoxie as to it’s “obvious” existence. Fair summation?.","date":"2014-08-27","mins":"2:31 pm","url":"https://shroudstory.com/2014/08/27/banding-is-it-real/","cat":"image_theory","title":"Banding? Is it Real?"},{"id":"comment-146598","author":"david_goulet","post":"Basic and very helpful. Thanks. This better explains, for me, the importance of the debate and the stakes involved for competing theories..","date":"2014-08-27","mins":"3:46 pm","url":"https://shroudstory.com/2014/08/27/banding-is-it-real/","cat":"image_theory","title":"Banding? Is it Real?"},{"id":"comment-146611","author":"david_goulet","post":"A good clarification of your side of the issue. I don’t really ‘buy’ one assumption though — that the face is too rectangular, too Gothic. If anything the face looks swollen to me, which is exactly what I’d expect of a death mask. I saw my share of corpses as the son of an undertaker, and the man on the Shroud sure looks like one. We are not dealing with a painting, we all agree on that. We are dealing with a yet to be confirmed image process. Because we do not know how it works, we cannot rule out any image distortion caused from that process. Your research is in an effort to prove that a medieval scorch theory cannot be ruled out. You’ve made some strides there. On the other hand, nothing you have discovered, to me, has ruled out a 1st century origin. I believe you’ve acknowledged this as well, pointing out that a scorch (in the broader sense of the term) theory might support a 1st century origin. Question: a bit off topic perhaps. Can sound waves create latent images on surfaces other than liquid ones? The banding (lines) on the TS remind me of sound ripples in some pics. Too sci fi perhaps, but could an ultra sonic pulse have created a reaction on the linen forming an image? A Big Bang mistaken for an earthquake perhaps? Sorry, the creative writer in me is bleeding onto the page at this point..","date":"2014-08-27","mins":"4:25 pm","url":"https://shroudstory.com/2014/08/27/banding-is-it-real/","cat":"image_theory","title":"Banding? Is it Real?"},{"id":"comment-146530","author":"david_goulet","post":"I’d like to make a list for you anoxie, if you ever had the brass to actually post YOUR theory on the image formation..","date":"2014-08-27","mins":"11:22 am","url":"https://shroudstory.com/2014/08/27/banding-is-it-real/","cat":"image_theory","title":"Banding? Is it Real?"},{"id":"comment-192385","author":"david_goulet","post":"This comment should be promoted. Keep being curious, one and all!.","date":"2015-03-04","mins":"9:31 am","url":"https://shroudstory.com/2015/03/03/checking-in-on-colin-berry-a-new-image-model-forming-in-my-mind/","cat":"image_theory","title":"Checking In On Colin Berry:  A New Image Model  ‘forming in my mind’"},{"id":"comment-192426","author":"david_goulet","post":"“Details building into crucial evidence, thinking experiment and experimental archaeology is what really matters to make the difference as far as unravelling the truth of the TS is concerned. ” That’s exactly what Colin has been doing, except his hypothesis starts with a medieval provenance, whereas yours would begin with a 1st century. Both are valid starting points. With Colin there’s been a bit of “Aha, I’ve got it! Wait, no hold on….aha now I’ve got it. Wait…” That’s how science is supposed to go. Not: “Aha, I’ve got it. Take my word for it, I got it.”.","date":"2015-03-04","mins":"3:14 pm","url":"https://shroudstory.com/2015/03/03/checking-in-on-colin-berry-a-new-image-model-forming-in-my-mind/","cat":"image_theory","title":"Checking In On Colin Berry:  A New Image Model  ‘forming in my mind’"},{"id":"comment-208672","author":"david_goulet","post":"I like your point, Dan, that if simple natural ‘ingredients’ like flour/flour oil could account for the image formation then what other natural medium might have also worked? While Colin may be winding down his experiments it’s really all just begun. Thanks to Dr. Berry for that..","date":"2015-08-21","mins":"8:16 am","url":"https://shroudstory.com/2015/08/21/close-to-the-finishing-line-or-the-starting-line/","cat":"image_theory","title":"Close to the finishing line or the starting line?"},{"id":"comment-208728","author":"david_goulet","post":"This post will be deleted as soon as Dan sees it. A stern warning should also be issued to the contributor to refrain from this kind of absolute nonsense..","date":"2015-08-22","mins":"11:31 am","url":"https://shroudstory.com/2015/08/21/close-to-the-finishing-line-or-the-starting-line/","cat":"image_theory","title":"Close to the finishing line or the starting line?"},{"id":"comment-208737","author":"david_goulet","post":"I had to look the word ‘enthymeme’ up – so full marks for forcing me to enrich my word power. This at least is a reasonable criticism. I’ll give you a mulligan on the previous one, Stan. It’s not like I’ve never shared an off colour joke that bombed (and regretted it)..","date":"2015-08-22","mins":"6:08 pm","url":"https://shroudstory.com/2015/08/21/close-to-the-finishing-line-or-the-starting-line/","cat":"image_theory","title":"Close to the finishing line or the starting line?"},{"id":"comment-208683","author":"david_goulet","post":"I’m not a scientist, can you explain why you say this? What exactly is problematic with the diagram, from a scientific perspective? I ask this sincerely..","date":"2015-08-21","mins":"10:35 am","url":"https://shroudstory.com/2015/08/21/close-to-the-finishing-line-or-the-starting-line/","cat":"image_theory","title":"Close to the finishing line or the starting line?"},{"id":"comment-200174","author":"david_goulet","post":"It’s called rain, David Mo..","date":"2015-05-25","mins":"3:22 pm","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-200231","author":"david_goulet","post":"Interesting observation. I believe Colin is now working on the premise that a statue was not used but rather an actual body (living or dead) was employed. I’m wondering if the eyebrow protrusion might be related to swelling of the body tissue. If the relic is authentic, and the body is Jesus, we’re dealing with a man who was soundly beaten — the Gospels record he was stuck in the face. He also may have fallen face first. The most common areas of swelling on a face, that’s taken hard impact, will be the area around the eye (cheek and brow) and the around the mouth (cheek and lips)..","date":"2015-05-26","mins":"6:41 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199597","author":"david_goulet","post":"Read Dave B’s response below to the flagrum issue. Your pardon begging is itself begging to be pardoned..","date":"2015-05-19","mins":"8:17 pm","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199709","author":"david_goulet","post":"Nor can I make the deaf hear..","date":"2015-05-20","mins":"2:26 pm","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199521","author":"david_goulet","post":"The scourge marks are most likely authentic exactly because they do not look authentic. If a forger was involved with the relic then why would he create such enigmatic marks to represent a scourge, when in his medieval time period and audience would have expected the more traditional ‘stripes’ left by a whip? The forger hypothesis continually needs to turn the forger into some kind of mastermind who decided to use a image formation method that was 100 times more complex than needed for the audience of the era. He might have stumbled upon a process for the body image, but there is no reason for him to use the dumbbell shape when, as Hugh has pointed out many times, nobody today (let alone the medieval period) is certain what a roman flagrum actually looked like..","date":"2015-05-19","mins":"8:28 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199545","author":"david_goulet","post":"Are those influenced by the Shroud by any chance?.","date":"2015-05-19","mins":"2:43 pm","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199548","author":"david_goulet","post":"Also those are pieces of art, and isn’t our forger theory based on the premise that this is not artwork but an intent to appear authentic? It is intended to match the Passion narrative everyone at that time was familiar with. The skeptic keeps saying “but this isn’t what we’d expect to see in a crucified man” and I keep saying “Exactly the point”. If it’s a forgery why is the forgery so oddly unlike what we’d expect. Can you name another type of forgery where the forger went to such lengths to make the end product look so unlike what his audience would expect?.","date":"2015-05-19","mins":"2:50 pm","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199596","author":"david_goulet","post":"Why do think that was, Hugh? Why small welts? Would that be consistent with what medieval lashing inflicted? Did medieval artists differentiate between first century lash wounds and 14th century ones?.","date":"2015-05-19","mins":"8:13 pm","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199712","author":"david_goulet","post":"I’ve reread Colin’s post and the subsequent comments. Nothing I’ve read convinces me the image must be fake. However, neither does any comment convince me it is unquestionably authentic. Everyone seems to have a different assumption as to what the wounds should look like and this colours their interpretation of what we do see. Like so many aspects of the icon, a conclusive answer eludes us. Fertile discussion nonetheless..","date":"2015-05-20","mins":"2:39 pm","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199718","author":"david_goulet","post":"I appreciate the sentiment but it is fair to point out that while a pathologist may indeed identify the marks as scourge wounds, the pathologist is not concerned with the intricacies of image formation – especially how blood may smear and affect clarity of image. Colin has spent more time now experimenting with image formation than the pathologists mentioned — that does give weight to his observations..","date":"2015-05-20","mins":"3:28 pm","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-52457","author":"david_goulet","post":"Your blood theory is a good reason why we must be very careful when studying the blood stains – because some may indeed have been touch ups. Indeed, whose to say that all the blood stains aren’t additions. I hesitate to suggest that because if the bloodstains were proven to be on top of the image then the fallback position for an authentist would be to say the image is authentic – the blood was added. That would look like a real dodge to the skeptics, even though it could be the reality. So much we simply don’t know..","date":"2013-11-22","mins":"9:02 pm","url":"https://shroudstory.com/2013/11/21/colins-scorch-under-a-microscope/","cat":"image_theory","title":"Colin’s Scorch Under a Microscope"},{"id":"comment-52410","author":"david_goulet","post":"Anonymous :I just can’t see a forger taking a real bloodstained burial cloth and making a perfect body image (forensically speaking) around those stains without disturbing or damaging them and which would look in perfect sync with those biological stains. This kind of scenario is far beyond what my rational brain can take. It’s beyond anyone’s rational brain. This is why Colin, Hugh, etc believe the ‘blood’ stains were applied after the image was created. The more we explore the various theories I can say this: if the Shroud is not authentic then the Templars theory is the only one that could even be remotely possible to be true. In other words, in my opinion, the available evidence leaves no other logical conclusion. It would have taken a secret order, with conspiratorial motivations and the many necessary resources, to have produced the Shroud. They would have had to employ the services of at least one master artisan (i..e. A metal worker) with a team of helpers. They would have had to obtain a crucifix from some plundered or ruined church from somewhere in Chistendom. Or forged the finished corpus. All evidence of the enveavour would have had to been kept secret – likely under a vow of eternal perdition if anyone broke that secret pact. The artisan would have had to be something of a perfectionist — not stopping at a scorch that was ‘pretty darn good’ but one that was exceptionally evenly scorched. Then someone with a superior knowledge of the wounds of Christ had to use leeches to dab blood on the shroud to approximate those wounds. If the Shroud is medieval this is the only theory that matches the requirements of the available evidence..","date":"2013-11-22","mins":"1:01 pm","url":"https://shroudstory.com/2013/11/21/colins-scorch-under-a-microscope/","cat":"image_theory","title":"Colin’s Scorch Under a Microscope"},{"id":"comment-201623","author":"david_goulet","post":"Can Paulette or Dan explain why they feel Freeman’s is closest of the misses? Because I’d have to go with Colin or Dave Hines or Max before Charles’ theory..","date":"2015-06-11","mins":"8:47 am","url":"https://shroudstory.com/2015/06/11/comment-promoted-charles-freeman-comes-closest/","cat":"image_theory","title":"Comment Promoted:  Charles Freeman Comes Closest"},{"id":"comment-207862","author":"david_goulet","post":"Except Lazarus et al weren’t resurrected. They were resuscitated. No less awesome a miracle, but resurrection would appear to be something of another strata..","date":"2015-08-10","mins":"8:33 am","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-207897","author":"david_goulet","post":"I should have been clearer in my reply. I didn’t mean that those other people were not dead. The Gospels clearly state they were. I was trying to point out that Jesus’ rising from the dead is much different the other cases, though the process may have commonalities. In each case you mentioned, the person was easily identified by their kinfolk. But in Jesus’ case he is not recognized at all at first. Lazarus and the others are brought back to life, they go about their lives in exactly the same way as before they died — and they eventually experience death again. The Gospel writers clearly saw the other cases as similar to each other, a person died and then was restored to life by Jesus. But Jesus is not merely restored to the life he had, he is the new Adam. The Gospel writers had less trouble detailing the others restored to life. There is clarity in the story – a person was dead, and now is alive again – their death almost a hiccup in their earthly life. Jesus’ resurrection is less easily described to the Gospel writers. He is different now. Something they have never experienced before..","date":"2015-08-10","mins":"2:42 pm","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-207869","author":"david_goulet","post":"Can sweat leave an imprint on linen of a body image? Salt water? Blood? I ask because if I was a medieval forger attempting an image of Christ taken from a transport linen I’d likely start with these relevant mediums. Failing these natural first choices, I might branch out to lemon juice, urine, etc – other materials that are known to leave a stain. If any of these methods produced a decent image, then why would I go with the more complex (by comparison) ones – such as flour? BTW, an image of the dead Christ imprinted in his own blood — now there’s a relic that would pack the house..","date":"2015-08-10","mins":"8:53 am","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-207874","author":"david_goulet","post":"Thanks for the background, Colin. I knew these materials had been looked at as a possible explanation for the Shroud and subsequently were found wanting — in that they do not match what we have on the Shroud therefore they are not part of the icon’s image formation. BUT (I like big ‘buts’ as the song goes) I’m not worried about what material was or was not used for the purposes of my question. If one can get a serviceable image using lemon, sweat, blood etc, then why wouldn’t a medieval relic maker have used those mediums? Why complexity when simplicity would suffice? It’s not a question for a scientist, more so a detective, but it’s one that does perplex me..","date":"2015-08-10","mins":"9:56 am","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-208109","author":"david_goulet","post":"It’s all imaginary reconstruction at this point, isn’t it?.","date":"2015-08-12","mins":"8:41 pm","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-210522","author":"david_goulet","post":"This is intriguing on so many levels. We have a second Shroud – a copy – which we cannot discern the image formation mechanism. We do know some minor parts of it are painted. If we discover the image mechanism on the copy, could it be the same mechanism for the original? Could this then suggest that the ‘original’ is itself a copy and that the original was lost at some point? If a man made mechanism was designed in the 1600’s then it most certainly could have been designed in the 1400’s. If I was a non authentist I’d be most excited by the Shroud of Arquata. There’s also the possibility that once the mechanism is discerned for the copy, that we then can cross examine with the TS. If we are able to rule out that it is the same mechanism, this may strengthen the case for authenticity. If I was an authentist I’d be most excited by the Shroud of Arquata..","date":"2015-09-16","mins":"9:07 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","title":"Faint Images:  The Case of the Shroud of Arquata"},{"id":"comment-210867","author":"david_goulet","post":"I’m sorry, but this tangent is becoming more and more incoherent. It is conjecture. There is no way to prove conjecture by simply providing more conjecture. Can we put aside the musings on what the RC hierarchy may or may not be thinking and refocus on the topic of the blog, which is the Shroud and NOT the current state of world religions..","date":"2015-09-21","mins":"9:59 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","title":"Faint Images:  The Case of the Shroud of Arquata"},{"id":"comment-52458","author":"david_goulet","post":"I actually took Dan’s poke as a backhanded compliment with a bit of wink,wink nudge,nudge. A good conspiracy theory (one that has real plausibility) is something to be savored. Mysteries are good for the soul. So come on dear friends,once more into the breach!.","date":"2013-11-22","mins":"9:12 pm","url":"https://shroudstory.com/2013/11/22/first-annual-bertrand-russell-award-in-sindonology/","cat":"image_theory","title":"First Annual Bertrand Russell Award in Sindonology"},{"id":"comment-208762","author":"david_goulet","post":"What are the ramifications of Colin’s assertion? If we are indeed looking in the wrong place how does this affect laser theories, or Maillard, etc?.","date":"2015-08-23","mins":"8:10 am","url":"https://shroudstory.com/2015/08/23/have-we-all-been-looking-in-the-wrong-place/","cat":"image_theory","title":"Have we all been looking in the wrong place?"},{"id":"comment-208772","author":"david_goulet","post":"Some questions just came to mind, Colin. I assume in your theory that the whole linen would have to be heated in the oven at the same time. It’s a very large linen. Did ovens of this size exist in the period? Is there evidence of uneven heating on the linen – which I would expect with a medieval period large oven? What would the back of the linen have rested on during heating to prevent scorching?.","date":"2015-08-23","mins":"9:17 am","url":"https://shroudstory.com/2015/08/23/have-we-all-been-looking-in-the-wrong-place/","cat":"image_theory","title":"Have we all been looking in the wrong place?"},{"id":"comment-164620","author":"david_goulet","post":"Questioning the assumption of someone questioning the assumption….I like that..","date":"2014-10-22","mins":"10:07 am","url":"https://shroudstory.com/2014/10/22/homogeneous-or-not-thats-the-question/","cat":"image_theory","title":"Homogeneous or Not? That’s the Question"},{"id":"comment-158393","author":"david_goulet","post":"Not only are there apricot leaves on the eyelids, if one looks closely enough (you need to have a trained eye for this) you can clearly see the name ‘Del Monte’ on the leaves..","date":"2014-10-01","mins":"2:47 pm","url":"https://shroudstory.com/2014/09/30/inspired-by-colin-berrys-experiments-with-lemons/","cat":"image_theory","title":"Inspired by Colin Berry’s Experiments with Lemons . . ."},{"id":"comment-158413","author":"david_goulet","post":"That’s not avocado, it’s a mango. Did you forget you are looking at a negative fructal image?.","date":"2014-10-01","mins":"3:54 pm","url":"https://shroudstory.com/2014/09/30/inspired-by-colin-berrys-experiments-with-lemons/","cat":"image_theory","title":"Inspired by Colin Berry’s Experiments with Lemons . . ."},{"id":"comment-158418","author":"david_goulet","post":"A hybrid! Good catch, Max!.","date":"2014-10-01","mins":"4:07 pm","url":"https://shroudstory.com/2014/09/30/inspired-by-colin-berrys-experiments-with-lemons/","cat":"image_theory","title":"Inspired by Colin Berry’s Experiments with Lemons . . ."},{"id":"comment-158006","author":"david_goulet","post":"I see apricots on the eyelids. Hard to tell, they may be there or not. :).","date":"2014-09-30","mins":"11:05 am","url":"https://shroudstory.com/2014/09/30/inspired-by-colin-berrys-experiments-with-lemons/","cat":"image_theory","title":"Inspired by Colin Berry’s Experiments with Lemons . . ."},{"id":"comment-158008","author":"david_goulet","post":"Are you suddenly a cryptoarcheoflorist? Those are apricot shoots, common to the Jerusalem Common Market. You also failed to notice the link between an apricot and a nectarine – a clear allusion to the Shroud – ‘necro turino’. This is cryptoarcheoflora 101!.","date":"2014-09-30","mins":"11:19 am","url":"https://shroudstory.com/2014/09/30/inspired-by-colin-berrys-experiments-with-lemons/","cat":"image_theory","title":"Inspired by Colin Berry’s Experiments with Lemons . . ."},{"id":"comment-158027","author":"david_goulet","post":"“The fruit of thy womb”….classic!.","date":"2014-09-30","mins":"1:19 pm","url":"https://shroudstory.com/2014/09/30/inspired-by-colin-berrys-experiments-with-lemons/","cat":"image_theory","title":"Inspired by Colin Berry’s Experiments with Lemons . . ."},{"id":"comment-158013","author":"david_goulet","post":"Apples and oranges!.","date":"2014-09-30","mins":"11:37 am","url":"https://shroudstory.com/2014/09/30/inspired-by-colin-berrys-experiments-with-lemons/","cat":"image_theory","title":"Inspired by Colin Berry’s Experiments with Lemons . . ."},{"id":"comment-87728","author":"david_goulet","post":"Is there anywhere on the Shroud where the image penetrates deeper into the linen than in other spots? Is it not logical to assume that if the image is a man made scorch it would have penetrated deeper in some areas — undetectable at the time but not so today. Are we sure the image is uniform in its depth across the linen?.","date":"2014-03-12","mins":"7:53 am","url":"https://shroudstory.com/2014/03/11/is-time-the-secret-ingredient-we-need-to-consider/","cat":"image_theory","title":"Is Time the Secret Ingredient We Need to Consider?"},{"id":"comment-87811","author":"david_goulet","post":"The only way to move forward, given the lack of new data/tests, is to question and re examine what we already think we know. I don’t expect Colin is going to find conclusive evidence to validate the scorch theory, but his experiments and thought exploration could lead to other insights. He may ‘accidently’ hit upon something revelatory that does move us forward. This is certainly better than standing pat waiting for Turin to allow new tests..","date":"2014-03-12","mins":"12:18 pm","url":"https://shroudstory.com/2014/03/11/is-time-the-secret-ingredient-we-need-to-consider/","cat":"image_theory","title":"Is Time the Secret Ingredient We Need to Consider?"},{"id":"comment-207861","author":"david_goulet","post":"This whole 3 D properties from 2 D images process, did interest in the phenomenon originate with the Shroud? I’m curious as to whether anyone was exploring this prior to the observations made about the Shroud’s 3 D properties. I do find it fascinating how people exploring the icon have discovered things that have application beyond it. Whether the icon is divinely made or divinely inspired, it continues to be a gift to human curiosity..","date":"2015-08-10","mins":"8:29 am","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","title":"It is really, really time to rethink what we think about 3D"},{"id":"comment-51733","author":"david_goulet","post":"I think this is a very good hypothesis. I could see someone wanting to ‘touch up’ the image with a blood stain or two to enhance it for the pilgrims or for personal ego. I recall seeing an interview with Mel Gibson talking about his cameo in the Passion movie. It was his hand portraying the Roman soldier who drives the nail into Jesus’ wrist. He did this as a personal ‘confession’ – showing how he too was a sinner crucifying Christ. Might some holder of the Shroud added his own blood to the Shroud as a pious act? So much has happened to that piece of cloth that we can only try to guess working backwards — it’s a monster of a forensics process..","date":"2013-11-17","mins":"9:44 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51736","author":"david_goulet","post":"A fair point. If a forger came up with the idea of creating a scorch image, it is reasonable to assume that others of his time could deduce it was a scorch once presented with it – especially if it was darker at the time. As you said the average pilgrim might not have had access to it, nor the scientific background. But the clergy would have, so too the the artists who were commissioned to paint icons based on it. That no one until the modern era even referred to it as ‘a scorch like’ image is something to consider..","date":"2013-11-17","mins":"9:54 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51740","author":"david_goulet","post":"Are you saying you don’t think the bloodstains on the Shroud are real? Or just that they did not come from the body itself? Just trying to clarify as this potasium discussion is way over my head..","date":"2013-11-17","mins":"10:05 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51742","author":"david_goulet","post":"Hugh, same question I asked Colin above. Are you suggesting that the bloodstains are not blood, or rather that they could not have come from the corpse itself?.","date":"2013-11-17","mins":"10:15 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51745","author":"david_goulet","post":"Would you say that the leech theory is, currently, the only theory that is plausible – if the Shroud is a forgery?.","date":"2013-11-17","mins":"10:30 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51747","author":"david_goulet","post":"Do you concur with Colin’s leech hypothesis? If it’s not blood, then what other possibility is there?.","date":"2013-11-17","mins":"10:32 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51433","author":"david_goulet","post":"So does this experiment leave us with this rather interesting conclusion: the Shroud image was created by a scorch? What then is the source of the scorching – what types of heat can produce this scorch? Which ones can be eliminated – for example, could electricity running through a corpse produce such a scorch? Just trying to summarize for myself what we can take away from this experiment..","date":"2013-11-15","mins":"9:09 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51775","author":"david_goulet","post":"So if its not blood, what is it? If the Shroud is authentic I can see why there might be problems with finding all the typical forensic blood factors — i.e. Age of the blood, we don’t know what the Shroud has been exposed to in those undocumented periods and how this might have affected the blood, as we do not know the image formation process we do not know if that process affected the blood. Also how many people have had access to the blood samples from the Shroud? Were those blood samples all taken from one spot or from multiple spots? Are we relying simply on too few studies that may have missed something? Is Adler’s work definitive? If the Shroud is a forgery why have we not been able to have more clarity on what the blood consists of. Colin’s leech theory appears to the only current theory that has a ghost of a chance of meeting the parameters and it has some obvious challenges. And, Kelly, there’s nothing absurd in trying to find literature that touches on the subject. It’s where I’d start too, before heading for the final frontier and planting a Federation flag on a planet — only to discover that the Klingons had been there last week..","date":"2013-11-17","mins":"2:49 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51839","author":"david_goulet","post":"I’m still stumped on this blood debate. If it is not blood, what is it? Colin, didn’t you come to your leech theory because you deduced that the stains were blood (as opposed to paint or other matter) — and you needed to explain how that blood got onto the linen? The leeches provided the blood, albeit a ‘processed’ blood that more closely fit the parameters. Is there at least agreement that the stains are human (primate) blood? But we just aren’t certain if it got there on its own or with someone else’s help..","date":"2013-11-17","mins":"10:53 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51473","author":"david_goulet","post":"I feel what the crucifix scorch experiment showed, as Hugh pointed out as well, is that you can replicate some of the more interesting/unique properties of the Shroud – i.e. The 3 D properties, the photo negative. This neither proves nor disproves authenticity. What it does prove is that what we have long be told are properties ‘unique to the Shroud’ are not necessarily so. No one had bothered to question these assumptions until Colin’s simple experiments with some modern tools we all now have access too. Hats off to him for taking that intiative. Don’t shoot the messenger..","date":"2013-11-15","mins":"12:36 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51480","author":"david_goulet","post":"Anonymous :Regarding the uniqueness of the Shroud, you must look at the whole picture David, which include the blood and serum stains (most of them coming from exudates of highly traumatized blood). It’s only when you consider the presence of the Shroud body image AND the blood and serum stains together on one single piece of cloth that was certainly used at one point in its history to covered the dead body of a crucified man that it’s alright to say that the Shroud is unique in the world… Always keep in mind this advice: Always remember the whole picture given by all the data when you analyze one specific property of the Shroud… It’s very important to do so. I agree Phantom. I am not convinced of the scorch forgery theory because of the overall picture. But some sites, not this one, do claim that the Shroud must be authentic because of the 3 D properties or the photo negative image. They claim there’s no other such example in the world. Well that was true because no one had tried (and the technology was not previously accessible to the average person). It’s not quite true now. I also agree that can not be used as a proof of Resurrection. The Shroud, to me, has always been a sign. Signs are not proofs..","date":"2013-11-15","mins":"1:09 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51483","author":"david_goulet","post":"Hugh Farey :You see, I’m one of those “true scientists” you keep going on about, and unlike those who feel that science’s job is to add a veneer of logic to blind faith, “true scientists”, such as St Augustine of Hippo, St Thomas Aquinas and the late Pope Benedict XVI, believe that the truth is revealed by reason, not the other way round. Pope Emeritus Benedict is still alive, isn’t he?.","date":"2013-11-15","mins":"1:16 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51546","author":"david_goulet","post":"I notice that with most of the modern experiments the first scorch attempt is too hot and the image is very dark. I think we underestimate how hot the metal gets. But this darker scorch is actually a better image if your goal is a clear image of a dead Christ. I would think a forger would prefer a darker scorch for this reason. As you note, he isn’t working backwards, trying to match the image to meet some unknown (to him) effects. He’d already be working in a novel medium and a faint scorch would be less impressive than a darker, clear one to his intended audience. But I’m not a medieval artist so what do I know..","date":"2013-11-15","mins":"11:06 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51656","author":"david_goulet","post":"Why wouldn’t pilgrims be fooled by a scorch? It was not a known method of image creation at that time was it? This is why I’d have thought a darker scorch would have been preferred by a forger — why create such a light scorch that would be difficult for people to see?.","date":"2013-11-16","mins":"6:20 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51663","author":"david_goulet","post":"Colinsberry : Quite. Why has the term “scorch” become a pejorative one, given it makes no assumptions about mechanism? Maybe Tjhibault’s objection is aimed solely at contact scorches, with zero air gap. If so, he should say so, and bring the generic term “scorch” back in from the cold. Agreed. Even Prof Fanti’s corolla discharge theory is a ‘scorch’ theory. Is it a heated metal scorch, a bio chemical scorch, bio electrical, radiation,etc? Mattingly’s theory is the only other theory I find plausible that isn’t a scorch theory. I’d also say that if the Shroud is a forgery I don’t see how it could be anything but a scorch..","date":"2013-11-16","mins":"7:45 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51678","author":"david_goulet","post":"A biochemical scorch would not require a high energy discharge. I’ve read the rebuttals to the scorch theory and I agree there are significant problems with it. All I was suggesting above is that if the Shroud is authentic there could be a range of possible causes for the image formation. However if it’s a forgery the image formation is likely a scorch – because all other known alternatives have been eliminated while this one alone remains plausible. You don’t have to repeat the blood issues for my benefit. I’ve read your paper. And the others it was based on. You may feel Colin’s scorch experiment was a waste of time. But he did demonstrate that the 3d properties, the photo negative attributes, can be replicated. The ease with which he did it was thanks to dogged curiosity and modern technical tools the STURP era team could only dream of. He dispelled the long held perception that the Shroud alone could have these properties (and thus MUST be authentic). There may be other properties that still remain unique. But if Colin had listened to you and not bothered with his experiment, we’d have one less new observation about the Shroud to consider. Feel free to keep reminding me about those bloodstains and I’ll keep reminding you that insights can always be found where we least expect them..","date":"2013-11-16","mins":"11:22 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51680","author":"david_goulet","post":"Very well could be. A biochemical ‘scorch’ could be such a thing. I’m thinking of something like the effect poison ivy has on our skin. In a sense the ivy ‘scorches’ us — in a natural and mild way (compared to sulfuric acid or liquid nitrogen). Could the cocktail of spices, aloes, putrific gases acted liked poison ivy on the linen? It’s a poor example, as I’m no scientist but you get the idea. I do favour a natural image formation theory — but there’s more than one on the table..","date":"2013-11-16","mins":"11:31 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51739","author":"david_goulet","post":"Thanks Matthias. I am a Christian (Catholic). I do not rule out a supernatural theory, it’s just that it’s hard to explore supernatural theories, so I tend to start with the natural. I agree with your post below that a supernatural event could trigger natural effects. I also like the theory that the Shroud image is the product of a series of natural factors that all lined up just right to produce the image — that serendipity being the ‘miracle’..","date":"2013-11-17","mins":"10:01 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-50045","author":"david_goulet","post":"And burnt Templars and leeches aren’t wacky? Give your head a shake, man. Your theories are as bonkers as anyone’s as you try to fit the evidence to meet your narrative. But keep them coming one and all. Insights always come from unexpected places — the scientist who denies that is no scientist, but merely a computer..","date":"2013-11-05","mins":"11:03 am","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","title":"Mario Latendresse’s take on the 3D data"},{"id":"comment-208246","author":"david_goulet","post":"“Speculation too far…” and then some. The lightening part is interesting, but the whole ‘this would discount the Gospels’ musing is off the rails..","date":"2015-08-14","mins":"8:27 am","url":"https://shroudstory.com/2015/08/14/lightening-striking-the-other-crucified-person-in-his-shroud/","cat":"image_theory","title":"Lightening Striking the Other Crucified Person in His Shroud"},{"id":"comment-50052","author":"david_goulet","post":"Perhaps wacky is a poor choice of words but it’s one you like throw around. Your theory is outside the box. There’s no history of leech art, is there? You had an inspiration, a creative inspiration. That’s great. And it fit the narrative you had of a medieval forgery. You use science terms like ‘hypothesis’ and ‘research’ and ‘logic’. Different words for “I have a hunch and I bet there’s proof I’m right”. I’d hazard a guess that most people here find you a bit prickly and arrogant. A bit of a thorn in the side. But that’s exactly what is needed, someone who forces everyone to raise their game. Your personal crusade to hold Shroud science to a higher bar is necessary. So if Pope Francis ever gives access to the Shroud for new science, I’ve love to have you there. That’s how wacky I am..","date":"2013-11-05","mins":"11:50 am","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","title":"Mario Latendresse’s take on the 3D data"},{"id":"comment-50076","author":"david_goulet","post":"You need to read more Sir Arthur Conan Doyle. “Eliminate all other factors, and the one which remains must be the truth.” It’s what lead you to the leeches and scorched Templar theory, not Occam’s Razor. Love the ‘despite of evidence’ line too. I’d accept ‘lack of evidence’ because it actually applies — both ways. Or you could substitute ’14th century’ for ‘1st’ and it would apply just as truly..","date":"2013-11-05","mins":"3:22 pm","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","title":"Mario Latendresse’s take on the 3D data"},{"id":"comment-50079","author":"david_goulet","post":"Sometimes thorns need thorns of their own. I’ll defer to your wife on Sherlock. Sadly I’m more up on the silver screen Holmes than the books..","date":"2013-11-05","mins":"3:35 pm","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","title":"Mario Latendresse’s take on the 3D data"},{"id":"comment-50080","author":"david_goulet","post":"Not wanting to be accused of mangling a literary great I checked for a more definitive version of the Doyle quote and found this (in context): “You will not apply my precept,” he said, shaking his head. “How often have I said to you that when you have eliminated the impossible, whatever remains, however improbable, must be the truth? We know that he did not come through the door, the window, or the chimney. We also know that he could not have been concealed in the room, as there is no concealment possible. When, then, did he come?” The Sign of the Four, ch. 6 (1890) Sherlock Holmes in The Sign of the Four (Doubleday p. 111).","date":"2013-11-05","mins":"3:56 pm","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","title":"Mario Latendresse’s take on the 3D data"},{"id":"comment-50084","author":"david_goulet","post":"My literary pretensions came from the internet. I couldn’t recall the exact quote and hit upon the first one. I’m grateful for your wife’s correction, which is why I re posted. The corrected quote is actually more appropriate to your medieval theories. You eliminated the impossible (a miraculous image process) and came up with others that, while improbable, your logic deems as truth. It was not Occam’s Razor but Sherlock’s Razor that you followed. Too late to marry a woman better read than myself, but my wife informs me that she’s grateful that she married a man more gracious than the one your wife married..","date":"2013-11-05","mins":"4:31 pm","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","title":"Mario Latendresse’s take on the 3D data"},{"id":"comment-50073","author":"david_goulet","post":"Prove to me Occam’s Razor is valid. This is the equivalent in science of a Bigfoot sighting…or an authentic 1st century Shroud – lot’s of circumstantial evidence but no real proof..","date":"2013-11-05","mins":"2:23 pm","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","title":"Mario Latendresse’s take on the 3D data"},{"id":"comment-133101","author":"david_goulet","post":"Here’s the problem with de Wesselow’s theory — and other theories that propose that the Shroud (being an accidental image) inspired the birth of Christianity — it overstates the impact of the relic. As Yannick and others have repeatedly pointed out the Shroud depicts the dead body of Jesus — not a resurrected one. If I’m Peter or John and I see the Shroud I’d certainly believe that it was a sign that Jesus was special. But would it alone be enough for all 11 of them, and the women, to do a 180 degree in their beliefs? Would it have inspired a deep belief in resurrection into new glorified bodies? If the Shroud is the model, then why in the ‘stories’ of encounters with the risen Jesus is He not recognizable at first sight? Where did this idea come from that Jesus looked differently? He certainly looks like himself on the Shroud, no? Would seeing the Shroud alone have been enough to change Saul into Paul? If the early Christ follower community’s raison d’etre relied solely on the Shroud as their proof of resurrection than the Shroud would have played a much greater part in the story. We wouldn’t be searching the scriptures and apocryphal texts for hints of the Shroud. It would have been spoken of clearly, even if the relic itself needed to be hidden. Do we imagine that there were no skeptics among the disciples? That faced with the Shroud no one would have claimed (as we do today) “that’s a drawing, a painting, a work of art — it’s not real!”. Certainly our modern sensibilities are not identical to those of the 1st century. But we are not so different than those men and women. The Shroud today, while compelling, has not transformed the world — moved masses of people to great acts of piety and faith. It’s inspired no martyrs (to my knowledge). I doubt it would have done so 2000 years ago either. It has always been a sign, not a proof..","date":"2014-06-27","mins":"9:28 am","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","title":"Maybe a New Image Hypothesis?"},{"id":"comment-131685","author":"david_goulet","post":"You and Colin are on the same page at last! The only difference is you’re working from the assumption that the limestone was circa 1st century while he is is assuming it’s medieval. You do have a slight advantage in that you can provide a practical application of the lime (topical embalming). The medieval theory needs stronger evidence as to how it was that lime (while available) would be used for this purpose. Either way it’s interesting that this can be commonly investigated and should be. Dare we hope for a joint paper from Hamon and Berry? :).","date":"2014-06-20","mins":"9:23 am","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","title":"Maybe a New Image Hypothesis?"},{"id":"comment-131711","author":"david_goulet","post":"It was a ‘bridge too far’. We knew it would be. Cryptoarcheologists and chemical scientists are the Hatfields and the Mc Coys of academia. ;).","date":"2014-06-20","mins":"11:36 am","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","title":"Maybe a New Image Hypothesis?"},{"id":"comment-6218","author":"david_goulet","post":"Cheeky ending. 🙂.","date":"2015-08-28","mins":"3:45 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/08/28/might-flour-power-have-been-used-create-the-enigmatic-shroud-of-turin-body-image-a-retired-fmbra-flour-scientist-says/","cat":"contact_imprint","title":"Might flour-power have been used create the enigmatic “Shroud” of Turin body image? A retired  FMBRA flour scientist says …"},{"id":"comment-197746","author":"david_goulet","post":"I’ve asked this question in the past too. There is one possible answer if one is speaking of a stretcher cloth (vs a burial cloth). It is more difficult to carry a body stretcher like if the cloth is folded across the body side to side. Much easier if the linen is stretched head to foot as each bearer (assuming at least four – one on each corner) now has a similar type of seam to grip. If you go side to side, one set of bearers has no easy seam to grip. The corpse’s weight will be easier to distribute evenly with a head to toe model..","date":"2015-04-27","mins":"11:00 am","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","title":"Might tactile chemography prove to be the super-model?"},{"id":"comment-197753","author":"david_goulet","post":"Fair point, Max..","date":"2015-04-27","mins":"11:45 am","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","title":"Might tactile chemography prove to be the super-model?"},{"id":"comment-197752","author":"david_goulet","post":"You know, I’m not sure myself anymore. :).","date":"2015-04-27","mins":"11:44 am","url":"https://shroudstory.com/2015/04/26/might-tactile-chemography-prove-to-be-the-super-model/","cat":"image_theory","title":"Might tactile chemography prove to be the super-model?"},{"id":"comment-6963","author":"david_goulet","post":"Why not submit a paper to a science journal, or at least an article to a skeptic site which might then draw more attention to your work and the ongoing blog. I know your current model is a work in progress but even if you submitted what you’ve got thus far it would be very valuable. What you really need is a to have a cub reporter find your work — who then goes back to the publisher exclaiming ‘Here’s our Easter article, this gent has a fascinating theory that explains how and why the Turin Shroud was made!” Stop the presses! It’s that time of year…they’re looking..","date":"2016-02-12","mins":"5:48 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/25/modelling-the-shroud-of-turin-with-white-flour-olive-oil-and-a-real-face-in-pictures/","cat":"turin_shroud","title":"Modelling the Shroud of Turin with white flour, olive oil and a real face – in pictures."},{"id":"comment-6940","author":"david_goulet","post":"Good to see you are carrying on your always intriguing work, Colin. As I reflect on your flour, oil and baking method, I can’t help but be struck by the parallel to the subject of the piece — who himself said ‘I am the bread of life.” Perhaps there is a clue in that. 🙂.","date":"2016-02-06","mins":"1:04 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/25/modelling-the-shroud-of-turin-with-white-flour-olive-oil-and-a-real-face-in-pictures/","cat":"turin_shroud","title":"Modelling the Shroud of Turin with white flour, olive oil and a real face – in pictures."},{"id":"comment-6945","author":"david_goulet","post":"Good question. I’m not sure b) would be my first choice though it does have its merits (as you are demonstrating). I likely would have chosen something that approximates sweat and blood but that required less recipe juggling — like lemon juice or some matter of dye. I would then have used solar radiation to bring out the image and give it an aged look. We know this wasn’t the method because of what science we do have on the Shroud — but these to me would be the intuitive methods as they drew on existing imaging methods. Now you could righty argue that the cleric had to come up with something unique, a novel method, otherwise some keen eyed medieval sciencebod would have exposed (or replicated) the method. Your current theory is easily your strongest. You’ve got a logical motivation for using the method, the resources needed would be easily accessible, and you’ve replicated the model and gotten characteristics close to the Shroud — as mentioned by another commenter above, you may be the closest yet of all the attempts made by a pro medieval proponent. No small feat..","date":"2016-02-07","mins":"1:23 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/25/modelling-the-shroud-of-turin-with-white-flour-olive-oil-and-a-real-face-in-pictures/","cat":"turin_shroud","title":"Modelling the Shroud of Turin with white flour, olive oil and a real face – in pictures."},{"id":"comment-37632","author":"david_goulet","post":"I’d love to see Dan in 3 D, please do..","date":"2013-06-21","mins":"2:19 pm","url":"https://shroudstory.com/2013/06/21/nice-3d-image/","cat":"image_theory","title":"Nice 3D Image"},{"id":"comment-37652","author":"david_goulet","post":"Cardinal Spaghettini was made papal nuncio to Malta last month – it was in all the papers. Besides Dan’s got a bigger budget than the Vatican these days..","date":"2013-06-21","mins":"3:35 pm","url":"https://shroudstory.com/2013/06/21/nice-3d-image/","cat":"image_theory","title":"Nice 3D Image"},{"id":"comment-138970","author":"david_goulet","post":"“But a contact scorch from a heated template is an ‘impactograph’. The only reason I used my own hand, coated with Nutella, is because I couldn’t find a bronze replica of it in the garage, so had to settle for second best.” I thought you had buns of steel! ;) Thanks for the clarification though..","date":"2014-07-17","mins":"3:37 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?"},{"id":"comment-138958","author":"david_goulet","post":"What does your impact print look like under a microscope? Is it easy to discern the material used for the imprinting? I assume traces of hazelnut goodness will reside in your test linen. Assuming a medieval artisan didn’t have access to Nutella (his loss) what material might he have used and why has it escaped detection?.","date":"2014-07-17","mins":"2:20 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?"},{"id":"comment-138963","author":"david_goulet","post":"The problem I have with the medieval impactogram theory is that it is too simple. The bas relief scorch theory at least had a high level of complexity (specialized statues, master metal workers and a conspiracy of Templars involved). It was so complex it helped explain why there might be only one Shroud. But this current theory appears to be something within the realm of anyone (with some resources) to replicate. Why then only one? I actually like the impactogram theory because it does answer some questions about the image. My thoughts are crystallizing too but on a natural (not man made) impactogram image..","date":"2014-07-17","mins":"2:54 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?"},{"id":"comment-138962","author":"david_goulet","post":"What we seem to be dealing with this theory, to use older terminology, is a stamp. The image is a stamp created by contact between linen and some material placed over a corpse or statue. Stamps often leave behind uneven images as the Nutella hand experiment demonstrates. Colin’s experiment supposes a stickier medium than previous suggestions of ochre or other powdery substances. My question is: whatever the medium there must be some residue, however faint or miniscule, left on the linen, so how did STURP (or others) miss it? And again, as with the scorch theory, do we have evidence of this method being used elsewhere around the medieval era? Just because something is possible doesn’t mean it is probable..","date":"2014-07-17","mins":"2:38 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?"},{"id":"comment-89300","author":"david_goulet","post":"When you say “to convincingly demonstrate what he can see is really there and what he cannot is really not there” — to whom is this demonstrated? Oneself? Others? And sorry, Dan, to encourage the sidetrack but trying to follow Max’s thread is akin to Sudoku. Keeps the mind sharp. :).","date":"2014-03-15","mins":"3:14 pm","url":"https://shroudstory.com/2014/03/15/of-pixels-spectrum-and-density/","cat":"image_theory","title":"Of Pixels, Spectrum and Density"},{"id":"comment-89236","author":"david_goulet","post":"How does one become ‘qualified’ – who provides the qualification – for this kind of observation?.","date":"2014-03-15","mins":"11:42 am","url":"https://shroudstory.com/2014/03/15/of-pixels-spectrum-and-density/","cat":"image_theory","title":"Of Pixels, Spectrum and Density"},{"id":"comment-49452","author":"david_goulet","post":"Colinsberry : I think we all agree that the Shroud is a one off, David, but that should not prevent us from speculating as to how the image was formed, either in a 1st century tomb or a 14th.century workshop. If the latter, then it could have been made by thermal imprinting from some kind of hot solid template (or powder frottage as per Luigi Garlaschelli). Selective pigmentation at the nodes fits the later model, and so far I’m merely content to refer to ‘consistency’. You may need to wait longer for proof (possibly not my lifetime!). I’ve posted the first of the promised Mark Evans enlargements to my own site. Agreed. But precision in wording is as important as in experimentation. ;).","date":"2013-11-01","mins":"11:07 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49454","author":"david_goulet","post":"Anonymous : Instead of seriously considering Colin’s fantasy David, I think it would be much better for your understanding of the Shroud’s REALITY to focus on the very important conclusions of the experts named Adler and Rogers The wise man has more to learn from the fool than the fool from the wise man. Now I’m not saying Colin is a fool, nor you. Nor am I a wise man. But the heart of this saying is that the wise man can learn even from something that on the surface seems ‘fantasy’. Why, because the wise man has the ability to discern, to put things in perspective and context. He finds nuggets of Truth amongst a load of B.S. Here’s a thought experiment, if Rogers (or others of these scientists) was still alive and reading this blog, do you think he would discount Colin’s experiments or theories? Or would he take up the challenge, go back to his instruments to see if Colin was right or if he was talking through his rear end? I believe Rogers would have taken up the challenge as he did with the invisible weave theory – which also must have sounded like fantasy. With an enigma like the Shroud nothing should be thrown off the table. Nothing! That is bad science and it is even worse theology..","date":"2013-11-01","mins":"11:20 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49455","author":"david_goulet","post":"True. Charges dismissed. :).","date":"2013-11-01","mins":"11:21 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49473","author":"david_goulet","post":"I’ve read those papers/comments before. They are excellent. I assume Colin has too. But what I was supposing was if someone challenged Roger’s conclusions, introducing a new theory with some experimentation behind it (like Colin’s recent one) I don’t believe Rogers would have dismissed it out of hand. He would have looked at its merits and if he felt it might have some validity he would have investigated further. I think this because I believe Rogers was a sincere scientist. For the record, I’m not convinced by the scorch theory. But there’s been many things in my life I was initially unconvinced by, only to be later surprised. I am more cautious now where I place my exclamation points. Something the 1988 C 14 team might also feel today?.","date":"2013-11-01","mins":"4:24 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49223","author":"david_goulet","post":"Nice to see you back, Yannick. Or someone who sounds and thinks a lot like Yannick. ;).","date":"2013-10-30","mins":"1:37 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49242","author":"david_goulet","post":"There’s a difference between Quebec French and France French, says the guy with the French last name who cannot speak either. :( Malheursement..","date":"2013-10-30","mins":"3:09 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49305","author":"david_goulet","post":"Gr.12 chemist here. Can you explain in layman’s terms why this eureka makes you so excited? I’d like to be excited too..","date":"2013-10-31","mins":"7:28 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49349","author":"david_goulet","post":"Hugh Farey : All right, all right. For what it’s worth I think most of the chemical tests do suggest the blood is, in fact, blood. I don’t think the evidence about the sort of blood is conclusive, and it is not obvious that it leaked from a dead body, but it does seem to be, mostly, blood. I believe Colin would concur with that (he’ll correct me if I’m wrong), which is why he came up with the leech theory. The weight of evidence suggests blood, blood, blood. The question is what is the source of the blood? The weight of evidence is less discernible here..","date":"2013-10-31","mins":"2:54 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49363","author":"david_goulet","post":"It’s important to keep one thing in mind, Phantom, and that an earmark of scientific proof is that the results can be replicated. I could come out tomorrow and deny Newton’s theories about gravity but some quick repeats of various experiments would squash my doubts. The problem with the Shroud is that we have very limited experimental evidence, done by a relative handful of scientists. This Shroud is not as accessible as gravity. If Colin, or anyone else, wants to doubt the scientists you mentioned that is his prerogative. We can’t claim those earlier experiments/observations were definitive because not everyone has access to the same materials to repeat the experiments. Fresh data would certainly help. As long as the evidence has not completely ruled out the forgery theory, Colin is doing science (and us) a favour by following that line of reason. It either opens up new insights, or closes off dead ends. You may think it is a complete waste of time but it is his time to waste..","date":"2013-10-31","mins":"4:38 pm","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49440","author":"david_goulet","post":"I was about to launch into a rant of my own here asking why there has to be so much animosity in these posts. But then I was struck by a passage from Scripture “So, because you are lukewarm, and neither hot nor cold, I will spit you out of my mouth.” There is fire and ice here because the Shroud (and what it means for science, Christianity, history, etc) matters deeply to us for our own reasons. Though I wish there was bit more respect on display, it is indeed good to see that this is not a lukewarm forum..","date":"2013-11-01","mins":"9:44 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-49445","author":"david_goulet","post":"“and thus consistent with medieval fabrication” — should edit this to say ‘and thus is consistent with medieval technology’. How can it be consistent with medieval fabrication if we do not have other examples of such fabrication?.","date":"2013-11-01","mins":"10:34 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-74378","author":"david_goulet","post":"At least this experiment accounts for the missing thumbs. If you had a GI Joe with ‘kung fu grip’ you’ll know that the first thing to break off that hands were the thumbs! Jesus must have had ‘kung fu grip’..","date":"2014-01-24","mins":"9:18 am","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-74382","author":"david_goulet","post":"This experiment, and others, lead me to a question about the Shroud. Why was the linen folded over the body at the head and not by the side of the body? It seems a less efficient way to wrap a body than via a side fold. I know of no hospital or morgue that would think to fold a death sheet in such a way. I recall someone here speaking of how Jewish burial shrouds were often altar cloths… do I recall that correctly? That would explain why the sheet was longer than it was wide and would necessitate such an odd fold. Which brings me back to a comment that Daveb shared that if the Shroud is a medieval creation why would the artisan not have used a side fold — the most common way to cover a body? How would the artisan have known of Jewish burial customs? Perhaps a future GI Joe experiment, or bas belief crucifix, could try using a side fold to see if that would make any measurable difference to the image..","date":"2014-01-24","mins":"9:29 am","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-74605","author":"david_goulet","post":"Colinsberry : Science is about moving from the known to the unknown – and is not for the faint hearted. Substitute ‘science’ with the word ‘life’ and it’s doubly true..","date":"2014-01-25","mins":"9:07 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-75085","author":"david_goulet","post":"Anon, your criticism of Colin is way over the top. He is working with a hypothesis — what you call a preconceived notion — formed by his observations of the Shroud. Following his hypothesis has proven fruitful in his debunking some of the assumptions about the Shroud, i.e. 3 D imaging being totally unique. As Hugh has noted, there are indeed still serious challenges to Colin’s hypothesis. You are right to question his hypothesis, that’s good science. But when he takes the time and effort to respond with a sincere reply, then have the common courtesy to say ‘thank you but I do not agree’. You can call his hypothesis b.s. All you want in the privacy of your home. This thread was actually quite interesting until you decided to storm out and take your ball with you..","date":"2014-01-29","mins":"1:43 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-75166","author":"david_goulet","post":"I think it’s also helpful to qualify what is meant by ‘scorch’. Man made vs. Natural (as in a bio chemical). There was an exchange previously with Yannick, er, the Phantom, and there was some agreement that the image could be a natural scorch created by some yet unidentified bio chemical reaction, i.e. A Maillard type reaction. Scorch is a word with many applications and STURP was obviously aware of this..","date":"2014-01-30","mins":"11:09 am","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-75179","author":"david_goulet","post":"Anonymous :David, a Maillard reaction is not the same as a scorch. Scorch involve important quantity of heat. Maillard reactions are happening at NORMAL TEMPERATURE. Don’t mix apples and oranges. When I reject any scorch hypothesis, I reject any idea that the image could have been formed by an energetic radiation like heat, no matter from what source this supposed heat could come from. I’ll defer to your better understanding on the Maillard process. But you prove my point about terminology. You understand a scorch as radiative heat. But a bio chemical scorch would be more like a scorch caused by acid – which occur at normal temperatures. STURP saw no evidence of a man made scorch, as you pointed out above. What they could not rule out is a natural scorch caused by an unidentified cocktail of bio chemical factors. This doesn’t mean they think that’s what it was, but that based on the image’s properties this cannot be ruled out. We can’t talk about apples and oranges until we decide what a fruit is..","date":"2014-01-30","mins":"2:03 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-76103","author":"david_goulet","post":"If I may translate: Anon is saying that if you consider the existing data (without a jaundiced eye skeptic’s eye nor the eye of an authentist prone to science fiction) then the odds are in the favour of a natural image formation. Your rebuttal above still applies. The existing data is far from conclusive and the minute you stop questioning your assumptions you miss the opportunity for fresh insights..","date":"2014-02-02","mins":"11:19 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-170878","author":"david_goulet","post":"As much as I dislike Anoxie’s caustic style, s/he has a point. Colin, you’ve been pretty dismissive in the past about STURP’s roster. I asked you once to name any Shroud researcher you respected (including STURP) — you replied there wasn’t one (you were just being honest). The best you could say previously about Ray Rogers was that perhaps he’d been duped by others and had studied a false sample. Lately you seem to have found a new appreciation for at least some of the STURP research. I don’t mind you tearing a strip off Charles for writing off STURP, but the optics might be better if you acknowledged that you’ve had a change of mind about STURP — that your writing off of their work was premature. Fair is fair..","date":"2014-11-12","mins":"2:24 pm","url":"https://shroudstory.com/2014/11/12/real-1st-century-or-simulated-14th-century-sweat-imprint/","cat":"image_theory","title":"Real 1st century or simulated 14th century sweat imprint?"},{"id":"comment-170895","author":"david_goulet","post":"Nicely done, Chris B. :).","date":"2014-11-12","mins":"3:49 pm","url":"https://shroudstory.com/2014/11/12/real-1st-century-or-simulated-14th-century-sweat-imprint/","cat":"image_theory","title":"Real 1st century or simulated 14th century sweat imprint?"},{"id":"comment-170902","author":"david_goulet","post":"Exploring gluten intolerance sounds intriguing. And as you don’t have to wait for Turin to proceed with the real science, probably less frustrating. Carry on, sir..","date":"2014-11-12","mins":"4:24 pm","url":"https://shroudstory.com/2014/11/12/real-1st-century-or-simulated-14th-century-sweat-imprint/","cat":"image_theory","title":"Real 1st century or simulated 14th century sweat imprint?"},{"id":"comment-131245","author":"david_goulet","post":"Science debate newbie here, but why are pdf’s so imposing? Is it simply a copy and paste challenge?.","date":"2014-06-19","mins":"9:51 am","url":"https://shroudstory.com/2014/06/19/revisiting-the-turin-shroud-image-is-not-a-scorch/","cat":"image_theory","title":"Revisiting:  The Turin Shroud Image is not a Scorch"},{"id":"comment-131279","author":"david_goulet","post":"I think Colin’s suggestion for a corresponding posting for comments is a good one. I have no problem with pdf’s because they are critical in protecting the integrity of written work in digital media. I say this as a writer (non science). But in this context it is only fair to ensure proper discussion can occur re: the contents of the ‘impenetrable’ pdf..","date":"2014-06-19","mins":"10:57 am","url":"https://shroudstory.com/2014/06/19/revisiting-the-turin-shroud-image-is-not-a-scorch/","cat":"image_theory","title":"Revisiting:  The Turin Shroud Image is not a Scorch"},{"id":"comment-52753","author":"david_goulet","post":"Why do you say ‘none of the above’ rather than ‘one of the above’ or ‘all of the above’? Because if you phrase the question thus: which of these formation theories can we completely rule out? Now the answer could be “none of the above”. I see know why Colin was pressing hard for new C14 tests. At least if we can get a definitive date on the linen – one way or the other – it might cut the possible theories in half..","date":"2013-11-25","mins":"8:24 am","url":"https://shroudstory.com/2013/11/25/running-out-of-options/","cat":"image_theory","title":"Running out of options?"},{"id":"comment-144748","author":"david_goulet","post":"No doubt some reasoning is inept (blinded by confirmation bias for example) but some of the reasoning I’ve seen on display here is anything but inept. Doesn’t mean it’s accurate (we can’t know for sure) but it’s not inept. As for believing in Jesus resurrection – greater minds than you and I have believed in it so I don’t think taking it under consideration (vis a vis the Shroud) is watering the wine. More like sniffing the cork..","date":"2014-08-19","mins":"9:27 am","url":"https://shroudstory.com/2014/08/17/scorched-by-god-a-hymn-for-this-sunday/","cat":"image_theory","title":"Scorched by God? A Hymn for this Sunday."},{"id":"comment-86934","author":"david_goulet","post":"Just wanted to add kudos to Colin too. His experiments are, whether you agree with his conclusions, brilliant stuff. And they are triggering excellent discussions. Whether he’s your favourite person or not you have to admit he’s advancing Shroud knowledge and the value of kitchen science. His site does deserve more google traffic..","date":"2014-03-10","mins":"9:54 am","url":"https://shroudstory.com/2014/03/09/scorching-onion-skins/","cat":"image_theory","title":"Scorching Onion Skins"},{"id":"comment-157738","author":"david_goulet","post":"I like this avenue of thought very much. I wonder if the human body might excrete a bodily fluid that mimics ‘invisible ink’ (i.e. Lemon juice). Might a crucified victim’s sweat have been naturally altered somehow to become more acidic? If a person can sweat blood (a medically documented phenomenon) what other unusual sweats might occur? Or did the sour wine mix with the sweat on the body (or after being consumed). And what then was the heat source that carbonizes the image? Light? Radiation? What if, as has been speculated before, the linen contained no discernible image at first (but was still kept because of the blood stains). Then the linen was held close to lamps or candles to be shown and the heat carbonized the image. This might have occurred months, perhaps years, later. These are authentist avenues, of course Colin will be more interested in the artisan avenues. Either way it’s a fascinating path to tread..","date":"2014-09-29","mins":"2:11 pm","url":"https://shroudstory.com/2014/09/29/secret-image-made-with-invisible-ink/","cat":"image_theory","title":"Secret Image Made With Invisible Ink"},{"id":"comment-158021","author":"david_goulet","post":"A very valid point..","date":"2014-09-30","mins":"12:44 pm","url":"https://shroudstory.com/2014/09/29/secret-image-made-with-invisible-ink/","cat":"image_theory","title":"Secret Image Made With Invisible Ink"},{"id":"comment-49813","author":"david_goulet","post":"Agreed. That’s why I’m interested in seeing other examples of scorched facial portraits with which to compare 3 D properties. Nothing philosophical about that. And it’s theologians who debate the angels dancing, philosophers tend to stick to questions like ‘how do we know the pin is even there?’.","date":"2013-11-03","mins":"8:55 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-49797","author":"david_goulet","post":"Colinsberry : I could do that David, once I’ve searched my own cobweb festooned archive. Better still – do it for yourself. Get a piece of metal or brass that has some rounded contours to it – even a coin would do or better still a medal or medallion (I used to know the difference). Heat it on a cooker ring until it scorches a test scrap of fabric. Then press against cloth, preferably linen or cotton to get a scorch. Take a photograph on your digital camera or phone. Then download Image J onto your laptop. I’ll tell you which keys to press, but it’s basically about entering into its 3 D enhancement program. See it with your own eyes. Thermal imprints from 3 D or flattened semi 3 D (bas relief) templates, aka cattle brands, respond magnificently to 3 D programs – but so they should, since scorch intensity is in proportion to 3 D relief. If it’s raised, it leaves a good imprint. If it’s lower down in the relief, less raised, it does not. Yes, I could give links to my own postings, but it’s better that folks find these things out for themselves.Then they realize it’s not trickery – just a reading of image density as height above a base plane. I don’t know that I’d know how to brand something as fine as the micron level. But surely you’re not the only person to have experimented or used scorches to create portraits of people. Would there be other existing examples out there to draw from? I’m more philosopher than backyard scientist, I can cook alright — just not Templars. ;)..","date":"2013-11-03","mins":"4:09 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-49823","author":"david_goulet","post":"The scorch technique seems such a promising theory in this experiment. Have you attempted it with a deeper face? Are there medieval examples of this type of imaging (even simple ones)? If not, at what time in history do we see scorching used as an artistic or copy/reproduction method? Where was it first used? Sorry for the barrage of questions. If there is a scorching 101 site, do tell..","date":"2013-11-04","mins":"12:01 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-49902","author":"david_goulet","post":"Ironic that we should move on from “that medieval claptrap” yet you would have us put our faith in medieval scorchtraps. ;).","date":"2013-11-04","mins":"11:14 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-49910","author":"david_goulet","post":"Why the urgency? Need to know before your time is up? Need to rub it in the face of those pseudo scientists before you join the void? As many others here have said, my ‘faith’ does not (nor should it) require the Shroud to be authentic. It’s gravy, total gravy. If it is authentic I’ll take no satisfaction in shoving it any skeptics face. If it is medieval I’ll still admire it has an amazing icon. I’ve mentioned in another post somewhere that Pope Francis just might be the guy to allow/encourage new tests. He has the Jesuit mindset of following Truth wherever it leads – and he is willing to engage the atheist/agnostic in public discussion. What a great project this would make to further that dialogue..","date":"2013-11-04","mins":"12:24 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-49781","author":"david_goulet","post":"I think the 3 D properties are indeed a bit of a red herring. But here’s a question that will show my ignorance but I’ll ask anyway: The 3 D properties teased from the Shroud, were they drawn from the Shroud itself or only photographs of it? I mean the examples provided in this post are of two types: photos of real 3 D people and one (the Shroud) of a picture of a 2 D piece of linen. Or a picture of a picture if you will. Apples and oranges,no?.","date":"2013-11-03","mins":"2:24 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-49783","author":"david_goulet","post":"Wait, I see one the photos is also a picture of a picture.as i see fingers (so that would be closer to apple to apple). But what this actually drives home for me is just how unique the Shroud (whatever century it was formed in) is. It shows as well or better than most of these modern pics. We’re talking about a micron thick image on a piece of linen created before photography exists — yet it has the exact same qualities of a modern pic of a oic. Wow..","date":"2013-11-03","mins":"2:32 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-49792","author":"david_goulet","post":"Can you provide examples, as Hugh has, of the 3 D properties of this ‘cattle branding’ method. That would be great for comparison too..","date":"2013-11-03","mins":"3:30 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-7566","author":"david_goulet","post":"Oh, that’s right, it was a bas relief. I recall now the theory. It’s been so long since I’ve been on a Shroud site, I’ve rather lost track of some of the backstory. I miss Dan’s site, though I’m more productive at work these days with its absence. It’s too bad a new investigation on the Shroud can’t be organized (dare to dream) – knowing better today what to look for I’m certain that even without another C 14 round definitive evidence could be obtained as to age of provenance. But what would we do with our time then?.","date":"2016-08-04","mins":"8:50 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/04/shroud-question-1-from-david-goulet-its-to-do-with-the-testability-or-otherwise-of-that-seemingly-shunned-14th-century-flour-imprinting-model-mine/","cat":"new_theory","title":"Shroud Question 1 from David Goulet: it’s to do with the testability of my 14th century flour-imprinting model."},{"id":"comment-7562","author":"david_goulet","post":"Hi Colin, Thanks for answering my question. Your theory continues to hold up well. As I’ve said before, and I believe Thibault agrees, of all the medieval provenance theories yours is the most promising. I have a follow up question spurred by part of your answer, “there might have been a different flour or other food source that supplied the necessary protein and reducing sugar for a Maillard reaction”. I recall your earlier musing about the image being of a roasted Templar. Was part of the thinking then that a roasted human body could produce a contact imprint because of the Maillard reaction of the roasted human proteins? Just curious as to what other food candidates might work, besides flour (which understandably is the more obvious candidate)..","date":"2016-08-04","mins":"6:47 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/04/shroud-question-1-from-david-goulet-its-to-do-with-the-testability-or-otherwise-of-that-seemingly-shunned-14th-century-flour-imprinting-model-mine/","cat":"new_theory","title":"Shroud Question 1 from David Goulet: it’s to do with the testability of my 14th century flour-imprinting model."},{"id":"comment-94624","author":"david_goulet","post":"So obvious a fake that it has ‘fooled’ art historians and scientists into acknowledging that it could be authentic. So obvious that no modern artist or scientist has yet replicated it fully. The only thing obvious here is Mr. Johnson’s bias and ignorance..","date":"2014-03-29","mins":"3:48 pm","url":"https://shroudstory.com/2014/03/29/so-even-without-knowing-how-the-shroud-was-faked-its-obvious-that-someone-did-fake-it/","cat":"image_theory","title":"So, even without knowing how the shroud was faked, it’s obvious that someone did fake it?"},{"id":"comment-94627","author":"david_goulet","post":"And with this kind of academic rigour, I doubt Mr. Johnson will attain any higher standing than associate professor. He may have already exceeded his abilities..","date":"2014-03-29","mins":"3:55 pm","url":"https://shroudstory.com/2014/03/29/so-even-without-knowing-how-the-shroud-was-faked-its-obvious-that-someone-did-fake-it/","cat":"image_theory","title":"So, even without knowing how the shroud was faked, it’s obvious that someone did fake it?"},{"id":"comment-155029","author":"david_goulet","post":"It seems that very little can be ruled out: radiation, scorches, paint, lasers, etc. But in each case the method that was ‘used’ is beyond 21st century backward engineering. Whoever is responsible for that image is a genius for the ages..","date":"2014-09-24","mins":"9:56 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-158133","author":"david_goulet","post":"There are wealthy Catholics who could fund this in a heartbeat, but of course the results would always be seen as ‘biased’ because of who was backing it. I’m sure there are also wealthy atheists who likewise could fund it, with the same problem of optics as above. Crowd funding might be an option – more and more charitable endeavors are done that way. It would offer some form of funding neutrality..","date":"2014-09-30","mins":"4:18 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-155239","author":"david_goulet","post":"What would it take to rule painting out?.","date":"2014-09-24","mins":"4:36 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-155826","author":"david_goulet","post":"Why not just use sweat? Dan, that’s an intriguing insight. If I was trying to make something look like a sweat imprint the first thing I’d try is exactly that. Take a person who looks like Jesus, get them nice and sweaty, oily too, and very dirty — and then press a linen over them. Blood could be added on afterward or some self flagellation could be done. What would the resulting image look like? This is testable, no? It could be that the resulting image is rather disappointing and thus this method was abandoned. What does a sweat imprint actually look like?.","date":"2014-09-25","mins":"9:24 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-156799","author":"david_goulet","post":"“Anyway it is so hopelessly dated by now that it is becoming increasingly irrelevant for any serious student of the Shroud.” I realize this is just your opinion, but it is, frankly, ridiculous..","date":"2014-09-26","mins":"9:25 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-156912","author":"david_goulet","post":"Charles, I don’t disagree that new tests are needed, indeed they are a must for progress on this debate. But I take umbrage with your assertion that what science has been done is irrelevant. There may be insights yet to be mined from the existing STURP work, if we are creative about it. Naturally, I’d love to see a new round of investigations, but as that does not seem to be forthcoming, let’s not discount what we do have just yet. Would you also assert that the C 14 studies are now irrelevant, after all science has progressed beyond those primitive tests too. I’m willing to see my doctor if you’ll see yours..","date":"2014-09-26","mins":"11:20 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-156805","author":"david_goulet","post":"This discussion on the Shroud being a painting or not can be summarized thusly: it is possible (because there is no evidence that proves it is impossible), but it is not probable (because there is no evidence that proves otherwise). The weight one gives to the possible vs. The not probable depends on one’s predisposition..","date":"2014-09-26","mins":"9:30 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-171897","author":"david_goulet","post":"“The TS body image is as much (if not more) about technology ….” Or, possibly, a natural mechanism..","date":"2014-11-18","mins":"11:42 am","url":"https://shroudstory.com/2014/11/18/the-conspiracy-of-the-faux-sweat-imprint/","cat":"image_theory","title":"The Conspiracy of the Faux-Sweat Imprint"},{"id":"comment-172218","author":"david_goulet","post":"“In my model, the ‘top of head’ model is explained quite simply. The artisans didn’t like the look of fused heads, so inserted a damp cloth or similar to prevent imaging at that point.” This is a simple conclusion based on a complex preconception — your Veronica theory — which is based on quite a few INNI Ts. I don’t mind INNI Ts, by the way, we all have to start somewhere..","date":"2014-11-20","mins":"9:15 am","url":"https://shroudstory.com/2014/11/18/the-conspiracy-of-the-faux-sweat-imprint/","cat":"image_theory","title":"The Conspiracy of the Faux-Sweat Imprint"},{"id":"comment-171909","author":"david_goulet","post":"Ah, the famous dumbbell imprints. But here’s the problem – how would a medieval committee even know what a Roman flagrum looked like when, as Hugh has pointed out before, we aren’t even sure today what one looks like? Why such meticulous detail when the medieval pilgrim would not have known what a Roman flagrum was? Why not a simple whip mark that the medieval person would be familiar with?.","date":"2014-11-18","mins":"12:51 pm","url":"https://shroudstory.com/2014/11/18/the-conspiracy-of-the-faux-sweat-imprint/","cat":"image_theory","title":"The Conspiracy of the Faux-Sweat Imprint"},{"id":"comment-158876","author":"david_goulet","post":"Fascinating stuff! Keep following the science of course. Your theory may seem on the surface to preclude an authentist image formation, but then again it may not. If there was a resurrection event (versus simply a natural image formation resulting from decomposition on a cold slab) I would expect some form of energy activity (light/heat) to be in play. In the medieval artisan model it’s conceivable that a combination of specific fluids were combined with a heat source to generate the image. In the authentist model it’s conceivable that bio fluids and ritual materials combined with a yet unknown energy source (by product of a resurrection event) to produce the image. Sadly, for now, whatever a resurrection event might entail is beyond our ability to scientifically investigate via model building. But your experiments may at least provide clues (for those of us so inclined to muse in that direction). Onward!.","date":"2014-10-03","mins":"9:54 am","url":"https://shroudstory.com/2014/10/03/the-devolution-and-evolution-of-a-maillard-reaction-image-hypothesis/","cat":"image_theory","title":"The Devolution and Evolution of a Maillard Reaction Image Hypothesis"},{"id":"comment-158974","author":"david_goulet","post":"But if one does believe in the resurrection one has to consider the possibility that whatever it was, it may have involved energy — in a way we may not currently be able to understand. Of course resurrection may involve time continuums, Star Trek type dematerialization, angels, or biogenetic mutation. It’s all conjecture and so, yes, we must focus on what we can measure and observe. But as the subtitle of the post notes – you can’t use up creativity..","date":"2014-10-03","mins":"3:25 pm","url":"https://shroudstory.com/2014/10/03/the-devolution-and-evolution-of-a-maillard-reaction-image-hypothesis/","cat":"image_theory","title":"The Devolution and Evolution of a Maillard Reaction Image Hypothesis"},{"id":"comment-158902","author":"david_goulet","post":"An excellent point Charles. It’s an avenue sorely underserved currently..","date":"2014-10-03","mins":"11:51 am","url":"https://shroudstory.com/2014/10/03/the-devolution-and-evolution-of-a-maillard-reaction-image-hypothesis/","cat":"image_theory","title":"The Devolution and Evolution of a Maillard Reaction Image Hypothesis"},{"id":"comment-206417","author":"david_goulet","post":"Now I’m craving jambalaya, thanks Dan! And your point about moderating on the fly via a phone is well taken..","date":"2015-07-23","mins":"2:45 pm","url":"https://shroudstory.com/2015/07/23/the-morphing-of-rogers-and-berry/","cat":"image_theory","title":"The Morphing of Rogers and Berry?"},{"id":"comment-206410","author":"david_goulet","post":"Fair point. Dan, you at least could redact the personal bowshots in Anoxie’s otherwise interesting posts. You do it to others when they stray into ad hom attacks. More leeway is acceptable to people who do not post anonymously but Anoxie chooses otherwise. I don’t expect that everyone is suddenly going to be singing Kumbayah together, but this post was very fruitful until the snide asides started..","date":"2015-07-23","mins":"1:48 pm","url":"https://shroudstory.com/2015/07/23/the-morphing-of-rogers-and-berry/","cat":"image_theory","title":"The Morphing of Rogers and Berry?"},{"id":"comment-102305","author":"david_goulet","post":"It’s an interesting hypothesis Max but if it is such a simple process why do we not see evidence of the method having been used more than once (on a human body)?.","date":"2014-04-22","mins":"7:24 am","url":"https://shroudstory.com/2014/04/17/the-turin-shroud-image-is-not-a-scorch/","cat":"image_theory","title":"The Turin Shroud Image is not a Scorch"},{"id":"comment-102391","author":"david_goulet","post":"So the resultant image was then an ‘accident’ produced by these processes and something that interrupted the otherwise usual process of decay..","date":"2014-04-22","mins":"11:52 am","url":"https://shroudstory.com/2014/04/17/the-turin-shroud-image-is-not-a-scorch/","cat":"image_theory","title":"The Turin Shroud Image is not a Scorch"},{"id":"comment-100770","author":"david_goulet","post":"Brilliant work. As Daveb stated there is still much work to be done, but this paper does seem to put a dagger in the heat scorch hypothesis..","date":"2014-04-18","mins":"11:27 am","url":"https://shroudstory.com/2014/04/17/the-turin-shroud-image-is-not-a-scorch/","cat":"image_theory","title":"The Turin Shroud Image is not a Scorch"},{"id":"comment-183537","author":"david_goulet","post":"“The fact that she, as an expert, did not think the Shroud was anything special as a an artefact or work of art is significant .” Significant indeed, but not how you imply. It demonstrates how the Shroud is so easily dismissed by art experts who have not taken the time to actually study beyond what they’ve seen in articles. I’m afraid Villers dismissal of the Shroud as insignificant damages her legacy as a serious art historian. I say that with all respect to the deceased..","date":"2015-01-15","mins":"12:39 pm","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","title":"There is another reason Charles Freeman is wrong"},{"id":"comment-53916","author":"david_goulet","post":"It’s all a bit over my head here but is it possible to deduce from the Shroud image (using our modern understanding of light and image formation) if the “light’ is shining on the human form, versus from the human form itself, when it was made?.","date":"2013-11-29","mins":"2:23 pm","url":"https://shroudstory.com/2013/11/29/this-may-be-the-biggest-mystery-of-all/","cat":"image_theory","title":"This may be the biggest mystery of all?"},{"id":"comment-167225","author":"david_goulet","post":"Was flour even white in that time period? And why flour…perhaps it is oatmeal…a much heartier base for artwork..","date":"2014-10-31","mins":"9:36 am","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","title":"Those Dark Specks in the Mark Evan’s Photographs"},{"id":"comment-73459","author":"david_goulet","post":"This would seem to suggest a lack of tight contact of the linen on the sides. Therefore not a tight wrap but loosely draped. What do you think?.","date":"2014-01-16","mins":"12:08 pm","url":"https://shroudstory.com/2014/01/15/top-of-head-puzzle/","cat":"image_theory","title":"Top of Head Puzzle"},{"id":"comment-73460","author":"david_goulet","post":"Your ‘error’ has generated great discussion. I wish my mistakes were as fruitful!.","date":"2014-01-16","mins":"12:10 pm","url":"https://shroudstory.com/2014/01/15/top-of-head-puzzle/","cat":"image_theory","title":"Top of Head Puzzle"},{"id":"comment-73458","author":"david_goulet","post":"I agree. It does pose problems for the bas relief theory. The authenticity position does have the Jewish burial customs (head wrapping etc) that fit ‘the gap’. What would be the bas relief equivalent? If the head was that of a real model – and the body the metal — maybe there is more wiggle room. But I believe the latest bas relief theory favours the opposite, no?.","date":"2014-01-16","mins":"12:05 pm","url":"https://shroudstory.com/2014/01/15/top-of-head-puzzle/","cat":"image_theory","title":"Top of Head Puzzle"},{"id":"comment-73465","author":"david_goulet","post":"Louis :I thought it could be due to a hypothetical chin band (#7) going down the length of the face on both sides. It is possible that the body was loosely draped because of the spices (Joseph of Arimathaea) and plants (Avinoam Danin) kept on the sides of the body. The chin strap theory could be valid. But shouldn’t we see evidence of the strap on the hairlines?.","date":"2014-01-16","mins":"1:12 pm","url":"https://shroudstory.com/2014/01/15/top-of-head-puzzle/","cat":"image_theory","title":"Top of Head Puzzle"},{"id":"comment-73533","author":"david_goulet","post":"There are always work arounds. The caveat being that they further stretch the tidiness of the theory. It works both ways of course. For the authentist we start to speak of chins traps and spice bags that account for the ‘gaps’. The medievalist likewise has to speak of multiple attempts to ‘fix’ discrepancies. The scientific mind dancing with the imagination — and God was pleased. :).","date":"2014-01-17","mins":"10:01 am","url":"https://shroudstory.com/2014/01/15/top-of-head-puzzle/","cat":"image_theory","title":"Top of Head Puzzle"},{"id":"comment-73389","author":"david_goulet","post":"I’m seeing a 6 8 inch gap between the crowns of the images. I’m seeing the crown on the dorsal (right side in pic above) ending at the same line as the four burn holes. I also assumed the mark that abuts the ventral was a water mark (shaped like a tropical fish). Are the blood marks on the dorsal not blood in the hair, as opposed to shoulders?.","date":"2014-01-15","mins":"4:38 pm","url":"https://shroudstory.com/2014/01/15/top-of-head-puzzle/","cat":"image_theory","title":"Top of Head Puzzle"},{"id":"comment-84575","author":"david_goulet","post":"The writer in me wants to suggest that those that buried Jesus replaced the crown of thorns with a crown of flowers, which kept the cloth off the top of the head. Pure narrative speculation — but it’s what I might have done..","date":"2014-03-03","mins":"5:17 pm","url":"https://shroudstory.com/2014/02/28/top-of-the-head-puzzle-redux/","cat":"image_theory","title":"Top of the Head Puzzle Redux"},{"id":"comment-84956","author":"david_goulet","post":"There are many reasons that there might not have been an image on top of the head. From burial straps, to flowers (I still like a crown of flowers) to caked blood, and because we don’t know the process of image formation we don’t know ‘what we don’t know’. This mythical artist, who is two moves ahead of even us modern day observers, neglects to account for the image gap between the heads? He gets everything else amazingly right but muffs something that obvious? This gap actually makes me less inclined to accept the forger theory — because it’s exactly the kind of gap a forger would have mitigated..","date":"2014-03-04","mins":"5:30 pm","url":"https://shroudstory.com/2014/02/28/top-of-the-head-puzzle-redux/","cat":"image_theory","title":"Top of the Head Puzzle Redux"},{"id":"comment-88701","author":"david_goulet","post":"This is the kind of response that serves the science. Thanks Chris B..","date":"2014-03-14","mins":"9:15 am","url":"https://shroudstory.com/2014/03/14/two-comments-promoted-colin-berry-has-cracked-the-shroud-enigma/","cat":"image_theory","title":"Two Comments Promoted:  Colin Berry Has Cracked the Shroud Enigma?"},{"id":"comment-90052","author":"david_goulet","post":"Where does insight come from if not from experimentation, even when the experiment itself may fail to prove one’s theory. Why do you think Dr. Heimburger is open to testing Colin’s results? Because he sees there is worth in the exploration. And speaking theologically, there is NEVER anything worthless in the exercising of our creativity and intellect in the search for truth. God delights in our misses as much as our hits. He did not create us to stand around and let others draw conclusions for us..","date":"2014-03-17","mins":"11:10 am","url":"https://shroudstory.com/2014/03/14/two-comments-promoted-colin-berry-has-cracked-the-shroud-enigma/","cat":"image_theory","title":"Two Comments Promoted:  Colin Berry Has Cracked the Shroud Enigma?"},{"id":"comment-88702","author":"david_goulet","post":"Mythbusters may be pop science but it serves a purpose — and it has debunked many a myth convincingly. Comparing Colin to that show isn’t the put down you may think it is..","date":"2014-03-14","mins":"9:18 am","url":"https://shroudstory.com/2014/03/14/two-comments-promoted-colin-berry-has-cracked-the-shroud-enigma/","cat":"image_theory","title":"Two Comments Promoted:  Colin Berry Has Cracked the Shroud Enigma?"},{"id":"comment-88705","author":"david_goulet","post":"Before Colin’s heated crucifix experiment it was said that only the Shroud displayed certain 3 D imaging qualities. His experiment demonstrated that the Shroud was not unique, that a scorch presented similar properties. If that experiment was a waste of time, then we need a lot more of it wasted..","date":"2014-03-14","mins":"9:20 am","url":"https://shroudstory.com/2014/03/14/two-comments-promoted-colin-berry-has-cracked-the-shroud-enigma/","cat":"image_theory","title":"Two Comments Promoted:  Colin Berry Has Cracked the Shroud Enigma?"},{"id":"comment-216409","author":"david_goulet","post":"Charles, with most painted linens of the period, if the paint started to come off it was easily reapplied. Why in the case of the Shroud was this not done?.","date":"2015-12-13","mins":"12:36 pm","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","title":"Watertight Evidence"},{"id":"comment-195015","author":"david_goulet","post":"Why is working backwards problematic? Isn’t reverse engineering a scientific methodology? The belief that the Shroud may be a medieval artifact is not illogical given the evidence, so neither is it illogical to reverse engineer it using technology of the era. Neither is it illogical to explore the more fantastic theories using light – because until someone comes up with a definitive answer all ideas are fair game as starting points of research and experimentation. And exploring a one way road isn’t a bad plan, if it turns out to be the right road..","date":"2015-03-31","mins":"8:59 pm","url":"https://shroudstory.com/2015/03/31/whats-to-like-over-on-colins-blog-right-now/","cat":"image_theory","title":"What’s to like over on Colin’s blog right now?"},{"id":"comment-195087","author":"david_goulet","post":"So much of the debate here is really triggered by human personalities and not just the science. Which is rather fitting given that the subject of the discussion is as much a question as to ‘who’ as it is a ‘how’..","date":"2015-04-01","mins":"8:25 am","url":"https://shroudstory.com/2015/03/31/whats-to-like-over-on-colins-blog-right-now/","cat":"image_theory","title":"What’s to like over on Colin’s blog right now?"},{"id":"comment-195099","author":"david_goulet","post":"It’s the scientific mindset that ultimately makes an experiment ‘serious’. The most expensive lab in the world is useless if Mickey Mouse is running the show..","date":"2015-04-01","mins":"9:50 am","url":"https://shroudstory.com/2015/03/31/whats-to-like-over-on-colins-blog-right-now/","cat":"image_theory","title":"What’s to like over on Colin’s blog right now?"},{"id":"comment-195186","author":"david_goulet","post":"Your findings (which you note would substantiate the possibility of medieval technology be used) also apply to any naturalistic image formation. This is good because it seems that the naturalistic theory has been losing ground on this blog – specifically among some authentists. We seem to have polarized into the light/radiation versus contact fake camps. There is a third way, as they say..","date":"2015-04-02","mins":"8:32 am","url":"https://shroudstory.com/2015/03/31/whats-to-like-over-on-colins-blog-right-now/","cat":"image_theory","title":"What’s to like over on Colin’s blog right now?"},{"id":"comment-170893","author":"david_goulet","post":"“Other people”. Are these other people as versed in the full gamut of Shroud research as those here? Or are they simply art historians who already think the Shroud is nothing but a curio? Posters here have pointed out some massive gaps in your theory and you’ve provided a marginal defense. If you were defending a Ph D with this kind of counter punch I’m afraid you’d fail. I actually was open minded about your theory when it first was shared but you have had no convincing answers to the critics (never mind their lack of civility at times). I’m sorry but you gave it an honest effort but it’s now time to honestly concede the theory does not solve the mystery of the image formation. Giving yourself a year to collect some confirmation biased reviews won’t have you any closer to the truth..","date":"2014-11-12","mins":"3:41 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-170829","author":"david_goulet","post":"OK. I don’t think you should claim deliberate deception. But you can accuse him of academic incompetence. I think many posters here have exposed his theory as insubstantial. He offered a theory, it was proven wrong, time to move on. However if he continues to ignore the counter evidence and posit that his theory remains viable, then I’d revisit the ‘deliberate deception’ accusation..","date":"2014-11-12","mins":"9:57 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-171074","author":"david_goulet","post":"Charles I don’t think you are deliberately misleading anyone. I think you are a victim of confirmation bias. You have looked only at evidence that supports your theory and do not seem able to appreciate the evidence that damages the theory. I am not an expert in any of the disciplines on display here, but I read and consider the posts of the experts that do frequent here. One does eventually start to see a forest through the trees. It’s not the 14 century provenance I have a problem with either — your loom reference is a valid one. Or that the Shroud is indicative of gothic art style. What I have a problem with is the flaked off paint theory. It’s an interesting hypothesis but you haven’t produced a shred of conclusive evidence, nor defended well against the counter arguments. I’m wary then of anyone who proclaims ‘mystery solved!’ – though perhaps that was an editor’s decision to hype the article. But you make a valid point about judging too early. I hope you will be able to share with us in a year corroboration from other experts who agree with your theory. I’m most open to re examining the theory at that time..","date":"2014-11-13","mins":"1:23 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-209116","author":"david_goulet","post":"While I find this whole topic is taking us off the rails I agree that Dan’s posting is his way of ‘weighing in’ in the dust up. In an effort to get us back on point, may I suggest a posting about the latest on the ‘KGB hacker conspiracy’. That seems to be one everyone can be equally dismissive of. :).","date":"2015-08-27","mins":"8:36 am","url":"https://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/","cat":"image_theory","title":"You may reassure Mr. Berry"},{"id":"comment-209202","author":"david_goulet","post":"Point of clarification. Colin has never claimed that Jesus was covered in flour and half baked. He proposes a medieval artisan may have done this to a live or dead ‘volunteer’ whose features resembled the popular image of Jesus. The person was not baked, only the linen with the flour imprint. If you’re going to ridicule the theory at least appear to have understood it..","date":"2015-08-28","mins":"8:01 am","url":"https://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/","cat":"image_theory","title":"You may reassure Mr. Berry"},{"id":"comment-209205","author":"david_goulet","post":"Sorry, Dan. Thought I’d posted this under Stan’s comment..","date":"2015-08-28","mins":"9:08 am","url":"https://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/","cat":"image_theory","title":"You may reassure Mr. Berry"},{"id":"comment-209115","author":"david_goulet","post":"Paolo writes, “It is evident Mr. Berry is not trained in microscope imaging. Our students can do a better work.” Yet he does not provide a single example to back up this accusation against Colin. Notice I didn’t use the title ‘Dr.’ for either gent. I think I’ll reserve that title for those that take the Hippocratic oath..","date":"2015-08-27","mins":"8:31 am","url":"https://shroudstory.com/2015/08/27/you-may-reassure-mr-berry/","cat":"image_theory","title":"You may reassure Mr. Berry"},{"id":"comment-199863","author":"david_goulet","post":"Is it possible that the image is formed not from something exterior contacting the linen but from something drawing internal material out of the linen like a vacuum? The best way I can describe it ( with my limited scientific knowledge) would be to compare it to a child sucking on a ice pop (frozen coloured sugar water). As the child sucks on the ice pop the food dye and sugar is drawn to the point of contact. Soon the top of the ice pop holds all the colour and the base is pale ice. Could the Shroud image likewise have been created by starches in the linen being drawn to the surface? This would assume a resurrection process currently outside our understanding, though I might liken it to the effect of a black hole caused by a collapsing star. Fantastical speculation, agreed. But I’m just trying to think outside the box in case it might trigger further useful speculation..","date":"2015-05-22","mins":"8:40 am","url":"https://shroudstory.com/2015/05/19/guest-posting-the-shroud-of-turin-an-x-ray/","cat":"uncategorized","title":"Guest Posting:  The Shroud of Turin – An X-Ray?"},{"id":"comment-199889","author":"david_goulet","post":"I suppose it needn’t even be a vacuum created by suction, it could also be a natural leaching effect. Perhaps something on the body drew the starches out of the linen (as opposed to imparting them on top the linen) – like salt draws moisture. This might include a leaching agent that did not require direct contact. A reverse Maillard reaction? Obviously a subject which is not my forte, but food for thought perhaps..","date":"2015-05-22","mins":"2:02 pm","url":"https://shroudstory.com/2015/05/19/guest-posting-the-shroud-of-turin-an-x-ray/","cat":"uncategorized","title":"Guest Posting:  The Shroud of Turin – An X-Ray?"},{"id":"comment-52634","author":"david_goulet","post":"I don’t believe they had permission at that time to conduct an invasive test. I also suspect they, STERA,assumed the tests they already had planned would prove the Shroud was not authentic. C 14 tests, at that stage, would have been seen as overkill..","date":"2013-11-24","mins":"5:43 am","url":"https://shroudstory.com/2013/11/23/is-the-image-on-the-shroud-of-turin-a-selfie/","cat":"news_&_views","title":"Is the Image on the Shroud of Turin a Selfie?"},{"id":"comment-52669","author":"david_goulet","post":"They were supposed to go in unbiased, but if Barry is any example then they did have personal (if not expressed) biases. In retrospect, after their initial studies were complete and they still were filled with questions I’m sure some of them wished they had included C 14 as part of the original parameters..","date":"2013-11-24","mins":"10:00 am","url":"https://shroudstory.com/2013/11/23/is-the-image-on-the-shroud-of-turin-a-selfie/","cat":"news_&_views","title":"Is the Image on the Shroud of Turin a Selfie?"},{"id":"comment-7804","author":"david_goulet","post":"What I’d like to see is a group of science students take your model and further the experiments, documenting their findings and submitting to a peer review paper. They might even have a go at the full size model. The strong point of your model is that it could be done on a shoe string budget. No lasers needed! Wish we knew a science teacher somewhere…hmmmm..","date":"2016-09-15","mins":"3:14 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?"},{"id":"comment-7708","author":"david_goulet","post":"You’ve studied the Shroud image in more detail than I have. Do you see any evidence that the dorsal and frontal images had any major difference in contact pressure? I’m considering how the forger made the imprint, i.e. Was the floured body laying flat on the linen (dorsal image formed by gravity and body’s weight) while the top of the linen was folded over the front of the body and pressure applied from the exterior (hands or soft weights applied). Or, could the frontal image have been done first, then the body rolled over onto its stomach and the dorsal image done in a similar fashion (not therefore relying on gravity and its own weight). Let’s go one step further – could the image have been made with the subject in a vertical position? Would there be any clues in the image that betray any of these scenarios?.","date":"2016-08-26","mins":"6:23 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?"},{"id":"comment-7824","author":"david_goulet","post":"Having read over that paper, it appears their conclusion is that the blood stains are indeed blood stains, but there may be evidence they were touched up ‘revived’ at some point with dye/paint. Not a new idea, but this time with some evidence. Is this your takeaway from the the paper as well?.","date":"2016-09-19","mins":"2:31 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?"},{"id":"comment-7675","author":"david_goulet","post":"” I’m far from convinced that the Man on the TS possesses either!” Was it not common belief in the Medieval period that Jesus sported a beard and moustache? I would think that a forger would want those features on the image..","date":"2016-08-24","mins":"3:05 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?"},{"id":"comment-7677","author":"david_goulet","post":"This may be. What confused me is your observation/belief that there’s no beard/moustache. There clearly is, but I understand now your belief in what you deem has caused it – not actual hair but a bump. Thanks for clarifying your position..","date":"2016-08-24","mins":"4:51 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?"},{"id":"comment-7656","author":"david_goulet","post":"Fair enough. But what about the hair? Does it pose problems for image formation in your model? Perhaps there are signs in the hair in the image that might prove support your model?.","date":"2016-08-22","mins":"9:40 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?"},{"id":"comment-7654","author":"david_goulet","post":"You’ve answered my question, sort of. You contend there are no wounds, only blood marks suggesting wounds. You also contend these were added after the image formation. Would it matter in your model then if the subject was alive or dead? One further question comes to mind. Your flour model works very well with smooth surfaces, like the space action figures and crucifix. And you’ve done your hand as well. But have you tried it with hair? Does it pose any special problems?.","date":"2016-08-22","mins":"8:11 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?"},{"id":"comment-7652","author":"david_goulet","post":"Colin, your model would require a human subject for the image formation – covered in the flour base from which then the imprint was made. This person would be either living or dead. Which do you think it was: a living subject or a dead one? If it was a cadaver then one might expect that they would have added post mortem wounds so these would add to the realistic nature of the relic. Is there evidence of this in the wound markings? If the subject was live they would either have had to fake the wounds, or add them post image formation. We do agree that there are wounds on the figure in the image? How and when were they created is the question I have..","date":"2016-08-22","mins":"7:09 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?"},{"id":"comment-7648","author":"david_goulet","post":"Was pasta prevalent in France at the time the forgery was being ‘cooked’ up?.","date":"2016-08-22","mins":"2:09 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?"},{"id":"comment-7823","author":"david_goulet","post":"Yes, just saw this as well via the Shroud.com latest website. Also some other good papers. I agree with what you say with the 1/12 modeling. I find it compelling. I would think other scientists would as well. What the full scale model brings to the table is everyone else. For better or worse. Onward, sir. You are reaching a point where your work cannot be ignored much longer..","date":"2016-09-19","mins":"2:06 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?"},{"id":"comment-7807","author":"david_goulet","post":"I really don’t care what medium the peer review occurs in. Replace ‘paper’ with ‘blog’. But what you need is some form of peer review and a way to attract more is if a bunch of fresh faced students adopt your model and run with it. It would actually make for a cool documentary. Maybe a James Randi foundation would back it. Funny thing – if Dan’s blog was still around and he was posting about your latest model you’d have loads of responses – some wheat and a ton of chaff to be sure. Am I the only one from that crew that is keeping an eye on your work? Not everyone on Dan’s blog was so pro authenticity they rejected your ideas on sight. Where’s Thibault? Hugh? Thomas? Is Google to blame? Keep blogging, eventually something has to budge..","date":"2016-09-15","mins":"8:09 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/16/might-invisible-ink-technology-mere-childs-play-have-been-superbly-fine-tuned-to-achieve-whole-body-imaging/","cat":"medieval_forgery","title":"Might invisible ink technology (mere child’s play) have been superbly fine-tuned to achieve whole body imaging?"},{"id":"comment-170401","author":"david_goulet","post":"HSG, your 3rd paragraph is very intriguing. If one prefers the medieval provenance theory then you are saying the artisan chose the 3 1 weave perhaps after much experimentation. It would be no accident then that this weave was chosen. Certainly the artisan was beyond diligent in forming this ‘exquisite’ image. An unknown master of masters, really. If one prefers the 1st century provenance theory, then we may have an inkling as to why no such other burial images have been found over time. The 3 1 weave was not, likely, the usual type of linen used for burials. The TS may be unique this way, it may be, as some have hypothesized, a linen meant for use as a altar cloth or some other more luxurious usage. It was utilized as a burial shroud out of haste and/or reverence for the deceased. The use of this 3 1 weave then was providential, with of course no human observation that it would provide for an image at all. Mystery..","date":"2014-11-10","mins":"9:34 am","url":"https://shroudstory.com/2014/11/10/guest-posting-by-o-k-on-the-shroud-as-a-negative/","cat":"uncategorized","title":"Guest Posting by O.K. on the Shroud as a Negative"},{"id":"comment-47912","author":"david_goulet","post":"Fascinating! Whether it has any bearing on the Shroud or not..","date":"2013-10-18","mins":"2:38 pm","url":"https://shroudstory.com/2013/10/18/how-do-we-know-no-directionality-of-light/","cat":"uncategorized","title":"How do we know? No directionality of light."},{"id":"comment-48056","author":"david_goulet","post":"True but someday on this site also claimed that cutting edge science is necessarily controversial..","date":"2013-10-19","mins":"5:19 pm","url":"https://shroudstory.com/2013/10/18/how-do-we-know-no-directionality-of-light/","cat":"uncategorized","title":"How do we know? No directionality of light."},{"id":"comment-91740","author":"david_goulet","post":"Why would flattening them make them invisible? Lost me there. If I have a crease in my denim jeans and then flatten it out I may still see a crease line – it depends if the crease affected the colour uniformity..","date":"2014-03-21","mins":"10:01 pm","url":"https://shroudstory.com/2014/03/21/so-then-why-is-there-an-image/","cat":"news_&_views","title":"So then, why is there an image?"},{"id":"comment-186391","author":"david_goulet","post":"If anyone might convince Francis to provide more access it may be Barrie..","date":"2015-01-26","mins":"9:51 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers"},{"id":"comment-186410","author":"david_goulet","post":"I was thinking ecumenical in that Barrie is not Christian. He also has the trust and respect of most Shroud parties. He’s one of the last men standing from STURP – which may appeal to the idea of providence acting in this. I like the Greek Orthodox approach as well..","date":"2015-01-26","mins":"10:58 am","url":"https://shroudstory.com/2015/01/25/the-hidden-away-hd-images-an-indispensable-tool-for-researchers/","cat":"news_&_views","title":"The Hidden Away HD Images:  An Indispensable Tool for Researchers"},{"id":"comment-40527","author":"david_goulet","post":"I don’t know what’s more frustrating, atheists claiming the Shroud is a forgery (despite the lack of evidence) or Christians dismissing it as nothing special. I guess walking on water and rising from the dead is simply too tough an act to follow..","date":"2013-08-05","mins":"3:05 pm","url":"https://shroudstory.com/2013/08/05/why-would-jesus-defy-the-2nd-commandment-and-create-a-graven-image-unto-himself/","cat":"news_&_views","title":"Why would Jesus defy the 2nd commandment and create a \"graven image\" unto himself?"}]
