[{"id":"comment-159866","author":"david_goulet","post":"Christian tradition, to my knowledge, only teaches that a resurrected body is a glorified body — and leaves it at that. The resurrection stories of Jesus note how Jesus’ body was not exactly as it was before death (they did not recognize him) and yet it was still his body (the wounds). The tomb is empty which further points to the fact that something happened to Jesus’ actual body. The concept of reincarnation involves a soul continually going through a cycle of rebirth, from infant to adult. This is so completely different than Jesus’ resurrection that to connect the two, other than in the broadest strokes, is nonsensical..","date":"2014-10-06","mins":"12:42 pm","url":"https://shroudstory.com/2014/10/06/a-different-perspective-on-the-shroud/","cat":"news_&_views","title":"A Different Perspective on the Shroud"},{"id":"comment-203194","author":"david_goulet","post":"If (big IF) the Shroud is a 14th century artifact, Pope Francis’ words would still be relevant. In the end, neither you, Hugh or I can read Pope Francis’ mind so it is pointless to play the game du jour of “What Francis really meant…”.","date":"2015-06-22","mins":"8:18 am","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","title":"A Memorable Photograph Worth a Thousand Words"},{"id":"comment-203251","author":"david_goulet","post":"Not sure what one’s passport has to do with this discussion. Your first three Popes’ quotes clearly point to a belief in authenticity. The latter three do not. They would apply to 14th century relic equally as well. You may want to try your hand at backgammon..","date":"2015-06-22","mins":"4:00 pm","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","title":"A Memorable Photograph Worth a Thousand Words"},{"id":"comment-203350","author":"david_goulet","post":"Nabber you are a victim of confirmation bias. Do you know what crystal clear would be? If a Pope said ‘this relic is the authentic burial cloth of Christ’. This is essentially what the first three Popes you quoted have said, the latter three did not. Do the latter three see the relic as a profound icon of faith – absolutely. But did they outright declare it authentic – no. Period. I don’t understand why you are so adamant about what the Popes have said or not said. It doesn’t really matter unless you believe they have been privy to insider information. It is for each person to decide what they believe re: authenticity regardless of what a pontiff states. And please keep your accusations of disingenuousness to yourself. You are not my confessor nor my judge..","date":"2015-06-23","mins":"8:54 am","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","title":"A Memorable Photograph Worth a Thousand Words"},{"id":"comment-173598","author":"david_goulet","post":"I’d have swore those X’s were different shades. That’s amazing..","date":"2014-11-29","mins":"9:02 am","url":"https://shroudstory.com/2014/11/29/a-warning-about-what-we-perceive/","cat":"science","title":"A warning about what we perceive"},{"id":"comment-95920","author":"david_goulet","post":"The Y cross is not a new idea. But a T cross could still have been used depending on the slumping of the body downward, creating the same Y effect. The main argument against a Y cross is where did Pilate’s edict get placed. Tradition has it above the accused, but there is no ‘above’ with a Y..","date":"2014-04-02","mins":"4:18 pm","url":"https://shroudstory.com/2014/04/02/a-y-shaped-crucifixion-according-to-the-shroud-of-turin/","cat":"news_&_views","title":"A “Y” Shaped Crucifixion According to the Shroud of Turin?"},{"id":"comment-164888","author":"david_goulet","post":"Thanks for this Dan. It’s been getting out of hand of late, sometimes it’s been a bold accusation, more often it is a patronizing aside. Either way this needs to be curtailed..","date":"2014-10-23","mins":"11:06 am","url":"https://shroudstory.com/2014/10/23/accusations-of-intellectual-dishonesty/","cat":"news_&_views","title":"Accusations of Intellectual Dishonesty"},{"id":"comment-165164","author":"david_goulet","post":"Agreed Eric. I myself have contributed to that avalanche (out of pure frustration). It would be nice to get back to debating without the personal barbs..","date":"2014-10-24","mins":"9:48 am","url":"https://shroudstory.com/2014/10/23/accusations-of-intellectual-dishonesty/","cat":"news_&_views","title":"Accusations of Intellectual Dishonesty"},{"id":"comment-164902","author":"david_goulet","post":"It’s a moot point. If we can’t discern today if the Shroud is authentic or not, what chance someone of that time period. It really doesn’t matter what they said, they had no better idea than we do..","date":"2014-10-23","mins":"12:34 pm","url":"https://shroudstory.com/2014/10/23/accusations-of-intellectual-dishonesty/","cat":"news_&_views","title":"Accusations of Intellectual Dishonesty"},{"id":"comment-29012","author":"david_goulet","post":"Superb reflection! For me the Shroud proves nothing, yet suggests everything — as all true signs do..","date":"2013-04-01","mins":"1:48 pm","url":"https://shroudstory.com/2013/04/01/an-easter-meditation-on-the-shroud-as-a-sign/","cat":"news_&_views","title":"An Easter Meditation on the Shroud as a Sign"},{"id":"comment-164928","author":"david_goulet","post":"Dictionaries? Are YOU kidding?.","date":"2014-10-23","mins":"2:19 pm","url":"https://shroudstory.com/2014/10/23/accusations-of-intellectual-dishonesty/","cat":"news_&_views","title":"Accusations of Intellectual Dishonesty"},{"id":"comment-103633","author":"david_goulet","post":"The Ten Commandments is ‘Christian themed’? I’d like to get Barry’s take on that! I suspect Bill was thinking of another Heston film, Ben Hur. Bill needs to keep his chariots straight..","date":"2014-04-25","mins":"11:37 am","url":"https://shroudstory.com/2014/04/25/bill-donohue-on-the-ten-commandments-the-shroud-of-turin-and-more/","cat":"news_&_views","title":"Bill Donohue on the Ten Commandments, the Shroud of Turin and More"},{"id":"comment-71626","author":"david_goulet","post":"I believe Pope Benedict copyrighted his encyclicals to protect them from being exploited by others, rather than desiring to exploit them himself. I’m less bothered by that than the Apple Shroud App and high def pics being copyrighted. But translations of the Bible are copyrighted too so perhaps it is no real suprise. I do know that the true believer shares freely the Good News — why wouldn’t we?.","date":"2014-01-03","mins":"10:22 am","url":"https://shroudstory.com/2014/01/03/brilliant-the-pause-button-with-the-rosary-hanging-from-it/","cat":"shroud_marketplace","title":"Brilliant:  The Pause Button with the Rosary Hanging From It"},{"id":"comment-103634","author":"david_goulet","post":"Typo — of course it’s the one and only Barrie Schwortz I was referring to..","date":"2014-04-25","mins":"11:38 am","url":"https://shroudstory.com/2014/04/25/bill-donohue-on-the-ten-commandments-the-shroud-of-turin-and-more/","cat":"news_&_views","title":"Bill Donohue on the Ten Commandments, the Shroud of Turin and More"},{"id":"comment-58062","author":"david_goulet","post":"I actually hear something echo in my memory that Colin posted once: if a person has something revelatory to share about the Shroud then, if they truly believe it is the image of Jesus, should they not offer that revelation freely? To expect a person to purchase your book, your article, your documentary is not so far removed from what the moneylenders were doing, is it? It’s a hard question because there are many good people out there who are selling books, docs and whatnot about the Shroud. I do not think greed is their motivation. They need to eat too. But did Jesus charge people a speaker’s fee when he shared the Good News? Did the apostles? If we believe the Shroud is a precious gift, then what right do we have to put a price tag on its being shared. I think, crazy at it may sound, that Colin and Francis are on the same page here..","date":"2013-12-11","mins":"1:56 pm","url":"https://shroudstory.com/2013/12/11/bruised-hurting-and-dirty/","cat":"news_&_views","title":"Bruised, Hurting and Dirty"},{"id":"comment-50678","author":"david_goulet","post":"If Dahl was implying the pollen was ‘planted’ by pro authentists I’d love to read any fiction he’s published. Great imagination. And is it inconceivable that insects might have been the medium of transmission, not wind? A linen stained with blood and other organic matter, Gee I wouldn’t think insects might be attracted to that..","date":"2013-11-10","mins":"7:14 pm","url":"https://shroudstory.com/2013/11/08/cementing-over-central-park/","cat":"news_&_views","title":"Cementing Over Central Park"},{"id":"comment-207044","author":"david_goulet","post":"I agree with Colin. Not because I’m trying to be his best buddy, but because he’s right on this point. Max is allowed to post his thought experiments and then defend them as gospel — despite any published evidence. I’d have less issue with this (I like thought experiments) if he would be more open to criticism. He also acts troll ish with his pejorative comments about Colin. Colin is correct when he points out that it’s bad form to pull content from his site to chum the waters on your own. As this very posting is evidence of..","date":"2015-07-31","mins":"9:23 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","title":"Cherry Jam, the Metaphor"},{"id":"comment-207051","author":"david_goulet","post":"Theories pass. The frog remains. Jean Rostand.","date":"2015-07-31","mins":"9:36 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","title":"Cherry Jam, the Metaphor"},{"id":"comment-207087","author":"david_goulet","post":"Christolipsology…. I googled this word and the only other times it shows up is in comments made on this blog by you, Max. What does this tell me? You are an expert with, and lover of, languages. I think even Colin would concede that. Like Tolkien (whose love of language led him to create a lingua Elvin which evolved into the entire LOTR narrative) you have built a narrative for the Shroud stemming from archeoetymology(!). You are more poet than scientist and that is well and good. But when poets mix with scientists their words may inspire, but they can never provide the proofs scientists demand. That is not a judgment, just an observation..","date":"2015-07-31","mins":"12:45 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","title":"Cherry Jam, the Metaphor"},{"id":"comment-207045","author":"david_goulet","post":"Prove it. Or shut up. Your accusations are growing tedious..","date":"2015-07-31","mins":"9:24 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","title":"Cherry Jam, the Metaphor"},{"id":"comment-207062","author":"david_goulet","post":"Max, I did find it rather ironic that in the end Colin’s theories have swung around to something similar to the angle you took, and Rogers and others. I do not believe for a second that he copied your theory, but rather he came around to it on his own after eliminating his previous theories. Yes, he did dismiss your theory originally (and Rogers) in the early going and so you and others, seeing now Colin exploring similar territory, can be forgiven for wanting to let him know “I told you so”. Fair is fair. But you overstep when you accuse him of recycling your ideas..","date":"2015-07-31","mins":"10:36 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","title":"Cherry Jam, the Metaphor"},{"id":"comment-207069","author":"david_goulet","post":"Dare to dream, piero. Dare to dream..","date":"2015-07-31","mins":"11:15 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","title":"Cherry Jam, the Metaphor"},{"id":"comment-191915","author":"david_goulet","post":"Touche, Daveb!.","date":"2015-02-26","mins":"2:27 pm","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"id":"comment-51595","author":"david_goulet","post":"Perhaps someone should start a second blog Copyofthe Shroudstory, or Copyofthe Shroudwithoutthehype as I think we have enough on our hands here with the original..","date":"2013-11-16","mins":"8:05 am","url":"https://shroudstory.com/2013/11/15/copy-of-the-shroud-of-turin-in-new-jersey/","cat":"news_&_views","title":"Copy of the Shroud of Turin in New Jersey"},{"id":"comment-138498","author":"david_goulet","post":"I was being facetious. You are correct, of course..","date":"2014-07-15","mins":"11:16 am","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","title":"David Roemer’s Rejected Paper"},{"id":"comment-138495","author":"david_goulet","post":"I think it is Dolan who should have reported Roemer to the CDF not the other way around..","date":"2014-07-15","mins":"10:41 am","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","title":"David Roemer’s Rejected Paper"},{"id":"comment-194357","author":"david_goulet","post":"And that picture of Depp is from Pirates of the Caribbean 3 !!!.","date":"2015-03-25","mins":"8:13 am","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","title":"Double-0-7’s  Big 3 Analysis"},{"id":"comment-111921","author":"david_goulet","post":"I recommend the documentary Hellbound. It provides much food for thought on our understanding of Hell..","date":"2014-05-05","mins":"12:58 pm","url":"https://shroudstory.com/2014/05/04/everyone-goes-to-heaven/","cat":"news_&_views","title":"Everyone Goes to Heaven?"},{"id":"comment-63155","author":"david_goulet","post":"Nice to see everyone is getting into the Christmas spirit..","date":"2013-12-20","mins":"8:35 am","url":"https://shroudstory.com/2013/12/20/fan-mail/","cat":"news_&_views","title":"Fan Mail"},{"id":"comment-211215","author":"david_goulet","post":"There is a dorsal image..","date":"2015-09-25","mins":"7:28 pm","url":"https://shroudstory.com/2015/09/25/everything-we-know-about-the-shroud/","cat":"reader_inquiry","title":"Everything We Know About the Shroud?"},{"id":"comment-32618","author":"david_goulet","post":"Proving authenticity should elicit one word from a person’s mouth, “Wow!” What you do in the face of that ‘wow’ is then up to you and your conscience..","date":"2013-05-02","mins":"10:59 am","url":"https://shroudstory.com/2013/05/02/good-question-what-would-proving-shroud-do/","cat":"news_&_views","title":"Good Question: What would ‘proving’ Shroud do?"},{"id":"comment-172219","author":"david_goulet","post":"Meet the 21st century equivalent of the Lirey badge..","date":"2014-11-20","mins":"9:16 am","url":"https://shroudstory.com/2014/11/20/how-many-cities-can-you-identify-on-the-back/","cat":"other_sites","title":"How many cities can you identify on the back?"},{"id":"comment-215190","author":"david_goulet","post":"I don’t think this image is from the Shroud at all..","date":"2015-11-27","mins":"2:59 pm","url":"https://shroudstory.com/2015/11/27/i-hope-this-helps/","cat":"reader_inquiry","title":"I Hope This Helps"},{"id":"comment-43764","author":"david_goulet","post":"I’ll be honest. I’d be more likely to drop something in the hat if it was going to a research fund with the product being new scientific data on the Shroud. I’m not that interested in funding a fictional film about the Shroud with the hope it may spur the Vatican and others to proceed with the scientific project. There have been umpteen works of fiction about the Shroud, like the many cloning angles, and none of these have spurred any new science. I suspect many Shroudies have not contributed for this reason. As was stated, we all fell the going around in circles because there’s no new data to examine. We’re all craving new data — if I can fund that directly I’m all in..","date":"2013-09-11","mins":"9:41 am","url":"https://shroudstory.com/2013/09/10/i-say-let-all-of-us-help-david-help-us-all/","cat":"crowdfunding","title":"I say let all of us help David help us all"},{"id":"comment-43814","author":"david_goulet","post":"Is such testing possible today with non destructive methods?.","date":"2013-09-11","mins":"2:36 pm","url":"https://shroudstory.com/2013/09/10/i-say-let-all-of-us-help-david-help-us-all/","cat":"crowdfunding","title":"I say let all of us help David help us all"},{"id":"comment-43798","author":"david_goulet","post":"Agreed! A team with no vested interest in the Shroud. Completely neutral. There are probably many such scientists in places like China, India, Japan, where the Shroud is not part of the cultural background noise..","date":"2013-09-11","mins":"1:32 pm","url":"https://shroudstory.com/2013/09/10/i-say-let-all-of-us-help-david-help-us-all/","cat":"crowdfunding","title":"I say let all of us help David help us all"},{"id":"comment-43778","author":"david_goulet","post":"Would they also have to exclude any researcher who believes that the shroud is a forgery? The threat of confirmation bias runs both ways. Finding open minded, unbiased scientists may be the most challenging aspect of such a project..","date":"2013-09-11","mins":"11:23 am","url":"https://shroudstory.com/2013/09/10/i-say-let-all-of-us-help-david-help-us-all/","cat":"crowdfunding","title":"I say let all of us help David help us all"},{"id":"comment-43811","author":"david_goulet","post":"By mystery I mean an inexplicable component — something outside of human history. Relics are objects of history and while the Shroud is partly that, it is much more. This doesn’t mean the other relics have no historic or spiritual value. And if the links to the Shroud could be further studied the results would obviously have importance to sindonology. But their authenticity is more dependent on the Shroud’s than the reverse, no? Prove the Shroud is authentic and these related items will of course become more popular too. I’ll have to delve more into the Manoppello (based on your comments). Again, I’m not trying to discourage study of these interesting relics. If one wishes to visit Mars, this doesn’t preclude studying the moon. But Mars is Mars..","date":"2013-09-11","mins":"2:32 pm","url":"https://shroudstory.com/2013/09/10/i-say-let-all-of-us-help-david-help-us-all/","cat":"crowdfunding","title":"I say let all of us help David help us all"},{"id":"comment-43965","author":"david_goulet","post":"Does anyone know more about the predisposition of the STURP team going into their research? Had any of them made public their thoughts on the Shroud before the event? I’m just curious as it might give us something to compare against..","date":"2013-09-12","mins":"1:52 pm","url":"https://shroudstory.com/2013/09/10/i-say-let-all-of-us-help-david-help-us-all/","cat":"crowdfunding","title":"I say let all of us help David help us all"},{"id":"comment-43818","author":"david_goulet","post":"O.K. : I And I don’t see the reason why should we exclude catholics for example. True. But one of the most compelling aspects of the STURP investigation was how you had ‘neutral’ scientists like Barry and Ray, among others, who became pro authenticity. This is why I’m in favour of truly agnostic (regarding the Shroud) scientists being involved. Because if they do become pro authenticity it is more significant..","date":"2013-09-11","mins":"2:42 pm","url":"https://shroudstory.com/2013/09/10/i-say-let-all-of-us-help-david-help-us-all/","cat":"crowdfunding","title":"I say let all of us help David help us all"},{"id":"comment-44062","author":"david_goulet","post":"What is the point in talking straight if I do it without charity?.","date":"2013-09-13","mins":"10:10 am","url":"https://shroudstory.com/2013/09/10/i-say-let-all-of-us-help-david-help-us-all/","cat":"crowdfunding","title":"I say let all of us help David help us all"},{"id":"comment-164922","author":"david_goulet","post":"Max I believe you are inexplicably confusing early Renaissance Ecclesiastical Latin, with late Medieval Ecclesiastical Latin. An oversight I’m sure..","date":"2014-10-23","mins":"1:55 pm","url":"https://shroudstory.com/2014/10/23/accusations-of-intellectual-dishonesty/","cat":"news_&_views","title":"Accusations of Intellectual Dishonesty"},{"id":"comment-43974","author":"david_goulet","post":"O.K. : But that was completely different situation, as there were no data available before Shroud examination in 1978 (which was done not only by the STURP, but by Italian team also, which is often forgotten!) This is true. But didn’t several of the team come in assuming they would be working with a piece of man made art? Undoubtedly some would have had that initial bias, yet it doesn’t seem to have impeded their scientific approach. Nor those that may have been leaning to a pro authentic conclusion. Perhaps I’m trying to find a middle ground in all this discussion. Because the landscape is so different than in 1978, when their didn’t exist a cottage industry for Shroud materials, I think Yannick makes a fair point that if someone has a very strong existing theory — one which they have published books supporting and would have something to gain or lose based on the results of new studies — then there is a danger of confirmation bias or at least the perception of it. This person brings an element of risk. On the other hand it would be silly to exclude scientists just because they may be coming into it with existing thoughts on the Shroud. I suppose ideally it would be good to have a mix of Shroud knowledgeable scientists (a Kelly Kearse for example) and some hardly knowledgeable ones. That way you avoid reinventing the wheel while also utilizing fresh eyes that might hit upon something as yet undiscovered. As with all things, a healthy balance will produce the best results. Not that I can prove that scientifically. :).","date":"2013-09-12","mins":"3:07 pm","url":"https://shroudstory.com/2013/09/10/i-say-let-all-of-us-help-david-help-us-all/","cat":"crowdfunding","title":"I say let all of us help David help us all"},{"id":"comment-44099","author":"david_goulet","post":"The arm chair QB comment was condescending. But it didn’t come unprovoked. But this is becoming more and more a counselling session and less about science. Let us agree that we are all imperfect and to endeavour to be charitable in our posts. Even if that may be a penance at times..","date":"2013-09-13","mins":"2:38 pm","url":"https://shroudstory.com/2013/09/10/i-say-let-all-of-us-help-david-help-us-all/","cat":"crowdfunding","title":"I say let all of us help David help us all"},{"id":"comment-44078","author":"david_goulet","post":"Yannick Clément : Here’s the correct version of my previous comment: Additonal note (and I hope everyone here will listen carefully): There are two things in life that I just can’t stand when I exchange with someone : Dishonesty and condescending. If you avoid using these two things with me, you’ll find our exchange being very nice and fruitful. Yannick, I would never accuse you, or anyone else here, of dishonesty. As for condescending…it is said we often accuse of others the very faults we suffer ourselves. Just an observation, not an accusation. :).","date":"2013-09-13","mins":"11:47 am","url":"https://shroudstory.com/2013/09/10/i-say-let-all-of-us-help-david-help-us-all/","cat":"crowdfunding","title":"I say let all of us help David help us all"},{"id":"comment-44100","author":"david_goulet","post":"Thanks for bringing us back to the original topic. I would add that Mr Rolfe could still pitch this as a film project, but as another documentary rather than a fiction feature. He is extremely qualified in this regard and a documentary about not only a new scientific study, but the very process to reach that point (selection of the team, wrangling permission from the Church) would make for natural drama. The circus that surrounds the Shroud is as fascinating as the Shroud itself at times – as this blog attests to. That would make for a compelling film – with the real meat of it being the coverage of the new research. I would whole heartedly support that kind of film project. As I said in the beginning, a fictional tale just doesn’t grab my imagination like the real object itself..","date":"2013-09-13","mins":"2:45 pm","url":"https://shroudstory.com/2013/09/10/i-say-let-all-of-us-help-david-help-us-all/","cat":"crowdfunding","title":"I say let all of us help David help us all"},{"id":"comment-44128","author":"david_goulet","post":"Excellent background info, thanks Daveb. There is the modern day advantage of the internet and crowd funding possibilities (like this one) that didn’t exist in 1978, so this might help get things going a bit faster. It just needs one spark — I realize that is what David Rolfe is attempting to do with his film but I don’t know if that’s enough to strike the flint. It may take what a Hollywood movie requires to get greenlit: someone with deep pockets to be the big benefactor. Anyone got Mel Gibson’s number?.","date":"2013-09-13","mins":"6:42 pm","url":"https://shroudstory.com/2013/09/10/i-say-let-all-of-us-help-david-help-us-all/","cat":"crowdfunding","title":"I say let all of us help David help us all"},{"id":"comment-43790","author":"david_goulet","post":"The majority of these, if authentic, are relics. The Manopello is dubious as a relic, more likely a work of art. None stand as enigmatic signs like the Shroud. They do not carry the same mystery — namely the mode of image formation. Not they are not worthy of deeper study and historical appreciation — but they simply do not spark the imagination like the Shroud does. Your call for more patience, however, is well taken. When the time is right, when the technology is ready, when the Church is in the mood — the science will get done..","date":"2013-09-11","mins":"12:54 pm","url":"https://shroudstory.com/2013/09/10/i-say-let-all-of-us-help-david-help-us-all/","cat":"crowdfunding","title":"I say let all of us help David help us all"},{"id":"comment-172817","author":"david_goulet","post":"Oswald acted alone. He did not conspire alone. Beyond that it’s all fascinating speculation..","date":"2014-11-24","mins":"12:01 pm","url":"https://shroudstory.com/2014/11/24/ignoring-the-weight-of-the-evidence/","cat":"news_&_views","title":"Ignoring the Weight of the Evidence"},{"id":"comment-52966","author":"david_goulet","post":"When Colin suggested this I gave it a serious consideration. Is it a plausible theory? Yes. There is no singular piece of evidence that can refute the theory and there are some cursory pieces of evidence that could support it. Is it probable? No. My main problem with the theory is that if someone was able to make this work once, why did they never make it work twice? Human ingenuity is boundless. Humans built the pyramids, crossed the Pacific in canoes, built the Rapa Nui statues – and some moderns were so astonished that we went looking for aliens to explain how they did it. Is the Shroud an object beyond the realm of a medieval artisan. No. But the Egyptians built several pyramids, the Polynesian star navigators criss crossed in the Pacific in hundreds of canoes, and there are dozens of statues on Rapa Nui. It is a human trait that once we acquire a new technique or technology that we seek to use it, or some variant of it, again and again. The medieval artisan and his team, because this was not a one man job, appear to have gone against the grain and after making this novel image formation decided to never use it again. Perhaps they were all murdered to protect the secret? Or all took a vow of secrecy upon pain of perdition? Again, this is plausible, but probable?.","date":"2013-11-27","mins":"3:23 pm","url":"https://shroudstory.com/2013/11/26/imagine/","cat":"uncategorized","title":"Imagine"},{"id":"comment-52970","author":"david_goulet","post":"Matthias :“My hands can cover my genitals (mind you, only just). That was meant as a joke, right? I did laugh when reading it. Just wanted you to know someone ‘caught’ it..","date":"2013-11-27","mins":"3:43 pm","url":"https://shroudstory.com/2013/11/26/imagine/","cat":"uncategorized","title":"Imagine"},{"id":"comment-47429","author":"david_goulet","post":"Mr Diaz, I suggest you focus your efforts on curing cancer, as you claim to be on the right track. Once cancer is cured then return to the Shroud parallels. The Shroud will still be here, but many cancer sufferers may not..","date":"2013-10-13","mins":"9:18 pm","url":"https://shroudstory.com/2013/10/12/in-a-peer-reviewed-scientific-journal/","cat":"news_&_views","title":"In a peer-reviewed scientific journal"},{"id":"comment-185442","author":"david_goulet","post":"Happy to say he proved me wrong..","date":"2015-01-22","mins":"2:48 pm","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","title":"Jeffrey Skurka on Buffalo Catholic Radio Station"},{"id":"comment-184875","author":"david_goulet","post":"He won’t apologize. The internet makes bullies of us all..","date":"2015-01-20","mins":"11:52 am","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","title":"Jeffrey Skurka on Buffalo Catholic Radio Station"},{"id":"comment-184527","author":"david_goulet","post":"The image formation explained by Marvel Comics..","date":"2015-01-19","mins":"9:25 am","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","title":"Jeffrey Skurka on Buffalo Catholic Radio Station"},{"id":"comment-151938","author":"david_goulet","post":"Are you referring to Stan Lee? He is old enough and has the creativity to pull such a stunt. (I know you meant Satan, just having some fun)..","date":"2014-09-17","mins":"11:50 am","url":"https://shroudstory.com/2014/09/17/lets-agree-to-agree/","cat":"news_&_views","title":"Let’s Agree to Agree?"},{"id":"comment-151940","author":"david_goulet","post":"Dan you seem to get it pretty good from both sides, each claiming you’re squarely in the opposition’s camp. You must be doing something right..","date":"2014-09-17","mins":"11:51 am","url":"https://shroudstory.com/2014/09/17/lets-agree-to-agree/","cat":"news_&_views","title":"Let’s Agree to Agree?"},{"id":"comment-194192","author":"david_goulet","post":"“My theory is that the image on the shroud is genuinely Jesus and caused by stains from the blood, dirt, sweat, and oil, nothing more. The oil would have the dried blood, dirt and salt from sweat dissolved into it and this would have caused some serious stains on the surface of the shroud. How simple is that?” So simple that it should be likewise simple to replicate. Give it a try..","date":"2015-03-23","mins":"6:02 pm","url":"https://shroudstory.com/2015/02/11/media-release-vision-tvs-conspiracy-show/","cat":"conspiracy_theory","title":"Media Release:  Vision TV’s Conspiracy Show"},{"id":"comment-44552","author":"david_goulet","post":"Josie all the proofs that point to the authenticity of the Shroud were uncovered by men and women who used science as their measuring stick. It is scientific investigation and not merely the waving of a fairy faith wand that has led credence to the claims of authenticity. You mock the very thing that gives you such certitude. That you can come on here and ridicule others who wish to use reason and science to further understand this mystery is to insult the One who gave us curiousity and reason to begin with. It is no disrespect to Christ to seek to understand how such a sign came to be — reason and faith are not at odds here. But if the desire to use science to play with mystery offends you, perhaps you should give this blog a pass. Most of what you read here will only frustrate you..","date":"2013-09-17","mins":"4:21 pm","url":"https://shroudstory.com/2013/09/15/more-scientific-research-on-the-shroud-of-turin-why/","cat":"uncategorized","title":"More scientific research on the Shroud of Turin? Why?"},{"id":"comment-44558","author":"david_goulet","post":"You didn’t understand Dave B when he said it is not necessary to believe it was the supernatural or the natural. He meant one doesn’t have to choose a side. One can be agnostic about how the image was formed. This is a blog where people ask a lot of questions because they don’t have the answers. As you appear to have those answers, or see no purpose in asking them, why bother posting here?.","date":"2013-09-17","mins":"6:16 pm","url":"https://shroudstory.com/2013/09/15/more-scientific-research-on-the-shroud-of-turin-why/","cat":"uncategorized","title":"More scientific research on the Shroud of Turin? Why?"},{"id":"comment-51900","author":"david_goulet","post":"Colin, if you are successful in reproducing a copy of the Shroud using your method that would indeed be a groundbreaking achievement — again it would not disprove or prove authenticity but merely establish that a medieval artisan could have made the image with the available technology. But that technology is actually so simple that could we not then say that it could have been made by someone from the 10th century, 5 century, 1st century, or even prior to that? Why stop at the medieval era for our mystery artisan?.","date":"2013-11-18","mins":"1:27 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","title":"Must See:  The Informative Mark Evans Photomicrographs"},{"id":"comment-51942","author":"david_goulet","post":"I suppose a welathy benefactor would have been involved. Not out of the ordinary in medieval times. And of course any earlier attempts would have been destroyed so that no one would know of the technique and spoil the relic’s status. I’m not saying I accept the theory, but your objections are not insurmountable..","date":"2013-11-18","mins":"5:19 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","title":"Must See:  The Informative Mark Evans Photomicrographs"},{"id":"comment-51919","author":"david_goulet","post":"Keep up the good fight, sir. We can all do with a bit more reason and lot less superstition. BTW, our long gone artisan will be in good company perhaps with those pirates that built the Oak Island treasure pit..","date":"2013-11-18","mins":"3:31 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","title":"Must See:  The Informative Mark Evans Photomicrographs"},{"id":"comment-52027","author":"david_goulet","post":"Well, there’s supposition and then there’s stretching reason. Most major works of fine art in that era were at the expense of some well to do patron so it’s not a stretch. There are other aspects of the theory that are stretchy..","date":"2013-11-19","mins":"11:47 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","title":"Must See:  The Informative Mark Evans Photomicrographs"},{"id":"comment-52127","author":"david_goulet","post":"Colinsberry : PS: How many folks here are aware of the presence of the so called sedillis marks on each of the buttocks (symmetrical sets of 3 marks each forming a triangle)? http://www.sindonology.org/papers/blood Marks Butts.shtml Mario Latendresse interprets them as an additional torture device of Roman crucifixion, and Yannick Clement, mentioned at the end of the above link, thinks they may be burns marks, not blood. I think they are where mounting bolts(sawn off to flush stubs) or maybe open bolt holes for a lifesize crucifix existed and which imaged onto the dorsal view as a scorch. They were subsequently disguised as blood marks. I’m presently revisiting some older ideas I expressed many moons ago that the Shroud was made from a crucifixion bronze from which the arms were removed and re positioned. There was probably a loin cloth to be disposed of too, but that could help resolve some oddities re the figure on the Lirey badge, especially that curious coiled belt, which Wilson interpreted as blood from the lance wound, gathered on the underside of the back, and which I previously thought could be a chain used to secure a victim. You’re off on another interesting angle. I have to say the sedellis theory does make sense as Mario posits. It was a known addition to crucifixion crosses. So it’s a logical presumption. Your full size reconfigured statue theory has some challenges. I’m not sure most of the crosses I’ve seen have the buttocks secured/bolted on the cross, it’s usually the hands and feet – just like the real victim experienced. Also this is becoming a bit of a major medieval team project. You need the scorch expert, the benefactor, some men to help with carrying the heavy statue, the blacksmith — and not any horse shoe banger — this would need to be someone so expert with working metal that he could remove the arms and reattach them without leaving so much as a seam on the image. He would have needed a team of workers because while a small crucifix heats easily and even enough on a stove, how do you get that even heating with a large corpus that would have had to have been heated in a foundry? Where did they get the statue? For your theory they are using an existing one — while certainly not uncommon to find, most statues remained in churches. I’ll help you out here. Maybe the crucifix survived a fire in its host church. It was taken to a foundry (for repair or storage) covered with a sheet. The soot on the cross left an imprint on the sheet, which someone discovered. This gave them the inspiration (heat + linen equals image) to create the fake relic, and since this cross was out of commission anyway it made for the perfect model to use – since no one would be missing it. Any major church fires in that time period and locale? However, with any conspiracy (and this would have been a conspiracy if one was trying to make a fake relic) the more people involved the more chance the secret is blown. One artisan, working alone, might have taken the secret process to his grave — but a whole team? No one tried to use the same technique to create other relics? No pilgrims noticed that the Shroud image reminded them of a cross that once adorned that burnt church in the next town? Why switch to this new theory when the one you had before (powdered body with bas relief head) was less cumbersome? It’s a great thought experiment..","date":"2013-11-20","mins":"9:56 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","title":"Must See:  The Informative Mark Evans Photomicrographs"},{"id":"comment-202391","author":"david_goulet","post":"What is the difference between a custom and a practice, archaeo cryptologically speaking?.","date":"2015-06-16","mins":"3:49 pm","url":"https://shroudstory.com/2015/06/16/of-people-who-drink-medicinal-wine-from-a-teaspoon/","cat":"news_&_views","title":"Of People Who Drink Medicinal Wine from a Teaspoon"},{"id":"comment-204182","author":"david_goulet","post":"And yet hundreds of Anglican priests (many married) have been accepted into the Catholic Church of late and carry on as ordained priests. Are we to believe that the Eucharist was not being consecrated before, but suddenly is now? What magic is this! :).","date":"2015-06-30","mins":"2:33 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","title":"Off Topic Warning:  About the Eucharist and Then Some"},{"id":"comment-73823","author":"david_goulet","post":"Joe starts every investigation with the assumption, as Randi did, that he can debunk the ‘paranormal’ claim. This is fine for 99 percent of the cases they’ve investigated. But as many have pointed out here, the Shroud is not, necessarily, a paranormal case. It could be authentic and be natural. If Joe could accept that premise then the confirmation bias that obviously impedes his research on this topic would be lessened..","date":"2014-01-20","mins":"11:59 am","url":"https://shroudstory.com/2014/01/20/oh-no-a-mean-and-nasty-smokescreener-and-clever-rationalizationer/","cat":"news_&_views","title":"Oh no, a mean and nasty smokescreener and clever rationalizationer"},{"id":"comment-204288","author":"david_goulet","post":"Pope John Paul II’s ‘ex cathedra’ statement (and it’s debatable if it was validly ex cathedra) can be over turned by another Pope who speaks ex cathedra. How is that possible? Because when Jesus gave the authority to Peter ‘whatever you bind on Earth will be bound in heaven’ He immediately qualified it with ‘and whatever you loose on Earth will be loosed in heaven.’ Jesus is essentially saying to Peter “you will eventually tie yourself in a knot and will need to loosen that knot to proceed. Whatever is done can be undone.” We have God’s permission to make mistakes and correct them. Nothing we do is irreversible. The Church’s current understanding of ‘ex cathedra’ is incomplete..","date":"2015-07-01","mins":"6:56 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","title":"Off Topic Warning:  About the Eucharist and Then Some"},{"id":"comment-50111","author":"david_goulet","post":"Who was it that said, “i will not go quietly into the night…” :).","date":"2013-11-05","mins":"9:58 pm","url":"https://shroudstory.com/2013/11/05/on-arrogance-and-second-hand-literary-wisdom/","cat":"news_&_views","title":"On arrogance and second hand literary wisdom"},{"id":"comment-51633","author":"david_goulet","post":"Well the idea of bio organic heating is relevant to any scorch theories that might have a natural, rather than man made, bent. It also goes to show that things that may not chemically react on their own can when part of a cocktail. But it really is the PBS link with Mattingly’s work that is the most intriguing aspect of the post..","date":"2013-11-16","mins":"12:52 pm","url":"https://shroudstory.com/2013/11/16/pbs-the-real-story-of-king-tut-has-become-shrouded-in-myth-with-many-mysteries-around-his-tomb-unsolved-to-this-day/","cat":"news_&_views","title":"PBS: The real story of King Tut has become shrouded in myth, with many mysteries around his tomb unsolved to this day"},{"id":"comment-51596","author":"david_goulet","post":"Dr Mattingly’s research is fascinating. Yet another avenue to dive into..","date":"2013-11-16","mins":"8:13 am","url":"https://shroudstory.com/2013/11/16/pbs-the-real-story-of-king-tut-has-become-shrouded-in-myth-with-many-mysteries-around-his-tomb-unsolved-to-this-day/","cat":"news_&_views","title":"PBS: The real story of King Tut has become shrouded in myth, with many mysteries around his tomb unsolved to this day"},{"id":"comment-38103","author":"david_goulet","post":"To be fair, Colin’s not the only one who needs this reminder. There’s enough high horses around here at times to start a Leipzig show..","date":"2013-06-26","mins":"11:54 am","url":"https://shroudstory.com/2013/06/26/personal-attacks-on-others/","cat":"news_&_views","title":"Personal Attacks on Others"},{"id":"comment-186649","author":"david_goulet","post":"Wait til Colin gets one of these onto his kitchen stove lab. ;).","date":"2015-01-27","mins":"11:03 am","url":"https://shroudstory.com/2015/01/27/picture-for-today-from-the-sindone-2015-facebook-page/","cat":"other_sites","title":"Picture for Today from the Sindone 2015 Facebook Page"},{"id":"comment-134892","author":"david_goulet","post":"Two of my favourite enigmas linked in one photo: the Shroud and the Brendan voyage. Nice..","date":"2014-07-02","mins":"12:13 pm","url":"https://shroudstory.com/2014/07/02/picture-of-the-week-lighting-up-the-night-on-the-south-jersey-shore/","cat":"uncategorized","title":"Picture of the Week:  Lighting up the night on the South Jersey Shore"},{"id":"comment-134922","author":"david_goulet","post":"And don’t forget ‘Brendan’ is an anagram giving us the old Germanic word ‘Bandern’ a plural form meaning ‘ribbons’ or ‘swaths’ of linen — a clever nod to the Shroud and it’s dual images..","date":"2014-07-02","mins":"2:23 pm","url":"https://shroudstory.com/2014/07/02/picture-of-the-week-lighting-up-the-night-on-the-south-jersey-shore/","cat":"uncategorized","title":"Picture of the Week:  Lighting up the night on the South Jersey Shore"},{"id":"comment-93477","author":"david_goulet","post":"Here’s something that doesn’t add up for me. If I’m a medieval artisan, who has presumably experimented extensively to perfect this technique, why would I accept such an imperfection as a crease on the facial area? This would be the one area I’d want to ensure was perfect. How was I so sloppy as to allow a crease to occur on an area that should be among the more ‘easy’ to scorch without creasing (vs the area between arms and body)?.","date":"2014-03-26","mins":"10:19 am","url":"https://shroudstory.com/2014/03/25/pictures-to-consider-for-the-posting-baked-in-creases-really/","cat":"uncategorized","title":"Pictures to Consider for the Posting: “Baked-In Creases. Really?”"},{"id":"comment-208738","author":"david_goulet","post":"And Waldo behind the raised speaker..","date":"2015-08-22","mins":"6:10 pm","url":"https://shroudstory.com/2015/08/22/pictures-of-the-day/","cat":"news_&_views","title":"Pictures of the Day"},{"id":"comment-93503","author":"david_goulet","post":"Thanks for the extensive reply. I’ll chew on it while you enjoy being grampsbod..","date":"2014-03-26","mins":"11:51 am","url":"https://shroudstory.com/2014/03/25/pictures-to-consider-for-the-posting-baked-in-creases-really/","cat":"uncategorized","title":"Pictures to Consider for the Posting: “Baked-In Creases. Really?”"},{"id":"comment-166714","author":"david_goulet","post":"What’s your field of expertise Al Jones?.","date":"2014-10-29","mins":"8:36 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","title":"Quote for Today on Carbon Dating of the Shroud"},{"id":"comment-46803","author":"david_goulet","post":"I hadn’t seen this originally, being a latecomer to this blog. I was expecting a smoking gun. I got a rubber dart. Colin, Mr. Gore’s romantic comment is just that a comment, a vent. It’s a nice one. His ‘question’ is a rhetorical one. He seems quite aware of the arguments against the RCD and is stating aloud his opinion that they are weak. You give such great respect to this scientist – assuming he is above reproach — but have never given the same respect to any of the STURP scientists, especially Rogers. If you want to point out hypocrisy… Why Dan closed the comments off, he will have to explain..","date":"2013-10-10","mins":"7:30 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","title":"Responding Directly to Colin Berry"},{"id":"comment-46824","author":"david_goulet","post":"You also seem to be saying that it for others to determine which scientists I should respect. Maybe they would like to do the background reading and research as well – it would save me so much time You’re right, Colin, absolutely right. Always were, always will be..","date":"2013-10-10","mins":"9:24 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","title":"Responding Directly to Colin Berry"},{"id":"comment-46826","author":"david_goulet","post":"Stop the dark insinuations? Who was the one that suggested Rogers was fudging his final papers, or even better, was being duped by others who were using him like a marionette? you do keep a record of your postings for later reference, right? Press for new testing of the Shroud? Have you been reading this blog the past month? Everyone here has been discussing just that and David Rolfe even tried a crowd funding project to that end. Cut to the chase? Try cutting the bull first..","date":"2013-10-10","mins":"9:33 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","title":"Responding Directly to Colin Berry"},{"id":"comment-46830","author":"david_goulet","post":"Rolfe’s approach wasn’t my first choice either (as you must know having read all the comments). The point is that everyone here would very much like new data, new testing. What you seem unaware of, so let me educate you, is that Church doesn’t give a rat’s petunia what any of us would like and no amount of lobbying will change that. And yes, I know your views on Rogers, but if your dark conspiracy theories are to be given a free pass, then what’s good for the goose….","date":"2013-10-10","mins":"9:47 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","title":"Responding Directly to Colin Berry"},{"id":"comment-46855","author":"david_goulet","post":"Like I said above. You have an answer for everything. The scientists that agree with your skepticism are above reproach, those that would disagree are pawns in some conspiracy. We’re all a bunch of anti science wingnuts. So why don’t you leave us to our little fantasy world and go off and play with the real scientists. Or do care for us that much, doggedly hoping to pull us out of our ignorance? That’s it isn’t it? You really care. You can’t give up hope on us. Give me a hug you big lug..","date":"2013-10-10","mins":"11:26 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","title":"Responding Directly to Colin Berry"},{"id":"comment-46874","author":"david_goulet","post":"Here’s one fact I like: no one has been able to reproduce the Shroud – though many have tried. And this one: no other relic has been found created with the same image formation process – though many have looked. And this one for balance: no one has been able to replicate the C 14 results – but that was only attempted the one time..","date":"2013-10-10","mins":"1:33 pm","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","title":"Responding Directly to Colin Berry"},{"id":"comment-46881","author":"david_goulet","post":"He’s on to us Louis. The jig is up. Our private agenda has been exposed. We’ll have to go to Plan B and set up that new blog Inquisitionstory.com No one expects the Inquisitionstory!.","date":"2013-10-10","mins":"2:01 pm","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","title":"Responding Directly to Colin Berry"},{"id":"comment-46879","author":"david_goulet","post":"“There are more things in heaven and earth, Horatio, Than are dreamt of in your philosophy. ” Keep dreaming Horatio..","date":"2013-10-10","mins":"1:55 pm","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","title":"Responding Directly to Colin Berry"},{"id":"comment-46894","author":"david_goulet","post":"Randi’s forum. Truth served with a spirit of viciousness. Just another type of lie really..","date":"2013-10-10","mins":"3:06 pm","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","title":"Responding Directly to Colin Berry"},{"id":"comment-46885","author":"david_goulet","post":"“Gentle interrogation”? Well, there’s been no water boarding, I’ll grant you that, but “gentle”? I suppose a bull in a china shop could be considered gentle, when compared to a tank..","date":"2013-10-10","mins":"2:38 pm","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","title":"Responding Directly to Colin Berry"},{"id":"comment-46897","author":"david_goulet","post":"Relic fixated obsessives….like the type that would take the time to experiment with leeches to see if that was how the blood got on the relic? Yeah there’s a few of us here. Good company. Thin skinned — said the carrot to the apple. I like the tattoo idea, though..","date":"2013-10-10","mins":"3:12 pm","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","title":"Responding Directly to Colin Berry"},{"id":"comment-47691","author":"david_goulet","post":"Keep moving the goalposts, you’ll score eventually,.","date":"2013-10-16","mins":"7:00 pm","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","title":"Responding Directly to Colin Berry"},{"id":"comment-146160","author":"david_goulet","post":"Colin, I only have a high school degree in science and I know how to use “scielntific methodology”. You want to have a go at TH, be my guest, but get off that bloody high horse first. I know scores of people who have no degree and who are just as versed in the scientific method as any of you pontificiating blowhards here. I don’t care who is published in what journal. I don’t care if you present your opinions/studies in pdf’s,on papernapkins or written in the sand. I think it best I take a break from this blog, all Shroud blogs for awhile, because the lot of you are becoming insufferably pretensious boors. ..","date":"2014-08-25","mins":"10:34 pm","url":"https://shroudstory.com/2014/08/25/resting-on-our-laurels/","cat":"news_&_views","title":"Resting on Our Laurels"},{"id":"comment-146260","author":"david_goulet","post":"Gents, I must apologize. I was in a terse mood last night (for various reasons) and should have refrained from posting until after a good night’s sleep. I am sensitive, I suppose, to people who flash their degrees around. Neither of my parents attended university, my mom didn’t even finish high school and my dad was a country undertaker. My town was made up of farmers and lumbermen – not a degree among them. But many of them were absolutely brilliant thinkers, engineers and ‘scientists’. Colin, your educational background and experience as a scientist is impressive – and anyone here that belittles it is foolish to do so. You have a right to defend your hard earned knowledge, but be mindful when doing so that life is a pretty good university. All of us have earned degrees of some form at that school — even if we don’t have the paperwork to hang on a wall..","date":"2014-08-26","mins":"7:48 am","url":"https://shroudstory.com/2014/08/25/resting-on-our-laurels/","cat":"news_&_views","title":"Resting on Our Laurels"},{"id":"comment-146277","author":"david_goulet","post":"You were provoked, agreed. Flaunting is not the right word. But there was collateral damage with your defense, in my opinion. I know that was not your intention. If I may add one further observation on this point (before I become the tedious boor), I really appreciate the attitude of Hugh Farley on this site. He’s as patient as Job, even when the jabs come his way. His defense is not a tirade but a relentless sticking to the facts. This prevents debate spiraling off into these very kinds of discussions we’re having now. I find this attitude forces me to also stick to the facts, the science (while still allowing for some out of the box thinking). The end result is the science is better served, better defended. There is an expression (Flaherty?) “to the hard of hearing one must shout”. But it is also true that if you shout all the time, others go deaf. Now let’s get back to the good stuff. I wish there was a Shroud Expo where guys like you and TH could meet and would have access to a lab and could do these experiments right there. No need for pdfs. They have these communal labs in many cities now, where entrepreneurs and tinkerers can share 3 D printers and other technology. Why not a Shroud Expo like that instead of just dry lectures all the time? If we can’t get the Vatican/Turin to allow STURP 2.0 could we not at least try something like this?.","date":"2014-08-26","mins":"9:16 am","url":"https://shroudstory.com/2014/08/25/resting-on-our-laurels/","cat":"news_&_views","title":"Resting on Our Laurels"},{"id":"comment-146280","author":"david_goulet","post":"Sorry, Colin. But once you post anything on the internet, it’s public domain. As long as Dan credits you properly there’s nothing you can do about it. That being said, Dan, I would ask that you honour Colin’s request as I believe that he is owed that professional courtesy. A simple link to his response would be fair..","date":"2014-08-26","mins":"9:21 am","url":"https://shroudstory.com/2014/08/25/resting-on-our-laurels/","cat":"news_&_views","title":"Resting on Our Laurels"},{"id":"comment-165161","author":"david_goulet","post":"Nice post, Dan. Brother Guy is a favourite of mine. His ability to present faith and reason as not being mutually exclusive makes him a Christian for our times..","date":"2014-10-24","mins":"9:46 am","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","title":"Scientific truth is a pathway to God"},{"id":"comment-82061","author":"david_goulet","post":"You mean like someone saying: “it’s important to emphasize that this would not, in any way, cast more doubts over the reality of his Resurrection or his divine nature… We should never forget the true reality of the Incarnation in the flesh!” I’m sure scientists would find that a very rational statement. :).","date":"2014-02-24","mins":"2:49 pm","url":"https://shroudstory.com/2014/02/23/should-ssg-get-involved/","cat":"news_&_views","title":"Should SSG Get Involved?"},{"id":"comment-165295","author":"david_goulet","post":"The story reminds me Wilde’s The Selfish Giant..","date":"2014-10-24","mins":"8:19 pm","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","title":"Scientific truth is a pathway to God"},{"id":"comment-82108","author":"david_goulet","post":"Yannick Clément : The cheap shot I refer to is what David said above… How is that a cheap shot?! You only want to allow ‘science’ any say on the Shroud, but then ‘profess’ from faith when speaking of the Resurrection. But heaven forbid if anyone else were to do the opposite. Don’t get mad then if someone calls you on it — in a friendly way..","date":"2014-02-24","mins":"5:14 pm","url":"https://shroudstory.com/2014/02/23/should-ssg-get-involved/","cat":"news_&_views","title":"Should SSG Get Involved?"},{"id":"comment-82355","author":"david_goulet","post":"Would it be helpful if we defined what ‘supernatural’ means, as it seems not all of us are on the same page. To me, supernatural – in regards to the Shroud/Resurrection — means something that occurred that our current understanding of nature does not provide a closed explanation for. Were the laws of Nature, as we know them, broken Easter morning? We do not know because ‘we don’t know what we don’t know’ about all those laws. For others supernatural may be utterly pure imaginative fantasy. It was the leprechauns that raised Jesus from the grave! I believe there is room for the former definition in serious sindonology, but not the latter..","date":"2014-02-25","mins":"11:41 am","url":"https://shroudstory.com/2014/02/23/should-ssg-get-involved/","cat":"news_&_views","title":"Should SSG Get Involved?"},{"id":"comment-82350","author":"david_goulet","post":"Perhaps I misread your intention, if so I do apologize. Perhaps I have mixed apples and oranges, but I always did enjoy a good fruit salad. :).","date":"2014-02-25","mins":"11:32 am","url":"https://shroudstory.com/2014/02/23/should-ssg-get-involved/","cat":"news_&_views","title":"Should SSG Get Involved?"},{"id":"comment-134694","author":"david_goulet","post":"Louis, perhaps you should take a break from posting for a while, you are starting to make a fool of yourself with these petty attacks. You have better insights to offer than that..","date":"2014-07-01","mins":"11:08 am","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","title":"Shroud Encounters of the Wikipedia Kind"},{"id":"comment-135096","author":"david_goulet","post":"Good point. Had Jesus been clean shaven he would have stood out for that alone, given the milieu. For the Gospel depictions of him, especially during his final days, I picture a man more akin to John the Baptist in appearance. He certainly didn’t go the cross clean shaven — beard torn by an angry mob perhaps — but not barbershop fresh that’s for sure..","date":"2014-07-03","mins":"9:42 am","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","title":"Shroud Encounters of the Wikipedia Kind"},{"id":"comment-135102","author":"david_goulet","post":"I have reflected more on the photos with Colin’s observation in mind: is there really a moustache and beard on the man in the Shroud or could it be impactogram affect? It is a great question. If this is the face of Jesus then we are talking about a man whose face has taken a beating. It is a death mask. What kind of swelling might have occurred around his chin and mouth area? Did he fall on his face while carrying the cross? How badly was he struck on the face by guards or the mob? Was his facial hair torn out by zealous Jewish guards or clerics and what does such violence do to the area where the hair is pulled out? How much blood, saliva, and dirt encrusted into his facial hair? How much might have been wiped away by the mourners? Was his face and facial hair anointed with oil and other products affecting image formation? If this is Jesus then impact does play a great part in that facial image, but it is the impact not of a funeral shroud that weighs heaviest but the impact of human violence — and hopefully thereafter, human love..","date":"2014-07-03","mins":"10:35 am","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","title":"Shroud Encounters of the Wikipedia Kind"},{"id":"comment-216579","author":"david_goulet","post":"This blog was my gateway drug into the addictive realm of Shroudology. I sensed this day was coming, hoped it would be a long while yet. If, as Louis suggests, Turin/Rome does monitor this site I’d hope this blog has demonstrated how essential it is to convene STURP 2.0. Wheels are spinning needlessly while the object of our affection lies waiting to share its secrets. Faith never need fear science, because both seek the Truth. If the Shroud is not authentic it remains a work of art that inspires faith. If it is authentic it’s formation should inspire science. Let’s stop talking about what it could be and start discovering what it is. To keep the status quo, of opaque science and transparent superstition, is an insult to the Creator. Thanks Dan for all your hard work, wit and patience. This Catholic is grateful an Episcopalian led the way in providing the penultimate platform for Shroud discussion. Hat tip to Dan!.","date":"2015-12-15","mins":"10:08 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-165165","author":"david_goulet","post":"“As to whether the Shroud is really authentic or not, I don’t think any of this correspondence sheds any light on the matter at all!” It doesn’t. Not one iota..","date":"2014-10-24","mins":"9:51 am","url":"https://shroudstory.com/2014/10/23/accusations-of-intellectual-dishonesty/","cat":"news_&_views","title":"Accusations of Intellectual Dishonesty"},{"id":"comment-45198","author":"david_goulet","post":"My mom had an expression she used when talking about miracles. “Every time you tell someone about a miracle you lose a little piece of it.” She believed that miracles were meant for those that personally experienced them. They were rewards of faith and not meant as proofs. They were to be treasured in the quiet of one’s heart. When a person started sharing the miracle with others, doubt would enter the picture. Someone would offer an alternative rational explanation that dulled the miracle’s shine. The more the miracle was used as a proof, the less it came to mean to the person(s) that experienced it. The Catholic Church does warn that miracles and apparitions are in the realm of private revelation. I think The Church is on the same page as my mom..","date":"2013-09-23","mins":"10:28 am","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","title":"The Eucharistic Miracle of Buenos Aires"},{"id":"comment-143577","author":"david_goulet","post":"Phillipa Foster’s article is a bit weak, imo. She notes that Kodak technicians felt the Guadalupe image had photographic properties but doesn’t provide further details. Just because an image that predates photography has photographic characteristics doesn’t mean it is miraculous. There may be many types of image formation that mimic photography and vice versa. One could take a photograph and claim “it has scorch like characteristics”..","date":"2014-08-12","mins":"2:25 pm","url":"https://shroudstory.com/2014/08/12/the-latest-bsts-newsletter-is-out/","cat":"news_&_views","title":"The Latest BSTS Newsletter is Out"},{"id":"comment-174933","author":"david_goulet","post":"Nicely summarized, Hugh..","date":"2014-12-06","mins":"10:06 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-174686","author":"david_goulet","post":"Aljones — you don’t find it odd that the only piece of evidence that points to a medieval provenance (your words not mine) is the C14 dating? Surely a medieval man made artifact should have more scientific evidence that exposes its provenance, no? You have no doubt the sampling (if not the method and result) may have been flawed — when a host of testing protocols were oddly not followed? You have a rather narrow definition of science..","date":"2014-12-04","mins":"8:28 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-36296","author":"david_goulet","post":"Sounds like quack science to me..","date":"2013-06-06","mins":"11:15 am","url":"https://shroudstory.com/2013/06/06/the-mallard-reaction/","cat":"humor","title":"The Mallard Reaction"},{"id":"comment-202625","author":"david_goulet","post":"I, for one, agree with your Rosetta comparison. We could very likely solve the authenticity question of the Shroud with a new STURP 2.0 investigation – using non destructive methods. What are we afraid of? That we will be guilty of putting God to the test? Here’s a newsflash: God wants us to put Him to the test – because it means we are searching for Him – the Truth. Yes, I know Jesus – in the desert – answers the Devil with: “thou shall not put they Lord and God to the test.” But he speaks here of a test of God’s Will and of his own identity as Son of God. That is a very different type of test. To test the Shroud is not to test God Himself – it is to test a relic. It is a test, for some, of our own faith – to see what is it exactly we do believe in: Jesus or an icon. That’s a necessary distinction to know for our spiritual health. If we go into a new set of tests, with a sincere desire simply to know the truth, and not to prove our personal position on the matter, we will be fulfilling our God given desire to turn a question mark into a period. Let’s avoid the exclamation marks this time around..","date":"2015-06-18","mins":"7:48 am","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","title":"The Masters of Comedy in Piedmont"},{"id":"comment-202660","author":"david_goulet","post":"A fair point Nabber. I wasn’t trying to poke anyone’s eye..","date":"2015-06-18","mins":"12:32 pm","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","title":"The Masters of Comedy in Piedmont"},{"id":"comment-201330","author":"david_goulet","post":"I was in Turin last week, providentially, and was able to view the Shroud (my first time to do so). It was nice to finally see in person what is our topic of passionate discussion here. I was struck by the rather meager tourist industry presence. Yes, I did see school trips and many other bus loads of pilgrims coming to see the Shroud, but apart from a few souvenir stalls and the official Shroud library presence, the overall environment was one of quiet reflection. Some commenters here have implied that the Church has no interest in retesting the Shroud as it is a relic/cash cow. I’m sure the Shroud when displayed does pump the tourism industry in Turin but this is not Lourdes, Fatima or Medjegorie — the vibe is very much different. As a pilgrimage site it is, like the icon itself, enigmatic..","date":"2015-06-08","mins":"9:36 am","url":"https://shroudstory.com/2015/06/08/the-pope-and-the-tramps/","cat":"2015","title":"The Pope and the Tramps"},{"id":"comment-73340","author":"david_goulet","post":"Louis :David, who had access was Mme. Mechthild Flury Lemberg, and I think it was she who advised Turin to remove the cloth. I think it was a good decision as it would have to be done sooner or later, you see? Flury Lemberg’s decisions had the approval of Pope John Paul II. Is it the practise of the Turin authorities to act on the recommendation of one researcher? I do hope someone else corroborated Mme flury Lemberg’s advisement..","date":"2014-01-14","mins":"5:32 pm","url":"https://shroudstory.com/2014/01/14/the-questionable-restoration-of-the-shroud-of-turin/","cat":"news_&_views","title":"The Questionable Restoration of the Shroud of Turin"},{"id":"comment-73329","author":"david_goulet","post":"Louis, do you get the sense that some insiders (art curators, researchers) trusted by the Turin authorities have had priviledged access to the Shroud? For example, who identified this soot bomb? It’s not mentioned anywhere else, so it was not obvious to other researchers. It would have to have been identified by someone with both expertise and access to the Shroud. When was that access granted, and to whom?.","date":"2014-01-14","mins":"4:33 pm","url":"https://shroudstory.com/2014/01/14/the-questionable-restoration-of-the-shroud-of-turin/","cat":"news_&_views","title":"The Questionable Restoration of the Shroud of Turin"},{"id":"comment-73461","author":"david_goulet","post":"I don’t doubt for a minute that Mme Flury Lemberg and the Turin authorities had the best intentions, and that restoration work was necessary. But it would have been ideal had they been more open about the process from the beginning – for the very reason that other experts might have offered input on that process. We might have much more subsequent materials from the restoration to study. Fewer errors. I feel the way it was handled did not provide very helpful optics on the whole endeavour. But as Anoxie has said, ‘what’s done is done’ — we take the lessons learned and move forward..","date":"2014-01-16","mins":"12:16 pm","url":"https://shroudstory.com/2014/01/14/the-questionable-restoration-of-the-shroud-of-turin/","cat":"news_&_views","title":"The Questionable Restoration of the Shroud of Turin"},{"id":"comment-197407","author":"david_goulet","post":"“and made Wilson a laughing stock among the Byzantine specialists” Perhaps you could direct us to a copy of Byzantine Monthly or a blog site for these Byzantine specialists (any one of the dozens that must exist) that supports this assertion?.","date":"2015-04-24","mins":"8:30 am","url":"https://shroudstory.com/2015/04/23/the-real-meaning-is-not-authenticity/","cat":"2015","title":"The Real Meaning Is Not Authenticity"},{"id":"comment-197323","author":"david_goulet","post":"There is a difference between ‘aping’ and coming to a similar conclusion from a different route. Colin is on a similar thought pattern but coming from a medieval point of view, you came to your theory from a 1st century point of view. Good on you both. It’s a win win. So please can we see a little graciousness and get on with discussing the merits of the theories..","date":"2015-04-23","mins":"2:13 pm","url":"https://shroudstory.com/2015/04/23/the-real-meaning-is-not-authenticity/","cat":"2015","title":"The Real Meaning Is Not Authenticity"},{"id":"comment-197410","author":"david_goulet","post":"Dan remains silent perhaps because, as you freely admit, your blog is like reading someone who is thinking out loud. He may be waiting for you to come to a conclusion before directing traffic toward you. The sweat imprint is an intriguing one and I find it superior to your previous one. You and Max, coming at it from different time stamps, have at least naturalistic theories that can be explored. I wish Max’s theory could be tested more with experimentation as yours is. He needs a protégé in a university looking for a Ph D project..","date":"2015-04-24","mins":"8:38 am","url":"https://shroudstory.com/2015/04/23/the-real-meaning-is-not-authenticity/","cat":"2015","title":"The Real Meaning Is Not Authenticity"},{"id":"comment-197406","author":"david_goulet","post":"Thanks for this, Hugh. Very helpful. I look forward to Max’s addenda/clarifications of his theory..","date":"2015-04-24","mins":"8:27 am","url":"https://shroudstory.com/2015/04/23/the-real-meaning-is-not-authenticity/","cat":"2015","title":"The Real Meaning Is Not Authenticity"},{"id":"comment-197412","author":"david_goulet","post":"You accuse Colin of aping your theory, yet you make a monkey of yourself with your ad hom attacks, Max. Are you the only one who hasn’t noticed how much Colin has dialed down the rhetoric of late? Yes, he’s still snarky and gets a jab in here and there, but his behavior has become much more conciliatory and he’s obviously made a great effort not to get into a name calling shouting match with you. You seem incapable of disciplining yourself in a similar manner. I’m not suggesting you forget the recent past on this blog, but I don’t see how digging up old wounds helps advance the discussion. A simple “I told you so” is the best line one can have when a rival finds himself swimming in the same end of the pool as you. You didn’t invent the pool or the water in it..","date":"2015-04-24","mins":"8:48 am","url":"https://shroudstory.com/2015/04/23/the-real-meaning-is-not-authenticity/","cat":"2015","title":"The Real Meaning Is Not Authenticity"},{"id":"comment-197418","author":"david_goulet","post":"To be honest I couldn’t help but use the joke. Mea culpa, mea culpa, mea MA Xima culpa..","date":"2015-04-24","mins":"9:21 am","url":"https://shroudstory.com/2015/04/23/the-real-meaning-is-not-authenticity/","cat":"2015","title":"The Real Meaning Is Not Authenticity"},{"id":"comment-197419","author":"david_goulet","post":"Sorry, by naturalistic I meant non miraculous. Your model is quite good. I’d like to see how it looks photographed (a la 2nd Pia) and then with Image J – just to see how it’s comparing on those fronts. All in good time I’m sure..","date":"2015-04-24","mins":"9:30 am","url":"https://shroudstory.com/2015/04/23/the-real-meaning-is-not-authenticity/","cat":"2015","title":"The Real Meaning Is Not Authenticity"},{"id":"comment-197333","author":"david_goulet","post":"I tried..","date":"2015-04-23","mins":"3:09 pm","url":"https://shroudstory.com/2015/04/23/the-real-meaning-is-not-authenticity/","cat":"2015","title":"The Real Meaning Is Not Authenticity"},{"id":"comment-38218","author":"david_goulet","post":"Dan, I was wondering if your search engine might pick up the article. I actually wrote this before the latest dust up by some of the lads here. I really need to update that headshot..","date":"2013-06-27","mins":"9:56 am","url":"https://shroudstory.com/2013/06/27/the-shroud-of-barrys-bay/","cat":"news_&_views","title":"The Shroud of Barrys Bay"},{"id":"comment-35136","author":"david_goulet","post":"One person can see objects, another cannot. The famous Find The Cat exercise demonstrates that some people are more visually attuned for certain patterns/objects. It took me awhile to find those cats, but once I did – or was shown where they were – I recognized them as cats and can now find them again without delay. So why can’t I see these coins even when I have been shown where and what to look for? I once went ghost hunting with friends of our family. We sat in a car looking for the ghost light that is said to appear at the base of a hill. Our driver said she could see lights and got spooked. She drove down the hill claiming she could see the lights. She then slammed the brakes on because she was certain the lights were now right ahead of her on the road. When the light passed she tore out of there like a bat out of hell. I never, at any time, saw the ghost light she was adamant was there. And I can assure you that this woman was not acting or pranking us – she was sincerely terrified. She saw something, I did not. Whose reality should others accept when we tell the same story? I don’t mean that rhetorically. I’m not sure of the answer myself..","date":"2013-05-28","mins":"4:59 pm","url":"https://shroudstory.com/2013/05/28/the-vagaries-of-human-visual-perception-and-individual-judgment/","cat":"news_&_views","title":"The vagaries of human visual perception and individual judgment"},{"id":"comment-48401","author":"david_goulet","post":"Our nose is made of cartilage, not bone, right? So a broken nose is not a broken bone. How’s that for trivial? :).","date":"2013-10-22","mins":"9:53 am","url":"https://shroudstory.com/2013/10/22/todays-how-do-we-know-the-mans-bones-were-not-broken/","cat":"how_do_we_know","title":"Today’s How do we know: the man’s bones were not broken"},{"id":"comment-45401","author":"david_goulet","post":"I only hit 10% with my campaign, so this wasn’t a bad showing. You don’t know unless you try, so kudos to Rolfe for taking a shot at it. Hopefully it may still open some doors for him..","date":"2013-09-25","mins":"1:19 pm","url":"https://shroudstory.com/2013/09/25/too-bad/","cat":"crowdfunding","title":"Too Bad"},{"id":"comment-204169","author":"david_goulet","post":"Even if we were to leave the man affected climate change argument aside, one doesn’t need to be a scientist to agree with the horse sense of the rest of the encyclical. How we’ve turned the planet into a giant rubbish bin, how practises like fracking are dangerous, how the consumerism of our age is using up resources for trivialities, etc. We either take our responsibility as stewards for creation seriously, or we will reap the consequences..","date":"2015-06-30","mins":"1:15 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-204172","author":"david_goulet","post":"Easiest position in the world is be a contrarian. Good luck with that..","date":"2015-06-30","mins":"1:32 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-204177","author":"david_goulet","post":"I wish Colin was still following this blog. You of all people talking about ‘real science’. Irony..","date":"2015-06-30","mins":"1:50 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-204183","author":"david_goulet","post":"I know you never met a question mark that you didn’t want to turn into an exclamation point. Beyond that, no, you are correct, I do not know squat about you. My loss..","date":"2015-06-30","mins":"2:37 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-73220","author":"david_goulet","post":"As a Catholic,I personally feel the very concept of relics is itself a relic. The Church can say what it wants but there is no real rhyme or reason to relics – as your questions demonstrate. They are simply mementos that we have imbued with holy significance. Relics cannot produce miracles. It is our faith that creates miracles — Jesus told us this. If an object triggers that faith that’s well and good but the minute we believe it was the object that caused the miracle then we have left the realm of faith and entered superstition. I would make just one caveat for relics linked to Christ – such as the Sudarium and the Shroud. These are unique and the Shroud goes beyond being a relic and is indeed a sign (to the authentist).","date":"2014-01-13","mins":"8:22 am","url":"https://shroudstory.com/2014/01/13/when-is-a-relic-not-a-relic/","cat":"news_&_views","title":"When is a relic not a relic?"},{"id":"comment-73534","author":"david_goulet","post":"May the first church that makes a claim of ownership of this Sign be anathema. As you have stated this relic belongs to all…and to none..","date":"2014-01-17","mins":"10:05 am","url":"https://shroudstory.com/2014/01/13/when-is-a-relic-not-a-relic/","cat":"news_&_views","title":"When is a relic not a relic?"},{"id":"comment-216754","author":"david_goulet","post":"One wound, or blood mark, I would expect to see (if this was a medieval work) is a mark across the forehead where the crown of thorns was traditionally thought to have been impressed into Jesus’s skin. Much has been made of the ‘too perfect’ scourge marks across the back and legs — and the wrist wounds (or hand wounds depending on one’s perception) are well defined. Yet the artisan settles for a singular epsilon blood curl instead of a blood trail across the forehead? That leaves me scratching my head..","date":"2015-12-17","mins":"9:39 pm","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-215811","author":"david_goulet","post":"I’ve often wondered if only the face was displayed, over the course of some centuries, then should we not see a difference in the linen itself of that exposure? Is there any sign on the linen that the face area has received more contamination (light, airborne, etc) than the rest of the ‘hidden’ linen?.","date":"2015-12-07","mins":"1:05 pm","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-215815","author":"david_goulet","post":"I don’t see the lack of public display as a deal breaker at this point. The Shroud could have been ‘lost’ for centuries — this certainly is not unheard of with ancient objects (King Tut’s tomb comes to mind). I also don’t see why exploration into image formation needs to be an either/or proposition. One can explore both avenues (ancient or medieval) – perhaps favouring one or the other as one sees fit – but leaving the possibility open that the road may taken them to the other side of the debate. The medieval provenance has a strong case: C 14, first indisputable public record, lack of bullet proof evidence to the contrary. Looking for how a craftsman of the time may have achieved the image should be explored more than perhaps it has – by those who have access to the relic. But looking for naturalistic explanations that gel with authenticity also should continue to be explored. The more fantastic theories — one never knows if something might prove fruitful — are okay but I agree they are currently given much more attention and resource than the more rational theories above..","date":"2015-12-07","mins":"1:33 pm","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216147","author":"david_goulet","post":"What was the tradition of the time for such relics of this magnitude I wonder? The Ark of the Covenant was the type of relic that no one save the high priests would have been allowed to see the tablets within. Yet the ark itself was venerated. If this chest did house the image of God perhaps it too was treated similarly to the ark. As such, I don’t see Mario’s assertion as ridiculous at all..","date":"2015-12-10","mins":"12:28 pm","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216159","author":"david_goulet","post":"Glad Colin agrees with me! There is hope for him yet perhaps. :).","date":"2015-12-10","mins":"2:54 pm","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216161","author":"david_goulet","post":"From my background (as you know) Total Plot Amnesia is a grave digger’s nightmare..","date":"2015-12-10","mins":"3:13 pm","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216165","author":"david_goulet","post":"Returning the plot back to Colin’s main observation, that being the glaring lack of artistic representation (of the non allusion type) in the historic record, we have to acknowledge this is a very curious fact. But as I’ve mentioned in other comments, it’s not without parallels to other objects. If the faithful truly believed the Shroud was ‘an image not made by human hands’ but a miraculous gift — an imprint of the Son of God — this would make it more than a relic. It (and it’s reliquary) would be akin to the Ark of the Covenant that held the Commandments. The Shroud — sign of the New Covenant. To this day the Ark, supposedly housed in a small chapel in Ethiopia, is not opened for anyone. Such is the power of superstition and/or faith. Given the superstitious nature of the faithful of the turn of the millennium (as Dave B has commented upon), led to believe whatever the clergy told them, is it difficult to imagine that the Shroud was kept from direct viewing? For who can look upon on the face of God and live?! No doubt this will all seem like fanciful authentist claptrap, but God is both Science and Narrative. The enigma of the Shroud is proof of that..","date":"2015-12-10","mins":"3:59 pm","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-216342","author":"david_goulet","post":"Louis the article about what Jesus may have looked like is interesting but to think the Shroud could not be authentic because Jesus has long hair in it is rather silly actually. While Jesus likely had shorter hair during his early ministry, at the time of his execution Jesus was anything but an observant Jew. He had spent time in the desert, like The Baptist, and had become counter cultural in so many aspects of his life. He may also have seen himself as something of a Nazarite at this time, like Samson he would have to die to save his people. Paul of course would not have been privy to any of this, for he never met Jesus during that time..","date":"2015-12-12","mins":"4:50 pm","url":"https://shroudstory.com/2015/12/06/why-didnt-i-think-of-that/","cat":"news_&_views","title":"Why Didn’t I Think of That"},{"id":"comment-56715","author":"david_goulet","post":"I agree with the sentiment but what does one expect when some Christians use their beliefs to mock the unbelief of others. I’ve seen the ‘alleged’ authenticity of the Shroud proclaimed triumphantly to be a proof of Christ’s divinity and woe to those who choose not to believe now in Him. Any wonder then that skeptics trample the Shroud under foot? The minute we start using the Shroud as a proof we are the ones trampling it underfoot. It is a sign — not a propoganda poster..","date":"2013-12-05","mins":"11:13 am","url":"https://shroudstory.com/2013/12/05/you-need-to-read-both-lines-of-the-headline/","cat":"humor","title":"You need to read both lines of the headline"},{"id":"comment-56799","author":"david_goulet","post":"One man’s holy treasure is another man’s knick knack.Even the Shroud, as precious an ‘icon’ that it is, and seen as holy by believers — is still but a sign pointing at that which is truly holy. Jesus urges us to see the holiness within ourselves and each other, first and foremost. I often ask myself, when confronted by the latest brazen anti Christian offence, “would Jesus be offended by this or am I projecting my self righteous indignation onto it?” For example, if someone vandalized my church would that be an offense against Christ? It is certainly a slap in the face to those that worship there (reason enough to decry it) but even the darkest acts cannot overcome the light — for in the end the light will dispel every patch of darkness. In the end God gets the last laugh, so who am I to appropriate His anger?.","date":"2013-12-05","mins":"4:26 pm","url":"https://shroudstory.com/2013/12/05/you-need-to-read-both-lines-of-the-headline/","cat":"humor","title":"You need to read both lines of the headline"}]
