[{"id":"comment-168665","author":"david_goulet","post":"But Max it would seem that this reaction you theorize would have happened to more Second Temple burial shrouds than just Yeshua’s. Why is this phenomenon not seen elsewhere? And why can’t we replicate it with modern methods – which seem available to be tested with..","date":"2014-11-04","mins":"1:54 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-168655","author":"david_goulet","post":"I’d like to question an assumption both Colin and Charles have, and that is that the TS image was darker/clearer originally than it is today. If the ‘invisible ink’ properties were in play (naturally rather than man made) then it’s quite possible the TS image was originally much less dark/clear than it is now. It could have gone, however, from ‘invisible’ to dark to faded over time as well. Food for thought..","date":"2014-11-04","mins":"1:31 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-168666","author":"david_goulet","post":"As vexing as Shroudstory can be, for all sides, it is currently the best site for rigorous debate on the various Shroud topics. Take a break, but do come back and bring your friends and their credentials with them..","date":"2014-11-04","mins":"1:57 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-169345","author":"david_goulet","post":"“So perhaps the Shroudies will win after all.” It saddens me that we have to speak in terms of winning or losing on this matter. The search for, and finding of, the truth should be a ‘win’ for everyone. If it isn’t then we probably have more invested in this debate than we can personally admit..","date":"2014-11-06","mins":"4:18 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-206229","author":"david_goulet","post":"Agreed, Daveb. They were indeed expecting a Messiah, that’s the core of the story of Israel to that point. The sons of Zebedee certainly thought Jesus was going to kick some butt. So too those who feted him on Palm Sunday. Jesus, however, was not the Messiah they had anticipated. That’s why he was executed without a revolt occurring. Even his own followers had lost faith in him – he was not ‘the Anointed one’ after all. Then the big reveal by God — Jesus wasn’t just the Messiah of the Jews of that time, He was/is Messiah of all humanity throughout time. It may have taken me a century to digest that reality too..","date":"2015-07-20","mins":"3:58 pm","url":"https://shroudstory.com/2015/07/17/a-reflection-on-the-shroud-and-zechariah/","cat":"article","title":"A Reflection on the Shroud and Zechariah"},{"id":"comment-206271","author":"david_goulet","post":"Good observation. So many of Jesus sayings make much more sense when one sees him as a builder. He speaks of stones that the builders rejected, building on solid ground and of making Peter his ‘rock’..","date":"2015-07-21","mins":"8:18 am","url":"https://shroudstory.com/2015/07/17/a-reflection-on-the-shroud-and-zechariah/","cat":"article","title":"A Reflection on the Shroud and Zechariah"},{"id":"comment-206279","author":"david_goulet","post":"Ken Campbell has a very good article on this topic: http://www.etsjets.org/files/JETS PD Fs/48/48 3/JETS 48 3 501 519.pdf.","date":"2015-07-21","mins":"9:19 am","url":"https://shroudstory.com/2015/07/17/a-reflection-on-the-shroud-and-zechariah/","cat":"article","title":"A Reflection on the Shroud and Zechariah"},{"id":"comment-206292","author":"david_goulet","post":"You seem to be now saying that no Jew was anticipating a Suffering Messiah – this is true – but that’s not what you implied earlier. The Jews were very much expecting a Messiah and they also were aware of a Suffering Servant motif. It’s in Jesus that those who ‘see’ him, after his resurrection, come to understand that He is both. It’s after his Passion that the Suffering Messiah becomes a theme. Can we agree on that?.","date":"2015-07-21","mins":"12:53 pm","url":"https://shroudstory.com/2015/07/17/a-reflection-on-the-shroud-and-zechariah/","cat":"article","title":"A Reflection on the Shroud and Zechariah"},{"id":"comment-206327","author":"david_goulet","post":"It is a question of faith more than exegesis. The first believers, being Jews, looked back at the OT and connected these themes and prophecies to Jesus – one can see why. Did the OT author have Jesus in mind when he wrote of these things — no, how could he without a crystal ball? But that doesn’t mean the Spirit wasn’t inspiring him. Do you believe in prophecy – a divine foreshadowing of things to come? If not, then linking Jesus to these OT themes is an exercise in confirmation bias – reading into the past things we wish to see a pattern for. This is a valid, rationalistic viewpoint. But if you believe in prophecy, and that God has written Himself into our human story, then the OT is more than just a history of the Jewish people. It is the precursor to what will be the heart of the story. And what author doesn’t use set ups and pay offs in his tale? The OT is the set up, the Gospels are the pay off. As you pointed out, many Jews did not ‘convert’ to be followers of Jesus post Easter. But many did. Some saw the connection to the OT, some did not. God doesn’t force belief on any of us..","date":"2015-07-22","mins":"10:06 am","url":"https://shroudstory.com/2015/07/17/a-reflection-on-the-shroud-and-zechariah/","cat":"article","title":"A Reflection on the Shroud and Zechariah"},{"id":"comment-163205","author":"david_goulet","post":"Totally uncalled for ad hom attack which the moderator should remove!.","date":"2014-10-17","mins":"4:10 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163213","author":"david_goulet","post":"I recall Charles suggesting that research be done into possible alternate historical routes for the shroud, from Jerusalem to Europe. Why we would he do that if he was not at least open to the possibility of authenticity? Can you point to actual postings where there is evidence of him deliberately providing misinformation? I’m not talking about debatable conjecture but clear examples where he provided misinformation and was called on it. I believe if you are going to accuse someone of conspiring to mislead you need to provide evidence. Again, I’m not an apologist for Charles, I’m not convinced by his theory — but neither am I convinced he is a wolf in sheep’s clothing….not until someone shows me some dog hair..","date":"2014-10-17","mins":"4:41 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-164918","author":"david_goulet","post":"How can Hugh do his homework if the references you noted are unpublished?.","date":"2014-10-23","mins":"1:44 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-164923","author":"david_goulet","post":"Let me guess, you found them at the public library. If one is naïve then one cannot ignore, i.e. You cannot ignore that which you do not know about..","date":"2014-10-23","mins":"1:57 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-164929","author":"david_goulet","post":"My thoughts exactly. We are in agreement at last..","date":"2014-10-23","mins":"2:20 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-164935","author":"david_goulet","post":"I concede a touché on that one, Max. :).","date":"2014-10-23","mins":"2:47 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163207","author":"david_goulet","post":"I have no problem with a critical rebuttal to Charles. The link you provided as a good start. But unless you have the gift of telepathy you cannot accuse him of a deliberate attempt to deceive. It is quite possible Charles believes in his own theories and observations. If you can poke holes in his theory, please do. But unless you have evidence that his goal is to knowingly deceive others, please refrain from such accusations..","date":"2014-10-17","mins":"4:18 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163290","author":"david_goulet","post":"At least Charles put his name on the document and is open to scrutiny. If he has plagiarized, it will be exposed no doubt. I appreciate that he doesn’t hide between pseudonyms..","date":"2014-10-17","mins":"9:01 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-44846","author":"david_goulet","post":"It’s an interesting conspiracy theory, except for the fact that everyone agrees the man on the Shroud is quite dead. The ‘body was stolen’ theory is then the last option for those who would dismiss the resurrection accounts..","date":"2013-09-20","mins":"10:28 am","url":"https://shroudstory.com/2013/09/20/and-that-is-one-of-the-top-25-conspiracy-theories-of-all-time/","cat":"press_coverage","title":"And that is one of the top 25 conspiracy theories of all time?"},{"id":"comment-145843","author":"david_goulet","post":"It’s often pointed out here how authentists have turned certain ‘myths’ about the Shroud into ‘accepted facts’ simply by repeating them enough. I see what’s good for the goose…..","date":"2014-08-24","mins":"1:21 pm","url":"https://shroudstory.com/2014/08/24/another-case-of-incorrect-journalism/","cat":"press_coverage","title":"Another Case of Incorrect Journalism"},{"id":"comment-205729","author":"david_goulet","post":"Colin isn’t saying the Shroud was the actual transport linen, he’s saying a medieval audience may have been convinced it was a transport linen. The medieval audience wouldn’t have known the Jewish burial customs. There is medieval art that shows a linen being used when Jesus is taken from the cross. If the Shroud is authentic it is not likely a transport linen but a burial linen given the image characteristics. But Colin’s theory is premised on a medieval forgery..","date":"2015-07-14","mins":"9:28 pm","url":"https://shroudstory.com/2015/07/12/barrie-schwortz-colin-berry-and-some-good-reporting-in-fort-wayne/","cat":"article","title":"Barrie Schwortz, Colin Berry and Some Good Reporting in Fort Wayne"},{"id":"comment-205848","author":"david_goulet","post":"I think what has caused confusion, and this is just my opinion, is that both Colin and his critics (and supporters) are sometimes thinking out loud and, given the theory, this requires mentally entering the mindset of a medieval artisan — trying to figure out what he may have known about the crucifixion and how this would affect his forgery. This becomes confusing because in the comments it’s difficult to know who’s ‘head’ we are in. Colin has to defend the linen stretcher as plausible scripturally, because if it’s not defensible then the medieval artisan theory makes no sense either. Yes, if you look back at some of Colin’s comments it appears he’s saying that the Shroud is the transport linen – but I assumed he was arguing the plausibility of this from the point of view of the medieval artisan. I know Colin does not believe the Shroud is authentic, so I have always assumed when he debates for the stretcher linen angle it is to show a medieval artisan may have interpreted the scriptures likewise. For the record I’m not a proponent of his theory (I’ve listed some of the challenges under Thomas’ post), but I’m a proponent of a rationally constructed argument and this is one. If I’ve added to anyone’s confusion, it was not my intent..","date":"2015-07-15","mins":"8:28 am","url":"https://shroudstory.com/2015/07/12/barrie-schwortz-colin-berry-and-some-good-reporting-in-fort-wayne/","cat":"article","title":"Barrie Schwortz, Colin Berry and Some Good Reporting in Fort Wayne"},{"id":"comment-202837","author":"david_goulet","post":"I’m sure someone, not so very long ago, would have likewise thought human travel to the moon would be impossible, same for computers in our phones, or video chats with someone in real time across the globe, or 3 D printers. What seems impossible today may be possible in a generation. Earth isn’t just our home, it’s our home base..","date":"2015-06-19","mins":"3:49 pm","url":"https://shroudstory.com/2015/06/19/bbc-news-magazine-the-perplexing-image/","cat":"article","title":"BBC News Magazine:  The Perplexing Image"},{"id":"comment-202867","author":"david_goulet","post":"I’ve often wondered if the ‘past lives’ phenomenon is some form of memory transferred through the genes. We inherit certain characteristics from our parents and grandparents, why not pieces of memories as well – microbits hidden in the DNA? There is so little we know about our brains, I suspect one day we’ll find these memory genes that link us more than we’d realized to our forbearers..","date":"2015-06-19","mins":"9:15 pm","url":"https://shroudstory.com/2015/06/19/bbc-news-magazine-the-perplexing-image/","cat":"article","title":"BBC News Magazine:  The Perplexing Image"},{"id":"comment-204873","author":"david_goulet","post":"Your Meacham link doesn’t work. Can you summarize what you believe? You seem to be saying that yes the tomb was empty but only because the body had been removed. So did Jesus – personally – return from the dead at some point or not?.","date":"2015-07-07","mins":"2:58 pm","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","title":"Christian Faith Eroded to the Very Core?"},{"id":"comment-204925","author":"david_goulet","post":"What, in your opinion, occurred to Jesus after his death and burial — according to your studies in hermeneutics and archeology?.","date":"2015-07-08","mins":"8:07 am","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","title":"Christian Faith Eroded to the Very Core?"},{"id":"comment-205133","author":"david_goulet","post":"I’m confused, Max. When and where do you think the image was formed on the Shroud? And if Jesus was alive on Easter Sunday, having been dead Friday, is that not a miracle?.","date":"2015-07-10","mins":"7:58 am","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","title":"Christian Faith Eroded to the Very Core?"},{"id":"comment-198407","author":"david_goulet","post":"Max, reminder: please try to avoid all the short posts. You were doing really well on this until today. I know it’s hard for you, but it makes following the various threads more difficult..","date":"2015-05-05","mins":"2:10 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198416","author":"david_goulet","post":"My theory is that the Shroud was created by leprechauns, commissioned to make it exchange for gold. Just wait until the relevant experts in leprechaun handicrafts can be brought in contact with the Shroud. Then you’ll all see I’m right. Faith and begorrah..","date":"2015-05-05","mins":"3:59 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198090","author":"david_goulet","post":"Thx Louis. Interesting article..","date":"2015-05-01","mins":"11:48 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198234","author":"david_goulet","post":"Paper mache? I too am amazed at the result of your experiment but we aren’t looking for a 3 dimensional image model, just one that photographs that way. Or is this merely a stage which leads to that model later?.","date":"2015-05-03","mins":"8:04 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198280","author":"david_goulet","post":"“Methinks…” I thought it was Max replying for a second. :) Thanks for the Chemography for Dummies recap. That was helpful..","date":"2015-05-04","mins":"8:04 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198005","author":"david_goulet","post":"The problem remains of context even if one does eventually replicate the characteristics. The Mona Lisa may be a superb painting and difficult to replicate but it fits within the historical context. There is a difference between a masterpiece and an enigma. If the Shroud is a medieval creation then I suspect it was a happy accident; that whoever made it was playing around with a few techniques and landed upon one that he/she could not replicate – because the mechanical process was not documented or understood sufficiently to enable a second successful attempt. What is a miracle? There are many cases of people being spontaneously cured of a terrible disease (like cancer) which stumps the doctors — but is not a paranormal event. It’s not as if the person suddenly grew back a missing limb. That a medieval artisan could create a unique image with the equally unique characteristics we see with the Shroud is not beyond the realm of reason — it doesn’t require a paranormal event. But it would require circumstances that may stump the doctor..","date":"2015-04-30","mins":"9:04 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198038","author":"david_goulet","post":"I don’t get your point..","date":"2015-04-30","mins":"1:58 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-208509","author":"david_goulet","post":"Maillard is not the answer. But it may be a link in the answer. Thus there is value in anyone, repeat anyone, who explores the process. If we could let the observations speak for themselves without the accompanying narrative commentary the farther we’ll get in less time..","date":"2015-08-18","mins":"12:55 pm","url":"https://shroudstory.com/2015/08/16/colin-berrys-long-running-investigation-of-the-shroud/","cat":"article","title":"Colin Berry’s Long Running Investigation of the Shroud"},{"id":"comment-208511","author":"david_goulet","post":"I agree, Louis..","date":"2015-08-18","mins":"1:25 pm","url":"https://shroudstory.com/2015/08/16/colin-berrys-long-running-investigation-of-the-shroud/","cat":"article","title":"Colin Berry’s Long Running Investigation of the Shroud"},{"id":"comment-208483","author":"david_goulet","post":"You don’t have to be a scientist to ask a good question. Though to answer it you may want to consult one..","date":"2015-08-18","mins":"7:55 am","url":"https://shroudstory.com/2015/08/16/colin-berrys-long-running-investigation-of-the-shroud/","cat":"article","title":"Colin Berry’s Long Running Investigation of the Shroud"},{"id":"comment-192213","author":"david_goulet","post":"Leon, some of the points you mention are assumptions and not established facts (such as the pollen). If you spend some time reviewing this blog you’ll find that much that we have assumed to be true about the Shroud are in fact theories and not facts substantiated by clear evidence..","date":"2015-03-02","mins":"1:41 pm","url":"https://shroudstory.com/2015/03/02/daily-beast-review-of-cnns-shroud-of-turin-episode/","cat":"press_coverage","title":"Daily Beast Review of CNN’s Shroud of Turin Episode"},{"id":"comment-197763","author":"david_goulet","post":"The more I look at this the more it reminds me of a cover of a Rush album..","date":"2015-04-27","mins":"2:01 pm","url":"https://shroudstory.com/2015/04/27/computer-generated-young-jesus-from-image-on-shroud/","cat":"press_coverage","title":"Computer Generated Young Jesus From Image on Shroud"},{"id":"comment-192318","author":"david_goulet","post":"There is pollen on the linen, but there is contention on what kinds of pollen and how they might have gotten there..","date":"2015-03-03","mins":"4:51 pm","url":"https://shroudstory.com/2015/03/02/daily-beast-review-of-cnns-shroud-of-turin-episode/","cat":"press_coverage","title":"Daily Beast Review of CNN’s Shroud of Turin Episode"},{"id":"comment-195726","author":"david_goulet","post":"Colin, are you still working from the premise that the forger applied the acid to a bas relief: woodcut, metal or stone – and the image is a contact print result? I’m just trying to understand how the topical acid made it on to the linen. Max would be working from a similar premise but of course with an actual corpse. Could your theory likewise involve a corpse? Also, we have historical precedent of people spontaneously combusting. What about a spontaneous vaporization? Pure sci fi I suppose. Just musing that while human beings are not comprised of light, we are comprised of gases – like carbon. From my Star Trek science lessons, I recall we are carbon based lifeforms. Is the Shroud image evidence of a human body turning to carbon vapour? Would this in turn affect its C 14 readings? Questions beyond the realm of science, no doubt. Carry on with the actual science..","date":"2015-04-08","mins":"8:42 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","title":"Easter Ink"},{"id":"comment-195743","author":"david_goulet","post":"Thanks for the detailed reply, Colin. Full marks for that. The vaporization question was strictly for bonus marks..","date":"2015-04-08","mins":"11:46 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","title":"Easter Ink"},{"id":"comment-195755","author":"david_goulet","post":"Perhaps we should lobby schools to drop their chemistry labs and switch over to experimental archaeology — so much cheaper. Why do real science with all those costly materials when you can produce synthetic thought experiments for free. There might even be a free app for that on the kids smartphones..","date":"2015-04-08","mins":"3:03 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","title":"Easter Ink"},{"id":"comment-195787","author":"david_goulet","post":"There’s an expression common in North American slang: “My bad.” When used it signifies that one has made an error, that one owns that error, but also that one is not going to dwell on it – because no one is perfect. Somehow it is easier to say “My bad.” than “I was wrong.” or “I’m sorry.” I think some folks on this blog might want to borrow that slang rather than back themselves into corners unwilling to concede a single point..","date":"2015-04-08","mins":"8:14 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","title":"Easter Ink"},{"id":"comment-195761","author":"david_goulet","post":"I agree about the media. Polarized viewpoints create tension and thus make for more dramatic media events. Middle ground views are blasé to media producers. Nobody wants to watch a person on TV say, “To be honest, I don’t know.”.","date":"2015-04-08","mins":"4:00 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","title":"Easter Ink"},{"id":"comment-52439","author":"david_goulet","post":"I think Colin just found himself a cottage industry. ;).","date":"2013-11-22","mins":"5:24 pm","url":"https://shroudstory.com/2013/11/22/if-you-will-be-near-whippany-new-jersey-in-december/","cat":"press_coverage","title":"If you will be near Whippany, New Jersey, in December"},{"id":"comment-194777","author":"david_goulet","post":"I’d be lobbying for a complete second round of non destructive observation aka STURP 2.0. This is at least something the Vatican may consider. I’m also confident that this time, knowing what to look for specifically, sufficient evidence will be found to prove or disprove authenticity..","date":"2015-03-29","mins":"8:30 am","url":"https://shroudstory.com/2015/03/28/is-bilirubin-still-accepted-as-an-explanation-for-the-red-blood/","cat":"article","title":"Is Bilirubin Still Accepted as an Explanation for the Red Blood?"},{"id":"comment-132947","author":"david_goulet","post":"Looking forward to the book, John. Heavy stuff!.","date":"2014-06-26","mins":"11:52 am","url":"https://shroudstory.com/2014/06/26/john-klotz-approaching-book-on-the-shroud/","cat":"article","title":"John Klotz’ Approaching Book on the Shroud"},{"id":"comment-97626","author":"david_goulet","post":"The existing evidence would result in a hung jury..","date":"2014-04-08","mins":"9:26 am","url":"https://shroudstory.com/2014/04/08/lawrence-e-schauf-for-the-prosecution-the-trial-of-the-shroud/","cat":"article","title":"Lawrence E. Schauf for the Prosecution: The Trial of the Shroud"},{"id":"comment-97668","author":"david_goulet","post":"If Catholic answers cost $70,000 imagine how much the questions must be!.","date":"2014-04-08","mins":"2:32 pm","url":"https://shroudstory.com/2014/04/08/lawrence-e-schauf-for-the-prosecution-the-trial-of-the-shroud/","cat":"article","title":"Lawrence E. Schauf for the Prosecution: The Trial of the Shroud"},{"id":"comment-212558","author":"david_goulet","post":"And this is why, in my opinion, the Church/Turin has an obligation to further test the Shroud. In the absence of truth this kind of superstitious nonsense abounds. Superstition slowly poisons faith..","date":"2015-10-15","mins":"8:46 am","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","title":"Maybe the devil made them post this"},{"id":"comment-213259","author":"david_goulet","post":"Assuming your hair is clean..","date":"2015-10-21","mins":"11:22 am","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","title":"Maybe the devil made them post this"},{"id":"comment-212575","author":"david_goulet","post":"So it did sound familiar after all..","date":"2015-10-15","mins":"12:45 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","title":"Maybe the devil made them post this"},{"id":"comment-165920","author":"david_goulet","post":"Methinks Max should heed Dan’s warning. Reminder: Jesus would much rather you treat your neighbor with charity than defend his burial clothes..","date":"2014-10-27","mins":"9:22 am","url":"https://shroudstory.com/2014/10/27/more-on-charles-freemans-article/","cat":"article","title":"More on Charles Freeman’s Article"},{"id":"comment-40570","author":"david_goulet","post":"Thanks for this reference. I don’t know how many times I’ve heard that expression “if you put all the pieces of the Cross together you could…” build a bridge across the English Channel, etc. It’s become an accepted myth in the media now..","date":"2013-08-06","mins":"10:24 am","url":"https://shroudstory.com/2013/08/06/nbc-a-shroud-in-turin-is-said-to-hold-the-image-of-jesus-a-piece-of-jesus-cross-was-found/","cat":"press_coverage","title":"NBC:  A shroud in Turin is said to hold the image of Jesus & A piece of Jesus’ cross was found"},{"id":"comment-165937","author":"david_goulet","post":"Argentinian mate…one of my favourites too!.","date":"2014-10-27","mins":"10:15 am","url":"https://shroudstory.com/2014/10/27/more-on-charles-freemans-article/","cat":"article","title":"More on Charles Freeman’s Article"},{"id":"comment-192999","author":"david_goulet","post":"Love that last paragraph, Hugh. It’s so well put I almost feel compelled to disagree with it. ;).","date":"2015-03-09","mins":"9:14 pm","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","title":"Nice Review of Russ Breault’s Presentation in Wisconsin"},{"id":"comment-193047","author":"david_goulet","post":"Leon, YOU LISTEN UP (gee my caps lock works too) the case for authenticity is not as air tight as you seem to believe. Please do your homework and read some of the older archived posts here on the blog. The carbon dating has not been ‘debunked’ by anyone. Period. Full stop. Have serious questions been raised about the protocols and sampling? Yes. Does this mean the carbon dating is null and void? Not until the above mentioned questions have been fully answered. Can you show me where Rogers ‘dumped’ all over the tests? If the Shroud ignites and inspires faith, wonderful. This is an inner treasure a believer should cherish quietly, not brag about it to those more skeptical. Skepticism, by the way, is a God given trait as well, meant to save us from the chains of superstition..","date":"2015-03-10","mins":"9:06 am","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","title":"Nice Review of Russ Breault’s Presentation in Wisconsin"},{"id":"comment-193158","author":"david_goulet","post":"It’s not a #3 – it’s a sideways lower case ‘m’. Start again…..","date":"2015-03-11","mins":"8:17 pm","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","title":"Nice Review of Russ Breault’s Presentation in Wisconsin"},{"id":"comment-193058","author":"david_goulet","post":"It is a noble middle path. Do carry on, Russ..","date":"2015-03-10","mins":"11:51 am","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","title":"Nice Review of Russ Breault’s Presentation in Wisconsin"},{"id":"comment-193072","author":"david_goulet","post":"It’s times like this I wish the Shroud was proven a medieval forgery. And I am an authentist! Are there skeptics who will never, under any circumstance accept authenticity? I’d imagine so. Are there authentists who will never accept a medieval provenance. Undoubtedly. But to paint either side with such a broad brush, to allow no room for legitimate skepticism or legitimate (vs blind) faith, is unjust..","date":"2015-03-10","mins":"2:49 pm","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","title":"Nice Review of Russ Breault’s Presentation in Wisconsin"},{"id":"comment-190713","author":"david_goulet","post":"My expectations were exceeded! Though I suspect Max may not be the only one to soon be put on a short leash around here..","date":"2015-02-11","mins":"12:41 pm","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"id":"comment-190841","author":"david_goulet","post":"Well then. Let’s pack up and go home. Case closed. Glad we solved that mystery. And to think all it took was a bit of conjecture from an unknown source. Thank you Mr X for pointing out something no one else had ever thought to address. I’ll have more time to read the Daily Mail now..","date":"2015-02-12","mins":"12:48 pm","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"id":"comment-190822","author":"david_goulet","post":"Mea culpa, mea culpa, mea maxima culpa..","date":"2015-02-12","mins":"9:31 am","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"id":"comment-190703","author":"david_goulet","post":"I have to agree with Nabber. There are certainly valid points in this article, but seeded among them are weeds of misdirection. It damages the overall credibility. It would appear both sides of the debate have a tendency toward “piling on”..","date":"2015-02-11","mins":"11:26 am","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"id":"comment-190707","author":"david_goulet","post":"I wonder what Kim Kardashian thinks of the Shroud?(can’t wait to see what CB finds for this one)..","date":"2015-02-11","mins":"12:03 pm","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"id":"comment-209966","author":"david_goulet","post":"Right, thanks for the correction..","date":"2015-09-09","mins":"10:08 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","title":"Significant Response to the Preview of the Thermochimica Acta Editorial"},{"id":"comment-209961","author":"david_goulet","post":"That was a very strange assumption made by Gove. What was it based on?.","date":"2015-09-09","mins":"9:32 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","title":"Significant Response to the Preview of the Thermochimica Acta Editorial"},{"id":"comment-209965","author":"david_goulet","post":"I’m not sure the invisible weave exists (it may be a weave too far for me) but Flury Lemberg’s assumption is very strange. What did she base it on, is my question. Just eyeballing the linen? Is there any hard evidence that supports her assertion? It seems grossly short sighted and I say that without malicious speculation..","date":"2015-09-09","mins":"10:07 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","title":"Significant Response to the Preview of the Thermochimica Acta Editorial"},{"id":"comment-210114","author":"david_goulet","post":"Do we have examples of other linens of similar age and material (and usage) that we can compare to see if they have been reweaved?.","date":"2015-09-11","mins":"8:05 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","title":"Significant Response to the Preview of the Thermochimica Acta Editorial"},{"id":"comment-150478","author":"david_goulet","post":"What the….? Where did they get the samples from? How was this not on the official program? There was talk of hand grenades being thrown on this site a few days ago. This three page paper is the equivalent of a drone strike at Bari..","date":"2014-09-12","mins":"11:19 am","url":"https://shroudstory.com/2014/09/12/surprising-paper-out-of-bari-plant-dna-studies-on-the-shroud-of-turin/","cat":"article","title":"Surprising Paper out of Bari: Plant DNA Studies on the Shroud of Turin"},{"id":"comment-209959","author":"david_goulet","post":"I’m curious. Put invisible weaving aside. Based on this posting by Joe, does it not give you pause for thought that perhaps the sample section used for the C 14 testing was not ‘original’ material? He presents a strong case that the Shroud has been repaired and fiddled with many times. I wouldn’t be surprised if only the image area has been left untouched by pious medieval weavers. Do you think the sample section tested was consistent with the rest of the linen? I think we may be focusing on the wrong section of the shroud for evidence of reweaves, we need to look at sections closer to the image area. You won’t find evidence of invisible weaves, or otherwise, in a section that itself may be a part of a larger reweave..","date":"2015-09-09","mins":"9:30 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","title":"Significant Response to the Preview of the Thermochimica Acta Editorial"},{"id":"comment-152226","author":"david_goulet","post":"Were her conclusions corroborated by any other textile experts?.","date":"2014-09-18","mins":"9:43 am","url":"https://shroudstory.com/2014/09/12/surprising-paper-out-of-bari-plant-dna-studies-on-the-shroud-of-turin/","cat":"article","title":"Surprising Paper out of Bari: Plant DNA Studies on the Shroud of Turin"},{"id":"comment-152227","author":"david_goulet","post":"The linen could have been produced in any number of places, from Gaul to Antioch, and made it’s way to Jerusalem which was a hub or trade and commerce. One thousand years from now, experts may be examining a pair of running shoes that some believe were worn by a man named Kobe Bryant in Los Angeles circa 2014. An expert in ancient American footwear may assert that the shoes were not manufactured in California, nor likely the United States. This would not rule out a 2014 provenance of the shoes because they were made in Vietnam. The Odor Eaters on the other hand…..","date":"2014-09-18","mins":"9:56 am","url":"https://shroudstory.com/2014/09/12/surprising-paper-out-of-bari-plant-dna-studies-on-the-shroud-of-turin/","cat":"article","title":"Surprising Paper out of Bari: Plant DNA Studies on the Shroud of Turin"},{"id":"comment-150513","author":"david_goulet","post":"There must be something new about it, perhaps addenda, or why else to spring it on the Bari conference? Makes no sense. But this is Shroudology, where sense isn’t always a requirement..","date":"2014-09-12","mins":"2:21 pm","url":"https://shroudstory.com/2014/09/12/surprising-paper-out-of-bari-plant-dna-studies-on-the-shroud-of-turin/","cat":"article","title":"Surprising Paper out of Bari: Plant DNA Studies on the Shroud of Turin"},{"id":"comment-79791","author":"david_goulet","post":"I agree with you Hugh. Does it take an expert to deduce that if there was an earthquake of the magnitude suggested – then the collateral damage would have been equally as massive and this would have been recorded beyond the pages of the gospel. Certainly we need the folks with phd’s when we get into the nitty gritty areas. But for many of the more esoteric ideas merely vetting them on the internet is enough to find the holes. In that sense each of us is capable of ‘peer reviewing’ many of these ideas..","date":"2014-02-16","mins":"9:37 am","url":"https://shroudstory.com/2014/02/16/the-shroud-of-turin-story-brings-up-all-the-usual-issues-about-click-bait-journalism/","cat":"press_coverage","title":"The Shroud of Turin story brings up all the usual issues about click-bait journalism"},{"id":"comment-211492","author":"david_goulet","post":"These 2000 microphotographs…who has seen them? Who currently has access to them?.","date":"2015-09-29","mins":"10:14 am","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","title":"The Shroud of Canterbury"},{"id":"comment-211495","author":"david_goulet","post":"The Archdiocese has this incredible resource and has not produced a single paper on the subject? Or have they? It sounds like they are sitting on a goldmine and while I may understand why they do not want to share the gold, they should be producing something with it. Otherwise, what was the point? Have they discovered something that puts authenticity in question? Why else to withhold?.","date":"2015-09-29","mins":"10:40 am","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","title":"The Shroud of Canterbury"},{"id":"comment-192214","author":"david_goulet","post":"Steve, I lean towards authenticity. But as Hugh notes, there are many false assumptions in what you have posted. Spend some time reviewing this blog and you’ll see the nuances and grey areas that shroud the Shroud (for both sides of the debate)..","date":"2015-03-02","mins":"1:43 pm","url":"https://shroudstory.com/2015/02/13/two-more-articles-about-upcoming-cnn-series-on-finding-jesus/","cat":"press_coverage","title":"Two More Articles About Upcoming CNN Series on Finding Jesus"},{"id":"comment-192292","author":"david_goulet","post":"Has anyone else seen the Part 2 of the PBS special Steve mentions? I haven’t, so I don’t know the context of his claim that members of the original C 14 lab teams have admitted to botching the process. Also is anyone else aware of the testing he mentions of the ‘repaired swatch that got a 1st century date — this is news to me. Fanti?.","date":"2015-03-03","mins":"12:54 pm","url":"https://shroudstory.com/2015/02/13/two-more-articles-about-upcoming-cnn-series-on-finding-jesus/","cat":"press_coverage","title":"Two More Articles About Upcoming CNN Series on Finding Jesus"},{"id":"comment-102393","author":"david_goulet","post":"“A highly stylized, somewhat amateur…” does anyone else find this nonsensical?.","date":"2014-04-22","mins":"12:00 pm","url":"https://shroudstory.com/2014/04/20/wayne-phillips-hopes-to-create-a-small-shroud-army/","cat":"press_coverage","title":"Wayne Phillips:  Hopes to create a small “Shroud Army”"},{"id":"comment-38561","author":"david_goulet","post":"Stage musicians pride themselves on being able to reconstruct illusions and flim flam. They are indeed very good at it as James Randi has proven over the years.This is why the Shroud vexes them so. They have not been able to reconstruct it.Thus they have to confront the possibility that either they are not as skilled as they think they are (the horror!), or the Shroud is not flim flam (the believers have a leg to stand on…say it ain’t so Joe)..","date":"2013-07-03","mins":"7:36 am","url":"https://shroudstory.com/2013/07/03/a-book-review-of-joe-nickells-the-science-of-miracles/","cat":"books","title":"A Book Review of Joe Nickell’s The Science of Miracles"},{"id":"comment-38576","author":"david_goulet","post":"Stage magicians, not musicians. Though they do have a lot in common..","date":"2013-07-03","mins":"2:20 pm","url":"https://shroudstory.com/2013/07/03/a-book-review-of-joe-nickells-the-science-of-miracles/","cat":"books","title":"A Book Review of Joe Nickell’s The Science of Miracles"},{"id":"comment-125282","author":"david_goulet","post":"Amen!.","date":"2014-05-28","mins":"12:21 pm","url":"https://shroudstory.com/2014/05/27/can-doubts-about-the-shroud-strengthen-christian-faith/","cat":"books","title":"Can doubts about the shroud strengthen Christian faith?"},{"id":"comment-146261","author":"david_goulet","post":"This is interesting. We often theorize what happened to the cloth after Easter weekend – what journey it took. But what about the journey beforehand? How old was the linen before it was used as a burial shroud? Where was it from? How much pollen was already on the linen before it even got to Jerusalem? (Assuming the TS is authentic of course)..","date":"2014-08-26","mins":"7:54 am","url":"https://shroudstory.com/2014/08/22/coming-out-of-the-closet-on-pollen-and-plant-images/","cat":"books","title":"Coming Out of the Closet on Pollen and Plant Images"},{"id":"comment-40173","author":"david_goulet","post":"The term Fox News is an oxymoron..","date":"2013-07-30","mins":"11:12 pm","url":"https://shroudstory.com/2013/07/30/fox-news-propels-zealot-the-life-and-times-of-jesus-to-number-one/","cat":"books","title":"Fox News Propels Zealot: The Life and Times of Jesus to Number One"},{"id":"comment-40365","author":"david_goulet","post":"Nope. CNN, BBC and the independent blogosphere..","date":"2013-08-03","mins":"4:28 pm","url":"https://shroudstory.com/2013/07/30/fox-news-propels-zealot-the-life-and-times-of-jesus-to-number-one/","cat":"books","title":"Fox News Propels Zealot: The Life and Times of Jesus to Number One"},{"id":"comment-38115","author":"david_goulet","post":"If it was just a couple of servants tasked with the burial, I could see that possibility. If it was anyone closer to Jesus, then I still don’t see them using the coins – even if they didn’t at that point believe he was the Messiah. The symbolism would be unacceptable – better to leave the eyes open than sealed with Roman coins. But maybe I’m projecting my own ethos onto the situation. It’s like trying to do a puzzle — missing most of the pieces..","date":"2013-06-26","mins":"4:37 pm","url":"https://shroudstory.com/2013/06/21/getting-dizzy-reading-venerosos-the-chimera/","cat":"books","title":"Getting Dizzy Reading Veneroso’s The Chimera"},{"id":"comment-37600","author":"david_goulet","post":"I’m assuming the author felt the need to REALLY establish the Shroud’s authenticity in order to set up believably the cloning angle. From a writer’s perspective this makes sense. Of course a serious Shroudie is understandably going to have trouble seeing past the artistic license (and the misconceptions it may seed in readers with only a casual knowledge of the Shroud)..","date":"2013-06-21","mins":"10:11 am","url":"https://shroudstory.com/2013/06/21/getting-dizzy-reading-venerosos-the-chimera/","cat":"books","title":"Getting Dizzy Reading Veneroso’s The Chimera"},{"id":"comment-38108","author":"david_goulet","post":"I also wouldn’t find it odd that a coin was placed on a Jewish body, but this wasn’t just any Jewish body – if we assume it was Jesus. It was that of a messianic figure (to his believers). He was put to death, brutally, by Romans on the command of Pontius Pilate – who was goaded into the act (according to the Gospels) by the Jewish authorities who claimed Jesus was no friend of Caesar (true enough). It seems then exceedingly strange that his followers would place an image of the governor who sentenced him to execution onto his body. It’s like saying ‘Rome wins’. Why would they do that? If it was just to keep the eyes closed, I’d think they’d have used anything, a stone, a stick…anything but a coin that had the face of the oppressor on it..","date":"2013-06-26","mins":"1:51 pm","url":"https://shroudstory.com/2013/06/21/getting-dizzy-reading-venerosos-the-chimera/","cat":"books","title":"Getting Dizzy Reading Veneroso’s The Chimera"},{"id":"comment-83502","author":"david_goulet","post":"Telling others what to do…my my…how British of you..","date":"2014-02-28","mins":"3:21 pm","url":"https://shroudstory.com/2014/02/26/giulio-fantis-book-launched/","cat":"books","title":"Giulio Fanti’s Book Launched"},{"id":"comment-30972","author":"david_goulet","post":"I’ll confess I laughed at that one..","date":"2013-04-16","mins":"12:25 pm","url":"https://shroudstory.com/2013/04/16/giulio-fanti-responds-to-gian-marco-rinaldis-book-review/","cat":"books","title":"Giulio Fanti Responds to Gian Marco Rinaldi’s Book Review"},{"id":"comment-83525","author":"david_goulet","post":"Colinsberry : David Goulet : Telling others what to do…my my…how British of you. Yup. We say what we think and even, if only once in a while, when pushed, say what we think. If that’s British peculiar, then so be it. There are those who use the Shroud to push an agenda. Some of us think they are wrong. Some of us, not only Brits, have no time for that agenda – and resent the fudge of those who suggest we may be misjudging, making out we have been too hasty in our conclusions. Sometimes one has to take a firm stand on what one believes to be right – or wrong, The shroudie pro authenticity case is wrong, Then let this Canadian be equally blunt. Your Templar scorch theory, while admirable in its creativity, is also wrong. You have no more scientific proof than anyone else, pro or con authenticity. See, I actually had the gonads to say that. Woo hoo. Rather than slagging Barrie’s site you could have been providing papers to it. But you prefer to be the one man gang, the maverick. It’s your life, do as you please. But if Hugh prefers to play nice with the rest of the kids, even the ones he disagrees with, well that’s his choice. Now get back to your experiments you crazy (in a good way) tub thumper..","date":"2014-02-28","mins":"4:57 pm","url":"https://shroudstory.com/2014/02/26/giulio-fantis-book-launched/","cat":"books","title":"Giulio Fanti’s Book Launched"},{"id":"comment-83541","author":"david_goulet","post":"And where’s your peer review? Oh fudge..","date":"2014-02-28","mins":"6:00 pm","url":"https://shroudstory.com/2014/02/26/giulio-fantis-book-launched/","cat":"books","title":"Giulio Fanti’s Book Launched"},{"id":"comment-83542","author":"david_goulet","post":"“Get off your high horse” said the man riding a giraffe..","date":"2014-02-28","mins":"6:00 pm","url":"https://shroudstory.com/2014/02/26/giulio-fantis-book-launched/","cat":"books","title":"Giulio Fanti’s Book Launched"},{"id":"comment-33324","author":"david_goulet","post":"And what might have been Roger’s motivation been for partaking in this ‘cronyism’? Given he was dying at the time do you suspect it was career advancement?.","date":"2013-05-09","mins":"9:14 am","url":"https://shroudstory.com/2013/05/08/joe-nickells-new-book-the-science-of-miracles/","cat":"books","title":"Joe Nickell’s New Book: The Science of Miracles"},{"id":"comment-123634","author":"david_goulet","post":"What is the difference between experimental archaeology and regular science? Also, as clergy are/were expected to handle the Eucharist, they keep/kept their fingernails very clean and well trimmed as not to soil/damage the Host. I for one have cleaned and trimmed my nails, as an experimental religionist, and can attest that it is nearly impossible to fray a paper towel under such conditions. Your experiments as an experimental archaeological are based on flawed data..","date":"2014-05-23","mins":"12:41 pm","url":"https://shroudstory.com/2014/05/22/more-tomfoolery-the-carbon-dating-results-are-worthless/","cat":"books","title":"More Tomfoolery: The carbon dating results are worthless"},{"id":"comment-123132","author":"david_goulet","post":"It is short sighted to claim the carbon dating results are useless. Flawed? Yes. Inconclusive? Yes. Worthless? No. Even a flawed experiment/test yields information that can be very useful if one has the patience to sift through what went wrong and ask how it went wrong. One may also find some elements that went right. One can say the same of Vignon markings and Quads, etc. Given the scarcity of new data on the Shroud, I’d be very reluctant to start throwing babies out with the bath water we do have..","date":"2014-05-22","mins":"9:18 am","url":"https://shroudstory.com/2014/05/22/more-tomfoolery-the-carbon-dating-results-are-worthless/","cat":"books","title":"More Tomfoolery: The carbon dating results are worthless"},{"id":"comment-123647","author":"david_goulet","post":"The rubrics of the Catholic church are quite clear that a priest, bishop, etc is to keep his hands clean (cuticles groomed) out of respect for the Blessed Sacrament and other holy manipulatives (relics included). I’m not calling into question your other assertions about the weight and duration of exposition of the Shroud as I have no data to counter what you have observed. However on the matter of clerical cuticles, I’m quite certain these are a non factor..","date":"2014-05-23","mins":"1:26 pm","url":"https://shroudstory.com/2014/05/22/more-tomfoolery-the-carbon-dating-results-are-worthless/","cat":"books","title":"More Tomfoolery: The carbon dating results are worthless"},{"id":"comment-49591","author":"david_goulet","post":"Josie this post made me laugh, for all the right reasons. “cooked the Mexican guy’! This is like Mythbusters – backyard science sure sounds like fun!.","date":"2013-11-02","mins":"11:44 am","url":"https://shroudstory.com/2013/10/28/new-book-by-dame-de-saint-simone/","cat":"books","title":"New Book by Dame De Saint-Simone"},{"id":"comment-158621","author":"david_goulet","post":"“It’s a boy! And he’s a whopper!” Congratulations, John. Looking forward to reading this..","date":"2014-10-02","mins":"10:57 am","url":"https://shroudstory.com/2014/10/02/new-book-the-coming-of-the-quantum-christ/","cat":"books","title":"New Book:  The Coming of the Quantum Christ:"},{"id":"comment-198633","author":"david_goulet","post":"When I checked out the Amazon link, Amazon recommended another related product I might also be interested in: Aveeno skin lotion. I might have to suggest to Colin to try that next in his experiments!.","date":"2015-05-08","mins":"10:54 am","url":"https://shroudstory.com/2015/05/08/new-book-by-stephen-mattingly-proposes-image-mechanism/","cat":"books","title":"New Book by Stephen Mattingly Proposes Image Mechanism"},{"id":"comment-37332","author":"david_goulet","post":"No. I can’t say they went with those angles. You’re safe. :).","date":"2013-06-18","mins":"4:41 pm","url":"https://shroudstory.com/2013/06/17/new-shroud-of-turin-novel-the-chimera-by-fr-j-r-veneroso/","cat":"books","title":"New Shroud of Turin Novel, The Chimera by Fr. J. R. Veneroso"},{"id":"comment-37307","author":"david_goulet","post":"There are dozens of movie scripts floating around Hollywood that have the ‘cloning Jesus from the Shroud’ set up. The one that got closest to being greenlit a few years ago was a comedy. A friend of mine wrote a kids book using a teen aged Jesus clone angle, Emmanuel Mc Clue and the Mystery of the Shroud. The idea that we could ‘manufacture’ the Second Coming is tantalizing..","date":"2013-06-18","mins":"9:21 am","url":"https://shroudstory.com/2013/06/17/new-shroud-of-turin-novel-the-chimera-by-fr-j-r-veneroso/","cat":"books","title":"New Shroud of Turin Novel, The Chimera by Fr. J. R. Veneroso"},{"id":"comment-50307","author":"david_goulet","post":"This is much deeper analysis/feedback than I was looking at — thanks, Kelly. I was thinking more in terms of the matching of wound patterns, than the blood match (which would as you point out be even more conclusive). If a person has a unique type of wound (like those found from a scourged and crucified victim) and the wound pattern shows up on two (or three) separate pieces of ‘clothing’ evidence then this is important. This is why I would like to see persons trained in forensics to give their two cents on the wound match ups between the three relics. This type of person could give a better conclusion as to how ‘good’ the match ups are and how much could be coincidental..","date":"2013-11-07","mins":"11:04 am","url":"https://shroudstory.com/2013/11/06/of-similarities-the-tunic-of-argenteuil-and-the-shroud-of-turin/","cat":"books","title":"Of Similarities:  The Tunic of Argenteuil and the Shroud of Turin"},{"id":"comment-50191","author":"david_goulet","post":"The problem with pollen evidence is the same with the carbon dating in our inability to know what has come into contact with the material. A false relic could have traveled to many places and picked up those pollens as much as a true relic. I would find the matching bloodstains more conclusive that the two materials are linked to the same person. Though I’d like to see some forensics experts support the conclusions mentioned in the post. I keep pondering on these linked relics. We certainly know there was an industry built around them. But it is logical to assume that Christ’s garments, burials clothes, etc would have been considered precious relics by his followers, particularly because they contain his blood – his lifeforce. It also follows then that they would have preserved them, hid them in times of persecution. Of all the relics out there, these relics would be preeminent. The only way they would have been lost is if they were destroyed by catastrophe. That may have happened. But is it pure poppycock to think that the Sudarium, the Shroud and the Tunic could indeed be these preeminent relics? I don’t think so, particularly if they can be linked by general forensics. Proving definitely they are those relics is of course another matter..","date":"2013-11-06","mins":"10:44 am","url":"https://shroudstory.com/2013/11/06/of-similarities-the-tunic-of-argenteuil-and-the-shroud-of-turin/","cat":"books","title":"Of Similarities:  The Tunic of Argenteuil and the Shroud of Turin"},{"id":"comment-72293","author":"david_goulet","post":"Whether one is a Pope, a university academic or just a fisherman out in his boat thinking about the God of creation…in the end each can say he ‘understands’ God as much as the others. Jesus asks each of us that which he asked his apostles, “Who do you say that I am?” I believe as a long as we seek to answer that query honestly and humbly – that is what truly matters. Our desire to get the answer right is more important than getting it right..","date":"2014-01-05","mins":"10:41 am","url":"https://shroudstory.com/2014/01/03/rest-in-peace-ian-barbour/","cat":"books","title":"Rest in Peace Ian Barbour"},{"id":"comment-58996","author":"david_goulet","post":"I read this book when it was still in the womb of the author’s conciousness. It was cheaper that way..","date":"2013-12-13","mins":"4:36 pm","url":"https://shroudstory.com/2013/12/13/please-only-discuss-michael-judes-book-and-claims-here/","cat":"books","title":"Please Only Discuss Michael Jude’s Book and Claims Here"},{"id":"comment-45294","author":"david_goulet","post":"Agreed and according to the rule of this blog of not allowing unsubstantiated accusations of intellectual dishonesty I believe the post should be removed. Unless that is Francis has PROOF Rogers was deliberately lying..","date":"2013-09-24","mins":"7:57 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45518","author":"david_goulet","post":"A fair request..","date":"2013-09-26","mins":"9:43 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45196","author":"david_goulet","post":"Whenever the stakes are high you will have people crossing lines to ensure they come out on the right side of the result. Academics are no different than big business — the egos are the same. The temptation to manipulate people and processes — for whatever motivation — is as old as humanity. Joe’s claims surprise me not at all..","date":"2013-09-23","mins":"10:16 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-36707","author":"david_goulet","post":"I want to play too. What if it’s not an L at all, but an upside down 7?.","date":"2013-06-11","mins":"12:23 pm","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?"},{"id":"comment-168658","author":"david_goulet","post":"Max, are there any other experts in iconocryptanalysis — alive or dead? The challenge, as I’m sure you will appreciate, is that if you are the proto iconocryptanalyst then it will be almost impossible to obtain peer review of your work. How can this challenge be overcome?.","date":"2014-11-04","mins":"1:37 pm","url":"https://shroudstory.com/2014/11/04/decrypted-iconosteganalysist-or-iconocryptanalyst/","cat":"paper_chase","title":"Decrypted:  Iconosteganalysist or Iconocryptanalyst"},{"id":"comment-168944","author":"david_goulet","post":"Max, ENOUGH! Why do you have to always turn the discussion into personal jabs? Hugh has merely pointed out the challenges he has with your observations. I did the same. I’m more than willing to concede that you have special cryptoanalysis skills – but not based simply on your claiming to have them. There must be other academics you share notes with, discuss iconography with. Could you not invite one of them to this forum to chime in on your observations? One peer corroboration would be worth a hundred of your mini post ‘reminders’ claiming you can see things the rest of us cannot..","date":"2014-11-05","mins":"10:54 am","url":"https://shroudstory.com/2014/11/04/decrypted-iconosteganalysist-or-iconocryptanalyst/","cat":"paper_chase","title":"Decrypted:  Iconosteganalysist or Iconocryptanalyst"},{"id":"comment-202778","author":"david_goulet","post":"Your coin theory is missing only one thing: corroboration. That doesn’t mean you aren’t correct, it just means that until another expert, in all those uber unique fields you account yourself one, corroborates your theory then it remains merely an intriguing ‘what if’..","date":"2015-06-19","mins":"8:04 am","url":"https://shroudstory.com/2015/06/19/paper-chase-offensive-coins-heads-or-tails/","cat":"paper_chase","title":"Paper Chase:  Offensive Coins? Heads or Tails?"},{"id":"comment-164030","author":"david_goulet","post":"Max is going to have a field day with this one, in three…two….","date":"2014-10-20","mins":"9:21 am","url":"https://shroudstory.com/2014/10/19/new-paper-the-lirey-toga/","cat":"paper_chase","title":"New Paper:  The Lirey Toga"},{"id":"comment-38045","author":"david_goulet","post":"Good point about the lack of bloody fingerprints elsewhere. The whole coin issue has become a wild goose chase. There are better aspects of the Shroud to be investigating which could bear more fruit, one way or another, than the painfully subjective coins angle..","date":"2013-06-25","mins":"12:34 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue"},{"id":"comment-202791","author":"david_goulet","post":"But who can confirm your eidomatic numistic image extraction based on archeological blood stain pattern analysis? That’s my point..","date":"2015-06-19","mins":"8:40 am","url":"https://shroudstory.com/2015/06/19/paper-chase-offensive-coins-heads-or-tails/","cat":"paper_chase","title":"Paper Chase:  Offensive Coins? Heads or Tails?"},{"id":"comment-183230","author":"david_goulet","post":"Thanks for the summary, Colin. Agreed, the woodprint/wet theory has some major hurdles to overcome..","date":"2015-01-14","mins":"10:33 am","url":"https://shroudstory.com/2015/01/14/papers-by-the-skeptic-of-sturp/","cat":"paper_chase","title":"Papers by the Skeptic of STURP"},{"id":"comment-183222","author":"david_goulet","post":"So the bas relief theory but using a woodprint? And the mechanism of image formation to the cloth?.","date":"2015-01-14","mins":"9:41 am","url":"https://shroudstory.com/2015/01/14/papers-by-the-skeptic-of-sturp/","cat":"paper_chase","title":"Papers by the Skeptic of STURP"},{"id":"comment-214535","author":"david_goulet","post":"“Whatever mechanism is proposed for the transfer of information from the body to the cloth, the idea that it would work with skin, hair, fingernails, iron, wood, bronze, papyrus and sponge, stretches belief, in my opinion.” But whatever that mechanism was it did work with the skin and hair, we can see that. Or do you mean you doubt one mechanism could work with that many varying materials?.","date":"2015-11-12","mins":"10:40 am","url":"https://shroudstory.com/2015/11/09/because-i-dont-see-it/","cat":"video","title":"Because I Don’t See It"},{"id":"comment-94634","author":"david_goulet","post":"A fair question! Does anyone know what the pollen contamination of other ancient linens is like? I would think that the Shroud would indeed be laden with pollen, it is merely a question of from where and how might it have found its way there. I wonder if sometimes we aren’t guilty of being too quick to dismiss evidence that may appear to be ‘too good to be true’ — so as not to appear biased for authenticity. Having pollen on that linen that may point quite directly to authenticity certainly tempts the ‘too good to be true’ reflex. If confirmation bias is a danger, so too reverse confirmation bias. Frei’s work may not be definitive, but making it ‘inadmissible’ is a mistake..","date":"2014-03-29","mins":"4:16 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show"},{"id":"comment-39503","author":"david_goulet","post":"Well, we’re fortunate then to have you around to set the record straight. :).","date":"2013-07-22","mins":"6:01 am","url":"https://shroudstory.com/2013/07/19/imagine-taking-easter-out-and-there-just-isnt-a-story/","cat":"video","title":"Imagine taking Easter out and there just isn’t a story"},{"id":"comment-193221","author":"david_goulet","post":"Sometimes the most honest answer is “we don’t really know”..","date":"2015-03-12","mins":"1:39 pm","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","title":"Here We Go Again"},{"id":"comment-39525","author":"david_goulet","post":"I was reflecting on Yannick’s thoughts about free will and signs. There are only two major characters in the Gospels who, on first glance, appear to have been given a proof rather than a sign: Paul and Thomas. Scholars have been debating whether Paul’s Damascus conversion is a literary device to express an inner transformation. In other words, was Paul already leaning in his heart and mind to accepting the Christ message and then it climaxed with a moment of revelation – after which he is given a sign of confirmation. Thomas is less easy to reconcile. He alone demands a proof (not merely a sign) of Jesus resurrection. And he is given it. I’ve heard different interpretations of Thomas’ story. Some suppose that Thomas was not in cynical disbelief when he asked for his proof, rather he was ready beyond measure to believe, but needed to see it with his own eyes. He is granted this proof and then he is the first to proclaim Jesus’ divinity..","date":"2013-07-22","mins":"11:48 am","url":"https://shroudstory.com/2013/07/19/imagine-taking-easter-out-and-there-just-isnt-a-story/","cat":"video","title":"Imagine taking Easter out and there just isn’t a story"},{"id":"comment-39897","author":"david_goulet","post":"I tend to think very similar to you,based on what I’ve read from New Testament scholars and from my own lived experience. I think it is very telling that Jesus, himself, never wrote anything down — though he knew how to write for he is described as writing in the sand (a temporary medium) in the Gospels. Once you write something down on paper or stone, especially if you are a spiritual leader, it has a tendency to become dogma. The Shroud, bringing us back to this blog, reminds me of Jesus writing in the sand. Or, as you have nicely described, appearing to his followers in a form that never quite dispels the question mark..","date":"2013-07-27","mins":"11:32 pm","url":"https://shroudstory.com/2013/07/19/imagine-taking-easter-out-and-there-just-isnt-a-story/","cat":"video","title":"Imagine taking Easter out and there just isn’t a story"},{"id":"comment-192546","author":"david_goulet","post":"I actually don’t expect that any corroboration will be necessary, as I expect my request will go unanswered (or conveniently unnoticed)..","date":"2015-03-05","mins":"2:13 pm","url":"https://shroudstory.com/2015/03/05/keeping-an-audience-in-suspense/","cat":"television","title":"Keeping an audience in suspense"},{"id":"comment-215363","author":"david_goulet","post":"No Exodus? I think some scholars don’t trust their own birth certificates. “How do I know I was actually born at all?” This is nonsense. The Flood happened. The Exodus happened. David fought Goliath. Did they happen as recorded in the OT, who knows. But I assure you a regional flood likely did happen, a group of Hebrews made their way out of Egyptian exploitation at some point, and a plucky David led his men to victory against greater odds. The germ of these stories is true — common sense tells us this. Can archeology ever prove them completely, maybe – maybe not. It is good to question the historicity of everything — that’s why this blog exists. But if one left it to the so called experts I’d be led to believe that the Israelites didn’t do much of anything — just sat around the tent making up wild stories to amuse their kids. I doubt they’d have survived as long as they did twiddling their thumbs like that..","date":"2015-11-30","mins":"11:09 am","url":"https://shroudstory.com/2015/11/29/new-very-short-video-from-national-geographic/","cat":"video","title":"New, Very Short Video from National Geographic"},{"id":"comment-70485","author":"david_goulet","post":"Excellent point. My wife is Samoan and her oral memory is fantastic, as is her facial recognition and memory. Her brother is a traditional orator back in Samoa and I am amazed at what he can recall from memory, i.e. Lineages. A couple of decades is nothing for those raised in oral cultures..","date":"2013-12-31","mins":"8:02 am","url":"https://shroudstory.com/2013/12/29/new-video-discovering-jesus-in-his-holy-shroud/","cat":"video","title":"New Video: Discovering Jesus in His Holy Shroud"},{"id":"comment-47745","author":"david_goulet","post":"I wonder if social media would be another way to go, i.e. A parish Facebook page for example. Many parishes have websites but rarely with an interactive forum. That sense of community, in urban areas, is so hard to create. Your magazine was a creative attempt, kudos to you for trying that..","date":"2013-10-17","mins":"6:48 am","url":"https://shroudstory.com/2013/10/16/plan-to-be-bored-but-dont-worry-only-the-first-six-minutes-of-this-lecture-is-about-the-shroud/","cat":"video","title":"Plan to be bored: But don’t worry. Only the first six minutes of this lecture are about the Shroud."},{"id":"comment-77616","author":"david_goulet","post":"Have you attempted to reproduce the Shroud with charcoal or other such materials? Do we have precedent in Gnosticism for this kind of craftsmanship?.","date":"2014-02-08","mins":"9:57 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud"},{"id":"comment-77768","author":"david_goulet","post":"Good observation, Russ. I would think the Gnostics them would have created an image of Christ alive — eyes open — making the statement that you can kill flesh, not spirit..","date":"2014-02-09","mins":"11:19 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud"},{"id":"comment-189407","author":"david_goulet","post":"Agreed. Sounds like a bait and switch move. I doubt the program plays out that way at all. I’ll settle for objectivity..","date":"2015-02-05","mins":"12:33 pm","url":"https://shroudstory.com/2015/02/05/set-your-dvr-an-unprecedented-cnn-event-on-march-1/","cat":"video","title":"Set Your DVR:  An Unprecedented CNN Event on March 1"},{"id":"comment-208948","author":"david_goulet","post":"Your quotes do not contradict what I said. Yes, Jesus is the conduit to the Father. We can begin that journey today with Jesus (the kingdom is now) and we can know light and life even when our day is dark and grim. But there is more to our journey than just this life..","date":"2015-08-25","mins":"9:43 am","url":"https://shroudstory.com/2015/08/25/simon-brown-video-of-barrie-schwortz-at-jalsa-salana-uk/","cat":"video","title":"Simon Brown Video of Barrie Schwortz at  Jalsa Salana UK"},{"id":"comment-208943","author":"david_goulet","post":"But Jesus doesn’t specify when this ‘coming to the Father’ occurs. The assumption is that it has to happen in the here and now of this life (it can certainly begin here) but perhaps there is a moment when we pass from this reality to the next where our journey, our way, connects with Jesus as we continue to the Father. C.S. Lewis explores this wonderfully in his Great Divorce allegory. With Scripture, as with the Shroud, we must always question our assumptions..","date":"2015-08-25","mins":"8:52 am","url":"https://shroudstory.com/2015/08/25/simon-brown-video-of-barrie-schwortz-at-jalsa-salana-uk/","cat":"video","title":"Simon Brown Video of Barrie Schwortz at  Jalsa Salana UK"},{"id":"comment-80131","author":"david_goulet","post":"Anonymous : I cannot agree more with you Mike (about the music too!). Zeffirelli has set the bar so high that it will take a very huge masterpiece to get close to what he did. In no other movie than this one do we see a Jesus that better show the face of the God of Love and Mercy that he preached all his life… There is truly a mystic side in that movie that we cannot see in any other… One of my favorite scene is the one where Jesus “used” Matthew and Peter to tell the Parable of the Prodigal and the older sons. What an awesome scene! I have only two minor qualms with Zeffirelli’s masterpiece. Mary Magdalene was not a harlot. And Robert Powell was much too frail physically. Yes those eyes and cheekbones overcame much, but he simply didn’t project strength to me. I prefer the more robust Caviezel version of Jesus. I’d love to see what Jim might have done with Jesus beyond a few flashbacks during his passion narrative. What Zeffirelli did, which no one else has yet approached, is provide a rich context for the Truth of the gospel story to shine. As you mentioned, that Prodigal Son scene is pure genius..","date":"2014-02-17","mins":"5:56 pm","url":"https://shroudstory.com/2014/02/17/son-of-god-in-theaters-february-28/","cat":"movie","title":"Son of God in Theaters February 28"},{"id":"comment-183221","author":"david_goulet","post":"Here’s a thought. If it is medieval – whose to say it was crafted in medieval Europe? Might it have been crafted in Egypt or Syria or even farther afield, using methods unseen in Europe? There are many skills/knowledge that our forbearers had, which we have long forgotten — and this varied as well based on geography no doubt. If one believes in medieval provenance, the net needs to widen considerably for parallel technology…because right now the wheels they be a spinning in the mud of Europe..","date":"2015-01-14","mins":"9:39 am","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","title":"Smithsonian Channel:  Is it the greatest prank ever pulled?"},{"id":"comment-39208","author":"david_goulet","post":"Unfortunately, many “scientists” are doing just that. I would think they only way to prove resurrection is ‘possible’ is to replicate it. Outside of the scientists in horror movies, I don’t see anyone ever succeeding at that. They are free to try of course. Everyone needs a hobby. :).","date":"2013-07-18","mins":"11:46 am","url":"https://shroudstory.com/2013/07/16/the-investigator-new-film-about-the-death-and-resurrection-of-christ/","cat":"movie","title":"The Investigator:  New Film About the Death and Resurrection of Christ"},{"id":"comment-192534","author":"david_goulet","post":"Sources, Charles, please. Can you list your blood experts? They may be known to Dr. Kearse and he can at least corroborate that they are indeed experts on the matter..","date":"2015-03-05","mins":"1:10 pm","url":"https://shroudstory.com/2015/03/05/keeping-an-audience-in-suspense/","cat":"television","title":"Keeping an audience in suspense"},{"id":"comment-39202","author":"david_goulet","post":"Yes, Yannick, but our hearts are not detached from our minds. If one is interested in the Shroud as a witness to a real event, one that is outside normal human experience, this is not heresy – unless they claim that they can only believe if they can prove the Resurrection happened. That is like giving God an ultimatum – “show yourself and only then will I believe!” This is not actually heresy but the root of most atheism. Just because the Gospel tells us that ‘blessed are those who have not seen yet still believe’ we should not take that to mean it is wrong to want to see. Thomas was not wrong to demand a sign – for faith (which he had) without reason is mere superstition. The disciples all had faith but they also were blessed to witness the resurrected Jesus. This witness was essential or we wouldn’t be sitting here today talking about Jesus at all. God’s rule would appear to be: once you have faith, then you will be given your sign. It must be so with a God that respects free will. Every generation seeks a witness. “How do I know what you say is true?” For the modern Thomas, the Shroud acts as such a witness. Not a proof, just a sign. Of course each of us, who professes Jesus, is to be a living sign. This is how the church spread in the beginning — people marveling at the love of these ‘Christians’ even in the face of suffering and death. That too is a powerful witness. So yes, the heart of faith is the pillar of belief, but the mind and its desire for rational certitude is the hearts partner in the dance..","date":"2013-07-18","mins":"9:38 am","url":"https://shroudstory.com/2013/07/16/the-investigator-new-film-about-the-death-and-resurrection-of-christ/","cat":"movie","title":"The Investigator:  New Film About the Death and Resurrection of Christ"},{"id":"comment-80478","author":"david_goulet","post":"Modern scholars have suggested that Mary M’s background was embellished by later Church writers. She is not now thought to be the woman who poured the perfume on Jesus’ feet. She was more than likely a prominent woman in the Jewish community, possibly a widow, but also someone who had the means to help support Jesus ministry. I’m just sharing what I’ve read from other sources. This doesn’t impede my enjoyment of Zeffirelli’s work. He was working with the interpretation of the time and it still reveals beautiful truths. Powell was good, for sure. Perhaps a bit too European for me, but he did bring a level of inner intensity that I’ve never seen any actor who has played Jesus replicate. Zeffirelli’s casting for the project was impeccable..","date":"2014-02-18","mins":"10:04 pm","url":"https://shroudstory.com/2014/02/17/son-of-god-in-theaters-february-28/","cat":"movie","title":"Son of God in Theaters February 28"},{"id":"comment-39130","author":"david_goulet","post":"This film seems to be preaching to the converted, based on the softie reviews. It reminds of the Lee Strobel books ‘the Case for…” which are filled with many strawmen. Not that there aren’t sound logical reasons for belief in Jesus, but as Yannick has pointed out, if it was all based on facts we’d have no reason for faith, would we?.","date":"2013-07-17","mins":"11:24 am","url":"https://shroudstory.com/2013/07/16/the-investigator-new-film-about-the-death-and-resurrection-of-christ/","cat":"movie","title":"The Investigator:  New Film About the Death and Resurrection of Christ"},{"id":"comment-202517","author":"david_goulet","post":"Typo in the first line, Dan: ‘show’ – not ‘shoe’. Though watching it may be good for one’s sole. ;).","date":"2015-06-17","mins":"10:57 am","url":"https://shroudstory.com/2015/06/17/the-shroud-on-nbcs-today-show/","cat":"television","title":"The Shroud on NBC’s Today Show"},{"id":"comment-143905","author":"david_goulet","post":"I agree with Colin. Please strike Dawkins comments from the site as they are misrepresentative. His use of the phrase ‘rock solid’ is laughable but he still is entitled to be honestly represented..","date":"2014-08-14","mins":"1:21 pm","url":"https://shroudstory.com/2014/08/14/update-on-the-movie-the-shroud-conspiracy/","cat":"movie","title":"Update on the Movie, The Shroud Conspiracy"},{"id":"comment-51279","author":"david_goulet","post":"Thanks for taking up the challenge so quickly. I was actually going to suggest a crucifix as a model – so some serendipity there. As to your results: they are similar to what we’ve seen before with scorches (which is why persons like yourself see validity in the theory). What’s needed now is to get the reverse image (like we have with the Shroud) and look at the 3 D imaging properties. The crucifix, while better than a flatter model, only has one area of mild double levelling (the loincloth). This is where I have to agree with Matthias that with the Shroud, if it is a scorch fake, we see a level of precision that is hard to imagine a medieval artistan being able to execute given the complexity of the figure (three levels on the front, bent knees at the dorsal). If it is a fake, the artist went with one of the most difficult models around. Experiments like yours increase the possibility of it being a scorch, yet at the same time decrease the probability, imo. Still, well done sir!.","date":"2013-11-14","mins":"11:04 am","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-51333","author":"david_goulet","post":"More good work, though I’m not quite sure why you are so astonished by the results. There is precedent for what you’ve achieved, no? Is there a way to get the photographic negative image result where we could see if your shroud displays the depth and detail of the Shroud. When time permits of course, you’d accomplished a ton in a day so no rush..","date":"2013-11-14","mins":"5:24 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-51364","author":"david_goulet","post":"Colinsberry : We seem to be at cross purposes here David. I am not attempting to reproduce the “depth and detail” of the Shroud, which I leave to those of an artistic bent, I am content merely to add ticks to a checklist of scientific criteria (superficial, non directional, light/dark reversed image, 3 D enhancible etc). In any case, I hardly think that the Shroud could be said to exhibit depth and detail when folk say one has to stand back several metres, simply to recognize it as the image of a man, and that the closer you get, the more the image seems to merge with the background coloration. Let’s not idealize. I’m looking at the detailing in the photo negative, where we see shadows and clefts. When one looks at this image it seems like the body could actually be touched. If all we had was the basic image I think the scorch forgery theory would be more plausible. But that life like photo negative with such fine detail has the real Wow factor. And because a medieval forger could never have known about this Wow factor he couldn’t have planned for it. It would mean it is an accidental byproduct of any scorched figure. We do agree that whatever the origin of the image, the photo negative effect is what makes the Shroud the enigma it is?.","date":"2013-11-14","mins":"7:33 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-51365","author":"david_goulet","post":"P.s. I did get the cross purposes joke. I assume it was intended. ;).","date":"2013-11-14","mins":"7:34 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-51378","author":"david_goulet","post":"I’ve been searching the internet for pics of negative photographs based on scorch images. For the most part only the Shroud and your bas relief experiments come up. So kudos for the pioneer work. It is a bit surprising that such a ‘promising’ explanation for the image formation has not been experimented with more. But people do have lives to live. I’d be interested in any photo negatives of the crucifix you might get. The scorch theory still doesn’t work for me (for many other reasons) but I think you’ve demonstrated that the Wow factor — while still Wow — could be considered a very happy accident..","date":"2013-11-14","mins":"8:55 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-50966","author":"david_goulet","post":"So when does this scholarly credentials pissing match end? Colin, you’ve already stated previously that there really isn’t anyone involved with sindonology that has credentials that passes muster. Everyone is just playing pretend at being serious researchers. Except those C 14 labs who are above approach of course. Perhaps you could put together your own team of ‘real’ scientists — the Anti STURP and collaborate with the C 14 labs that still have samples and blow this whole invisible weave theory out of the water. That would be more productive than this credential skeet shooting game. Perhaps not as much fun, but more productive..","date":"2013-11-12","mins":"1:32 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-50994","author":"david_goulet","post":"Impeccable credentials. As I’m sure most of the others mentioned will have as well, and thus they have no excuses. Why are these scholars not making any discernable efforts to re examine or retest the surviving samples? You fail to see why these good gents are ‘dissed’. It’s not because they came up with the “wrong answer” – – it’s because when faced with new questions and theories questioned the ‘answer’ these scientists have not replied ‘hmmm let’s go back to the source materials and look into that’. Instead they insist in Pharoanic fashion that “what we have written, we have written”. Why don’t you turn your critical eye on that gap in the scientific method for a few hours. But for what it’s worth, John was out of line with the dog comparisons. I don’t blame you for barking back..","date":"2013-11-12","mins":"4:56 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-50978","author":"david_goulet","post":"What does Google scholar (suddenly the go to source for everyone’s scholary back check needs) say about the scientists that did the C 14 testing? Does anyone know their names, I’d be happy to do the check. Due diligence and all..","date":"2013-11-12","mins":"3:22 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-50996","author":"david_goulet","post":"Sorry, Pilatian fashion. Pharoanic would be ‘so I have written, so let it be done’. Either fits actually..","date":"2013-11-12","mins":"4:58 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-51182","author":"david_goulet","post":"If anyone is doing another heated statue experiment, I’d be interested in seeing the result when using a statue with a minimum of three levels of contact – approximating the three levels of the body in the Shroud (top hand, bottom hand, lower trunk). Spatulas and coins are a good start but an object with more detailed 3 D would be very helpful..","date":"2013-11-13","mins":"10:50 pm","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-209124","author":"david_goulet","post":"I worked for many years with a Catholic Cardinal. I have a brother in law in Rome who is a priest and high up in his order. I worked with missionaries in Africa and the South Pacific. I follow commentary by Vatican insiders on the NCR blog. I have been involved with the church most of my life. I have seen, from experience, how clericalism corrupts, how power corrupts. I have known over ten abusers and seen how – until recently – nothing was done to stop them. I appreciate the hard slog Francis has in trying to revitalize the leadership of the Church. There are those that would stop him. The Church is on the verge of schism in my opinion, as traditionalists battle to return us to the days of Trent. Even as there are those that would take us too far, too fast in the other direction. My brother in law told me that when Francis made his wonderful statement that “a shepherd should smell like his flock” many in the Italian hierarchy responded “but my flock smell of Versace.” Would I trust these kinds of men with a new investigation of the Shroud? Would you?.","date":"2015-08-27","mins":"10:32 am","url":"https://shroudstory.com/2015/08/26/youtube-of-barrie-schwortz-at-ahmadiyya-annual-convention/","cat":"video","title":"YouTube of Barrie Schwortz at Ahmadiyya Annual Convention"},{"id":"comment-209028","author":"david_goulet","post":"Thanks for the background info on this sect. But I don’t understand why you are taking Hugh to task for attending the event and providing some very broad observations. Where does he claim to be an expert in religion?.","date":"2015-08-26","mins":"12:06 pm","url":"https://shroudstory.com/2015/08/26/youtube-of-barrie-schwortz-at-ahmadiyya-annual-convention/","cat":"video","title":"YouTube of Barrie Schwortz at Ahmadiyya Annual Convention"},{"id":"comment-209036","author":"david_goulet","post":"I suspect Hugh is also being as polite as he can. If the red hats in Rome and Turin are reading this then they have much too much time on their hands and perhaps should be looking after a parish somewhere. Hugh comments were totally coherent. Francis would delight in any inter religious dialogue — as opposed to inter religious warfare. Naturally he isn’t going to accept a Jesus in Kashmir theory, nor would anyone expect him to..","date":"2015-08-26","mins":"2:25 pm","url":"https://shroudstory.com/2015/08/26/youtube-of-barrie-schwortz-at-ahmadiyya-annual-convention/","cat":"video","title":"YouTube of Barrie Schwortz at Ahmadiyya Annual Convention"},{"id":"comment-209121","author":"david_goulet","post":"I know too well how it functions, Louis..","date":"2015-08-27","mins":"9:31 am","url":"https://shroudstory.com/2015/08/26/youtube-of-barrie-schwortz-at-ahmadiyya-annual-convention/","cat":"video","title":"YouTube of Barrie Schwortz at Ahmadiyya Annual Convention"},{"id":"comment-192230","author":"david_goulet","post":"The assumption that there is any evidence that the linen has been tested under scientific peer reviewed protocols and found to be 1st century. The repair hypothesis is still not proven (neither has it been disproven). And the three labs did not end up with dramatically different results which they averaged…where did you hear this?.","date":"2015-03-02","mins":"4:43 pm","url":"https://shroudstory.com/2015/02/13/two-more-articles-about-upcoming-cnn-series-on-finding-jesus/","cat":"press_coverage","title":"Two More Articles About Upcoming CNN Series on Finding Jesus"}]
