[{"id":"comment-215515","author":"david_goulet","post":"Valid point. It may have required careful religious observance while removing it as blood and flesh were involved. An activity that may have had to wait until after Sabbath to complete. If it was a cap that covered just the top rear part of the head then this is plausible. Otherwise we’d likely have some sign of it on the frontal face image..","date":"2015-12-02","mins":"8:20 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215506","author":"david_goulet","post":"But your problem would apply to a forgery as well. Why is there no image on the top if it is a bas relief type imprint? Why such precision in other areas but not on the top of the head? Artistic decision? But this wasn’t meant to be art (if it is a forgery I’m inclined to go with Colin’s theory that is meant as a relic)..","date":"2015-12-02","mins":"3:44 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215552","author":"david_goulet","post":"The flip side of course is that if the two relics are authentic then whatever (potentially) threw off the carbon dating (contamination) could have affected both linens. Is there evidence of other ancient linens, which have been exposed to the elements in a similar manner to these relics, providing unusual C 14 readings? Or are our two relics anomalous? The only way to establish any true link between the relics is to test the blood of both for a direct match. Until this is done it is all conjecture. But the Sudarium is a intriguing relic to be sure. We have many Shroud copies in existence — but how many Sudariums — which would be even easier to copy convincingly than the Shroud..","date":"2015-12-03","mins":"9:56 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215635","author":"david_goulet","post":"Define ‘similar’. Or perhaps provide an example or two for comparison sake. The C 14 dating remains the strongest evidence for the non authentist argument for both relics – there’s no denying that..","date":"2015-12-04","mins":"12:38 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"}]
