[{"title":"A Defense of Ray Rogers on the Image at the Thread and Fiber Level","post":"It is relevant to note that Barrie Schwortz once noted that the reaction itself was only half of the puzzle: \n“Ray Rogers told me personally that he believed, “Something else was at work with the Maillard reaction,” but he didn’t know what that was and didn’t live long enough to explore it.”\nSince that comment was posted here (https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/) and Yannick is well aware of that, it may be negligent to only partially portray Rogers’ position on the matter.\n\n","date":"September 14, 2014 at 7:46 am","url":"https://shroudstory.com/2014/09/14/a-defense-of-ray-rogers-on-the-image-at-the-thread-and-fiber-level/","cat":"guest_posting","id":"comment-150913","author":"Eric","site":"shroudstory"},{"title":"A Defense of Ray Rogers on the Image at the Thread and Fiber Level","post":"“…it may be negligent to only partially portray Rogers’ position on the matter.”\nOr there again, it may be negligent to quote Mr. Raymond N.Rogers (often though inaccurately prefaced with Dr. or Prof) as if the last word on the subject. \nHe was employed by a US Govt. agency to work on the safety assessment of chemical explosives on prolonged storage. He pioneered differential scanning calorimetry (DSC) as a means of monitoring changes in crystalline order that might provide clues to stability/instability characteristics related to decreasing Arrhenius energy of activation and thus kinetic susceptibility to spontaneous, non-detonator-triggered explosive decomposition. Along the way he acquired expertise in pyrolysis mass spectrometry, a handy tool for investigating unfamiliar chemical species that research chemists etc frequently encounter when pursuing open-ended studies, but was prone to premature publication, notably on detecting hydroxyproline in TS blood that he immediately adduced as evidence for a non-thermally-imprinted TS image,  a conclusion that does not stand up to close scrutiny by those of us more experienced with mass spectrometry where biochemicals and physiological fluids are concerned. \nBeyond that. Mr.Raymond N.Rogers was a fairly anonymous middle-level scientist, doing the job for which he was paid, competently and conscientiously. But then the same could be said for thousands of other research scientists the world over, with or without specific training in research (Mr. Rogers being without, which occasionally showed in his prima donna style of writing that invited no response to some quite tendentious ideas and propositions). \nThe main complaint this retired biomedical scientist with 12 years additional research in the area of plant polysaccharide (dietary fibre) research is concerned is that Raymond Rogers, having been invited to lead STURP’s chemical investigation of the TS, did not bother to acquaint himself with the detailed chemical structure of flax and linen fibres at the microscopical level. He repeatedly referred to them as if they were simply pure cellulose, referring just occasionally to chemically- reactive and thus easily pyrolysable hemicelluloses and pectins as if  “impurities” and never making a single reference to the superficial hemicellulose-rich primary cell wall (PCW), and choosing to lumber shroudology instead with an entirely hypothetical entity – the starch/saponin allegedly image-receptive impurity coating.\nIt’s time for a realistic assessment of the sadly-deceased.Ray Rogers’ strengths and weaknesses as an experimentalist and STURP team leader. With no disrespect to the dead (science being indifferent to its practitioners’ birth and death dates)  it’s  time that some took Ray Rogers off that pedestal and ceased referring to him as a scientific “great”. The latter description is simply not borne out by the facts, especially his googleable published work. I repeat: Ray Rogers had been a relatively anonymous middle level scientist, only acquiring a high profile AFTER acquiring visibility in his role as STURP team leader.\n\n","date":"September 14, 2014 at 9:03 am","url":"https://shroudstory.com/2014/09/14/a-defense-of-ray-rogers-on-the-image-at-the-thread-and-fiber-level/","cat":"guest_posting","id":"comment-150932","author":"Colin Berry","site":"shroudstory"},{"title":"A Defense of Ray Rogers on the Image at the Thread and Fiber Level","post":"You tried to mask it, but it stands as an ad-hominem attack.  Sorry for you.\n\n","date":"September 15, 2014 at 9:26 am","url":"https://shroudstory.com/2014/09/14/a-defense-of-ray-rogers-on-the-image-at-the-thread-and-fiber-level/","cat":"guest_posting","id":"comment-151167","author":"Nabber","site":"shroudstory"},{"title":"A Defense of Ray Rogers on the Image at the Thread and Fiber Level","post":"Where the Maillard reaction breaks down for me, is I don’t see how gas would uniformly emit from a decaying body at the same intensity whether from the torso, orifices or from extremities.  The uniform intensity of the image, top to bottom and front to back, is one of its most profound attributes.  As Eric mentioned, Rogers knew that the Maillard reaction alone could not be responsible for the highly resolved image we see on the Shroud.  IMHO, there is something else at work.  What that may be is anyone’s guess.\n\n","date":"September 14, 2014 at 8:45 am","url":"https://shroudstory.com/2014/09/14/a-defense-of-ray-rogers-on-the-image-at-the-thread-and-fiber-level/","cat":"guest_posting","id":"comment-150925","author":"russ Breault","site":"shroudstory"},{"title":"A Defense of Ray Rogers on the Image at the Thread and Fiber Level","post":"BTW, excellent article Yannick.  I just think Maillard reaction alone cannot explain all the attributes of the image.\n\n","date":"September 14, 2014 at 8:48 am","url":"https://shroudstory.com/2014/09/14/a-defense-of-ray-rogers-on-the-image-at-the-thread-and-fiber-level/","cat":"guest_posting","id":"comment-150927","author":"Shroud Encounter","site":"shroudstory"},{"title":"A Defense of Ray Rogers on the Image at the Thread and Fiber Level","post":"I don’t think the Milliard reaction answers anything! It is just too improbable taking into account what Russ mentioned in his comment…uniformity! A decaying body will not in most probability emit uniformly, especially the back image! Where was there room if the body was laid on a hard surface for gas to emit uniformly or how?? Its near impossible to digest. I mentioned the FACT that Rogers knew the Milliard reaction alone could not answer the mystery of the image a long time ago to Yannick, he tends to ignore this fact. I’ll go as far as saying; I’ll bet Rogers knew in his heart he was heading down the wrong path, but being human, pride took precedence….may he RIP.\n\n","date":"September 14, 2014 at 1:19 pm","url":"https://shroudstory.com/2014/09/14/a-defense-of-ray-rogers-on-the-image-at-the-thread-and-fiber-level/","cat":"guest_posting","id":"comment-150969","author":"Ron","site":"shroudstory"},{"title":"A Defense of Ray Rogers on the Image at the Thread and Fiber Level","post":"Well, yes and no…\nThe problem with both radiation and vapour interactions at a distance is the observation that only the most protruberant parts of the curve of each thread as it weaves in and out are discoloured. Both radiation and vapour should discolour every exposed part of each thread.\nThe ‘stochastic’ school acknowledge this, and explain that at threshold levels, however small the attenuation of the radiation over the tiny distances involved, there must be a distance which acts as a boundary between the distance within which discolouration can occur, and a distance too far for any reaction.\nThe ‘evaporation gradient’ school also acknowledge the problem, and say that a coating of dissolved chemicals evaporated away in such away that the chemicals were only left on the crown of the curves of the threads, so that although vapour from the body must have spread everywhere, only the crowns of the threads became discoloured by it.\nA mixture of these two ideas is quite tenable.\nThe ‘contact’ hypothesis does not require either the delicately balanced radiation threshold or the all-or-nothing chemical concentration only on the crown of the threads. It suffers from the observation that there appears to have been some action at a distance. If a bas relief was postulated as the model for the image, this difficulty is lessened.\n\n","date":"September 14, 2014 at 11:34 am","url":"https://shroudstory.com/2014/09/14/a-defense-of-ray-rogers-on-the-image-at-the-thread-and-fiber-level/","cat":"guest_posting","id":"comment-150955","author":"Hugh Farey","site":"shroudstory"},{"title":"A Defense of Ray Rogers on the Image at the Thread and Fiber Level","post":"And Ron, quite so; it is difficult to postulate a consistent emanation from all over a dead body, whether of radiation or of vapourous emission, and even more difficult to postulate such emission being only in a straight, vertical line upwards and downwards. But we must not fall into the trap of saying: “because it cannot be explained naturally, therefore it must be a fake.” We have heard, and rejected, arguments like that before, only usually, of course, they are the other way round: “because it cannot be explained artificially, therefore it must be authentic.” Neither of them is logically meaningful.\n\n","date":"September 14, 2014 at 3:09 pm","url":"https://shroudstory.com/2014/09/14/a-defense-of-ray-rogers-on-the-image-at-the-thread-and-fiber-level/","cat":"guest_posting","id":"comment-150990","author":"Hugh Farey","site":"shroudstory"},{"title":"A Defense of Ray Rogers on the Image at the Thread and Fiber Level","post":"As the TS is unlikely to be available for further scientific testing in the foreseeable future, then if in fact a scientific explanation is at all tenable, the only way forward would seem to be further experimentation.  Rogers’ own experiments with ammonia have coloured linen, apparently producing indicative results only. Colin has his scorching experiments, Fanti et al have their excimer lasers, Hugh has his pinkies, I assume presently in cold storage.  Few of the experiments to date seem to persuade anyone except only those whose babies they are.  The only way forward would seem to require major investment, remarkable and scarce skills, and dedication.  And even so an answer may still not be forthcoming.  I don’t think I’ll ever see it.\n\n","date":"September 14, 2014 at 4:17 pm","url":"https://shroudstory.com/2014/09/14/a-defense-of-ray-rogers-on-the-image-at-the-thread-and-fiber-level/","cat":"guest_posting","id":"comment-150996","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Defense of Ray Rogers on the Image at the Thread and Fiber Level","post":"The TS was created by the miracle of the resurrection, that’s why DaveB.\n\n","date":"September 15, 2014 at 4:16 am","url":"https://shroudstory.com/2014/09/14/a-defense-of-ray-rogers-on-the-image-at-the-thread-and-fiber-level/","cat":"guest_posting","id":"comment-151116","author":"Thomas","site":"shroudstory"},{"title":"A Defense of Ray Rogers on the Image at the Thread and Fiber Level","post":"That is a valid opinion which may eventually be shown to be an inevitable conclusion, but as yet remains untested, because of insufficient serious attempts to duplicate the properties of the coloration.  Investment, skills, true dedication and perseverance remain as yet fully untried.\n\n","date":"September 15, 2014 at 4:59 am","url":"https://shroudstory.com/2014/09/14/a-defense-of-ray-rogers-on-the-image-at-the-thread-and-fiber-level/","cat":"guest_posting","id":"comment-151124","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Defense of Ray Rogers on the Image at the Thread and Fiber Level","post":"A reply from Yannick who is unable to post comments;\nMessage from Yannick: “I note that many people, once again, I’ve not understood the heart of the message I wanted to deliver, which is that the important observations and analyses done by Rogers on his Shroud samples were good enough for him, a chemist expert in determining chemical damages on different types of material, to completely discard all the image formation hypotheses involving any form of energetic radiation and that’s include not only the corona discharge proposed by Fanti or DeLiso, the burst of UV light proposed by Di Lazzaro or Jackson, the burst of protons and neutrons proposed by Rinaudo, but also the scorch hypothesis proposed by various skeptics over the years.  That’s the main point.  The second is this: Unlike what some people have understood, I’m not saying that the Maillard reaction hypothesis (in the form described by Rogers) is THE answer to the image formation, but what I’m fully convinced after years of readings about the Shroud and particularly, after reading with attention and no bias all the writings of Rogers, is this: 1- The image formation must have come from a mild chemical reaction happening at low temperature (and possibly at room temperature). 2- This image formation process must have involved a quantity of “energy” quite small and most probably related to the biological state of the Shroud man’s corpse (and probably also related to its traumatic state). 3- The image chromophore must be located inside a thin and UNEVEN (very important element) layer of carbohydrate impurities instead of being located Inside the structure of the fiber itself (note that this type of carbohydrate coating is, as Rogers said clearly, a type of chromophore much easier to color chemically than the fiber itself, whether we talk about the primary cell wall or the rest of the fiber). And finally, concerning the “P.S.” that you can find at the end of my guess post, I wanted to show people a clear proof that, unlike some other Shroud researchers (I don’t want to name no one), I’m able to change my mind on a particular topic associated with the Shroud if my reflection eventually leads me to a different conclusion than what I first thought.  This concerns the fact that I gradually came to reject the image formation hypothesis described by Fazio and Mandaglio IN THE FORM THEY WROTE IT, while it leads me to propose a new hypothesis that has never been proposed before, which is that the discontinuous distribution of colored fibers in the image area can well have come from a combination of an image chromophore located only inside a thin and UNEVEN layer of carbohydrate impurities AND (in probably a lesser way) a stochastic process of image formation that involved a so small amount of “energy” that it wasn’t able to color every carbohydrate coated fibers it encountered.  If I’m right, that means that out of 3 fibers that were hit by the weak energy (that could have been post-mortem gases or something else probably related to the biological and traumatic state of the body), one could have been coated with a good amount of carbohydrate impurities and would have become yellowed through a still undermined chemical process, another one could have also been coated with a good amount of the same impurities but would have remained uncolored because the energy was so weak that it provoked a stochastic result of coloration and a third one could also have remained uncolored, not because of the weakness of the energy involved, but because this particular fiber would not have been coated with enough impurities to produce a visible yellowing on-top of the fiber.  THAT’S THE 3 MAIN MESSAGES I WANTED TO DELIVER WITH THIS GUESS POSTING OF MINE.  Unlike what some people seem to believe, I never intended to “sell” Rogers’ image formation hypothesis (in the form he wrote it) to anyone…”\n\n","date":"September 15, 2014 at 1:02 pm","url":"https://shroudstory.com/2014/09/14/a-defense-of-ray-rogers-on-the-image-at-the-thread-and-fiber-level/","cat":"guest_posting","id":"comment-151198","author":"Dan","site":"shroudstory"},{"title":"A Defense of Ray Rogers on the Image at the Thread and Fiber Level","post":"“Many people, once again, have not understood the heart of the message I wanted to deliver.” No. They understand it perfectly, but they disagree with it. That’s not the same thing at all.\nActually, I find all the action-at-a-distance explanations fraught with problems, so tend to agree with much of Yannick’s opening statements, although I would not clump scorching with UV, proton or other radiation, as scorching can be a contact (conduction) process as well as, and rather better than, a radiation one. I also agree that the image making process involved quite a ‘mild’ chemical change, probably at low temperature.\nHowever I do not agree that the image-forming mechanism “must” have come from biological material at all, let alone be related to its traumatic state, and I do not agree that the image chromophore “must be located inside a thin and UNEVEN (very important element) layer of carbohydrate impurities instead of being located inside the structure of the fiber itself.” Rogers’s findings in this respect are still controversial, and by no means established. His suggestion of a saponin/dextrose “impurity layer,” and his experiments with evaporation gradients are far from satisfactory, let alone conclusive, and Yannick’s suggestion that postulating an uneven layer of coating makes the hypothesis stronger is unconvincing to me.\n\n","date":"September 15, 2014 at 1:58 pm","url":"https://shroudstory.com/2014/09/14/a-defense-of-ray-rogers-on-the-image-at-the-thread-and-fiber-level/","cat":"guest_posting","id":"comment-151206","author":"Hugh Farey","site":"shroudstory"},{"title":"A Defense of Ray Rogers on the Image at the Thread and Fiber Level","post":"Just two thoughts in haste:\n1) Most, if not all of the linen fabrics, either medieval or ancient, were certainly washed with different kinds of soaps in water. This is certainly true for the Shroud that is a fine linen cloth.\nTherefore one can expect to find some residual impurities at the surface of the cloth.\n2) According to Rogers, the fact that some colored bundles of fibers are found adjacent to bundles of uncolored fibers can be explained by the properties of the uneven “thin layer” of impurities left by the evaporation/concentration process following the washing.\nThe “surface tension” is the key parameter.\nRogers: ” My point in mentioning surface-tension effects is to show that different amounts of suspended and/or dissolved impurities would deposit during evaporation of the washing liquid, depending on the surface characteristics of the batch of fibers. The soluble and colloidal components of crude starch would be in solution/suspension, and those impurities would be deposited on all parts of the cloth as the liquid evaporated. Differences in deposition would be seen depending on the surface properties and the rate of evaporation.(…)”.\nFrom: https://shroudofturin.files.wordpress.com/2012/08/rogers-maillard-reaction-for-dan-blog-2.pdf\nIs there another hypothesis explaining this simple observation/fact ?\nI do not know if the chromophore is the “thin impurity layer” or the PCW.\nBut I know that Rogers was a true scientist who was in contact with several experts.\n\n","date":"September 15, 2014 at 4:19 pm","url":"https://shroudstory.com/2014/09/14/a-defense-of-ray-rogers-on-the-image-at-the-thread-and-fiber-level/","cat":"guest_posting","id":"comment-151242","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"A Defense of Ray Rogers on the Image at the Thread and Fiber Level","post":"An important observation for me is that Rogers claimed to have removed the image coloration from a fibre by using dimide.  This left the underlying fibre exposed, intact and unaffected.  For me that is a strong argument in favour of his hypothesis that the image lies only on the coating of the fibre, not the fibre itself.  I think it can only be refuted by demonstrating that Rogers was mistaken about the results of this experiment. But like so many other experiments involving the Shroud, it was only ever done once, no-one else is reported as ever having repeated the experiment, and we remain as ever in the dark about the placement of the image,  A fundamental principle of experimental science, is that results should be repeatable, before acceptance of their truth value.  This is so seldom done in experiments involving the Shroud.  It always seem to lead to unnecessary controversies, and debates which go nowhere, and we remain as ignorant as ever, despite the various assertions made by persons professing their favourite theories or denials of same.\n\n","date":"September 15, 2014 at 3:46 pm","url":"https://shroudstory.com/2014/09/14/a-defense-of-ray-rogers-on-the-image-at-the-thread-and-fiber-level/","cat":"guest_posting","id":"comment-151232","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Defense of Ray Rogers on the Image at the Thread and Fiber Level","post":"Isn’t rather Alan Adler who did the diimide experiment? Rogers report the finding but does not say he redid the test. See item 12 at https://www.shroud.com/pdfs/rogers5faqs.pdf. Without redoing this test several times, we are left with one experiment which is weak evidence. Yet it is indeed an important observation.\n\n","date":"September 16, 2014 at 12:16 pm","url":"https://shroudstory.com/2014/09/14/a-defense-of-ray-rogers-on-the-image-at-the-thread-and-fiber-level/","cat":"guest_posting","id":"comment-151483","author":"Mario Latendresse","site":"shroudstory"},{"title":"A Defense of Ray Rogers on the Image at the Thread and Fiber Level","post":"Testus unus testus nullus\n\n","date":"September 16, 2014 at 12:21 pm","url":"https://shroudstory.com/2014/09/14/a-defense-of-ray-rogers-on-the-image-at-the-thread-and-fiber-level/","cat":"guest_posting","id":"comment-151484","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Defense of Ray Rogers on the Image at the Thread and Fiber Level","post":"Typo: testis unus testis nullus\n\n","date":"September 16, 2014 at 12:24 pm","url":"https://shroudstory.com/2014/09/14/a-defense-of-ray-rogers-on-the-image-at-the-thread-and-fiber-level/","cat":"guest_posting","id":"comment-151485","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Defense of Ray Rogers on the Image at the Thread and Fiber Level","post":"I needed to check my Latin dictionary.  Max is not being bawdy, Translates as “One witness is no witness”.  Surprisingly, the common medical term is derived from it.  Haven’t heard from you in a pretty long month or several.  Welcome back! daveb\n\n","date":"September 16, 2014 at 3:47 pm","url":"https://shroudstory.com/2014/09/14/a-defense-of-ray-rogers-on-the-image-at-the-thread-and-fiber-level/","cat":"guest_posting","id":"comment-151522","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Defense of Ray Rogers on the Image at the Thread and Fiber Level","post":"Thank you daveb. As a Latin legal maxim, testis unus testis nullus just means one single witness is no witness or in other words the experiment that was done only once (by Rogers), did not have probative weight.\n\n","date":"September 17, 2014 at 10:33 am","url":"https://shroudstory.com/2014/09/14/a-defense-of-ray-rogers-on-the-image-at-the-thread-and-fiber-level/","cat":"guest_posting","id":"comment-151910","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Defense of Ray Rogers on the Image at the Thread and Fiber Level","post":"The Latin ‘testis’ also relates to ‘testamentum; = testament.  I speculate that it’s adoption as applied to the male organ almost certainly refers to a primitive custom of making an oath.  There is an example in Genesis where a dying patriarch asks that his eldest son place his hand on his ‘thigh’ (an euphemism), and to make such an oath.\n\n","date":"September 16, 2014 at 3:58 pm","url":"https://shroudstory.com/2014/09/14/a-defense-of-ray-rogers-on-the-image-at-the-thread-and-fiber-level/","cat":"guest_posting","id":"comment-151525","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Defense of Ray Rogers on the Image at the Thread and Fiber Level","post":"Dave: “An important observation for me is that Rogers claimed to have removed the image coloration from a fibre by using dimide. This left the underlying fibre exposed, intact and unaffected. For me that is a strong argument in favour of his hypothesis that the image lies only on the coating of the fibre, not the fibre itself. I think it can only be refuted by demonstrating that Rogers was mistaken about the results of this experiment.”\nAdler (not Rogers) did the diimide experiment.( Mario is right). Adler also found the “ghosts” and then Rogers too.\nEven if ” like so many other experiments involving the Shroud, it was only ever done once”, I do think that it is a fact.\nRogers have shown later that the medulla of the image fibers is not colored. He also have shown that the “cellulose crystals” of the image fibers were not changed by the image forming process.\nThere is absolutely no doubt that the color is only at the very surface of the image fibers.\nWhat does the diimide experiment mean?\nColin writes (see :http://colinb-sciencebuzz.blogspot.fr/2014/08/lets-move-things-along-one-easy-step-at.html):\n“More importantly, diimide works at the molecular sub-microscopic level. Nothing can be deduced from colour or texture changes about structure at the macroscopic level (coatings etc).\nThe very term ‘colour removal’ is itself misleading if implying that anything is physically removed. Colour ‘removal’ is a chemical change that does not physically remove anything (diimide actually adds hydrogen atoms, e.g. across C=C double bonds, that interferes with the chromophore’s light-absorbing properties).”\nI fully agree ( yes !!!) and I could not explain better.\nIn other words, the diimide experiment says nothing about the chromophore carrier (PCW or impurity layer) except that it is at the very surface of the image fibers and that it very likely consists of C=C double bonds.\nUp to now, we have no mean to know what is the surface chromophore carrier.\n\n","date":"September 17, 2014 at 4:09 pm","url":"https://shroudstory.com/2014/09/14/a-defense-of-ray-rogers-on-the-image-at-the-thread-and-fiber-level/","cat":"guest_posting","id":"comment-152007","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"A Defense of Ray Rogers on the Image at the Thread and Fiber Level","post":"Thanks Thibault (& Mario & Colin).  That is very clear indeed.  Perhaps I had presumed that whatever had caused the colour had been “sponged out” by the dimide, and had been removed from the surface, rather like removing a stain.  But as I understand your explanation, that does not seem to have been the case.  Would I be correct in deducing that if hydrogen was added, that is in effect a reducing reaction, the opposite to oxidation?  My Chemistry I is now a little rusty. \nAs the experiment, like so many others involving the Shroud, seems to have only ever been done once, that still leaves a doubt, even though it is suggestive,  Max’s epigram “testis unus testis nullus” remains true, and like so many other experiments it need to be repeated to create any kind of scientific conviction.\n\n","date":"September 17, 2014 at 4:39 pm","url":"https://shroudstory.com/2014/09/14/a-defense-of-ray-rogers-on-the-image-at-the-thread-and-fiber-level/","cat":"guest_posting","id":"comment-152016","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Defense of Ray Rogers on the Image at the Thread and Fiber Level","post":"“Would I be correct in deducing that if hydrogen was added, that is in effect a reducing reaction, the opposite to oxidation?”\nThat’s true.\n“As the experiment, like so many others involving the Shroud, seems to have only ever been done once, that still leaves a doubt, even though it is suggestive, Max’s epigram “testis unus testis nullus” remains true, and like so many other experiments it need to be repeated to create any kind of scientific conviction.”\nOk. But, as I wrote, there are other experiments (Rogers), showing that the cellulose itself was not changed by the image forming process.\nThere is no doubt: this is a proved fact.\nWhat kind of process?\nMore tomorrow.\n\n","date":"September 17, 2014 at 5:38 pm","url":"https://shroudstory.com/2014/09/14/a-defense-of-ray-rogers-on-the-image-at-the-thread-and-fiber-level/","cat":"guest_posting","id":"comment-152030","author":"Thibault HEIMBURGER","site":"shroudstory"}]
