[{"title":"The Shroud of Turin – let’s focus on that hemicellulose coating on the linen fibres … It could explain a great deal","post":"Sorry,  Jos, I’ve tried without success to grasp the intended meaning at the start of your second para, but am not sure what you mean by distances from contact points. Can you assure me that you are not picturing a cloth that is loosely draped over the hot body (take that latter term any way you wish ;-)?  Are you aware that my assumption is that a bed of sand or similar is being used with a view to getting body and cloth in contact at most points, while accepting that the pressure being applied varies depending on the contour relative to the normal (which is likely to be a major determinant where intensity of image is concerned, since conduction/scorching depends on intimate contact). Or maybe you mean distances in the horizontal plane – if so please confirm.\nAs regards the “islands of oxidation ” – yes, a good point, and I’m all in favour of those crucial falsifying tests, but there is a factor that needs to be borne in mind, Any speck of opaque or semi-opaque dirt can act as an absorber of infrared rays from the hot object and produce local scorching. I kid thee not – see my early experiments with charcoal as a ‘thermo-sensitizer’ on my science buzz site, where it’s possible to paint (with watery charcoal paste), then scorch (under a source of infrared), wash out the charcoal to leave a scorched-in facsimile of one’s doodle!\n","date":"February 18, 2012 at 11:51 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/18/the-shroud-of-turin-lets-focus-on-that-hemicellulose-coating-on-the-linen-fibres-it-could-explain-a-great-deal/","cat":"cellulose","id":"comment-19","author":"colinsberry","site":"colinberry"},{"title":"The Shroud of Turin – let’s focus on that hemicellulose coating on the linen fibres … It could explain a great deal","post":"Sorry, there will be a few hours delay in your reply going up, Jos. Am out for the evening and not on my own laptop.\n","date":"February 18, 2012 at 6:24 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/18/the-shroud-of-turin-lets-focus-on-that-hemicellulose-coating-on-the-linen-fibres-it-could-explain-a-great-deal/","cat":"cellulose","id":"comment-17","author":"colinsberry","site":"colinberry"},{"title":"The Shroud of Turin – let’s focus on that hemicellulose coating on the linen fibres … It could explain a great deal","post":"The pyrolysis front would be formed by a great number of paths spreading out away from the contact region. Each of these paths will come to a halt abruptly and randomly. The overall result will be a halo of kinds,  a set of longer and shorter scorching paths spreading out from the contact region, with the global outlook being something like a fractal halo thinning out with distance.\nCrucially, it should be explained how such a mechanism could reproduce a scorching signal that weakens with increasing shroud-metal (or shroud-body) distance. The distance between a non-contact point and the contact area is not proportional to the distance between that same point and the metal (or the body).\nAnyway, I think that your theory can be tested in a very simple way. According to your  model,  ‘islands of oxidation’ (that is, small islands of scorched fiber surrounded by intact fibers) in image areas without direct contact between shroud and body,  cannot possibly occur. This is a claim that could be falisfied by showing a counter-example.\n","date":"February 18, 2012 at 6:12 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/18/the-shroud-of-turin-lets-focus-on-that-hemicellulose-coating-on-the-linen-fibres-it-could-explain-a-great-deal/","cat":"cellulose","id":"comment-16","author":"Jos Verhulst","site":"colinberry"},{"title":"The Shroud of Turin – let’s focus on that hemicellulose coating on the linen fibres … It could explain a great deal","post":"Just a holding reply:\n“The pyrolysis front would be formed by a great number of paths spreading out away from the contact region. Each of these paths will come to a halt abruptly and randomly. The overall result will be a halo of kinds, a set of longer and shorter scorching paths spreading out from the contact region, with the global outlook being something like a fractal halo thinning out with distance.”\nMethinks you are moving the goalposts, Jos. Nobody said the image was compact, or that it was confined to a certain distance of the hot metal, only that fibres were uniformly coloured wherever they were seen.\nI would have thought that a little spreading out was desirable anyway, to achieve softer edges, avoiding an excessively “stamped on” look. \nI’ll be back later with some other reflections…\n","date":"February 18, 2012 at 9:15 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/18/the-shroud-of-turin-lets-focus-on-that-hemicellulose-coating-on-the-linen-fibres-it-could-explain-a-great-deal/","cat":"cellulose","id":"comment-18","author":"colinsberry","site":"colinberry"},{"title":"The Shroud of Turin – let’s focus on that hemicellulose coating on the linen fibres … It could explain a great deal","post":"Why do you say “halo”? A half-tone effect should preclude halos that give differing intensities of coloration, or as I would say “scorching” within the same fibre. Any model to be credible has to produce an all-or-nothing effect, which I believe this one does. \nIt envisages an advancing front of pyrolysis that converts all hemicellulose microfibrils in its path to a maximally degraded state (at least for the particular temperature in question) but which then abruptly stops somewhere nearby, either because of heat loss that deprives the reaction of its Arrhenius energy of activation, or because of unfavourable geometry (the exothermic heat from pyrolysis escaping into air or the body of the cloth, and failing to “pre-roast” fibres beyond a certain point. \nIt’s like that analogy with the lighted match. If you don’t hold it at the correct end-down angle, it will go out, and the zone of pyrolysis (“charred bit”) stops quite abruptly, with unaffected wood immediately adjacent – a kind of “either/or” effect that is a consequence of that Arrehenius energy hump, the activation energy,  that is encountered whenever chemical bonds have to be broken before new ones can be formed.\n","date":"February 18, 2012 at 4:06 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/18/the-shroud-of-turin-lets-focus-on-that-hemicellulose-coating-on-the-linen-fibres-it-could-explain-a-great-deal/","cat":"cellulose","id":"comment-15","author":"colinsberry","site":"colinberry"},{"title":"The Shroud of Turin – let’s focus on that hemicellulose coating on the linen fibres … It could explain a great deal","post":"“The scorching will initially be confined to those parts of the fabric that are in IMMEDIATE contact with the hot metal…”. This seems to imply that the image would consist of a set of contact points or contact areas (where maximal oxidation occurs) that is surrounded by a halo fading out as a function of the distance to the contact area. There would be no  relationship connecting, at a given point of that halo, the intensity of the image to the  distance separating shroud and  hot metal surface.\n","date":"February 18, 2012 at 3:38 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/18/the-shroud-of-turin-lets-focus-on-that-hemicellulose-coating-on-the-linen-fibres-it-could-explain-a-great-deal/","cat":"cellulose","id":"comment-14","author":"Jos Verhulst","site":"colinberry"}]
