[{"title":"Two thousand years of chemical history was destroyed","post":"This truly does boggle the mind…and if one were to ask “What do you think would be the most devatating thing (apart from complete destruction) that could happen during the study and investigation of the shroud. ?Then I would have to answer …exactly what they already did and in the manner which they did it and was clearly pointed out in the article described by Ray Rogers.\nI never dreamed this could happen…and if so,only under pain of death…so to speak.I would be very interested to know more about this event and the circumstances that allowed it to happen.\n\n","date":"March 25, 2012 at 3:23 pm","url":"https://shroudstory.com/2012/03/25/two-thousand-years-of-chemical-history-was-destroyed/","cat":"news_&_views","id":"comment-9630","author":"john","site":"shroudstory"},{"title":"Two thousand years of chemical history was destroyed","post":"In the light of what Rogers said, I think we really have to ask ourselves this important question :  Is it possible that this kind of “non protective” restoration was done on purpose by the Church (or by some people inside the Church) ?  I’m not at all a great fan of conspiracy theories but, in this particular case, I found it hard to believe that the custodians of the Shroud were as dumb as that !  I know many people inside the Church have a hard time with the fact that the Shroud of Turin is probably authentic (I think it is mainly because they fear some Idolatry danger, which is real).  Who knows if this restoration wasn’t done to “erase” some important elements in this big puzzle so that it will be very difficult in the future for any scientist to reach a positive identification and say that this cloth is most probably the one who wrapped the body of Jesus of Nazareth ? Again, what force me to ask those question is because I just can’t believe the people who ordered and coordinated this restoration were so dumb and never consult any credible scientist before doing the job.  If there was no conspiracy, then the only conclusion is that I’m wrong here and yes, those people were really dumb !!!  The way I see things, it’s one or the other.  I don’t think there’s an in-between here.\n\n","date":"March 25, 2012 at 3:45 pm","url":"https://shroudstory.com/2012/03/25/two-thousand-years-of-chemical-history-was-destroyed/","cat":"news_&_views","id":"comment-9632","author":"Yannick Clément","site":"shroudstory"},{"title":"Two thousand years of chemical history was destroyed","post":"I haven’t read Meacham’s book, and I probably won’t as I would fear its consequences on my hypertension.\nIt seems as if the present custodial regime of the Shroud is totally incompetent and unfit for this sacred duty.  It didn’t even understand fundamental principles of representative sampling for purposes of C14 dating, with all the aftermath and consequences that brought about.  How many more errors are they going to be allowed to make?\nI can only think that the so-called “Restoration” work must have been put into the hands of those who imagined they were dealing with some artistic work, instead of an archaeological artifact.  It is not the first time that so-called Restorers have badly bungled a job.  Ian Wilson mentions one or two in his 2010 book relating to ancient icons representing the mandylion.\nIt’s too late now, and we’re only left with the archive of Ray Roger’s data, yet to be researched and catalogued.\n\n","date":"March 25, 2012 at 3:46 pm","url":"https://shroudstory.com/2012/03/25/two-thousand-years-of-chemical-history-was-destroyed/","cat":"news_&_views","id":"comment-9633","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Two thousand years of chemical history was destroyed","post":"I love your idea that the custodians were thinking in terms of “artwork protection” instead of an authentic burial cloth.  Who knows ?  Maybe that’s why they did what they did and there was no conspiracy ?  Who knows ?  If this is the way they saw the Shroud, it was completely off-track !!!\n\n","date":"March 25, 2012 at 3:54 pm","url":"https://shroudstory.com/2012/03/25/two-thousand-years-of-chemical-history-was-destroyed/","cat":"news_&_views","id":"comment-9636","author":"Yannick Clément","site":"shroudstory"},{"title":"Two thousand years of chemical history was destroyed","post":"For those not familiar with the 2002 restoration of the Shroud, read the Comments on the Restoration page of shroud.com at http://www.shroud.com/restored.htm for details.\n\n","date":"March 25, 2012 at 3:48 pm","url":"https://shroudstory.com/2012/03/25/two-thousand-years-of-chemical-history-was-destroyed/","cat":"news_&_views","id":"comment-9634","author":"Barrie Schwortz","site":"shroudstory"},{"title":"Two thousand years of chemical history was destroyed","post":"Everything regarding the restoration sounds horrible but to be fair I would like to hear the version of those involved in the restoration. Did they vacum the Shroud like a carpet or did they use – for example- a special device according to methodologies widely accepted by the scientific community for similar cases? Where is the material extracted in the process? Is it available for independent research and testing? Honestly, I dont know the answers but the questions have to be made. At this point, as in many other aspects of the Shroud we only have too many versions and very few facts. Is it possible to contact the team which performed the restoration and hear their version and what is more important, which was the fate of the extracted material?\n\n","date":"March 25, 2012 at 4:05 pm","url":"https://shroudstory.com/2012/03/25/two-thousand-years-of-chemical-history-was-destroyed/","cat":"news_&_views","id":"comment-9637","author":"Gabriel","site":"shroudstory"},{"title":"Two thousand years of chemical history was destroyed","post":"At the conference on the Shroud in Dallas in 2005, I know that Madam Flury-Lemberg did a speach to describe all his work.  Here’s a page about this conference on Barrie’s website : http://www.shroud.com/dallas3.htm\nI don’t know if this presentation done by madam Flury-Lemberg is avalaible somewhere…  I would like to read this.  M. Russ Breault, on his Shroud University website has many videos from many Shroud conferences but he don’t have nothing that come from the 2005 conference.  Just too bad !\n\n","date":"March 25, 2012 at 5:49 pm","url":"https://shroudstory.com/2012/03/25/two-thousand-years-of-chemical-history-was-destroyed/","cat":"news_&_views","id":"comment-9641","author":"Yannick Clément","site":"shroudstory"},{"title":"Two thousand years of chemical history was destroyed","post":"From what I can gather; the WHOLE surface of the Shroud was NOT vacuumed, apparently they used the micro-pipette technique when they did vacuum specific areas. Which? frontal areas specifically were not mentioned, but, also the back side of the cloth was vacuumed using the same micro-pipette method. As for any actual material extracted, also photographs, digital-imaging, tape samples or burn shards and not to forget the apparent videos of the proceedings; only a 31/2 minute video has been released to date…thats it!? They seem reluctant to expose anything. But in viewing the short video I was alarmed to see that simple precautions were not taken, such as it was not done in a clean room, people were not wearing gloves or masks or bio clothes! …Very unsettling to say the least. But according to custodians, all materials extracted was marked for its specific location of extraction, categorized and sealed, including the backing cloth, for future study.\nRon\n\n","date":"March 25, 2012 at 8:28 pm","url":"https://shroudstory.com/2012/03/25/two-thousand-years-of-chemical-history-was-destroyed/","cat":"news_&_views","id":"comment-9647","author":"Ron","site":"shroudstory"},{"title":"Two thousand years of chemical history was destroyed","post":"To help you find the materials on the restoration that we published in 2002, here are some links to the articles we included on the 2002 Late Breaking News page:\nDramatic News From Turin – http://www.shroud.com/late02.htm#restored\nRestored Shroud Unveiled – http://www.shroud.com/late02.htm#restored2\nComments on the Restoration – http://www.shroud.com/late02.htm#restored3\nComments on the Comments – http://www.shroud.com/late02.htm#restored4\nHere is a link to the resulting page of comments from Shroud scholars:\nComments on the Restoration Page – http://www.shroud.com/restored.htm\nHere is a link to an article provided by the Rev. Albert Kim Dreisbach Jr. with a translation of an Italian article by Mons. Joseph Ghiberti regarding the restoration:\nStory of the Restoration 2002 – http://www.shroud.com/pdfs/restore.pdf\nThese should provide some useful background material.\n\n","date":"March 25, 2012 at 5:42 pm","url":"https://shroudstory.com/2012/03/25/two-thousand-years-of-chemical-history-was-destroyed/","cat":"news_&_views","id":"comment-9640","author":"Barrie Schwortz","site":"shroudstory"},{"title":"Two thousand years of chemical history was destroyed","post":"One final note. You can use the Website Search Engine on http://www.shroud.com and enter “restoration” to find much more material about the 2002 restoration.\n\n","date":"March 25, 2012 at 6:06 pm","url":"https://shroudstory.com/2012/03/25/two-thousand-years-of-chemical-history-was-destroyed/","cat":"news_&_views","id":"comment-9642","author":"Barrie Schwortz","site":"shroudstory"},{"title":"Two thousand years of chemical history was destroyed","post":"Thanks Barrie for all the links. I personally can say I’ve read just about everything on your site to this topic, plus other material as in Wilson, Antonacci etc; I haven’t read Meachen’s book yet but I’ll get there. I realize you have made a statement to this before has in it is “water under the bridge” but I’m curious as to your thoughts on the whole ordeal, seeing as you may have much more insight then I could ever have.\nI have in the past here on this blog, raised the same question as Yannick did in his first post above…I am not a conspiracy theorist in normality, but this whole Shroud thing and the dealings of the custodians of such Shroud makes one wonder!…We now have two individual “situations” here that have in all intense and purposes, been BOTCHED, maybe deliberately and it would seem in the goal of making it impossible to ever finding the truth of this Shroud. The rediculous fiasco of the 1988 c14 dating caused by what I believe to be a deliberate choice of a contaminated sampling and ofcorse the ‘secret’ 2002 restoration. Most notably is the insistance of the Vatican/Custodians in dismissing/ignoring all outside scholarly advice or help along with showing a total lack of commonsense. These people are not stupid, so why such stupid mistakes? One can only conclude there is a power in the church that will do whatever possible to see the truth of the Shroud, whatever that may be, does not come to light….these are my personal thoughts on the matter.\nRon\n\n","date":"March 26, 2012 at 12:35 am","url":"https://shroudstory.com/2012/03/25/two-thousand-years-of-chemical-history-was-destroyed/","cat":"news_&_views","id":"comment-9648","author":"Ron","site":"shroudstory"},{"title":"Two thousand years of chemical history was destroyed","post":"Hi Ron, \nI am not convinced that the problem was with the Vatican, but it certainly existed in Turin. The Pope had to rely on information provided to him by his official custodian, the Archbishop of Turin, to make his decision to permit the restoration. If the Pope was told this was a necessary intervention, he would certainly have accepted that as fact and granted his permission. I believe that has all changed since the restoration and Rome is far more aware of the issues in Turin than they were in 2002.  Sadly, it is too late for the Shroud and the damage was done.  My personal opinion of the restoration is in total agreement with Ray Rogers and most other scientists who have studied the Shroud. I strongly urge you to read Meacham’s book when you can. It is well worth it.\nPerhaps the most unsettling part of what occurred was the attachment of a “new” backing cloth to the Shroud that was much whiter and brighter than the previous Holland cloth, lowering the apparent contrast of the image.  Worse yet, no chemical analysis was performed on the “new” cloth to determine if it had been treated in any manner that might prove harmful to the Shroud. Remember, it is permanently attached to the back of the Shroud. In one of the press releases from Turin after the restoration, they stated that the intervention “wasn’t about science but about conservation,” as if science plays no role in the conservation of the cloth. It was that attitude that was most disappointing.\nI leave for a series of lectures in Canada tomorrow morning and won’t be back in my office until April 4th.  I am not sure I’ll have internet access while there, so I may be silent for the next week or so.  I hope this information is helpful.\nBarrie\n\n","date":"March 26, 2012 at 4:26 pm","url":"https://shroudstory.com/2012/03/25/two-thousand-years-of-chemical-history-was-destroyed/","cat":"news_&_views","id":"comment-9667","author":"Barrie Schwortz","site":"shroudstory"},{"title":"Two thousand years of chemical history was destroyed","post":"Thanks for the response and your thoughts Barrie. I guess your right about the Vatican, the Pope would basically rely on his scientific experts I guess. But at the same time wouldn’t he be aware that there was absolutely no ‘outside’ help or advice? Wouldn’t that be expected? But maybe they just kept him in the dark about alot of things, who knows? And Yeah the backing cloth is something else.\nAnyways, your lectures in Canada, any scheduled in Toronto? Would definately like to attend if so.\nThanks,\nRon\n\n","date":"March 26, 2012 at 5:33 pm","url":"https://shroudstory.com/2012/03/25/two-thousand-years-of-chemical-history-was-destroyed/","cat":"news_&_views","id":"comment-9670","author":"Ron","site":"shroudstory"},{"title":"Two thousand years of chemical history was destroyed","post":"Hi Ron,\nIt is hard to know exactly what Pope John Paul II knew about the planned intervention but we have to assume he was told it was necessary.  By 2002 his health was declining and he might not have known much else.\nMy current lectures are in Delta, B.C. near Vancouver. I may be in the Toronto area in October however.  The Vancouver Shroud Association has a Shroud exhibit that might be going to Toronto late this year. If that is confirmed, I’ll be there too.  If so, I hope to see you there. I’ll try and post the info on the website once it is finalized. You can see my current lecture schedule at this link:  http://www.shroud.com/latebrak.htm#lectures\nWarmest regards,\nBarrie\n\n","date":"March 26, 2012 at 6:02 pm","url":"https://shroudstory.com/2012/03/25/two-thousand-years-of-chemical-history-was-destroyed/","cat":"news_&_views","id":"comment-9673","author":"Barrie Schwortz","site":"shroudstory"},{"title":"Two thousand years of chemical history was destroyed","post":"Thanks for the heads-up Barrie, I’ll also keep my eye on your website schedule. Hope to see you here someday.\nRon\n\n","date":"March 26, 2012 at 7:03 pm","url":"https://shroudstory.com/2012/03/25/two-thousand-years-of-chemical-history-was-destroyed/","cat":"news_&_views","id":"comment-9676","author":"Ron","site":"shroudstory"},{"title":"Two thousand years of chemical history was destroyed","post":"\nYannick Clément :\nIn the light of what Rogers said, I think we really have to ask ourselves this important question :  Is it possible that this kind of “non protective” restoration was done on purpose by the Church (or by some people inside the Church) ?  I’m not at all a great fan of conspiracy theories but, in this particular case, I found it hard to believe that the custodians of the Shroud were as dumb as that !\n\nUnfortunatly, I would say there is no conspiracy. The custodians of the Shroud simply put secret higher than science.\nNow, the best answer is to build a kind of STURP 2 who would like to deal with the shroud, raising new questions and new methods.\n\n","date":"March 27, 2012 at 2:54 pm","url":"https://shroudstory.com/2012/03/25/two-thousand-years-of-chemical-history-was-destroyed/","cat":"news_&_views","id":"comment-9697","author":"anoxie","site":"shroudstory"},{"title":"Two thousand years of chemical history was destroyed","post":"If this is true (and it’s not hard for me to believe this), then, the conclusion is that those people are simply dumb !  At the time of the restoration, there was many STURP members (like Rogers) that were still alive and that could have been good counsellors, but unfortunatelly, they didn’t ask them their opinions before doing the job.  I know Al Adler was one important counsellors for some years before his death (and I even think, sadly, that he was one pushing Turin to do a restoration very quickly).  But between Adler’s death in 2000 and the restoration in 2002, I don’t think Turin was in touch with any STURP members…\n\n","date":"March 27, 2012 at 3:33 pm","url":"https://shroudstory.com/2012/03/25/two-thousand-years-of-chemical-history-was-destroyed/","cat":"news_&_views","id":"comment-9700","author":"Yannick Clément","site":"shroudstory"},{"title":"Two thousand years of chemical history was destroyed","post":"“Unfortunately, I would say there is no conspiracy. The custodians of the Shroud simply put {secrecy} higher then science….That IS conspiracy lol…Sorry I don’t buy it, as in the argument of provenance of the Shroud there is only two answers here to this total debauchery; They (custodians) are either complete ‘IDIOTS’ or it was a deliberate act of sabotage on the shroud. There is no middle ground on this, unfortunately.\nSTURP 2? Sorry that was declined in 1988, this would be STURP 3 or STURP ‘ATTEMPT 2’. I would most probably go into shock, if the news;  “Custodians of the Shroud have sanctioned another STURP investigation into the Shroud of Turin”, literally.\nRon\n\n","date":"March 27, 2012 at 6:46 pm","url":"https://shroudstory.com/2012/03/25/two-thousand-years-of-chemical-history-was-destroyed/","cat":"news_&_views","id":"comment-9707","author":"Ron","site":"shroudstory"},{"title":"Two thousand years of chemical history was destroyed","post":"I think we will both be dead for a time when it will happen ! ;-)\n\n","date":"March 28, 2012 at 1:00 pm","url":"https://shroudstory.com/2012/03/25/two-thousand-years-of-chemical-history-was-destroyed/","cat":"news_&_views","id":"comment-9730","author":"Yannick Clément","site":"shroudstory"},{"title":"Two thousand years of chemical history was destroyed","post":"The restoration may have been awkward and amateur, but I don’t think they deteriorated the shroud on purpose.\nA kind of STURP 2 meant a new team of scientists, worldly reknowned in their field, asking questions and elaborating new protocols to study the shroud.\n\n","date":"March 28, 2012 at 11:48 am","url":"https://shroudstory.com/2012/03/25/two-thousand-years-of-chemical-history-was-destroyed/","cat":"news_&_views","id":"comment-9726","author":"anoxie","site":"shroudstory"}]
