[{"title":"Quickie response to Thibault Heimburger re that 1949 Lea and Hannan paper on the casein-glucose Maillard reaction.","post":"PS: thanks btw for suggesting how that figure of 40,000 might have arisen from the data you extracted. But it still does not explain where that 80 degrees C figure came from. I’ll take your word for it not being in the paper, which makes one wonder if someone has seen additional Lea and Hannan data elsewhere and wrongly attributed it to their 1949 BBA paper. I see that paper was just one of a series, so it’s not impossible.\nHow ludicrous – sickening in fact –  that 60 year old science is still behind a pay wall.\nOn a totally different subject – what’s your view Thibault on post mortem ‘fibrinolysis’ of  external blood clots? .Do you think that sequestered plasminogen would/could be activated under such circumstances sufficient to allow previously dried clots to re-liquefy to imprint on linen as good, if not better, than freshly-shed blood? Can moisture-retention, for whatever reason, really do that?\n","date":"August 13, 2012 at 5:25 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/08/12/quickie-response-to-thibault-heimburger-re-that-1949-lea-and-hannan-paper-on-the-casein-glucose-maillard-reaction/","cat":"casein","id":"comment-473","author":"colinsberry","site":"colinberry"},{"title":"Quickie response to Thibault Heimburger re that 1949 Lea and Hannan paper on the casein-glucose Maillard reaction.","post":"But those figures bear out exactly what I’ve been saying all along: there is negligible reaction between the amine source and the reducing carbohydrate at lower temperatures up to and including room temperature, even up to 37 degrees.\n0°C: 0.0015\n10°C: 0.0067\n20°C: 0.034\n37°C: 0.71\n55°C: 9.3\n70°C: 58.”\n Each additional 10 degree rise in temperature (albeit not measured here in that precise interval except at the beginning ) produces a vast increase in reaction. It’s way in excess of the Q10 of 2 or even 3 that Rogers cited, making it sound as though the Maillard reaction were a typical reaction in kinetic/thermodynamic terms when it clearly is not, being far more temperature-sensitive as these (admittedly incomplete) data show.  OK, so one is not measuring polymerised end product, only the essential first fixation of nitrogen, but if the first step follows these kinetics, and the putative exposure to amine was brief – at most a day or two (if that) – then the final yellow colour that would develop on standing would presumably be in rough proportion to the values in this table.\nSorry, but the kinetics and/or thermodynamics of the Maillard reaction (initial step included), in particular the temperature response curve, are all wrong for image formation in the range of normal environmental temperatures – say up to 40 degrees C. The Maillard reaction simply does not fit the bill. It is a process that needs much higher temperatures, say 50 degrees or above, to stand any chance of producing an appreciable yellow or brown colour by the proposed mechanism of brief exposure to amines, even if the subsequent incubation period were to be centuries…. \nThank you for your interest, Thibault… but I’m sticking to my guns on this one. I recognize a dud hypothesis when I see one….\n","date":"August 12, 2012 at 9:49 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/08/12/quickie-response-to-thibault-heimburger-re-that-1949-lea-and-hannan-paper-on-the-casein-glucose-maillard-reaction/","cat":"casein","id":"comment-470","author":"colinsberry","site":"colinberry"},{"title":"Quickie response to Thibault Heimburger re that 1949 Lea and Hannan paper on the casein-glucose Maillard reaction.","post":"Colin,\nThe “40,000 fold” is not found so in the document. However, I have found what follows :\n———————————————–\n” Effects of temperature : (….)\nCasein-glucose … were held in equilibrium with an atmosphere of 70% RH, at temperatures of 0, 10, 20, 28.5, 37 and 55°C, as described above, and examined at intervals for free amino-N content and for color. …A further experiment was, however, performed at 70°C to obtain a figure of less accuracy.\nWhen the results were plotted it was found that all the curves of amino loss against time were of the same general shape and tended to the same final value. The rates could therefore be compared quite adequately by considering only the initial reaction rate determined by drawing the tangent at zero time to the smoothed curve. A number of readings were taken at short reaction times to ensure the accuracy of the initial portion of the curve; The values for the initial rate, expressed as % loss of amino N per hour, were :\n0°C: 0.0015\n10°C: 0.0067\n20°C: 0.034\n37°C: 0.71\n55°C: 9.3\n70°C: 58.”\n——————————————\nI assume that these numbers are the basis of the “40,000 fold” statement (0.0015 x 40.000 = 60)\nBut it is the VERY INITIAL rate of the reactions (and not of the color) that finally “tended to the same final value”.\nThis has nothing to do with the development of the color in the first weeks as explained in my comment on Dan’s blog.\nOf course the temperature has a critical influence on the rate of the Maillard reactions but there is no doubt that many of them can give a yellow-brown discoloration within some days, months or years at room temperature (Rogers explained that in the paper I wrote that is now on Dan’s blog).\n","date":"August 12, 2012 at 9:20 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/08/12/quickie-response-to-thibault-heimburger-re-that-1949-lea-and-hannan-paper-on-the-casein-glucose-maillard-reaction/","cat":"casein","id":"comment-469","author":"Thibault HEIMBURGER","site":"colinberry"}]
