[{"id":"comment-29510","author":"cody_wendt","post":"Some thoughts on the various perspectives and arguments being presented here: 1. Rinaldi’s critique of Fanti’s selective dating corrections looks powerful; it suggests that Fanti allowed his desire for a first century centered date range to compromise his objectivity. I will be interested to see if and how Fanti responds to this. 2. However, let it be said that Rinaldi himself is clearly biased *against* arguments for the Shroud’s authenticity, as he shows when he derisively asserts that “the only ‘evidence’ of antiquity adduced by Shroudologists is in the (non existent) fingerprints of two coins of Pontius Pilate!”– an irksome, false, and utterly ignorant statement. As such, I do not feel confident that Rinaldi provides a genuinely fair assessment of Fanti’s research; further reviews by knowledgeable readers, as well as an English translation, will be very helpful. 3. Yannick Clement makes some valid points, but seems to have an intense emotional vendetta against Fanti, as evidenced by the fact that he seems intent on dominating every Fanti related comment thread with posts heavy in highly personalized attacks on Fanti’s character. His claim that nothing Fanti says should ever be used as evidence is, to my mind, significantly over the top. As noted above, I do think that Fanti’s scientific objectivity is questionable, but let it be said that absolutely no scientist, not even the very best of them, is entirely free of bias; it is only a matter of how much and what kind each individual has. As such, we are left in the position of having no choice but to use material generated by individuals who have biases. Even a biased individual, assuming he is not an out an out fraud (and I do not believe Fanti is one), can still generate useful data, though it may require more sifting and interpretation to make use of than that which was compiled by a more objective researcher. Fanti may be more biased than the ideal scientist (and more biased than, say, a Raymond Rogers), but it would amount to an ad hominem fallacy to argue on those grounds that no data he generates can ever provide viable evidence relating to the Shroud’s authenticity. All told, from what I’ve seen, it looks as though Fanti’s tests might not offer the ironclad evidence of the Shroud’s dating from the time of Christ that has been claimed (since the precision of the techniques is uncertain and the figures seem to have been “massaged” in a way that may have generated a range more closely centered around the first century than was justified), but that they may nonetheless strongly indicate (as, contrary to Rinaldi, a great deal of other evidence already does) that the Shroud is substantially older than the 1988 radiocarbon dating result, which is still a very significant finding..","date":"2013-04-05","mins":"12:27 pm","url":"https://shroudstory.com/2013/04/04/a-critical-review-of-giulio-fantis-new-book-unreliable-results-because-of-inadequacy-of-methods/","cat":"books","title":"A Critical Review of Giulio Fanti’s New Book:   Unreliable Results Because of Inadequacy of Methods"}]
