[{"title":"\n\"Editorial and Contents,\" Shroud of Turin News, August 2016 \n","post":"\n\nI wonder that there is a correlation between the fact that most of your readers come from the Russian Federation and your hacking theory.\n\n","author":"Anonymous","date":"September 2, 2016 at 5:36 PM","url":"http://theshroudofturin.blogspot.com/2016/09/editorial-and-contents-shroud-of-turin.html","site":"moore"},{"title":"\n\"Editorial and Contents,\" Shroud of Turin News, August 2016 \n","post":"\n\nAnonymous>I wonder that there is a correlation between the fact that most of your readers come from the Russian Federation and your hacking theory.There may be, but as far as I am aware, Google Analytics does not provide information about where readers of individual posts come from.Also my hacking theory posts rarely (if ever) feature in Google Analytics' most pageviews for a month.Superficially one might think that my July 30 post, \"The 1260-1390 radiocarbon date of the Turin Shroud was the result of a computer hacking #9,\" which was about the former Soviet Union's alleged role in the hacking, may have been responsible for the 21st August sudden jump in pageviews. But as the Google Analytics reports in my \"Editorial and Contents\" posts for July and August show, that post was not listed in the most pageviews for those months.Also, my May 2016 \"Editorial and Contents\" post was when I first noticed the map of Russia representing the most readers, but there was no hacker theory post in that month. There seems to have been a gradual increase in Russian readers over time and they are not reading any particular posts.  Stephen E. Jones----------------------------------MY POLICIES. Comments are moderated. Those I consider off-topic, offensive or sub-standard will not appear. Except that comments under my latest post can be on any Shroud-related topic. I normally allow only one comment per individual under each one of my posts.\n\n","author":"Stephen E. Jones","date":"September 2, 2016 at 7:30 PM","url":"http://theshroudofturin.blogspot.com/2016/09/editorial-and-contents-shroud-of-turin.html","site":"moore"}]
