[{"title":"\nCrispino, Dorothy (1916-2014): Turin Shroud Encyclopedia\n","post":"\n\nHello Stephen, it looks like Joseph Accetta has hugh Farey fever . Not to be confused with August Accetta, STURP team member Joseph Accetta is presenting a possible 14th century explanation for that image and he's speculating that the image is made from a contact process. It looks like we are officially in the twilight zone lol. Another hugh Farey clone is ignoring the mountain of evidencefir an older date yet again. Is Joseph Accetta an atheist , agnostic or Christian. I haven't been able to find much on his worldview , but he will be presentimg this at the shroud conference in St. Louis .Where are they getting these kooky theories from?Colin berry who ridiculed sturp so many times is suddenly pro Accetta . Why doesn't that surprise me.http://www.stlouisshroudconference.com/program/speculations-on-the-14th-century-origins-of-the-turin-shroudPresentationSPECULATIONS ON THE 14TH CENTURY ORIGINS OF THE TURIN SHROUD10-Oct-201411:15-11:45 amAuthorsJoseph Accetta, Ph.D. - PresenterAbstract:This paper is based on the assumption that the Shroud is of 14th century origins consistent with its radiocarbon date and thus must be explained within the technology and historical context of that era. Avoiding the controversy surrounding the date, the author presents a plausibility argument to reconcile its visual and forensic properties with extent 14th century printing technology, geographical circumstance and historical context. The observed 3-d properties of the image are discussed in relationship to physical image formation processes and a plausible explanation for this extraordinary effect is given based printing techniques known to exist at that time and in that locale. Further the argument is reinforced with analytical results showing that under any reasonable assumption about the surface bi-directional reflectance distribution function (BRDF) including the use of measured human skin data, the observed 3-d properties cannot be reconciled with any known radiative imaging process and thus must be a contact process.I really wanted to attend the conference. Now I thank the good lord above that I couldn't make it.Bippy123\n\n","author":"Bippy123","date":"August 31, 2014 at 4:56 PM","url":"http://theshroudofturin.blogspot.com/2014/08/crispino-dorothy-1916-2014-turin-shroud.html","site":"moore"},{"title":"\nCrispino, Dorothy (1916-2014): Turin Shroud Encyclopedia\n","post":"\n\nBippy123>Hello Stephen, it looks like Joseph Accetta has hugh Farey fever . Not to be confused with August Accetta, STURP team member Joseph Accetta is presenting a possible 14th century explanation for that image and he's speculating that the image is made from a contact process. He's WRONG regarding the image being made by a contact process. For the simple reason the Shroud has images of parts of the body that could not have been in contact with it.See the photo and diagram in Paolo di Lazzaro's paper, \"Could A Burst of Radiation Create a Shroud-Like Coloration? A Summary of 5 years of Experiments at ENEA Frascati,\" Valencia Shroud Congress, 2012. >It looks like we are officially in the twilight zone lol. Another hugh Farey clone is ignoring the mountain of evidencefir an older date yet again. The problem is that the invincibly ignorant are proposing naturalistic `explanations' of the Shroud image which will be accepted by the equally ignorant. A variation on Jesus' `blind leading the blind' (Mt 15:14; Lk 6:39).I am scanning Shroud Spectrum International and there is compelling evidence that the Shroud is authentic, but coming generations, who don't read deeply the Shroud pro-authenticity literature won't know that.  >Is Joseph Accetta an atheist , agnostic or Christian. I haven't been able to find much on his worldview , I don't know. I have never heard of him. >but he will be presentimg this at the shroud conference in St. Louis .Let's hope he is corrected in the Q&A session after his presentation by someone at the Conference. In days past, when pro-authenticists Ian Wilson and Mark Guscin edited the BSTS Newsletter, any such corrections would have been reported in it.But now the anti-authenticist Hugh Farey, who believes that the Shroud was a 14th century accident, any such correction probably won't be reported in the BSTN.[continued]\n\n","author":"Stephen E Jones","date":"August 31, 2014 at 10:47 PM","url":"http://theshroudofturin.blogspot.com/2014/08/crispino-dorothy-1916-2014-turin-shroud.html","site":"moore"},{"title":"\nCrispino, Dorothy (1916-2014): Turin Shroud Encyclopedia\n","post":"\n\n[continued]>Where are they getting these kooky theories from?So powerful is the indoctrination in Naturalism (`nature is all there is: there is no supernatural') in science (I have a BSc and I have experienced it first-hand), the universities in general, and even some theological colleges, that some (if not most) Christians who are scientists seek a naturalistic explanation for everything, even Biblical miracles. But they are inconsistent in that if Christianity is true, then Naturalism is FALSE.While he is not a scientist, I came across an online paper by Dan Porter where he admits that he regards (or at least did in 2001), \"the Resurrection\" as \"a metaphor\":\"I am a theologically liberal thinking person ... and I accept many thing in the Bible that are scientifically or historically implausible as something of a metaphor. For me, these questions about the Shroud’s authenticity were daunting. For no matter how I might try to separate the mysterious and inexplicable image on the Shroud from my metaphorical interpretations of the Resurrection, I could not do so.\" (Porter, Daniel R., 2001, \"The Shroud of Turin and the Resurrection Problem: an Anglican/Episcopal perspective\").If Porter still believes that the Resurrection of Christ is a metaphor, and he was hoping the Shroud would convince him otherwise, but it didn't (because he has the cart before the horse), it would explain much about Porter, including his being pro- anti-authenticist and anti-Bible believing pro-authenticists like me, on his blog.That is, I assume that because Porter still can't accept the Resurrection of Christ was literal, he is now turning against the Shroud's authenticity.>Colin berry who ridiculed sturp so many times is suddenly pro Accetta . Why doesn't that surprise me.Berry, being also a Philosophical Naturalist, would be pro ANY naturalistic explanation of the Shroud, even if it's WRONG![continued]\n\n","author":"Stephen E Jones","date":"August 31, 2014 at 11:24 PM","url":"http://theshroudofturin.blogspot.com/2014/08/crispino-dorothy-1916-2014-turin-shroud.html","site":"moore"},{"title":"\nCrispino, Dorothy (1916-2014): Turin Shroud Encyclopedia\n","post":"\n\n[continued]>http://www.stlouisshroudconference.com/program/speculations-on-the-14th-century-origins-of-the-turin-shroud>>Presentation>>SPECULATIONS ON THE 14TH CENTURY ORIGINS OF THE TURIN SHROUD>>10-Oct-2014>11:15-11:45 am>Authors>>Joseph Accetta, Ph.D. - Presenter>>Abstract:>>This paper is based on the assumption that the Shroud is of 14th century origins consistent with its radiocarbon date and thus must be explained within the technology and historical context of that era. He is deceiving himself. The MOUNTAIN of evidence that the Shroud existed well before 1260, indeed all the way back to the 1st century, is proof beyond REASONABLE doubt that the 1260-1390 = 1325 +/- 1325 radiocarbon date of the Shroud was WRONG.Indeed, as I have pointed out in my posts, \"My theory that the radiocarbon dating laboratories were duped by a computer hacker #5\" and #6, Table 2 of the 1989 Nature paper, with its admission, that: \"An initial inspection of Table 2 shows that the agreement among the three laboratories for samples 2, 3 and 4 [non-Shroud controls] is exceptionally good.  The spread of the measurements for sample 1 [the Shroud] is somewhat greater than would be expected from the errors quoted\" shows that the Shroud sample's dates were not real dates, but were computer-generated (e.g. by Timothy W. Linick's hacker program).Since samples 1 (the Shroud) and 2, 3 and 4 [non-Shroud controls] were all on the one ~26 mm or ~1 inch carousel wheel and each sample was irradiated in turn for 1 minute, the whole run taking 10 minutes, there is NO WAY that the Shroud samples could have a spread of different C14 dates AND \"the agreement among the three laboratories for samples 2, 3 and 4\" be \"exceptionally good.\"Something MAJOR must have gone wrong (e.g. the Shroud dates are not real dates but computer-generated), and the radiocarbon dating of the Shroud should have been declared FAILED.But the labs went too far out on a limb publicly to admit that, and so they HAD to pretend that the Shroud's dating was valid, when it WASN'T. [continued]\n\n","author":"Stephen E Jones","date":"September 1, 2014 at 12:00 AM","url":"http://theshroudofturin.blogspot.com/2014/08/crispino-dorothy-1916-2014-turin-shroud.html","site":"moore"},{"title":"\nCrispino, Dorothy (1916-2014): Turin Shroud Encyclopedia\n","post":"\n\n[continued]>Avoiding the controversy surrounding the date, That there still IS a \"controversy surrounding the date\" of the Shroud, 26 years later, itself shows that the Shroud's 1988 C-14 date of 1260-1390 was not reliable.So what is the point of trying to show, against the OVERWHELMING weight of the evidence, that the Shroud had a 14th century origin? >the author presents a plausibility argument to reconcile its visual and forensic properties with extent 14th century printing technology, geographical circumstance and historical context. Again he is deceiving himself. Even if it could be shown that the Shroud COULD have been produced in the 14th century, the historical and artistic evidence for the Shroud's existence well before the 14th century, and indeed all the way back to the 1st century, shows that it WASN'T.>The observed 3-d properties of the image are discussed in relationship to physical image formation processes and a plausible explanation for this extraordinary effect is given based printing techniques known to exist at that time and in that locale. So where are all the other 14th century shrouds and artworks produced by these \"printing techniques\"? And what 14th century \"printing techniques\" can print an image on linen that is one flax cell wall (\"one fifth of a thousandth of a millimetre\" or 0.0002 mm) deep? With no ink (the Shroud image is not paint, dye or pigment but a physical change to the linen fibres).>Further the argument is reinforced with analytical results showing that under any reasonable assumption about the surface bi-directional reflectance distribution function (BRDF) including the use of measured human skin data, the observed 3-d properties cannot be reconciled with any known radiative imaging process and thus must be a contact process.Again, it CANT have been a contact process because the Shroud's image shows recessed areas of the Man's body which could not have been in contact with the cloth. See Lazzaro's 2012 paper.And also where in the same paper where Lazzaro shows how the closest match to the Shroud's image was found by his ENEA lab to have been produced by a high wattage, high frequency, UV laser. >I really wanted to attend the conference. Now I thank the good lord above that I couldn't make it.Why \"thank the good lord above\"? Presumably there are going to be other papers at the St. Louis Shroud Conference 2014 which take account of ALL the available evidence, than Joseph Acetta's, which simply IGNORES that evidence?Stephen E. Jones---------------------------------Reader, if you like this my The Shroud of Turin  blog, and you have a website, could you please consider adding  a hyperlink to my blog on it? This would help increase its Google PageRank number and so enable those who are Google searching on \"the Shroud of Turin\" to more readily discover my blog. Thanks.\n\n","author":"Stephen E Jones","date":"September 1, 2014 at 12:08 AM","url":"http://theshroudofturin.blogspot.com/2014/08/crispino-dorothy-1916-2014-turin-shroud.html","site":"moore"},{"title":"\nCrispino, Dorothy (1916-2014): Turin Shroud Encyclopedia\n","post":"\n\n>I am scanning Shroud Spectrum International and there is compelling evidence that the Shroud is authentic, ...I was referring to an article by physicist John P. Jackson, that I am in the midst of scanning right now, \"Is the Image on the Shroud Due to a Process Heretofore Unknown to Modern Science?\" Shroud Spectrum International, Issue #34, March 1990, pp.3-29, in which Jackson shows convincingly that the only explanation for all the characteristics of the Shroud image is a collapsing cloth:\"In the remainder of this paper, I would like to develop the thesis that the second interpretation is correct; specifically, that in the case of the Shroud image, the cloth did collapse into and through the underlying body structure.\" (Jackson, Ibid, p.9).The paper will be online on Shroud.com's Shroud Spectrum International web page, either in September or December.But a later version of it, presented by Jackson, coincidentally at a Shroud Symposium at  St. Louis in 1991, is already online in my post, \"John P. Jackson, `An Unconventional Hypothesis to Explain all Image Characteristics Found on the Shroud Image' (1991)\".Stephen E. Jones\n\n","author":"Stephen E Jones","date":"September 1, 2014 at 6:16 AM","url":"http://theshroudofturin.blogspot.com/2014/08/crispino-dorothy-1916-2014-turin-shroud.html","site":"moore"},{"title":"\nCrispino, Dorothy (1916-2014): Turin Shroud Encyclopedia\n","post":"\n\n\"\"Let's hope he is corrected in the Q&A session after his presentation by someone at the Conference. In days past, when pro-authenticists Ian Wilson and Mark Guscin edited the BSTS Newsletter, any such corrections would have been reported in it.But now the anti-authenticist Hugh Farey, who believes that the Shroud was a 14th century accident, any such correction probably won't be reported in the BSTN.\"\"Now I truly understand the urgency of why you objected to Hugh Farey being made editor of the BSTS more then ever.I am wondering who voted him in and what process they used to do this?I would be shocked if anyone didn't correct him In the Q & A because there is simply a mountain of evidence to do this with, but my point is couldn't this presentation have been replaced with something a little more plausible and interesting. It feels like this guy is taking us back to the 1970's for heaven's sake.\"\"While he is not a scientist, I came across an online paper by Dan Porter where he admits that he regards (or at least did in 2001), \"the Resurrection\" as \"a metaphor\":\"\"This is amazing, which explains why he gives so much leeway to atheists and skeptics like Collin berry and is harder on pro authenticists and believers like you and a few others. I wonder why Dan just doesn't save us all the trouble and put this information in bold letters on his site if he was honest enough to warn newbies who are about to enter the proverbial dragons lair.\"\"Why \"thank the good lord above\"? Presumably there are going to be other papers at the St. Louis Shroud Conference 2014 which take account of ALL the available evidence, than Joseph Acetta's, which simply IGNORES that evidence?\"\"You make a very reasonable Point Stephen,  there are actually going to be a lot of good presentations. I hope I can get an opportunity to somehow make it but it looks slim right now as I am battling some kind of health issues, I wont know more until the labwork is all done. Ive been having all over the body itching for the last 8 months and some hip and finger discomfort. It could be from the stress of my dad passing, don't know for sure.I hope everything is better with your wife Stephen. I have her and you in my daily prayers.God blessBippy123\n\n","author":"bippy123","date":"September 2, 2014 at 2:55 AM","url":"http://theshroudofturin.blogspot.com/2014/08/crispino-dorothy-1916-2014-turin-shroud.html","site":"moore"},{"title":"\nCrispino, Dorothy (1916-2014): Turin Shroud Encyclopedia\n","post":"\n\nBippy123 >>...But now the anti-authenticist Hugh Farey, who believes that the Shroud was a 14th century accident, any such correction probably won't be reported in the BSTN.>Now I truly understand the urgency of why you objected to Hugh Farey being made editor of the BSTS more then ever.I expect there will be an article by Joe Nickell in the BSTN, arguing for a 14th century production of the Shroud (albeit not by an \"accident\" - even Nickell is not as extreme as Farey in that) in the interests of `being fair to both sides'. >I am wondering who voted him in and what process they used to do this?Presumably no one else wanted to do it, and the BSTS governing board or committee (if they even have one) thought that any Editor is better than none. But an ANTI-AUTHENTICIST Editor is WORSE that none, for the Newsletter of the British Society FOR the Turin Shroud! >I would be shocked if anyone didn't correct him In the Q & A because there is simply a mountain of evidence to do this with, but my point is couldn't this presentation have been replaced with something a little more plausible and interesting. It feels like this guy is taking us back to the 1970's for heaven's sake.Agreed. The St Louis Shroud Conference Committee (assuming it has one) should vet proposed papers, and if they fly in the face of the known evidence, i.e. the Shroud image is NOT a printing (the image not being comprised of any paint, pigment, dye or ink), and there is OVERWHELMING evidence that the Shroud existed well before the 14th century, and indeed all the way back to the 1st century.That is not suppressing dissent. Science conferences don't allow theories to be presented that fly in the face of the vast majority of the known scientific evidence. As this Joseph Acetta's proposed paper does.The danger is that Shroud skeptics will refer to the Acetta's paper at a Shroud conference as evidence that the Shroud is 14th century. >>While he is not a scientist, I came across an online paper by Dan Porter where he admits that he regards (or at least did in 2001), \"the Resurrection\" as \"a metaphor\":>This is amazing, which explains why he gives so much leeway to atheists and sceptics like Collin berry and is harder on pro authenticists and believers like you and a few others. Yes. In the final analysis Porter and Berry are all on the same non-Christian, anti-authenticity, side and Bible-believing, Shroud pro-authenticists, like me are on the opposite side from them. [continued]\n\n","author":"Stephen E Jones","date":"September 2, 2014 at 9:27 PM","url":"http://theshroudofturin.blogspot.com/2014/08/crispino-dorothy-1916-2014-turin-shroud.html","site":"moore"},{"title":"\nCrispino, Dorothy (1916-2014): Turin Shroud Encyclopedia\n","post":"\n\n[continued]>I wonder why Dan just doesn't save us all the trouble and put this information in bold letters on his site if he was honest enough to warn newbies who are about to enter the proverbial dragons lair.Probably because if Dan announced that he doesn't believe in Jesus' BODILY resurrection and also that he doesn't believe the Shroud is authentic, he would lose a lot of readers, and Dan LOVES to brag about how many readers his blog has.>>Why \"thank the good lord above\"? Presumably there are going to be other papers at the St. Louis Shroud Conference 2014 which take account of ALL the available evidence, than Joseph Acetta's, which simply IGNORES that evidence?>You make a very reasonable Point Stephen, there are actually going to be a lot of good presentations. I hope I can get an opportunity to somehow make it but it looks slim right now as I am battling some kind of health issues, I wont know more until the labwork is all done. Ive been having all over the body itching for the last 8 months and some hip and finger discomfort. It could be from the stress of my dad passing, don't know for sure.OK. I will pray for you.>I hope everything is better with your wife Stephen. I have her and you in my daily prayers.Thanks. She had the `flu recently and it stopped her taking her first steps, until I had helped her start walking. Any raising of her temperature exacerbates her MS, which is the nerves having damaged myelin `insulation' which weakens the nerves' signals to the muscles. So me going to see the Shroud in 2015 is looking less likely than it seemed a couple of months ago. But we will make a final decision in October when the online booking system starts.The One whose image is on the Shroud knows the problem and if He wants me to see the Shroud in 2015, he will clear away all obstacles.Stephen E. Jones\n\n","author":"Stephen E Jones","date":"September 2, 2014 at 9:32 PM","url":"http://theshroudofturin.blogspot.com/2014/08/crispino-dorothy-1916-2014-turin-shroud.html","site":"moore"},{"title":"\nCrispino, Dorothy (1916-2014): Turin Shroud Encyclopedia\n","post":"\n\n\"\"Thanks. She had the `flu recently and it stopped her taking her first steps, until I had helped her start walking. Any raising of her temperature exacerbates her MS, which is the nerves having damaged myelin `insulation' which weakens the nerves' signals to the muscles.\"\"Aww , I pray that she is over the flu. Im praying so hard for the both of you. If I ever get married I hope my marriage is as strong as your Stephen. The way you care for each other is very Christ-like :)I Just came back from my doctors appointment and she wants to test me for Cancer and other things . Hopefully all will turn out fine.Stephen, Thank God for this Blog and for you as you are relentless in your pursuit of truth and not double sided like a few we will not name.God bless you my friendBippy123\n\n","author":"bippy123","date":"September 4, 2014 at 12:31 PM","url":"http://theshroudofturin.blogspot.com/2014/08/crispino-dorothy-1916-2014-turin-shroud.html","site":"moore"},{"title":"\nCrispino, Dorothy (1916-2014): Turin Shroud Encyclopedia\n","post":"\n\nbippy123>>Thanks. She had the `flu recently and it stopped her taking her first steps, until I had helped her start walking. Any raising of her temperature exacerbates her MS ...>Aww , I pray that she is over the flu. Im praying so hard for the both of you. If I ever get married I hope my marriage is as strong as your Stephen. The way you care for each other is very Christ-like :)Thanks but I signed up for, \"... in sickness and in health, to death us do part.\" >I Just came back from my doctors appointment and she wants to test me for Cancer and other things . Hopefully all will turn out fine.They have to test for everything, just in case. Try not to worry.>Stephen, Thank God for this Blog and for you as you are relentless in your pursuit of truthI am glad that I can help you and a few other `Shroudies'. >and not double sided like a few we will not name.I feel sorry for the Dan, the fence-sitter. I Googled on \"Stephen Jones Shroud\" for the past week to see if anyone was talking about my blog and I found this first few lines by Dan:\"In another blog Stephen Jones accuses me of being anti-authenticity. Take your pick. Would I rather know the truth about the shroud no matter what it is?\"Dan is deceiving himself. How LONG has he been studying the Shroud, and yet he STILL doesn't \"know the truth about\" it?! Clearly the problem is not the evidence but Dan's UNBELIEF in the bodily Resurrection of Christ, which Dan wrongly thinks is just a \"metaphor.\"Dan doesn't realise that STARTING from a position of unbelief, he will NEVER receive the inner assurance which comes from the Holy Spirit about the Resurrection of Christ, which then flows on to Dan's being against the authenticity of the Shroud.A few rare non-Christians, like Thomas de Wesselow, manage by mental gymnastics to believe in the authenticity of the Shroud, while rejecting the Resurrection of the Man on the Shroud. But they are the rare exceptions to the general rule that if you reject the Resurrection of Jesus, then to be consistent, you will also reject the authenticity of the Shroud. Dan evidently hoped that the Shroud would give him enough evidence to overcome his unbelief. But it doesn't work that way: \"A man convinced against his will, is of the same opinion still.\"And the problem is Dan's WILL. That is, the bottom line for Dan (and not only him but others like him) is that he doesn't WANT to believe in the Resurrection of Jesus and the authenticity of the Shroud.[continued]\n\n","author":"Stephen E Jones","date":"September 4, 2014 at 2:37 PM","url":"http://theshroudofturin.blogspot.com/2014/08/crispino-dorothy-1916-2014-turin-shroud.html","site":"moore"},{"title":"\nCrispino, Dorothy (1916-2014): Turin Shroud Encyclopedia\n","post":"\n\nThere is no such thing as neutrality towards Jesus. Jesus Himself said in Mt 12:30 & Lk 11:23 :\"Whoever is not with me is against me, and whoever does not gather with me scatters.\"So Dan by persisting in his wilful unbelief in the Resurrection of Jesus is AGAINST Jesus and so SCATTERS, that is, works against Jesus. That's why Dan works against me. Jesus' unconditional first demand is that non-Christians (including Dan) REPENT (Gk. metanoia = \"change your mind\" - an act of the will) and BELIEVE the good news:  Mk 1:14-15. 14 Now after John was arrested, Jesus came into Galilee, proclaiming the gospel of God, 15 and saying, “The time is fulfilled, and the kingdom of God is at hand; repent and believe in the gospel [Gk. evangelion = good news].”As all true Christians know, you must believe FIRST and then the Holy Spirit will help you to SEE what previously you were BLIND to. That's what the slave-trader John Newton testified to:Amazing Grace, how sweet the sound,That saved a wretch like me.I once was lost but now am found,Was blind, but now I see.But if Dan continues to sit on the fence, regarding the Resurrection of Christ, and the authenticity of the Shroud, then James 1:6-8 states that as a \"double-minded man\" \"he will [not] receive anything from the Lord\":\"6 But let him ask in faith, with no doubting, for the one who doubts is like a wave of the sea that is driven and tossed by the wind. 7 For that person must not suppose that he will receive anything from the Lord; 8 he is a double-minded man, unstable in all his ways.\"And the eyes to see and the inner assurance that Jesus has indeed been raised bodily from the dead, are \"receive[d] ... from the Lord.\" They are not solely intellectual. >God bless you my friendThanks. Let's hope Dan reads this and that he is blessed by God after first repenting (changing his mind) of his attitude of unbelief.I am writing all this out of LOVE for Dan, in the hope he reads it and acts on it. Otherwise I would write nothing and let Dan receive the inevitable consequences of his unbelief.Stephen E. Jones\n\n","author":"Stephen E Jones","date":"September 4, 2014 at 2:39 PM","url":"http://theshroudofturin.blogspot.com/2014/08/crispino-dorothy-1916-2014-turin-shroud.html","site":"moore"},{"title":"\nCrispino, Dorothy (1916-2014): Turin Shroud Encyclopedia\n","post":"\n\n>So Dan by persisting in his wilful unbelief in the Resurrection of Jesus is AGAINST Jesus and so SCATTERS, that is, works against Jesus. That's why Dan works against me. I should have added \"...against me, a Bible-believing follower of Jesus who does believe in His bodily resurrection.\"I did find it hard to believe in Jesus' bodily resurrection, in 1967 (~47 years ago) when I became a Christian, but the Bible clearly taught it, so it was either return to my previous atheism, or be a consistent Christian and accept on faith that Jesus was bodily raised from the dead.And I can testify to Dan (and any others in his position: NOMINALLY but not ACTUALLY Christian-\"having the appearance of godliness, but denying its power\" 2Tim 3:5) that if you accept on faith what the Bible clearly teaches, including the resurrection of Jesus, the Holy Spirit DOES give you spiritual wisdom and an inner assurance that the resurrection of Jesus is true and so is the authenticity of the Shroud.Stephen Jones\n\n","author":"Stephen E Jones","date":"September 4, 2014 at 7:45 PM","url":"http://theshroudofturin.blogspot.com/2014/08/crispino-dorothy-1916-2014-turin-shroud.html","site":"moore"}]
