[{"title":"\nNew experiments on Shroud show it's not medieval\n","post":"\n\nHey Stephen thanks for the link and article my friend.I had a hunch that there was a reason for this TV showing of the shroud but I had no idea it would potentially be this big.I wonder how the skeptics are going to spin their way out if this. It's great also that its being submitted for peer review.The news just keeps better and better for us and worse for shroud skeptics. :)\n\n","author":"Bippy123","date":"March 29, 2013 at 10:38 AM","url":"http://theshroudofturin.blogspot.com/2013/03/new-experiments-on-shroud-show-its-not.html","site":"moore"},{"title":"\nNew experiments on Shroud show it's not medieval\n","post":"\n\nBippy123 >Hey Stephen thanks for the link and article my friend.Thanks. But it was commenter The Deuce who deserves the thanks for alerting me to it.>I had a hunch that there was a reason for this TV showing of the shroud but I had no idea it would potentially be this big.I'm not sure that Fanti's book and Pope Benedict XVI's last act to have a TV exhibition of the Shroud are connected.But the latter has added significance because as Cardinal Ratzinger he was Chairman of the Pontifical Academy of Sciences during the era of the 1988 radiocarbon dating of the Shroud, and so he would be VERY well informed about the authenticity of the Shroud and the flaws in the radiocarbon dating process that came up with the \"1260-1390 ... medieval\" date. >I wonder how the skeptics are going to spin their way out if this. Probably just ignore it. It's funny that Colin Berry is trying to get the Royal Society to investigate the Shroud when all that the atheist/agnostics who dominate such peak scientific bodies want to do is ignore it, because it threatens their core naturalistic philosophy.>It's great also that its being submitted for peer review.Agreed. But since the time of STURP (1978) most Shroud pro-authenticity scientific studies have been submitted to peer-reviewed scientific journals.Unlike Shroud anti-authenticity scientific studies which have rarely (if ever) been submitted to peer-reviewed scientific journals.The 1988 radiocarbon dating of the Shroud study which appeared in NATURE Vol. 337, 16th February, 1989, pp.611-615 was probably not peer-reviewed. If it had been it would have been rejected, so variable were the three C-14 laboratories' dates and so fallacious the paper's reasoning! >The news just keeps better and better for us and worse for shroud skeptics. :) Indeed! Truth has a habit of getting better and untruth a habit of getting worse.Stephen E. Jones-----------------------------------Comments are moderated. Those I consider off-topic, offensive or sub-standard will not appear. I reserve the right to respond to any comment as a separate blog post.\n\n","author":"Stephen E Jones","date":"March 29, 2013 at 12:26 PM","url":"http://theshroudofturin.blogspot.com/2013/03/new-experiments-on-shroud-show-its-not.html","site":"moore"},{"title":"\nNew experiments on Shroud show it's not medieval\n","post":"\n\nThis really is fantastic news. With this, the single solitary piece of evidence against the Shroud's authenticity, the one thing the skeptics had to cling to, has been shattered. And just in time for Easter!I doubt many skeptics will be persuaded by this, or any possible evidence no matter how strong. If they won't believe Moses and the Prophets, after all, they will not believe even if one is raised from the dead.However, I expect we're going to see a lot of even loopier theories about the Shroud from them, as these findings paint them into an even smaller and more untenable corner than they were already in. In particular, I think we're going to see a lot more Wesselow-style \"real but fake\" nonsense, where the skeptic admits the Shroud was the real burial cloth of Jesus, but tries to explain away the image as somehow an accident rather than a miracle.\n\n","author":"The Deuce","date":"April 1, 2013 at 11:06 PM","url":"http://theshroudofturin.blogspot.com/2013/03/new-experiments-on-shroud-show-its-not.html","site":"moore"},{"title":"\nNew experiments on Shroud show it's not medieval\n","post":"\n\nThe Deuce >This really is fantastic news.Agreed. But it's not surprising. Since the Shroud IS authentic, it is always possible that some new evidence is found which further supports the Shroud being 1st century and futher undermines the 1260-1390 C-14 dating.   >With this, the single solitary piece of evidence against the Shroud's authenticity, the one thing the skeptics had to cling to, has been shattered. Not \"shattered\" but now there are FOUR different age tests (counting Ray Rogers' vanillin test) which contradict the ONE C-14 age test.Not to mention all the other evidence that the Shroud is authentic.>And just in time for Easter!That's actually a problem because the sceptics (see my latest post) like Joe Nickell are claiming it's just a money-making stunt by Fanti. But as I pointed out, it is the PUBLISHER of a book who decides when it is published, not the AUTHOR.Besides, truth is not determined by when it is published.But the sceptics are drowning and need to cling to whatever straw they can find! >I doubt many skeptics will be persuaded by this, or any possible evidence no matter how strong. The really commmitted ones like Joe Nickell won't be, but there may be some less committed anti-authenticists who switch sides.>If they won't believe Moses and the Prophets, after all, they will not believe even if one is raised from the dead.As the One whose image is on the Shroud pointed out (Luke 16:31). >However, I expect we're going to see a lot of even loopier theories about the Shroud from them, as these findings paint them into an even smaller and more untenable corner than they were already in. Agreed. I think I have mentioned before there is one anti-authenticity theory the sceptics could always retreat to, that of historian Robert Drews, that the Shroud was created very early, in the second or third cenury (from memory) by a now unknown process. >In particular, I think we're going to see a lot more Wesselow-style \"real but fake\" nonsense, where the skeptic admits the Shroud was the real burial cloth of Jesus, but tries to explain away the image as somehow an accident rather than a miracle.Agreed. Even some Christians champion a naturalistic image formation process on the Shroud.So pervasive is the influence of Naturalistic philosophy, even on Christians, in our post-Christian age.Stephen E. Jones\n\n","author":"Stephen E Jones","date":"April 2, 2013 at 12:53 AM","url":"http://theshroudofturin.blogspot.com/2013/03/new-experiments-on-shroud-show-its-not.html","site":"moore"}]
