[{"title":"\nNon-traditional #13: The man on the Shroud: The evidence is overwhelming that the Turin Shroud is authentic! \n","post":"\n\n\"A completely naked depiction of Jesus would have been sacrilegious and blasphemous to the medieval mind\"But why was the shroud then exposed in public without any fuss ?\n\n","author":"Anonymous","date":"April 23, 2016 at 3:02 PM","url":"http://theshroudofturin.blogspot.com/2016/04/non-traditional-13-man-on-shroud.html","site":"moore"},{"title":"\nNon-traditional #13: The man on the Shroud: The evidence is overwhelming that the Turin Shroud is authentic! \n","post":"\n\nAnonymous>>\"A completely naked depiction of Jesus would have been sacrilegious and blasphemous to the medieval mind\">But why was the shroud then exposed in public without any fuss ?You did not quote the context of my above sentence, which was:\"A completely naked depiction of Jesus would have been sacrilegious and blasphemous to the medieval mind[57], and the usual punishment for blasphemy in medieval Europe was death by burning at the stake[58]. So no medieval European forger would have dared to depict Christ naked[59] realistically, as the man on the Shroud is[60] . Therefore the complete nudity of the image on the Shroud is a further proof of its authenticity[61]!\"Note: \"So no medieval European forger would have dared to depict Christ naked.\"But because the Shroud was believed and claimed by its medieval owners who exhibited it, to be NOT the work of an artist/forger, but the imprint of Jesus' body on His burial shroud, it was NOT \"sacrilegious and blasphemous to the medieval mind.\" Only IF the Shroud was the work of an artist/forger would the Shroud man's total nudity be \"sacrilegious and blasphemous to the medieval mind.\" Which is further evidence against the 1389 claim of the Bishop of Troyes, Pierre d'Arcis (†1377-1395) that the image on the Shroud had been \"cunningly painted\" and one of his predecessors, Bishop Henry de Poitiers (†1354-1370), had \"discovered ... the artist who had painted it.\" (Wilson, I., 1979, \"The Shroud of Turin,\" pp.266-267).If the artist who had painted the Shroud's image of a completely naked Jesus, showing His buttocks, and scourge marks around His genitals, had been discovered by Bishop de Poitiers, the forger would have been arrested, charged, tried, found guilty of blasphemy, and burned at the stake. There then would have been a record of his arrest, trial and execution, and the forger name would have been cited by Bishop d'Arcis, who was a lawyer. That d'Arcis cited no name of the forger, or details of his trial and execution, shows there never was a forger, and d'Arcis was at best misinformed, and at worst lying.Stephen E. Jones----------------------------------MY POLICIES Comments are moderated. Those I consider off-topic, offensive or sub-standard will not appear. Except that comments under my latest post can be on any Shroud-related topic without being off-topic. I normally allow only one comment per individual under each one of my posts.\n\n","author":"Stephen E. Jones","date":"April 23, 2016 at 4:09 PM","url":"http://theshroudofturin.blogspot.com/2016/04/non-traditional-13-man-on-shroud.html","site":"moore"},{"title":"\nNon-traditional #13: The man on the Shroud: The evidence is overwhelming that the Turin Shroud is authentic! \n","post":"\n\nBut because the Shroud was believed and claimed by its medieval owners who exhibited it, to be NOT the work of an artist/forger, but the imprint of Jesus' body on His burial shroud, it was NOT \"sacrilegious and blasphemous to the medieval mind.\" No danger for the artist/forger then.\n\n","author":"Anonymous","date":"April 23, 2016 at 4:30 PM","url":"http://theshroudofturin.blogspot.com/2016/04/non-traditional-13-man-on-shroud.html","site":"moore"},{"title":"\nNon-traditional #13: The man on the Shroud: The evidence is overwhelming that the Turin Shroud is authentic! \n","post":"\n\nAnonymous>>But because the Shroud was believed and claimed by its medieval owners who exhibited it, to be NOT the work of an artist/forger, but the imprint of Jesus' body on His burial shroud, it was NOT \"sacrilegious and blasphemous to the medieval mind.\">No danger for the artist/forger thenI nearly deleted your comment as \"sub-standard\" because you are being OBTUSE.There WAS NO \"artist/forger.\" Only if there HAD BEEN an \"artist/forger,\" would the image on the Shroud have been \"sacrilegious and blasphemous to the medieval mind.\"That many thousands, if not millions, of medieval Christians, who would have been deeply offended by the Shroud image's total nudity if they thought it was the work of an artist/forger, made pilgrimages to view the Shroud when it was publicly exhibited, is evidence that they believed the claims of those exhibiting the Shroud that it was NOT the work of an artist/forger, but the imprint of Jesus' body on His burial shroud.Even otherwise credulous medievals would have known that you can only charge HUMANS with blasphemy, not GOD.You have had your \"normally ... only one comment per individual under each one of my posts\" under this post..Stephen E. Jones----------------------------------\"By way of guidance as to what I mean by `offensive' and `sub-standard,' I regard comments to my blog as analogous to letters to the Editor of a newspaper. If the Editor of a newspaper would not publish a comment because it is `offensive' and/or `sub-standard' then neither will I. It does not mean that if I disagree with a comment I won't publish it. I have published anti-authenticist comments and other comments that I disagreed with, and I have deleted `offensive' and/or `sub-standard' comments that are pro-authenticist. `Sub-standard' includes attempting to use my blog as a platform to publish a block of text of the commenter's own views, and also bare links to other sites with little or no actual comments. By `off-topic' I mean if a comment has little or nothing to do with the topic(s) in the post it is under (except for the latest post-see above).\" [05Jan16]\n\n","author":"Stephen E. Jones","date":"April 23, 2016 at 5:00 PM","url":"http://theshroudofturin.blogspot.com/2016/04/non-traditional-13-man-on-shroud.html","site":"moore"}]
