[{"title":"\nRe: John Calvin on the Shroud #2\n","post":"\n\nHello Mr. Stephen,       I found your site via the Jesus is Jehovah side, along with my wife, and have followed your threads with great interest. Thank you for the hard work that you put into the research and responses of your blog. I once was rather neutral on the Shroud, but have become increasingly convinced of its authenticity upon reading and reflecting upon your proofs. I hope that as time progresses these proofs shall become even more solid even as the hearts of the world become harder for the Spirit to penetrate. As a side note, I have also found your 2037 interpretation to be quite an interesting conclusion, and am continuing to reflect and read up on your line of reasoning. Whether before or after then, my wife and I look forward to meeting you and worshiping our Lord together with you. May our risen Lord and God bless you and keep you until the day of your calling or his return.Your brother in ChristCraig\n\n","author":"Moa","date":"January 12, 2011 at 9:03 AM","url":"http://theshroudofturin.blogspot.com/2011/01/re-john-calvin-on-shroud-2.html","site":"moore"},{"title":"\nRe: John Calvin on the Shroud #2\n","post":"\n\nCraig>I found your site via the Jesus is Jehovah side, along with my wife, and have followed your threads with great interest. Thank you for the hard work that you put into the research and responses of your blog. Thanks for your feedback. I hope the positive aspect of my Jesus is Jehovah! blog (i.e. not only negative against Jehovah's Witness teaching that Jesus is Michael the archangel) is of broader interest to my fellow Christians.>I once was rather neutral on the Shroud, but have become increasingly convinced of its authenticity upon reading and reflecting upon your proofs. I hope that as time progresses these proofs shall become even more solid even as the hearts of the world become harder for the Spirit to penetrate. With the discovery of the Pray Manuscript (1192-1195) with its unique features of the Shroud, predating the earliest possible 1988 radiocarbon dating of 1260-1390 by at least 65 years; and the perfect match of the Sudarium of Oviedo with the face of the Man on the Shroud; the proof that the Shroud of Turin is the burial sheet of Jesus (and the Sudarium of Oviedo is the headcloth in Jn 20:5-7); already is solid enough. But there are still more proofs accumulating for the Shroud's authenticity, e.g. as briefly mentioned in my post above, Markwardt's evidence in his paper, \"Ancient Edessa and the Shroud: History Concealed by the Discipline of the Secret\" that the Shroud was known in the second century AD, but was concealed by allegorical language. >As a side note, I have also found your 2037 interpretation to be quite an interesting conclusion, and am continuing to reflect and read up on your line of reasoning. Thanks. For the benefit of other readers you are presumably referring to: \"My interpretation of Lk. 21:24-28 ... that Jesus will return before the bulk of that generation that lived in 1967 passes away, i.e. before 2037. See also my posts `Re: about your prediction of Jesus' return by 2037' and `Re: what would happen if I lived to 2037 and Jesus has not come?'\" (\"What I believe about Creation, Evolution, Design and Christianity: Jesus Christ's return (second coming)\").>Whether before or after then, my wife and I look forward to meeting you and worshiping our Lord together with you. May our risen Lord and God bless you and keep you until the day of your calling or his return.>>Your brother in ChristCraig Amen! As for me it is a purify hope (1Jn 3:3) that I may be among the \"we who are still alive, who are left until the coming of the Lord\"(1Th 4:15)! Stephen E. Jones\n\n","author":"Stephen E Jones","date":"January 12, 2011 at 12:16 PM","url":"http://theshroudofturin.blogspot.com/2011/01/re-john-calvin-on-shroud-2.html","site":"moore"},{"title":"\nRe: John Calvin on the Shroud #2\n","post":"\n\nAnonymousI have deleted your comment about \"Archeologist Shimon Gibson\" because it is off-topic under this post, which has nothing about Gibson. I have also deleted your identical copy of that comment under \"Shroud of Turin News - September 2008\" because it is off-topic there too. And also because I regard it as \"substandard\" to make identical copies of the same comment under different posts. If you wish, you can re-do your comment under \"Burial shroud proves Turin Shroud not from 1st century C.E. Jerusalem?\" which is about archaeologist Shimon Gibson.Stephen E. Jones\n\n","author":"Stephen E Jones","date":"February 4, 2011 at 5:31 PM","url":"http://theshroudofturin.blogspot.com/2011/01/re-john-calvin-on-shroud-2.html","site":"moore"},{"title":"\nRe: John Calvin on the Shroud #2\n","post":"\n\nI just deleted a comment as off-topic because it only briefly mentioned the topic of the above post, \"John Calvin on the Shroud,\" and then went off at a tangent with little or no relationship to that topic.As I have stated before, MY blog's comments are primarily for commenting on MY posts. They are not a launching pad for individuals to promote THEIR own views unrelated to my post their comment is under.I am starting new `taglines' which help explain what I mean by \"offensive,\" \"substandard\" and \"off-topic\" comments. Below is the start of my`tagline' on \"off-topic\" comments.Stephen E. Jones----------------------------------MY POLICIES. Comments deleted as \"off-topic\" include those which contain only a brief mention of the topic of my post it is under, but then go off at a tangent with little or no relationship to that topic.\n\n","author":"Stephen E. Jones","date":"November 13, 2017 at 9:36 AM","url":"http://theshroudofturin.blogspot.com/2011/01/re-john-calvin-on-shroud-2.html","site":"moore"}]
