[{"title":"\nDanusha Goska's Shroud of Turin Talk, at the Catholic Campus Ministry Center, WPUNJ, Wayne / Haledon New Jersey, Wednesday, April 30th, Six PM.\n","post":"\n\n\"If the technology to create the Shroud was available in medieval Europe, where are other products of this technology?\" For me, *this* gets to the heart of the matter. Excellent essay.\n\n","author":"Anonymous","date":"April 14, 2014 at 2:19 AM","url":"http://theshroudofturin.blogspot.com/2014/04/here-is-flyer-to-danusha-goska-s-author.html","site":"moore"},{"title":"\nDanusha Goska's Shroud of Turin Talk, at the Catholic Campus Ministry Center, WPUNJ, Wayne / Haledon New Jersey, Wednesday, April 30th, Six PM.\n","post":"\n\nSinging Bear>\"If the technology to create the Shroud was available in medieval Europe, where are other products of this technology?\" This is Danusha Goska's unanswered and unanswerable question to Shroud anti-authenticists in her excellent, must read, essay, \"The Shroud of Turin???\".>For me, *this* gets to the heart of the matter. Yes, she continued: \"Given the lucrative nature of the forgery market, why didn't the forger create a similar Shroud of Mary, Shroud of St. Peter, Shroud of St. Paul, etc.? And why didn't followers do the same?\" >Excellent essay.It is indeed. I have now reposted it as, \"Danusha Goska's original essay, `The Shroud of Turin???'\" Stephen E. Jones---------------------------------Reader, if you like this my The Shroud of Turin  blog, and you have a website, could you please consider adding  a hyperlink to my blog on it? This would help increase its Google PageRank number and so enable those who are Google searching on \"the Shroud of Turin\" to more readily discover my blog. Thanks.\n\n","author":"Stephen E Jones","date":"April 14, 2014 at 7:52 AM","url":"http://theshroudofturin.blogspot.com/2014/04/here-is-flyer-to-danusha-goska-s-author.html","site":"moore"},{"title":"\nDanusha Goska's Shroud of Turin Talk, at the Catholic Campus Ministry Center, WPUNJ, Wayne / Haledon New Jersey, Wednesday, April 30th, Six PM.\n","post":"\n\nHyperlink added many moons ago. Have been directing people to you for some time. Keep up this wonderful and essential work. Thanks.\n\n","author":"Anonymous","date":"April 14, 2014 at 2:35 PM","url":"http://theshroudofturin.blogspot.com/2014/04/here-is-flyer-to-danusha-goska-s-author.html","site":"moore"},{"title":"\nDanusha Goska's Shroud of Turin Talk, at the Catholic Campus Ministry Center, WPUNJ, Wayne / Haledon New Jersey, Wednesday, April 30th, Six PM.\n","post":"\n\nSinging Bear>Hyperlink added many moons ago. Thanks. Much appreciated. >Have been directing people to you for some time. Again, thanks.>Keep up this wonderful and essential work. Thanks.I will, while I can.Stephen E. Jones\n\n","author":"Stephen E Jones","date":"April 14, 2014 at 4:14 PM","url":"http://theshroudofturin.blogspot.com/2014/04/here-is-flyer-to-danusha-goska-s-author.html","site":"moore"}]
