[{"title":"\nRe: The Shroud of Turin: Evidence that Jesus was crucified on a cross, not a stake\n","post":"\n\nStephen,I stop back here from time to time... I have you linked on my own blog. This was such a good collection of articles and thoughts.I love how this one takes a nice swing at the silly claim of the JW claim. One wonders what in the world they are thinking sometimes. Along with the Mormon claim, this is such a house of cards that any study, be it Theological, historical and in this case scientific will blow a mighty wind a knock the house over.Thank you for continuing to update us on what you find about the Shroud. I like you am thoroughly convinced of it's authenticity. What more does a person really want to convince them? My faith doesn't rest on it, but it certainly backs up my faith.Blessings to you in the name of Christ,-g-\n\n","author":"George Weis","date":"May 11, 2009 at 5:30 AM","url":"http://theshroudofturin.blogspot.com/2009/04/re-shroud-of-turin-evidence-that-jesus.html","site":"moore"},{"title":"\nRe: The Shroud of Turin: Evidence that Jesus was crucified on a cross, not a stake\n","post":"\n\nGeorge>I have you linked on my own blog. This was such a good collection of articles and thoughts.Thanks for your comment and for the link on your blog, Path of the Weis.>I love how this one takes a nice swing at the silly claim of the JW claim. One wonders what in the world they are thinking sometimes.They don't think for themselves. The Watchtower Society warns JWs to \"Avoid Independent Thinking\" (my emphasis bold):\"Avoid Independent Thinking From the very outset of his rebellion Satan called into question God's way of doing things. He promoted independent thinking. `You can decide for yourself what is good and bad,' Satan told Eve. `You don't have to listen to God. He is not really telling you the truth.' (Genesis 3:1-5) To this day, it has been Satan's subtle design to infect God's people with this type of thinking.-2 Timothy 3:1, 13. How is such independent thinking manifested? A common way is by questioning the counsel that is provided by God's visible organization. ....\" (\"Exposing the Devil's Subtle Designs,\" The Watchtower, January 15, 1983, pp.18-22, p.22)and even to \"Fight Against Independent Thinking\":\"Fight Against Independent Thinking As we study the Bible we learn that Jehovah has always guided his servants in an organized way. And just as in the first century there was only one true Christian organization, so today Jehovah is using only one organization. (Ephesians 4:4, 5; Matthew 24:45-47) Yet there are some who point out that the organization has had to make adjustments before, and so they argue: `This shows that we have to make up our own mind on what to believe.' This is independent thinking. Why is it so dangerous? Such thinking is an evidence of pride. ... If we get to thinking that we know better than the organization, we should ask ourselves: `Where did we learn Bible truth in the first place? Would we know the way of the truth if it had not been for guidance from the organization? Really, can we get along without the direction of God's organization?' No, we cannot! ... When we consider the mighty spirit forces who are fighting against us, we must acknowledge that on our own we could not possibly win. Yet with God's backing, and with the help and support of his organization-our worldwide association of brothers-we cannot lose. ...\" (\"Armed for the Fight Against Wicked Spirits,\" The Watchtower, January 15, 1983, pp.23-27, p.27)  which means unthinking and unquestioning obedience to the Watchtower organization, which is really the JW's god.>Along with the Mormon claim, this is such a house of cards that any study, be it Theological, historical and in this case scientific will blow a mighty wind a knock the house over.The problem is that for JWs and the Mormons their ultimate ground of belief is not in the Bible, nor in any objective evidence, but it is in their respective cultic organizations, the Watchtower Society and the LDS Church.But that is why a JW's faith might be shaken more by evidence that the Watchtower Society has been wrong for nearly 60 years in that Jesus really did die on a two-beamed cross and not a single upright stake, than by arguing about the meaning of Bible verses (which however does have its place).>Thank you for continuing to update us on what you find about the Shroud. I like you am thoroughly convinced of it's authenticity. What more does a person really want to convince them? My faith doesn't rest on it, but it certainly backs up my faith.Agreed. For us Christians, the Shroud is just another example of the truth of Ephesians 3:20 \"Now to him who is able to do immeasurably more than all we ask or imagine ...\"However, as the public become more and more aware that the 1988 radiocarbon-dating of the Shroud to the 14th century was wrong (if not fraudulent) and the now overwhelming evidence that the Shroud is the very burial sheet of Jesus, inscribed with a record of His horrific suffering and death on a cross for them and also with His resurrection, maybe millions who otherwise wouldn't will become Christians in one last mighty harvest, in these last years before Jesus returns (in my considered opinion before 2037).>Blessings to you in the name of Christ,Thanks. And to you.Stephen E. Jones\n\n","author":"Stephen E Jones","date":"May 11, 2009 at 9:11 AM","url":"http://theshroudofturin.blogspot.com/2009/04/re-shroud-of-turin-evidence-that-jesus.html","site":"moore"},{"title":"\nRe: The Shroud of Turin: Evidence that Jesus was crucified on a cross, not a stake\n","post":"\n\nBrother,I had the opportunity to enlighten someone the other day... and some new evidence you have provided on here helped me out quite a bit. funny thing was, this fellow was Catholic and didn't know about the shroud.I think it may have pushed His faith forward.I love this blog, I wish you had the time to crank more out... I love your commentary and reports.Blessings in Christ our risen Lord,-g-\n\n","author":"George Weis","date":"June 22, 2009 at 9:03 AM","url":"http://theshroudofturin.blogspot.com/2009/04/re-shroud-of-turin-evidence-that-jesus.html","site":"moore"},{"title":"\nRe: The Shroud of Turin: Evidence that Jesus was crucified on a cross, not a stake\n","post":"\n\nGeorge>I love this blog, I wish you had the time to crank more outThanks. I have a 3 week break from my Graduate Diploma of Education, from 4 - 26 July, so I will catch up with my blogging then.Stephen E. Jones\n\n","author":"Stephen E Jones","date":"June 22, 2009 at 5:22 PM","url":"http://theshroudofturin.blogspot.com/2009/04/re-shroud-of-turin-evidence-that-jesus.html","site":"moore"}]
