[{"title":"\nShroud News - August 2007\n","post":"\n\nI am not a scientist but I have eyes.  I wish they could explain the lack of distance between the front of the image and the back.  I placed a blanket on my head there was an 8-inch gap of where my face would have touched the front and where my head would have touched the back.  Looking at the PHOTOs there is less than 2 inches.  This is also depicted in most of the artwork that I've seen.  I do not doubt that there was one at some time in the past.  I would just like someone to explain the lack of distance between the face and the back.\n\n","author":"LaShawn Pulkoski","date":"October 3, 2007 at 8:34 AM","url":"http://theshroudofturin.blogspot.com/2007/09/shroud-news-august-2007.html","site":"moore"},{"title":"\nShroud News - August 2007\n","post":"\n\nLaShawn>I am not a scientist but I have eyes. I wish they could explain thelack of distance between the front of the image and the back. Thanks for your comment. I am away from my home while it is being painted and so I don't have access to my Shroud books. So this is an answer off the top of my head (no pun intended!).My first point is that claims of apparent gross anatomical blunders in the Shroud's image (and in this case there may not even be that-see below) argues more in favour of the Shroud's authenticity than the alternative forgery theory.That is because: 1) other anatomical features of the Shroud (e.g. the wounds, blood-flows, etc) exhibit an accuracy (if not a  perfection) that would require an an artistic genius of at least the level a Leonardo da Vinci. But then an artistic genius of at least that level would hardly commit gross anatomical blunders that even an average art student would not make.2) If there were such apparent major anomalies, that would be evidence that the Shroud's image was formed not by human or normal natural processes, but by some extraordinary or supernatural process, e.g. the image actually is a type of xray originating from within the body (see my CED blog post of 14 May 2007), where distances are less than at the surface, and not from its surface where distances are greater; and/or the image was formed as the linen collapsed downward as Jesus' body was resurrected through it, as proposed by physicist John P. Jackson. >I placeda blanket on my head there was an 8-inch gap of where my face wouldhave touched the front and where my head would have touched the back.According to this anti-authenticity article, an \"8-inch gap\" is is fact what exists between the Shroud's front and back head images: \"The front and back images of the head are separated by a gap of perhaps 20 cm (8 inches)\"!But as I said, I don't have my books with me, but when I get home I will refer to my large photos of the Shroud and measure the gap and report the result in a further comment.>Looking at the PHOTOs there is less than 2 inches. This is alsodepicted in most of the artwork that I've seen. See above.>I do not doubt thatthere was one at some time in the past. I would just like someone toexplain the lack of distance between the face and the back.Hope this has helped.Stephen E. Jones\n\n","author":"Stephen E. Jones","date":"November 27, 2007 at 8:40 PM","url":"http://theshroudofturin.blogspot.com/2007/09/shroud-news-august-2007.html","site":"moore"}]
