[{"title":"\nShroud News - January 2008\n","post":"\n\nIn my humble opinion, the Shroud of Turin is a hoax.  That's not to say it doesn't represent a great act of faith and in spite of itself hasn't become a religious relic anyway.  Still, the only questions left to science after much investigation is how the artwork on the shroud was actually painted.  Daubbed, brushed, whatever.  All this other stuff is just a point of argument and an excuse to publish another academic paper.  The real answer is very simple.Now, I believe the bible is just a master work of compiled collections of ancient writers.  But clearly the believers in the shroud are also believers in the bible as an accurate gospel of God and Jesus Christ, etc.  I have seen a few bible quotes in the debate about the shroud, but I rarely, if ever, see one in particular that I offer here.  How can the Shroud of Turin possibly be authentic when the bible reads thusly: John 20:3 Peter therefore went forth, and that other disciple, and came to the sepulchre. 4 So they ran both together: and the other disciple did outrun Peter, and came first to the sepulchre. 5 And he stooping down, and looking in, saw the linen clothes lying; yet went he not in. 6 Then cometh Simon Peter following him, and went into the sepulchre, and seeth the linen clothes lie, 7 And the napkin, that was about his head, not lying with the linen clothes, but wrapped together in a place by itself.The scripture clearly states that there were two pieces, with a separate piece around Jesus' head, and from what I understand common practive of the time.  That being the case, the image of Jesus' face would not be on the Turin shroud, or would at least appear differently from the rest of the fabric.  And the absense of folds, voids, and displacements in the image that would occur had the fabric been wrapped around a body further support the Shroud, not so much an intentional hoax, but a medieval work of art.\n\n","author":"BrandyKat","date":"June 14, 2008 at 11:49 PM","url":"http://theshroudofturin.blogspot.com/2008/03/shroud-news-january-2008.html","site":"moore"},{"title":"\nShroud News - January 2008\n","post":"\n\nBrandyKat>In my humble opinion, the Shroud of Turin is a hoax. ...Thanks for your comment. You raise too many points for me to respond in a comment, and anyway few would see it it here under my January 2008 Shroud News.So I will respond in a separate post in the near future to each of your points.Stephen E. Jones\n\n","author":"Bear in mind that Jesus was a 1st century Galilean. Is there any evidence that Galilean men had ponytails? According to Stevenson and Habermas they did: \"As a matter of fact, the traditional style for an orthodox Jewish man of two thousand years ago is much the same for him today: a ponytail of hair and sidelocks-precisely what we see on the Shroud.\" ((Stevenson, K.E. & Habermas, G.R., 1990, \"The Shroud and the Controversy,\" Thomas Nelson Publishers: Nashville TN, p.151)But since it is now clear that what was once thought to be a ponytail is NOT part of the image of the man on the Shroud, I don't care to argue it, one way or the other.[...]Stephen E. Jones----------------------------------MY POLICIES. Comments are moderated. Those I consider off-topic, offensive or sub-standard will not appear. Except that comments under my current post can be on any one Shroud-related topic without being off-topic. To avoid time-wasting debate I normally allow only one comment per individual under each one of my posts.\n\n","author":"Stephen E. Jones","date":"March 12, 2018 at 9:14 AM","url":"http://theshroudofturin.blogspot.com/2008/03/shroud-news-january-2008.html","site":"moore"}]
