[{"title":"Stephen Jones adds another part to his series","post":"Congratulations Steve on another, clear, clean presentation of irrefutable facts that are (1) indisputable scientifically and (2) totally irreconcilable with the Shroud as forgery. The old saying is the devil is in the details, but as somebody recently remarked, when it comes to the Shroud, God is in the details.\nThe activities of STURP were real science. It’s the pseudo-skeptics, that must deny them. They do so because in the very fine details of the Shroud are facts that are simply incompatible  with their world view.\nWe can have a real debate when the self-styled champions of “science” accept the scientifically established reality of the crucifixion of Jesus Christ. They can’t do not that because it would start them down (up) the slippery slope of having to deal with the resurrection.  Whether that slippery slope is down or up is a matter of perspective.\n\n","date":"March 23, 2013 at 7:45 am","url":"https://shroudstory.com/2013/03/23/stephen-jones-adds-another-part-to-his-series/","cat":"other_blogs","id":"comment-28158","author":"John Klotz","site":"shroudstory"},{"title":"Stephen Jones adds another part to his series","post":"We have frequently discussed the limestone “dirt” and the “poker holes” on this site. I note a comment in Stephen Jones’ posting that the limestone was only found under the right foot.  This is inexact. It was also found on a knee-cap and the nose, as if from a fall, prompting John Klotz to recount a story, being tripped up by his dog ‘Bogie’ with the result that John actually fell on his nose and his knee-cap, an unduly extreme form of dedicated corroboration.  ‘Gabriel’ has often mentioned that the published paper on the limestone lacked peer-review and attempts should be made to confirm the results.  It has also been suggested that the strontium impurity if quantitatively measured should prove an excellent indicator of geographical provenance.  The issue clearly needs revisiting. \nWe also discussed the poker holes in Dan’s posting of February 25, when Stephen first commenced his Part 2.6, which it seems draws heavily on some of Ian Wilson’s commentary, although it has seemed sensible for Stephen not to have accepted the incident reported by Arculf as their cause. There are a number of possible scenarios. One such is that at some early stage the Shroud may have been used as a folded altar cloth and damaged by grains of burning incense.  Certain ancient eucharistic rites mention that altar cloths are to be so viewed as being the sindon of the Lord.  Another possible scenario is that it may have been subjected to an unknown trial by fire, as I mentioned in a comment on the Feb 25 posting, arising from another comment by Wilson. \nWilson’s other source is an Arabic document found in Egypt referring to a trial of the “Image of Edessa”: “Hail Abgar, who was worthy to behold the image of the Lord made without ink on cloth, the image of the worker of miracles. It was not effaced or burnt when it was tested by fire and water before the great multitude.” This may well have been some otherwise unknown trial.  However in view of the reference to Abgar, there is a problem here identifying this implicit test as causing the poker holes which obviously happened when the Shroud was folded into four layers. (A) Four layers doesn’t fit with Wilson’s theory of tetradiplon. (B) If this test did cause the poker holes, it is an extremely rare reference to an occasion when the Shroud was folded in this way. The Arabic document does imply a practice of subjecting such objects to trials by ordeal, and perhaps this did happen to the Shroud cloth at some unknown time. Or perhaps we should just accept that the holes may have been caused by some mere mishap such as burning incense.\n\n","date":"March 23, 2013 at 8:08 am","url":"https://shroudstory.com/2013/03/23/stephen-jones-adds-another-part-to-his-series/","cat":"other_blogs","id":"comment-28159","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Stephen Jones adds another part to his series","post":"If the 4 series of holes (i.e. the so-called poker holes) would have been done during a trial by fire with a hot poker or something like that, each holes and each series of holes would present roughly the same diameter, which is not the case.\nAdler wrote something about the most probable nature of these holes and, in his mind, these were probably caused by some drops of a corrosive liquid or some drops of hot wax on the Shroud during a time when it was folded in 4 equal parts (possibly during a liturgical ceremony).  \nUsing Occam’s razor, this is surely the most rational and probable explanation for these particular holes and I don’t understand why some Shroud websites (like the useful website of Mario Latendresse for example) still perpetuate this non-sense hypothesis of Wilson (one among many!) by using this term “poker holes” to define the 4 series of holes on the Shroud. As my friend Barrie Schwortz told me one day, these holes should be simply called “L-shaped burn holes” and that’s all!\n\n","date":"March 23, 2013 at 8:24 pm","url":"https://shroudstory.com/2013/03/23/stephen-jones-adds-another-part-to-his-series/","cat":"other_blogs","id":"comment-28227","author":"Yannick Clément","site":"shroudstory"},{"title":"Stephen Jones adds another part to his series","post":"Aragonite. As usual there is more to this than meets the eye. According to the Villadas (A New Look at the Validity of the Carbon-14 Dating of the Shroud – shroud.com), Rogers passed on a single slide with a single speck of indeterminate composition to Kohlbeck, who identified it as aragonite and in turn passed it on to Levi-Setti, who analysed it as best he could. A single speck. I am not aware that anybody else has analysed any other speck.\nCaesar Barta (at holyshroudguild.org) takes up the story. He notes that Aragonite is widespread and very common, and therefore not a good proof that the shroud is associated with the Jerusalem sample, but he prints the mass spectrometer spectra.\nThese are not easy to read, and are somewhat deceptive, as the spectrum from the shroud overlays, and in many places obscures that of the Jerusalem sample, and the diagrams are blurred. What’s more, as Barta points out, the spectrum from the shroud includes that of underlying linen, as the speck could not be removed from it. Nevertheless, reading from left to right of Diagram 1: Positive Secondary Ions, there are some curious points to observe, which somebody may be able to explain.\n1) The spectrum begins with a huge Hydrogen spike for the Jerusalem sample (J), and no corresponding one for the Shroud (S) at all.\n2) Lithium has a small S spike but no J evidence.\n3) There is 10 times as much sodium in J as there is in S.\n4) Magnesium and Aluminium spikes appear to be similar, but S has silicon and J does not.\n5) The next named spike is Potassium, of which there is about the same.\n6) Then comes Calcium, with a huge J spike, 100 times bigger than the S spike.\n7) And then Cobalt, of which there is10 times as much in J as in S.\n8) The next collection is the CaO/Fe group, which again shows a huge discrepancy between the two spikes,\n9) And finally Gallium (?), of which there is a lot in S but very little in J.\nI will refrain from repeating my survey for Diagram 2, the Negative Secondary Ions, but I hope I have said enough to make people go back for another look. The two spectra look nothing like each other, and if we are to accept that in fact they show a similarity between the speck on the shroud and a sample of Jerusalem limestone, then could some expert please explain how?\n\n","date":"March 23, 2013 at 10:05 am","url":"https://shroudstory.com/2013/03/23/stephen-jones-adds-another-part-to-his-series/","cat":"other_blogs","id":"comment-28163","author":"Hugh Farey","site":"shroudstory"},{"title":"Stephen Jones adds another part to his series","post":"Hugh, I agree with you. I have been trying to explain the same idea in some comments I have been writing here during the last year.\nYour analysis of the Positive Secondary Ions plot seems basically correct and if we move to the Negative Secondary Ions things even look worse since the differences between the number of counts for most elements (but H) in the Jerusalem and Shroud sample shows values or roughly one order of magnitude (ten times more in the case of Jerusalem sample).\nHowever, the problem I find here is not these apparent discrepancies.\nPerhaps, if a true experienced expert in comparing limestones using spectra had a look at these ones, he would say that discrepancies are in the range of what can be reasonably been expected for two samples with the same origin. But I am not an expert on this field and simply I don’t know.\nWhat I am missing here is the interpretation and validation of these spectra by truly experiences eyes in the field of limestone comparation before publication. That’s what we call peer-review.\nIn the absence of this, the widely spred claims on the aragonite issue lack any validity since all the literature developed in the last years is based on these only two charts originally published in Biblical Archeology Review.\nPD.  It would be great if Dan could publish a post with these two graphs for open discussion (if  allowed by copyright protection laws)\n\n","date":"March 24, 2013 at 6:46 am","url":"https://shroudstory.com/2013/03/23/stephen-jones-adds-another-part-to-his-series/","cat":"other_blogs","id":"comment-28261","author":"Gabriel","site":"shroudstory"},{"title":"Stephen Jones adds another part to his series","post":"Thanks, Gabriel. I too know nothing about the mass spectra of limestone, and would be very pleased to know more. Gerard Lucotte’s controversial paper on particles from the face claims that rather little of the dirt is aragonite, so I have emailed him for clarification, although I note Yannick’s comments earlier that Lucotte (a professor at the “Institute of Molecular Anthropology” in Paris) is a clown from the lunatic fringe.\n\n","date":"March 24, 2013 at 9:50 am","url":"https://shroudstory.com/2013/03/23/stephen-jones-adds-another-part-to-his-series/","cat":"other_blogs","id":"comment-28270","author":"Hugh Farey","site":"shroudstory"}]
