[{"title":"\nDimensions of the Shroud: Turin Shroud Encyclopedia \n","post":"\n\nA few days ago \"Anonymous\" submitted a comment, quoting favourably something that Colin Berry had written.But Colin Berry, aka Sciencebod, is permanently banned from commenting on this blog (the only person who has been) because of his persistent breaching of my stated policies (see below), despite my repeated warnings, mostly for \"offensive\" comments.I assume the anonymous comment was by Berry himself, especially considering it had an offensive component, which Berry seems unable to restrain, and so is his `trademark'.However, in the unlikely event the comment was not by Colin Berry, but by someone posting Berry's words and arguments, then that is banned also, since clearly it would be a way of Berry circumventing his banishment from commenting on my blog.The comment by Berry, or on his behalf, was that blood chemist Alan Adler was wrong that bilirubin was responsible for the permanently red colour of Shroud blood, because of bilirubin's instability.But apart from Berry's misunderstanding of Adler's argument (due to Berry's evident ignorance of Shroud literature), Adler's explanation was more complex than that the red colour of Shroud blood is simply bilirubin:\"Furthermore, Alan Adler tumbled upon one very important explanation for why, as has been agreed by everyone, the `blood' looks too red. A particular oddity that he discovered of the Shroud `blood's' bile pigments was that these seemed to contain what he called `an extraordinarily high' level of the pigment bilirubin, giving rise to the question why this should be so. As he explained: `... a torture, scourging and crucifixion leading to shock - that would produce a tremendous hemolysis [break-up of red blood corpuscles-IW]. In less than 30 seconds the haemolyzed haemoglobin will run through the liver, building up a very high bilirubin. If that blood then clots the exudate forms, and all the intact cells with haemoglobin stay behind, only the haemolyzed goes out along with the serum albumin which bind the bilirubin. So what one ends up with on the cloth is an exudate which has an enhanced bilirubin index with respect to the haemolyzed haemoglobin. You now mix bilirubin which is yellow-orange with methaemoglobin in its para-hemic form, which is an orangey-brown, and you get blood which has a red colour.'\" (Wilson, I., 1998\"The Blood and the Shroud,\" p.89). Note that Adler's tests did find  \"an extraordinarily high\" level of bilirubin in Shroud blood. [continued]\n\n","author":"Stephen E Jones","date":"February 10, 2015 at 9:52 PM","url":"http://theshroudofturin.blogspot.com/2015/02/dimensions-of-shroud-turin-shroud_4.html","site":"moore"},{"title":"\nDimensions of the Shroud: Turin Shroud Encyclopedia \n","post":"\n\n[continued]See also Adler's paper \"Chemical and Physical Characteristics of the Blood Stains,\" on page 135 of his \"The Orphaned Manuscript,\" which I will eventually scan and it will be placed online (probably early to mid this year) by Barrie Schwortz, in his Shroud Spectrum International archive.There is another explanations of the permanent reddish colour of Shroud blood, \"the Saponaria [soapwort] treatment of the cloth\":\"Studies by Adler have indicated that the red color seen microscopically is consistent with someone who was the victim of severe trauma, due to the breakdown products of red blood cells, namely bilirubin. However, another explanation for the red color may be due to Saponaria treatment of the cloth.\" (Zugibe, F.T., 2005, \"The Crucifixion of Jesus: A Forensic Inquiry,\" p.177).Of which there is experimental evidence by STURP:\"It is worth noting that, if the cloth was washed using soapwort, it might also help explain the reddish colour of the bloodstains, since Saponaria solutions are haemolytic, i.e. they break down red blood cells and release the haemoglobin. Apparently, this was tested before the STURP team went to Turin by applying blood to linen washed with soapwort, and twenty-five years later this blood was still red, whereas control samples on ordinary linen had turned black. This is an alternative explanation to that proposed by Adler, but it does not necessarily invalidate his conclusion that the blood belonged to a badly injured person.\" (de Wesselow, T., 2012, \"The Sign,\" p.111).Berry claims to be speaking for science, but since when is it scientific to:1. Depend on personal abuse to make up for the weakness of one's arguments?2. Fail to research thoroughly the literature of the hypothesis that one is attempting to refute?3. Ignore the mountain of other evidence in favour of the overall theory one is trying to refute, with a single \"molehill\" item of apparently contrary evidence?Science does not throw out a theory that is backed by a large number of different lines of evidence, because of one claimed problem. Rather what science does is try to reconcile the single problem with the large body of evidence for the theory.Berry's approach is the very antithesis of science! Stephen E. Jones-----------------------------------MY POLICIES Comments are moderated. Those I consider off-topic, offensive or sub-standard will not appear. Except that comments under my latest post can be on any Shroud-related topic without being off-topic. I normally allow only one comment per individual under each one of my posts.\n\n","author":"Stephen E Jones","date":"February 10, 2015 at 10:02 PM","url":"http://theshroudofturin.blogspot.com/2015/02/dimensions-of-shroud-turin-shroud_4.html","site":"moore"},{"title":"\nDimensions of the Shroud: Turin Shroud Encyclopedia \n","post":"\n\n>See also Adler's paper \"Chemical and Physical Characteristics of the Blood Stains,\" on page 135 of his \"The Orphaned Manuscript,\" which I will eventually scan and it will be placed online (probably early to mid this year) by Barrie Schwortz, in his Shroud Spectrum International archive.I have today scanned pages 60-61 of Adler's \"The Orphaned Manuscript,\" which is part of an article of his, \"The Origin and Nature of Blood on the Turin Shroud\" (1986).On page 61, Adler wrote (my emphasis):\"The next test we did was to take micro-spectrum photometry on the nonbirefringent red-coated fibrils from the Shroud. It was obvious that the spectrum it produced did not match the spectrum of methemoglobin, at least as it is given in the standard references, which is a solution spectrum of blood. But in a film of hemoglobin there is a confirmation change; it no longer remains in the `met' form but goes to the para-hemic form. It is known now that there is a certain species which will spontaneously go to the para-hemic form if there is not enough turn-over in the spleen and the liver to process the blood fast enough. We found a spectrum that was characteristic of only one known group of compounds — the so-called high-spin, high-iron porphyrins. So instead of being wrong, the spectrum peaks were in the right place. What we were seeing was the breakdown products of hemoglobin — bilirubin and biliverdin. And one began to make sense out of all this. There is AN EXTRAORDINARILY HIGH BILIRUBIN COUNT, almost as high as the methemoglobin. Now how does one account for such a high bilirubin in a person? One possibility is that the person had a severe malaria, but this does not seem very likely. But A TORTURE, SCOURGING AND CRUCIFIXION LEADING TO SHOCK — THAT WOULD PRODUCE A TREMENDOUS HEMOLYSIS. In less than 30 seconds, the hemolyzed hemoglobin will run through the liver, building up a very high bilirubin content in the blood. If that blood then clots, the exudate forms, and all the intact cells with hemoglobin stay behind, only the hemolyzed hemoglobin goes out along with THE SERUM ALBUMIN WHICH BINDS THE BILIRUBIN. So what one ends up with on the cloth is AN EXUDATE WHICH HAS AN ENHANCED BILIRUBIN INDEX with respect to the hemolyzed hemoglobin. You now mix bilirubin which is yellow-orange with methemoglobin in its para-hemic form which is an orangey-brown and YOU GET BLOOD WHICH HAS A RED COLOR.In fact, WE HAVE BEEN ABLE TO SIMULATE THIS SPECTRUM IN THE LABORATORY BY THE PROCESS DESCRIBED ABOVE. This very strongly suggests that the blood stains are of a man who was severely beaten. No one would have ever dreamed, when we first started doing the analysis, that THE CHEMISTRY WOULD PROVIDE CORROBORATING EVIDENCE to what the pathologists concluded long ago about the Shroud figure. The blood has no cells, is very low in potassium, and HAS THE RIGHT COLOUR AND COMPOSITION FOR THE BLOOD OF A MAN WHO WAS SEVERELY FLOGGED AND CRUCIFIED. This is entirely consistent with the forensic evidence.\"Hopefully \"The Orphaned Manuscript\" will be online in May as part of Barrie Schwortz's next Shroud.com update, if I can finish scanning it by then. It is already online in Google Books, but there it is only an image, not savable as text.Stephen E. Jones---------------------------------Reader, if you like this my The Shroud of Turin  blog, and you have a website, could you please consider adding  a hyperlink to my blog on it? This would help increase its Google PageRank number and so enable those who are Google searching on \"the Shroud of Turin\" to more readily discover my blog. Thanks.\n\n","author":"Stephen E Jones","date":"March 2, 2015 at 8:17 AM","url":"http://theshroudofturin.blogspot.com/2015/02/dimensions-of-shroud-turin-shroud_4.html","site":"moore"}]
