[{"title":"Stephen Jones is even questioning my beliefs about the Resurrection","post":"The term “Big Bang” was actually poking fun at the priest-scientist who put forth the theory which has now become the term everyone knows for a theory most everyone accepts as true.\n\n","date":"April 6, 2014 at 10:02 am","url":"https://shroudstory.com/2014/04/06/stephen-jones-is-even-questioning-my-beliefs-about-the-resurrection/","cat":"other_blogs","id":"comment-97086","author":"Andy","site":"shroudstory"},{"title":"Stephen Jones is even questioning my beliefs about the Resurrection","post":"Dan, what in the world is he getting at?\n\n","date":"April 6, 2014 at 11:57 am","url":"https://shroudstory.com/2014/04/06/stephen-jones-is-even-questioning-my-beliefs-about-the-resurrection/","cat":"other_blogs","id":"comment-97110","author":"Merkin Muffley","site":"shroudstory"},{"title":"Stephen Jones is even questioning my beliefs about the Resurrection","post":"Jesus may indeed be going before SEJ with this, with part of the Master plan to include enhanced free publicity and more awareness…But what if the good Lord in His infinite wisdom is turning up the spotlight to, in fact, catalyze the reveal that such accusations have no solid, factual foundation, and are not truly based on actual transpired events?  One wonders if the author would also be willing to accept that type of Divine intervention, or must it be made to order?\nAlso, if such conspiracies are true, then does this mean Ray Rogers’ lab notebooks may have also been hacked?  That the area sampled for the dating is, in fact, not anamolous relative to the rest of the cloth?  Are C-14 date hacking (the cloth is really much older than we were led to believe) and RR’s chemical analysis (this area is spurious, non-representative of the main cloth) compatible?  Or is this  just happenstance, true, true, & unrelated?  Does anyone know where Ray Rogers stood on the Big Bang and evolution?\n\n","date":"April 6, 2014 at 3:10 pm","url":"https://shroudstory.com/2014/04/06/stephen-jones-is-even-questioning-my-beliefs-about-the-resurrection/","cat":"other_blogs","id":"comment-97147","author":"Kelly Kearse","site":"shroudstory"},{"title":"Stephen Jones is even questioning my beliefs about the Resurrection","post":"“The theory of evolution has seen an amazing process of accretion of facts since it was first proposed, and it has proved to have predictive value.” — Ray Rogers.\nRay Rogers was a charter member of the Coalition for Excellence in Science Education in New Mexico, which stressed the importance of teaching evolution in the schools. He was strongly against teaching creationism in the schools and actively lobbied against it. In one case he wrote a rather strong letter to the editor of the Los Alamos Monitor, the city’s local newspaper. \nR. N. Rogers\n10 Jan. 1997\nThe Los Alamos Monitor\nEditor:\nSig Hecker is the director of the most famous laboratory in the world, certainly the laboratory that has had the largest effect on humanity’s perception of science since the beginning of recorded history. This is The Laboratory that has shown people that they must take the effects of science seriously. It is also one of the laboratories that could teach the world just what science is and what they can expect from it. I have reason to believe that Sig Hecker is an exceedingly poor choice to represent science.\nThe public largely does not understand exactly what science is, and there appears to he a strong desire not to be compelled to find out either in school or by personal study. A significant fraction of the public has a deep hate for what they think science is. Another fraction feels that its beliefs are threatened. Both groups have launched assaults on science, and the people who love science cannot believe that it is happening. It is! We have seen a very practical result in the State Board of Education that will have long-term effects.\nScience is not “things.” It is a way of thinking. Classical Scientific Method is simply a method for objectively applying logic to the solution of problems. 1) The problem must be stated in clear terms, and obscure words must be defined clearly. The goal sought must also be stated clearly. 2) Everything known about the problem must be studied, and all references must be acknowledged. There must be no “hidden facts,” and it is not clever to “blind side” the opposition. Carefully planned observations should be made. Different methods of observation should be made when possible, and results must be checked for internal consistency and agreement with reported results. All observations must be taken seriously, until some justifiable and clearly stated reason can be found to eliminate any. 3) A “brainstorming” session, preferably with other workers familiar with the problem, should try to develop as many potential explanations (hypotheses) as possible (Method of Multiple Working Hypotheses), All hypotheses must be clearly stated. And 4), all of the hypotheses must be tested equally against the same, complete list of observations and facts. Testing may often involve making predictions on the basis of the hypotheses and testing the predictions by experiment. The Principle of Parsimony (Occam’s Razor) states that the hypothesis that includes the largest number of facts and observations will be closest to the truth. Hypotheses that do not accept many facts without “special pleading” should be discarded.\nWe are now living in a time when the special pleadings have assumed more importance than the facts. An approach that does not include the components of Scientific Method is not “science.”\nA well-tested hypothesis, for which no exceptions have been found, is called a “theory.” The word “theory” in science does not connote “speculation.” Creationists misuse the term to confuse the public.\nI asked Sig Hecker for help in the defense of science. He has, after all, espoused excellence in science” as his fundamental desire for the laboratory. With regard to creationism, his response was the following: “The lab has no official position on creationism. The media have tried, several times to get me to take a stance, and I have refused.”\nI suppose that a large government-financed scientific organization must be politically correct. It might not be good for the careers of scientific managers to propose an official position on something like science. An individual scientist, however, might be expected to make continual application of classical Scientific Method. He would be expected to keep “truth” as his primary goal. He would be expected to defend his methods under peer review. I believe that Sig’s refusal to make a personal statement on creationism is his scientific position.\nIf the laboratory is managed by creationists who still profess to be scientists, they should be willing to present all of their facts for public scrutiny. If they are not willing to do this, I believe that higher authorities should return the laboratory to scientific management as quickly as legally possible. Persons who value science should insist on it.\nR. N. Rogers\nHere is another letter. Any questions now about where Rogers stands?\nR. N. Rogers\n17 Jan. 1997\nThe Los Alamos Monitor\nEditor:\nJohn Baumgardner’s response to my letter attributes statements to me that I did not make. I was advocating classical scientific method as the best approach to the solution of problems. I did not advocate or even mention atheism. I did not advocate any control over religious expression. Religion is “revealed”: The body of knowledge in science is developed by application of a specific logical process. The two operate in different spheres. Science and atheism are two different things. Trouble comes when a person attempts selectively to accept or deny scientific observations primarily on the basis of religious beliefs. By definition, a “scientist” is a person who uses scientific method. Like Caesar’s wife, a scientist must be above suspicion. The more “renowned” the scientist, the more careful he should be.\nI was accused of proposing atheism as official policy for the laboratory. I was accused of advocating control over free religious expression. Those are serious accusations. I did neither.\nThe Greeks classified logical fallacies over two thousand years ago, and many fallacies appear in attempts to circumvent honest application of scientific method on any topic. Baumgardner’s accusations against me are a good example of an argument ad hominum, with which you attack a person rather thrums logic (common in politics). Invocation of great theist scientists seems to have as its unstated conclusion that “therefore, creationism is true.” True science should not use hidden premises; however, the type of argument used involves the non sequitur fallacy (argumentative leap). The most common fallacy I see used is “begging the question”: The argument assumes as true what it needs to prove.\nHundreds of years of observations and measurements by thousands of scientists have provided the basis for the scientific theory of evolution. Has all of that been a conspiracy? Back to begging the question, can anyone prove that “science has falsified evolution” without first accepting the premise that God created everything, most things, some things, or (fill in the blanks)? In science you state your hypotheses and premises, and I have yet to see all of the creationist premises and/or hypotheses clearly stated.\nIncidentally, I hated to use the word “theory.” Its use by creationists illustrates another fallacy, the fallacy of equivocation. This involves the deliberate use of the same word or phrase in more than one sense. A scientific theory is more solidly established than a hypothesis. The theory of evolution has seen an amazing process of accretion of facts since it was first proposed, and it has proved to have predictive value.\nThe fallacy of composition has often been used in attempts to disprove evolution. It involves the suggestion of some doubt and the application of that doubt to the attempted destruction of an entire body of knowledge. Each doubt must be critically analyzed, and I do not see that being done. Is it necessary to disprove anything to prove God? Do warped logic and outright lies support God?\nI admit that I have not read Behe’s book. I have, however, had a son who worked in Melvin Calvin’s laboratory at Berkeley, and I have read many of Calvin’s works. Calvin wrote Chemical Evolution, and he got a Nobel Prize. I have not seen any creationist work of similar stature. Perhaps a corporate philosophy that allows a lack of scientific rigor explains the lack of Nobel Prizes at Los Alamos.\nI would have to see some scientific analysis of creationists’ claims, made by creationists with rigorous methods, before I organized a symposium with them. I do not enjoy illogical polemics and vague claims. With or without scientific, method, I suggest most strongly that John Baumgardner watch very closely what he says or writes about any scientist\nR. N. Rogers\n\n","date":"April 6, 2014 at 4:34 pm","url":"https://shroudstory.com/2014/04/06/stephen-jones-is-even-questioning-my-beliefs-about-the-resurrection/","cat":"other_blogs","id":"comment-97179","author":"Dan","site":"shroudstory"},{"title":"Stephen Jones is even questioning my beliefs about the Resurrection","post":"Rogers wrote “.. if the laboratory is managed by creationists who still profess to be scientists.” See #4. What about non-creationists who still profess to be scientists? That is why the science-theology dialogue exists.\n\n","date":"April 6, 2014 at 5:37 pm","url":"https://shroudstory.com/2014/04/06/stephen-jones-is-even-questioning-my-beliefs-about-the-resurrection/","cat":"other_blogs","id":"comment-97194","author":"Louis","site":"shroudstory"},{"title":"Stephen Jones is even questioning my beliefs about the Resurrection","post":"“I  told Dan and his commenters that the Holy Spirit had been prompting me to warn both them and Dan that they who personally attack me, a Christian who is only seeking to serve his Lord, that Jesus will, if they don’t repent, avenge their attacks on me.”\n“I strongly believe that Jesus is going before me in this and that He will progressively reveal what REALLY happened in the C-14 dating of His Shroud.”\nIt is easy to fall into the trap that one is the spokesperson for Jesus.  The worst offences committed by Christians were always done in His name.  The Egyptian desert monks under St Cyril of Alexandria murdered the renown female mathematican Hypatia for this reason.  Dare one mention the horrors committed by the western Crusaders against their orthodox brethren in the east, the methods of the Spanish inquisitors, the horrors perpetrated by both Elizabethan and Jacobite persecutors against those they disagreed with. Stephen is no doubt familiar with Foxe’s Book of Martyrs. One can cite the witch trials of medieval Europe, and those more recently in Salem, check Artur Miller’s “The Crucible”. All done in the name of Christ! But other agendas were at work and the real culprit is laughing his demonic head off in his home of Hades. \nStephen is on shaky ground when he accuses other God-fearing folk of heresy.  But he is following a well-trodden precedent!   \nIt can be no accident that the most virulent evangelical adherents also tend to become the most fanatic of agnostics and atheists. It is a mind-set that drives them, not God’s truth at all.\n\n","date":"April 6, 2014 at 4:05 pm","url":"https://shroudstory.com/2014/04/06/stephen-jones-is-even-questioning-my-beliefs-about-the-resurrection/","cat":"other_blogs","id":"comment-97165","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Stephen Jones is even questioning my beliefs about the Resurrection","post":"A lot of rethinking about the Bible’s creation story will have to be done and Father Georges Lemaitre’s Big Bang theory is still not proven and even if it is, it may only answer some questions,not all. But that will not be his fault because he was just a physicist, not a theologian like Rahner or a philosopher like Heidegger. \nAs I wrote more than once here, there is still a lot more in the box and it will not be the Big Bang theory or the Turin Shroud that will stop churches from closing down (nine a day only in the US, it seems). For that matter, it is also the reason why 70% of Israel’s population is secular, roughly thinking along the lines archaeologist Israel Finkelstein thinks.\nThere are two things that have to be considered by those writing on the Shroud:\n1) If the image was formed by a natural process, what will it tell us? Do we need it to prove the existence of Jesus or that he was crucified, dead and buried?\n2) If it was formed by a supernatural process, a byproduct of the Resurrection, will it answer all our questions? No, it wont. One has to go beyond Shroud studies to see what science is discovering. There are things that neither science or religion can answer now and we have to go beyond slowly.   \nKelly asks if anyone knows where Ray Rogers stood on evolution. Judging from a paper he co-authored, nothing to do with the Shroud, he accepted the evolutionary process, and in this particular paper he sort of wrote about it as an automatic process, without saying anything about where the rationale came from. Such an attitude can unfortunately also be seen in some areas of Shroud studies. To dodge questions when they are raised is downright dishonesty.\n\n","date":"April 6, 2014 at 4:25 pm","url":"https://shroudstory.com/2014/04/06/stephen-jones-is-even-questioning-my-beliefs-about-the-resurrection/","cat":"other_blogs","id":"comment-97173","author":"Louis","site":"shroudstory"},{"title":"Stephen Jones is even questioning my beliefs about the Resurrection","post":"Very disappointing, So Stephen just remembered now that everyone here is bad? Only when Dan tries to prevents him from defaming someone with no shred of evidence.\n\n","date":"April 6, 2014 at 4:26 pm","url":"https://shroudstory.com/2014/04/06/stephen-jones-is-even-questioning-my-beliefs-about-the-resurrection/","cat":"other_blogs","id":"comment-97174","author":"Mike M","site":"shroudstory"},{"title":"Stephen Jones is even questioning my beliefs about the Resurrection","post":"“Usually, even a non-Christian knows something about the earth, the\nheavens, and the other elements of this world, about the motion and\norbit of the stars and even their size and relative positions, about\nthe predictable eclipses of the sun and moon, the cycles of the years\nand seasons, about the kinds of animals, shrubs, stones, and so forth,\nand this knowledge he holds to as being certain from reason and\nexperience. Now, it is a disgraceful and dangerous thing for an\ninfidel to hear a Christian, presumably giving the meaning of Holy\nScripture, talking nonsense on these topics; and we should take all\nmeans to prevent such an embarrassing situation, in which people show\nup vast ignorance in a Christian and laugh it to scorn. The shame is\nnot so much that an ignorant individual is derided, but that people\noutside the household of the faith think our sacred writers held such\nopinions, and, to the great loss of those for whose salvation we toil,\nthe writers of our Scripture are criticized and rejected as unlearned\nmen…. Reckless and incompetent expounders of Holy Scripture bring\nuntold trouble and sorrow on their wiser brethren when they are caught\nin one of their mischievous false opinions and are taken to task by\nthese who are not bound by the authority of our sacred books. For\nthen, to defend their utterly foolish and obviously untrue statements,\nthey will try to call upon Holy Scripture for proof and even recite\nfrom memory many passages which they think support their position,\nalthough they understand neither what they say nor the things about\nwhich they make assertion.”\nAugustine(Bishop of Hippo)\n\n","date":"April 6, 2014 at 5:03 pm","url":"https://shroudstory.com/2014/04/06/stephen-jones-is-even-questioning-my-beliefs-about-the-resurrection/","cat":"other_blogs","id":"comment-97186","author":"John Green","site":"shroudstory"},{"title":"Stephen Jones is even questioning my beliefs about the Resurrection","post":"Delightful! I’ve passed it on to a scholarly Augustinian priest acquaintance who I think might also appreciate it!\n\n","date":"April 6, 2014 at 6:51 pm","url":"https://shroudstory.com/2014/04/06/stephen-jones-is-even-questioning-my-beliefs-about-the-resurrection/","cat":"other_blogs","id":"comment-97211","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Stephen Jones is even questioning my beliefs about the Resurrection","post":"Theoretically this sounds fine, however it seems Augustine would have done some rethinking if he were here with us today.\n\n","date":"April 6, 2014 at 7:42 pm","url":"https://shroudstory.com/2014/04/06/stephen-jones-is-even-questioning-my-beliefs-about-the-resurrection/","cat":"other_blogs","id":"comment-97217","author":"Louis","site":"shroudstory"},{"title":"Stephen Jones is even questioning my beliefs about the Resurrection","post":"Further to my other comments above, there are other viewpoints:\nhttp://news.yahoo.com/creationists-hate-catholic-040054152–politics.html\nCreationists do not sometimes understand that Intelligent Design can create problems, which is something Miller grasps very well. It is like saying Leibniz did away with the problem of evil.\n\n","date":"April 6, 2014 at 6:03 pm","url":"https://shroudstory.com/2014/04/06/stephen-jones-is-even-questioning-my-beliefs-about-the-resurrection/","cat":"other_blogs","id":"comment-97198","author":"Louis","site":"shroudstory"},{"title":"Stephen Jones is even questioning my beliefs about the Resurrection","post":"\nDan :\n“The theory of evolution has seen an amazing process of accretion of facts since it was first proposed, and it has proved to have predictive value.” — Ray Rogers.\nRay Rogers was a charter member of the Coalition for Excellence in Science Education in New Mexico, which stressed the importance of teaching evolution in the schools. He was strongly against teaching creationism in the schools and actively lobbied against it. In one case he wrote a rather strong letter to the editor of the Los Alamos Monitor, the city’s local newspaper.\nR. N. Rogers\n10 Jan. 1997\nThe Los Alamos Monitor\nEditor:\nSig Hecker is the director of the most famous laboratory in the world, certainly the laboratory that has had the largest effect on humanity’s perception of science since the beginning of recorded history. This is The Laboratory that has shown people that they must take the effects of science seriously. It is also one of the laboratories that could teach the world just what science is and what they can expect from it. I have reason to believe that Sig Hecker is an exceedingly poor choice to represent science.\nThe public largely does not understand exactly what science is, and there appears to he a strong desire not to be compelled to find out either in school or by personal study. A significant fraction of the public has a deep hate for what they think science is. Another fraction feels that its beliefs are threatened. Both groups have launched assaults on science, and the people who love science cannot believe that it is happening. It is! We have seen a very practical result in the State Board of Education that will have long-term effects.\nScience is not “things.” It is a way of thinking. Classical Scientific Method is simply a method for objectively applying logic to the solution of problems. 1) The problem must be stated in clear terms, and obscure words must be defined clearly. The goal sought must also be stated clearly. 2) Everything known about the problem must be studied, and all references must be acknowledged. There must be no “hidden facts,” and it is not clever to “blind side” the opposition. Carefully planned observations should be made. Different methods of observation should be made when possible, and results must be checked for internal consistency and agreement with reported results. All observations must be taken seriously, until some justifiable and clearly stated reason can be found to eliminate any. 3) A “brainstorming” session, preferably with other workers familiar with the problem, should try to develop as many potential explanations (hypotheses) as possible (Method of Multiple Working Hypotheses), All hypotheses must be clearly stated. And 4), all of the hypotheses must be tested equally against the same, complete list of observations and facts. Testing may often involve making predictions on the basis of the hypotheses and testing the predictions by experiment. The Principle of Parsimony (Occam’s Razor) states that the hypothesis that includes the largest number of facts and observations will be closest to the truth. Hypotheses that do not accept many facts without “special pleading” should be discarded.\nWe are now living in a time when the special pleadings have assumed more importance than the facts. An approach that does not include the components of Scientific Method is not “science.”\nA well-tested hypothesis, for which no exceptions have been found, is called a “theory.” The word “theory” in science does not connote “speculation.” Creationists misuse the term to confuse the public.\nI asked Sig Hecker for help in the defense of science. He has, after all, espoused excellence in science” as his fundamental desire for the laboratory. With regard to creationism, his response was the following: “The lab has no official position on creationism. The media have tried, several times to get me to take a stance, and I have refused.”\nI suppose that a large government-financed scientific organization must be politically correct. It might not be good for the careers of scientific managers to propose an official position on something like science. An individual scientist, however, might be expected to make continual application of classical Scientific Method. He would be expected to keep “truth” as his primary goal. He would be expected to defend his methods under peer review. I believe that Sig’s refusal to make a personal statement on creationism is his scientific position.\nIf the laboratory is managed by creationists who still profess to be scientists, they should be willing to present all of their facts for public scrutiny. If they are not willing to do this, I believe that higher authorities should return the laboratory to scientific management as quickly as legally possible. Persons who value science should insist on it.\nR. N. Rogers\nHere is another letter. Any questions now about where Rogers stands?\nR. N. Rogers\n17 Jan. 1997\nThe Los Alamos Monitor\nEditor:\nJohn Baumgardner’s response to my letter attributes statements to me that I did not make. I was advocating classical scientific method as the best approach to the solution of problems. I did not advocate or even mention atheism. I did not advocate any control over religious expression. Religion is “revealed”: The body of knowledge in science is developed by application of a specific logical process. The two operate in different spheres. Science and atheism are two different things. Trouble comes when a person attempts selectively to accept or deny scientific observations primarily on the basis of religious beliefs. By definition, a “scientist” is a person who uses scientific method. Like Caesar’s wife, a scientist must be above suspicion. The more “renowned” the scientist, the more careful he should be.\nI was accused of proposing atheism as official policy for the laboratory. I was accused of advocating control over free religious expression. Those are serious accusations. I did neither.\nThe Greeks classified logical fallacies over two thousand years ago, and many fallacies appear in attempts to circumvent honest application of scientific method on any topic. Baumgardner’s accusations against me are a good example of an argument ad hominum, with which you attack a person rather thrums logic (common in politics). Invocation of great theist scientists seems to have as its unstated conclusion that “therefore, creationism is true.” True science should not use hidden premises; however, the type of argument used involves the non sequitur fallacy (argumentative leap). The most common fallacy I see used is “begging the question”: The argument assumes as true what it needs to prove.\nHundreds of years of observations and measurements by thousands of scientists have provided the basis for the scientific theory of evolution. Has all of that been a conspiracy? Back to begging the question, can anyone prove that “science has falsified evolution” without first accepting the premise that God created everything, most things, some things, or (fill in the blanks)? In science you state your hypotheses and premises, and I have yet to see all of the creationist premises and/or hypotheses clearly stated.\nIncidentally, I hated to use the word “theory.” Its use by creationists illustrates another fallacy, the fallacy of equivocation. This involves the deliberate use of the same word or phrase in more than one sense. A scientific theory is more solidly established than a hypothesis. The theory of evolution has seen an amazing process of accretion of facts since it was first proposed, and it has proved to have predictive value.\nThe fallacy of composition has often been used in attempts to disprove evolution. It involves the suggestion of some doubt and the application of that doubt to the attempted destruction of an entire body of knowledge. Each doubt must be critically analyzed, and I do not see that being done. Is it necessary to disprove anything to prove God? Do warped logic and outright lies support God?\nI admit that I have not read Behe’s book. I have, however, had a son who worked in Melvin Calvin’s laboratory at Berkeley, and I have read many of Calvin’s works. Calvin wrote Chemical Evolution, and he got a Nobel Prize. I have not seen any creationist work of similar stature. Perhaps a corporate philosophy that allows a lack of scientific rigor explains the lack of Nobel Prizes at Los Alamos.\nI would have to see some scientific analysis of creationists’ claims, made by creationists with rigorous methods, before I organized a symposium with them. I do not enjoy illogical polemics and vague claims. With or without scientific, method, I suggest most strongly that John Baumgardner watch very closely what he says or writes about any scientist\nR. N. Rogers\n\nDan,\nThanks for your effort on this-It was interesting to read Rogers’ viewpoint in detail.\nI must be honest and apologize-I was actually making a sarcastic comment, that if Rogers’ assigned some value to evolution (I had a pretty good idea what his views were), then his credibility in studying the Shroud must also be questioned, according to the SEJ school of thinking.  When one sets authentic at all costs as the final page and works backwards, conspirators can lurk everywhere.\nMy apologies again (though I did enjoy reading this!)-I just didn’t want to mislead why I originally wrote that-\n\n","date":"April 6, 2014 at 7:04 pm","url":"https://shroudstory.com/2014/04/06/stephen-jones-is-even-questioning-my-beliefs-about-the-resurrection/","cat":"other_blogs","id":"comment-97215","author":"Kelly Kearse","site":"shroudstory"},{"title":"Stephen Jones is even questioning my beliefs about the Resurrection","post":"Stephen is speaking as though he believes God has given him ‘authority’ to do so. I have to ask what proof Stephen has that such authority has been given him. \nI can quote Scripture out of context too.\n\n","date":"April 7, 2014 at 9:13 am","url":"https://shroudstory.com/2014/04/06/stephen-jones-is-even-questioning-my-beliefs-about-the-resurrection/","cat":"other_blogs","id":"comment-97378","author":"David Goulet","site":"shroudstory"},{"title":"Stephen Jones is even questioning my beliefs about the Resurrection","post":"True Christians and false Christians are separated through love, tolerance and reaction to adversity. \nHow do you act when you don’t get your way or when someone doesn’t agree with your beliefs? Newsflash- Bigotry is NOT a Christian trait, in fact it’s an oxymoron. \nRemember folks, when you come online, the world is watching. It’s great to voice our individualism and thoughts, but IF you are a Christian it is your obligation to do so in a Christ-like manner, regardless how right you THINK you are, or agitated you become.\nWhy would anyone want to convert to a group of angry hypocrites spewing out condescending remarks faster than a new PEZ dispenser? It only encourages atheism. \n\n","date":"April 7, 2014 at 12:04 pm","url":"https://shroudstory.com/2014/04/06/stephen-jones-is-even-questioning-my-beliefs-about-the-resurrection/","cat":"other_blogs","id":"comment-97406","author":"jenx","site":"shroudstory"},{"title":"Stephen Jones is even questioning my beliefs about the Resurrection","post":"A point extremely well made. I’ll try to remember that one. But I guess that to err is also human.\n\n","date":"April 7, 2014 at 3:52 pm","url":"https://shroudstory.com/2014/04/06/stephen-jones-is-even-questioning-my-beliefs-about-the-resurrection/","cat":"other_blogs","id":"comment-97442","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Stephen Jones is even questioning my beliefs about the Resurrection","post":"Good point.  Perhaps there is a inverse correlation between virtue and contention.  The more virtue the less contention.\n\n","date":"May 7, 2014 at 11:54 pm","url":"https://shroudstory.com/2014/04/06/stephen-jones-is-even-questioning-my-beliefs-about-the-resurrection/","cat":"other_blogs","id":"comment-114269","author":"Andy","site":"shroudstory"},{"title":"Stephen Jones is even questioning my beliefs about the Resurrection","post":"Once again, Stephen Jones is, as I expected, atrophying his credibility. Dan, you or I don’t know where these come from, it’s simply that they seem to have been going in a misdirection since his supposed “hypothesis”. Why?\n\n","date":"April 7, 2014 at 3:59 pm","url":"https://shroudstory.com/2014/04/06/stephen-jones-is-even-questioning-my-beliefs-about-the-resurrection/","cat":"other_blogs","id":"comment-97443","author":"Merkin Muffley","site":"shroudstory"}]
