[{"title":"\nRe: There is compelling evidence it is the burial cloth of Christ, or a man crucified during that time #2\n","post":"\n\nHi Stephen, I'm sure we have never met though I was with Channel 10 in Perth (Good Morning Perth and my Magic Show on Saturday Mornings) in 1989/90.I enjoyed your article and have been involved with the Shroud research for over 20 years. My book on the Shroud (\"In The Image Of His God\" ISBN 978-1-4327-2878-6 was launched at the Shroud Convention in Ohio last October. Rex Morgan is a dear friend. You may enjoy my web site http://shroudresearch.com or http://worldofunexplainedmysteries.com Sincere regardsPeterDr. Peter J. Shield PhD,ARP\n\n","author":"Dr. Peter J. Shield PhD","date":"July 16, 2009 at 1:12 AM","url":"http://theshroudofturin.blogspot.com/2008/11/re-there-is-compelling-evidence-it-is.html","site":"moore"},{"title":"\nRe: There is compelling evidence it is the burial cloth of Christ, or a man crucified during that time #2\n","post":"\n\nPeterThanks for your comment.>My book on the Shroud (\"In The Image Of His God\" ... was launched at the Shroud Convention in Ohio last October. From your Shroud of Turin Research website:\"In `In the Image of His God' Dr. Shield proposes an incredible scenario involving The Knights Templar, Leonardo Da Vinci, Pope John Paul II and a plot by the infamous Illuminati to bring about the downfall of the Catholic Church!\"I agree it is \"incredible\" in the original sense of \"not credible.\"Stephen E. Jones\n\n","author":"Stephen E Jones","date":"July 16, 2009 at 9:16 AM","url":"http://theshroudofturin.blogspot.com/2008/11/re-there-is-compelling-evidence-it-is.html","site":"moore"},{"title":"\nRe: There is compelling evidence it is the burial cloth of Christ, or a man crucified during that time #2\n","post":"\n\nThe Shroud of Turin can't possibly be an image of Christ. The gospels clearly say that Jesus was wrapped in 'strips' of cloth, except for a a type of hood over his head.\n\n","author":"Dawn Wessel","date":"July 17, 2009 at 10:54 AM","url":"http://theshroudofturin.blogspot.com/2008/11/re-there-is-compelling-evidence-it-is.html","site":"moore"},{"title":"\nRe: There is compelling evidence it is the burial cloth of Christ, or a man crucified during that time #2\n","post":"\n\nDawnThanks for your comment.>The Shroud of Turin can't possibly be an image of Christ. The gospels clearly say that Jesus was wrapped in 'strips' of cloth, except for a a type of hood over his head.No. As leading evangelical Christian theologian Dr. Gary Habermas (and others) has demonstrated in his two co-authored books, \"Verdict on the Shroud\" (1981) and \"The Shroud and the Controversy\" (1990), the Shroud is perfectly in harmony with the Gospel accounts of Jesus burial (as well as His suffering, death and resurrection), when the data in all four Gospels is carefully considered, especially in the original Greek.The \"strips of linen\" in Lk 24:12; Jn 11:44; 19:40; 20:5-6 is a mistranslation by the NIV in being too specific when the underlying Greek words can just mean linen cloths. The KJV more correctly translates those same verses by the more general \"linen clothes\" and \"graveclothes.\" The NASB translates those verses as \"linen wrappings.\" The NLT of those same verses has \"linen wrappings\" and \"graveclothes\" and \"long sheets of linen cloth.\"Also the NIV is at variance with Jewish burial customs, where bodies were enfolded in a shroud not wound around in strips or bandages like an Egyptian mummy. The only strips that were used in Jewish burials are those tying the hands, feet and jaw, to keep them in place before rigor mortis set in. That is probably what is meant in Jn 11:44 where Lazarus was still bound by those linen strips, but it does not mean (or say) that he was otherwise naked, which he would be if those strips were all that he was wearing.See my 2007 post \"Bogus: Shroud of Turin? #1\" and Does the Shroud Contradict the Gospels?.Stephen E. Jones \n\n","author":"Stephen E Jones","date":"July 17, 2009 at 5:41 PM","url":"http://theshroudofturin.blogspot.com/2008/11/re-there-is-compelling-evidence-it-is.html","site":"moore"}]
