[{"title":"Stephen Jones Persists with the Hacker Theory","post":"I hate Occam’s razor even when I invoke as I will now. Simply put, it holds that the simmplest solution is normally the correct one. On the other hand, Einstein was opined: “Everything should be as simple as possible, but not simpler.”\nIn any event, from my experience, fraud is usually a lot more complex than the truth. That’s why there is a common admonition: always tell the truth so that you don’t have to remember what you said.\nNow putting all these adages and cliche’s together, never assume fraud unless it’s the only explanation. Investigate? Yes, of course. But when the evidence  damning the carbon tests is right there on the table, don’t spend too much of your time looking under the table.\nSteve has made enormous, worthwhile contributions to his blog and Shroud studies. The hacker theory isn’t one of them.\n\n","date":"March 8, 2014 at 10:21 am","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","id":"comment-86224","author":"John Klotz","site":"shroudstory"},{"title":"Stephen Jones Persists with the Hacker Theory","post":"Right, John, I agree.  What a great Shroud novel it would be though… intriguing to the mind but out of bounds in reality.\n\n","date":"March 8, 2014 at 11:30 am","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","id":"comment-86239","author":"Annette Cloutiér","site":"shroudstory"},{"title":"Stephen Jones Persists with the Hacker Theory","post":"John & Annette, I agree with both of you. I also think the longer he harps on this very weak (ridiculous, in my opinion) argument the more damage he does to his more serious, very well referenced research.\n\n","date":"March 8, 2014 at 2:15 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","id":"comment-86277","author":"Mike M","site":"shroudstory"},{"title":"Stephen Jones Persists with the Hacker Theory","post":"Right John, but what an intriguing Shroud novel this would make!   Imaginative in the mind, but out of bounds in reality!\n\n","date":"March 8, 2014 at 12:10 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","id":"comment-86256","author":"Annette Cloutier","site":"shroudstory"},{"title":"Stephen Jones Persists with the Hacker Theory","post":"Actually this sounds like a valid hypothesis overall, the details might not be there yet but the means and motives definitely are. It’s likely the test was rigged from multiple angles in case any one should fail, from the shady sample selection to the backdoors in the system. The shroud is so important we cannot dismiss the depths enemies of Christ will stoop to discredit him and his witnesses (material witness in this case). Just read the Gospels and Acts to see the conspiracy against Christ, the Apostles, and subsequent disciples down the ages. Do you think it ever ended? Christ is a huge headache for the world powers, religious and political, not least of all Atheist world Socialism.\nDon’t be surprised if enemies of Christ are willing to portray themselves as Shroud supporters complete with Shroud blogs, only to shoot down any real progress in Shroud studies with cheap buzzwords for weak minds like ‘tinfoil hat’ or ‘conspiracy theory’ in order to manage the discussion. These Judas goat actors are to be expected “And no wonder, for even Satan disguises himself as an angel of light. So it is no surprise if his servants, also, disguise themselves as servants of righteousness. Their end will correspond to their deeds.” 2Cor 11.14-5\nWhile I might not agree with everything said I do appreciate the persistence of Stephen Jones — keep at it!\n\n","date":"March 8, 2014 at 3:13 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","id":"comment-86287","author":"EGM","site":"shroudstory"},{"title":"Stephen Jones Persists with the Hacker Theory","post":"Just want to add that the means definitely existed at the time but was it in place? I would think it highly likely to be, but this is important to verify. The motive however has always been there, whether it be a KGB agent or otherwise as pointed out already.\n\n","date":"March 8, 2014 at 3:38 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","id":"comment-86291","author":"EGM","site":"shroudstory"},{"title":"Stephen Jones Persists with the Hacker Theory","post":"EGM, I don’t discount fraud up to the sampling stage. However, after that to claim that 3 labs were hacked simultaneously, in my opinion, is absurd. I have been to analysis labs 100s of times before (working in pharmaceutical manufacturing for 11 years)  waiting for the analysis of different pharmaceutical batches. The people who operate those machines (mass spectrometry, HPLC etc.) can tell by looking at the initial curve/slope what the analysis will be like. Jull in one of the interviews said that within 5 minutes they knew that the sample was not 2000 years old, and I believe him, because I’ve been in similar labs before. So it’s not that someone manipulated the numbers during processing the data, because you can’t fool scientists in 3 labs who were looking at the curve as the analysis was going on. The test itself would show to the experienced eye if the sample was old or young. Rather than resorting to conspiracy theories and  branding other believers as Satans (i guess its an honour since Jesus himself was accused with the same thing), there are tons of real, credible pieces of evidence that supports the authenticity and discredits the C14 date. Conspiracy theories won’t get us anywhere.\n\n","date":"March 8, 2014 at 6:46 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","id":"comment-86333","author":"Mike M","site":"shroudstory"},{"title":"Stephen Jones Persists with the Hacker Theory","post":"Re: #7\nMike, I was under the impression that the results were not produced simultaneously – not an major issue anyway. Really though, it’s a bit naive to think conspiracies are not at work to undermine Christ and his servants when it’s been recorded this way since the beginning of the Gospels not to mention the reason Christ was crucified to begin with. Conspiracies abound in just about every sphere of humanity. Just hang around a criminal courtroom for a some time if you lived a sheltered life. \n“I don’t discount fraud up to the sampling stage,” so you don’t discount the sampling was fraudulent – that’s a start. All it takes is more than one person involved to make it a conspiracy, nothing too outlandish. Careful you don’t slip up and admit conspiracies are possible, what would the good and most noble members of the Order of the Shroud Blog think of you? I’m sure we can find something in the DSM to diagnose you with. That’s ok, I suppose I should take your word at face value about how the lab systems worked back then and how all airtight it was because you worked at all three labs (simultaneously) and they ran the same C14 tests run in pharm labs and it’s absurd to think otherwise, etc etc. That might all be true for all I know, I hope it’s that simple. For the record I don’t know Jull and have never met and got to know the man and can’t vouch for his character, I guess you have and therefore can. \nWhat I do find absurd was the push against a perfectly valid line of inquiry about the security details surrounding perhaps the most important C14 test in history. Why the heck wouldn’t we want to know more about it?? All of a sudden we have you as an expert to pop up and explain it all away with a wave of the hand? The group response against it seemed unnatural and a bit overdone, even.. dare I say it.. suspicious? (Maybe you can insert a tin-foil hat comment here) I felt compelled to add some balance to the discussion, but I never said I believed it happened as described, I only made it clear I believed it could very well have happened, especially in light of the criminal sample process and suspicious date. There should be a full on investigation of the whole situation start to finish with full cooperation from everyone involved. That will never happen of course. The next best thing is what Mr. Jones is doing and what does he get in return? A slap down by people supposedly most interested in learning about it.\nOne small request Mike M, please don’t accuse me of branding someone a satan when I didn’t (Satan is referred to as the Accuser btw). The quote I gave also refers to servants of Satan (Adversary) who pose and act like believers of Christ to undermine their faithfulness. Of course quoting the bible to such won’t make much difference since they’ll just tell you Paul didn’t write 2 Corinthians (a pious fraud perhaps) or Christ may have misspoke here or there, etc etc. Hope that clears things up.\nBtw, I’d just like to point out that those who think the Shroud a fraud are conspiracy theorists. They would typically push the narrative that the cloth image is man-made and peddled by members of the church (hierarchy) to attract a large patronage with hopefully larger pockets, or at least some variation of this plan which would require more than one person involved in the fraud.\n\n","date":"March 10, 2014 at 10:55 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","id":"comment-87177","author":"EGM","site":"shroudstory"},{"title":"Stephen Jones Persists with the Hacker Theory","post":"EGM, Wow, I didn’t think I upset you that much.\n“It’s a bit naive to think conspiracies are not at work”\n … Who said that conspiraceis are not at work. All I said was that the hacking claim was ridiculous and didn’t make sense to me. you don’t believe me, fine, I am cool with that.\n“Lived a sheltered life”\n…. very typical, can’t counter an argument go ad hominem. Please focus on the arguments without judging the person behind them, you don’t know me.\n“Noble members of the blog”\n…. again very typical…generalize without countering the actual arguments just bundle everyone else together and brand them. It’s easier than actually listening to what they are saying.\n“find something in DSM to diagnose you with”\ndude…what are you talking about. When did anyone in this blog brand anyone with something from the DSM. do you have an example or your just talking nonsense, for the most part people talk with respect in this blog (with some exceptions that Dan takes care of swiftly).\n“Can’t vouch for Jull’s character”\n….neither can I, but why assume the worst in people. If you don’t know the guy why assume he is part of a conspiracy? Just because you don’t agree with him?\n“Have you as an expert”\n…… I never said I was. I am entitled to my opinion, based on my life experience, thank God I am allowed that here, don’t like it, so what…that’s what blogs are for.I say my opinion, you say yours. Why are you angry? May be because you have nothing to back up your claims with?\n“Quoting the bible to such wont make much difference” …..Neither to you my friend, so I won’t even bother.\n\n","date":"March 11, 2014 at 12:44 am","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","id":"comment-87201","author":"Mike M","site":"shroudstory"},{"title":"Stephen Jones Persists with the Hacker Theory","post":"Re: #9\nMike, I don’t think I was upset, why would you think that? I might have poked fun at the stereotypes projected on those of us who study history and understand conspiracies are a huge part of life where power and wealth reside. Maybe you don’t believe me, that’s ok I’m cool with that. \nI wonder why you twisted my words when you misquoted me “Lived a sheltered life” editing out “in case you..” Typical tactic when you can’t address what was actually said just edit it how you like. As you said, I don’t know you and didn’t assume you were “street wise,” know what I mean? So no ad hominem there I’m afraid.\n““Noble members of the blog”…. again very typical…generalize without countering the actual arguments just bundle everyone else together and brand them.” It’s easier than actually listening to what they are saying.”\nNow you’re accusing me of not listening. No, I didn’t “bundle everyone together” either because not everyone plays the  ‘conspiracy theory’ or ‘tin-hatter’ card to stifle the discussion, just the ones who know who they are. And if I respond to an issue raised here, yes I do my best to read what others before me have said and then respond. The typical response was to hit the ‘conspiracy theory’ button way too fast to what Jones was proposing as if just invoking the words wins the argument. That’s kinda why I started my original post with “actually this sounds like a valid hypothesis..” and laid out my train of thought and tried to address issues with the reception of said proposal (ie, the conspiratorial nature of it, and the poor response it received; this is a pattern I’ve seen for some time btw, and not just on this blog). So why assume I didn’t listen? Do you have any evidence I didn’t or are you making another dig at me because you yourself can’t address the points?\n““find something in DSM to diagnose you with” dude…what are you talking about.”\nThis was a small joke, sorry you missed it. Some background: People will often stereotype those who bring up conspiracies as having mental issues without hearing them out, and the DSM is the bible of Psychiatry used to diagnose mental disorders. Interestingly, one of the signs used to diagnose some form of schizophrenia I believe was if the patient held the belief that the government wiretaps the phones! So there you have it, Edward Snowden is a headcase and should be extraordinary renditioned to the nearest re-education camp for processing immediately! The NSA’s good name has now been cleared! You have to have humor on this board sometimes.\n““Can’t vouch for Jull’s character”….neither can I, but why assume the worst in people. If you don’t know the guy why assume he is part of a conspiracy? Just because you don’t agree with him?”\nNow you’re accusing me of assuming the worst in people and Jull is part of the conspiracy?? Sounds to me like you’re the one assuming the worst in people — me. No, I was being completely neutral about Jull which I think is the smart approach in this delicate subject. If this were a criminal investigation (which it probably should be) and I was a detective, people in his position would definitely be a suspect — I do NOT assume his guilt, nor his innocence. You on the other hand admit you don’t know him but take him at his word anyways. Fine with me, I’m just trying to be a bit more cautious and circumspect in my approach and putting your voice in context when you support him.\n““Have you as an expert”…… I never said I was.”\nGood I wanted to get that out in the clear because some may have been mislead by your, what may have appeared to be, seeming authority on the subject discussed. So, it’s not that I don’t want to believe you when you pipe up to assure everyone that everything ran perfect and no shenanigans were afoot (nevermind that their were shenanigans afoot during the thoughtfully screwed up sample process which should immediately cast the whole dark operation in a suspect light), it’s just that you might not exactly be qualified to say so one way or the other, nor am I, only I don’t assume to do so as you did while attempting to insult and accuse others (me) who think it wise to investigate carefully the security detail surround what I believe to be the most important C14 test in history and get real facts, referring to when you said:  “resorting to conspiracy theories and branding other believers as Satans… Conspiracy theories won’t get us anywhere.”\n“Why are you angry? May be because you have nothing to back up your claims with?”\nNot sure why you have to focus on accusing me of being angry. I admit, I don’t like being BS’d though and give short shrift to those who engage in it — not saying you’re doing that, but constantly accusing people of things they’re not doing really isn’t.. cool dude. It kinda makes you look bad and discredits you. Not sure I’ll respond to you if you keep doing it. Also, exactly what claims am I making without back up?? Please back this accusation up.\n““Quoting the bible to such wont make much difference” …..Neither to you my friend, so I won’t even bother.”\nAnd can you provide some proof for your opinion as I did mine, friend?\nIt’s duly noted how you responded to my request to not accuse me with many more accusations. I’m beginning to think you really like the Accuser title, like a son proudly bearing the family mark of his father perhaps.\n\n","date":"March 11, 2014 at 3:14 am","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","id":"comment-87243","author":"EGM","site":"shroudstory"},{"title":"Stephen Jones Persists with the Hacker Theory","post":"EGM,\nI will make this short because I am heading to work.\nI am happy you are not angry. As to “backing up my claims”, what claims?, The onus is on you and Stephen to prove your case. I haven’t seen any evidence yet, have you?\nThe whole case is like a boring 007 movie. With covert KGB agents and calculator hacking. Why should I give you any evidence when I am not the one coming up with the outlandish claims.\nSorry, I missed your DSM joke, I usually don’t miss good ones.\nI never claimed to be an expert and never insulted anyone, Can you quote me please when you accuse me of such things?\nAnd as for the claim that I am the son of the “accuser” I would say…”God bless you” since Jesus taught me to bless those who curse me. He knows my heart, and yours. I am always happy with His judgement, sorry, I don’t care about yours.\n\n","date":"March 11, 2014 at 7:49 am","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","id":"comment-87322","author":"Mike M","site":"shroudstory"},{"title":"Stephen Jones Persists with the Hacker Theory","post":"Karol Jozef Wojtila as John Paul II was pope from 1978 until his death in 2005. His canonization is set down to occur on April 27, 2014.  He had a significant part in the eventual downfall of Soviet communism, commencing in his own homeland of Poland. He was therefore an effective enemy of the Soviet regime and all it stood for, and of course the C14 dating of the Shroud occurred during his pontificate. But there is a simpler solution of why the C14 dating failed to realize a date consistent with a first century provenance, That is of course the non-representative sampling and the likelihood that the samples taken were from a patch different from the main cloth.\n\n","date":"March 8, 2014 at 3:15 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","id":"comment-86288","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Stephen Jones Persists with the Hacker Theory","post":"Right… for sure an anomalous testing area is prima facie.\n\n","date":"March 8, 2014 at 8:38 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","id":"comment-86358","author":"Annette Cloutier","site":"shroudstory"},{"title":"Stephen Jones Persists with the Hacker Theory","post":"Like!\n\n","date":"March 9, 2014 at 12:21 am","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","id":"comment-86424","author":"clublu22014","site":"shroudstory"},{"title":"Stephen Jones Persists with the Hacker Theory","post":"Hello. I’m new to the site and enjoy your posts and debates!\nI heard a few years back where Schwortz commented about a financial benefit for the University if the Carbon 14 results were within the Window however, it wasn’t expanded due to the political repercussions.\nI think personally the sample was unintentionally tainted from prior restorations… and maybe it was meant to be, just like finding the missing factor in life, Christ’s existence, the Bibles authenticity, animals that defy physics and so forth. It’s amazing all of these unrelated mysteries coincide, pointing directly to the creator, but yet also leaves a gap to be filled with faith, by choice.\nJen X, Ohio\n\n","date":"March 8, 2014 at 6:43 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","id":"comment-86331","author":"jenx","site":"shroudstory"},{"title":"Stephen Jones Persists with the Hacker Theory","post":"Jenx, I agree, one of the most puzzling bible verses to me, yet most beautiful at the same time. Luke 10:21 ” At that time Jesus, full of joy through the Holy Spirit, said, I praise you, Father, Lord of heaven and earth, because you have hidden these things from the wise and learned, and revealed them to little children. Yes, Father, for this is what you were pleased to do.” Why would God hide His knowledge, and why would Jesus Rejoice in that… For the same reason you mentioned (the missing factor). God doesn’t want a genius with the wrong ( prideful) heart to find him only based on evidence. He would rather have a simple minded person with the right (humble) heart. So there will always be room for the doubters to doubt, there will never be 100% proof for God for the unwilling heart to believe.. Just indications/signs for the willing heart.\n\n","date":"March 8, 2014 at 6:59 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","id":"comment-86336","author":"Mike M","site":"shroudstory"},{"title":"Stephen Jones Persists with the Hacker Theory","post":"With all respect, I believe in this particular passage, Christ was praising God for the mysteries which had been revealed to the disciples (who were childlike) and not so for the Scribes and Pharisees (who rejected Christ’s teachings and the significance of His deeds). With a cross reference in Lk 8:10 and further in Mt 11:25-27.\nI can relate to this passage too. During my university years I began to think too deeply for scientific answers which made me question my original faith. Only when I submitted to my childlike state could I find the answers. Which in itself is another mystery! They’re everywhere! Lol.\nBut too, this is just what “I” see in the scripture. I believe the Bible is a personal gift to each of us as individuals with different passions (and translations) to help us through our time on earth. And as followers in Christ we respect that individualism and unite through our actions and love.\n\n","date":"March 8, 2014 at 9:44 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","id":"comment-86374","author":"jenx","site":"shroudstory"},{"title":"Stephen Jones Persists with the Hacker Theory","post":"Jenx, thanks for the cross references, you are absolutely right.\n\n","date":"March 8, 2014 at 10:59 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","id":"comment-86390","author":"Mike M","site":"shroudstory"},{"title":"Stephen Jones Persists with the Hacker Theory","post":"Or…. there would be a lot of scandals at the daycares. ha!\n\n","date":"March 8, 2014 at 11:33 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","id":"comment-86406","author":"jenx","site":"shroudstory"},{"title":"Stephen Jones Persists with the Hacker Theory","post":"Like!\n\n","date":"March 8, 2014 at 8:40 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","id":"comment-86359","author":"clublu22014","site":"shroudstory"},{"title":"Stephen Jones Persists with the Hacker Theory","post":"If the Lord has revealed the secrets of the Shroud to mere children I wish we knew which ones…\n\n","date":"March 8, 2014 at 7:06 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","id":"comment-86338","author":"Hugh Farey","site":"shroudstory"},{"title":"Stephen Jones Persists with the Hacker Theory","post":"Hugh, I think that was tongue in cheek. If not, Jesus, in the context of this verse, wasn’t talking about children. He was referring to His seventy two disciples who just came back successful from their first mission. They were mostly simple minded people with no resources (bag, sandal or purse) sent like “lambs among wolves”.\n\n","date":"March 8, 2014 at 7:18 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","id":"comment-86343","author":"Mike M","site":"shroudstory"},{"title":"Stephen Jones Persists with the Hacker Theory","post":"Ah! My mistake. I’m a teacher and have been interrogating my pupils…\n\n","date":"March 8, 2014 at 7:20 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","id":"comment-86344","author":"Hugh Farey","site":"shroudstory"},{"title":"Stephen Jones Persists with the Hacker Theory","post":"LOL… Hopefully nobody was hurt :-)\n\n","date":"March 8, 2014 at 7:21 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","id":"comment-86345","author":"Mike M","site":"shroudstory"},{"title":"Stephen Jones Persists with the Hacker Theory","post":"I have recently received an email from Timothy Jull, regarding the hacking hypothesis. Its text, in its entirety, runs:\n“This is impossible. In our case, the software for the calculations is offline. In any case, the calculation does NOT require software, it was done offline and plotted on a graph, as I recall.\nIndeed, in 1988 the internet (as we know it today) didn’t exist – there was a pre-existing network run by the US government which was quite restricted.\nAnyway, the machine we used at that time couldn’t have been attached to it, and that one still isn’t.”\n\n","date":"March 9, 2014 at 4:54 am","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","id":"comment-86477","author":"Hugh Farey","site":"shroudstory"}]
