[{"title":"\nSidestrip #5: The evidence is overwhelming that the Turin Shroud is authentic! \n","post":"\n\nAnonymous>Greetings! I found the following post by \"Hugh Farey\" over at Dan's blog regarding this blog entry and thought you might like to address it: ...No. As I stated as recently as 20 August 2015, posting comments on my blog for the purpose of providing discussion on Porter's blog is off-topic:==================================You may not be aware that since November 4, 2014 it has been my policy that:\"... mentioning of Dan Porter, and his blog, and his blog's members in connection with Porter's blog, is henceforth off-topic on my blog.\"I further advised of this policy in my comments of: November 14, 2014; November 16, 2014; and May 31, 2015My reason is given in my November 16 comment that I don't want to provide `grist for the mill' of Porter's blog:----------------------------------\"As I have stated ... it is my policy ... that: `... mentioning of Dan Porter, and his blog, and his blog's members in connection with Porter's blog, is henceforth off-topic on my blog.' ... This includes you [Porter] , or your members, making comments on my blog for the purpose of providing `grist for the mill' of your blog.----------------------------------Which in turn is based on my objection stated in my post, of May 8, 2014: \"`The Letter from Alexius Comnenus': My response to Dan Porter,\" that \"Porter is a pirate who steals the hard work and intellectual property of others\" including me:----------------------------------\"Again Porter has scavenged my work, rather than do original work of his own. As I have said before, ... Porter is a pirate who steals the hard work and intellectual property of others ... But Porter is evidently untroubled by the ethics of parasiting off the work of others, despite it being against their expressed wishes, to feed his `gossip column' blog.\"----------------------------------My policy above is aimed at preventing Porter and his readers from starting a comments debate on my blog and then cross-posting it to Porter's blog, to provide `grist for its mill'.==================================Except to say that Farey, a mere science teacher, contradicts ancient textiles conservator Mechthilde Flury-Lemberg's statement that the stitching of the seam joining the sidestrip and the main body of the Shroud is closely similar, if not identical, to that found at Masada. As Farey himself stated according to you: \"As it happens, I don't agree with some of Flury Lemberg's interpretations.\" So if anyone choose to believe Farey over against Flury-Lemberg that's THEIR problem.Here are the sources I based the Masada part of my \"Sidestrip\" entry above on. First was Ian Wilson's eye-witness report of what Flury-Lemberg said at the 2000 Turin Symposium (my emphases):\"The first speaker was Dr. Mechthild Flury-Lemberg ... But even more importantly, Dr. Flury-Lemberg found the cloth's finishing, at its hems, and in the joining seam to have been done using an unusual type of stitching very nearly invisible on one side, and as such CLOSELY RESEMBLING THAT OF ANCIENT JEWISH TEXTILES AS FOUND AT MASADA, THE JEWISH PALACE-FORTRESS THAT WAS OVERTHROWN BY THE ROMANS IN AD 73, NEVER TO BE OCCUPIED AGAIN. This alone, therefore, constitutes powerful evidence against the carbon dating result of 1988. As Dr. Flury-Lemberg told the Sunday Times 'In my opinion the Shroud is not a mediaeval fake. The parallels I have found indicate that it could have existed at the same time as Jesus Christ and in what is now Israel.'\" (Wilson, I., 2000, \"`The Turin Shroud – past, present and future', Turin, 2-5 March, 2000 – probably the best-ever Shroud Symposium,\" BSTS Newsletter, No. 51, June).  [continued]\n\n","author":"Stephen E. Jones","date":"September 12, 2015 at 10:39 PM","url":"http://theshroudofturin.blogspot.com/2015/08/the-evidence-is-overwhelming-that-turin.html","site":"moore"}]
