[{"title":"\nThe man on the Shroud #8: The evidence is overwhelming that the Turin Shroud is authentic! \n","post":"\n\nStephen... youclaim that the shroud is genuine,  yet this is contrary to scripture which surely must be the final authoratative evidence.  The shoroud is a complete body image, that is, in direct contact with the body... but Scripture indicates this cannot possibly be the case as the body of Jesus was wrapped in TWO seperate pieces of cloth, one described as linen, which was wrapped around the torso & legs, the other a 'cloth' wrapped around the head. according to John 20:7 (NIV)  'as well as the cloth that had been wrapped around Jesus' head. The cloth was still lying in its place, separate from the linen.'Some versions decribe the body cloth as 'bandages' or strips... not one continuous peice of cloth as the shroud is. Having personally seen the shroud in Turin a few years ago i can agree that it is a fascinating artefact. but NOT the shroud of Jesus... They dont even know where the real tomb is.... and NOTHING pertinent to the crucifixion or the Burial has survived. Anyway it is totally irrelevant.... as the Anges said, 'He is not here...He is risen' and that initself is far more important and relevant  than any piece of cloth. how is the Shoud in any way relevant to the Gospel.?  Focus on Jesus. 'The Author & finisher of our Faith' Keep the main thing.... the main thing.Blessings! BobM.\n\n","author":"Bob Mullins","date":"April 23, 2018 at 8:01 PM","url":"http://theshroudofturin.blogspot.com/2015/12/the-man-on-shroud-8-evidence-is.html","site":"moore"},{"title":"\nThe man on the Shroud #8: The evidence is overwhelming that the Turin Shroud is authentic! \n","post":"\n\nBobThanks for your comment. I am very busy with my current post, so I will reply to your comment when I have time.In the meantime, see my post of 11 July 2012: \"`according to John chapter 20, Jesus was wrapped in linen cloths (plural) ... If Scripture is correct ... lets throw out the shroud'\" in response to a comment of 31 May 2012 under my post, \"My critique of `The Pray Codex,' Wikipedia, 1 May 2011,\" where a reader made the same logical error as you, that if there were two (or more cloths) in the Tomb, one of them cannot be the Shroud. Stephen E. Jones----------------------------------MY POLICIES. Comments are moderated. Those I consider off-topic, offensive or sub-standard will not appear. Except that comments under my current post can be on any one Shroud-related topic without being off-topic. To avoid time-wasting debate I normally allow only one comment per individual under each one of my posts.\n\n","author":"Stephen E. Jones","date":"April 23, 2018 at 11:08 PM","url":"http://theshroudofturin.blogspot.com/2015/12/the-man-on-shroud-8-evidence-is.html","site":"moore"},{"title":"\nThe man on the Shroud #8: The evidence is overwhelming that the Turin Shroud is authentic! \n","post":"\n\nBobI decided to respond to your comment as a separate post. See under the \"Comments\" section of my April 2018 Shroud of Turin News.The first installment of the post should appear tomorrow, 8th May 2018, under the title, \"`you claim that the shroud is genuine, yet this is contrary to scripture'\"I will confirm below with a link to it when that first installment it is posted.Stephen E. Jones\n\n","author":"Stephen E. Jones","date":"May 7, 2018 at 11:57 PM","url":"http://theshroudofturin.blogspot.com/2015/12/the-man-on-shroud-8-evidence-is.html","site":"moore"},{"title":"\nThe man on the Shroud #8: The evidence is overwhelming that the Turin Shroud is authentic! \n","post":"\n\n>I will confirm below with a link to it when that first installment ... is posted.Bob, here is the link to my reply post, \"'you claim that the shroud is genuine, yet this is contrary to scripture',\" to your comment above.Any comments on this should now be under that post.Stephen E. Jones\n\n","author":"Stephen E. Jones","date":"May 9, 2018 at 9:28 AM","url":"http://theshroudofturin.blogspot.com/2015/12/the-man-on-shroud-8-evidence-is.html","site":"moore"}]
