[{"title":"Stephen E. Jones Starting a New Series of Posts","post":"When it will be time to talk about the Sudarium, I hope M. Jones will be more honest than Miss. Bennett and adress the very problematic issue of the two C14 dating that were done on the cloth in 1990 and 1992 (this lady made a presentation on the Sudarium in Panama this year and don’t even said a word about that !) and which gave these results : \nThe first time (in 1990), two different C14 labs did the testing and gave two pretty close results of 642-869 (middle date of 756) for one (Tucson, Arizona) and 653-786 (middle date of 720) for the other (Toronto, Canada). The second time (in 1992), the C14 testing was only performed by the Arizona lab and gave a result of 540-754 (middle date of 647). Finally, it should be noted that the average date for these two series of tests is 708, which correspond to a time when Constantinople had become the capital of the false relics of Christianity, especially those associated with Jesus Passion.\nI also hope that M. Jones will talk about the complete absence of information concerning the level of bilirubin that was found in the blood samples from the Sudarium that were analyzed by Baima Bollone and maybe by some other medical experts.  NOWHERE I have been able to find any information about that and I found this very strange because, in my opinion, if there’s a good “match” between the level of bilirubin that was found in the blood of the Sudarium and the very high level (much higher than normal) that was found by Adler in the blood of the Shroud, this would be an even better piece of evidence that both cloths have really covered the same head.  But on the other hand, if the level of bilirubin that was found in the blood of the Sudarium is simply “normal” or “standard”, then I think this would be a very important piece of evidence to show that the Sudarium is probably a false relic that was created with the use of a real crucified body other than Jesus…  Effectively, since both cloths are supposed to have covered the same bloody head one after the other, WE SHOULD EXPECT TO GET A LEVEL OF BILIRUBIN FOR THE SUDARIUM THAT WOULD BE VERY CLOSE TO THE ANOMALOUSLY HIGH LEVEL THAT WAS FIND BY ADLER ON THE SHROUD.  \nDON’T YOU AGREE WITH ME THAT THIS TOTAL LACK OF INFORMATION CONCERNING THE LEVEL OF BILIRUBIN THAT WAS FOUND IN THE BLOOD OF THE SUDARIUM IS VERY BIZARRE (TO SAY THE LEAST) ???\nI have tried to contact Baima Bollone directly by email on 2 different occasions about this in order to know the result he obtained and I never get any reply from him.  I have also made numerous attemps elsewhere to find the correct result of bilirubin for the Sudarium (I even contact the Spanish Centro) and NEVER WAS ABLE TO GET AN ANSWER !!!!  \nStrange you say ???  You bet !!!\nSo, if someone out there know the truth about the level of bilirubin that was found in the blood from the Sudarium, please tell us the truth !!!!  In my mind, this could be one of the most important piece of evidence concerning the question of whether or not this cloth have been used on the same bloody head than the Shroud.\n\n","date":"October 12, 2012 at 10:47 am","url":"https://shroudstory.com/2012/10/12/stephen-e-jones-starting-a-new-series-of-posts/","cat":"other_blogs","id":"comment-17545","author":"Yannick Clément","site":"shroudstory"},{"title":"Stephen E. Jones Starting a New Series of Posts","post":"Great news. So now he will no longer aim his quotes at a specific person, in an attempt to ‘refute’ him, he will simply quote because he likes to. He has nothing new to say, but he has nothing better to do either.\n\n","date":"October 12, 2012 at 1:40 pm","url":"https://shroudstory.com/2012/10/12/stephen-e-jones-starting-a-new-series-of-posts/","cat":"other_blogs","id":"comment-17552","author":"Davor Aslanovski","site":"shroudstory"},{"title":"Stephen E. Jones Starting a New Series of Posts","post":"Nothing new to say ?  If M. Jones or anyone else in the Shroud world can finally address the issue of the unknown level of bilirubin regarding the blood on the Sudarium and his unknown degree of congruence with the abnormally high level of bilirubin found by Adler for the blood on the Shroud, I think that will definately be something NEW…\n\n","date":"October 12, 2012 at 4:08 pm","url":"https://shroudstory.com/2012/10/12/stephen-e-jones-starting-a-new-series-of-posts/","cat":"other_blogs","id":"comment-17558","author":"Yannick Clément","site":"shroudstory"},{"title":"Stephen E. Jones Starting a New Series of Posts","post":"And I somehow think Jones hadn’t conducted any recent research in that, or any other, area. Ergo, I expect he has nothing new to say. As is the case with most people who imagine they are involved in Shroud ‘studies’.\n\n","date":"October 12, 2012 at 5:16 pm","url":"https://shroudstory.com/2012/10/12/stephen-e-jones-starting-a-new-series-of-posts/","cat":"other_blogs","id":"comment-17561","author":"Davor Aslanovski","site":"shroudstory"},{"title":"Stephen E. Jones Starting a New Series of Posts","post":"Yannick; your attack on Miss Bennett is definately not warranted. As she was refering to Guscin’s investigations on the C14 from his previously written book; ‘The Oviedo Cloth’.  I haven’t read Guscin’s book myself, so I cannot make any comments to it…As for the C14 tests you mention, none of these were reliable! Mario Maroni had sent two labs (Tuscon, Toronto) samples he acquirred, which Max Frei had taken, in 1979. These tests were performed in 1994, …thats 15 years later! The condtions in which the samples were stored was not known, the tests were done without authorization or tracking. Plus there was a myriad of issues pertaining to ALL the C14 tests done, too long to list here…It is pretty clear none of the C14 tests done are of any ‘serious scientific value’…Incidently, Dr. Jull, when questioned by Guscin pertaining to the testing, made a very enticing statement; “in order to produce a radiocarbon date on any paticular material, it is important that the origin of the samples be known and clearly stated to the laboratory.” ….Origin?, …provenance…Ring a BELL? The C14 tests done on the Sudarium are completely irrelevant, period.\nMoving along to your question on Bilirubin, Mr Jones can only repeat what he would read from Guscin’s or Bennett’s writings, because as far as I know he has no access to the EDICES papers and cannot read Spanish, so don’t expect any new announcements. ;-)  Miss Bennett on the other hand can translate Spanish quite well, but did state in her book that much of the EDICES reports were of a very ‘technical’ nature and she would keep her writings to a more understandable level for her readers.\nI have a question for you on the whole Bilirubin thingy; Are you a medical expert? It would seem to me that you are assuming the postmordem 1part blood, 6 parts serum liquid found on the cloth would contain bilirubin? Would it?…We need an expert here to answer that question as I am no expert and definately am not so sure about it. We also cannot know whether bilirubin is mentioned or not in the EDICES studies, or if they had studied all blood samples found on the Sudarium. So until EDICES releases a properly translated document, which the experts on this issue can review, we’ll have to wait, just as in so many other things pertaining to the Shroud studies.\nR\n\n","date":"October 12, 2012 at 8:08 pm","url":"https://shroudstory.com/2012/10/12/stephen-e-jones-starting-a-new-series-of-posts/","cat":"other_blogs","id":"comment-17570","author":"Ron","site":"shroudstory"},{"title":"Stephen E. Jones Starting a New Series of Posts","post":"What I said concerning Miss Bennett was a well-deserved critical point of view versus her paper, which was only showing one side of the coin.  Each time I see papers like that, it always raised the “propaganda” flag in my head !\nConcerning the bilirubin, the good match I expect would come from the blood that was known to have been shed in life and not from the post-mortem blood that supposedly came out of the nose and mouth in a 1 to 6 proportion with a clear liquid.  There are enough bloodstains on the Sudarium that are known to have come from a pre-mortem blood transfer to easily verify if there is, yes or no, a similar high level of bilirubin in that blood than in the blood samples from the Shroud analyzed by Adler. Remember that Adler have clearly said that the bilirubin level in the blood from the Shroud was not only higher than normal, but much higher than normal (very abnormal if you will)…\nAs I said, I have made a long inquiry about that and came out completely EMPTY, which is NOT NORMAL AT ALL !  We constantly read the very good match between the AB blood from the Shroud and from the Sudarium and there is NOTHING NOWHERE about the degree of matching that was found by Baima Bollone and other medical experts who have studied the blood from the Sudarium !  I repeat :  THIS IS VERY STRANGE in my mind…  I don’t necessarily pretend that there is a cover up by the Spanish Centro on that particular question but I questioned the fact that we are left in total darkness concerning this most important topic versus the question of whether or not the Sudarium have cover the same bloody head than the Shroud.  Look, it’s been a while now (maybe 15 years if I recall well) since the first blood study was done on the Sudarium !  THIS IS WELL ENOUGH FOR SOMEONE LIKE MARK GUSCIN OR ANOTHER SCHOLARS TO HAVE TRANSLATE SOMETHING ABOUT THAT !  And nevertheless, there’s still NOTHING AT ALL WE CAN FIND ANYWHERE !!!  Strange you say ?  YOU BET !  It’s even shady in my mind…\n\n","date":"October 14, 2012 at 5:17 pm","url":"https://shroudstory.com/2012/10/12/stephen-e-jones-starting-a-new-series-of-posts/","cat":"other_blogs","id":"comment-17635","author":"Yannick Clément","site":"shroudstory"},{"title":"Stephen E. Jones Starting a New Series of Posts","post":"It is a book that she has written Yannick, not a paper. In doing so she is trying to deliver information derived from the EDICES extensive studies. Of course the information is going to be one-sided, to expect otherwise is naive. You seem to ‘expect’ and ‘assume’ alot in your mind. We don’t have a full report on the EDICES findings, do I find this STRANGE, no. It’s not any different then alot of unpublished information out there. Now to assume the life blood which can be found on the Sudarium (and not in huge quantities, I would add) would or could be tested properly for bilirubin is another thing. Do you know for sure the blood is not degraded or that the EDICES actually looked for bilirubin? If you were to ‘properly’ examine all the evidence on the Sudarium, you wouldn’t be so quick to report it as a fake. It’s obvious to me you are biased in your study of the artefact from your comments.\nR\n\n","date":"October 18, 2012 at 7:31 am","url":"https://shroudstory.com/2012/10/12/stephen-e-jones-starting-a-new-series-of-posts/","cat":"other_blogs","id":"comment-17785","author":"Ron","site":"shroudstory"},{"title":"Stephen E. Jones Starting a New Series of Posts","post":"Sorry typo; should read as ‘postmortem’ 1 part blood, 6 parts serum.\nR\n\n","date":"October 12, 2012 at 8:15 pm","url":"https://shroudstory.com/2012/10/12/stephen-e-jones-starting-a-new-series-of-posts/","cat":"other_blogs","id":"comment-17571","author":"Ron","site":"shroudstory"},{"title":"Stephen E. Jones Starting a New Series of Posts","post":"Suggestion: There could well be a crucial question of timing in the whole death trauma, as to when the bilirubin levels in the blood changed from normal.  As I understand it, the head cloth could well be placed over the head at some time during the crucifixion to hide the condemned person’s face and his grimacing from passersby – I think there might be something in Jewish Law about it.  It could well have been removed during the laying out, the jaw cloths then placed and tied together with any other tying then done, and the body then shrouded and wrapped.  Max Patrick Hamon would have some ideas about the whole wrapping business, but a medical expert would need to comment on the timing of bilirubin variations.  Because of these timing variations, it is quite possible that both sudarium and shroud might show different bilirubin levels.  But it’s all very conjectural.\n\n","date":"October 13, 2012 at 12:17 am","url":"https://shroudstory.com/2012/10/12/stephen-e-jones-starting-a-new-series-of-posts/","cat":"other_blogs","id":"comment-17575","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Stephen E. Jones Starting a New Series of Posts","post":"Well David according to the Edices study/experiments of blood patterns,  the Sudarium was first placed about the head approx one hour ‘after’ death occurred, and this fits with Jewish law in that the face of the ‘deceased’ should be covered inlight of the sensativities of the family and passers-by. But only after death, from what I understood. Also according to these studies the sudarium was completetly removed from the head approx 2.5 hours later. One would think the onslaught of the scourging alone, have brought about increased bilirubin levels, so bascially at an early stage of the passion. But I am no expert, although I believe I have read that precise statement in my research.\nR\n\n","date":"October 13, 2012 at 5:41 am","url":"https://shroudstory.com/2012/10/12/stephen-e-jones-starting-a-new-series-of-posts/","cat":"other_blogs","id":"comment-17581","author":"Ron","site":"shroudstory"},{"title":"Stephen E. Jones Starting a New Series of Posts","post":"Ron, I don’t recall having read that the Sudarium would have been placed one hour after death.  I think you’re wrong about that.  As I recall, the Centro’s conclusion indicates that it was placed very shortly after death occured and it stayed in contact with the head for 2 hours (not 2.5 hours).  I just wanted to set the record straight about that.\nNevertheless, I confirm that you’re right about the fact that the level of bilirubin for the Shroud man would definately have started to rise high during the very violent scourging that he suffered.  No question about that.  So, on that simple factual base, we can say to Daveb :  Well try my friend but you’re hypothesis cannot explain a possible discrepancy (since we don’t know the result about that, we have to stay prudent here) between the level of bilirubin that was found on both cloths…  \nI have asked Kelly Kearse to give me his opinion in the case there would really be a very strong discrepancy and he told that bilirubin was pretty sensible to degradation depending on environmental factors.  Then, after I raised the fact that bilirubin was surely not so easily degradable because it is a proven fact that it was able to survived pretty well in the blood of the Shroud, even though we know that cloth was not always preserved well and even survived a big fire in 1532, he told me this, which is a pretty good answer : “It’s not that bilirubin is so unstable & that it’s so subject to degradation, it’s just something to keep in mind as a possible variable. Clearly, Heller & Adler detected bilirubin in the Shroud samples, so it was able to survive whatever environmental factors the cloth has been exposed to. The Shroud has been, of course, exposed to fire throughout its history-it is difficult to say exactly what effect this may have had on certain areas of the cloth & any proteins/glycoproteins that are found there. Being folded, the intensity of the heat was most likely not uniform throughout, similar to a house burning down, but certain articles surviving. The variables throughout the histories of the Shroud & the Oviedo are a great unknown. In many respects, it may be difficult to achieve a side-by-side comparison for certain aspects of the cloths. I think it’s worth a try, but the most meaningful would be analysis using exactly the same method(s), with something to normalize to. As bilirubin has been reported to relatively sensitive to photolysis, it’s something to keep in mind, especially given the many unknowns of the conditions the cloths may have been subject to. It’s not as though the sample was applied to the same piece of material and torn in half, to be pieced together years later.”\nBut in the end, if there really is a big discrepancy between the blood of the Sudarium and the blood of the Shroud (we’re not there yet, so the “if” is important), that would be a fact that would have to be considered as a piece of evidence AGAINST the idea that both cloths really covered the same head.  But in the end, as M. Kearse once told me, the most important test that could be made would be a comparative DNA study between the Shroud and the Sudarium.  Because the DNA is badly degraded on both cloths, maybe a proper comparative DNA study would be impossible, but it’s surely worth a try…\nTo conclude on the question of the bilirubin level on the Sudarium, I just want to ask again the help of anyone who will read this in order to finally find the correct answer about that !  So, if someone know something about the bilirubin level that was found in the blood of the Sudarium, please, tell us the truth !!!!  THANKS !\n\n","date":"October 14, 2012 at 6:40 pm","url":"https://shroudstory.com/2012/10/12/stephen-e-jones-starting-a-new-series-of-posts/","cat":"other_blogs","id":"comment-17638","author":"Yannick Clément","site":"shroudstory"},{"title":"Stephen E. Jones Starting a New Series of Posts","post":"Here’s an additional comment concerning the 2 C14 dating of the Sudarium that were done on sub-samples coming from one main sample in 1990 and 1992 :\nI disagree with Ron and others who pretend these dating must be rejected.  I would not disagree to question these dating because they were unofficially done and in not optimal conditions or to consider the sample used doubtful because it was taken a long time before the dating (15 years or so), but I think it would not be scientific to reject completely these dating. I think this would be a big mistake and in the end, it would denote an evident bias.\nAfter all, the 2 sets of results were not incoherent. That’s a very important point to note ! On that particular subject, here’s the opinion of Timothy Jull from the Arizona C14 lab that did the 2 series of dating in 1990 and 1992 : “The two results… do not appear to me to be in disagreement. The ages are to my mind in agreement. One always gets some scatter between different measurements, although I agree it could be a little better in this case. I suppose it is possible that there is a small offset in the two ages due to the second having been heated, but the conditions you describe seem to me to be\ntoo low to have any great effect. We have material remaining from these samples, if there is some further question about the measurements.”\nThis opinion from an expert like Jull just confirms what I just said about the fact that these 2 dating results are not incoherent…\nThe other very important thing to note, of course, is the fact that, on the contrary to the Shroud dating of 1988, there is absolutely no solid scientific evidence of a contamination of some kind that would enable us to discard it.  \nSo, I think the best way to consider these 2 unofficial dating of the Sudarium is to think of them as 2 “preliminary results” that seems, at first sight, to indicates that MAYBE the Sudarium is a false relic of Christ made around 700 A.D. And the other very important thing to consider (for the Church at least) is that another official C14 dating done more properly MUST be performed in order to compare the result with these 2 preliminary results in order to evaluate correctly the real scientific value of these preliminary results.  For the moment, I really think this is the best way to interpret these 2 C14 dating that were done in 1990 and 1992, and I would have like to see Miss Bennett say something about that in his paper…\nOf course, if someone could show some solid scientific evidence of contamination for the main sample that was used to date the cloth in 1990 and 1992, this would completely change the way to see these preliminary results, but so far, there’s nothing of that nature !  We should avoid thinking that because the Shroud’s dating of 1988 is certainly incorrect due to a probable repair or mending of the sampled corner that great doubts must necessarily be cast upon all the other C14 dating that were done (officially or not) for other cloths associated with Jesus Christ !  Thinking that way would be wrong.  Totally and scientifically wrong. \nBut in the end, I agree that a new dating done more properly should be done in the case of the Sudarium.  I don’t understand why the Church have not done it yet !  Do they fear that the result would come out roughly the same as these 2 preliminary tests ? It’s possible…\n\n","date":"October 15, 2012 at 10:51 am","url":"https://shroudstory.com/2012/10/12/stephen-e-jones-starting-a-new-series-of-posts/","cat":"other_blogs","id":"comment-17662","author":"Yannick Clément","site":"shroudstory"},{"title":"Stephen E. Jones Starting a New Series of Posts","post":"The Shroud is not part of the deposit of faith and the Creed does not say ” and was buried wrapped in the Turin Shroud.” John Paul II left the question of authenticity to science and it is not the Church that is to be blamed if part of the science left many things to be desired. Above all, even if the Shroud is proved to have wrapped the body of Jesus, and the Resurrection can indirectly be observed on the relic, there would still be a lot of questions to answer  — but nothing to do with the Shroud.\n\n","date":"October 15, 2012 at 9:38 pm","url":"https://shroudstory.com/2012/10/12/stephen-e-jones-starting-a-new-series-of-posts/","cat":"other_blogs","id":"comment-17671","author":"Louis","site":"shroudstory"},{"title":"Stephen E. Jones Starting a New Series of Posts","post":"The problem of the Vatican versus the relics associated with Christ is that it has left the local churches who are the safekeepers of these cloths take all the important decisions and most of the time, they were bad decisions.  What would been much better from the beginning is that the Vatican would have create a commission of experts from all the necessary fields (including archaeologists and biochemists) to make a global study (that would have included a comparative study) of all these relics at the same time and gives the supervision of this to only one single organism like the Pontifical Academy of Science.  This would have probably prevent all the mess that happened in the past versus the Shroud (the C14 dating and the 2002 restoration) and no doubt that today, we would have a much better global view of the situation regarding these relics and the correct level of probability concerning their potential authentiticity…  No doubt also that the sum of data concerning these relics would be higher and more solid.  In the end, it’s never too late and the Vatican should really consider to create a scientific commission that would analyze them side by side.\n\n","date":"October 16, 2012 at 10:39 am","url":"https://shroudstory.com/2012/10/12/stephen-e-jones-starting-a-new-series-of-posts/","cat":"other_blogs","id":"comment-17700","author":"Yannick Clément","site":"shroudstory"},{"title":"Stephen E. Jones Starting a New Series of Posts","post":"The Shroud is of secondary importance to the Church. And why is that so? Because its stand has always been that it was the risen Christ — and not any relic — that was the difference and provided the courage needed by the first Christians to face lions, be crucified upside down, be flogged in synagogues and so forth. It is not all difficult to understand this if one goes beyond the Shroud to concentrate on biblical studies and theology. The last sentence of the previous comment has something to do with this.\nMuch more cooperation is needed in Shroud studies if the Church is to create a commission that can supervise and select the relevant material and hand it over to the Pontifical Academy of Science for analysis and it is they who will judge what should reach the Pope’s desk.\nIt is clear that Jesus said some things that could be interpreted as “Take it or leave it” and that, and not any relic, is apparently what Christians should concentrate on.\n\n","date":"October 16, 2012 at 5:55 pm","url":"https://shroudstory.com/2012/10/12/stephen-e-jones-starting-a-new-series-of-posts/","cat":"other_blogs","id":"comment-17726","author":"Louis","site":"shroudstory"},{"title":"Stephen E. Jones Starting a New Series of Posts","post":"The problem in the Catholic church versus the relics is that the Vatican has let the relic thing to the local churches who makes big money on the back of pilgrims and tourists with, most of the time, false relics…  If I was the Pope, I would create a scientific commission with only one purpose :  to verify the probability of authenticity of all the relics supposedly associated with Christ (and maybe some other important relics supposedly associated with the virgin Mary or other important saints).  And each time there would be solid and confirmed scientific facts that would clearly show that such and such relics cannot be authentic, I would ordained these things to get out of the church where they are kept and give them to art museums or appropriate places like that.  I would only keep those who have good chances to be genuine (and I’m sure there are very rare). We’re not in the Middle Ages no more and in my mind of liberal catholic, I don’t see any good reason (not even an economical one !) that some local churches would keep and venerated a relic if it is scientifically proven that it is false !!!  That’s why I hope the Vatican will ends up making a very good clean-up concerning this very “dirty” issue of the relics !!!!\n\n","date":"October 17, 2012 at 10:39 am","url":"https://shroudstory.com/2012/10/12/stephen-e-jones-starting-a-new-series-of-posts/","cat":"other_blogs","id":"comment-17745","author":"Yannick Clément","site":"shroudstory"},{"title":"Stephen E. Jones Starting a New Series of Posts","post":"To Yannicks comments; “Ron, I don’t recall having read that the Sudarium would have been placed one hour after death. I think you’re wrong about that. As I recall, the Centro’s conclusion indicates that it was placed very shortly after death occured and it stayed in contact with the head for 2 hours (not 2.5 hours). I just wanted to set the record straight about that.” -Try reading a little closer in the future….\nBennett pg74, pt6; “On the lower part of the left edge of the cloth are a series of stains which correspond to puncture wounds, produced while the man was still alive and [which shed blood approximately one hour before the linen was placed on them].” …para mine.\nFrom the paper; Comparative Study of the SoO and the SHroud of Turin, III International Congress, June 1998; Mareno, Villilian.\nPt7; “At the bottom of the back of the head, there is a series of wounds produced in life by some sharp objects. These wounds HAD BLED an HOUR before the cloth was placed on top of them.”\nThis clearly means liveblood stopped flowing approximately one hour before the Sudarium was placed on the head…As any blood flow would stop flowing with the advent of death and the heart pumping…simple deduction and reasoning. \nAgain it seems, you Yannick, read or obsorb only what you want to.\nAs to your statements on the C14 and Jull’s comments; Lets please try reading that section again and try being a little more HONEST about the context of the comments and the actual serious lack of protocols, and the true nature of the samples being as they were in a gaseous state in viles, which the lab themselfs claimed were “leaking air”. Again, no serious thought can be placed on those apparent C14 tests or the fact they were comparable whatsoever or can they be thought as a ‘preliminary finding’. Your bias again shows up in spades here as it does with your whole Wilson castration, which holds no logic.\nR\n\n","date":"October 18, 2012 at 8:00 am","url":"https://shroudstory.com/2012/10/12/stephen-e-jones-starting-a-new-series-of-posts/","cat":"other_blogs","id":"comment-17789","author":"Ron","site":"shroudstory"},{"title":"Stephen E. Jones Starting a New Series of Posts","post":"Ron, what do you do with this particular conclusion taken from the same paper of the EDICES you quote: “Once the man had died, the corpse stayed in a vertical position for around one hour.”\nSo, if you’re right concerning the conclusion that the Sudarium would have been put on the head of the deceased person only one hour after his death, then that would mean the cloth would have been put on him only at the moment his body was dropped from the cross !!!  And I’m sure this is NOT the conclusion of the EDICES.  I have seen an interview with Mark Guscin on Shrouduniversity.com in which he showed how the cloth was folded and it is clear that it was first put on the head while the body was still on the cross and it must have stayed that way for around an hour !  What Guscin said would be completely wrong if it was true that the cloth would have been put on the head after an hour after death… This information from Guscin seem to be confirmed by the conclusion #11 found in the paper published by EDICES where we can read that once the body would have been placed on the ground with the Sudarium over his head, it would have stayed in this position for approximately ONE MORE HOUR.  In my mind, that mean the body would have stayed also approximately one hour with the Sudarium while he was on the cross.  \nIn the light of the particular conclusion I gave you at the beginning of this comment, if Guscin is correct concerning the length of time the body would have stayed on the cross with the cloth over his head, then that mean the Sudarium must have been put on the head of the deceased person very shortly after his death.\nIf I’m right about that, then that mean your interpretation of the conclusion #7 we can see in the paper published by EDICES must be wrong. First, let’s read again this particular conclusion: “At the bottom of the back of his head, there is a series of wounds produced in life by some sharp\nobjects. These wounds had bled about an hour before the cloth was placed on top of them.”\nIn my mind, what the scientists from EDICES really mean there is that these particular wounds were made from blood that was shed in life and not from post-mortem.  They didn’t meant that this particular bleeding happened at the exact time of time but WELL BEFORE !  If my interpretation is correct, that would not be in contradiction at all with the fact that the cloth would have been put on the head of the deceased person shortly after his death on the cross.\nBut I have to admit that the paper published by EDICES is not always clear concerning the time when the cloth would have been put over the head of the deceased person…  Effectively, in another part of the same paper, we read this : “help us to understand better what happened to the body of\nJesus from an hour after his death on the cross, when the cloth was placed on his face, up till the time when it was taken off.”\nThis particular comment found in the paper of EDICES is in total contradiction with the conclusion #7 that I gave you at the start of my comment !!!!  I think this is an erroneous comment that should not have written that way in the paper… This is the only rational way to understand this particular comment, unless of course that what they said in conclusion #7 is incorrect…\n\n","date":"October 19, 2012 at 1:01 pm","url":"https://shroudstory.com/2012/10/12/stephen-e-jones-starting-a-new-series-of-posts/","cat":"other_blogs","id":"comment-17876","author":"Yannick Clément","site":"shroudstory"},{"title":"Stephen E. Jones Starting a New Series of Posts","post":"Yannick if you interpret all the information correctly, it is clear, from the life blood found on the lower back-side of the Sudarium; The body was already dead (blood stopped flowing) for approx one hour before the Sudarium was placed on the head, then from the frontal stains of blood and water it was concluded that the body hung for approx another hour. Then from the frontal stains again, but these ones flowing up the nose to the forehead, it was deduced that the body lay partially face down with the head resting against a solid object for approx another 45 minutes to an hour… The Sudarium was then rewrapped fully around the head and the body was moved, where finally five to ten minutes later the Sudarium was completely removed from the body…I don’t see how that can be so difficult to comprehend. If you add the one hour before the cloth was placed over the head, then another hour on the cross and then another approx one hour to possibly one and a quarter hours laying in front of the cross and moving the body to the tomb, that puts us at approximately 6 to 6:15 in the evening. Seems to work out pretty good!\nR\n\n","date":"October 19, 2012 at 1:31 pm","url":"https://shroudstory.com/2012/10/12/stephen-e-jones-starting-a-new-series-of-posts/","cat":"other_blogs","id":"comment-17878","author":"Ron","site":"shroudstory"},{"title":"Stephen E. Jones Starting a New Series of Posts","post":"I understand how you interpret the whole timing and this could be right, BUT it doesn’t fit with the conclusion #7 that said: “Once the man had died, the corpse stayed in a vertical position for around one hour.”\nExcuse me Ron, but this conclusion clearly state that the corpse only stayed one hour on the cross after death…  How can you reconcile this conclusion and your timing description ???\n\n","date":"October 19, 2012 at 3:35 pm","url":"https://shroudstory.com/2012/10/12/stephen-e-jones-starting-a-new-series-of-posts/","cat":"other_blogs","id":"comment-17881","author":"Yannick Clément","site":"shroudstory"},{"title":"Stephen E. Jones Starting a New Series of Posts","post":"I will agree Yannick that the EDICE’s paper seems a little misleading on this particular topic. This can be due to translation issues maybe? Or an oversight? I have read several papers outside of Bennett’s book on the Sudarium and I think the scenario I just posted above is actually what is understood to have occured chronologically.\nR\n\n","date":"October 19, 2012 at 3:43 pm","url":"https://shroudstory.com/2012/10/12/stephen-e-jones-starting-a-new-series-of-posts/","cat":"other_blogs","id":"comment-17883","author":"Ron","site":"shroudstory"},{"title":"Stephen E. Jones Starting a New Series of Posts","post":"Some comments here are off-topic, so there is no point in replying, and it must also be pointed out that comments where replies are kind of requested must come with answers to previous suggestions.\n\n","date":"October 18, 2012 at 7:47 pm","url":"https://shroudstory.com/2012/10/12/stephen-e-jones-starting-a-new-series-of-posts/","cat":"other_blogs","id":"comment-17838","author":"Louis","site":"shroudstory"}]
