[{"title":"\nThe Shroud of Turin: 3.6. The man on the Shroud and Jesus were crucified\n","post":"\n\nAnother great article Stephen. God bless you\n\n","author":"Anonymous","date":"December 3, 2013 at 9:02 AM","url":"http://theshroudofturin.blogspot.com/2013/12/the-shroud-of-turin-36-man-on-shroud.html","site":"moore"},{"title":"\nThe Shroud of Turin: 3.6. The man on the Shroud and Jesus were crucified\n","post":"\n\nAnonymous>Another great article Stephen. God bless youThanks. I was amazed that my  previous post in the series was in September.But there was a lot of research involved in the topic of crucifixion and the Shroud. Also, I had been very busy in the last few months working as a casual relief (aka substitute, supply) high school teacher, but now that there are only two weeks left before the Western Australian school summer holidays, I should be able to post further articles in the series at a more rapid rate.Stephen E. Jones----------------------------------Reader. If you like this my The Shroud of Turin  blog, and you have a website, could you please consider adding  a hyperlink to my blog on it? This would help increase its Google PageRank number and so enable those who are Google searching on \"the Shroud of Turin\" to more readily discover my blog. Thanks.\n\n","author":"Stephen E Jones","date":"December 3, 2013 at 11:24 AM","url":"http://theshroudofturin.blogspot.com/2013/12/the-shroud-of-turin-36-man-on-shroud.html","site":"moore"},{"title":"\nThe Shroud of Turin: 3.6. The man on the Shroud and Jesus were crucified\n","post":"\n\nStephen: Thanks so much for this; it is incredibly helpful.  One of the biggest struggles I have (common to researchers in all disciplines, I suppose) is simply keeping track of 'who said what.'  That is, recalling which authors and references I already have in my library of papers support which specific claims.  So, your series is crucial for me in simply keeping myself oriented.  These articles can't come fast enough as far as I'm concerned; each one is a treasure trove!One question for you, though.  I am curious why you prefer Barbet's research to that of Zugibe.  My recollection is that they reach different conclusions as to placement of the nails and cause of death.\n\n","author":"Overall great quality.Thanks.I have not continued with this series, \"The Shroud of Turin.\" My last post in it was on February 27, 2014: \"The Shroud of Turin: 3.7. The man on the Shroud and Jesus were buried (2).\"Looking back, the main reason was that on February 18, 2014 I started my theory that the 1988 radiocarbon dating of the Shroud as \"mediaeval ... AD 1260-1390\" was the result of a hacking of the fully computerised AMS radiocarbon dating computers at Arizona, Zurich and Oxford laboratories. I have developed that theory through several series and now I am concluding it a series, \"The 1260-1390 radiocarbon date of the Turin Shroud was the result of a computer hacking\" which is now up to part #7.Also, I had since started a series, \"The evidence is overwhelming that the Turin Shroud is authentic!\" which is currently up to part #13.However, I would like to continue that \"The Shroud of Turin\" series, when time permits. So thanks for reminding me of it!Stephen E. Jones----------------------------------MY POLICIES Comments are moderated. Those I consider off-topic, offensive or sub-standard will not appear. Except that comments under my latest post can be on any Shroud-related topic without being off-topic. I normally allow only one comment per individual under each one of my posts.\n\n","author":"Stephen E. Jones","date":"May 20, 2016 at 9:01 AM","url":"http://theshroudofturin.blogspot.com/2013/12/the-shroud-of-turin-36-man-on-shroud.html","site":"moore"}]
