[{"title":"\nIntroduction to my The Shroud of Turin (TSoT) blog!\n","post":"\n\nhas anyone else noticed another facial image on the shroud not on the upper part?\n\n","author":"sammy a","date":"March 24, 2008 at 8:51 AM","url":"http://theshroudofturin.blogspot.com/2007/06/introduction-to-my-shroud-of-turin-tsot.html","site":"moore"},{"title":"\nIntroduction to my The Shroud of Turin (TSoT) blog!\n","post":"\n\nsammy>has anyone else noticed another facial image on the shroud not on the upper part?Not that I am aware of.Stephen E. Jones\n\n","author":"and then I will let him/her have the last word.\"Please note that I no longer have the above in my policies. The amended policy now reads:\"Any response by me will usually be only once to each individual under that post.\"Stephen E. Jones\n\n","author":"Stephen E Jones","date":"July 24, 2009 at 9:37 PM","url":"http://theshroudofturin.blogspot.com/2007/06/introduction-to-my-shroud-of-turin-tsot.html","site":"moore"},{"title":"\nIntroduction to my The Shroud of Turin (TSoT) blog!\n","post":"\n\nHaving approved this comment, I deleted it because it is basically a link to another site. But then I reconsidered and am here reposting the comment:----------------------------------I have just released a new book titled, THE SHROUD OF TURINAn Imprint of the Soul, Apparition or Quantum Bio-Hologram byChidambaram Ramesh.You can find more information about ithttp://www.dogearsetc.com/mainpage.jsp?type=2&id=36728.My book Advocates the Quantum Bio-Holographic idea for the first timeto explain the miraculous image on the Turin Shroud.Chidambaram Ramesh.----------------------------------There is an online press release about this book at: \"First book by an Indian author on the Shroud of Turin released.\"I have not yet read the book, so I am not agreeing or disagreeing with the author's thesis. Although from the press release's description:\"By drawing a plethora of evidence from the alchemical secrets of resuscitating spectral plant out of ashes, the author establishes that material body of organisms even if consumed to ashes, retain their selfsame form and figure.\"I would probably disagree with it.Stephen E. Jones\n\n","author":"Stephen E Jones","date":"November 29, 2010 at 7:18 PM","url":"http://theshroudofturin.blogspot.com/2007/06/introduction-to-my-shroud-of-turin-tsot.html","site":"moore"}]
