[{"title":"Stephen Jones Starting New Section","post":"The proposed List of Contents indicates that Mr Jones’ focus will be on the Passion narrative, so that it would therefore seem that a forensic type approach is envisaged. He might like to look a little further into the Apostolic and post-Apostolic church biblical texts to see if there might be some other indications as well. An obvious one is that he will have to deal with the description of the cloths found in the tomb. Mr Hamon has from time to time mentioned a few other more obscure indications. Are there suggestions or secret indications of the Shroud in various obscure references to linen, apparel and so on? Why did Mary Magdalen mistake the resurrected Christ for the gardener – was it because he wore a himation like a gardener, in reality the Shroud? What is behind the vision of the large cloth that Peter sees descending from heaven – is this an obscure reference to it? There are further suggestions or hints in some Revelations’ texts – the horseman named Faithful and True riding into battle and yet his cloak is already soaked in blood; there are saints dressed in fine white linen, and so on. The gospel accounts were of course written well after the events they describe, but other possible references might be found in some of the other narrative sections. There is an obvious problem of unavoidable speculation in these references, and they can only be inferred from interpretation. They might not appeal to Mr Jones’ preference for an evangelical interpretation of the texts, and he might have to acknowledge an underlying ‘disciplina arcani’ to get at them. It also tends to be a fairly specialized field with which he might have some difficulty. However he has written on such issues as ‘coins on eyes’ and commented on pareidolia. He may like to consider whether there might be obscure references to the Shroud in some of the biblical texts apart from the specific Passion narrative.\n\n","date":"June 12, 2013 at 5:12 pm","url":"https://shroudstory.com/2013/06/12/stephen-jones-starting-new-section/","cat":"other_blogs","id":"comment-36813","author":"daveb of wellington nz","site":"shroudstory"}]
