[{"title":"\nLocations of the Shroud: Turin 1578-1694: Turin Shroud Encyclopedia\n","post":"\n\nThis is a comment I received yesterday by email. I have posted it under this my latest post and will respond to it shortly.--------------------------------Hello,My name is ... and I’m currently researching the Turin Shroud for my extended project qualification at school. I came across your blog and it has been one of the most helpful websites I’ve found, so thank you for your dedication to the Shroud!I did try to post this as a comment on the blog, but for some reason I wasn’t able to. I was reading your post about the poker holes in the shroud, and noticed that you also mentioned the Pray Codex as I’ve seen a lot of other researchers have pointed out. At first I was convinced that the existence of the holes on the Pray Codex meant the Shroud must have dated to an earlier time as the artist of the Pray Codex must have copied that holes formation from it. However, I’ve also noticed that one seems to have considered the (admittedly unlikely) possibility that the holes in the shroud could have been modelled on the Pray Codex, presumably by the artist who many claim forged the shroud. I was just wondering whether I’ve missed something that means this can’t be the case, as I really would like to believe that the painting must have been based on the shroud!Many thanks in advance for anything you can tell me,[...]\n\n","author":"Stephen E Jones","date":"April 8, 2015 at 5:29 PM","url":"http://theshroudofturin.blogspot.com/2015/04/locations-of-shroud-turin-1578-to.html","site":"moore"},{"title":"\nLocations of the Shroud: Turin 1578-1694: Turin Shroud Encyclopedia\n","post":"\n\n>Hello,>>My name is ... and I’m currently researching the Turin Shroud for my extended project qualification at school. Great! I have often wondered if my blog is useful to students such as yourself.>I came across your blog and it has been one of the most helpful websites I’ve found, so thank you for your dedication to the Shroud!Thank YOU.>I did try to post this as a comment on the blog, but for some reason I wasn’t able to. I don't know why. I haven't changed my blog's \"Who can comment\" setting. I have checked and it is still \"Anyone - includes Anonymous Users.\">I was reading your post about the poker holes in the shroud,I presume you mean my 2013 post, \"The Shroud of Turin: 2.6. The other marks (2): Poker holes.\">and noticed that you also mentioned the Pray Codex as I’ve seen a lot of other researchers have pointed out. The Pray Codex is mentioned in that post above, and it is also covered in my 2012 post, \"My critique of `The Pray Codex,' Wikipedia, 1 May 2011.\"  >At first I was convinced that the existence of the holes on the Pray Codex meant the Shroud must have dated to an earlier time as the artist of the Pray Codex must have copied that holes formation from it. You were right the first time.>However, I’ve also noticed that one seems to have consideredNewcomers to the Shroud sometimes think that they have discovered something about it that no one else has considered. But that is highly unlikely, given that the Shroud has been the subject of intense criticism by Shroud sceptics for over a century. >...the (admittedly unlikely) possibility that the holes in the shroud could have been modelled on the Pray Codex, presumably by the artist who many claim forged the shroud. Ian Wilson and Mark Guscin are two Shroud pro-authenticist authors who consider, and refute, the general Shroud sceptic argument that a 13th-14th century forger went around museums and art galleries (as French biologist/artist Paul Vignon did in the early 20th century), noting marks-in-common on Byzantine artworks dating back to the 6th century (the \"Vignon markings\"), and included those in his Shroud forgery. [continued]\n\n","author":"Stephen E Jones","date":"April 8, 2015 at 11:22 PM","url":"http://theshroudofturin.blogspot.com/2015/04/locations-of-shroud-turin-1578-to.html","site":"moore"},{"title":"\nLocations of the Shroud: Turin 1578-1694: Turin Shroud Encyclopedia\n","post":"\n\n[continued]But problems with that include:1) The forger would have had to travel thousands of kilometres visiting museums and art galleries, in the 13th-14th century when travel was very difficult and very hazardous. 2) But public museums and art galleries didn't exist in 13th-14th century, as artworks were in private collections or churches, and even the latter were not generally viewable by the public.3) Europe was wracked by wars in those centuries, including \"The Hundred Years War\" (1337-1453), which particularly devastated France. 4) Europe was also ravaged by the Black Death from 1347 to the 18th century, which killed between 30% and 60% of the population.5) The former Byzantine Empire, including Constantinople, had been subsumed by the Islamic Ottoman Empire (1299-1566). 6) The Shroud has features which were unknown in the 14th century, such as photographic negativity, arterial and venous blood circulation, serum halos surrounding blood clots, etc.7) Why would a forger go to so much time, effort and expense in a gullible age which would have been (and WAS) satisfied with far less? 8) A forger who went to that degree of time, effort and expense to forge the Shroud would have sold his forgery for a lot of money to someone RICH. But Geoffroy I de Charny (c.1300-56), the first undisputed owner of the Shroud, was POOR. He had to request funding from the King of France to build his modest wooden church at Lirey.9) And having made ONE Shroud, the forger would have made MORE, since the public and clergy did not care that other churches had their own `original' of the same relic.  [continued]\n\n","author":"Stephen E Jones","date":"April 8, 2015 at 11:31 PM","url":"http://theshroudofturin.blogspot.com/2015/04/locations-of-shroud-turin-1578-to.html","site":"moore"},{"title":"\nLocations of the Shroud: Turin 1578-1694: Turin Shroud Encyclopedia\n","post":"\n\n[continued]>I was just wondering whether I’ve missed something that means this can’t be the case, as I really would like to believe that the painting must have been based on the shroud!In addition to those general problems of the forgery theory, additional problems of the forger incorporating the \"poker holes\" on the Pray Codex, include: 10) The ink drawings which symbolically depict the Shroud, including its L-shaped \"poker holes,\" are inside a codex which is written in Old Hungarian, which a 13th-14th century forger would be most unlikely to understand and so be interested in.11) Why would a forger who had been collecting Vignon markings be bothered with the Pray Codex's \"poker holes\" which are not in any Byzantine artwork?12) The Pray Codex was compiled at Boldva monastery in Hungary between 1192-95. That is 65 years before the earliest 1260 radiocarbon date of the Shroud. And the drawings within the Codex, which depict the \"poker holes\" (and 7 other unique features on the Shroud, according to agnostic art historian Thomas de Wesselow), must be even older than that. Therefore the Pray Codex drawings alone refute the 1260-1390 radiocarbon date of the Shroud.13) The Pray Codex was discovered in 1770 by György Pray, presumably in the archives of the University of Nagy-Szombat in Slovakia where Pray was then a professor of theology. The codex and its drawings had presumably been there unrecognised since 1285 when the Boldva monastery was destroyed by the Mongols and the monks fled. The unknown, hypothetical, medieval forger of the Shroud, in addition to his other `superhuman' museum and art gallery (which didn't then exist) travels, would have had to travel to Hungary or Slovakia, discover the Codex written in Old Hungarian, and the drawings inside it, copy 8 features on those drawings including the \"poker holes,\" and incorporate them also into his hypothetical Shroud forgery.Shroud sceptics can respond with the glib answer that the forger incorporated the Vignon markings and Pray Codex features in his forgery, but no Shroud sceptic has actually proposed a COMPREHENSIVE forgery theory which plausibly explains in detail HOW and WHEN the forger did it (let alone WHY), museum by museum, art gallery by art gallery, marking by marking. If a Shroud sceptic had attempted to develop such a comprehensive forgery theory, he must have quietly given up, when he realised its IMPLAUSIBILITY (if not IMPOSSIBILITY).  >Many thanks in advance for anything you can tell me,[...] I hope this has helped you to realise that you were indeed right the first time!Stephen E. Jones---------------------------------Reader, if you like this my The Shroud of Turin  blog, and you have a website, could you please consider adding  a hyperlink to my blog on it? This would help increase its Google PageRank number and so enable those who are Google searching on \"the Shroud of Turin\" to more readily discover my blog. Thanks.\n\n","author":"Stephen E Jones","date":"April 8, 2015 at 11:41 PM","url":"http://theshroudofturin.blogspot.com/2015/04/locations-of-shroud-turin-1578-to.html","site":"moore"},{"title":"\nLocations of the Shroud: Turin 1578-1694: Turin Shroud Encyclopedia\n","post":"\n\n(Sent this as a reply to your last comment but I can't see it so I'm not sure if it sent) Thank you so much for such a detailed response to my question, I'm now re-convinced that the painting must have been based on the shroud! Also, on another topic, I don't suppose you've covered the pollen traces that were found on the shroud in your post anywhere have you? I'm making my way through them all so I'm sure I'll stumble across it eventually if you have, but I wondered if I could quickly get your opinion on something I read earlier. Someone claimed that, because it can't be disputed that the shroud has not left Europe since the time that the carbon dating results place it's creation at, the fact that pollen from Jerusalem can be found on it shows the shroud must have existed outside of Europe at an earlier date. Would you consider this sufficient evidence to dispute the carbon dating, or do you feel the pollen could have come in contact with the shroud some other way? (I need as many opinions from researchers as possible for my epq!)\n\n","author":"My name is Ayla Garrigó and I work at the Shroud of Turin Expo in San Antonio. We just wanted to let you know a little bit about us and what we do (www.shroudexpo.com) ... There's more information about it in our web page and Facebook page. Thank you and God bless you.Glad to be of help publicising the expo.Stephen E. Jones\n\n","author":"Stephen E Jones","date":"April 15, 2015 at 6:16 AM","url":"http://theshroudofturin.blogspot.com/2015/04/locations-of-shroud-turin-1578-to.html","site":"moore"}]
