[{"title":"What did Stephen Jones just say?","post":"Regardless of what Catholic John Walsh and Evangelical Stephen Jones might say, the appropriate response of the Catholic Church, still having to cope with the results of a most unsatisfactory radio-carbon dating test, has to be “Caution!”  No way is it going to seek to be embarrassed by a proclamation one way or the other that later investigations might well prove to be faulty. It is possible for even a pro-authenticist to be a fanatic, and their ravings are best ignored.\n\n","date":"October 7, 2013 at 7:07 am","url":"https://shroudstory.com/2013/10/07/what-did-stephen-jones-just-say/","cat":"news_&_views","id":"comment-46364","author":"daveb of wellington nz","site":"shroudstory"},{"title":"What did Stephen Jones just say?","post":"As far as I know there is no “official” position of the Church. Neither is there any reasonable alternative that would protect it for the benefit of all Christians or even all mankind. I was asked this question by someone a few years ago about whether there might me a better custodian. I replied, somewhat ironically: you would prefer Oxford or the British Museum?\nAt least two Popes have been quite committed to the Shroud. One is Pope Benedict and the other Pius the XI who was responsible for the 1933 exposition which really kicked-off the modern era of Shroud science. He also climbed the Also climber the Alps as a young man with Paul Vignon, a decade or so before Secondo Pia’s photographs. And, his battle against the Nazi’s is the subject a recent book.\nI doubt the Church has to declare it as a matter of faith that the Shroud is authentic. Frankly it declares too much to be a matter of faith. That may ultimately be be the task of Science.\nBut frankly, to use the Shroud as a vehicle to attack the Church is simply counter-productive..\n\n","date":"October 7, 2013 at 7:24 am","url":"https://shroudstory.com/2013/10/07/what-did-stephen-jones-just-say/","cat":"news_&_views","id":"comment-46365","author":"John Klotz","site":"shroudstory"},{"title":"What did Stephen Jones just say?","post":"“Alps”\n\n","date":"October 7, 2013 at 7:25 am","url":"https://shroudstory.com/2013/10/07/what-did-stephen-jones-just-say/","cat":"news_&_views","id":"comment-46366","author":"John Klotz","site":"shroudstory"},{"title":"What did Stephen Jones just say?","post":"A faith which depends on relics, whatever denomination the person may belong to, is no faith at all.\n\n","date":"October 7, 2013 at 10:27 am","url":"https://shroudstory.com/2013/10/07/what-did-stephen-jones-just-say/","cat":"news_&_views","id":"comment-46375","author":"Louis","site":"shroudstory"},{"title":"What did Stephen Jones just say?","post":"A paraphrase of Pope Benedict XVI quoted in the UK announcing the beatification of John Henry Newman in September 2010: “Faith without adequate reason, is fanaticism!”\n\n","date":"October 7, 2013 at 3:07 pm","url":"https://shroudstory.com/2013/10/07/what-did-stephen-jones-just-say/","cat":"news_&_views","id":"comment-46388","author":"daveb of wellington nz","site":"shroudstory"},{"title":"What did Stephen Jones just say?","post":"Benedict XVI (a theologian) was obviously thinking about the encyclical “Fides et Ratio” (Faith and Reason) issued by Pope John Paul II (who was a philosopher). You can be sure that they were not thinking about relics and there are many Catholics, who, like Anglicans and Protestants, do not depend on relics to sustain their Christian faith.\n\n","date":"October 7, 2013 at 6:55 pm","url":"https://shroudstory.com/2013/10/07/what-did-stephen-jones-just-say/","cat":"news_&_views","id":"comment-46414","author":"Louis","site":"shroudstory"},{"title":"What did Stephen Jones just say?","post":"That is not the issue; your statement “A faith which depends on relics, …  is no faith at all” is I consider unduly judgmental.  For reason to operate at all, it must flow from empirical evidence of some kind.  Relics may properly serve as one type of such empirical evidence for some persons and I do not see that condemnation is at all in order! I would turn the accusation around and say that “Faith wothout Reason is no Faith at all!” It would in fact be unthinking Fanaticism!\n\n","date":"October 8, 2013 at 2:08 am","url":"https://shroudstory.com/2013/10/07/what-did-stephen-jones-just-say/","cat":"news_&_views","id":"comment-46444","author":"daveb of wellington nz","site":"shroudstory"},{"title":"What did Stephen Jones just say?","post":"But Jones either/or is incorrect. The Shroud could be a natural phenomenon, accidental if you will, without spiritual purpose. To say it must be either a miraculous sign from God or a complete fraud is faith with blinders on.\n\n","date":"October 7, 2013 at 12:12 pm","url":"https://shroudstory.com/2013/10/07/what-did-stephen-jones-just-say/","cat":"news_&_views","id":"comment-46380","author":"David Goulet","site":"shroudstory"},{"title":"What did Stephen Jones just say?","post":"Even by his own terms, Stephen is being rather ungenerous, I feel. Although he personally has no doubts at all, he seems to accept that the Shroud may be thought of as either the work of God or the work of the Devil (He doesn’t seem to accept any other possibility). That being so, what response would he feel appropriate from the Catholic (or any other) Church?\nIt is a pity that Stephen treats John Walsh’s comment, that the Shroud is either “the most awesome and instructive relic of Christ in existence” or “one of the most ingenious, most unbelievably clever products of the human mind and hand on record, “there is no middle ground,” as an axiomatic fact, and is therefore immune to any suggestion to the contrary.\n\n","date":"October 7, 2013 at 12:55 pm","url":"https://shroudstory.com/2013/10/07/what-did-stephen-jones-just-say/","cat":"news_&_views","id":"comment-46381","author":"Hugh Farey","site":"shroudstory"},{"title":"What did Stephen Jones just say?","post":"I agree completely with Hugh. I was astounded when I read Stephen’s words. I thought Dan had misquoted him. But that was not the case. Why just the Roman Catholic Church? \nIn 1998, John Paul II addressed the authenticity of the shroud by saying, “The Church does not have specific competence to pronounce on these questions. It entrusts to scientists the task of continuing to investigate to find suitable answers to the questions regarding the Shroud”. Those words could well suffice if an “official statement” was needed. JPII’s message was both forthright and reasoned. \nStephen should reconsider what he wrote and clarify or issue a retraction.\n\n","date":"October 7, 2013 at 2:24 pm","url":"https://shroudstory.com/2013/10/07/what-did-stephen-jones-just-say/","cat":"news_&_views","id":"comment-46386","author":"Paulette","site":"shroudstory"},{"title":"What did Stephen Jones just say?","post":"There is middle ground! It may be a piece of artwork produced as a tribute to 11th/12h century Byzantine artwork showing a naked, crossed arm Christ.\n\n","date":"October 7, 2013 at 5:47 pm","url":"https://shroudstory.com/2013/10/07/what-did-stephen-jones-just-say/","cat":"news_&_views","id":"comment-46401","author":"ChrisB","site":"shroudstory"},{"title":"What did Stephen Jones just say?","post":"As things are, it is impossible to prove that the Shroud is the burial cloth of Jesus, but by the same token, it’s impossible to prove that it isn’t. That’s what faith is all about. You believe something even in the face of impossible evidence, like when they said the Carbon 14 testing was conclusive. In spite of even that, I believed the cloth was the burial cloth of Jesus. Then when they said the Carbon 14 testing was flawed, I smiled because I knew I had been right. However, in order to prove the cloth is without a doubt, truly that of Jesus, we would have to take blood samples from the shroud and do DNA testing on it. That being said, if we do get the DNA, we have nothing to compare it to. We don’tr have samples of Christ’s blood. As a Catholic, I believe, without a doubt, that the Shroud of Turin is the burial cloth of Jesus the Christ. Would I be willing to die for this belief? Emphatically YES!!! That’s what faith is. Stephen should realize the Church is protecting itself because people are too willing to condemn our faith in a relic. The Church knows we have nothing to compare it to. We as Catholics believe, we don’t need hard evidence, that’s what science wants because scientists will not believe unless they can see and feel the burning bush. Again, we do not need that evidence and we believe.\n\n","date":"October 7, 2013 at 6:41 pm","url":"https://shroudstory.com/2013/10/07/what-did-stephen-jones-just-say/","cat":"news_&_views","id":"comment-46413","author":"Rosalie Giansante","site":"shroudstory"},{"title":"What did Stephen Jones just say?","post":"Well said, Rosalie.\n\n","date":"October 7, 2013 at 6:57 pm","url":"https://shroudstory.com/2013/10/07/what-did-stephen-jones-just-say/","cat":"news_&_views","id":"comment-46415","author":"Louis","site":"shroudstory"},{"title":"What did Stephen Jones just say?","post":"I believe that the possibility that the shroud was made by human hands is the same as the possibility that the appearances of the risen Christ as reported in the Gospels was  caused by  mass delusions of the apostles.\n\n","date":"October 7, 2013 at 10:14 pm","url":"https://shroudstory.com/2013/10/07/what-did-stephen-jones-just-say/","cat":"news_&_views","id":"comment-46426","author":"Paul","site":"shroudstory"},{"title":"What did Stephen Jones just say?","post":"The Catholic Church doesn’t need to rule on the Shroud at all, ever.  If it does, it does.  If it doesn’t, it doesn’t. This does not make the statement by the Church false in any way.  Cautious, not false or intentionally deceiving.\n\n","date":"October 8, 2013 at 7:46 pm","url":"https://shroudstory.com/2013/10/07/what-did-stephen-jones-just-say/","cat":"news_&_views","id":"comment-46558","author":"Andy Weiss","site":"shroudstory"},{"title":"What did Stephen Jones just say?","post":"Reply to #7 Daveb of Wellington: “Faith without reason”? All faith has some reason and that does not necessarily involve relics. Do you think the Vietnamese Catholics relied on relics during the war? General Creighton Abrams did not leave the Methodist Church to become a Catholic because he saw them venerating relics, he just saw their plain, strong faith.\n\n","date":"October 8, 2013 at 9:21 pm","url":"https://shroudstory.com/2013/10/07/what-did-stephen-jones-just-say/","cat":"news_&_views","id":"comment-46568","author":"Louis","site":"shroudstory"},{"title":"What did Stephen Jones just say?","post":"2nd reply to #7 att. Daveb of Wellington. Want to see great faith in the Catholic Church without relics in just one image? Go the link\nhttp://www.catholicherald.co.uk/commentandblogs/2013/10/08/no-one-wants-to-admit-that-theres-a-war-on-christians/\n\n","date":"October 8, 2013 at 9:44 pm","url":"https://shroudstory.com/2013/10/07/what-did-stephen-jones-just-say/","cat":"news_&_views","id":"comment-46572","author":"Louis","site":"shroudstory"},{"title":"What did Stephen Jones just say?","post":"What if there were an “official position” on the Shroud? What would it matter? Christ Himself said “Ye have seen and believed. Blessed are those who have not seen, yet believe!”  He also decried a generation as “faithless” who needed “signs and wonders” to believe. Why should the RCC take a position Jesus Himself would scarcely endorse as a desirable alternative to the trust in Himself He so wants us to have? There is much credible evidence that Shroud of Turin is authentic, and much learned academic study that can hardly be ignored that points to the contrary. I remember when the C14 test was the “last word, oh yeah, it’s a fake, everybody go home.” Well, it seems it was not the last word, after all. The RCC is VERY wise to admit, that, while a relic ‘worthy of veneration,’ so is every plaster statue of every saint and every mummified ‘incorruptible,’ jerked and de-hydrated in gilt glass coffins under layers of painted wax to hide their blackened, sunken faces. Given these ‘venerable’ examples, it is probably for the best the RCC make no extravagant claims to authenticity.  If I am wrong then perhaps a pilgrimage to the Holy Toe of Saint Dionysius the Areopagite might cure my gout, after all. Please take no offense to my humor, none is intended.  But I think my point is well taken.\n\n","date":"October 8, 2013 at 9:29 pm","url":"https://shroudstory.com/2013/10/07/what-did-stephen-jones-just-say/","cat":"news_&_views","id":"comment-46570","author":"Josie L. Tyner","site":"shroudstory"},{"title":"What did Stephen Jones just say?","post":"There are incorrupt bodies of some saints.\n\n","date":"October 8, 2013 at 9:32 pm","url":"https://shroudstory.com/2013/10/07/what-did-stephen-jones-just-say/","cat":"news_&_views","id":"comment-46571","author":"Louis","site":"shroudstory"},{"title":"What did Stephen Jones just say?","post":"I have seen pictures of the so-called “incorrupts.” And what the RCC accepts as incorrupt are, mostly, in a fairly good state of preservation but hardly un-accounted for by natural means. Natural mummification is not that unusual. Look up the corpse of St. Rita, from the 1200s. Dessicated for sure, a natural mummy.  I have seen the corpse of St. Bernadette. As a caregiver, I travelled with my partially paralyzed employer to Lourdes.( caregivers get awesome rates, sometimes half price.)  I told her what she was seeing was a wax mask, and made the custodial priest admit exactly that.  They are not allowed to lie to pilgrims anymore. Bernadette’s corpse, initially, had a very lifelike appearance.  But after awhile her face turned black as coal.  My boss did not appreciate my truth-telling, and I was dismissed shortly after returning to the States for “breaking a dear lady’s heart.” But if you want to live in a lie, it better be a better one than that.  Same thing for the corpse of Saint Catherine Laboure, St. Vincent de Paul, all covered in wax. The head of Saint Catherine of Sienna is in an awful state, still on exhibition for some reason.  THAT is why the RCC takes no position on the SOT.  Embarrassing positions they have taken in the past, bowing and scraping and trading in pieces of so much jerked and dried meat in fancy glass coffins. As M Luther once joked, “19 of the original 12 apostles are buried in Spain.” Some of that pre Vatican 2 stuff is pretty much swept under the rug, and they have no plans to trot it out any time soon.\n\n","date":"October 11, 2013 at 10:18 am","url":"https://shroudstory.com/2013/10/07/what-did-stephen-jones-just-say/","cat":"news_&_views","id":"comment-47019","author":"Josie L Tyner","site":"shroudstory"},{"title":"What did Stephen Jones just say?","post":"Louis, Thank you for the reference at #17.  I went past the image, yes well-chosen, and onwards to read the article, thought-provoking and well-written.  It deals with the problem of the universal deafening silence to anti-Christian persecution in very many parts of the world. \nIn NZ we are I think, or more truthfully have been, better served by the media than much larger countries, preoccupied as they are with their own internal concerns.  We are better informed than many other western populations concerning international issues.  Accordingly the content of the article came as no new revelation to me, as it might to others. The writer makes a valid point concerning the silence with which such anti-Christian persecution is universally treated.  We have a cynical saying here, perhaps common to other smaller countries, that “War is God’s way of teaching geography to Americans.” I have worked with professionals from USA during my long career, often finding them to be less informed about international matters than my fellow countrymen.  I recommend the article to others. \nConcerning the TS’ value in the quest for Faith, I see its role as at least a useful proselytising tool to a cynical atheistic generation, self-satisfied with its own accomplishments, gods of their own handiwork, but which craves a sign of the truly divine.\n\n","date":"October 9, 2013 at 2:36 am","url":"https://shroudstory.com/2013/10/07/what-did-stephen-jones-just-say/","cat":"news_&_views","id":"comment-46592","author":"daveb of wellington nz","site":"shroudstory"},{"title":"What did Stephen Jones just say?","post":"David, there is nothing to thank me for, I just wanted to demonstrate with the link pasted on #17 that faith does not necessarily depend on relics. Yes, a cynical atheist generation does crave for a sign of the truly divine and, given some of the discoveries of science, some Christians have felt that their own faith has been undermined and this is particularly true of fundamentalists, with their literal interpretation of Genesis. The well-known American Catholic philosopher David Schindler recently launched a book where he talks about how philosophy and theology can intersect and why there is no need to throw faith overboard.\nDo you know where Heidegger recovered his faith, decades after fighting with the Jesuits, and after his philosophy led him nowhere? He found it in history. He did not stop thinking, with that kind of mind he just couldn’t. He began to enter and bless himself whenever he passed by a church and called a priest to his house to make sure he would be given a Catholic burial.\nI have felt anti-Christian persecution in my own skin, and have learned to live with it. Go to the link below to see the latest round:\nhttp://news.yahoo.com/israelis-held-jerusalem-christian-graves-vandalised-193705186.html\n\n","date":"October 9, 2013 at 12:43 pm","url":"https://shroudstory.com/2013/10/07/what-did-stephen-jones-just-say/","cat":"news_&_views","id":"comment-46671","author":"Louis","site":"shroudstory"},{"title":"What did Stephen Jones just say?","post":"I don’t belong to any Synagogue, Chruch, Mosque or Temple. To me, the Turin Shroud is not an object of faith but an object of quest: quest for the historical Yeshua.\n\n","date":"October 9, 2013 at 1:07 pm","url":"https://shroudstory.com/2013/10/07/what-did-stephen-jones-just-say/","cat":"news_&_views","id":"comment-46673","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"What did Stephen Jones just say?","post":"In the Middle Ages, Yeshua’s Shroud or Holy Grail was the quest for G.od and his mysteries through its polymorphic sembances and visions.\n\n","date":"October 9, 2013 at 1:18 pm","url":"https://shroudstory.com/2013/10/07/what-did-stephen-jones-just-say/","cat":"news_&_views","id":"comment-46676","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"What did Stephen Jones just say?","post":"That’s OK, Max, there are many people who feel like you and don’t belong to any organised religion, but at least you seem to believe in a superior being, which is evident when you write “G.od “. Orthodox Jewish influence!\n\n","date":"October 9, 2013 at 1:29 pm","url":"https://shroudstory.com/2013/10/07/what-did-stephen-jones-just-say/","cat":"news_&_views","id":"comment-46679","author":"Louis","site":"shroudstory"},{"title":"What did Stephen Jones just say?","post":"To me G.od is the call of the radiant power of the presence of the infinite intelligence within any human being to lead the fullness of real Life.\n\n","date":"October 9, 2013 at 7:24 pm","url":"https://shroudstory.com/2013/10/07/what-did-stephen-jones-just-say/","cat":"news_&_views","id":"comment-46719","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"What did Stephen Jones just say?","post":"So you’re a kind of self-styled gnostic, is it?\n\n","date":"October 9, 2013 at 7:47 pm","url":"https://shroudstory.com/2013/10/07/what-did-stephen-jones-just-say/","cat":"news_&_views","id":"comment-46720","author":"Louis","site":"shroudstory"}]
