[{"id":"comment-12175","author":"anoxie","post":"“Ron: the restriction of the sample area for carbon dating to one corner was unfortunate – but would you really want to see the Shroud disfigured by multiple sampling sites?” “Restoration” damaged the shroud more than the 1986 sampling… R. Roger cleverly suggested to date the shroud based on the material burnt and vacuum cleaned during the “restoration”. That said, I don’t think C14 datation is a priority..","date":"2012-06-11","mins":"3:58 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-141066","author":"anoxie","post":"1 “In the paper “Correlation of Image Intensity on the Turin Shroud with the 3 D Structure of a Human Body Shape” written by Jackson, Jumper and Ercoline in 1984, they estimated that he areas of direct contact between the cloth and the back of the body were covering a total surface of ≈ 2800 cm2 at the time of the image formation, while on the front side, they were only covering a total surface of ≈ 1100 cm2” This could be a good start to discuss wether “might John P.Jackson have been right in thinking the frontal and dorsal images of the Man on the Turin Shroud are subtly different” 2 What does Colin see that is 3 D in this? ….","date":"2014-07-29","mins":"10:33 am","url":"https://shroudstory.com/2014/07/29/beyond-luwu-and-lotto/","cat":"art","title":"Beyond LUWU and LOTTO"},{"id":"comment-25593","author":"anoxie","post":"I’ve got 4170 for “medallion of lirey”, i think we are mistaking a medallion for a badge..","date":"2013-02-25","mins":"4:54 am","url":"https://shroudstory.com/2013/02/24/cluny-medal-versus-lirey-badge/","cat":"art","title":"Cluny Medal versus Lirey Badge"},{"id":"comment-25703","author":"anoxie","post":"It was a joke but thank you for this precision, I didn’t know what a “méreau” was..","date":"2013-02-26","mins":"4:29 am","url":"https://shroudstory.com/2013/02/24/cluny-medal-versus-lirey-badge/","cat":"art","title":"Cluny Medal versus Lirey Badge"},{"id":"comment-25701","author":"anoxie","post":"Or perhaps he’s stopped commenting because there is nothing to comment any longer, whatever Colin’s behaviour..","date":"2013-02-26","mins":"4:16 am","url":"https://shroudstory.com/2013/02/24/cluny-medal-versus-lirey-badge/","cat":"art","title":"Cluny Medal versus Lirey Badge"},{"id":"comment-109000","author":"anoxie","post":"And beyond : Mario Latendresse has created the second photograph of his anaglyph according to arbitrary parameters. “depth map” on the shroud is isotropic, no perspective, and it’s “the fuzzier the further” and not necessarily “the brighter the closer” as used in his second photograph..","date":"2014-05-02","mins":"1:49 pm","url":"https://shroudstory.com/2014/05/02/did-leonardo-da-vinci-accidentally-invent-3d-pictures/","cat":"art","title":"Did Leonardo da Vinci Accidentally Invent 3D Pictures"},{"id":"comment-109451","author":"anoxie","post":"Basically i meant you don’t know how the 3d is encoded on the shroud, you are assuming “facts”. If you use the vp8, you can see “3d”, it does’t mean you.ve deciphered the way cloth body distance is encoded. You write : a “depth map” has nothing to do with isotropy Once again, you create an artificial depth map to generate your anaglyph. To do so you use an horizontal shift (stereoscopic vision required by the anaglyph) but contrary to the example of this post (the two mona lisa) you don’t know under which perspective you should look at the shroud (left right, oblique, upside down). You write : the parameter needed is not essential, nor unique Well, to create a subjective 3d vision. To put science in a “depth map” one has to have a scientific model. I’m right, not asking, not dogmatic..","date":"2014-05-03","mins":"12:51 am","url":"https://shroudstory.com/2014/05/02/did-leonardo-da-vinci-accidentally-invent-3d-pictures/","cat":"art","title":"Did Leonardo da Vinci Accidentally Invent 3D Pictures"},{"id":"comment-144994","author":"anoxie","post":"Rebecca has a good point questionning face matching between the shroud “photograph like” and frescoes/icons “cartoon like” using facial recognition algorithms which are known to fail at cross matching between cartoons based on facial attributes and photographs. Why do such methods fail ? because it is not how our brain works..","date":"2014-08-20","mins":"12:33 pm","url":"https://shroudstory.com/2014/08/20/face-matching-methods-questioned/","cat":"art","title":"Face Matching Methods Questioned"},{"id":"comment-40872","author":"anoxie","post":"But the presence of that blood, now that science can detect and do so much with it, may have been the reason the Vatican effectively sabotaged the C14 test and has subsequently denied all further scientific investigation. He should be more specific when he writes “C14 test was sabotaged”..","date":"2013-08-10","mins":"3:57 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","title":"Here is a crowdfunding campaign we should be able to support"},{"id":"comment-41095","author":"anoxie","post":"Ok, I didn’t get he thought of a “divine blood”. That’s far fetched..","date":"2013-08-12","mins":"2:59 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","title":"Here is a crowdfunding campaign we should be able to support"},{"id":"comment-41329","author":"anoxie","post":"Was Gonella a scientist ? People responsible for the dating are the one who signed the paper..","date":"2013-08-15","mins":"7:45 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","title":"Here is a crowdfunding campaign we should be able to support"},{"id":"comment-205997","author":"anoxie","post":"Colin has the vehemence and righteousness of a recent convert. Maybe he should re think his scorch hypothesis under the light of the listed properties. “I personally would rather be seen as “Right but Repulsive” than “Wrong but Romantic”.” What about “Wrong and Repulsive”?.","date":"2015-07-17","mins":"1:33 am","url":"https://shroudstory.com/2015/07/16/nicely-summarized-colin/","cat":"art","title":"Nicely Summarized, Colin"},{"id":"comment-26017","author":"anoxie","post":"It seems skeptical inquirer is seriously running out of arguments..","date":"2013-03-01","mins":"8:58 am","url":"https://shroudstory.com/2013/03/01/observations-consistent-with-a-medieval-artist/","cat":"art","title":"Observations Consistent with a Medieval Artist?"},{"id":"comment-15443","author":"anoxie","post":"Restorations may be controversial, at least here, we can reach a consensus to say it is not brilliant..","date":"2012-08-24","mins":"2:35 pm","url":"https://shroudstory.com/2012/08/24/please-keep-her-away-from-the-shroud-of-turin/","cat":"art","title":"Please keep her away from the Shroud of Turin"},{"id":"comment-148525","author":"anoxie","post":"Dan, you wrote in your Shroud of Turin faq: “The similarities between the Pantocrator icon and the image on the Shroud of Turin are startling. It is too significant to be coincidental.” It’s an opinion, but i agree..","date":"2014-09-04","mins":"11:32 am","url":"https://shroudstory.com/2014/09/04/speaking-of-matching-faces/","cat":"art","title":"Speaking of Matching Faces"},{"id":"comment-25601","author":"anoxie","post":"Ok, from a history of art perspective it is ludicrous, but is there any perspective from which it is not ? forensic pathology ? blood stains ? textile ? image ? pollens ? minerals ? ….","date":"2013-02-25","mins":"8:24 am","url":"https://shroudstory.com/2013/02/25/the-art-of-the-impossible/","cat":"art","title":"The Art of the Impossible?"}]
