[{"id":"comment-193056","author":"anoxie","post":"That’s a widespread misunderstanding between confidence interval and significance level. Let’s go back to nature’s article: “The spread of the measurements for sample 1 [the shroud] is somewhat greater than would be expected from the errors quoted.” “somewhat greater”??? that’s the art of British understatement… it is rather the worst scattering acceptable, with a significance level at 5% (according to their own test, chosen a posteriori). Once you’ve accepted this shaky significance level, you can do the math to determine whatever confidence interval..","date":"2015-03-10","mins":"10:52 am","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-193139","author":"anoxie","post":"Just for fun, another case about C14 dating on a less passionate debate: “Existing radiocarbon (14 C) dates on American mastodon (Mammut americanum) fossils from eastern Beringia (Alaska and Yukon) have been interpreted as evidence they inhabited the Arctic and Subarctic during Pleistocene full glacial times (∼18,000 14 C years B.P.). However, this chronology is inconsistent with inferred habitat preferences of mastodons and correlative paleoecological evidence.” Guess what went wrong….","date":"2015-03-11","mins":"2:41 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-19048","author":"anoxie","post":"Why ask for a new test whereas we don’t know for sure what could have gone wrong in the first one ? Step one is to get the data of the 1988 dating..","date":"2012-11-14","mins":"3:43 pm","url":"https://shroudstory.com/2012/11/14/berry-no-matter-where-he-or-she-considers-themselves-to-be-on-the-scale-of-infallibility/","cat":"carbon_14_dating","title":"Berry: No matter where he or she considers themselves to be on the scale of infallibility"},{"id":"comment-193141","author":"anoxie","post":"They actually decided to redate American mastodons because they are mistaken for the much hairier mammoths… But the dating pb didn’t come from the hair, but from a poor sampling and overlooked external contamination..","date":"2015-03-11","mins":"3:52 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-185456","author":"anoxie","post":"“To my way of thinking this plays into the mended shroud explanations…” To my way of thinking much has been written way more convincingly about this issue..","date":"2015-01-22","mins":"3:59 pm","url":"https://shroudstory.com/2015/01/21/bsts-article-by-hugh-farey/","cat":"carbon_14_dating","title":"BSTS Article by Hugh Farey"},{"id":"comment-74344","author":"anoxie","post":"1/ it’s Discovery Channel. 2/ forget quad mosaic. 3/ anoxie : Anyway, ironically enough, they’ve been fooled by their tool… Robert Villareal concluded the threads were made of cotton (no linen, no impurities), whereas Thibault observed microscopically that the same thread (R7) was overwhelmingly made of linen. FTIR spectrum of old cotton blended with old linen +/ impruities from crust ? Hard to interpret, 4/ yes, it looks dirty..","date":"2014-01-24","mins":"2:22 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-73959","author":"anoxie","post":"Hugh Farey : This suggests to me that some attempt was made to stain the backing cloth to make it ‘fit’ the shroud better, quite possibly by smearing it with a cotton pad damp with a mixture of dye and gum arabic. Such a process would only affect the surfaces in contact with the cloth (which is why the backing cloth under the Shroud stayed white) and liberally scatter cotton, dye and gum over the margins of the shroud. Needless to say, all this gunk was removed and had no effect on the C14 dating. Is this consistent with Thibault’s observations ?.","date":"2014-01-21","mins":"1:23 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-73986","author":"anoxie","post":"Do you accept this conclusion (this thread is definitely not linen) ?.","date":"2014-01-21","mins":"4:43 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74008","author":"anoxie","post":"Hugh Farey : Yes. Quite a lot of threads are not linen. I don’t know if this is exclusive to the radiocarbon corner Exactly, you don’t know. You don’t know if your sample is representative of the whole shroud. Don’t you understand this is what invalidates the protocol of the radiocarbon dating ?.","date":"2014-01-21","mins":"5:38 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74525","author":"anoxie","post":"Daveb of wellington nz : The sampling area is clearly anomalous, and unrepresentative of the whole, never mind the details. No other area was sampled.Charles Freeman : So why did John Jackson and Flury Lemberg not spot the anomaly Because they did not look for it ? Has Dr Flury Lemberg ruled out the presence of cotton ? Any quotation ?.","date":"2014-01-25","mins":"6:57 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74649","author":"anoxie","post":"Thank you for these precisions Thibault, obviously, the anomaly of the C14 corner regarding the content of vanillin is another strong argument pointing to a flawed sampling..","date":"2014-01-26","mins":"6:55 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74210","author":"anoxie","post":"From threads to shreds… David Goulet : He [Hugh] is pointing out gaps he sees between observations and conclusions. Can we get back to evidence based discussion and stop with the judgements. Here are the gaps i can see between observations and Hugh’s conclusions: 1/ how can you talk of superficial contamination (superficial gunk and bla bla) whereas cotton has been found interwoven with linen, whereas R1 is a whole thread (not shred). 2/ how do you explain the difference between the amount of cotton found in the Raes/radiocarbon sample and threads from main parts of the shroud. 3/ how do you know the cleaning process could have separated linen from cotton : Hugh Farey : all this gunk was removed and had no effect on the C14 dating. Seriously ?! Give me a break. Hugh’s conclusions are speculations based on misunderstandings..","date":"2014-01-23","mins":"5:40 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-73969","author":"anoxie","post":"Not at all i would say. You can’t have 1/ a superficial “gunk” (made of cotton/dye/gum) and 2/ cotton fibers in the core of individually coated threads. Image from the LANL are unequivocal..","date":"2014-01-21","mins":"2:19 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74233","author":"anoxie","post":"Charles Freeman : As there are so few cotton fibres found on the Shroud it would need an intensive examination of the Shroud to see whether they were all over the Shroud but as Jull said some of these fibres may have drifted in anyway from bags in which the Shroud was folded. So few cotton fibres ? On the main Shroud ? yes On the radiocarbon/Raes samples ? no: When LANL has conducted FTIR analysis, they could only find cotton, not linen. When Thibault has intesively studied R7 he has found cotton, mainly around the thread, but into the core too, eliminating an external contamination. Have cotton fibers drifted from bags which contained the Shroud into the core of Shroud fibers in the radiocarbon area ? Mr Jull is not running out of imagination but i don’t buy it..","date":"2014-01-23","mins":"9:28 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74243","author":"anoxie","post":"Charles Freeman : Please elaborate what this cotton was and where it came from. Please, refer to the protocol of the 1988 radiocarbon dating..","date":"2014-01-23","mins":"10:40 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74259","author":"anoxie","post":"No one, as you can see. No reference to the composition of what they dated. One has to trust them, it was linen… until you find cotton..","date":"2014-01-23","mins":"1:11 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-73975","author":"anoxie","post":"Ohio shroud conference : Villarreal also revealed that, during testing, one of the threads came apart in the middle forming two separate pieces. A surface resin, that may have been holding the two pieces together, fell off and was analyzed. Surprisingly, the two ends of the thread had different chemical compositions, lending credence to the theory that the threads were spliced together during a repair. A superfical gunk on an homogeneous thread ?.","date":"2014-01-21","mins":"3:00 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74279","author":"anoxie","post":"Charles Freeman : I just want to know what this analysis was, what is was done on, etc, as I , and perhaps others reading this discussion, know nothing about it and it seems very mysterious as no one has yet proved that cotton makes up more than a tiny, tiny part of the Shroud and that only in fibres. I thought you knew about LANL’s analysis. Anyway, ironically enough, they’ve been fooled by their tool… as the C14 daters were fooled by the precision of the measure neglecting the protocol sampling. Robert Villareal concluded the threads were made of cotton (no linen, no impurities), whereas Thibault observed microscopically that the same thread (R7) was overwhelmingly made of linen, but with a significant amount of cotton fibers (up to 20%), a part of which in the core of the thread..","date":"2014-01-23","mins":"3:29 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-108098","author":"anoxie","post":"I can’t see any one more qualified than Rogers on image formation, in Turin or anywhere else, but maybe i’ve missed another Valencia consensus or another urban legend..","date":"2014-05-01","mins":"2:07 pm","url":"https://shroudstory.com/2014/05/01/comment-promoted-john-klotz-on-how-ray-rogers-gets-critiqued/","cat":"carbon_14_dating","title":"Comment Promoted:  John Klotz on How Ray Rogers Gets Critiqued"},{"id":"comment-108123","author":"anoxie","post":"No (naturalistic) alternative..","date":"2014-05-01","mins":"2:32 pm","url":"https://shroudstory.com/2014/05/01/comment-promoted-john-klotz-on-how-ray-rogers-gets-critiqued/","cat":"carbon_14_dating","title":"Comment Promoted:  John Klotz on How Ray Rogers Gets Critiqued"},{"id":"comment-74212","author":"anoxie","post":"Yes..","date":"2014-01-23","mins":"5:42 am","url":"https://shroudstory.com/2014/01/22/comment-promoted-are-the-quad-mosaics-meaningless/","cat":"carbon_14_dating","title":"Comment Promoted: Are the Quad Mosaics Meaningless?"},{"id":"comment-127804","author":"anoxie","post":"“As can be seen, Oxford’s 780 720 (years before 1950) age range (1170 1230) doesn’t overlap either Arizona’s (1273 1335) or Zurich’s (1250 1298). And Arizona and Zurich only overlap by 25 years (Arizona’s 1273 minimum and Zurich’s 1298 maximum). This is inexplicable given that the laboratories’ Shroud samples were all from the same postage stamp size[33] sliver of linen, and all were dated by the same AMS method. But it is consistent with my theory that the Shroud sample’s ages, unlike those of the non Shroud samples, were not real ages but were randomly generated by a hacker’s computer program within limits to ensure that the Shroud’s radiocarbon dates, when calibrated, would cluster around 1325 ± 65 years. It is also evidence that all three laboratories’ AMS control console computers were hacked, not only Arizona’s.” All this conspiracy theory is insane, but this is really twisted, why a hacker would have bothered to generate a set of data undermining the validity of the dating ?.","date":"2014-06-08","mins":"3:53 pm","url":"https://shroudstory.com/2014/06/08/conspiracy-theory-part-4/","cat":"carbon_14_dating","title":"Conspiracy Theory Part 4"},{"id":"comment-127903","author":"anoxie","post":"” In other words, he is referring to a certainly of well over the 95% confidence level reported in the Nature paper. In terms of the standard deviation from the mean, he could be referring to three (99.73% confidence) or even four (99.99%), which in no way contradicts the conclusion of the Nature paper.” And again, a misunderstanding of statistics….","date":"2014-06-09","mins":"1:44 am","url":"https://shroudstory.com/2014/06/08/conspiracy-theory-part-4/","cat":"carbon_14_dating","title":"Conspiracy Theory Part 4"},{"id":"comment-124555","author":"anoxie","post":"1325 +/ 65, significance level* : 5% (the lowest acceptable) * The probability of obtaining, by chance, a scatter among the three dates as high as that observed, under the assumption that the quoted errors reflect all sources of random variation. If there is an anomaly in the sample, it is no longer a random variation. There is no valid radiocarbon date..","date":"2014-05-25","mins":"5:47 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","title":"Dissent of the day:  I’ll say one thing for Jones"},{"id":"comment-209716","author":"anoxie","post":"“I wonder to what extent personal agendas might be behind the present paper.” I don’t..","date":"2015-09-06","mins":"6:14 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-208711","author":"anoxie","post":"“But is there anything in it that might impact the accuracy of the shroud’s dating?” Not directly, but it helps to understand what a robust result is, and the results of the radiocarbon dating of the Shroud are not robust. The choice of the statistical analysis, which ultimately lead to a tiny 5% significance level, is subjective..","date":"2015-08-22","mins":"4:08 am","url":"https://shroudstory.com/2015/08/22/food-for-thought-an-important-paper-on-radiocarbon-dating/","cat":"carbon_14_dating","title":"Food for Thought: An Important Paper on Radiocarbon Dating"},{"id":"comment-134429","author":"anoxie","post":"Coincidence vs Congruence : HPM upper image – TS dorsal image, folding under the buttocks..","date":"2014-06-30","mins":"3:56 am","url":"https://shroudstory.com/2014/06/30/its-a-total-feeling-sort-of-thing/","cat":"carbon_14_dating","title":"It’s a total feeling sort of thing."},{"id":"comment-174463","author":"anoxie","post":"Just another illustration why New Atheism is just ideology thinly veiled behind this pseudo rationalism façade..","date":"2014-12-03","mins":"9:05 am","url":"https://shroudstory.com/2014/12/03/jerry-coyne-pope-francis-endorses-the-fake-shroud-of-turin/","cat":"carbon_14_dating","title":"Jerry Coyne:  Pope Francis endorses the fake Shroud of Turin"},{"id":"comment-174488","author":"anoxie","post":"In his mind, it’s ideology, don’t even bother..","date":"2014-12-03","mins":"1:08 pm","url":"https://shroudstory.com/2014/12/03/jerry-coyne-pope-francis-endorses-the-fake-shroud-of-turin/","cat":"carbon_14_dating","title":"Jerry Coyne:  Pope Francis endorses the fake Shroud of Turin"},{"id":"comment-174495","author":"anoxie","post":"There are lighter areas all over the image! Yet another theory, the “patchwork theory”, the shades of whites resulting from different patches of cloth applied all over the body… Absurd, you can’t explain the image without being systematic..","date":"2014-12-03","mins":"1:55 pm","url":"https://shroudstory.com/2014/12/03/jerry-coyne-pope-francis-endorses-the-fake-shroud-of-turin/","cat":"carbon_14_dating","title":"Jerry Coyne:  Pope Francis endorses the fake Shroud of Turin"},{"id":"comment-48531","author":"anoxie","post":"Scientists thought C14 dating would hit the target. Then they drew the circle around. Problem is, there was no target..","date":"2013-10-23","mins":"1:27 pm","url":"https://shroudstory.com/2013/10/23/jones-none-of-the-three-laboratories-dated-its-sample-to-between-1260-and-1390/","cat":"carbon_14_dating","title":"Jones:  “none of the three laboratories dated its sample to between 1260 and 1390”"},{"id":"comment-197282","author":"anoxie","post":"The Turin Shroud is more real today because the 1988 carbon dating has been questionned. The leading explanation is an external contamination by cotton fibers. What kind of non invasive experiments would you carry out to test this hypothesis? direct examination of shroud fibers, UV/VIS reflectance and fluorescence measurements as well as Raman spectroscopic measurements….","date":"2015-04-23","mins":"6:22 am","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","title":"Look at what happened between 1988 and 2015"},{"id":"comment-197299","author":"anoxie","post":"Hi Nabber, don’t worry, there is a very short answer to my comment..","date":"2015-04-23","mins":"7:58 am","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","title":"Look at what happened between 1988 and 2015"},{"id":"comment-197473","author":"anoxie","post":"All of the above, has been done..","date":"2015-04-25","mins":"2:53 am","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","title":"Look at what happened between 1988 and 2015"},{"id":"comment-192520","author":"anoxie","post":"“The scientists who took the sample knew what they were doing.” Would the same scientists be confident in the results of a biopsy of their prostate made of a single tissue sample?.","date":"2015-03-05","mins":"11:37 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-13944","author":"anoxie","post":"Everything had been said more than 20 years ago. Concerning the C14 datation : S. J. Lukasik : It always surprises me when otherwide competent people fail to observe the most obvious scientific procedures. Concerning the conservation of the Shroud : S. J. Lukasik : … the Church presumably thinks that the initiative for the preservation of its art and relics is its alone. The bureaucratic politics are baffling, yet the shroud maybe one of the most significant objects in the world..","date":"2012-07-18","mins":"10:38 am","url":"https://shroudstory.com/2012/07/17/paper-chase-sturps-fascinating-1988-draft-protocol-for-future-examinations-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Paper Chase:  STURP’s Fascinating 1988 \"Draft Protocol for Future Examinations of the Shroud of Turin\""},{"id":"comment-27431","author":"anoxie","post":"They could remain factual, present the radiocarbon dating, and quote Pr Ramsey, the director of the Oxford Radiocarbon Laboratory, who claimed : everyone […] need to have a critical look on the evidence [including the radiocarbon dating] that they have come up with in order for us to try to work out somekind of a coherent story that fits and tells us the truth of the history of this intriguing cloth Let’s hope the next wave of articles surrounding the Shroud’s technological exposition will have this much needed critical look..","date":"2013-03-16","mins":"8:14 am","url":"https://shroudstory.com/2013/03/16/official-junk/","cat":"carbon_14_dating","title":"Official Junk"},{"id":"comment-172648","author":"anoxie","post":"These kind of limits should have appeared in the discussion of the Nature’s paper. But how do you make beautiful graphs and charts with five significant digits?!? You ASSUME sampling is flawless..","date":"2014-11-23","mins":"5:04 am","url":"https://shroudstory.com/2014/11/23/paper-chase-the-shroud-of-turin-and-its-radiodating/","cat":"carbon_14_dating","title":"Paper Chase:  The Shroud of Turin and its Radiodating"},{"id":"comment-142368","author":"anoxie","post":"What about your cleaning protocole ? https://shroudstory.com/2012/11/14/berry no matter where he or she considers themselves to be on the scale of infallibility/.","date":"2014-08-05","mins":"3:44 am","url":"https://shroudstory.com/2014/08/04/photo-rich-wonderful-presentation-by-emanuela-marinelli/","cat":"carbon_14_dating","title":"Photo Rich, Wonderful Presentation by Emanuela Marinelli"},{"id":"comment-9030","author":"anoxie","post":"“‘scorchography’, a branch of the ancient art of pyrography” why not, but the best way is to summit such an hypothesis to as peer reviewed journal..","date":"2012-03-07","mins":"1:37 pm","url":"https://shroudstory.com/2012/02/28/paper-chase-to-know-a-veil-by-philip-ball/","cat":"carbon_14_dating","title":"Paper Chase: To know a veil by Philip Ball"},{"id":"comment-142356","author":"anoxie","post":"“the science begins at the laboratories” Hugh, the science begins at the sampling. But this thought sums up the fiasco of the dating..","date":"2014-08-05","mins":"2:38 am","url":"https://shroudstory.com/2014/08/04/photo-rich-wonderful-presentation-by-emanuela-marinelli/","cat":"carbon_14_dating","title":"Photo Rich, Wonderful Presentation by Emanuela Marinelli"},{"id":"comment-17582","author":"anoxie","post":"The limitations of the C14 dating are its sampling protocol and the absence of chemical/physical characterisation of the sample. These are facts. On which data can we rely to invalidate/validate the dating ? – raw figures of the dating – characterisation of the reserve sample.","date":"2012-10-13","mins":"5:42 am","url":"https://shroudstory.com/2012/07/27/savage-treatment-in-randi-land/","cat":"carbon_14_dating","title":"Savage Treatment in Randi Land"},{"id":"comment-9495","author":"anoxie","post":"“That’s sham inquiry and it’s worthless” Maybe. And her post, is useless. Note that “skeptic” on the internet, means “conspiracy theory”..","date":"2012-03-21","mins":"3:09 pm","url":"https://shroudstory.com/2012/03/21/sharon-hill-should-check-out-her-facts/","cat":"carbon_14_dating","title":"Sharon Hill should check out her facts"},{"id":"comment-921","author":"anoxie","post":"“you might get the idea that he is thinking seriously about John and Rebecca’s carbon monoxide hypothesis.” Exactly, and that was a big joke. But Pr Ramsey certainly knew about LANL’s work and accepted to test carbon monoxide hypothesis which he knew couldn’t explain the gap between 0 and 1300 to say to the press “hi, i’m an open minded man”. I bet he’s convinced the 1988 datation was flawed, he just can’t say it so easily..","date":"2010-01-07","mins":"1:16 pm","url":"https://shroudstory.com/2008/08/19/sort-of-strange-shroud-of-turin-news-coverage/","cat":"carbon_14_dating","title":"Sort of Strange Shroud of Turin News Coverage"},{"id":"comment-144008","author":"anoxie","post":"Let’s be clear, it is not to be prudent or neutral to present Hugh Duncan’s article as “back to the scientific side”..","date":"2014-08-15","mins":"3:46 am","url":"https://shroudstory.com/2014/08/13/stephen-jones-wants-bsts-to-remove-hugh-farey-as-editor-of-the-newsletter/","cat":"carbon_14_dating","title":"Stephen Jones Wants BSTS to Remove Hugh Farey as Editor of the Newsletter"},{"id":"comment-143860","author":"anoxie","post":"It’s not neutralism, but relativism. Is Hugh Ducan’s article science or art work ? Does Hugh’s editorial help putting Hugh Ducan’s work in perspective or does it mix things up ?.","date":"2014-08-14","mins":"5:54 am","url":"https://shroudstory.com/2014/08/13/stephen-jones-wants-bsts-to-remove-hugh-farey-as-editor-of-the-newsletter/","cat":"carbon_14_dating","title":"Stephen Jones Wants BSTS to Remove Hugh Farey as Editor of the Newsletter"},{"id":"comment-144169","author":"anoxie","post":"You’re are biased David, ask the question the other way round: presenting Colin Berry’s work as art work and not science, would it be neutral ? Hugh Duncan’s article is art work, not science, the author himself doesn’t claim otherwise. Hugh editorial is misleading..","date":"2014-08-16","mins":"5:50 am","url":"https://shroudstory.com/2014/08/13/stephen-jones-wants-bsts-to-remove-hugh-farey-as-editor-of-the-newsletter/","cat":"carbon_14_dating","title":"Stephen Jones Wants BSTS to Remove Hugh Farey as Editor of the Newsletter"},{"id":"comment-144232","author":"anoxie","post":"Whatever, an editor doesn’t have to be neutral. But to go further on science and “contact scorching” a few links pointing to Thibault Heimburger’s and Colin Berry’s views may have been informative..","date":"2014-08-16","mins":"3:16 pm","url":"https://shroudstory.com/2014/08/13/stephen-jones-wants-bsts-to-remove-hugh-farey-as-editor-of-the-newsletter/","cat":"carbon_14_dating","title":"Stephen Jones Wants BSTS to Remove Hugh Farey as Editor of the Newsletter"},{"id":"comment-144780","author":"anoxie","post":"Hugh could you be more specific or do i use the N word ?.","date":"2014-08-19","mins":"12:04 pm","url":"https://shroudstory.com/2014/08/13/stephen-jones-wants-bsts-to-remove-hugh-farey-as-editor-of-the-newsletter/","cat":"carbon_14_dating","title":"Stephen Jones Wants BSTS to Remove Hugh Farey as Editor of the Newsletter"},{"id":"comment-144781","author":"anoxie","post":"Mechanism that leads to thin oil films reminds me of the theory of a certain R. R., go try..","date":"2014-08-19","mins":"12:09 pm","url":"https://shroudstory.com/2014/08/13/stephen-jones-wants-bsts-to-remove-hugh-farey-as-editor-of-the-newsletter/","cat":"carbon_14_dating","title":"Stephen Jones Wants BSTS to Remove Hugh Farey as Editor of the Newsletter"},{"id":"comment-144796","author":"anoxie","post":"Ok then, light hitting a photographic plate is a natural, not man induced, phenomenon. One has just to produce aluminium, or a photographic plate, or… whatever..","date":"2014-08-19","mins":"1:30 pm","url":"https://shroudstory.com/2014/08/13/stephen-jones-wants-bsts-to-remove-hugh-farey-as-editor-of-the-newsletter/","cat":"carbon_14_dating","title":"Stephen Jones Wants BSTS to Remove Hugh Farey as Editor of the Newsletter"},{"id":"comment-144790","author":"anoxie","post":"I mean of the natural of man induced phenomenon you’ve mentionned: first one – is in Rogers’ theory second one – i’m still looking for a thin layer/surface of aluminium not man induced have another try to illustrate your point..","date":"2014-08-19","mins":"12:42 pm","url":"https://shroudstory.com/2014/08/13/stephen-jones-wants-bsts-to-remove-hugh-farey-as-editor-of-the-newsletter/","cat":"carbon_14_dating","title":"Stephen Jones Wants BSTS to Remove Hugh Farey as Editor of the Newsletter"},{"id":"comment-144804","author":"anoxie","post":"Ok, so you’ve just stalled on aluminium. Or should we interprete the gold leaf as the third candidate to a thin layer “natural of man induced phenomenon” ?.","date":"2014-08-19","mins":"2:29 pm","url":"https://shroudstory.com/2014/08/13/stephen-jones-wants-bsts-to-remove-hugh-farey-as-editor-of-the-newsletter/","cat":"carbon_14_dating","title":"Stephen Jones Wants BSTS to Remove Hugh Farey as Editor of the Newsletter"},{"id":"comment-143709","author":"anoxie","post":"Have the radiocarbon laboratories duped people (and Nature) by a statistical trick ?.","date":"2014-08-13","mins":"12:35 pm","url":"https://shroudstory.com/2014/08/13/stephen-jones-wants-bsts-to-remove-hugh-farey-as-editor-of-the-newsletter/","cat":"carbon_14_dating","title":"Stephen Jones Wants BSTS to Remove Hugh Farey as Editor of the Newsletter"},{"id":"comment-125545","author":"anoxie","post":"Let’s answer this way: What are the odds against a “statistically valid” 1325 +/ 65 result if you re test the shroud rigourously ? Astronomical, definitely..","date":"2014-05-29","mins":"2:58 pm","url":"https://shroudstory.com/2014/05/29/the-challenge-for-stephen-now/","cat":"carbon_14_dating","title":"The Challenge for Stephen Now"},{"id":"comment-125892","author":"anoxie","post":"I perfectly understand your argument. You answered: “The heterogeneity of the sample is irrelevant in this context, as the date of any sample is from the whole sample, whether the new and old threads were neatly separated or intricately blended makes no difference” You still don’t get it : if the sample is heterogeneous, you can’t use Christopher Ramsey’s Ox Cal and an online carbon dating calculator, simple as that (basic assumption is sub samples’ variations result from random fluctuations, no trend, no gradient). Hugh you can’t do the math, but nobody said risk analysis is easy..","date":"2014-05-31","mins":"7:21 am","url":"https://shroudstory.com/2014/05/29/the-challenge-for-stephen-now/","cat":"carbon_14_dating","title":"The Challenge for Stephen Now"},{"id":"comment-125513","author":"anoxie","post":"“The answer (easily calculable using Christopher Ramsey’s Ox Cal and an online carbon dating calculator) is about 1/10.” Another figure you throw to the wind. This is non sense, you’ve no idea of how homogeneous the scatter of new linen threads is, heterogeneity is the key parameter, but unknown. You simply can’t do the math..","date":"2014-05-29","mins":"12:41 pm","url":"https://shroudstory.com/2014/05/29/the-challenge-for-stephen-now/","cat":"carbon_14_dating","title":"The Challenge for Stephen Now"},{"id":"comment-125682","author":"anoxie","post":"That’s the point, i’m still wondering wether this dating was a failure or a scientific fraud : ” there is only a difference in degree between `cooking’ the data and inventing a whole experiment out of thin air” ‘cooking’ is the statistical shoehorn used to get a positive result out of this trend..","date":"2014-05-30","mins":"6:12 am","url":"https://shroudstory.com/2014/05/29/the-challenge-for-stephen-now/","cat":"carbon_14_dating","title":"The Challenge for Stephen Now"},{"id":"comment-125532","author":"anoxie","post":"You don’t get it. What is the probability to get any valid date (significance level > 5%) given an heterogeneous sample ? It depends on the number of sub samples you test and their (local) heterogeneity. You can’t do the math..","date":"2014-05-29","mins":"2:00 pm","url":"https://shroudstory.com/2014/05/29/the-challenge-for-stephen-now/","cat":"carbon_14_dating","title":"The Challenge for Stephen Now"},{"id":"comment-125728","author":"anoxie","post":"I think the fraud theory is an option, but fraud by “cooking” the data. It’s old news : http://www.shroud.com/vanhels3.htm.","date":"2014-05-30","mins":"10:36 am","url":"https://shroudstory.com/2014/05/30/the-collapse-of-the-fraud-theory/","cat":"carbon_14_dating","title":"The Collapse of the Fraud Theory"},{"id":"comment-210421","author":"anoxie","post":"This is merely Rogers bashing, unsupported by facts obviously..","date":"2015-09-15","mins":"1:01 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","title":"The Chemist Rogers and Plastic Bags"},{"id":"comment-9029","author":"anoxie","post":"“One can only speculate as to why the three labs agreed to go ahead and test contiguous specimens…” They tested contiguous samples, founds 5% signifignacy, decided to publish. One may find out it has been the biggest mistake of C14 dating history. Nowadays scientists would be more carefull (cf Dr Ramsey himself)..","date":"2012-03-07","mins":"1:33 pm","url":"https://shroudstory.com/2012/03/05/you-must-be-kidding-colin-berry/","cat":"carbon_14_dating","title":"You must be kidding, Colin Berry"},{"id":"comment-9042","author":"anoxie","post":"Nothing wrong, just a coincidence. Here p=0.05, perfect, but that is the lowest significancy admitted. Now, if the basic assumption (samples are homogeneous) is challenged, a/ C14 datation can’t be applied b/ it explains why the significancy is so dramatically low. When they published the article in 1986, no one could imagine that the samples were slightly different… and they didn’t bother to analyse them, chemically or physically..","date":"2012-03-07","mins":"4:35 pm","url":"https://shroudstory.com/2012/03/05/you-must-be-kidding-colin-berry/","cat":"carbon_14_dating","title":"You must be kidding, Colin Berry"}]
