[{"id":"comment-28866","author":"anoxie","post":"Colinsberry : It would hardly make sense to have active fibrinolysis in an external blood clot, would it? When did the blood become external ?.","date":"2013-03-30","mins":"1:35 pm","url":"https://shroudstory.com/2013/03/30/awaiting-live-stream-from-rai-uno/","cat":"event","title":"Awaiting Live Stream from RAI Uno"},{"id":"comment-150190","author":"anoxie","post":"“Meantime we shall have to wait until such time as Vatican authorities have more confidence in scientists’ abilities and open mindedness than they seem to have at present. Too much of the science seems to be agenda driven, regardless of what side of the authenticity divide one looks at it.” It seems wise..","date":"2014-09-11","mins":"9:00 am","url":"https://shroudstory.com/2014/09/10/a-report-on-the-bari-conference/","cat":"conference","title":"A Report on the Bari Conference"},{"id":"comment-28923","author":"anoxie","post":"Colinsberry : long after the blood had clotted and dried. This is the tricky part… We don’t know how long the blood was exposed to skin/air before it hit the cloth, we don’t know if it had clotted at all..","date":"2013-03-31","mins":"4:08 am","url":"https://shroudstory.com/2013/03/30/awaiting-live-stream-from-rai-uno/","cat":"event","title":"Awaiting Live Stream from RAI Uno"},{"id":"comment-28861","author":"anoxie","post":"I don’t know who talked about blood clots. It could simply be a differential migration between serum and figurated elements/heavy protein. Was blood fluid ? viscous ? solid ? One has to study pathological, post mortem fibrinolysis/coagulation. This is done in routine for ICU patients, obviously it is less usefull after the death of the patient. But I don’t take for granted that the boold formed solid blood clots. Thibault, have you got any reference on this issue ?.","date":"2013-03-30","mins":"12:54 pm","url":"https://shroudstory.com/2013/03/30/awaiting-live-stream-from-rai-uno/","cat":"event","title":"Awaiting Live Stream from RAI Uno"},{"id":"comment-50300","author":"anoxie","post":"Colin, when you agree with Matt, on which point(s) specifically do you agree : do you think the test is incomplete ? do you think the C 14 content is a function of vertical location ? do you think the samples were not randomly chosen ? do you think more tests had to be done beyond the boundary ?.","date":"2013-11-07","mins":"10:13 am","url":"https://shroudstory.com/2013/11/06/barrie-on-ewtn-liveand-again-in-repeats/","cat":"event","title":"Barrie on EWTN, Live–and again in repeats"},{"id":"comment-50306","author":"anoxie","post":"Thank you for this comprehensive answer. No, i’m not a professional Shroud researcher, and i’m not Colodaro based..","date":"2013-11-07","mins":"10:46 am","url":"https://shroudstory.com/2013/11/06/barrie-on-ewtn-liveand-again-in-repeats/","cat":"event","title":"Barrie on EWTN, Live–and again in repeats"},{"id":"comment-17426","author":"anoxie","post":"I was talking of Roger finding cotton in the C14 threads and the FTIR spectroscopy made by the LANL on C14 threads. Does Pr Ramsey see these tests conclsive or not to invalid the 1988 dating ?.","date":"2012-10-10","mins":"2:20 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17432","author":"anoxie","post":"Ron, we agree on this. But is the question of the 1988 datation solved ? We could think so, in 2008, after LANL FTIR spectroscopy analysis and Rogers’ article. But Philip Ball woke up and wrote in an editorial in Nature that ” the status of the Shroud of Turin is murkier than ever'”, at the precise moment we could think the question of the 1988 datation was solved. My conclusion is he did not give much credit to Rogers’ and LANL’s works..","date":"2012-10-10","mins":"3:40 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17440","author":"anoxie","post":"I care what Pr Ramsey thinks of Rogers’ and LANL’s works..","date":"2012-10-10","mins":"4:48 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17469","author":"anoxie","post":"I think Barrie Schwortz, Ray Rogers or Robert Villereal may have done so. We often hear that the Church is reluctant to allow new tests, this is the main argument of Philip Ball, but isn’t it up to the labs in charge of the datation to allow a critical examination of the reserve sample ? As Rogers put it : A gum/dye/mordant coating is easy to observe on Raes and radiocarbon yarns. No other part of the shroud shows such a coating..","date":"2012-10-11","mins":"7:11 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17460","author":"anoxie","post":"Rogers’ did a great work, but with the limited means he had. LANL’s did the work, but unofficially, and did not publish the results. Then why can Philip Ball write in Nature that “the future of the shroud is merkier than ever” ? Partly because the very labs which did the dating refuse to look at the evidence and to characterize independantly what they dated (the reserve sample is still there). Now is this merely political or does Pr Ramsey genuinely think the level of proof is not good enough to justify tests on the reserve sample ? I don’t know..","date":"2012-10-11","mins":"2:59 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-152237","author":"anoxie","post":"Colin Berry is wrong about scorching. PDL is wrong about lasers. So why bother?.","date":"2014-09-18","mins":"10:36 am","url":"https://shroudstory.com/2014/09/18/colin-berry-ok-ive-made-a-start-on-that-di-lazzaro-pdf/","cat":"conference","title":"Colin Berry:  OK, I’ve made a start on that Di Lazzaro pdf"},{"id":"comment-17422","author":"anoxie","post":"Before asking for a new radio carbon dating, the 3 labs involved in the 1988 dating should agree on what went wrong, if they consider anything went wrong. Pr Christopher Ramsey thinks more testing is needed. Maybe the first test should be done on the reserve sample of the 1988 dating. Or maybe he considers Rogers’ and LANL’s work answered the question..","date":"2012-10-10","mins":"1:23 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17439","author":"anoxie","post":"I didn’t mean another datation, but another independant analysis to characterize the reserve sample. The three labs were responsible for the datation, they should feel concerned by this issue. It’s an easy way out to claim that “more testing is needed”. Either they think there has been a sampling problem or not..","date":"2012-10-10","mins":"4:45 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-152416","author":"anoxie","post":"You mean Nabber has leeched off Colin’s content about Di Lazzaro? Nabber, your life is going to be difficult..","date":"2014-09-19","mins":"3:04 am","url":"https://shroudstory.com/2014/09/18/colin-berry-ok-ive-made-a-start-on-that-di-lazzaro-pdf/","cat":"conference","title":"Colin Berry:  OK, I’ve made a start on that Di Lazzaro pdf"},{"id":"comment-17967","author":"anoxie","post":"To be precise : Colin Berry claimed that Maillard reaction is simply not thermodynamically possible at ambient temperature. Adrie van der Hoeven claims that Rogers simply “falsified his own Maillard hypothesis”..","date":"2012-10-21","mins":"5:59 am","url":"https://shroudstory.com/2012/10/18/denis-mannixs-maillard-experiment-proposals/","cat":"event","title":"Denis Mannix’s Maillard experiment proposals"},{"id":"comment-22816","author":"anoxie","post":"This would be great, i’d like to know Pr Jumper’s latest views on the Shroud..","date":"2013-01-27","mins":"6:45 am","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","title":"Eric J. Jumper to Speak on the Shroud of Turin"},{"id":"comment-18398","author":"anoxie","post":"Hugh Farey : however he does seem to have changed his earlier position slightly in favour of a possibility that gas diffusion plays a bigger part than he first thought. During the S Tu RP they rules out diffusion because the image is superficial. Then, 20 years later, he run new tests and found out it was the reactant on the cloth which could be superficial but gases could have diffused through the cloth. His theory seems to have been dismissed in Shroud circles. Evidence of starch is not obvious, reactive amines initially proposed (cadaverine and putrecine) have been ruled out. But his views on kinetics and diffusion are very interesting, and a chemical reaction is a credible rational explanation. If you have time, you should try to reproduce his experiments to determine reachable resolution thanks to a diffusion mechanism..","date":"2012-10-27","mins":"1:13 am","url":"https://shroudstory.com/2012/10/23/fly-on-the-wall-summary-of-the-bsts-meeting/","cat":"event","title":"Fly on the wall summary of the BSTS Meeting"},{"id":"comment-18367","author":"anoxie","post":"Could Denis Mannix quote Rogers’ claim ? I’m not in Shroud circles, and when I asked Thibault for more details about Rogers’ hypothesis, there was no mention of thermal currents. I think diffusion is the distant mechanism involved in body image formation. But image formation includes contact and diffusion..","date":"2012-10-26","mins":"1:13 pm","url":"https://shroudstory.com/2012/10/23/fly-on-the-wall-summary-of-the-bsts-meeting/","cat":"event","title":"Fly on the wall summary of the BSTS Meeting"},{"id":"comment-18375","author":"anoxie","post":"Hugh Farey : Rogers dismisses any form of gaseous diffusion as responsible for the image This is a complete misunderstanding of Rogers’ hypothesis. One step foward, two steps backward..","date":"2012-10-26","mins":"3:07 pm","url":"https://shroudstory.com/2012/10/23/fly-on-the-wall-summary-of-the-bsts-meeting/","cat":"event","title":"Fly on the wall summary of the BSTS Meeting"},{"id":"comment-17137","author":"anoxie","post":"This exposition is a good introduction to the shroud. Don’t expect too much on scientific isssues (though it clearly explains basic properties), but if you can, go for it, there are quality reproductions of the shroud..","date":"2012-10-01","mins":"5:02 pm","url":"https://shroudstory.com/2012/02/23/more-on-exhibition-of-the-shroud-of-turin-in-mlaga-spain/","cat":"event","title":"More on exhibition of the Shroud of Turin in Málaga, Spain"},{"id":"comment-18383","author":"anoxie","post":"Ok. So far the best (and most coherent) explanation of his hypothesis is here : ROGERS’ MAILLARD REACTION.","date":"2012-10-26","mins":"5:25 pm","url":"https://shroudstory.com/2012/10/23/fly-on-the-wall-summary-of-the-bsts-meeting/","cat":"event","title":"Fly on the wall summary of the BSTS Meeting"},{"id":"comment-151192","author":"anoxie","post":"“Hostile critics will have an easy target, and perhaps they will think they are scoring against the Shroud, whereas they will only be hitting the errors of Dr. Hynek.” nov. 4, 1951. Edward A. Wuenschel Dr Hyneks are not an endangered species..","date":"2014-09-15","mins":"12:00 pm","url":"https://shroudstory.com/2014/09/15/now-available-two-atsi-bari-papers-now-available-on-enea-frascati-website/","cat":"conference","title":"Now Available:  Two ATSI Bari Papers on ENEA Frascati Website"},{"id":"comment-17971","author":"anoxie","post":"“Denis Mannix, chemist, has been revisiting the material published on the Maillard reaction theory and will reveal the results of his investigation so far.” I’m waiting for a comprehensive review of literature and the results of his investigation..","date":"2012-10-21","mins":"8:03 am","url":"https://shroudstory.com/2012/10/21/on-the-day-of-the-bsts-meeting/","cat":"event","title":"On the Day of the BSTS Meeting"},{"id":"comment-199535","author":"anoxie","post":"Let’s ask to another prominent speaker, Joseph Zyss, what he thinks of Di Lazzaro’s experiment..","date":"2015-05-19","mins":"1:49 pm","url":"https://shroudstory.com/2015/05/19/paolo-di-lazzaro-to-speak-at-fiat-lux-conference/","cat":"conference","title":"Paolo Di Lazzaro to Speak at Fiat Lux Conference"},{"id":"comment-98618","author":"anoxie","post":"Scientifically interpreting gray scale into 3 D data means thinking of an underlying image formation mechanism and a shroud body configuration. These points should be explicitly mentioned..","date":"2014-04-12","mins":"5:11 am","url":"https://shroudstory.com/2014/04/12/petrus-soons-to-present-his-scientific-research-at-the-uninversity-of-miami/","cat":"event","title":"Petrus Soons to Present His Scientific Research at the University of Miami"},{"id":"comment-99997","author":"anoxie","post":"Yes, at least the basic step seems to be “gray scale mapping” if one reads shroud3d.com. Then there must have been several “procedures” to get “anatomically near perfect 3 D images”, which are great, but not scientific. Let’s think of the fuzzy borders and local resolution variations, they’ve disappeared in the final image. Theoretically, if you consider a high map, you assume one point on the shroud corresponds to one point on the body. This is right for contact points but not for distant points, which explains why this approach is basically flawed..","date":"2014-04-16","mins":"1:51 pm","url":"https://shroudstory.com/2014/04/12/petrus-soons-to-present-his-scientific-research-at-the-uninversity-of-miami/","cat":"event","title":"Petrus Soons to Present His Scientific Research at the University of Miami"},{"id":"comment-99636","author":"anoxie","post":"The problem is not how you treat the 3 D data (into a hologram, a bronze or a 3 D printer), but how you generate these data. It seems “the 3 D information was extracted by means of gray scale mapping (also called displacement mapping) by Galmarini in Argentina”, VP8 style, no more..","date":"2014-04-15","mins":"2:48 pm","url":"https://shroudstory.com/2014/04/12/petrus-soons-to-present-his-scientific-research-at-the-uninversity-of-miami/","cat":"event","title":"Petrus Soons to Present His Scientific Research at the University of Miami"},{"id":"comment-26823","author":"anoxie","post":"Another quote from the AP story : “But experts stand by carbon dating of scraps of the cloth that determine the linen was made in the 13th or 14th century in a kind of medieval forgery.” “a kind of” scorching ?.","date":"2013-03-08","mins":"9:32 am","url":"https://shroudstory.com/2013/03/08/pope-benedict-says-shroud-of-turin-authentic-burial-robe-of-jesus-it-doesnt-matter-what-science-says-about-its-authenticity/","cat":"event","title":"Pope Benedict says Shroud of Turin authentic burial robe of Jesus & it doesn’t matter what science says about its authenticity"},{"id":"comment-26887","author":"anoxie","post":"I agree. Reading Reuters, AFP or AP stories i’m waiting for factual, objective information..","date":"2013-03-09","mins":"6:18 am","url":"https://shroudstory.com/2013/03/08/pope-benedict-says-shroud-of-turin-authentic-burial-robe-of-jesus-it-doesnt-matter-what-science-says-about-its-authenticity/","cat":"event","title":"Pope Benedict says Shroud of Turin authentic burial robe of Jesus & it doesn’t matter what science says about its authenticity"},{"id":"comment-137323","author":"anoxie","post":"What is striking when you read Rogers book, is whereas people may think there is a shadow scientific committee thinking of the shroud’s conservation, 2002 restoration proved there was simply no pilot in the plane. Rogers has left shroud science orphan..","date":"2014-07-12","mins":"6:34 am","url":"https://shroudstory.com/2014/07/04/anticipating-the-conference-barrie-schwortz-on-ray-rogers/","cat":"st_louis_2014","title":"Anticipating the Conference:  Barrie Schwortz on Ray Rogers"},{"id":"comment-138491","author":"anoxie","post":"“. If they know the Shroud is medieval why draw attention to it in such a big way?” Don’t worry..","date":"2014-07-15","mins":"10:10 am","url":"https://shroudstory.com/2014/07/15/reservations-for-viewing-the-shroud-of-turin-in-2015/","cat":"2015","title":"Reservations for Viewing the Shroud of Turin in 2015"},{"id":"comment-133252","author":"anoxie","post":"When shadows of artifacts constitute reality, sindology really looks like the allegory of the cave. And these guys have Ph Ds….","date":"2014-06-28","mins":"4:45 am","url":"https://shroudstory.com/2014/06/27/anticipating-the-conference-robert-siefker-on-observations-data-and-hypotheses/","cat":"st_louis_2014","title":"Anticipating the Conference:  Robert Siefker on Observations, Data and Hypotheses"},{"id":"comment-126808","author":"anoxie","post":"I would not anticipate too much about printing techniques..","date":"2014-06-04","mins":"1:43 pm","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins"},{"id":"comment-173626","author":"anoxie","post":"And what about Thibault’s presentation on the chain of custody of Rogers’ C14 samples?.","date":"2014-11-29","mins":"1:01 pm","url":"https://shroudstory.com/2014/11/26/st-louis-videos/","cat":"st_louis_2014","title":"St. Louis Videos"},{"id":"comment-173629","author":"anoxie","post":"Ok, because as far as i could hear Bob’s presentation, he seemed no longer confident in the chain of custody, but i may have misunderstood his speech..","date":"2014-11-29","mins":"1:24 pm","url":"https://shroudstory.com/2014/11/26/st-louis-videos/","cat":"st_louis_2014","title":"St. Louis Videos"},{"id":"comment-173758","author":"anoxie","post":"“… You don’t know where it comes from, you don’t know what the history of it is, you don’t know who has had this sample… It’s a mystery how we can get anything to agree with these samples if we don’t have of those parameters…” You’ve pointed the problem came from the composite nature of the threads. Have they tried to analyse individual fibers since 2008? Because it looks like he is reinterpreting his 2008 paper wihtout new analyses..","date":"2014-11-30","mins":"5:13 am","url":"https://shroudstory.com/2014/11/26/st-louis-videos/","cat":"st_louis_2014","title":"St. Louis Videos"},{"id":"comment-26227","author":"anoxie","post":"Concerning image formation I think most of the dots are in Ray Rogers’ work. Connecting them and finding the missing ones are the next challenges (which seem largely underestimated), requiring a multidisciplinary team, modern science and recent textbooks..","date":"2013-03-03","mins":"5:11 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-148998","author":"anoxie","post":"Louis, it is not up to Rome or Turin to trash out anything, and they have already clearly said so. At Bari, the IEEE has ultimately taken a step back, leaving the Italian Trimurti on its own..","date":"2014-09-06","mins":"4:23 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"}]
