[{"id":"comment-170385","author":"anoxie","post":"Sufficient to proove the absence of fluctuation? no, you need an image lighted on purpose..","date":"2014-11-10","mins":"8:54 am","url":"https://shroudstory.com/2014/11/08/a-detailed-response-to-the-halo-study/","cat":"history","title":"A Detailed Response to The Halo Study"},{"id":"comment-170391","author":"anoxie","post":"I mean the major source of fluctuation of contrast on an image is the light source itself. If you don’t control the light source, how do you want to infer any conclusion on the contrast you see on a photograph?.","date":"2014-11-10","mins":"9:09 am","url":"https://shroudstory.com/2014/11/08/a-detailed-response-to-the-halo-study/","cat":"history","title":"A Detailed Response to The Halo Study"},{"id":"comment-170395","author":"anoxie","post":"But it works the other way round, if you don’t control the light source, you can’t quantify precisely the background fluctuation and see whether limited areas are beyond random fluctuation..","date":"2014-11-10","mins":"9:18 am","url":"https://shroudstory.com/2014/11/08/a-detailed-response-to-the-halo-study/","cat":"history","title":"A Detailed Response to The Halo Study"},{"id":"comment-170383","author":"anoxie","post":"” some readily accessible images”… this is the real crux of the matter. I don’t think basic data is suited to this analysis, and i don’t think both works methods are correct either to analyse background fluctuations..","date":"2014-11-10","mins":"8:50 am","url":"https://shroudstory.com/2014/11/08/a-detailed-response-to-the-halo-study/","cat":"history","title":"A Detailed Response to The Halo Study"},{"id":"comment-20028","author":"anoxie","post":"Thank you for this article. The scientist, however, believes himself to have reached a very definite conclusion as to the origin of the Shroud’s images. Whatever providential guiding there may have been, their origin, he holds, was natural..","date":"2012-12-08","mins":"7:20 am","url":"https://shroudstory.com/2012/12/04/an-early-christmas-present-from-john-klotz/","cat":"history","title":"An Early Christmas Present from John Klotz"},{"id":"comment-149221","author":"anoxie","post":"These articles (biblical blankets) are generated over and over again in a vacuum..","date":"2014-09-07","mins":"6:36 am","url":"https://shroudstory.com/2014/09/07/an-old-christian-papyrus/","cat":"history","title":"An Old Christian Papyrus"},{"id":"comment-20094","author":"anoxie","post":"This is an actual quote from Rev. Rinaldi’s article. The scientist seems to be Yve Delage. Marcelin Berthelot, a great chemist and physicist, didn’t want Pr Delage’s article to be published. Since he was a militant atheist, I don’t know wether he thought Pr Delage was wrong or that such an article should not be published in ‘Les Comptes rendus de l’Academie des Sciences’..","date":"2012-12-09","mins":"10:08 am","url":"https://shroudstory.com/2012/12/04/an-early-christmas-present-from-john-klotz/","cat":"history","title":"An Early Christmas Present from John Klotz"},{"id":"comment-149611","author":"anoxie","post":"It is OK on established facts about dinosaurs, not on controversies about the Shroud, but this is “truthiness”: “The less effort it takes to process a factual claim, the more accurate it seems. When we fluidly and frictionlessly absorb a piece of information, one that perhaps snaps neatly onto our existing belief structures, we are filled with a sense of comfort, familiarity, and trust.”.","date":"2014-09-09","mins":"5:55 am","url":"https://shroudstory.com/2014/09/07/an-old-christian-papyrus/","cat":"history","title":"An Old Christian Papyrus"},{"id":"comment-149579","author":"anoxie","post":"Hi daveb, I was talking of the article about the Shroud mentionned at the end of the post: “Proof of Jesus Christ? 7 Pieces of Evidence Debated. The first one is Biblical Blankets. Guess what?” http://www.livescience.com/38014 physical evidence jesus debated.html 7 Biblical blankets.","date":"2014-09-09","mins":"2:55 am","url":"https://shroudstory.com/2014/09/07/an-old-christian-papyrus/","cat":"history","title":"An Old Christian Papyrus"},{"id":"comment-14421","author":"anoxie","post":"Try on youtube : BBC DOC – Shroud of Turin – New Evidence 29’50” on video..","date":"2012-08-02","mins":"1:55 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","title":"Answers to Many Questions About the Fold Marks on the Shroud"},{"id":"comment-166669","author":"anoxie","post":"It would have been nice if Charles had focused on historical work and not guesswork whether there was actually a loincloth on the Shroud or not or whether Mc Crone proved it was a painting, it spoils his article..","date":"2014-10-29","mins":"4:32 pm","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science"},{"id":"comment-25385","author":"anoxie","post":"900°C ? Where ? How long ? At least locally, on the reliquary, long enough to melt silver. Does it mean the temperature reached 900°C inside the reliquary ? I don’t think so. Was the water poured directly on the shroud or more likely on the reliquary to cool it down ? Was the shroud still on fire when water was poured or had the silver cooled down and was the fire smothed ?.","date":"2013-02-23","mins":"7:14 am","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","title":"David Rolfe we need you"},{"id":"comment-25479","author":"anoxie","post":"Ron, according to Guerreschi’s paper we don’t know if silver or the lining of the reliquary did melt at all. The niche in the stone has protected the reliquary from heat and direct flames. A metallic (?) object may have been a thermal bridge between the fire and the shroud..","date":"2013-02-24","mins":"6:42 am","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","title":"David Rolfe we need you"},{"id":"comment-25394","author":"anoxie","post":"Thank you for this very interesting reference. Reading this article I definitely think temperature was much lower, and actually a slow pyrolysis due to a direct contact to an overheated object seems very likely..","date":"2013-02-23","mins":"8:08 am","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","title":"David Rolfe we need you"},{"id":"comment-25375","author":"anoxie","post":"Hugh Farey : Is it not remarkable that the outside layers suffered no more discolouration from the heat than the inside layers? I don’t think temperature was high enough on the outside layers, you need very high temperature to discolour flax fibers, this happened around the holes, through all the layers. And you can see a steep temperature gradient, this proves once again heat radiation isn’t a good candidate to discolour the shroud..","date":"2013-02-23","mins":"4:36 am","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","title":"David Rolfe we need you"},{"id":"comment-169742","author":"anoxie","post":"“The reasonable explanation is that the artist did not consider it or decided it would not be aesthetically pleasing.” You should detail the method of the artist first, then what may have been his aesthetics vision, you’re jumping to a speculative conclusion. Anyway, i don’t think there is a specific “top of the head” issue, but see my previous comments on this blog..","date":"2014-11-08","mins":"1:46 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-142011","author":"anoxie","post":"Very interesting indeed, thank you..","date":"2014-08-03","mins":"12:52 pm","url":"https://shroudstory.com/2014/08/01/paul-maier-at-the-veritas-forum-the-real-jesus/","cat":"history","title":"Paul Maier at The Veritas Forum: The Real Jesus"},{"id":"comment-172063","author":"anoxie","post":"Thank you for this healthy comment. Colin is going around in circle. He is in trouble, believing in and reinforcing his own conspiracy theory, posts after posts, months after months..","date":"2014-11-19","mins":"9:39 am","url":"https://shroudstory.com/2014/11/19/i-think-he-sees/","cat":"history","title":"I think HE sees?"},{"id":"comment-141772","author":"anoxie","post":"Paul Maier : “I have really been the first professor of ancient history to absolutely state that we have categorical proofs that the tomb was empty, in any case.” “While speaking to the probability of the correct locations of certain traditional sites in the Holy Land, and faced with a question regarding that shroud which was under intensive study, Dr. Maier then stated that in his judgment it was about “95% probably authentic.” http://www.wlsessays.net/files/Lemke Turin.pdf He probably didn’t mention the Shroud because it is still controversial and he doesn’t need it to claim that the tomb was empty. But the Shroud meets the missing body problem he has perfectly exposed..","date":"2014-08-02","mins":"5:23 am","url":"https://shroudstory.com/2014/08/01/paul-maier-at-the-veritas-forum-the-real-jesus/","cat":"history","title":"Paul Maier at The Veritas Forum: The Real Jesus"},{"id":"comment-14685","author":"anoxie","post":"Corneliotel : Creo que Rogers pensaba en una reacción de Maillard de inicio MUY RÁPIDO, con temperatura corporal muy alta y aminas pesadas MUY PRECOCES (cadaverina y putrescina) Read carefully Rogers article : Rogers Postmortem body temperatures can reach 41ºC (Irvine, 2001), and steep temperature gradients would exist across the cloth as a result of the low thermal diffusivity of linen and the angular dependence of radiant heat flow from a nonmetallic surface (Gubareff et al, 1960). The temperature gradients will have a large effect on Maillard reaction rates. These combination of factors could produce a distribution of reaction products with the appearance of the image. Rogers assumed there must have been steep temperature gradients on the shroud to explain image resolution since he thought the origin of the reactive amines should be in the lungs. He admitted himself “The chemistry of the colour does not answer all questions about how the “photographic” image formed. I think the body had cooled down when reactive amines hit the cloth. Corneliotel : NO HAY AGOTAMIENTO de sacáridos reactivos. Sólo 1 a 3 fibrillas por hilo están afectadas por el color ¡POR CADA HILO AFECTADO POR EL COLOR!, por lo que quedarían INFINIDAD de fibrillas CON RECUBRIMIENTO de polisacáridos reactivos que NO HAN SIDO AFECTADAS It is debatable. If you look at the areal density of color on the face you can see there may be a saturation on cheeks, nose, eyebrows, hair, beard. On these areas the limiting factor may be reducing saccharides. As suggested Rogers, different amounts of these impurities could come from different surface tension of the washing solution and the surface energy of the specific linen fibers..","date":"2012-08-10","mins":"4:56 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?"},{"id":"comment-14663","author":"anoxie","post":"Once reactive amines hit the cloth, it’s just the first step of a long and complex series of reactions called Maillard reaction. A withdrawal of the corpse doesn’t stop the process. What Rogers published is about the nature of coloration of the shroud Maillard reaction, concerning the origin of amines he had a personnal idea but had not enough time to explore it further. I think it is unfair, and not scientific, to throw away his work on the Maillard reaction on the basis of his idea on the origin of amines, or the temperature of the body..","date":"2012-08-09","mins":"11:30 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?"},{"id":"comment-14659","author":"anoxie","post":"Carlos Otal : withdrawal or the theft of the corpse within 36 48 hours Do you see any other option ?.","date":"2012-08-09","mins":"10:16 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?"},{"id":"comment-44950","author":"anoxie","post":"I’ve heard two more (speculative) observations from Thierry Castex linking the codex to the shroud : 1/the folding under the buttocks – a band with no image under the buttocks on the shroud 2/the folding on the backside – a slight angulation between front / back side on the shroud.","date":"2013-09-21","mins":"6:56 am","url":"https://shroudstory.com/2013/09/21/so-is-that-the-shroud-of-turin-depicted-in-the-hungarian-pray-codex/","cat":"history","title":"So is that the Shroud of Turin depicted in the Hungarian Pray Codex?"},{"id":"comment-17585","author":"anoxie","post":"Not explained does not mean miraculous..","date":"2012-10-13","mins":"7:39 am","url":"https://shroudstory.com/2012/10/13/the-beast-is-sindonology/","cat":"history","title":"The beast is ‘sindonology"},{"id":"comment-45162","author":"anoxie","post":"Is this the shroud itself or a another sheet on which the body has been prepared ? Has the body been prepared at all ? What kind of fluid could have been used ?.","date":"2013-09-23","mins":"5:03 am","url":"https://shroudstory.com/2013/09/21/so-is-that-the-shroud-of-turin-depicted-in-the-hungarian-pray-codex/","cat":"history","title":"So is that the Shroud of Turin depicted in the Hungarian Pray Codex?"},{"id":"comment-16379","author":"anoxie","post":"At least it seems very likely the shroud had been folded different ways. Aldo Guerreschi’s thought on this issue seems very perceptive : the holes caused by the Chambery fire of 1532 and the large water stains on the edges and in the central part of the cloth were in no way related, but were consequences of two totally distinct episodes..","date":"2012-09-17","mins":"4:19 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"id":"comment-27605","author":"anoxie","post":"Matthias : is it a stylised ‘a’ for ‘alpha’? I would say so..","date":"2013-03-18","mins":"4:51 am","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","title":"The Curious ‘a’ in the Hungarian Pray Manuscript"},{"id":"comment-17624","author":"anoxie","post":"I’m ignorant as far as Art History is concerned, but scientifically someone like Ray Rogers studied the Shroud and didn’t get lost. You can read last crystal clear post from Kelly Kearse, he doesn’t seem lost. You can pick up bogus theories and create “the beast” you want..","date":"2012-10-14","mins":"5:59 am","url":"https://shroudstory.com/2012/10/13/the-beast-is-sindonology/","cat":"history","title":"The beast is ‘sindonology"},{"id":"comment-26270","author":"anoxie","post":"Definitely one of the best documentary on the Shroud. Concerning the last part with Ray Downing’s experiment resulting in an image “close” to the one encoded on the shroud, one should note it is based on light diffusion with a controlled source… one more step and you can model gas diffusion on a thin layer ; ).","date":"2013-03-03","mins":"1:05 pm","url":"https://shroudstory.com/2013/03/02/the-real-face-of-jesus-this-lent-and-eastertide/","cat":"history","title":"The Real Face of Jesus this Lent and Eastertide"},{"id":"comment-28182","author":"anoxie","post":"Andy Weiss : The problem with some scientists is they think they are so above others and use their puny little minds to malign others. So called scientists..","date":"2013-03-23","mins":"1:41 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-28414","author":"anoxie","post":"Colinsberry : I believe that the combination of conduction and convection can account for the scorching being primarily on the parts of the weave in direct contact with the hot metal, but with some encroachment of the scorch into the oblique threads diving into the weave – probably due to the effect of hot gases. You believe. The very low conduction of heat in linen is still responsible for heat transfer at first order, whereas convection is second order, just try to quantify heat transfer. What are you using Colin, a fan ? Nan mais allo quoi ! un ventilateur ?.","date":"2013-03-26","mins":"12:38 pm","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-25389","author":"anoxie","post":"Talking about conspiracy theory (1532 fire) : Colin Berry : There was collateral damage, certainly, but that was necessary in the interests of credibility (a single burnt hole would have immediately aroused suspicion). That is why there is no gradation of roasted/non roasted panels, as Hugh has pointed out. Why? Because the Shroud was never roasted inside an reliquary – the selective scorching was done with the Shroud on a convenient work surface..","date":"2013-02-23","mins":"7:34 am","url":"https://shroudstory.com/2013/02/23/to-hide-away-and-suppress-the-cluny-medal/","cat":"history","title":"To hide away and suppress the Cluny Medal"},{"id":"comment-15293","author":"anoxie","post":"At least linen was bleached. In the article “Microscopic and Macroscopic Characteristics of the Shroud of Turin Image Superficiality”, Journal of Imaging Science and Technology® 54(4): 040201–040201 8, 2010, one can read : No references to the use of starch in antiquity have been found..","date":"2012-08-20","mins":"4:26 pm","url":"https://shroudstory.com/2012/08/19/who-was-wrong-ray-rogers-or-pliny-the-elder/","cat":"history","title":"Who was wrong? Ray Rogers or Pliny the Elder?"},{"id":"comment-15553","author":"anoxie","post":"Don’t worry, I can read, and this [postulate of unlikely forms of energy] is what Rogers called “goal directed pseudoscience”. Result is damage to the credibility of studies on the Shroud..","date":"2012-08-29","mins":"4:26 am","url":"https://shroudstory.com/2012/08/19/who-was-wrong-ray-rogers-or-pliny-the-elder/","cat":"history","title":"Who was wrong? Ray Rogers or Pliny the Elder?"},{"id":"comment-72406","author":"anoxie","post":"Thank you for the link, Dale Martin is an excellent teacher and a captivating orator. Take a stand, decide you’re going to do something crazy and have an opinion..","date":"2014-01-06","mins":"9:56 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-10445","author":"anoxie","post":"“And that is totally consistent with the FACT that there is absolutely no ancient list of relics related to the Passion of the Christ that include the Mandylion ” There are manuscripts which clearly link the Mandylion to the Passion (cf Mark Guscin, here is a link French http://www.suaire turin.com/Resources/guscin.pdf).","date":"2012-04-16","mins":"9:57 am","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong"},{"id":"comment-72420","author":"anoxie","post":"I think i’ve got my answer concerning conspiracy theories..","date":"2014-01-06","mins":"2:22 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-10452","author":"anoxie","post":"I see, actually he didn’t find an ancient list of relics. But his point was clearly that the Mandylion was not manmade, could have had boodstains, could have been a full body image, could have been wraped (“tetradiplon”) and… could be the shroud. But obviously you should email him directly to have his viewpoint..","date":"2012-04-16","mins":"12:51 pm","url":"https://shroudstory.com/2012/04/16/yannick-i-said-it-before-and-ill-say-it-again-ian-wilson-is-wrong/","cat":"history","title":"Yannick: I said it before and I’ll say it again: Ian Wilson is Wrong"},{"id":"comment-12109","author":"anoxie","post":"Actually, extra lenght mainly comes from a hips to knee difference. You can see a band with no image under the bottom on the dorsal image. Fanti, Piczek et al. Took for granted the image was continuous, it may be wrong..","date":"2012-06-09","mins":"6:07 am","url":"https://shroudstory.com/2012/06/04/yannicks-nice-surprise-folding-test-on-the-enrie/","cat":"history","title":"Yannick’s Nice Surprise:  Folding Test on the Enrie"},{"id":"comment-12042","author":"anoxie","post":"“Material Evidence, reported by Rageh Omaar and Produced by David Rolfe. In the documentary they have a clip with Dr Jackson et.al showing how THROUGH YEARS OF STUDY they have come to the most likely method in which the Shroud was wrapped.” Doesn’t explain the difference of lenght between frontal and dorsal image..","date":"2012-06-07","mins":"10:10 am","url":"https://shroudstory.com/2012/06/04/yannicks-nice-surprise-folding-test-on-the-enrie/","cat":"history","title":"Yannick’s Nice Surprise:  Folding Test on the Enrie"},{"id":"comment-12174","author":"anoxie","post":"Ok, because concerning the difference of lenght this is a first order explanation whereas foreshortening is second order..","date":"2012-06-11","mins":"3:12 am","url":"https://shroudstory.com/2012/06/04/yannicks-nice-surprise-folding-test-on-the-enrie/","cat":"history","title":"Yannick’s Nice Surprise:  Folding Test on the Enrie"},{"id":"comment-12135","author":"anoxie","post":"Mesure the distance from the antero superior iliac spine to the knee, frontal and dorsal. There’s a gap. Looking under the buttocks you can see an area with no image. Maybe the image is not continuous..","date":"2012-06-10","mins":"8:14 am","url":"https://shroudstory.com/2012/06/04/yannicks-nice-surprise-folding-test-on-the-enrie/","cat":"history","title":"Yannick’s Nice Surprise:  Folding Test on the Enrie"},{"id":"comment-12150","author":"anoxie","post":"Ok then, can you see an angle between the upper and down side of the image on the dorsal image you can’t see on the frontal one ?.","date":"2012-06-10","mins":"1:03 pm","url":"https://shroudstory.com/2012/06/04/yannicks-nice-surprise-folding-test-on-the-enrie/","cat":"history","title":"Yannick’s Nice Surprise:  Folding Test on the Enrie"}]
