[{"id":"comment-206078","author":"anoxie","post":"3d and real body configuration: It is not a silly hypothesis, it is even obvious, and has been done. “Autocatalysis after chemical imprinting?” It is so Rogers’ hypothesis. Wake up and think different..","date":"2015-07-18","mins":"6:38 am","url":"https://shroudstory.com/2015/07/18/blow-your-mind-3d-scanning-technology-and-what-it-could-mean/","cat":"3d","title":"Blow Your Mind 3D Scanning Technology And What It Could Mean"},{"id":"comment-127554","author":"anoxie","post":"“This is the danger of working alone, refusing to read anything that goes against one’s own presuppositions, and refusing to allow dialogue.” Writing non sense, moonwalking. You can sleep well..","date":"2014-06-07","mins":"11:57 am","url":"https://shroudstory.com/2014/06/07/colin-berry-is-up-with-an-interesting-posting-about-3d-enhancement/","cat":"3d","title":"Colin Berry is up with an interesting posting about 3D enhancement"},{"id":"comment-128397","author":"anoxie","post":"To transform a grey scale or a half tone map into distance, one has to have a scientific model. It’s only according to a given model that one can translate these data into distance. Image J is just a very poor surrogate, and there may be a lot of misuse and misunderstanding..","date":"2014-06-11","mins":"2:01 am","url":"https://shroudstory.com/2014/06/10/more-on-colin-berry-is-up-with-an-interesting-posting-about-3d-enhancement/","cat":"3d","title":"More on Colin Berry is up with an interesting posting about 3D enhancement"},{"id":"comment-175923","author":"anoxie","post":"“Colin has shown one way that apparent relief can be generated that has nothing to do with shape.” And footprints in the sand have nothing to do with shape either? The contrast of a scorch has all to do with shape, temperature, pressure, and the nature of the hot template. Scorching is a contact mechanism, and has many properties different from the Shroud image. But that’s not even close to the real problem of the Shroud image, being the nature of the distant mechanism..","date":"2014-12-12","mins":"11:25 am","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-176394","author":"anoxie","post":"I think we’ve already talked about misusing image J, 3 D and smoothing: https://shroudstory.com/2014/06/05/everymans vp8/.","date":"2014-12-14","mins":"3:37 pm","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-176864","author":"anoxie","post":"I think i have the answer: it is mickey mouse science. I’ve recently browsed your blog, in 2009 you talked about a big crunch: it is mickey mouse science. People got a nobel prize proving universe is expanding and testing their theories. Should i dive deeper into your blog?.","date":"2014-12-16","mins":"1:19 am","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-175970","author":"anoxie","post":"CB: You’ve lost your credit (and all your eggs) defending your scorch hypothesis. Dwelling on another “pseudo sweat imprint without being too specific”, for hundreds of posts and thousands of comments, will be endless and fruitless. Game is over..","date":"2014-12-12","mins":"6:01 pm","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-176711","author":"anoxie","post":"It was a question, but actually, Mario’s answers are welcomed as well..","date":"2014-12-15","mins":"12:38 pm","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-176673","author":"anoxie","post":"Hugh Farey: “the 3 D image cannot be reconciled with any brightness/distance correlation yet proposed, without being considerably subjectively distorted to fit the preconception.” This is not correct. But this is a critical point, the body/3 D template is missing, we have to work backward to re model its shape. Let’s think of a lost bronze statue you’d like to rebuild, all you have left are old black and white photographs (uncontrolled light, orientation). What’s the method? What are the assumptions? And what’s the difference with the Shroud image?.","date":"2014-12-15","mins":"10:30 am","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-177000","author":"anoxie","post":"O.K. “So small deviations in new observation, and still Big Crunch may happen.” No, the margin is large enough, no big crunch ahead. Colin, the problem is when you write: “Will the Universe go on expanding for ever? If you believe in Dark Matter and Dark Energy, then the answer is probably yes. But so far, neither of those hypothetical entities has yet been detected. ” “Believers” are scientists, scientists who obtained the consensus and got their theory confirmed with an extraodinary precision. I don’t care about your quote from wiki, even if 99% of scientists admit current theory, you’ll always find an outcast claiming a big crunch is possible “though not observationally supported”. “Though not observationally supported” anything may happen!!! I think it’s all what your scorch theory is about… “not observationally supported”..","date":"2014-12-16","mins":"12:26 pm","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-177044","author":"anoxie","post":"“3) with k=0 (EXACTLY ZERO) that is flat, infinite Universe, no Big Crunch.” O.K., this is boring, i perfectly understand FLRW models and don’t need wiki quotes. “Perhaps the most remarkable possibility is that a vanishing or negative local curvature (ΩK ≡ 1 − Ωtot ≥ 0) does not necessarily mean that our Universe is infinite. Indeed we can still be living in a universe of finite volume due to the global topological multi connectivity of space, even if described by the flat or hyperbolic FRW solutions.” http://planck.caltech.edu/pub/2013results/Planck 2013 results 26.pdf Planck, Hubble (and other experiments) have paved the way to precision astronomy, universe is accelerating, no big crunch ahead..","date":"2014-12-16","mins":"4:12 pm","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-177026","author":"anoxie","post":"O.K. “So small deviations in new observation, and still Big Crunch may happen.” No. Quote from your link: “Constraints on the total energy density of the Universe, Omega Ttot, have improved spectacularly in the last two decades”. Planck has improved these constraints, no big crunch ahead, this is precision cosmology. No borderline situation..","date":"2014-12-16","mins":"2:45 pm","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-175388","author":"anoxie","post":"Short answer: CB’s model is wrong. But, what was the question?.","date":"2014-12-09","mins":"12:36 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-177051","author":"anoxie","post":"Eventuality of Big Crunch “not observationally supported”. Build a model, fit the data, and we’ll re open this topic..","date":"2014-12-16","mins":"4:42 pm","url":"https://shroudstory.com/2014/12/12/only-the-shadow-knows/","cat":"3d","title":"Only the Shadow knows"},{"id":"comment-175398","author":"anoxie","post":"“The monochromatic nature of image and its superficiality points us in a different direction from a thermal scorch or some chemical reaction.” Scientifically, the shroud image is not monochromatic. This is another abuse of language, like the 3 D issue..","date":"2014-12-09","mins":"1:53 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175585","author":"anoxie","post":"What’s the temperature of this template?.","date":"2014-12-10","mins":"2:13 pm","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175830","author":"anoxie","post":"“From a scientific standpoint…” Discussions have been drifting away from science for a while. And the topic of this post was scorching pillow cases, “published evidence”..","date":"2014-12-12","mins":"1:14 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-211697","author":"anoxie","post":"See dynamic equalization, Castex 2012. Http://thierrycastex.blogspot.fr See the discussion following “banding on the shroud” by Hugh Farey..","date":"2015-10-03","mins":"8:04 am","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"id":"comment-127994","author":"anoxie","post":"“When a hot template is put in contact with a linen fabric, the pectin “glue” (middle lamella) that is found elsewhere at the surface and between the fibers is immediately colored and this is the main source of the color in a light scorch. This fact would have been obviously discovered by the STURP team (and particularly by Rogers).” https://shroudofturin.files.wordpress.com/2014/04/scorch 2 eng final.pdf.","date":"2014-06-09","mins":"12:25 pm","url":"https://shroudstory.com/2014/06/08/speaking-of-3d/","cat":"3d","title":"Speaking of 3D"},{"id":"comment-16231","author":"anoxie","post":"You can’t have this simplistic reasoning : Gabriel : Maillard reaction yields water as a subproduct that inhibits further development of the reaction itself. That would not happen with a more open configuration of the linen around the body, since water could evaporate in a dry environment. Water, is just one parameter among many others. It may be a major or secondary parameter. And the way water influences Maillard reaction kinetics must be determined for each model. This water/Maillard reaction kinetics relationship is not necessarily linear, and you may have a bell shaped curve with a maximum rate at intermediate/high relative humidity values for most models..","date":"2012-09-13","mins":"1:14 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","title":"A different approach to what some see as problems with the image on the Shroud of Turin"},{"id":"comment-9697","author":"anoxie","post":"Yannick Clément : In the light of what Rogers said, I think we really have to ask ourselves this important question : Is it possible that this kind of “non protective” restoration was done on purpose by the Church (or by some people inside the Church) ? I’m not at all a great fan of conspiracy theories but, in this particular case, I found it hard to believe that the custodians of the Shroud were as dumb as that ! Unfortunatly, I would say there is no conspiracy. The custodians of the Shroud simply put secret higher than science. Now, the best answer is to build a kind of STURP 2 who would like to deal with the shroud, raising new questions and new methods..","date":"2012-03-27","mins":"2:54 pm","url":"https://shroudstory.com/2012/03/25/two-thousand-years-of-chemical-history-was-destroyed/","cat":"news_&_views","title":"Two thousand years of chemical history was destroyed"},{"id":"comment-206291","author":"anoxie","post":"“And Colin gives us an alternate possibility” Actually it was an unconvinging answer to a question from Thibault Heimburger, who noted that Rogers used the Holland cloth as a control. “What if” the control was skewed by fumigation “so the reactive aldehyde groups of lignin in the initially peripheral Raes threads were better protected from the SO2 than the more central threads.” That’s pretty accurately agenda driven SO2..","date":"2015-07-21","mins":"12:45 pm","url":"https://shroudstory.com/2015/07/20/in-the-weeds-vanillin-and-the-age-of-the-shroud/","cat":"science","title":"In the Weeds:  Vanillin and the Age of the Shroud"},{"id":"comment-9726","author":"anoxie","post":"The restoration may have been awkward and amateur, but I don’t think they deteriorated the shroud on purpose. A kind of STURP 2 meant a new team of scientists, worldly reknowned in their field, asking questions and elaborating new protocols to study the shroud..","date":"2012-03-28","mins":"11:48 am","url":"https://shroudstory.com/2012/03/25/two-thousand-years-of-chemical-history-was-destroyed/","cat":"news_&_views","title":"Two thousand years of chemical history was destroyed"},{"id":"comment-208353","author":"anoxie","post":"“Here’s my solution, in the new flour powder imprinting model. The powder was applied to all parts of the face except the nose.” This one is funny. Could you include it in your final version or is it another ephemeral hypothesis?.","date":"2015-08-16","mins":"3:49 am","url":"https://shroudstory.com/2015/08/15/3d-of-the-day-imprinted-in-a-contact-only-mechanism/","cat":"image_theory","title":"3D of the Day:  Imprinted in a Contact-Only Mechanism?"},{"id":"comment-207944","author":"anoxie","post":"Except the Shroud may be unique and life ubiquitous. Http://www.osservatoreromano.va/it/news/solo noi nelluniverso.","date":"2015-08-11","mins":"3:33 am","url":"https://shroudstory.com/2015/08/11/a-guest-posting-by-yannick-clment/","cat":"image_theory","title":"A Guest Posting by Yannick Clément"},{"id":"comment-147095","author":"anoxie","post":"I’ve commented this post on the original thread: https://shroudstory.com/2014/08/27/banding is it real/#comment 147056 You want an original thought from Hugh Farey ? see Aug 27, 7:42 am (same post – banding? is it real?) “Finally, as I have said before, one might predict that the irregular processing of the raw thread could lead to visible banding on a cloth, but in that case there would be irregular banding patterns longitudinally, as the warp threads would be made from separate individual hanks, and broad regular bands transversely, as each weft single hank was used up going backwards and forwards across the loom. This is not what we observe.” And before giving my thought on this one, Hugh, what do you mean by “this is not what we observe” ? That it rules out banding effect from a single hank ?.","date":"2014-08-29","mins":"9:04 am","url":"https://shroudstory.com/2014/08/29/a-new-paradigm-for-banding/","cat":"image_theory","title":"A new paradigm for banding?"},{"id":"comment-147127","author":"anoxie","post":"Well this “new paradigm” has appeared after : Daveb: “Query to anyone: The weave is a zigzag herringbone twill. Does anyone know if the alleged banding synchronises with the pitch of the zigzag, or not? Or is it independent of the pitch?” anoxie: “3 the zig zag pattern has an independent role on image perception (image – différence) Synchronisation ? Let’s have a break on banding and the “no sharp edge” claim of CB.” Guess what are the bands on the “image – différence” who have a role on the image intensity? Maybe Dan should include this image in the post, what a new paradigm! FYI, it’s from Thierry Castex’s blog. You’ve re invented the wheel Hugh. And you see David Goulet, that’s why i’m reluctant to give constructive answers. By the way, thanks for your non constructive answer Hugh, i won’t comment..","date":"2014-08-29","mins":"12:30 pm","url":"https://shroudstory.com/2014/08/29/a-new-paradigm-for-banding/","cat":"image_theory","title":"A new paradigm for banding?"},{"id":"comment-205958","author":"anoxie","post":"My doubt is not about the wavelength, but whether they’ve serioulsy studied the depth of interaction between UV light and a flax fiber. Rogers is clear. Waiting for a clarification from ENEA scientists..","date":"2015-07-16","mins":"12:21 pm","url":"https://shroudstory.com/2015/07/16/a-reason-to-doubt-the-image-was-formed-by-radiation/","cat":"image_theory","title":"A Reason to Doubt the Image Was Formed By Radiation"},{"id":"comment-147169","author":"anoxie","post":"You’re lovely Colin, and harmless..","date":"2014-08-29","mins":"4:29 pm","url":"https://shroudstory.com/2014/08/29/a-new-paradigm-for-banding/","cat":"image_theory","title":"A new paradigm for banding?"},{"id":"comment-205959","author":"anoxie","post":"” In any cloth that has spent much of its life shut away from the light, the gamma rays from cosmic radiation play a bigger part than light.” ” I agree that the Shroud has been irradiated, mostly I guess by cosmic rays” The issue is not light. Try again..","date":"2015-07-16","mins":"12:24 pm","url":"https://shroudstory.com/2015/07/16/a-reason-to-doubt-the-image-was-formed-by-radiation/","cat":"image_theory","title":"A Reason to Doubt the Image Was Formed By Radiation"},{"id":"comment-205963","author":"anoxie","post":"No birefringence analysis, no mention of the depth of the interaction between UV light and the flax fiber..","date":"2015-07-16","mins":"1:07 pm","url":"https://shroudstory.com/2015/07/16/a-reason-to-doubt-the-image-was-formed-by-radiation/","cat":"image_theory","title":"A Reason to Doubt the Image Was Formed By Radiation"},{"id":"comment-205944","author":"anoxie","post":"“A question raised by a friend got me to wondering if a certain paper by Ray Rogers was ever really refuted or disputed or was it simply ignored as inconvenient?” Simply ignored..","date":"2015-07-16","mins":"9:24 am","url":"https://shroudstory.com/2015/07/16/a-reason-to-doubt-the-image-was-formed-by-radiation/","cat":"image_theory","title":"A Reason to Doubt the Image Was Formed By Radiation"},{"id":"comment-205952","author":"anoxie","post":"Rogers wrote: “In flax fibers, any photon or particle with an energy above about 3 e V (e.g., light with a shorter wavelength than green) can directly break a few bonds in the crystallized polymer chains.” What wavelenght did ENEA scientists used? Have they refuted, disputed or simply ignored Rogers’ observations? What is not definitive enough to do anything with, is a comment claiming the Shroud has been mostly irradiated by cosmic rays..","date":"2015-07-16","mins":"11:47 am","url":"https://shroudstory.com/2015/07/16/a-reason-to-doubt-the-image-was-formed-by-radiation/","cat":"image_theory","title":"A Reason to Doubt the Image Was Formed By Radiation"},{"id":"comment-171540","author":"anoxie","post":"“Correction: last paragraph above. “It’s NOT entirely impossible for the image to have been formed with no application of heat.”” Or sweat imitating a scorch with no heat? A kind of double back flip? Artistic note: 4.5 Scientific note: 1.2.","date":"2014-11-16","mins":"6:06 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-203426","author":"anoxie","post":"“Mechanism of enhanced browning in image zone? Presumably a non enzymatic Maillard browning reaction between reducing sugars and proteins.” A “shamelessly immodest breakthrough discovery”, any resemblance to theories of scientists living or dead is purely accidental. “Is Colin serious or not ?” Are you serious Thibault?.","date":"2015-06-24","mins":"1:24 am","url":"https://shroudstory.com/2015/06/23/a-shameless-plug/","cat":"image_theory","title":"A Shameless Plug"},{"id":"comment-193622","author":"anoxie","post":"“It’s not an insurmountable question, and yet it’s one of the many little questions about the relic that leave me scratching my head. Odd fold, odd fold…” David, what do you notice immediately if you put the frontal and dorsal images side by side?.","date":"2015-03-17","mins":"1:05 pm","url":"https://shroudstory.com/2015/03/17/a-shift-drift-in-colin-berrys-thinking/","cat":"image_theory","title":"A Shift-Drift in Colin Berry’s Thinking?"},{"id":"comment-193628","author":"anoxie","post":"This is quite paradoxal if you consider a gifted forger, the anatomical precision is exquisite but the size mismatch is obvious..","date":"2015-03-17","mins":"3:11 pm","url":"https://shroudstory.com/2015/03/17/a-shift-drift-in-colin-berrys-thinking/","cat":"image_theory","title":"A Shift-Drift in Colin Berry’s Thinking?"},{"id":"comment-193633","author":"anoxie","post":"I guess the forger aligned woodblocks side by side, realized he had messed up, then decided to align them head to toe..","date":"2015-03-17","mins":"3:38 pm","url":"https://shroudstory.com/2015/03/17/a-shift-drift-in-colin-berrys-thinking/","cat":"image_theory","title":"A Shift-Drift in Colin Berry’s Thinking?"},{"id":"comment-193734","author":"anoxie","post":"“It’s still scorching note, i.e. Superficial surface modification and yellowing of linen carbohydrates, but happening slowly and insidiously and non intentionally via chemical rather than instant thermally induced dehydration, oxidation etc” where is the sticky “paint” he’s just described? “I need a name to describe my new modelling of the Shroud image (inspired by Joseph Accetta) using an alternative to his iron/oak gall ink. Mine uses alum mordanted concentrated aqueous extract of pomegranate rind deployed not as ink, this syrup being deployed as a kind of natural sticky “paint”.” it seems CB has just given up his new modelling inspired by Joseph Accetta and is trying to go back (again) to a chemical reaction inspired by Rogers without totally giving up scorching… this is a kind of brownian motion, not the scientific method..","date":"2015-03-19","mins":"4:26 am","url":"https://shroudstory.com/2015/03/17/a-shift-drift-in-colin-berrys-thinking/","cat":"image_theory","title":"A Shift-Drift in Colin Berry’s Thinking?"},{"id":"comment-193779","author":"anoxie","post":"“It is interesting what while several papers have been written saying that the 95% confidence range is wrong, none have suggested a value that might be correct, based on the statistiics at hand.” You’re mixing things up Hugh, but could you give the references of these papers (at least one) in order to clarify this misunderstanding?.","date":"2015-03-19","mins":"2:19 pm","url":"https://shroudstory.com/2015/03/17/a-shift-drift-in-colin-berrys-thinking/","cat":"image_theory","title":"A Shift-Drift in Colin Berry’s Thinking?"},{"id":"comment-193797","author":"anoxie","post":"His conclusion is the opposite: “It is clear, that such large errors are unacceptable for the precision claimed for AMS age rc. Determinations.” His statistical analysis shows a systematic bias and an unexpected variability in the results pointing to an inhomogeneity of the samples. You may disagree with his analysis, but it is a nonsense to use his results to preclude a 1st century date..","date":"2015-03-19","mins":"4:37 pm","url":"https://shroudstory.com/2015/03/17/a-shift-drift-in-colin-berrys-thinking/","cat":"image_theory","title":"A Shift-Drift in Colin Berry’s Thinking?"},{"id":"comment-193832","author":"anoxie","post":"“No, you miss the point, anoxie. Remi van Haest does indeed reject the precision claimed, and identifies a lack of homogeneity, but even so he comes up with his own estimation of the precision” I repeat, you miss the point. Remi Van Haelst has: a/ identified a lack of homogeneity which he deemed sufficient to reject the validity of the C14 dating. B/ determined another 95% confidence interval, which btw you seem to have just discovered. BUT, this is a theoretical exercise, assuming the sample is homogeneous (which he has just proven to be wrong), to illustrate that the interval you should get is unacceptable for the claimed precision of the AMS age rc. Determinations. It is a total nonsense to quote his calculation to preclude a 1st century date..","date":"2015-03-20","mins":"1:55 am","url":"https://shroudstory.com/2015/03/17/a-shift-drift-in-colin-berrys-thinking/","cat":"image_theory","title":"A Shift-Drift in Colin Berry’s Thinking?"},{"id":"comment-193851","author":"anoxie","post":"“That in itself is sufficient, as all the statisticians well know, totally to rule out a 1st century date (based on the radiocarbon data alone).” Remi Van Haelst doesn’t rule out a 1st century date, what he rules out is the validity of the C14 dating. According to his article the pb is either an inhomogeneity in the sample OR an unacceptable interval if you assume that the sample is homogeneous. “I do not disagree with his analysis. I agree with him completely.” Then I’m afraid you don’t understand his point..","date":"2015-03-20","mins":"7:15 am","url":"https://shroudstory.com/2015/03/17/a-shift-drift-in-colin-berrys-thinking/","cat":"image_theory","title":"A Shift-Drift in Colin Berry’s Thinking?"},{"id":"comment-193866","author":"anoxie","post":"Rémi Van Haelst released his first article in 1997 (https://www.shroud.com/vanhels3.htm), confirmed his analysis in 2010 (http://www.acheiropoietos.info/proceedings/Van Haelst Web.pdf). Needless to say, he never got an explanation for the 95% confidence..","date":"2015-03-20","mins":"10:25 am","url":"https://shroudstory.com/2015/03/17/a-shift-drift-in-colin-berrys-thinking/","cat":"image_theory","title":"A Shift-Drift in Colin Berry’s Thinking?"},{"id":"comment-206002","author":"anoxie","post":"“We obtained a superficial coloration of linen by UV laser beam without destroying the linen, nor altering linen’s structure.” Not altering linen’s structure? Really? “We cantherefore infer that short and high intensity UV pulses change the crystalline structure of cellulose in a similar manner as aging and low intensity radiation (radon, natural radioactivity, secondary parti cles from cosmic rays) accumulated in a long termperiod do.” https://www.academia.edu/3478909/Superficial and Shroud like coloration of linen by short laser pulses in the vacuum ultraviolet That’s precisely Rogers’ point. He could not see any difference between image fibers and non image fibers. So, Dr Di Lazzaro, high intensity UV pulses don’t alter linen’s structure? Rogers was wrong?.","date":"2015-07-17","mins":"3:25 am","url":"https://shroudstory.com/2015/07/17/a-very-helpful-answer-from-paolo-di-lazzaro/","cat":"image_theory","title":"A Very Helpful Answer from Paolo Di Lazzaro"},{"id":"comment-17145","author":"anoxie","post":"Louis, could you give the best argument which in your view rules out Maillard reaction ?.","date":"2012-10-02","mins":"3:50 am","url":"https://shroudstory.com/2012/09/28/a-touch-of-miracle-plus-a-maillard-reaction/","cat":"image_theory","title":"A Touch of Miracle Plus A Maillard Reaction"},{"id":"comment-206158","author":"anoxie","post":"Hi Yannick, there are many questions to ask, but here we’re stuck to the very first one, clearly put by Dan: “Has this ever really been refuted or disputed or was it simply ignored as inconvenient? Is the linen coloration obtained by ENEA scientists different?” “This” refering to a paper by Rogers, https://www.shroud.com/pdfs/rogers8.pdf , looking at the effects of radiation on flax fibers. Dan, though not a scientist, has a good idea of the big picture and has precisely quoted Rogers: “Direct comparisons between image and non image parts of the shroud show exactly the same amounts and types of radiation damage in the two types of areas (e.g., figures 7 and 8). This suggests that the image was not produced by any mechanism that involved heat, light, or ionizing radiation.” Di Lazzaro uses bursts of UV light and creates radiation damage ( see fig. 12 https://www.academia.edu/3478909/Superficial and Shroud like coloration of linen by short laser pulses in the vacuum ultraviolet ). We can fairly say that this radiation damage alters the linen’s structure. Now, let’s read Di Lazzaro’s answer and see how he dodges the question, again, simply ignoring Dan’s quote and dwelling on another experience. Needless to say, i don’t consider his answer very helpful..","date":"2015-07-19","mins":"11:01 am","url":"https://shroudstory.com/2015/07/17/a-very-helpful-answer-from-paolo-di-lazzaro/","cat":"image_theory","title":"A Very Helpful Answer from Paolo Di Lazzaro"},{"id":"comment-16708","author":"anoxie","post":"Gabriel, i think you’ve misunderstood Rogers’ quote. He was not talking about “something else”, but simply of his complex hypothesis as described in his long ssg message which should not be reduced to a ‘diffusion model’..","date":"2012-09-21","mins":"9:24 pm","url":"https://shroudstory.com/2012/09/20/agenda-driven-shroud-science-what-a-pity/","cat":"image_theory","title":"Agenda Driven Shroud Science?  What a pity."},{"id":"comment-16610","author":"anoxie","post":"David Rolfe : Just show me a meaningful image of anything created in this way and I will have a lot more respect for the idea. This is naive. First steps should not be to create any meaningful image but to determine the chromophore, test how sugars layer spread on linen fibers, determine reactive amines..","date":"2012-09-20","mins":"4:29 pm","url":"https://shroudstory.com/2012/09/20/agenda-driven-shroud-science-what-a-pity/","cat":"image_theory","title":"Agenda Driven Shroud Science?  What a pity."},{"id":"comment-18741","author":"anoxie","post":"According to Rogers, lignin was partially removed before weaving, during the bleaching, and is responsible for the bands on the Shroud. Rogers : The bands of different color on the Shroud are the result of different amounts of lignin left from the bleaching process. I think he didn’t link lignin to the image since he could see image fibers with or without lignin (% of dark growth rings). To put it simply : reflected light = superficial image, transmitted light = ubiquitous lignin..","date":"2012-11-02","mins":"2:02 pm","url":"https://shroudstory.com/2012/11/02/an-image-formed-by-the-yellowing-of-lignon/","cat":"image_theory","title":"An image formed by the yellowing of Lignin?"},{"id":"comment-18788","author":"anoxie","post":"The full quote is : Rogers : The bands of different color on the Shroud are the result of different amounts of lignin left from the bleaching process. The tape samples reflect this variation as an observed difference among quantitative measurements of lignin on the fibrils. From http://www.shroud.com/pdfs/n54part6.pdf Do you know what is this quantative mesurement ? “on the fibrils” means he could directly measure lignin on the surface of flax fibers (and not only % of dark growth rings) ? I thought sensitive tests for lignin on the shroud were negative. Thibault HEIMBURGER : – We know that the “impurity layer” is about 0.2 to 0.6 microm. Thick (Rogers) – We know that lignin is found in flax fibers as a major component of the PCW, which is about 0.2 microm. Thick. Are these figure reliable ? Because they legitimate an hypothesis based on an impurity layer. Thank you,.","date":"2012-11-04","mins":"5:53 am","url":"https://shroudstory.com/2012/11/02/an-image-formed-by-the-yellowing-of-lignon/","cat":"image_theory","title":"An image formed by the yellowing of Lignin?"},{"id":"comment-140749","author":"anoxie","post":"The “path” of Rogers according to Yannick : http://www.doc.ic.ac.uk/~nd/surprise 95/journal/vol4/ykl/report.br1 Eventually consistent with a stochastic phenomenon..","date":"2014-07-27","mins":"5:22 pm","url":"https://shroudstory.com/2014/07/27/another-paper-by-yannick-clment/","cat":"image_theory","title":"Another Paper by Yannick Clément"},{"id":"comment-23885","author":"anoxie","post":"On Durante image, you can see a max/min contrast distance clearly < 4 mm (lower lip zone), but i don't know how reliable is the scale on Shroud scope..","date":"2013-02-09","mins":"3:48 pm","url":"https://shroudstory.com/2013/02/09/another-question-from-the-siefker-and-spicer-paper/","cat":"image_theory","title":"Another Question from the Siefker and Spicer paper"},{"id":"comment-14359","author":"anoxie","post":"Ok, actually points 1 and 3 are in contradiction. Rogers drew conclusions out of his preliminary experiments even if it was in contradiction with his own hypothesis. So far, I think any convection flow blurs the image. “High resolution” requires a cool and still atmosphere (and cooled body), there was no convection cells. The origin of the amines should be on the skin (ammonia coming from slow hydrolysis of urea), the origin of the amines in the lung simply doesn’t fit the data. The cloth was laid on the body. The suited model is not fluid mechanics (“low flow” is misleading, i meant no macroscopic flow) but models of diffusion (random migration of molecules) giving a probability distribution function..","date":"2012-07-31","mins":"1:54 pm","url":"https://shroudstory.com/2012/07/30/asking-thibault-for-more-details-concerning-rogers-hypothesis/","cat":"image_theory","title":"Asking Thibault for more details concerning Rogers hypothesis"},{"id":"comment-23900","author":"anoxie","post":"It seems to be an extrapolation to use MTF without the input image or the acquisition system : “MTF resolution of images obtained without an acquisition system”G. Fanti, R. Basso, presented at the Ohio conference in 2008. They’ve focused on hands and the face. Yes, MTF is used to mesure the resolution power of an acquisition system. How does this relate to the shroud ? I don’t know but at least i think we can forget the 4,9 +/ 0,5 mm resolution..","date":"2013-02-10","mins":"3:22 am","url":"https://shroudstory.com/2013/02/09/another-question-from-the-siefker-and-spicer-paper/","cat":"image_theory","title":"Another Question from the Siefker and Spicer paper"},{"id":"comment-14911","author":"anoxie","post":"Thank you Thibault for this comprehensive description of Rogers hypothesis. Actually this hypothesis requires many parameters, the value of each being important to get a final image. Part I, MAILLARD REACTION IN DETAIL : 1/Sugars layer The nature and thickness of the layer depends on the amount of wetting agent (S. Officinalis) and the type of ground grains used to make crude starch. 2/Reactive amines The reactive amines should come from the skin. They could have concentrated from sweat or direct plasma exudation from the wounds. Reactive amines would slowly appear at the surface of the skin. Rogers used DETA (diethylenetriamine) mw 103.2 in his experiments, and used it directly (no slow production or release), there was no convection, but you can see the borders of image are not straight, certainly due to a quick release of amines responsible for a flooding. In your article, you suggested ammonia through hydrolysis of urea. But is hydrolysis of urea significant at ambient temperature ? Have you thought about glutamine ? glutamine is available in plasma and sweat, and in large amounts in muscle cells (~20 mmol/L). Under a stress and/or trauma there is an accelerated outward transport from muscle cells. Hydrolysis of glutamine is much faster than hydrolysis of urea at lower temperature. There may be other amines, main ones should be determined before any experiment. 3/Contact/Gas diffusion There may be reactive reacting through contact (glutamine), while other could diffuse (ammonia). And there may be different products, through different pathways, giving different coloration. 4/Reaction completion This is an “autocatalytic” type reaction, which increases contrast (the closer the darker) and resolution (lesser spread of gaseous amines). How long is the “induction time” depending on the concentration of gaseous amines ? During this time, the rate will closely follow a zero order rate law and contrast will be “diffusion controlled”. This may explain partly why resolution seems higher on the face (more autocatalytic) than on other parts (more diffusion controlled). “Extinction coefficient” is important but hardly evaluable. 5/Path length dependent attenuation of the concentration It is not simply due to a concentration gradient based on Kinetic Theory of Gases, we should take into account a complex absorbing boundary. Absorbing boundary (cloth), whose strength depends on time, adsorption, absorption, depletion of reactant(s), thus the type of linen and weaving, thickness of the sugars layer, local level of completion. The more the parameters, the lower the odds to get an image. But here it is..","date":"2012-08-13","mins":"5:33 pm","url":"https://shroudstory.com/2012/07/30/asking-thibault-for-more-details-concerning-rogers-hypothesis/","cat":"image_theory","title":"Asking Thibault for more details concerning Rogers hypothesis"},{"id":"comment-14366","author":"anoxie","post":"Rogers set the cornerstone of the image theory : Maillard reaction. Reading parts of his books, you can see the origin of the reactive amines is just of component of the hypothesis, and Rogers had to found a candidate because Maillard reaction requires amines. Rogers set the method. And reading his conclusions and experiments you can see it can be translated to an origin of the amines on the skin. Actually chapter XI is on kinetics theory of gases, which applies once the amines “reached its target” on the skin, and then diffuse “in a cool and still atmosphere”..","date":"2012-07-31","mins":"4:39 pm","url":"https://shroudstory.com/2012/07/30/asking-thibault-for-more-details-concerning-rogers-hypothesis/","cat":"image_theory","title":"Asking Thibault for more details concerning Rogers hypothesis"},{"id":"comment-14427","author":"anoxie","post":"Gabriel : In my view, a laminar flow of amines with a very low Reynolds number in small confined cells could be the only option because this would mean a quasi vertical motion I don’t think we should take a vertical motion for granted. The intensity of the coloration on the shroud may be correlated to the shortest path between body and cloth. Concerning convection cells : why would they be confined ? why would they be in a steady state ? how could they fit high resolution (at then be totally asymetrical : long and narrow) ? why would confined convection cells between body and shroud create any contrast on the shroud ? do you think the temperature gradient between body and shroud could create any convection at all (if significant) ? Any convection mouvement would alter a gradient of concentration depending on body distance, and result in a loss of information..","date":"2012-08-02","mins":"4:39 pm","url":"https://shroudstory.com/2012/07/30/asking-thibault-for-more-details-concerning-rogers-hypothesis/","cat":"image_theory","title":"Asking Thibault for more details concerning Rogers hypothesis"},{"id":"comment-14368","author":"anoxie","post":"And that’s precisely why i’m asking for details to test step by step his hypothesis..","date":"2012-07-31","mins":"5:04 pm","url":"https://shroudstory.com/2012/07/30/asking-thibault-for-more-details-concerning-rogers-hypothesis/","cat":"image_theory","title":"Asking Thibault for more details concerning Rogers hypothesis"},{"id":"comment-146462","author":"anoxie","post":"You’ve already answered Dan. This is just another obvious illustration of CB’s bad habit to distort/select/ignore facts..","date":"2014-08-27","mins":"4:15 am","url":"https://shroudstory.com/2014/08/27/banding-is-it-real/","cat":"image_theory","title":"Banding? Is it Real?"},{"id":"comment-146539","author":"anoxie","post":"“That may be, but can you point it out a lttle more clearly?” Less clear on the face because this is precisely where image is the more intense, and it happens it is mostly on warp threads, but this post focused on the face..","date":"2014-08-27","mins":"11:58 am","url":"https://shroudstory.com/2014/08/27/banding-is-it-real/","cat":"image_theory","title":"Banding? Is it Real?"},{"id":"comment-146552","author":"anoxie","post":"“As the light is coming through from behind, all the light and dark variation is caused by the thickness of the cloth at any point, which includes the backing cloth.” Another point on Hugh’s list David, reflected light doesn’t depend much on the thickness of the cloth… I thought it was obvious, transmitted light only underlines this pattern. Back to the “avant filtrage” image (reflected light), there is a horizontal pattern, though vertical pattern is much clearer (image is on warp threads)..","date":"2014-08-27","mins":"1:02 pm","url":"https://shroudstory.com/2014/08/27/banding-is-it-real/","cat":"image_theory","title":"Banding? Is it Real?"},{"id":"comment-146567","author":"anoxie","post":"He has clearly mentionned the backing cloth as a confusion factor, i’ve answered banding depends on the shroud. But maybe you can enlighten me about Hugh’s vagaries? Do you understand his point more clearly?.","date":"2014-08-27","mins":"1:29 pm","url":"https://shroudstory.com/2014/08/27/banding-is-it-real/","cat":"image_theory","title":"Banding? Is it Real?"},{"id":"comment-146555","author":"anoxie","post":"This is a real question ?.","date":"2014-08-27","mins":"1:14 pm","url":"https://shroudstory.com/2014/08/27/banding-is-it-real/","cat":"image_theory","title":"Banding? Is it Real?"},{"id":"comment-146560","author":"anoxie","post":"It is transmitted light. So ?.","date":"2014-08-27","mins":"1:19 pm","url":"https://shroudstory.com/2014/08/27/banding-is-it-real/","cat":"image_theory","title":"Banding? Is it Real?"},{"id":"comment-146578","author":"anoxie","post":"Let’s Hugh have a try..","date":"2014-08-27","mins":"1:54 pm","url":"https://shroudstory.com/2014/08/27/banding-is-it-real/","cat":"image_theory","title":"Banding? Is it Real?"},{"id":"comment-146574","author":"anoxie","post":"“This seems logical, to me, is there a good reason why the backing cloth is not relevant at all?” Reflected light image..","date":"2014-08-27","mins":"1:43 pm","url":"https://shroudstory.com/2014/08/27/banding-is-it-real/","cat":"image_theory","title":"Banding? Is it Real?"},{"id":"comment-146570","author":"anoxie","post":"“As the light is coming through from behind, all the light and dark variation is caused by the thickness of the cloth at any point, which includes the backing cloth. ” Answer : no. Translation problem ?.","date":"2014-08-27","mins":"1:32 pm","url":"https://shroudstory.com/2014/08/27/banding-is-it-real/","cat":"image_theory","title":"Banding? Is it Real?"},{"id":"comment-146699","author":"anoxie","post":"Banding? Real? “In fact, the more we try to pin down what, precisely, makes the dark bands appear so, the more we find that the borders between the bands correspond with the herringbone ‘spines” This is what i call : banding. This the kind of limit/artefact CB doesn’t want to hear about..","date":"2014-08-28","mins":"12:26 am","url":"https://shroudstory.com/2014/08/27/banding-is-it-real/","cat":"image_theory","title":"Banding? Is it Real?"},{"id":"comment-146507","author":"anoxie","post":"Help yourself: https://shroudofturin.files.wordpress.com/2012/10/scorch paper en.pdf.","date":"2014-08-27","mins":"8:52 am","url":"https://shroudstory.com/2014/08/27/banding-is-it-real/","cat":"image_theory","title":"Banding? Is it Real?"},{"id":"comment-146596","author":"anoxie","post":"Let’s be basic. David, at the thread level, the linen take the image differently. This is what you can see on the image “avant filtrage”. Name it banding, or whatever, this is just an observation, but apparently Colin and Hugh disagree..","date":"2014-08-27","mins":"3:33 pm","url":"https://shroudstory.com/2014/08/27/banding-is-it-real/","cat":"image_theory","title":"Banding? Is it Real?"},{"id":"comment-146707","author":"anoxie","post":"1 it’s a sharp, clear cut edge 2 the dark band on the face starts on a spike 3 the zig zag pattern has an independent role on image perception (image – différence) Synchronisation ? Let’s have a break on banding and the “no sharp edge” claim of CB..","date":"2014-08-28","mins":"1:14 am","url":"https://shroudstory.com/2014/08/27/banding-is-it-real/","cat":"image_theory","title":"Banding? Is it Real?"},{"id":"comment-146787","author":"anoxie","post":"Is there a sharp cut off in intensity along CB’s yellow line on the left of the fac, from hair to chest? CB has used image J and claimed: “Straightaway one can see that the sharp cut off at the sides of the face, aka excessive and unrealistic ‘linearity’, disappears almost completely.” My answer was: look at high definition raw pictures and you can see a sharp cutt off. Anyone can see it, and i think Hugh has finally (hardly?) admitted it when he has noted that the dark band starts on a spike. This zig zag pattern is underlined by the difference image (middle one), and has a role on the image intensity (left one). Claiming that looking at image J, which actually smoothes the image largely discussed here , you can’t see this cut off, is simply absurd! But maybe this spoonfeeding will trigger another version in CB far fetched theories..","date":"2014-08-28","mins":"9:10 am","url":"https://shroudstory.com/2014/08/27/banding-is-it-real/","cat":"image_theory","title":"Banding? Is it Real?"},{"id":"comment-147106","author":"anoxie","post":"Full quote: “Straightaway one can see that the sharp cut off at the sides of the face, aka excessive and unrealistic ‘linearity’, disappears almost completely. With it must surely disappear any idea that the cut offs had anything to do with banding” The cut off has much to do with banding. Banding is clearly seen on a raw picture. And guess what? the sharp cut off disappears when you smooth it!.","date":"2014-08-29","mins":"9:51 am","url":"https://shroudstory.com/2014/08/27/banding-is-it-real/","cat":"image_theory","title":"Banding? Is it Real?"},{"id":"comment-146521","author":"anoxie","post":"“Finally, as I have said before, one might predict that the irregular processing of the raw thread could lead to visible banding on a cloth, but in that case there would be irregular banding patterns longitudinally, as the warp threads would be made from separate individual hanks, and broad regular bands transversely, as each weft single hank was used up going backwards and forwards across the loom. This is not what we observe.” This is what I observe : Who cares about your predictions where the image should be? Can’t you see that the image is mostly on the warp threads? You can put this one on Hugh’s list David..","date":"2014-08-27","mins":"10:35 am","url":"https://shroudstory.com/2014/08/27/banding-is-it-real/","cat":"image_theory","title":"Banding? Is it Real?"},{"id":"comment-147109","author":"anoxie","post":"I guess you still have to work hard on it before answering to my comment. Don’t worry, i’m patient..","date":"2014-08-29","mins":"10:09 am","url":"https://shroudstory.com/2014/08/27/banding-is-it-real/","cat":"image_theory","title":"Banding? Is it Real?"},{"id":"comment-147056","author":"anoxie","post":"Sure, i’m a troll, and Hugh is brilliant. Now, read my comment just above his “brilliant” comment (Aug 28, 1:14 am). I’m pointing since the very beginning of this thread to this regular pattern based on warp threads and the herringbone pattern, i’ve provided the link to the difference image underlining this pattern, and i had just mentionned the role of this pattern on image density… Now tell what is the “new paradigm” for banding not related to this herringbone pattern and the overwhelming role of warp threads on the face ?.","date":"2014-08-29","mins":"6:16 am","url":"https://shroudstory.com/2014/08/27/banding-is-it-real/","cat":"image_theory","title":"Banding? Is it Real?"},{"id":"comment-18603","author":"anoxie","post":"Ron : How does one explain the amazing detail of the images on areas that in all probability had no contact whatsoever with the cloth and in some areas up to 4cm? Could you give an example of such an area ?.","date":"2012-10-30","mins":"12:17 pm","url":"https://shroudstory.com/2012/10/29/big-deal-peer-reviewed-scientific-paper-soon-to-be-published/","cat":"image_theory","title":"Big Deal Peer-Reviewed Scientific Paper Soon to Be Published"},{"id":"comment-20410","author":"anoxie","post":"Who did the best job to study the corona discharge hypothesis ? To my knowledge, Rogers, and his conclusions were similar, Fanti’s work was not scientific..","date":"2012-12-14","mins":"4:08 am","url":"https://shroudstory.com/2012/12/13/barberis-fantis-conclusions-are-not-scientific/","cat":"image_theory","title":"Barberis:  Fanti’s conclusions are not scientific"},{"id":"comment-23298","author":"anoxie","post":"“There are some folk who need to learn – re learn a bit of elementary physics.” Yes, Colin Berry should start with heat equation in wikipedia..","date":"2013-02-03","mins":"7:45 am","url":"https://shroudstory.com/2013/02/03/be-sure-to-read-the-comment-by-thibault-heimburger/","cat":"image_theory","title":"Be sure to read the comment by Thibault Heimburger"},{"id":"comment-18616","author":"anoxie","post":"I’m asking seriously, could you point out one area with “an amazing detail” that had no contact whatsoever with the body ?.","date":"2012-10-30","mins":"3:24 pm","url":"https://shroudstory.com/2012/10/29/big-deal-peer-reviewed-scientific-paper-soon-to-be-published/","cat":"image_theory","title":"Big Deal Peer-Reviewed Scientific Paper Soon to Be Published"},{"id":"comment-18623","author":"anoxie","post":"Daveb of wellington nz : a convection model has obvious objections ROGERS’ MAILLARD REACTION No mention of convection..","date":"2012-10-30","mins":"3:59 pm","url":"https://shroudstory.com/2012/10/29/big-deal-peer-reviewed-scientific-paper-soon-to-be-published/","cat":"image_theory","title":"Big Deal Peer-Reviewed Scientific Paper Soon to Be Published"},{"id":"comment-18695","author":"anoxie","post":"Daveb of wellington nz : I think it is the diffusion mechanism I have problems most in attaining the resolution So far, the only paper i’ve found which directly addressed the question of resolution is Fanti’s paper, in JIST nov dec 2011 : http://www.shroud enigma.com/challenge/paper/g fanti paper.html Concerning gas diffusion he wrote : gas diffusion experiments achieve poorer resolution, coarser than 20mm (Fig. 6). What is figure 6 ? An image formation experiment with a heated papier maché hand. To analyse gas diffusion he took an experiment mixing diffusion and convection. Brilliant..","date":"2012-11-01","mins":"5:56 am","url":"https://shroudstory.com/2012/10/29/big-deal-peer-reviewed-scientific-paper-soon-to-be-published/","cat":"image_theory","title":"Big Deal Peer-Reviewed Scientific Paper Soon to Be Published"},{"id":"comment-18520","author":"anoxie","post":"Gabriel : Even if so, to say the least and to keep polite, the authors do not give any new relevant information and re sell the same they have done before. Truly sad. They have changed the title, and the journal..","date":"2012-10-29","mins":"5:25 pm","url":"https://shroudstory.com/2012/10/29/big-deal-peer-reviewed-scientific-paper-soon-to-be-published/","cat":"image_theory","title":"Big Deal Peer-Reviewed Scientific Paper Soon to Be Published"},{"id":"comment-18557","author":"anoxie","post":"Hugh Farey : there must be some doubt as to exactly how much (or how little) the ghosts contribute to the image. The colored ghosts are seen only in image areas..","date":"2012-10-30","mins":"5:33 am","url":"https://shroudstory.com/2012/10/29/big-deal-peer-reviewed-scientific-paper-soon-to-be-published/","cat":"image_theory","title":"Big Deal Peer-Reviewed Scientific Paper Soon to Be Published"},{"id":"comment-18602","author":"anoxie","post":"The “impurity layer” is an interpretation. I’m not aware of un coloured ghosts. S Tu RP observations : Color is on the surface of the fibers. Much less force was required to remove tapes from image areas than from non image areas. Surface of color fibers appears “corroded”. “Ghosts” of color were stripped off of fibers by the adhesive of sampling tapes..","date":"2012-10-30","mins":"12:10 pm","url":"https://shroudstory.com/2012/10/29/big-deal-peer-reviewed-scientific-paper-soon-to-be-published/","cat":"image_theory","title":"Big Deal Peer-Reviewed Scientific Paper Soon to Be Published"},{"id":"comment-208686","author":"anoxie","post":"Cold oil (room temperature) migrates as well..","date":"2015-08-21","mins":"10:52 am","url":"https://shroudstory.com/2015/08/21/close-to-the-finishing-line-or-the-starting-line/","cat":"image_theory","title":"Close to the finishing line or the starting line?"},{"id":"comment-208689","author":"anoxie","post":"Of course the viscosity of oil decreases with temperature, but: “How’s that oil likely to behave when a flour imprint on linen is placed in a hot oven? My guess is that as it heats up, its viscosity will decrease. It will become runnier, and start to spread” a. Oil will start to spread as soon it touches the fiber b. Viscosity is not as much the issue as wetting and capillarity You should have blue spreading as well as red spreading..","date":"2015-08-21","mins":"11:52 am","url":"https://shroudstory.com/2015/08/21/close-to-the-finishing-line-or-the-starting-line/","cat":"image_theory","title":"Close to the finishing line or the starting line?"},{"id":"comment-208682","author":"anoxie","post":"Copyright: Colin Berry. Don’t worry, i don’t think a scientist would put his name on this picture..","date":"2015-08-21","mins":"10:20 am","url":"https://shroudstory.com/2015/08/21/close-to-the-finishing-line-or-the-starting-line/","cat":"image_theory","title":"Close to the finishing line or the starting line?"},{"id":"comment-198687","author":"anoxie","post":"Colin Berry has cracked the Shroud enigma: https://shroudstory.com/2014/03/14/two comments promoted colin berry has cracked the shroud enigma/.","date":"2015-05-09","mins":"4:43 am","url":"https://shroudstory.com/2015/05/09/colin-berry-has-it-all-figured-out-sort-of-maybe/","cat":"image_theory","title":"Colin Berry Has It All Figured Out, Sort Of, Maybe"},{"id":"comment-20263","author":"anoxie","post":"Keep it simple, what you can see in the eyes’ area is definitely not specific of this area, you can’t draw a specific conclusion out of it..","date":"2012-12-12","mins":"4:55 am","url":"https://shroudstory.com/2012/12/11/coins-on-eyes-issue-again/","cat":"image_theory","title":"Coins on Eyes Issue Again"},{"id":"comment-198753","author":"anoxie","post":"When should we stop the track record, on may 9 or may 10? Since each commment brings a new version, maybe the number of CB´s comments could serve as a proxy..","date":"2015-05-10","mins":"3:16 am","url":"https://shroudstory.com/2015/05/09/colin-berry-has-it-all-figured-out-sort-of-maybe/","cat":"image_theory","title":"Colin Berry Has It All Figured Out, Sort Of, Maybe"},{"id":"comment-206523","author":"anoxie","post":"As far as i’m concerned, I’m not responsible for what Colin, or Yannick think. Get a specific reference to one of my comments, then we’ll start to argue on this basis, because these are serious accusations..","date":"2015-07-25","mins":"10:56 am","url":"https://shroudstory.com/2015/07/25/colin-berry-on-rogers-groupies-me-and-trolls/","cat":"image_theory","title":"Colin Berry on Rogers, Groupies, Me and Trolls"},{"id":"comment-206576","author":"anoxie","post":"“coward”, “troll”, “fanatic”, what’s next on the list? And we should talk chemistry on this post? Put your question clearly, get a guest posting from Dan..","date":"2015-07-26","mins":"3:24 am","url":"https://shroudstory.com/2015/07/25/colin-berry-on-rogers-groupies-me-and-trolls/","cat":"image_theory","title":"Colin Berry on Rogers, Groupies, Me and Trolls"},{"id":"comment-206587","author":"anoxie","post":"Why? Because you’ve hit the dead end of scorching and are running out of original ideas. You’re recycling what you considered as a complete non starter into a forgery narrative, and shamelessly distorting Rogers’ Maillard reaction hypothesis to promote your own. This was a foreseeable end, that’s why we have “Rogers’ Maillard reaction explained in detail by Rogers himself”. And seriously, who is dealing with abusive comments? Unreal..","date":"2015-07-26","mins":"5:01 am","url":"https://shroudstory.com/2015/07/25/colin-berry-on-rogers-groupies-me-and-trolls/","cat":"image_theory","title":"Colin Berry on Rogers, Groupies, Me and Trolls"},{"id":"comment-206582","author":"anoxie","post":"The science i’ve addressed was thermodynamics, in my world, Maillard reaction occurs under 100°C. It’s been three years, but i’m not the one who has been scorching in the meantime, dissmissing Maillard reaction as, i quote, “a complete non starter”..","date":"2015-07-26","mins":"4:25 am","url":"https://shroudstory.com/2015/07/25/colin-berry-on-rogers-groupies-me-and-trolls/","cat":"image_theory","title":"Colin Berry on Rogers, Groupies, Me and Trolls"},{"id":"comment-170038","author":"anoxie","post":"“I hesitate to say this, but what’s the point of posting one’s ideas to a specialist web forum if one gets absolutely no detailed feedback, either positive or negative?” Could you give a link to one of these posts?.","date":"2014-11-09","mins":"4:20 am","url":"https://shroudstory.com/2014/11/08/colin-berry-wants-feedback/","cat":"image_theory","title":"Colin Berry Wants Feedback"},{"id":"comment-21863","author":"anoxie","post":"Most of the issues questionned by Colin Berry have been raised for a while and deserve a proper answer. Take the pcw, Thibault Heimburger explained in this blog that Rogers didn’t know it and that data are consistent with pcw +/ impurity layer. Take the gas diffusion hypothesis, an article in the top right corner of this blog clarifies Rogers’ very interesting views. The point is almost everyone is out of his league and true experts like Kelly Kearse are missing..","date":"2013-01-10","mins":"7:27 pm","url":"https://shroudstory.com/2013/01/08/colin-berry-takes-on-banding-and-more/","cat":"image_theory","title":"Colin Berry Takes On Banding and More"},{"id":"comment-201117","author":"anoxie","post":"Daveb, as Thibault noticed, he doesn’t even draw the good conclusions out of his own experiments, and this is not the first time. “stoopid” is mostly for the conclusion, naive would be for the model..","date":"2015-06-05","mins":"3:28 am","url":"https://shroudstory.com/2015/06/01/colin-berry-its-the-negative-image-with-3d-properties-stoopid/","cat":"image_theory","title":"Colin Berry:  It’s the negative image with 3D properties, stoopid"},{"id":"comment-170049","author":"anoxie","post":"“It’s difficult to pinpoint one particular posting” whereas we’ve been continuously directed to your posts on this blog, for months? And we should read yet another post on your blog? I don’t play hide and seek with postings..","date":"2014-11-09","mins":"5:04 am","url":"https://shroudstory.com/2014/11/08/colin-berry-wants-feedback/","cat":"image_theory","title":"Colin Berry Wants Feedback"},{"id":"comment-201115","author":"anoxie","post":"“Really?” No, that’s a stoopid model..","date":"2015-06-05","mins":"3:11 am","url":"https://shroudstory.com/2015/06/01/colin-berry-its-the-negative-image-with-3d-properties-stoopid/","cat":"image_theory","title":"Colin Berry:  It’s the negative image with 3D properties, stoopid"},{"id":"comment-165955","author":"anoxie","post":"Http://shroudofturinwithoutallthehype.wordpress.com/2012/08/10/sturps raymond n rogers top notch thermochemist appeared to have abandoned thermodynamics completely when he argued for that implausible maillard reaction/ ” There’s more I could say – on the role of chemical kinetics – on why I think that a Maillard reaction is a complete non starter, not just in thermodynamic terms, but on a host of other grounds but writing this has been draining.” Colin Berry Reading you is draining as well..","date":"2014-10-27","mins":"11:18 am","url":"https://shroudstory.com/2014/10/27/colin-berry-maybe-its-a-maillard-reaction-after-all/","cat":"image_theory","title":"Colin Berry:  Maybe It’s A Maillard Reaction After All"},{"id":"comment-166221","author":"anoxie","post":"Louis, i know how Rogers toyed with the Maillard reaction, i’ve never meant work was over, being a regular reader of this blog you should know that. I’m just telling you Colin doesn’t know what he is doing. Https://shroudstory.com/2012/08/12/thibault heimburger i hope now that nobody will claim that there is no maillard reaction and no color at room temperature/.","date":"2014-10-28","mins":"11:25 am","url":"https://shroudstory.com/2014/10/27/colin-berry-maybe-its-a-maillard-reaction-after-all/","cat":"image_theory","title":"Colin Berry:  Maybe It’s A Maillard Reaction After All"},{"id":"comment-166236","author":"anoxie","post":"?.","date":"2014-10-28","mins":"12:56 pm","url":"https://shroudstory.com/2014/10/27/colin-berry-maybe-its-a-maillard-reaction-after-all/","cat":"image_theory","title":"Colin Berry:  Maybe It’s A Maillard Reaction After All"},{"id":"comment-166243","author":"anoxie","post":"Suggestions, manipulations or esoteric speculations, depending on your viewpoint..","date":"2014-10-28","mins":"1:14 pm","url":"https://shroudstory.com/2014/10/27/colin-berry-maybe-its-a-maillard-reaction-after-all/","cat":"image_theory","title":"Colin Berry:  Maybe It’s A Maillard Reaction After All"},{"id":"comment-165989","author":"anoxie","post":"Please, could you be more specific regarding the other grounds on which a Maillard reaction is a complete non starter?.","date":"2014-10-27","mins":"2:51 pm","url":"https://shroudstory.com/2014/10/27/colin-berry-maybe-its-a-maillard-reaction-after-all/","cat":"image_theory","title":"Colin Berry:  Maybe It’s A Maillard Reaction After All"},{"id":"comment-166081","author":"anoxie","post":"Flour is a complete non starter. Not just because it is flour, but on a host of other grounds i won’t discuss here, bye..","date":"2014-10-28","mins":"2:09 am","url":"https://shroudstory.com/2014/10/27/colin-berry-maybe-its-a-maillard-reaction-after-all/","cat":"image_theory","title":"Colin Berry:  Maybe It’s A Maillard Reaction After All"},{"id":"comment-165998","author":"anoxie","post":"This does not answer the question. The first ground largely discussed was precisely temperature/chemical kinetics/thermodynamics. The question was about the “other grounds” you mentionned to claim Maillard reaction a complete non starter..","date":"2014-10-27","mins":"4:04 pm","url":"https://shroudstory.com/2014/10/27/colin-berry-maybe-its-a-maillard-reaction-after-all/","cat":"image_theory","title":"Colin Berry:  Maybe It’s A Maillard Reaction After All"},{"id":"comment-166212","author":"anoxie","post":"My comment was an ironical CB style answer. I think Colin doesn’t know what he is doing, whether with manipulated image or with white flour or with scorching. I think the basis to deal with Maillard reaction is not Colin’s speculations, but Thibault’s and Rogers’ works..","date":"2014-10-28","mins":"11:04 am","url":"https://shroudstory.com/2014/10/27/colin-berry-maybe-its-a-maillard-reaction-after-all/","cat":"image_theory","title":"Colin Berry:  Maybe It’s A Maillard Reaction After All"},{"id":"comment-191535","author":"anoxie","post":"“that terminology cannot and must not attempt to impose a new orthodoxy regarding mechanism” Serioulsy?!? Do we have the same free dictionnary? To impress : to produce (an imprint, etc) by pressure in or on (something) An imprint means pressure, contact, no distant mechanism unless you detail the process, that’s already biased. Guess who has been trying to impose his mechanism… let’s be specific and talk about a thermal scorch, anyone could make his own mind directly. And yes, yes, yes there is a pb with J Image, there is a pb with the misuse of J Image, that’s been said, written, re said, re written. At least it does not take a long time to catch up..","date":"2015-02-22","mins":"2:22 am","url":"https://shroudstory.com/2015/02/21/colin-berry-stop-calling-the-faint-image-a-faint-image/","cat":"image_theory","title":"Colin Berry:  Stop Calling the Faint Image a Faint Image"},{"id":"comment-199425","author":"anoxie","post":"You know what is frankly not credible? CB claiming the “blood” came from a leech, see https://shroudstory.com/2013/03/22/three new shroud of turin websites to watch/.","date":"2015-05-18","mins":"3:45 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199451","author":"anoxie","post":"Do hope people don’t mistake a “skeptic” for a “consipiracist”..","date":"2015-05-18","mins":"10:56 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-14766","author":"anoxie","post":"Colin Berry The Maillard reaction is simply not THERMODYNAMICALLY FEASIBLE at 100 degrees Celsius Colin Berry is wrong, again. ‘Effect of time, temperature, and reactant ratio on pyrazine formation in model systems” Takayuki Shibamoto , Richard A. Bernhard J. Agric. Food Chem., 1976, 24 (4), pp 847–852.","date":"2012-08-11","mins":"7:07 am","url":"https://shroudstory.com/2012/08/11/colin-berry-so-how-could-ray-rogers-have-got-it-so-wrong/","cat":"image_theory","title":"Colin Berry: So how could Ray Rogers have got it so wrong?"},{"id":"comment-104404","author":"anoxie","post":"“The man of science must work with method. Science is built up of facts, as a house is built of stones; but an accumulation of facts is no more a science than a heap of stones is a house.” Henri Poincaré, Science and Hypothesis..","date":"2014-04-27","mins":"10:43 am","url":"https://shroudstory.com/2014/04/27/colin-berrys-sticky-tape-experiments/","cat":"image_theory","title":"Colin Berry’s Sticky Tape Experiments"},{"id":"comment-91607","author":"anoxie","post":"Daveb is perfectly right, the more you study the shroud, the better you realise how much remains to be done..","date":"2014-03-21","mins":"1:12 pm","url":"https://shroudstory.com/2014/03/20/comment-promoted-another-hypothesis-about-the-image-formation/","cat":"image_theory","title":"Comment Promoted:  Another hypothesis about the image formation"},{"id":"comment-201678","author":"anoxie","post":"Back in 1978 people could think the image was a painting and seen as the closest to the mark. STURP results have ruled out this hypothesis. I don’t know to which mark Charles Freeman’s hypothesis comes close, but it’s definitely in the trash bin for years. Oh yeah, the pigments have been magically removed… don’t fool around..","date":"2015-06-12","mins":"1:22 am","url":"https://shroudstory.com/2015/06/11/comment-promoted-charles-freeman-comes-closest/","cat":"image_theory","title":"Comment Promoted:  Charles Freeman Comes Closest"},{"id":"comment-91223","author":"anoxie","post":"“there is no convincing evidence that gross putrefactive changes can produce the fine details that are seen in the ST” they don’t investigate any further..","date":"2014-03-20","mins":"12:34 pm","url":"https://shroudstory.com/2014/03/20/comment-promoted-another-hypothesis-about-the-image-formation/","cat":"image_theory","title":"Comment Promoted:  Another hypothesis about the image formation"},{"id":"comment-201637","author":"anoxie","post":"“Charles Freeman’s comes closest to the mark” Sorry but i’ve not seriously studied Charles Freeman’s hypothesis, what are the main differences with Mc Crone’s theory?.","date":"2015-06-11","mins":"12:19 pm","url":"https://shroudstory.com/2015/06/11/comment-promoted-charles-freeman-comes-closest/","cat":"image_theory","title":"Comment Promoted:  Charles Freeman Comes Closest"},{"id":"comment-18288","author":"anoxie","post":"Yes, and Thibault’s article sums up his theory. But reading again Denis Mannix’s “quoting” Rogers and Donn Reile’s comment, i was thinking things are still confused. Donn may have reacted based on Denis’ claim of a pure distant diffusion mechanism. This is a mess..","date":"2012-10-25","mins":"1:33 pm","url":"https://shroudstory.com/2012/10/24/comment-promoted-denis-mannix-on-his-proposal/","cat":"image_theory","title":"Comment Promoted: Denis Mannix on his proposal"},{"id":"comment-18197","author":"anoxie","post":"Denis Mannix : The work proposed is designed to test only the latter part of this claim by Rogers which is quite a surprising claim ie. That a clear image (comparable with the image on the Shroud) can be made on a recipient surface by gases that rise in a thermal current and retain, during their movement, the details of the surface, (wounds, fingers etc) from which they were released. I don’t speculate thermal current/convection blur the image, this results from equations of diffusion. Read carefully Rogers’ mail, there is no mention of a thermal current when he describes the diffusion mechanism. And when he run his tests he concluded that thermal current/convection blurred the image. The conditions to get the highest resolution are no thermal current. Plus you should note that diffusion is only a mechanism among others. Kinetics of the gas solid reaction itself increases the contrast. Any experiment is welcome, but you should be aware of the limitations. Last but not least, we don’t know for sure what the reactants are..","date":"2012-10-24","mins":"9:57 am","url":"https://shroudstory.com/2012/10/24/comment-promoted-denis-mannix-on-his-proposal/","cat":"image_theory","title":"Comment Promoted: Denis Mannix on his proposal"},{"id":"comment-18322","author":"anoxie","post":"Since Rogers’ very promising work i’ve not seen any investigation on this hypothesis..","date":"2012-10-26","mins":"4:13 am","url":"https://shroudstory.com/2012/10/24/comment-promoted-denis-mannix-on-his-proposal/","cat":"image_theory","title":"Comment Promoted: Denis Mannix on his proposal"},{"id":"comment-18421","author":"anoxie","post":"Rogers : It is NOT valid to state that “diffusion can not yield good resolution”: you must address the laws of diffusion..","date":"2012-10-27","mins":"12:20 pm","url":"https://shroudstory.com/2012/10/24/comment-promoted-denis-mannix-on-his-proposal/","cat":"image_theory","title":"Comment Promoted: Denis Mannix on his proposal"},{"id":"comment-18214","author":"anoxie","post":"If you don’t like équations a simple look to Rogers’ preliminary tests proves gas doesn’t spread uniformly. Question is reachable resolution..","date":"2012-10-24","mins":"2:36 pm","url":"https://shroudstory.com/2012/10/24/comment-promoted-denis-mannix-on-his-proposal/","cat":"image_theory","title":"Comment Promoted: Denis Mannix on his proposal"},{"id":"comment-18384","author":"anoxie","post":"Ok, then you should note that what happened is not really common. It is not a gas leak on a pipe line, but a very slow production of gas in a thin layer, with no convection current..","date":"2012-10-26","mins":"5:28 pm","url":"https://shroudstory.com/2012/10/24/comment-promoted-denis-mannix-on-his-proposal/","cat":"image_theory","title":"Comment Promoted: Denis Mannix on his proposal"},{"id":"comment-207598","author":"anoxie","post":"“Comparing Colin Berry’s Methods to Those of Sam Pellicori” Sam Pellicori has published his work. Colin Berry is blogging. I think Thibault Heimburger had suggested Colin to publish at least a finite pdf. Point an error in Colin’s latest hypothesis and you get 10 posts, 100 comments and 3 new versions of the hypothesis..","date":"2015-08-06","mins":"1:24 pm","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-18285","author":"anoxie","post":"If something needs clarification, it’s Rogers’ Maillard reaction. I think Rogers would have been upset reading his alleged claim : “a clear image (comparable with the image on the Shroud) can be made on a recipient surface by gases that rise in a thermal current and retain, during their movement, the details of the surface, (wounds, fingers etc) from which they were released.” This is actually absurd. His hypothesis is much more complex, and first of all it is a contact (beard, nose, fingers, wounds) and diffusion (borders, cheeks) hypothesis..","date":"2012-10-25","mins":"12:29 pm","url":"https://shroudstory.com/2012/10/24/comment-promoted-denis-mannix-on-his-proposal/","cat":"image_theory","title":"Comment Promoted: Denis Mannix on his proposal"},{"id":"comment-207608","author":"anoxie","post":"Actually we have your pictures and a million words..","date":"2015-08-06","mins":"2:23 pm","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-127069","author":"anoxie","post":"“It is not 1978 anymore. It is time to move on.” Smoothing the image ? Bad idea. For example a useful tweak is filtering the background pattern : https://douglawrence.files.wordpress.com/2008/07/front filtered neg histo g1 final.jpg There is always a loss of information but you can see better the original shape..","date":"2014-06-05","mins":"1:05 pm","url":"https://shroudstory.com/2014/06/05/everymans-vp8/","cat":"image_theory","title":"Everyman’s VP8"},{"id":"comment-207906","author":"anoxie","post":"“If not, ask Barrie, a true expert.” Don’t be too harsh with Colin. He is doing his best..","date":"2015-08-10","mins":"4:22 pm","url":"https://shroudstory.com/2015/08/06/comparing-colin-berrys-methods-to-those-of-sam-pellicori/","cat":"image_theory","title":"Comparing Colin Berry’s Methods to Those of Sam Pellicori"},{"id":"comment-127089","author":"anoxie","post":"I mean it’s too loosely correlated to image intensity..","date":"2014-06-05","mins":"2:31 pm","url":"https://shroudstory.com/2014/06/05/everymans-vp8/","cat":"image_theory","title":"Everyman’s VP8"},{"id":"comment-183240","author":"anoxie","post":"There is an ongoing project to build a 3 D model based on random conventional photographs. I think i’ve already commented this issue. With only one random conventional photograph? No way. The shroud image is NOT holographic but is NOT a mere photograph..","date":"2015-01-14","mins":"11:18 am","url":"https://shroudstory.com/2014/06/05/good-3d-from-a-conventional-photograph/","cat":"image_theory","title":"Good 3D from a conventional photograph"},{"id":"comment-208859","author":"anoxie","post":"With such a fast and furious blog pace, you can only ask questions, and overlook (bad) answers. He is our hyper blogger..","date":"2015-08-24","mins":"8:11 am","url":"https://shroudstory.com/2015/08/23/have-we-all-been-looking-in-the-wrong-place/","cat":"image_theory","title":"Have we all been looking in the wrong place?"},{"id":"comment-164892","author":"anoxie","post":"I have to ask you Thibault, after Dan’s clarification as regards the accusations of intellectual dishonnesty (https://shroudstory.com/2014/10/23/accusations of intellectual dishonesty/), do you think Colin’s post is based on “image misunderstandings” or “image misrepresentations” or “image manipulations”?.","date":"2014-10-23","mins":"11:21 am","url":"https://shroudstory.com/2014/10/22/homogeneous-or-not-thats-the-question/","cat":"image_theory","title":"Homogeneous or Not? That’s the Question"},{"id":"comment-164612","author":"anoxie","post":"Who says the Shroud of Turin image is homogeneous? That is the question, because i don’t, Mr Scorch..","date":"2014-10-22","mins":"9:44 am","url":"https://shroudstory.com/2014/10/22/homogeneous-or-not-thats-the-question/","cat":"image_theory","title":"Homogeneous or Not? That’s the Question"},{"id":"comment-164657","author":"anoxie","post":"Yannick, the question is not whether his point is relevant (he has not really qualified “homogeneous” and his image is rather pointless), what is interesting is why he tries to make a point: to artificially trigger a U turn in his theory, saving his face with an “original argument”. And people still buy it. Problems are not stinky bombs, as old as Colin on this blog, last one just being under the spotlights, but his empty posts being promoted. Has anyone really understood what he meant by not homogeneous ??? No, because it makes no sense since he does not qualify it. See Rogers: ” …the statement that all image fibers look the same is not correct: there are some significant differences…” THIS is not homogeneous, based on a direct observation. Now, waiting for Thibault and his pdf n°3..","date":"2014-10-22","mins":"12:17 pm","url":"https://shroudstory.com/2014/10/22/homogeneous-or-not-thats-the-question/","cat":"image_theory","title":"Homogeneous or Not? That’s the Question"},{"id":"comment-164630","author":"anoxie","post":"It means: “I AM DESPERATELY LOOKING FOR A WAY OUT MY BOGUS SCORCH HYPOTHESIS”.","date":"2014-10-22","mins":"10:42 am","url":"https://shroudstory.com/2014/10/22/homogeneous-or-not-thats-the-question/","cat":"image_theory","title":"Homogeneous or Not? That’s the Question"},{"id":"comment-164624","author":"anoxie","post":"He is going to explain Thibault Heimburger why the image may be a Maillard Reaction, stay tuned..","date":"2014-10-22","mins":"10:24 am","url":"https://shroudstory.com/2014/10/22/homogeneous-or-not-thats-the-question/","cat":"image_theory","title":"Homogeneous or Not? That’s the Question"},{"id":"comment-110901","author":"anoxie","post":"“It was, really, a lot of hope that the laws of gaseous diffusion, ambient heat by convection, radiation and contact, the drape of the cloth and reactive chemical exhaustion might somehow form a picture. His experiments with papier mâché hands and bolts were, at best, exploratory and not demonstrative. It did not rise to the level of hypothesis.” This is a mess…. The exegetic work on Rogers’ theory maybe endless… That’s why i asked Thibault for more details two years ago and he came with the article on the right side of this blog Based on this clarification, when i talk about “Rogers’ theory” i mean : 1/ the article “Rogers Maillard reaction hypothesis…” (old mail on the SSG according to Thibault) 2/ his experiment on gaseous diffusion with EDTA reaching a millimetric resolution Then the question is : How wrong was “Rogers’ theory” ?.","date":"2014-05-04","mins":"1:49 pm","url":"https://shroudstory.com/2014/05/03/how-right-was-rogers-on-the-image-making-process/","cat":"image_theory","title":"How Right Was Rogers on the Image Making Process?"},{"id":"comment-19730","author":"anoxie","post":"It doesn’t look like the vp8. Dr Soons’ 3 D requires asumptions, extrapolations and even imagination (arms) to fill the gaps, create an outline, smooth the surface, create a volume and lay a flat greyscale skin on it. There are so many arbitrary parameters that it is no longer science but artwork whereas VP8 is basic, direct but scientific. When Dr Jackson presented a more realistic 3 D image, he described clearly his assumptions..","date":"2012-12-02","mins":"5:01 am","url":"https://shroudstory.com/2012/11/18/i-certainly-have-real-reservations-about-petrus-soons-3d-work-any-comments-now/","cat":"image_theory","title":"I certainly have real reservations about Petrus Soons’ 3D work. Any comments now?"},{"id":"comment-19204","author":"anoxie","post":"” According to Dr. Soons and Pete, his 3 D is not artwork, but a visual display of the brightness encoding on the Shroud similar to what the VP8 does.” I don’t think so. 3 D on the shroud has no outline. VP8 data show a shape looking like a bas relief. You can get something closer to a real human shape if you assume the shroud was wrapped around the corpse and take into account local cloth corpse configuration, image formation mechanism, variegated pattern of the shroud itself, but you won’t get outlines..","date":"2012-11-19","mins":"11:59 am","url":"https://shroudstory.com/2012/11/18/i-certainly-have-real-reservations-about-petrus-soons-3d-work-any-comments-now/","cat":"image_theory","title":"I certainly have real reservations about Petrus Soons’ 3D work. Any comments now?"},{"id":"comment-18408","author":"anoxie","post":"Isn’t this “invisible ‘ink’ that need not damage the linen itself” a sort of impurity layer ?.","date":"2012-10-27","mins":"7:29 am","url":"https://shroudstory.com/2012/10/27/image-is-scorched-lemonade/","cat":"image_theory","title":"Image is Scorched Lemonade?"},{"id":"comment-18423","author":"anoxie","post":"Well, he is experimenting, this is a good thing. But he should really buy a microscope and a good optical device to add a macrophotography documentation to his work..","date":"2012-10-27","mins":"1:21 pm","url":"https://shroudstory.com/2012/10/27/image-is-scorched-lemonade/","cat":"image_theory","title":"Image is Scorched Lemonade?"},{"id":"comment-18565","author":"anoxie","post":"Andy Weiss : This reminds me of what Walter Mc Crone did with his ‘science.’ Indeed, with a microscope Walter Mc Crone claimed it was a painting, with a microscope will Colin Berry claim it is a scorching ?.","date":"2012-10-30","mins":"6:12 am","url":"https://shroudstory.com/2012/10/27/image-is-scorched-lemonade/","cat":"image_theory","title":"Image is Scorched Lemonade?"},{"id":"comment-21425","author":"anoxie","post":"I may have missed something but i thought Adrie’s work pointed there was no evidence of starch on the shroud, but i may have the wrong version of her work..","date":"2013-01-01","mins":"12:44 pm","url":"https://shroudstory.com/2013/01/01/important-aspect-of-flax-fiber-microstructure-and-rogers-ghosts/","cat":"image_theory","title":"Important aspect of flax fiber microstructure and Rogers’ “ghosts”"},{"id":"comment-200777","author":"anoxie","post":"“While Colin complains that the world is ignoring his two stage imprinting model,” If you want to be taken serioulsy you have to be consistent. Whatever nonsense Charles Freeman is writing, he has been consistent with his views, and has published a readable article about it. Colin had published a kind of “summary” of his scorch hypothesis, it was back in the days you could still read one of his blogpost with a single mug of coffee. He had been promoted on Wikipedia. Is he still complaining that his scorch hypothesis which could “explain it all” has been removed from the references on Wiki? Is he complaining that Wiki has not updated his page for his latest “hypothesis which explains it all”?.","date":"2015-06-01","mins":"8:23 am","url":"https://shroudstory.com/2015/06/01/is-charles-freeman-emerging-as-the-worlds-leading-shroud-skeptic/","cat":"image_theory","title":"Is Charles Freeman Emerging as the World’s Leading Shroud Skeptic?"},{"id":"comment-200791","author":"anoxie","post":"If you had to be scientifically correct to be a leading Shroud skeptic, one would know. You think he doesn’t add anything of value, i think Colin doesn’t either. As a chemist, i would rather listen to Thibault, silent so far on his own views..","date":"2015-06-01","mins":"11:07 am","url":"https://shroudstory.com/2015/06/01/is-charles-freeman-emerging-as-the-worlds-leading-shroud-skeptic/","cat":"image_theory","title":"Is Charles Freeman Emerging as the World’s Leading Shroud Skeptic?"},{"id":"comment-204449","author":"anoxie","post":"Thibault has given an argued answer. Not considering it claiming “Colin is the chemist here”, is not convincing, to say the least….","date":"2015-07-03","mins":"10:50 am","url":"https://shroudstory.com/2015/07/02/is-colin-berry-onto-something/","cat":"image_theory","title":"Is Colin Berry Onto Something?"},{"id":"comment-204454","author":"anoxie","post":"A/ Maillard reaction happens at room temperature, that was the point b/ What candidate reactants may have been at stake? He was looking for it, ask him directly, i don’t think he has given any clue so far on this blog..","date":"2015-07-03","mins":"11:02 am","url":"https://shroudstory.com/2015/07/02/is-colin-berry-onto-something/","cat":"image_theory","title":"Is Colin Berry Onto Something?"},{"id":"comment-204820","author":"anoxie","post":"Image n° 2 is a superficial coloration, not a shroud like image. Rogers had produced a superfical coloration by Maillard..","date":"2015-07-07","mins":"2:23 am","url":"https://shroudstory.com/2015/07/02/is-colin-berry-onto-something/","cat":"image_theory","title":"Is Colin Berry Onto Something?"},{"id":"comment-204421","author":"anoxie","post":"So he has been “probably” wrong (does he/you explain why?) for years, promoting a scorch hypothesis and insulting “shroudies”. Now he is probably “onto something”, something being somewhat a bad melting pot of the very same shroudies’ theories. The only serious “breakthrough” being “probably” a Maillard reaction as an explanation for the browning. Wow..","date":"2015-07-03","mins":"5:25 am","url":"https://shroudstory.com/2015/07/02/is-colin-berry-onto-something/","cat":"image_theory","title":"Is Colin Berry Onto Something?"},{"id":"comment-204409","author":"anoxie","post":"Colin has been for two years onto a scorch hypothesis. Can our reader explain his scorch hypothesis and why Colin has given up?.","date":"2015-07-03","mins":"12:49 am","url":"https://shroudstory.com/2015/07/02/is-colin-berry-onto-something/","cat":"image_theory","title":"Is Colin Berry Onto Something?"},{"id":"comment-204423","author":"anoxie","post":"What is needed to make Rogers’ hypothesis viable are to find out the reactants. Flour is not one of them. “Spice” “oil” “myhrr” “sweat” “urine” “saponaria” or “loving hands” mean i don’t know..","date":"2015-07-03","mins":"5:32 am","url":"https://shroudstory.com/2015/07/02/is-colin-berry-onto-something/","cat":"image_theory","title":"Is Colin Berry Onto Something?"},{"id":"comment-204444","author":"anoxie","post":"“Maillard requires high temperature” This was Colin’s argument when he was onto something, Thibault answered: https://shroudstory.com/2012/08/12/thibault heimburger i hope now that nobody will claim that there is no maillard reaction and no color at room temperature/.","date":"2015-07-03","mins":"10:14 am","url":"https://shroudstory.com/2015/07/02/is-colin-berry-onto-something/","cat":"image_theory","title":"Is Colin Berry Onto Something?"},{"id":"comment-87424","author":"anoxie","post":"“OK, so it’s a tall order (maybe) to create a 200nm thick scorch that never goes deeper into the weave. But it’s not a tall order if one is then allowed to come back a few centuries later when all the more deeply scorched fibres have broken off, leaving just those with the PCW scorched.” … that never goes deeper into individual linen fibers. Next..","date":"2014-03-11","mins":"3:10 pm","url":"https://shroudstory.com/2014/03/11/is-time-the-secret-ingredient-we-need-to-consider/","cat":"image_theory","title":"Is Time the Secret Ingredient We Need to Consider?"},{"id":"comment-208015","author":"anoxie","post":"You can get 3 D with scorching, water stains, frottage, painting, photographs…. The question is which model is the best fit for the 3 D properties of the Shroud. You can ask for more data on the 3 D to choose between different models, but are we there yet? Has the preliminary work been done?.","date":"2015-08-12","mins":"12:25 am","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","title":"It is really, really time to rethink what we think about 3D"},{"id":"comment-207950","author":"anoxie","post":"“Il reste tout à fait possible de faire une VRAIE représentation 3 D à partir d’un bas relief.” This basic 3 D analysis was pointed back in 2005. So, when Dan wrote in 2011 : “the 3 D encoding (height field data) of the image is unexplained by science and controverts ancient forgery” and is now considering to “rethink the 3 D”, it is a personnal statement..","date":"2015-08-11","mins":"4:31 am","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","title":"It is really, really time to rethink what we think about 3D"},{"id":"comment-17484","author":"anoxie","post":"Paulette, do you think we can go on for new tests on the Shroud without settling the question of the 1988 radiocarbon dating ?.","date":"2012-10-11","mins":"10:21 am","url":"https://shroudstory.com/2012/10/11/it-is-thus-but-may-not-berichard-dawkins-should-ignore-the-challenge/","cat":"image_theory","title":"It is thus but may not be–Richard Dawkins should ignore the challenge"},{"id":"comment-51782","author":"anoxie","post":"Ok, thank you, need to go back to the source article..","date":"2013-11-17","mins":"4:48 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51807","author":"anoxie","post":"Ok. Blood “very low in potassium” , in Adler ´s paragraph, seems to be blood exudates vs whole blood..","date":"2013-11-17","mins":"6:02 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51461","author":"anoxie","post":"Back to basic. What were the conclusions of the STURP, notably which mechanism had been excluded ? Why did Ray Rogers re consider his position concerning a diffusion mechanism ? Why did Ray Rogers, a leading expert in thermal analyst, exclude a scorch hypothesis ? The answers are still valid..","date":"2013-11-15","mins":"11:24 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51706","author":"anoxie","post":"Suggestion for addtion : miraculous disparition of pigments. Colinsberry : But it might be a composite “painting” (well, frottage actually) if Luigi Garlaschelli’s model is looked at closely..","date":"2013-11-17","mins":"6:54 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51748","author":"anoxie","post":"Everyone from med school knows potassium is mainly intracellular. What was the sensitivity for potassium ? Which articles are you referring to ?.","date":"2013-11-17","mins":"10:56 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-135057","author":"anoxie","post":"A real corpse, this is a U Turn for Colin Berry. Next one, not a scorch but a chemical reaction ? :).","date":"2014-07-03","mins":"5:40 am","url":"https://shroudstory.com/2014/07/03/its-everything-to-do-with-an-unyielding-structure-called-the-upper-rib-cage/","cat":"image_theory","title":"It’s everything to do with an unyielding structure called the upper rib cage"},{"id":"comment-135266","author":"anoxie","post":"Thibault, scorch is dead, Colin just wants to keep playing, whatever inconsistencies..","date":"2014-07-04","mins":"4:25 am","url":"https://shroudstory.com/2014/07/03/its-everything-to-do-with-an-unyielding-structure-called-the-upper-rib-cage/","cat":"image_theory","title":"It’s everything to do with an unyielding structure called the upper rib cage"},{"id":"comment-16447","author":"anoxie","post":"This is disappointing. We are back to this degraded and blurred version of Rogers’ hypothesis. I don’t know where it comes from. Rogers himself, who was then urged to think of “something else” ? Various misunderstandings ? That’s precisely why I asked Thibault for more details concerning his hypothesis. Just start with two comments : – note that cadaverine or putrescine have been ruled out by Thibault. – “the gaseous molecules were transported to the Shroud by thermal ie.vertical convection currents”, “Heat the dummy to give a range of surface temperatures” : this is a totally unlikely model, and bad physics..","date":"2012-09-18","mins":"6:29 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","title":"Latest on David Rolfe’s Site on Maillard Reaction"},{"id":"comment-16513","author":"anoxie","post":"I think the main parameter is gas concentration gradient, temperature gradient being a second order parameter. As you say, you can’t have significant temperature gradients with a dead body. If you consider a living body, i’m not convinced Maillard reaction kinetics would be sensitive enough to temperature gradients on the shroud to produce contrasts we can see. And i don’t think either temperature gradients would fit the image pattern (hairs have very low thermal conductivity, steep temperature gradients next to contact points). Plus you have to consider the breathing which would disturb the whole face area, not a very limited (hardly noticable) area under the nose. Chest and abdominal movements are other issues. But your point confirms Rogers feeling temperature gradients were important (but don’t forget he was a thermal analyst). Concerning scourge marks : i think you don’t wonder how blood came on the cloth, just consider reactants for the Maillard reaction could have been transfered by diffusion (ammonia, heavy amines) and direct contact too from wounds/plasma exsudation and sweat (thinking of glutamine, reactants don’t necessarily come from decomposition)..","date":"2012-09-19","mins":"1:02 pm","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","title":"Latest on David Rolfe’s Site on Maillard Reaction"},{"id":"comment-16835","author":"anoxie","post":"I mean the shroud proved we should be carefull with assumptions and rely on facts. Concerning the imprity layer, it could be not perfectly spread at all. Have a look at the banding effect and local aspect of color distribution. Microscopically, thickness of the layer may range on a large scale..","date":"2012-09-24","mins":"2:46 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","title":"Latest on David Rolfe’s Site on Maillard Reaction"},{"id":"comment-16832","author":"anoxie","post":"It is very unlikely you could find cotton evenly hidden in linen threads. How is that for an assumption ?.","date":"2012-09-24","mins":"2:05 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","title":"Latest on David Rolfe’s Site on Maillard Reaction"},{"id":"comment-16484","author":"anoxie","post":"Helmut Felzmann : Therefore I think that if somebody considers a chemical process (like the Maillard reaction as proposed by Rogers) he might finally come up with the hypothesis of a living body. If you take a living body, one issue is the breathing. Take 5 L/min for an adult. There is no longer any concentration gradient depending on body cloth clearance around nose and mouth, and the main parameter remaining is temperature. Then temperature gradient on linen is created by hot air coming out of nose/mouth and direct contact point (low thermal diffusivity of linen). This is not consistent with the image of the face. Concerning the scourge marks, I don’t see your point..","date":"2012-09-18","mins":"5:55 pm","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","title":"Latest on David Rolfe’s Site on Maillard Reaction"},{"id":"comment-16840","author":"anoxie","post":"Treatment/alteration/properties of the primary cell wall ? Mechanical properties of image fibers are different from non image fibers. If confirmed, I can hardly imagine how a thin impurity layer could increase sensitivy of fibers to tensile stress, without altering pcw. Rogers didn’t know the pcw, but his hypothesis is consistent with pcw/impurity layer or interaction between both as the chromophore..","date":"2012-09-24","mins":"5:05 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","title":"Latest on David Rolfe’s Site on Maillard Reaction"},{"id":"comment-50026","author":"anoxie","post":"You can look at the shroud picture the way you want, upside down, 30°, 45°, and apply the shift this way. Your eyes will still be oriented “horizontally” according to the shift pixels..","date":"2013-11-05","mins":"7:02 am","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","title":"Mario Latendresse’s take on the 3D data"},{"id":"comment-50021","author":"anoxie","post":"Mario : one for the original image and a different color for the shifted pixels Mario, shroud image is isotropic, have you tried a vertical or an oblique shift ? Isn’ t the best result from an horizontal shift because constrast gradient is mainly horizontal ? (thinking of a vertical cylinder – no 3 D with a vertical shift legs, nose, hair…).","date":"2013-11-05","mins":"6:49 am","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","title":"Mario Latendresse’s take on the 3D data"},{"id":"comment-50027","author":"anoxie","post":"O.K., never minds..","date":"2013-11-05","mins":"7:03 am","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","title":"Mario Latendresse’s take on the 3D data"},{"id":"comment-49995","author":"anoxie","post":"Once, again, forget about 3 D and think of spatial information. The shroud produces a “good 3 D” means constrast is roughly correctly correlated one way or another to spatial information (body shroud distance ?). A photograph produces a “bad 3 D” means contrast is badly correlated (but still more or less slightly correlated) to spatial information. Jackson ‘s experiment based on a photograph with emitted light attenuated through water gives an “excellent 3 D”, means correlation between contrast and spatial information is very good (experiment is designed this way)..","date":"2013-11-05","mins":"4:38 am","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","title":"Mario Latendresse’s take on the 3D data"},{"id":"comment-50005","author":"anoxie","post":"O.K. : the 3 D relief of TS Man’s body is slightly distorted, because one must take into account the way the linen drapped the body. I think Jackson himself has produced the first model taking into account the drapping to correct distortions..","date":"2013-11-05","mins":"5:25 am","url":"https://shroudstory.com/2013/11/04/mario-latendresses-take-on-the-3d-data/","cat":"image_theory","title":"Mario Latendresse’s take on the 3D data"},{"id":"comment-132057","author":"anoxie","post":"Maybe we should wait 2 years, and over 200 postings..","date":"2014-06-21","mins":"8:09 am","url":"https://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/","cat":"image_theory","title":"Maybe a New Image Hypothesis?"},{"id":"comment-49751","author":"anoxie","post":"I don ´t know, there are various interpretations of Rogers ´ theory. That´s why i asked Thibault back in June 2012 for more details and he has written what is in my view the most comprehensive and coherent theory (though to be continued) concerning image formation. It was a mail from Ray Rogers and is on the right side of this blog. It is random diffusion, as random diffusion attenuates light intensity according to the lengh of the path in the water in John Jackson ´s experiment Concerning heavy molecules, this is a critical point, Thibault is working on it. Concerning the reactant on the cloth, given the distribution of image it has to be (double ?) superficial (as long as you consider a diffusion mechanism). Is it a starch coating ? A modification of pcw of superficial fibers during the production of the cloth ? More tests are needed. Btw, Rogers didn ´t know the pcw, no wonder he never mentionned it..","date":"2013-11-03","mins":"11:07 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","title":"Maybe the 3D data doesn’t mean what we think it does"},{"id":"comment-49738","author":"anoxie","post":"Rogers ´ model is not a convection model but a diffusion model. Convection ruins the resolution..","date":"2013-11-03","mins":"9:58 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","title":"Maybe the 3D data doesn’t mean what we think it does"},{"id":"comment-49724","author":"anoxie","post":"The most convincing point relating the data to a cloth body distance would be to correct the distortions according to the projection/formation mechanism and see which model is the best match to a real human form..","date":"2013-11-03","mins":"9:37 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","title":"Maybe the 3D data doesn’t mean what we think it does"},{"id":"comment-49694","author":"anoxie","post":"The “fog” may be water: emitted light from the surface, diffuses through water and intensity is attenuated. Jackson has done this experiment (the real face of Jesus, 47′), body cloth clearance with a plane / wrapping the body surface. That said, the shroud was not underwater, and a heavy molecule diffusing through air may do the task, at first order..","date":"2013-11-03","mins":"6:49 am","url":"https://shroudstory.com/2013/11/03/maybe-the-3d-data-doesnt-mean-what-we-think-it-does/","cat":"image_theory","title":"Maybe the 3D data doesn’t mean what we think it does"},{"id":"comment-7770","author":"anoxie","post":"Fanti’s article is naively biaised. But I would draw a parallel with the C14 datation. In both cases there is an assumption which distorted the way facts have been analysed. 1/ Fanti’s article. There’s the image of a body, the imprint of which is lying on a linen => there must be an outline. 2/ C14 datation. They took a sample, textile experts said it’s homogeneous => it must be homogeneous. Error ? 1/ The outline is not continuous whereas it should be => take opportune values and techniques and reconstruct a continuous outline. 2/ C14 datation. Significancy limit 5% => don’t bother explaining this very low significancy, take opportune statistical techninques, anyway it’s medieval not antique. Artefact or new fact ? 1/ The linen could be folded. 2/ The sample could may be not representative of the whole linen..","date":"2012-01-31","mins":"2:00 pm","url":"https://shroudstory.com/2012/01/30/more-on-sciencebod-reacts-focus-on-paper-by-fanti-et-al/","cat":"image_theory","title":"More on Sciencebod Reacts (Focus on paper by Fanti, et al)"},{"id":"comment-7715","author":"anoxie","post":"To be more specific on Fanti’s article : 1/ The raw computerized outline without any reconstruction would have been more informative than the smooth imprint. 2/ “The technique to point out the outlines used different elaborations, among them a preliminary filtering of the image, a determination of the threshold on the basis of preestablished grey levels and an adjustment of the outline through suitable spatial filters.” more explanations about the techniques would be required. 3/ “an opportune value like threshold is determined” opportune seems subjective. 4/ There is a zone under the buttocks with no image. Using a computerized method would lead to a discontinuous outline on the dorsal image. Best regards,.","date":"2012-01-30","mins":"2:00 pm","url":"https://shroudstory.com/2012/01/30/more-on-sciencebod-reacts-focus-on-paper-by-fanti-et-al/","cat":"image_theory","title":"More on Sciencebod Reacts (Focus on paper by Fanti, et al)"},{"id":"comment-58492","author":"anoxie","post":"Mystery : “there are no chemical or physical methods known which can account for the totality of the image, nor can any combination of physical, chemical, biological or medical circumstances explain the image adequately.” Ignorance : “there could be a thin reactive layer on external fibers.”.","date":"2013-12-12","mins":"3:12 pm","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","title":"Mystery as Proof"},{"id":"comment-58345","author":"anoxie","post":"The limit is thin between mystery and ignorance..","date":"2013-12-12","mins":"8:07 am","url":"https://shroudstory.com/2013/12/12/mystery-as-proof/","cat":"image_theory","title":"Mystery as Proof"},{"id":"comment-42389","author":"anoxie","post":"Hi Thibault, are you still working on “other heavy amines” ? Thanks,.","date":"2013-08-30","mins":"5:40 am","url":"https://shroudstory.com/2013/08/26/nicely-done-you-must-download-this/","cat":"image_theory","title":"Nicely Done: You must download this"},{"id":"comment-42137","author":"anoxie","post":"” I have always been a little puzzled by the effects of using image obtain by film cameras” What effects are we talking about ?.","date":"2013-08-27","mins":"11:12 am","url":"https://shroudstory.com/2013/08/27/nicely-done-continued/","cat":"image_theory","title":"Nicely Done Continued"},{"id":"comment-139470","author":"anoxie","post":"Definitely Colin likes to shoot himself in the foot. This is an obvious selective bias. Look at the ulnar side of the right hand, there is an image, yellow rectangle concerns only the radial side. Now, cross your left hand over your right hand and move it slightly, you’ll rub the radial part of the dorsal face of the right hand, leaving the unlnar side undisturbed, precisely where you get the image. RIP impactograph twaddle..","date":"2014-07-20","mins":"9:26 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?"},{"id":"comment-139679","author":"anoxie","post":"“cross your left hand over your right hand and move it slightly, you’ll rub the radial part of the dorsal face of the right hand, leaving the unlnar side undisturbed,” I don’t change a single word. The TS man has his left hand over his right hand. Yelow rectangle is centered on the radial side of the dorsal side of the (anatomical) right hand of the TS man (A B) where you can see a faint image (Colin’s selection bias), whereas on the ulnar side of the dorsal side of the right hand you can see a much clearer image (right hand – D). (A B) and (A C) are on the radial side..","date":"2014-07-21","mins":"3:27 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?"},{"id":"comment-139651","author":"anoxie","post":"Colin should buy a microscope and a pair of glasses, but it’s old news..","date":"2014-07-21","mins":"10:24 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?"},{"id":"comment-140091","author":"anoxie","post":"Thibault Heimburger wrote : “The question is: is there a faint image in that area?” I guess “that area” is the (A B) triangle, it’s a banding effect as you’ve suggested. Note the slight misalignement of the 5th right finger..","date":"2014-07-24","mins":"3:44 am","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?"},{"id":"comment-16852","author":"anoxie","post":"You should read critics raised on this blog after the Valencia meeting to note there is a real debate going on on this issue..","date":"2012-09-24","mins":"9:36 am","url":"https://shroudstory.com/2012/09/24/of-infrared-herrings-and-mickey-mouse-science-berry-criticizing-di-lazzaro/","cat":"image_theory","title":"Of Infrared Herrings and Mickey Mouse Science:  Berry Criticizing Di Lazzaro"},{"id":"comment-89231","author":"anoxie","post":"“Pixels” are contingent..","date":"2014-03-15","mins":"11:25 am","url":"https://shroudstory.com/2014/03/15/of-pixels-spectrum-and-density/","cat":"image_theory","title":"Of Pixels, Spectrum and Density"},{"id":"comment-141478","author":"anoxie","post":"“Even the common French description of the Shroud as the “Suaire” (“face cloth”) instead of a “linceul”.” This is a recurrent theme from Colin… Guess what: a “suaire” is a “linceul” in French, both terms are usually used to describe the Shroud. Http://www.littre.org/definition/suaire..","date":"2014-07-31","mins":"1:18 pm","url":"https://shroudstory.com/2014/07/31/okay-maybe-i-shouldnt-have-used-the-word-significant/","cat":"image_theory","title":"Okay, maybe I shouldn’t have used the word ‘Significant’"},{"id":"comment-43004","author":"anoxie","post":"Yannick, i think this paper is simply anterior to his mail, written in 2003 i guess, and to his experiments which proved convection blurred the image..","date":"2013-09-05","mins":"8:16 am","url":"https://shroudstory.com/2013/09/01/paper-chase-an-alternate-hypothesis-for-the-image-color/","cat":"image_theory","title":"Paper Chase:  An Alternate Hypothesis for the Image Color"},{"id":"comment-43492","author":"anoxie","post":"2003 mail :3 MAILLARD REACTION IN DETAIL No convection means no convection cells, but diffusion is still active..","date":"2013-09-09","mins":"1:23 pm","url":"https://shroudstory.com/2013/09/01/paper-chase-an-alternate-hypothesis-for-the-image-color/","cat":"image_theory","title":"Paper Chase:  An Alternate Hypothesis for the Image Color"},{"id":"comment-42685","author":"anoxie","post":"I think this is a dead end. But the article where he sums up his ideas (top right corner of this blog) is an excellent basis and different from this version..","date":"2013-09-02","mins":"1:36 pm","url":"https://shroudstory.com/2013/09/01/paper-chase-an-alternate-hypothesis-for-the-image-color/","cat":"image_theory","title":"Paper Chase:  An Alternate Hypothesis for the Image Color"},{"id":"comment-43499","author":"anoxie","post":"Convection, and convection cells, would result from a temperature gradient not from the substances (but skin temperature quickly reaches ambient temperature once blood flow stops.) There are many factors limiting resolution, one is the molecular weight of diffusing molecules, e.g. NH3 alone simply can’t reach high resolution..","date":"2013-09-09","mins":"3:13 pm","url":"https://shroudstory.com/2013/09/01/paper-chase-an-alternate-hypothesis-for-the-image-color/","cat":"image_theory","title":"Paper Chase:  An Alternate Hypothesis for the Image Color"},{"id":"comment-43496","author":"anoxie","post":"That´s the point. Challenge is to identify which substances diffused from the surface of the skin, and the heavier the better. Using EDTA he got a millimetric resolution..","date":"2013-09-09","mins":"2:39 pm","url":"https://shroudstory.com/2013/09/01/paper-chase-an-alternate-hypothesis-for-the-image-color/","cat":"image_theory","title":"Paper Chase:  An Alternate Hypothesis for the Image Color"},{"id":"comment-17269","author":"anoxie","post":"“the blood marks document body flattening” Blood marks are partially completed by image marks. Don’t these image marks document body flattening ?.","date":"2012-10-06","mins":"12:40 pm","url":"https://shroudstory.com/2012/10/05/paper-chase-lavoies-paper-from-frascati/","cat":"image_theory","title":"Paper Chase: Lavoie’s Paper from Frascati"},{"id":"comment-23925","author":"anoxie","post":"I don’t think the point spread function is shift invariant. Anyway, I don’t think we can assume the “acquisition system” is a “focused optical system”. This article is nonsense..","date":"2013-02-10","mins":"11:11 am","url":"https://shroudstory.com/2013/02/10/paper-chase-mtf-resolution-4-90-5-mm-and-all-that/","cat":"image_theory","title":"Paper Chase: MTF Resolution, 4.9±0.5 mm and all that"},{"id":"comment-13052","author":"anoxie","post":"There’s no second part(cf previous discussion) Resuming Rogers’ idea to a “Gas diffusion hypothesis” is misleading (at least G. Fanti was mislead in his analysis of Rogers’ hypothesis) : to be precise Rogers’ explanation of chemical properties of the image is based on Maillard reaction, concerning image resolution he made an hypothesis, to be tested and optimized, including many parameters, one of which being gas diffusion. Rogers John Jackson’s mathematical analysis of image resolution suggested that no single, simple molecular diffusion or radiation mechanism could produce the image observed. However, a combination of systems could offer an explanation, e.g., anisotropic heat flow by radiation from the body to the cloth, attenuated heat flow in the cloth, gaseous diffusion, convection, surface properties of cloth, and the dependence of chemical rates on temperature..","date":"2012-06-26","mins":"6:47 am","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis"},{"id":"comment-13162","author":"anoxie","post":"Gabriel : more research is needed regarding the motion of gases/amines and how this explanation fits in the anisotropiic vertical formation of image Well, you’ve got the answer, it can’t fit, gaseous diffusion is isotropic. Then I don’t think there is a “vertical formation of image”. But, if you assume the shroud was mostly in direct contact with the corpse, you can consider local conditions consistent with so called “high resolution”..","date":"2012-06-28","mins":"5:33 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis"},{"id":"comment-13280","author":"anoxie","post":"Yes, I think too Rogers found the right track. As Thibault wrote in his article the reactive amine should be on the skin. And next step is : Thibault HEIMBURGER : The main first key parameter is the number of gaseous molecules reaching the target at a given location within a certain time. That is modelling the liquid vapour transition kinetic and interdiffusion of gases..","date":"2012-07-01","mins":"11:05 am","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis"},{"id":"comment-13351","author":"anoxie","post":"Yannick Clément : a fiber that would have more impurity on its surface would have a higher coloring potential Exactly, but too much impurity and the contrast is ruined… What seems extraordinary is the very good match between the amount of reactive amines and the amount of reactive on the shroud. And as you say, there may be other critical parameters (temperature ? moisture ? adsorption ? diffusivity/porosity of the shroud ?) Actually, there seem to be a contrast of the image depending on the band. That’s obvious on “blank” bands, but on brown ones, we should not mistake the variegated patterns for the image. It’s hard if not impossible to do on a picture. I don’t think STRP team did a spectrophotography of the shroud able to differentiate image patterns from variegated patterns. Is there such a material ? Or at least a very high resolution picture of the shroud ?.","date":"2012-07-03","mins":"1:11 am","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis"},{"id":"comment-13334","author":"anoxie","post":"So far, based on basic models (plane and radial diffusion) to study gradient concentration, I think the diffusion hypothesis is consistent with image resolution. Another argument for gaseous diffusion is the banding effect. I found a picture with an enhanced contrast (or a better resolution) here. Contrast is very good but you can see few bands almost blank or brown all lenght long. And according to gaseous diffusion, there was gas in no contact zones (between fingers, between hands and legs…), able to react. Then we can say, on this area, the limiting factor was the reactive on the cloth..","date":"2012-07-02","mins":"3:58 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis"},{"id":"comment-13481","author":"anoxie","post":"Yannick Clément : And for the match between the amount of reactive amines and the amount of impurities on the fibers, I’m not so sure about that. In my mind, it is truly possible that there some light coloration that have not been detected on some fibers because these fibers didn’t beared much impurities, while in other areas (where the bands are darker), it’s truly possible to think that the more impurities there are on the fibers, the more we can see an intense coloration. Ok, I’ll try to be clearer. Coloration intensity is based on the density of impurity layer, but contrast comes from the difference between colored zones and the background color, and gradient of reactive on colored zones. If the density of the impurity layer was too high, we would have a blurred image (like the one Rogers got in his first experiments), too low, a ghostly or no image. To have a correct contrast, the global range of the reactive and the mean density of impurity layer have to match..","date":"2012-07-05","mins":"1:19 am","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis"},{"id":"comment-13566","author":"anoxie","post":"Yannick Clément : I think only real experiments (along with maybe some estimations from a software modeling) could permit to calculate this range precisely. Experiments are needed to explore the reactivity of the impurity layer, and the amounts/type of reactive amines needed to have a correct resolution. But I see no theoretical objection to discard this hypothesis..","date":"2012-07-07","mins":"5:12 am","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis"},{"id":"comment-13367","author":"anoxie","post":"In my view, there is no definite argument for vertical anisotropy..","date":"2012-07-03","mins":"4:55 am","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis"},{"id":"comment-13659","author":"anoxie","post":"That’s it, i don’t see any definitive argument to reject an hypothesis based on Maillard reaction..","date":"2012-07-09","mins":"3:20 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis"},{"id":"comment-13103","author":"anoxie","post":"To start with, Maillard reaction itself is complex. Its kinetic and products depend on substances reacting and parameters such as moisture, p H, temperature which have to be determined. So yes, a chemist’s expertise is definitely needed..","date":"2012-06-27","mins":"12:27 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis"},{"id":"comment-13628","author":"anoxie","post":"I don’t speak spanish, but I think you based your argument on Rogers’ hypothesis presented in his article on Maillard reaction. Your points are debatable but mostly right, that’s why to have a comprehensive hypothesis, it must be optimized. I can read “putrescina, cadaverina” in your comment, you should note they have been ruled out by thibault Heimburger, his article cited in this post..","date":"2012-07-09","mins":"1:08 am","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis"},{"id":"comment-13637","author":"anoxie","post":"Why do you discard Maillard reaction ?.","date":"2012-07-09","mins":"4:00 am","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis"},{"id":"comment-13665","author":"anoxie","post":"Temperature : ok Putrefaction and gases coming from the orifices : ok But i think that was mere ideas for Rogers, not a comprehensive hypothesis. Concerning Maillard reaction and the resolution, i don’t agree. Maillard reaction id the best explanation, by far, to explain chemical properties of the image. Resolution is consistent with gaseous diffusion given a close corpse shroud configuration..","date":"2012-07-09","mins":"8:11 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis"},{"id":"comment-146535","author":"anoxie","post":"There is an irregular banding pattern horizontally Hugh..","date":"2014-08-27","mins":"11:31 am","url":"https://shroudstory.com/2014/08/27/banding-is-it-real/","cat":"image_theory","title":"Banding? Is it Real?"},{"id":"comment-13768","author":"anoxie","post":"I would go further, this hypothesis cannot be ruled out, and is the most consistent with image pattern. Concerning diffusion one should keep in mind that : Rogers : “Diffusion does not mean the same thing as “diffuse”..","date":"2012-07-12","mins":"1:07 am","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis"},{"id":"comment-13687","author":"anoxie","post":"Ron : “Resolution is consistent with gaseous diffusion given a close corpse Shroud configuration’ ….Please lets stay real here! Where is this consistence evidence? Diffusion creates a gradient of concentration/density of probability decreasing exponentially with distance (obviously analytical results have other factors depending on plane, radial diffusion) + we should take into acount boundaries contidions (close corps Shroud configuration) eg : compare legs and fingers, local gradient depends on radius, what can you see ? a higher resolution on fingers vs legs. Now, Ron, what I said, is : anoxie : So far, based on basic models (plane and radial diffusion) to study gradient concentration, I think the diffusion hypothesis is consistent with image resolution. So far, diffusion can’t be discarded..","date":"2012-07-10","mins":"10:28 am","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis"},{"id":"comment-13786","author":"anoxie","post":"Gabriel : A solid model describing the motion of amines from the body towards the cloth is still missing. Fick’s laws of diffusion (+ close corpse shroud configuration) : Smaller bend radius explains higher resolution and steeper gradient. Diffusion gradient explains no clearcut edge of the image. Isotropy is inherent to diffusion. Gabriel : Particularly, the motion of those amines coming from the lungs through mouth and nose. The movement of this amines from the nose to the hair and then towards the cloth to originate a Maillard reaction while providing a high resolution seems to me hard to understand. The reactive amines should be on the skin..","date":"2012-07-12","mins":"5:08 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis"},{"id":"comment-13115","author":"anoxie","post":"“Gaseous diffusion hypothesis” is misleading. A large part of the shroud could be in direct contact with the body. And this is to be quantified, but when Dr Flury Lemberg removed the back cloth on the shroud, she noticed the shroud is strikingly soft. There is no color saturation on the shroud, ok, but analysing the grey scale, there are evidences of a saturation at contact points (hair, nose, eyebrows, beard, chicks, forearms…), and gradient is steep (pure diffusion zones). Concerning contact zones, there’s a pressure gradient too. Higher pressure meaning microcopically : shroud clother to the skin, and more contact points..","date":"2012-06-27","mins":"5:39 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis"},{"id":"comment-130210","author":"anoxie","post":"Thibault Heimburger : “If there is a stochastic process, it is at thread level and not only at fiber level.” Stochastic process at a thread level, seriously ?!? Authors mistake “stochastic” for “unknown”. And I don’t see why this process should not be totally deterministic..","date":"2014-06-17","mins":"8:51 am","url":"https://shroudstory.com/2014/06/17/photomicrographs-and-stochastic-imaging/","cat":"image_theory","title":"Photomicrographs and Stochastic Imaging"},{"id":"comment-130930","author":"anoxie","post":"You’re the chemist Thibault, the issue is complex and i may remind you i’ve been waiting for two years your views on the potential reactants. So let’s start with physics, if you consider a gas solid reaction, the surface of the fiber is critical, fibers are heterogeneous and surfaces more or less cracked resulting to a different sensitivity to induction phase allowing the autocatalytic reaction and reaction completion. This is one parameter of the “varying threshold” of reactants leading to the coloration of a given fiber. (You can consider a genuine stochastic fm screening but usually it refers to a printing technique where “stochastic” is pseudo random and not a genuine physical/chemical stochastic event.).","date":"2014-06-18","mins":"5:23 pm","url":"https://shroudstory.com/2014/06/17/photomicrographs-and-stochastic-imaging/","cat":"image_theory","title":"Photomicrographs and Stochastic Imaging"},{"id":"comment-130253","author":"anoxie","post":"Reproducing the shroud using FM screening you’ll get 3d as well..","date":"2014-06-17","mins":"12:00 pm","url":"https://shroudstory.com/2014/06/17/photomicrographs-and-stochastic-imaging/","cat":"image_theory","title":"Photomicrographs and Stochastic Imaging"},{"id":"comment-130242","author":"anoxie","post":"?.","date":"2014-06-17","mins":"11:48 am","url":"https://shroudstory.com/2014/06/17/photomicrographs-and-stochastic-imaging/","cat":"image_theory","title":"Photomicrographs and Stochastic Imaging"},{"id":"comment-130300","author":"anoxie","post":"Frequency densities, fibers properties..","date":"2014-06-17","mins":"1:56 pm","url":"https://shroudstory.com/2014/06/17/photomicrographs-and-stochastic-imaging/","cat":"image_theory","title":"Photomicrographs and Stochastic Imaging"},{"id":"comment-130287","author":"anoxie","post":"Actually I think the shroud is consistent with AM screening with varying frequencies resulting in a higher contrast and sharper 3 D than a high resolution FM screening. But “stochastic FM screening” is misleading, it is not a stochastic process but a pseudo random distribution of dots. On the TS, the grid is the linen and contrary to a stochastic process, i think the key is a varying threshold..","date":"2014-06-17","mins":"1:37 pm","url":"https://shroudstory.com/2014/06/17/photomicrographs-and-stochastic-imaging/","cat":"image_theory","title":"Photomicrographs and Stochastic Imaging"},{"id":"comment-170873","author":"anoxie","post":"I think you’re in the worst position to criticize Charles for writing off STURP science, and furthermore, you’re asking us to compare. This was my answer to your suggestion..","date":"2014-11-12","mins":"2:05 pm","url":"https://shroudstory.com/2014/11/12/real-1st-century-or-simulated-14th-century-sweat-imprint/","cat":"image_theory","title":"Real 1st century or simulated 14th century sweat imprint?"},{"id":"comment-170865","author":"anoxie","post":"You’ve written off STURP science. You’ve insulted STURP scientists. You’ve claimed to have solved the mystery (“After 2 years, and over 200 postings, I think I’ve finally cracked it – the enigma of the Shroud of Turin.”) vs HT version “Origins of the TS, Solving history’s greatest mystery”. Except your outrageous behavior vs Charles civility, no, i can’t see the difference..","date":"2014-11-12","mins":"1:51 pm","url":"https://shroudstory.com/2014/11/12/real-1st-century-or-simulated-14th-century-sweat-imprint/","cat":"image_theory","title":"Real 1st century or simulated 14th century sweat imprint?"},{"id":"comment-13844","author":"anoxie","post":"Do you have contacts with Bob Villareal ? Actually, there is a very serious hypothesis to explore here, according to Rogers’ hypothesis + Thibaut’s paper on reactive amines. And the image pattern is consistent with a diffusion process. I think there should be physicists at the LANL able to study rigorously this hypothesis..","date":"2012-07-14","mins":"8:26 am","url":"https://shroudstory.com/2012/07/11/rejecting-all-the-energetic-hypothesis-for-the-shroud-of-turin-image/","cat":"image_theory","title":"Rejecting all the “energetic” hypothesis for the Shroud of Turin image"},{"id":"comment-13891","author":"anoxie","post":"Ok. There are very solid arguments pointing to a diffusion process. Maybe it’s time to request for help, if he is interested he could give a look or foward it to his Ph Ds..","date":"2012-07-16","mins":"5:55 am","url":"https://shroudstory.com/2012/07/11/rejecting-all-the-energetic-hypothesis-for-the-shroud-of-turin-image/","cat":"image_theory","title":"Rejecting all the “energetic” hypothesis for the Shroud of Turin image"},{"id":"comment-13893","author":"anoxie","post":"The point is to have a multidisciplinary approach and get a final answer..","date":"2012-07-16","mins":"8:08 am","url":"https://shroudstory.com/2012/07/11/rejecting-all-the-energetic-hypothesis-for-the-shroud-of-turin-image/","cat":"image_theory","title":"Rejecting all the “energetic” hypothesis for the Shroud of Turin image"},{"id":"comment-101908","author":"anoxie","post":"Consensus ? 1/ no consensus – parenthetical change a posteriori 2/ “not visible”… To the naked eye ? 3/ intensity is higher on the face… contact points = same cloth body distance… Same intensity ? 4/ where starts the side of a sphere or a cylinder ? … And so on… Is there any consensus on the list of the scientists who signed this consensus ?.","date":"2014-04-21","mins":"5:55 am","url":"https://shroudstory.com/2014/04/16/remember-the-valencia-consensus-parenthetical/","cat":"image_theory","title":"Remember the Valencia Consensus Parenthetical"},{"id":"comment-202963","author":"anoxie","post":"The whole thread: https://shroudstory.com/2015/06/14/stephen jones on the thomas de wesselow presentation/.","date":"2015-06-20","mins":"3:09 pm","url":"https://shroudstory.com/2015/06/20/resolution-of-the-shroud-image/","cat":"image_theory","title":"Resolution  of the Shroud Image"},{"id":"comment-202912","author":"anoxie","post":"Do you have any idea concerning the reactants at stake?.","date":"2015-06-20","mins":"6:29 am","url":"https://shroudstory.com/2015/06/20/resolution-of-the-shroud-image/","cat":"image_theory","title":"Resolution  of the Shroud Image"},{"id":"comment-7659","author":"anoxie","post":"Sciencebod : OK, I’ll accept (reluctantly for now) that it’s all to do with flexion, rigor mortis, foreshortening, call it what you will, but something inside tells me there is something not quite right. I’m reluctant too. There’s a real issue concerning the difference of lenght between frontal and dorsal image. Fanti proposed outlines, reproduced on the picture above. You can see these outlines are continuous. Point is if you look at the dorsal image, there is a zone under the buttocks with no image. How do you draw an outline ? by extrapolation ? Assuming there must be an image ? Assuming the linen was here, standing in front of the body, streched ? What has been taken for granted can be questionned. Sciencebod is just pointing an issue with no satisfying answer..","date":"2012-01-29","mins":"10:34 am","url":"https://shroudstory.com/2012/01/26/sciencebod-reacts/","cat":"image_theory","title":"Sciencebod reacts"},{"id":"comment-86510","author":"anoxie","post":"If you consider oignon is mainly made of starch and sugars, it looks like the suggested hoax recipe based on a thin external layer : Rogers : Using a cloth washed in a low surface tension solution containing pentose sugars (e.g., a Saponaria solution) and dried in the sun, a non metallic statue at a temperature above 100 C might have worked.A thin oignon layer doesn’t absord much heat, it protects only very slightly and briefly the linen. It is just more sensitive to lower temperature..","date":"2014-03-09","mins":"7:22 am","url":"https://shroudstory.com/2014/03/09/scorching-onion-skins/","cat":"image_theory","title":"Scorching Onion Skins"},{"id":"comment-7621","author":"anoxie","post":"Hi, The shroud could be folded on the backside, under he bottom. Explaining the difference in lenght, the absence of image, the duplication of wounds and the slight angulation..","date":"2012-01-28","mins":"4:54 am","url":"https://shroudstory.com/2012/01/26/sciencebod-reacts/","cat":"image_theory","title":"Sciencebod reacts"},{"id":"comment-144707","author":"anoxie","post":"Hugh Farey: “The universe and all that it contains are intrinsically rational, and there are no limits to its explicability. If God scorched his ‘bright design’ onto a piece of cloth, he did it within his own laws, and if we work on it enough, we will be able to find out how.” PHPL: “you [Hugh] actually believe in Jesus’ resurrection.” I guess this is a limit to explicability..","date":"2014-08-19","mins":"5:24 am","url":"https://shroudstory.com/2014/08/17/scorched-by-god-a-hymn-for-this-sunday/","cat":"image_theory","title":"Scorched by God? A Hymn for this Sunday."},{"id":"comment-86539","author":"anoxie","post":"Mike M : I don’t get it? We have linen, why experiment on onions. Or is it claimed that the whole shroud was covered in onion? This is what happens when you perform experiments in the kitchen.Mike M : I guess a 4.4×1.1m linen cloth can be produced today not manually woven but I don’t think the weaving whether manual or automatic makes a difference in the image. What’s your point? The point is modern linen can’t be directly compared to the shroud..","date":"2014-03-09","mins":"8:58 am","url":"https://shroudstory.com/2014/03/09/scorching-onion-skins/","cat":"image_theory","title":"Scorching Onion Skins"},{"id":"comment-86553","author":"anoxie","post":"I’ve just pointed the similarities, meaning he’s got a degraded idea of what Rogers suggested years ago..","date":"2014-03-09","mins":"9:42 am","url":"https://shroudstory.com/2014/03/09/scorching-onion-skins/","cat":"image_theory","title":"Scorching Onion Skins"},{"id":"comment-49798","author":"anoxie","post":"This is an important point. There is no easy spatial information in a photograph because contrast of an image point depends on the amount of reflected light, from a point of the object, reaching the lens. This amount of reflected light mainly depends on the lightning, the properties of the object but not on the spatial configuration. Concerning the shroud VP 8 image is related to spatial information only if you think of an underlying mechanism linking closely distance and contrast..","date":"2013-11-03","mins":"4:21 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-49787","author":"anoxie","post":"Spatial information does not depend on the image but on the mechanism. Light is not attenuated by distance (unless you consider an experiment like Jackson ´s), the contrast depends on the lightning. Pictures from ok except (maybe) the shroud, have no spatial information..","date":"2013-11-03","mins":"2:57 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-155080","author":"anoxie","post":"Super relativism, super illisionism, super skepticism….","date":"2014-09-24","mins":"11:37 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-155498","author":"anoxie","post":"For all anyone knows, putrescine and cadaverine are not involved..","date":"2014-09-25","mins":"1:02 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-155233","author":"anoxie","post":"“It appears that you are extending the meaning of painting or “definitely ruled out” or both.” Don’t be too picky… Scorching or painting or chemical scorch paint, what difference?.","date":"2014-09-24","mins":"4:25 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-155890","author":"anoxie","post":"And where is Paulette, could the image be a painting?.","date":"2014-09-25","mins":"11:22 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-9028","author":"anoxie","post":"Here is the response to this hypothesis (french) : http://www.suaire science.com/documents/rep scienceetvie.pdf by the way, Paul Eric Blanrue is an historian, not a scientist..","date":"2012-03-07","mins":"1:21 pm","url":"https://shroudstory.com/2012/03/04/stephen-jones-has-an-important-posting-on-heated-bas-relief-images/","cat":"image_theory","title":"Stephen Jones has an important posting on heated bas relief images"},{"id":"comment-34399","author":"anoxie","post":"Maillard reaction is not a definite answer. But Rogers’ views concerning a gas diffusion mechanism and an auto catalytical gas solid reaction are the two major parameters explaining image formation/contrast, scientifically..","date":"2013-05-23","mins":"1:42 am","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","title":"Struggling with Naturalist Explanations"},{"id":"comment-156733","author":"anoxie","post":"Hugh, if you think the Shroud could be a painting, you should publish your work in the next newsletter of the BSTS..","date":"2014-09-26","mins":"8:20 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-34705","author":"anoxie","post":"Precisely, in his point 3, Rogers considered gas diffusion AND direct contact. Different reactants must be considered, limited wound patterns illustrate a contact mechanism. The discussion focuses on gas diffusion because the distant mechanism and its resolution is what gives the image its 3 D properties..","date":"2013-05-25","mins":"4:36 am","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","title":"Struggling with Naturalist Explanations"},{"id":"comment-137108","author":"anoxie","post":"Is the blue rectangle centered ? What can people see ?.","date":"2014-07-11","mins":"11:00 am","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","title":"Teeth Reconsidered"},{"id":"comment-137185","author":"anoxie","post":"“why he/she considers it relevant to the present post.” Hugh as already answered, it’s all about an artifact of the banding..","date":"2014-07-11","mins":"4:29 pm","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","title":"Teeth Reconsidered"},{"id":"comment-138077","author":"anoxie","post":"“Troll anoxie is referring to a post I did almost 2 months ago, one that was never picked up on this site.” https://shroudstory.com/2014/05/18/colin berry its not douse water its the feet being orthogonal to the longitudinal plane during scorching/.","date":"2014-07-14","mins":"8:18 am","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","title":"Teeth Reconsidered"},{"id":"comment-171914","author":"anoxie","post":"Adding epicycles….","date":"2014-11-18","mins":"1:12 pm","url":"https://shroudstory.com/2014/11/18/the-conspiracy-of-the-faux-sweat-imprint/","cat":"image_theory","title":"The Conspiracy of the Faux-Sweat Imprint"},{"id":"comment-171844","author":"anoxie","post":"“13. Feet are a problem.” No kidding, Colin could even see individual toes. Actually, he had mistaken banding for toes. Science? “16. Take liberties with human anatomy if necessary (slightly overlong arms and fingers).” No overlong arms and fingers. 1. 5. 14. Post hoc hypotheses… And so on… if not a conspiracy theory, at least an epicycles theory..","date":"2014-11-18","mins":"5:22 am","url":"https://shroudstory.com/2014/11/18/the-conspiracy-of-the-faux-sweat-imprint/","cat":"image_theory","title":"The Conspiracy of the Faux-Sweat Imprint"},{"id":"comment-158919","author":"anoxie","post":"Fuzziness. Let’s wait another 30 months or more and you’ll think to another box: temperature..","date":"2014-10-03","mins":"12:39 pm","url":"https://shroudstory.com/2014/10/03/the-devolution-and-evolution-of-a-maillard-reaction-image-hypothesis/","cat":"image_theory","title":"The Devolution and Evolution of a Maillard Reaction Image Hypothesis"},{"id":"comment-149195","author":"anoxie","post":"Thank you..","date":"2014-09-07","mins":"1:39 am","url":"https://shroudstory.com/2014/09/06/the-man-who-liked-to-dip-pickle-spears-in-his-beers/","cat":"image_theory","title":"The Man Who Liked to Dip Pickle Spears in His Beers"},{"id":"comment-149069","author":"anoxie","post":"“the experiments in Italy and other places all point towards some kind of radiation (Sorry Ray R.).” Thibault Heimburger is active on this blog, understands Ray R.’s work and is the fourth author on “Microscopic and Macroscopic Characteristics of the Shroud of Turin Image Superficiality”. (http://www.ingentaconnect.com/content/ist/jist/2010/00000054/00000004/art00001) Do you think he takes a stand for some kind of radiation mechanism? I’d be curious to know..","date":"2014-09-06","mins":"11:25 am","url":"https://shroudstory.com/2014/09/06/the-man-who-liked-to-dip-pickle-spears-in-his-beers/","cat":"image_theory","title":"The Man Who Liked to Dip Pickle Spears in His Beers"},{"id":"comment-206394","author":"anoxie","post":"Chemical reaction : checked volatile amines : checked what’s next to make things worse? temperature? does Colin still think there is no Maillard reaction at room temperature? I’ve been arguing for months with Colin about his scorch hypothesis vs Rogers’, i won’t comment on this shameless counterfeit. But please Colin, do make things worse for yourself, there’s plenty of room to improve your latest theory, help yourself: https://shroudstory.com/2012/07/30/asking thibault for more details concerning rogers hypothesis/.","date":"2015-07-23","mins":"11:45 am","url":"https://shroudstory.com/2015/07/23/the-morphing-of-rogers-and-berry/","cat":"image_theory","title":"The Morphing of Rogers and Berry?"},{"id":"comment-206398","author":"anoxie","post":"I suggest you to read your comments explaining why Maillard reaction is “thermodynamically” not possible at room temperature. Glad to know you’ve read thermodynamics 101 since then..","date":"2015-07-23","mins":"12:11 pm","url":"https://shroudstory.com/2015/07/23/the-morphing-of-rogers-and-berry/","cat":"image_theory","title":"The Morphing of Rogers and Berry?"},{"id":"comment-206403","author":"anoxie","post":"You’re responsible for your comments, sure: a: i thought the accusations of trolling were no longer tolerated b: you can post under a real name, with a professional reputation, and still, be wrong..","date":"2015-07-23","mins":"12:31 pm","url":"https://shroudstory.com/2015/07/23/the-morphing-of-rogers-and-berry/","cat":"image_theory","title":"The Morphing of Rogers and Berry?"},{"id":"comment-206441","author":"anoxie","post":"“Are we supposed to be impressed with anoxie’s steady stream of toxic comment, unsupported by fact?” Here is what you wrote about Maillard reaction and thermodynamics: https://shroudstory.com/2012/08/11/colin berry so how could ray rogers have got it so wrong/ Where is the stream of poison? Who is the man hitting a professional scientist, unsupported by fact?.","date":"2015-07-24","mins":"12:13 am","url":"https://shroudstory.com/2015/07/23/the-morphing-of-rogers-and-berry/","cat":"image_theory","title":"The Morphing of Rogers and Berry?"},{"id":"comment-103280","author":"anoxie","post":"Prof Dr Nicholas Peter Legh Allen : the body image was created photographically. We can say it’s absurd, it’s an anachronism. More basically, among other critical points, a single optical system can’t reproduce the fluctuations of resolution (obviously missing in your reproduction)..","date":"2014-04-24","mins":"12:46 pm","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","title":"The pig experiment was not Barrie’s experiment"},{"id":"comment-101149","author":"anoxie","post":"Thank you for this didactical paper, it could help non scientific readers understand why the TS is not a scorch..","date":"2014-04-19","mins":"5:49 am","url":"https://shroudstory.com/2014/04/17/the-turin-shroud-image-is-not-a-scorch/","cat":"image_theory","title":"The Turin Shroud Image is not a Scorch"},{"id":"comment-15106","author":"anoxie","post":"Thibault Heimburger I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature. Thibault, you know people will still claim the shroud is a hoax, a painting, a schorching or whatever. What is important is patience and a well argued answer..","date":"2012-08-17","mins":"5:01 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature."},{"id":"comment-21318","author":"anoxie","post":"Bippy123 : As for the image coming from some natural method (Maillard reaction amongst others) this is also completely blown away when you consider the smaller secondary image found when they took off the back stitching ). 1/ is there a secondary image on the back side ? 2/ does it blow away a natural explanation as presented by Rogers ?.","date":"2012-12-29","mins":"8:58 am","url":"https://shroudstory.com/2012/10/21/thibault-heimburger-now-i-know-for-sure-that-the-ts-body-image-is-not-a-scorch/","cat":"image_theory","title":"Thibault Heimburger: Now, I know for sure that the TS body image is not a scorch"},{"id":"comment-15472","author":"anoxie","post":"Actually it seems i’ve missed the Valencia meeting and ENEA’s work. No comment. Concerning the quoted words, they have not been removed, you have to click on “load more post” at the end of comments. And you can see other words which worth quoting : David Rolfe : The fondness that everyone, me included, has for Ray’s memory is the only thing that has kept the theory alive for as long as it has. That is almost an insult to Rogers’ work. I don’t know what David understands to Rogers’ hypothesis, but it is based on very solid scientific arguments..","date":"2012-08-25","mins":"1:43 pm","url":"https://shroudstory.com/2012/08/18/there-should-be-some-kind-of-reaction-at-the-upcoming-bsts-meeting/","cat":"image_theory","title":"There should be some kind of reaction at the upcoming BSTS meeting."},{"id":"comment-21375","author":"anoxie","post":"“How much of this is due to evaporation concentration, and how much due to a failure to penetrate in the first place is difficult to say. Either way, Colin Berry’s latest post on shroudofturinwithoutallthehype reminds us that image formation had at least some effect on the structure of the fibres beneath it, which are described as altogether more fragile than non image fibres.” Concentration does not occur only on a thin layer. Think of a longitudinal section of a flax fiber, then focus on dislocations. Flax fibers break statistically on dislocations..","date":"2012-12-31","mins":"6:36 am","url":"https://shroudstory.com/2012/10/21/thibault-heimburger-now-i-know-for-sure-that-the-ts-body-image-is-not-a-scorch/","cat":"image_theory","title":"Thibault Heimburger: Now, I know for sure that the TS body image is not a scorch"},{"id":"comment-21380","author":"anoxie","post":"Yes, basically the distant mechanism is gas diffusion. But the darkness of the image depends on many parameters, cloth body configuration, porosity of the cloth, products of the reaction ( what color is your beer ?), kinetics (with the modern theory of cracking in physics)… It is really a complex issue..","date":"2012-12-31","mins":"8:22 am","url":"https://shroudstory.com/2012/10/21/thibault-heimburger-now-i-know-for-sure-that-the-ts-body-image-is-not-a-scorch/","cat":"image_theory","title":"Thibault Heimburger: Now, I know for sure that the TS body image is not a scorch"},{"id":"comment-21378","author":"anoxie","post":"1/ further tests are needed, but reactants are still unknown. 2/ no convection (ambient temperature gas, cold skin). 3/ gravity is not a first order parameter, mean free path is. Have look to his theory as presented in the upright corner of this blog..","date":"2012-12-31","mins":"7:23 am","url":"https://shroudstory.com/2012/10/21/thibault-heimburger-now-i-know-for-sure-that-the-ts-body-image-is-not-a-scorch/","cat":"image_theory","title":"Thibault Heimburger: Now, I know for sure that the TS body image is not a scorch"},{"id":"comment-21388","author":"anoxie","post":"You know putrescine and cadaverine have been ruled out. Thibault is thinking of other heavy amines. Trying ammonia, you should try to produce it slowly. Glutamine is a good candidate to produce ammonia at ambient temperature. Rogers used EDTA for mimicking heavy amines (resolution tests). Amines should not be blocked by cloth, it blurs the image (it may happen if production is too quick), they should react when they hit the cloth/diffuse through it..","date":"2012-12-31","mins":"9:43 am","url":"https://shroudstory.com/2012/10/21/thibault-heimburger-now-i-know-for-sure-that-the-ts-body-image-is-not-a-scorch/","cat":"image_theory","title":"Thibault Heimburger: Now, I know for sure that the TS body image is not a scorch"},{"id":"comment-21396","author":"anoxie","post":"He explained he could not finish part 2 and asked a physicist for help. But part 1, the origin of reactive amines, is to be continued since it doesn’t give potential reactants..","date":"2012-12-31","mins":"12:30 pm","url":"https://shroudstory.com/2012/10/21/thibault-heimburger-now-i-know-for-sure-that-the-ts-body-image-is-not-a-scorch/","cat":"image_theory","title":"Thibault Heimburger: Now, I know for sure that the TS body image is not a scorch"},{"id":"comment-18146","author":"anoxie","post":"Thibault HEIMBURGER : A chemical reaction remains as the most probable body image formation process. Definitely..","date":"2012-10-23","mins":"3:51 pm","url":"https://shroudstory.com/2012/10/21/thibault-heimburger-now-i-know-for-sure-that-the-ts-body-image-is-not-a-scorch/","cat":"image_theory","title":"Thibault Heimburger: Now, I know for sure that the TS body image is not a scorch"},{"id":"comment-18407","author":"anoxie","post":"I don’t think a scorch would necessarily be seen in a back lit photography : We see the direct image on the shroud thanks to reflected light on its surface, contrast in a given direction depends highly on superficial fibers. In a back lit photography light diffuses through the cloth, the slight intensity fluctuation due to superficial chromophore is masked by variegated pattern in the whole thickness of the threads. Then a very light scorch would not be seen either in a back lit photography. That’s why i think this back lit photography is an indirect macroscopic argument against scorching whereas Thibault’s article is a much needed direct microscopic argument against scorching..","date":"2012-10-27","mins":"5:22 am","url":"https://shroudstory.com/2012/10/21/thibault-heimburger-now-i-know-for-sure-that-the-ts-body-image-is-not-a-scorch/","cat":"image_theory","title":"Thibault Heimburger: Now, I know for sure that the TS body image is not a scorch"},{"id":"comment-18451","author":"anoxie","post":"Yes, I agree with you, that’s why it is an indrect argument. But a very light scorch may not be seen in a back lit photography..","date":"2012-10-28","mins":"9:24 am","url":"https://shroudstory.com/2012/10/21/thibault-heimburger-now-i-know-for-sure-that-the-ts-body-image-is-not-a-scorch/","cat":"image_theory","title":"Thibault Heimburger: Now, I know for sure that the TS body image is not a scorch"},{"id":"comment-18044","author":"anoxie","post":"Thank you Thibault, this is an excellent analysis of scorching at the microscopic level..","date":"2012-10-22","mins":"1:21 pm","url":"https://shroudstory.com/2012/10/21/thibault-heimburger-now-i-know-for-sure-that-the-ts-body-image-is-not-a-scorch/","cat":"image_theory","title":"Thibault Heimburger: Now, I know for sure that the TS body image is not a scorch"},{"id":"comment-54303","author":"anoxie","post":"Let´s say you’re looking to an experiment on a linen with different level of completion of maillard reaction, EDTA applied chronogically. Grey level will refer to degree of reaction completion, not to a heightmap..","date":"2013-12-01","mins":"11:04 am","url":"https://shroudstory.com/2013/11/29/this-may-be-the-biggest-mystery-of-all/","cat":"image_theory","title":"This may be the biggest mystery of all?"},{"id":"comment-54378","author":"anoxie","post":"It was a suggestion to test different parameter. Concerning the shroud different degrees of completion may result from differentinitial concentrations. Maybe in the end after years of slow ongoing reactin, it´s binary, reaction completed or not. But, given the maillard reaction hypothesis, one has to link the half tone effect to reaction completion/ concentration of molecules. Has anyone tried the vp8 on Rogers ‘ experiment with a rope ? Where does his color gradient comes from : concentration ? reaction completion ? Similar half tone effect ?.","date":"2013-12-01","mins":"1:32 pm","url":"https://shroudstory.com/2013/11/29/this-may-be-the-biggest-mystery-of-all/","cat":"image_theory","title":"This may be the biggest mystery of all?"},{"id":"comment-54471","author":"anoxie","post":"I didn’t think of this interpretation. You’re talking of a selection biais of the data. I was talking of how one could interpret the data according to his own subjective hypothesis (eg how STURP team determined cloth body distance).","date":"2013-12-01","mins":"4:28 pm","url":"https://shroudstory.com/2013/11/29/this-may-be-the-biggest-mystery-of-all/","cat":"image_theory","title":"This may be the biggest mystery of all?"},{"id":"comment-54290","author":"anoxie","post":"No..","date":"2013-12-01","mins":"7:26 am","url":"https://shroudstory.com/2013/11/29/this-may-be-the-biggest-mystery-of-all/","cat":"image_theory","title":"This may be the biggest mystery of all?"},{"id":"comment-54120","author":"anoxie","post":"Computer graphics expert : I suggest that the VP 8 Image Analyzer was not used correctly thus leading to a lot of misunderstanding. Obviously, the shroud is not a simple heightmap with a direct, linear relationship between contrast and body cloth clearance. It would be pure fiction to think of such a claim..","date":"2013-11-30","mins":"7:02 am","url":"https://shroudstory.com/2013/11/29/this-may-be-the-biggest-mystery-of-all/","cat":"image_theory","title":"This may be the biggest mystery of all?"},{"id":"comment-54277","author":"anoxie","post":"Correlation is not high, meaning, correlation is not simple, direct, linear. But correlation is irrefutable, for sure..","date":"2013-12-01","mins":"6:17 am","url":"https://shroudstory.com/2013/11/29/this-may-be-the-biggest-mystery-of-all/","cat":"image_theory","title":"This may be the biggest mystery of all?"},{"id":"comment-167278","author":"anoxie","post":"CB “I have thought and written a great deal about the huge temperature response (in relative terms) of Maillard reactions in the region of 50 55 degrees Celsius” Seriously? You’re totally discredited about Maillard reaction for a long, long time, since we had to fight to explain it actually occured below 100°C, you answered: “Not even slightly toasted. The Maillard reaction is simply not THERMODYNAMICALLY FEASIBLE at 100 degrees Celsius, even if other chemical reactions are occuring at multiples of their normal room temperature rate.” We’ve been bored for weeks with your “thermodynamically not feasible Maillard reaction under 100°C”, and now we should read your posts about “the huge temperature response of Maillard reaction around 50°C” and flour particules??? You don’t have to be a rocket scientist to understand he does not know what he is talking about..","date":"2014-10-31","mins":"12:24 pm","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","title":"Those Dark Specks in the Mark Evan’s Photographs"},{"id":"comment-54285","author":"anoxie","post":"Giorgio : Archive from the Guild. The interpretation can only be as good as the interpreter. His subjective and objective knowledge of the area enters a bias which the VP 8 cannot override. Meaning how does the interpreter understand the half tone effect ? Reaction completion ? Autocatalytical reaction ? Blurring of the image due to the molecular weight of diffusing molecule ? This kind of subjective hypothesis ?.","date":"2013-12-01","mins":"6:34 am","url":"https://shroudstory.com/2013/11/29/this-may-be-the-biggest-mystery-of-all/","cat":"image_theory","title":"This may be the biggest mystery of all?"},{"id":"comment-167872","author":"anoxie","post":"“The Maillard reaction is simply not THERMODYNAMICALLY FEASIBLE at 100 degrees Celsius” Ironically, you claimed so, to insult Ray Rogers’ credentials. Result is: you’ve definitely discredited yourself..","date":"2014-11-02","mins":"5:51 am","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","title":"Those Dark Specks in the Mark Evan’s Photographs"},{"id":"comment-167567","author":"anoxie","post":"Context: https://shroudstory.com/2012/08/11/colin berry so how could ray rogers have got it so wrong/ Discredited..","date":"2014-11-01","mins":"5:34 am","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","title":"Those Dark Specks in the Mark Evan’s Photographs"},{"id":"comment-13466","author":"anoxie","post":"Steve : The truth is, the more science is applied to the Shroud, the more difficult it becomes to explain it away. Sorry, but you can’t say that. What STRP team did was a progress, and real science. They rejected easy explanations, but described for the first time the shroud properties in scientific terms. Rogers applied science, and he widened the breach to image formation explanation. Thibauld Heimburger applied science and he may have explained the homogeneous spread of reactive amines on the shroud. “Gaseous diffusion hypothesis”, though misleading as I explained in this post, has never been properly discarded. When STRP did, it was because they ruled out a diffusion of the reactive trough the cloth. But Rogers explained superficiallity of the image, and a backside image has been found on the cloth. Science is a step by step process. A science enigma is “dark matter”, current science is puzzled, but the shroud needs more science. Fick’s laws ? 19th century, which article ruled out diffusion laws, had the shroud covered a body (point 3 of the “challenge”) ?.","date":"2012-07-04","mins":"3:13 pm","url":"https://shroudstory.com/2012/06/29/three-months-today-the-dawkins-challenge/","cat":"image_theory","title":"Three Months Today: The Dawkins Challenge"},{"id":"comment-112839","author":"anoxie","post":"I think the body had been prepared before being wrapped in the shroud, that’s for the “uniform” part. Or you could say, “i do not think it’s real because i can’t see enough blood” or “bloodstains are too uniform top to bottom and front and back”, be systematic..","date":"2014-05-06","mins":"10:59 am","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","title":"To Yannick on Science and Philosophy"},{"id":"comment-117843","author":"anoxie","post":"Ammonia is too light, that’s why he thought of temperature gradient and heavier molecules to explain the resolution. Temperature gradients required are unrealistic, remains heavier molecules, tbd as said Kelly Kearse..","date":"2014-05-12","mins":"11:20 am","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","title":"To Yannick on Science and Philosophy"},{"id":"comment-111996","author":"anoxie","post":"The main problem with Di Lazarro’s experiment is not its “highly unconventional hypothesis” (shroud collapsing into a radiating body – sci fi), but that it doesn’t meet the criteria of the shroud image. Concerning Rogers, critics sum up to the reactant. One should note Rogers thought reactant should come from the skin (SSG mail – no alternative for a diffusion mechanism), something is naive about gases coming from the orifices forming the image (wether it comes from Di Lazarro cf his slide at the Valencia conference – or Rogers). I doubt it could be a post mortem change – hairs don’t decompose – it was slowly produced on the skin and hairs in the tomb. Looking foward to Thibault Heimburger’s candidates..","date":"2014-05-05","mins":"2:28 pm","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","title":"To Yannick on Science and Philosophy"},{"id":"comment-73423","author":"anoxie","post":"Mario Latendresse : […]the lack of side images do not need a complex explanation. It is the consequence of the distance of the cloth to the sides of the body. That is, from the assumption that the imprinted image has recorded the cloth/body distance, and the body is loosely covered by the cloth, the distance of the sides of the body are too far away to be recorded at all on the Shroud. I don’t think either there is a specific “head puzzle”..","date":"2014-01-16","mins":"4:57 am","url":"https://shroudstory.com/2014/01/15/top-of-head-puzzle/","cat":"image_theory","title":"Top of Head Puzzle"},{"id":"comment-73541","author":"anoxie","post":"Yes colin, it is a knwon water stain. Where do you think it comes from ?.","date":"2014-01-17","mins":"11:15 am","url":"https://shroudstory.com/2014/01/15/top-of-head-puzzle/","cat":"image_theory","title":"Top of Head Puzzle"},{"id":"comment-73588","author":"anoxie","post":"Colinsberry … the intense heat in that Chambery fire (accident? arson) melted silver to account for the major burn holes (excluding the earlier L shaped ones). So maybe the melt hole provided a means of introducing cooling water if, say, smoke had been seen billowing out. Maybe not. The folding of the shroud during the Chambéry fire (burn holes) is not consistent with the pattern of the water stains..","date":"2014-01-18","mins":"6:45 am","url":"https://shroudstory.com/2014/01/15/top-of-head-puzzle/","cat":"image_theory","title":"Top of Head Puzzle"},{"id":"comment-13035","author":"anoxie","post":"Concerning pictures : the first one is exact : it’s raw data from VP 8 (it looks like a bas relief) the second one has been treated, 3 D effect is stunning but not accurate. And a comment since it has not been corrected : sciencebod : I take it you are aware of the way the computer was programmed, i.e. To treat light and dark areas on the shroud as being closer to or further from a 3 D object that was emitting some kind of radiation. There is a sense in which the analysis presupposed the conclusion that folk are intended to make re the allegedly “unique” 3 D properties – in other words, putting the effects cart before the causal horse. Obviously, VP 8 was not designed on purpose to study the shroud, but in the 1960’s for topographical purposes..","date":"2012-06-25","mins":"4:39 pm","url":"https://shroudstory.com/2012/01/15/tough-questions-from-sciencebod/","cat":"image_theory","title":"Tough Questions from Sciencebod"},{"id":"comment-88662","author":"anoxie","post":"“I don’t think anyone has explored the scorch theory to the degree Colin now has. Agree with him or not you have to respect the work he’s put into it.” Temperature ? Contact pressure ? Time ?.","date":"2014-03-14","mins":"7:08 am","url":"https://shroudstory.com/2014/03/14/two-comments-promoted-colin-berry-has-cracked-the-shroud-enigma/","cat":"image_theory","title":"Two Comments Promoted:  Colin Berry Has Cracked the Shroud Enigma?"},{"id":"comment-171375","author":"anoxie","post":"” Ray Rogers used 66 degrees C in his modelling of Maillard reactions” It was to quicken the reaction, not because it was thermodynamically not feasible at ambiant temperature. Ray Rogers theory was about a chemical reaction. Your theory was all about heat. There is a lot of material on this blog, in your postings and comments, which prove how opposed you were to my arguments, and now, you’re talking about a “chemical imprint”. I’m glad to hear that, but I can’t see how you can justify such a flip flop, no way, ever. It’s science, not politics..","date":"2014-11-15","mins":"6:50 am","url":"https://shroudstory.com/2014/11/15/weakened-image-fibers/","cat":"image_theory","title":"Weakened image fibers"},{"id":"comment-171360","author":"anoxie","post":"“I was reading Colin Berry’s recent posting which makes an important claim, namely that it is impossible for the image to have been formed without heat.” Do you think Colin Berry is really going down this path? He seems to be reluctant to take a definitive stand any longer for his scorch hypothesis..","date":"2014-11-15","mins":"5:42 am","url":"https://shroudstory.com/2014/11/15/weakened-image-fibers/","cat":"image_theory","title":"Weakened image fibers"},{"id":"comment-170851","author":"anoxie","post":"The FFT recognizes the weave. The filter image i gave you to explain the banding is precisely a filtering of the weave pattern with FFT done by Thierry Castex… I guess you don’t know what you’re talking about..","date":"2014-11-12","mins":"12:49 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-170587","author":"anoxie","post":"This is what isotropy means, a basic, well known property of the Shroud image. I hope we won’t re write the whole data set simply because Charles thinks it’s a painting, boring..","date":"2014-11-11","mins":"5:56 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-170859","author":"anoxie","post":"Https://shroudstory.com/2014/08/27/banding is it real/ The banding filtered by the FFT is the banding of the weave pattern. Four spots on the FFT..","date":"2014-11-12","mins":"1:15 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-170877","author":"anoxie","post":"” but I am familiar with Tierry Castex’s website, which is also fascinating.” Then you should study it again, because he clearly explains where is the weave pattern on the FFT. Now i understand why you did not get at all my explanations about the banding of the weave and honnestly thought your pdf pointed to an original idea….","date":"2014-11-12","mins":"2:16 pm","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-18932","author":"anoxie","post":"If someone wins ten times in a row the national lottery jackpot, is it a miracle ?.","date":"2012-11-09","mins":"6:15 pm","url":"https://shroudstory.com/2012/11/07/you-shroudies-and-your-fallacious-thinking/","cat":"image_theory","title":"You shroudies and your fallacious thinking"},{"id":"comment-23297","author":"anoxie","post":"Paul, the shroud is either a natural artifact or man made, this is the exclusive scientific alternative. Then the mirror question is : is there a possibilty that something was man made that can not be made now or has not been made by any known human in the history of mankind ? Odds are low too. The main argument against gas diffusion is reachable resolution, but one should keep in mind that potential resolution is very good with gas diffusion (see Rogers’ tests), limiting factor is body cloth clearance. A natural phenomenon doesn’t mean simple and easy to reproduce..","date":"2013-02-03","mins":"7:33 am","url":"https://shroudstory.com/2013/01/31/how-could-a-medieval-mind-create-an-image-such-as-the-one-on-the-shroud/","cat":"uncategorized","title":"How could a medieval mind create an image such as the one on the shroud?"},{"id":"comment-1614","author":"anoxie","post":"Ok for this clarification. But Adrie wrote in a comment : ” It seems possible/likely that a sealing coating of retrograded starch (end of this comment) still more or less protects the non image fibers from drying/aging ” Is it a personnal view or a quote ? Anyway, speculations will go on as long as we don’t have definite arguments. Meanwhile studying the microstruture of flax fibers and dislocation bands maybe more productive. Happy new year !.","date":"2013-01-02","mins":"8:16 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/01/more-thoughts-on-the-fragility-of-image-bearing-fibres-on-the-shroud-of-turin/","cat":"anoxie","title":"More thoughts on the fragility of image-bearing fibres on the Shroud of Turin"},{"id":"comment-170356","author":"anoxie","post":"I have to say to preserve balance: read the discussion on banding (https://shroudstory.com/2014/08/29/more about banding on the shroud of turin/) and the prequel of Hugh’s confusing post. But why don’t you write a pdf about thermography Colin?.","date":"2014-11-10","mins":"6:05 am","url":"https://shroudstory.com/2014/11/10/guest-posting-by-o-k-on-the-shroud-as-a-negative/","cat":"uncategorized","title":"Guest Posting by O.K. on the Shroud as a Negative"},{"id":"comment-170405","author":"anoxie","post":"“Parallel to the cloth”… and the cloth flat i guess?.","date":"2014-11-10","mins":"10:11 am","url":"https://shroudstory.com/2014/11/10/guest-posting-by-o-k-on-the-shroud-as-a-negative/","cat":"uncategorized","title":"Guest Posting by O.K. on the Shroud as a Negative"},{"id":"comment-170411","author":"anoxie","post":"I don’t understand what you mean. But thinking the cloth was flat during the image formation is already a gamble..","date":"2014-11-10","mins":"10:30 am","url":"https://shroudstory.com/2014/11/10/guest-posting-by-o-k-on-the-shroud-as-a-negative/","cat":"uncategorized","title":"Guest Posting by O.K. on the Shroud as a Negative"},{"id":"comment-170397","author":"anoxie","post":"What do you mean by “lensing”?.","date":"2014-11-10","mins":"9:20 am","url":"https://shroudstory.com/2014/11/10/guest-posting-by-o-k-on-the-shroud-as-a-negative/","cat":"uncategorized","title":"Guest Posting by O.K. on the Shroud as a Negative"},{"id":"comment-176647","author":"anoxie","post":"“One of the most important arguments against the scorch is related to UV fluorescence. “[…]This demonstration together with the observed absence of body image fluorescence is strong evidence against the cause for the body image being a scorch”. Although we do not know exactly what “lightly scorched linen” means, this demonstration still remains important.” https://shroudofturin.files.wordpress.com/2012/10/scorch paper en.pdf.","date":"2014-12-15","mins":"7:59 am","url":"https://shroudstory.com/2014/12/15/is-fluorescence-still-in-question/","cat":"science","title":"Is Fluorescence Still in Question?"},{"id":"comment-177467","author":"anoxie","post":"This distinction between “a core scorch” and a “superficial surface scorch” is just another fallacy..","date":"2014-12-18","mins":"2:47 am","url":"https://shroudstory.com/2014/12/15/is-fluorescence-still-in-question/","cat":"science","title":"Is Fluorescence Still in Question?"},{"id":"comment-174714","author":"anoxie","post":"This is a storm in a teapot. G. Fanti got a massive coverage after publishing his paper, the article should stand by itself without the reader looking for another interview. As soon as july 5, 2004 Barrie cautiously added: “It is interesting to note that the Turin authorities currently deny the existence of any image on the reverse side of the cloth, in spite of the peer reviewed work done by Giulio and Roberto. I believe that making the high resolution 2002 images available for further study by qualified researchers would be an excellent means of avoiding further controversy on this issue.” And we know how reluctant Turin authorities are to take a stand for a scientific issue….","date":"2014-12-05","mins":"1:32 am","url":"https://shroudstory.com/2014/12/04/paper-chase-the-second-face-defended/","cat":"paper_chase","title":"Paper Chase:  The Second Face Defended"},{"id":"comment-23698","author":"anoxie","post":"1/ Vertical mapping implies borders. 2/ Image density is constent with shortest path. 3/ What is the side of a sphere ? 4/ There are image distorsions. Vertical mapping has not been properly established..","date":"2013-02-07","mins":"12:57 pm","url":"https://shroudstory.com/2013/02/07/topic-of-the-day-7-vertical-mapping-of-a-human-form/","cat":"topic_for_today","title":"Topic of the Day (#7): Vertical Mapping of a Human Form"},{"id":"comment-23704","author":"anoxie","post":"I don’t think the difference between a vertical projection and a diffusion mechanism would be striking at first sight. Differences would be slight. A very good argument for a diffusion mechanism are diffuse borders of the image. If you look at the hands and the fingers, you can’t really see the sides either, but part of the diffuse boder may come from the sides. It is like Rogers’ test with a rope, one can see a kind of “projection” of the rope with diffuse borders, but mechanism was gas diffusion. I really don’t see any serious argument pointing to a vertical projection mechanism in this item. Question is : what was the body cloth configuration ?.","date":"2013-02-07","mins":"3:16 pm","url":"https://shroudstory.com/2013/02/07/topic-of-the-day-7-vertical-mapping-of-a-human-form/","cat":"topic_for_today","title":"Topic of the Day (#7): Vertical Mapping of a Human Form"},{"id":"comment-23718","author":"anoxie","post":"Ok, we agree, the absence of a clear side image may not be explained by the image formation mechanism (which could be isotropic) but the body cloth clearance. Now the absence of “side images” should be explained more clearly. If you take a picture of someone, do you see “side images” ? This is misleading, and the conclusion to a “vertical mapping” is confusing too..","date":"2013-02-07","mins":"6:06 pm","url":"https://shroudstory.com/2013/02/07/topic-of-the-day-7-vertical-mapping-of-a-human-form/","cat":"topic_for_today","title":"Topic of the Day (#7): Vertical Mapping of a Human Form"},{"id":"comment-23721","author":"anoxie","post":"” This implies that there are fewer image forming molecules when the gases arrive at the cloth, with the further distances.” It decreases exponentially with distance, and it’s correlated to the radius of a cylinder. Btw it may explain why resolution is better on fingers vs legs. Mario Latendresse’s article is very interesting and is an independant argument for an isotropic mechanism..","date":"2013-02-07","mins":"6:18 pm","url":"https://shroudstory.com/2013/02/07/topic-of-the-day-7-vertical-mapping-of-a-human-form/","cat":"topic_for_today","title":"Topic of the Day (#7): Vertical Mapping of a Human Form"},{"id":"comment-23850","author":"anoxie","post":"I don’t know how they got this resolution. I don’t think resolution is homogeneous and it may depends on local conditions. But the best resolution around 5 mm doesn’t seem unrealistic, if you consider the distance between two points with a significant different color density it may even be lower..","date":"2013-02-09","mins":"6:04 am","url":"https://shroudstory.com/2013/02/08/topic-of-the-day-8-the-body-image-disappears-at-a-distance/","cat":"topic_for_today","title":"Topic of the Day (#8):  The body image disappears at a distance"},{"id":"comment-23852","author":"anoxie","post":"Why bother ? Because this is the kind of review which convey “established” misconceptions about the shroud..","date":"2013-02-09","mins":"6:27 am","url":"https://shroudstory.com/2013/02/08/topic-of-the-day-8-the-body-image-disappears-at-a-distance/","cat":"topic_for_today","title":"Topic of the Day (#8):  The body image disappears at a distance"},{"id":"comment-146533","author":"anoxie","post":"Help yourself: browse through my comments, https://shroudstory.com/.","date":"2014-08-27","mins":"11:29 am","url":"https://shroudstory.com/2014/08/27/banding-is-it-real/","cat":"image_theory","title":"Banding? Is it Real?"},{"id":"comment-43503","author":"anoxie","post":"Temperature of the skin ? No significant gradient with room temperature, at least to create active convection cells. EDTA is the reactant Rogers used to mimick heavy amines. I don’t think urea produces ammonia significantly at ambient temperature. Glutamine does for example. Ammonia could have played a role during the induction phase “to prepare” the coating of fibers but alone can’t reach high resolution because based on a diffusion model gradient is not steep enough..","date":"2013-09-09","mins":"3:57 pm","url":"https://shroudstory.com/2013/09/01/paper-chase-an-alternate-hypothesis-for-the-image-color/","cat":"image_theory","title":"Paper Chase:  An Alternate Hypothesis for the Image Color"}]
