[{"id":"comment-150229","author":"anoxie","post":"C14, 1988, i think the booster shot is not really necessary..","date":"2014-09-11","mins":"11:12 am","url":"https://shroudstory.com/2014/09/11/a-reason-to-not-do-more-scientific-testing-on-the-shroud/","cat":"science","title":"A Reason to NOT DO More Scientific Testing on the Shroud"},{"id":"comment-150370","author":"anoxie","post":"Multispectral analysis is great, and there would be a lot more interesting tests needed. Bishop Sanchez Sorondo has just said why it is still not the right timing, keeping in mind the blackboard picture. It’s up to scientists to build a team and a thorough protocol, clearing out vain controverses the hard part..","date":"2014-09-12","mins":"1:12 am","url":"https://shroudstory.com/2014/09/11/a-reason-to-not-do-more-scientific-testing-on-the-shroud/","cat":"science","title":"A Reason to NOT DO More Scientific Testing on the Shroud"},{"id":"comment-173578","author":"anoxie","post":"“I could change the color of illumination on that apple and make it look green or blue or something completely different,” he says. “The redness isn’t a property of the apple. It’s a property of the apple in combination with a particular lighting that’s on it and a particular observer looking at it.” Or if you don’t illuminate that apple, it still glows in the infrared….","date":"2014-11-29","mins":"6:03 am","url":"https://shroudstory.com/2014/11/29/a-warning-about-what-we-perceive/","cat":"science","title":"A warning about what we perceive"},{"id":"comment-173635","author":"anoxie","post":"Isaac Newton knew he didn’t need a candle to see what he was doing. He knew what he was doing..","date":"2014-11-29","mins":"2:15 pm","url":"https://shroudstory.com/2014/11/29/a-warning-about-what-we-perceive/","cat":"science","title":"A warning about what we perceive"},{"id":"comment-173760","author":"anoxie","post":"Back to the Shroud, from the beginning, filters have been used to enhance details. It has always been the basis for image analysis, since the beginning of space exploration, and keep in mind Don Lynn was an image analyst at JPL. That’s why physicists and scientists speak of “natural” color, meaning under sunlight. See Mars’ images from Olivier de Coursac or more recently, an image from Europa: http://www.pasadenanow.com/main/mapping the chemistry needed for life at europa.","date":"2014-11-30","mins":"5:38 am","url":"https://shroudstory.com/2014/11/29/a-warning-about-what-we-perceive/","cat":"science","title":"A warning about what we perceive"},{"id":"comment-199176","author":"anoxie","post":"“It is probably nothing more than crappy paraphrasing when we read, “modern science is still incapable.”” A lot of simple things in science turn out to be complicated, see the physics of coffee stains: http://www.npr.org/2011/08/17/139681851/scientists crack the physics of coffee rings The science of what happened on the Shroud is made of a series complex steps. So when you read such claims, keep in mind we had a poor understanding of coffee stains until 2011….","date":"2015-05-15","mins":"7:50 am","url":"https://shroudstory.com/2015/05/15/an-american-jew-in-favor-of-authenticity/","cat":"other_sites","title":"An American Jew in Favor of Authenticity"},{"id":"comment-174585","author":"anoxie","post":"“On the bottom of the Xs, where they cross from yellow to gray, the color of the X appears to change. How could it be measured by an instrument that would prove the assertion?” Andy, the physical attributes of color doesn’t change. The warning points precisely to this distinction between our perception of color (physiologically based center surround organization of the receptive fields in the retina) and the physical attributes of color (wavelength brightness…). Then, what happens when you try to compare distant color? You’re doomed. It turns out our eyes are sensitive to local contrast variations but rather ineffective to compare distant points..","date":"2014-12-04","mins":"4:50 am","url":"https://shroudstory.com/2014/11/29/a-warning-about-what-we-perceive/","cat":"science","title":"A warning about what we perceive"},{"id":"comment-146799","author":"anoxie","post":"“Only few papers accepted for presentation at the workshop exhibit a content within the IEEE field of interest.” No kidding! Has Vernon Cooray cancelled his presentation? Louis: “Piero can clear his doubts about the lightning here and the topic gains importance in view of the paper to be presented by the Sri Lankan scientist Professor Vernon Cooray (Uppsala University, Sweden), author of around 200 scientific papers and a recognised authority, in Bari, Italy.” https://shroudstory.com/2014/07/15/a telling interview with giulio fanti/ I was hoping that “as professor at Uppsala he should not say to much baloney”… for sure he won’t..","date":"2014-08-28","mins":"10:45 am","url":"https://shroudstory.com/2014/08/28/breaking-news-on-the-bari-conference/","cat":"news_&_views","title":"Breaking News on the Bari Conference"},{"id":"comment-146850","author":"anoxie","post":"I couldn’t find him, so i’ve just wondered. Http://dee.poliba.it/ATSI2014/Programma ATSI%20final.pdf.","date":"2014-08-28","mins":"2:37 pm","url":"https://shroudstory.com/2014/08/28/breaking-news-on-the-bari-conference/","cat":"news_&_views","title":"Breaking News on the Bari Conference"},{"id":"comment-50529","author":"anoxie","post":"I’m still confused about what was dated in 1988. What exactly is the radiocarbon sample retained by the University of Arizona and that Jull examined ? What about a minimally scientific testing on this sample ? (Different from the one done by Pr Jull).","date":"2013-11-09","mins":"6:11 am","url":"https://shroudstory.com/2013/11/08/cementing-over-central-park/","cat":"news_&_views","title":"Cementing Over Central Park"},{"id":"comment-58070","author":"anoxie","post":"Fanciness or decorum, who cares. Very perceptive parallel between how we should look at the shroud and a “bruised, hurting and dirty Church”. Don’t be afraid to claim it is not a forgery. At least it is reachable by a serene and deep scientific examination..","date":"2013-12-11","mins":"2:09 pm","url":"https://shroudstory.com/2013/12/11/bruised-hurting-and-dirty/","cat":"news_&_views","title":"Bruised, Hurting and Dirty"},{"id":"comment-50563","author":"anoxie","post":"This is an optical examination, not a physical or chemical test as performed by the LANL..","date":"2013-11-09","mins":"11:43 am","url":"https://shroudstory.com/2013/11/08/cementing-over-central-park/","cat":"news_&_views","title":"Cementing Over Central Park"},{"id":"comment-50558","author":"anoxie","post":"I mean the first round (C 14 dating) should be closed before thinking of the next one. There is a serious suspicion concerning the sampling. Though, for 25 years, no physical or chemical analysis has been done on the radiocarbon sample retained by the University of Arizona ?.","date":"2013-11-09","mins":"11:27 am","url":"https://shroudstory.com/2013/11/08/cementing-over-central-park/","cat":"news_&_views","title":"Cementing Over Central Park"},{"id":"comment-50564","author":"anoxie","post":"Labs do not seek closure, actually..","date":"2013-11-09","mins":"11:46 am","url":"https://shroudstory.com/2013/11/08/cementing-over-central-park/","cat":"news_&_views","title":"Cementing Over Central Park"},{"id":"comment-50568","author":"anoxie","post":"; ) More Seriously, scientifically, there is no failure, just positive or negative results. I don ´t know the real content of this sample, no one does, but i think it deserves a proper examination..","date":"2013-11-09","mins":"12:53 pm","url":"https://shroudstory.com/2013/11/08/cementing-over-central-park/","cat":"news_&_views","title":"Cementing Over Central Park"},{"id":"comment-192115","author":"anoxie","post":"“…the Archbishop Emeritus of Turin, Giovanni Saldarini requested all unauthorized threads to be returned to Turin and any testing would be disowned on all unreturned threads (Biema, Dorfman, Burke, & Penner, 1998).” Rogers had to publish his observations, where? I don’t care. Future testings will settle the issue, officially..","date":"2015-03-01","mins":"2:29 pm","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"id":"comment-26503","author":"anoxie","post":"Another quote from Micheal Shermer, from the same source : ” We can demarcate science from pseudoscience less by what science is and more by what scientists do. Science is a set of methods aimed at testing hypotheses and building theories.” And from Ray Rogers defining the scientific method : ” Science is not “things.” It is a way of thinking. Classical Scientific Method is simply a method for objectively applying logic to the solution of problems. 1) The problem must be stated in clear terms, and obscure words must be defined clearly. The goal sought must also be stated clearly. 2) Everything known about the problem must be studied, and all references must be acknowledged. There must be no “hidden facts,” and it is not clever to “blind side” the opposition. Carefully planned observations should be made. Different methods of observation should be made when possible, and results must be checked for internal consistency and agreement with reported results. All observations must be taken seriously, until some justifiable and clearly stated reason can be found to eliminate any. 3) A “brainstorming” session, preferably with other workers familiar with the problem, should try to develop as many potential explanations (hypotheses) as possible (Method of Multiple Working Hypotheses), All hypotheses must be clearly stated. And 4), all of the hypotheses must be tested equally against the same, complete list of observations and facts. Testing may often involve making predictions on the basis of the hypotheses and testing the predictions by experiment. The Principle of Parsimony (Occam’s Razor) states that the hypothesis that includes the largest number of facts and observations will be closest to the truth. Hypotheses that do not accept many facts without “special pleading” should be discarded.” This is science. What it is not, call it pseudoscience, bad science, no science, naïve observation, or whatever, it is not science. And we should keep in mind that concerning the shroud most data published by the STURP result from basic scientific observations..","date":"2013-03-05","mins":"8:57 am","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","title":"Defining Pseudoscience:  It Takes a Rocket Surgeon"},{"id":"comment-12578","author":"anoxie","post":"1/ steep gradient, ok, remains to be quantified. Why vertical ? 2/ is it consistent with the symetrical properties of frontal and dorsal image ? 3/ intensity results from the number of threads carrying the image, (a blank thread can be surrounded by colored threads even in the highest intensity zones) why a gas would not interact homogenously with the threads ?.","date":"2012-06-16","mins":"4:06 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","title":"Gas Diffusion and the Banding Effect"},{"id":"comment-18978","author":"anoxie","post":"Yannick Clément : This is another very good example of the “I think I see” syndrome versus the Shroud. Right..","date":"2012-11-11","mins":"6:55 pm","url":"https://shroudstory.com/2012/11/03/face-of-the-man-of-the-shroud-of-turin-encoded-in-sistine-chapel/","cat":"news_&_views","title":"Face of the Man of the Shroud of Turin Encoded in Sistine Chapel?"},{"id":"comment-12598","author":"anoxie","post":"Which gases emitted from the body are lighter than air ? Laminar regime applies to fluid dynamics. Can the molecules emitted from the body be modelled by a fluid (i.e. So dense to be a continuum) ?.","date":"2012-06-16","mins":"9:14 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","title":"Gas Diffusion and the Banding Effect"},{"id":"comment-12631","author":"anoxie","post":"“vaporograph hypothesis” : – macroscopic gas flows convey amines : there must be a gradient of temperature between body and air, amines must have been released and reacted before the end of convection flows. – thermally driven convection flows are modelled according temperature gradient around the body and boundaries conditions (shroud – skin). – convection cells size have to be inferior to image resolution. First point is to describe the temperature field around the body, and I can’t see why this gradient should be vertical. Cold air is ambient air surrounding the body and the shroud. Temperature field should be complex and boundaries roughtly orthogonal to skin and shroud..","date":"2012-06-17","mins":"7:16 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","title":"Gas Diffusion and the Banding Effect"},{"id":"comment-177316","author":"anoxie","post":"“Had the meeting been of a crowd of UFO enthusiasts planning to submit a proposal to the US Air Force about Roswell it could not have appeared woollier.” At least you understand why the Shroud has been not been subjected to further testing….","date":"2014-12-17","mins":"2:48 pm","url":"https://shroudstory.com/2014/12/16/future-testing-of-the-shroud/","cat":"science","title":"Future Testing of the Shroud"},{"id":"comment-12603","author":"anoxie","post":"1/ I hardly see a gas emitted from the body lighter than air. 2/ I thought laminar regime concerns air, few amines released guided by air laminar flow, question is air flow modelling between body and shroud.","date":"2012-06-16","mins":"10:34 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","title":"Gas Diffusion and the Banding Effect"},{"id":"comment-12676","author":"anoxie","post":"Yannick Clément : I really think the explanation for this fact can well be found first in the ancient bleaching process that would have leave a non homogeneous amount of impurities on the fibers and also (and maybe more) in the evaporation concentration process that was going on at the end of the fabrication of the cloth. Ok, but it’s binary. One thread is colored the next one not, all lenght long, that’s not a simple non homogeneous bleaching. Yannick Clément : We can easily see that what was reported here by Anoxie is not true at all. I said he didn’t explain the high resolution, not that gas diffusion could not explain high resolution. That said : Yannick Clément : Diffusion DOES NOT MEAN the same thing as “diffuse”. The mean free path of a molecule will determine his its diffusion properties. The mean free path is the distance the molecule will go between collisions with other molecules. Such calculations show that molecules can not go very far unimpeded at NORMAL temperatures and pressures. The potential for IMAGE RESOLUTION IS QUITE GOOD. E.g. NH3 diffusion speed : 645 m/s at 25 °C, even a molecule 10000 th times heavier would go 6.5 m/s. And diffusion is isotropic. But maybe did Rogers write few equation to describe his idea. So far I can’t see how Graham’s Law is consistent with high resolution..","date":"2012-06-18","mins":"12:32 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","title":"Gas Diffusion and the Banding Effect"},{"id":"comment-12483","author":"anoxie","post":"I thought Roger himself said it explained most of the chemical properties, but not the high resolution of the image. That’s the problem : chemical reaction – high resolution – no contact.","date":"2012-06-14","mins":"4:07 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","title":"Gas Diffusion and the Banding Effect"},{"id":"comment-12709","author":"anoxie","post":"Erratum : I gave molecule speed not gas diffusion speed. Actually there can be a steep gradient as Rogers said..","date":"2012-06-19","mins":"10:55 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","title":"Gas Diffusion and the Banding Effect"},{"id":"comment-12751","author":"anoxie","post":"Yannick Clément : Whether Rogers is correct or not about heavy amines gas (personally, I think it’s very probable that there was at least some ammoniac gas coming out of the nose and mouth from the lungs), we must understand that the parallel (or complementary) hypothesis proposed by Thibault Heimburger in one of his paper could also have taken some part in the image formation process of the body and of the hair. Can you give the reference/link of Thibault Heimburger’s paper on this issue ? Thank you. Colinsberry : But in the final analysis, towards the end of his life, Rogers disappointed with some highly tendentious views on image imprinting mechanism and on carbon dating – ones that just happened to play into the hands of the authenticists… Do you mean Rogers was an authenticist ?.","date":"2012-06-20","mins":"4:02 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","title":"Gas Diffusion and the Banding Effect"},{"id":"comment-12870","author":"anoxie","post":"That would be great ! In the meantime, could you summerize his conclusions or major contributions to Rogers hypothesis (gases, resolution, 3 D properties, distortion) ? Thank you,.","date":"2012-06-21","mins":"3:33 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","title":"Gas Diffusion and the Banding Effect"},{"id":"comment-13031","author":"anoxie","post":"His work (not in my mind yet a fully formed hypothesis) has since been improperly and unfairly characterized as merely a diffusion hypothesis (e.g. Totally and inappropriately misrepresented in Giulio Fanti’s most recent paper, “Hypotheses Regarding the Formation of the Body Image on the Turin Shroud. A Critical Compendium,” in The Journal of Imaging Science and Technology, (Vol. 55, No. 6 060507 1 060507 14, 2011)) Is the article freely available ?.","date":"2012-06-25","mins":"2:21 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","title":"Gas Diffusion and the Banding Effect"},{"id":"comment-13032","author":"anoxie","post":"I found the article on the net : “Hypotheses Regarding the Formation of the Body Image on the Turin Shroud. A Critical Compendium” G. Fanti. The paper didn’t explore properly Rogers’ hypothesis..","date":"2012-06-25","mins":"4:11 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","title":"Gas Diffusion and the Banding Effect"},{"id":"comment-12953","author":"anoxie","post":"Thank you for these explanations. Ok for considering an extraordinary situation but based on a natural process. As said by Thibault, heavy amines gases may be ruled out. May ammonia diffusion play a central role in image formation ? that was the second part of Thibault’s work. I’ll try to have a serious look on this hypothesis. By the way, wasn’t the body washed before being placed in the shroud ?.","date":"2012-06-23","mins":"7:30 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","title":"Gas Diffusion and the Banding Effect"},{"id":"comment-13010","author":"anoxie","post":"I’ve just read Rogers’ 2003 article dealing with Maillard reaction. Actually, Rogers already said gas diffusion is just one (minor ?) parameter of image formation. Rogers : Postmortem body temperatures can reach 41ºC (Irvine, 2001), and steep temperature gradients would exist across the cloth as a result of the low thermal diffusivity of linen and the angular dependence of radiant heat flow from a nonmetallic surface (Gubareff et al, 1960). The temperature gradients will have a large effect on Maillard reaction rates. Temperature gradients may be a major parameter..","date":"2012-06-25","mins":"10:12 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","title":"Gas Diffusion and the Banding Effect"},{"id":"comment-13025","author":"anoxie","post":"Max Patrick Hamon : The Man of the Shroud was INDIRECTLY washed. For collimation, an anaerobic (oxygene free) environement (body/cloth) is most needed… Any slight air gap will cause no or next to no ID image as we can see on the Shroud…. How would the environement be oxygen or air free ?.","date":"2012-06-25","mins":"12:32 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","title":"Gas Diffusion and the Banding Effect"},{"id":"comment-13042","author":"anoxie","post":"Ok, still, how do you explain an oxygen free space between cloth and body ?.","date":"2012-06-26","mins":"1:08 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","title":"Gas Diffusion and the Banding Effect"},{"id":"comment-172688","author":"anoxie","post":"“possibly ones that are entirely chemical at room temperature, though less probable” source please. Https://shroudofturin.files.wordpress.com/2012/08/rogers maillard reaction for dan blog 2.pdf.","date":"2014-11-23","mins":"10:39 am","url":"https://shroudstory.com/2014/11/23/how-to-become-famous/","cat":"wikipedia_content","title":"How to Become Famous"},{"id":"comment-172693","author":"anoxie","post":"Now, why a “simulated sweat imprint” hypothesis and no longer “scorch” hypothesis? Strange. Because contrary to what is written (by CB himself?), “B. Still considers the TS to be a contact scorch”, he seems no longer decided to take a definitive stand for his scorch hypothesis. That’s why i’ve tried to clarify Rogers’ hypothesis, more than two years ago, precisely to prevent his hypothesis from being spoiled by such claims. CB, your scorch hypothesis is a complete failure, leave Rogers in peace..","date":"2014-11-23","mins":"11:23 am","url":"https://shroudstory.com/2014/11/23/how-to-become-famous/","cat":"wikipedia_content","title":"How to Become Famous"},{"id":"comment-163192","author":"anoxie","post":"Let’s focus on this lost comment by Haqodeshim, and think of what it illustrates. “…VP 8 image analyser […] a computer built for our planetary exploration…” This is from Russ Breault in the video inserted in the comment. NASA is a magic word for public outreach. Mix up NASA with the Shroud of Turin and you get a fantasy factory. Https://shroudstory.com/2014/03/30/nasa had nothing to do with it/.","date":"2014-10-17","mins":"3:21 pm","url":"https://shroudstory.com/2014/10/17/i-call-them-shrolls/","cat":"news_&_views","title":"I Call Them Shrolls"},{"id":"comment-15058","author":"anoxie","post":"“I think I see” pure speculation..","date":"2012-08-16","mins":"8:27 am","url":"https://shroudstory.com/2012/08/16/i-think-i-see-another-different-nail-on-the-shroud-of-turin/","cat":"news_&_views","title":"I think I see another, different nail on the Shroud of Turin"},{"id":"comment-15108","author":"anoxie","post":"Yes, I think it is an artifact. It is hard to discriminate the image from the background noise. And it is not perfectly known how and where the shroud took the image. Read last Dan’s post, it is informative on this issue..","date":"2012-08-17","mins":"7:35 am","url":"https://shroudstory.com/2012/08/16/i-think-i-see-another-different-nail-on-the-shroud-of-turin/","cat":"news_&_views","title":"I think I see another, different nail on the Shroud of Turin"},{"id":"comment-15101","author":"anoxie","post":"Les Fredette : I am speculating, in the true sense of the word, that the nail on the Shroud may very well be one of the nails found in the Caiaphas tomb. I meant there is no nail image on the Shroud..","date":"2012-08-17","mins":"2:43 am","url":"https://shroudstory.com/2012/08/16/i-think-i-see-another-different-nail-on-the-shroud-of-turin/","cat":"news_&_views","title":"I think I see another, different nail on the Shroud of Turin"},{"id":"comment-126311","author":"anoxie","post":"Be stupid, be stubborn : C14 = raw data..","date":"2014-06-02","mins":"2:01 pm","url":"https://shroudstory.com/2014/06/02/intellectual-inferiority-of-christians/","cat":"news_&_views","title":"Intellectual Inferiority of Christians?"},{"id":"comment-126323","author":"anoxie","post":"… and never released..","date":"2014-06-02","mins":"3:27 pm","url":"https://shroudstory.com/2014/06/02/intellectual-inferiority-of-christians/","cat":"news_&_views","title":"Intellectual Inferiority of Christians?"},{"id":"comment-923","author":"anoxie","post":"Done in 2010, stunning to see no spike in august 2008, when 1988 C14 datation has been scientifically proven to be flawed. I bet you’d have seen a huge spike if google trends existed in 1988… Worse, one can see spikes when ppl anounce reproducing the shroud. Question is : Is the world press biased ?.","date":"2010-01-08","mins":"10:19 am","url":"https://shroudstory.com/2008/09/04/interest-in-the-shroud-of-turin-linked-to-news/","cat":"news_&_views","title":"Interest in the Shroud of Turin Linked to News"},{"id":"comment-172975","author":"anoxie","post":"” Therefore it was concluded that no applied dyes, stains, or pigments, were present and the image chromophore was a conjugated carbonyl produced in the cellulose structure itself by a dehydrative oxidation process (5,24).” https://www.shroud.com/pdfs/adler.pdf The atmosphere is now mostly made of Argon..","date":"2014-11-25","mins":"2:11 pm","url":"https://shroudstory.com/2014/11/25/is-the-image-disappearing/","cat":"how_do_we_know","title":"Is the image disappearing?"},{"id":"comment-151961","author":"anoxie","post":"It was already the talk of the 2008 Ohio conference, lines are shifting, slowly. That said, patch is misleading, reweaving seems more specific..","date":"2014-09-17","mins":"12:38 pm","url":"https://shroudstory.com/2014/09/17/lets-agree-to-agree/","cat":"news_&_views","title":"Let’s Agree to Agree?"},{"id":"comment-153133","author":"anoxie","post":"You know the problem of the C14 dating is more basic and has much to do with bad sampling and arrogance. You know the problem of Colin has much to do with promoting scorching on a bogus basis and arrogance. The Vatican supports science, evolution, astronomy and whatever makes sense..","date":"2014-09-21","mins":"7:19 am","url":"https://shroudstory.com/2014/09/21/lest-the-wrath-of-god-descend-upon-them-like-a-ton-of-bricks/","cat":"humor","title":"Lest the wrath of God descend upon them like a ton of bricks"},{"id":"comment-201685","author":"anoxie","post":"“The cloth is subjected to programmed emissions of nitrogen, which are also aimed at preservation.” I didn’t know about nitrogen. You could find the composition of the reliquary here : http://www.enea.it/it/produzione scientifica/EAI/anno 2012/knowledge diagnostics and preservation of cultural heritage/the conservation of the shroud of turin optical studies Ar 99.5% ; O2 0.5% ; RH~50% Has it changed?.","date":"2015-06-12","mins":"4:00 am","url":"https://shroudstory.com/2015/06/12/lights-cameras-action-and-the-drones-of-turin/","cat":"2015","title":"Lights, Cameras, Action and the Drones of Turin"},{"id":"comment-57728","author":"anoxie","post":"I think they just can’t imagine how complex/unlikely/not realistic it would be to get an image on a shroud such as the one we can see according to the middle ages knowledge. Though it would still be an interesting challenge if they could produce anything close to any image on a shroud thanks to any camera obscura / optical system. No wonder, they did not..","date":"2013-12-10","mins":"4:12 pm","url":"https://shroudstory.com/2013/12/10/maybe-vermeer-made-the-shroud-of-turin/","cat":"humor","title":"Maybe Vermeer Made the Shroud of Turin"},{"id":"comment-147155","author":"anoxie","post":"“Illusion” ? Hugh, if you leech, at least do it intelligently..","date":"2014-08-29","mins":"3:08 pm","url":"https://shroudstory.com/2014/08/29/more-about-banding-on-the-shroud-of-turin/","cat":"news_&_views","title":"More about banding on the Shroud of Turin"},{"id":"comment-147259","author":"anoxie","post":"To discuss the paper, this may be helpful too: https://shroudstory.com/2014/08/27/banding is it real/ It is not an illusion, it is real. But i already knew Hugh was an illusionist, it all started with cotton fibers..","date":"2014-08-30","mins":"2:06 am","url":"https://shroudstory.com/2014/08/29/more-about-banding-on-the-shroud-of-turin/","cat":"news_&_views","title":"More about banding on the Shroud of Turin"},{"id":"comment-147478","author":"anoxie","post":"“1 it’s a sharp, clear cut edge 2 the dark band on the face starts on a spike 3 the zig zag pattern has an independent role on image perception (image – différence) Synchronisation ? Let’s have a break on banding and the “no sharp edge” claim of CB.” Third time. And i can’t resume the whole thread. I’ve largely mentionned these three point based on this image to explain why banding is real and not an illusion. I’ve suggested to Dan to insert at least this image in the post where he has promoted “a new paradigm”. Https://shroudstory.com/2014/08/29/a new paradigm for banding/ This is a farce..","date":"2014-08-31","mins":"2:07 am","url":"https://shroudstory.com/2014/08/29/more-about-banding-on-the-shroud-of-turin/","cat":"news_&_views","title":"More about banding on the Shroud of Turin"},{"id":"comment-147164","author":"anoxie","post":"Another problem of translation?.","date":"2014-08-29","mins":"4:10 pm","url":"https://shroudstory.com/2014/08/29/more-about-banding-on-the-shroud-of-turin/","cat":"news_&_views","title":"More about banding on the Shroud of Turin"},{"id":"comment-147375","author":"anoxie","post":"Just tell me, this is a joke or you haven’t read the post: banding? Is it real?.","date":"2014-08-30","mins":"3:10 pm","url":"https://shroudstory.com/2014/08/29/more-about-banding-on-the-shroud-of-turin/","cat":"news_&_views","title":"More about banding on the Shroud of Turin"},{"id":"comment-25399","author":"anoxie","post":"This looks bad… at least they don’t bother with C14 dating, and women, you could see Jesse Bradford “single but dating”..","date":"2013-02-23","mins":"9:09 am","url":"https://shroudstory.com/2013/02/23/more-on-the-power-of-few-movie/","cat":"news_&_views","title":"More on The Power of Few Movie"},{"id":"comment-45707","author":"anoxie","post":"The best work to question the validity of the c14 dating was presented in 2008 and concerns the heterogeneity of the samples. What is needed is an official sample to confirm this work and debate is closed..","date":"2013-09-28","mins":"5:48 am","url":"https://shroudstory.com/2013/09/28/national-geographics-100-greatest-mysteries-revealed/","cat":"news_&_views","title":"National Geographic’s 100 Greatest Mysteries Revealed"},{"id":"comment-52240","author":"anoxie","post":"What is the temperature of your “hot” template ? Could you quantify the pressure ?.","date":"2013-11-21","mins":"4:12 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","title":"Must See:  The Informative Mark Evans Photomicrographs"},{"id":"comment-148293","author":"anoxie","post":"Mar 1, 2010? New?.","date":"2014-09-03","mins":"11:19 am","url":"https://shroudstory.com/2014/09/03/new-permanent-shroud-of-turin-exhibit/","cat":"news_&_views","title":"New Permanent Shroud of Turin Exhibit"},{"id":"comment-74421","author":"anoxie","post":"It would be a nice editor touch for a sci fi magazine..","date":"2014-01-24","mins":"2:23 pm","url":"https://shroudstory.com/2014/01/24/nice-editor-touch/","cat":"news_&_views","title":"Nice Editor Touch"},{"id":"comment-166442","author":"anoxie","post":"Don’t you know why he thought the C14 corner had been manipulated?.","date":"2014-10-29","mins":"1:42 am","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","title":"Quote for Today on Carbon Dating of the Shroud"},{"id":"comment-214638","author":"anoxie","post":"Fluctuat nec mergitur..","date":"2015-11-15","mins":"1:34 pm","url":"https://shroudstory.com/2015/11/14/paris/","cat":"news_&_views","title":"Paris"},{"id":"comment-36510","author":"anoxie","post":"Fingers, no bones. Gas diffusion diffuse border / contact points highest contrast (“bones”). Gas diffusion consistent with small radius – high resolution/gradient (finger) large radius – low resolution/gradient (legs)..","date":"2013-06-09","mins":"5:41 am","url":"https://shroudstory.com/2013/06/05/r-i-p-ben-wiech/","cat":"news_&_views","title":"R.I.P. Ben Wiech"},{"id":"comment-36875","author":"anoxie","post":"How long ?.","date":"2013-06-13","mins":"1:58 pm","url":"https://shroudstory.com/2013/06/05/r-i-p-ben-wiech/","cat":"news_&_views","title":"R.I.P. Ben Wiech"},{"id":"comment-9262","author":"anoxie","post":"It seems Colin B, who claimed to be skeptical, advocates a conspiracy theory..","date":"2012-03-12","mins":"3:01 pm","url":"https://shroudstory.com/2012/03/12/regrettably/","cat":"news_&_views","title":"Regrettably"},{"id":"comment-20420","author":"anoxie","post":"I’d rather say a shadow of doubt about the shroud. And Science helps seeing the shroud as the actual burial of Christ, whereas the Church would ask faith to fill the gap..","date":"2012-12-14","mins":"7:14 am","url":"https://shroudstory.com/2012/12/12/reading-the-shroud-backwards/","cat":"news_&_views","title":"Reading the Shroud Backwards"},{"id":"comment-212274","author":"anoxie","post":"Marion, and Castex, and Frale (collaborating with Castex). Http://thierrycastex.blogspot.fr/2012/04/filtrage dans le domaine de fourier.html Orozco is not looking for letters, yet..","date":"2015-10-11","mins":"4:25 am","url":"https://shroudstory.com/2015/10/11/removing-weave-pattern-from-images-of-the-shroud-of-turin/","cat":"other_sites","title":"Removing Weave Pattern from Images of the Shroud of Turin"},{"id":"comment-146064","author":"anoxie","post":"It rather looks like pet theory pushing, science will have to wait..","date":"2014-08-25","mins":"12:14 pm","url":"https://shroudstory.com/2014/08/25/resting-on-our-laurels/","cat":"news_&_views","title":"Resting on Our Laurels"},{"id":"comment-146077","author":"anoxie","post":"It was rethoretical, the TS is not a scorch. But i’m still puzzled by Thibault’s answers, not mentionning the crystal strutcture of flax fibers or characteristics of high temperature rapid heating to discard scorching..","date":"2014-08-25","mins":"1:30 pm","url":"https://shroudstory.com/2014/08/25/resting-on-our-laurels/","cat":"news_&_views","title":"Resting on Our Laurels"},{"id":"comment-142619","author":"anoxie","post":"No. I don’t consider either an eathquake as a “natural process”..","date":"2014-08-06","mins":"1:01 pm","url":"https://shroudstory.com/2014/08/06/scientific-conference-on-the-shroud-of-turin/","cat":"news_&_views","title":"Scientific Conference on the Shroud of Turin"},{"id":"comment-142713","author":"anoxie","post":"I meant no volcanoes or earthquakes are involved in the image formation process..","date":"2014-08-07","mins":"1:06 am","url":"https://shroudstory.com/2014/08/06/scientific-conference-on-the-shroud-of-turin/","cat":"news_&_views","title":"Scientific Conference on the Shroud of Turin"},{"id":"comment-142800","author":"anoxie","post":"You’re thinking of this paper or have other arguments ? http://link.springer.com/article/10.1007/s11012 013 9865 x?no access=true.","date":"2014-08-07","mins":"11:41 am","url":"https://shroudstory.com/2014/08/06/scientific-conference-on-the-shroud-of-turin/","cat":"news_&_views","title":"Scientific Conference on the Shroud of Turin"},{"id":"comment-165245","author":"anoxie","post":"The Shroud or extraterrestrial life?.","date":"2014-10-24","mins":"3:23 pm","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","title":"Scientific truth is a pathway to God"},{"id":"comment-142598","author":"anoxie","post":"So far, some elements let say that the image was produced through a natural process that involved the body of a human being..","date":"2014-08-06","mins":"10:36 am","url":"https://shroudstory.com/2014/08/06/scientific-conference-on-the-shroud-of-turin/","cat":"news_&_views","title":"Scientific Conference on the Shroud of Turin"},{"id":"comment-165250","author":"anoxie","post":"It was a joke..","date":"2014-10-24","mins":"3:38 pm","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","title":"Scientific truth is a pathway to God"},{"id":"comment-165240","author":"anoxie","post":"Piero, you should note Br. Guy Consolmagno has two degrees in planetary science. In the past decade, planetary science has exploded, and the question of life with it, as a jesuit, it’s almost part of his job. I think “…the religious people seem to think they are more flexible than outsiders believe that religion would be…”. “Theology is not, a set of beliefs written in stone that people subscribe to, but it’s a way that people make sense of their experience… in one sense dealing with the discovery of extraterrestrial life for a believer is the same thing as dealing with say the tragic experience of a death of a loved one…” Robin Lovin, in an interesting discussion: http://www.loc.gov/today/cyberlc/feature wdesc.php?rec=6330 Back to the Shroud, i think the Vatican is more flexible than outsiders believe, what is needed are good outsiders..","date":"2014-10-24","mins":"3:03 pm","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","title":"Scientific truth is a pathway to God"},{"id":"comment-172809","author":"anoxie","post":"Can’t you see the difference between: A CB, shroud researcher… blabla… claims the Shroud is a scorch imprint. B CB, blabla… has a gut feeling, the Shroud is a fake, and MAY, PROBABLY, be a scorch imprint imitatig a sweat imprint. He no longer takes a stand for anything. Even writting rubbish, the minimum required is being consistent with yourself..","date":"2014-11-24","mins":"10:06 am","url":"https://shroudstory.com/2014/11/24/social-encyclopedia-ing-the-shroud-of-turin-and-channel-5/","cat":"wikipedia_content","title":"Social Encyclopedia-ing, the Shroud of Turin and Channel 5"},{"id":"comment-172826","author":"anoxie","post":"“His hypothesis that the Shroud is indeed a kind of scorch” …”kind of”… Sorry, but after more than 30 months, he doesn’t even seem confident that the image is a scorch any longer. He is moonwalking, retrograding his bogus, classical “scorch” hypothesis (the one initially quoted in wikipedia) to a “simulated sweat imprint” hypothesis, murkier than ever. Hugh, you’re an illusionist, as ever, saying black is white, or a “kind of” white..","date":"2014-11-24","mins":"1:42 pm","url":"https://shroudstory.com/2014/11/24/social-encyclopedia-ing-the-shroud-of-turin-and-channel-5/","cat":"wikipedia_content","title":"Social Encyclopedia-ing, the Shroud of Turin and Channel 5"},{"id":"comment-172853","author":"anoxie","post":"This is just another version to save his face after giving up his classical “scorch” theory. 30 months to conclude to the obvious, put it the way you want, i’m done with his mumbo jumbo. He has written to the Vatican, the Royal Society and now even wikipedia is bored with his propaganda… Thibault has already pointed the pb, Colin has never written a single pdf you can simply answer too, that’s why he has focused on his classical “scorch” hypothesis. Now, waiting for pdf n°3, and game over..","date":"2014-11-24","mins":"5:04 pm","url":"https://shroudstory.com/2014/11/24/social-encyclopedia-ing-the-shroud-of-turin-and-channel-5/","cat":"wikipedia_content","title":"Social Encyclopedia-ing, the Shroud of Turin and Channel 5"},{"id":"comment-14630","author":"anoxie","post":"I’ve just read García Macedo’s article on corona discharge. There is no corona discharge between the silver figure (modelling a human body) and the linen (oiled with baby care almond oil and bleached with sodium hypochlorite). There is a corona discharge between the needles and the linen but then “the current is conducted to earth through the points in which the metallic figure makes contact with the plane” [through the linen] What I can see on figure 6a and c looks like scorches created by an intense current, and actually it seems to be : “When the corona discharge is present on the linen, the image begins to be formed by this SCP [slow combustion process]”. I don’t understand why Colin Berry is ironical with this special issue, “a variable transformer connected to the line (120 V, 60 Hz) that feed a home made DC voltage supply” is a way as another to create scorch marks..","date":"2012-08-08","mins":"4:55 pm","url":"https://shroudstory.com/2012/08/04/special-shroud-of-turin-issue-of-scientific-research-and-essays-journal/","cat":"news_&_views","title":"Special Shroud of Turin Issue of Scientific Research and Essays Journal"},{"id":"comment-19686","author":"anoxie","post":"“No one in this age has figured out if there is but one universe” In this example, there is a “multi universe” theory fitting current data, but not enough observationnal/experimental data to confirm it. Concerning the shroud, a theory is needed to explain the data we have..","date":"2012-11-30","mins":"1:53 pm","url":"https://shroudstory.com/2012/11/30/strong-ignorance-is-not-strong-evidence/","cat":"news_&_views","title":"Strong ignorance is not strong evidence"},{"id":"comment-55500","author":"anoxie","post":"Way up on the bias scale : Shroud’s page in French wikipedia. But don’t worry, anyone really interested in the Shroud could find this blog on google..","date":"2013-12-03","mins":"4:14 am","url":"https://shroudstory.com/2013/12/02/the-anti-shroudrelicscatholicchristian-propaganda-on-wikipediaguest-posting-by-o-k/","cat":"news_&_views","title":"The anti-Shroud/Relics/Catholic/Christian propaganda on Wikipedia–Guest Posting by O. K."},{"id":"comment-174636","author":"anoxie","post":"It is a distressing to read such a comment knowing the large amount of material given by Kelly Kearse to patiently explain the blood issue… Charles, give us a break, do your homework..","date":"2014-12-04","mins":"12:21 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173407","author":"anoxie","post":"Colin is taking any data about the Shroud, relabel it with his forgery narrative, and writes a new post. You’re still looking for anything making sense?.","date":"2014-11-28","mins":"2:40 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-174717","author":"anoxie","post":"“You have a rather narrow definition of science.” This is the hallmark of all crude skeptics..","date":"2014-12-05","mins":"1:40 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-202742","author":"anoxie","post":"Amazing pictures from the Nav Cam camera on Rosetta BUT there is a lunatic video about the “Electric Universe” and C 67 P at the end of the post….","date":"2015-06-19","mins":"2:04 am","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","title":"The Masters of Comedy in Piedmont"},{"id":"comment-202739","author":"anoxie","post":"“Would it make any difference if we sent the Shroud into a 308 million km orbit?” No, what would make the difference is a dedicated team of scientists and engineers..","date":"2015-06-19","mins":"1:44 am","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","title":"The Masters of Comedy in Piedmont"},{"id":"comment-73318","author":"anoxie","post":"Actually, the two recommendations quoted from the commission are 1/ the removal of the holland cloth and the patches and 2/ the change for an argon atmosphere. Concerning the pollution of the holland cloth i don’t see what he means, is it a pollution from [inert] “carbonized cellulose” from the original cloth ?!? At least it is the feeling I have listening to his presentation, and since the holland cloth was directly stitched to the back of the shroud, i can’t see what other pollution he would refer to..","date":"2014-01-14","mins":"1:31 pm","url":"https://shroudstory.com/2014/01/14/the-questionable-restoration-of-the-shroud-of-turin/","cat":"news_&_views","title":"The Questionable Restoration of the Shroud of Turin"},{"id":"comment-73425","author":"anoxie","post":"Louis : If the Shroud is in good condition today it is because of the restoration work. This is questionable. But what’s done is done..","date":"2014-01-16","mins":"5:07 am","url":"https://shroudstory.com/2014/01/14/the-questionable-restoration-of-the-shroud-of-turin/","cat":"news_&_views","title":"The Questionable Restoration of the Shroud of Turin"},{"id":"comment-73338","author":"anoxie","post":"Wait a minute, the commission recommended to remove the patches but they didn’t think of the charred material still surrounding the burn holes ? They’ve waited for Dr Flury Lemberg to discover this “bomb” or “pollution” ? They didn’t think of the scientific value of these areas ? This is a farce..","date":"2014-01-14","mins":"5:25 pm","url":"https://shroudstory.com/2014/01/14/the-questionable-restoration-of-the-shroud-of-turin/","cat":"news_&_views","title":"The Questionable Restoration of the Shroud of Turin"},{"id":"comment-140862","author":"anoxie","post":"This page is a mess: image analysis : “Shroud researcher Colin Berry has observed that the scorch marks and holes in the shroud also produced clear 3 D images under the VP8 analysis.[148] He deduced from this that the shroud image was produced by light scorching, and has produced 3 D images from scorches using appropriate software.[149]” bas relief: “it has been suggested that the bas relief could also be heated and used to scorch an image onto the cloth. However researcher Thibault Heimburger performed some experiments with the scorching of linen, and found that a scorch mark is only produced by direct contact with the hot object – thus producing an all or nothing discoloration with no graduation of color as is found in the shroud.[191]” And about Maillard reaction: “the image resolution and the uniform coloration of the linen resolution seem to be incompatible with a mechanism involving diffusion.[197]” 197: Fanti et alii, Microscopic and Macroscopic Characteristics of the Shroud of Turin Image Superficiality, Journal of Imaging Science and Technology—July/August 2010—Volume 54, Issue 4, p. 040201 6 Discussed here, no comment. It looks like “Bouvard et Pécuchet” are writing this article, mixing apples and oranges without even noticing..","date":"2014-07-28","mins":"6:32 am","url":"https://shroudstory.com/2014/07/28/the-shroud-of-turin-and-the-wikipedia-edit-wars/","cat":"news_&_views","title":"The Shroud of Turin and the Wikipedia Edit Wars"},{"id":"comment-95726","author":"anoxie","post":"Actually, this was my point. Your keys are “lost” when you decide to stop the search, it is subjective, not scientific..","date":"2014-04-02","mins":"1:27 am","url":"https://shroudstory.com/2014/04/01/the-shroud-that-defies-scientific-explanation-part-2/","cat":"news_&_views","title":"The Shroud that Defies Scientific Explanation (Part 2)"},{"id":"comment-95608","author":"anoxie","post":"If you’re looking for lost keys, eventually you will find them. Scientifically there is no loss of information, at worst keys are scrambled up. That you didn’t find them under the sofa doesn’t mean they’ve magically deasappeared out of space time..","date":"2014-04-01","mins":"6:11 pm","url":"https://shroudstory.com/2014/04/01/the-shroud-that-defies-scientific-explanation-part-2/","cat":"news_&_views","title":"The Shroud that Defies Scientific Explanation (Part 2)"},{"id":"comment-204914","author":"anoxie","post":"“… the issue of organic reactions and non contemporaneous contamination of ancient materials can be a very serious and complex matter, deserving quantitative investigation of the possible impacts on measurement accuracy…” http://nvlpubs.nist.gov/nistpubs/jres/109/2/j92cur.pdf.","date":"2015-07-08","mins":"4:14 am","url":"https://shroudstory.com/2015/07/08/todays-featured-article-in-wikipedia/","cat":"wikipedia_content","title":"Today’s Featured Article in Wikipedia"},{"id":"comment-172880","author":"anoxie","post":"Colin has lost his credibility with his scorch hypothesis, no need to hear just another version. Hugh, you have lost your credibility long ago, latest discussions being about cotton and banding. Charles, well, it’s just another painting theory. We’ve spent months to explain Colin the obvious, now that finally he is giving up his “scorch” hypothesis, adding epicycles on epicycles, it’s high time to stop feeding his conspiracy theory..","date":"2014-11-25","mins":"12:23 am","url":"https://shroudstory.com/2014/11/24/social-encyclopedia-ing-the-shroud-of-turin-and-channel-5/","cat":"wikipedia_content","title":"Social Encyclopedia-ing, the Shroud of Turin and Channel 5"},{"id":"comment-48427","author":"anoxie","post":"There are many little bones at the basis of the cartilage. There is a doubt on the knee cap too. That said, there is no obvious wound/deformation indicating legs were broken..","date":"2013-10-22","mins":"1:28 pm","url":"https://shroudstory.com/2013/10/22/todays-how-do-we-know-the-mans-bones-were-not-broken/","cat":"how_do_we_know","title":"Today’s How do we know: the man’s bones were not broken"},{"id":"comment-48443","author":"anoxie","post":"Based on a picture, we simply can’t say reliably wether nasal bone is broken or not..","date":"2013-10-22","mins":"3:59 pm","url":"https://shroudstory.com/2013/10/22/todays-how-do-we-know-the-mans-bones-were-not-broken/","cat":"how_do_we_know","title":"Today’s How do we know: the man’s bones were not broken"},{"id":"comment-48485","author":"anoxie","post":"Broken nose : A broken nose is painfull, swollen, red. It is a very common injury and may have very mild symptoms. I hardly see how one can discard a broken nose with no physical exam. Nasal bone may be broken, or not..","date":"2013-10-23","mins":"1:36 am","url":"https://shroudstory.com/2013/10/22/todays-how-do-we-know-the-mans-bones-were-not-broken/","cat":"how_do_we_know","title":"Today’s How do we know: the man’s bones were not broken"},{"id":"comment-204146","author":"anoxie","post":"I don’t know if both are related but “Laudato si” illustrates the complementary relationship between science and faith. Dan, you asked : https://shroudstory.com/2013/03/14/is pope francis a chemist/ and commented “he is the first pope to have been a scientist, I want to believe it is so” Here he brings an answer : ” …the heavy layering of science extends far beyond the climate issue. As the Post has described, the encyclical is full of scientific content on a diversity of environmental issues — sometimes even throwing around highly technical concepts like ocean acidification, “bioaccumulation” and “synthetic agrotoxins.” So if you’re one of those who insists that science and religion are in conflict — or one of those who stokes that conflict — Francis presents a major challenge.” http://www.washingtonpost.com/news/energy environment/wp/2015/06/18/why pope franciss climate message may be hard for some americans to swallow/.","date":"2015-06-30","mins":"10:52 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-204151","author":"anoxie","post":"Http://thinkprogress.org/climate/2011/07/29/282584/climate scienists debunk latest bunk by denier roy spencer/ I am not a climate skeptic. I don’t have to read Roy Spencer’s misinformation to make up my mind..","date":"2015-06-30","mins":"11:14 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-204157","author":"anoxie","post":"Another super liberal website: http://climate.nasa.gov/.","date":"2015-06-30","mins":"11:41 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-204167","author":"anoxie","post":"NASA has drifted away from science? Are you serious?.","date":"2015-06-30","mins":"1:05 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-204163","author":"anoxie","post":"“the figure of 97% consensus has been thoroughly debunked” A letter, is that all you’ve got? http://climate.nasa.gov/scientific consensus/ http://iopscience.iop.org/1748 9326/8/2/024024/article.","date":"2015-06-30","mins":"12:38 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-204175","author":"anoxie","post":"Data coming from here: http://data.giss.nasa.gov/gistemp/tabledata v3/GLB.Ts+d SST.txt I don’t think NASA scientists are compromised at all by any kind of liberal fascism, they are among the best scientists working on climate change. I’m getting what the journalist of the Wahsington Post meant by “hard to swallow for americans”….","date":"2015-06-30","mins":"1:35 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-204191","author":"anoxie","post":"“If we look at a more recent period of time, since the record warm year of 1998, one could say that it has cooled in the last 17 years. We still don’t know whether warming is happening now or will happen in the future.” This is a well known hiatus: http://www.scientificamerican.com/article/oceans hid the heat and slowed pace of global warming/ Air temperature is only one of many proxies to monitor climate change..","date":"2015-06-30","mins":"3:30 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?"},{"id":"comment-134456","author":"anoxie","post":"“voilà” with a grave accent..","date":"2014-06-30","mins":"6:56 am","url":"https://shroudstory.com/2014/06/30/what-if-jesus-defies-expectations-again/","cat":"news_&_views","title":"What if Jesus Defies Expectations Again"},{"id":"comment-205019","author":"anoxie","post":"Concerning Marion, or Castex, or Frale, it’s no more than “i think i see” with a scientific vernish. Concerning Di Lazzaro, he’s a laser expert and tries reproduce the shroud tanks to lasers, naively. Carpentieri, lost in unconventional neutronish radiation, is trying to reproduce the shroud thanks to neutron radiation, and Colin Berry, our food expert, is trying to reproduce the image, with flour..","date":"2015-07-09","mins":"5:05 pm","url":"https://shroudstory.com/2015/07/09/who-proposed-ultraviolet/","cat":"news_&_views","title":"Who Proposed Ultraviolet?"},{"id":"comment-174405","author":"anoxie","post":"“And no, the word linen or a suitable synonym is not to be found. I, too, am wikified.” Because the object, shortly described in wikipedia, is “descent from the cross” or “deposition of christ”, the presence of a cloth or a linen here is plain artistic interpretation, no need to feed CB’s far fetched extrapolations. On the other hand what can you actually see on these 30 pictures (even in the entombment) you can’t see on the Shroud? A loincloth. Sure, in a forgery narrative, they would simply have removed the loincloth between the descent from the cross and “deposition into” a body bag, no need to argue, what is problematic is the highly variable linen……. This is plain artistic interpretation, this is plain CB´s wild extrapolation, this is plain confirmation bias, no need to be wikified..","date":"2014-12-03","mins":"1:41 am","url":"https://shroudstory.com/2014/12/02/wikified-word-of-the-day/","cat":"news_&_views","title":"Wikified:  Word of the Day"}]
