[{"id":"comment-16987","author":"anoxie","post":"Ok..","date":"2012-09-27","mins":"11:58 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-17326","author":"anoxie","post":"“Do we basically know that neither Flury Lemberg or anyone else did no chemical or physical analysis of the samples before c14 datation, or is it that they just haven’t told us specifically what they did in accepting the samples?” I’m not aware of any documented chemical or physical analysis before C14 datation. Dr Fulry Lemberg gave her expertise based on a visual analysis of the shroud. Chemical or physical data gathered by the STURP have not been taken into account before chosing the sampling area. The very question of reweaving was raised before the official results of the C14 datation were announced: Draft Protocol for Future Examinations of the Shroud of Turin, 8 october 1988, page 4 Apparently no overall survey of the cloth was undertaken or documented to justify the sampling location. Thus questions of waterstains, edge handling, possible 14th century reweaving, and the like remain unanswered. “what did the 78 STURP research say about that particular area?” That it was the worst sampling area..","date":"2012-10-08","mins":"6:00 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-17334","author":"anoxie","post":"Richard Savage : – Do you know where I can get more specific info from STURP re that corner? There is no shortcut if you want to do it right, you have to study patiently STURP’s peer reviewed articles. A good introduction is here : Discrepancies in the Radiocarbon Dating Area of the Turin Shroud But let’s be clear, it was not STURP’s objective to determine a sampling location. This job has not been done before the C14 datation..","date":"2012-10-08","mins":"1:46 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-17392","author":"anoxie","post":"Sorry, this should work : Discrepancies in the Radiocarbon Dating Area of the Turin Shroud. STURP did not miss the reweaving, because it did not look for it. That is the sense of the warning “the question of a possible reweaving remains unanswered”. This is the main limitation of the C14 datation. Its sampling protocol did not include an overall study of the cloth and a chemical/physical characterisation of the sample. Thus the basic rule of C14 datation (the sample must be representative of the whole), has not been respected with the highest level of proof..","date":"2012-10-10","mins":"5:38 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-17551","author":"anoxie","post":"Your welcome. But i must say you’re in a dead end. If they don’t accept Rogers’ article (and why would they since the three laboratories don’t seem to care), we have to rely on Nature’ article. However, 1/ it seems raw data leaked out from Tucson laboratory 2/ an independant analysis of the reserve sample may easily confirm Rogers’ findings if he was right Basically, it’s a matter of time..","date":"2012-10-12","mins":"1:32 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-17393","author":"anoxie","post":"Sorry for the link. You can find it easily, search for : Chemistry Today (Vol 26, Num 4, Jul/Aug 2008), “Discrepancies in the radiocarbon dating area of the Turin Shroud,” Benford M.S., Marino J.G..","date":"2012-10-10","mins":"5:41 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-17756","author":"anoxie","post":"I mean the ones who should move on are Pr Ramsey, or Dr Jull. Until this happens, you’ll have a hard time to convince any skeptic on the Randi forum. And according to a paper from Dr Jull “Investigating a Dated Piece of the Shroud of Turin”, Radiocarbon 52 no 4, 2010: 1521 1527, this is not going to happen soon..","date":"2012-10-17","mins":"3:38 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-17872","author":"anoxie","post":"This is an expert’s opinion. These are facts : 1/ Rogers’ article in Thermochimica Acta 2/ Confirmation by LANL’s work (http://www.shroud.com/pdfs/villarrealvtxt.pdf) based on : 1. X ray Photoelectron Spectroscopy 2. Tube Excited and Radioactive Source Micro spot Energy Dispersive X Ray Fluorescence (MXRF) Spectrometry 3. High and Low Powered Magnification with a High Resolution Photo Microscope 4. Fourier Transform Infra Red Spectroscopy (FTIR) with Reflectance Mode Capability 5. Time of Flight Secondary Ion Mass Spectrometer (TOF SIMS) And I think the answer by Dr. Jull in Radiocarbon is not convincing. Only an independant, comprehensive and official analysis of radiocarbon yarns could settle this issue, no more, no less..","date":"2012-10-19","mins":"12:04 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-18043","author":"anoxie","post":"This is a legitimate question. You should ask Joe Marino for more details on his investigations on French re weaving. I have no strong views on this hypothesis. I think the rigourous conclusion we can draw out Rogers’ and LANL’s works is not that there has been a reweaving but that there is/was a significant amount of cotton in the C14 sample. And this fact (the sample is not representative of the whole), invalidates the dating..","date":"2012-10-22","mins":"1:14 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-18198","author":"anoxie","post":"Be carefull, there are very controversial claims in this list. I don’t think the shroud is holographic or bears flowers’ images. I don’t know much about the mattress but i think it is a different mecanism. Some claims are elusive. Talking to skeptics, I’d stick to the C14 dating and its limitations. If they don’t admit them, i’d give up, otherwise i’d try to argue..","date":"2012-10-24","mins":"10:07 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-18299","author":"anoxie","post":"I’ve read the article concerning the hologram theory. It is not convincing, the described properties are not specific of a hologram. Definitely, the shroud is not holographic. In regard to flowers and coins, you should read Dan’s article : I Don’t See Flowers and Coins and Teeth on the Shroud of Turin. Concerning the Hospice mattress, it is not the same mechanism..","date":"2012-10-25","mins":"4:30 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-27644","author":"anoxie","post":"You should ask Thibault directly. He has examined threads from the shroud and has seen different type of fibers, certainly not from the original cloth..","date":"2013-03-18","mins":"10:16 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-7867","author":"anoxie","post":"Significance level (%) 5 4.99 and the article is non conclusive… as said Dan, even Pr Ramsey admitted one should have a second look on the 1988 C14 datation. What is needed is a multinational, multidisciplinary team of reknowned experts, proposing a protocole to study the shroud physically, chemically, historically… One can say the Vatican is reluctant, but creating such a team and protocole may be the hard bit. Best regards,.","date":"2012-02-02","mins":"2:17 pm","url":"https://shroudstory.com/2012/01/31/badder-still-bad-archaeology-at-bad-archaeology/","cat":"other_blogs","title":"Badder Still: Bad Archaeology at Bad Archaeology"},{"id":"comment-16855","author":"anoxie","post":"There has been no chemical or physical analysis of the samples before c14 datation. You can’t draw any conclusion on the nature of the samples based on Nature’s article. Do they have any other source ?.","date":"2012-09-24","mins":"10:34 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-180533","author":"anoxie","post":"Both problems have a sampling issue..","date":"2015-01-01","mins":"9:02 am","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-30870","author":"anoxie","post":"One has to remenber anti clericalism was maybe at its highest in France when Pr Delage protested against censorship. Times have changed..","date":"2013-04-15","mins":"10:01 am","url":"https://shroudstory.com/2013/04/15/danusha-goska-on-catholics-atheists-censorship-and-the-shroud/","cat":"news_&_views","title":"Danusha Goska on Catholics, Atheists, Censorship and the Shroud"},{"id":"comment-30938","author":"anoxie","post":"I wonder how Delage expected his work to be recieved. He should know most members of the French Academy of Sciences were deeply anticlerical, some close to an anticlerical sectarism. It was well beyond quiet atheism. This was academical context in France, 1902. Censorship didn’t prevent STURP’s scientists to publish their work in respected peer reviewed journals in the 80’s..","date":"2013-04-16","mins":"3:29 am","url":"https://shroudstory.com/2013/04/15/danusha-goska-on-catholics-atheists-censorship-and-the-shroud/","cat":"news_&_views","title":"Danusha Goska on Catholics, Atheists, Censorship and the Shroud"},{"id":"comment-72766","author":"anoxie","post":"That’s a good point, but science won’t tell why a totally unllikely naturalistic phenomenon has occured. It depends on the witness to name it..","date":"2014-01-09","mins":"2:03 pm","url":"https://shroudstory.com/2014/01/09/best-shroud-of-turin-comment-of-the-day-and-its-on-another-blog/","cat":"other_blogs","title":"Best Shroud of Turin Comment of the Day and it’s on Another Blog"},{"id":"comment-130740","author":"anoxie","post":"I was commenting the article : “Today, we know the characteristics of the stochastic processes, which are triggered by a little quantity of energy that produce noticeable effects only after a time of latency of the order of many years. It should be noted that such an effect doesn’t need a minimum threshold to appear” And I’m telling you it is the opposite on the shroud, coloration needs a minimum threshold to appear, the distribution depends on the varying threshold between fibers. Just read your article, you simply don’t mention heterogeneity of fibers but the source of energy as the origin of the “stochastic process”. I won’t comment comments, or comments trying to explain my comments, i usually agree with myself. No, the source of energy is not responsible for a stochastic process..","date":"2014-06-18","mins":"10:21 am","url":"https://shroudstory.com/2014/06/18/catching-up-yannick-to-hugh-anoxie-and-all-of-us/","cat":"paper_chase","title":"Catching Up:  Yannick to Hugh, Anoxie and All of Us"},{"id":"comment-131277","author":"anoxie","post":"“This extended scenario is something I had in mind since last summer but it’s only when I read the recent comment made by Thibault that I thought it was time I talk about it publicly. It was even the first time I was talking about it with Fazio” So you’ve write with Fazio “a natural stochastic process….” but never told him about what you think is the best explanation of the uneven coloration ? This is absurd..","date":"2014-06-19","mins":"10:53 am","url":"https://shroudstory.com/2014/06/18/catching-up-yannick-to-hugh-anoxie-and-all-of-us/","cat":"paper_chase","title":"Catching Up:  Yannick to Hugh, Anoxie and All of Us"},{"id":"comment-131425","author":"anoxie","post":"September 7, 2013 at 6:59 pm https://shroudstory.com/2013/09/04/thoughts on the newly published paper by ray rogers/#comments ““Nowadays, we know that a slight transfer of energy triggered a stochastic process.” Note: this is a kind of process that can cause an image that is discontinuous and very superficial like the one on the Shroud and that can only be natural in nature (in a paper entitled “Stochastic distribution of the fibrils that yielded the Shroud of Turin body image”, these 2 Italian scientists were very clear on this question and there’s no doubt that Ray Rogers would have agreed with them about that).” And you had this scenario in mind since this summer ? No, Ray Rogers would not have agreed with them about that. No, the source of energy is not responsible for a stochastic process. Have another try..","date":"2014-06-19","mins":"5:33 pm","url":"https://shroudstory.com/2014/06/18/catching-up-yannick-to-hugh-anoxie-and-all-of-us/","cat":"paper_chase","title":"Catching Up:  Yannick to Hugh, Anoxie and All of Us"},{"id":"comment-132023","author":"anoxie","post":"“How do you know this Mr. Anoxie?” Because I know physics, not just in an embryonic state. It is really ironical to see you, Yannick Clément, who has for months written endless posts and comments on (your interpretation of) Rogers’ theory, coauthor of a paper on image formation (“A Natural Stochastic Process May Explain the Coexistence of Bloodstains and an Image on the Shroud of Turin”) not consistent with Rogers’ theory….","date":"2014-06-21","mins":"5:50 am","url":"https://shroudstory.com/2014/06/18/catching-up-yannick-to-hugh-anoxie-and-all-of-us/","cat":"paper_chase","title":"Catching Up:  Yannick to Hugh, Anoxie and All of Us"},{"id":"comment-139234","author":"anoxie","post":"Left and right shoulders can’t be directly compared, left one is not as well defined as the right one. It depends on cloth – body configuration. Imprinting mechanism should not be idealized. Or you could say right leg is longer than the left one, lower shoulder, lower leg… Mike, the dorsal image is misaligned on the shroud. Draw a lign from top of the head to feet, compare frontal and dorsal..","date":"2014-07-19","mins":"1:16 am","url":"https://shroudstory.com/2014/07/18/comment-promoted-a-misalignment-between-the-left-and-right-shoulders/","cat":"comments_promoted","title":"Comment Promoted:  A Misalignment Between the Left and Right Shoulders"},{"id":"comment-139238","author":"anoxie","post":"And about getting the right left right : https://shroudstory.com/2012/12/26/getting the left and the right right/.","date":"2014-07-19","mins":"2:23 am","url":"https://shroudstory.com/2014/07/18/comment-promoted-a-misalignment-between-the-left-and-right-shoulders/","cat":"comments_promoted","title":"Comment Promoted:  A Misalignment Between the Left and Right Shoulders"},{"id":"comment-139165","author":"anoxie","post":"There is a misalignment/twist/rotation on the whole dorsal image. From shoulders to feet, no longer centered. Think 3 D..","date":"2014-07-18","mins":"1:15 pm","url":"https://shroudstory.com/2014/07/18/comment-promoted-a-misalignment-between-the-left-and-right-shoulders/","cat":"comments_promoted","title":"Comment Promoted:  A Misalignment Between the Left and Right Shoulders"},{"id":"comment-201560","author":"anoxie","post":"“That’s why we have no right, for the moment, to discard Rogers’ hypothesis for image formation in the form he described it!” Could you be more specific? What image formation hypothesis are you supporting?.","date":"2015-06-11","mins":"12:24 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","title":"Guest Posting by Yannick Clément"},{"id":"comment-8198","author":"anoxie","post":"One needs to examine facts. And facts need a multidisciplinary approach, I don’t believe one man can have the expertise to deal with each questions raised by the shroud. That said, if you think you have reproduced the shroud, you should seriously think of publishing your findings..","date":"2012-02-13","mins":"12:05 pm","url":"https://shroudstory.com/2012/02/07/dont-confuse-him-with-facts-his-mind-is-made-up/","cat":"other_blogs","title":"Don’t confuse him with facts, his mind is made up"},{"id":"comment-201346","author":"anoxie","post":"“A natural and accidental process is expected to produce many partial and incomplete images for every single complete image. ” What do you think of the blood stains: is the blood imprint partial, incomplete and not homogeneous compared to the image?.","date":"2015-06-08","mins":"2:01 pm","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","title":"Guest Posting by Yannick Clément"},{"id":"comment-85618","author":"anoxie","post":"Using a cloth washed in a low surface tension solution containing pentose sugars (e.g., a Saponaria solution) and dried in the sun, a non metallic statue at a temperature above 100 C might have worked Best hoax hypothesis..","date":"2014-03-06","mins":"5:01 pm","url":"https://shroudstory.com/2014/03/06/hit-and-run-trolling-and-a-whole-lot-more/","cat":"other_blogs","title":"Hit and Run Trolling and a Whole Lot More"},{"id":"comment-201472","author":"anoxie","post":"“Is humanity like the Shroud, a one off occurrence brought about by a series of coincidental causes? Are we a miracle?” Great questions..","date":"2015-06-10","mins":"9:13 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","title":"Guest Posting by Yannick Clément"},{"id":"comment-85926","author":"anoxie","post":"It was a simple reminder to put Colin Berry back on a rational track, if not realistic..","date":"2014-03-07","mins":"12:37 pm","url":"https://shroudstory.com/2014/03/06/hit-and-run-trolling-and-a-whole-lot-more/","cat":"other_blogs","title":"Hit and Run Trolling and a Whole Lot More"},{"id":"comment-144591","author":"anoxie","post":"Do you really think J. Jackson is this stupid ? “Depending on the temperature, the conductivity of the material and no doubt other factors, there may not be sufficient heat to discolour anything beyond the first few fibres thickness, however fast it goes.” The problem is not how fast heat propagates, but how long you apply the template, this is the critical factor as far as heat and then temperature, is concerned. The time scale is what it is, a time scale..","date":"2014-08-18","mins":"2:24 pm","url":"https://shroudstory.com/2014/08/18/into-a-world-not-cut-off-from-reality/","cat":"other_blogs","title":"Into a World Not Cut Off from Reality?"},{"id":"comment-85928","author":"anoxie","post":"Mike M : Why don’t we see a new shroud manufactured in 2014 with the same Macro and Micro properties of the shroud? Good question. Has anyone tried to reproduce the shroud ? Meaning the shroud itself, not the image or bloodstains. Is there any consensus how it was made and bleached ? Has anyone the skill and the material to reproduce a full size shroud ?.","date":"2014-03-07","mins":"12:41 pm","url":"https://shroudstory.com/2014/03/06/hit-and-run-trolling-and-a-whole-lot-more/","cat":"other_blogs","title":"Hit and Run Trolling and a Whole Lot More"},{"id":"comment-144599","author":"anoxie","post":"J. Jackson is talking about a “time scale” because this is how you will roughly describe the evolution of heat transfer or propagation of the thermal discoloration, which are not constant in time/space. I don’t think he claims a thermal discoloration can’t be superficial..","date":"2014-08-18","mins":"3:29 pm","url":"https://shroudstory.com/2014/08/18/into-a-world-not-cut-off-from-reality/","cat":"other_blogs","title":"Into a World Not Cut Off from Reality?"},{"id":"comment-135049","author":"anoxie","post":"“why is it necessary for the hair (or mustache, or beard) to leave an image different from the image of the skin?” Because it retains fluids..","date":"2014-07-03","mins":"4:52 am","url":"https://shroudstory.com/2014/07/02/is-the-beard-of-the-man-of-the-shroud-an-impactogram/","cat":"other_blogs","title":"Is the beard of the man of the shroud an impactogram?"},{"id":"comment-144579","author":"anoxie","post":"Can thermal imprint be superficial at thread level ? It’s all about time scale. “The problems this technique, as explained in detail in my 1984 paper, is that thermal discoloration propagates through the thickness of the cloth on a time scale between 1/100 to 1/10 second. This could be mitigated to some extent by pre soaking the cloth, but this moved the resulting image to appear more like one of direct contact, owing to the need to vaporize the moisture in the linen which requires time that competes with the thermal penetration time into the cloth.” https://shroudstory.com/2012/03/04/john jackson on colin berrys highly misleading comments/.","date":"2014-08-18","mins":"1:22 pm","url":"https://shroudstory.com/2014/08/18/into-a-world-not-cut-off-from-reality/","cat":"other_blogs","title":"Into a World Not Cut Off from Reality?"},{"id":"comment-159875","author":"anoxie","post":"“People who are experts in one field are capable of appalling lapses of judgement when assessing the evidence in fields outside their own.” Good, basic conclusion..","date":"2014-10-06","mins":"1:22 pm","url":"https://shroudstory.com/2014/10/06/jerry-coyne-once-again/","cat":"other_blogs","title":"Jerry Coyne Once Again"},{"id":"comment-12037","author":"anoxie","post":"What seems to be interesting is the folding of the shroud under the bottom :.","date":"2012-06-07","mins":"9:08 am","url":"https://shroudstory.com/2012/06/07/marcel-alonso-on-rogers-impurity-layer/","cat":"challenge","title":"Marcel Alonso on Rogers’ Impurity Layer"},{"id":"comment-12041","author":"anoxie","post":"1 Concerning the filtering : should a dynamic equalization deform an image ? No. 2 “Since these treatment leave the image intact, the formation of this image would’nt have altered the surface composition of the threads, which would go in the sense of a deposit of coloration added to the threads” (original in French :”Comme ces traitements laissent l’image intacte, le dépôt de celle ci n’aurait pas altéré la composition de surface du fil, ce qui irait dans le sens d’une couleur déposée, ajoutée à celle du fil.”) We only have one information : intensity. Based on this, one can’t conclude on an image added on the shread or mixed in the shread. 3 Alonso is giving his opinion, I don’t think there is the beginning of a scientific work..","date":"2012-06-07","mins":"10:01 am","url":"https://shroudstory.com/2012/06/07/marcel-alonso-on-rogers-impurity-layer/","cat":"challenge","title":"Marcel Alonso on Rogers’ Impurity Layer"},{"id":"comment-12055","author":"anoxie","post":"You clearly explained Alonso opinion/hypothesis. What I say is it you can’t draw this conclusion out of this numeric treatment..","date":"2012-06-07","mins":"12:52 pm","url":"https://shroudstory.com/2012/06/07/marcel-alonso-on-rogers-impurity-layer/","cat":"challenge","title":"Marcel Alonso on Rogers’ Impurity Layer"},{"id":"comment-157066","author":"anoxie","post":"The Shroud is a box trap for skeptics, ignorance….","date":"2014-09-26","mins":"6:35 pm","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","title":"Mars, Weeping Mary and the Shroud"},{"id":"comment-26979","author":"anoxie","post":"Interesting. Once again it focuses on image formation, so let’s forget 2 min about image formation. Has anyone reproduced blood stains pattern ? Take the last mediatic attempt to reproduce the shroud, namely Luigi Garlaschelli’s. What did he naively say to thibault about blood stains ? “I have absolutely not tackled the problem of blood stains (…)” Has anyone reproduced blood stains ? macroscopically ? microscopically ? Has anyone studied such pathological blood thanks to thromboelastography ? Was the strain used to remove flax fibers percisely measured ? Is it close to the strength of a blood clot ? Were flax fibers broken when the corpse was removed from the shroud ? What do we know about mechanical properties of flax fibers ?.","date":"2013-03-10","mins":"8:54 am","url":"https://shroudstory.com/2013/03/10/old-video-ancient-secrets-of-the-bible-the-shroud-of-turin/","cat":"other_blogs","title":"Old Video: Ancient Secrets of the Bible – The Shroud of Turin"},{"id":"comment-27096","author":"anoxie","post":"Obviously, i didn’t mean to test the blood on the shroud. What’s the point ? Quantification. You must have heard about post mortem fibrinolysis, but it is still in balance with coagulation. Post mortem clots are weaker, but still develop. Now you can easily imagine that if coagulation/fibrinolysis of normal blood and pathological blood (it has been suggested the victim suffered disseminated intravascular coagulation) in vivo is different, post mortem coagulation/fibrinolysis will be different, clots properties will be different, kinetics of clots formation will be different, shape of bloodstains will be different..","date":"2013-03-11","mins":"4:38 pm","url":"https://shroudstory.com/2013/03/10/old-video-ancient-secrets-of-the-bible-the-shroud-of-turin/","cat":"other_blogs","title":"Old Video: Ancient Secrets of the Bible – The Shroud of Turin"},{"id":"comment-191475","author":"anoxie","post":"“The strategy of Colin is to destroy this blog.” The only things Colin has been destroying so far, being (over) exposed on this blog, are his own credentials..","date":"2015-02-21","mins":"7:03 am","url":"https://shroudstory.com/2015/02/14/on-deaf-ears-here/","cat":"other_blogs","title":"On Deaf Ears Here?"},{"id":"comment-46412","author":"anoxie","post":"Matthias : some of the stains like those on the forearms (and possibly the head), for example, look contrived. I hardly see how a forger could have added blood/serum, e.g. On the forearm, fitting perfectly at the microscopic level with image borders..","date":"2013-10-07","mins":"6:37 pm","url":"https://shroudstory.com/2013/10/06/one-persons-take-away-from-a-shroud-lecture/","cat":"other_blogs","title":"One Person’s Take Away from a Shroud Lecture"},{"id":"comment-46331","author":"anoxie","post":"Thinking of scourge marks, there is no clear limit between “image” and “bloodstains”..","date":"2013-10-06","mins":"5:53 pm","url":"https://shroudstory.com/2013/10/06/one-persons-take-away-from-a-shroud-lecture/","cat":"other_blogs","title":"One Person’s Take Away from a Shroud Lecture"},{"id":"comment-46693","author":"anoxie","post":"Hugh Farey : no artist could have matched the injuries due to a Roman flagrum Actually, no artist could have matched the injuries (adding blood) to image pattern..","date":"2013-10-09","mins":"4:43 pm","url":"https://shroudstory.com/2013/10/06/one-persons-take-away-from-a-shroud-lecture/","cat":"other_blogs","title":"One Person’s Take Away from a Shroud Lecture"},{"id":"comment-73749","author":"anoxie","post":"Thank you for the document, for the most part, still strikingly modern. Edward A. Wuenschel :The very nature of the subject and the state of the controversy demanded precise knowledge and a rigorously scientific spirit in one who pretended to do more than popularize the work of others..","date":"2014-01-19","mins":"6:15 pm","url":"https://shroudstory.com/2014/01/19/paper-chase-a-wonderful-rare-document-from-father-weuncheal/","cat":"other_blogs","title":"Paper Chase:  A Wonderful, Rare Document from Father Weuncheal"},{"id":"comment-73862","author":"anoxie","post":"Obviously, but he warns us of the many “Dr Hyneks” who will flourish on the Shroud..","date":"2014-01-20","mins":"5:07 pm","url":"https://shroudstory.com/2014/01/19/paper-chase-a-wonderful-rare-document-from-father-weuncheal/","cat":"other_blogs","title":"Paper Chase:  A Wonderful, Rare Document from Father Weuncheal"},{"id":"comment-153713","author":"anoxie","post":"The quote was: “If there’s the slightest air gap, then there’s essentially no scorching, though a slight yellowing might just be possible from hot convected gases.” not: “If there’s the slightest air gap, then there’s essentially no scorching” But my answer may be: “there’s […] no scorching” Hugh, if you’ve found something, write a helpful pdf, and i’ll comment..","date":"2014-09-22","mins":"2:49 pm","url":"https://shroudstory.com/2014/09/22/samuel-johnson-meets-his-match/","cat":"comments_promoted","title":"Samuel Johnson Meets His Match"},{"id":"comment-29214","author":"anoxie","post":"Hugh Farey : Any painting or photograph taken full face, with front lighting and a dark background, reproduces the 3 D effect as least as well as the shroud, and sometimes better. Hugh, you have to be more specific, at least give an example of one single painting which contains 3 D information..","date":"2013-04-03","mins":"10:08 am","url":"https://shroudstory.com/2013/04/02/ten-questions-for-shroud-skeptics-from-fr-longenecker/","cat":"other_blogs","title":"Ten Questions for Shroud Skeptics from Fr. Longenecker"},{"id":"comment-153692","author":"anoxie","post":"“If there’s the slightest air gap, then there’s essentially no scorching, though a slight yellowing might just be possible from hot convected gases.” PHPL, this “excellent answer” is pure tosh. But CB should stick to his basic ideas, the more he writes, the more he makes a fool of himself..","date":"2014-09-22","mins":"2:08 pm","url":"https://shroudstory.com/2014/09/22/samuel-johnson-meets-his-match/","cat":"comments_promoted","title":"Samuel Johnson Meets His Match"},{"id":"comment-149967","author":"anoxie","post":"About the empty tomb: https://shroudstory.com/2014/08/01/paul maier at the veritas forum the real jesus/ When you try to argue, you’ll eventually find these kind of footnotes, dead end of reason..","date":"2014-09-10","mins":"3:16 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-147493","author":"anoxie","post":"I think that for the sake of clarity, you should not have splitted the post on banding, into one, two, three, four posts… A confusing pdf… And i don’t know what’s going to pop up. I’ve answered. Thibault has paraphrased. Banding is real. What you see here is just what i’ve predicted at the end of “banding? Is it real?” “this spoonfeeding will trigger another version in CB far fetched theories.” There is no more science in this one than in the ludicrious first post of Colin about banding. I won’t put a resume next to my name, maybe, Thibault will wake up, repeat what i say, and be listened to, that’s the Thibault’s effect. If on such a basic issue one is misunderstood, there is no need to argue any longer..","date":"2014-08-31","mins":"3:41 am","url":"https://shroudstory.com/2014/08/30/time-will-tell/","cat":"other_blogs","title":"Time will tell."},{"id":"comment-147813","author":"anoxie","post":"Sorry, i don’t get your point..","date":"2014-09-01","mins":"1:14 pm","url":"https://shroudstory.com/2014/08/30/time-will-tell/","cat":"other_blogs","title":"Time will tell."},{"id":"comment-147816","author":"anoxie","post":"Ok. I don’t really care. Best recent contributions to the study of the Shroud have been made by… Thibault Heimburger and Kelly Kearse. I’ve already given my opinion on PDL, Fanti, Jackson… the Valencia consensus….","date":"2014-09-01","mins":"1:35 pm","url":"https://shroudstory.com/2014/08/30/time-will-tell/","cat":"other_blogs","title":"Time will tell."},{"id":"comment-147785","author":"anoxie","post":"Time will tell… about what? So far, i’ve restrained myself to tackle each issue one by one. The latest being the banding. The banding effect is not an illusion, and time has nothing to do with it. Even a game of ping pong has rules, and a score..","date":"2014-09-01","mins":"11:35 am","url":"https://shroudstory.com/2014/08/30/time-will-tell/","cat":"other_blogs","title":"Time will tell."},{"id":"comment-147797","author":"anoxie","post":"And in the meantime we can say what it is not. Data have been collected, and if you want to build a theory you’ve to deal with it. Here, we’ve been merely talking about high definition pictures of the Shroud..","date":"2014-09-01","mins":"12:25 pm","url":"https://shroudstory.com/2014/08/30/time-will-tell/","cat":"other_blogs","title":"Time will tell."},{"id":"comment-147808","author":"anoxie","post":"We’re talking about banding here, not playing ping pong. Who has ignored what claimed by whom on which basis?.","date":"2014-09-01","mins":"12:56 pm","url":"https://shroudstory.com/2014/08/30/time-will-tell/","cat":"other_blogs","title":"Time will tell."},{"id":"comment-198762","author":"anoxie","post":"Yannick, we’ve discussed about Rogers’ legacy back in 2012, It was clear that no definite answer had been given concerning chemical reactants at stake,Thibault said he was working on it. I guess the problem is complex when you’re dealing with a biological coating and he still doesn’t have a serious track, no more no less than our latecomer in the chemical field, CB, who thought he had it all figured out but is totally off the track..","date":"2015-05-10","mins":"6:04 am","url":"https://shroudstory.com/2015/05/10/yannick-clment-on-colin-berrys-latest-hypothesis/","cat":"guest_posting","title":"Yannick Clément on Colin Berry’s Latest Hypothesis"},{"id":"comment-73030","author":"anoxie","post":"Dr. Petrus Soons found that something had been placed around Jesus’ neck with three Hebrew letters (can you see it under his beard?) No, i can’t see it. Keep it simple..","date":"2014-01-11","mins":"7:37 am","url":"https://shroudstory.com/2014/01/11/you-do-not-like-them-so-you-say-try-them-try-them-and-you-may/","cat":"other_blogs","title":"You do not like them. So you say. Try them! Try them! And you may"}]
