[{"id":"comment-9823","author":"john","post":"I agree with Susanna…we should pray for the fool (and that is what he is according to scripture…the fool has said in his heart …etc.)whatever form our prayers should take. Conversions,however great or small,are happening around the globe by the minute.And apart from the classic conversion of St.Paul,we all know of various conversions in recent times as well.Malcolm Mugridge and his encounter with Mother Theresa immediiately comes to my mind and his subsequent book,”Something Beautiful for God”. In any case I will never underestimate the importance and power of prayer…and to take it a little further,I’d like to add something Catherine de Hueck Dorothy had said.She was a baroness of Russia and social activist who worked with the poor in Harlem N.Y.,as well as an author of many spiritual books and founder of the Madonna House, a lay apostolate in northern Ontairio,Canada(and which is now in several other countries) Anyhow,shortly after I had the good fortune of meeting and chatting with Catherine on a few occassions while she was living,I saw her being interviewed on a regular national T.V. Program in my country Canada called “Man Alive.She was asked by Roy Bonistiel,who hosted the program,the question,”How important is prayer in your life”? To this she smiled and answered quite calmly and emphatically,while looking him straight in the eye,she said,I AM a prayer”. She went on to explain in greater detail,but the gest of what she wanted to convey,was how everything we do,whether it’s housework,garden work,what have you,,,also becomes a prayer when done in the right spirit and offered to God.Yes,Susanna,I agree,that we should pray for Richard Dawkins whatever form our prayers should take..","date":"2012-03-31","mins":"11:06 am","url":"https://shroudstory.com/2012/03/31/speaking-of-issuing-challenges-to-dawkins/","cat":"event","title":"Speaking of issuing challenges to Dawkins"},{"id":"comment-11393","author":"john","post":"Undoubtedly a mysterious object indeed…and what else could it be if it had actually wrapped around the creator of the cosmos and author of life.Anything less mysterious then it already is would be unfitting..","date":"2012-05-16","mins":"4:09 pm","url":"https://shroudstory.com/2012/05/16/traveling-shroud-of-turin-exhibit-in-the-midwest/","cat":"event","title":"Traveling Shroud of Turin Exhibit in the Midwest"}]
