[{"id":"comment-11413","author":"john","post":"What Christians have gotten all wrong is just how decieved are some members of the faith.To no really good end do they persevere and pursue notions that are way out in left feid.Overscupulously examining articles of faith that they have no business meddling with…all to satisfy an insatiable ego in the belief that they got it right where all others have failed..","date":"2012-05-18","mins":"4:55 am","url":"https://shroudstory.com/2012/05/18/do-christians-misunderstand-heaven/","cat":"news_&_views","title":"Do Christians Misunderstand Heaven?"},{"id":"comment-5514","author":"john","post":"Too often, mankind thinks far too much of him or herself, believing that “science” is the way to all knowledge. How foolish are we, for some considered to be “so knowledgeable”, yet fail to recognize the existence of the true “Author of creation, our universe, very existence, and salvation”? Kudos to you Dr. Porter, for coming to realize and publicly admit, that you don’t know what you don’t know and can’t explain using science. In doing so, you are opening yourself up to Faith and the explanation, for things that cannot be explained, by mere mankind. God is surely stirring in heart heart, as well as your mind, and soul. Here’s to hoping that others eyes are opened to the TRUTH, even if they don’t yet see it with their very eyes, or feel with their spirit, to the core of their very beings. God Bless..","date":"2011-12-14","mins":"3:02 pm","url":"https://shroudstory.com/2010/12/14/replica-of-our-lady-of-guadalupe-enthroned-in-turin/","cat":"news_&_views","title":"Replica of Our Lady of Guadalupe Enthroned in Turin"},{"id":"comment-5515","author":"john","post":"Too often, mankind thinks far too much of him or herself, believing that “science” is the way to all knowledge. How foolish are we, for some considered to be “so knowledgeable”, yet fail to recognize the existence of the true “Author of creation, our universe, very existence, and salvation”? Kudos to you Dr. Porter, for coming to realize and publicly admit, that you don’t know what you don’t know and can’t explain using science. In doing so, you are opening yourself up to Faith and the explanation, for things that cannot be explained, by mere mankind. God is surely stirring in your heart, as well as your mind, and soul. Here’s to hoping that others eyes are opened to the TRUTH, even if they don’t yet see it with their very eyes, or feel with their spirit, to the core of their very beings. Even the hardest of hearts can soften and be changed, if they only open themselves up to the possibilities that they for too long have been denying. Often giving in to what really is, often fills the void that we often times struggle with, no matter how “advanced” our scientific methods or manners/devices of inquiry may be. God Bless..","date":"2011-12-14","mins":"3:07 pm","url":"https://shroudstory.com/2010/12/14/replica-of-our-lady-of-guadalupe-enthroned-in-turin/","cat":"news_&_views","title":"Replica of Our Lady of Guadalupe Enthroned in Turin"},{"id":"comment-9468","author":"john","post":"I have to say,you certainly can’t accuse this web site of being bias…even the most ridiculous can be heard..","date":"2012-03-20","mins":"9:26 am","url":"https://shroudstory.com/2012/03/20/the-resurrect-christ-foundation-and-the-shroud-of-turin/","cat":"news_&_views","title":"The Resurrect Christ Foundation and the Shroud of Turin"}]
