[{"id":"comment-13350","author":"john","post":"Ron and Dave…I couldn’t have said it better.Apart from the Shroud of Turin and it’s remarkable preservation and survival…what a precious and priceless treasure it is to have “the gift of faith”..","date":"2012-07-02","mins":"11:37 pm","url":"https://shroudstory.com/2012/07/02/this-is-really-just-a-lead-in-to-quoting-the-daily-mail-on-lombatti/","cat":"news_&_views","title":"This is really just a lead in to quoting the Daily Mail on Lombatti"},{"id":"comment-9473","author":"john","post":"I read just the article and found it extremely interesting..","date":"2012-03-20","mins":"10:48 am","url":"https://shroudstory.com/2012/03/20/interview-with-barrie-schwortz-in-intrepid/","cat":"news_&_views","title":"Interview with Barrie Schwortz in Intrepid"},{"id":"comment-11373","author":"john","post":"His comfort zone is of course with those who have little or no knowledge of the shroud or scriptures.And he of course cannot debate the findings of the scientist and researchers because he conveniently believes in them.They (being scientist) cannot take the luxury of claiming the burial cloth is authenticly that of Christ…whether they personally believe it is or not…because they are still intrigued and bound in trying to explain how this image came to be. This art historian is a typical opportunist and is clearly exploiting these findings to serve his own best interest….money. So they (the disciples) went into the tomb and discovered the barely noticible and faint image of Christ on the cloth.They were then so intrigued by it that they went against Jewish burial customs and law to disrespectfully kick or put the body of Christ to one side and use the shroud to found one of the greatest religions in the world.And all based solely on the “idea” of a “spiritual” resurection and not a “physical” one. This guy missed his calling…he should have been a lawyer..","date":"2012-05-15","mins":"2:47 pm","url":"https://shroudstory.com/2012/05/15/interview-with-thomas-de-wesselow/","cat":"history","title":"Interview with Thomas de Wesselow"},{"id":"comment-9580","author":"john","post":"“So take that Christians” !!! Take what ??? The fact that you’ve got an axe to grind with Christianity…or the fact that you’ve got to be the most ill informed or ignorant person to date making comments concerning the shroud.Before accusing others of being asleep perhaps you better talk to the man in the mirror first…and tell HIM to… WAKE UP !!!.","date":"2012-03-24","mins":"11:04 am","url":"https://shroudstory.com/2012/03/24/someone-who-is-not-a-fan-of-russ-breault-and-the-shroud-of-turin/","cat":"news_&_views","title":"Someone who is not a fan of Russ Breault and the Shroud of Turin"},{"id":"comment-9752","author":"john","post":"Facts… mixed with rubbish and a vivid imagination..","date":"2012-03-29","mins":"12:28 pm","url":"https://shroudstory.com/2012/03/29/press-center-for-the-sign-by-thomas-de-wesselow/","cat":"books","title":"Press Center for The Sign by Thomas de Wesselow"}]
