[{"id":"comment-34685","author":"emmett","post":"I concur. I too am a Catholic and have been since I was about 7 yrs. Old. I am 72 years old now but do not attend church, I live in a board/care home and have Neuropathy in both lower legs and feet. I do not drive and do very little walking. I had a Priest come and visit me some time back. I say the Rosary at least once a day and each Sunday someone from the local church comes out to the home and gives me Holy Communion. The first time I saw the photo of the Shroud I was taken aback and looked at it very intently. It was as though it was telling me that it was the Risen Christ. It has been my belief since then..","date":"2013-05-24","mins":"7:39 pm","url":"https://shroudstory.com/2013/05/24/an-atheist-going-to-a-heaven-he-doesnt-believe-in/","cat":"news_&_views","title":"An Atheist Going to a Heaven He Doesn’t Believe In"},{"id":"comment-34668","author":"emmett","post":"I am not the owner of a dead body yet. I have a soul like all earth people but I have no idea of what transpires in the moments after a person “passes away” and what decisions they can make with what they are suddenly aware of the situation that the soul finds itself facing (right after the death of the body). What happens there ?????.","date":"2013-05-24","mins":"4:49 pm","url":"https://shroudstory.com/2013/05/24/an-atheist-going-to-a-heaven-he-doesnt-believe-in/","cat":"news_&_views","title":"An Atheist Going to a Heaven He Doesn’t Believe In"},{"id":"comment-35385","author":"emmett","post":"What do the men of that era look like in a painting from that time frame?? If my memory holds true, they have a look of what is considered today to be “long haired”. They did not look like they came out of a Barber Shop after receiving – not a short cut but a regular cut. Of course if they were bald then they were bald. Men had long hair but not as long as women usually wore theirs..","date":"2013-05-30","mins":"4:18 pm","url":"https://shroudstory.com/2013/05/30/how-can-you-argue-with-this/","cat":"other_blogs","title":"How can you argue with this?"}]
