[{"id":"comment-29713","author":"corneliotel","post":"El SUDARIO DE OVIEDO, 83×53 cm, está bien documentado desde el siglo VII d.C, y estando lleno de manchas de sangre de distintas intensidades y tonos es un buen ejemplo para establecer comparaciones. Carlos Otal.","date":"2013-04-06","mins":"10:26 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29397","author":"corneliotel","post":"“ASSESSED URINARY LEVELS OF HYDROXYPROLINE 24, 48 AND 72 HOURS AFTER MAXIMAL STRECHING EXERCISE”. Rafaella.Bauerfeldt1.Antonio J.Luque Rubia2 José Villegas García…y otros. The purpose of this study was to investigate the degree of catabolism of collagen as measured by levels of urinary excretion of hydroxyproline (HP) after static stretching exercise. Study participants were 37 firefighters from the 1st GMAR of the State of Rio de Janeiro of the male gender, who are doing regular physical training, = + 29 years old, divided into two groups: control group (n = 17) which has not undergone any type of intervention and the experimental group (n = 20) which was submitted to static stretching exercise. As a methodological procedure was performed 4 urine samples for each individual. The first collection was performed before the procedure to verify the level of HP as reference of the sample group (basal). The second, third and fourth collections were performed 24h, 48h and 72 hours after stretching static, with a fasting of 12 hours before sampling. For the determination of urinary levels of HP,was used Clin Rep (complete kit for hydroxyproline in urine) by the method colorimetric. The results found on the levels of HP: Δ basal 24h=1,99 mg/24h. ; Δ 24h 48h= 9,01 mg/24h ; Δ 48h 72h= – 9,90 mg/24h e Δ Basal 72h= 1,09 mg/24h. For the results it is concluded that there was a difference in the concentrations of HP between the baseline and 24h (p = 0,001 <0.05), with a significant increase in 48h (p = 0,001 0.05), matching it to the original level of the basal time, thereby determining that HP may be a biochemical index in the process of tissue repair and remodeling after exercise. —————————————————————————————————————– Mi mal inglés no me permite seguir con “claridad” varios aspectos del debate. En Jesús se daban todas las circunstancias que hacían posible un DIC,no he tenido acceso al trabajo de Bergeron que debe ser interesante: Bergeron JW (2011).The crucifixion of Jesus Review of hypothesized mechanisms of death and implications of shock and trauma induced coagulopathy. J. Forensic Legal Med.19, (3):113 116. Además de todo ello, con DIC o sin DIC, es muy posible que la CELULOSA del lino haya jugado un muy importante papel como “factor de coagulación”: Másová L, Rysavá J, Krízová P, Suttnar J, Salaj P, Dyr JE, Homola J, Dostálek J, Myska K, & Pecka M (2003). Hemostyptic effect of oxidized cellulose on blood platelets. Sbornik lekarsky, 104 (2), 231 6 PMID: 14577133 Krízová P, Másová L, Suttnar J, Salaj P, Dyr JE, Homola J, & Pecka M (2007). The influence of intrinsic coagulation pathway on blood platelets activation by oxidized cellulose. Journal of biomedical materials research. Part A, 82 (2), 274 80 PMID: 17274026 Carlos Otal.","date":"2013-04-04","mins":"5:44 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-13865","author":"corneliotel","post":"Si Colin consigue reproducir manchas de sangre, alguna con halo de suero, de manera similar a las que aparecen en la Sábana Santa, habrá realizado el MEJOR TRABAJO realizada hasta ahora sobre la Sábana. ¡Inténtelo, Colin!. Vale cualquier método. Otros estudiosos lo han intentado durante muchos años..","date":"2012-07-15","mins":"11:15 am","url":"https://shroudstory.com/2012/07/15/why-not-carbon-date-the-blood-on-the-shroud-of-turin/","cat":"blood_studies","title":"Why not carbon date the blood on the Shroud of Turin?"},{"id":"comment-14346","author":"corneliotel","post":"Colin Berry ha ido EVOLUCIONANDO, empezó quemando las telas con planchas de metal caliente y ahora, poco tiempo después, mantiene la hipótesis de la quemadura por LUZ. ¡ ja, ja, ja, ja !. ¡Colin terminará siendo defensor de la autenticidad de la Sábana! Estoy en ese punto, la quemadura por LUZ, de acuerdo con Colin Berry. Hay que tener mucho cuidado con la utilización de las palabras, asociar la palabra quemadura (SCORCH) sólo con ALTA TEMPERATURA es una fuente de ERROR. Una quemadura es una oxidación deshidratación y existe la oxidación deshidratación producida por CALOR (alta temperatura), la oxidación deshidratación producida por FRIO (baja temperatura), la oxidación deshidratación por una sustancia química QUÍMICA ( sin tener relación con la temperatura)……..y otras probables maneras. Di Lazzaro obtiene la oxidación deshidratación de la fibrilla del lino mediante luz ultravioleta al parecer sin aumento apreciable de la temperatura. [“Yo soy la luz del mundo; el que me sigue, no andará en tinieblas, sino que tendrá la luz de la vida”. Juan 8.12: ] Carlos.","date":"2012-07-30","mins":"9:26 pm","url":"https://shroudstory.com/2012/07/30/sometimes-just-sometimes-colin-berry-talks-sense-but-but-but/","cat":"blood_studies","title":"Sometimes, just sometimes, Colin Berry talks sense. But. But. But."},{"id":"comment-14285","author":"corneliotel","post":"¡Congratulations, Yannick! Daveb, es una “desmaterialización rematerialización”, probablemente instantánea en el tiempo que eludiría el “burst” de energía……..","date":"2012-07-28","mins":"9:23 pm","url":"https://shroudstory.com/2012/07/28/yannick-delights-with-another-great-paper/","cat":"blood_studies","title":"Yannick Delights with Another Great Paper"}]
