[{"id":"comment-15030","author":"corneliotel","post":"Lo he contado ya hace unos días en el blog de Dan, ahora lo cuento en el mío http://lasabanaylosescepticos.blogspot.com.es/ Cualquiera que haya sido el mecanismo de formación de la imagen, natural o sobrenatural, de naturaleza física o de naturaleza química, la imagen es posible (y muy probable) que haya tenido un periodo de latencia de meses, años e incluso siglos. Tanto los experimentos del ENEA con radiación UV (hipótesis física), como la “para mi improbable” reacción de Maillard propuesta por Rogers (hipótesis química) contemplan periodos de latencia en la aparición del COLOR. ¿Siglos? Incluso la propuesta excéptica lo contempla; para el profesor de química Luigi Garlaschelli, para quien la imagen fue en principio una PINTURA, las impurezas ácidas acompañantes del pigmento ocre rojo con el que se pintó la imagen serían las responsables de la oxidación deshidratación de las fibrillas del lino que proporcionan el color amarillo de las fibras que configuran la imagen ACTUAL, que sería muy distinta de la pictórica original. ¿Qué cabría esperar de una imagen que hubiera tenido un periodo de latencia de siglos? – Una Sábana que no mostraría imagen en principio, sino sólo las manchas de sangre. – La cabeza y el rostro sería lo primero en ser reconocible al cabo de unos siglos en tanto el resto de la figura no sería todavía interpretable como tal figura corporal, (sólo una imagen del rostro producto del sudor y de la sangre de un Jesús vivo) aunque se iría abriendo la idea de que la gran mancha de sangre sería consecuencia de la lanzada en el costado y se relacionaría con las otras manchas de sangre de la Sábana. (no hay elementos de juicio para sospechar que los ojos están cerrados) Las primeras interpretaciones no habrían pues relacionado la sábana con una mortaja funeraria al no ser reconocible la figura corporal, ya que sólo después del año mil, y ya en Constantinopla toda la imagen TERMINARÍA siendo visible y siendo reconocible como mortaja funeraria, la Sábana de Constantinopla. Bajo esta óptica, una imagen latente que tardó varios siglos en empezar a ser visible y varios siglos en completarse, las contradicciones entre las diversas narraciones parecen ya no ser tales y se entendería perfectamente la evolución de la iconografía al respecto con anterioridad al 1350. Carlos Otal.","date":"2012-08-15","mins":"6:34 pm","url":"https://shroudstory.com/2012/08/01/answers-to-many-questions-about-the-fold-marks-on-the-shroud/","cat":"history","title":"Answers to Many Questions About the Fold Marks on the Shroud"},{"id":"comment-9342","author":"corneliotel","post":"Dan, hay un fenómeno MUY curioso que describió hace algunos años un comentarista de nick Tony. Solicitó ayuda pero sólo obtuvo burlas. Se produce en las pantallas de los ordenadores portátiles, ignoro si son TFT o LCD (entiendo muy poco de ordenadores). El portatil mío es un HP Pavilion de 17 pulgadas y tendrá 6 o 7 años (ignoro si en los modernos se produce el fenómeno). Si observamos el rostro del Hombre de la Sábana ( por ejemplo el “Face only vertical” en el Shroud Scope de Mario Latendesse) y vamos inclinando la pantalla del ordenador hasta el máximo y luego el propio ordenador, vamos como la imagen pasa del negativo al positivo ( o viceversa) paulatinamente, “como si” se fueran SELECCIONANDO por CAPAS las intensidades tonales permitiendo observar MEJOR detalles que pasan inadvertidos. El fenómeno, además de BELLO, creo que merecería atención por parte de los que entienden del tema (pantallas de ordenadores).","date":"2012-03-15","mins":"9:36 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”"},{"id":"comment-9344","author":"corneliotel","post":"Me he tenido que volver a “loguear” y ahora aparezco como “corneliotel Soy “co”, Carlos Otal.","date":"2012-03-15","mins":"9:39 am","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”"},{"id":"comment-9404","author":"corneliotel","post":"Muy interesante, Max..","date":"2012-03-17","mins":"4:54 pm","url":"https://shroudstory.com/2012/03/14/nonsense-of-the-day-comments-on-banding-maybe-jesus-looked-different/","cat":"history","title":"Nonsense of the Day: Comments on “Banding: Maybe Jesus Looked Different”"},{"id":"comment-14256","author":"corneliotel","post":"La PRIMERA imagen de Jesús “loin Cloth” es del año 420 430, como muestro en mi blog: http://lasabanaylosescepticos.blogspot.com.es/2009/03/la lanzada en el costado 1.html Carlos.","date":"2012-07-26","mins":"6:50 pm","url":"https://shroudstory.com/2012/07/17/paper-chase-all-sorts-of-papers/","cat":"history","title":"Paper Chase: All sorts of papers"},{"id":"comment-14680","author":"corneliotel","post":"Gabriel: a. Las 36 48 horas post morten ( probablemente menos horas) marcan el límite en que la Sábana comenzaría a impregnarse por los líquidos de la DESCOMPOSICIÓN, lo cual no se observa en la Sábana. B. Creo que Rogers pensaba en una reacción de Maillard de inicio MUY RÁPIDO, con temperatura corporal muy alta y aminas pesadas MUY PRECOCES (cadaverina y putrescina): “The bodies are quite dry as a result of the hyperthermia. Many bodies are found at high temperature in closed automobiles or lying on the desert in the sun. Materials that are stable at normal room temperatures (about 22°C) can react rapidly at 41 43°C. Many simple chemical processes double (or even triple) their rates for each 10°C (18°F) increase in temperature. A dehydration type of reaction could be expected to be about three times faster at normal body temperature than at room temperature and four to nine times faster at about 41°C.” “Scientific method applied to the Shroud of Turin. A review”Raymond N. Rogers* and Anna Arnold y “The sample was then treated for 10 minutes with ammonia vapour: a very light colour could be observed on the top surface after standing 24 hours at room temperature. To increase the reaction rate, a sample was treated at 66 ºC for a few minutes (Figure 2 above). In these conditions the development of colour is very clear and the most intense colour appears in the ring on top. Some colour appears around the ring on the back surface; however, the centre of the back is nearly white.” “The Shroud of Turin: An Amino Carbonyl Reaction (Maillard Reaction) ” Rogers, Arnoldi c. Pienso que Rogers NO SABÍA como INTERRUMPIR de manera NATURAL su reacción de Maillard. ( ya he comentado tiempo atrás que no se dan las circunstancias apropiadas en el Hombre de la Sábana para una reacción de Maillard). Creo haber leído lo que indica Dan, pero no recuerdo en dónde. Las objeciones a esa hipótesis parecen elementales: NO HAY AGOTAMIENTO de sacáridos reactivos. Sólo 1 a 3 fibrillas por hilo están afectadas por el color ¡POR CADA HILO AFECTADO POR EL COLOR!, por lo que quedarían INFINIDAD de fibrillas CON RECUBRIMIENTO de polisacáridos reactivos que NO HAN SIDO AFECTADAS. NO HAY DISMINUCIÓN de aminas reactivas, por el contrario su concentración va aumentando. Carlos Otal.","date":"2012-08-09","mins":"7:26 pm","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?"},{"id":"comment-14739","author":"corneliotel","post":"Yannick: Ya he comentado en muchas ocasiones que no se dan en el Hombre de la Sábana las circunstancias apropiadas para una reacción de Maillard….. Y por el momento es una hipótesis NO demostrada el que en el tejido de la Sábana se encuentre el revestimiento de sacáridos reactivos necesarios para esa reaccción. Pero la finalidad de mi comentario, yo soy “perro viejo”, era que el LECTOR tuviera una idea clara de QUÉ SE ESCONDE detrás de cada propuesta, en este caso qué se esconde tras la hipótesis de la reacción de Maillard. Suponía cúal era el pensamiento de Rogers y me alegra el que usted me lo confirme. [Quote from Carlos : “ To the Rogers proposal be scientific, the Maillard reaction would have been interrupted suddenly by the withdrawal or the theft of the corpse of Jesus within 36 48 hours of their stay in the Sepulchre.” My answer : Effectively, that’s what Rogers was assuming with his hypothesis, with the exception of one thing : The assumption of the maximum time before the body had to leave the Shroud is in fact 72 hours instead of 36 48 hours, because many studies have showed that the liquid phase of putrefaction can start between 36 to 72 hours, DEPENDING ON MANY FACTORS. In page 116 of his book, Rogers say : “Vass et al. Also report that putrefaction (structural degradation) starts between 36 and 72 hours after death…” And he add : “Perhaps we can assume that the cloth could not have been in contact with the body for more than about three days.”] El científico honesto no debe dejarse influenciar por ningún aspecto religioso, Delage fue un magnífico ejemplo, y Rogers honestamente manifestó que su hipótesis NO JUSTIFICABA la imagen corporal, sino tan sólo el COLOR de la fibrilla afectada en su recubrimiento de impurezas. Una reacción de Maillard que NO parece ser viable y que NO justifica la imagen. Si la formación de la imagen se debiera a la reacción de Maillard propuesta por Rogers: 1. El Hombre de la Sábana ( Jesús de Nazaret) NO HABRÍA RESUCITADO, su cuerpo habría sido retirado o robado. 2. Los Evangelios contarían GRANDES MENTIRAS ( apariciones de Jesús, ascensión, etc, etc). 3. El Cristianismo se basaría pues en una GRAN MENTIRA. Para ser la reaccion de Maillard una hipótesis que NO justifica la imagen , admitirla como válida resulta bastante MÁS DAÑINA al pensamiento cristiano que las hipótesis de los ADVERSARIOS de la Sábana, Mc Crone, Nickell, Garlaschelli, Lombatti etc, etc, o que los resultados de la datación por el C14, ya siendo la Sábana una falsificación medieval, no afecta a aquellas cosas que son los pilares de la Fe cristiana. ¿Comprenden los lectores? Carlos Otal..","date":"2012-08-10","mins":"7:25 pm","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?"},{"id":"comment-13290","author":"corneliotel","post":"Todo esto suena a PATALETA escéptica ¡ja, ja, ja..! Los científicos favorables a la autenticidad de la Sábana son siempre “pseudo científicos”, carentes de formación académica, hacen mal las cosas…¡ja, ja ja…! ¡Y esto suelen decirlo los escépticos que CARECEN de formación científica generalmente ! Escribía William Meacham en 1983: “Beyond misunderstanding lies invective, and the comments of Cole, Nickell, Schafersman, and Mueller are phrased in an emotive tone not conducive to reasoned discussion. They bristle with intemperate rhetoric: “gullibility,” “credulous bias,” “notoriously subjective,” “sheer whimsy,” “blatant example of human credulity,” “conceit,” and “so called evidence,” to mention but a few examples. Doubts about personal competence or expertise emanate from Schafersman (graduate student) and Nickell (English instructor) like stones from inside a glass house: Frei’s work is “questionable,” STURP members may be pseudo scientists, Heller and Adler are “nonforensic scientists,” Filas and Whanger “nonexperts,” and Bucklin and Gambescia “religious devotees of the ‘relic.’ ” Those with views supporting the skeptics are mirabile dictu described in lavish terms: the Turin Commission consisted of “forensic experts;” Mc Crone is “probably the best known forensic microbiologist in the world” and “a distinguished expert”; Baden is not only “one of America’s foremost medico legal experts,” but “one of the world’s most distinguished pathologists.” Naturally, the former group are subject to a pro authenticity bias, make “subjective inferences,” and find “artifacts of their own hopes,” whereas the latter conduct “impressive analyses” and make discoveries and “positive identifications.” I leave it to the reader to decide whether this is the type of rhetoric usually associated with a carefully reasoned argument, not to mention a “powerful case.”” Yo no soy un científico, pero soy médico y TENGO una formación científica y un “curriculum vitae” bastante envidiable, que abarca entre otras muchas cosas desde la medicina clinica hasta la docencia como profesor universitario. Creo que teniendo en cuenta el GRAN NÚMERO de médicos que HABIENDO ESTUDIADO la Sábana están convencidos de su autenticidad ( la opinión SIN ESTUDIAR tiene un valor nulo), debo llegar a la conclusión de que hay que ser MUY ESTÚPIDO ( me refiero a NOSOTROS LOS MÉDICOS) para dejarse ENGAÑAR por la pretendida impronta de un ser humano ¡que es una falsificación!. Una profesión, la Medicina, llena de estúpidos ignorantes que no distinguen una impronta humana de una falsificación pictórica o realizada con una escultura….¡ ja, ja, ja…! Desde que la Sábana Santa “entró” en el estudio científico de mano del Profesor Delage en 1902, médico, zoólogo, Profesor de Anatomía Comparada en la Sorbona, miembro de la Academia de Ciencias de París y acreditado agnóstico, numerosísimos profesionales de la Medicina se han sentido atraídos por ella. He confeccionado una relación de médicos ilustres, muchísimos de ellos catedráticos o profesores de Universidad, que avalan la concurrencia en el Hombre de la Sábana de aspectos médicos que no son reproducibles por vía del arte, que corresponden a la existencia real de un ser humano que ha tenido contacto con la Sábana, que ha dejado en ella las huellas de su sangre y que por una vía que escapa al conocimiento actual de la Ciencia, ha dejado impresa en ella la impronta de SU imagen. Indico en muchos de ellos algún trabajo relevante para una mejor identificación por el lector. Accetta A. Nuclear Medicine and its relevance to the Shroud of Turin. Baima Bollone.P. The Shroud under the microscope: Forensic examination Ball DA. The crucifixion and death of man called Jesus. Barbet P. La Passion de Jésus Christ selon le chirurgien. Belcet F, Filippa Borrono Bona, Manfredi, Mattio. Riflessioni del chirurgo sull ferita toracica. Bucklin R. An autopsy on the Man of the Shroud. Brillante C. La fibrinolisi nella genesi delle impronte sindoniche. Davis CT. The crucifixion of Jesus: the passion of Christ from a medical point of view. Delfín Villaláin J. Estudio de la rigidez cadavérica que presenta la Sábana de Turín. Canale M. Rilievi e considerazione sul DNA presente sulla Sindone. Caminals A. Estudio de la crucifixion según la Sábana Santa. Cappi M. La Sindone dalla A alla Z. Cinquemani N, Cicchetti S. Le dopple immagini sulle mani dell´Uomo della Sindone. Coppini L. Le lesione da punta ed il colpo di lancia visibili sulla Sindone. Rilievi di anatomia topografica e radiologica. Dellesite G. Cause fisiche della morte della Sindone: medicina e certezze. Domínguez J J. La Síndone. Estudio médico. Edwards WD. On the physical cause of death of Jesus. Fiori R. La lesioni da inchiodamento ai piedi dell´Uomo della Sindone. García Blazquez M. La búsqueda científica de Dios. Garza Valdes L. Wood remnants in the blood of the occipital region of the Man on the Shroud of Turin. Gilly R. La Pasión de Jesús. Conclusiones de un médico. Giraud F. Le Saint Suaire, étude medicale et scientifique. Goldoni. Estudio hematológico sobre las muestras del Sudario tomadas en 1978. Guillaud Vallee O. Position en opposition du ponce chez l´homme du linceoul étude critique des travaux de Barbet. H. Ur Rerhman. Did Jesus Christ die of pulmonary embolism? a rebuttal. Hynek R W. Lo que revela el Sudario a un convertido. Huisman H. The Holy Shroud of Turin. Injury of the right eye. Judica Cordiglia G. L´Uomo della Sindone e il Gesu dei Vangeli? Larato G. L´ignominiosa flagellazione secondo la Síndone: rilievi di fisiopatologia clinica. Le Bec A. The death of the cross: a physiological study of the passion of Our Lord Jesus Christ. Legrand A. Du Gibet du Golgotha a ceux de Dachau. Lavoie G. Forensic studies of the blood marks on the Shroud of Turin. Lévêque J. Le Saint Suaire revisité. Lorente J A. Examen forense al cuerpo de Jesús. Mérat P. The nailing of the feet on the Cross. Milanesio A. Le lesioni da inchiodamento agli arti dell´Uomo della Sindone. Novelli G. La Síndone un caso ancora aperto. Palacios Carvajal J. La Sábana Santa.Estudio de un cirujano. Puorrat O. The localization of the chest wound on the right side. Revidatti D. Anatomía de la Crucifixión. Las manos. Rodante S. Medico necroscopic enquiry of wounds from the crowning with thorns on a medieval painting. Comparison with corresponding image on the Shroud. Rubén Darío Camargo R. Fisiopatología de la muerte de Jesucristo. Thibault Heimburger, Le Suaire et la Science. Signorini R. Alla ricerca della prova provata. Suárez Lledó Alemany J. Informe médico legal sobre el Sudario de Oviedo y la Síndone de Turín. Solas J. Blood stains on the Shroud.Distinctive characteristics. The problem of their transfer. Truman D. The crucifixión of Jesús. The passion of Chris from a medical point of view. Whanger A. Radiological aspects of the Shroud of Turin. Wilkinson J. The physical cause of the death of Christ. – Barragán Jain, Caselli, Cameron, Clerq J M, De Vicentiis, Delgado Roig, Gambescia J, Igartus, Jewell H J, La Cava, Lagraña R, Liébana J, López Gómez L, Marchand, Michel W, Morano H, Novelli, Notowski, Pugeaut R, Sáez Rodriguez, Sava Anthony , Stroud Willian, Terraes A, Tarantini D, Valdés, Wasenar R, Willis D. Representan tan sólo la “punta del iceberg”, pues son un sinfín los médicos profesionalmente muy bien acreditados, entre los que me cuento, los que hemos reconocido en la figura del Hombre de la Sábana, cruelmente martirizado, todas las características propias de un ser humano que la Sábana envolvió, Jesús de Nazaret..","date":"2012-07-01","mins":"1:59 pm","url":"https://shroudstory.com/2012/07/01/sindonology-oh-what-an-awful-word/","cat":"history","title":"Sindonology: Oh, what an awful word?"},{"id":"comment-27809","author":"corneliotel","post":"El angel tiene 6 dedos ( 5 dedos se ven + 1 dedo pulgar que está oculto). Carlos Otal.","date":"2013-03-19","mins":"1:29 pm","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","title":"The Curious ‘a’ in the Hungarian Pray Manuscript"},{"id":"comment-13220","author":"corneliotel","post":"” He is often aware that experts have refuted some of his claims, but refuses to change his mind – because these experts are generally not very inspiring to him.” ¿Qué expertos?..","date":"2012-06-30","mins":"12:44 pm","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","title":"Wilson the Exoheretic. What? Yes, Exoheretic."}]
