[{"id":"comment-12497","author":"corneliotel","post":"Summary. — The first goal of this inquiry, carried out on sources of the history of Christic relics, was to discover those among them which might involve the Shroud of Turin, notably so as to fix the vocabulary used. It has thus been established that the frequent identification of the Shroud of Turin with the Mandylion coming from Edessa in Constantinople in 944 was impossible, the two relics being simultaneously conserved in Constantinople from an unknown date on, perhaps from the 11th c. On. Later testimony describing the image on the Mandylion as being of a body and not just of a face rely on an erroneous interpretation of a Latin text, oft repeated at the end of the Middle Ages. The texts (in Latin and in Greek) are cited within a context wide enough to clarify their meaning, and they are translated. They attest the presence of the shroud at Constantinople before 1204. Emmanuel Poulle, Les sources de l’histoire du linceul de Turin. Revue critique Revue d’Histoire Ecclésiastique, 2009/3 4.","date":"2012-06-15","mins":"4:12 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"id":"comment-12249","author":"corneliotel","post":"¡La desinformación de que hacen gala los escépticos es patética! ¿De dónde salen los 40 ” burial cloths of Jesus”? El escéptico italiano Antonio Lombatti se refiere al canónigo Ulysse Chevalier, historiador de la Iglesia más conocido por el hallazgo del “Memorandum DÁrcis” (documento no firmado, no sellado y no fechado atribuido al obispo Pierre DÁrcis, y que Chevalier dató en 1389 porque así le convenía). Ulysse Chevalier escribía en su obra “Le st. Suaire de Lirey Chambéry Turin et les défenseurs de son authenticité”, p.10. A.Picard et fils, 1902: “Le nombre des suaires connus atteint la quarantaine: je laisse a M. De Mély le soin de donner une description de chacun d´eux et d´indiquer les autorités qui attestent son existence.” No eran pues 40, sino 38 los sudarios… como aclara el escéptico Maurice Vernes en la famosa “Controversia de París de 1902”, Revue scientifique, n° 20 du 17 mai 1902, pp. 613 623: “L’abbé Ulysse Chevalier, fort compétent en la matière, a énuméré dix neuf localités où étaient conservés, soit le linceul du Christ en son entier, soit de très notables portions du drap funéraire. Un archéologue de valeur, M. F. De Mély, est en mesure, pour sa part, d’en citer dix neuf autres ; un petit nombre sont porteurs d’effigies ou empreintes, notamment celui qu’on exhibait jadis à Besançon et qui a disparu lors de la Révolution.” [ La “Controversia de Parí de1902” entre Maurice Vernes y Paul Vignon, con una carta al director de Ives Delage ha sido editada por Dominique Autié (q.p.d), es muy interesante pues se plantea la que será a partir de entonces la postura ESCÉPTICA respecto a la Sábana de Turín http://blog dominique.autie.intexte.net/blogs/index.php/2006/04/16/title 9 De los 19 “sudarios” que estudió Chevalier solo merecieron su atención 2: – la Sábana de Cadouin ( que no tenía ninguna IMAGEN). – la Sábana de Besançon que está documentada desde 1523 (copiada probablemente de la de Lirey y que mostraba sólo la imagen frontal). De los 19 “sudarios” que citó el arqueólogo M. De Mély, Ulysse Chevalier no valoró ninguno. Escribía el escéptico Maurice Vernes en 1902: “Parmi les nombreux linceuls du Christ qui ont été vénérés en Europe, celui de Turin, en raison des empreintes qu’il porte, a donné lieu à un rapprochement avec une pièce d’étoffe également désignée à l’attention par la présence d’une effigie, le suaire jadis conservé à Constantinople.” Es justamente y precisamente la excepcionalidad de la presencia de la IMAGEN CORPORAL en una pretendida mortaja de Jesús lo que distingue a la Sábana de Turín, al igual que siglo y medio antes había sucedido con la Sábana de Constantinopla, y justa y precisamente esa excepcionalidad la que apunta a su misma identidad. La que hoy conocemos como Sábana Santa. Los escépticos MODERNOS han distorsionado lo escrito por Ulysse Chevalier. Si el señor Chevalier, Mély o quien fuera hubieran propuesto en 1902 la existencia conocida de cuarenta sudarios, enteros o fragmentarios, no pueden estar fuera del listado de los conocidos en el año 2012 , y NO es conocida la existencia en la Edad Media de sudarios que pretendieran ser la mortaja de Jesús y tuvieran la imagen corporal de Jesús, a excepción de los apuntados, Constantinopla y Turín..","date":"2012-06-12","mins":"6:26 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"id":"comment-12561","author":"corneliotel","post":"Menedemo, Poulle estima en efecto que las 2 reliquias son DIFERENTES. Yo no he estudiado el tema y no tengo por lo tanto un criterio propio. Le sugiero la lectura de: http://www.suaire turin.com/skylitzesyl.htm.","date":"2012-06-15","mins":"5:33 pm","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"id":"comment-12305","author":"corneliotel","post":"Max, entre 1205 y 1308 el ducado de Atenas (tras el saqueo de Constantinopla por los cruzados) fue gobernado por la familia La Roche: Otón de la Roche (1205 1225) Guido I de la Roche (1225 1263) Juan I de la Roche (1263 1280) Guillermo I de la Roche (1280 1287) Guido II de la Roche (1287 1308).","date":"2012-06-12","mins":"11:44 am","url":"https://shroudstory.com/2012/06/12/quote-for-today-lombattis-shout-down-from-the-ivory-tower/","cat":"news_&_views","title":"Quote for Today: Lombatti’s Shout Down from the Ivory Tower"},{"id":"comment-12112","author":"corneliotel","post":"¿Top Secret? ¿Cúal es esa ” unpublished information”? ¿Nadie conoce esos contenidos de “The Night of the Shroud”?.","date":"2012-06-09","mins":"11:03 am","url":"https://shroudstory.com/2012/06/09/barrie-schwortz-writes-2/","cat":"news_&_views","title":"Barrie Schwortz writes"},{"id":"comment-28696","author":"corneliotel","post":"El Prof. Giulio Fanti sabe bien lo que hace……y es un RETO a Turín. Turín tiene suficiente “material” recogido de la Sábana para poder REPETIR los estudios de Fanti sin necesidad de “tocar” la Sábana. ¿Realizará Turín los estudios ? Nooooooooooo……. Carlos Otal.","date":"2013-03-29","mins":"5:41 am","url":"https://shroudstory.com/2013/03/29/barrie-schwortz-biggest-issue-so-far-seems-to-be-the-validity-of-fantis-samples/","cat":"news_&_views","title":"Barrie Schwortz:  Biggest issue so far seems to be the validity of Fanti’s samples"},{"id":"comment-9432","author":"corneliotel","post":"La teoría de la conspiración fue favorecida por la actitud y declaraciones de los responsables de los propios laboratorios…… El laboratorio de Zurich preparó para la BBC un montaje fotográfico IMPOSIBLE mostrando las muestras y submuestras que fueron datadas. Aunque se conocía por la descripción que de él hizo Bonnet Eymard cuando se lo mostró el Prof: Woelfli que lo tenía en su despacho, la foto no fue publicada hasta el 2005 por ETH Life International, newsletter del Swiss Federal Institute of Technology Zurich, al que pertenece el laboratorio que dató la Sábana por el C14. Http://archiv.ethlife.ethz.ch/e/articles/sciencelife/turin.html Las 3 submuestras Z1.1.1, Z1.1.2 y Z1.1.3 NO PUEDEN PROCEDER de la muestra Z1.1 (entre otras varias cosas la “raspa” de la “espina de pez” típica del tejido y que aparece en Z1 y en Z1.1, tenía que aparecer en alguna de las 3 submuestras que se “quemaron”……) Si alguien conoce la SOLUCIÓN del puzzle, probablemente Colin, que la explique……. Y si hay ERRORES, que no se han reconocido, en algo tan simple como realizar ESE montaje fotográfico para la BBC, cualquiera sabe qué fue lo que se “quemó”…… [El Prof. Hull, del laboratorio de Arizona nos sorprendió a todos hace poco tiempo al decirse poseedor de una submuestra que según Nature estaba “quemada” (DATADA)].","date":"2012-03-18","mins":"7:12 pm","url":"https://shroudstory.com/2012/03/17/welcome-to-colin-berrys-new-straw-shedder-blog/","cat":"other_blogs","title":"Welcome to Colin Berry’s new Straw Shedder blog"},{"id":"comment-11464","author":"corneliotel","post":"Pregunta para colinsberry, experto en Industria Alimentaria: ¿ Inhiben las cifras altas de ácido láctico la producción de vapores de amoniaco y de aminas aromáticas (cadaverina y putrescina)?. Gracias por la respuesta. Carlos Otal..","date":"2012-05-20","mins":"8:41 am","url":"https://shroudstory.com/2012/05/20/the-valencia-dawkins-challenge-no-consensus-on-consensus/","cat":"challenge","title":"The Valencia Dawkins Challenge:  No Consensus on Consensus"},{"id":"comment-11466","author":"corneliotel","post":"+ a.lactico—— INHIBIT———vapor amoniaco, cadaverina, putrescina, etc etc (Gracias Dan).","date":"2012-05-20","mins":"9:32 am","url":"https://shroudstory.com/2012/05/20/the-valencia-dawkins-challenge-no-consensus-on-consensus/","cat":"challenge","title":"The Valencia Dawkins Challenge:  No Consensus on Consensus"},{"id":"comment-14637","author":"corneliotel","post":"A. Yannick CONFUNDE a los lectores: Para ser CIENTÍFICA la propuesta de Rogers, la reacción de Maillard tendría que haber sido INTERRUMPIDA BRUSCAMENTE por la RETIRADA o el ROBO del cadáver de Jesús antes de las 36 48 horas de su permanencia en el sepulcro. De no interrumpirse bruscamente la reacción de Maillard, la “imagen” habría sido una gran MANCHA INFORME por la acción de los productos de la DESCOMPOSICIÓN y la PUTREFACCIÓN del cuerpo de Jesús. B. Yannick SE CONFUNDE: Yannick dice ADMITIR la resurrección de Jesús, la “desmaterialización” del cuerpo de Jesús antes de las 36 48 horas de su permanencia en el sepulcro. Yannick dice admitir la INTERRUPCIÓN SOBRENATURAL de la reacción de Maillard ( la reacción propuesta por Rogers). La hipótesis de una interrupción SOBRENATURAL de la reacción de Maillard NO ES CIENTÍFICA. C. Yannick debe APRENDER a ser coherente. La hipótesis de Rogers es CIENTÍFICA si se interrumpe por un medio NATURAL la reacción de Maillard. [lo que NO SIGNIFICA que sea cierta] La hipótesis de Yannick es NO CIENTÍFICA ( interrupción de la reacción de Maillard por la Resurreción ). D. Siendo la Sábana Santa un OBJETO FÍSICO REAL, todo científico que estudie los posibles efectos sobre la Sábana Santa de reacciones “químicas” ( sea Rogers o sea Garlaschelli, etc) o de reacciones “fisicas” ( sea Fanti, Di Lazzaro, Antoacci o el que fuera), será un BUEN científico o será un MAL científico en razón de la METODOLOGÍA que aplique, NO en razón de sus creencias religiosas .Todo científico, creyente o no creyente, sabe que NO EXISTE ninguna energía física o química que pueda RESUCITAR a los muertos. Carlos Otal.","date":"2012-08-09","mins":"12:05 am","url":"https://shroudstory.com/2012/08/07/and-yannick-responds-to-giulios-comments/","cat":"news_&_views","title":"Yannick Reacts to Special Issue"},{"id":"comment-14645","author":"corneliotel","post":"Gabriel: Una vez cesados los procesos de AUTOLISIS, e incluso en ocasiones sin haber cesado, se inician los auténticos fenómenos de DESCOMPOSICIÓN, entre los cuales SÓLO voy a mencionar los que serían RECONOCIBLES en el Hombre de la Sábana: 1. la infiltración gaseosa o enfisema, afectando a párpados y labios. 2. flictenas pútridas, elevaciones de la epidermis con líquido en su interior. 2. desprendimiento de la piel al romperse las flictenas. 4. salida del contenido gástrico por la boca y a veces el intestinal por el ano a consecuencia de la presión gaseosa. Más de 36 48 horas la producción de GAS es máxima, el ENFISEMA es máximo y la piel empieza a soltar un LÍQUIDO NEGRUZCO propio de la putrefacción. La reacción de Maillard es aquí IRRELEVANTE en la producción de una MANCHA INFORME relacionada con la descomposición cadavérica. Carlos.","date":"2012-08-09","mins":"6:18 am","url":"https://shroudstory.com/2012/08/07/and-yannick-responds-to-giulios-comments/","cat":"news_&_views","title":"Yannick Reacts to Special Issue"},{"id":"comment-14650","author":"corneliotel","post":"Colin es un individuo MUY INTELIGENTE…….. Es lástima que milite en el lado “equivocado”, aunque para él sea más divertido. Colin escribe: “How odd that Shroudology showed not the slightest interest in hydroxyproline, except as “evidence” against scorching, despite Rogers himself flagging it up as possibly of animal origin.” Yo también estoy SORPRENDIDO. Colin ha entendido MUY RÁPIDO el GRAN INTERÉS de mi comentario sobre la hidroxiprolina. La presencia de hidroxiprolina en la sangre sería una PRUEBA IMPORTANTÍSIMA de autenticidad, probablemente la MAYOR……. 1. Autenticidad de la SANGRE como sangre humana. 2. Sangre procedente de un SER que fue sometido a un enorme desgaste y estiramiento muscular : a. intensas contracciones musculares por el suplicio del látigo….con muy probables micro lesiones musculares por la acción directa del látigo. B. inicio del transporte del madero de la cruz para el que la fuerza muscular ya no le responde. C. intenso y mantenido estiramiento muscular a consecuencia de la crucifixión. En los años en que escribió Rogers NO se habían realizado estudios sobre la hidroxiprolina en relación a los esfuerzos musculares, estudios desarrollados fundamentalmente en relación con la medicina del DEPORTE y de gran interés sobre todo en la “contracción muscular excéntrica”…….. ¿Será Colin el ÚNICO interesado en el tema de la hidroxiprolina? ¡Ja,ja,ja,ja…..! Carlos Otal.","date":"2012-08-09","mins":"7:30 am","url":"https://shroudstory.com/2012/08/07/and-yannick-responds-to-giulios-comments/","cat":"news_&_views","title":"Yannick Reacts to Special Issue"},{"id":"comment-14604","author":"corneliotel","post":"¡Hidroxiprolina! ¡Un MAGNÍFICO argumento a favor de la AUTENTICIDAD! En el individuo normal, SANO, la hidroxiprolina se encuentra como TRAZAS en el suero sanguíneo, y en mayor cantidad en la orina como hidroxiprolina libre y hidroxiprolina conjugada con péptidos. En el individuo ENFERMO con diversas patologías que aquí no interesan, la hidroxiprolina aumenta en el suero sanguíneo y sobre todo en la orina. ¿Adivinan en qué situaciones AUMENTA de forma considerable la hidroxiprolina tanto en el suero sanguíneo como en la orina? La hidroxiprolina aumenta de manera muy considerable en suero sanguíneo y en orina en los INTENSOS ESTIRAMIENTOS MUSCULARES MANTENIDOS, lo que es bien conocido por la medicina del deporte. – No se me ocurre un ESTIRAMIENTO MUSCULAR MANTENIDO MÁS INTENSO que el proporcionado por 3 horas de CRUCIFIXIÓN. [el pico de hidroxiprolina en la muestra procedente del talón me sugiere “contaminación” por la orina. En el tipo de muerte que sufrió Jesús sería normal la emisión de orina…. Incluso de heces y líquido seminal] – Yo soy médico clínico, sugiero que un médico mejor cualificado que yo en bioquímica de la sangre y la orina como el Dr. Heimburger retome el tema de la hidroxiprolina. Carlos.","date":"2012-08-08","mins":"3:47 am","url":"https://shroudstory.com/2012/08/07/and-yannick-responds-to-giulios-comments/","cat":"news_&_views","title":"Yannick Reacts to Special Issue"}]
