[{"title":"2015:  Shroud of Turin Pilgrimage Plus Holy Land, Rome and Florence","post":"Roll up, roll up. See the $hroud of Turin (reserved viewing)!  But view it simply as an icon, no extravagant claims please…\nResearch update: I think I know how the TS image was (or might have been) made in principle, and am working hard to convert principle to practice. \nClue: a whole-body ‘death mask’  can be re-cast to make a  trough-like bas relief  cast in heat-conducting bronze.  Place the hollow shell-like template face-down onto linen. Half fill with quicklime. Then add water. Wait for steam, then press down into linen. Result: a ‘thermochemical impactograph.’\nThis info is brought to you free of charge..\n\n","date":"July 5, 2014 at 10:24 am","url":"https://shroudstory.com/2014/07/05/2015-shroud-of-turin-pilgrimage-plus-holy-land-rome-and-florence/","cat":"2015","id":"comment-135486","author":"Colin Berry","site":"shroudstory"},{"title":"2015:  Shroud of Turin Pilgrimage Plus Holy Land, Rome and Florence","post":"Some of the sites are probably pure fiction, not supported by NT data, unless they were part of an oral tradition that is now lost.\nWe must not forget about the blood detected on the “icon”, and much will depend on what Kelly Kearse will say at St.Louis.\n\n","date":"July 5, 2014 at 11:12 am","url":"https://shroudstory.com/2014/07/05/2015-shroud-of-turin-pilgrimage-plus-holy-land-rome-and-florence/","cat":"2015","id":"comment-135492","author":"Louis","site":"shroudstory"},{"title":"2015:  Shroud of Turin Pilgrimage Plus Holy Land, Rome and Florence","post":"Do any of these adverts for reserved viewing mean anything? The sindone.org site still announces, in Italian, that it is not possible to book anything yet, and the English pages are still carrying information about the 2010 exposition.\n\n","date":"July 6, 2014 at 5:06 am","url":"https://shroudstory.com/2014/07/05/2015-shroud-of-turin-pilgrimage-plus-holy-land-rome-and-florence/","cat":"2015","id":"comment-135607","author":"Hugh Farey","site":"shroudstory"}]
