[{"title":"2014, A Good Year for Blogging","post":"Yes, Sindone.org looks sophisticated and auto-detects tablets and smart phones. Shroud.com on the other hand does not inspire confidence or invite exploration. It is a turn off. Hire a high school kid for a week to at least dress up the home page.\n\n","date":"December 16, 2014 at 8:55 am","url":"https://shroudstory.com/2014/12/16/2014-a-good-year-for-blogging/","cat":"news_&_views","id":"comment-176944","author":"Paulette","site":"shroudstory"},{"title":"2014, A Good Year for Blogging","post":"You know, something, Paulette, when a website and home page is consistently, month-to-month and year-to-year, number one in Google, you have to be very cautious about making changes. In other words if it aint broke don’t fix it. Shroud.com is number one because of inbound links. Inbound links can be thought of as votes of confidence. The site has the best material. It is updated frequently. Barrie makes sure everything is perfect from text to links to archives to summaries. The home page, maybe, could be made to look a bit more aesthetically pleasing, okay. But that is a minor detail. Barrie has a lot of other priorities like preparing for next year’s exhibition. And, by the way, until recently, sindone.org was really frightfully still advertising the “upcoming” 2010 exhibition.\n\n","date":"December 16, 2014 at 9:51 am","url":"https://shroudstory.com/2014/12/16/2014-a-good-year-for-blogging/","cat":"news_&_views","id":"comment-176961","author":"Dan","site":"shroudstory"},{"title":"2014, A Good Year for Blogging","post":"Moreover, see Moreover see:  Bravo! Wonderful Facelift of shroud.com from just about three years ago.\n\n","date":"December 16, 2014 at 3:03 pm","url":"https://shroudstory.com/2014/12/16/2014-a-good-year-for-blogging/","cat":"news_&_views","id":"comment-177030","author":"Dan","site":"shroudstory"},{"title":"2014, A Good Year for Blogging","post":"Add Pinterest  and Instagram sharing to the blog.  The official Shroud site should do likewise.\n\n","date":"December 16, 2014 at 8:58 am","url":"https://shroudstory.com/2014/12/16/2014-a-good-year-for-blogging/","cat":"news_&_views","id":"comment-176947","author":"Paulette","site":"shroudstory"},{"title":"2014, A Good Year for Blogging","post":"Okay on Pinterest; I’ve add it. I believe Instagram is for sharing only your own work product and photographs, at least that’s my reading.\n\n","date":"December 16, 2014 at 1:22 pm","url":"https://shroudstory.com/2014/12/16/2014-a-good-year-for-blogging/","cat":"news_&_views","id":"comment-177009","author":"Dan","site":"shroudstory"}]
