[{"title":"CNN: Enhance your conclave experience . . .","post":"Pope Francis I (Latin: Franciscus; born Jorge Mario Bergoglio; December 17, 1936) is the 266th and recently elected Pope of the Catholic Church, elected on March 13, 2013. He chose his regnal name in honor of St. Francis of Assisi.  He is the first Pope born in the Americas.\nA comprehensive background of Cardinal Jorge Mario Bergoglio can be found at: http://en.wikipedia.org/wiki/Jorge_Bergoglio \nHe is one of five children of an Italian railway worker. After studying at the seminary in Villa Devoto, he entered the Society of Jesus on March 11, 1958. Bergoglio obtained a licentiate in philosophy from the Colegio Máximo San José in San Miguel, and then taught literature and psychology at the Colegio de la Inmaculada in Santa Fe, and the Colegio del Salvador in Buenos Aires. He was ordained to the priesthood on December 13, 1969, by Archbishop Ramón José Castellano. He attended the Philosophical and Theological Faculty of San Miguel, a seminary in San Miguel. Bergoglio attained the position of novice master there and became professor of theology.\nImpressed with his leadership skills, the Society of Jesus promoted Bergoglio and he served as provincial for Argentina from 1973 to 1979. He was transferred in 1980 to become the rector of the seminary in San Miguel where he had studied. He served in that capacity until 1986. He completed his doctoral dissertation in Germany and returned to his homeland to serve as confessor and spiritual director in Córdoba.\nAs Cardinal, Bergoglio became known for personal humility, doctrinal conservatism and a commitment to social justice. A simple lifestyle has contributed to his reputation for humility. He lives in a small apartment, rather than in the palatial bishop’s residence. He gave up his chauffeured limousine in favor of public transportation, and he reportedly cooks his own meals.\nUpon the death of Pope John Paul II, Bergoglio, considered papabile himself, participated in the 2005 papal conclave as a cardinal elector, the conclave that selected Pope Benedict XVI. A widespread theory says that he was in a close race with Ratzinger until he emotionally asked that the cardinals not vote for him.[3] Earlier, he had participated in the funeral of Pope John Paul II and acted as a regent alongside the College of Cardinals, governing the Holy See and the Roman Catholic Church during the interregnum sede vacante period.\nIn New Zealand, the run-up to the announcement of the conclave’s decision, Breakfast News interspersed its interviews with news rep Garth Bray at St Peter’s Square with reports that the NZ Parliament had just passed its second reading of the Same-Sex Marriage Bill by 77 votes to 44.  During the committee hearings several submissions were rejected and not heard as they were deemed to be too offensive to be seen by Parliament.  This included submissions by the ultra-conservative Catholic Action group.  Clearly there were better ways to be effective in opposing the Bill than the Catholic Action group were able to find. \nWhat has mystified me since the new Pope Francis was announced, is how I seemed to know his name about an hour beforehand.  As I was preparing the morning cereals and wifely cup-of-tea, I was pondering what the new Pope might be called.  I had rejected the names Pius, John, Paul and Benedict.  It occurred to me that he might choose Francis in view of the wold’s ecological crisis, and it seemed to be a natural choice.  How did I know this?  The Holy Spirit moves in mysterious ways, his wonders to perform.\n\n","date":"March 13, 2013 at 4:15 pm","url":"https://shroudstory.com/2013/03/13/cnn-enhance-your-conclave-experience/","cat":"off_topic","id":"comment-27227","author":"daveb of wellington nz","site":"shroudstory"},{"title":"CNN: Enhance your conclave experience . . .","post":"In 2007 the new owner of the Shroud, Pope Francisco I,  wrote the foreword (*) of a book written in Spanish by the journalist of “Il Giornale” Andrea Tornielli. The book’ s title is “La resurreccion” and the author includes among the evidences in favor of the historicity of the Resurrection a whole chapter devoted to the Shroud of Turin. I don’t know if writing a foreword can be understood as a full endorsement of the content of the book, but being himself a chemical engineer, perhaps -only himself- we can expect a new phase regarding Shroud studies.\n(*) http://edant.clarin.com/diario/2007/04/04/deportes/m-00415.htm\n\n","date":"March 13, 2013 at 4:49 pm","url":"https://shroudstory.com/2013/03/13/cnn-enhance-your-conclave-experience/","cat":"off_topic","id":"comment-27229","author":"Gabriel","site":"shroudstory"},{"title":"CNN: Enhance your conclave experience . . .","post":"Personally, I seriously doubt that the Shroud will be on the top of the priorities of this new Pope !  There are so many problems right now inside and outside the Church that I’m not so confident about a rapid change versus the Shroud and his direct study.  But again, that’s just my personal feeling.\n\n","date":"March 13, 2013 at 4:56 pm","url":"https://shroudstory.com/2013/03/13/cnn-enhance-your-conclave-experience/","cat":"off_topic","id":"comment-27233","author":"Yannick Clément","site":"shroudstory"},{"title":"CNN: Enhance your conclave experience . . .","post":"Thanks for the URL Gabriel, it was worthwhile doing a Google translate from the original Spanish. A few extracts follow (allow for Google mis-translates): \n“The prestigious Italian Vatican analyst Andrea Tornielli-Il Giornale newspaper, believes that it is worth going through the path of resurrection.” … “This led him to face an investigation that resulted in the book The Resurrection: mysteries, legends and truth “(editorial Claretian) emerging. In volume-prefaced by Cardinal Bergoglio-Tornielli exposes what he considers a number of indications that humanly make plausible the story of the Gospels, beyond these clear-as always-not newspaper reports, but teaching a belief.”  [… …]\n“The book devotes an entire chapter, perhaps the most exciting, the Shroud on display in Turin and the evidence that, in their opinion, it brings about the resurrection.  Tradition says that the famous blanket was covering the body of Jesus after being taken down from the cross. Tornielli admits at the outset that a carbon 14 dating done in 1988 found that the fabric is medieval. Noting that such studies often led to striking errors, states that the three laboratories were tested invalid took a sample belongs to a much later restoration. The error-remember-was demonstrated in 2005 by chemist Raymond Rogers of Los Alamos National Laboratory. The sheet would be much older.”  Etc …\n\n","date":"March 13, 2013 at 5:33 pm","url":"https://shroudstory.com/2013/03/13/cnn-enhance-your-conclave-experience/","cat":"off_topic","id":"comment-27235","author":"daveb of wellington nz","site":"shroudstory"},{"title":"CNN: Enhance your conclave experience . . .","post":"Typo error: perhaps- only perhaps- we can….\n\n","date":"March 13, 2013 at 4:50 pm","url":"https://shroudstory.com/2013/03/13/cnn-enhance-your-conclave-experience/","cat":"off_topic","id":"comment-27230","author":"Gabriel","site":"shroudstory"},{"title":"CNN: Enhance your conclave experience . . .","post":"Quote : “As Cardinal, Bergoglio became known for personal humility, doctrinal conservatism and a commitment to social justice.”\nPersonal humility and social justice : very good.\nDoctrinal conservatism : very sad.\nI think it will take another 20 years from now (and maybe more) before there will be enough liberal cardinals in the Church to allow the election of a liberal pope that will make the hard changes that are desperately needed.  Unfortunately, when that day will come, the Church will have lost a lot of his remaining faithful in Europe and North America (and maybe elsewhere).  The lost will be partially due to the massive dying of the aging population of the faithful in the years to come of course, but it will also be due to a lack of new faces entering the Church because of the strong conservatism that sadly go on and on and on inside the actual Church and that is in complete mismatch with a major portion of the young generations (and also with the true loving and merciful face of the Father revealed by Jesus, which is much more dramatic in the end).\nBut that’s just a rapid point of view based on some partial information taken from the news agencies…  In reality, who knows what will happen with this new Pope?  As I said the other day, the Holy Spirit is still at work in the World and in the Church and we could have some nice surprises…\n\n","date":"March 13, 2013 at 4:53 pm","url":"https://shroudstory.com/2013/03/13/cnn-enhance-your-conclave-experience/","cat":"off_topic","id":"comment-27232","author":"Yannick Clément","site":"shroudstory"},{"title":"CNN: Enhance your conclave experience . . .","post":"Can you be Francis the First before there has been a Second?\n\n","date":"March 13, 2013 at 7:55 pm","url":"https://shroudstory.com/2013/03/13/cnn-enhance-your-conclave-experience/","cat":"off_topic","id":"comment-27241","author":"Hugh Farey","site":"shroudstory"},{"title":"CNN: Enhance your conclave experience . . .","post":"As sure as God made little green apples, you can’t become Francis the First, AFTER there’s been Francis the Second!\n\n","date":"March 13, 2013 at 8:16 pm","url":"https://shroudstory.com/2013/03/13/cnn-enhance-your-conclave-experience/","cat":"off_topic","id":"comment-27242","author":"daveb of wellington nz","site":"shroudstory"},{"title":"CNN: Enhance your conclave experience . . .","post":"It is being said that Chavez, who was seen taking communion and kissing a crucifix not long before he died, nudged Christ to ensure that a South American would be elected Pope! This part of the Catholic world is really in need of help and with Cristina Kirchner as president some of the headaches Pope Francis I will have can come as a result of what is going on in his home country, where he will be able to count on support from the Capuchin Andrés Stanovnik, archbishop of Corrientes. (www.arzcorrientes.com.ar/guia_eclesiastica_2.html).\nThe Church of England in the UK and part of the Lutheran Church in Brazil began concentrating on how to help the needy after drawing inspiration from Father Gustavo Gutierrez (Peru) and Archbishop Helder Camara (Brazil). South American Francis I can now give the example to the faithful in other parts of the world.\n\n","date":"March 13, 2013 at 10:30 pm","url":"https://shroudstory.com/2013/03/13/cnn-enhance-your-conclave-experience/","cat":"off_topic","id":"comment-27251","author":"Louis","site":"shroudstory"},{"title":"CNN: Enhance your conclave experience . . .","post":"The Argentine seems to be a land of contradictions.  As news broke of the election of Pope Francis, a scuffle broke out in the Chamber of Deputies.  The right-wing deputies wanted to hear Pope Francis’ first speech, while the left-wing deputies wanted to proceed with the set agenda item of honouring deceased President Chavez.  The Left being in the majority got their way.  Cardinal Bergoglio seems to come with some right-wing baggage arising from the crimes of the 1970-76 military junta when the church was widely seen as siding with the regime.  Progressive liberation priests disappeared, many being murdered.  Cardinal Bergoglio somehow survived, despite his advocacy of the poor. He denies the various allegations made against him during these dark days.  Concerning the scuffle in the National Congress, the “Atlantic Wire” commented: “Argentina’s Congress got in a fight over a guy that once sympathized with an authoritarian regime in order to hold a ceremony for another guy who was in charge of an authoritarian regime? Latin America is weird, sometimes.”\nCorruption and self-interested manipulation of the system also seems endemic to Argentina.  Both the Peronistas and subsequently the Kirchners came to power on a mandate of helping the poor.  Both have faced charges of corruption and feathering their own nests. \nWhat with his wily Jesuit background and his familiarity with the worst aspects of his homeland, one could hope that Pope Francis might well be more than a match for the schemers and corruption in the Vatican, and be able to sort out the banking scandals and other abuses. Reports suggest that he is not a familiar figure in Rome, and clearly he will need some inside help to get to the bottom of these matters. \nGlobally, Catholic Bishops have sometimes expressed their frustration at their views being ignored because of the power wielded by the Curia establishment.  Time will tell whether their concerns can be better addressed than seems to be the case in the recent past.  Will there be a Vatican Council III?  Who knows? That is what is probably needed. \nOne might hope that a papal chemical engineer might be roused to some interest in initiating further investigations into the Shroud of Turin.  The young Jorge Bergoglio entered the seminary at age 22, and perhaps any chemistry he once knew has long been forgotten. He would first have to penetrate the overly-protective Turin custodial wall to succeed in this, and perhaps in the initial stages of his pontificate he is likely to have rather more pressing priorities.\n\n","date":"March 14, 2013 at 5:23 am","url":"https://shroudstory.com/2013/03/13/cnn-enhance-your-conclave-experience/","cat":"off_topic","id":"comment-27271","author":"daveb of wellington nz","site":"shroudstory"}]
