[{"title":"Palm Sunday","post":"Today, I went to the mass of the Palm Sunday and we read all the Passion, death and burial of Jesus according to St-Mark.  Note :  The majority of New Testament’s scholars have conclude that this gospel is the earliest gospel of the 4 and I truly belive it.  And according to tradition, this one had been written by Mark, who served as the interpreter of St-Peter while he was in Rome.  So, if this is true, we can say that this narrative is most probably a pretty accurate account of the real events of the Passion, death and burial of Jesus.\nAnd, when it come to the burial of Jesus, what do we read ?  A very simple account.  Here’s the main lines (chapter 15, verses 45-46) : “…he (Pilate) granted the body to Joseph.  Joseph bought a linen cloth, took Him down, wrapped Him in the linen cloth and laid Him in a tomb which had been hewn out in the rock; and he rolled a stone against the entrance of the tomb.\nWhy am I quoting this part of the gospel ?  Simply because I want to ask Ron and Max (see our recent debate on this blog), why this could not be the reality ?  This account is exactly how I see the burial of Christ :  Very fast, simple and partial in comparison to normal Jewish burial custom.  Except for the addition we found in John’s gospel about the aloes and myrrh, which I think can be historic, I don’t see why we would have to think that there was some other actions (like the washing of the body) during this partial rite on friday.  I just want to remember those people that this very fast, simple and partial rite is supported by the gospels (this part of the gospel of St-Mark particularly) and it is also supported by some evidences that were found on the Shroud, like the presence of dirt in the knee and the nose area (see “the list” of facts presented in Dallas in 2005) and the nature of the blood stains regarding the scourge marks (that cannot have been made by liquid blood, but that was made, instead, by some decals of humid blood clots).  \nThis last evidence is supported by Alan Adler in his book “The Orphaned Manuscript” and it is also supported by what Pierre Barbet said in his book “A Doctor at Calvary”.  I said that because, in Zugibe’s hypothesis, if the body had been washed in the regions of the scourge marks, what would have stained the cloth would have been fresh liquid blood (post-mortem of course !) that would have came out of the wounds and that would have stained the cloth when the body would have been laid in the Shroud shortly after the washing.  Sorry but if this scenario would be true, no way the scourge marks would looks like we see them on the Shroud !  Particularly true for the perfect borders of the marks.  If this would have been made by liquid blood coming out of the wounds after a washing of the body, the wound marks would have not been so perfectly bordered, particularly for the back portion of the Shroud, because of the high pressure exerted by the weight of the body.  In fact, in scenario like that, the wounds would have look like a total mess, which is far from being the reality of the Shroud !  Also, think about that :  Miller and Pellicori, in their important study of the UV photos of the Shroud, tell us that, around almost every scourge marks, there is a fluorescent halo made by the serum.  This is totally consistent with Barbet and Adler point of view regarding the blood transfer on the Shroud.  Effectively, if those blood marks came from dried blood clots that would have been humidified again on their surface, the humidity (whatever it was) would have also rehumidified the serum stains that are normally present around any dried blood stains and that came from a well-known process in medicine named “blood retraction”, which is a normal part of the clotting process. \nIn Zugibe’s scenario, do you really think we would find serum stains like that around the blood stains ?  No way !  And, again, this is particularly true for the back region of the Shroud…  On this particular point, isn’t it interesting to note that, in the article where he summarize is hypothesis (link for the article : http://www.shroud.com/zugibe2.htm), Zugibe don’t say a word about the presence of serum halos around almost every scourge marks ???  I think this is an aspect that was completely and sadly neglected by him.  I think he should have take note more seriously of this FACT concerning the serum stains (a fact that can be found easily in the paper of Miller and Pellicori)…  I’m sorry but this lone fact of the serum stains is enough to completely reject Zugibe’s hypothesis about the blood transfer, particularly concerning the scourge marks of the back.  The most probable answer is to think that those scourge marks came from a rehumidification of some sort of the top surface of the blood clots that covered the scourge injuries.  Even if those scourge injuries were dried for a long time (I don’t know the exact time range, but it’s at least several hours), I know it is possible to rehumidified them again in order to produce mirror images on cloth.  \nAnd, as I said, we can also add the very well-defined shapes of the scourge marks that can only be achieved (nevermind what Zugibe pretend) by a decal of humid blood clots instead of some fresh liquid blood…  Like Barbet said in his book, when liquid blood stain a cloth, the stain ALWAYS follow the weave of the cloth.  With the herringbone weave of the Shroud, the blood stains would show some preferred direction (coming from blood that would have follow the weave) and no doubt a very particular feature like that would have been easily noticed by Barbet, Adler or Miller and Pellicori or any other scientist from the STURP.  This was not the case…  Those 2 important facts regarding the scourge marks are totally consistent   I really wonder how can an expert like Zugibe never noticed that important aspect of the question.\nP.S. :  I know this is completely off-topic, but since I’m pretty sure Ron and Max will read this, I would like to show one more evidence that go against the Mandylion hypothesis of Ian Wilson (Ron and Max are two defenders of this hypothesis).  This week-end, I’ve watched a very interesting DVD about the Shroud.  It is called simply “Shroud” and it was published in 2005 by Nova-T under the auspices of the Archdiocese of Turin.  You can see infos about this dvd on Barrie’s website :  http://www.shroud.com/obtain.htm#Video\nIn this video, a big portion is dedicate to the 2002 restoration and we can see an interesting interview with Msgr Ghiberti from Turin.  In this interview, he said that the Shroud was completely scanned with a special camera who can look at the cloth at microscopic level.  All this scanning was recorded and conserved.  And what is very interesting is the fact that Msgr Ghiberti specified that, with this particular technique, it was possible to find all traces of dirt that could have been present on the Shroud, trapped in the weave of the cloth.  Remember what I said about the FACT that the STURP team didn’t noticed more dirt or dust in the region of the face versus anywhere else on the cloth ?  You were kind of skeptic about that.  I’m sorry but the video microscopic technique used in 2002 during the restoration would have been sensible enough to detect any noticeable variation in the dust or dirt content for the region of the face or anywhere else on the cloth (Ghiberti said that the whole cloth was scanned like that).  Isn’t it strange that nobody from the restoration commission (whether it be Ghiberti, Flury-Lemberg or anybody else) have report that there was more dirt or dust (or even a more important yellowing) in the region of the face ???  And don’t worry…  You can bet your house that a fact like that, if it was real, would have been reported by them for sure !!!  Sorry but I think you didn’t thought about this important PHYSICAL FACT my friends (and Wilson, Scavone or any other defender of the Mandylion hypothesis have not take this seriously enough too) !!!  In reality, the absence of any comment from the commission about this question is a tacit confirmation of what can be deduced from the dead silence of STURP regarding any noticeable difference regarding the physical aspect of the region of the face.\nIn fact, this absence of any noticeable difference between the region of the face and the rest of the Shroud is an authentic PHYSICAL FACT (not a speculation) that, alone, is enough to put VERY SERIOUSLY in doubt the hypothesis of Wilson regarding the Mandylion.  If this cloth would have been the Shroud folded in 8 with only the region of the face exposed to air and light (this set-up would have stayed that way for centuries !!!), there is NO WAY (I repeat, no way, scientifically speaking) that this would not have created some noticeable difference in the physical aspect of the Shroud in the region of the face (particularly in regard of the presence of more dust and/or dirt and also regarding the presence of a more important yellowing of the fibers).  I’m sorry to broke the dream of those who believe Wilson’s hypothesis is true, but this is the physical reality of the Shroud my friends (again, I repeat that this is not any kind of speculation) and nobody can’t denied it, unless he his completely full of bias !!!  And if this PHYSICAL REALITY tell us that the Shroud cannot have been folded in the way describe by Wilson in his hypothesis, why continue at all costs to defend his misconceptions ???  I repeat what I said before :  If you believe that the Shroud is authentic, what is the big deal with the fact that his ancient history is still unknown and will probably remain unknown ?  Personally, I don’t have any problem with that because I know that this unknown history do not mean that the relic is false…  In fact, I think that simply mean that his horrific aspect didn’t fit with the sensibility of the early days of the Church and that forces the Clergy to hide it for a very long time, possibly until it was showed in the Blachernes Church in 1203, when the crusaders were at the gate of the city.  I really think the Shroud was almost always kept inside a reliquary until that time and that’s why we don’t have much references to it in the first millenium of our era.  I think the explanation is as simple as that…\n\n","date":"April 1, 2012 at 7:31 pm","url":"https://shroudstory.com/2012/04/01/palm-sunday/","cat":"news_&_views","id":"comment-9840","author":"Yannick Clément","site":"shroudstory"},{"title":"Palm Sunday","post":"There an incomplete phrase in my comment below.  Here’s the complete phrase :  ” Those 2 important facts regarding the scourge marks are totally consistent WITH A MIRROR IMAGE TRANSFER MADE BY HUMID BLOOD CLOT AND TOTALLY INCONSISTENT WITH THE HYPOTHESIS OF A WASHING OF THE BODY PRIOR TO HIS DEPOSIT IN THE SHROUD.  I really wonder how can an expert like Zugibe never noticed that important aspect of the question.”\n\n","date":"April 2, 2012 at 10:23 am","url":"https://shroudstory.com/2012/04/01/palm-sunday/","cat":"news_&_views","id":"comment-9868","author":"Yannick Clément","site":"shroudstory"},{"title":"Palm Sunday","post":"Yannick, very interesting this info about how they scanned the whole cloth at a microscopic level. Also your conclusion regarding the Mandylion. For me at least, this is news. Are these images the same as the so often quoted in this blog high resolution HAL 9000 images?\nFrom this and other details It seems to me that after all, the restoration was not so “catastrophic” as some claim……\n\n","date":"April 2, 2012 at 3:20 pm","url":"https://shroudstory.com/2012/04/01/palm-sunday/","cat":"news_&_views","id":"comment-9874","author":"Gabriel","site":"shroudstory"},{"title":"Palm Sunday","post":"For the catastrophic general feeling, I think it is prudent to wait until a new scientific team can have the permission to analyse the Shroud.  Then, we’ll be fixed.  Until that moment, all the bad comments are more “speculative” I think than anything.  Let’s wait what a new team of scientists will tell when they’ll get access to all the material that was taken during the restoration.  Ho, by the way, here’s a message to everyone who think the restoration was catastrophic :  BLAME IT ON ALAN ADLER !  He he !  Effectively, this was him who urged the most the Turin authorities to do rapidly a restoration of the cloth.  But, at the same time, I have to admit that Adler was already dead when the restoration took place, so I don’t think he is responsible for some questionnable actions that took place during this restoration.  But one thing’s for sure :  If it wasn’t for Adler, it’s not so sure that the resoration would have taken place.  In the DVD I’ve mentioned, Msgr Ghiberti clearly said that it was Adler who urged the authorities to make a restoration of the cloth and we can find 2 or 3 papers on that particular topic in Adler’s book “The Orphaned Manuscript”.  It’s funny to see how much people seem to avoid to address some critics to Adler regarding the restoration !  In my mind, all the critics always blamed the Turin authorities and never Adler.  I think there’s a lot of “politics” and “agendas” being all this…  I just hate to see that. \nNow, for your question about the HAL 9000 images, I can’t tell.  I’m not an expert on the 2002 restoration.  All I know (info taken from the DVD) is that the restoration team took a camera that can take microscopic views of the cloth and pass over every square inches of the cloth with it.  And what is wonderful is the fact that all this operation was recorded !  Would be great if we could see this entire video !  One of the purpose of this operation was to find where there was some charred particles on the cloth (particles that came from the 1532 fire) in order to take them away (while, at the same time, keeping those particles in little glass bottles for future researches).   So, if that camera was sensible enough to see microscopic charred particles, you can be sure that it was sensible enough to see all the dust and dirt that could be scattered everywhere on the cloth !!!  And since the commission (or any of his members) never said a word about having found more dirt and/or dust in the region of the face, I think this physical fact alone is enough to really put the hypothesis of Wilson in jeopardy !  I really think this physical FACT has always been neglected by the defenders of Ian Wilson when it comes to judge the relevance of his Mandylion hypothesis.  Sad but true !\n\n","date":"April 2, 2012 at 3:40 pm","url":"https://shroudstory.com/2012/04/01/palm-sunday/","cat":"news_&_views","id":"comment-9875","author":"Yannick Clément","site":"shroudstory"},{"title":"Palm Sunday","post":"One more comment about the Passion of the Christ we can read in St-Mark Gospel.  This comment is directly adressed to Dan Scavone.  M. Scavone, did you note the part of the Gospel where we read that a young man run away naked at Gethsemane ?  Before being naked, the text said that he was wearing only a “linen sheet”.  What was the greek word used to describe this “linen sheet” ?  SINDON !!!  Now, I hope you don’t think this man was wearing a burial shroud of more than 4 meters long !!!  In fact, most scholars says that the cloth this man was wearing was some kind of a night tunic that was used by Jews to sleep at night.  We are very far from a burial shroud, don’t you think ???  That’s a perfect example of what I was saying in my long reply the other day :  Sindon can mean many things, depending on the context of the text !!!  And if we come back to the Acts of Thaddeus part where the author is talking about a “sindon tetradiplon”, I’m sorry but the context of this text exclude completely the interpretation you do.  No way Jesus could have been given a burial shroud of more than 4 meters in order to wipe his face !!!  NO WAY !\n\n","date":"April 2, 2012 at 8:32 am","url":"https://shroudstory.com/2012/04/01/palm-sunday/","cat":"news_&_views","id":"comment-9865","author":"Yannick Clément","site":"shroudstory"},{"title":"Palm Sunday","post":"Yannick is mixing things up. Has he seen the research by Phil Dayvault? Also, it does not matter which Gospel is the earliest because there is convergence and there also was oral tradition in the Jesus Movement that later became the Church. If that was not so, there would be no Christianity.\nLouis\n\n","date":"April 2, 2012 at 12:46 pm","url":"https://shroudstory.com/2012/04/01/palm-sunday/","cat":"news_&_views","id":"comment-9870","author":"Louis","site":"shroudstory"},{"title":"Palm Sunday","post":"This is your opinion.  I just wanted to point out the fact that the Gospel accounts and what we see on the Shroud is really coherent…\n\n","date":"April 2, 2012 at 1:00 pm","url":"https://shroudstory.com/2012/04/01/palm-sunday/","cat":"news_&_views","id":"comment-9871","author":"Yannick Clément","site":"shroudstory"}]
