[{"title":"Comment Exchange of the Day Yesterday","post":"Good image research, Dan. But your “Italian Job” picture is incomplete, showing only the wedding photographers. Choose a wider picture and your see the startled bride and groom at the top of the steps. Mamma mia.\nhttps://encrypted-tbn3.gstatic.com/images?q=tbn:ANd9GcTKzUQ2DLkpXxix6FQ97UK15rB_cCrYUg7DiMOKFarj6oikOfBS\n\n","date":"October 12, 2013 at 5:05 am","url":"https://shroudstory.com/2013/10/12/comment-exchange-of-the-day-yesterday/","cat":"news_&_views","id":"comment-47173","author":"colinsberry","site":"shroudstory"},{"title":"Comment Exchange of the Day Yesterday","post":"Leave this to the oldtimers, and there are many, who have published their views, otherwise we will be listening to broken records again, this time from newcomers. It is an established fact that everything went wrong in 1988, starting from Turin, then to London and the labs and back to Turin.\n\n","date":"October 12, 2013 at 10:31 am","url":"https://shroudstory.com/2013/10/12/comment-exchange-of-the-day-yesterday/","cat":"news_&_views","id":"comment-47216","author":"Louis","site":"shroudstory"},{"title":"Comment Exchange of the Day Yesterday","post":"I personally shan’t lose a second’s sleep at being snubbed for offering a “newcomer’s view”, if that is the correct takeaway message from what one has to say seems a somewhat sniffy and patronising comment. \n But there’s another needle stuck in the groove of another record, the one that incessantly tells us not only that the testing was a complete fiasco, but then adds merrily that re-testing would of course be a complete waste of time (“contamination”, the methodology “too new and controversial”  or “totally unsuitable for linen” etc etc).\n Why don’t they jump to the next groove, the one that incessantly plays another refrain: “We simply cannot afford to have the radiocarbon scientists come back with the same answer, not when they will insist next time around on being allowed to do it their way, so as to be able to claim unimpeachable statistical precision”?\n\n","date":"October 12, 2013 at 10:56 am","url":"https://shroudstory.com/2013/10/12/comment-exchange-of-the-day-yesterday/","cat":"news_&_views","id":"comment-47226","author":"colinsberry","site":"shroudstory"},{"title":"Comment Exchange of the Day Yesterday","post":"That’s right, a second’s sleep will never be available, given the motives, which were voiced a few days ago, right here. The question that arises here is: Is it worthwhile? There is a lot more to read, tons of material, before reaching the conclusion that the best way to get at the object of prejudice (or hatred?) is to attack the TS.\nThe last paragraph above hits the nail on the head. Unless all the doubts are cleared, and they are many, as the abundant literature demonstrates,there is no point in proceeding.\n\n","date":"October 12, 2013 at 11:55 am","url":"https://shroudstory.com/2013/10/12/comment-exchange-of-the-day-yesterday/","cat":"news_&_views","id":"comment-47235","author":"Louis","site":"shroudstory"},{"title":"Comment Exchange of the Day Yesterday","post":"Birra Peroni! Paga te sig. Collins? When it comes to alcoholic beverages that’s sure to get a response from me everytime.\n\n","date":"October 12, 2013 at 10:43 am","url":"https://shroudstory.com/2013/10/12/comment-exchange-of-the-day-yesterday/","cat":"news_&_views","id":"comment-47223","author":"Giorgio","site":"shroudstory"},{"title":"Comment Exchange of the Day Yesterday","post":"“There is a lot more to read, tons of material, before reaching the conclusion that the best way to get at the object of prejudice (or hatred?) is to attack the TS.”\nI can only speak for myself, but I have to say it’s not the TS that is the object of prejudice. How can it be? An object is an object – a physical entity that has no obvious spiritual essence.\nIf you want to know the real reason why the TS can arouse such indignation, at least among those of us who have devoted our careers to scientific research and teaching, then look no further than this article that appeared in the UK press under the headline:\nItalian study claims Turin Shroud is Christ’s authentic burial robe.\nOpening sentence:  \nItalian scientists have conducted a series of advanced experiments which, they claim, show that the marks on the shroud – purportedly left by the imprint of Christ’s body – could not possibly have been faked with technology that was available in the medieval period.\nhttp://www.telegraph.co.uk/news/religion/8966422/Italian-study-claims-Turin-Shroud-is-Christs-authentic-burial-robe.html\n19 Dec 2011\nCan you guess which word sticks in this particular craw? Answer: It’s the second, the one I have bolded.\nBest perhaps that I stop there.\n\n","date":"October 12, 2013 at 2:11 pm","url":"https://shroudstory.com/2013/10/12/comment-exchange-of-the-day-yesterday/","cat":"news_&_views","id":"comment-47253","author":"colinsberry","site":"shroudstory"},{"title":"Comment Exchange of the Day Yesterday","post":"I was referring to the Catholic Church and comments posted on the thread “You guys are brutal”, particularly #26. Unfortunately a new thread was opened, but there is more than enough ammunition at my end if the exchange is to continue on the previous thread.\nThe link is stale news, and who said that it is the last word on the topic? It is just one among many papers, an attempt to explain how the image was formed. We will have to live with loads of papers till the authorities decide what to do. The decision does not depend entirely on them. Why? See the second paragraph on #4 above.\nPeople who devote their careers to scientific research and teaching are to be praised — as long as they do not indulge in scientism. Can those scientists known for scientism answer the question: Why is there something instead of nothing?\n\n","date":"October 12, 2013 at 2:57 pm","url":"https://shroudstory.com/2013/10/12/comment-exchange-of-the-day-yesterday/","cat":"news_&_views","id":"comment-47255","author":"Louis","site":"shroudstory"}]
