[{"title":"Part of a Comment Promoted:  A Question for Today","post":"I wonder how, I wonder why\nYesterday you told me ’bout the blue, blue sky\nAnd all that I can see is just a yellow lemon tree\nI’m turning my head up and down\nI’m turning, turning, turning, turning, turning around\nAnd all that I can see is just another lemon tree.\n\n","date":"July 2, 2014 at 6:40 am","url":"https://shroudstory.com/2014/07/02/part-of-a-comment-promoted-a-question-for-today/","cat":"news_&_views","id":"comment-134843","author":"O.K.","site":"shroudstory"},{"title":"Part of a Comment Promoted:  A Question for Today","post":"I am not going to guess but I suspect, and this is what prompted me, that  it will be on the same lines as the work done on ancient gilded metals in the conservation lab at the British Museum. They pinpointed a new technique of gilding on copper ( or at least only copper casting took this gilding) that only came in in the second century AD. They then realised that the Horses of St Marks, that some had dated as late as the 1990s as fourth century BC, were gilded the same way and had to be second century AD or later.\nSo it might be with Egyptian Coptic textiles, Islamic cloth, medieval linen,or even some first century weave just unearthed, that provides the evidence. You can’t simply hold this research up and it is taking place around many of the issues that have become frozen in debate over the Shroud.\nSo we shall see. It will almost certainly be something that no one can predict but it will be obvious when it is found.\n\n","date":"July 2, 2014 at 6:55 am","url":"https://shroudstory.com/2014/07/02/part-of-a-comment-promoted-a-question-for-today/","cat":"news_&_views","id":"comment-134845","author":"Charles Freeman","site":"shroudstory"},{"title":"Part of a Comment Promoted:  A Question for Today","post":"This is simply argument to the future fallacy -one could say as well that one day someone will find definite proof of Shroud’s 1st century origin.\n\n","date":"July 2, 2014 at 7:12 am","url":"https://shroudstory.com/2014/07/02/part-of-a-comment-promoted-a-question-for-today/","cat":"news_&_views","id":"comment-134847","author":"O.K.","site":"shroudstory"},{"title":"Part of a Comment Promoted:  A Question for Today","post":"One might well. You cannot predict what research will throw up. We only know that there are conservation labs throughout the world working on ancient linens and that new textiles are being discovered in archaeological sites every year. So there is a high probability ( I am not going to try and calculate how high a probability!) that something of relevance to the Shroud might come up that may give a date to the Shroud that will have the same  backing as the dating of the Horses of St. Mark’s which is now accepted by everyone.\nI am just wondering how this will be dealt with if it happens. O.K. seems to assume that it will never happen and he can simply stick to his own beliefs.\nAnother good case was the discovery, by Michael Ventris, that the Linear B tablets were written in Greek. Lots of people said that this was impossible. But then a new cache was dug up in the palace of Pylos and indeed it was Greek. So it was put about by Ventris’ opponents that new tablets had been created specially and then buried . . .\n\n","date":"July 2, 2014 at 8:28 am","url":"https://shroudstory.com/2014/07/02/part-of-a-comment-promoted-a-question-for-today/","cat":"news_&_views","id":"comment-134859","author":"Charles Freeman","site":"shroudstory"},{"title":"Part of a Comment Promoted:  A Question for Today","post":"I think isotopic analysis of the flax fibres may identify the place…\n\n","date":"July 2, 2014 at 3:22 pm","url":"https://shroudstory.com/2014/07/02/part-of-a-comment-promoted-a-question-for-today/","cat":"news_&_views","id":"comment-134938","author":"Hugh Farey","site":"shroudstory"},{"title":"Part of a Comment Promoted:  A Question for Today","post":"Aside: There is quite a good review of the history of the Linear decipherment in Simon Singh’s “The Code Book”. \nTopic:  Giulio Fanti’s work on testing the mechanical properties of ancient flax fibres is one piece of pioneering work that may at some time develop more conclusively.  But I suspect that rather more is required.  His paper “A NEW CYCLIC-LOADS MACHINE FOR THE MEASUREMENT OF MICRO-MECHANICAL PROPERTIES OF SINGLE FLAX FIBERS COMING FROM THE TURIN SHROUD” by Giulio Fanti, Pierandrea Malfi;  can be found at:\nhttps://shroudofturin.files.wordpress.com/2013/09/aimeta-fanti.pdf   And he has some good citations of earlier work by various ones. \nThe paper has considerable technical content which may be difficult for some.  Essentially the concept is that the cellulose degrades with time, and by calibrating against properties of known ages of cloths, an estimate of the sample’s age can be made.  A significant problem is that time is not the only dependent variable, but also the history of the cloth, its storage, handling, humidity, also affect these properties.  My recollection is that he tested some four separate parameters, and there was a considerable spread of the various estimated ages.  His attempts at measuring the age of his TS samples seems to be generally considered inconclusive by most reviewers, as far as I know, although he asserted his results were at least consistent with 1st century provenance.  \nA significant problem will always be the reluctance of relics’ guardians to allow the release of samples from intact relics, because of a natural enough wish to preserve the integrity of the relic.  This will always seem to make adequately representative sampling a difficult issue.  There is clearly a preference for non-destructive testing methods. \nSome, including the late Ray Rogers, considered that the presence of a starch coating on the TS fibres indicated that the TS was of ancient provenance, because of the change in linen production methods in medieval times which left no such coating. Rogers also considered that the absence of vanillin was another indicator. \nClearly much more is required than what has been achieved to date, and it may well come.  Nevertheless it is one matter to determine the age of the cloth, but even if it was proved to be first century, there would still be those skeptics who would assert that the image was produced by some medieval artisan, by some means as yet unknown! \nMuch more scientific work and historical research, on several fronts is required.  Access to the relic hampers scientific testing.  Time and the inevitable destruction of any records that may once have provided clues hampers historical research.  Research into naturalistic production of images however remains an independent possibility into greater understanding.\n\n","date":"July 2, 2014 at 4:54 pm","url":"https://shroudstory.com/2014/07/02/part-of-a-comment-promoted-a-question-for-today/","cat":"news_&_views","id":"comment-134947","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Part of a Comment Promoted:  A Question for Today","post":"You wrote:\n>The paper has considerable technical content which may be difficult for some.\n—- —\nIn the book : “Sindone: primo secolo dopo Cristo!” Edizioni Segno (Italy) there are the inherent explanations…\nYou wrote:\n>Essentially the concept is that the cellulose degrades with time, and by calibrating against properties of known ages of cloths, an estimate of the sample’s age can be made.\n—- —-\nThe question was underlined (before myself and Fanti) by Diana and Marinelli. Please read the paper : Natural Textile Fibres – Optical Activity, Racemization and Epimerization\nlink:\nhttps://www.shroud.com/diana.htm\nDp = the depolymerization degree …\n— —\nYou wrote:\n>A significant problem is that time is not the only dependent variable, but also the history of the cloth, its storage, handling, humidity, also affect these properties\nYes, but you forgot the attacks by bacteria, the fungal attacks and the insects…\n— —\nYou wrote:\n>There is clearly a preference for non-destructive testing methods. \nYes. Only we have to work following non-destructive testing methods.\nBut Fanti came to break the linen fibers subjecting them to loads.\nTherefore his tests are not completely non-destructive…\nInstead I have underlined (read the past messages) the ideas of :\n– indentation\n– three-point (or multi-point) bending test\nin order to obtain the interesting estimations about the Elastic Modulus.\nSee also the flexural Modulus of elasticity:\nhttp://en.wikipedia.org/wiki/Three_point_flexural_test\nwe can probe the mechanical properties of nanoscale materials:\nlink:\nhttp://www.thewalkerlab.com/research/investigation-of-boron-nitride-nanotubes/\n[Nanoscale Mechanics – Studies of Boron Nitride Nanotubes … = the rigid material, the linen fibers does not seem to be so rigid.!]\n— —\nSo…\nWhat is your comment ?\n\n","date":"July 4, 2014 at 8:48 am","url":"https://shroudstory.com/2014/07/02/part-of-a-comment-promoted-a-question-for-today/","cat":"news_&_views","id":"comment-135302","author":"Piero","site":"shroudstory"},{"title":"Part of a Comment Promoted:  A Question for Today","post":"My point was that it might be work on materials other than the Shroud by specialists who may never have heard of it that would provide findings that could then be applied back to the Shroud and provide something definitive.\n\n","date":"July 2, 2014 at 5:30 pm","url":"https://shroudstory.com/2014/07/02/part-of-a-comment-promoted-a-question-for-today/","cat":"news_&_views","id":"comment-134950","author":"Charles Freeman","site":"shroudstory"},{"title":"Part of a Comment Promoted:  A Question for Today","post":"Fanti’s calibration curves were carried out on various cloths for which the ages were claimed to be known.  He provides a reference for these, but at the time of the paper I cited it was still under publication. I think I recall he may have published it formally since in a peer-reviewed pub.  It is the comparisons with other cloths that can only provide such evidence that Charles suggests.  Surfactant coatings may provide one indicator, and there are probably others such as along the lines of Rogers’ vanillin or whatever.\n\n","date":"July 2, 2014 at 11:36 pm","url":"https://shroudstory.com/2014/07/02/part-of-a-comment-promoted-a-question-for-today/","cat":"news_&_views","id":"comment-135003","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Part of a Comment Promoted:  A Question for Today","post":"In my idea the “work on materials other than the Shroud by specialists who may never have heard of it” is not a wise idea, because they have to know something (at least) about the Shroud (and lignocellulosic textiles) before to work on this kind of argument.\nThe probable result is nothing = no proper guidance or suggestion (prompt) from who don’t know the matter.\nSo…\nHow to give rise to the adequate scientific team ?\n…and…\nWhere are the funds to sustain the research?\n\n","date":"July 4, 2014 at 11:38 am","url":"https://shroudstory.com/2014/07/02/part-of-a-comment-promoted-a-question-for-today/","cat":"news_&_views","id":"comment-135319","author":"Piero","site":"shroudstory"},{"title":"Part of a Comment Promoted:  A Question for Today","post":"There is already an immense amount of work going on with ancient linens in conservation labs. So knowledge is expanding all the time. At some point something of immediate relevance to the Shroud is likely to emerge – it is just a question of recognising it.\n\n","date":"July 4, 2014 at 4:26 pm","url":"https://shroudstory.com/2014/07/02/part-of-a-comment-promoted-a-question-for-today/","cat":"news_&_views","id":"comment-135365","author":"Charles Freeman","site":"shroudstory"},{"title":"Part of a Comment Promoted:  A Question for Today","post":"A well-preserved pre-Incan funeral shroud, more than 2000 years old:\nhttp://www.upi.com/Top_News/World-News/2014/06/17/Peru-displays-pre-Incan-funeral-shroud/5681403015679/\n\n","date":"July 2, 2014 at 8:35 pm","url":"https://shroudstory.com/2014/07/02/part-of-a-comment-promoted-a-question-for-today/","cat":"news_&_views","id":"comment-134969","author":"Louis","site":"shroudstory"}]
