[{"title":"Photographs of the Shroud and Copyright","post":"Barrie Schwortz is an expert in copyright law and used to teach it.  Perhaps you should ask him to explain it.\n\n","date":"January 9, 2015 at 8:51 am","url":"https://shroudstory.com/2015/01/09/photographs-of-the-shroud-and-copyright/","cat":"news_&_views","id":"comment-182162","author":"Andy","site":"shroudstory"},{"title":"Photographs of the Shroud and Copyright","post":"I would love to hear from Barrie on this. He may comment and a guest posting is always welcome from Barrie.  Like I said, I’m not a lawyer.  But I have had this issue explained to me by an attorney who is very familiar with copyright law.  You will also notice that Wikipedia Foundation (of Wikipedia) takes this position: “The official position taken by the Wikimedia Foundation is that “faithful reproductions of two-dimensional public domain works of art are public domain”.\nArt?  A limiting word?  Probably not. \nA bit more on the 1999 ruling by the U. S. District Court for Southern New York:\nThe Bridgeman Art Library, a private enterprise, makes photographic reproductions of numerous works of art from museums around the world. It is their business. However, a few years ago, the Corel Corporation, a computer graphics software company, used many of Bridgeman’s reproductions to produce an educational CD-ROM without seeking permission or paying Bridgeman.  Bridgeman claimed copyright infringement. Not only had they purchased rights to some photographs, they had made many of them.\nIn 1999, the U. S. District Court for Southern New York ruled against Bridgeman. The ruling stated that “exact photographic copies of public domain images could not be protected by copyright in the United States because the copies lack originality. Even if accurate reproductions require a great deal of skill, experience and effort, the key element for copyrightability under U.S. law is that copyrighted material must show sufficient originality.” (quoted from Wikipedia)\nIn other words, if you take a picture of an ancient mosaic, and you give me a copy or you make a copy publically available, I can use it without your permission.\nIs this fair? You would probably not think so if you are the photographer or someone owning a copyright claim. Bridgeman still makes copyright claims and insists that use of their photographs be licensed. Many such works today, particularly those that are licensed to commercial concerns, contains invisible or visible “digital watermarks,” to detect copying. But that is not very effective. Typical blogging software simply strips away digital watermarks and facilitates automatic cropping, resizing and corrections to contrast and color as thousands of pictures get posted every hour on the Internet.\nDoes Bridgeman vs. Corel apply to photographs of the Shroud of Turin? Perhaps not, for it has not been determined that the shroud is a work of art.  But the courts might not see it that way. The precedent established by Bridgeman vs. Corel stipulates that a photograph show sufficient originality. The more accurate the photograph the less copyrightable it is. It is often said that the courts have ruled that “sweat of the brow” (for example, the act of photographing a public domain work) is not the “creative spark” which deserves copyright. I agree with that.\nColin was making a different point, altogether.  I don’t know how I feel about it.  Regardless, I think credit to the photographer is appropriate.  \nLike I said, I would love to hear from Barrie on this. Or anyone. And, again, I’m not a lawyer.\n\n","date":"January 9, 2015 at 9:52 am","url":"https://shroudstory.com/2015/01/09/photographs-of-the-shroud-and-copyright/","cat":"news_&_views","id":"comment-182167","author":"Dan","site":"shroudstory"},{"title":"Photographs of the Shroud and Copyright","post":"I can say how is in Italy. All images of the Shroud are under copyright. If you want to publish it, you must ask the commettee for the shroud in Turin. They ask you why you want to publish them, and a summary of the book or article where you want to publish them (a summary of the book, the index, etc.). They read it and if they agree, they sell you the image. The only allowed source, are the photos of Gian Durante. They ask you how many pictures, the size, the nature of your publication, the diffusion, etc.\nMy editor asked an image for my next book. For an image of the shroud to be printed in a page of a book, not in very high definition, they asked 300$ (american dollars). Gian Durante asked 155$ to send the image. Total: 455 $.\nMy editor was very surprised. For the other pictures of the book, he payed between 60 and 90$. For this, I told my editor to refuse and print the book without the image of the shroud. But he considererd it impossible.\nAfter some insistences, the commettee kindly sold the image for 235 instead of 300 $. (300+155 = 405$)\nBefore this experience, I imagined that the pictures of the shroud are free.\nP.S. A picture (not of the shroud) was provided by Schwortz, freely, I think, or almost freely.\n\n","date":"January 9, 2015 at 12:35 pm","url":"https://shroudstory.com/2015/01/09/photographs-of-the-shroud-and-copyright/","cat":"news_&_views","id":"comment-182193","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Photographs of the Shroud and Copyright","post":"I suspect that those prominent claims to hold “copyright” are little more than bluff. What they mean in reality is what we would once have heard as “Tough. I hold the negatives”. Nowadays that’s had to be recast in digital parlance as “I have the highest resolution images”,i.e. those that reproduce best on the printed page.\nOne has only to read the preamble on Barrie Schwortz’s site to see that it’s all about ring-fencing the max. resolution source code, not because it’s genuine copyright, but because possession as they say is nine points of the law.\nhttps://shroud.com/gallery/index.htm\nMy one regret is having had to wait so long to see the Mark Evans images. Earlier observations, sadly my own, mid- 2012,  re  the distribution of blood between herringbone ribs and furrows (based on lower magnification Shroud Scope images) were clearly in error, based as they were on the deceptiveness of images that fail to show the weave pattern in sufficiently high resolution and magnification.\nHaving made that admission, one still wonders why those vital Evans’ images are still ‘copyright-protected’, real or apparent. While gold dust to researchers, it’s hard to see any obvious commercial value. BS to his credit did tell an intermediary (Thibault Heimburger) back in 2012 that he could supply me with a CD archive of the Evans images for a token charge. It was an offer I felt it necessary to decline, given suggestions that access to high resolution photographs did not mean carte blanche to publish online (see the above link).\n\n","date":"January 9, 2015 at 5:21 pm","url":"https://shroudstory.com/2015/01/09/photographs-of-the-shroud-and-copyright/","cat":"news_&_views","id":"comment-182225","author":"Colin Berry","site":"shroudstory"},{"title":"Photographs of the Shroud and Copyright","post":"I can say how is in Italy. All images of the Shroud are under copyright. If you want to publish it, you must ask the commettee for the shroud in Turin\nSo it seems that the same images can be published in US for free, while you need permission to publish them in Italy.\nWhile gold dust to researchers, it’s hard to see any obvious commercial value.\nThere is a commercial value -if you want to publish a book containing them, you have to get a deal with Barrie. That’s income for his fundation, allowing him to maintain the activity.\n\n","date":"January 9, 2015 at 5:54 pm","url":"https://shroudstory.com/2015/01/09/photographs-of-the-shroud-and-copyright/","cat":"news_&_views","id":"comment-182228","author":"O.K.","site":"shroudstory"},{"title":"Photographs of the Shroud and Copyright","post":"I assume the esteemed STERA boardman had permission to upload the copyrighted Fanti docudrama to YouTube. Doesn’t that say it all.\n\n","date":"January 9, 2015 at 5:51 pm","url":"https://shroudstory.com/2015/01/09/photographs-of-the-shroud-and-copyright/","cat":"news_&_views","id":"comment-182227","author":"Paulette","site":"shroudstory"},{"title":"Photographs of the Shroud and Copyright","post":"See this:\nhttp://commons.wikimedia.org/wiki/Commons:Reuse_of_PD-Art_photographs\n\n","date":"January 9, 2015 at 6:02 pm","url":"https://shroudstory.com/2015/01/09/photographs-of-the-shroud-and-copyright/","cat":"news_&_views","id":"comment-182229","author":"O.K.","site":"shroudstory"},{"title":"Photographs of the Shroud and Copyright","post":"Extract from your link, OK, comparing US v UK law (the former being problematical for STERA, and the latter displaying yet again its ass-like characteristics).\nUnited States / USA\n Under the rule in Bridgeman Art Library v. Corel Corporation, a mere ‘record’ photograph of a 2D work of art (i.e. a photograph which is an as-accurate-as-possible copy of the original) acquires no copyright protection.\nUnited Kingdom / UK (My italics)\nMost British academics and practitioners (sic) agree that the UK courts would uphold copyright protection on a carefully lit and exposed photograph, taken from a distance, which aims to be a faithful reproduction of a 2D work of art. The level of originality required by the UK courts is low (‘sweat of the brow”), and there is likely to be sufficient originality in the photographer’s selection of lighting arrangements, exposure, filters and so on for a new copyright to be generated. Here is what the principal copyright practitioner’s text, Copinger & Skone James, has to say:\n    In terms of what is original for the purpose of determining whether copyright subsists in a photograph, the requirement of originality is low and may be satisfied by little more than the opportunistic pointing of the camera and the pressing of the shutter button. There seems to be no reason of principle why there should be any distinction between the photograph which is the result of such a process and a photograph which is intended to reproduce a work of art, such as a painting or another photograph.\n\n","date":"January 9, 2015 at 6:19 pm","url":"https://shroudstory.com/2015/01/09/photographs-of-the-shroud-and-copyright/","cat":"news_&_views","id":"comment-182231","author":"Colin Berry","site":"shroudstory"},{"title":"Photographs of the Shroud and Copyright","post":"Copyright was obtained for all the illustrations used in my History Today print article, including from the Royal Library in Turin who were actually quite helpful and not that expensive compared to the church ( and asked nothing about why they were needed) but I was told that it was too expensive to get worldwide online copyright permissions hence my online article has hardly any illustrations.\n\n","date":"January 10, 2015 at 4:01 pm","url":"https://shroudstory.com/2015/01/09/photographs-of-the-shroud-and-copyright/","cat":"news_&_views","id":"comment-182431","author":"Charles Freeman","site":"shroudstory"}]
