[{"title":"Comment of A Superfluous Man Brought to the top","post":"Quote ” I assume here that there must be someone out there who has recently written from a persuasive ‘anti’ perspective when it comes to the Shroud’s authenticity” unquote…I don’t think so Superfluous!\nActually most ‘anti’ writings bring up the same old points which are; The d’Arcis memos, the 1988 c14 carbon dating and the sudden appearance of the Shroud in 14th century…not much else unless you want to hear speculations that Leonardo DaVinci did it. The point is all these above mentioned points have been debunked including the infamous c14, (which by the way was never ‘peer-reviewed’ originally) and debunked by R. Rogers paper of 2005 and consequent peer-reviews. The d’arcis memos which the “antis” cling too are basically hearsay to begin with and with absolutely no proof to back up the alligations, just maybe the desperate rantings of a impoverished clergy. So not much ‘ammunition’ in the “anti’s” favour to talk about….Even the misleading statements to the blood, AB on the Shroud matching that of the Sudarium being of no consequence as apparently “all blood reverts too AB” has been proven false inlight of the recent Tutankhamon DNA tests. Point is;…\nYou’d be hardpressed to find a good ‘anti-Shroud’ book out there.\nR\n\n","date":"February 13, 2012 at 3:00 pm","url":"https://shroudstory.com/2012/02/13/comment-of-a-superfluous-man-brought-to-the-top/","cat":"news_&_views","id":"comment-8200","author":"Ron","site":"shroudstory"},{"title":"Comment of A Superfluous Man Brought to the top","post":"Ron, Nature is together with Science the most serious and considered scientifc journals. It is a peer-reviewed journal where typically a very high percentage of tentative papers are rejected due to the difficulties raised by the referees. Therefore, I  would  also assume that the c14 paper also went through a such a process. You mention that the c14-Shroud paper was never ‘peer-reviewed’ originally, could you extend on this a little bit, please? If we are talking about Nature not submitting a paper to peer-review before publishing it only for non-scientifc reasons, this would be a very serious subject for Nature.\nIn my opinion, the c14 test was applied correctly but perhaps on the wrong sample. Futhermore, in 2011 there seems to be enough evidences gathered in the scientific literature these years that indicate that the c14 test might not be appropiate to date the Shroud. Something that perhaps in 1988 was not so clear. I have written some comments about this here so I won`t come back to this point again, but I tend to think that the C14 experiment itself was carried out following generally accepted standards. Otherwise, I think it would never have been accepted for publication in Nature.\n\n","date":"February 13, 2012 at 3:45 pm","url":"https://shroudstory.com/2012/02/13/comment-of-a-superfluous-man-brought-to-the-top/","cat":"news_&_views","id":"comment-8201","author":"Gabriel","site":"shroudstory"},{"title":"Comment of A Superfluous Man Brought to the top","post":"I guess I worded that a little on the stringent side…my error, sorry. The point I was trying to make is that much evidence has surfaced since the original Nature article was released that shows the ‘peer-review’ IF done by Nature ‘thoroughly’, has been found to have many discrepancies and contrary to what you may believe even the actual procedures during the testing have been questioned! eg; of the actual size of the samples NOT meeting the minimal weight required, proper examination of the samples before sampling etc, etc;. Many of these points have been discussed here before and they are not new. To me it seems the Nature report may have been done in haste and alot of evidence is pointing to that statement,…meaning, in laymen’s terms; Nature did a half-***ed review.\nWith that said, I was really hoping when posting that someone would have picked-up on my statement about the AB blood of the Shroud. In the Stephen Jones blog, February 2012 posting, a poster directs Stephen to this very interesting topic and one I find may be very important in Shroud studies, as the word has been (over the decades) that all blood will revert to AB and these recent studies may prove this to be wrong!….I’d really like to hear other people’s thoughts on this. Maybe Dan can open a new post on this very intriquing topic???\nR\n\n","date":"February 13, 2012 at 5:16 pm","url":"https://shroudstory.com/2012/02/13/comment-of-a-superfluous-man-brought-to-the-top/","cat":"news_&_views","id":"comment-8206","author":"Ron","site":"shroudstory"},{"title":"Comment of A Superfluous Man Brought to the top","post":"Today a recently published paper in a serious journal of physics (*) has been widely commented in different newspapers (**). I have downloaded the full version from my institution`s library. The point is that the authors have been able to model mathematically the profile of human hair ponytails.\nI have read somewhere that on the back image of the Shroud at the head level a ponytail can be devised.\nI inmediately have wondered if using a high resolution image a test could be carried out: does that ponytail follow the mathematical shape expected for a human ponytail? Would it be possible to obtain information on whether that ponytail was in vertical or horizontal position?\n(*) PRL108,078101(2012) PHYSICAL REVIEW LETTERS. Shape of a ponytail and the statistical physics of hair Fiber bundles. Raymond E. Goldstein, Patrick B. Warren, and Robin C.Ball. Department of applied mathematics and theoretical physics,University of Cambridge\n(**)\nhttp://www.nytimes.com/2012/02/11/science/ponytail-shape-is-determined-by-complex-physics.html\nhttp://www.dailymail.co.uk/sciencetech/article-2100530/Rapunzel-number-lets-scientists-predict-shape-ponytail–solving-problem-posed-Leonardo-da-Vinci.html\n\n","date":"February 13, 2012 at 6:10 pm","url":"https://shroudstory.com/2012/02/13/comment-of-a-superfluous-man-brought-to-the-top/","cat":"news_&_views","id":"comment-8210","author":"Gabriel","site":"shroudstory"},{"title":"Comment of A Superfluous Man Brought to the top","post":"I think to Ron’s point: what was published in Nature and what actually happened may be two different things in a lot of respects. Had the review process had all the facts in-hand it may have gone another way.\n\n","date":"February 13, 2012 at 9:52 pm","url":"https://shroudstory.com/2012/02/13/comment-of-a-superfluous-man-brought-to-the-top/","cat":"news_&_views","id":"comment-8215","author":"Chris","site":"shroudstory"},{"title":"Comment of A Superfluous Man Brought to the top","post":"Gabriel, I don’t think an analysis of a pony tail would yield any meaningful results. The hair on the back image is fainter than the body image on the same side and it’s very undefined. So I don’t think a definitive outline could be ascertained. \nAs an aside, this characteristic of the hair on the reverse image is something that proponents of forgery are going to have a hard time grappling with and explaining.\n\n","date":"February 13, 2012 at 9:59 pm","url":"https://shroudstory.com/2012/02/13/comment-of-a-superfluous-man-brought-to-the-top/","cat":"news_&_views","id":"comment-8216","author":"Chris","site":"shroudstory"},{"title":"Comment of A Superfluous Man Brought to the top","post":"Mr Superfluous, I like the St. Thomas More picture. I think that’s by Holbein? He is one of my heroes and someone who’s courage I hope to imitate. \nThere have been a few times in my life when I’ve had to depart from others in their path for moral reasons. There have been a least a couple of occasions where I was confronted and asked why I could not go along with others in their behavior when they didn’t see anything wrong with it. My response has always been to paraphrase More: “If you should die and go to Heaven for following your conscience and I should die and go to Hell for nor following mine, will you join me for fellowship’s sake?” The response is always the same as More received: silence. It’s good to know some things are eternal.\n\n","date":"February 13, 2012 at 10:07 pm","url":"https://shroudstory.com/2012/02/13/comment-of-a-superfluous-man-brought-to-the-top/","cat":"news_&_views","id":"comment-8217","author":"Chris","site":"shroudstory"},{"title":"Comment of A Superfluous Man Brought to the top","post":"Hi!\nMr «Superfluous Man» seems to be honest when dealing with the Shroud but despite assuming he is not aware of «the state of the art» asserts «technically if one were able to prove that the Shroud was certainly from the year 33 A.D. even this still would not conclusively prove that it belonged to «Christ» (i.e. there were many other men who were crucified and died in or around that period)».\nThat’s a good question indeed, and I invite him to read the post and excellent comments on this blog entitled « Why do we think it is an image of Jesus on the Shroud of Turin» December 7, 2011.\nMaybe there he’ll find the answer. I’d be glad to know his advice\n                                      regards\n                                 Maria da Glória\n                             Centro Português de Sindonologia\n\n","date":"February 14, 2012 at 8:19 am","url":"https://shroudstory.com/2012/02/13/comment-of-a-superfluous-man-brought-to-the-top/","cat":"news_&_views","id":"comment-8228","author":"Maria da Glória Gonçalves Barroso","site":"shroudstory"}]
