[{"title":"Posting Correction","post":"Freeman commits at least  three egregious errors in his piece (actually a lot more).\nFirst is to fully credit the D’Arcis memo which was really a hoax and never  delivered to the Avignon pope. Second, he concludes it was a painting on the basis of McCrone’s findings  which have been thoroughly rebutted and Third, he credits the carbon dating which has been remitted to the “dust bin of histotry.”. I’s be happy to debate on any of the three, because frankly, he doesn’t know what he’s writing about.\nBut let’s begin with this one: the Shroud is not a painting!!!! That is a scientific fact.\n\n","date":"October 28, 2014 at 11:09 am","url":"https://shroudstory.com/2014/10/28/posting-correction/","cat":"uncategorized","id":"comment-166214","author":"John Klotz","site":"shroudstory"},{"title":"Posting Correction","post":"No, I give hardly any credence to the d’Arcis memorandum- i give much greater weight to the pronouncement of Clement VII that the Shroud was not genuine but nevertheless was worthy of veneration.This confirms that the church hierarchy did not believe it was a forgery.\nI do not rely on McCrone- I do not support him in my article one way or the other as you will see from my article. I simply mention his findings .The best evidence for the painting comes from the calcium carbonate that was an ingredient of gesso which was used to seal a cloth ON THE OUTER FIBRILS only before painting. That was a STURP finding- the problem being that they did not know anything about medieval painting. I do not regard it as definitive but it is hard to understand why there was so much calcium carbonate and why the image was just on the outer fibrils but this was just where the medieval experts advised it should be and applied by a knife so that any excess could be scraped off (this explains why there were no brushmarks). The other issue is the much more distinct images and the presence of features such as the Crown of Thorns that are now vanished- where have they gone if they were not originally painted on and now disintegrated?\nThe carbon 14 dating has not been discredited. The careful work of Flury-Lemberg as well as every other expert who has actually examined the cloth close up confirms that there was no reweaving -it simply could not be concealed on the back even if it was on the front-  and this is further confirmed by John Jackson’s photography that shows the bands were not  interrupted. Jackson himself confirmed that there was no reweaving and he is normally trusted among the Shroudies. Then no one has been able to even say what the contamination that would have to be twice the weight of the cloth AFTER cleaning to affect the result actually was.\nAn examination under modern microscopy , that is, as my article says, desperately needed -would show whether the paintings or lack of it is ‘a scientific fact ;or not. \nThe debate will not be won or lost on the Shroud Story website. it will be won and lost among specialists in the areas I covered, medieval iconography, weaving techniques/looms, conservationists, specialists in painted linens, experts on medieval liturgy- these are the ones I am approaching for further comments. As I have said before, the debate will not be sorted one way or the other- authentic burial cloth or faded painted linen – in under a year as it takes this sort of time, at least, for the ideas to get around and reach the people who know about medieval artefacts and the ceremonies associated with them..\nBut I must congratulate you on being -so far as I know- the only contributor to the Guardian comments section to have his comment removed by the moderator. Quite some feat when you look at the competition!!\n.\n\n","date":"October 28, 2014 at 12:43 pm","url":"https://shroudstory.com/2014/10/28/posting-correction/","cat":"uncategorized","id":"comment-166233","author":"Charles Freeman","site":"shroudstory"},{"title":"Posting Correction","post":"Charles, what do you make of the Khi2 test, is it scientifically valid or invalid? NOTHING totally overlooking It is scientifically INVALID!\n\n","date":"October 28, 2014 at 5:50 pm","url":"https://shroudstory.com/2014/10/28/posting-correction/","cat":"uncategorized","id":"comment-166306","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Posting Correction","post":"Well, Charles, it will be interesting to see their responses.\nHowever, the responses are only as meaningful as the brief, and if the brief is as one sided as I expect from you, then we can expect the responses to be of limited value.\n\n","date":"October 29, 2014 at 2:13 am","url":"https://shroudstory.com/2014/10/28/posting-correction/","cat":"uncategorized","id":"comment-166447","author":"Thomas","site":"shroudstory"},{"title":"Posting Correction","post":"Well, the professional academics I work with are professionals and they would never go public with something that they could not defend with their own expertise. But it takes time – it took about four months to get my article published, presumably because it was being read by other academics than those I consulted before even a magazine for the general history public accepted it. So give it a year at least.\nBut if my article had not been pUblicised here, I would not be responding at all as it is not on this website that the issues will be decided anyway.\n\n","date":"October 29, 2014 at 3:48 am","url":"https://shroudstory.com/2014/10/28/posting-correction/","cat":"uncategorized","id":"comment-166470","author":"Charles Freeman","site":"shroudstory"},{"title":"Posting Correction","post":"” I’s be happy to debate on any of the three “, Well, Mr Freeman has actually replied to you on all three topics  and there’s still no reply from you Mr Klotz.\n\n","date":"October 29, 2014 at 10:40 am","url":"https://shroudstory.com/2014/10/28/posting-correction/","cat":"uncategorized","id":"comment-166564","author":"PHPL","site":"shroudstory"},{"title":"Posting Correction","post":"John, I also don’t think it is correct to indulge in guesswork and try to pass it off as history. See my comment on the other thread.\n\n","date":"October 28, 2014 at 11:16 am","url":"https://shroudstory.com/2014/10/28/posting-correction/","cat":"uncategorized","id":"comment-166217","author":"Louis","site":"shroudstory"},{"title":"Posting Correction","post":"Clement VII had no choice but to keep his mouth shut and allow the expositions. When it comes to science, there are many hypotheses about how the carbon dating results may have been skewed. Many details about the Shroud are also being ignored.\n\n","date":"October 28, 2014 at 1:05 pm","url":"https://shroudstory.com/2014/10/28/posting-correction/","cat":"uncategorized","id":"comment-166239","author":"Louis","site":"shroudstory"},{"title":"Posting Correction","post":"Sorry to say that. A Historian misled so many millions ignoring all the scientific facts and by considering only guess work.\n\n","date":"October 28, 2014 at 5:21 pm","url":"https://shroudstory.com/2014/10/28/posting-correction/","cat":"uncategorized","id":"comment-166295","author":"Sampath Fernando","site":"shroudstory"},{"title":"Posting Correction","post":"උඉතෙ රිඝ්ට්\n\n","date":"October 28, 2014 at 5:41 pm","url":"https://shroudstory.com/2014/10/28/posting-correction/","cat":"uncategorized","id":"comment-166302","author":"Louis","site":"shroudstory"},{"title":"Posting Correction","post":"What did you say?\n\n","date":"October 28, 2014 at 5:52 pm","url":"https://shroudstory.com/2014/10/28/posting-correction/","cat":"uncategorized","id":"comment-166307","author":"John Klotz","site":"shroudstory"},{"title":"Posting Correction","post":"Quite right.\n\n","date":"October 28, 2014 at 5:58 pm","url":"https://shroudstory.com/2014/10/28/posting-correction/","cat":"uncategorized","id":"comment-166309","author":"Louis","site":"shroudstory"},{"title":"Posting Correction","post":"Wouldn’t a painting that faded over centuries have resulted in a negative image with similarly faded/distorted detail? I would like to accept the Shroud as the work of a medieval artist……just show me similar ones from the time period.  Following Mr. Freeman’s logic, he should be able to have an art student create one, artificially age it, and voila!\nThis whole argument is pointless.\n\n","date":"October 28, 2014 at 7:58 pm","url":"https://shroudstory.com/2014/10/28/posting-correction/","cat":"uncategorized","id":"comment-166351","author":"Mordecai Boone","site":"shroudstory"},{"title":"Posting Correction","post":"Well if you read my article you will see I give two examples of similar faded medieval paintings on cloth and call on conservationists to see if they have more from their work. This is why I am seeking out conservationists so that we can build up some comparative examples.  The Shroud is not the only formerly painted linen with faded images after five or six hundred years of public expositions. but  you might have actually to read my article to see what two of those other  linens are!\nAs my article says , the images were painted as negatives, as the Besancon Shroud was also. As I argue these cloths were produced for the Quem Queritis ceremony where grave cloth had to be brought out of the tomb and held up in front of it  to show that Christ has risen -just look at the Lirey  pilgrim badge to see how it was done. Whether the artist used a template to copy from ( this would explain how similar the Shroud bloodstains are to those, for instance,  of the Holkham Bible and the Roettgen Pieta, both fourteenth century) or whether he did his own thing, he had to produce a negative image to make the point that this was a grave cloth. This was right at the beginning of medieval drama. – the Passion plays follow.\n\n","date":"October 29, 2014 at 3:41 am","url":"https://shroudstory.com/2014/10/28/posting-correction/","cat":"uncategorized","id":"comment-166468","author":"Charles Freeman","site":"shroudstory"},{"title":"Posting Correction","post":"Over at ShroudScience someone has made a valid point that it seems strange that not a single flake of paint seems to have remained stuck to the Shroud, even if the vast majority of it has indeed crumbled away. Still, the Zittau Lenten Veil is worth looking at: http://www.zittau.eu/fastentuecher/images/xxl/pressefoto_11_grosses_zittauer_fastentuch_1472.jpg\nThe paint has flaked off rather selectively, in a big patch, but has left behind some interesting pale brown stains. I wonder what it looks like from behind?\nAnother point concerns the quality of the cloth – would a stage prop require something so expensive? Who knows, but perhaps, if used as a liturgical object, indeed, becoming an altarcloth for the rest of the liturgy, it might.\nAndrew Sofer’s book, The Stage Life of Props, the opening chapters of which are on Google Books, discusses the liturgical transition of objects from profane to sacred rather well.\n\n","date":"October 29, 2014 at 5:03 am","url":"https://shroudstory.com/2014/10/28/posting-correction/","cat":"uncategorized","id":"comment-166489","author":"Hugh Farey","site":"shroudstory"},{"title":"Posting Correction","post":"Thanks, Hugh for the Sofer reference – I did not know it but it seems relevant to my thesis. \nI don’t  think the Shroud is ‘so expensive’ – just look at the linen table cloths they were producing  in the medieval period that are of far higher quality. \nThe medieval treatises on painting on linen stress that the weave has got to be fairly close or else the gesso surface cannot be applied. You are aiming to get a very thin and consistent layer of gesso on the outer fibrils without it seeping through a loose weave (then you paint on top). There were two aims- 1) to allow you, if not in the case of the Shroud, to have different paintings on  each side 2) for flags and banners to be able to flutter in the breeze. It was quite a skilled job to get the gesso on in a thin layer and that is why they advised to do it with a knife so excess could be scraped off.\nAlso a treadle loom is three times as fast as an ancient loom thanks to the coordination of feet and hands so this made the whole process of weaving linen and other textiles much easier after c. 1000. Unfortunately the cost of securing illustration rights for the world wide web were prohibitive but I have a nice picture of a medieval treadle loom in the print version of HT. It shows how the weave was rolled up around a rod at the top so that longer cloths could be produced, but the width was limited to c. 130 cms, No problems, the experts tell me, in producing the Shroud on such a loom.\n\n","date":"October 29, 2014 at 6:13 am","url":"https://shroudstory.com/2014/10/28/posting-correction/","cat":"uncategorized","id":"comment-166505","author":"Charles Freeman","site":"shroudstory"},{"title":"Posting Correction","post":"Mr. Freeman,\nI have read your article and purchased it.  I did not see that you had posted any pictures of the purported negative images in negative….Please do so to demonstrate how consistent they are or are not with the negative of the Turin Shroud.  If your theory cannot produce a negative of a negative image in such detail, then it cannot be correct. Period.\n\n","date":"October 29, 2014 at 12:42 pm","url":"https://shroudstory.com/2014/10/28/posting-correction/","cat":"uncategorized","id":"comment-166594","author":"Mordecai Boone","site":"shroudstory"},{"title":"Posting Correction","post":"Correct, the claims had to be accompanied by images.\n\n","date":"October 29, 2014 at 4:20 pm","url":"https://shroudstory.com/2014/10/28/posting-correction/","cat":"uncategorized","id":"comment-166665","author":"Louis","site":"shroudstory"}]
