[{"title":"Common ground between believers and atheists","post":"I believe that I cannot see God the Father but I believe that he is there, I believe that the Shroud of Turin is the Shroud that Jesus Christ was placed in and was covering his body when his Devine Spirit entered his body for the Resurrection as prophesized,\n\n","date":"November 24, 2013 at 4:33 pm","url":"https://shroudstory.com/2013/11/24/common-ground-between-believers-and-atheists/","cat":"uncategorized","id":"comment-52703","author":"ekmcmahon","site":"shroudstory"},{"title":"Common ground between believers and atheists","post":"Michael Novak is a respected philosopher but is linked to politics. If only there could be links to biblical studies and psychology:\nWhat would he say about Matthew 5:8? Would he call Jesus a liar?\nHas he said anything about feeling God? Has he read depth psychology, has he read C.G.Jung, for instance?\nSt. Theresa, Doctor of the Church, went through a long period of the “dark night of the soul”, Mother Teresa also had a short experience and told Ferdinand Périer, Archbishop of Calcutta, about it.\nPope Francis is wiser than Novak in his “Lumen Fidei”.\n\n","date":"November 24, 2013 at 4:36 pm","url":"https://shroudstory.com/2013/11/24/common-ground-between-believers-and-atheists/","cat":"uncategorized","id":"comment-52704","author":"Louis","site":"shroudstory"},{"title":"Common ground between believers and atheists","post":"There are two kinds of knowledge: faith and reason. With reason, we know something is true because we can see the truth of it. With faith, we know something is true because God is telling us. The existence of God is a matter of reason, not faith. That there is life after death is a matter of faith. My reasons for making an act of faith are: 1) That Jesus was a Jewish prophet. 2) The Resurrection of Jesus. 3) The passion of Jesus as told by the synoptic gospels and the Holy Shroud.\n\n","date":"November 24, 2013 at 4:57 pm","url":"https://shroudstory.com/2013/11/24/common-ground-between-believers-and-atheists/","cat":"uncategorized","id":"comment-52707","author":"David Roemer","site":"shroudstory"},{"title":"Common ground between believers and atheists","post":"Michael Novak is a dire warning of what has happened to the Catholic Church since the horror of Vatican II.  I can just hear Jesus saying to the disciples, “You know, in the dark of night I’m not so sure there is a God at all.  Maybe the unbelievers are right, who knows?”  Yeah that fits him like a glove.  His last words from the cross were “my God my God why have you forsaken me?”, not “my God, are you there?”\nThe “sheer modesty” that compels that crowd to listen led to the utter travesty of the Assisi prayer meeting and a photograph of an apostate “Pope” kissing a Koran.  Reminds me of the phrase about being so open minded your brains fall out.\nIt would be impossible to misconstrue the “cloud of unknowing” or the “dark night of the soul” more comprehensively.  The apophaticism of Dionysius is just not quite the same as becoming the fellow traveller of atheists and sceptics.\n\n","date":"November 26, 2013 at 8:18 pm","url":"https://shroudstory.com/2013/11/24/common-ground-between-believers-and-atheists/","cat":"uncategorized","id":"comment-52870","author":"R. H. Cahall","site":"shroudstory"}]
