[{"title":"Copy of the Shroud of Turin in New Jersey","post":"I was delighted to see that the Shroud of Turin is another of those ‘blood’ relics whose blood liquefies. They were very common in the Middle Ages an, in fact, having the blood of Christ in liquid rather than dried form was often taken as a mark of authenticity. (The true blood of Christ would never solidify- this was the selling point of the monks at Weingarten in Germany who had the blood that had come out of the side of Christ and was still liquid to prove it -one reason perhaps why the Shroud was never in the top class of blood relics.)  Here were have a case, like that of the blood of St. Januarius in Naples, when the blood only liquefies on special occasions but is able to replicate itself  on a contact relic that then becomes a relic in itself. Not unusual but good to add to the story of the Shroud.\nI deal with the medieval blood cults in Chapter Nineteen of my Holy Bones, Holy Dust, ‘The Wondrous Blood of Christ’.\nI have not as yet come across any member of the STURP tomb ( here apparently still active in 1986) who knew anything about medieval relic cults so I wonder how they dealt with the matter. Anyone know who was involved?\n\n","date":"November 16, 2013 at 4:44 am","url":"https://shroudstory.com/2013/11/15/copy-of-the-shroud-of-turin-in-new-jersey/","cat":"news_&_views","id":"comment-51570","author":"Charles Freeman","site":"shroudstory"},{"title":"Copy of the Shroud of Turin in New Jersey","post":"\nCharles Freeman :\nI was delighted to see that the Shroud of Turin is another of those ‘blood’ relics whose blood liquefies. They were very common in the Middle Ages an, in fact, having the blood of\nChrist in liquid rather than dried form was often taken as a mark of authenticity. (The true blood of Christ would never solidify- this was the selling point of the monks at Weingarten in Germany who had the blood that had come out of the side of Christ and was still liquid to prove it -one reason perhaps why the Shroud was never in the top class of blood relics.)  Here were have a case, like that of the blood of St. Januarius in Naples, when the blood only liquefies on special occasions but is able to replicate itself  on a contact relic that then becomes a relic in itself. Not unusual but good to add to the story of the Shroud.\nI deal with the medieval blood cults in Chapter Nineteen of my Holy Bones, Holy Dust, ‘The Wondrous Blood of Christ’.\nI have not as yet come across any member of the STURP tomb ( here apparently still active in 1986) who knew anything about medieval relic cults so I wonder how they dealt with the matter. Anyone know who was involved?\n\nYou could contact the monastery directly or do a little digging if you sincerely want to know-who, what, when-I’m no historian, but I did last year- “STURP tomb”, I’ll pass-the objectivity is obvious; besides, why bother, any tests that were done would be considered incompetent, inconclusive, etc.\n\n","date":"November 16, 2013 at 6:06 am","url":"https://shroudstory.com/2013/11/15/copy-of-the-shroud-of-turin-in-new-jersey/","cat":"news_&_views","id":"comment-51577","author":"Kelly Kearse","site":"shroudstory"},{"title":"Copy of the Shroud of Turin in New Jersey","post":"I took STURP tomb to be a typo, Kelly, maybe Freud-assisted, but a typo, all the same Charles having presumably meant to say STURP team. (?)\nOn a different matter, I see Anonymous has not come back yet to explain those allegedly “out-of-stereoregister” blood rivulets on the hair. Rest assured I’m waiting for him when he does – and have the scourge marks held in reserve too, in an attempt to shoot down once and for all his needle-stuck-in-groove dogma.\n\n","date":"November 16, 2013 at 6:26 am","url":"https://shroudstory.com/2013/11/15/copy-of-the-shroud-of-turin-in-new-jersey/","cat":"news_&_views","id":"comment-51579","author":"colinsberry","site":"shroudstory"},{"title":"Copy of the Shroud of Turin in New Jersey","post":"Typo – yes ‘team’. Apologies.\n‘Any tests that were done would be considered incompetent, inconclusive, etc’ Well, we wouldn’t know until we had read the report whether they met normal levels of scientific objectivity(over to you Colin) but as a historian working largely on medieval relic cults, it is good to see stories about the Shroud that echo those of other medieval relic cults. It makes me feel quite at home when so many reports on the Shroud treat it as if it were the only relic existing in medieval Europe so that, despite there being thousands of documented medieval cloths, linen and silk mainly, with images on them,when a report of one, such as that by Robert de Clari, is found, it is assumed to be the Shroud!\n\n","date":"November 16, 2013 at 6:58 am","url":"https://shroudstory.com/2013/11/15/copy-of-the-shroud-of-turin-in-new-jersey/","cat":"news_&_views","id":"comment-51584","author":"Charles Freeman","site":"shroudstory"},{"title":"Copy of the Shroud of Turin in New Jersey","post":"\ncolinsberry :\nI took STURP tomb to be a typo, Kelly, maybe Freud-assisted, but a typo, all the same Charles having presumably meant to say STURP team. (?)\nOn a different matter, I see Anonymous has not come back yet to explain those allegedly “out-of-stereoregister” blood rivulets on the hair. Rest assured I’m waiting for him when he does – and have the scourge marks held in reserve too, in an attempt to shoot down once and for all his needle-stuck-in-groove dogma.\n\nEven with the benefit of doubt for a typo (right…) or a misheard dictation:translation, it’s transparent that the conclusion is a forgone one.  Science deals with the black & white, as well as the grey, but it doesn’t work by starting with a conclusion and working backwards-I’d rather start by looking at the data, as objectively as possible, like a scientific reviewer would, you know?\n\n","date":"November 16, 2013 at 6:50 am","url":"https://shroudstory.com/2013/11/15/copy-of-the-shroud-of-turin-in-new-jersey/","cat":"news_&_views","id":"comment-51582","author":"Kelly Kearse","site":"shroudstory"},{"title":"Copy of the Shroud of Turin in New Jersey","post":"So what do you think,Kelly, about ancient blood, apparently dried, that comes  damp to such an extent that it can be transferred onto another piece of cloth? It is common enough in medieval Europe to read of such things which is why I feel quite at home with it and don’t think of it in scientific terms at all. But the STURP TEAM (raised no doubt from the TOMB of their disbandment of 1981) apparently did think of it as a ‘scientific’ happening. So if the two bloods are the same,what is the mechanism through which the dried blood of the Shroud transferred itself to the nuns’ copy?\n\n","date":"November 16, 2013 at 7:04 am","url":"https://shroudstory.com/2013/11/15/copy-of-the-shroud-of-turin-in-new-jersey/","cat":"news_&_views","id":"comment-51586","author":"Charles Freeman","site":"shroudstory"},{"title":"Copy of the Shroud of Turin in New Jersey","post":"Mechanism is a puzzle, certainly. But before thinking about that, there’s a criterion that has to be met if entertaining notions about secondary imprinting by direct contact. One has to show that one’s imprint has reversed (left-right) mirror-image morphology, as can be easily demonstrated with a sheet of paper and fountain pen (fold while the ink is still wet).\n\n","date":"November 16, 2013 at 7:21 am","url":"https://shroudstory.com/2013/11/15/copy-of-the-shroud-of-turin-in-new-jersey/","cat":"news_&_views","id":"comment-51588","author":"colinsberry","site":"shroudstory"},{"title":"Copy of the Shroud of Turin in New Jersey","post":"Co;in, It looks here as if the nuns’ copy has been placed face up and the blood has seeped in from the back. Normally someone trying to transfer the potency of a relic would have put their own image directly onto the face of the Shroud. But I am always scrupulously careful not to say this sort of thing about a relic unless, as in the rare case of the Shroud, it has been adopted as an object of scientific research.\n\n","date":"November 16, 2013 at 7:29 am","url":"https://shroudstory.com/2013/11/15/copy-of-the-shroud-of-turin-in-new-jersey/","cat":"news_&_views","id":"comment-51589","author":"Charles Freeman","site":"shroudstory"},{"title":"Copy of the Shroud of Turin in New Jersey","post":"\nCharles Freeman :\nCo;in, It looks here as if the nuns’ copy has been placed face up and the blood has seeped in from the back. Normally someone trying to transfer the potency of a relic would have put their own image directly onto the face of the Shroud. But I am always scrupulously careful not to say this sort of thing about a relic unless, as in the rare case of the Shroud, it has been adopted as an object of scientific research.\n\nMy thoughts precisely Charles. But if placed faced up then the blood would be darker on the reverse than on the front. Is that the case? \nIf placed faced down, then the lance-wound blood would be on the wrong side of the body, which is not the case in the photograph shown.\nSummit’s surely not right… That’s Summit, New Joisy.\n\n","date":"November 16, 2013 at 7:35 am","url":"https://shroudstory.com/2013/11/15/copy-of-the-shroud-of-turin-in-new-jersey/","cat":"news_&_views","id":"comment-51590","author":"colinsberry","site":"shroudstory"},{"title":"Copy of the Shroud of Turin in New Jersey","post":"Perhaps someone should start a second blog CopyoftheShroudstory, or CopyoftheShroudwithoutthehype as I think we have enough on our hands here with the original.\n\n","date":"November 16, 2013 at 8:05 am","url":"https://shroudstory.com/2013/11/15/copy-of-the-shroud-of-turin-in-new-jersey/","cat":"news_&_views","id":"comment-51595","author":"David Goulet","site":"shroudstory"},{"title":"Copy of the Shroud of Turin in New Jersey","post":"I blame that Dan Porter myself for covering this ‘copyoftheshroud’ story. He must have known it would be like throwing red meat to the sceptics’ brigade, once that liquefying blood got a mention. \nActually, it’s not blood. It’s a “serum exudate of retracted blood clots”, didn’t ya know,  that somehow gained bags of quasi-but-not-quite haemoglobin from leaking red blood cells, while carelessly losing its potassium? That in itself is a small miracle, even without the re-liquifying tendency. \nBe that as it may, please don’t shut down debate just yet, David. I was hoping to package up my comments (maybe one or two of yours as well) for yet another shadow posting on you-know-where.  ;-)\n\n","date":"November 16, 2013 at 8:26 am","url":"https://shroudstory.com/2013/11/15/copy-of-the-shroud-of-turin-in-new-jersey/","cat":"news_&_views","id":"comment-51598","author":"colinsberry","site":"shroudstory"},{"title":"Copy of the Shroud of Turin in New Jersey","post":"\nCharles Freeman :\nSo what do you think,Kelly, about ancient blood, apparently dried, that comes  damp to such an extent that it can be transferred onto another piece of cloth? It is common enough in medieval Europe to read of such things which is why I feel quite at home with it and don’t think of it in scientific terms at all. But the STURP TEAM (raised no doubt from the TOMB of their disbandment of 1981) apparently did think of it as a ‘scientific’ happening. So if the two bloods are the same,what is the mechanism through which the dried blood of the Shroud transferred itself to the nuns’ copy?\n\nWhat do I think?  I believe in science.  I believe in miracles.  For me, it is not a given that science and faith must be in conflict.  I disagree with those who think this is so.  I also disagree with the promotion of any type of relic as authentic & miraculous when the science says otherwise.  Is it possible that some religious relics are fake and overhyped?  Of course it is.  But I don’t think this automatically disqualifies everything.  This is a subject that has to be considered on an individual basis.  God doesn’t need to rely on fakery.  He’s much, much bigger than that.      \nA tent of Catholicism is transubstantiation.  I am a Catholic (adult convert).  I believe in it.  If I didn’t, I wouldn’t leave the pew.  What is the mechanism?  I don’t know.  But I believe there is one, though you probably won’t find it looking in a science textbook, even the latest edition.  In my opinion, there’s much about science and natural laws that remain to be elucidated, I don’t think we know everything about everything, even in 2013, soon to be 2014.  A fighter jet or iPhone would have seemed miraculous or the devil’s trickery 500 years ago.  Where do we currently sit on the timeline with our scientific knowledge?  99.999% and counting?  I, myself, think it’s naive to think so-man was made in God’s image, true, but prepare to catch an atomic bomb when you try to take Him on in a chess match.\nBack to the Shroud copy in NJ.  I’ve been there, I’ve seen it.  If the blood on the Shroud is not real blood, then any discussion is pointless.  If the Shroud blood were the true blood of Jesus, the mechanism could be a miraculous one.  Or, then again, with all due respect, it could just be the humidity.  I have no problem either way. \nFor myself, the most important thing about the Shroud is not if the blood is a specific type or if the bilirubin is high or low, or even if the blood is transferred or applied.  Becoming interested in the immunology & cell biology aspects that surround the Shroud has allowed me to consider the images in a more detailed way than I ever did.  Even if it were a marvelous work of man-made art, I would still value its ability to deepen my faith in the sufferings of Christ.  In my life, the Shroud has done that in a different way than anything else ever did.  I’ve seen the Pieta, I’ve seen numerous paintings & frescos, I’ve seen the Passion on the big screen and on DvD.  The Shroud has made it more real for me.  That’s the bottom line.  That appreciation will still be there, even if it were demonstrated to be bogus by the evening’s end.  Science & faith have together given me a wonderful life.  So, what do I think?  I think you should be careful what you ask for; after all, it was in a “tomb” where this all started.\n\n","date":"November 16, 2013 at 8:49 am","url":"https://shroudstory.com/2013/11/15/copy-of-the-shroud-of-turin-in-new-jersey/","cat":"news_&_views","id":"comment-51599","author":"Kelly Kearse","site":"shroudstory"},{"title":"Copy of the Shroud of Turin in New Jersey","post":"Kelly, we are talking about relics, with possible miraculous properties, and no one has said anything about people with intense faith with the ability to heal and cure. When Pope John Paul II made it to the cover of “Time” magazine as “Man of the Year” years ago mention was made of people who came close to him and felt something different. It remained a mystery, at least to me, till I read a book about him by the German journalist Andreas Englisch, a lapsed Catholic who returned to the faith like Peter Seewald, former editor of “Der Spiegel”.\nThe late pontiff had the ability to heal and cure but did not want anyone to say anything about it, so the German journalist and writer published his findings around two years ago.\nAmong the cases he cites: An American Jewish millionaire, dying of a malignant brain tumour, wanted to die in Jerusalem but wanted to see Pope John Paul II before that. An arrangement was therefore made through Msgr. Stanislau Dziwisz, then the Pope’s secretary. The dying man was brought on a stretcher to the chapel where the  Pope said early morning mass, received Holy Communion(!) and then flew to Jerusalem. When he arrived there he noted that he had been completely cured. Is this Catholic propaganda?\nThis is just one case cited in the book. The Gospels tell us that Jesus cured the centurion’s servant….\n\n","date":"November 16, 2013 at 10:04 am","url":"https://shroudstory.com/2013/11/15/copy-of-the-shroud-of-turin-in-new-jersey/","cat":"news_&_views","id":"comment-51610","author":"Louis","site":"shroudstory"},{"title":"Copy of the Shroud of Turin in New Jersey","post":"“the fact that it came into physical contact with the Holy Shroud of Turin. When it was removed it was found that the wound in the side, as it is seen on the Holy Shroud had become damp as though with blood, and that this effusion had stained the copy.” Facts again… how we learn to dread them. Is there any evidence for this statement of any kind whatever?\n\n","date":"November 16, 2013 at 9:22 am","url":"https://shroudstory.com/2013/11/15/copy-of-the-shroud-of-turin-in-new-jersey/","cat":"news_&_views","id":"comment-51603","author":"Hugh Farey","site":"shroudstory"},{"title":"Copy of the Shroud of Turin in New Jersey","post":"\nHugh Farey :\n“the fact that it came into physical contact with the Holy Shroud of Turin. When it was removed it was found that the wound in the side, as it is seen on the Holy Shroud had become damp as though with blood, and that this effusion had stained the copy.” Facts again… how we learn to dread them. Is there any evidence for this statement of any kind whatever?\n\nWhich part?\n\n","date":"November 16, 2013 at 9:46 am","url":"https://shroudstory.com/2013/11/15/copy-of-the-shroud-of-turin-in-new-jersey/","cat":"news_&_views","id":"comment-51608","author":"Kelly Kearse","site":"shroudstory"},{"title":"Copy of the Shroud of Turin in New Jersey","post":"All of it. It is supposed that this painting came into physical contact with the shroud in 1634. It is supposed that on removal part of it was wet. (“As though with blood.” Does that mean it was red? Odd choice of words) It is supposed that this effusion (“Effusion?” From where?) had stained the copy. The English words read like a translation from Latin or French. Who wrote about it, when, and where can the primary source be found? In 1987, Fred Zugibe, among others (who?) affirmed that the stain was indeed that of human blood and of the same blood type as on the Holy Shroud (No longer “as though with blood” note, now plain “blood”). Where is their report?\n\n","date":"November 16, 2013 at 10:05 am","url":"https://shroudstory.com/2013/11/15/copy-of-the-shroud-of-turin-in-new-jersey/","cat":"news_&_views","id":"comment-51611","author":"Hugh Farey","site":"shroudstory"},{"title":"Copy of the Shroud of Turin in New Jersey","post":"Hugh.You have made the right points. This is how relic cults work – the myths just develop, as it appears that Zugibe developed this one, and their origins can no longer be traced but if people want to believe that they are miracles they will and the story will go on growing. \nI am glad that Kelly has told us that he believes in the possibility of miracles because that helps understand his approach.Any event for which one can not find a physical explanation  can  potentially be the result of a miracle. So if, as yet, we have no scientific explanation for the images on the Shroud , Kelly can keep open the possibility that they are the result of some miracle.\nHard-nosed Brits like myself, living in a country that simply gathered up all relics and burned them in the 1530s, take another approach – we don’t understand ‘x’ but there are lots of things we didn’t understand in the past, we do understand now as a result of scientific developments, so why not the Shroud?\nThis does not mean that relic cults, the way they arise and grow and why some become worldwide phenomena and others disappear is not a fascinating topic- at least fascinating enough for me to have spent many months researching and writing about it. I repeat that I am delighted that the Shroud has been behaving like a good medieval relic should and transferred itself onto a copy that has now achieved veneration in its own right with a storyline that seems to have been boosted further by Fred Zugibe. What will we be saying about the Shroud in fifty years time or will it be one of those cults that simply disappear like so many others in history?\n\n","date":"November 16, 2013 at 10:28 am","url":"https://shroudstory.com/2013/11/15/copy-of-the-shroud-of-turin-in-new-jersey/","cat":"news_&_views","id":"comment-51615","author":"Charles Freeman","site":"shroudstory"},{"title":"Copy of the Shroud of Turin in New Jersey","post":"\nHugh Farey :\nAll of it. It is supposed that this painting came into physical contact with the shroud in 1634. It is supposed that on removal part of it was wet. (“As though with blood.” Does that mean it was red? Odd choice of words) It is supposed that this effusion (“Effusion?” From where?) had stained the copy. The English words read like a translation from Latin or French. Who wrote about it, when, and where can the primary source be found? In 1987, Fred Zugibe, among others (who?) affirmed that the stain was indeed that of human blood and of the same blood type as on the Holy Shroud (No longer “as though with blood” note, now plain “blood”). Where is their report?\n\nHugh, I was only pulling your leg.  Search this blog with the word megalopolis.  I suggest contacting Sister directly if you’re truly interested.\n\n","date":"November 16, 2013 at 10:25 am","url":"https://shroudstory.com/2013/11/15/copy-of-the-shroud-of-turin-in-new-jersey/","cat":"news_&_views","id":"comment-51613","author":"Kelly Kearse","site":"shroudstory"},{"title":"Copy of the Shroud of Turin in New Jersey","post":"\nCharles Freeman :\nHugh.You have made the right points. This is how relic cults work – the myths just develop, as it appears that Zugibe developed this one, and their origins can no longer be traced but if people want to believe that they are miracles they will and the story will go on growing.\nI am glad that Kelly has told us that he believes in the possibility of miracles because that helps understand his approach.Any event for which one can not find a physical explanation  can  potentially be the result of a miracle. So if, as yet, we have no scientific explanation for the images on the Shroud , Kelly can keep open the possibility that they are the result of some miracle.\nHard-nosed Brits like myself, living in a country that simply gathered up all relics and burned them in the 1530s, take another approach – we don’t understand ‘x’ but there are lots of things we didn’t understand in the past, we do understand now as a result of scientific developments, so why not the Shroud?\nThis does not mean that relic cults, the way they arise and grow and why some become worldwide phenomena and others disappear is not a fascinating topic- at least fascinating enough for me to have spent many months researching and writing about it. I repeat that I am delighted that the Shroud has been behaving like a good medieval relic should and transferred itself onto a copy that has now achieved veneration in its own right with a storyline that seems to have been boosted further by Fred Zugibe. What will we be saying about the Shroud in fifty years time or will it be one of those cults that simply disappear like so many others in history?\n\nCharles, you may be a gifted writer, but even talent falls short of being able to twist another’s words so far.  My words are what they are.  I wrote them, others can read them, as they can yours.  You asked what I thought, I told you.  I don’t need to grasp for straws to claim a miracle if the science doesn’t fit.  I choose to leave both possibilities open.  I choose to be objective.  There is a difference and you know it.    \nHard-nosed?  Want to put a honker to the real test?  Try evaluating from an objective viewpoint, without a preconceived foregone conclusion, working backwards, choosing with delight what supports one’s own ideas.  Dare to consider an alternative without being subjective. That’s where the real steel is, the other way is easy.\n\n","date":"November 16, 2013 at 10:52 am","url":"https://shroudstory.com/2013/11/15/copy-of-the-shroud-of-turin-in-new-jersey/","cat":"news_&_views","id":"comment-51620","author":"Kelly Kearse","site":"shroudstory"},{"title":"Copy of the Shroud of Turin in New Jersey","post":"The problem with the science is that there is as yet nothing to date the Shroud to that narrow window of 1-35 AD. So it is a question of leaving the question open,as I do, though I suspect the science will eventually come up with a ‘medieval’ solution, or come out in favour of authenticity. Clearly if one believes in the possibility of miracles then the lack of any scientific support for a first century date is not so important.\n\n","date":"November 16, 2013 at 11:18 am","url":"https://shroudstory.com/2013/11/15/copy-of-the-shroud-of-turin-in-new-jersey/","cat":"news_&_views","id":"comment-51622","author":"Charles Freeman","site":"shroudstory"},{"title":"Copy of the Shroud of Turin in New Jersey","post":"\nCharles Freeman :\nThe problem with the science is that there is as yet nothing to date the Shroud to that narrow window of 1-35 AD. So it is a question of leaving the question open,as I do, though I suspect the science will eventually come up with a ‘medieval’ solution, or come out in favour of authenticity. Clearly if one believes in the possibility of miracles then the lack of any scientific support for a first century date is not so important.\n\nAh, but there you are clearly mistaken that it is not so important, at least in my beliefs.  I do not view it that way. The lack of scientific support for a first century date is very, very important.  It is all important.  I don’t think it’s accurate to equate believing in the possibilities of miracles with discarding scientific evidence, it’s not the same thing.\nEven if the Shroud is authentic, I believe that image formation could have occurred by a completely naturalistic process-it’s a possibility I leave open.  Just as I do regarding a miraculous one, or some combination in between.  For me, miraculous doesn’t operate by default, if a scientific explanation about a process is incomplete, this may simply reflect the fact that the right set of experiments hasn’t been done yet.  It’s good to be a scientific Thomas, searching for the truth is what it is all about.  To a point, these types of arguments become circular and primarily reflect one’s own opinions & experiences.  Differences exist.  I’m not writing to convince you (or anyone else)-you asked what I thought, I told you, I’ll leave it at that.\n\n","date":"November 16, 2013 at 11:43 am","url":"https://shroudstory.com/2013/11/15/copy-of-the-shroud-of-turin-in-new-jersey/","cat":"news_&_views","id":"comment-51627","author":"Kelly Kearse","site":"shroudstory"}]
