[{"title":"Quote for Today: Ultimate Icon?","post":"Why would the 1978 “reprint” of a sceptical “Plain Truth” article on the Shroud appearing in US Catholic, need to be reprinted in 2014.  The quote in the above posting appears to add no information to our knowledge of the Shroud except some peculiar theological / biblical speculation, does not draw on any of the concurrent 1978 STURP investigations, nor of course on any subsequent investigations, not even the 1988 C-14 attempts to date it.  Nor of course with its somewhat pathetically subtle damning inference “forgers do forge” does it seem to offer any suggestion on how these nasty forgers went about their nefarious work.  And some 46 years we are still no wiser even now how they might have done it! A most peculiar reprint!  One might presume that the Jesuits were behind it, shades of Herbert Thurston!\n\n","date":"June 4, 2014 at 6:16 am","url":"https://shroudstory.com/2014/06/04/quote-for-today-ultimate-icon/","cat":"quotations","id":"comment-126726","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Quote for Today: Ultimate Icon?","post":"“Can we believe that God Himself, knowing the inevitable misuse and the decline of true religion it would produce, would have given mankind for an icon, a relic, the very shroud in which Jesus was buried? ”\nYes, absolutely He does. God doesn’t stop a blessing because of potential misuse. We have Free choice for just that reason, people have free choice to do all kinds of abhorrent things because that same free choice gives others the potential to do great things. And talking of relics, “God was performing extraordinary miracles by the hands of Paul, so that handkerchiefs or aprons were even carried from his body to the sick, and the diseases left them and the evil spirits went out”(Acts 19:11-12)\n\n","date":"June 4, 2014 at 6:37 am","url":"https://shroudstory.com/2014/06/04/quote-for-today-ultimate-icon/","cat":"quotations","id":"comment-126730","author":"Mike M","site":"shroudstory"},{"title":"Quote for Today: Ultimate Icon?","post":"God did not hide the body of Moses, the people who buried him knew where they had placed him. The writer is publishing rubbish, the so-called “Tomb of David” is also a place of worship today.\nI met Herbert W. Armstrong and listened to a talk he gave soon after I graduated, having begun reading the “Plain Truth” since I was fifteen years old. He was a soft spoken, well-intentioned man, but I would add, also misled. The WCG should be respected for their views, however what is being said by them does not coincide with what we know today.\n\n","date":"June 4, 2014 at 11:04 am","url":"https://shroudstory.com/2014/06/04/quote-for-today-ultimate-icon/","cat":"quotations","id":"comment-126778","author":"Louis","site":"shroudstory"}]
