[{"title":"R.I.P. Ben Wiech","post":"Re: Wrist / Hand wounds.\nI’m fascinated by this aspect of the shroud. To me this aspect speaks of thermal effect, whether scorch etc. But if it’s scorch, then it is scorch off a real human body. Bas relief / statue wouldn’t show the finger bones, as statues / bas reliefs don’t show finger bones.\nBTW, I measured length from tip of finger to wrist / palm wound on Shroudscope, and with several attempts consistently hit around 12-13 cms. If I look to my hand, which is I guess average size (I’m 188cm / 90kg but my hands aren’t big), that puts the wound in the middle of the hand, NOT at the wrist, as is frequently argued.\nI’d be interested in people’s views.\n\n","date":"June 8, 2013 at 5:53 am","url":"https://shroudstory.com/2013/06/05/r-i-p-ben-wiech/","cat":"news_&_views","id":"comment-36425","author":"Matthias","site":"shroudstory"},{"title":"R.I.P. Ben Wiech","post":"Matthias, you are right. The finger bones DO speak of thermal effect AND a tightly wrapped-up bloody body.\nReminder of one of my previous posts: “The Sindon image is affected by several distortions strongly suggestive of rigor mortis such as head slightly bent forward, back curved and legs bent with raised knees etc. The unusually long arms and seemingly long fingers on the right hand imply both dislocation and uneven stretching at the arm level. \nThe latter distortions are a matter of “complex variable projective geometry” as the in-soaked long inner burial cloth (aka TS) shrank up and got somehow taut again – during the Sindon image formation process (through drying out when subjected to (myrrhic-)aloetic fumigation)– in conjunction with abducted-adducted arms counteracted rigor mortis.\nDuring the image formation process, the tightly pulled and compressed in-soaked long inner burial sheet  didn’t quite return to its natural size and shape as it got sort of taut again lengthwise through shrinking (through drying out). The uneven recording of the two arms imprint on the inner side of the burial cloth is due to the fact the deceased’s arms had been forced in rigor mortis from abduction to adduction thus creating sort of a counter-pressure to wrapping-up pressure. Through drying out and slight cloth-to-body pressure release, the arms mechanically tended to slightly raised again, this resulted in a specific image distortion not to be extended to the whole body imprint.”\n\n","date":"June 8, 2013 at 8:56 am","url":"https://shroudstory.com/2013/06/05/r-i-p-ben-wiech/","cat":"news_&_views","id":"comment-36433","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"R.I.P. Ben Wiech","post":"WRIST / HAND WOUNDs\nI’m interested in exploring this further if people have the inclination.\nAbove, I assumed that the obvious image of the finer bones argues for a thermally-generated image.\nHowever, having thought deeper, could the crucifixion have torn flesh from the hand, thus exposing the bones, which could hence have left the image via Maillard reaction?\nthoughts?\n\n","date":"June 9, 2013 at 12:15 am","url":"https://shroudstory.com/2013/06/05/r-i-p-ben-wiech/","cat":"news_&_views","id":"comment-36497","author":"Matthias","site":"shroudstory"},{"title":"R.I.P. Ben Wiech","post":"Fingers, no bones. Gas diffusion diffuse border / contact points highest contrast (“bones”). Gas diffusion consistent with small radius – high resolution/gradient (finger) large radius – low resolution/gradient (legs).\n\n","date":"June 9, 2013 at 5:41 am","url":"https://shroudstory.com/2013/06/05/r-i-p-ben-wiech/","cat":"news_&_views","id":"comment-36510","author":"anoxie","site":"shroudstory"},{"title":"R.I.P. Ben Wiech","post":"Anoxie – good argument except the ‘fingers’ are too long. That’s why I wondered if flesh could have been torn away from hands,revealing bones,and then imprintment via maillard?\n\n","date":"June 9, 2013 at 8:18 pm","url":"https://shroudstory.com/2013/06/05/r-i-p-ben-wiech/","cat":"news_&_views","id":"comment-36584","author":"matthias","site":"shroudstory"},{"title":"R.I.P. Ben Wiech","post":"How long ?\n\n","date":"June 13, 2013 at 1:58 pm","url":"https://shroudstory.com/2013/06/05/r-i-p-ben-wiech/","cat":"news_&_views","id":"comment-36875","author":"anoxie","site":"shroudstory"},{"title":"R.I.P. Ben Wiech","post":"Too bad, Ben Wiech could not agree TOO that the mind can fool us into NOT seeing things on the Shroud that maybe are REALLY there.\nThere is a blind spot in the human sight-and-brain coordination system that prevent to correctly see latent UNFAMILIAR images that are really there.\nToo bad he BLINDLINGLY relied on Jackson and Schwortz and others who are adamant in saying the partial coin imprints/ghost writings/flower head very faint decals aren’t there and can’t be there YET NOT BEING THE RIGHT EXPERTS to discriminate between falsely positive perception, falsely negative perception and misreading in terms of paleaographic or floral forms. How long pseudo-Shroud Science will prevail in the hands of the wrong experts?\n\n","date":"June 9, 2013 at 11:53 am","url":"https://shroudstory.com/2013/06/05/r-i-p-ben-wiech/","cat":"news_&_views","id":"comment-36551","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"R.I.P. Ben Wiech","post":"The hands fascinate me as well, especially that right hand with the elongated fingers. That index finger is very intriguing and I have often wondered what it is that we are seeing. Was Christ’s fingers dislocated from perhaps someone pulling on them to get his arms spread more easily?\nThat right hand is also under what I assume to be a draping effect from the raised left knee. Does this cause some sort of distortion? All the fingers of the right hand look as if they are sort of sweeping . I also wonder if there is a double exposure effect from the shroud loosening as Max asserts. Whatever it is I see it as evidence that is stronger for the argument of authenticity than for forgery. I don’t think it likely that a forger would get everything else with regards to the pathology of crucifixion and then completely get the right hand wrong.\nAs for bones, I am fairly certain I see bones in the palm of the hand. This is the back of the left hand. Of course, Christ just may have been very skinny (which looks to be consistent with the rest of the body to my eye as I don’t see any indication of fat let alone excess fat). I have seen the hand bones of folks who are just as skinny so I don’t think it unusual that I should see bones on the back of the palm.\nAlso, for where the nail wound comes out of the back of the palm – when I use the shroudscope tool to analyze the length from where I think the fingers meet the hand (this is the space between the middle finger and the ring finger – the point at which they meet) to where I think the nail hole is I get a different measurement depending on which image I look at. The negative image seems to yield a smaller measurement while the normal photograph yields a measurement more consistent with the back of my own thumb (meaning it’s entirely consistent with driving the nail straight through the hand at the base of the thumb).\nThe left hand looks entirely normal to me otherwise.\n\n","date":"June 10, 2013 at 1:46 pm","url":"https://shroudstory.com/2013/06/05/r-i-p-ben-wiech/","cat":"news_&_views","id":"comment-36637","author":"Chris","site":"shroudstory"}]
