[{"title":"Really? We must come to God by faith, not by sight?","post":"“Guest Author” is displaying naivety of the type that results in religion being depised as only for simpletons.  This totally untested fragment has got a long way to go before it can ever attain the record of tests applied to the Shroud of Turin.  \nFaith requires at least some rational basis if it is ever to be more than mere uninformed and unquestioning fanatacism.  This has been clearly expressed by Pope Benedict, and any number of other reputable theologians.  This has been never more true than it is at the present time with all the scientific understanding that our present knowledge enjoys.  The old tired formulae quite properly find no response in modern man, and an appeal to his intelligence is now demanded, more so than ever before.  \nThere are many roads to attaining that faith.  Some will respond to the simple message of the gospel, others may be more impressed by the life example of Christians they may know, others may find it satisfies a spiritual yearning, some perhaps by philosophical argument.  The Shroud is regarded by many as a love-letter from Jesus comprehensible only in our own present age through the discoveries of modern technology.  Although it is has endured for centuries, perhaps it was meant just for our own time of questioning and doubt. \nI have little time for self-satisfied religious smugness which proclaims it has a faith, “I’m all right, Jack.  My faith is sufficient for me. Wallow in your unbelief.”  That is not the Christian message, nor is it the commission given to any apostle.\n\n","date":"September 21, 2012 at 7:26 am","url":"https://shroudstory.com/2012/09/21/really-we-must-come-to-god-by-faith-not-by-sight/","cat":"news_&_views","id":"comment-16660","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Really? We must come to God by faith, not by sight?","post":"Fr. Dunn is right about the papyrus announced by Karen King without making the necessary verifications first and presenting nothing really new in this field and, worse, claiming that that the discussion emerged among the primitive Christians when it is clear that the distortions arose in fringe groups only after AD 150. As for proof about the Resurrection, one needs to only ponder about why Christianity went beyond the first century.\n\n","date":"September 21, 2012 at 8:33 am","url":"https://shroudstory.com/2012/09/21/really-we-must-come-to-god-by-faith-not-by-sight/","cat":"news_&_views","id":"comment-16669","author":"Louis","site":"shroudstory"},{"title":"Really? We must come to God by faith, not by sight?","post":"Just because someone ‘found’ a papyrus is completely meaningless.  From where did it come?  When & by whom was it written?  It is a fact that there were many specious writings n the first 3-4 centuries of the Church.  That’s the precise reason why it was the Church which canonized (selected and identified) Scripture as early as the 360s and as late as the early 400s.  Theologically and historically speaking, this ‘find’ means nothing.\n\n","date":"September 21, 2012 at 11:13 am","url":"https://shroudstory.com/2012/09/21/really-we-must-come-to-god-by-faith-not-by-sight/","cat":"news_&_views","id":"comment-16685","author":"Andy Weiss","site":"shroudstory"},{"title":"Really? We must come to God by faith, not by sight?","post":"There are several informative URLs about this fragment Dan listed in his previous posting on the topic.  My own comments there attempted to provide a terse summary of these and my own interpretation of its significance. \nThe experts allow that even if carbon testing on the papyrus shows a 4th century date, this is not necessarily significant as the material is readily available on the black market.  Tests are now proceeding on the ink which should show whether it is authentic or a forgery.  It may be significant that the owner, whoever it might be is said to have expressed an interest in selling it.     \nShould the fragment prove to be authentic, I have surmised that it may well be a copy of an attempt to resolve a 2nd century conflict within some gnostic sect on whether marriage may be a valid option for its members or not, in view of the early expectation of the parousia.  By asserting that Jesus was himself married, the writer would be attempting to validate marriage.  The fragment cannot inform that Jesus was himself married, as the assertion is very likely spurious\n\n","date":"September 21, 2012 at 4:01 pm","url":"https://shroudstory.com/2012/09/21/really-we-must-come-to-god-by-faith-not-by-sight/","cat":"news_&_views","id":"comment-16698","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Really? We must come to God by faith, not by sight?","post":"I have never understood this type of fideism as the only possible way to have faith (and of course this type of epistemological dichotomy is not what Hebrews 11:1 is talking about as it is often so misquoted as saying such). Did not the Apostles not believe until they saw the Risen Christ or the empty tomb? Did not St. Thomas not believe until Christ appeared before him? Did not Paul see Christ before he stopped persecuting and began preaching? What about the countless peoples who were brought to faith by seeing the miracles of the Apostles? I completely agree with daveb, that there are many things that can bring people to faith, and the Shroud of Turin is certainly one of them.\n\n","date":"September 22, 2012 at 8:49 pm","url":"https://shroudstory.com/2012/09/21/really-we-must-come-to-god-by-faith-not-by-sight/","cat":"news_&_views","id":"comment-16776","author":"ncalibey","site":"shroudstory"},{"title":"Really? We must come to God by faith, not by sight?","post":"And if the Shroud turns out to be the burial cloth of someone else than Christ, what will happened to the faith of those who would have found faith via this false relic ?\nThat’s precisely why the Catholic Church don’t want to use this cloth as a banner to convert people and IT’S A VERY GOOD THING !!!!\nA faith that is based on a material object is a very weak faith in my mind.  But of course, that’s just my personal opinion.\nAnyway, let me ask one important question to all of you :  IF science would prove one day beyond any reasonable doubt that the Shroud is really the burial cloth of someone else than Jesus of Nazareth, what would be the consequence of this news on your personal faith ???\nMy answer :  NOTHING.  I would just be very sad because this relic is a part of my reflection on the message of the Incarnation of God in our humanity and I couldn’t use it anymore for this.  But in the end, that would not change my belief in this idea that Jesus was human and divine and more importantly, that would not change anything to my belief that Jesus have really resurrected.  Also, I should add this important reflection of mine :  If the Shroud is really the Shroud of Christ (as I believe) and if the image on the cloth is really the product of a natural, chemical and biological process, I don’t see any good reason to think that this would mean that Jesus didn’t resurrect.  Most of the time when I debate with the supernatural fans of the Shroud, I have a sense that this is what they would conclude if the image would be proven to be 100% natural !  This is ridiculous…\n\n","date":"September 22, 2012 at 9:35 pm","url":"https://shroudstory.com/2012/09/21/really-we-must-come-to-god-by-faith-not-by-sight/","cat":"news_&_views","id":"comment-16779","author":"Yannick Clément","site":"shroudstory"},{"title":"Really? We must come to God by faith, not by sight?","post":"Yannick,\nFaith, as you probably know, comes from the Greek work pistis which means ‘loyalty’ or ‘trust’. It’s a developing relationship that grows over time in Christ; while one may need the Shroud to start, just as St. Thomas needed to see Christ himself, it can develop to the point where it will no longer need it.\n\n","date":"September 22, 2012 at 9:49 pm","url":"https://shroudstory.com/2012/09/21/really-we-must-come-to-god-by-faith-not-by-sight/","cat":"news_&_views","id":"comment-16780","author":"ncalibey","site":"shroudstory"},{"title":"Really? We must come to God by faith, not by sight?","post":"I think you’re right.  I think when it is a problem is when a person’s faith in Christ = his faith in the authenticity of the Shroud…  That’s where the danger lies when you start to get faith in Christ because of the Shroud.\n\n","date":"September 22, 2012 at 10:05 pm","url":"https://shroudstory.com/2012/09/21/really-we-must-come-to-god-by-faith-not-by-sight/","cat":"news_&_views","id":"comment-16781","author":"Yannick Clément","site":"shroudstory"},{"title":"Really? We must come to God by faith, not by sight?","post":"Neither Yannick Clement nor anyone else can identify a single crucifixion victim, among all the tens of thousands crucified, who was also crowned with a cap of thorns and left their burial cloths behind.  That is the clincher.  It is no-one else!  Get over it!\n\n","date":"September 23, 2012 at 2:03 am","url":"https://shroudstory.com/2012/09/21/really-we-must-come-to-god-by-faith-not-by-sight/","cat":"news_&_views","id":"comment-16788","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Really? We must come to God by faith, not by sight?","post":"Exactly Dave! I understand Yannick’s comment somewhat, but seriously with all we know of this Shroud; The points you just mentioned Dave, which the chances of anyone else suffering the exact wounds and these wounds matching exactly what we read in scriptures, as occurred to our Lord, has been calculated to be in the Billions to 1 (or something on that line). All the other evidence we have, even evidence that is not fully confirmed or evidence some people just will not accept; as in the pollen evidence for instance, which can place this Shroud in Jerusalem, in early spring, and even to a specific time of day, to me anyways, is enough to prove it’s provenance…\nThere is absolutley no ‘confirmed’ evidence that can say; This is not the Shroud that wrapped the historical Jesus in 1st century Judea…Everyone should by now, totally dismiss any radiocarbon testing done to date, which by the way was never evidence ‘on it’s own’, and is the only thing going against this Shroud. Which still dumbfounds me that we still hear about it and it is still mentioned! People should really get their heads out of the sand and do some research on radicarbon-dating and the fallacy that it is irrefutable as a testing method!…So in essence there is absolutely nothing against this shroud being authentic, and pages and pages of evidence actually showing it to be so.\nLets not forget that for some reason, someone decided this Shroud must be saved and maticulously cared for, for two millenia…Why would anyone care to save a ‘burial cloth’ with such reverence, for so long, if it was of no importance to humanity or simply someone elses?\nSo, I believe for one to say; “maybe it could turn out to be someone else”,  is simply rediculous.\nR\n\n","date":"September 23, 2012 at 5:36 pm","url":"https://shroudstory.com/2012/09/21/really-we-must-come-to-god-by-faith-not-by-sight/","cat":"news_&_views","id":"comment-16810","author":"Ron","site":"shroudstory"},{"title":"Really? We must come to God by faith, not by sight?","post":"You will have to read my upcoming paper that will precisely analyzed the question of the identity of the Shroud man my friend !  You’ll see that it is not so 100% evident as you seem to think that the man of the Shroud is Jesus of Nazareth.  When you make an analyze the subject with objectivity and without any bias, you come to one conclusion :  It is highly probable that the man of the Shroud is truly Jesus of Nazareth BUT there is also an open door (even if the opening is thin) that this man could be the victim of a forger who would have done his work with the corpse of a real crucified man most probably between the 5th and the beginning of the 8th century.  I came out of my reflection for this paper with this conclusion :  this last scenario is highly unlikely but NOT IMPOSSIBLE…  And if a new series of C14 dating on the Shroud that would be done properly and which would give a dating result in that particular era (between 400 and 700 A.D. more or less), then I’m sorry but this particular scenario would gain much credibility.\nAll this to say that :  Science will never be able to give a 100% positive identification of the Shroud man as being Jesus of Nazareth.  The best answer that science could give presently is a probability (that I judge very high) and never a certainty.  In fact, the only 100% sure conclusion that science could give us one day regarding the Shroud would be to discard completely the possibility that this could be the authentic Shroud of Jesus (if new unquestionable data that goes against the authenticity would come to light).\nIn other words, a positive identification by science will never be possible with a 100% degree of certainty while a negative identification by science  with almost a 100% degree of certainty COULD BE POSSIBLE ONE DAY (if new data would come to light, like a new C14 dating in many locations of the cloth that would give a date far from the 1st century but that would be include in the range of possible date given by Rogers : 1300-3000).  That’s the reality and we have to accept and live with this reality…\n\n","date":"September 23, 2012 at 6:23 pm","url":"https://shroudstory.com/2012/09/21/really-we-must-come-to-god-by-faith-not-by-sight/","cat":"news_&_views","id":"comment-16813","author":"Yannick Clément","site":"shroudstory"},{"title":"Really? We must come to God by faith, not by sight?","post":"I do not need yet another unduly prolix paper from the over-abundantly verbose YC to know precisely who the TSM is or who he is intended to be.  The probablitiy that it may be someone else is precisely zero!  He is apparently unaware that the emperor Constantine outlawed crucifixion as a state punishment in the year 337 AD.  Quantum Mechanics  asserts that there is indeed a finite probability that all the air molecules in Yannick’s bedroom may momentarily gather together in one corner and that’s about the probability that the TSM could be anyone else!  He is now saying that some smart forger in the 5th to 8th C had the technological ability to produce the likeness, when all we know of the Shroud only became available in the last 100 years or so.  He’s in Fantasyland!\n\n","date":"September 23, 2012 at 8:46 pm","url":"https://shroudstory.com/2012/09/21/really-we-must-come-to-god-by-faith-not-by-sight/","cat":"news_&_views","id":"comment-16823","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Really? We must come to God by faith, not by sight?","post":"Dave please calm down my friend and wait to read my complete upcoming paper (that will be finish surely in a couple of months), ok ???  Wait at least to read all my argumentation before jumping on the ceiling !  And remember my principal conclusion : It is highly probable that the man of the Shroud is truly Jesus of Nazareth…  \nExcuse me but if we want to stay scientifically sound and honest, we’re destinated to deal with probabilities and not certainties concerning the identity of the Shroud man and you could not change anything about that my friend. As I said, science will never be able to fully proof without any doubt if the Shroud man was really Jesus.  The only thing science could do would be to dispove this possibility beyond any reasonable doubt but remember that this negative conclusion is a very unlikely possibility because we both knows that the best probability (not a 100% certainty) is by far that the man of the Shroud is really Jesus…  So please, calm down !!!\n\n","date":"September 23, 2012 at 9:44 pm","url":"https://shroudstory.com/2012/09/21/really-we-must-come-to-god-by-faith-not-by-sight/","cat":"news_&_views","id":"comment-16826","author":"Yannick Clément","site":"shroudstory"},{"title":"Really? We must come to God by faith, not by sight?","post":"I just can’t believe some of the things you have just stated! A forger in the 5th  to 8th century? Yannick you yourself in your paper suggested the blood evidence is enough to disregard any forgery! WHat about the fact that the blood shows NO signs of disturbance, meaning the shroud was never ‘lifted’, ‘pulled’ or ‘fail’ from the corpse? How possibly could a forger pull this off? It is impossible. Furthermore I suggest you read some of my comments on C14 dating and how it is quite evident a new series of tests would result most likely in the same crap that came out last time. Reason; there has not been much progress with contamination issues and the Shroud would be far to contaminated to ever dream of getting a proper reading. Plus no one undertands the cause of the image and there are hypothesis out there, that if true, could cause the c14 to be skewwed by hundreds of years.\nR\n\n","date":"September 24, 2012 at 2:53 am","url":"https://shroudstory.com/2012/09/21/really-we-must-come-to-god-by-faith-not-by-sight/","cat":"news_&_views","id":"comment-16836","author":"Ron","site":"shroudstory"},{"title":"Really? We must come to God by faith, not by sight?","post":"I should have added that my faith does not rely on the Shroud, I have been with Christ since only a child, so if by some miracle this Shroud proves not to be of Christ’s, (which I feel very, very unlikely), it will not dampen my faithin the Lord.\nR\n\n","date":"September 23, 2012 at 5:42 pm","url":"https://shroudstory.com/2012/09/21/really-we-must-come-to-god-by-faith-not-by-sight/","cat":"news_&_views","id":"comment-16812","author":"Ron","site":"shroudstory"},{"title":"Really? We must come to God by faith, not by sight?","post":"Ron, the fact that you said “very unlikely” goes very well with my previous comment to Daveb and with my global conclusion of my upcoming paper.  That is a good thing you think like this and leave the door open to the possibility (real) that the Shroud COULD be the true burial cloth of anohter crucifixion victim other than Jesus of Nazareth.  This proves that your judgement is not so full of bias.  One good note for you !  Bravo !\n\n","date":"September 23, 2012 at 6:25 pm","url":"https://shroudstory.com/2012/09/21/really-we-must-come-to-god-by-faith-not-by-sight/","cat":"news_&_views","id":"comment-16814","author":"Yannick Clément","site":"shroudstory"},{"title":"Really? We must come to God by faith, not by sight?","post":"Rubbish!!\n\n","date":"September 23, 2012 at 8:47 pm","url":"https://shroudstory.com/2012/09/21/really-we-must-come-to-god-by-faith-not-by-sight/","cat":"news_&_views","id":"comment-16824","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Really? We must come to God by faith, not by sight?","post":"Calm down Dave or you’ll get a heart attack and I don’t want to have your death on my conscience !!!  HA HA HA !!!\n\n","date":"September 23, 2012 at 9:46 pm","url":"https://shroudstory.com/2012/09/21/really-we-must-come-to-god-by-faith-not-by-sight/","cat":"news_&_views","id":"comment-16827","author":"Yannick Clément","site":"shroudstory"},{"title":"Really? We must come to God by faith, not by sight?","post":"I guess you missed the word ‘miracle’ in there Yannick. Meaning to me anyways any chance this was a fluke of nature or a forgery is a big fat NIL….this is not a bias comment my friend, but one from extensive study of all writings on the attributes of the Shroud, my personal observations, logic and common sense.  Also I beg to differ in your idea that science could prove the Shroud inauthentic, there are way to many unknown variables for even science to come to a 100% conclusion, EVER.\nOh and I would just like to add, as to your comment above where you mention Roger’s age ranges of 1300 to 3000 years; He questimated this from the lack of vanillin in the Shroud threads; His dating meant the Shroud could be tentively dated anywhere from 1000bce to 700ad depending on the mean temperatures the Shroud had been exposed to over the centuries. So in essence your point makes no sense, as his dating can place the Shroud right in the 1st century.\nR\n\n","date":"September 24, 2012 at 3:18 am","url":"https://shroudstory.com/2012/09/21/really-we-must-come-to-god-by-faith-not-by-sight/","cat":"news_&_views","id":"comment-16837","author":"Ron","site":"shroudstory"},{"title":"Really? We must come to God by faith, not by sight?","post":"Ron, I don’t understand how you react sometimes !  You said one thing one day and then retract from what you say !  Incredible…  You called “very unlikely” (as it should be) the idea that the Shroud man can be someone else than Jesus and then you treat me as a complete stupid guy because I said to Dave that science CANNOT and WILL NEVER be able to prove that the Shroud man is really Jesus of Nazareth and say that the chance this Shroud was a fluke of nature or a forgery is a big fat NIL !  How can you reconcile these 2 statements from you ?  Maybe you are bipolar and you’re not aware of this ??? (this is a joke of course)\nI want to react also to what you say about Rogers alternative dating of the Shroud.  May I suggest you to read again his results that you wrote down in your comment ???  He said that the Shroud could have been woven ANYTIME between 1000 B.C. and 700 A.D. !!!  He NEVER states that the Shroud had been woven during the time of Christ as you seem to point out.  Rogers results only give the possibility that effectively the Shroud COULD have been woven during the time of Christ, which is completely different.\nAnd in your other comment, you question the possibility (very thin by the way) that I raised that a forger could have created the Shroud between the 5th to beginning of the 8th century while using a real crucified body to do so.  \nWHY ?  This scenario (which is “scenario #1” in my first paper) enters into the range of dates given by Rogers and his compatible with the FACT that the Shroud is a real burial cloth of a real crucified man and also with the FACT that the body image comes from some form of interaction between the dead body and the cloth (2 FACTS that I point out stronghly in my first paper on the subject).\nBecause of this, science today CANNOT completely discard this scenario (even if it appears highly unlikely to me and to you) and it’s truly important to recognize this as a FACT.\nMoral of this story :  WE HAVE TO KEEP AN OPEN-MIND ABOUT ALL THE 4 POSSIBLE SCENARIOS THAT ARE STILL ON THE TABLE AND THAT I DESCRIBED IN MY FIRST PAPER.\nAnd concerning the C14 dating, I’m sorry but right now, this method is still considered by the vast majority of the archaeologists on this planet as the best dating method for ancient artefact.  That doesn’t mean it is a perfect method (the dating of 1988 is a great proof of this and Meacham talk about all the potential problems related to this method in his book and in the paper he wrote on the subject in the 80s).  BUT we have to recognize that this method as been very useful in many occasions in the field of archaeology, so I’m not ready to dismiss it concerning the Shroud and I would certainly push hard on the Vatican for another series of C14 dating of the cloth but much more properly done this time…\n\n","date":"September 24, 2012 at 10:56 am","url":"https://shroudstory.com/2012/09/21/really-we-must-come-to-god-by-faith-not-by-sight/","cat":"news_&_views","id":"comment-16858","author":"Yannick Clément","site":"shroudstory"},{"title":"Really? We must come to God by faith, not by sight?","post":"YC; “Ron, I don’t understand how you react sometimes ! You said one thing one day and then retract from what you say ! Incredible…” -Yannick I think you should re-read my comment, as I think I make it very clear; IT would be a “miracle” if it could be someone else depicted on the Shroud. When I say “very very unlikely” in combination with “miracle”, I believe it should be taken as; there is NO CHANCE in hell!…So no retracting of my thoughts there….You should probably look in the mirror about the issue you accuse me of.\nYC; “He NEVER states that the Shroud had been woven during the time of Christ as you seem to point out. Rogers results only give the possibility that effectively the Shroud COULD have been woven during the time of Christ, which is completely different.” -Isn’t that exactly what I said? I am not in error with my comment. As Roger’s vanillin dates can place the Shroud’s manufacture in the 1st century! I never said Roger’s stated it was from the 1st century but that, it could be from the first century!…You should try re-reading your own previous comment, as it does not make sense and maybe you should read other’s comments a little slower, or maybe twice, as there may be a language barrier issue here.\nYC; “And in your other comment, you question the possibility (very thin by the way) that I raised that a forger could have created the Shroud between the 5th to beginning of the 8th century while using a real crucified body to do so.” – …The point Yannick was that if a forger used even a dead body, [How the hell did he get the Shroud off the body without disturbing the blood?] This fact, which you are well aware of (the blood not being disturbed) goes against any forgery attempt with a dead body or a statue or bas-relief, whatever! You’ve just been found in a contradiction my friend to prior statements. Furthermore to make this “dead body” sceanario even more impossible; How did this forger manage to create the image we see (with a dead body)? But then, manage to do so without any blurring of the image during the process of applying and removing the body using a 14 ft by 3.5ft shroud in the 4th to 8th century? …lets get real here! This is no different then the blood evidence ‘proving’ it was not a painting or work of art, as the blood was on the cloth first…Get my point now?\nYC; “And concerning the C14 dating, I’m sorry but right now, this method is still considered by the vast majority of the archaeologists on this planet as the best dating method for ancient artefact.” -…Now I know there is a language issue here! -I never said it wasn’t the best method ‘at present’, (which is arguable), just that it is not infallible, meaning it cannot be taken as a ‘end-all’ to any dating issue, especially with the UNKNOWN provenance of the Shroud and the contamination issue. I also believe you are in complete error about what archaeologists ACTUALLY believe when it comes to radiocarbon dating! They more then anyone are aware of the issues with the process and would be the first to back what I’ve stated. Stemming from your comments and especially your ‘generalization’ about archaeologists, you really need to better educate yourself with the process of radiocarbon dating, seriously!\nR\n\n","date":"September 24, 2012 at 5:23 pm","url":"https://shroudstory.com/2012/09/21/really-we-must-come-to-god-by-faith-not-by-sight/","cat":"news_&_views","id":"comment-16878","author":"Ron","site":"shroudstory"},{"title":"Really? We must come to God by faith, not by sight?","post":"Yannick: If you’ve made up your mind to write your paper on the identity of TSM, I suggest you check out the article I wrote on the same topic way back in June for the Parish magazine which I edit, Tawa Catholic News.  There may be something there which you can use.  Go to:\nhttp://tawacatholic.org.nz/wp-content/uploads/2011/08/TCN-Winter-2012.pdf\nThis will bring up the Winter issue of TCN.  Use the Zoom Out tool as the webmaster posted the issue big size.  Go to pp. 29-34, The Holy Shroud of Turin, 2) Identity – Whose image? By David Belz.   Or if you want, you can save the whole issue as a PDF for some bed-time reading.  Acknowledgements are always appreciated.  Daveb\n\n","date":"September 24, 2012 at 9:25 pm","url":"https://shroudstory.com/2012/09/21/really-we-must-come-to-god-by-faith-not-by-sight/","cat":"news_&_views","id":"comment-16883","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Really? We must come to God by faith, not by sight?","post":"Don’t worry Dave !  I already told you the other day that I was going to read it and I try to always do what I say I’ll do.  So, yes, I already read it and thought it was an interesting point of view but a bit too “partisan” and “incomplete”.  When you’ll read my upcoming paper, I’m sure you’ll understand why I say this…  In general, your paper was pretty good, but I think you shoud have left the door open (even if it was a very thin opening !!!) to the other 2 possible scenarios I describe in my first paper (scenario 1 and 2).  That’s what I think.  Please wait to read my upcoming paper and we’ll be able to discuss more in deep about all this.\n\n","date":"September 25, 2012 at 10:52 am","url":"https://shroudstory.com/2012/09/21/really-we-must-come-to-god-by-faith-not-by-sight/","cat":"news_&_views","id":"comment-16893","author":"Yannick Clément","site":"shroudstory"},{"title":"Really? We must come to God by faith, not by sight?","post":"Yannick, you have probably seen this image previously, but what are your thoughts on the NASA Chandra telescope image, B1509, titled “Hand of God.”\nGo to Google images and type B1509 Chandra image.  This neutron star appeared 1700 years ago.\nIf you exclude the hand, the face (eyes and long nose) look exactly like the face on the Shroud image.\n\n","date":"September 28, 2012 at 3:59 pm","url":"https://shroudstory.com/2012/09/21/really-we-must-come-to-god-by-faith-not-by-sight/","cat":"news_&_views","id":"comment-17031","author":"Angel","site":"shroudstory"},{"title":"Really? We must come to God by faith, not by sight?","post":"I can’t believe I actually saw a crown of thorns around the top of the “head”.  Astronomers claim it is a super-nova explosion.  I suppose they’re right??!!\n\n","date":"September 29, 2012 at 6:58 am","url":"https://shroudstory.com/2012/09/21/really-we-must-come-to-god-by-faith-not-by-sight/","cat":"news_&_views","id":"comment-17048","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Really? We must come to God by faith, not by sight?","post":"Dave, when this image was first introduced by NASA it was claimed the event happened 1700 years ago, as seen from this link.\nChandra :: Photo Album :: PSR B1509-58 :: How Old Is It?\nchandra.harvard.edu/photo/2009/b1509/how_old.html\nApr 8, 2009 – The age estimate for B1509 of 1700 years is given in Earth’s time-frame, … supernova explosion that created the pulsar about 1700 years ago (incidentally, … Put another way, in this image B1509 looks about 1700 years old. \nYet this site, with an enlarged picture, states this event occurred 17,000 years ago.\nhttp://redicecreations.com/article.php?id=6182\nThe colors, red, green, blue were added by NASA to detail areas of high and low energy.  The crown appears as low energy (red) and the hand high energy (blue).\nBest,\n\n","date":"September 29, 2012 at 12:49 pm","url":"https://shroudstory.com/2012/09/21/really-we-must-come-to-god-by-faith-not-by-sight/","cat":"news_&_views","id":"comment-17058","author":"Angel","site":"shroudstory"}]
