[{"title":"An important distinction in Catholic theology","post":"I see from shroud.com that one of Pope Emeritus Benedict XVI’s predecessors with the same name has been one of those who have referred to the Shroud as a ‘relic’ and affirmed its authenticity:\n1758 – Death of the very scholarly Pope Benedict XIV (Prosper Lambertini), who had written of the Shroud: ‘The Holy Shroud, that outstanding relic, is preserved at Turin. Popes Paul II (1464-1471); Sixtus IV (1471-1484); Julius II (1503-1513) and Clement VII (1523-1534) all bear witness that this is the same in which our Lord was wrapped.’ \nAm I correct in thinking that Shroud enthusiast Benedict XVI never went so far as to use the r word, and his successor certainly did not in his Easter Saturday address, so it’s not entirely clear why there is still a r-word alert in the MSM. BOTH Francis and his predecessor have been careful to use the term ‘icon’ surely?\nBenedict XVI referred to it an an “icon written in blood”. It was interesting to see another pro-authenticity Shroud enthusiast (David Rolfe) being willing to entertain the suggestion yesterday (with a hint of justification too) that the Shroud’s blood has been “touched up” over the centuries. One wonders what ABO blood group(s) might have been used for the ‘icon re-written in blood’. AB?\n\n","date":"April 9, 2013 at 6:04 am","url":"https://shroudstory.com/2013/04/09/an-important-distinction-in-catholic-theology/","cat":"news_&_views","id":"comment-30001","author":"colinsberry","site":"shroudstory"},{"title":"An important distinction in Catholic theology","post":"It may come as a surprise to some, but not everything that any Pope may say is to be considered as “infallible doctrine”.  Unless the statement meets certain rigid criteria, it can I think be only given the same weight as any such statement by a well-informed Catholic theologian, and such statements are not necessarily deemed to be infallible.  \nThe doctrine of infallibility, officially defined at the Vatican I council of 1870, says that when the Pope is officially defining church dogma, the Holy Spirit is also. There are three  requirements for infallibility to be invoked:\n1.  The pronouncement must be made by the official successor to Peter.\n2.  The subject matter must be in the area of faith and morals.\n3.  The Pope must be speaking ex cathedra (from the chair) of Peter, and must be intending to proclaim a doctine that binds the entire Church to assent.\nIf any one of the above 3 requirements is missing, the papal declaration is not considered to be an infallible doctrine.  Not everything the Pope says is infallible.\nThus any Pope may consider the Shroud to be the authentic burial cloth of Jesus Christ, or else he may prefer to refer it to as an icon, and he may write as such whatever.  As the matter is hardly to be considered one of “faith and morals” it is unlikely that even an official position would ever become binding as a matter of Catholic doctrine, regardless of whether the cloth’s authenticity be ever conclusively proved or not. In such matters, it is to be expected that the faithful will come to their own conclusions about where truth may rest according to how well they may be able to inform their individual consciences.  This implies a duty to become as well-informed as may be reasonable for the particular individual.\n\n","date":"April 9, 2013 at 7:08 am","url":"https://shroudstory.com/2013/04/09/an-important-distinction-in-catholic-theology/","cat":"news_&_views","id":"comment-30005","author":"daveb of wellington nz","site":"shroudstory"},{"title":"An important distinction in Catholic theology","post":"In other words – like the traffic lights in Rome – advisory only…\n\n","date":"April 9, 2013 at 7:42 am","url":"https://shroudstory.com/2013/04/09/an-important-distinction-in-catholic-theology/","cat":"news_&_views","id":"comment-30013","author":"colinsberry","site":"shroudstory"},{"title":"An important distinction in Catholic theology","post":"Walsh wrote a balanced report and it was obvious that the Pope was not speaking ex cathedra, just expressing his personal views. Curiously, no Shroudie expressed regret that Francis used the word “icon”, there having been indignation when that was exactly the word used by the late Cardinal Giovanni Saldarini, the papal custodian, when referring to the relic some years ago.\n\n","date":"April 9, 2013 at 10:52 am","url":"https://shroudstory.com/2013/04/09/an-important-distinction-in-catholic-theology/","cat":"news_&_views","id":"comment-30036","author":"Louis","site":"shroudstory"},{"title":"An important distinction in Catholic theology","post":"Re: Touching up the bloodstains on the Shroud, as only approximately 5% of the population are AB, if more than one person were involved, the random chance of recruiting medieval co-conspirators with a similar phenotype might require some divine assistance, or perhaps a tremendous amount of random luck.  \nIf a single individual (AB) was involved and one clings to the controversial notion that O blood may be the most likely as it is the oldest according to certain theories (discussed in previous threads)-such original blood would not be reactive with anti-A and anti-B antibodies in the original forward typing tests, and thus remain undetected.  Follow up studies using monoclonal antibodies developed against the core O-antigen, however, specifically indicated O antigens were not present in the bloodstained fibers of the Shroud that have been examined.  As anti-A and anti-B reactivity was approximately equivalent, this showed both A and B antigens were present with an assigned phenotype of AB.  This conclusion is from using forward typing methods, (some might argue reverse typing results support this, but as a negative result is expected, this argument becomes somewhat circular).  Molecular biology analysis looking at the genotype (DNA), if feasible, would confirm and extend the forward typing results.  \nIf this were a touchup job, then careful scrutiny of bloodstained fibers on the contact versus the reverse side of the cloth might reveal disparities in blood type, barring divine assistance or a very, very good luck of the draw (see opening sentence above).\n\n","date":"April 9, 2013 at 10:58 am","url":"https://shroudstory.com/2013/04/09/an-important-distinction-in-catholic-theology/","cat":"news_&_views","id":"comment-30038","author":"Kelly Kearse","site":"shroudstory"},{"title":"An important distinction in Catholic theology","post":"Kelly, can I ask your help here? If one were given a sample of blood which was actually of two different blood types combined, and tested it thinking it was of a single type, would there be a 67% probability that it would test AB? (or alternatively, if reverse tested, a 67% probability that it would test O?)\n\n","date":"April 9, 2013 at 12:36 pm","url":"https://shroudstory.com/2013/04/09/an-important-distinction-in-catholic-theology/","cat":"news_&_views","id":"comment-30052","author":"Hugh Farey","site":"shroudstory"},{"title":"An important distinction in Catholic theology","post":"Am glad that someone followed the argument. I lost it in the 2nd to 5th line of the second paragraph…   ;-(\n\n","date":"April 9, 2013 at 12:46 pm","url":"https://shroudstory.com/2013/04/09/an-important-distinction-in-catholic-theology/","cat":"news_&_views","id":"comment-30054","author":"colinsberry","site":"shroudstory"},{"title":"An important distinction in Catholic theology","post":"Concentrate, Colin, concentrate!\n\n","date":"April 9, 2013 at 3:42 pm","url":"https://shroudstory.com/2013/04/09/an-important-distinction-in-catholic-theology/","cat":"news_&_views","id":"comment-30075","author":"daveb of wellington nz","site":"shroudstory"},{"title":"An important distinction in Catholic theology","post":"Hugh,\nIt would depend on the type(s), but with mixture of A + B, approximately equal amounts from two different individuals, that would look similar to a single individual with AB.  \nThe forward & reverse tests, in general, are primarily qualitative.\nRegardin reverse tested, etc., look at Figure 7 here: http://www.shroud.com/pdfs/kearse.pdf\nThis shows what forward typing & reverse typing is based on.  To be classified as O by reverse typing, this would indicate that both anti-A (could be from either an O or a B individual) and anti-B (could be from either an O or an A individual) antibodies would exist in the serum.  Reverse typing in older samples could be pretty iffy-to provide a reaction they would have to remain functional, which is dependent upon conformation, etc.  They could be present but invisible in such a readout-like a rusted out car on the side of the road-it’s there, but doesn’t work.\nThe previous comment about anti-O refers to the fact that in the early going (mid 70s or so), anti-O reagents really weren’t available.  So, classifying that someone were type O (by forward typing) primarily relied on the failure to react with anti-A and anti-B testing reagents.\nSince the development of monoclonal antibodies, reagents that react directly with the O group have become available.\n\n","date":"April 9, 2013 at 1:52 pm","url":"https://shroudstory.com/2013/04/09/an-important-distinction-in-catholic-theology/","cat":"news_&_views","id":"comment-30062","author":"Kelly Kearse","site":"shroudstory"},{"title":"An important distinction in Catholic theology","post":"(removed: DRP)\n\n","date":"April 9, 2013 at 2:05 pm","url":"https://shroudstory.com/2013/04/09/an-important-distinction-in-catholic-theology/","cat":"news_&_views","id":"comment-30063","author":"colinsberry","site":"shroudstory"},{"title":"An important distinction in Catholic theology","post":"“If a single individual (AB) was involved and one clings to the controversial notion that O blood may be the most likely as it is the oldest according to certain theories (discussed in previous threads)-such original blood would not be reactive with anti-A and anti-B antibodies in the original forward typing tests, and thus remain undetected.”\nThe age of the AB blood type has been discussed previously on the blog, but the short version is:\nIn a popular diet fad, based on blood type (the D’Adamo theory), the suggestion is that O is the original blood type in human history, then blood type A, then blood type B, followed most recently by AB, only 1,000 or so years ago.  The point has been previously raised in the blog that the presence of AB blood on the Shroud could possibly be taken as evidence to indicate that it may not be authentic (as AB blood is a relative newcomer according to this theory).  \nThe D’Adamo theory is at direct odds with the conclusion from most DNA sequencing studies which indicate that the most ancient version of the ABO gene is A.  The next blood type that appears by human lineage is B, followed by O. (see previous discussion on the blog)\nTo apply this to the touch up scenario above, the original blood on the Shroud would be type O (as AB wasn’t around yet), and the later applied touch up would be type AB.  The original type O would have gone undetected in the original Shroud typing studies as only anti-A and anti-B antibodies were available, hence type AB-only the touch up would be positive. \n“Follow up studies using monoclonal antibodies developed against the core O-antigen, however, specifically indicated O antigens were not present in the bloodstained fibers of the Shroud that have been examined”\nThe original typing studies were subsequently followed up on with more recently developed antibodies, which can recognize the O blood type directly.  If the original blood on the Shroud would have been type O, it should have been detected here.  It wasn’t.\n\n","date":"April 9, 2013 at 7:40 pm","url":"https://shroudstory.com/2013/04/09/an-important-distinction-in-catholic-theology/","cat":"news_&_views","id":"comment-30096","author":"Kelly Kearse","site":"shroudstory"},{"title":"An important distinction in Catholic theology","post":"I don’t know where D’Adamo got his theory from. If you research this you seem to get back to evidence from Hungarian burial  archaeology but other than hearing a Hungarian professor dating AB to AD 900, partly on the grounds that AB has not be found in burials earlier than that and A and B groups have known to have mingled on the Hungarian plain around 900 and then Hungary went on to have the highest incidence of AB in Europe (over eight per cent), I have not got any further in finding academic backing. I am still looking I have ignored D’Adamo as I would not see him as a credible source in himself.\n\n","date":"April 10, 2013 at 12:51 pm","url":"https://shroudstory.com/2013/04/09/an-important-distinction-in-catholic-theology/","cat":"news_&_views","id":"comment-30220","author":"Charles Freeman","site":"shroudstory"},{"title":"An important distinction in Catholic theology","post":"(removed: DRP)\n\n","date":"April 9, 2013 at 7:48 pm","url":"https://shroudstory.com/2013/04/09/an-important-distinction-in-catholic-theology/","cat":"news_&_views","id":"comment-30098","author":"Kelly Kearse","site":"shroudstory"},{"title":"An important distinction in Catholic theology","post":"(removed: DRP)\n\n","date":"April 9, 2013 at 8:09 pm","url":"https://shroudstory.com/2013/04/09/an-important-distinction-in-catholic-theology/","cat":"news_&_views","id":"comment-30101","author":"colinsberry","site":"shroudstory"},{"title":"An important distinction in Catholic theology","post":"If you mix A and B you will have precipitation of the mixture which will painting difficult.\nand even leeches won’t help.\nType O is not the most old type as if it is contradicted by the very distinctions of type characteristics. The oldest is A, then B, then O and AB\n\n","date":"April 9, 2013 at 10:35 pm","url":"https://shroudstory.com/2013/04/09/an-important-distinction-in-catholic-theology/","cat":"news_&_views","id":"comment-30117","author":"jesterof","site":"shroudstory"},{"title":"An important distinction in Catholic theology","post":"Mixing fresh A & B blood yes, but I thought we were talking about a later touch up here, adding fresh blood to old blood, to the original bloodstains that had transferred much earlier.\n\n","date":"April 10, 2013 at 6:00 am","url":"https://shroudstory.com/2013/04/09/an-important-distinction-in-catholic-theology/","cat":"news_&_views","id":"comment-30172","author":"Kelly Kearse","site":"shroudstory"},{"title":"An important distinction in Catholic theology","post":"Charles Freeman has cycled his 900AD Hungarian theory as the source of AB blood types previously. It seems to be based on hearsay from a Hungarian professor, focusing only on Hungarian burials. It can only be relevant if a Hungarian, or at least Eastern European provenance can be postulated for the origin of the TS. Any survey of racially typed blood groups shows that group AB has been widely dispersed throughout many parts of the Old World (Africa, Middle East, Europe and Asia). Source:\nhttp://www.bloodbook.com/world-abo.html \nThere are only a few groups where it does not seem to have occurred recently. These include American (N & S) native populations, Australian aborigines, NZ Maori and Hawaiian and a few others. However it has been asserted elsewhere that there have been about five reversions to Group O from mixed groups during the course of humanoid and human history. It is interesting for example that Group AB is now rare or absent among Maori and Polynesian populations notwithstanding that anthropologists trace the early origins of these peoples (about 3000 BC) to China where AB is currently 13% (Peking) 6% (Canton). Groups A and B also occur in anthropoid apes, so it has been around a long time. AB is rare among Kikuyu 1%, but occurs at 5% of Bantu. \nShroud authenticists postulate a Middle East provenance for the Shroud, and the occurrence of AB in these populations is significant: Arabs 6%, Egyptians 8%, Armenians 6%, Georgians 4%, Persians 7%, Polish Jews 8%.  It is not credible that these AB populations have anything to do with any admixture of racial types in the Hungarian region of 900 AD. Charles should let it go instead of wasting our time on such irrelevance.\n\n","date":"April 11, 2013 at 2:43 am","url":"https://shroudstory.com/2013/04/09/an-important-distinction-in-catholic-theology/","cat":"news_&_views","id":"comment-30300","author":"daveb of wellington nz","site":"shroudstory"}]
