[{"title":"A Memorable Photograph Worth a Thousand Words","post":"That might be worth a little more than 1000.\n\n","date":"June 21, 2015 at 7:59 am","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","id":"comment-203060","author":"Dcn Andy","site":"shroudstory"},{"title":"A Memorable Photograph Worth a Thousand Words","post":"Question to answer (in my opinion): do you think the Pope would the will to caress in that manner the theca (built for custody of the Holy Shroud) if the cloth was just a painting?\n\n","date":"June 21, 2015 at 8:31 am","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","id":"comment-203064","author":"piero","site":"shroudstory"},{"title":"A Memorable Photograph Worth a Thousand Words","post":"Pope Francis speaks his mind. That gesture seems to say that he believes the relic is authentic but I have not seen any statement so far about his personal opinion.\nWe have also remember that a few days ago both the pontiff and Russian President Vladimir Putin, a practicing Russian Orthodox Christian, were photographed kissing an icon of the Virgin Mary in the Vatican.\n\n","date":"June 21, 2015 at 9:03 am","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","id":"comment-203066","author":"Louis","site":"shroudstory"},{"title":"A Memorable Photograph Worth a Thousand Words","post":"think Putin does this for political reasons…however..padre pio did say “before it’s over, Russia will teach americal something about conversion” …(or words to that effect)\n\n","date":"June 21, 2015 at 10:16 am","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","id":"comment-203075","author":"rick","site":"shroudstory"},{"title":"A Memorable Photograph Worth a Thousand Words","post":"“Pope Francis speaks his mind. That gesture seems to say that he believes the relic is authentic ”\nI have not the same interpretation of the gesture.\nIt seems to me that this gesture is the gesture of a pilgrim.\nPiero: “do you think the Pope would the will to caress in that manner the theca (built for custody of the Holy Shroud) if the cloth was just a painting?”\nNo, certainly not.\nBut the fact is that Pope Francis did not kneel before the Shroud, contrary to Benoit XVI and John Paul II.\nIs is significant? I don’t know.\n\n","date":"June 21, 2015 at 4:43 pm","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","id":"comment-203104","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"A Memorable Photograph Worth a Thousand Words","post":"“It seems to me that this gesture is the gesture of a pilgrim”\nThat is correct, but what goes on in the head of a pilgrim?\nI did notice that he did not kneel before the relic, he sat and prayed, meditated…. That was not surprising at all, at least to me. Not long ago I commented on this blog that Pope Francis is not devoted to relics and if he did say anything it would be about suffering, hope and redemption.\nPiero is also correct and the pontiff is a close friend of Archbishop Marcelo Sánchez Sorondo, chancellor of the Pontifical Academy of Science, also from Argentina.\n\n","date":"June 21, 2015 at 5:06 pm","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","id":"comment-203108","author":"Louis","site":"shroudstory"},{"title":"A Memorable Photograph Worth a Thousand Words","post":"Louis, where have you been?  Pope Francis I:  “By means of the Holy Shroud, the Unique and Supreme Word of God comes to us.”\nJust how clear would you like him to be?\nAs they say, “you could Google it.”\n\n","date":"June 21, 2015 at 6:07 pm","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","id":"comment-203113","author":"Nabber","site":"shroudstory"},{"title":"A Memorable Photograph Worth a Thousand Words","post":"Hi Nabber\nWhere have I been?\nI have been between working on a big academic book on Jesus and something on the Templars, also commenting on shroudstory.\nWhile it is not hard to understand how you feel, which is worthy of respect, my views are different. I am reposting here part of what I commented some days ago, but that does not make my faith less than yours!\nBest.\n“Everyone wants to know whether it is Jesus — who played the central role in history — who is the man seen on the Shroud.\nIf it really is Jesus, what is the message of the Shroud? If the image was formed in a natural manner, what will it tell us? We know what was done to Jesus. It is in the Gospels. Mahatma Gandhi literally broke into tears the first time he saw a crucifix, when he left London, where he was studying law at the Inner Temple, and went to Rome on holiday and visited the Sistine Chapel. It is doubtful if he knew something about the Shroud.\nIf supernatural agency was involved will it answer all our questions? It doesn’t seem so because science is telling us some things that clash with what is written in the Bible. There are things beyond the purview of the Bible and systematic theologians have not been able to answer questions that have been raised so far. We have to “rethink” what is meant by Monotheism. Is that heresy? No it is’nt. We must remember that Jesus said things that made people who heard him realise that he was presenting himself as someone different from the rest of mankind. He has his own views about God, Moses and Scripture. If the Shroud image was produced by supernatural means it will have to conform to these views.\nLife in the world is getting to be very uncomfortable, more people are now wondering if God exists and where he can be found. It has left even great biblical scholars thinking:\nhttps://www.academia.edu/12851672/The_Historical_Jesus_The_view_of_Professor_Geza_Vermes\nBut is not enough to just think of Jesus in terms of an existential spiritual legacy.”\n\n","date":"June 21, 2015 at 6:32 pm","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","id":"comment-203117","author":"Louis","site":"shroudstory"},{"title":"A Memorable Photograph Worth a Thousand Words","post":"Images to illustrate the comment:\nhttp://ministryvalues.com/index.php?option=com_content&task=view&id=2026&Itemid=4\n\n","date":"June 21, 2015 at 9:31 am","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","id":"comment-203072","author":"Louis","site":"shroudstory"},{"title":"A Memorable Photograph Worth a Thousand Words","post":"I always respect Pope Francis. He selected the longest day (for us shortest day) to visit the site. \nHope one day Pope Francis will make a comment of the Shroud.\n\n","date":"June 21, 2015 at 4:25 pm","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","id":"comment-203103","author":"Sampath Fernando","site":"shroudstory"},{"title":"A Memorable Photograph Worth a Thousand Words","post":"Sampath,  where have you been? Pope Francis I: “By means of the Holy Shroud, the Unique and Supreme Word of God comes to us.”\nJust how clear would you like him to be?\nAs they say, “you could Google it.”\n\n","date":"June 21, 2015 at 6:08 pm","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","id":"comment-203115","author":"Nabber","site":"shroudstory"},{"title":"A Memorable Photograph Worth a Thousand Words","post":"Thank you Nabber\n\n","date":"June 21, 2015 at 6:55 pm","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","id":"comment-203118","author":"Sampath Fernando","site":"shroudstory"},{"title":"A Memorable Photograph Worth a Thousand Words","post":"“The Unique and Supreme Word of God” comes to us in many different ways, natural and artificial, privately and publicly, including teaching, ceremony, and art, such as sculptures, paintings, icons and relics. I do not think Pope Francis is specifically identifying the Shroud as genuine or not in his pronouncement, any more than did his predecessors.\n“Just how clear would you like him to be?” Personally, I think his pronouncement was exactly as clear as I would like him to be.\n\n","date":"June 22, 2015 at 2:24 am","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","id":"comment-203150","author":"Hugh Farey","site":"shroudstory"},{"title":"A Memorable Photograph Worth a Thousand Words","post":"But Pope Francis was not talking about OTHER sculptures, paintings, icons, relics, nor has he said anything similar about them.  HF is a either thick, or purposely dissembling.  \nLet’s rearrange the Pope’s statement for those unable to diagram sentences:  “The Unique and Supreme Word of God comes to us by means of The Holy Shroud.”  He was as clear as he could be, except to those who desperately need to change the meaning of what the said…..\n\n","date":"June 22, 2015 at 7:47 am","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","id":"comment-203193","author":"Nabber","site":"shroudstory"},{"title":"A Memorable Photograph Worth a Thousand Words","post":"If (big IF) the Shroud is a 14th century artifact, Pope Francis’ words would still be relevant.\nIn the end, neither you, Hugh or I can read Pope Francis’ mind so it is pointless to play the game du jour of “What Francis really meant…”\n\n","date":"June 22, 2015 at 8:18 am","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","id":"comment-203194","author":"David Goulet","site":"shroudstory"},{"title":"A Memorable Photograph Worth a Thousand Words","post":"“HF is either thick, or purposely dissembling.” Charming. I beg to differ. It is clear to me, to DavidG, and to all the various commenters whose opinions have appeared in print, that Pope Francis, like his predecessors, was careful not to express an opinion as to whether the Shroud is the burial cloth of Christ or not. It is not clear to me, as David rightly says, whether Pope Francis actually thinks it is authentic or not. I don’t know. But I do know that it is not obvious from what he said. Nabber apparently thinks he knows, and apparently bases his knowledge on the Pope’s pronouncement that the Word of God comes to us by means of the Shroud. Well, good for him.\nBut that doesn’t mean HF is either thick, or purposely dissembling.\n\n","date":"June 22, 2015 at 8:56 am","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","id":"comment-203200","author":"Hugh Farey","site":"shroudstory"},{"title":"A Memorable Photograph Worth a Thousand Words","post":"As I commented on this blog about two months ago, my feeling was that Pope Francis would talk about suffering when he visited the Shroud exposition. Right enough:\n http://www.catholicherald.co.uk/news/2015/06/22/pope-francis-says-face-of-christ-on-shroud-pushes-us-towards-those-who-suffer/\n\n","date":"June 22, 2015 at 9:47 am","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","id":"comment-203210","author":"Louis","site":"shroudstory"},{"title":"A Memorable Photograph Worth a Thousand Words","post":"Evidently it does mean that.  It’s too bad that an American has to explain English to a Brit.  The UNIQUE and Supreme Word of God comes to us by _______ (fill in the blank).  Theologically, the answer could only be “Jesus” or “the Bible”, or as Pope Francis opines, “the Holy Shroud.”   Any other answer here would be some secular nonsense.  \nNow you are repeating nonsense again, re:  his predecessor Popes have failed to express an opinion?  Unbelievable.\nPope Pius XI “… certainly not the work of any human hand.”\nPope Pius XII “The linen in which Joseph of Arimathea enveloped the sacred remains of our Lord Jesus Christ.”\nPope John XXIII “This can only be the Lord’s own doing.”\nPope Paul VI “…The image from the Holy Shroud reveals to us the human and divine personality of Christ.”\nPope John Paul II “The Holy Shroud is the most splendid relic of the Passion and Resurrection.”\nPope Benedict XVI “…should be seen as a photographic document of the darkest mystery of faith — that of Christ’s crucifixion and resurrection.”\nAs we say in America, read ’em and weep….\n\n","date":"June 22, 2015 at 3:54 pm","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","id":"comment-203249","author":"Nabber","site":"shroudstory"},{"title":"A Memorable Photograph Worth a Thousand Words","post":"Not sure what one’s passport has to do with this discussion. Your first three Popes’ quotes clearly point to a belief in authenticity. The latter three do not. They would apply to 14th century relic equally as well.\nYou may want to try your hand at backgammon.\n\n","date":"June 22, 2015 at 4:00 pm","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","id":"comment-203251","author":"David Goulet","site":"shroudstory"},{"title":"A Memorable Photograph Worth a Thousand Words","post":"You may want to try your hand at interpreting English, David.  \nPope Paul VI “…The image from the Holy Shroud reveals to us the human and divine personality of Christ.”\nClearly, Paul VI is saying here, the Holy Shroud reveals to us the human and divine personality of Christ and that  theologically, then, nothing other than the Shroud and the New Testament reveal to us the human and divine personality of Christ. So being on an equal footing with the New Testament [according to Paul VI], the Shroud is Truth.  If a 14th century relic or other relic could have revealed such a thing, you would have had a declaration of such by another Pope.  You do not have such.\nPope John Paul II “The Holy Shroud is the most splendid relic of the Passion and Resurrection.”  \nIf you knew what the term “relic” meant to JP II, David, then you would understand what he meant by this statement.  Pity.  He also stated it as “THE most splendid relic” and not just “A relic”.\nPope Benedict XVI “…should be seen as a photographic document of the darkest mystery of faith — that of Christ’s crucifixion and resurrection.”\n“A Photo of Christ’s Crucifixion and Resurrection.”  Couldn’t be any more clear, and you’re saying that it is not is the height of disingenuousness.\n\n","date":"June 23, 2015 at 7:57 am","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","id":"comment-203346","author":"Nabber","site":"shroudstory"},{"title":"A Memorable Photograph Worth a Thousand Words","post":"Nabber you are a victim of confirmation bias. Do you know what crystal clear would be? If a Pope said ‘this relic is the authentic burial cloth of Christ’. This is essentially what the first three Popes you quoted have said, the latter three did not. Do the latter three see the relic as a profound icon of faith – absolutely. But did they outright declare it authentic – no. Period.\nI don’t understand why you are so adamant about what the Popes have said or not said. It doesn’t really matter unless you believe they have been privy to insider information. It is for each person to decide what they believe re: authenticity regardless of what a pontiff states.\nAnd please keep your accusations of disingenuousness to yourself. You are not my confessor nor my judge.\n\n","date":"June 23, 2015 at 8:54 am","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","id":"comment-203350","author":"David Goulet","site":"shroudstory"},{"title":"A Memorable Photograph Worth a Thousand Words","post":"In this case, I am the judge.  “..this relic is the authentic burial cloth of Christ”  is equal to “this is the most splendid relic of the Passion and Resurrection”, and if you can’t see it, you are in serious denial.  But then again, what would you care about what the Popes say?  They are nothing to you, or so the evidence shows.\n\n","date":"June 23, 2015 at 9:36 am","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","id":"comment-203352","author":"Nabber","site":"shroudstory"},{"title":"A Memorable Photograph Worth a Thousand Words","post":"Take it easy. Your last two sentences are a bit over the line. \n\n","date":"June 23, 2015 at 10:13 am","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","id":"comment-203354","author":"Dan","site":"shroudstory"},{"title":"A Memorable Photograph Worth a Thousand Words","post":"Got it, Dan.  But it’s seems peculiar that a member of the skeptic crowd really cares about what the Popes say, up until the point they think they can use the words….\n\n","date":"June 23, 2015 at 2:30 pm","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","id":"comment-203377","author":"Nabber","site":"shroudstory"},{"title":"A Memorable Photograph Worth a Thousand Words","post":"So now the Word became cloth?\n\n","date":"June 22, 2015 at 9:19 am","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","id":"comment-203204","author":"Louis","site":"shroudstory"},{"title":"A Memorable Photograph Worth a Thousand Words","post":"In Hebrew Davar means both “THing done” and  “THing spoken” or “Word” as it denotes both a message, promise, oracle, report or plan and a reality i.e. a thing that is done, a deed, an action. The TS man’s/Yeshua’s cloth is the memorial of an event in time of which much was spoken.\n\n","date":"June 22, 2015 at 9:40 am","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","id":"comment-203209","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Memorable Photograph Worth a Thousand Words","post":"Correct, but I was referring to ‘Word’ in the sense it is in the gospel of John, which is the way Pope Francis referred to it. The hebrew word can be employed in the sense of “an action”, the cloth depicting an event in time. It would be the “Word was resurrected”, at least from the believing Christian’s point of view.\n\n","date":"June 22, 2015 at 11:47 am","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","id":"comment-203229","author":"Louis","site":"shroudstory"},{"title":"A Memorable Photograph Worth a Thousand Words","post":"Actually in the gospel of John, the Greek Logos –that translates the Hebrew Davar– denotes the fulfillment of the messianic prophecy (what was spoken of the promised Massiah was done/fulfilled through Yeshu’a at least from the believing Christian’s viewpoint.\n\n","date":"June 22, 2015 at 5:46 pm","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","id":"comment-203267","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Memorable Photograph Worth a Thousand Words","post":"Quite correct. Davar/dabar/dabhar does have a link to “logos”. It is like wordplay, on which Father Jean Carmignac worked. That is fine for Christians. The big problem arises when it comes to what is meant by “messiah”, a concept that arose in 200 BC and that is another story.\n\n","date":"June 22, 2015 at 6:02 pm","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","id":"comment-203272","author":"Louis","site":"shroudstory"},{"title":"A Memorable Photograph Worth a Thousand Words","post":"Re the word Messiah: \nIt means “(the) anointed with crocodile fat”. It is derived from the ancient Egyptian “messeh” meaning “crocodile”. Apparently, pharaohs were anointed with crocodile fat. \nNow the Turin Shroud Man’s bloodied body WHOLE/ORIGINAL/UNDAMAGED image seen as an oversized Rorschach inkblot projective test could have evoked the pareidoliac image of a crocodile (“Crocodile Messiah”), in Greek drakkos, “dragon”. \nReminder:  “Dragon” (δράκων,) in the New Testament occurs only in The book of Revelation that is a vision from/of Yeshu’a the Messiah… \nMethinks John of Patmos used the TS man’s/Yeshua’s burial cloth bearing his faint fuzzy double bloodied body image as a projective support for mystic prophetic visions/responses. This is not coincidence at all either if in the Second Temple period the herring-bone weave pattern was symbolic of the living waters of the Torah and in the Book of Revelation Yeshu’a appears wearing a garment/robe soaked with/dipped in blood and his title was Ha-Davar, the Word (of G-od).\n\n","date":"June 23, 2015 at 3:47 am","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","id":"comment-203319","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Memorable Photograph Worth a Thousand Words","post":"Note: in the Book of Revelation, the Greek word used for robe/garment is… HIMATION (= SINDON).\n\n","date":"June 23, 2015 at 3:51 am","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","id":"comment-203320","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Memorable Photograph Worth a Thousand Words","post":"What about dormant pareidoliac imageplay as far as the TS is concerned to account for the Book of Revelation visions?\n(Actually, in the 1990s, I have done quite a research work on this. John’s Revelation can be read in cryptic conjunction i.e. in “primary/pareidoliac/projective visualisation” with the Shroud image as oversized Rorschach. “Sindonocryptographically” speaking, too bad the relic was damaged in the 1532 fire meaning a few of John’s visions are now lost on us).\n\n","date":"June 23, 2015 at 4:00 am","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","id":"comment-203322","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Memorable Photograph Worth a Thousand Words","post":"Telling hagiographic legends and Grail stories based on Yeshua’s oversized Rorschach inkblot test-like double bloodied image started respectively in the third c. CE and the 12th c. CE. The TS double bloodied body image does have such a potential and can be turned too into a projective backdrop that can re-capture John’s 1st c. CE apocalyptic visions.\n\n","date":"June 23, 2015 at 6:12 am","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","id":"comment-203334","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Memorable Photograph Worth a Thousand Words","post":"Actually the TS man’s/Yeshua’s double bloodied body imprint/image on his burial cloth (irrespective of the Coptic, Syriac and Byzantine secret liturgies) is worth a thousand and one Late Antique and Medieval  legends and stories…\n\n","date":"June 23, 2015 at 6:18 am","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","id":"comment-203335","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Memorable Photograph Worth a Thousand Words","post":"“He is clothed in a garment (Greek himation) soaked with blood,\nand (…) his name is the word (Hebrew ha-davar) of G-od.”\nsee The Book of Revelation 19: 11-18 and 21.\n\n","date":"June 23, 2015 at 6:31 am","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","id":"comment-203338","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Memorable Photograph Worth a Thousand Words","post":"I referred to “Messiah” because the intention was to point out the different interpretations that arose, and not only in connection with the Essenes. Questions 7 and 8 in the link below, which is an interview with the author of the most authoritative book on the topic “Messiah” today demonstrates how complex the interpretations were. J.J. Collins may have exaggerated in his interpretation of the scenario during the time of Jesus, which Fr. Fitzmyer accepts with reservations.:\nhttps://www.academia.edu/4700001/What_do_we_know_about_the_Bible_An_interview_with_Joseph_A._Fitzmyer_SJ\nIt does seem, however, that Richard Bauckham (Edinburgh) has made significant advances, providing us with a more convincing scenario.\nThis is a problem that continues till today and you may know that the Lubavitcher Hasidim community interpreted their rebbe’s partial paralysis as an indication of Isaiah’s “suffering servant”.\nAs for the book of Revelation, as you surely know it is highly complex and the interpretations are many, therefore the need to tread carefully. It was controvesial right from the beginning, not having been included in the Peshitta (the Syriac New Testament) initially and became part of the canon only later. It is very likely that the gnostic influence was strong.\nYet, the line you are taking is interesting and, who knows, may yield more results in the future.\n\n","date":"June 23, 2015 at 10:51 am","url":"https://shroudstory.com/2015/06/21/a-memorable-photograph-worth-a-thousand-words/","cat":"2015","id":"comment-203359","author":"Louis","site":"shroudstory"}]
