[{"title":"David Roemer’s Rejected Paper","post":"Well, I suppose I asked for it, so here goes.\nThe reason this paper was rejected by conferences on the Shroud of Turin is because this paper is not about the Shroud of Turin. The word Shroud occurs 15 times, the first 13 times before the end of the opening paragraph. The rest of the paper does not concern itself in any way with the Shroud.\nBut what of the opening paragraph? We learn that Robert Drews thinks Gnostics created the Shroud. We learn that Thomas de Wesselow thinks the Shroud to be a natural formation. We learn that many people think the Shroud is authentic. These ideas are not expanded upon or explored in any way, except with the statement: “images are always created by human beings and no one has been able to explain how a corpse could produce such a detailed blood-stained image on that large piece of linen.” The first part is patently untrue and the second, an argument from ignorance. I have devoted several posts to explaining that “no one knows how it was done” is not an argument against a 13th century origin, but it is equally not an argument against authenticity either. \nThe opening paragraph ends with the intriguing suggestion that “the authors, by the way, are using the authenticity of the Shroud to give an historical explanation for the Resurrection of Jesus.” The authors in question are not specified, and the Resurrection is not further mentioned in the paper.\nThe rest of the essay is a trivial explanation of the nature of human inquiry, and the theological implications of the Big Bang model.\nNeither the title of this essay nor its abstract adequately reflect the paper itself. I’m not in the least surprised it was rejected.\n\n","date":"July 15, 2014 at 10:08 am","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","id":"comment-138490","author":"Hugh Farey","site":"shroudstory"},{"title":"David Roemer’s Rejected Paper","post":"I think it is Dolan who should have reported Roemer to the CDF not the other way around.\n\n","date":"July 15, 2014 at 10:41 am","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","id":"comment-138495","author":"David Goulet","site":"shroudstory"},{"title":"David Roemer’s Rejected Paper","post":"The Turin Shroud is not an article of faith.\n\n","date":"July 15, 2014 at 10:52 am","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","id":"comment-138496","author":"Louis","site":"shroudstory"},{"title":"David Roemer’s Rejected Paper","post":"I was being facetious. You are correct, of course.\n\n","date":"July 15, 2014 at 11:16 am","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","id":"comment-138498","author":"David Goulet","site":"shroudstory"},{"title":"David Roemer’s Rejected Paper","post":"Ok, David Goulet. I like your comments, you are straightforward.\nNow to David Roemer:\nIt is clear now why Cardinal Timothy Dolan, the people in charge at Saint Louis and Bari have rejected the paper. It says next to nothing about the Turin Shroud, it has more to do with physics and theology. I will go further: Even if the relic is “proved” to be authentic, that it does show something about the Resurrection, it will not answer all questions.\nThere is a lot in physics that is theoretical, so the Bing Bang theory proposed by Father Georges Lemaitre, the “Catholic priest” who Roemer refers to, may have to be changed. One sees Stephen Hawking proposing a theory, then changing his mind, knowing that answers are not easy. His big mistake was to mix science and theology, leading to scientism, so he did not really answer the question he himself had posed, as commented on another thread yesterday.\nIf David Roemer thinks that the TS is not authentic, fine, he is entitled to have that opinion,but then he should not write a paper as though it is about the relic, which it is not, and try to present it at Saint Louis and Bari.\nSome of the questions he is dwelling on have to be tackled, but not in the context of the Turin Shroud.\n\n","date":"July 15, 2014 at 11:37 am","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","id":"comment-138505","author":"Louis","site":"shroudstory"},{"title":"David Roemer’s Rejected Paper","post":"Just to keep the record straight, the reviewer rejected my paper because it said the Shroud is not authentic. I’v told Dario Petrie that I would not pursue my complaint against the conference with the IEEE if the reviewer’s comments were repudiated by the conference organizers.\nIf you read my paper between the lines, you will see that I indirectly referred to the Resurrection of Jesus by discussing the exorcisms of Jesus. They are both historical events and it makes no sense to ask if Jesus really cured people or if Jesus really rose from the dead. It is, of course, reasonable to ask whether or not Jesus is alive in a new life with God. I believe He is alive for five reasons: 1) The cosmological argument for God’s existence. 2) The Resurrection of Jesus. 3) The Shroud of Turin. 4) Jesus saved mankind for meaning. 5) people who think life ends in the grave with one exception I know of (Jean-Paul Sartre) don’t discuss the matter rationally, intelligently, and knowledgeably.\n\n","date":"July 15, 2014 at 7:17 pm","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","id":"comment-138577","author":"David Roemer","site":"shroudstory"},{"title":"David Roemer’s Rejected Paper","post":"No, this won’t do. Papers submitted to conferences on the Shroud should be about the Shroud, and not be irrelevant smoke-screens for a sub-text which has to be read between the lines. Besides which, you do not discuss the exorcisms of Jesus. Your sole statement about Jesus is: “it is an historical fact that Jesus was a healer and exorcist who did not charge for his services. This raises the question: Did Jesus heal anyone?” This is not a discussion, it is not even logical. \nIt seems that your principal message, both in this paper and in your other writings, is that “Jesus is alive in a new life with God.” This is admirable, and the more people who advocate it the better. However, nothing in your paper leads towards the effective delivery of this message. None of your five reasons are adequate in themselves, and none are explained, explored or even enlarged upon in your paper.\nAs your paper does not discuss the inauthenticity of the shroud, it is difficult to believe that it was rejected on those grounds.\n\n","date":"July 16, 2014 at 2:28 am","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","id":"comment-138635","author":"Hugh Farey","site":"shroudstory"},{"title":"David Roemer’s Rejected Paper","post":"David, give me permission to publish the rejection letter and let people decide for themselves.\n\n","date":"July 16, 2014 at 7:11 am","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","id":"comment-138692","author":"Dan","site":"shroudstory"},{"title":"David Roemer’s Rejected Paper","post":"You have my permission to publish the pdf file a gave you titled ATSI 2014.pdf.\n\n","date":"July 16, 2014 at 7:19 am","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","id":"comment-138694","author":"David Roemer","site":"shroudstory"},{"title":"David Roemer’s Rejected Paper","post":"Thank you, David. CLICK HERE to read the letter to David Roemer.\n\n","date":"July 16, 2014 at 8:05 am","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","id":"comment-138706","author":"Dan","site":"shroudstory"},{"title":"David Roemer’s Rejected Paper","post":"My mind was made up long before this latest spat (or is it recycled?). The difficulty I have is in composing a polite reply that contains the words “pretentious” and “drivel”.\n\n","date":"July 16, 2014 at 7:51 am","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","id":"comment-138701","author":"Colin Berry","site":"shroudstory"},{"title":"David Roemer’s Rejected Paper","post":"I can understand what David Roemer is saying because these are topics on which I write, however it does not seem appropriate to include them in a paper on the TS to be presented at Shroud conferences. There is a lot more in the box to be discussed, but I see no reason why this has to be done in the context of Shrouds studies.\n\n","date":"July 16, 2014 at 6:24 pm","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","id":"comment-138797","author":"Louis","site":"shroudstory"},{"title":"David Roemer’s Rejected Paper","post":"This is the review. If Dario Petrie doesn’t repudiate it, it will make the Italy Section of the IEEE look like idiots:  \nLet’s bring to the heart of the problem regarding the quality of the submitted paper: all aspects of the TS invariably calls into question the person of Jesus Christ. The fact that the TS has been conserved up to now could either imply that it is a fake that goes far back in time or it is the true linen in which the corpse of Jesus Christ was wrapped. Provided the second hypothesis, corroborated up to now by stockpiled evidence, is assumed, then the resurrection of Jesus Christ could tacitly be understood, because if it didn’t the TS would have been destroyed in the brief course of the corpse corruption. Of course, this is only an example of reasoning. Note that even the scientific thinking advances, as the case may be, involving educated guesses, with all due respect to those which turn off immediately with apodictic – paradoxically non-scientific – pose when the above-mentioned guesses apply, say, to the Shroud. What exactly regards Jesus Christ as Son of God, namely His identification with the risen Lord, invariably needs to be referred to His incarnation. This applies to any investigation, irrespective of whether the investigator is a worshipper or not. Contrary to a stagnant gnosis, there is a general consensus on regarding incarnation even from some attainable, practical aspects. This is the case when attention is paid to the available attestations of personally or collectively tangible, palpable, detectable, intelligible experiences, as well as purely terrestrial events and circumstances. As a consequence, any sagacious investigator that deals with this sensitive topic prefers not to get the still unresolved, vague – to the point of boredom! -, misleading problem, say, of the Big Bang in place! The resurrection and what revolves around this crucial event – this is the case for the Turin Shroud – has nothing to do, let’s say with different words, with the “Chief World Systems” and cannot give someone room to slightest hints, sterile and pointless appraisals, as well as pseudo-philosophical lucubration to any large extent. What is conclusively demanded is that the author might be prone to appropriately propose any starting conjecture, at will, before working out a self-consistent view of the matter; if not, the approach runs the risk to be a waste of time. Unfortunately, this is the case for the paper at hand.\nRoughly but bluntly speaking again, what caused the Big Bang, as well as taking a philosophical hike on derived issues, is not concern of this forum unless the investigation is, hypothetically speaking, so revised as to resolutely point, here and now, toward substantial, mature, convincing arguments focused on tentatively proving whether the TS is a fake or not. Since this is not realistically happening with reference to the paper under examination, then it is to be rejected without a second thought.\nSupportive of the above detrimental judgement are the following specific details:\n– there is a broad and valuable consensus in supporting the existence of God exactly through the Big Bang theory! This should have been adequately considered in the submitted paper, whatever the author’s persuasion;\n– the author seems to get theology and religions history mixed up.\n\n","date":"July 16, 2014 at 5:29 am","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","id":"comment-138668","author":"David Roemer","site":"shroudstory"},{"title":"David Roemer’s Rejected Paper","post":"‘The fact that the TS has been conserved up to now could either imply that it is a fake that goes far back in time or it is the true linen in which the corpse of Jesus Christ was wrapped.’\nNot quite true. In January 1390 the (anti-) pope Clement VII decreed that the Shroud might be exhibited at Lirey so long  as it was announced to the assembled crowds ‘in a loud and intelligible voice’ that ‘the Linen with the imprints is not the Shroud of Christ but a copy and representation made in imitation of the Shroud of the same Lord Jesus Christ.’ \nSix months later, June 1st,  there was a further papal bull in which indulgences were allowed to those who visited the Shroud at Lirey.\nThis implies that for reasons lost to us the Shroud was seen as an object of veneration as an icon might be. This would have been enough to justify its conservation.\nAs I have said before, we would love to know why exactly the Shroud was given this papal indulgence while at the same time being seen as not genuine. I have never seen anyone tackle this important issue.Too late to present it at either of the conferences.\n\n","date":"July 16, 2014 at 10:06 am","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","id":"comment-138723","author":"Charles Freeman","site":"shroudstory"},{"title":"David Roemer’s Rejected Paper","post":"David, there is nothing at all in the above peroration (which is itself only barely comprehensible) that suggests your paper was rejected because of its non-authenticity stance. The two key statements regarding your paper are:\n“The paper contains a series of confused considerations in the field of the philosophy of science which have nothing to do with the shroud and the research on its image.”\nThis is perfectly true.\n“What is conclusively demanded is that the author might be prone to appropriately propose any starting conjecture, at will, before working out a self-consistent view of the matter; if not, the approach runs the risk to be a waste of time. Unfortunately, this is the case for the paper at hand.”\nThis is clumsily written but suggests that a) you should propose a ‘starting conjecture,’ which you don’t, and that b) you explore ‘a self consistent view of the matter,’ which you also don’t.\nThere is no danger of the IEEE looking like idiots on the strength of this reaction.\n\n","date":"July 16, 2014 at 10:08 am","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","id":"comment-138724","author":"Hugh Farey","site":"shroudstory"},{"title":"David Roemer’s Rejected Paper","post":"“The fact that the TS has been conserved up to now could either imply that it is a fake that goes far back in time or it is the true linen in which the corpse of Jesus Christ was wrapped.\nProvided the second hypothesis, corroborated up to now by stockpiled evidence, is assumed, then the resurrection of Jesus Christ could tacitly be understood, because if it didn’t the TS would have been destroyed in the brief course of the corpse corruption.” \nMy paper says that the TS is a fake because that explains how the image got there. The reviewer is saying there is a “stockpile” of evidence for authenticity. This is pseudoscience because there is no evidence for authenticity. The reviewer then goes on to assume that the TS is authentic and indicates that this is evidence for the “resurrection of Jesus” because the TS was not destroyed. It is obvious to me that the reviewer is practicing pseudoscience to promote belief in life after death. This is the same thing that advocates of intelligent design (ID) do. I did not check, but I will bet that there are no papers in the IEEE Xplore Digital Library about ID. \n“Roughly but bluntly speaking again, what caused the Big Bang, as well as taking a philosophical hike on derived issues, is not concern of this forum unless the investigation is, hypothetically speaking, so revised as to resolutely point, here and now, toward substantial, mature, convincing arguments focused on tentatively proving whether the TS is a fake or not. Since this is not realistically happening with reference to the paper under examination, then it is to be rejected without a second thought.”\nMy paper fits into one of the “aspects” listed in the request for papers:  image formation,\nimage processing, dating, textile’s manufacturing, physicochemical aspects, forensic medicine, archaeology, history, philosophy, iconography.\n\n","date":"July 16, 2014 at 11:48 am","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","id":"comment-138736","author":"David Roemer","site":"shroudstory"},{"title":"David Roemer’s Rejected Paper","post":"The author of a paper knows what he wants it to mean, but the reader of the paper only understands what he can derive from it. There can be a wide discrepancy between the two. \nIn detail:\n“My paper says that the TS is a fake because that explains how the image got there.” Actually your paper says no such thing. Your sole contribution to ‘how the image got there’ is “images are always created by human beings and no one has been able to explain how a corpse could produce such a detailed blood-stained image on that large piece of linen,” which I have already commented on above.\n“The reviewer is saying there is a “stockpile” of evidence for authenticity. This is pseudoscience because there is no evidence for authenticity.” In the absence of common consensus, evidence may be brought forward to defend either interpretation of the Shroud, and there is indeed sufficient evidence for authenticity for the term ‘stockpile’ to be valid (if somewhat bizarre). Even if there were not, the statement would simply be false; it is not pseudoscience. And should the Shroud ever be definitively determined to be a fake, then the contrary evidence will still exist; it will just have to be re-interpreted.\n“The reviewer then goes on to assume that the TS is authentic and indicates that this is evidence for the “resurrection of Jesus” because the TS was not destroyed.” No, he doesn’t. He specifically conditionally says “provided the [authenticity hypothesis] is assumed,” then there is a priori evidence that the Shroud’s occupant did not lie in it for very long, which is evidence – not very strong, but evidence nonetheless – for the Resurrection.\n“It is obvious to me that the reviewer is practicing pseudoscience to promote belief in life after death.” What is obvious to you is not necessarily what is obvious to anybody else. It may well be that the reviewer believes that the Shroud is real evidence for the Resurrection, but he is careful not to say that, and one should not assume unstated beliefs. Even if he does believe it, you cannot demonstrate that his belief derives from the practice of pseudoscience. Your subsequent comment on ID is wholly irrelevant.\nNext you quote a passage from the reviewer without comment. Why? If I may paraphrase it: “What caused the Big Bang …  is no concern of this forum unless the investigation is … focused on tentatively proving whether the TS is a fake or not.” Your vague reference to the Big Bang had no relevance to the Shroud at all.\n“My paper fits into one of the “aspects” listed in the request for papers.” No, it doesn’t. Not one of the ten aspects you list is even mentioned in your paper, let alone discussed.\n\n","date":"July 16, 2014 at 1:40 pm","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","id":"comment-138750","author":"Hugh Farey","site":"shroudstory"},{"title":"David Roemer’s Rejected Paper","post":"The conflict between me and Hugh Farey is the same conflict that arises between advocates of the theory of intelligent design and mainstream biologists. One side says there is evidence for ID, and the other side says there is not. I am on the side of mainstream biologist. There is no evidence for ID, and ID advocates are being irrational. ID advocates are also failing at the level of intelligence. What ID advocates consider to be evidence is actually evidence that the universe is not intelligible. Religion causes so much anxiety that people are inhibited from thinking intelligently and rationally. All the evidence people think supports the authenticity of the Shroud, just supports the fact that it was created in the 1st century. There is no evidence for authenticity because detailed images, not outlines, always are created by humans. The atheists I named say the Shroud is authentic to explain away the Resurrection of Jesus, and Christians say the Shroud is authentic because they are weak in fundamental theology.\n\n","date":"July 16, 2014 at 3:39 pm","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","id":"comment-138765","author":"David Roemer","site":"shroudstory"},{"title":"David Roemer’s Rejected Paper","post":"David, you write, “There is no evidence for authenticity because detailed images, not outlines, always are created by humans.” I don’t believe it. Prove it. I think God does. Prove that he doesn’t. Address the objections that have been raised instead of continually repeating personal beliefs as though they are facts.  While I don’t agree with ID (ala Michael Behe), I don’t think its advocates are being irrational and/or failing at the level of intelligence. Comparing Hugh to these folk would be insulting if the comparison made any sense. It doesn’t and Hugh certainly understands that. You might think about it before responding further.\n\n","date":"July 16, 2014 at 5:07 pm","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","id":"comment-138779","author":"Dan","site":"shroudstory"},{"title":"David Roemer’s Rejected Paper","post":"You prove a proposition is true when you advance so much evidence that you can say honestly someone who disagrees has bad judgment. This is the evidence that the Shroud is a fake: All detailed images that exist were created by humans. If you don’t change your mind and agree with me, I will tell the IEEE that you have poor judgment and should not be reviewing any papers about the Shroud.\n\n","date":"July 16, 2014 at 5:20 pm","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","id":"comment-138785","author":"David Roemer","site":"shroudstory"},{"title":"David Roemer’s Rejected Paper","post":"Besides the fish image is more detailed than the shroud image and it is not “created by humans.”\n\n","date":"July 16, 2014 at 5:23 pm","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","id":"comment-138787","author":"Dan","site":"shroudstory"},{"title":"David Roemer’s Rejected Paper","post":"This is news to me. “Detailed” means there is shading. There are images of fish that are not just outlines of their bones?\n\n","date":"July 16, 2014 at 5:48 pm","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","id":"comment-138792","author":"David Roemer","site":"shroudstory"},{"title":"David Roemer’s Rejected Paper","post":"I’m sorry, David, but this is non-sense from beginning to end. If there is any conflict between us it is not chiefly ideological, but simply that I deplore your inability to say anything coherent. I agree with you that ID adherents are wrong, but I do not insult their intelligence. As numerous commenters have noted, here and elsewhere, evidence for a 1st century origin is usually considered prima facie evidence for authenticity, even if other interpretations are possible. “There is no evidence for authenticity because detailed images, not outlines, always are created by humans.” You give no evidence at all for this bland statement. Authenticists, of course, think that the image was created by a human, albeit deceased.\n“Christians say the Shroud is authentic because they are weak in fundamental theology.” This is an absurd generalisation. During the course of your comment you have called your opponents “failing at the level of intelligence,” “inhibited from thinking intelligently and rationally,” and “weak in fundamental theology.” These are wild and wholly unjustified comments. If you have anything worthwhile to say, you must say it with considerably more justification than petty insults against those you perceive disagree with you.\n\n","date":"July 16, 2014 at 5:19 pm","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","id":"comment-138783","author":"Hugh Farey","site":"shroudstory"},{"title":"David Roemer’s Rejected Paper","post":"The blind spot that atheists have is that they don’t understand the mind-body problem. There are four solutions to the mind-body problem: dualism, materialism, idealism, and it is a mystery. . . . [Balance of comment deleted. It is simply an unrelated litany of insults.]\n\n","date":"July 16, 2014 at 5:34 pm","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","id":"comment-138788","author":"David Roemer","site":"shroudstory"},{"title":"David Roemer’s Rejected Paper","post":"Whether atheists have a blind spot or not is not the issue. Have you anything to offer concerning the Shroud?\n\n","date":"July 17, 2014 at 6:51 pm","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","id":"comment-139012","author":"Hugh Farey","site":"shroudstory"},{"title":"David Roemer’s Rejected Paper","post":"@Hugh\nMy 2014 ATSI paper and slideshow explain why the Shroud is not authentic and why God did not cause the Big Bang. I can’t think of any way to make it clearer. If Cardinal Dolan had  accepted my invitation to present my analysis to an educated group of Catholics, the give and take of a discussion might have helped me and/or those people who say the Shroud is authentic and God caused the Big Bang.\n\n","date":"July 17, 2014 at 7:40 pm","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","id":"comment-139021","author":"David Roemer","site":"shroudstory"},{"title":"David Roemer’s Rejected Paper","post":"This is the nub of the discussion. Neither your paper nor your slideshow explain why the shroud is not authentic, nor why God did not cause the Bang Big, nor how these two are related. I do understand that you cannot think of a way of making your views clearer, and my advice must be to stop trying until you have thought of one. I, and I dare say others who read this site, would be happy to assist, but your views are so vague and amorphic that there is little to get a grip on.\n\n","date":"July 18, 2014 at 4:10 am","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","id":"comment-139100","author":"Hugh Farey","site":"shroudstory"},{"title":"David Roemer’s Rejected Paper","post":"I think David has not understood that the Shroud is not an article of faith. If there are Christians who mix the Shroud with fundamental theology that is a mistake. Relying on the authentication of the relic, as a prop for weak faith, is yet another problem.\n\n","date":"July 17, 2014 at 7:58 pm","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","id":"comment-139026","author":"Louis","site":"shroudstory"},{"title":"David Roemer’s Rejected Paper","post":"The big bang has its problems. If God did not cause it, who did? Was it Hawking’s “spontaneous creation”? If yes, then isn’t that scientism?\n\n","date":"July 17, 2014 at 8:02 pm","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","id":"comment-139029","author":"Louis","site":"shroudstory"},{"title":"David Roemer’s Rejected Paper","post":"When animals have nothing to do they go to sleep. Only humans ask questions, and just because they ask questions doesn’t mean there is an answer. The Big Bang is evidence that the universe is not intelligible, as I said in my paper and proved with a calculation.\n\n","date":"July 18, 2014 at 12:12 am","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","id":"comment-139062","author":"David Roemer","site":"shroudstory"},{"title":"David Roemer’s Rejected Paper","post":"“The Big Bang is evidence that the universe is not intelligible, as I said in my paper and proved with a calculation.” This is nonsense. The Big Bang, however accurate it may be as a model of the beginning of the universe, is one way of making the universe intelligible, not the reverse, and your calculation, estimating the density of a salt crystal sized universe, was not a proof. It was naive. The singularity from which the universe sprang, according to the model, was billions of times smaller, and denser, than your grain of salt.\n\n","date":"July 18, 2014 at 1:18 pm","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","id":"comment-139166","author":"Hugh Farey","site":"shroudstory"},{"title":"David Roemer’s Rejected Paper","post":"The Big Bang makes intelligible the expanding universe. However, it is evidence that the universe is not intelligible. How can we possible understand how a singularity produced 100 billion galaxies? The Big Bang is evidence that God does not exist. We know God exists because we hope or assume the universe is intelligible.\n\n","date":"July 18, 2014 at 2:33 pm","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","id":"comment-139173","author":"David Roemer","site":"shroudstory"},{"title":"David Roemer’s Rejected Paper","post":"“How can we possibly understand how a singularity produced 100 billion galaxies?” Some find it a problem, but physicists such as myself and many others have no intellectual difficulty, although it is an emotional enormity, I admit.\n“The Big Bang is evidence that God does not exist.” No it isn’t. It may be evidence of the working of God.\n“We know God exists because we hope or assume the universe is intelligible.” This doesn’t make sense, but if you mean that belief in the inherent comprehensibility of the universe implies belief in an overarching intelligibility-function which may be so indistinguishable from some concepts of God that we might as well identify the two, then I agree!\n\n","date":"July 18, 2014 at 3:37 pm","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","id":"comment-139180","author":"Hugh Farey","site":"shroudstory"},{"title":"David Roemer’s Rejected Paper","post":"No disagreement there, in the sense that many of our questions regarding the universe remain unanswered. Theories are proposed from time to time and even Hawking has changed his mind.\n\n","date":"July 18, 2014 at 12:55 pm","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","id":"comment-139160","author":"Louis","site":"shroudstory"},{"title":"David Roemer’s Rejected Paper","post":"David Roemer: The universe is not intelligible, many questions remain unanswered;\nhttps://www.academia.edu/5353803/God_science_and_religion_today\nChristians at least depart from this world with faith, faith in Jesus, not in Genesis.\n\n","date":"July 18, 2014 at 3:06 pm","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","id":"comment-139178","author":"Louis","site":"shroudstory"},{"title":"David Roemer’s Rejected Paper","post":"Not being able to answer questions does not mean that the universe is not inherently intelligible. Rationality is one of the fundamental characteristics of Catholic belief.\n\n","date":"July 18, 2014 at 3:39 pm","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","id":"comment-139181","author":"Hugh Farey","site":"shroudstory"},{"title":"David Roemer’s Rejected Paper","post":"Quite correct when it comes to rationality as fundamental in Catholic belief, demonstrated quite recently by Benedict XVI in his writings. One must also add that he brought the former “Der Spiegel” editor, ex-communist and fellow Bavarian Peter Seewald, a really hard nut to crack, back to his Catholic faith after an interview, for which Benedict refused to see any questions in advance! Some of the books published after these meetings can be seen at:\n   http://www.ignatius.com/Products/LIWO-H/light-of-the-world.aspx\nNow, we cannot forget that there are mysteries, and the word “mystery” is often employed in Catholic doctrine, even in prayers. That is honesty.\nFor the fundamentalists everything in the Bible is true, if not nothing is true. If something goes wrong, they lose their faith  and become anti-Christian, then go ahead and write books against Christianity. There are some former (fundamentalist) pastors in the US who did this.\nOn the other hand, science is also full of mysteries, there is no point in science trying to take the place of philosophy or religion, although many scientists would love to see that happen.\nStephen Hawking is a member of the Pontifical Academy of Sciences, and that goes to show his greatness, he knows that he may always have to change his mind, he recognises the mysteries in science That is being honest.\nAs the Anglican priest-scientist John Polkinghorne has said more than once, science has its limits. So we come to faith, and the faith in Jesus I mentioned has something to do with what Harnack wrote. You will find it in the end of the second last paragraph of the Introduction in the following interview:\nhttps://www.academia.edu/4700001/What_do_we_know_about_the_Bible_An_interview_with_Joseph_A._Fitzmyer_SJ\nThere is mystery, but there is also faith.\n\n","date":"July 18, 2014 at 4:21 pm","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","id":"comment-139186","author":"Louis","site":"shroudstory"}]
