[{"title":"Relic authenticates Shroud of Turin?","post":"Last Sept 21, as usual the Oviedo Sudarium was exhibited once again. I attended the mass in which it was shown and at the Cathedral’s shop I bought the proceedings of the Second Intenational Conference on the Oviedo Sudarium of 2007 (in Spanish).\nI have the feeling that while most of the reseach on the Shroud has been carried out in English, research on the Oviedo Sudarium has been in Spanish. In my view, this has been a major problem to connect and put in common all the amazing coincidences taht exist and also, the research lines followed.\nFor example, while reading the proceedings I have known that Ray Rogers analyzed and prepared a report for the Oviedo Ecclesiastic authorities on the Oviedo Sudarium. He sent it one month before passing way, after receiving some sample from Oviedo.\nThe point is that the content of his research is not related to chemistry but to another research line: the impact of natural radiation on the degradadtion of linen fibers!! (above mentioned proceedings, paper by Cesar Barta, pp 147 onwards)\nOut of the comparison of the fibers from the Sudarium with fibers from the Shroud and additional ancient cloths, he concludes that there is a high probability that both cloths (Sudarium and Shroud) may share the same geographical origin and also be of the same age.\nPerhaps the involvement of Rogers in the analysis of the Sudarium is widely known but for me at least, this is news and I would appreciate any indication of where this report by Rogers could be found.\n\n","date":"October 6, 2012 at 7:57 am","url":"https://shroudstory.com/2012/10/06/relic-authenticates-shroud-of-turin/","cat":"news_&_views","id":"comment-17256","author":"Gabriel","site":"shroudstory"},{"title":"Relic authenticates Shroud of Turin?","post":"I wasn’t aware Rogers did this study on the Sudarium.  Thanks for that information, Gabriel.  I will go to the one source who will probably know: Barrie Schwortz and will let you know what I find.\nPerhaps Guscuin’s work was the first on the Sudarium in English.  I would like to get that as I told Mark a couple days ago after being introduced to him by Yannick.  There have been others since such as Janice Bennett’s work, referenced here #3 (http://shroudnm.com/docs/SEAM-Turin-Shroud-Presentation-References.pdf) published in 2001 in English.  I have used this information in my talks on the Shroud since reading this most delightful book.\n\n","date":"October 6, 2012 at 9:09 am","url":"https://shroudstory.com/2012/10/06/relic-authenticates-shroud-of-turin/","cat":"news_&_views","id":"comment-17257","author":"Andy Weiss","site":"shroudstory"},{"title":"Relic authenticates Shroud of Turin?","post":"Check out this interesting article spurred on by a search for Mark Guscuin’s book originally from “Ireland’s Own” magazine. http://www.mysticsofthechurch.com/2010/03/sudarium-of-oviedo-and-shroud-of-turin.html\n\n","date":"October 6, 2012 at 9:19 am","url":"https://shroudstory.com/2012/10/06/relic-authenticates-shroud-of-turin/","cat":"news_&_views","id":"comment-17259","author":"Andy Weiss","site":"shroudstory"},{"title":"Relic authenticates Shroud of Turin?","post":"Gabriel ~ Is this the paper you are looking for?  http://www.shroud.com/pdfs/rogers9.pdf I found it using http://shroudnm.com/search.html to search Shroud.com.  If not, I’ll e-mail or better yet call Barrie.\n\n","date":"October 6, 2012 at 9:26 am","url":"https://shroudstory.com/2012/10/06/relic-authenticates-shroud-of-turin/","cat":"news_&_views","id":"comment-17260","author":"Andy Weiss","site":"shroudstory"},{"title":"Relic authenticates Shroud of Turin?","post":"Andy, thanks for the link. I guess that the report he sent to Oviedo was a development of the paper you mention, because the contents are similar. However, the final report included additional cloths but, surprisingly enough, this report seems to have been lost in Oviedo.\nTo me, however, the most important think is the way he opens to analyze the role of natural radiation on linens.\nCould we find the signature of heavy radiation events through history? http://phys.org/news/2012-06-tree-japanese-scientists-8th-century-mystery.html\nIf so, it would be helpful for datation and many other thinks too.Thanks again.\n\n","date":"October 6, 2012 at 12:46 pm","url":"https://shroudstory.com/2012/10/06/relic-authenticates-shroud-of-turin/","cat":"news_&_views","id":"comment-17270","author":"Gabriel","site":"shroudstory"},{"title":"Relic authenticates Shroud of Turin?","post":"Gabriel, think of the implications of the solar burst mentioned in your link http://phys.org/news/2012-06-tree-japanese-scientists-8th-century-mystery.html, to the c14 test results done on the Shroud!…It can be astronomical! …Was there anyother ‘bursts’, unknown to science in the last two millennium? Solar Flares that could raise questions to the practicality or precision of the radiocarbon dating method? It is well understood that not only solar bursts but volcanic activity, can also influence the rate of c14 isotopes in the atmosphere and these cannot be calculated properly into c14 equations…Just a thought in passing and something to ponder.\nR\n\n","date":"October 7, 2012 at 7:01 pm","url":"https://shroudstory.com/2012/10/06/relic-authenticates-shroud-of-turin/","cat":"news_&_views","id":"comment-17314","author":"Ron","site":"shroudstory"},{"title":"Relic authenticates Shroud of Turin?","post":"I was humorously thinking Colin Berry wouldn’t like this since he obviously has no respect for Ray Rogers.  Ray was known for being politically incorrect.  Who would be more politically incorrect, Ray or Colin?\n\n","date":"October 6, 2012 at 9:28 am","url":"https://shroudstory.com/2012/10/06/relic-authenticates-shroud-of-turin/","cat":"news_&_views","id":"comment-17261","author":"Andy Weiss","site":"shroudstory"},{"title":"Relic authenticates Shroud of Turin?","post":"Why didn’t Rogers write more on what he called “different kinds of radiation”?\n\n","date":"October 6, 2012 at 10:22 am","url":"https://shroudstory.com/2012/10/06/relic-authenticates-shroud-of-turin/","cat":"news_&_views","id":"comment-17264","author":"Louis","site":"shroudstory"},{"title":"Relic authenticates Shroud of Turin?","post":"\nLouis :\nWhy didn’t Rogers write more on what he called “different kinds of radiation”?\n\nThat would be impossible to answer unless Ray left us one before he passed away.\n\n","date":"October 8, 2012 at 6:28 pm","url":"https://shroudstory.com/2012/10/06/relic-authenticates-shroud-of-turin/","cat":"news_&_views","id":"comment-17342","author":"Andy Weiss","site":"shroudstory"}]
