[{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"This is an epochal post. Trash talking Shroud-deniers (how’s that for coining a phrase) like to label the STURP team results as pseudo-science even as they labor over their kitchen tea pots creating scorches of this and that.\nThe point of the article and book is that pseudo-science has become a meaningless phrase because it has been too broadly applied to too many endeavors that turn-out to be worthwhile even if they are not science at all. Pseudo-science is thus the McCarthyism of our age. Joe McCarthy so debased Communist as an epithet that it became impossible to use that term intelligently to describe what a Communist really is.\nThus Obama is a Marxist, Communist, fascist, Nazi, Hitlerite Stalinist all rolled up into one. (Actually, I don’t believe he is any of these.)\nWho is the pseudo-scientist: Colin Berry who throws the word around with abandon, or John Heller  who discovered the nature of the blood stains on the Shroud by using a microspectrophotometer? I might have an opinion, but the point is it’s better that we move epithets and deal with what is.\n\n","date":"March 4, 2013 at 9:43 am","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26395","author":"John Klotz","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"When I was doing my Biology degree (2000-2004), we were taught in the Philosophy of Science unit that philosophers of science had generally given up on the project of trying to demarcate what is “science” from “pseudoscience.” The problem was (as Dan mentions above), that the criteria proposed to demarcate “science” from “pseudoscience,” e.g. “testable,” “falsifiable,” “repeatable,” etc, would rule out as “pseudoscience” some fields generally regarded as “science,” e.g. string theory. And they would rule in as “science” some fields not generally regarded as science, e.g. Creation-Science. For example to claim that Creation-Science is “untestable” and “unfalsifiable” and then claim it has been tested and found to be false, would be self-contradictory.\nBut that does not prevent science polemicists claiming that an opposing position is “pseudoscience.” Their aim is to rule out in advance an opposing view so that it cannot get a fair hearing. That saves them doing the hard work of showing that an opposing view is wrong.\nAs regards Colin Berry claiming that the field of Shroud pro-authenticity (Sindonology) is “pseudoscience,” it would be helpful for him to state upfront his demarcation criteria of what he regards as “pseudoscience.” If it is any of the usual criteria, like “testable,” “falsifiable,” “repeatable,” then the Shroud pro-authenticity hypothesis would pass with flying colours.\nFor example, the 1988 radiocarbon dating of the Shroud showed that the Shroud pro-authenticity position is both “testable” and “falsifiable”. It was claimed in NATURE that “The results provide conclusive evidence that the linen of the Shroud of Turin is mediaeval … A.D. 1260-1390,” and therefore the Shroud could not be authentic. That is, the Shroud was tested and found to be false (or so the dating laboratories thought). \nIt would therefore be self-contradictory of Colin (and the Royal Society) to claim that Shroud pro-authenticity is “untestable” and “unfalsifiable” and yet regard the 1988 radiocarbon dating as having tested the Shroud’s authenticity and found it to be not authentic. \nAs regards “repeatable,” all that is required is that the major features of the Shroud are replicated using knowledge, materials and technology available in the 14th century. Some have in fact tried to do that but to date all have failed.\nIt might be argued that the theory that the Shroud’s image was caused by radiation emitted by Jesus’ resurrection fails the “repeatable” demarcation criterion. But some parts of mainstream science are not “repeatable,” e.g. the Big Bang and macroevolutionary events. And the theory that the Shroud’s image was caused by radiation emitted by Jesus’ resurrection is not essential to the Shroud pro-authenticity position.\nSo before Colin writes his letter to the Royal Society claiming that Shroud pro-authenticity (Sindonology) is a pseudoscience he should first clearly state his demarcation criteria of what he regards as “science” and “pseudoscience,” and then show objectively and non-circularly how Shroud pro-authenticity satisfied his “pseudoscience” demarcation criteria.\n\n","date":"March 4, 2013 at 10:58 am","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26402","author":"Stephen E. Jones","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"Good point, Stephen. I agree 100%. However, I would add that Shroud studies have not always followed the standards methods and protocols true scientific research is to keep to. Mainly after the works by the STURP generation.\nRegarding CB’s call to the RS, it is really amazing that now he does not want the RS to demonstrate the scorch theory (like a few months ago). No, he wants to involve the RS to analyze the blood-first theory which makes everything even more confusing.\nI sort of understand this move as an implicit admitance of the difficulties he has found with the scorch theory. This seems as he wanted someone else to take over his work, disappear from the scene, start blogging on the origin of the “euskaldunak”  and let someone else (RS) take the dialectic blows of his poor scorch theory. Good luck again Colin.\n\n","date":"March 4, 2013 at 2:31 pm","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26421","author":"Gabriel","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"Agreed. I was going to add that Shroud pro-authenticity has often published its findings and theories in peer-reviewed scientific journals, as STURP did; but by contrast Shroud anti-authenticity has rarely published its findings in peer-reviewed scientific journals. \nThe publication of the 1988 radiocarbon dating of the Shroud in NATURE might be the only occasion that Shroud anti-authenticity published its findings in a peer-reviewed scientific journal. And even then it is doubtful if that paper went through peer-review.\nBut it is not generally regarded as a demarcation criterion of science that a finding or theory must be published in a peer-reviewed scientific journal. For example, Charles Darwin’s theories of evolution by natural and sexual selection were not published in peer-reviewed scientific journals even though they did then exist. And Walter McCrone’s Shroud anti-authenticity findings and claims were only published in his own in-house journal THE MICROSCOPE.\nAlso, while not a demarcation criterion of science, a mark of good science is presenting one’s paper before one’s peers at scientific conferences. And Shroud pro-authenticity has held regular scientific conferences. On my bookshelf I have the proceedings of six such conferences. But Shroud anti-authenticity has never, as far as I am aware, ever held even one such scientific conference.\nSo on any objective criterion of good science, Shroud pro-authenticity passes with flying colours, and Shroud anti-authenticity only receives a bare pass, if that.\nAnother criterion of good science is the attitude of its proponents. Shroud pro-authenticity, for the most part, relies on evidence and argument, with personal attack being rare and frowned upon when it occurs. But Shroud anti-authenticity relies heavily on ad hominem attacks. For example, Harry Gove, in his book on the 1988 radiocarbon dating, ruled out of court Shroud pro-authenticity proponents like STURP, on the basis that they were all Christian believers (which wasn’t even true) and therefore biased in favour of the Shroud’s authenticity. But Gove, like most Shroud anti-authenticists, was blind to his own anti-Christian bias. Another example is a radio debate between Barrie Schwortz and Joe Nickell, where the latter relied heavily on ad hominem attacks against Shroud pro-authenticists, but Schwortz (a non-practicing Jew) simply presented the evidence for the Shroud’s authenticity.\nIndeed, if heavy reliance on ad hominem attacks is a mark of bad science in respect of the Shroud, then Colin himself is a prime example. Colin, for all his claims to be a scientist, seems unable to mount a rational argument without resorting to ad hominem attacks upon those he disagrees with. To me this is `body language’ which reveals that deep down Colin does not have confidence in his Shroud anti-authenticist position. Indeed, if I were Colin I would be embarrassed to draw the attention of the Royal Society to my blog!\n\n","date":"March 4, 2013 at 10:40 pm","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26472","author":"Stephen E. Jones","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"Another quote from Micheal Shermer, from the same source :\n” We can demarcate science from pseudoscience less by what science is and more by what scientists do. Science is a set of methods aimed at testing hypotheses and building theories.”\nAnd from Ray Rogers defining the scientific method :\n” Science is not “things.” It is a way of thinking. Classical Scientific Method is simply a method for objectively applying logic to the solution of problems. 1) The problem must be stated in clear terms, and obscure words must be defined clearly. The goal sought must also be stated clearly. 2) Everything known about the problem must be studied, and all references must be acknowledged. There must be no “hidden facts,” and it is not clever to “blind side” the opposition. Carefully planned observations should be made. Different methods of observation should be made when possible, and results must be checked for internal consistency and agreement with reported results. All observations must be taken seriously, until some justifiable and clearly stated reason can be found to eliminate any. 3) A “brainstorming” session, preferably with other workers familiar with the problem, should try to develop as many potential explanations (hypotheses) as possible (Method of Multiple Working Hypotheses), All hypotheses must be clearly stated. And 4), all of the hypotheses must be tested equally against the same, complete list of observations and facts. Testing may often involve making predictions on the basis of the hypotheses and testing the predictions by experiment. The Principle of Parsimony (Occam’s Razor) states that the hypothesis that includes the largest number of facts and observations will be closest to the truth. Hypotheses that do not accept many facts without “special pleading” should be discarded.”\nThis is science. What it is not, call it pseudoscience, bad science, no science, naïve observation, or whatever, it is not science.\nAnd we should keep in mind that concerning the shroud most data published by the STURP result from basic scientific observations.\n\n","date":"March 5, 2013 at 8:57 am","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26503","author":"anoxie","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"I’m in favor of Colin Berry’s idea of having the Royal Society of London become involved in shroud research. No one who thinks that the shroud is real should have any fear of the truth from wherever. The Royal Society would be fairly good at such an undertaking. I also think we might start with the question Colin raises about bloodstains and go from there. Eventually, the question of C14 will need to be addressed. Maybe the Royal Society can get Oxford involved.\nI do think it is a bit naïve to think that a letter from Colin will do the trick. I therefore propose to start a petition campaign at change.org. The whole shroud community including SSG, BTST and readers of this blog could electronically sign the petition encouraging Paul Nurse to become involved. We could invite CSICOP and other skeptical organizations to sign the petition as well. Get enough groups involved and the media will get involved. \nBTW: I’m a bit confused. Colin tells us that the “Royal Society’s [has a] current policy of confronting and exposing pseudo-science.” As evidence of this he quotes the BBC saying, “Sir Paul believes strongly that scientists have a duty to speak out about science in public life and challenge pseudoscience.” I was not aware that what Nurse opines is ex cathedra policy for the entire society. He must be one powerful dude.\nActually, Royal Society policy and policy work including confrontation “is organised around the following four themes.” 1)Sustainability, 2)Diplomacy, 3)Innovation and 4)Governance. I guess we could petition the society to add 5)Icons and Relics.\n\n","date":"March 5, 2013 at 11:23 am","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26520","author":"Paulette","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"Mentioning, pseudo-shroud science + pseudo-history + pseudo-forensics + pseudo-archaeology + pseudo-iconology, it’s amazing what an old sciencebod ‘losing it’ like Colin Berry (live from the Colin Berry Centre for promoting ‘new pseudo-shroud science’) brings himself to imagine, or believe especially when if fits his pseudo-historical, pseudo-forensic, pseudo-archaeological and pseudo-iconological preconceptions.\n\n","date":"March 6, 2013 at 12:37 pm","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26614","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"What’s the French for “bring on the men with white coats”?  MPH has just tried to troll my site under a new ID, with all the usual abuse (“bullsh*it” etc).  But I have learned the hard way that WordPress’s “Report Spam” key is the only effective way to deal with him.  \nShame. He could have achieved so much if only that detail-absorbing mind of his, combined with focus, could have been applied to more constructive  purposes.\n\n","date":"March 6, 2013 at 1:01 pm","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26615","author":"colinsberry","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"CB’s Crap & Bullshit Center for promoting new pseudo-shroud science IN THE NAME OF Science, this is an ‘abuse’ to true Science.\n\n","date":"March 6, 2013 at 1:25 pm","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26617","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"Shame on the site’s host for deleting my protest re this individual’s trolling of my site, while allowing the evidence for my charge to be allowed here. I may well have more to say when I have had time to think about this new turn of events.\n\n","date":"March 6, 2013 at 2:21 pm","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26625","author":"colinsberry","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"Colin, that is a surprise to me. I haven’t been near my computer in the last several hours. I just came out of a theater, turned on my iPhone and saw this message from you. How I deleted a comment I never saw or knew existed is a complete mystery to me. It must have been a miracle.\nAnyways, repost the comment, please. Or send it to me by email and I will insert it when I get home this evening.\nI just figured out how to post this comment with my iPhone. That too is a miracle.\n\n","date":"March 6, 2013 at 4:36 pm","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26640","author":"Dan","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"Dan: the comment that follows this one makes a reference to “white  coats”, my own words. So at least one person – to whom my comment referred – saw it before it mysteriously disappeared. Have you perhaps shared your password with anyone else? Is it maybe Dan Porter Inc?\n\n","date":"March 6, 2013 at 6:30 pm","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26669","author":"colinsberry","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"how funny! (again)\n\n","date":"March 6, 2013 at 6:51 pm","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26677","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"Dan; “I just figured out how to post this comment with my iphone. That too is a miracle”\nHahaha, …you still got it Dan!\n\n","date":"March 7, 2013 at 4:54 pm","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26757","author":"Ron","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"Re “the men with white coats”: REMINDER FOR CB: TURIN SHROUD caution: to be taken in small doses only\n\n","date":"March 6, 2013 at 6:14 pm","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26659","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"(The above sentence is the SOLE inCRIMinating “bullsh*ted sentence” that ‘most mysteriously too’  disappeared from his site). My tongue-in-cheek reply was: “the men with white coats”, (you mean) the KnightsTemplar?\n\n","date":"March 7, 2013 at 9:45 am","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26721","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"Typo: this is an ‘abuse’ of Science\n\n","date":"March 7, 2013 at 4:51 pm","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26756","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"This is not a new id. This my girlfriend’s.\n\n","date":"March 6, 2013 at 1:27 pm","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26618","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"My girlfriend does share my opinion about CB.\n\n","date":"March 6, 2013 at 1:30 pm","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26619","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"My girlfriend too thinks CB’s histori-archaeo-iconological and forensic bla bla is just bullsh*t. She posted it on his blog as comment (she is French, I helped her with her English)\n\n","date":"March 7, 2013 at 10:04 am","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26725","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"Typo: BTW My girlfriend has two science PhDs.\n\n","date":"March 7, 2013 at 10:09 am","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26727","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"However it ‘most mysteriously’ disappeared too.\n\n","date":"March 7, 2013 at 10:34 am","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26731","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"What about French humour? Methinks CB can only tolerate/stand HIS English humour and insults at other’s expense.\n\n","date":"March 6, 2013 at 1:42 pm","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26622","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"Even from Dan’s blog I can hear CB’s BarbeCue siren voice calling “MAAAAATTTTTHHHIIIIAAAASSSSSSSS”, “HHHHHHHHUUUUUUUGHHHHHH”…. “JUST LISSSSSSSSSSTEN TO ME AND NOBODY ELSSSSSSSSSSSSSSSSSSSSSSE!”\n\n","date":"March 6, 2013 at 1:21 pm","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26616","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"“the men with white coats”, the KnightsTemplar?\n\n","date":"March 6, 2013 at 2:02 pm","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26624","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"CB your are a troll in the true Sindon Science sphere. Shame on you who thinks and keeps claiming he is speaking on behalf of ‘science’.\n\n","date":"March 6, 2013 at 2:46 pm","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26627","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"REMINDER FOR CB: TURIN SHROUD caution: to be taken in small doses only\n\n","date":"March 6, 2013 at 6:12 pm","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26658","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"Typo: “Bring the men with white coats”\n\n","date":"March 6, 2013 at 6:24 pm","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26664","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"Soon for sure we’ll really have to “bring the men with white coats”. Just guess for whom?\n\n","date":"March 6, 2013 at 6:48 pm","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26674","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"Re  “white coats”, soon for sure we’ll really have to “bring the men with white coats”. Just guess for whom?\n\n","date":"March 6, 2013 at 6:49 pm","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26675","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"How funny!\n\n","date":"March 6, 2013 at 6:51 pm","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26676","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"I did not keep a copy of the comment I posted earlier – the one that MPH clearly saw – but has since mysteriously disappeared – but it went something like this:\nWhat’s the French for “bring on the men with white coats?”\nMPH has just trolled my site under a new ID with all the telltale signs of his vocabulary  like “bullsh*t”” etc.\nSadly I’ve learned the hard way that the only solution is to use WordPress’s “Report Spam”.\nShame. He could have achieved so much, given his ability to absorb detail, if only he could have combined it with focus and used it for constructive purposes.”\n\n","date":"March 6, 2013 at 7:21 pm","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26679","author":"colinsberry","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"I said once I say it twice: Enough of the Joecolin Berrynickell arrognorant Show allegedly in the name of ‘science’! How long will CB falsely historical, falsely archaeological, falsely iconological and falsely forensical BLA BLA BLA be promoted at the expense of true History, true Archaeology, true Iconology and true Forensics?\n\n","date":"March 7, 2013 at 9:56 am","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26723","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"BTW My girlfriend has two science PhDs.\n\n","date":"March 7, 2013 at 10:08 am","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26726","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"Nearly each time I read CB, I cannot help thinking his science PhD was only a waste of time.\n\n","date":"March 7, 2013 at 10:31 am","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26730","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"To disagree with CB and do some French humour at his expense (for a change) is to invite his wrath, insults and threats.\n\n","date":"March 7, 2013 at 4:47 pm","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26754","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"CBs theory is ok for a movie or a novel. However here methinks it is high time to mean Good Science, Good Forensics, Good Archaeology,  Good History, Good Iconology and Good Linguistics (as much as possible and as far as the TS is concerned).\n\n","date":"March 7, 2013 at 7:22 pm","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26772","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"Typo: Good Philology\n\n","date":"March 7, 2013 at 7:28 pm","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26773","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"MPH – fantasist maybe, but just the man you need when you’ve mislaid the telephone directory. MPH = Mittyesque ‘Pluie Homme’?  ;-)\n\n","date":"March 8, 2013 at 3:55 am","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26803","author":"colinsberry","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"Alright, children. That’s enough.\n\n","date":"March 8, 2013 at 8:52 am","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26817","author":"Dan","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"BTW rather call me MePHitz (as destroyer of iconological, historical, forensical & archaeological forensic falsehood plasterer like you).\n\n","date":"March 8, 2013 at 10:22 am","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26827","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"Now just guess who is the ‘Tophel Shequer’ (Ger. Teufel)\n\n","date":"March 8, 2013 at 10:32 am","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26828","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"Somehow I just knew the first rebuke would be directed at me, Daniel R Porter, despite my receiving weeks of abuse from MPH on your site, much of it expressed in the coarsest of language.\nAny blog site that incubates and then turns a blind eye to a spammer-cum-troll is one that needs to take a long hard look at itself.\n\n","date":"March 8, 2013 at 9:01 am","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26818","author":"colinsberry","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"I said children, plural.\n\n","date":"March 8, 2013 at 9:28 am","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26822","author":"Dan","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"Playtime over. Back to TS classroom.\n\n","date":"March 8, 2013 at 9:49 am","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26825","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"Re TS classroom, I mean Turin Sindon Thinking Skills\n\n","date":"March 8, 2013 at 11:44 am","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26831","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"…NOT Turin Sindon Tophel Shequer.\n\n","date":"March 8, 2013 at 11:45 am","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26832","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"Okay Max, stop it. People who get email notification of new comments are getting annoyed.\n\n","date":"March 8, 2013 at 12:35 pm","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26833","author":"Dan","site":"shroudstory"},{"title":"Defining Pseudoscience:  It Takes a Rocket Surgeon","post":"Thank God! I think also annoyed with everytime you log on and look at the ‘Latest comments’, it’s filled with one name…Lets try to compress our thoughts into one or two comments please, but hopefully not too long a comment, (Yannick) ;-)\nR\n\n","date":"March 8, 2013 at 1:48 pm","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","id":"comment-26836","author":"Ron","site":"shroudstory"}]
