[{"title":"Definition of Inauthentic in Oxford Dictionary","post":"Too funny!… in retrospect… moving to a 2020 vision definition:  Shroud of Turin was thought to have been proved inauthentic by radiocarbon dating,,, but now we know its authentic!\n\n","date":"February 24, 2014 at 5:16 am","url":"https://shroudstory.com/2014/02/24/definition-of-inauthentic-in-oxford-dictionary/","cat":"news_&_views","id":"comment-81940","author":"Annette Cloutier","site":"shroudstory"},{"title":"Definition of Inauthentic in Oxford Dictionary","post":"Annette,\nThe real joke is why I looked it up. I am writing about the authenticity v, inauthenticity and inauthenticity is red-lined, indicating it’s misspelled. As matter of fact, as I type this  it is red-lined by whatever program is used by the blog. I thought maybe unauthenticity might be right but it is also red-lined.\nI suppose I am making a mountain over a molehill. I once got a bit perturbed when in a piece I wrote about Roy Cohn,  the  op-ed editor at Newsday without informing me  changed the last sentence  to “The truth does not lie in his bones” from “Truth does not lie in his bones.” The addition of the word “the” changed a nuance of it’s meaning in my eyes. It was take on the old expression “he doesn’t have a honest bone on his body”. See http://www.johnklotz.com/rosen.htm\nI am not a fan of the Rosenbergs but I believe they did less damage then Klaus Fuchs  whose life the Brits spared. The sentence to death they received from Judge Kaufman was not appropriate under the circumstances. Pope Pius XII urged its commutation.\nThe complete last paragraph as emended for my web page is: \n“The Rosenberg controversy has not been interred with\nRoy Cohn. But in pressing their case, the adversaries of Judge\nKaufman had best not put too much weight on the testimony of Roy\nCohn. Truth does not lie in his bones.” :\n\n","date":"February 24, 2014 at 7:43 am","url":"https://shroudstory.com/2014/02/24/definition-of-inauthentic-in-oxford-dictionary/","cat":"news_&_views","id":"comment-81965","author":"John Klotz","site":"shroudstory"}]
