[{"title":"Rupert Sheldrake on Science and Religion","post":"I submitted the following comment to Huff about this article:\nAn example of how physicists are biased and irrational about thermodynamics is the view of most physicists, published in many peer-reviewed articles and scholarly works, that biological evolution does not violate the second law of thermodynamics. \nThe second law of thermodynamics states that a gas will fill up the entire container it is in. This is a matter of common sense, more than a law of physics. However, this law does not apply to the evolution of stars because the law only applies to non-interacting particles. For the same reason, it does not apply to evolution because a living organism is not a collection of non-interacting particles. So, it is just as incorrect to say that evolution violates the second law as to say it does not. \nBut there is a connection between evolution and statistical mechanics. Physicists calculate the number of ways there are to arrange N different objects: N times N-1 time N-2 times N-3 etc. etc. Evolutionary biologists calculate the number of ways of creating a 600 amino acid protein using the 20 amino acids: 20 to the 600th power.  This is the source of the misinformation that evolution violates the second law of thermodynamics. \nThe American Journal of Physics published an article titled “Entropy and evolution” (Vol. 76, No. 11, Nov. 2008) with an absurd equation proving that evolution does not violate the second law because of the sun. The idea is that the second law only applies to isolated systems and evolution did not occur in an isolated system. This is absurd because the sun heats things up and causes disorder not order. The equation is absurd because it uses the Boltzmann constant to calculate the entropy of the biosphere.\n\n","date":"December 2, 2012 at 11:24 am","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","id":"comment-19734","author":"David Roemer","site":"shroudstory"},{"title":"Rupert Sheldrake on Science and Religion","post":"I thought Sheldrake’s posting an excellent article.  What bad science and bad religion seem to share in common is a certain arrogance and lack of humility.  There are certainly any number of examples of bad science.  However, science itself seemed able and bound to accommodate itself when sufficent evidence was mounted to discard older discredited theories.  However the process of getting there was usually fraught with much disputation, often acrimonious.  The phlogiston theory had to give way to Joseph Priestley’s oxygen; Despite the atomic theory being a working hypothesis for chemists from the 18th c. the experimental physicist Ernst Mach was denying the existience of atoms as late as 1905, dirving Boltzman to suicide; Soon afterwards Einstein demonstrated their existence from applying Boltzman’s theories to Brownian movement;  Similarly “conservation of mass” was disproved as an infallible statement from Einstein’s E = mc^2 equation;  Immutability of the elements was altered by Rutherford’s work in radioactivity;  Laplace’s insistence on determinism was dealt a blow by the demonstrable randomness of quantum mechanics.  \nThe debate concerning entropy, may have originated with Teilhard de Chardin’s observation of the development of complexity being an apparently opposing principle.  Many of Teilhard’s forecasts, particularly relating to inter-personal communication have now come to pass.  Nevertheless, the law of increasing entropy has been shown to be true for all observable closed systems, notwithstanding increasing complexity.  However as recently as 1978, Ira Levine was able to state in his text-book “Physical Chemistry” that “There is no guarantee that laws that hold on a terrestial scale must also hold on a cosmic scale.  Although there is no evidence for a cosmic violation of the second law (of thermodynamics) our experience is insufficient to rule out such a violation. (etc)”  op. cit. p.96.  He mentions the discredited steady-state theory of Hoyle et al. \nLevine I think demonstrates the correct attitude of scientific humility.  Michio Kaku in his “Parallel Universes” makes the point that the plethora of “goldilocks” properties, on both the micro and macro scale has persuaded a number of scientists that the universe, and in particular our own solar system, did not eventuate by chance, but rather by cosmic design.  Yet others less credulous take refuge in the invention of the so-called “anthropic principle”. \nAny search of Shroud sceptic sites reveals to all the misplaced “faith in science” of a certain prevalent attitude, together with what appears to be deliberate misinformation, and illustrates well the point that Sheldrake makes in his article.\n\n","date":"December 2, 2012 at 7:09 pm","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","id":"comment-19750","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Rupert Sheldrake on Science and Religion","post":"daveb: The law of increasing entropy does not apply to the evolution of stars. The gravitational attraction between the hydrogen atoms causes the entropy of this isolated system to decrease. It also does not apply to evolution because a living organism is not a system of non-interacting particles.\n\n","date":"December 2, 2012 at 8:45 pm","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","id":"comment-19752","author":"David Roemer","site":"shroudstory"},{"title":"Rupert Sheldrake on Science and Religion","post":"Opinion may be divided on the matter.  My understanding is that the entropy of every CLOSED SYSTEM decreases with the arrow of time.  Otherwise please cite your authorities!\n\n","date":"December 3, 2012 at 2:10 am","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","id":"comment-19756","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Rupert Sheldrake on Science and Religion","post":"Correction: I’m clearly as confused as you are:  “Tthe entropy of every CLOSED SYSTEM INCREASES with the arrow of time.”\n\n","date":"December 3, 2012 at 5:47 am","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","id":"comment-19762","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Rupert Sheldrake on Science and Religion","post":"daveb: I think the burden of proof is on you. In the evolution of stars, entropy decreases as the hydrogen molecules move closer together. This is not a violation of the second law of thermodynamics. The second law only applies to non-interacting particles, though chemical reactions can be included in thermodynamic analysis.\n\n","date":"December 3, 2012 at 9:25 am","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","id":"comment-19766","author":"David Roemer","site":"shroudstory"},{"title":"Rupert Sheldrake on Science and Religion","post":"I’m afraid I either disagree with or misunderstand much of David Roemer’s argument, and would be grateful for clarification. Would I be correct in thinking that his basic premise is that evolution is an unscientific theory, unsupported by, for example, the second law of thermodynamics? When he says, above “it is just as incorrect to say that evolution violates the second law as to say it does not,” he confuses me completely. I gather that he feels that the energy input to the earth from the sun is insufficient to account for the energy required for evolution, whereas the article in the American Journal of Physics claims that it is. Is that correct? I also don’t understand what he means by non-interacting particles. Is the gravitational attraction between particles not an interaction? Is the behaviour of particles in a chemical reaction not an interaction? Can he give an example of the second law of thermodynamics applying to some non-interacting particles? Answers to some of these might help me to understand Roemer’s ideas a great deal more than I do at present, and who knows, maybe I will become the first person on the web to agree with him!\n\n","date":"December 3, 2012 at 3:27 pm","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","id":"comment-19778","author":"Hugh Farey","site":"shroudstory"},{"title":"Rupert Sheldrake on Science and Religion","post":"Even the Wikipedia article covers these points adequately:\nhttp://en.wikipedia.org/wiki/Entropy \nGenerally:  “the most familiar manifestation of entropy is that, following the laws of thermodynamics, entropy of a closed system always increases and in heat transfer situations, heat energy is transferred from higher temperature components to lower temperature components.” \nArrow of time: “Entropy is the only quantity in the physical sciences that seems to imply a particular direction of progress, sometimes called an arrow of time. As time progresses, the second law of thermodynamics states that the entropy of an isolated system never decreases.” \n Entropy & Life: “Organisms inherit the ability to create unique and complex biological structures; it is unlikely for those capabilities to be reinvented or be taught each generation. Therefore DNA must be operative as the prime cause in this characteristic as well. Applying Boltzmann’s perspective of the second law, the change of state from a more probable, less ordered and high entropy arrangement to one of less probability, more order, and lower entropy seen in biological ordering calls for a function like that known of DNA. DNA’s apparent information processing function provides a resolution of the paradox posed by life and the entropy requirement of the second law” \nSection on Cosmology also covers the points raised.\n\n","date":"December 3, 2012 at 3:28 pm","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","id":"comment-19779","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Rupert Sheldrake on Science and Religion","post":"Sheldrake has written some interesting things in the field of Parapsychology, particularly about psychic pets.\n\n","date":"December 3, 2012 at 5:45 pm","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","id":"comment-19783","author":"Louis","site":"shroudstory"},{"title":"Rupert Sheldrake on Science and Religion","post":"Yes, I read that. It doesn’t really explain David Roemer’s point of view though, does it? DNA needs energy to make it work – is it Roemer’s contention that there isn’t enough? And where do interactive (or non-interactive) particles come in? I find Styer’s paper, and Bunn’s variation on it, both models of clarity, but if there is another side to the discussion, I would quite like to understand that too.\n\n","date":"December 3, 2012 at 5:45 pm","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","id":"comment-19784","author":"Hugh Farey","site":"shroudstory"},{"title":"Rupert Sheldrake on Science and Religion","post":"I broke down my explanation of why the American Journal of Physics article is absurd into eight steps:\n1) Natural selection explains why giraffes have long necks, but not how bacteria evolved into giraffes in only 3.5 billion years. Evolutionary biologists always speak of adaptive evolution. The old model for evolution was a tornado hitting a junkyard and producing a Boeing 747 in flight. The new model is a computer generating a Shakespearean sonnet by the random selection of letters.\n2) Thermodynamics and statistical mechanics are connected branches of physics. The key variable in thermodynamics is temperature, which is the sensation of hot and cold. It is measured with a thermometer in units called degrees. The second law of thermodynamics states that a gas will fill up the entire container it is in. The second law does not apply to the evolution of stars or biological evolution.\n3) Statistical mechanics is related to thermodynamics. For example, the average kinetic energy of a gas molecule is directly proportional to the temperature of the gas. The constant of proportionality is the Boltzmann constant and is a decimal with 23 zeros. \n4) There is a very loose connection between evolutionary biology and statistical mechanics. In statistical mechanics, physicists calculate the number of ways of arranging N objects: N X (N-1) X (N-2)…. Biologists calculate the number of proteins that can be formed with N amino acids: 20 to the Nth power.\n5) Because of #4, some non-physicists mistakenly say that evolution violates the second law of thermodynamics.\n6) Many scholarly works erroneously try to refute # 5 by giving an expanded explanation of the second law. They incorrectly describe the second law as stating that nature goes from order to disorder, thus supporting the idea the evolution violates the second law. But they point out that this principle only applies to closed systems. Since the biosphere was bathed in sunlight, the biosphere is not a closed system.\n7) The idea that evolution does not violate the second law because of the sun is absurd because the photons from the sun tend to cause disorder not order.\n8) The AJP article is even more absurd than this. It writes down a fake equation connecting the statistical concept of the “thermodynamic probability” of the biosphere with the thermodynamic concept of entropy using the Boltzmann constant. It thus produces an equation showing that evolution does not violate the second law of thermodynamics.\n\n","date":"December 4, 2012 at 12:00 am","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","id":"comment-19788","author":"David Roemer","site":"shroudstory"},{"title":"Rupert Sheldrake on Science and Religion","post":"#2: “The second law does not apply to the evolution of stars or biological evolution.” No scientific authority cited!  \nAt this stage I shall bow out of the debate, which is too far off-topic from this site dedicated to discussing the Holy Shroud of Turin, and go back to putting my faith in Goldilocks zones, and the consequential inference of a designer universe!  I see little relevance or point in encouraging peculiar unsupported scientific theories in this particular forum!\n\n","date":"December 4, 2012 at 3:16 am","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","id":"comment-19794","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Rupert Sheldrake on Science and Religion","post":"Hugh: The AJP article should be retracted because it is flat out absurd. You are quite right to assume that there are no such errors in a peer-reviewed article about physics especially since I, and others, have been explaining why the article should be retracted. It is like the Holocaust. No one was ever forced to kill anyone in Germany, but there were severe penalties for telling about the atrocities. Collaboration took the form of silence. Physicists are being silent about the embarrassing error in the article. \nMy #1  states that natural selection explains only adaptation, not common descent. The only theory that explains common descent is intelligent design (ID), but there is no evidence for intelligent design. ID is irrational and is motivated by anxiety about religion, just like the theory that the Holy Shroud is authentic. People who think the Holy Shroud is authentic usually believe in ID. I’m surprised that someone on this site is taking the atheistic position on evolution. Atheists don’t like to admit ID is a better theory in some sense than natural selection because they are more interested in promoting atheism than in understanding science.\n\n","date":"December 4, 2012 at 9:22 am","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","id":"comment-19810","author":"David Roemer","site":"shroudstory"},{"title":"Rupert Sheldrake on Science and Religion","post":"David, you say, “I and others.” Who?\n\n","date":"December 4, 2012 at 10:28 am","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","id":"comment-19816","author":"Dan","site":"shroudstory"},{"title":"Rupert Sheldrake on Science and Religion","post":"David? I accept evolution as it is being taught in most of our school systems. I do not accept ID. Is this what you mean by the atheist position? If so, a lot of Roman Catholics and Episcopalians are going to be very surprised.\n\n","date":"December 4, 2012 at 10:37 am","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","id":"comment-19818","author":"Dan","site":"shroudstory"},{"title":"Rupert Sheldrake on Science and Religion","post":"Dan: Granville Stewart’s paper (“A second look at the second law”) was accepted for publication by Applied Mathematics Letters, but was ultimately rejected. Prof. Stewart tells the story at http://www.evolutionnews.org/2011/10/more_philosophical_than_scient052441.html\nI can email you this article if you tell me how. Another article by Andy McIntosh was published in the International Journal of Design & Nature Ecodynamics. The title is “Information and entropy top-down or bottom-up.”\nI can also send you two article published in Physics Today titled, “Thermodynamics of Evolution.” The title implies that Stewart and McIntosh are wrong, however, the fourth paragraph of the article shows that there is no disagreement between the Physics Today articles and Stewart and McIntosh. As I have said, \n1) The idea that evolution violates the second law of thermodynamics  is wrong.\n2) The idea that evolution does not violate the second law because of the sun is stupid.\n3) The idea that there is an equation that proves the second law does not violate the second law is ignorant and irrational. That a peer-reviewed journal could publish such an article is perhaps understandable, given how # 2 is thought by many to be good physics. That the AJP does not retract the article boggles the mind.\n\n","date":"December 4, 2012 at 10:59 am","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","id":"comment-19821","author":"David Roemer","site":"shroudstory"},{"title":"Rupert Sheldrake on Science and Religion","post":"“Natural selection explains only adaptation, not common descent.” Fortunately evolution contains rather more than natural selection, and the study of DNA and genetic mutation explain both adaptation and common descent very well indeed, without the need for ID.\n“There is no evidence for intelligent design. ID is irrational.” This is why it is rejected not only by atheists but also by most Christians. Pope Benedict XVI has been at pains to point out several times that Catholicism is nothing if not rational.\n“People who think the Holy Shroud is authentic usually believe in ID.” Really? Do you have any evidence for this? I sincerely hope it isn’t true.\n“Atheists don’t like to admit ID is a better theory in some sense than natural selection because they are more interested in promoting atheism than in understanding science.” As ID is neither scientific nor rational (your own words), atheists need not have any understanding of science to reject it. They may do so for other reasons than ‘promoting atheism.’\n\n","date":"December 4, 2012 at 3:19 pm","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","id":"comment-19830","author":"Hugh Farey","site":"shroudstory"},{"title":"Rupert Sheldrake on Science and Religion","post":"Having only just entered the discussion, which i was originally loath to do, I shall persevere a little longer. However I’m still not what Roemer’s point is.\n1) His first paragraph is surely quite incorrect. Neither his ‘old’ model nor his ‘new’ model are now or have ever been recognised by evolutionary biologists. The gradual accumulation of adaptive characteristics cannot be modelled in either of those terms, and never has been.\n2) If the last sentence of paragraph two is intended to be supported by the rest of the paragraph, then the paragraph is a non-sequitur. The facts that a gas expands to fill its container, whereas in space a gas contracts to generate a star cannot be directly compared. Indeed the second law of thermodynamics predicts that where the energy of escaping from gravity is greater than the energy of gravitational attraction, a gas will not fill up its container. This is why the earth has an atmosphere, for instance. The behaviour of gases has no direct relevance to the evolution of organisms, which are not gases.\n3) I do understand that particles move faster when they are hotter. For all I know he may be right in saying that the kinetic energy of a gas molecule increases by 10000000000000000000000 times for every degree heated, although it seems quite a lot to me. Is that really what Boltzmann’s constant implies?\n4) The fact that a number of entities can be arranged in billions of different ways has no relevance to evolution. The number of possible proteins is constrained by a number of other conditions unrelated to the mathematical calculation, and even if it were not, proteins are not formed by the random accumulation of amino acids.\n5) Roemer is correct in saying that evolution does not violate the second law of thermodynamics. The only ‘non-physicists’ who think it does are people whose understanding of the universe comes from a mistaken interpretation of various religious scriptures.\n6) I have recently read two ‘scholarly papers’ (in the American Journal of Physics, brought to my attention by David Roemer himself) which refute the idea that evolution violates the second law of thermodynamics. Neither of them is so simplistic as to claim that that ‘nature goes from order to disorder’. They both explain comprehensively how the entropy of the universe is not decreased by anything that happens on earth, and that any local or apparent decrease in entropy is invariably outweighed by an overall increase elsewhere.\n7) While Roemer is correct in saying that solar radiation tends to increase the entropy of the universe, he is wrong to apply this generalisation to photosynthesis. The decrease in entropy due to photosynthesis is trivial compared to the overall increase due to solar radiation, and is at any rate temporary.\n8) The article to which Roemer specifically refers (Styer, 2008) makes huge generalisations concerning the rate of evolution, and applies figures derived from these to standard entropy equations. The equations are not ‘fake,’ although the figures may be ‘absurd.’ A subsequent paper (Bunn, 2009) made serious adjustments to Styler’s figures, but the equations were just as relevant and the conclusion identical – that in sheer mathematical terms evolution does not break the second law of thermodynamics. In other papers, mathematicians making different assumptions come to the conclusion that evolution actually increases entropy, which more obviously doesn’t violate the second law.\nAfter all that I still do not understand Roemer’s fundamental conviction. If it is simply that he disagrees with Daniel Styer’s numerical assumptions then he may well be right and others concur. However their papers have been accepted rather than his because they have explained precisely where his assumptions were erroneous and proffered better ones of their own. If, on the other hand, Roemer believes that evolution is intrinsically impossible according to currently understood science, and that an alternative science must be adduced to explain it, then I think he should say so.\n\n","date":"December 4, 2012 at 5:42 am","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","id":"comment-19800","author":"Hugh Farey","site":"shroudstory"},{"title":"Rupert Sheldrake on Science and Religion","post":"Why on earth read that liberal rag the Huffington Post?\n\n","date":"December 4, 2012 at 6:50 am","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","id":"comment-19801","author":"Tim","site":"shroudstory"},{"title":"Rupert Sheldrake on Science and Religion","post":"I read a wide spectrum of publications, conservative and liberal.\n\n","date":"December 4, 2012 at 7:19 am","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","id":"comment-19804","author":"Dan","site":"shroudstory"},{"title":"Rupert Sheldrake on Science and Religion","post":"That is the right approach, for we need to know what everyone is saying.\n\n","date":"December 4, 2012 at 8:09 am","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","id":"comment-19806","author":"Louis","site":"shroudstory"},{"title":"Rupert Sheldrake on Science and Religion","post":"We still do not know everything about the nature of reality and the nature of being and much of what scientists say is still theoretical. There are keys to the secret in the words of Jesus.\n\n","date":"December 4, 2012 at 8:19 am","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","id":"comment-19808","author":"Louis","site":"shroudstory"},{"title":"Rupert Sheldrake on Science and Religion","post":"I agree. The first step to believing in Jesus is realizing that we don’t know what a human being is. We can comprehend what a human is because we know everything we do and everything that happens to us. But, we can’t define or explicate what a human being is other than to say humans are embodied spirits.\n\n","date":"December 4, 2012 at 4:36 pm","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","id":"comment-19834","author":"David Roemer","site":"shroudstory"},{"title":"Rupert Sheldrake on Science and Religion","post":"You are right, David. We still have a long way to go, and your efforts and seriousness are appreciated.\n\n","date":"December 4, 2012 at 9:51 pm","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","id":"comment-19845","author":"Louis","site":"shroudstory"},{"title":"Rupert Sheldrake on Science and Religion","post":"Hugh: The equation for temperature and KE energy is  KE = (3/2)kT. k is the Boltzmann constant and is quite small. It only applies to molecules. Suppose you have a box of ping-pong balls bouncing around in a box. The kinetic energy of a ball will be around 1 joule. This  does not mean the temperature of the ping pong balls is a gazillion degrees. This is how irrational the AJP article is.\n\n","date":"December 4, 2012 at 9:31 am","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","id":"comment-19812","author":"David Roemer","site":"shroudstory"},{"title":"Rupert Sheldrake on Science and Religion","post":"Dan: This is the atheistic position on evolution:\nAdvocate of ID: ID is a better theory for evolution than natural selection.\nAtheist: No it isn’t. ID is not science because it is not testable. \nAtheists don’t understand what science is. Atheists don’t realize that science is something humans do, but animals do not do. When animals have nothing to do, they go to sleep. Humans ask questions, some of which are scientific questions. Atheists don’t grasp the difference beween these two questions:\nScientific question: Why is the sky blue?\nNon-scientific question: What is knowing the sky is blue?\n\n","date":"December 4, 2012 at 11:05 am","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","id":"comment-19822","author":"David Roemer","site":"shroudstory"},{"title":"Rupert Sheldrake on Science and Religion","post":"Hugh: “Natural selection” is short hand for “natural selection acting upon innovations.” According to James Shapiro, a mainstream biologist from the U. of Chicago, the old paradigm for innovations was random mutations and the new paradigm is genetic engineering. In any case, no evolutionary biologist thinks natural selection acting upon random mutations or genetic engineering explains the complexity of mammals. Natural selection only explains why species adapt to the environment. \nThe primary structure of a protein (there are four structures in a protein) does not even begin to describe the complexity of a mammal. There is the molecular machinery consisting of dozens of proteins. There is also the dynamic complexity of the ability of cells to detect their environment and produce new proteins to handle the changes in the environment (genetic engineering). There is also the process of cell differentiation which enables a single fertilized egg to become many different cells. There is also the instinctual behavior of animals and the ability of small children to speak with grammatical precision. Children are born with the ability to know when to use “me” and when to use “I.”\n\n","date":"December 4, 2012 at 4:32 pm","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","id":"comment-19832","author":"David Roemer","site":"shroudstory"},{"title":"Rupert Sheldrake on Science and Religion","post":"“No evolutionary biologist thinks natural selection acting upon random mutations or genetic engineering explains the complexity of mammals.” I fear this is spectacularly untrue, and that almost exactly the opposite is more accurate: Almost ALL evolutionary biologists think that… etc, etc. James Shapiro has done some fascinating work on manipulated DNA mutation, and his paradigm shift in favour of degrees of genetic information rather than discreet genes is interesting, but hardly earth-shattering. His book on evolution was deliberately provocative (and it is no bad thing to stir up controversy around ones area of expertise now and again) but his views are far from ‘mainstream’ and excited a lot of acrimony among his evolutionary colleagues.\n\n","date":"December 4, 2012 at 6:47 pm","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","id":"comment-19836","author":"Hugh Farey","site":"shroudstory"},{"title":"Rupert Sheldrake on Science and Religion","post":"Hugh: These are the quotes I am basing my statements on. You will never find a quote from a biology textbook or scholarly work that states natural selection acting upon innovations explains the complexity of life. I repeat: natural selection only explains adaptation. \nFacilitated variation is not like orthogenesis, a theory championed by the eccentric American paleontologist Henry Osborn (1857–1935), which imbues the organism with an internal preset course of evolution, a program of variations unfolding over time. Natural selection remains a major part of the explanation of how organisms have evolved characters so well adapted to the environment. (Marc Kirschner and John Gerhart, The Plausibility of Life: Resolving Darwin’s Dilemma, page 247)\nBy the time Darwin came to publish On the Origin of Species in 1859, he had amassed enough evidence to propel evolution itself, though still not natural selection, a long way towards the status of fact. Indeed, it was this elevation from hypothesis towards fact that occupied Darwin for most of his great book. The elevation has continued until, today, there is no longer any doubt in any serious mind, and scientists speak, at least informally, of the fact of evolution. All reputable biologists go on to agree that natural selection is one of its most important driving forces, although —as some biologists insist more than others—not the only one. Even if it is not the only one, I have yet to meet a serious biologist who can point to an alternative to natural selection as a driving force of adaptive evolution—evolution towards positive improvement. (Richard Dawkins, The Greatest Show on Earth: The Evidence for Evolution, p. 18)\n\n","date":"December 4, 2012 at 7:33 pm","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","id":"comment-19838","author":"David Roemer","site":"shroudstory"},{"title":"Rupert Sheldrake on Science and Religion","post":"Oh dear; this is getting to be a bit like ping-pong. Almost by definition, “selection” suggests that a variety of things already exist, from which one or more may be ‘selected,’ and others rejected. As far as that goes, I could not disagree. However, “evolution” consists firstly of the provision of variety, through mutation, genetic drift and sexual recombination, and only secondly of “Natural Selection.” To equate Evolution and Natural Selection is wrong, and repeating the fact that Selection explains variety but not innovation does not make it right. Not being a high-school or college teacher I do not have access to textbooks, but I do not believe that they restrict their explorations of evolution to Natural Selection alone, and to imply that they do is a gross distortion of their intent.\n For the edification of anybody else who may be following this thread, here are a couple of quotes from the internet:\n–  British Natural History Museum: “Evolution is driven by random changes in the genes of organisms, called mutations, and a complex process called natural selection.”\n–  Biology Online: Evolution is “the change in genetic composition of a population over successive generations, which may be caused by natural selection, inbreeding, hybridization, or mutation.”\n–  And even Wikipedia: “Life evolves by means of mutations (changes in an organism’s hereditary information), genetic drift (random change in the genetic variation of a population from generation to generation), and natural selection (the non-random and gradual process of natural variation by which observable traits (such as eye color) become more or less common in a population).”\nHowever, I do find that some avowedly creationist / intelligent design sites, and for I know their textbooks too, do try to omit mutation from their considerations of evolution, presumably because it is easier to deny evolution if you ignore half of its exposition.\n\n","date":"December 5, 2012 at 9:10 am","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","id":"comment-19867","author":"Hugh Farey","site":"shroudstory"},{"title":"Rupert Sheldrake on Science and Religion","post":"Hugh: As I said, “natural selection” is short hand for “natural selection acting upon innovations.” Before “innovations” meant “random mutations.” Now, biologists have more knowledge about innovations: gene transfer, gene duplication, facilitated variation and so on. James Shapiro is saying that self-engineering is another source of innovations. \nI have also said I do not believe in ID or creationism. There is no evidence for these theories. \nThe two quotes I gave proves that no bioligist thinks natural selection (acting upon innovations) explains how life evolved from bacteria to mammals in only 3.5 billion years. The first quote says, “evolved characters so WELL ADAPTED TO THE ENVIRONMENT.” The quote from Richard Dawkins, a professional biologist and atheist, says “ADAPTIVE EVOLUTION.” \nYou can’t supply any quotes from biologists saying that natural selection acting upon innovations explains the complexity of life because there are none. You have been duped by atheists and advocates of intelligent design. Advocates of ID compare ID with natural selection to make ID look better. Atheists go along with the scam because they don’t want to admit ID is a better theory than natural selection in some sense.\n\n","date":"December 5, 2012 at 9:28 am","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","id":"comment-19869","author":"David Roemer","site":"shroudstory"},{"title":"Rupert Sheldrake on Science and Religion","post":"Now I’m baffled beyond redemption.\nI can supply quotes from biologists saying that natural selection acting upon innovations explains the complexity of life; I did in my previous post.\nAs it happens I do have a copy of The Greatest Show on Earth, which devotes many pages to mutations. “Mutations are the random changes in genes that constitute the raw material for evolution by non-random selection,” Dawkins explains at one point, and at another: “Lenski’s research shows … many of the essential components of evolution by natural selection: random mutation followed by non-random natural selection … the way successive mutations build on their predecessors to produce evolutionary change …”\nI utterly deny that I have been duped by either atheists or advocates of ID. I believe my previous posts explain that clearly. I do not believe the motives of atheists are what you say they are, and I do not believe that ID is a better theory than natural selection in any sense.\nWhat surprises me now is that I thought you were a proponent of ID yourself. After all you did write (above) “The only theory that explains common descent is intelligent design (ID).” Now you say you “do not believe in ID”. Since by your own logic you do not believe in the only theory that explains common descent, then what on earth do you believe?\n\n","date":"December 5, 2012 at 2:17 pm","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","id":"comment-19877","author":"Hugh Farey","site":"shroudstory"},{"title":"Rupert Sheldrake on Science and Religion","post":"Hugh: Intelligent design is a bright idea. But there is no evidence for it. ID is an attempt to explain common descent, but rational people judge it to be false. The quotes you gave from Dawkins do not say natural selection explains how mammals evolved from bacteria in only 3.5 billion years. Natural selection only explains adaptation. Science has not yet solved the question of what caused the Big Bang, the origin of life, or evolution. This is a reason to believe in the Bible because the Bible says God created the universe from nothing.\n\n","date":"December 5, 2012 at 3:52 pm","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","id":"comment-19880","author":"David Roemer","site":"shroudstory"},{"title":"Rupert Sheldrake on Science and Religion","post":"Reluctantly, I shall add another posting.  I feel that the gentlemen are merely arguing minor details.  The Universe and all that is within it are the product of a Creator God.  How this happened, Science can point the way.  While Dawkins et al might argue that random fluctuations, natural selection and Darwinian survival of the fittest are all that is required to explain our present situation, a more fundamental approach is required.  All that exists in the universe depends on the fundamental properties of matter.  These properties could very well have been somewhat different from what they actually are.  \nA few minor examples:  “In order to create life, our planet must have been stable for hundreds of millions of years.  But such a stable world is extremely difficult to make.  Commencing with matter, if the proton particle were just 1% heavier, all atomic nuclei would be unstable and fly apart, and life would be impossible.  To create DNA, protons must be stable for hundreds of millions of years.  When we look at the four fundamental forces of nature, these are also critical.  If the weak force were either weaker or stronger, then neutrinos could not form supernovae, and there would again be no elements heavier than iron.”  There are many such examples   Any search on “Goldilocks zones” or “Goldilocks properties of matter” can provide persuasive evidence that there is an intelligence which shapes our ends.  Getting lost in the detail provides little further enlightenment.  There is no fundamental reason why the universe should not be otherwise than what it is.  That the universe is what it is, can only point to a Creator God, timeless and omniscient.  The so-called “anthropic principle” sheds no further light except that “We’re here, because we’re here”, hardly a rigorous scientific statement.\n\n","date":"December 5, 2012 at 3:37 pm","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","id":"comment-19879","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Rupert Sheldrake on Science and Religion","post":"Well gentlemen, I think I finally understand both your fundamental positions, and perhaps paradoxically, largely agree with them. “En arche en ho Logos,” begins St John’s Gospel – and I use Greek because arche is not well translated by beginning nor logos by word. Perhaps ‘comprehensibility’ might do, or ‘reason,’ or indeed, as St John equates it to, God, although there are so many different ways of interpreting that word that I prefer to leave that to theologians. It is, I think, the principle task of the professed scientist to turn ‘comprehensibility’ into ‘comprehension’ by observation, by experiment, and above all by reason, which is what I have been attempting here.\nI was loath to get involved in this discussion (just couldn’t resist it I suppose), but I’m quite glad I have pursued it thus far. I now understand completely why David Roemer’s approach to the American Journal of Physics was doomed from the start, and find myself very much in accord with David Belz’s first and last comments. I too shall now bow out of this discussion, with best wishes to you both until we meet on another posting!\n\n","date":"December 5, 2012 at 6:35 pm","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","id":"comment-19886","author":"Hugh Farey","site":"shroudstory"}]
