[{"title":"Do Christians Misunderstand Heaven?","post":"What Christians have gotten all wrong is just how decieved are some members of the faith.To no really good end do they persevere and pursue notions that are way out in left feid.Overscupulously examining articles of faith that they have no business meddling with…all to satisfy an insatiable ego in the belief that they got it right where all others have failed.\n\n","date":"May 18, 2012 at 4:55 am","url":"https://shroudstory.com/2012/05/18/do-christians-misunderstand-heaven/","cat":"news_&_views","id":"comment-11413","author":"john","site":"shroudstory"},{"title":"Do Christians Misunderstand Heaven?","post":"Theologians who confine their original sources to the Jewish Bible might well look in vain.  The notion of an after-life and a general resurrection was a very late development in Jewish thought.  (It can certainly be found in Maccabees)  In the New Testament the specific word “Paradise” (of Persian origin) only occurs three times: Luke 23:43, II Cor 12:4, Rev 2:7.  Certainly the Sadducees, the Jewish priests, rejected the notion of a general resurrection, even in NT times.  \nHowever the Septuagint LXX, which was the common Bible in those days uses the word “Paradise” some 46 times, but uses it in a variety of ways.  This was the Greek Bible which was translated in Alexandria in the 3rd c BC, originally to serve the requirements of Greek-speaking Jews, and partly for the requirements of the Great Library of Ptolemy II in Alexandria.  LXX comprised the Jewish Bible and several other works, the so-called Apocrypha, or deutero-canonical works.  It is frequently quoted in the NT.  Its general use by the early Christians to make their case, resulted in the Jews rejecting it ~100AD, and reverting to the original Jewish texts only.  Despite its use by the Catholic Church for 15 centuries, mainly as the Latin Vulgate, (also the Greek Orthodox) the Protestant reformers also decided to reject it, although not without some internal controversy. \nThe idea of an afer-life is clearly an early Christian teaching found in the New Testament, in the gospels and epistles, and finally as the New Jerusalem of Revelations.  A memorable saying of Jesus to the Sadducees found in John’s gospel is “Abraham rejoiced to see my day; he saw it and was glad” (I paraphrase from memory).  Because it is in John, some liberals such as the ‘Jesus Seminar’ tend to reject this as a reliable saying of Jesus.  We also have the words from the cross to the ‘good’ thief, “Amen, this day you will be with me in paradise.”  \nSo it all depends what sources you’re prepared to use, but it is clearly an orthodox teaching, found in the practice of canonising as saints those whose lives have been exceptional.\nInterestingly, I searched in the index of my 380 page “Source Book of the Bible for Teachers”, published as long ago as 1970, but there was nothing listed under ‘paradise’ or ‘after-life’ and the only reference to ‘resurrection’ was confined to that of Jesus.  So maybe the denial of an after-life is not such a new idea at least in liberal circles. Orthodox Christians will beg to differ and will cite the NT refs.\n\n","date":"May 18, 2012 at 9:10 am","url":"https://shroudstory.com/2012/05/18/do-christians-misunderstand-heaven/","cat":"news_&_views","id":"comment-11421","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Do Christians Misunderstand Heaven?","post":"It is perhaps not all that surprising that Jewish ideas of an after-life developed in such a cosmopolitan city as Alexandria.  We can see in the concept the elements of Egyptian funerary rites [Book of the Dead], Greek Platonic idealism with its notions of the soul (an idea alien to tradtional Jewish thought), and Iranian (Persian) ideas of a world of angels and demons.  So we might say that the development was some process of syncretism.  My own religious view is that God chooses his own methods of revelation of His Truth to humanity,  Clearly the Alexandrian Jews came to believe in an after-life which went well beyond the traditional Jewish idea of Sheol as the the abode of the dead.  The concept became part of early Christianity, was authenticated from the words of Jesus, and was developed further by the early Christian writers in the NT.  I do not see that the Christian view of heaven would sound so bizarre to Jesus as the lead article asserts.  The fact that the early missionary church was essentially Hellenic rather than Jewish, ensured that the concept survived.\n\n","date":"May 18, 2012 at 4:59 pm","url":"https://shroudstory.com/2012/05/18/do-christians-misunderstand-heaven/","cat":"news_&_views","id":"comment-11430","author":"daveb of wellington nz","site":"shroudstory"}]
