[{"title":"Double-0-7’s  Big 3 Analysis","post":"This is David Hines’s video posted here a few days ago. All I can say is that the opening image reminds me irresistibly of Johnny Depp.","date":"March 25, 2015 at 6:25 am","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194350","author":"Hugh Farey","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"See Hugh this:\nHere you have a callibration of Shroud and Manoppello. Contrary to Depp face, they are truly 1:1 overlayings. It is not only the proportions, real life size of the Shroud face corresponds exactly with the real life-size of Manoppello Face.\nMore\n\nYou have several similar wounds, blood marks, and other tiny details. Here, on the old chart you have a dozen of them, but actually there is likely to be many more there.\nHere you have Shroud and Manoppello marked and overlayed. As you can see the correspondence is really significant.\nNo Hugh. Shroud and Manoppello are not the same level as Shroud and Depp, or Prince William.\n\n","date":"March 25, 2015 at 1:32 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194387","author":"O.K.","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"Strangely, imgur did not pick up the overlay, but the comparison is just as exact as any of the others, Manoppello, Justinian II, da Vinci, Durer, the Cistine Chapel, Prince William and all the other incontestable derivations we have seen over the years.\n\n","date":"March 25, 2015 at 6:31 am","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194353","author":"Hugh Farey","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"Good Afternoon Hugh, I did the  Prince Williams overlay with The Shroud, his eyes were about 2″ lower than where The Shroud eyes were.  It not only did not fit, it was not even close.  Some people doing these overlays are changing the aspect ratio of the image which is completely dishonest and deceptive.  The overlays on this video are NOT doing that.\n(I know also that you did NOT do that with this Depp image)  The question about the Depp image is where is the forehead?  When the eyes are lined up, the forehead must also match up, end of nose and mouth should also be  in the same place with very minimal to no drift when it is over laid slowly.\nAnyone with good video editing software, such as Sony Vegas could overlay these images and will find out that I did a straightforward honest comparison.   I have not seen this Prince Williams overlay but I know  His face does not line up with The Shroud at all. If it is shown matching, deception is involved.\nThese overlays are done matching only the head length.  As soon as that is done, nothing else should be done.  If it does not fall into place immediately after length is matched. It is not a match. Because the length is matched does not mean the width will match. Width of image is NOT changed.  When the length is matched the width should line up automatically.\n (It took less than 5 minutes to do the Pantocrator, that is how fast that lined up)\nAnyone can match eyes into the image but will everything else line up?  NO.  Only if one changes the aspect ratio which is a very simple thing to do with video editing software, doing this  you could make almost image fit.  But it also not honest and it is also very easy to debunk and expose as a fraud if one is doing this to deceive someone. God forbid anyone be guilty of doing such a thing.\n If the skull being matched is for example 9″ in length, then the overlay image being compared must also be 9″ in length.  That is only point that is matched, nothing else.\nAnyways, how do you upload a photo on this site?   There is no place to attach a file, how are you getting a photo uploaded on here?   Let me know when you have time.  That way I can do the overlay and show the in between phases of the images in still shots.    We can start with Prince Williams and show everyone how it really lines up honestly.  Then the J. Depp image.  I will use the same software I used on these images do you can see it.  I will match them and do the overlay.  It is not complicated.\n\n","date":"March 25, 2015 at 4:06 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194405","author":"Dave Hines","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"Anyways, how do you upload a photo on this site? There is no place to attach a file, how are you getting a photo uploaded on here\nUpload your picture on Imgur http://imgur.com/ and place a direct link in your comment.\n\n","date":"March 25, 2015 at 5:59 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194414","author":"O.K.","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"\nMy channel was named after this painting I did.\n\n","date":"March 26, 2015 at 1:35 am","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194438","author":"Dave Hines","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"And that picture of Depp is from Pirates of the Caribbean 3 !!!\n\n","date":"March 25, 2015 at 8:13 am","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194357","author":"David Goulet","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"That is either a coincidence or the Spirit of God’s way of interjecting humor on this blog site.\nAfter I uploaded thIs video (an hour later)  I matched 3 of 5 numbers on a lottery ticket and won $50.00.  It was the 1st time in my 51 years on this planet that I matched more than 1 number on a lottery and won money.  The odds of doing so were 1 in 559.65.  I did ask the Spirit of God for a number 3 sign if the #3 blood stain was not a coincidence but a ID mark.\nThere are those that would say I received that sign and others that would say the events are not related.  Anyways Good Friday falls on April 3rd This Year.   NASA confirmed there was a blood moon visible from Jerusalem on Friday April, 3rd, 33AD.   Many believe that is the day of the cross.  The April 3rd date is according to the Julian Calendar in use at that time.  The “3” could be telling us\n1. Time of death   3:00PM\n2. Date of death  April 3\nIt is either a coincidence or it is not. There is no in between. 50/50 chance starting out  \nWhen Jesus was on the cross he was being mocked by the Jewish High Priests they shouted to Jesus “You said you were going to destroy the Temple and rebuild it in 3 days. Well then, if you are the Son of God, save yourself and come down from the cross!” \n3…\n\n","date":"March 25, 2015 at 4:55 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194406","author":"Dave Hines","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"Hi David\nAgain this year Good Friday is coming on 3 April.\n\n","date":"March 29, 2015 at 5:49 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194806","author":"Sampath Fernando","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"Hi Sampath.  NASA confirmed there was a blood moon visible from Jerusalem on April, 3, 33AD According the to Julian Calendar use in that time. Gregorian calendar date would be April 1st.   I have been editing a film for several days. Sorry for the delayed response.  I am uploading a video in regards to this number #3 bloodstain that is so absolutely bizarre that I do not think I will ever hear the end of it.   I will be ridiculed and laughed at, but that is OK.  I am not going to freak out over it and get upset.  This will be no doubt one  the most bizarre videos if not the most bizarre video ever uploaded in regards to the authenticity of The Shroud of Turin. I have been accused of trying to cash in on the Man In The Shroud, yet I gave my books away for free and do not make a single penny on any video I ever produced.  My income source and my Shroud of Turin research are 2 completely different things.    I have lost money, not gained. Well over 5 figures in expenses and nothing coming back  and I could care less, I get reimbursed in ways that I cannot even begin to explain.  I like doing Shroud research.  It is fun and exciting.  It also a extremely serious subject.  This video is a combination of all those.  Very serious and bit of fun at the same time.   All things in accordance with the will of God.  Get ready to be a bit surprised when you see the footage I am uploading.\n\n","date":"March 30, 2015 at 2:25 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194879","author":"Dave Hines","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"The earliest known example of the numeral ‘3’ can only be traced to about 700 AD when it appeared on some Indian copper plate deeds involving a land transaction, and is subsequently known to occur in numerating the verses in an Indian poem.  The Indians had developed a true denary system including a zero place holder.  The system was adapted by the Arabs, using two different forms for the symbols.  The system was first introduced into the West by Gerbert of Aurillac when he became Pope Sylvester II around 1000 AD, and who had been exposed to Moorish education.  It only became popular during the 1200s when Leonardo Fibonacci, similarly educated, published his ‘Liber Abaci’.  Previously commercial transactions were calculated using a 10-base abacus, and written down using Roman numerals which had originated from shepherd’s tally sticks.  Astronomers and mathematicians continued to use a Babylonian 60-base system even well into the 1500s.  Coming back to New Testament times, both Greek and Hebrew used a 10-base alphabetic system.  The forehead bloodstain in the shape of the numeral ‘3’ only appears as such after 1898 when Secondo Pia’s negative photo of the Shroud became well known, and reversed the stain which on the original cloth appears as a Greek epsilon.  In the Greek numerary system,.epsilon is given the value ‘5’, of no particular biblical significance of note.  If considered as an imprint, then the original template for it would certainly appear as a numeral 3.  We might therefore speculate that as such the Shroud was intended for our own times, when the ‘3’ became intelligible as such, and might be interpreted in a symbolic way.\n\n","date":"March 25, 2015 at 2:24 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194395","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"700 AD eh? Could you cite a source?\nDo u think spies (trolls?) would be interested in spreading disinfo on certain shroud messageboards and youtube? jk lol ;)\nps – The Good Shepherd is also a movie about the American/CIA spy ring at Yale fraternity best known as Skull & Bones (Russell Trust Association). Context.\n\n","date":"March 25, 2015 at 3:12 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194399","author":"Not a John Dee","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"I love reading your commentary.  You did mention you wanted to talk more about the “message of the Shroud”  this video falls kind of falls into that category.  I highly doubt this is what you had in mind.  Discussing a blood stain that took on the shape of # 3.\nI do believe the Shroud image was more intended for our own times.  More people have seen it in the last 100 years than in the last 2000 years.\nThere are 2 Possibilities.\n1. Blood flowing from small puncture wound/wounds by random chance took on shape of #3\n2. Blood flowing from small puncture wound/wounds did not randomly take on shape of #3. \nIf a random event, we should see other examples of this occurring in other cases where the head of someone suffered small puncture wounds or any type of wound for that matter.\nRandom events repeat themselves more often.  Should be able to find other examples of this happening by random occurrence.  If not, it starts looking like it is not a random event. \nUnfortunately this type of research would involve having to look at the photos of thousands of dead bodies or photos of people who suffered a head injury that caused blood to flow.\n\n","date":"March 25, 2015 at 5:19 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194408","author":"Dave Hines","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"More 3s\n3 temptations, Jesus raised 3 dead people, 3 disciples to pray at Gethsemane, 3 disciples when transfigured,\n\n","date":"March 25, 2015 at 9:08 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194421","author":"Sampath Fernando","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"3 More Coincidences?\n1. “For You will not abandon my soul to Sheol; nor will you allow Your Holy One to undergo decay”\nCoincidence:  No evidence of decomposition on Shroud,  dead body could not have been in Shroud more than 3 days. \n2. “And the soldiers platted a crown of thorns and put it on his head”\nCoincidence:  Pollens from Gundelia tournefortii, (Not the kind of plant that would have been used as a funeral bouquet) an extremely fearsome-looking thorn plant are present around head and upper scalp area of Man In Shroud and extending to its vertex are at least 30 blood flows from spike/small puncture wounds. \n3. New Living Translation   Paul of Tarsus\n“Oh, foolish Galatians! Who has cast an evil spell on you? For the meaning of Jesus Christ’s death was made as clear to you as if you had seen a picture of his death on the cross”\nCoincidence:  The pollen trial on the Shroud goes  from Jerusalem to Edessa and into Central Turkey where Galatia was in that time. \nThe entire Shroud of Turin case file is one coincidence after another that all point to the same person as being the person wrapped in it.\nI could list up to 100 more points like this quoting scripture and the forensic fact that is “coincidentally” in agreement with the historical record \nEach display given a numerical value of weight, say 1 lb.   By itself, one piece of evidence does not carry much weight, like the #3 bloodstain, it is not proof of anything, it’s circumstantial,  but when circumstantial evidence starts increasing in numbers, like replicating mitochondria DNA, A complete profile/ more clear picture can be seen. Process of elimination also takes place as numbers increase and the weight gets heavier.\nAt what point as the scale continues to tip further and further as each 1lb weight is put on the scale does one wave the white flag and say  “these cannot all be coincidences”\nThe Man In The Shroud Must Be…\n\n","date":"March 26, 2015 at 2:32 am","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194444","author":"Dave Hines","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"Hi Sampath\nHere is the complete list of “3” Coincidences\n  listen to your inner voice and trust your gut feeling, what is it telling you?\n1. Jesus prayed (3) three times in the Garden of Gethsemane before His arrest.\n 2. Jesus was on cross for 3 hours\n3. There were 3 hours of darkness while Jesus was on the cross\n4. NASA confirmed there was a blood moon in Jerusalem on Friday April 3, 33AD\n5. Jonah was in the belly of the whale for 3 days\n6. After Elijah was taken into heaven skeptical roman soldiers searched for his body for 3 days but did not find him, only his Shroud/Mantle was left behind. (Preceding Event to the Resurrection)\n7. Jesus’ ministry on earth was 3 years and he was 33 years old at death\n8. Jesus is 1) Prophet, 2) Priest, and 3) King.\n9. There were 3 witnesses to transfiguration of Jesus,\n10.  During His ministry Jesus raised 3 people from the dead.\n12. There were 3 crosses\n13. The inscription on the cross of Jesus was in 3 languages.\n (Showed completeness of His rejection by man)\n 14. Peter denied Jesus 3 times,\n15.  Later Peter told Jesus he loved him 3 times\n16.  Judas betrays Jesus for 30 pieces of silver\n17. 3 Samples of Shroud fabric are sent to 3 different labs\n18. Shroud of Turin is 3 over 1 herringbone twill fabric\n19.  3 women and 3 men were present at burial.\n20 Jesus appeared to his disciples 3 times after being resurrected\n21.  3 witnesses to Resurrection,  Shroud, Sudarium, Empty Tomb\n22. It took Saint Joseph and Mary 3 days/3 nights to find Jesus in the Temple; Talking with the elders for 3 days\n23. Jesus received 3 gifts at birth, gold, frankincense & myrrh (same at death)\n24. Jesus was in the tomb 3 days\n25..Jesus said he would rise after 3 days & temple will be re-built in 3 days\n26. God’s attributes are (3) omniscience, omnipresence, and omnipotence.\n27. God’s essence is that of a Trinity (3) Three in One: Father, Son, and Spirit.\n28. Three (3) denotes divine perfection and completeness\n29 Jesus died at the 9th hour (3 p.m.).\n30 The Number (3) is the number of resurrection\n31 The NUMBER 3 is written in blood on the right side of the forehead of Man in Shroud\n32. The NUMBER 3 bloodstain is 3cm long!!!\n\n","date":"March 26, 2015 at 4:37 am","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194452","author":"Dave Hines","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"Hi Sampath, here are some more coincidences that occurred with the number 3 recently.  I filmed it.  I got on my knees and asked in the name of Jesus to place a moving electrical signal in front of my ELF sensor oscillating at 3.333 cycles per second and it happened!   4 number 3’s   Today is 4-3\nThere are 2 possibilities\n1. The events are related\n2.The events are not related.\n One could argue my ELF sensor was falsely perceiving there was an electrical signal in the room or just displaying the number sequence I asked for so my feelings would not be hurt, or I somehow gained the ability to be able to control the number of times an electrical oscillates in one second with 4 decimal point accuracy.   I cannot.   But the Man In The Shroud/Jesus can.  It is said it is not possible to scientifically prove the Shroud is genuine, WRONG.   “All things are possible to he who believes”\n Enjoy the Holiday weekend.\nSpirit of God often leaves clues behind in the form of numbers.    033\n \n\n","date":"April 3, 2015 at 2:19 am","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-195230","author":"Dave Hines","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"There are 2 Possibilities.\n1. Blood flowing from small puncture wound/wounds by random chance took on shape of #3\n2. Blood flowing from small puncture wound/wounds did not randomly take on shape of #3\nSame deal with 3D Info/distance info.\nThere are 2 Possibilities\n1.  Fibers on outer shroud fabric are colored and others are not are a random event\n2.  Fibers on outer shroud fabric are colored and others are not are NOT a random event\nIt was either planned or not planned.    Created and designed that way so that at a later date in time when technology increased a VP 8 analyzer would interpret the data as elevation and 3D figure of original subject could be reproduced.\nOr the fact some fibers are colored and others not are just a random accident, like the number 3 bloodstain…\n\n","date":"March 26, 2015 at 3:16 am","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194446","author":"Dave Hines","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"Barbet gives a full and comprehensive analysis of the blood flows from the crown of thorns.  The shape of the striking blood-stain as a ‘3’, would seem to arise from a furrowing of the brow from the excruciating pain from the thorns, firmly held in place by a circlet of rushes.\n\n","date":"March 26, 2015 at 2:53 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194506","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"Not a John Dee, Mar 25, 3:12 pm: “700 AD eh? Could you cite a source?” Refers to mine: “The earliest known example of the numeral ‘3’ can only be traced to about 700 AD when it appeared on some Indian copper plate deeds involving a land transaction, and is subsequently known to occur in numerating the verses in an Indian poem.” \nThe standard and extremely comprehensive work on the origin of numbers of very many different civilisations is “From One to Zero” by Georges Ifrah, first translated from its original French title of 1981 by Viking Penguin 1985, date of my copy.  There may have been subsequent reprints. \nChapter 29 in Part VI, some 60 pages ‘The Origin of Arabic Numerals’ is relevant.  The particular copper plate deed is dated ‘Cheddai 346’ corresponding to AD 595.  The poem with the numbered verses corresponds to a date AD 875.  There were modifications in the specific symbols, including some reversals for an historical reason, but few changes in the system used.\n\n","date":"March 30, 2015 at 12:24 am","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194825","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"I wrote the above note in some haste because of an interruption at the time.  The full title of Ifrah’s Ch 29 is actually ‘The Origin of Hindu-Arabic Numerals’.  It was the Hindus who invented our modern denary counting system, and it included a place-holder zero.  The only precedent for it is the ancient Babylonian base-60 system which only survived in astronomy and mathematics.  No other civilisation ever came close to any similar system.  The Indian system migrated extensively into  South-East Asia, but the symbols were modified and adapted to suit local writing materials and styles.  The Arabs adapted the system, and two separate sets of symbols developed one eastward and the other westward. \nThe actual symbol used for the Cheddai date 346 (=AD 595) in the copper-plate deed appears as three near-horizontal scribed strokes with a vertical stroke down the middle.  The 3 symbol used in numbering the verses in the AD 875 poem is actually very close to our modern 3 with a small tail.  Ifrah has several tabulations of the symbols used at various times, and there is quite some variation, some of them particularly stylised.  The first appearance in the West occurs in a Visigoth manuscript ‘Codex Vigilianus’ of AD 876 where the 3 appears more as a stylised z with a reversed tail.  In this CV manuscript the numerals 1 and 6 to 9 are very close to our modern styles, the 2 is upside-down, but 4 & 5 are hardly recognisable as modern symbols.  Around 1000 AD Gerbert of Aurillac. as Pope Sylvester II attempted to introduce the system in commercial transactions by using numbered counters called ‘apices’ on a counting board replacing the abacus.  The appearance of the numbers would then depend on the observer’s perspective of the counter, which explains the upside-down 2. The apices system never really caught on. In the 12th century, Adelard of Bath translated several Arabic mathematical works and the apices method was discontinued.  Leonardo Fibonacci 1180-1250 had been educated by Arabic masters in North Africa and his published work ‘Liber Abaci’ popularised the arithmetic, counting systems, and symbols, pretty much as we know them today.\n\n","date":"March 30, 2015 at 5:57 am","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194846","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"A couple more comments, if I may.\n1) My first response to the blue picture at the start of the video was, ‘he looks like Johnny Depp.’ This had nothing to do with matching up pictures – in fact I had to hunt quite hard through Google images to find one that matched my mental picture of the actor, to then compare with the Shroud. No one could look at the Manopello image, with its somewhat grotesque teeth, or the slicked back hair and sleek moustache of the Pantocrator, and say, ‘he looks like the man on the Shroud.’ I do not consider the mathematical similarity more important than the overall artistic one.\n2) When I match up a couple of photos, I do not use the size of the head. It is impossible to gauge the size of the Shroud man’s head as his beard obscures his chin. What I do is to adjust one picture (without changing the aspect) so that the level of the eyes and the level of the mouth match, as I have in my picture above. When that is done almost any picture of anybody blends quite well, including Prince William.\n3) Your own matches of the Manopello and Pantocrator images do not match mouths well. For the Manopello image, we have to assume that what is normally taken as the lower lip of the Shroud man is actually the teeth of the Manopello man, while the lower lip of the Pantocrator image is actually the moustache of the Shroud man. Comparing the Manopello image with the Pantocrator image, following your own video, shows the mouths of the two are widely discrepant.\n4) At 4:08 we are told “there is no way your going to get all these match points by random happenstance” and at 4:20 we get “the calculated odds of probability and chance that all these 180 points of congruency between the Shroud of Turin and this image [the Pantocrator] are a coincidental match … are 1 in several million at least.” Actually the video shows almost no points of congruency, let alone 180. You would have to point them out individually before anybody could accept any such thing. How did you count them? Simply lining up the eyes does not show 180 points of congruency.\n5) There is also a claim (at 1:35) that the Manopello image must have been laid against the Shroud image for the match to be so perfect. However resizing photographs to fit each other does not support any such claim. To do that you would have to produce actual measurements of similar features of the two images, which has not been done, either here or, I believe, anywhere else.\nAll in all, its an entertaining game, this image blending demonstration, but it tells us nothing at all about the origins of the various images, let alone constitutes any kind of ‘proof.’\n\n","date":"March 26, 2015 at 3:46 am","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194447","author":"Hugh Farey","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"Good Afternoon:  Good points.  Good Comments.  When you have time could you go on Shroud Scope and map out 2 points on both negative and positive image?\nThe goal being to determine the exact length of the skull of Man In The Shroud.\nCan you make points where you believe the forehead begins and where the chin ends?\nAs close as you can get.  You are more than qualified to make those determinations.\nWhat is that number exactly?\nThen when you have time could you take screen shots of both and post them here?\nI don’t care if there is a line drawn in the middle of the face in the screen shot. \n1. Using the negative\n2. Other using positive  \nThat way lines are established.   I will do overlay based on the points you map out.\nWhen the overlay is done we will cut off the portions of the images being overlaid so we are only seeing the length of the head, from top of forehead to bottom of chin.\nLines must be established that are not crossed so as not to tilt the scale in favor of a match when in fact it is not.  Sword cuts both ways on that.\n Only then can the most accurate overlay be done.\nGOAL: Determine exact length of the skull of Man In the Shroud, next overlay will be based on the points you map out. \nNote for the record I never used the word “proves”  or that the Manoppello image was a contact image, only that it is believed by some to be a contact image.   The way in which the Manoppello lines up with Shroud is evidence that supports it could be contact image.  That is all.  It does not prove anything.  That I agree with. \nHoping to see some photos posted with lines established.   I will use them on next overlay.\nI will lay the Manoppello image within those lines and any other.\nIt was my goal to achieve perfection when doing these overlays.   I do not think I was 100% successful in doing that.   Repetition is the mother of skill.  I will do it again.\n\n","date":"March 26, 2015 at 2:22 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194502","author":"Dave Hines","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"No, David. I do not believe that any objective skull length can be established for the Shroud image. My guess could be no better than yours, and neither need be accurate. Far better to use the level of the eyes and the level of the mouth, as I did above.\nIt is true that you did not commit yourself to the Manopello overlay hypothesis. However, expressions throughout your video such as “there is no reasonable doubt that whoever did this work used the Turin Shroud as a role model”, or “there is no way your going to get all these match points by random happenstance” suggest that you think your overlay technique definitely demonstrates something that it most definitely doesn’t.\nThere is no need to repeat your matching exercise. 180 points of congruency is quite perfect enough for me. If they in fact exists at all. Perhaps you could post an image with arrows pointing them all out.\n\n","date":"March 26, 2015 at 2:51 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194505","author":"Hugh Farey","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"Opinions vary Hugh, but mark my words on this.  God willing I will prove beyond any reasonable doubt that some of these frescoes used the Shroud of Turin as a role model.   Accidental characteristics are being replicated, that is not going to happen by random coincidence. One who believes accidental characteristics being replicated is not strong evidence that proves beyond a reasonable doubt the images are connected, rages against forensic science and logic.\n Consider these images I have here as appetizers.  I am not even close to being through. Just warming up   Main entree is coming.   A full meal that will leave most everyone satisfied.  Best is yet to come.  \nThomas Heaphy sketch lines up incredibly well.   No one can deny that.  All I need are just a few more witnesses to come forward and we will put them up on the stand.  3 witnesses.  Note how on the Pantocrator image the artist replicated the circles around the eyes where they are whited out on the negative image.\nYou say that is a coincidence, I say it is not.\nAnother thing we need to do, is to stop limiting ourselves to what we believe is possible,\nTo move outside our circle of comfort, to be more bold & assertive, expansive & faithful in our thinking and take action.  To be fearless and without doubt.\nThose are the character qualities that people gravitate toward and children look up to and want to role model.\n Most certainly we can go on Shroud scope and make a determination of the length of the skull with a very slim margin of error. Yes, that is possible, it is not only possible, it is going to be done.\n I may stumble and fall along the journey but with some help from the Man In The Shroud I will get the cross up the hill.     Amen  (Thank you Lord in advance)\n\n","date":"March 26, 2015 at 5:49 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194522","author":"Dave Hines","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"Hugh:\nWhat I do is to adjust one picture (without changing the aspect) so that the level of the eyes and the level of the mouth match, as I have in my picture above. When that is done almost any picture of anybody blends quite well, including Prince William.\nTherefore you have only a single distance. Thus any picture will match as you have complete freedom in adjusting the scale.\nHugh:\n5) There is also a claim (at 1:35) that the Manopello image must have been laid against the Shroud image for the match to be so perfect. However resizing photographs to fit each other does not support any such claim. To do that you would have to produce actual measurements of similar features of the two images, which has not been done, either here or, I believe, anywhere else.\nDave Hines:\nGOAL: Determine exact length of the skull of Man In the Shroud, next overlay will be based on the points you map out. \nHugh:\nNo, David. I do not believe that any objective skull length can be established for the Shroud image. My guess could be no better than yours, and neither need be accurate. Far better to use the level of the eyes and the level of the mouth, as I did above.\nThis actually has been done. See my post from March 25, 2015 at 1:32 pm:\nYou have absolute scale thre, based on data from ShroudScope, and Sister Blandina Paschalis-Schloemer atlas of overlays for Shroud/Manoppello/Oviedo.\n\nAccording to Sister’s measurements (pg. 28-29) the distance on Manoppello from tip of the nose to the tuft of the hair is 134 mm, while distance on the Shroud between two folds is 237 mm. My own measurements with ShroudScope give about 227 mm. The difference is about 4-5 %.\nThe whole Manoppello dimensions are circa 24×17.5 cm. The Shroud’s are circa 442×113 cm. The size of both cloths is known within a few %. So given uncertainites of callibration, and the fact that the fabrics might have changed their size a couple % through the centuries, we can say that both faces on Shroud and Manoppello have exactly the same size, with a max 5 % +/- margin of error.\n\n","date":"March 26, 2015 at 4:52 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194508","author":"O.K.","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"Hi OK, if you have time, could you go on Shroud Scope and using the measuring tool draw the line from the top of the forehead to bottom of chin where you have it.    Average size of human skull is 8 to 9 inches.  227mm is 8.93 inches.   I think you are right give or take a few millimeters.   Please take a screen shot and post it when you have time, I will do the same and see what I come up with. I am interested in seeing where the 2 points end up.\n   Images being overlaid with the Shroud will also be scaled to 8.93 inches.  Matching top of forehead to bottom of chin as precisely as it is humanly possible to do so.  I am going to re visit some images this weekend.  Manoppello, Pantocrator and some others.  I will post photo results.  Sony Vegas Video Editing Software makes it possible to do extremely fine point adjustments.  That is what I am using.\nI am going to make some improvements, slight adjustments based on new and hopefully more accurate math.\n  Need to be certain what the distance between point A & point B is.  Give or take 5 millimeters. I am sure it is possible to be that accurate.\n\n","date":"March 27, 2015 at 11:20 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194664","author":"Dave Hines","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"Hi OK,This would be an example.    This is 224mm in length   Does it look right to you?","date":"March 28, 2015 at 12:25 am","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194667","author":"Dave Hines","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"Hello Dave.\nAll my callibrations you have in my post above from March 25, 2015 at 1:32 pm. They are partially based on ShroudScope, and partially on callibration by Sister Blandina in her book pg. 28-29.\nAccording to sister the distance between precisely two points marked (two ends of green arrow) is 237 mm.\nMy Shroud Scope mesurements give 227 mm instead. \nStill according to Sister, the distance between tip of the nose and top of the hair strand on Manoppello is 134 mm. This fairly precise correspond with the dimensions of Manoppello image (24×17.5 cm).\nRemember that absolutely accurate callibration is impossible. There is always an uncertainity, but no higer than 1-2 %. \nThe overlays are based on Sister Blandina values of 237 and 134 mm. However, I discovered that scaling down Shroud image to about 0.97 factor (which is equivalnet of about 230 mm) gives better results.\n\n","date":"March 28, 2015 at 4:52 am","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194675","author":"O.K.","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"Hello, sorry if intruding the discussion, but wanted to ask the crew.\nSince, Alan Adler gave at the Richmond Shroud Conference in 1999. comment that the surrounding cloth will gradually get darker and darker with time until the image first becomes a silhouette and later finally disappears altogether. Got me thinking and wondering what is the opinion of the participants on this site: was there more blood centuries ago on the Shroud?\nLook at the http://plastanica.blogspot.com/, and espc. this Serbian example:\n– Плаштаница скопског архиепископа Јована – 14. век. Манастир Хиландар. Света Гора\nArtistic exaggerating?\n\n","date":"March 26, 2015 at 7:54 am","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194469","author":"SDJJ","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"SDJJ If you access Charles Freeman Origins  of the Shroud of Turin in the English journal History Today you will find some of the descriptions that show,indeed, that observers of the Shroud did comment on the vivid nature of the blood on the Shroud in the fifteenth and sixteenth centuries. This was the age when paintings showing extensive blood of Christ, especially those showing Christ still bleeding even after he was dead, were very common.\nGood luck with your researches.\n\n","date":"March 26, 2015 at 10:32 am","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194479","author":"Charles Freeman","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"Also, great blog Dan!\nI am Serbian Shroud researcher, and would like to exchange thoughts from time to time. I apologize in front, but English is not my first language, and I have problem formulating sentences in the proper manner.\n\n","date":"March 26, 2015 at 8:16 am","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194473","author":"SDJJ","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"@Charles Freeman. Thank u Charles! I am familiar with ur writing, and do watch it closely (criticism is always welcome!), since I don’t think that it is a painting. Also, I agree with the Ian Wilson theory. Now, on some more details (if there are interested parties), when it comes to the Eastern rite involving the epitaphios and icons “not made by a human hand”, I recommend the works of one Aleksey Lidov, https://moscowstate.academia.edu/AlexeiLidov\nAnd, recommend the investigation of the further Mandylion type developments when it comes to the frescoepaintings. I am doing that for some time now. Example from Serbia, 1234. http://i57.tinypic.com/17saqw.jpg\nCheers!\n\n","date":"March 26, 2015 at 11:49 am","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194488","author":"SDJJ","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"SDJJ. It is just as important to read the work of professional historians who have different ideas from Mr. Wilson and it is important also to wonder why his views do not have any support from professional academics.  It is just a question of keeping your mind open.\n\n","date":"March 26, 2015 at 1:03 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194492","author":"Charles Freeman","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"Yes, I am always open minded. Thus, aware that the Mandylion/Shroud theory is hard to proof, but I find it most probable. This Serbian example, in possibile connection with the Mother of God holding the Shroud, and with, what might be the allusion to the Shroud displayed within the casket. The Shroud is here much wider.\n\n","date":"March 26, 2015 at 4:22 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194507","author":"SDJJ","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"Hi SDJJ\nNice to see you here. Perhaps you could write a paper about the paintings and icons at your end. We need to document as much as possible. In his last Shroud book Ian Wilson mentions a “gang of Albanian Muslims” who desecrated frescoes on the walls of the church at the monastery founded by the Serbian king Stefan Dusan. These frescoes were part of the Image of Edessa connection.\n\n","date":"March 26, 2015 at 5:08 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194510","author":"Louis","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"Hello Louis! Nice to meet you also. Actually, my first short book on the Shroud is in the process of translation into English, but in this version, I am not getting into details about the “missing years”, except for the indication on the Peloponnese trace, regarding the Serbian icon Saint Face de Laon. I have suggested the Serbian idea way back to Ian, regarding lots of signs from Serbia, but templar “discovery” of B. Frale, stopped our research for a while. Now, we do have diff. views on the road of the Serbian path, for now….\n\n","date":"March 26, 2015 at 5:32 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194517","author":"SDJJ","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"Yes, Matejce church where the Serbian king Milutin was crowned, is now much destroyed. I could not visit, since after the terrorist Albanian organisation so called ANA, drove out all the Serbs living around. Bus going to that area, from Skoplje, goes only once a year, under military escort and is reserved for Serbs that once lived there, to pay their respect for their dead in Matejce grounds (since the Serbian cemetery is destroyed). To tell u the truth I lost lots of nerves while escaping from Kosovo and dodging bullets around Serbian churches (the few that survived)..\n\n","date":"March 26, 2015 at 5:57 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194524","author":"SDJJ","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"Also, I am very much interested in the post 1204. faith of Keramion.\n\n","date":"March 26, 2015 at 5:58 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194525","author":"SDJJ","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"SDJJ, this thing about your book is very good news. I do wish you include the “lots of signs from Serbia” in any paper or another book you may write.\nI was working on a possible Templar connection but had to lay it aside to devote attention to more urgent work. Hopefully the work should resume next month, but this takes a very long time as there is a lot of documentation to examine when this is available.\n\n","date":"March 26, 2015 at 6:02 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194527","author":"Louis","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"Take care, those terrorists are extremely dangerous.\nWould you know if the frescoes at the Matejce church, destroyed with graffiti, cigarette ash and pickaxes were documented?\n\n","date":"March 26, 2015 at 6:10 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194530","author":"Louis","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"Thank u Louis! Well, I was planing to get out in three days, but it took me three weeks… I do believe that there is a great chance the “sindon” fresco (as I call it) still stands. I was informed that part of the inside was not so much damaged (they ware practising shooting on some other parts of frescoes mostly…). Yes, there are some Serbian evidences in my first book. Well, my opinion is that there is certainly a templar connection in Thessaloniki with the Shroud and the Keramion, but after, it is all depending on the origin of: http://en.wikipedia.org/wiki/Helen_of_Anjou\n\n","date":"March 26, 2015 at 6:29 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194531","author":"SDJJ","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"The late Daniel Raffard de Brienne, who was the president of the French Shroud group CIELT and a descendant of (Gauthier) Walter VI de Brienne, Duke of Athens, believed that there was a Greek connection, but nothing to do with the Templars. He was wondering if XIIIth- to IVth-century archives still existed in Athens. If there is something there, then it could be a lead:\nhttps://www.academia.edu/9156258/Shroud_Studies_in_France\n\n","date":"March 26, 2015 at 6:59 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194535","author":"Louis","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"Thank you Louis. I like the final answer:\nBrienne: The secret of the Turin Shroud is the process by which the image of Christ was imprinted on the cloth. This process remains unexplained by modern science. Due to its characteristics, the image even contradicts certain scientific laws. The word “miracle” burns lips.\n\n","date":"March 26, 2015 at 7:52 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194540","author":"Sampath Fernando","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"Hi Sampath\nDaniel Raffard de Brienne was always courteous and also conservative, what people would call “old fashioned” today. I respected him and his views.\nIf modern science cannot explain the image, then, yes, it could be called a miracle.\n\n","date":"March 26, 2015 at 8:00 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194541","author":"Louis","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"What makes you think science is really trying to explain the process?\nThe Shroud is very important to many, but I see no NASA type program to try and explain it. Plus science has had little access to the Shroud and may not be able to do the types of test needed to explain it. So the Pope has ties the hands of science, don’t blame science blame the Pope.\nUntil a few years ago science could not explain how a bee can fly. Was that a miracle?  \nhttp://www.caltech.edu/news/deciphering-mystery-bee-flight-1075\nScience worked on it and now we know.  \nUnexplained does not = miracle.\n\n","date":"March 27, 2015 at 6:08 am","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194588","author":"John Green","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"Note for SDJJ:  Hello & welcome.  You may be aware of Ian Wilson’s presentation at 2012 conference in Valencia.  Slide show has very many examples of Mandylion depictions, including several from Serbia.  Ian Wilson – “Discovering more of Shroud’s Early history”, Valencia Conference 2012; Paper and slide show: http://www.shroud.com/pdfs/wilsonvppt.pdf\nText of his paper is also available at the same site.  You can probably do a search for it there. \nFor a different perspective that the Mandylion was not the Shroud, I recommend a reading of Jack Markwardt’s paper presented at St Louis in 2014:  Modern Scholarship And The History Of The Turin Shroud, Jack Markwardt;  http://www.shroud.com/pdfs/stlmarkwardtpaper.pdf .  It comprises some 276 pages, double-spaced, with 251 footnotes, and 20 illustrations taken from his 136 slide-presentation.  \nHe mounts some serious criticisms against the Wilson Mandylion hypothesis.  However his own hypothesis that the Shroud was actually the Image of Camuliana, later known as the Image of God Incarnate, has also seemed contentious.  That is not to say that it is necessarily incorrect.\n\n","date":"March 26, 2015 at 7:30 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194538","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"Thank u Louis, interesting article! The problem is that historians are still not shore if Helena was Anjoy, or just related. Nevertheless, her monastery in Serbia, Gradac is a jewel of the Shroud (speaking as a pro Wilson xD) depiction, from what is left from the Turkish destruction. Templar connection yes (as in protecting) but I do not think – in possession. I do know Dan Scavone was looking into Thessaloniki few years ago, but did not found anything more. But Serbs ware much present there, as ware in Peloponnese..\n\n","date":"March 26, 2015 at 8:27 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194543","author":"SDJJ","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"You’re welcome, SDJJ. The Templars had heavily guarded monastery-fortresses so they may have possessed the Shroud or just protected it, as you say. There are clues indicating that Jesus’ face was important to them and I am working on this topic.\nYou are in the right man in the right place to do the research at your end.\n\n","date":"March 26, 2015 at 8:41 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194546","author":"Louis","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"Thank u daveb of wellington nz! Yes, I am aware and as I said, I am monitoring everything…:)\nWhemn it comes to Mr. Markwardt’s work, I do find it refreshing, but Wilson-ist I stay. I do not think that, since we mentioned Serbian Matejce, at some point frescoes depicting the Abgar legend presented a large (I know, for some not large enough…) cloth – named sindon. Or look at the Studenica example. When it comes to the Slavonic history, one must also have in mind the historical background of this depictions. I believe that same goes for Serbs living in todays parts of Albania, Croatia and Bulgaria; same goes for Slavs in todays Belorussia, Russia.\n\n","date":"March 26, 2015 at 8:45 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194547","author":"SDJJ","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"We have many Yugoslavs whose families immigrated to NZ.  Some came out in the early colonial era, after about 1840 and mined the kauri gum fields in the far north; after that many of their families established the first vineyards here.  Others came out as WWII refugees.  I think most of them were actually Croats or Dalmatians, but I know there were also a few Serbs.  My closest friend at engineering school and best man at my wedding came from a Croat family, and his father’s shop in central Auckland seemed to be a kind of social centre for many Yugoslavs.  \nMarkwardt is of the opinion that the Abgar legend is an allegory concerning the conversion of Abgar VIII the Great ~200 AD, and not Abgar V Ukkama, the subject of the legend.  He believes the true Shroud was used as a kind of visual aid to assist this conversion and was then returned to Antioch.  He also cites the contemporary Edessan Bardesanic.’Hymn of the Pearl’ in support of this.\n\n","date":"March 27, 2015 at 2:26 am","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194575","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"Yes Louis, and I was actually having in mind idea of Noel Currer-Brigs, when it comes to the Thessaloniki. Who knows, maybe the church of Saint Nicholas Orphanos there is the best lead so far, when it comes to that city, that is.\nSerbian example of epithapiuos (Albania), that I find very important: https://torinskipokrov.files.wordpress.com/2015/01/plastanica-iz-glavenice4.jpg\nBelarus example: https://torinskipokrov.files.wordpress.com/2015/01/sveti-keramion10.jpg\nGood night Louis (here it is 03.09.)!\n\n","date":"March 26, 2015 at 9:08 pm","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194550","author":"SDJJ","site":"shroudstory"},{"title":"Double-0-7’s  Big 3 Analysis","post":"HI SDJJ\nThank you for the links. Please contact by em so that we can continue the discussion.\n\n","date":"March 27, 2015 at 9:53 am","url":"https://shroudstory.com/2015/03/25/double-0-7s-big-3-analysis/","cat":"uncategorized","id":"comment-194606","author":"Louis","site":"shroudstory"}]
