[{"title":"Shroud of Turin shows another mystery face","post":"The shroud image bears multiple facial images, as does the Guadalupe image, and there is no doubt that it was produced in a similarly paranormal manner. From a distance, when the image is turned upside down, one can see what appears from contemporary descriptions and depictions to be the face of the apostle Paul looking downward and grimacing in pain. His eyes are quite close together, his beard and hair dark, and his hairline receding. He is not the male model type. There seem to be flames leaping up from around his shoulders. The contrast with the handsome, serene face of Jesus is striking. In the photo shown at the following link, where some see a flower, there is actually another face which resembles the recently discovered second face. Moreover, this third face is a frontal view with a side view overlaid on it, and the pattern repeats (to the left) as if in a series of angled mirrors.","date":"June 7, 2009 at 6:42 am","url":"https://shroudstory.com/2009/02/21/shroud-of-turin-shows-another-mystery-face/","cat":"news_&_views","id":"comment-553","author":"Frank Martin","site":"shroudstory"},{"title":"Shroud of Turin shows another mystery face","post":"Its exciting to think that this bit of cloth may have been the actual cloth that was wrapped around christ himself. However some so-called “christian” religions are HUGE on using relics, and miss the point that  the important FREE gift of Christ and the apostles was the Bible – and they are given away free.\n*sigh*\n\n","date":"March 25, 2010 at 11:50 pm","url":"https://shroudstory.com/2009/02/21/shroud-of-turin-shows-another-mystery-face/","cat":"news_&_views","id":"comment-1181","author":"steve","site":"shroudstory"},{"title":"Shroud of Turin shows another mystery face","post":"I can certainly understand that True Believers WANT this Shroud of Turin to be the authentic burial cloth of Christ.  However, I am NOT one of them.  This was proven to be a fake, phony and a fraud, in 1988, by means of carbon dating.  CASE CLOSED!\n\n","date":"March 27, 2010 at 10:27 am","url":"https://shroudstory.com/2009/02/21/shroud-of-turin-shows-another-mystery-face/","cat":"news_&_views","id":"comment-1186","author":"Barry Fleckmann","site":"shroudstory"},{"title":"Shroud of Turin shows another mystery face","post":"“We have shown the shroud to be a fake,” Teddy Hall, the director of Oxford’s Research Laboratory for Archaeology and the History of Art said following carbon dating of the Shroud of Turin in 1988. “Anyone who disagrees with us ought to belong to the Flat Earth Society.”\nBarry, that should have been the end of it. The big piece of cloth with two life-size images, front and back, of an apparently crucified man was not—could not be—the burial shroud of Jesus of Nazareth. Science had just proven that.  It originated, so the scientists said, in the Middle Ages sometime between 1260 and 1390, or thereabouts.\nTwo decades later, people are still trying to prove the Shroud is fake. And we should wonder why. One reason is that the carbon dating has been shown to be invalid. Ray Rogers, who had accepted the carbon dating, decided to disprove a crazy explanation from what he called the lunatic fringe. The crazy idea was that the Shroud had been mended and the samples were from that mending job. What Rogers discovered was that the crazy idea seemed to be right. He concluded that the sample used for carbon dating was not representative of the cloth. It was chemically different. Moreover, one of the chemical differences, the amount of vanillin, provided a new clue about the cloth’s age. Samples from the main part of the cloth, unlike the carbon 14 sample area, did not contain any vanillin. If the shroud was only as old as the radiocarbon date, it would have plentiful vanillin.  The Shroud was at least twice as old. It might be 2000 years old. After a lengthy peer review process, his findings that the carbon dating was wholly invalid were published in the scientific journal Thermochimica Acta. This was also confirmed by John L Brown, a forensic materials specialist at Georgia Tech in Atlanta, Georgia and by Robert Villarreal and a team of nine scientists at the Los Alamos National Laboratory in New Mexico. Additional articles appeared including one in Chemistry Today that showed that the sample used was completely invalid. \nOne of the claims by proponents of authenticity is that even with modern technology, no one has been able to reproduce the images. British physicist Philip Ball repeated pointed this out in Nature. While true, it doesn’t mean that someone won’t figure it out, someday. \nBut that is not all. Several historians argue, I think correctly, that history strongly suggests authenticity. The arguments are about as good as most ancient history gets. Even so, definitive proof is elusive. \nCase closed is simply not the case. Also, you should be aware that many true believers, primarily fundamentalist Christians, DO NOT WANT the Shroud to be real.\n\n","date":"March 27, 2010 at 10:48 am","url":"https://shroudstory.com/2009/02/21/shroud-of-turin-shows-another-mystery-face/","cat":"news_&_views","id":"comment-1187","author":"Episcopalian","site":"shroudstory"},{"title":"Shroud of Turin shows another mystery face","post":"Hey, WHATEVER fits YOUR needs.  WHATEVER floats YOUR boat.  Comedian George Carlin called God (Jesus?), “The Invisible White Man in the Sky.”  Outside of the Shroud of Turin, there is NOTHING that exists to prove that Jesus EVER lived.  The story of Jesus belongs in Aesop’s Fables, and Grimm’s Fairy Tales.  Believing, brings people comfort.  I know that.  More power to ’em!  I’m an Atheist, but I love Christmas!!  The decorations!  Even the Nativity Scene!  It’s a BEAUTIFUL story!  Easter is coming, I’m gonna’ bring baskets of candy to my friends!  Yeah, I’ll help the cash registers turn!!  However, our home planet, Earth, has been here for about eight billion years.  Organized religion?  About two thousand years.  DO THE MATH!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\n","date":"March 27, 2010 at 4:31 pm","url":"https://shroudstory.com/2009/02/21/shroud-of-turin-shows-another-mystery-face/","cat":"news_&_views","id":"comment-1188","author":"Barry Fleckmann","site":"shroudstory"},{"title":"Shroud of Turin shows another mystery face","post":"Barry, I don’t mind that you are an Atheist. And I miss George Carlin who was a great comedian. But I’m afraid that in you I’ve encountered a non-thinking, fundamentalist Atheist. The earth is about 4.5 billion years old, not eight billion. Organized religion has been around longer than Christianity, which, BTW, has only been truly organized for about 1600 years or so.\n\n","date":"March 27, 2010 at 10:14 pm","url":"https://shroudstory.com/2009/02/21/shroud-of-turin-shows-another-mystery-face/","cat":"news_&_views","id":"comment-1189","author":"Episcopalian","site":"shroudstory"},{"title":"Shroud of Turin shows another mystery face","post":"Okay, Episcopalian, since YOU are too lazy to do the math, I’ll do it for you.  Draw a straight line across a blackboard, we’re going to make a timeline.\nIf we place the creation of the earth (4.5 billion years, 8 billion years, twenty billion years, WHATEVER!), at the far left side of the timeline, where would we put the creation of organized religions (okay, we’ll leave out Christianity, it’s too recent)?  \nOn the FAR right side of the timeline, THAT’S where.\nSomewhere in the middle of the timeline, we’re going to put the rise and fall of the dinosaurs, even though organized religion (The Bible, Old Testament) tell us that they were never, here.\nIt’s funny, but bones, fossils and footprints tell a far different story, but Moses and the Burning Bush are our final authority on this subject (he says with tongue pressed firmly in cheek!).\nSo, HOW does organized religion get around this HUGE disparity in time when it comes to Creation?\nIt tells us that the age of the earth is six thousand years, that’s how.\nYou know, Moses, the Burning Bush, God, Adam and Eve, the Serpent, Noah and the rest of Grimm’s Fairy Tales.\nYup, I AM a non-thinking, fundamentalist Atheist, and proud to be one, too!!!\nI can SURE distinguish between history and hokum, though!!\n\n","date":"March 28, 2010 at 8:30 am","url":"https://shroudstory.com/2009/02/21/shroud-of-turin-shows-another-mystery-face/","cat":"news_&_views","id":"comment-1190","author":"Barry Fleckmann","site":"shroudstory"},{"title":"Shroud of Turin shows another mystery face","post":"Barry, I am enjoying this conversation but I’m a bit confused by what you think the beliefs of “organized religion” are. I rather think that if you spoke with an Episcopal priest, a Catholic priest, or most clergy persons in mainline Protestant churches, they would have no problem with your timeline. The Bible is not a science book or a history book. Of course there were dinosaurs. Evolution took place over millions of years. The Bible is metaphorical in the sense that you are trying to argue that we Christians believe it in a literal sense. No we don’t.\nI’m glad you can distinguish between history and hokum. I think we probably agree on all the details. Even so, I believe in God. Barry, who are you reading? Could we discuss where you are getting your philosophical insights?\n\n","date":"March 28, 2010 at 7:38 pm","url":"https://shroudstory.com/2009/02/21/shroud-of-turin-shows-another-mystery-face/","cat":"news_&_views","id":"comment-1191","author":"Episcopalian","site":"shroudstory"},{"title":"Shroud of Turin shows another mystery face","post":"I am a dedicated catholic, I feel impelled to give my testimony because one needs to witness to the truth where and when necessary. In 1981 I was very privileged to have had a vision of our lord Jesus Christ in a historic church that was dedicated to St.Peter and St.Paul, I saw our Lords face, so sad.And the crown of thorns on his head so clear was this vision i could see the string of thorns encircled many times and the thorns so clear as if one would be pricked by them, I was totally awestruck and as you can imagine this vision took me from being a christian with many question marks to a fervent believer, after the vision i went to my mothers home when i went in to her living room i told my mother of my wonderful vision and was overwhelmed to discover that my mother had a copy of the shroud of Turin on her wall.I immediately said to my mother, this is Jesus Christ, this is who i saw actually as he is. It is him. The holy shroud image is that of Jesus Christ, I can’t prove it but i would lay my life on this because it is true. I have since 1981 had many other experiences which have also confirmed to me the authenticity of the holy shroud and that it is of our Lord Jesus Christ. One day it will be recognised as true and venerated as the wonderful relic that it is, and i look forward to that day. Yours in Christ … Fred\n\n","date":"June 5, 2010 at 7:42 pm","url":"https://shroudstory.com/2009/02/21/shroud-of-turin-shows-another-mystery-face/","cat":"news_&_views","id":"comment-1335","author":"Fred","site":"shroudstory"},{"title":"Shroud of Turin shows another mystery face","post":"Fred Ablitt, in my oppinion ,there is no doubt that the shroud of turin is the same shroud that Joseph of Arimathea wrapped the body of Jesus as in the gospel of Mark chapter 15 verses 42…46. Pope Benedict xv1 recently in Turin stated himself that the holy shroud of turin is like a photograph,positive and negative, he also said it is a burial cloth which enshrouded the corpse of a crusified man, and corresponds to what the gospels tell us about Jesus. I personaly believe that there is a whole stack of evidence to back up the holy shroud of turins true authentisity , but the real problem is that one still needs to look at the whole situation with the eyes of faith ,through an open mind,which is where most non believers stumble because they then have to accept that the God they dont believe in might actualy exist, which totaly contradicts there views, and puts there non beliefe to the test. In my view the real problem is that when true authentisity is being debated with those who dont believe in the existance of God, they inevitably wont take into consideration anything that might oppose there views, so in reality there is a stalemate, they then base there whole analysis on desisions they have made according to there own human ability to judge which is prone to error, using no more than tests to detemine age, carbon dating which has been proven unreliable, in the tests that have been carried out on the holy shroud of turin, so i ask those scientists lets look at this with an open mind, with a full compleate and unbiased analysis of all the evidence without exeption, then a true and fare conclusion can start to take place, if only for the sake of common sence…YOURS IN CHRIST…FRED…\n\n","date":"June 5, 2010 at 7:43 pm","url":"https://shroudstory.com/2009/02/21/shroud-of-turin-shows-another-mystery-face/","cat":"news_&_views","id":"comment-1336","author":"Fred","site":"shroudstory"}]
