[{"title":"Déjà vu or what?","post":"So…\nArticle I.1.0 The front and back images are equally dark. I think I agree with that.\nArticle I.2.0.A. The normal tones are reversed. The normal tones of what? Of body parts? I’m not light on the nose and dark in the cheeks. \nArticle I.2.0.B.The parts of the body closest to the cloth left the darkest marks. Sorry, but from a critical viewpoint you can’t just assume that a body was present to make the marks.\nParts of the body which would have been closest to the cloth if the image was made by a cloth lying over a body? Sorry, can’t allow that either, as the cloth could have been horizontal or draped or wrapped.\nParts of the body lying closest to a theoretical horizontal plane level with the tip of the nose? Sorry, but you need also to specify if the body was also horizontal. Were the knees, for example, higher off the floor than the nose or not?\nParts of the body which would have been closest to a horizontal plane level with the tips of the knees assuming that the body was lying in a slightly knees-up position with the head also slightly raised? Er, no, as the head and particularly the nose is generally assumed to be the darkest area, and the knees would be much more prominent than the hands, for example.\nParts of the body which would have been closest to the cloth if the cloth had been draped over the body? Back of the head? Sides of the hair? Sorry.\nParts of the body which would have been closest to the cloth if the image was made by a cloth lying over a body which draped naturally from head to toe but not at all from side to side? Rather like unrolling a carpet or Venetian blind over the body? I think we may be getting there…\nArticle I.2.0.C. The image has the characteristics of a photographic negative. Of a monochrome photograph of a person taken full face with a light source directly in front and a black background. Although we are often told that real photographs of people under just those conditions do not look like the shroud, as the 3D image derived from them is unconvincing. If this is true, the shroud does not have all the characteristics of a photographic negative. I concede that it does have some; rather general and rather subjective.\nArticle I.2.0.D. The contrasting photographs. The negative is clearly not the negative of the positive, but a different photo altogether. It is also printed at a different size. A “true” negative would have the famous “epsilon” blood stain pointing a different way.\nWell that was exciting. Would anybody like to take over?\nArticle I.3.0…..\n\n","date":"January 30, 2013 at 11:00 am","url":"https://shroudstory.com/2013/01/30/dj-vu-or-what/","cat":"uncategorized","id":"comment-23044","author":"Hugh Farey","site":"shroudstory"},{"title":"Déjà vu or what?","post":"This new paper is a long (near 44 pages) and interesting document.\nBut (into the table “Image Characteristics”, under the chapter : “Evaluation of Image Formation Hypotheses”) there is not the useful combination “contact-gaseous diffusion”\nas we can see in other works (or hypotheses). See f. e. the old work by Volckringer\n(and the the Volckringer patterns could be reconstructed in 3D relief …) who was\nquoted by Dobert Siefker and Daniel Spicer under “contact”.\nThen, see also : the past study by Eng. Marcel Alonso (CIELT) and the strange\nquestion of the japanese gyotaku.\n… But, unfortunately, in this new paper by Siefker and Spicer there is not\nthe word “capillarity” … this argument was not treated (… if I was right in my reading\nof the file).\n— —\nIn any case the question I7.0 (ID) = convex “hills” (the convex hills of the\nface = eyeballs and tip of the nose !), seems to be an interesting argument.\nWhat is your idea about these particular “hills” ?\nI hope you have the possibility to control the inherent x, y, z data\nobtained from the different images of the Shroud taken in the past.\nThen, see also : the old question of the grain (observations by Barrie Schwortz,\nan expert in this field) in the photographs by Enrie, the different kind of resolution,\netc., etc. (included the images taken by HAL 9000, a company specializing in Art photography !) …\n— —\nRegards,\nPiero\nB. T. W. :\nHave you tried to see what happens (= detailed image analysis)\nusing the images taken by the company Hal 9000 of Novara  ?\n\n","date":"January 30, 2013 at 11:59 am","url":"https://shroudstory.com/2013/01/30/dj-vu-or-what/","cat":"uncategorized","id":"comment-23049","author":"Piero","site":"shroudstory"}]
