[{"title":"Endowed by their maker with dim wits","post":"Dan’s point is well made, and I’m aware that I, among others, may have offended from time to time.  For that I apologise.  While complaining about the mote in other’s eyes, we can be somewhat blind to the oaken beam in our own.  There’s a tradition in Parliamentary democracies that while debate can be expected to be robust in the Chamber of the House, unparliamentary language is not to be used, and in NZ anyway, members too often have to be sent out of the House for offending.  I imagine other jurisdictions have similar House rules.  Regardless, all debates among mature adults should be conducted in an adult manner, even when we get passionate about the topic. \nConcerning M. le chanoine Ulysse Chevalier in Dan’s posting pictured above:  Canon Chevalier was the acknowledged leader of a progressive faction around 1898, when Pia’s first photographs of the Shroud appeared.  A hitherto barely noticed relic suddenly seemed to be on the verge of becoming authenticated – worse, it tended to corroborate the orthodox position, thus threatening the schemes of the progressives to usher the Church into the twentieth century and into modernity, ostensibly setting aside old out-worn beliefs and practices, but in fact promoting a type of reductionist liberalism.  Both Chevalier and Rev Herbert Thurston fell back on their version of the D’Arcis memorandum to discredit it.  The two reverend gentlemen appear to have entered an unholy conspiracy to discredit the Shroud, not by an objective scholarly representation of the D’Arcis memorandum, but by deliberately and fraudulently misrepresenting it by twisting facts, and the deliberate omission of material, and hence concealing their lie,  \nRegular bloggers will be aware of a common public misperception that the D’Arcis memorandum discredits the Shroud, apparently in an authoritative way, as being a man-made object from the 13th – 14th centuries.  This misrepresentation is solely due to the work of Chevalier and Thurston. \nThe case against them is clearly set out in a paper: “THE CONSPIRACY AGAINST THE SHROUD”; By Jack Markwardt, 2001.  Markwardt’s spine-chilling paper against the two conspirators can be found at: http://www.shroud.com/pdfs/n55part3.pdf  – Recommended reading for all who have an interest in the truth concerning the Shroud!\n\n","date":"December 21, 2012 at 6:50 am","url":"https://shroudstory.com/2012/12/20/endowed-by-their-maker-with-dim-wits/","cat":"news_&_views","id":"comment-20895","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Endowed by their maker with dim wits","post":"I, too, would like to add my apologies to anyone I might have offended or have misinterpreted their intentions-something to work on in 2013…let’s see, for me, that put the list at about 23 items.  Dan, I appreciate the admonishment and your point is sincerely taken.  I didn’t know about M. le chanoine Ulysse Chevalier’s connection to the Shroud-daveb, thanks for the link, I will be interested in reading this.\n\n","date":"December 21, 2012 at 8:39 am","url":"https://shroudstory.com/2012/12/20/endowed-by-their-maker-with-dim-wits/","cat":"news_&_views","id":"comment-20901","author":"Kelly Kearse","site":"shroudstory"},{"title":"Endowed by their maker with dim wits","post":"Fascinating article which I haven’t seen before, so thanks for bringing it to our attention. I know nothing about it, so can somebody enlighten – do we think D’Arcis was an out-and-out liar who made up the ‘cunning painter’ himself, or was he simply mistaken in believing Henry of Poitiers, who was the out-and-out liar, or if neither, where did the story come from?\n\n","date":"December 21, 2012 at 8:41 am","url":"https://shroudstory.com/2012/12/20/endowed-by-their-maker-with-dim-wits/","cat":"news_&_views","id":"comment-20902","author":"Hugh Farey","site":"shroudstory"},{"title":"Endowed by their maker with dim wits","post":"Canon Ulysse Chevalier was considered to be the most cultured man in Europe and Father Herbert Thurston was also a very learned man. The most we can say is that they did not have access to many sources and were influenced my Modernism, however this does not justify character assassination.\n\n","date":"December 21, 2012 at 8:59 am","url":"https://shroudstory.com/2012/12/20/endowed-by-their-maker-with-dim-wits/","cat":"news_&_views","id":"comment-20905","author":"Louis","site":"shroudstory"},{"title":"Endowed by their maker with dim wits","post":"Reminder for all: \n  Contrary to what Ulysse Chevalier wanted the ‘vulgus pecum’ to believe, THE FINAL VERSION of the Papal bull of antipope Clement VII, issued in 1390, never stated the Lirey Shroud was a fake nor back up the forgery thesis.\n  In 1988, the carbonists did their outmost to have “their” C14 dating fit fact-twister Chevalier’s deliberate and fraudulent misrepresentation of the case. The case file against the TS authenticity is totally bugged. \n  Currently despised and/or overlooked parameters such as specific funerary rituals should be experimentally investigated.\n  On this Last Day of the ancient world, my apologies to anyone I might have offended. Let’s a new world takes over  and stop wasting time. The middle way is THE way as far as the Turin Shroud Science & Archaeology is concerned. Archfraudulists and archmiraculists have been completly spoiling the debates for decades and discredited Shroud Science, Exegesis and Archaeology. A more naturalistic AND ritualistic approach (that neither include nor preclude resurrection or coming back to life) shall be promoted for Shroud Science & Archaeology to REALLY advanced.\n\n","date":"December 21, 2012 at 10:52 am","url":"https://shroudstory.com/2012/12/20/endowed-by-their-maker-with-dim-wits/","cat":"news_&_views","id":"comment-20909","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Endowed by their maker with dim wits","post":"Typo: advance\n\n","date":"December 21, 2012 at 10:55 am","url":"https://shroudstory.com/2012/12/20/endowed-by-their-maker-with-dim-wits/","cat":"news_&_views","id":"comment-20910","author":"Max Patrick Hamon","site":"shroudstory"}]
