[{"title":"The Eucharistic Miracle of Buenos Aires","post":"Dan, being Anglican you probably are unaware of the topic of Eucharistic Miracles, but the story is well known and described in several books (mostly written by Catholics, unfortunately I don’t have any of them right now at hand), although of course primary documents are hard to get, like usually in those cases.\n\n","date":"September 23, 2013 at 6:17 am","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","id":"comment-45175","author":"O.K.","site":"shroudstory"},{"title":"The Eucharistic Miracle of Buenos Aires","post":"There has been around 130 Eucharistic Miracles accepted by the Catholic Church. The first one, and most widely known, is Eucharistic Miracle of Lanciano, said to happen around 700 AD (although the earliest documents that survived date back to 17th century). It has been examined in 1971 by prof. Odaoardo Linoli, a pathologist. He confirmed that it consisted of real heart tissue and human blood, of the TYPE AB. The same blood type that was found on the Shroud of Turin, on Sudarion of Oviedo, as well as on the Tunic of Argenteuil. I have seen scan (probably pirated) of his report (in Italian) in Internet, but it seems to be gone right now.\nHis results were later confirmed by WHO experts. I have not seen the document, and don’t know who the experts were, but I have seen the picture of the report’s cover in one book.\nSee this page for example: http://www.therealpresence.org/eucharst/mir/lanciano.html \nA few years back, in 2009, the alleged Eucharistic Miracle happened in Poland, in small town of Sokółka. For a few months it was the main topic in the media, and later the issue went quiet. So far I read, the medical specialists gave positive opinion, now the matter is being examined by the Vatican.\n\n","date":"September 23, 2013 at 7:04 am","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","id":"comment-45182","author":"O.K.","site":"shroudstory"},{"title":"The Eucharistic Miracle of Buenos Aires","post":"The most renown of these eucharistic miracles is that of Lanciano in Italy and dates from around 700AD. It is alleged to have occurred when a Basilian hieromonk, experiencing doubts about the eucharist, pronounced the words of consecration while saying Mass. There is a reasonably good trail of provenance since around that time. The Basilian monks kept custody of the elements until their departure in 1155, and were then succeeded by Benedictines. They were kept in the Valsecca chapel from 1636 to 1902, when they were then relocated to a new altar. \nThere have been various investigations in varying detail: 1574, 1636, 1777, 1886, 1971; The latest investigation in 1971 were by Dr Odoardo Linoli, professor of anatomy and pathological histology, etc. \nThe Wiki reference gives an adequate description, but there are also other references which can be found.\nhttp://en.wikipedia.org/wiki/Miracle_of_Lanciano \nSome of the Catholic references mention a hoax, but this is by way of a postulating discussion only.  There are of course the usual “skeptical” atheist sites, who delight in their specious attempts at debunking, because these early medieval monks in 700AD lacked the forethought to apply the strict standards of modern science. Interesting aspect for Shroudies in the know: The blood tests as AB. There are several other examples of this type of miracle, which can be searched. Google on .  I was surprised by the numbers. Many have been sanctioned by the Vatican.\n\n","date":"September 23, 2013 at 7:20 am","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","id":"comment-45183","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Eucharistic Miracle of Buenos Aires","post":"Angle brackets on text don’t work in WordPress: Google on “Eucharistic Miracles of the World”.\n\n","date":"September 23, 2013 at 7:22 am","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","id":"comment-45184","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Eucharistic Miracle of Buenos Aires","post":"I think I’m going to go out on a limb here and say this smacks of deliberate fraud. If anybody scientific was asked to identify anything, they wrote a report about about it, signed and dated it. Although the scientific analysis would not in itself have confirmed a miracle, it would at least have added a certain amount of confidence in it.\nI don’t believe the host was found in the first place.\nI don’t believe a piece of flesh grew in a “container of water.”\nI don’t believe the photograph illustrating the article above is genuine.\nI don’t believe the flesh grew in mass over a couple of years.\nHier stehe ich. Ich kann nicht anders.\n\n","date":"September 23, 2013 at 7:27 am","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","id":"comment-45186","author":"Hugh Farey","site":"shroudstory"},{"title":"The Eucharistic Miracle of Buenos Aires","post":"Sorry, Hugh, You’re going to have to check them out more rigorously before adopting Martin Luther’s stance. There’s more to them than you might imagine.\n\n","date":"September 23, 2013 at 7:39 am","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","id":"comment-45188","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Eucharistic Miracle of Buenos Aires","post":"Hugh, bit off topic but whilst on the subject of debating the veracity of alleged miracles, what are your thoughts on the miracle of the sun at Fatima?\n\n","date":"September 25, 2013 at 8:16 am","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","id":"comment-45362","author":"ChrisB","site":"shroudstory"},{"title":"The Eucharistic Miracle of Buenos Aires","post":"It appears that a lot of people experienced a variety of unusual phenomena, which increased their faith. If that’s a miracle, then that’s a miracle. Whether any of the events experienced actually happened is difficult to say; although it is clear that the sun itself did absolutely nothing unusual, there may have been local atmospheric conditions that suggested it  did. Such accounts as have been collected are wildly contradictory, suggesting that the experiences were more subjective than objective.\n\n","date":"September 25, 2013 at 2:15 pm","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","id":"comment-45405","author":"Hugh Farey","site":"shroudstory"},{"title":"The Eucharistic Miracle of Buenos Aires","post":"My mom had an expression she used when talking about miracles. “Every time you tell someone about a miracle you lose a little piece of it.”  She believed that miracles were meant for those that personally experienced them. They were rewards of faith and not meant as proofs. They were to be treasured in the quiet of one’s heart.\nWhen a person started sharing the miracle with others, doubt would enter the picture. Someone would offer an alternative rational explanation that dulled the miracle’s shine. The more the miracle was used as a proof, the less it came to mean to the person(s) that experienced it.\nThe Catholic Church does warn that miracles and apparitions are in the realm of private revelation. I think The Church is on the same page as my mom.\n\n","date":"September 23, 2013 at 10:28 am","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","id":"comment-45198","author":"David Goulet","site":"shroudstory"},{"title":"The Eucharistic Miracle of Buenos Aires","post":"Hi Dan,\nThanks for posting this. I enjoyed it very much. I also found the video Science tests faith on youtube. It features Mike Willasee who was a well know athiest during his time on Aust TV. He was a premiere tabloid journo & peddler of the usual bile we’re all familiar with.\nTo say he’s had a conversion on the road to Damascus is an understatement! \nHe explains his scepticsm & conversion back to Catholicism in the video as well as their methodology & evidence. Well worth a look if you’re sceptical. He was a very hard nosed Christopher Hitchens type before his conversion.\nYoutube\nScience tests faith\nPosted by SandritaRowan26\n\n","date":"September 23, 2013 at 12:13 pm","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","id":"comment-45205","author":"Gerard (private)","site":"shroudstory"},{"title":"The Eucharistic Miracle of Buenos Aires","post":"Ps. It is the video linked to in the article. \nHugh, please watch it. Please… Then post a comment.\n\n","date":"September 23, 2013 at 12:16 pm","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","id":"comment-45206","author":"Gerard (private)","site":"shroudstory"},{"title":"The Eucharistic Miracle of Buenos Aires","post":"Thank you, Gerard. I have watched the video in its entirely, and am prepared to concede that the finding of a host and the placing of it in water is credible. The photo of it after a few days shows it practically dissolved away, and at least five species of mould and/or bacteria growing on it. One of these appears to be the common and well attested Serratia marcescens, which is blood red and may have been a source of previous stories of eucharistic miracles. The next photo was taken, we are told, on 6 September, two and a half weeks later, when the bacteria look exactly like the illustration at http://www.sciencedaily.com/releases/2011/07/110707141158.htm. Why, or whether, Fr Pezet found this unusual, or worth photographing I can’t imagine.\nThere is then a thoroughly suspicious gap of three years, followed by the alleged presentation to Dr Zugibe of a piece of heart muscle. I say alleged as without a paper trail, the credibility of this part of the story is weakened beyond sustenance. \nAnd I was right about the photo, which shows a considerably more gory and even less credible alleged miracle in Korea.\nNo flesh to start with, no growth of flesh, no accurate photo. Three out of four ain’t bad.\n\n","date":"September 23, 2013 at 5:11 pm","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","id":"comment-45218","author":"Hugh Farey","site":"shroudstory"},{"title":"The Eucharistic Miracle of Buenos Aires","post":"Could you please give us a direct link to the video.\nCan’t find it in the article.\n\n","date":"September 25, 2013 at 3:48 pm","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","id":"comment-45415","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"The Eucharistic Miracle of Buenos Aires","post":"Hi Thibault. It’s at http://www.youtube.com/watch?v=-kuxEJXgGSI. It is an hour-long lecture in two parts by Ron Tesoriero and Michael Willersee. Ron Tesoriero first discusses a weeping statue, and moves on to the Eucharistic Miracle after 15 minutes. The two pictures I was describing are at 16:18 and 16:39.\n\n","date":"September 25, 2013 at 6:52 pm","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","id":"comment-45442","author":"Hugh Farey","site":"shroudstory"},{"title":"The Eucharistic Miracle of Buenos Aires","post":"There is a forest for the trees thing at work here. I think from a contemporary perspective the matter involves a guy who is now name Frances and is Pope of some church or the other.\nThat he ordered the scientific inquiry is a fascinating fact and what does it say about his attitude towards science and scientific examination of “miracles.”\nThat may be the biggest question of all.\n\n","date":"September 23, 2013 at 3:06 pm","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","id":"comment-45211","author":"John Klotz","site":"shroudstory"},{"title":"The Eucharistic Miracle of Buenos Aires","post":"One further thought. In the halcyon days of Vatican II, there was a popular hymn that had the following verse:\nWe stand before your altar Lord to share a common meal,\nOur love has brought us here today, because love makes symbols real.\nI believe that the quantum is the place where our realty intersects with the consciousness of the primordial  consciousness from which our existence sprang. I use to write of love as a metaphor but I now believe it is a very real quantum phenomena. \nTeilhard predicted a convergence of science and religion. It’s here! And maybe so is He!\nhttp://johnklotz.blogspot.com/2012/08/michael-redux-quantum-mechanics.html\n\n","date":"September 23, 2013 at 3:15 pm","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","id":"comment-45212","author":"John Klotz","site":"shroudstory"},{"title":"The Eucharistic Miracle of Buenos Aires","post":"Among all the usual news of murders, mayhem, terrorism, and trivia, our Wellington newspaper the Dominion-Post has unprecedently these last three mornings run significant spreads favourable to Pope Francis with pix, and of course he’s photogenic.  Sample headlines: “Pope: ‘Heal, or church will fall apart”, (half-page leading article world news section, Sat 21 Sept); “Pope plans major reform of church” (half page article, Mon 23 Sept); “Catholic Church’s truly holy man” (Opinion page, lead editorial, Tues 24 Sept). His influence is being felt far and wide, even in this so-called secular country at the ends of the earth. \nDid I mention trivia? Something called the ‘America’s Cup’ is getting wide-spread coverage here, with late arrivals at work-places as all NZers are glued to early morning TV. This morning Team NZ stands at 8 races to 5 against USA Oracle team.  Oracle has bounced back after a slow start, winning last four races. NZ was leading in 3 races, but calm weather over-extended the 40 minute time limit and these were cancelled. This morning sees a start in calm weather, with NZ on the favoured port side start position. Betting odds are now changing to favour Oracle.  Longest running America’s Cup in trophy’s history. This morning will see what way the race goes.\n\n","date":"September 23, 2013 at 4:18 pm","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","id":"comment-45213","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Eucharistic Miracle of Buenos Aires","post":"The way that the yacht race is going in San Francisco, Team NZ stands to snatch defeat from the jaws of victory, once again. Still, all the rigging and most of both teams are Made in NZ, so either way, I suppose we can’t really lose!\n\n","date":"September 23, 2013 at 4:58 pm","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","id":"comment-45216","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Eucharistic Miracle of Buenos Aires","post":"\nHugh Farey :\nThank you, Gerard. I have watched the video in its entirely, and am prepared to concede that the finding of a host and the placing of it in water is credible. The photo of it after a few days shows it practically dissolved away, and at least five species of mould and/or bacteria growing on it. One of these appears to be the common and well attested Serratia marcescens, which is blood red and may have been a source of previous stories of eucharistic miracles. The next photo was taken, we are told, on 6 September, two and a half weeks later, when the bacteria look exactly like the illustration at http://www.sciencedaily.com/releases/2011/07/110707141158.htm. Why, or whether, Fr Pezet found this unusual, or worth photographing I can’t imagine.\nThere is then a thoroughly suspicious gap of three years, followed by the alleged presentation to Dr Zugibe of a piece of heart muscle. I say alleged as without a paper trail, the credibility of this part of the story is weakened beyond sustenance.\nAnd I was right about the photo, which shows a considerably more gory and even less credible alleged miracle in Korea.\nNo flesh to start with, no growth of flesh, no accurate photo. Three out of four ain’t bad.\n\nCome over to the Dark Side, Hugh (noting the light switches that await you). You know it makes sense. You know it is your natural home… \nLeave the miraculists behind you.  Proceed into the light of knowledge and science – discarding the HPM as a piece of fanciful tat.  There are friends who await you.;..\n\n","date":"September 23, 2013 at 5:34 pm","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","id":"comment-45221","author":"colinsberry","site":"shroudstory"},{"title":"The Eucharistic Miracle of Buenos Aires","post":"I see that the serpent Darth Vader is still alive and well!!\n\n","date":"September 23, 2013 at 9:24 pm","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","id":"comment-45231","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Eucharistic Miracle of Buenos Aires","post":"A comment on the Linoli 1971 paper describing the characterization of the Miracle of Lanciano: regarding the blood typing (AB), the data presented only showed reaction with the host material-there were no negative controls to verify that the results are not simply due to nonspecific binding.  This is crucial.  With the Shroud, adjacent white (nonbloodstained) fibers serve this function (no antibody reactivity is observed).  One would also need to show that an irrelevant antibody (of similar type directly against something unrelated) does not react with the host material, that the antibody binding is truly specific.  This is also crucial.  In the Shroud studies, certain secondary antibodies were used as well as anti-O antisera to function as controls (no antibody reactivity was observed). Perhaps such tests were done in the previous studies and not mentioned.  Without such controls, it is difficult to make any solid conclusions about the antibody specificity, i.e. blood type. You would see exactly the same results (type AB) if unrelated, nonspecific were occurring.    \nRegarding the 1999 result that the sample contained human DNA.  This could also be interpreted as the sample was simply touched by a human being at some point.  To verify that the DNA truly originated from blood cells (and not simply skin cells), one would have to evaluate immune receptor gene rearrangement (unique to white blood cells).  The same is true for the DNA reported on the Shroud.  It remains to be determined if such DNA is truly from blood cells or is simply due to contamination.\nI am not a pathologist or experienced with examination of tissues, but I was always impressed by the cellular structure apparent in the Lanciano 1971 photographs.\n\n","date":"September 23, 2013 at 5:34 pm","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","id":"comment-45222","author":"Kelly Kearse","site":"shroudstory"},{"title":"The Eucharistic Miracle of Buenos Aires","post":"Kelly and others.\nSo far I have read Linoli’s examination had been verified multiple times in 1976 and 1981 (on the other sample taken in 1970) and his 1971 conclusions had been confirmed.\nThe scan of original 1971 Linoli’s paper (in Italian) can be found here: http://www.mediafire.com/download/2j2j8qalrmcrlb4/Lanciano+Article+16-45-35.pdf but I am not sure whether this is legitimate (that means legal) copy.\n\n","date":"September 25, 2013 at 9:14 am","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","id":"comment-45375","author":"O.K.","site":"shroudstory"},{"title":"The Eucharistic Miracle of Buenos Aires","post":"The Church is very careful when dealing with alleged miracles because only some cases seem to be genuine, where it is something like saying a power from beyond was acting in our world, which science can not explain.\nA very interesting books on the “Miracles of Pope John Paul II” was launched recently by the German journalist Andreas Englisch (see his website, with something in English), who seems to have become less sceptical and more Catholic. He talks about the miracles performed by the pontiff when he was alive. Curiously, Oscar Wilde believed he was cured by Pope Leo XIII when he was in the front row of the pilgrims at the Vatican in 1900. The website http://www.catholiceducation.org (USA) says ” he believed the pope’s blessing healed him from the effects of spoiled mussel, which had lingered for five months.”\n\n","date":"September 23, 2013 at 6:01 pm","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","id":"comment-45225","author":"Louis","site":"shroudstory"},{"title":"The Eucharistic Miracle of Buenos Aires","post":"\nO.K. :\nKelly and others.\nSo far I have read Linoli’s examination had been verified multiple times in 1976 and 1981 (on the other sample taken in 1970) and his 1971 conclusions had been confirmed.\nThe scan of original 1971 Linoli’s paper (in Italian) can be found here: http://www.mediafire.com/download/2j2j8qalrmcrlb4/Lanciano+Article+16-45-35.pdf but I am not sure whether this is legitimate (that means legal) copy.\n\nI’ve read the original article, but have never seen the data for 1976 & 1981 confirmations-do you have a link?\n\n","date":"September 25, 2013 at 3:59 pm","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","id":"comment-45418","author":"Kelly Kearse","site":"shroudstory"},{"title":"The Eucharistic Miracle of Buenos Aires","post":"Kelly: No I am basing only on descriptions in popular books about that case (and unfortuantely I don’t have any of them at hand in this moment). Nicola Nasuti OFMConv, “The Eucharistic Miracle in Lanciano”, Grzegorz Górny Janusz Rosikoń, “Dowody Tajemnicy” (Evidence of Mystery)\nHowever, as I said, I have seen a picture of a cover of 1976 WHO report in that latter book, so the story is not invented, I think.\n\n","date":"September 25, 2013 at 5:01 pm","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","id":"comment-45429","author":"O.K.","site":"shroudstory"},{"title":"The Eucharistic Miracle of Buenos Aires","post":"The fragment about Linoli’s determination of blood type as AB is very brief, but it refers to methods developed by some A. Fiori, and V. Siracusa. Kelly, you are a specialist of that field, could you tell us all whether there is real chance, that Linoli’s blood typing as AB may be a false positive? So far I know there were very little of possible contamination in Linoli’s samples.\nAnd one another thing. Andre Marion and Gerard Lucotte in their book about the Holy Tunic of Argenteuil claim that the blood on the Tunic was also determined to be AB, in 1985 by some dr Saint Prix, unfortuantely they give no reference to that work.\n\n","date":"September 25, 2013 at 5:17 pm","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","id":"comment-45430","author":"O.K.","site":"shroudstory"},{"title":"The Eucharistic Miracle of Buenos Aires","post":"It is doubtful if Luther is an authority worth referring to when it comes to miracles and some other matters. As for Fatima, the most curious fact is the “prophecy” that foretold the fall of the Communist regime. Jacintha Marto’s body was found incorrupt when it was dug up to be reburied in the basilica.\n\n","date":"September 25, 2013 at 4:27 pm","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","id":"comment-45427","author":"Louis","site":"shroudstory"},{"title":"The Eucharistic Miracle of Buenos Aires","post":"Louis: The ultimate fall of Communists was unavoidable (due to nature of Communism itself), so what’s that prophecy? (LOL)\n\n","date":"September 25, 2013 at 5:25 pm","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","id":"comment-45431","author":"O.K.","site":"shroudstory"},{"title":"The Eucharistic Miracle of Buenos Aires","post":"O.K. The reference was to the Communist regime in the former USSR in what is known as the “Fatima revelation” and Lúcia, Francisco and Jacintha, of the Marto family, were very small children, who probably knew next to nothing about regimes and politics. There is a very big difference between what you see in Lourdes, France and what is felt in Fatima, Portugal.\n\n","date":"September 25, 2013 at 6:30 pm","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","id":"comment-45439","author":"Louis","site":"shroudstory"},{"title":"The Eucharistic Miracle of Buenos Aires","post":"\nO.K. :\nThe fragment about Linoli’s determination of blood type as AB is very brief, but it refers to methods developed by some A. Fiori, and V. Siracusa. Kelly, you are a specialist of that field, could you tell us all whether there is real chance, that Linoli’s blood typing as AB may be a false positive? So far I know there were very little of possible contamination in Linoli’s samples.\nAnd one another thing. Andre Marion and Gerard Lucotte in their book about the Holy Tunic of Argenteuil claim that the blood on the Tunic was also determined to be AB, in 1985 by some dr Saint Prix, unfortuantely they give no reference to that work.\n\nA false positive is certainly a possibility.  Without controls (run in parallel), it is difficult to say.  Even if contamination is totally nil, a certain degree of nonspecific binding will exist for any type of antibody-the controls help evaluate to what degree this may occur.  The control groups are required to verify the true specificity of the reactivity.\n\n","date":"September 25, 2013 at 6:11 pm","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","id":"comment-45433","author":"Kelly Kearse","site":"shroudstory"},{"title":"The Eucharistic Miracle of Buenos Aires","post":"\nLouis :\nO.K. The reference was to the Communist regime in the former USSR in what is known as the “Fatima revelation” and Lúcia, Francisco and Jacintha, of the Marto family, were very small children, who probably knew next to nothing about regimes and politics. There is a very big difference between what you see in Lourdes, France and what is felt in Fatima, Portugal.\n\nLouis, that was only a joke ;-)\n\n","date":"September 25, 2013 at 6:32 pm","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","id":"comment-45440","author":"O.K.","site":"shroudstory"},{"title":"The Eucharistic Miracle of Buenos Aires","post":"O.K., sorry there is no time for jokes here, the matters being discussed are serious. Religion is a serious matter and people, particularly Christians, all over the world, are being massacred for what they believe. Did you see the news about the Anglicans massacred in Peshawar, Pakistan last week?\nFor some more, care has to be taken about what is written and what is read. Otherwise we will become like John Kerry, who, despite all the money at his disposal, either has not read enough or read the wrong material, and is in favour of another war. It is evident that his theological (!) opinions are leading him in the wrong direction…\n\n","date":"September 25, 2013 at 7:21 pm","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","id":"comment-45447","author":"Louis","site":"shroudstory"},{"title":"The Eucharistic Miracle of Buenos Aires","post":"Louis, calm down. And let’s not talk about politics (and politicians). Just said that some happenings in politics are very predictable, even without supernatural revelations. For example, that some (in fact most) politicians are idiots.\n And in fact I believe the revelations of Fatima were genuine.\n\n","date":"September 25, 2013 at 7:31 pm","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","id":"comment-45450","author":"O.K.","site":"shroudstory"},{"title":"The Eucharistic Miracle of Buenos Aires","post":"O.K. That’s OK! What I was trying to convey is that it is important to write and read with care, particularly when it comes to religion.\n\n","date":"September 25, 2013 at 7:59 pm","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","id":"comment-45453","author":"Louis","site":"shroudstory"},{"title":"The Eucharistic Miracle of Buenos Aires","post":"well then, we have Jesus’s DNA now. Why don’t they compare it with the DNA from the other ‘miracles’ of the same kind? if it is the same then well, it would make me wonder. Interestingly, top pathologists involved in medical assessments of the samples seem to have never given it a thought…\n\n","date":"December 15, 2013 at 2:50 pm","url":"https://shroudstory.com/2013/09/23/the-eucharistic-miracle-of-buenos-aires/","cat":"news_&_views","id":"comment-59923","author":"brzydula","site":"shroudstory"}]
