[{"title":"A modern conceptual idea of the \"supernatural\" world?","post":"Believe me Dan, it is not summer in NZ right now.  In Wellington we’re regularly getting temperature day-time highs of around 10 deg C (that’s about 50 deg F), though so far we haven’t had any snow here as we did last year in August.  Of course there’s snow on the high country, the North Island Desert Road gets regularly closed over winter, and they’e getting snow way down south on the low country, and the farmers regularly suffer stock losses as a result.  Stock is rarely ever kept indoors here. \nI first came across the idea of Parallel Universes from the book of that name by Michio Kaku who I think you see a lot of on TV in North America (Doubleday 2005).  He explains it very well.  It seemed to me it could be a stepping stone in coming to grips with the ideas implicit in the supernatural, which could find a response in the modern mind with our greater understanding of how the universe works.  Under modern avant-garde theories of matter involving string theory and M(membrane) theory, our universe comprises 3 dimensions of length, one of time, and several more which are supposed to be “rolled up” so we don’t directly perceive them.  Maybe there’s 10 or 12 of them.  In a parallel universe, these extra dimensions might not be rolled up, and it would appear very strange to us indeed, and the physical laws would be quite different.  \nThe main thing that I found attractive in Michio Kaku’s book, is his excellent treatment of so-called “Goldilocks zones”, which is the subject of his chapter 8, “A Designer Universe?”  You can find quite a lot about Goldilock Zones on the web and elsewhere.  But it is quite a controversial topic.  Kaku is an excellent science writer for the popular readership.\n\n","date":"July 11, 2012 at 7:28 am","url":"https://shroudstory.com/2012/07/11/a-modern-conceptual-idea-of-the-supernatural-world/","cat":"news_&_views","id":"comment-13728","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A modern conceptual idea of the \"supernatural\" world?","post":"Why the need to fetch supernature operating in parallel universe while every second of our own life, Supernature is at work to keep us alive and regenerate our own body in dayly producing DNA 300,000km (per body)?\n\n","date":"July 11, 2012 at 8:23 am","url":"https://shroudstory.com/2012/07/11/a-modern-conceptual-idea-of-the-supernatural-world/","cat":"news_&_views","id":"comment-13732","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A modern conceptual idea of the \"supernatural\" world?","post":"The Resurrection cannot be explained in scientific terms as it was probably a supranormal event, a power from beyond acting in this world.\n\n","date":"July 11, 2012 at 5:35 pm","url":"https://shroudstory.com/2012/07/11/a-modern-conceptual-idea-of-the-supernatural-world/","cat":"news_&_views","id":"comment-13746","author":"Louis","site":"shroudstory"},{"title":"A modern conceptual idea of the \"supernatural\" world?","post":"Before thinking the resurrection was the primary cause of the Shroud’s image, can we please wait until all the “natural” hypotheses will be fully tested and proven wrong ?  That’s my advice.  But, of course, if that’s what you believe personally, that’s your belief…\n\n","date":"July 11, 2012 at 6:40 pm","url":"https://shroudstory.com/2012/07/11/a-modern-conceptual-idea-of-the-supernatural-world/","cat":"news_&_views","id":"comment-13751","author":"Yannick Clément","site":"shroudstory"},{"title":"A modern conceptual idea of the \"supernatural\" world?","post":"The maintenance of life and rejuvenation of body cells are seen as “natural processes”.  Explanations of the causes of these processes depend on what perspective we adopt and out personal belief systems.  A purely spiritual approach, such as those by mystics and primal peoples, might explain them in such terms as the providence of God, or the Great Spirit, whereas an agnostic might explain them in terms of natural evolutionary development from some kind of primordial soup of organic matter.  Others, such as a modern informed religious person, could be prepared to accept some kind of synthesis including both viewpoints. \nIf parallel universes do in fact exist, then a religious person has to say that they are part of God’s creation.  It may be possible for some Being, an angel for example, to travel from one of these universes to another.  The Resurrection of Jesus might be seen as Jesus going to some kind of “super-universe” of which our present universe is but a component.  \nAn analogy is a flat two-dimensional table top which exists in our three dimensional space.  An ant crawling on the table-top has only a two dimensional perspective, with no up nor down, but we can reach out from our 3-D space and touch the ant.  In a similar way, Jesus may reach out from his super-universe and touch our lives.  God may be much closer to us than we can imagine.  \nThe evidence for parallel universes is scanty, but the concept could explain a few mysteries of quantum mechanics, such as super-symmetry and the spontaneous appearance of sub-atomic particles in perfect vacuums.  \nIt therefore seems to me that the concept might have some useful kind of role in a modern mind coming to terms with the existence or reality of the supernatural or spiritual world of the divine, in contrast to the materialists’ view of “All you can see, is all that exists – there is nothing else.”  \n“There are many rooms in my Father’s house; if there were not, I should have told you.” John 14:2\n\n","date":"July 11, 2012 at 5:44 pm","url":"https://shroudstory.com/2012/07/11/a-modern-conceptual-idea-of-the-supernatural-world/","cat":"news_&_views","id":"comment-13747","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A modern conceptual idea of the \"supernatural\" world?","post":"I really don’t think Teilhard of Chardin was a good advocate for any kind of “physical traces” of the resurrection that would have caused an image on the Shroud ! Forget it !!! At least, please Dave, don’t make him say things that he didn’t say. I don’t think you did that but someone else can be tempted to extrapolate while using Teillard point of view on the Universe. The fact is that his point of view had nothing to do with the image we see on the Shroud.\n\n","date":"July 11, 2012 at 6:40 pm","url":"https://shroudstory.com/2012/07/11/a-modern-conceptual-idea-of-the-supernatural-world/","cat":"news_&_views","id":"comment-13752","author":"Yannick Clément","site":"shroudstory"},{"title":"A modern conceptual idea of the \"supernatural\" world?","post":"Yet again, Yannick is misinterpreting what I have written and puts his own spin on the topic.  The original posting at the head of this blog was in connection with comments arising from the posting on Baldacchini, see Dan’s posting of July 5, and the link provided in the first two lines above.  As one commentator pointed out, Baldacchini’s matter-antimatter suggestion for the disappearance of the body would have resulted in a massive nuclear explosion, which plainly never happened, and would have surely blown any burial cloth to smithereens.  I suggested a parallel universe hypothesis was a rather more plausible explanation of the resurrection than matter-antimatter annihilation, if an explanation in comprehensible physics were to be considered at all .  The reference to Teilhard was an incidental throwaway comment, as he is one of the very few theologians who has ever attempted any kind of synthesis of science and religion.  \nYannick may prefer a naturalistic explanation of the Shroud image, but for all that he has ever written on the matter, no-one has ever come close to matching all its properties,  There is little evidence that any experimentalist is pursuing a programme to test naturalistic explanations (refer challenge to Dawkins), and we don’t have to wait until doomsday before accepting the proposition that the Resurrection is as good an explanation as we’re ever likely to get in our lifetime!\n\n","date":"July 11, 2012 at 10:08 pm","url":"https://shroudstory.com/2012/07/11/a-modern-conceptual-idea-of-the-supernatural-world/","cat":"news_&_views","id":"comment-13766","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A modern conceptual idea of the \"supernatural\" world?","post":"Daveb: “and we don’t have to wait until doomsday before accepting the proposition that the Resurrection is as good an explanation as we’re ever likely to get in our lifetime” …Exactly my thoughts also. Yannick seems to forget his ‘naturalistic image’ stance is basically blown away by the blood evidence found on the Shroud! Which he adamantly states, himself, is the main clue to the Shroud’s authenticity. There is no sign/evidence that the body was removed ‘mechanically’ from the Shroud, and until someone can explain this fact, ‘Naturalistically’ to me, then I will continue to believe the Shroud is tangible evidence left by the Lord himself as proof of his resurrection for those who need it.\nR.\n\n","date":"July 12, 2012 at 5:46 pm","url":"https://shroudstory.com/2012/07/11/a-modern-conceptual-idea-of-the-supernatural-world/","cat":"news_&_views","id":"comment-13791","author":"Ron","site":"shroudstory"},{"title":"A modern conceptual idea of the \"supernatural\" world?","post":"Dave, when you’ll be able to speak French as well as I speak English, I think then you’ll understand that I can, from time to time, misinterpret some of your comments…  But this one was more a reaction of the picture that Dan put beside your comment.  I hope someone who will see this picture will not think that Teillard’s view of the Universe could offer any kind of argument in favor of the idea that the body image of the Shroud is the result of some supernatural phenomenon, because this kind of idea is simply false or, in other word, is just like a very bad extrapolation of one of the most intelligent Christian writer of the 20th century.\n\n","date":"July 13, 2012 at 1:36 pm","url":"https://shroudstory.com/2012/07/11/a-modern-conceptual-idea-of-the-supernatural-world/","cat":"news_&_views","id":"comment-13821","author":"Yannick Clément","site":"shroudstory"},{"title":"A modern conceptual idea of the \"supernatural\" world?","post":"As stated more than once, the Shroud should not be used as part of Resurrection faith and the studies made by many serious scholars is unfortunately being distorted to put forward some weird theories by people who are either agnostics or belong to other faiths.\n\n","date":"July 12, 2012 at 11:54 am","url":"https://shroudstory.com/2012/07/11/a-modern-conceptual-idea-of-the-supernatural-world/","cat":"news_&_views","id":"comment-13781","author":"Louis","site":"shroudstory"},{"title":"A modern conceptual idea of the \"supernatural\" world?","post":"I disagree a bit with your point of view Louis…  I think most of the weidest “theories” concerning the Shroud don’t come from agnostics or people from other faith but from “good” Christians that are a bit (or mainly) blinded by their faith (I prefer to use the expression “religious beliefs” in their case).\n\n","date":"July 13, 2012 at 1:38 pm","url":"https://shroudstory.com/2012/07/11/a-modern-conceptual-idea-of-the-supernatural-world/","cat":"news_&_views","id":"comment-13822","author":"Yannick Clément","site":"shroudstory"},{"title":"A modern conceptual idea of the \"supernatural\" world?","post":"Louis, that’s your opinion and you’re entitled to it.  There are two aspects to every kind of manifestation:  1) the phenomenon itself, which is objective and undeniable; 2) its interpretation, which is subjective and always open to discussion.  If the “scholars” ever come to a satisfactory conclusion about the Shroud, and that’s not likely to be any time soon, that will be the time when more dogmatic assertions can be made.  Subjective interpretations of any kind will always atttract weird theorists of all persuasions – that’s the nature of the human condition.  It’s an undeniable fact that studies of the Shroud have been instrumental in bringing many into the life of faith, including it seems our venerable web-master among many others.  Those whose faith is based on other evidence, have merely come to their decision by another route.  As Pope Benedict has been known to state, “Faith without rationality (i.e. evidence) is fanatacism!”\n\n","date":"July 12, 2012 at 5:32 pm","url":"https://shroudstory.com/2012/07/11/a-modern-conceptual-idea-of-the-supernatural-world/","cat":"news_&_views","id":"comment-13789","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A modern conceptual idea of the \"supernatural\" world?","post":"I love that quote by Pope Benedict.\nR\n\n","date":"July 12, 2012 at 5:49 pm","url":"https://shroudstory.com/2012/07/11/a-modern-conceptual-idea-of-the-supernatural-world/","cat":"news_&_views","id":"comment-13792","author":"Ron","site":"shroudstory"},{"title":"A modern conceptual idea of the \"supernatural\" world?","post":"Me too Ron.  And I think that statement can sadly be applied to many Shroud researchers these days…  I think those people are just blinded by their religious belief and that has an effect in their cases of putting the real quest for truth on the side in order to pursuie their own quest for truth (which is something totally different, as I once said)…  When you only seek your own truth, that’s when fanatism is near.  I know some people think that I can fall myself into that kind of trap, but if those people could see how many times I’ve changed my mind over the years on many different topics regarding the Shroud, I don’t think they would have that kind of opinion of me no more.  I don’t think that defending passionately a rational quest for truth regarding the Shroud (while taking into account ALL the data we know about this object), I don’t think it can be called “fanatism”.  I prefer to think it’s more like a defense of the integrity of Shroud research.  And, I said it before, I’m not here to make friends but to seek the truth (which, again, is something totally different).  I don’t want to fall into one rigid group where all the people should think the same.  That’s what I call “fanatism”.\n\n","date":"July 13, 2012 at 1:45 pm","url":"https://shroudstory.com/2012/07/11/a-modern-conceptual-idea-of-the-supernatural-world/","cat":"news_&_views","id":"comment-13823","author":"Yannick Clément","site":"shroudstory"},{"title":"A modern conceptual idea of the \"supernatural\" world?","post":"\nYannick Clément :Me too Ron. And I think that statement can sadly be applied to many Shroud researchers these days… I think those people are just blinded by their religious belief and that has an effect in their cases of putting the real quest for truth on the side in order to pursuie their own quest for truth (which is something totally different, as I once said)… When you only seek your own truth, that’s when fanatism is near. I know some people think that I can fall myself into that kind of trap, but if those people could see how many times I’ve changed my mind over the years on many different topics regarding the Shroud, I don’t think they would have that kind of opinion of me no more. I don’t think that defending passionately a rational quest for truth regarding the Shroud (while taking into account ALL the data we know about this object), I don’t think it can be called “fanatism”. I prefer to think it’s more like a defense of the integrity of Shroud research. And, I said it before, I’m not here to make friends but to seek the truth (which, again, is something totally different). I don’t want to fall into one rigid group where all the people should think the same. That’s what I call “fanatism”.\nProblem is Yannick, although you may believe you are being scientific or ‘rational’, you aren’t. Case in point; over the past many months I have noticed you have ignored, many times, many tangible, factual details that will go against your thinking, you basically shirk the obvious. So if anyone is stuck in their thoughts it is you. Sorry. Another case in point Wilson’s hypothesis; You think everyone including myself accept it completely, unconditionally…not true. It is a hypothesis and accepted as so, nothing more. But it is still, even with all your excessively long blabbing posts, the closest thing we have to possibly the early history of the Shroud, even with some of it’s weaker points. Furthermore, until you or any of these “outside the Shroud world” historians you keep mentioning can come up with a better hypothesis, I’d appreciate if you and others would stop badmouthing Wilson. Even if you dissagree with him, a certain amount of respect should be shown to him considering what he has done to bring the Shroud to the masses.\nThanks for listening….I hope.\nR\n\n","date":"July 13, 2012 at 4:55 pm","url":"https://shroudstory.com/2012/07/11/a-modern-conceptual-idea-of-the-supernatural-world/","cat":"news_&_views","id":"comment-13829","author":"Ron","site":"shroudstory"},{"title":"A modern conceptual idea of the \"supernatural\" world?","post":"Respect ?  For the Shroud version of Dan Brown ?  No.  Never.  \nAnd before accusing me of being stuck with my thoughts, I think you should look at you in a mirror…\n\n","date":"July 13, 2012 at 5:30 pm","url":"https://shroudstory.com/2012/07/11/a-modern-conceptual-idea-of-the-supernatural-world/","cat":"news_&_views","id":"comment-13831","author":"Yannick Clément","site":"shroudstory"}]
