[{"title":"The Man of the Shroud has Horns?","post":"Dan, have you forgotten?\nhttps://shroudstory.com/2014/05/03/the-shroud-of-turin-and-the-horns-of-the-devil/\n\n","date":"July 17, 2014 at 6:20 am","url":"https://shroudstory.com/2014/07/17/the-man-of-the-shroud-has-horns/","cat":"tinfoil_hats","id":"comment-138888","author":"O.K.","site":"shroudstory"},{"title":"The Man of the Shroud has Horns?","post":"Senior moment, I guess. Sorry, O.K., I should have made reference to your comments back in May.\n\n","date":"July 17, 2014 at 6:56 am","url":"https://shroudstory.com/2014/07/17/the-man-of-the-shroud-has-horns/","cat":"tinfoil_hats","id":"comment-138896","author":"Dan","site":"shroudstory"},{"title":"The Man of the Shroud has Horns?","post":"I’ve studied preservation and cleaning methods of textiles for a personal collection of mine.\nAntique or ancient linen, being a plant fiber, can withstand water. However, when water is applied to a targeted area, the fibers swell and “pushes” collected particles to the perimeter of the water mark which darken over time.\nI’m not a rocket scientist fellas, but as I’ve studied the shroud I’ve gathered the image itself fades over time, while knowing edges of water stains darken.\nFor the Templars, they would’ve seen a darker image + lighter stain, right?\n\n","date":"July 17, 2014 at 9:58 am","url":"https://shroudstory.com/2014/07/17/the-man-of-the-shroud-has-horns/","cat":"tinfoil_hats","id":"comment-138914","author":"jenx","site":"shroudstory"},{"title":"The Man of the Shroud has Horns?","post":"This is absolute rubbish, a waste of time. Please gentlemen, read some history before confusing the Man of the Shroud with Baphomet. Did Michelangelo think about this mythical figure before putting those horns above Moses’ head? Did Jacques de Molay go from Athens to Avignon to meet Pope Clement V to discuss new crusading plans — the Fall of Acre was humiliating to the Templars — while worshipping a devil?\nThe knights used the Anastasis of the Church of the Holy Sepulchre in Jerusalem as a model to build their round churches:\n  https://www.academia.edu/7556467/Jesus_was_not_buried_in_Talpiot_-_Parts_I_and_II\nSee the legend of the first photograph to note in whose honour the church (with round) was consecrated.\n\n","date":"July 17, 2014 at 1:31 pm","url":"https://shroudstory.com/2014/07/17/the-man-of-the-shroud-has-horns/","cat":"tinfoil_hats","id":"comment-138948","author":"Louis","site":"shroudstory"},{"title":"The Man of the Shroud has Horns?","post":"Another relic is awaiting authentication, nothing to do with horns. It is the crown of thorns preserved at Notre Dame, Paris:\nhttp://www.notredamedeparis.fr/spip.php?article339\nThis is just one lead, the other one, details about which, with colour illustration, are given in Professor Danin’s book “Botany of the Shroud” is also on the waiting list.\n\n","date":"July 24, 2014 at 10:29 am","url":"https://shroudstory.com/2014/07/17/the-man-of-the-shroud-has-horns/","cat":"tinfoil_hats","id":"comment-140143","author":"Louis","site":"shroudstory"},{"title":"The Man of the Shroud has Horns?","post":"On May 4, 2014, I wrote:\n“Actually, the archaeopareidolia of the Devil’s two horns is not so much created by watermaks as by the two inverted “V” blood rivulets (as if in the hair on the left) and markings (on the right) at TS Face forehead level.”\n“Re the head the Templar Knights venerated and cryptically said to be in figuram baffometi:\nThe very word “baphomet” does wordplay (medieval etymology) with the Old French phrase “Ba Mauffé”, “Down with the Devil” (referring to Yeshua’s awe inspiring death mask (= the Holy Face of his Holy Shroud with his sole head appearing through the “MONSTRance”, i.e. the crystal rock of a vast oculus as central circular opening in front side of a reliquary). Actually via an archaeopareidolia, his death mask could appear AS IF having “two horns” at forehead level.”\n“The word very baffomet/baphomet (my own scientific etymology) comes from the Hebrew Ba-phéo-Emet, in Italian “é la bocca della Verità”, “the word in his mouth is Truth”. Through an analogy, It does refer (my own iconocryptology) to  “La Bocca della Verità” (or The Mouth of Truth”), an ancient marble mask with a hole in the mouth.  The Knight Templars’ alleged ‘idole’ in likeness of a Baphomet is nothing but a combination of two Holy faces: both the Holy Face of the Holy Shroud and the Holy Face of the Holy Veronica II aka The (open-mouthed) Holy Face of the Manoppello Veil.”\n“Archaeocryptollogicaly speaking, this is made pretty obvious when you make a comparative study of the two Holy Faces in light of the Bust of Christ depicted in the Templar oak panel from Templecombe.”\n\n","date":"July 24, 2014 at 1:39 pm","url":"https://shroudstory.com/2014/07/17/the-man-of-the-shroud-has-horns/","cat":"tinfoil_hats","id":"comment-140161","author":"Max patrick Hamon","site":"shroudstory"},{"title":"The Man of the Shroud has Horns?","post":"The Knight Templars’ ‘Head’ was reported (by Hugues de Payraud) to have “four legs: two at the front and two at the back”. Actually the Shroud image does show a bearded head with two  frontal imprints of legs and feet (the latter apparently ‘missing’ for a few Shroudies though) AND two dorsal imprints of legs and feet.\n\n","date":"July 24, 2014 at 1:51 pm","url":"https://shroudstory.com/2014/07/17/the-man-of-the-shroud-has-horns/","cat":"tinfoil_hats","id":"comment-140165","author":"Max patrick Hamon","site":"shroudstory"},{"title":"The Man of the Shroud has Horns?","post":"Typo: the frontal imprints of two legs and feet (the latter apparently ‘missing’ for a few Shroudies though) AND dorsal imprints of two legs and feet.\n\n","date":"July 24, 2014 at 1:55 pm","url":"https://shroudstory.com/2014/07/17/the-man-of-the-shroud-has-horns/","cat":"tinfoil_hats","id":"comment-140167","author":"Max patrick Hamon","site":"shroudstory"}]
