[{"title":"Face of the Man of the Shroud of Turin Encoded in Sistine Chapel?","post":"That elephant does not look like the man of the shroud. Just kidding. This is just plain nutty stuff. As I see it Michelangelo secretly included the images from those British crop circles. If Leonardo could use a time machine to photograph himself onto the shroud why not Michelangelo?\n\n","date":"November 3, 2012 at 7:19 am","url":"https://shroudstory.com/2012/11/03/face-of-the-man-of-the-shroud-of-turin-encoded-in-sistine-chapel/","cat":"news_&_views","id":"comment-18757","author":"Jesse","site":"shroudstory"},{"title":"Face of the Man of the Shroud of Turin Encoded in Sistine Chapel?","post":"If you overlaid other faces (how about Elvis?) would you find similar matches?  Michelangelo was certainly talented enough to achieve such a feat; it’s a clever idea, but wouldn’t it be more obvious?  I’m lost past the “eyelids”, if not before.\n\n","date":"November 3, 2012 at 7:46 am","url":"https://shroudstory.com/2012/11/03/face-of-the-man-of-the-shroud-of-turin-encoded-in-sistine-chapel/","cat":"news_&_views","id":"comment-18759","author":"Kelly Kearse","site":"shroudstory"},{"title":"Face of the Man of the Shroud of Turin Encoded in Sistine Chapel?","post":"Try this:\nBegin with any photo of a face, more or less face on.\nOverlay two circles, a triangle and a bent line on the eyes, nose and mouth.\nReduce the opacity of the photo to very little, and import the Cistine Chapel, under the overlay.\nDistort the Chapel photo so that the eye circles lie in the middle of the blue ovals just above the great crowd of dead people, and the mouth fits into the blue space below the two heavies at God’s feet.\nRemove the shapes, fade out the Chapel, fade up your face and anybody can have themselves unconsciously planted retrospectively in Michaelangelo’s brain!\n\n","date":"November 3, 2012 at 12:56 pm","url":"https://shroudstory.com/2012/11/03/face-of-the-man-of-the-shroud-of-turin-encoded-in-sistine-chapel/","cat":"news_&_views","id":"comment-18765","author":"Hugh Farey","site":"shroudstory"},{"title":"Face of the Man of the Shroud of Turin Encoded in Sistine Chapel?","post":"The best interactive Virtual Tour of the Sistine Chapel I’ve so far found is the Villanova version at:\nhttp://www.vatican.va/various/cappelle/sistina_vr/index.html   \nThe tour is interactive – use your pointer middle scroller to zoom, and keyboard arrow keys to navigate.  You get to see everything: From the Creation to the Last Judgment – chapel sanctuary, ceiling, the side wall frescoes by other artists, entrance doors etc, choose whatever perspective you want. \nNo pushy crowds, no clock-watching tour guides moving you on, no Italian heat, and best of all no neck liniment required! \nAs for encoded TSM, I suspect it’s “elephant in the sky” stuff – I don’t see it – Hugh’s comment is right on.  I suspect Philip E Dayvault is a technically clever chap with too much time to spare and an over-active imagination.  I tried stepping back from the screen with eyes half-closed – still didn’t get it!  My verdict – If Max tries it out, and even he doesn’t get it then it can’t be there!\n\n","date":"November 3, 2012 at 3:57 pm","url":"https://shroudstory.com/2012/11/03/face-of-the-man-of-the-shroud-of-turin-encoded-in-sistine-chapel/","cat":"news_&_views","id":"comment-18772","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Face of the Man of the Shroud of Turin Encoded in Sistine Chapel?","post":"I see another that looks like the TS image in Michaelangel’s fresco.\nLook at the angel that has her arm bent and extended up to her face. Her other arm is positioned across her waist.  She looks like she’s sitting on something similar to a lilly pad with her knees bent.  This would be the second set of images vertically down from Christ and to the right.\nIf you look at the blue shaded area, directly below the green pad the angel appears to be perched on, you will see a face embedded that looks like the Shroud image.  The eyes and nose seem exact, but the mought is a little wider.\nThe first image on this website is clearer.\nMichelangelo’s “Last Judgment” – Fresco at the Sistine Chapel\nhttp://www.webpages.uidaho.edu/~rfrey/166michelangelo.htm\nBest,\n\n","date":"November 3, 2012 at 5:57 pm","url":"https://shroudstory.com/2012/11/03/face-of-the-man-of-the-shroud-of-turin-encoded-in-sistine-chapel/","cat":"news_&_views","id":"comment-18780","author":"Angel","site":"shroudstory"},{"title":"Face of the Man of the Shroud of Turin Encoded in Sistine Chapel?","post":"In order to check this surprising hypothesis, it is inadequate  just to state ‘I don’t see any shroud face in this painting, therefore this seems to be just another cloudy elephant ‘. Of course you don’t see that face at a glance. If the hypothesis is true, the image is encoded. It’s secret, meaning that it will be difficult   to see it. In order to check the hypothesis, a good start would be to measure the proportions of the supposed eyes, nose, and mouth, and compare the results to the same measurements made on the shroud image. A second check could be to control for pecularities on the shroud image: are these reflected in this painting? For instance: the nose of the shroud image is concave towards the left. Is this concavity also suggested by the position of Christ, who is supposed to be on the dorsum of the nose of the hypothetical ‘Sixtine face’? And so on.\n\n","date":"November 3, 2012 at 6:50 pm","url":"https://shroudstory.com/2012/11/03/face-of-the-man-of-the-shroud-of-turin-encoded-in-sistine-chapel/","cat":"news_&_views","id":"comment-18782","author":"Jos Verhulst","site":"shroudstory"},{"title":"Face of the Man of the Shroud of Turin Encoded in Sistine Chapel?","post":"The problem is that I do see the shroud face. Also my face, Elvis’s face and anybody else’s face you care to superimpose. There is so much detail in the Cistine Chapel that any irregularity in anybody’s face is bound to have a parallel in it somewhere. Any feature of the Chapel which does not correspond with a feature of the face can be (and has been) ignored. As for proportions, even Dayvault admits that for a start you have to take a photo of the Chapel from exactly the right height and distance away, and even then the shroud photo had to be manipulated to make it fit.\n\n","date":"November 3, 2012 at 7:53 pm","url":"https://shroudstory.com/2012/11/03/face-of-the-man-of-the-shroud-of-turin-encoded-in-sistine-chapel/","cat":"news_&_views","id":"comment-18785","author":"Hugh Farey","site":"shroudstory"},{"title":"Face of the Man of the Shroud of Turin Encoded in Sistine Chapel?","post":"Phil is a serious Shroud researcher and did some good work on the Sanliurfa mosaic. The problem in this case is to explain what is meant by “unknowingly painted the encoded image,” the first reason to raise doubts. “Shroudie” Jesuit Father Heinrich Pfeiffer wrote a book on the Sistine Chapel and some good images of the frescoes can be seen on christusrex.org.\n\n","date":"November 3, 2012 at 8:37 pm","url":"https://shroudstory.com/2012/11/03/face-of-the-man-of-the-shroud-of-turin-encoded-in-sistine-chapel/","cat":"news_&_views","id":"comment-18787","author":"Louis","site":"shroudstory"},{"title":"Face of the Man of the Shroud of Turin Encoded in Sistine Chapel?","post":"Forgive my frivolity. I do not doubt Dayvault’s sincerity. However I have a couple of serious objections to the ENCODED article.\nFirstly, I do wish the word ‘forensic’ didn’t keep cropping up. I have no doubt at all – does anyone else? Does Dayvault? – that a court of law (which is where forensic methods get tested) would have extreme difficulty in recognising, beyond all reasonable doubt, that either the Sanliurfa mosaic or the Cistine Chapel were copies of the shroud. The forensic methods of a fingerprint expert, for example, or those of a firearms/toolmarks unit, in which Dayvault gained his expertise, are to demonstrate specific points of congruence between two images that appear very similar from the start. Any demonstration, by an opposing barrister, of lack of congruence where there should be some, usually invalidates the finding completely. Sadly, the images in dispute look nothing like each other, and all attempts to make them do so by finding points of congruence – which are in themselves highly debatable – are, forensically, doomed to fail.\nSecondly, Dayvault makes (at least) two assertions which are demonstrably untrue by anyone with basic imaging software, namely:\n     “The ONLY photograph which accurately and forensically corresponds to the unique landmark features of the frescoes is the highly-detailed CDD shroud face image” and\n     “In an attempt to disprove the hypothesis, overlay the Chapel fresco with another scaled photo of another person. try your best to align them. (An observable exercise is futility.)”\nThis last was the stimulus behind my first ‘try-it-yourself’ comment above. I maintain that my own face has at least as many points of congruence with the Chapel as that of the shroud, and would be happy to defend that position with detailed illustrations.\nThirdly, and I admit that this might just be my own prejudice, but I’m not impressed by the fact that a number of nations have forensic science departments, and do not think that mentioning the ‘FBI, DHS Customs and Border Protection, New York City Police Department, Los Angeles Sheriff’s Department…. Australian Federal Police… ‘ etc, etc. lends any authority to the article. At least to me, this sort of thing actually damages, rather than enhances, its credibility.\nFinally, like many researchers into offbeat matters, I should be delighted to change my mind if better evidence could be adduced. Perhaps one of the “several shroud colleagues” or better still the “forensic expert” mentioned in the article quoted above (but not, I note, in the ENCODED article itself) would like to explain how they were convinced.\n\n","date":"November 4, 2012 at 10:59 am","url":"https://shroudstory.com/2012/11/03/face-of-the-man-of-the-shroud-of-turin-encoded-in-sistine-chapel/","cat":"news_&_views","id":"comment-18792","author":"Hugh Farey","site":"shroudstory"},{"title":"Face of the Man of the Shroud of Turin Encoded in Sistine Chapel?","post":"One of the big frustrations of Shroud researchers is that significant traces of the Image of Edessa and other important  items relating to Christianity may lie underneath the destruction by the invaders. After all, Edessa (Sanliurfa) was an important centre of early Christianity. Apparently there is a lot of expectation in the excavations being made there, one result being the Sanliurfa mosaic that was first brought to light (for Shroudies) by Phil, and was identified as the image of “Issa” (Jesus) by the local (non-Christian) archaeologist. It must also be remembered that Phil was not alone in stressing the importance of this mosaic and it least goes to show that faces of Jesus were around before the destruction, and, who knows, the future may reveal a better face of Jesus, closer to what is seen on the TS.\nAs for the rest, the sentence saying “unknowingly painted the encoded image” is what demands explanation before one can proceed.\n\n","date":"November 4, 2012 at 12:39 pm","url":"https://shroudstory.com/2012/11/03/face-of-the-man-of-the-shroud-of-turin-encoded-in-sistine-chapel/","cat":"news_&_views","id":"comment-18793","author":"Louis","site":"shroudstory"},{"title":"Face of the Man of the Shroud of Turin Encoded in Sistine Chapel?","post":"This is another very good example of the “I think I see” syndrome versus the Shroud that was so much criticize by Rogers particularly (and others over the years) because of his very suggestive aspect, which has nothing to do with a real scientific analysis.\nBy the way, I really found this overlay technique of gradually putting one image over the other one to be VERY SUGGESTIVE AND NOT VERY SCIENTIFIC…  By the way, this technique was often used by Whanger and others to demonstrate their “I think I see” conclusions versus the Shroud, like the case of supposed images of flowers on the cloth and things like that.  I don’t buy these kinds of suggestive conclusions simply because of their suggestive aspect.  This is as simple as that for me.\n\n","date":"November 4, 2012 at 8:31 pm","url":"https://shroudstory.com/2012/11/03/face-of-the-man-of-the-shroud-of-turin-encoded-in-sistine-chapel/","cat":"news_&_views","id":"comment-18799","author":"Yannick Clément","site":"shroudstory"},{"title":"Face of the Man of the Shroud of Turin Encoded in Sistine Chapel?","post":"Back from a long week-end, I just read the Encoded 15-page paper. No matter how clever or cheeky Dayvault’s idea may seem at first sight, his forensic demonstration is far from being convincing as it falls short of both really extrinsic and intrinsic objective verifications.\n  Firstly a more “eido(mosaico)matic” tile-by-tile minute detection, isolation, identification and back-and-forth gradual construction-deconstruction process from source-object’s accidental characteristics (i.e. those of the TS face) to target-object artificial characteristics (i.e. those of the Sistine chapel fresco portion) should have been visually stressed to allow the reader to more easily follow and evaluate the relevance/accuracy of Dayvault’s observations.\n  Secondly the latter’s so-called ‘forensic demonstration’ falls short of overlaid counter-examples that could have proved whether or not beyond the shadow of a rational doubt (rather/perfectly) similar matches JUST COULD NOT be arrived at through applying the same forensic methodology e.g. to “continuous directional derivatives” (or CDDs) of Michelangelo’s, Leonardo da Vinci’s, Raphael’s, Albert Durer’s, The Joconde’s and Manoppello Veil/Veronica’s face image.\n  Thirdly, beside 1991 Whanger CDD Sindon face photograph, 2-3 additional “Sindon face windows to look through” (make specific comparisons with) would have been most needed in terms of really building up a truly compelling forensic  AND archaeocryptological case here.\n  In spite of his 15-page paper piling up of tiny pieces of evidence, with respect, Dayvault never really builds into asolid, thorough and compelling scientific and archaeological crucial evidence. His methodology is flawed and more ad hoc imagery would also be needed for Dayvault to really drive his point home i.e. in his readership’s mind. This is rendered all the more difficult by Dayvault candidly asking his reader to believe Michelangelo encoded the Sindon face image in the Sistine church ceiling without even being aware of it. Hence one may suggest a better title for his paper: Michelangelo, “an iconocryptographer in spite of himself”?\n\n","date":"November 5, 2012 at 7:06 am","url":"https://shroudstory.com/2012/11/03/face-of-the-man-of-the-shroud-of-turin-encoded-in-sistine-chapel/","cat":"news_&_views","id":"comment-18808","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Face of the Man of the Shroud of Turin Encoded in Sistine Chapel?","post":"Typo: with respect, Dayvault never really builds IT into a solid, thorough and compelling scientific and archaeological crucial evidence.\n\n","date":"November 5, 2012 at 7:17 am","url":"https://shroudstory.com/2012/11/03/face-of-the-man-of-the-shroud-of-turin-encoded-in-sistine-chapel/","cat":"news_&_views","id":"comment-18810","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Face of the Man of the Shroud of Turin Encoded in Sistine Chapel?","post":"+ typo: with respect, Dayvault never really builds IT into solid, thorough and compelling scientific and archaeological crucial evidence.\n\n","date":"November 5, 2012 at 9:15 pm","url":"https://shroudstory.com/2012/11/03/face-of-the-man-of-the-shroud-of-turin-encoded-in-sistine-chapel/","cat":"news_&_views","id":"comment-18829","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Face of the Man of the Shroud of Turin Encoded in Sistine Chapel?","post":"As a really impressive image misperception, see  “The face of Jesus Christ seen in a cloud” by Rex Features in “The Telegraph”..\n\n","date":"November 5, 2012 at 6:00 pm","url":"https://shroudstory.com/2012/11/03/face-of-the-man-of-the-shroud-of-turin-encoded-in-sistine-chapel/","cat":"news_&_views","id":"comment-18822","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Face of the Man of the Shroud of Turin Encoded in Sistine Chapel?","post":"See also Toby Elles (from Lancaster)’s frying pan with an image of “Jesus Christ” on it, Etc.\n\n","date":"November 5, 2012 at 6:07 pm","url":"https://shroudstory.com/2012/11/03/face-of-the-man-of-the-shroud-of-turin-encoded-in-sistine-chapel/","cat":"news_&_views","id":"comment-18823","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Face of the Man of the Shroud of Turin Encoded in Sistine Chapel?","post":"Or else the Kit-Kat which supposedly contains “an image of Jesus” (Picture: EUROPICS[CEN])\n\n","date":"November 5, 2012 at 6:10 pm","url":"https://shroudstory.com/2012/11/03/face-of-the-man-of-the-shroud-of-turin-encoded-in-sistine-chapel/","cat":"news_&_views","id":"comment-18824","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Face of the Man of the Shroud of Turin Encoded in Sistine Chapel?","post":"“The face of Jesus” on a naan bread is OK too (see Picture: SWNS)\n\n","date":"November 5, 2012 at 6:14 pm","url":"https://shroudstory.com/2012/11/03/face-of-the-man-of-the-shroud-of-turin-encoded-in-sistine-chapel/","cat":"news_&_views","id":"comment-18825","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Face of the Man of the Shroud of Turin Encoded in Sistine Chapel?","post":"“The face of Jesus”  spotted in April 2011 in a three cheese pizza  at the Posh Pizza shop in Brisbane, Australia, even/oven shows “a non inverted 3”!\n\n","date":"November 5, 2012 at 6:23 pm","url":"https://shroudstory.com/2012/11/03/face-of-the-man-of-the-shroud-of-turin-encoded-in-sistine-chapel/","cat":"news_&_views","id":"comment-18826","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Face of the Man of the Shroud of Turin Encoded in Sistine Chapel?","post":"I wonder if distinctive pattern recognition is a valid way to find “images”?\n\n","date":"November 8, 2012 at 10:00 pm","url":"https://shroudstory.com/2012/11/03/face-of-the-man-of-the-shroud-of-turin-encoded-in-sistine-chapel/","cat":"news_&_views","id":"comment-18903","author":"Andy Weiss","site":"shroudstory"},{"title":"Face of the Man of the Shroud of Turin Encoded in Sistine Chapel?","post":"Reminder: the “non-reversed 3” (nearly as in the negative TS face photograph in a ‘3’ cheese pizza was deliberate i.e. most probably a hoax.\n\n","date":"November 9, 2012 at 5:28 am","url":"https://shroudstory.com/2012/11/03/face-of-the-man-of-the-shroud-of-turin-encoded-in-sistine-chapel/","cat":"news_&_views","id":"comment-18910","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Face of the Man of the Shroud of Turin Encoded in Sistine Chapel?","post":"A valid way to really identify ‘TS-MV face images’ in artworks or items such as the Justinian II solidus (there are only 9mm from hair top to pointed beard) is from at least 3 copied/interpreted TS-MV facial accidental characteristics + at least 3 copied facial non accidental idividual characteristics.\n  When it comes to Christ face in a wall fresco, mosaic and/or painting, perfect overlapping at scale 1:1 with 2-3 copied/interpreted accidental characteristics included is a must.\n\n","date":"November 9, 2012 at 5:49 am","url":"https://shroudstory.com/2012/11/03/face-of-the-man-of-the-shroud-of-turin-encoded-in-sistine-chapel/","cat":"news_&_views","id":"comment-18911","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Face of the Man of the Shroud of Turin Encoded in Sistine Chapel?","post":"(Perfect or nearly perfect ovelapping at scale 1:1)\n\n","date":"November 9, 2012 at 5:58 am","url":"https://shroudstory.com/2012/11/03/face-of-the-man-of-the-shroud-of-turin-encoded-in-sistine-chapel/","cat":"news_&_views","id":"comment-18912","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Face of the Man of the Shroud of Turin Encoded in Sistine Chapel?","post":"When it comes to an imprint on textile as receiving object such as linen twill, a slight re-scaling may be needed if the source object (e.g. a coin) was recorded when the receiving cloth was soaked (e.g. in alkaline waters) and stretched.\n\n","date":"November 9, 2012 at 6:05 am","url":"https://shroudstory.com/2012/11/03/face-of-the-man-of-the-shroud-of-turin-encoded-in-sistine-chapel/","cat":"news_&_views","id":"comment-18913","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Face of the Man of the Shroud of Turin Encoded in Sistine Chapel?","post":"Some remarks here:\nhttps://docs.google.com/open?id=0Bzmu3L630O0fTmdVU0c4OUh5Uk0\n\n","date":"November 11, 2012 at 5:28 pm","url":"https://shroudstory.com/2012/11/03/face-of-the-man-of-the-shroud-of-turin-encoded-in-sistine-chapel/","cat":"news_&_views","id":"comment-18975","author":"Jos Verhulst","site":"shroudstory"},{"title":"Face of the Man of the Shroud of Turin Encoded in Sistine Chapel?","post":"\nYannick Clément :\nThis is another very good example of the “I think I see” syndrome versus the Shroud.\n\nRight.\n\n","date":"November 11, 2012 at 6:55 pm","url":"https://shroudstory.com/2012/11/03/face-of-the-man-of-the-shroud-of-turin-encoded-in-sistine-chapel/","cat":"news_&_views","id":"comment-18978","author":"anoxie","site":"shroudstory"},{"title":"Face of the Man of the Shroud of Turin Encoded in Sistine Chapel?","post":"This is a good article on the whole but it does not answer two questions: What is meant by “unknowingly painted the encoded image”? Has it anything to do with the so-called Spiritualist medium painting? Of course not. If, on the other hand, Michelangelo knew about the Shroud what was the reason to hide this knowledge? The Christ of the Last Judgment looks Roman, not Jewish.\n\n","date":"November 11, 2012 at 6:55 pm","url":"https://shroudstory.com/2012/11/03/face-of-the-man-of-the-shroud-of-turin-encoded-in-sistine-chapel/","cat":"news_&_views","id":"comment-18979","author":"Louis","site":"shroudstory"},{"title":"Face of the Man of the Shroud of Turin Encoded in Sistine Chapel?","post":"Some more remarks here:\nhttps://docs.google.com/open?id=0Bzmu3L630O0fWllOVFRwemNFdW8\n\n","date":"November 16, 2012 at 5:26 pm","url":"https://shroudstory.com/2012/11/03/face-of-the-man-of-the-shroud-of-turin-encoded-in-sistine-chapel/","cat":"news_&_views","id":"comment-19136","author":"Jos Verhulst","site":"shroudstory"},{"title":"Face of the Man of the Shroud of Turin Encoded in Sistine Chapel?","post":"Still more comments here:\nhttps://docs.google.com/open?id=0Bzmu3L630O0fUUM2QzVrVDZadjQ\n\n","date":"November 19, 2012 at 8:12 am","url":"https://shroudstory.com/2012/11/03/face-of-the-man-of-the-shroud-of-turin-encoded-in-sistine-chapel/","cat":"news_&_views","id":"comment-19196","author":"Jos Verhulst","site":"shroudstory"},{"title":"Face of the Man of the Shroud of Turin Encoded in Sistine Chapel?","post":"new link:\nhttps://docs.google.com/open?id=0Bzmu3L630O0fRnRlMTlaTFh6Mkk\n\n","date":"November 19, 2012 at 9:13 am","url":"https://shroudstory.com/2012/11/03/face-of-the-man-of-the-shroud-of-turin-encoded-in-sistine-chapel/","cat":"news_&_views","id":"comment-19197","author":"Jos Verhulst","site":"shroudstory"}]
