[{"title":"Fall Update to shroud.com","post":"Hello Barrie.\nThank you for your update to the shroud.com, and inclusion of my humble presentation about 3D effect.\nI have a one, very minor issue:\nYou wrote in the entry ” (Holy Tunic of Argenteuil To Be Displayed in 2016) http://shroud.com/latebrak.htm#tunic ) : Although not directly related to the Shroud of Turin.\nActually, several comparisons between bloodstains on the Tunic and the dorsal image on the Shroud have been performed, one back in 1930s, and more recently by late Andre Marion in 1997. Here you have two scans from Marion & Lucotte book “Le linceul de Turin et la tunique d’Argenteuil” (which provides excellent overview of the scientific reasearch of the Tunic):They claim there is a match. If so, then we should say that the Tunic is directly related to the Shroud -and very important material evidence.\n\n","date":"November 1, 2015 at 1:42 pm","url":"https://shroudstory.com/2015/11/01/fall-update-to-shroud-com/","cat":"other_sites","id":"comment-214062","author":"O.K.","site":"shroudstory"},{"title":"Fall Update to shroud.com","post":"I’m intrigued..Can you tell me anything else about the tunic or point me to another scientific investigation on it? I can’t find “Le linceul de Turin et la tunique d’Argenteuil” anywhere online.\n\n","date":"November 1, 2015 at 10:17 pm","url":"https://shroudstory.com/2015/11/01/fall-update-to-shroud-com/","cat":"other_sites","id":"comment-214070","author":"Matthew L.","site":"shroudstory"},{"title":"Fall Update to shroud.com","post":"Here are the Google Books fragments of Polish edition of that book (I have a paper version, which is my primary source of information about the Tunic): http://tinyurl.com/ow3jjw8\nOr you can ask our French-speaking friends.\nThere is also a chapter in Grzegorz Górny’s “Witnesses to mystery” which summarizes the research:\nhttp://tinyurl.com/o5m4ye3\n\n","date":"November 2, 2015 at 4:36 am","url":"https://shroudstory.com/2015/11/01/fall-update-to-shroud-com/","cat":"other_sites","id":"comment-214083","author":"O.K.","site":"shroudstory"}]
