[{"title":"Fan Mail","post":"Nice to see everyone is getting into the Christmas spirit.\n\n","date":"December 20, 2013 at 8:35 am","url":"https://shroudstory.com/2013/12/20/fan-mail/","cat":"news_&_views","id":"comment-63155","author":"David Goulet","site":"shroudstory"},{"title":"Fan Mail","post":"I note that the Most Holy Family Monastery (vaticancatholic.com) has 869 videos credited to it on YouTube, while the Vatican (vatican) has 2259. The most popular 15 uploads of the Holy Family have received over 14 million views, while those of the Vatican amount to only 2 million views. About 10 million of the Holy Family views are for uploads about exorcism and demonic possession, another million cover Creationism and another million “Death and the Journey into Hell.”\nI was unaware of Beavis and Butt-head until they were mentioned in this blog. Wikipedia says they are characterised by being “dim-witted, under-educated, and barely literate, and [lacking in] any empathy or moral scruples.” They also enjoy videos which are “associated with violence, sex or the macabre.”\n\n","date":"December 20, 2013 at 8:44 am","url":"https://shroudstory.com/2013/12/20/fan-mail/","cat":"news_&_views","id":"comment-63169","author":"Hugh Farey","site":"shroudstory"},{"title":"Fan Mail","post":"This kind of thing is the reason that bottles of peppermint schnapps need to be kept *far away* from the thesaurus at this time of year.\nMerry Christmas, you sedevacantist loons.  Jesus is the reason for the season — and for the Church as well.\n\n","date":"December 20, 2013 at 12:36 pm","url":"https://shroudstory.com/2013/12/20/fan-mail/","cat":"news_&_views","id":"comment-63338","author":"Jeff","site":"shroudstory"},{"title":"Fan Mail","post":"I happen to be a Catholic of the traditionalist bent- ie, I prefer the older form of the Mass, like traditional catechisms like the Baltimore- and I can tell you that even most “trads” think that Freddy Dimond(that’s the real name of the fella who runs the monastery) is a kook. A well meaning and sincere kook, but still a kook.\nAnd Merry Christmas to all!\n\n","date":"December 20, 2013 at 2:39 pm","url":"https://shroudstory.com/2013/12/20/fan-mail/","cat":"news_&_views","id":"comment-63437","author":"Chesterbelloc","site":"shroudstory"},{"title":"Fan Mail","post":"As far as expertise in derogatory castigations and indulgence in non sequitur argument is concerned, we’d all have to defer to the correspondent. I’m sorry that Dan is the recipient of this type of claptrap, and a little amazed that he saw fit to publish it. Maybe there’s a lesson in tolerance there!\n\n","date":"December 20, 2013 at 8:22 pm","url":"https://shroudstory.com/2013/12/20/fan-mail/","cat":"news_&_views","id":"comment-63688","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Fan Mail","post":"I sent an email to Petrus Soons the other day. He responded. Nice man.\n\n","date":"December 22, 2013 at 9:41 am","url":"https://shroudstory.com/2013/12/20/fan-mail/","cat":"news_&_views","id":"comment-64999","author":"michael jude","site":"shroudstory"}]
