[{"title":"A New Rule and this Blog’s Raison d’etre","post":"Dan,\nI think it is very sad that Colin Berry’s rants have driven people away. The problem is, how to react. There may be pseudo-science but there is also pseudo-skepticism. That is skeptics who claim to be impartially seeking the truth but instead are merely seeking to justify there own view. Perhaps the most prominent pseudo-skeptic of our time is Richard Dawkins, author of “The  God Delusion.”\nIn the days when the carbon dating provided an easy-out for skeptics, Father Rinaldi who did not live to see the results of Ray Rogers’ work stated atht he would not accept the results of the carbon dating until somebody could explain how the Shroud image was formed. That remains the challenge to not just the carbon test belivers, but for all of us. Call be a bliever if you will, but I believe that the mystery of the image will be either solved by science or remain insoluable. Maybe it will never be solved. Or maybe as science pushed further into the quantum enigmas, it might just face a solution that the pseudo-skeptics can never accept: It’s Him.\nI hope youcan recover your audience because the page has performed an important task in its healthy interchanges as contrasted to its braying ones.\nWhat the peudoskeptics will never admit is that there is no evidence that will suffice becasue they know the truth and the rest of us are poor, beknighted souls.\n“Keep the faith,” baby. Really! Whatever the final result of my endeavors without the blog, and of course, Shroud.com, I would be nowhere. And I am getting there, wherever “there” is.\n\n","date":"June 28, 2013 at 6:14 am","url":"https://shroudstory.com/2013/06/28/a-new-rule-and-this-blogs-raison-detre/","cat":"news_&_views","id":"comment-38297","author":"John Klotz","site":"shroudstory"},{"title":"A New Rule and this Blog’s Raison d’etre","post":"Cheers. Well said, Dan and John.\n\n","date":"June 28, 2013 at 6:29 am","url":"https://shroudstory.com/2013/06/28/a-new-rule-and-this-blogs-raison-detre/","cat":"news_&_views","id":"comment-38299","author":"Fr. M.","site":"shroudstory"},{"title":"A New Rule and this Blog’s Raison d’etre","post":"[edited out to here] . . . I was OFFICIALLY appointed Professor at the University of Riyad in 1976 (on cultural mission) and SERVED AS SUCH? If you don’t believe me . . . [edited out from here]\n\n","date":"June 28, 2013 at 7:14 am","url":"https://shroudstory.com/2013/06/28/a-new-rule-and-this-blogs-raison-detre/","cat":"news_&_views","id":"comment-38302","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A New Rule and this Blog’s Raison d’etre","post":"Professor Hamon, I believe you. Enough has been said on this subject.\nDan\n\n","date":"June 28, 2013 at 8:13 am","url":"https://shroudstory.com/2013/06/28/a-new-rule-and-this-blogs-raison-detre/","cat":"news_&_views","id":"comment-38311","author":"Dan","site":"shroudstory"},{"title":"A New Rule and this Blog’s Raison d’etre","post":"Thanks Dan.  Perhaps you should have done this some time ago.  I’m not trying to complain, I’m just happy you are putting your foot down now.\n\n","date":"June 28, 2013 at 8:20 am","url":"https://shroudstory.com/2013/06/28/a-new-rule-and-this-blogs-raison-detre/","cat":"news_&_views","id":"comment-38313","author":"Andy Weiss","site":"shroudstory"},{"title":"A New Rule and this Blog’s Raison d’etre","post":"This is a good step Dan Porter, one that should have been taken months ago and, as you know, it was something suggested by me. Anyway, this is progress and perhaps the next step could be eliminating people hiding behind pseudonyms, making provocative comments, behaving like self-appointed judges? That is the reason why they hide behind pseudonyms, posting their curriculums, but making it difficult to track their location, unless they fall into the hands of “detective” Colin. \nWe need Colin, as you yourself wrote, and he should be allowed to post his comments, however strong his scepticism may be. Was Dawkins not invited to the Vatican to act as a devil’s advocate some years ago? Didn’t Pope John Paul II go skiing with Italian president Sandro Pertini, who was an atheist? Has Archbishop Rowan Williams, a deep thinker and a great theologian, not debated with Dawkins, for everyone to see? These examples show us that true Christians should not be afraid, that faith is something that is not hollow.\nLet us hope that Max will fall in line with your new policy because we also need him. Best.\n\n","date":"June 28, 2013 at 11:06 am","url":"https://shroudstory.com/2013/06/28/a-new-rule-and-this-blogs-raison-detre/","cat":"news_&_views","id":"comment-38329","author":"Louis","site":"shroudstory"},{"title":"A New Rule and this Blog’s Raison d’etre","post":"Our NZ winter sport is Rugby Football, a hard physical game at which we excel.  Unlike American Gridiron no sissy body-padding is worn, and head protection gear is not compulsory.  Also unlike the more popular Association Football played elsewhere, there is hard body tackling as players seek to capture the ball from their opponents.  Our international games commence with the posturing of the traditional haka, a war-dance of defiance which is how you will be welcomed to our Maori marae, and indeed you will be made very welcome if you pay the traditional ‘koha’, for it is a “quid pro quo” society and ‘utu’ is important.   At the club level, despite the bruising, and occasional more serious injuries, and even sometimes ill-tempered fisticuffs, the teams get together afterwards in camaraderie, the contest over, for a few beers and sing rowdy rugby songs.  A whistle-blowing referee controls the game to ensure compliance with the Laws. \nOur women folk also play a hard physical game of Netball against the Aussies and Jamaicans, and the ref’s whistling is even more frequent.  Some of us imagine we can play cricket, a gentlemanly game much less boisterous, but even there the umpire’s word is Law.  Our Parliamentary debates are also robust, and the House Speaker regularly sends the worst prima donnas out of the chamber for unparliamentary behaviour.\nA much rougher game is ‘Hardball’ where the rules of fair play are ignored and the only objective is to win at all costs.  One version of the game is to attack the credibility of the opponents, using whatever arguments you can dream up, and when they retaliate you can cry “Foul!” and the umpire or moderator then steps in.  You can play this as a long-term strategy, the pay-off being that more benign players no longer turn up for the next fixture, and you can eventually succeed in killing off the enjoyable discussions among those whose views differ from your own.  Another version is to resort to incomprehensible technical jargon, and when this fails to persuade, you can act aggrieved, taking it as a personal insult, the pay-off being that your ego has been massaged. \nI see no problems with using a pseudonym, as those who have wanted to contact me have always been able to do so, by leaving a message on the site.  For others, you can track me down through web-pages: http://tawacatholic.org.nz/tawa-catholic-news-2 or else http://shroudnm.com/docs/2012-03-30-David-Belz-Shroud-Article.pdf  \nPersonally, I have little use for fellow-bloggers assuming a supercilious moral high-ground for lack of a cogent argument, and being a regular church-goer, nor do I require to be preached at elsewhere, as if from a pulpit. \nMy wife regularly plays Lawn Bowls, but I need to spend more time on the greens, having recently confined myself to umpiring including the nationals.  Others could learn a sense of fair play from the occasional round of golf, or enhance their perspective on life by simply walking the dog.  Croquet, anyone?!!\n\n","date":"June 28, 2013 at 8:19 pm","url":"https://shroudstory.com/2013/06/28/a-new-rule-and-this-blogs-raison-detre/","cat":"news_&_views","id":"comment-38353","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A New Rule and this Blog’s Raison d’etre","post":"Hullo Colin, it is a pity you have ceased commenting on this thread, but although an unbeliever, you must have read about Pope Benedict’s complaint about religious hypocrisy.\n\n","date":"June 30, 2013 at 4:49 pm","url":"https://shroudstory.com/2013/06/28/a-new-rule-and-this-blogs-raison-detre/","cat":"news_&_views","id":"comment-38432","author":"Louis","site":"shroudstory"}]
