[{"title":"Favorite Stupid, Stupid Science Picture for 2013","post":"This speaks volumes about McCrone’s legendary arrogance.  I would trust the science of Adler and Heller long before I would give any credence to McCrone.  He was wrong on the Vinland Map too.\n\n","date":"January 1, 2014 at 9:23 am","url":"https://shroudstory.com/2013/12/31/favorite-stupid-stupid-science-picture-for-2013/","cat":"science","id":"comment-70831","author":"Russ Breault","site":"shroudstory"},{"title":"Favorite Stupid, Stupid Science Picture for 2013","post":"\nRuss Breault :\nThis speaks volumes about McCrone’s legendary arrogance.  I would trust the science of Adler and Heller long before I would give any credence to McCrone.  He was wrong on the Vinland Map too.\n\nWell, Wikipedia claims he was not so much wrong about Vinland Map, but that doesn’t concern the Shroud at all. http://en.wikipedia.org/wiki/Vinland_map#Analysis_of_ink\nJust for everyone’s info. I wouldn’t concern so much his work on Vinland Map, because it is irrelevant to the Shroud, and someone may find this claim inaccurate -this would disrupt our efforts on promoting the Shroud.\n\n","date":"January 1, 2014 at 10:24 am","url":"https://shroudstory.com/2013/12/31/favorite-stupid-stupid-science-picture-for-2013/","cat":"science","id":"comment-70838","author":"O.K.","site":"shroudstory"},{"title":"Favorite Stupid, Stupid Science Picture for 2013","post":"The present status of the Vinland map is ambiguous. It seems there may be both authentic and suspect elements to it. Possibly the original had some kind of authentic basis, but was then dressed up to make it more impressive than the original discovery in an attempt to enhance its value.  \nNotwithstanding, McCrone clearly made specific, significant, and serious errors in his investigation, which a careful professional ought not to have made. These are identified in the wiki article.  His assertion that his work proved the map a forgery was widely publicised for the sole purpose of enhancing his reputation.  If the map is eventually discovered to be an out and out forgery, this verdict will owe very little to McCrone’s own investigation. \nHis work on the map was cited as authoritative credentials in the specious, stupid and arrogant verdict he delivered on the Shroud, which every other STURP scientist knew was patently incorrect.\n\n","date":"January 2, 2014 at 5:09 am","url":"https://shroudstory.com/2013/12/31/favorite-stupid-stupid-science-picture-for-2013/","cat":"science","id":"comment-71024","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Favorite Stupid, Stupid Science Picture for 2013","post":"“The evil that men do lives after them; the good is oft interred with their bones.” (Julius Caesar, Act 3 Scene 2)\nI’m often struck by the similarities between Walter McCrone and Max Frei-Sulzer, who are both still revered for their pioneering work among specialists in their fields, and both mocked to imbecility by one or other faction of the Shroud Crowd. I think the Shroud pushes ‘experts’, whether Scientific, Artistic, Textile or Historical, to the very edge of their competence, to the point where their individual personalities can dominate their technical findings. Some become arrogant and inflexible, others become reclusive and uninformative, and others fill the gamut between. Not a problem I have to cope with, fortunately, but I think it’s very difficult for an acknowledged expert to stand up boldly and say “I don’t know.”\n\n","date":"January 2, 2014 at 7:15 am","url":"https://shroudstory.com/2013/12/31/favorite-stupid-stupid-science-picture-for-2013/","cat":"science","id":"comment-71068","author":"Hugh Farey","site":"shroudstory"}]
