[{"title":"The Shroud of Turin is Number One on This List","post":"That’s a lovely, unbiased review stating the basic Facts regarding the Shroud. \nSometimes the barebones Truth is the best. And sometimes the barebones Truth is the hardest for people to accept.\n\n","date":"November 12, 2011 at 10:07 am","url":"https://shroudstory.com/2011/11/12/the-shroud-of-turin-is-number-one-on-this-list/","cat":"news_&_views","id":"comment-4754","author":"AnnieCee","site":"shroudstory"},{"title":"The Shroud of Turin is Number One on This List","post":"That is a very interesting article!! Fun to read.  I noticed a trend: it seems that things which cannot be explained are dismissed by “experts” as being a hoax.  Why is it so hard to just leave something as “unexplained.” Or “not confirmed.”  I enjoy the mystery. \nSome of those artifacts hint at extra-terrestial life. How fun is that??  I’m not someone who looks for UFO’s and I don’t collect books or belong to clubs. Not interested in getting silly about it… but I do think that if God wanted to put humanoid creatures on other planets He certainly could and can do whatever He wants to do.  It might explain why the planets are so unbelievably far apart: so we don’t corrupt other inhabited planets or influence them. I don’t think the human race would be good for any other “peoples” that might be out there. \nBut there’s no way of knowing what God might have done elsewhere. He’s not saying.\n\n","date":"November 12, 2011 at 1:46 pm","url":"https://shroudstory.com/2011/11/12/the-shroud-of-turin-is-number-one-on-this-list/","cat":"news_&_views","id":"comment-4758","author":"AnnieCee","site":"shroudstory"},{"title":"The Shroud of Turin is Number One on This List","post":"Actually, he stole that entire list from Toptenz.net. Thanks for mentioning it anyway. Can you remove the link to his site and place the link to the source site – http://www.toptenz.net/top-10-bizarre-archeological-discoveries.php – You can even see he left all the link to my site in the content when he swiped it.\n\n","date":"November 22, 2011 at 12:19 am","url":"https://shroudstory.com/2011/11/12/the-shroud-of-turin-is-number-one-on-this-list/","cat":"news_&_views","id":"comment-4920","author":"Toptenz","site":"shroudstory"},{"title":"The Shroud of Turin is Number One on This List","post":"Thanks, Dan. I appreciate you helping me deter content theft.\n\n","date":"November 26, 2011 at 2:38 pm","url":"https://shroudstory.com/2011/11/12/the-shroud-of-turin-is-number-one-on-this-list/","cat":"news_&_views","id":"comment-5035","author":"Toptenz","site":"shroudstory"}]
