[{"title":"Forget the improved translation. Rely on the KJV.","post":"And as Archbishop James Ussher of Armagh calculated in the 1650s, creation occurred on the evening of October 22, 4004 BC; And the creationists have it that men walked with dinosaurs!  You can calculate it all using just the Bible – scriptura sola!  Who needs rationality and science, when you can have revelation, for free?  Fanatacism knows no bounds and quite rightly(?) has no respect for merely human knowledge!  If the Bible says Black is White, then Black is White.  Mind you, St Paul says there are no longer Jews or Greeks!  None so blind, as those who will not see!\n\n","date":"August 12, 2012 at 6:52 am","url":"https://shroudstory.com/2012/08/12/forget-the-improved-translation-rely-on-the-kjv/","cat":"news_&_views","id":"comment-14821","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Forget the improved translation. Rely on the KJV.","post":"Some truth.  I think they need better biblical exegesis.  Let’s ignore the fact they are completely ignorant of any Shroud studies that have been done starting with Pia’s discovery.\nAgreed, daveb.\n\n","date":"August 12, 2012 at 9:21 am","url":"https://shroudstory.com/2012/08/12/forget-the-improved-translation-rely-on-the-kjv/","cat":"news_&_views","id":"comment-14828","author":"Andy Weiss","site":"shroudstory"},{"title":"Forget the improved translation. Rely on the KJV.","post":"Obviously the publication does not know enough about the Shroud.\nAs for the (KJV) Bible, I will quote the world-renowned biblical scholar Father Joseph A. Fitzmyer by saying ” it was not dropped from heaven in King James English.” He translated biblical texts in Aramaic, Hebrew, Syriac, Greek and Latin. \nThe publication also does not of course mention the Jerusalem Bible, originally produced by heavyweight scholars such as Father Roland de Vaux and his team at Jerusalem’s École Bíblique, the city´s oldest archaeological institution. These scholars  were experts in semitic languages, which can also be said about those there today, particularly Father Émile Puech. The latest Jerusalem Bible has Dom Henry Wansbrough (UK) as editor.\nBut, whatever the version, it is clear that no fundamentalist interpretation is possible today. Any learned Christian knows that Jesus did not interpret the OT like a fundamentalist…in those days.\n\n","date":"August 12, 2012 at 1:39 pm","url":"https://shroudstory.com/2012/08/12/forget-the-improved-translation-rely-on-the-kjv/","cat":"news_&_views","id":"comment-14831","author":"Louis","site":"shroudstory"},{"title":"Forget the improved translation. Rely on the KJV.","post":"Who said, “If the King James Bible was good enough for Jesus, It’s good enough for me?”\n\n","date":"August 12, 2012 at 2:25 pm","url":"https://shroudstory.com/2012/08/12/forget-the-improved-translation-rely-on-the-kjv/","cat":"news_&_views","id":"comment-14833","author":"Dan","site":"shroudstory"},{"title":"Forget the improved translation. Rely on the KJV.","post":"I don’t know, in fact I didn’t even know Jesus had read the KJV.\n\n","date":"August 12, 2012 at 6:24 pm","url":"https://shroudstory.com/2012/08/12/forget-the-improved-translation-rely-on-the-kjv/","cat":"news_&_views","id":"comment-14845","author":"Louis","site":"shroudstory"}]
