[{"title":"They don’t do it just for the credit card numbers","post":"You may want to consider USB drive.  You can get a 16GB for almost nothing which holds twice what a dual layer DVD does.\nI went on our site one day to do some updates and it was not there.  It was not a hacker, but the provider had performed server maintenance and inadvertently wiped out our site.  If I didn’t make some changes, it would have been operational again in the amount of time it takes to upload everything.  Offline backup is essential in this connected world.\n\n","date":"January 9, 2014 at 9:21 am","url":"https://shroudstory.com/2014/01/09/they-dont-do-it-just-for-the-credit-card-numbers/","cat":"uncategorized","id":"comment-72728","author":"Andy Weiss","site":"shroudstory"},{"title":"They don’t do it just for the credit card numbers","post":"Actually, this is something any of us can help with.  If you download an application like HTTrack, it’s easy to create your own, local mirror or backup of any website.  I have no idea how big the site is in bytes — after 18 years, probably very big — but assuming a decent broadband connection, you could have your own backup of the site within a few hours..  Thus, if the site were to go down or be compromised, you’d be able to help get it back up pronto.  You could even set up a recurring, incremental backup that periodically scans the site for updates and downloads just those.\nOn a related note, don’t discount the value of cloud storage — not as a replacement for physical media but a supplement.  Dropbox, box.com, SkyDrive, Google Docs, etc. all allow you to store huge amounts of data for free.  Even the paid accounts which offer storage into the terrabytes are fairly reasonable.  They’re also excellent for files you want to share with others or make publicly available.\nFinally, once a ‘canonical’ backup of the site exists, it would probably be good to set it up for distribution as a torrent, as is explained here: http://www.sidewalkcrusaders.com/bthowto/btstart.html\nNow I’m really getting carried away, so I’ll stop there.  I’ve got to run to an IT meeting anyway (I know, big surprise.)\n\n","date":"January 9, 2014 at 11:38 am","url":"https://shroudstory.com/2014/01/09/they-dont-do-it-just-for-the-credit-card-numbers/","cat":"uncategorized","id":"comment-72741","author":"Jeffrey Liss","site":"shroudstory"},{"title":"They don’t do it just for the credit card numbers","post":"The hackers are getting more and more subtle and aggressive. Despite the good security on my own home PC, I’ve had two serious infections over the last year, one during a visit to the “JesusisKing” site. Blog sites, including WordPress sites, are favourite phishing targets for email addresses. The scammers are changing their malware signatures every few hours, and it is near impossible for the antivirus and security houses to keep abreast of the play. Keep your own security well up to date, and often.  And if you get a ‘phone call from some plausible person claiming that your PC security is under threat but they will fix it for you, give them the bum’s rush! It’s just another scam!\n\n","date":"January 9, 2014 at 3:41 pm","url":"https://shroudstory.com/2014/01/09/they-dont-do-it-just-for-the-credit-card-numbers/","cat":"uncategorized","id":"comment-72780","author":"daveb of wellington nz","site":"shroudstory"},{"title":"They don’t do it just for the credit card numbers","post":"Yes, I can guess that you have to do something to maintain the integrity for your site.  It is a shame that there are evil atheists or non-believers who feel that they have to so something to stop anything that  speaks of God.  I guess that stopping the promulgation of Shroud material is a double hit. I have no suggestions as to anything you can do in addition to what you are  doing mow though..\n\n","date":"January 9, 2014 at 4:02 pm","url":"https://shroudstory.com/2014/01/09/they-dont-do-it-just-for-the-credit-card-numbers/","cat":"uncategorized","id":"comment-72784","author":"Emmett McMahon","site":"shroudstory"},{"title":"They don’t do it just for the credit card numbers","post":"I have heard from many people on this subject today. I think the systems in question are secure. In particular, I have heard from Barrie. He’s on top of the situation, I’m convinced of that, and there is nothing to be gained from detailing how and what he does. \nAs for my blog, the one attempt I know of was a failed repetitive attempt to log in. Dual authentication now makes this nearly impossible. Even with my password, the hacker needs my physical cell phone and a bar code to log in. I am quite comfortable with it. I back up incrementally without images frequently. With images, I do so once a month and mail the backup  DVD to a post office box where I keep three monthly cycles.\n\n","date":"January 9, 2014 at 7:56 pm","url":"https://shroudstory.com/2014/01/09/they-dont-do-it-just-for-the-credit-card-numbers/","cat":"uncategorized","id":"comment-72810","author":"Dan","site":"shroudstory"}]
