[{"title":"Fra Giovanni Angelico’s ‘Lamentation’ to be Displayed with the Shroud","post":"I know the Convent of San Marco well as it is one of my favourite places in Florence.  As you climb the stair you are greeted with a lovely Annunciation at the top  by Fra Angelico and then you go round the cells in each of which there is another fresco by Fra Angelico who was a monk there. So it is good to see that the convent is lending out one of his works.\nI would,however, be intrigued to know on what basis ‘experts’ consider that Fra Angelico saw the Turin Shroud. There is no record that he ever travelled outside Italy and at this period the Shroud was still in the possession of the de Charny family in France. His iconography of the laying out of Christ is conventional for medieval western art  in that Christ is being laid out on a single sheet with no images and the body on the Shroud has nothing to suggest the markings of the Shroud. So a bit of a mystery here unless we can find the ‘experts’ to explain their view.\n\n","date":"April 15, 2015 at 5:22 am","url":"https://shroudstory.com/2015/04/15/fra-giovanni-angelicos-lamentation-to-be-displayed-with-the-shroud/","cat":"2010","id":"comment-196383","author":"Charles Freeman","site":"shroudstory"},{"title":"Fra Giovanni Angelico’s ‘Lamentation’ to be Displayed with the Shroud","post":"I know the Convent of San Marco well as it is one of my favourite places in Florence. Fra Angelico was a monk there and painted frescos in each of the cells. So it is great that they are lending out one of his paintings for the exposition.\nHowever, I would be intrigued to know on what basis ‘experts’ consider that Fra Angelico saw the Shroud. There is no record that he ever left Italy and at this time the Shroud was still in France in the possession of Margaret de Charny. Moreover, Fra Angelico follows convention in showing Christ being laid out on a single sheet with no images on it. The marks on Christ’s body correspond in no way with those on the Shroud- there are no flagellation makes on the front of the body, for instance. So I look forward to hearing the ‘experts’ case on this one.\n\n","date":"April 15, 2015 at 5:28 am","url":"https://shroudstory.com/2015/04/15/fra-giovanni-angelicos-lamentation-to-be-displayed-with-the-shroud/","cat":"2010","id":"comment-196384","author":"Charles Freeman","site":"shroudstory"},{"title":"Fra Giovanni Angelico’s ‘Lamentation’ to be Displayed with the Shroud","post":"Sorry, the first comment did not get through but it has now! Forgive the repetition!\n\n","date":"April 15, 2015 at 5:29 am","url":"https://shroudstory.com/2015/04/15/fra-giovanni-angelicos-lamentation-to-be-displayed-with-the-shroud/","cat":"2010","id":"comment-196385","author":"Charles Freeman","site":"shroudstory"},{"title":"Fra Giovanni Angelico’s ‘Lamentation’ to be Displayed with the Shroud","post":"Interesting. The magic of WikiArt allows us to scroll through all Fra Angelico’s paintings chronologically. The lamentation appears in the middle, dated around 1441. The shroud is diaphanous and semi-transparent, which does not suggest that he was familiar with it, but the Body of Christ is covered with criss-cross marks, which are reminiscent of the Shroud. Another lamentation, painted ten years later, also shows these criss-crosses, although the Shroud is not transparent. Before, between and after these paintings Fra Angelico painted a couple of dozen figures of Christ, on the cross and off it, and there are very few consistent elements. The criss-crosses may be present or not, blood from the side-wound may be spurting or a mere dribble, and the length of beard and style of moustache is variable. The hands are invariably nailed through the palms, from which blood dribbles down the underside of the arms as well as straight off, and the feet fastened with one nail, and Christ wears a crown of thorns. To what extent this all indicates familiarity with the Shroud of Chambery, I couldn’t say, but what seems clear is that even if he had seen it, Fra Angelico did not consider it such a definitive portrait that he couldn’t produce marked diversion from it if he wanted.\n\n","date":"April 15, 2015 at 6:44 am","url":"https://shroudstory.com/2015/04/15/fra-giovanni-angelicos-lamentation-to-be-displayed-with-the-shroud/","cat":"2010","id":"comment-196389","author":"Hugh Farey","site":"shroudstory"},{"title":"Fra Giovanni Angelico’s ‘Lamentation’ to be Displayed with the Shroud","post":"Note that this Angelico “shroud” is shown at the foot of the Cross. It has been theorized by many that there was a sheet of some kind used at the Cross to lay His body down on, and used as well to transport Him to the tomb  — which of course could not have been The Shroud used in the Tomb.  This other sheet would have been greatly smeared by blood in the process, and could not have been the same sheet as The Shroud.  Therefore, Angelico did not have to have been trying to portray The Shroud.\n\n","date":"April 15, 2015 at 7:50 am","url":"https://shroudstory.com/2015/04/15/fra-giovanni-angelicos-lamentation-to-be-displayed-with-the-shroud/","cat":"2010","id":"comment-196401","author":"Nabber","site":"shroudstory"},{"title":"Fra Giovanni Angelico’s ‘Lamentation’ to be Displayed with the Shroud","post":"The 1440s were just the time when Margaret de Charny was in dispute with the canons at Lirey over ownership of the Shroud and in 1449 the bishop of Liege refused to accept that it was authentic when she tried to display it . So it is unlikely that the devout Beato Angelico would have paid any special attention to it even if we did have any evidence that he was ever in France. Other than the pilgrimage badge, I don’t know of any artist copying the Shroud  (e.g. size, double image) until the sixteenth century.\nStill,  let’s enjoy the Lamentation as a great extra for those visiting the Shroud. No need to try and link the two but I would still like to hear why ‘experts’ think that there is a link. There are many examples of all-over scourge marks, squiggles of blood on the forehead, blood along the arms from after 1300 and a single sheet for the burial, so no signs that Beato Angelico is operating outside the artistic conventions of his time.\n\n","date":"April 15, 2015 at 9:25 am","url":"https://shroudstory.com/2015/04/15/fra-giovanni-angelicos-lamentation-to-be-displayed-with-the-shroud/","cat":"2010","id":"comment-196411","author":"Charles Freeman","site":"shroudstory"},{"title":"Fra Giovanni Angelico’s ‘Lamentation’ to be Displayed with the Shroud","post":"As I said, Charles, there is no way the Shroud was at the foot of the Cross.\n\n","date":"April 16, 2015 at 8:51 am","url":"https://shroudstory.com/2015/04/15/fra-giovanni-angelicos-lamentation-to-be-displayed-with-the-shroud/","cat":"2010","id":"comment-196514","author":"Nabber","site":"shroudstory"},{"title":"Fra Giovanni Angelico’s ‘Lamentation’ to be Displayed with the Shroud","post":"So, Nabber,  for once, we are in total agreement: that this is not the Shroud. Still interested to know why ‘experts’ think that Beato Angelico had seen it.\n\n","date":"April 16, 2015 at 8:57 am","url":"https://shroudstory.com/2015/04/15/fra-giovanni-angelicos-lamentation-to-be-displayed-with-the-shroud/","cat":"2010","id":"comment-196515","author":"Charles Freeman","site":"shroudstory"},{"title":"Fra Giovanni Angelico’s ‘Lamentation’ to be Displayed with the Shroud","post":"Curious that all the paintings which indisputably show the double-imaged shroud, with angels floating about above (and all attributed to della Rovere in spite of different styles), invariably show it at the foot of the cross. The presence of the cross by itself certainly does not disqualify a cloth from being the Shroud. This maybe because the Shroud of Chembery/Turin was often differentiated from the Shroud of Besançon by supposing they were both authentic but used at different times. Besançon took priority as the burial cloth, so Chambery was relegated to the carrying ‘stretcher.’\n\n","date":"April 16, 2015 at 9:16 am","url":"https://shroudstory.com/2015/04/15/fra-giovanni-angelicos-lamentation-to-be-displayed-with-the-shroud/","cat":"2010","id":"comment-196517","author":"Hugh Farey","site":"shroudstory"},{"title":"Fra Giovanni Angelico’s ‘Lamentation’ to be Displayed with the Shroud","post":"Hugh, a past artist showing the Cross (or not), they probably were not engaged at all in any discussion over the existence of one/multiple shrouds, as we are today.  I’m  just making the point that a “carrying stretcher” -type shroud would have been quite smeared with blood and therefore could not have been the Shroud of the Tomb.  It seems to me that we in retrospect should not be wondering about why this particular representation has so little similarity to the SoT.\n\n","date":"April 17, 2015 at 7:49 am","url":"https://shroudstory.com/2015/04/15/fra-giovanni-angelicos-lamentation-to-be-displayed-with-the-shroud/","cat":"2010","id":"comment-196625","author":"Nabber","site":"shroudstory"},{"title":"Fra Giovanni Angelico’s ‘Lamentation’ to be Displayed with the Shroud","post":"“A “carrying stretcher” -type shroud would have been quite smeared with blood and therefore could not have been the Shroud of the Tomb.” I agree, absolutely. However, given that both Shrouds (Turin and Besançon) were often considered, together, authentic and miraculous until almost the 20th century, that was the explanation given. A similar attempt to reconcile the unreconcilable is given at http://www.sudariumchristi.com/uk/tomb/byssus.htm.\n\n","date":"April 17, 2015 at 10:35 am","url":"https://shroudstory.com/2015/04/15/fra-giovanni-angelicos-lamentation-to-be-displayed-with-the-shroud/","cat":"2010","id":"comment-196636","author":"Hugh Farey","site":"shroudstory"},{"title":"Fra Giovanni Angelico’s ‘Lamentation’ to be Displayed with the Shroud","post":"I think the answer is much more simple.\nSee John 19:41-42:  “41 Now in the place where he had been crucified there was a garden, and in the garden a new tomb, in which no one had yet been buried. 42 So they laid Jesus there because of the Jewish preparation day; for the tomb was close by.”  \nSo the artist simply puts the two ideas together, the two places close together, nearby, place of crucifixion (foot of the cross) and the laying out.  It has nothing to do with two separate shrouds, one for transport.\n\n","date":"April 17, 2015 at 3:12 pm","url":"https://shroudstory.com/2015/04/15/fra-giovanni-angelicos-lamentation-to-be-displayed-with-the-shroud/","cat":"2010","id":"comment-196645","author":"daveb of wellington nz","site":"shroudstory"}]
