[{"title":"Another Go-To Place on the Web to Explore the Shroud’s Image","post":"“If you want really high definition you will need to use Shroud 2.0 from which the following image of the epsilon bloodstain was taken in my iPhone. “\nWhy is it that each time I see a Shroud 2.0 image, courtesy of someone else’s iPad or iPhone, in this case Dan’s, the field of view quickly becomes obscured with a drifting mirage like-object that bears an uncanny resemblance to a chocolate teapot? Might it be something to do with utility, or rather lack thereof? Why is there scarcely any useful information content in those 2.0 images? Think I exaggerate? OK. Then increase the magnification of the 2.0 blood image above, all the while comparing with any of the higher magnification Mark Evans blood images (admittedly there’s not one of the epsilon for total like-for-like comparison). The 2.0 image above simply becomes pixel soup, and at no stage gives the slightest hint of the wealth of detail in a typical Evans photomicrograph in which blood appears highly heterogeneous – an array of thinly scattered dense dark red patches against a diffuse pink background (which still requires explanation).\nThe same goes for body image, for much the same reason. There’s scarcely any differentiation between body image and non-image regions. Sure, one can obtain it, whether ‘valid’ or not, by uploading images into a photoediting program, and playing around with contrast, brightness and midtone values. But that sort of thing is best suited to a PC. Shroud 2,0, for reasons best known to Halta Definizione licensees and the Shroud’s owners is not directly downloadable to laptops, being targeted at a (let’s not mince our words) gimmicky app-captivated market needing credit card or PayPal, Google Wallet, other Big Brotherish details. Maybe it’s more about building customer databases for future targeting? Who knows? The internet and its site-recording cookies gets nosier and more intrusive with each passing day…\nPersonally I’d prefer to invest in a chocolate teapot. It may be lacking somewhat in essential functionality, but at least when new and shiny it’s nice to look at.\n\n","date":"January 12, 2015 at 4:55 am","url":"https://shroudstory.com/2015/01/11/another-go-to-place-on-the-web-to-explore-the-shrouds-image/","cat":"tools","id":"comment-182765","author":"Colin Berry","site":"shroudstory"}]
