[{"title":"Future Testing of the Shroud","post":"Unfortunately I have not yet heard the words of Jackson …\n I want someone who has seen the movie and then drop us a useful message (a contribution to our discussion).\n— —\nSo…\nWhich will be the winning novel methodology ?\nWhat will be the new winning technology?\n— —\nI believe that Raman controls of 2002 should have been displayed.\nInstead… What happened in Turin?\nWhy there have never been shown that data?\n— —\nHere what says the inventor of the AFM, Christoph Gerber :\n“My research has been focused on nanomechanics ever\nsince we first developed the AFM more than 25 years ago…”\nLink:\nhttp://nanotechweb.org/cws/article/multimedia/59653\n\n","date":"December 16, 2014 at 8:59 am","url":"https://shroudstory.com/2014/12/16/future-testing-of-the-shroud/","cat":"science","id":"comment-176948","author":"piero","site":"shroudstory"},{"title":"Future Testing of the Shroud","post":"Atomic force microscopy (AFM) can be used to image in real-time\nthe structural changes of treated samples.\nand\nI have read that:\n>the molecular volume of the protein particles can be determined\nfrom particle dimensions derived from AFM images.\nThen…\nI think it’s possible the following fact:\n>the molecular volume of the cellulosic chains can be determined\nfrom chain dimensions derived from AFM images…\nThus the degree of polymerization will be determined via AFM…\nin order to know the age (epoch) of the material.\n\n","date":"December 16, 2014 at 9:19 am","url":"https://shroudstory.com/2014/12/16/future-testing-of-the-shroud/","cat":"science","id":"comment-176954","author":"piero","site":"shroudstory"},{"title":"Future Testing of the Shroud","post":"Here’s something similar that is even more attention-grabbing:","date":"December 17, 2014 at 4:15 am","url":"https://shroudstory.com/2014/12/16/future-testing-of-the-shroud/","cat":"science","id":"comment-177209","author":"Colin Berry","site":"shroudstory"},{"title":"Future Testing of the Shroud","post":"PS: The resemblance is uncanny: pre-dried paint in my video, with nothing more to see; pre-researched TS in the so-called discussion, with nothing more to research or discuss.\n\n","date":"December 17, 2014 at 4:30 am","url":"https://shroudstory.com/2014/12/16/future-testing-of-the-shroud/","cat":"science","id":"comment-177212","author":"Colin Berry","site":"shroudstory"},{"title":"Future Testing of the Shroud","post":":)\n\n","date":"December 17, 2014 at 5:21 am","url":"https://shroudstory.com/2014/12/16/future-testing-of-the-shroud/","cat":"science","id":"comment-177216","author":"Dan","site":"shroudstory"},{"title":"Future Testing of the Shroud","post":"I have just forced myself to watch the above from start to finish, and frankly I agree with Colin. There were vanishingly few suggestions for the Future Testing of the Shroud, and a general feeling of ignorance and incompetence in the face of “authorities”. Had the meeting been of a crowd of UFO enthusiasts planning to submit a proposal to the US Air Force about Roswell it could not have appeared woollier.\nThere were suggestions for:\n – A comparative investigationI of the DNA of the Shroud and various other relics such as the Sudarium and the Holy Coat.\n– A complete, detailed, multi-spectral record of the Shroud in case the artifact itself should be lost to posterity by losing contrast and disappearing, or by physical destruction.\n– More thorough investigations into Rogers’s vanillin hypothesis and Fanti’s mechanical degradation experiments.\n– An investigation into the effects Thymol has on radiocarbon dating.\n– An examination of part of the remaining piece of C14 sample (and the rest of the Shroud) for other isotopes associated with neutron absorption.\nThe atmosphere was, I thought, rather constrained by the eminence of John Jackson, and needed the element of slightly wacky excitement and innovation that seems to have been the hallmark of the Albuquerque conference that preceded the STuRP investigation.\nThere were no suggestions for an examination by archaeologists, pathologists, artists, or historians, which was a pity. Although there was a brief reference to the Mona Lisa, there was no hint that the kind of teams that worked on the Mona Lisa, or the Last Supper, or even the Cistine Chapel conservation might have anything to offer, nor, for that matter, the people working on Utzi the iceman, various Egyptian mummies or the eruption of Vesuvius, who have built up a huge expertise on ancient fabrics.\n\n","date":"December 17, 2014 at 6:11 am","url":"https://shroudstory.com/2014/12/16/future-testing-of-the-shroud/","cat":"science","id":"comment-177222","author":"Hugh Farey","site":"shroudstory"},{"title":"Future Testing of the Shroud","post":"“Had the meeting been of a crowd of UFO enthusiasts planning to submit a proposal to the US Air Force about Roswell it could not have appeared woollier.”\nAt least you understand why the Shroud has been not been subjected to further testing…\n\n","date":"December 17, 2014 at 2:48 pm","url":"https://shroudstory.com/2014/12/16/future-testing-of-the-shroud/","cat":"science","id":"comment-177316","author":"anoxie","site":"shroudstory"},{"title":"Future Testing of the Shroud","post":"Compare a meeting on the Shroud a strange gathering of\n“UFO fanatics” (I once went up to San Marino to follow\nan UFO conference…) seems a bit ‘too irreverent.\nAm I wrong in my criticism of this message sent by Hugh?\nBarberis is the director of CIS of Turin and certainly should\nnot be an amateur scientist …\nSo … what is your reply?\nIn order to clarify … I add that I have not been able to hear what were the words spoken during the meeting.\nSo: are just so much difficult to realize the tests with the use of the techniques SPM (which I have emphasized so much)?\nThe mechanical degradation experiments can be improved with the use of AFM.\n See also: the AFM three-point bending test, etc.\n What do you think about this vague note about the use of AFM?\n\n","date":"December 18, 2014 at 4:57 am","url":"https://shroudstory.com/2014/12/16/future-testing-of-the-shroud/","cat":"science","id":"comment-177489","author":"piero","site":"shroudstory"},{"title":"Future Testing of the Shroud","post":"Indeed, the participants at the conference included some of the greatest names in Shroud research; John Jackson, Bruno Barberis, Barrie Schwortz and so on, and no one can doubt their credentials, but the whole atmosphere was one of vagueness and imprecision. I dare say nearly everybody there was exhausted after the rigours of the day, which is quite understandable, but as a Future Testing of the Shroud forum it lacked direction, incisiveness and sparkle.\nAs for the AFM thing; I’m afraid I don’t know enough about it to be able to comment. It seems quite a small machine, so could you place it over the Shroud and scan the entire surface? Or would you choose selected sites? What, specifically, could it tell us? I have read all your notes about it with interest, but still don’t really know how it might help.\n\n","date":"December 18, 2014 at 5:56 am","url":"https://shroudstory.com/2014/12/16/future-testing-of-the-shroud/","cat":"science","id":"comment-177498","author":"Hugh Farey","site":"shroudstory"},{"title":"Future Testing of the Shroud","post":"I believe it would be important to be able to select the material (for example: the fibrils that were far from fire damage in 1532 …) if we want to know the real age of that Ancient Linen Sheet.\nIt would be nice to be able to do the mapping of the entire linen sheet, but I think this is just a utopia, far from reality…  In any case, the SPM mapping [= obtained with the use of AFM techniques] of certain areas (to be able to derive a set of data that give us hope of known what is the true age of the material) would be a very useful thing.\n— —\nAnother thing that I consider as feasible is the comparison with the results from the future SPM mapping for Sudarium of Oviedo.\nI have at hand an “old book” by Mark Guscin (“The Oviedo Cloth”), published in 1998. This book has been translated into Italian language only in 2007! …\nSo you should go and see the strange stories:\n… Mario Moroni, Jodi Barnhill (Arizona Univ.), Paul Damon, Timothy Jull, etc. …\nSo I believe that a comparison with the methods SPM (= control systems nondestructive) would be very helpful!\nWhat is your opinion?\n\n","date":"December 28, 2014 at 10:44 am","url":"https://shroudstory.com/2014/12/16/future-testing-of-the-shroud/","cat":"science","id":"comment-179623","author":"piero","site":"shroudstory"},{"title":"Future Testing of the Shroud","post":"Hi Piero, I’m still not clear. How can an AFM scan reveal the age of a textile?\n\n","date":"December 29, 2014 at 7:07 am","url":"https://shroudstory.com/2014/12/16/future-testing-of-the-shroud/","cat":"science","id":"comment-179786","author":"Hugh Farey","site":"shroudstory"},{"title":"Future Testing of the Shroud","post":"The core problem with the C14 test is the apparent non-uniformity of the results: Oxford old, Tucson young, Zürich in between. The age seems to be a function of where along  the sample strip  the measurement was done. Is this anomaly for real or is it a statistical fluke? The remaining parts of the sample should be used in order to answer this crucial question. After all, these samples were given to the laboratories for C14 testing. This material was not cut  from the Shroud to be filed away at the back of some drawer.\n\n","date":"December 17, 2014 at 5:12 pm","url":"https://shroudstory.com/2014/12/16/future-testing-of-the-shroud/","cat":"science","id":"comment-177348","author":"Jos verhulst","site":"shroudstory"},{"title":"Future Testing of the Shroud","post":"Jos, a bit of the sample taken in 1988 was retained for the purpose of “future work” by Arizona:\nhttps://shroudstory.com/2013/05/05/the-arizona-samples-of-the-shroud-of-turin/\n\n","date":"December 29, 2014 at 4:32 pm","url":"https://shroudstory.com/2014/12/16/future-testing-of-the-shroud/","cat":"science","id":"comment-179852","author":"Louis","site":"shroudstory"}]
