[{"title":"Giorgio Bracaglia over at the Holy Shroud Guild wants your help","post":"I did it!\nFunny.\nI could comment my own answers but I don’t want to have an influence on whoever.\nI encourage you to participate.\nDear Giorgio, are you yourself this student?\n\n","date":"December 20, 2014 at 1:46 pm","url":"https://shroudstory.com/2014/12/20/giorgio-bracaglia-over-at-the-holy-shroud-guild-wants-your-help/","cat":"other_sites","id":"comment-178020","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Giorgio Bracaglia over at the Holy Shroud Guild wants your help","post":"Yes I’m the old man who’s back to school to see if my pick up lines still work. Sad to say, I need new material with these young ladies.  Plus it’s much harder to work the field when you wear a wedding ring.  Lol. Thibault I’m glad you enjoyed it, hopefully when I’m finished with this assignment I can say the same thing.    I’ll let you know the results by the end of February. It will be uploaded.\n\n","date":"December 20, 2014 at 2:53 pm","url":"https://shroudstory.com/2014/12/20/giorgio-bracaglia-over-at-the-holy-shroud-guild-wants-your-help/","cat":"other_sites","id":"comment-178032","author":"Giorgio HSG","site":"shroudstory"},{"title":"Giorgio Bracaglia over at the Holy Shroud Guild wants your help","post":"I like your humor!\nHappy Christmas my friend.\nThibault.\n\n","date":"December 20, 2014 at 3:09 pm","url":"https://shroudstory.com/2014/12/20/giorgio-bracaglia-over-at-the-holy-shroud-guild-wants-your-help/","cat":"other_sites","id":"comment-178034","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Giorgio Bracaglia over at the Holy Shroud Guild wants your help","post":"Merry Christmas Thibault.\n\n","date":"December 20, 2014 at 4:07 pm","url":"https://shroudstory.com/2014/12/20/giorgio-bracaglia-over-at-the-holy-shroud-guild-wants-your-help/","cat":"other_sites","id":"comment-178043","author":"Giorgio HSG","site":"shroudstory"},{"title":"Giorgio Bracaglia over at the Holy Shroud Guild wants your help","post":"Hello Giorgio.\nI have some questions about your questionnaire.\nFirst, it seems that one person is able to fill it multiple times.\nSecond, when coming to part two, about Rogers’ Thermochimica Acta paper, there is such question:\nThere are clear evidences that the threads excised for the radio carbon data was representative to the cloth\nHow should we understand that question? Obviously, according to Rogers findings they were non-representative to the original Shroud, and thus 1988 carbon-dating results are invalid. But this does not mean that they were not excised from the original Shroud of Turin. Simply they were part of rewoven corner area -and the same applies to the Raes sample. That explains purported anomalies (starch, Z-spun of one thread and so on) -there is no need to assume that the samples was swapped or faked by some unidentified forces. \nAs we can see even in mid-80s there were clear suspicions that this corner is non-original -nevertheless they took a sample for 1988 carbon-dating form there.\nAnd other thing, Giorgio, that I would like to ask.\nIs there any chance to obtain Proceedings of the 1977 United States Conference of research on the Shroud of Turin, Albuquerque 1977, Holy Shroud Guild, New York 1977,/I> ?\n\n","date":"December 21, 2014 at 5:27 am","url":"https://shroudstory.com/2014/12/20/giorgio-bracaglia-over-at-the-holy-shroud-guild-wants-your-help/","cat":"other_sites","id":"comment-178153","author":"O.K.","site":"shroudstory"},{"title":"Giorgio Bracaglia over at the Holy Shroud Guild wants your help","post":"Hello O.K.  I guess the best answer I can give you comes from this sentence from the readings, “In 2000, Rogers received reports from a long time Sindonologist researchers, Joe Marino and Sue Bedford. They hypothesized that the radiocarbon dating were not from threads excised from the main body of the Shroud, but rather from a location contaminated with dye cotton used in the restoration of the Shroud”.\nI also have to point out there will be limitations to the data collected based on language barriers, and load questions that the controlled group who approved the wording may have overlooked.\nYou are correct about double entries however, when I tally the responses I am able to sort duplicate IP address and eliminate any duplication. Of course that has to be mentioned in the limitation section of the research since the duplicate responses may have come from 2 members or more from the same household, or the second response had different answers to the questions. \nAs far ar the 1977, Albuquerque procedures I know I do have that in archives. If I have already scanned them I can certainly upload them on the HSG site where you can retrieve it. However, if it is not scanned, you’ll have to give me time (March) before I will have time. I’ll let you know some time next week of the status.\n\n","date":"December 21, 2014 at 8:39 am","url":"https://shroudstory.com/2014/12/20/giorgio-bracaglia-over-at-the-holy-shroud-guild-wants-your-help/","cat":"other_sites","id":"comment-178177","author":"Giorgio HSG","site":"shroudstory"},{"title":"Giorgio Bracaglia over at the Holy Shroud Guild wants your help","post":"Thanks Giorgio.\n\n","date":"December 21, 2014 at 9:04 am","url":"https://shroudstory.com/2014/12/20/giorgio-bracaglia-over-at-the-holy-shroud-guild-wants-your-help/","cat":"other_sites","id":"comment-178181","author":"O.K.","site":"shroudstory"},{"title":"Giorgio Bracaglia over at the Holy Shroud Guild wants your help","post":"Since Christmas greetings are part of the comments, I thought it worthwhile also commenting on a nice article on the three “kings” by Father Dwight Longenecker on OSV:\nhttps://www.osv.com/Magazines/TheCatholicAnswer/Article/TabId/652/ArtMID/13618/ArticleID/16131/%E2%80%9CWe-Three-Kings%E2%80%9D.aspx\nOne problem is that the priest restricts his approach to Persian (Zoroastrian) sources. The great Spanish Jesuit archaeologist and historian Father Henry Heras, who spent forty years digging up India’s past, in fact deciphered the Indus Valley Civilisation script, found people in Western India bringing gold and frankincense as gifts for newborn babies. He speculated about the possibility of the three “kings” from India, where also astrology is widely used:\nhttps://www.manresa-sj.org/stamps/1_Heras.htm\nWishing everyone a blessed Christmas.\n\n","date":"December 21, 2014 at 9:20 am","url":"https://shroudstory.com/2014/12/20/giorgio-bracaglia-over-at-the-holy-shroud-guild-wants-your-help/","cat":"other_sites","id":"comment-178184","author":"Louis","site":"shroudstory"},{"title":"Giorgio Bracaglia over at the Holy Shroud Guild wants your help","post":"Thank you Louis,  Merry Christmas to you too.\n\n","date":"December 21, 2014 at 9:34 am","url":"https://shroudstory.com/2014/12/20/giorgio-bracaglia-over-at-the-holy-shroud-guild-wants-your-help/","cat":"other_sites","id":"comment-178187","author":"Giorgio HSG","site":"shroudstory"},{"title":"Giorgio Bracaglia over at the Holy Shroud Guild wants your help","post":"Nothing to thank me for, Giorgio. I hope the survey helps you in your endeavours.\n\n","date":"December 21, 2014 at 9:42 am","url":"https://shroudstory.com/2014/12/20/giorgio-bracaglia-over-at-the-holy-shroud-guild-wants-your-help/","cat":"other_sites","id":"comment-178189","author":"Louis","site":"shroudstory"},{"title":"Giorgio Bracaglia over at the Holy Shroud Guild wants your help","post":"Having done work in getting students to asses material and arguments critically, with appropriate material developed to help them, It does not seem that there is sufficient evidence to make valid judgements in the questionnaire so I am not sure how any serious findings on cognitive responses are going to come out of it.\nHow is the sample selected? Where is it being advertised other than here and the Holy Shroud Guild website. Is it specifically a survey of readers of these sites and, if so why?\nI cannot imagine anyone who does not know the Rogers’ paper and the background to it in considerably more detail than provided here would be able to make head or tail of the issue in Part Two.\nPerhaps someone can tell me where peer review comes in- are the respondents to the questionnaire  the peers? Is it a judgement of whether Rogers was right in believing that he had representative samples ( or unrepresentative samples) – yes ,there is a lot of confusion here. If this had been one my students compiling a similar survey, I would certainly have expected a lot more clarity about its purpose and how the limited number of questions related to COGNITIVE responses. The intelligent response in most cases would simply be ‘ not enough evidence to be able to make an assessment’ and this is hardly helpful to the questionnaire.\n\n","date":"December 21, 2014 at 10:47 am","url":"https://shroudstory.com/2014/12/20/giorgio-bracaglia-over-at-the-holy-shroud-guild-wants-your-help/","cat":"other_sites","id":"comment-178205","author":"Charles Freeman","site":"shroudstory"},{"title":"Giorgio Bracaglia over at the Holy Shroud Guild wants your help","post":"Charles, look at the assignment as nothing more than a prosecutor’s brief and answer according the readings as instructed. As far as cognitive research, there are so many empirical data already, my findings are so irrelevant to any conclusion. However, what is relevant for this course is to prepare me for using the right statical analysis and approach in my business research paper.\n\n","date":"December 21, 2014 at 11:14 am","url":"https://shroudstory.com/2014/12/20/giorgio-bracaglia-over-at-the-holy-shroud-guild-wants-your-help/","cat":"other_sites","id":"comment-178211","author":"Giorgio HSG","site":"shroudstory"},{"title":"Giorgio Bracaglia over at the Holy Shroud Guild wants your help","post":"Good luck with it and I hope the results provide you with the help you need.\n\n","date":"December 22, 2014 at 3:13 am","url":"https://shroudstory.com/2014/12/20/giorgio-bracaglia-over-at-the-holy-shroud-guild-wants-your-help/","cat":"other_sites","id":"comment-178356","author":"Charles Freeman","site":"shroudstory"},{"title":"Giorgio Bracaglia over at the Holy Shroud Guild wants your help","post":"Thank you Charles.\n\n","date":"December 22, 2014 at 9:00 am","url":"https://shroudstory.com/2014/12/20/giorgio-bracaglia-over-at-the-holy-shroud-guild-wants-your-help/","cat":"other_sites","id":"comment-178397","author":"Giorgio HSG","site":"shroudstory"}]
