[{"title":"God only knows if these relics are truly what they claim to be","post":"I’ve mentioned some of these relics earlier this year on this site.  Quite a good source to read is “The Quest For The True Cross”:  Carsten Peter Thiede and Matthew D’Ancona; Weidenfeld & Nicolson, 2000, though now a little dated.  At the time of publishing, the University of Arizona had yet to do its carbon dating of the titulus in 2002.  You can of course Google to Wikipedia on “Titulus Crucis” for a summary. \nSanta Croce in Gerusalemme was built by St Helena on the site of her former palace in 325 AD, and after scavenging the Holy Land for relics of Christ’s Passion and Crucifixion, she relocated several of them here, although she distributed some to other locations as well.  Many of the original authentic relics definitely existed.  At the time of Egeria’s visit the “title” was shown as one of the relics at Jerusalem in 383: “A silver-gilt casket is brought in which is the holy wood of the Cross. The casket is opened and (the wood) is taken out, and both the wood of the Cross and the title are placed upon the table.”  \nFragments of the True Cross were dispersed throughout Christendom, the main portion of the Vera Crux was held in the custody of the Bishop of Jerusalem whence it was captured and recaptured.  Eventually the Crusader kings took up the practice of carrying it into battle as a talismanic weapon.  It finally disappeared in 1187 on the field of Hattin in Galilee in the Frankish battle with the sultan Saladin.  It was last seen tied to the tail of Saladin’s horse as he dragged it through the streets of Damascus as a trophy of his triumph.  \nIn view of the imperial court’s seizure of all these relics, as part of an exercise in enhancing its own authority and reputation, it is hardly surprising that such a relic as the Shroud, in whatever form it may then have been kept, remained hidden from them.  This acquisitive imperial streak of course continued with the Byzantine general John Curcuas, when he took under threat of force, the Image of Edessa, whatever that may have been. \nThe original Titulus Crucis was hidden around 452 during an attack on Rome by Visigoths and forgotten until 1492, when it was said to have been rediscovered by workmen restoring a mosaic, and was found behind a brick inscribed with “Titulus Crucis”.  In view of these dates, it is curious that the Arizona carbon dating asserted that the present artifact was made between 980 AD and 1146 AD.  If the dating is correct, the only explanation must be that it was intended as a replica of the original, but then why wait until 1492 to announce its rediscovery?  Possibly it was some kind of closely guarded secret know only to a select few sacristans??  \nDespite the Arizona dating, D’Ancona and Thiede seem to make a very plausible case for the relic, and if it is indeed a replica, then very likely it is a close imitation of the original. \nI would guess that the flagrum viewed by Sprott during his visit, is very likely some artifact recovered during an archaeological dig, possibly at Herculaneum (buried at the same time as Pompeii), or else is a reconstruction from Paul Vignon’s analysis of the scourge marks on the Shroud image.\n\n","date":"July 26, 2012 at 7:42 am","url":"https://shroudstory.com/2012/07/26/god-only-knows-if-these-relics-are-truly-what-they-claim-to-be/","cat":"news_&_views","id":"comment-14247","author":"daveb of wellington nz","site":"shroudstory"}]
