[{"title":"What things would not be known until 800 years into the future?","post":"There are non so blind as those who refuse to see. Once again someone kneels at the altar of the great Carbon Dating god and refuses to understand the clear, convincing evidence that dates were obtained from an anomalous portion of the Shroud after the Labs and the Church jettisoned reasonable protocols that were five years in the making.\nScience didn’t fail. It was the labs that failed science.\n\n","date":"February 13, 2014 at 8:16 am","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-78983","author":"John Klotz","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"Where’s the insight with this post?  Sounds like more ignorant atheistic blather.\n\n","date":"February 13, 2014 at 9:11 am","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-78997","author":"Annette Cloutier","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"Google the name “Khenpo A-Chos” and you will begin to understand the Shroud is not nearly as mysterious as it is made out to be. If my paper, “Beyond Contemporary Thought” gets accepted I will explain it to you this Fall at the St. Louis conference. An alternate title could be “Where East Meets West.”\n\n","date":"February 13, 2014 at 9:17 am","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-78998","author":"Tom Devins","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"800 years prior, it would not be known that primate (human) blood could be distinguished from the blood of cows, dogs, goats, sheep, etc. or even that of fish or frogs. Why the need to go to such lengths?  The work of a ritualistic or purist?  If a human body was used as a template, was this person taken through the entire sequence, scourged prior to infliction of the puncture wounds (wrist, feet) and side wound-or were some “painted” on and some not?Was a body used as a rough template to mark the wounds, analogous to a tailor making his initial chalk marks, then touched up subsequently? Would the touch up be done with blood from the same person or victim number two (why not?). Is it reasonable to imagine that a skilled artist could make this work?\n\n","date":"February 13, 2014 at 9:34 am","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-78999","author":"Kelly Kearse","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"Tom, this was extremely helpful.  I can almost understand how this rainbow-body phenomenon remains under wraps.  I wish it was revealed to me more in my youth… I could have better understood what was gnawing at me… deeply grateful.  Can’t wait to meet you in St. Louis!  So sorry for my knee-jerk comment.\n\n","date":"February 13, 2014 at 10:24 am","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79012","author":"Annette Cloutier","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"I’m not keen on the Rainbow Body, myself. There seems to be hardly any evidence for it other than the purported eye-witness accounts which I do not accept as reliable. Thinking it may have some relevance to the Resurrection, Fr Francisco Tiso went to China to find out more about it. He gives an account of his findings (the eye-witness accounts), but rejects any close identification of the Rainbow Body with the Resurrection. He also – I think this was 1999 – planned further investigations, but these have not yet taken place. In fact an eerie silence has descended about the whole affair in the intervening 15 years or so.\n\n","date":"February 13, 2014 at 12:30 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79035","author":"Hugh Farey","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"I’ve identified some 30 incidents of Rainbow Body in the Buddhist, Hindu and Taoist religions.  When you study the Eastern doctrines of Emptiness and Nature of Mind and combine them with the core principles of quantum science you find an interesting connection.  \nThe Rainbow Body casts a cloud over the Christian doctrines of Original Sin and Resurrection.  It is an accepted, matter of fact phenomenon in Himalayan countries.  Lest we forget, Biblical heroes Enoch, Elijah, Moses and Mary, in addition to Jesus, all left the planet in very unusual ways.  For whatever reason, lives filled with wisdom, love, compassion and detachment cause something strange to happen to human body cells. Witness the 250+ incorruptible bodies found in the Catholic tradition. \nHere’s hoping I get the opportunity to elaborate on all of this in St. Louis in October.\n\n","date":"February 13, 2014 at 2:55 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79063","author":"Tom Devins","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"\nTom Devins :\nI’ve identified some 30 incidents of Rainbow Body in the Buddhist, Hindu and Taoist religions.  When you study the Eastern doctrines of Emptiness and Nature of Mind and\ncombine them with the core principles of quantum science you find an interesting connection.\nThe Rainbow Body casts a cloud over the Christian doctrines of Original Sin and Resurrection.  It is an accepted, matter of fact phenomenon in Himalayan countries.  Lest we forget, Biblical heroes Enoch, Elijah, Moses and Mary, in addition to Jesus, all left the planet in very unusual ways.  For whatever reason, lives filled with wisdom, love, compassion and detachment cause something strange to happen to human body cells. Witness the 250+ incorruptible bodies found in the Catholic tradition.\nHere’s hoping I get the opportunity to elaborate on all of this in St. Louis in October.\n\nAnd Elvis?  Please tell me that Elvis could be on the list…\na. Big fan of the king\nb. Have read that Elvis was active in researching many different religions, including Eastern\nc. Kidding-no disrespect intended\nIn all seriousness, and in a nutshell, in any of the cases you have researched, any instances of complete or even partial imaging of a body?\n\n","date":"February 13, 2014 at 3:13 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79069","author":"Kelly Kearse","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"Elvis was also reportedly found with a book on the Shroud of Turin when his body was discovered(Wilcox’s book, if I’m remembering correctly). That makes it official, Kelly!\n\n","date":"February 13, 2014 at 4:20 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79091","author":"Chesterbelloc","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"\nChesterbelloc :\nElvis was also reportedly found with a book on the Shroud of Turin when his body was discovered(Wilcox’s book, if I’m remembering correctly). That makes it official, Kelly!\n\n:)\nTom D,\nI would like to hear your take about the imprinting side of this-have any occurrences taken place, or do you propose that this aspect is somehow related to the type of cloth itself and/or treatments it may have been subjected to, some combination?  \nI recall hearing George Harrison’s widow speak about how the room was “filled with light” at the time of his passing, but that was as far as the details went.\n\n","date":"February 13, 2014 at 4:35 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79094","author":"Kelly Kearse","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"Dr. Paolo Di Lazzaro of Italy’s National Agency for New Technologies was able to create many of the Shroud’s body image characteristics by exposing a linen cloth to short, intense bursts of radiation. Most of the Rainbow Body events I know of involve a release of radiation in the visible spectrum; hence the word “Rainbow.”\nShardza Gyalteson (1859-1935) died with a Rainbow Body. His followers, fearing loss of relics, interrupted the dissolution process only to find a body the size of a one year old child suspended three feet of the ground wrapped in an envelope of light. The Old Testament prophet Elijah left this world in a whirlwind accompanied by a flaming chariot. In Matthew 28:3 we read that an angel descended to Jesus’ tomb and his (the angel) appearance was like lightening. \nI think the radiation comes about as the atoms which make up the body revert to their native, low energy state in accordance with the laws of Quantum Mechanics. Atoms are in reality dense energy which gets released in the dissolution process.\n\n","date":"February 13, 2014 at 6:53 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79128","author":"Tom Devins","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"Hi Tom,\nA lot of Coptic Monks have reached this status as well. Has been documented in Coptic literature many times that Monks have reached (after a life of fasting, prayer and abandonment of material pleasures) a status where they were able to enter places where the doors were locked or translocate from one place to another. They call them in Egyptian (literally) “tourists Fathers” because they could move from one place to another without much trouble.\n\n","date":"February 13, 2014 at 10:06 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79193","author":"Mike M","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"Lovely, this should never be unwitnessed or kept as secret cultic information. Pictures and documentations by loving persons wishing to impart this energy to the rest of the world should be allowed to operate without impediment\n\n","date":"February 13, 2014 at 10:15 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79195","author":"Annette Cloutier","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"Annette, Most these Monks have little contact with civilization. Within the community of monks they usually act stupid/mentally retarded or dumb to avoid glorification by other monks. They are extremely humble and wear dirty rags. They are usually discovered by accident ( bright light coming out of their dwellings at night, sounds of people praying together where there is only one person in a room, situations where someone showed up in a place far away from where he lives with no explanation how he got there etc.) these people intentionally avoid detection so I think it’s almost impossible to get evidence for this. They  get the energy from the word of God. The father of Monasticism “Abba Antonious” was a very rich man and he heard the bible read in church, the verse where Jesus told the rich man “if you want to be perfect sell what you have and give the money to the poor, and you will have treasure in heaven. Then come, follow me.” He took that verse personally and followed the commandment and started Monasticism in the whole world. So the energy is in the word of God, but how many people are willing to follow through?\n\n","date":"February 14, 2014 at 2:16 am","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79246","author":"Mike M","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"There are many things that cannot be taken literally. Why would Elijah need a chariot? Was he a Neil Armstrong of the period, about to visit another planet or moon, where the chariot could be put to use?\n\n","date":"February 13, 2014 at 7:08 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79133","author":"Louis","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"Hi Louis,\nI see this a lot in the bible. I don’t think that was intended to be allegorical. Just the people who witnessed those events couldn’t accurately describe what they have seen. They have witnessed a supernatural event and they can only compare it to the natural to try to tell the story to others.\n\n","date":"February 13, 2014 at 9:28 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79182","author":"Mike M","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"HI Mike, That’s right. The most fascinating thing in the Bible are the riddles. Riddles? The literal things Jesus used to express the deepest truths in his parables.\n\n","date":"February 14, 2014 at 2:34 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79397","author":"Louis","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"All these “epiphanies” are always reported in terms of the prevailing culture. Abraham comes to Canaan around 2000BC in the company of camels, because camels had been domesticated by 1000BC and this section of Genesis was written down no earlier; that Elijah had a chariot for a space-ship to take him to the Sky-god father as they were in use in Mesopotamia by 3000BC, and by 2000BC the horse had been domesticated to haul them; God destroys the planet by flooding as the exiles heard the stories of Utnapishtim in Babylon in the 6th c. BC; Angels appear at Jesus’ tomb because by they were then part of Jewish cosmogony. \nAngels don’t need atoms or other physical energy for their existence as they are spiritual beings. Providence may allow them to use the properties of the physical world to make themselves manifest to other material beings.  As for resurrected boies, we donn’t know what stuff they’re made of, maybe atoms, maybe something else!\n\n","date":"February 13, 2014 at 7:31 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79140","author":"daveb of wellington nz","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"Incorruption merits attention and as far as I know the Church has called for an investigation. It does not seem to have anything to do with mediaeval churches,as can be seen in the cases involving Jacinta Marto (Fatima, Portugal) or the emperor Franz Jozef von Habsburg-Lothringen (Madeira island, Portugal). Bernadette Soubirous (Lourdes, France) is one of those cases that draw the most attention.\n\n","date":"February 13, 2014 at 7:53 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79144","author":"Louis","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"A fluke?  I don’t think so..  Nothing has been proven in any respect that the Shroud is a forgery.  There are arguments but no proof.\n\n","date":"February 13, 2014 at 8:04 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79150","author":"Andy","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"Isn’t it possible that angels really did appear at Jesus’ tomb? All 4 Gospels record it, and if a man can rise from the dead, I don’t see how any of the other miracles of the Bible are unreasonable.\n\n","date":"February 13, 2014 at 8:21 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79158","author":"Chesterbelloc","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"Angels are reported to be seen at the tomb, but the evangelists stories vary in their accounts; one angel or two angels? John reports one at the foot and one at the head, or was it the Shroud image they saw? Providence seeks to communicate the message that Jesus has risen.  How is that to be reported in a Jewish culture of 1st century Palestine? The evangelists need to impress on their audience that the women come away from the tomb convinced that Jesus is risen – a message from on high – a heavenly messenger is therefore sent. Another example – An angel tells the apostles to go to Galilee where they will see Jesus there, but Luke has them staying in Jerusalem, proclaiming the risen Jesus. Much of what the evangelists set down will depend on the intention as to how eqch one will proclaim Jesus is Lord. The message is more important than how it is reported.\n\n","date":"February 13, 2014 at 8:42 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79164","author":"daveb of wellington nz","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"Hi Dave,\nI don’t believe the writers of the gospels were trying to modify the details to impress anyone. Please remember they also wrote that their king was crucified, that God has “forsaken Him”, that they spat on His face..etc. also that they all abandoned Him at the garden(one running naked leaving his clothes behind) Peter Denied him, they were hiding afraid in the room until Jesus appeared to them, Peter “didn’t know what he was saying” on the mount of disfiguration, lots of other examples as well. I truly find the bible a very honest book. The discrepancies you see in the angels story for example is what is to be expected with multiple witnesses and oral traditions. I don’t think of any intentional embellishments.\n\n","date":"February 13, 2014 at 10:01 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79191","author":"Mike M","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"\nTom Devins :\nDr. Paolo Di Lazzaro of Italy’s National Agency for New Technologies was able to create many of the Shroud’s body image characteristics by exposing a linen cloth to short, intense\nbursts of radiation. Most of the Rainbow Body events I know of involve a release of radiation in the visible spectrum; hence the word “Rainbow.”\nShardza Gyalteson (1859-1935) died with a Rainbow Body. His followers, fearing loss of relics, interrupted the dissolution process only to find a body the size of a one year old child suspended three feet of the ground wrapped in an envelope of light. The Old Testament prophet Elijah left this world in a whirlwind accompanied by a flaming chariot. In Matthew 28:3 we read that an angel descended to Jesus’ tomb and his (the angel) appearance was like lightening.\nI think the radiation comes about as the atoms which make up the body revert to their native, low energy state in accordance with the laws of Quantum Mechanics. Atoms are in reality dense energy which gets released in the dissolution process.\n\nOK-I appreciate you taking the time to reply\n\n","date":"February 13, 2014 at 9:03 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79174","author":"Kelly Kearse","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"Elijah didn’t need a chariot. He vanished in a shower of radiation which the scripture writer described as a fiery chariot. Belief is a huge modifier of perception.\n\n","date":"February 13, 2014 at 10:40 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79201","author":"Tom Devins","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"There has been a considerable amount of good, scholarly, research done on the Shroud beginning in the 70s.  Issues of radiodating aside, what is frequently not heard much anymore is that the image in negative is a match for a human body in three dimensions, the blood typed as AB, there are pollen grains in the cloth consistent with a middle eastern origin, the face on the cloth has sufficient concordance with almost every major “portrait” of Jesus from antiquity to be admitted in court as evidence of being the same person, and a bloodstain pattern that oddly matches those on another item claimed to be the cloth wrapped around the head of Jesus (the shroud image and cloth must be reproduced on a 3 dimensional “head” for this to work.\nCurrently, there is doubt about the radiodating from the 80s because of repair work done to the shroud in the middle ages, a new claim of dating that encompasses the 1st century, and some suggestion that neutrons could produce such an image.\nI don’t remember the exact issue or the author, but in a comment to Nature in the late 80s, a scientist wrote in and suggested that we don’t understand the physics that might be involved in resurrection.  \nIf the item is the genuine article it will stand up to any scrutiny that takes a valid, objective, approach to questioning its validity.\n\n","date":"February 13, 2014 at 11:50 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79218","author":"Jon H.","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"Mike M: “I don’t believe the writers of the gospels were trying to modify the details to impress anyone.” \nI didn’t say they were trying to impress anyone, nor am I saying that they intentionally modified the details!  But they had a mission to proclaim a message, the message of the Risen Lord.  How do they do that? By speaking in terms of the specific culture they’re addressing in terms that will be understood.  We’re talking mysteries here, not your everyday experience of observing the latest car model on the road!  There are two aspects to it.  The actual objective truth of the experience, which may actually be beyond understanding; and the interpretation of that experience.  The reporting of the experience is limited by the way in which it is expressed by the witnesses, the intention of those wishing to report that experience, and by their perception of the understanding of those they wish to report it to. Furthermore Providence may also have a hand in it, by ensuring that the nature of the experience will be reported in a way that will be understood. I didn’t say there were no angels, there may well have been.  But it would be pointless for Providence to send angels if angels were not already part of the cultural understanding!  An alternative option would have been to send Elijah or Moses, but the evangelists see this event as a turning point in human history, so angels make more sense! “There are more things in haeaven and earth than are dreamed of in your philosophy, Horatio” [Hamlet]\n\n","date":"February 14, 2014 at 3:10 am","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79255","author":"daveb of wellington nz","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"Is the  Shroud unique? How many other preserved  objects are there on the face of the earth that have an image in the anatomical detail of the Shroud matching written accounts and traditions? \nThe Shroud is not a tradition. It is here and now and it was, there and then.  It is not a legend, myth or allegory. That being said,  I do believe that human consciousness, the soul if you will, is a quantum phenomenon and that it has capabilities normally masked by  three dimensional reality. One of the most important scienetific breakthroughs in the study of the brain began with a “paranormal event.”\nIt his book, Heller concluded by noting that it all of history and the literally thousands of surviving burial linens there is no other image like the Shroud. Was he wrong? Can someone point out to me a comparable  image preserved for centuries, if not millennia, which comes within a country mile of the image on the Shroud?\nThere is an old slightly scatological saying common in some sophisticated circles  including Wall Street. “Money talks, BS walks.”  Where is the money? Where’s the beef? Where is the physical object that is comparable to the Shroud? So far as I know, and I do not claim universal knowledge of everything, there isn’t any. I am not being snide. I really would like to know..\nThe Shroud is my opinion is  a capital R Revelation, providentially preserved to a time when science could unlock it’s secrets. The Revelation is unfolding before our very eyes. How lucky are we. \nAnd how lucky were the men and women of STURP. I mention providence. That the STURP examination came to be was such a collection of circumstance and accident, that it can only be accounted for with a capital P Providence.\n\n","date":"February 14, 2014 at 6:34 am","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79303","author":"John Klotz","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"\nMike M :\nAnnette, Most these Monks have little contact with civilization. Within the community of monks they usually act stupid/mentally retarded or dumb to avoid glorification by other monks. They are extremely humble and wear dirty rags. They are usually discovered by accident ( bright light coming out of their dwellings at night, sounds of people praying together where there is only one person in a room, situations where someone showed up in a place far away from where he lives with no explanation how he got there etc.) these people intentionally avoid detection so I think it’s almost impossible to get evidence for this. They  get the energy from the word of God. The father of Monasticism “Abba Antonious” was a very rich man and he heard the bible read in church, the verse where Jesus told the rich man “if you want to be perfect sell what you have and give the money to the poor, and you will have treasure in heaven. Then come, follow me.” He took that verse personally and followed the commandment and started Monasticism in the whole world. So the energy is in the word of God, but how many people are willing to follow through?\n\nHi  Mike… Speaking of Anthony the Great… the rich young man who started desert monasticism ca 285, I read somewhere he wasn’t as saintly as you make him out to be… he had a pedophiliac relationship with Athanasius of Alexandria (the monk who authorized the canonization of the NT).  Athanasius was no prize either… he had a wicked temper.\nSo I don’t know about relying on past information.  How can we be sure of anything really… we can’t test it empirically.  But today, in our Information Age, we ought to be able to take pictures, videos, and create documentaries of these phenomenon.  Just like we do of deep sea creatures of the ocean which are seldom seen (e.g., giant squid), we should be able to make a documentary of the Rainbow Body Phenomenon.\n\n","date":"February 14, 2014 at 8:24 am","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79325","author":"Annette Cloutier","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"About fifteen years ago there was enthusiasm for just such a project, including ‘live’ photography of monks emitting light, and a close study of the ‘yellow cloth’ which purportedly covered the body of Khenpo A-Chos. The fact that nothing further has emerged is indicative, I think.\n\n","date":"February 14, 2014 at 8:37 am","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79331","author":"Hugh Farey","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"Right Hugh, I’ve seen on the Discovery Channel the filming of Tibetan Monks in the frigid cold wearing only a wet towel across their backs while in group meditation…one by one the towels on their backs would become steamy hot… I’ve looked for that on the Net (YouTube, Discovery Channel, etc.) and couldn’t find it.  But I found other research such as  http://www.youtube.com/watch?v=flJnlB4Tgu0   and    http://www.discovery.com/tv-shows/discovery-presents/videos/the-supernaturalist-levitation.htm.  I think dispelling the authenticity of this type of phenomenon would be akin to dispelling the authenticity of the Shroud… while not quite associated to a Medieval Merlin work, there is something almost unrelatable to be said for those who dedicate their lives totally in the deepest wells of E=MC2.   I would like to see more authentication of this type of spiritual field.  For example, Padre Pio types today would have to consent to undergo video taping of not only their stigmata, but reported acts of levitation and bilocation before getting 170 million hits on YouTube.\n\n","date":"February 14, 2014 at 9:22 am","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79341","author":"Annette Cloutier","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"Indicative of what?  Father Tiso told me (e-mail) that funding dried up. As best I can tell,  his initial inquiry was funded by the Institute of Noetic Sciences.  IONS is the creation of former astronaut Edgar Mitchell to investigate the paranormal.  It is Mitchell’s response to some pre-planned clairvoyance experiments he was conducting in outer space.  The people at IONS tell me their paranormal research program is floundering ( the retreat center is flourishing) because of an overall lack of interest by the public in general.  There is a persistent “so what” attitude that is slowing them down. \nI can assure you Father Tiso is very much convinced of the reality of the Rainbow Body. As you might expect he is reluctant to compare it to Jesus’ resurrection as the phenomenon potentiality undermines fundamental Christian philosophy. A life long Catholic (73 years) I am not as inhibited. If it looks like a duck, walks like a duck and talks like a duck, then, in all probability, it is a duck.  \nAs a presenter, I am looking at the upcoming St Louis Shroud conference as my coming out party. In fact, I am considering organizing a Shroud conference on my own. It will be a joint Buddhist-Christian endeavor called WHERE EAST MEETS WEST.\n\n","date":"February 14, 2014 at 12:39 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79380","author":"Tom Devins","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"\nAnnette Cloutier :\n\nMike M :\nAnnette, Most these Monks have little contact with civilization. Within the community of monks they usually act stupid/mentally retarded or dumb to avoid glorification by other monks. They are extremely humble and wear dirty rags. They are usually discovered by accident ( bright light coming out of their dwellings at night, sounds of people praying together where there is only one person in a room, situations where someone showed up in a place far away from where he lives with no explanation how he got there etc.) these people intentionally avoid detection so I think it’s almost impossible to get evidence for this. They  get the energy from the word of God. The father of Monasticism “Abba Antonious” was a very rich man and he heard the bible read in church, the verse where Jesus told the rich man “if you want to be perfect sell what you have and give the money to the poor, and you will have treasure in heaven. Then come, follow me.” He took that verse personally and followed the commandment and started Monasticism in the whole world. So the energy is in the word of God, but how many people are willing to follow through?\n\nHi  Mike… Speaking of Anthony the Great… the rich young man who started desert monasticism ca 285, I read somewhere he wasn’t as saintly as you make him out to be… he had a pedophiliac relationship with Athanasius of Alexandria (the monk who authorized the canonization of the NT).  Athanasius was no prize either… he had a wicked temper.\nSo I don’t know about relying on past information.  How can we be sure of anything really… we can’t test it empirically.  But today, in our Information Age, we ought to be able to take pictures, videos, and create documentaries of these phenomenon.  Just like we do of deep sea creatures of the ocean which are seldom seen (e.g., giant squid), we should be able to make a documentary of the Rainbow Body Phenomenon.\n\nAnnette, I don’t want to take this too far off topic, but do you have any links about what you’re saying about Anthony the Great’s relationship with Athanasius?\n\n","date":"February 14, 2014 at 2:02 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79390","author":"Chesterbelloc","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"Right… I’m not home right now, but when I return I’ll go through my library.  It was from a faint memory.  I felt rather uncomfortable blogging about it.  I quickly checked Wikipedia on the life of Athanasius.  This is what I found:  \nSozomen speaks of his “fitness for the priesthood”, and calls attention to the significant circumstance that he was “from his tenderest years practically self-taught”. “Not long after this,” adds the same authority, Bishop Alexander “invited Athanasius to be his commensal and secretary. He had been well educated, and was versed in grammar and rhetoric, and had already, while still a young man, and before reaching the episcopate, given proof to those who dwelt with him of his wisdom and acumen” (Soz., II, xvii). That “wisdom and acumen” manifested themselves in a varied environment. While still a deacon under Alexander’s care, he seems to have been brought for a while into close relations with some of the solitaries of the Egyptian desert, and in particular with the Anthony the Great, whose life he is said to have written.\nSo now I’m unsure as to weather it was Bishop Alexander or Anthony the Great who toyed with Athanasius.  But I remember doing research on this nearly 10 years ago… so I will have to retrace my steps further.\n\n","date":"February 14, 2014 at 4:36 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79431","author":"Annette Cloutier","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"Annette I don’t see any evidence in what you just said. I hope you will be able to substantiate those accusations with real evidence rather than speculation. There was a lot of rivalry back then, heresies and special interest so I can see how people would try to go ad hominem against those great people.\n\n","date":"February 14, 2014 at 6:51 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79448","author":"Mike M","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"Mike, this is precisely my point.  Whose to say one way or the other that these men were holy except people with an agenda.  The Church has its agenda.  The anti-ecclesiastical have there agenda.  Whose to say, except for us in the here and now to prove what can or cannot be proven… honestly.\n\n","date":"February 15, 2014 at 8:54 am","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79563","author":"Annette Cloutier","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"\nAnnette Cloutier :\nMike, this is precisely my point.  Who’s to say one way or the other that these men were holy except people with an agenda.  The Church has its agenda.  The anti-Church have their agenda.  Who’s to say, except for us in the here and now to prove what can or cannot be proven… honestly.\n\n","date":"February 15, 2014 at 10:35 am","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79580","author":"Annette Cloutier","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"Annette, there are indisputable facts that everybody agrees on.. That Anthony was very rich.. That Anthony gave up all his possessions to the poor. Isn’t that worthy of praise?\n\n","date":"February 15, 2014 at 7:33 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79660","author":"Mike M","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"Hey Mike, I’m not disputing the holiness of anyone past or present.  I’m just saying that there are certain things that we can not know for sure. The Shroud, being in our time and space right now, should be something that the Church should not leave as mystery because we can study it here and now.  It should be universally studied for the betterment of science, religion, or whatever it is that moves us to a greater good.  It’s lovely thinking that Anthony the Great and the Desert Fathers were “holy”.  It’s good for the mind, I’m sure, to contemplate the sacrifice of the smaller self, but for God’s sake we need to see and appreciate to the fullest the sacrifice others are making towards the study of the reality of Christ… Those dedicated now to the Shroud should be given more universal support.  The Shroud after all  is the indelible and long-lasting sign of his Energy, his Mass, his Light.  Whether it’s through the study of the Shroud itself, or the study of other spiritual phenomenon… such as Rainbow Bodies, the good that can result is a greater reality and idea of The Holy.\n\n","date":"February 15, 2014 at 8:52 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79680","author":"Annette Cloutier","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"Annette, I agree the shroud should go through another expedition. However I believe there should be a serious team like STURP with a clear protocol for the church to say yes.\n\n","date":"February 15, 2014 at 10:12 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79697","author":"Mike M","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"Precisely, Mike.  I would hope in the next scientific scrutiny of the Shroud that it is approached in an open democratic way not excluding the input of previous scientific groups such as STURP but rather will have learned to approach its findings openly and comprehensively with no pretention to transparency and inclusiveness.\n\n","date":"February 16, 2014 at 1:10 am","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79723","author":"Annette Cloutier","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"The rainbody body phenomenon sounds like esoteric nonsense and there is a lot of hearsay. As Westerners Fathers Tiso and Steindl-Rast were probably led away by Eastern tales that were new to them. We need to see something documented, otherwise it will be like the reincarnatio theories of Westerner Ian Stevenson (USA) being debunked by the Easterner C.T.K. Chari (India).\n\n","date":"February 15, 2014 at 8:53 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79681","author":"Louis","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"Thanks Louis… well then forget Rainbow Bodies, and compare the Shroud to other spiritual phenomenon that begs to be examined such as the Guadeloupe Tilma, the Veil of Manoppello, the incorruptible bodies of Bernadette Soubirous, Catherine of Laboure, to name a few… dedicated to promoting the concept of the Greater Good via the Immaculate Conception.\n\n","date":"February 15, 2014 at 9:19 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79686","author":"Annette Cloutier","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"Hi Annette, these objects mentioned by you are there to be examined, and surely you will agree that the rainbow bodies are not there to be examined in a similar way?\n\n","date":"February 15, 2014 at 9:32 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79689","author":"Louis","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"Right Louis… I’ve relegated the Rainbow Bodies to Finian.\n\n","date":"February 15, 2014 at 10:03 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79696","author":"Annette Cloutier","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"Good for you Annette, you got the point. You see, all the relics and incorruptible bodies you cited are not a part of the Deposit of Faith, they can be props like the Shroud. All of them require further investigation, and it is only when the scientists give their updated reports can theologians propose explanations, it is first ‘How’ and then ‘Why’. The canonisation process may interest you, if you have the time and inclination. \nBy the way, thousand of Hindus in India flock to Catholic Churches, in search of cures, healings, jobs, in churches dedicated to St. Anthony, St.Dominic Savio etc, they do not go looking for rainbow bodies in neighbouring Tibet.\n\n","date":"February 16, 2014 at 10:46 am","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-79803","author":"Louis","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"Louis,  would you be willing to point me to a link for the canonization process?  Thanks…\n\n","date":"February 18, 2014 at 11:42 am","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-80357","author":"Annette Cloutier","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"Hi Annette, you could try the following link for a start:\nhttp://www.religionfacts.com/christianity/practices/honoring_saints/canonization.htm\nThere are many people on the list and the process can take dozens of years. The Catholic Church looks for phenomena unexplained by science after the death of a candidate, but it seems that what happened during his or her life is also taken into consideration.\nIn his book on Pope John Paul II the German journalist and author no English translation, it seems) cites several cures by the late pontiff. There is one about a Jewish millionaire from New York who was dying of a brain tumour and had two wishes, to die in Jerusalem and see Pope John Paul before that. He was put into touch with Msgr. Stanislaw Dziwisz, the pope’s secretary. Since the man was very sick he was wheeled on a stretcher into the chapel where the pope was to say mass. He received communion from the pope’s hand during the celebration and was gently chided by the monsignor after that. A few days later the monsignor received a call saying that the man had been completely cured. This was also reported in newspapers.\n\n","date":"February 18, 2014 at 12:16 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-80365","author":"Louis","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"Thank  you Louis, this was very helpful.\n\n","date":"February 18, 2014 at 1:17 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-80384","author":"Annette Cloutier","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"You’re welcome, Annette. We look for faith in the midst of scepticism, in an increasingly sceptical Western world. It seems that sometimes faith can transform people who have gone through unbelievable suffering. Have you read about the   life of Josephine Bakhita?\n http://www.fondazionecanossiana.org/en/multimedia/news/item/165-anniversary-of-s-josephine-bakhita-canonization.html\nIt was the kind of religious faith transforming people that philosopher Wittgenstein was looking for.\n\n","date":"February 18, 2014 at 1:41 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-80389","author":"Louis","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"Sorry, the name of the journalist and author is Andreas Englisch.\n\n","date":"February 18, 2014 at 12:18 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-80366","author":"Louis","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"Uh oh, now you’ve got me studying…Ludwig Wittgenstein!  Nonetheless, I was  happy to see the Church would canonize someone like Josephine Bakhita.  Gives one hope for canonization for people like you and me!\n\n","date":"February 18, 2014 at 4:59 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-80421","author":"Annette Cloutier","site":"shroudstory"},{"title":"What things would not be known until 800 years into the future?","post":"Annette, you don’t have to go deep into his philosophy, just find out why a genius like him felt his soul was “empty” and slowly went back to the religion in which he was brought up. Well, to be more precise, the search went on throughout his life, with intervals here and there. In the case of Heidegger, he recovered his faith toward the end of his life, after having been left, like Wittgenstein, with an “empty” soul.\n  https://www.academia.edu/6085481/Why_was_Wittgensteins_burial_attended_by_a_religious_ceremony\nToday philosophers think differently, quite often guided by discoveries in science, they have to seek other paths which are not easy to find and there are various theologies which seem to clash with each other. Atheists must have noticed this trend and therefore indulge in scientism. But that is not the case with Stephen Hawking, who in a way keeps an open mind …. because he keeps on changing his mind.\n\n","date":"February 19, 2014 at 4:18 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","id":"comment-80675","author":"Louis","site":"shroudstory"}]
