[{"title":"How can you argue with this?","post":"Agenda-driven non-Jewish Shroud sceptics (and even authenticists at times) are all too keen to forget Jewish realities when it comes to Christ face iconography and… Second Temple period Judean burial customs, practices and rites.\n\n","date":"May 15, 2014 at 7:36 am","url":"https://shroudstory.com/2014/05/15/how-can-you-argue-with-this-2/","cat":"news_&_views","id":"comment-119863","author":"Max patrick Hamon","site":"shroudstory"},{"title":"How can you argue with this?","post":"Daveb, this comment needs illustrations. IW may have misinterpreted orthodox Jews who raise their sidelocks (Deuteronomy 19:27) and tuck them under the cap. Sikhs, who do not cut their hair, tucked inside a turban, also do not shave their beards, which is sometimes kept close to the face with a band or net. Many Russian Orthodox Church priests have long hair, which is not hidden.\n\n","date":"May 15, 2014 at 1:59 pm","url":"https://shroudstory.com/2014/05/15/how-can-you-argue-with-this-2/","cat":"news_&_views","id":"comment-120042","author":"Louis","site":"shroudstory"},{"title":"How can you argue with this?","post":"Louis, you’ll be aware that David Hines posted a particularly informative comment concerning western translations of Paul’s epistle to the Corinthians regarding men giving excessive attention to dressing their hair, claiming that the original text had little to do with hair length at all.  I think I recall that IW’s comment on Jewish men tucking their hair into their head-wear had the benefit of his discussing it with a Jewish acquaintance.  In the 1960s when many South-east Asian students were studying in NZ, I recall two Sikh engineering students.  One retained the practice of wearing his turban with long hair and beard; the other discarded them, adopting the western practice of clean-shaven, short back-and-sides, no turban.   His parents were extremely upset when they heard of it.  Both of them were diligent students, popular and fitted into the local scene well.\n\n","date":"May 15, 2014 at 5:05 pm","url":"https://shroudstory.com/2014/05/15/how-can-you-argue-with-this-2/","cat":"news_&_views","id":"comment-120102","author":"daveb of wellington nz","site":"shroudstory"},{"title":"How can you argue with this?","post":"Daveb, I think the male members of one particular Orthodox Jewish group have long hair, so perhaps IW was referring to them. Regarding clean-shaven Sikhs, perhaps the most well-known one is Father Arun Arora, a convert from Sikhism like the mystic Sadhu Sundar Singh who lived in the 19th century, who was quite recently appointed Director of Communications of the Church of England:\nhttp://www.riponleeds.anglican.org/news-468.html\n\n","date":"May 15, 2014 at 5:43 pm","url":"https://shroudstory.com/2014/05/15/how-can-you-argue-with-this-2/","cat":"news_&_views","id":"comment-120120","author":"Louis","site":"shroudstory"},{"title":"How can you argue with this?","post":"I think it unfortunate that Father Arun Arora felt obliged to surrender his cultural heritage upon his conversion, bearing in mind the much vaunted inclusiveness of he Anglican communion.  The long hair has a slight religious significance as it is the means by which the Sikhs are hauled up to heaven, but a cultural plea ought to have had some weight.  Indian women in our community often wear their colorful saris to our church for particular religious occasions such as baptisms and weddings.  Islamic head-scarfs are to be seen among our college girls and also when shopping. No full covering burkhas as yet.\n\n","date":"May 15, 2014 at 11:50 pm","url":"https://shroudstory.com/2014/05/15/how-can-you-argue-with-this-2/","cat":"news_&_views","id":"comment-120267","author":"daveb of wellington nz","site":"shroudstory"},{"title":"How can you argue with this?","post":"I am a member of the Church of God [Sabbath and Holy Day]. I know the idea that Yeshua and other Jews of his day, followed Greek style was a belief of Herbert W. Armstrong. He also taught that the instrument of crucifixion was a single upright post rather that the Tau [T] shape in two pieces it most likely was. These were minor teachings of the Church and not doctrine. Mr. Armstrong always taught to ‘Prove All Things’ and not just believe him. I have done just that and found some error in the minor elements of Mr. Armstrong’s teaching. Others have treated Mr. Armstrong as infallible. To do so is a terrible mistake. I learned much from the work of Herbert W. Armstrong. It put me on a path of great enlightenment…\n\n","date":"June 14, 2014 at 11:41 am","url":"https://shroudstory.com/2014/05/15/how-can-you-argue-with-this-2/","cat":"news_&_views","id":"comment-129458","author":"John Hill","site":"shroudstory"}]
