[{"title":"How Safe is The Shroud of Turin?","post":"I have found the following link (but the text is wriitten in italian language !) :\nhttp://www.globalist.it/Detail_News_Display?ID=53979&typeb=0&Furto-reliquia-di-papa-Wojtyla-spunta-la-pista-estera \nTitle :\nFurto reliquia di papa Wojtyla, spunta la pista estera\n—\nThis article was published today :\ngiovedì 30 gennaio 2014   h = 06:11\n— — —\nB.T.W. : reading the italian words :\n>… La chiesetta, che sorge alla falde aquilane del Gran Sasso, tra le frazioni di Camarda ed Assergi, è la prima dedicata a Karol Wojtyla, che il prossimo 27 settembre sarà canonizzato insieme ad un altro amatissimo pontefice, Giovanni XXIII. \nI have discovered an error :  “27 settembre” instead of “27 aprile” !!!\nHere the conclusive part of the text (sorry, in italian language !) :\n>… La reliquia è un pezzettino di stoffa, contenuto in un’ampolla, dell’abito che il pontefice indossava durante l’attentato in piazza San Pietro, il 13 maggio 1981.\n= The relic is a little piece of cloth and it was contained in an ampulla (= small bottle or phial … Then it is easy to hide that relic !)\n>A donarla al santuario, nel 2011, fu l’arcivescovo di Cracovia Stanislaw Dziwisz, per 50 anni segretario di Wojtyla. E proprio dal cardinale è partito un appello a chi ha compiuto il furto sacrilego affinchè i profanatori del santuario della Ienca restituiscano la reliquia del Beato prima della sua canonizzazione. «La reliquia, del resto – afferma Dziwisz – non ha alcun valore commerciale, ma solo enorme peso affettivo legato alla devozione di tanti fedeli».\n— — —\nIf you want to read the english text you have to translate the italian words\notherwise, see also under :\nhttp://www.thegatewaypundit.com/2014/01/thieves-steal-vial-of-pope-john-paul-iis-blood-from-italian-church/\n>In 2011, John Paul’s former private secretary, Cardinal Stanislaw Dziwisz, gave the local Abruzzo community the relic of the late pontiff’s blood, exhibited at the Shrine in San Pietro della Ienca. (L’Aquila)\n>Thieves broke into the Shrine in San Pietro della Ienca in the mountains east of Rome and stole a vial of Pope John Paul II’s blood.\n—- —\nand … try to read under the address :\nhttp://www.santuariogiovannipaolo2.com/english.html\n\n","date":"January 30, 2014 at 9:44 am","url":"https://shroudstory.com/2014/01/30/how-safe-is-the-shroud-of-turin/","cat":"news_&_views","id":"comment-75161","author":"Piero","site":"shroudstory"},{"title":"How Safe is The Shroud of Turin?","post":"Phil Dayvault had offered his own plan for keeping the Shroud safe around ten years ago but there seems to have been no response.\n\n","date":"January 31, 2014 at 8:51 am","url":"https://shroudstory.com/2014/01/30/how-safe-is-the-shroud-of-turin/","cat":"news_&_views","id":"comment-75418","author":"Louis","site":"shroudstory"},{"title":"How Safe is The Shroud of Turin?","post":"Louis wrote: “Phil Dayvault had offered his own plan for keeping the Shroud safe around ten years ago but there seems to have been no response.”\nStill safe, isn’t it?…(;-)\nSeriously…thanks, Louis, for remembering…however, the actual date of submission of the proposed protocol was in 1996.\n\n","date":"January 31, 2014 at 8:23 pm","url":"https://shroudstory.com/2014/01/30/how-safe-is-the-shroud-of-turin/","cat":"news_&_views","id":"comment-75549","author":"Phil Dayvault","site":"shroudstory"},{"title":"How Safe is The Shroud of Turin?","post":"Hi Phil, you have a good cop’s instinct and if you do send a reminder to Turin I’m sure many Shroudies will also sign.\n\n","date":"February 1, 2014 at 8:15 am","url":"https://shroudstory.com/2014/01/30/how-safe-is-the-shroud-of-turin/","cat":"news_&_views","id":"comment-75693","author":"Louis","site":"shroudstory"},{"title":"How Safe is The Shroud of Turin?","post":"Still safe, isn’t it?…(;-)\nSeriously…thanks, Louis, for remembering…however, the actual date of submission of the proposed protocol was in 1996.\n\n","date":"January 31, 2014 at 9:36 pm","url":"https://shroudstory.com/2014/01/30/how-safe-is-the-shroud-of-turin/","cat":"news_&_views","id":"comment-75564","author":"Phil Dayvault","site":"shroudstory"},{"title":"How Safe is The Shroud of Turin?","post":"Dan correctly raised the question of the Shroud’s safety and just in case Phil decides to send Turin a reminder, with cc to Rome, newcomers in the Shroud scenario should know that        Phil is a former FBI Special Agent.\n\n","date":"February 1, 2014 at 8:58 am","url":"https://shroudstory.com/2014/01/30/how-safe-is-the-shroud-of-turin/","cat":"news_&_views","id":"comment-75702","author":"Louis","site":"shroudstory"},{"title":"How Safe is The Shroud of Turin?","post":"BBC is reporting:\nItalian police have recovered most of a piece of cloth stained with the blood of Pope John Paul ll after it was stolen from a church in Abruzzo.\nThe cloth – from a cassock John Paul was wearing in 1981 when a gunman tried to assassinate him – was taken in a burglary last weekend.\nThe cloth was found in separate pieces in a garage of one of the three men arrested in connection with the theft.\nIt has been put back together with only a few filaments of gold missing.\nPolice are still looking for the remaining fragments.\nOn Thursday officers had found the gold and glass case in which the relic was held but said the cloth was still missing.\nBut on Friday, Bishop Giovanni D’Ercole told a press conference in L’Aquila that the cloth had now also been found and pieced together.\n“I think John Paul has forgiven them. I think we have to do the same,” Bishop D’Ercole said.\nThe relic was taken during a burglary of the San Pietro della Ienca church.\nThe three suspects apparently threw the cloth away, not realising its value.\nA small crucifix that was stolen along with the reliquary has also been recovered.\nAbruzzo was a place of special significance to the ski-loving Pope, who died in 2005.\n\n","date":"February 1, 2014 at 3:29 am","url":"https://shroudstory.com/2014/01/30/how-safe-is-the-shroud-of-turin/","cat":"news_&_views","id":"comment-75630","author":"Dan","site":"shroudstory"},{"title":"How Safe is The Shroud of Turin?","post":"I have read the interesting words under the address :\nhttp://www.adnkronos.com/IGN/Aki/English/Religion/Italy-John-Paul-II-relic-found-after-theft-from-church_321172985681.html\n\n","date":"February 1, 2014 at 7:25 am","url":"https://shroudstory.com/2014/01/30/how-safe-is-the-shroud-of-turin/","cat":"news_&_views","id":"comment-75675","author":"piero","site":"shroudstory"},{"title":"How Safe is The Shroud of Turin?","post":"I notice that shreds of John Paul II’s clothing are on sale for about $15, and numbers of chapels have drops of his blood, although none of that is for sale that I can find. It’s only a matter of time, I dare say. Good to see the relic trade still alive and kicking!\n\n","date":"February 1, 2014 at 7:38 am","url":"https://shroudstory.com/2014/01/30/how-safe-is-the-shroud-of-turin/","cat":"news_&_views","id":"comment-75681","author":"Hugh Farey","site":"shroudstory"},{"title":"How Safe is The Shroud of Turin?","post":"Wherever a church is built, evil installs itself next door. One clear sign appeared last week. Whoever understands must have noticed it…\n\n","date":"February 1, 2014 at 8:07 am","url":"https://shroudstory.com/2014/01/30/how-safe-is-the-shroud-of-turin/","cat":"news_&_views","id":"comment-75691","author":"Louis","site":"shroudstory"}]
