[{"title":"How to Become Famous","post":"“possibly ones that are entirely chemical at room temperature, though less probable”\nsource please.\nhttps://shroudofturin.files.wordpress.com/2012/08/rogers-maillard-reaction-for-dan-blog-2.pdf\n\n","date":"November 23, 2014 at 10:39 am","url":"https://shroudstory.com/2014/11/23/how-to-become-famous/","cat":"wikipedia_content","id":"comment-172688","author":"anoxie","site":"shroudstory"},{"title":"How to Become Famous","post":"Now, why a “simulated sweat imprint” hypothesis and no longer “scorch” hypothesis? Strange.\nBecause contrary to what is written (by CB himself?), “B. still considers the TS to be a contact scorch”, he seems no longer decided to take a definitive stand for his scorch hypothesis.\nThat’s why i’ve tried to clarify Rogers’ hypothesis, more than two years ago, precisely to prevent his hypothesis from being spoiled by such claims.\nCB, your scorch hypothesis is a complete failure, leave Rogers in peace.\n\n","date":"November 23, 2014 at 11:23 am","url":"https://shroudstory.com/2014/11/23/how-to-become-famous/","cat":"wikipedia_content","id":"comment-172693","author":"anoxie","site":"shroudstory"},{"title":"How to Become Famous","post":"I, for one, can hardly complain if Colin wishes to provide material to the Wikipedia site but I have provided a link to an article that was published in a respected history journal and which has, according to the Editor, had 20,000 hits. The article was read by expert advisers at my request and I assume, from the two month delay after I submitted the article to History Today before acceptance, peer- reviewed by their advisory committee. It is entirely up to the editor of the Wikipedia article ,of course, but might I suggest that Colin provides some evidence that he has academic support for his theories or we will have Stephen Jones joining in too.\n\n","date":"November 23, 2014 at 1:19 pm","url":"https://shroudstory.com/2014/11/23/how-to-become-famous/","cat":"wikipedia_content","id":"comment-172697","author":"Charles Freeman","site":"shroudstory"},{"title":"How to Become Famous","post":"I see that the summary of my article on Wikipedia has been deleted by someone called Stetson7. I am not gong to reinsert it as it has already had very wide publicity ( note the 20,000 hits on History Today) and I could not have wished for more. I assume that an editor might reinsert it but I will leave it up to them.\n\n","date":"November 23, 2014 at 1:32 pm","url":"https://shroudstory.com/2014/11/23/how-to-become-famous/","cat":"wikipedia_content","id":"comment-172700","author":"Charles Freeman","site":"shroudstory"},{"title":"How to Become Famous","post":"This site is going to lose its credibility with these absurd hypotheses. Colin’s back and forth scorch (burnt body) or sweat imprints (how? I don’t know), Freeman’s flaky paint. I;m surprise this isn’t in the World Weekly News.\n\n","date":"November 23, 2014 at 4:33 pm","url":"https://shroudstory.com/2014/11/23/how-to-become-famous/","cat":"wikipedia_content","id":"comment-172711","author":"Don","site":"shroudstory"},{"title":"How to Become Famous","post":"Don,I do think that the best fit explanation of the original images on the Shroud is a painting but medieval pigments would have fragmented into tiny particles, not flaked. They leave a faded image as in the Zittau Veil if you want an example to compare the Shroud with.\nHowever, leaving aside painting and looking at the Shroud today and seeing the all -over scourge marks, these are not known in images of the dead Christ before 1300. If the Shroud was earlier than that then no one seems to have realised that the scourging was all over the body- so had they seen e Shroud or not? Or perhaps, artists started copying the Shroud’s scourge marks only for the first time after 1300.\nOr maybe, just maybe, the images on the Shroud were made by someone after 1300 who was following the new trend that seems to have been sparked off by Isaiah 1.6.\n\n","date":"November 23, 2014 at 5:14 pm","url":"https://shroudstory.com/2014/11/23/how-to-become-famous/","cat":"wikipedia_content","id":"comment-172716","author":"Charles Freeman","site":"shroudstory"},{"title":"How to Become Famous","post":"Read “An Autopsy on the Man of the Shroud”, by Robert Bucklin, a forensic pathologist who have examined over 25,000 bodies. He went into great detail explaining everything that happened to the man on the shroud before, during and after death. After examination, he said there was no indication of anything that didn’t look right or out of place, blood flows, wounds, etc. It was actually like examining the real human body! Using your hypothesis, you don’t think Bucklin would know there’s something with the “picture”?\n\n","date":"November 23, 2014 at 7:38 pm","url":"https://shroudstory.com/2014/11/23/how-to-become-famous/","cat":"wikipedia_content","id":"comment-172734","author":"Don","site":"shroudstory"},{"title":"How to Become Famous","post":"correction-something WRONG with the picture\n\n","date":"November 23, 2014 at 7:41 pm","url":"https://shroudstory.com/2014/11/23/how-to-become-famous/","cat":"wikipedia_content","id":"comment-172735","author":"Don","site":"shroudstory"},{"title":"How to Become Famous","post":"The scourge marks are not particularly easy to see on the linen cloth itself (e.g. see Durante 2002 positives on Shroudscope), but they are particularly clear on the Enrie 1931 negatives.  Nevertheless they are depicted in art before 1300.  See Carolingian Stuttgart psalter illustration of scourging scene of 800-814, posted this site, check archive list right panel, for Oct 20, 2013.  There was known contact between Charlemagne’s and Byzantine courts.  \nThe Greek epitaphioi used in Greek Orthodox Easter liturgies sometimes show the scourge marks and other Shroud-like image features dating from about 1200.  They seem to reflect remembered details of the Shroud image following the Frankish Crusaders’ pillaging of the Constantinople relics.  The Thessalonika example is particularly graphic in its scourging details, and includes the chevron or herring-bone weave.  Although some of these post-date the Shroud’s known appearance in the West, there was no known Greek sighting of the Shroud since its appearance in Europe, and it can only be inferred that they are based on a collective Greek memory.\n\n","date":"November 23, 2014 at 9:13 pm","url":"https://shroudstory.com/2014/11/23/how-to-become-famous/","cat":"wikipedia_content","id":"comment-172739","author":"daveb of wellington nz","site":"shroudstory"},{"title":"How to Become Famous","post":"Would love to see the earliest extant example of the epitaphios which dates to circa 1200. It’s in a museum in Venice. There is a very small image of it on  the museum’s website but nowhere near big enough to see in detail.\nI am not aware of any decent online images of it.\nI wonder if any of our Italian friends could help?\n\n","date":"November 24, 2014 at 12:21 am","url":"https://shroudstory.com/2014/11/23/how-to-become-famous/","cat":"wikipedia_content","id":"comment-172756","author":"Thomas","site":"shroudstory"},{"title":"How to Become Famous","post":"Which Thessalonika epitaphios is graphic in its scourging details? The one shown most prominently in a Google search shows no scourging details at all. Am I missing something?\n\n","date":"November 24, 2014 at 9:01 am","url":"https://shroudstory.com/2014/11/23/how-to-become-famous/","cat":"wikipedia_content","id":"comment-172801","author":"Hugh Farey","site":"shroudstory"},{"title":"How to Become Famous","post":"My apologies, Hugh.  I had misread a reference in a Wilson plate, which I had thought was the example I intended. \nCheck out the Stavronikita epitaphios, discussed here at length on posting of June 28, 2014, with some good detailed graphics.  You need to inspect the detailed blow-ups.  \nTristan Casabianca had provided the specific reference:\n http://www.elpenor.org/athos/en/e218ck20.asp\nThere seems to have been two stages in producing it at a Mt Athos monastery, the second stage possibly as late as about 14th or 15th century, the first much earlier.  \nBoth the chevron twill and the scourge marks are particularly graphic.  \nThe point is that despite the latish alleged date of production, it is unlikely to have been copied from any of the Shroud’s European displays, as contact between Greek Orthodox and Europe at this time was minimal.  As Scavone has mentioned, such examples seem to have been based on a Greek memory of the original Shroud in Constantinople before 1204.\nI think it provides the “smoking gun” you occasionally claimed to have sought.  But you may have a different opinion or not!\n\n","date":"November 24, 2014 at 3:12 pm","url":"https://shroudstory.com/2014/11/23/how-to-become-famous/","cat":"wikipedia_content","id":"comment-172835","author":"daveb of wellington nz","site":"shroudstory"},{"title":"How to Become Famous","post":"I repeat we really need to see the Venice example. how?\n I’ve contacted the museum San Marco and they can’t provide any decent sized reproductions.\nI might just have to visit Venice and see it for myself\n\n","date":"November 24, 2014 at 4:27 pm","url":"https://shroudstory.com/2014/11/23/how-to-become-famous/","cat":"wikipedia_content","id":"comment-172846","author":"Thomas","site":"shroudstory"},{"title":"How to Become Famous","post":"I have Gertrud Schiller’s Icongraphy of Christian Art, Volume 2, and am looking at Plate 592, captioned c.1200. Byzantine. Epitaphios. Venice. Christ on the Anonting Stone. The photo is in black and whtie and about 10cm x 8cm. The epitaphios is very similar to the Stavronitika one mentioned by daveb, including the wide border, the inner frame with the four corners framed off in quarter-circles and inhabited by angels carrying books, and over the body of Christ two larger angels carrying carpet-beaters. Jesus is lying in a very similar pose to the Stavronitika Jesus, has his arms crossed and the thumbs clearly visible, and is wearing a loincloth. He appears to be covered in the same rather random spots of black, which may represent blood. The differences are that he is carrying a book under his right arm, and clearly lying on an uncovered stone slab, with no suggestion of a Shroud. Nevertheless, it is impossible not to think that the Stavronitika epitaphios is a direct copy of he Venice one, so similar are they in style and so unlike any others found on Google, except for one modern one, which adds several people to the scene.\n\n","date":"November 24, 2014 at 5:22 pm","url":"https://shroudstory.com/2014/11/23/how-to-become-famous/","cat":"wikipedia_content","id":"comment-172856","author":"Hugh Farey","site":"shroudstory"},{"title":"How to Become Famous","post":"Thanks. Would be interesting to know how / when it arrived in Venice. Following the sacking\nof Constantinople, maybe.\n\n","date":"November 25, 2014 at 12:37 am","url":"https://shroudstory.com/2014/11/23/how-to-become-famous/","cat":"wikipedia_content","id":"comment-172882","author":"Thomas","site":"shroudstory"},{"title":"How to Become Famous","post":"HF: “Nevertheless, it is impossible not to think that the Stavronitika epitaphios is a direct copy of the Venice one … ”  It may only be a question of whichever came first, and it does not matter a great deal.  Presumably the Venice epitaphios also had a Greek origin.  Unless HF is implying that monks from Mt Athos visited Venice to get their copy, and it’s unclear why they would do that, considering the lack of contact between Constantinople and Europe at this time.  There are too many Shroud-like motifs in the Stavronikita example to dismiss it so easily.\n\n","date":"November 25, 2014 at 2:44 pm","url":"https://shroudstory.com/2014/11/23/how-to-become-famous/","cat":"wikipedia_content","id":"comment-172981","author":"daveb of wellington nz","site":"shroudstory"},{"title":"How to Become Famous","post":"I guess both epitaphioi were made in the same place, or at least the later one was made in the place where the earlier one was at the time. I have no reason to suppose that either of them was made in the place where they now reside.\n\n","date":"November 25, 2014 at 4:58 pm","url":"https://shroudstory.com/2014/11/23/how-to-become-famous/","cat":"wikipedia_content","id":"comment-172988","author":"Hugh Farey","site":"shroudstory"},{"title":"How to Become Famous","post":"My researches on epitaphioi took me to the recent book Warren Woodfin, The Embodied Icon: Liturgical Vestments and Sacramental Power in Byzantium, Oxford ,  2012, pages 122-9. I only consulted it in the Cambridge UL so I am unable to answer your question. However, they did have the stone on which Christ was lain in one of the churches of Constantinople and ceremonies around this were especially sacred. Here are ,of course, many things from the 1204 sack of Constantinople in Venice so I would assume that this was how the epitaphioi got there.\n\n","date":"November 26, 2014 at 2:34 am","url":"https://shroudstory.com/2014/11/23/how-to-become-famous/","cat":"wikipedia_content","id":"comment-173038","author":"Charles Freeman","site":"shroudstory"},{"title":"How to Become Famous","post":"If the Venice epitaphios – dated by Schiller as circa 1200 – was from the sacking of Constantinople, then that points to a tradition of depicting the dead, bloodied and  scourged Christ at least 100 years earlier than Charles’s 1300AD claim of the beginning of that artistic tradition.\nThe epitaphios tradition is very suggestive of a Shroud influence.\nI wonder if the epitaphios tradition is derived from two great relics in Constantinople – the stone of unction, and a / the shroud.\n\n","date":"November 26, 2014 at 3:09 am","url":"https://shroudstory.com/2014/11/23/how-to-become-famous/","cat":"wikipedia_content","id":"comment-173041","author":"Thomas","site":"shroudstory"},{"title":"How to Become Famous","post":"“In 1169/70, Byzantine Emperor Manuel I Komnenos brought the Unction Stone to Constantinople. In 1180 he was buried with the relic, and an inscription on his tomb described Manuel as the new Joseph of Arimethea, because like Joseph he “bare[d] on his shoulders that stone upon which Christ’s body was placed.” In the centuries following the translation of the relic to the imperial capital, imagery featuring the Unction Stone proliferated. Entombments and lamentations were pictured in both wall painting and in other media, most commonly on the embroidered epitaphios, a textile used during the Divine Liturgy. This paper explores the ways the relic, as both literally possessed by the emperor and as pictured in hundreds of images throughout the Byzantine and post-Byzantine worlds, prompted worshipers to reenact the roles of the biblical mourners, and thereby insert themselves more fully into the ritual remembrance of Christ’s Crucifixion and Resurrection.”\nHedrick, Tera. “Mourning Reenacted: The Stone of Unction and Late Byzantine Liturgy”\n\n","date":"November 26, 2014 at 3:12 am","url":"https://shroudstory.com/2014/11/23/how-to-become-famous/","cat":"wikipedia_content","id":"comment-173042","author":"Thomas","site":"shroudstory"}]
