[{"title":"A Quote for this Sunday","post":"This is one of the most intelligent and balanced overviews of the Shroud in the present day-worth reading the entire discussion carefully.  I was glad to have had the opportunity to hear him speak twice during the conference.\n\n","date":"December 21, 2014 at 9:11 am","url":"https://shroudstory.com/2014/12/21/a-quote-for-this-sunday/","cat":"quotations","id":"comment-178182","author":"Kelly Kearse","site":"shroudstory"},{"title":"A Quote for this Sunday","post":"We can go beyond what the paper states. It is correct to employ both science and religion, but the question that arises is how much can science and religion(in the conventional sense) can tell us?\nSince there are two approaches in (pro-authenticity) science, one “naturalist” the other “miraculist”, this is what we must ask:\nNaturalist: Why would only Jesus leave his image on the Shroud by natural means if many like him were executed and buried as criminals by the Romans? Not all bodies were left on the cross to be devoured by wild dogs. Was Jesus not entitled to an air-conditioned tomb?\nMiraculist: “Hundreds of thousands in degrees Celsius lasting for a few hundredths of a second”. One wonders if any measurement is indeed possible.\nTaken from:\nhttps://www.academia.edu/8841978/Professor_Giulio_Fanti_discusses_the_controversies_in_the_realm_of_Shroud_studies\nwhere the differences between the “naturalist” and “miraculist” points of view can be read.\nI now quote John Klotz:\n“If indeed the Shroud is Christ’s and, if science is deciphering its revelation, what is it telling us?”\nIt is a very important question, one gives that gives rise to another query: How much can science decipher and just how much (conventional) religion can interpret?\nIt is known that the Resurrection has no analogy in human history, in fact it is said to have uniqueness par excellence.\nI now quote the (Reformed) Protestant theologian Jürgen Moltmann:\n“The raising of Christ involves not the category of the accidentally new, but the expectational category of the eschatologically new. The eschatologically new event of the resurrection of Christ, however, proves to be a novum ultimum both as against the similarity in ever-recurring reality and also against the comparative dissimilarity of new possibilities emerging in history.”\nWe have not got to the Jesus behind the text. Schweitzer abandoned scholarly studies after publishing his monumental work on the Jesus of history and withdrew into a world of mysticism, running a hospital as a medical missionary in Africa, firmly believing that Jesus comes alive when the Gospels are read.\nWill we get to the Jesus behind the Shroud image?\n\n","date":"December 21, 2014 at 10:11 am","url":"https://shroudstory.com/2014/12/21/a-quote-for-this-sunday/","cat":"quotations","id":"comment-178196","author":"Louis","site":"shroudstory"}]
