[{"title":"Huffington Post: Best Story About the Italian Study","post":"And despite the fact that Dan point out in bold character, Di Lazarro and his team are going out in the media !  BRAVO !!!\n\n","date":"December 21, 2011 at 9:34 am","url":"https://shroudstory.com/2011/12/21/huffington-post-best-story-about-the-italian-study/","cat":"news_&_views","id":"comment-5826","author":"Yannick Clément","site":"shroudstory"},{"title":"Huffington Post: Best Story About the Italian Study","post":"Yannick I think you should understand where that comment that Dan pointed too came from!…Take the link from that article above to the VATICAN INSIDER. I think that article emphasizes more of the details and comments made by DiLazarro et al. I think they were quite open and clear about their study and it’s ramifications or shortcomings.\nR\n\n","date":"December 21, 2011 at 10:24 am","url":"https://shroudstory.com/2011/12/21/huffington-post-best-story-about-the-italian-study/","cat":"news_&_views","id":"comment-5828","author":"Ron","site":"shroudstory"},{"title":"Huffington Post: Best Story About the Italian Study","post":"It seems to me that it is others that are blowing this study and it’s scientists comments way out of proportion and ‘supernaturalizing’ it, if that is actually a word lol ;-)\nR\n\n","date":"December 21, 2011 at 10:28 am","url":"https://shroudstory.com/2011/12/21/huffington-post-best-story-about-the-italian-study/","cat":"news_&_views","id":"comment-5829","author":"Ron","site":"shroudstory"},{"title":"Huffington Post: Best Story About the Italian Study","post":"Hummm, no so sure about that Ron…  Anyway, until they can confirmed their findings by some independent researchers, I think they should avoid any public talk in the media.  And even if those findings can be confirmed, there will always be the question of the validity of their linen samples.  Personally, I think there’s a clear and simple way that they can verify if their coloration is pretty much like the shroud :  they just have to take a sticky tape, put some pressure on their sample and see if they can find some “ghosts” of coloration just like STURP found in their sticky tapes from the Shroud surface (which are particles of coloration that were pulled out by the sticky tapes).  If they don’t find anything, then there’s a good probability that their coloration is not the same than the Shroud (chemically speaking) .  If they do find ghosts of coloration, then the probability would be higher for a match.  But since they didn’t used a linen sample done in the ancient way (with a impurity layer on the surface made of sugars), I seriously doubt that they could find any ghost of coloration in a sticky tape experiment.  Anyway, that would be a very good and quite simple test to propose to Di Lazarro and his team.\n\n","date":"December 21, 2011 at 11:30 am","url":"https://shroudstory.com/2011/12/21/huffington-post-best-story-about-the-italian-study/","cat":"news_&_views","id":"comment-5833","author":"Yannick Clément","site":"shroudstory"},{"title":"Huffington Post: Best Story About the Italian Study","post":"Good idea Yannick,  but I don’t think it would prove much, because as you mentioned, the sample they used was of new linen, so since it is manufactured differently from the ancient linen, we can already ‘suppose’ things would be different on the tape sample and on the linen….they need to use a clone of the ancient linen (as close as feasible) and re-do the experiment, then it may be worth doing your test. But alas we don’t know if 2000 years hasn’t affected the Shroud in other ways also, so there’s another tangent…\nR\n\n","date":"December 22, 2011 at 10:23 pm","url":"https://shroudstory.com/2011/12/21/huffington-post-best-story-about-the-italian-study/","cat":"news_&_views","id":"comment-5991","author":"Ron","site":"shroudstory"}]
