[{"title":"Ignorant indoctrinated and improperly educated theists","post":"Well, this just sums up the poverty of much atheistic thought. It’s an incredibly ignorant and simplistic piece which could easily be challenged on multiple fronts, however I for one have better things to do!\nIt just reminds me so much of some militant socialistic atheists I knew back in my university days, who thought they were oh so clever (but in fact were far less intelligent than they thought).\n\n","date":"December 30, 2013 at 7:25 am","url":"https://shroudstory.com/2013/12/30/ignorant-indoctrinated-and-improperly-educated-theists/","cat":"news_&_views","id":"comment-70067","author":"Matthias","site":"shroudstory"},{"title":"Ignorant indoctrinated and improperly educated theists","post":"No one will accuse Mr. Arel of rational, critical and logical thinking. And the shroud is not hanging in a church. No fact checkers or editors at this magazine.\n\n","date":"December 30, 2013 at 8:33 am","url":"https://shroudstory.com/2013/12/30/ignorant-indoctrinated-and-improperly-educated-theists/","cat":"news_&_views","id":"comment-70100","author":"Paulette","site":"shroudstory"},{"title":"Ignorant indoctrinated and improperly educated theists","post":"Whoever believes that the James ossuary proves the existence of Jesus is absolutely wrong. This is not only due to the fact that the second part of the inscription, saying “akhui d’Yeshua” is a forgery but also because there is contemporary literature other than the NT that talks about the existence of Jesus. The rest is history, and as Renan said, “History is incomprehensible without Christ”\n\n","date":"December 30, 2013 at 8:43 am","url":"https://shroudstory.com/2013/12/30/ignorant-indoctrinated-and-improperly-educated-theists/","cat":"news_&_views","id":"comment-70102","author":"Louis","site":"shroudstory"},{"title":"Ignorant indoctrinated and improperly educated theists","post":"Hmm. This was posted while I was commenting on the one before, specifically pondering what sort of people went to presentations in a church in which highly speculative ideas were presented with absolute conviction and without any qualification. No doubt the contributors to this blog would have listened politely, and possibly asked the presenter quietly during coffe and biscuits how he knew some of his more elaborate reconstructions were true. Sadly, however, I fear that in many cases, “the desire to believe” was indeed the motive behind their attendance in the first place, and having been told what to think, they went away entirely satisfied.\nEven so, the idea that, had they been told equally authoritatively, in the same church, in the same supportive atmosphere, that the shroud was a fake, that they would then have abandoned Christianity, is absurd. Nor do I believe that “it is often stated by theists that they would abandon their faith if the bones of Jesus were found and it was shown he did not rise from the dead.” Astonishingly as it may seem to atheists, the truth of the Resurrection, although attested to by scripture, does not, ultimately, depend on history at all. After Dan Arel has learned to read and write, he may be educated enough to attempt a little theology…\n\n","date":"December 30, 2013 at 9:28 am","url":"https://shroudstory.com/2013/12/30/ignorant-indoctrinated-and-improperly-educated-theists/","cat":"news_&_views","id":"comment-70119","author":"Hugh Farey","site":"shroudstory"},{"title":"Ignorant indoctrinated and improperly educated theists","post":"Ignorance upon ignorance compounded! False generality upon generality! The fellow can’t even write competently! Is this his version of an education? “Physician, heal thyself!” Was he paid for this bit of jounalese?\n\n","date":"December 30, 2013 at 4:03 pm","url":"https://shroudstory.com/2013/12/30/ignorant-indoctrinated-and-improperly-educated-theists/","cat":"news_&_views","id":"comment-70236","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Ignorant indoctrinated and improperly educated theists","post":"“Christians simply refuse to accept any scientific evidence this is a fake and use it often as evidence for Jesus existence.”\nHe also forgot a little thing called an apostophe there.  Oh, dear, I am dying of second-hand embarrassment for that guy.\n\n","date":"January 2, 2014 at 1:23 am","url":"https://shroudstory.com/2013/12/30/ignorant-indoctrinated-and-improperly-educated-theists/","cat":"news_&_views","id":"comment-70980","author":"Susana","site":"shroudstory"}]
