[{"title":"Ignoring the Weight of the Evidence","post":"Lee Harvey Oswald was a sharpshooter and used a bolt-action rifle, which means that although he had the skill to shoot we do not know if he would have time to reload the rifle, aim and shoot again. Other than this, there are many other factors that are unknown to us, and there seems to have been a conspiracy to get rid of the two Kennedy brothers.\nOpinions on the assassination seem to have more to do with bias than with the question of rationality/irrationality. Schopenhauer noted that the human being can be irrational, but that seems to be not only due to bias; the unconscious can be a powerful force dictating many of our decisions. That has paved the way for the debate on determinism versus free will.\n\n","date":"November 24, 2014 at 7:08 am","url":"https://shroudstory.com/2014/11/24/ignoring-the-weight-of-the-evidence/","cat":"news_&_views","id":"comment-172794","author":"Louis","site":"shroudstory"},{"title":"Ignoring the Weight of the Evidence","post":"I get your analogy using Oswald.  But for the sake of accuracy, let’s be clear:  the operation of that bolt rifle in the agreed-upon amount of seconds when JFK was in vew has been tested many times.  It was clearly easily repeated in a number of tests.  Facts are facts.\n\n","date":"November 24, 2014 at 11:14 am","url":"https://shroudstory.com/2014/11/24/ignoring-the-weight-of-the-evidence/","cat":"news_&_views","id":"comment-172813","author":"Nabber","site":"shroudstory"},{"title":"Ignoring the Weight of the Evidence","post":"Oswald acted alone. He did not conspire alone. Beyond that it’s all fascinating speculation.\n\n","date":"November 24, 2014 at 12:01 pm","url":"https://shroudstory.com/2014/11/24/ignoring-the-weight-of-the-evidence/","cat":"news_&_views","id":"comment-172817","author":"David Goulet","site":"shroudstory"},{"title":"Ignoring the Weight of the Evidence","post":"Conspire, yes.  Fact:  Oswald visited (or attempted to visit) the Soviet Embassy in Mexico City.  Because he passed out “Fair Play for Cuba” leaflets in New Orleans, there is just no way to completely know who his contacts were, for that.\n\n","date":"November 24, 2014 at 12:08 pm","url":"https://shroudstory.com/2014/11/24/ignoring-the-weight-of-the-evidence/","cat":"news_&_views","id":"comment-172819","author":"Nabber","site":"shroudstory"}]
