[{"title":"Imagining the Shroud of Turin AGAIN, and still by Mathew N. Schmalz","post":"Admittedly, the phrase “in order to clone Jesus” toward the end of the paragraph is what initially caught my eye, but the two sentences that follow raise some interesting points about the Shroud and the relationship of faith of faith & science.\n” In any case, if religion is about faith, why would any proof be necessary? If God worked in terms of proof, why not appear in the sky and be done with it.”\nThomas was in the inner circle, yet, for him proof was necessary.  For some, tangible evidence is part of the equation-for some it’s not; for others, it might push them closer than they once were…\nI don’t know why God doesn’t appear in the sky and be done with it. He doesn’t seem to work that way.  I suspect He has His reasons.\nIt is difficult for me to understand how science could prove the authenticity of the Shroud.  I don’t think that it can.  Science can only take you so far, up to a certain point,-after that faith must come in.  Perhaps it’s the word “prove” that is a sticking point-it may mean different things to different people.  In the realm of science, it’s a strong word to use.\nReligion is about faith, most certainly, but does this implicitly warrant that science must be quarantined in all matters of religion?  The attraction of the Shroud for many is, it goes without saying, its relationship to faith.  For the believer who is also a scientist, investigation into the physical properties of the Shroud is a natural.  For myself, science & faith are an important part of my identity-together, the two have given me a wonderful life.  I believe that the Shroud once wrapped a human body.  It may or may not have been Jesus.  I think it probably was.  Can science prove this?  It’s very difficult for me to see how.  I am a Christian who is also a scientist.  I am a scientist who is also a Christian.  To me, that isn’t contradictory; a conflict between the two isn’t automatic.  More often than not, I usually agree with myself.      \nIt may be a simplified analogy, and this is not intended to trivialize the subject, but in some ways investigation & discussion of the Shroud may be relatively similar to “proving” an autograph is authentic.  Yes, the looping of the “B” and the slanting of the “R” are right where they should be, that’s important…The ink is consistent with the type of fountain pen that would have been used at that time.  Records indicate that someone named “George Herman” signed into the Hotel Diplomat during the supposed month-actually, there is some discrepancy if it is “Herman” or really “Henmab”-apparently the desk clerk spilled coffee on the middle of that page of the register.  Several cigar stubs (at least one of them was well-chewed, although not sufficiently enough for a dental records match) were reportedly found at a nearby train station.  Could this really be a baseball signed by the Babe, himself?  There are multiple findings that are consistent with the ball being genuine.  It makes sense.  Ol’ grandpa really loved that ball…got it from a friend of his…he kept it on the mantle for years, until it rolled off one afternoon and nearly went into the fireplace…Unless you were there, and handed the ball over to Mr. Ruth, and watched him sign it in person, it is difficult to “prove” that the autograph is real, particularly to anyone else-this becomes further compounded with increasing time.  You weigh the evidence, which is not a standard unit for everyone-opinions will certainly vary-the rest you have to take on faith.\n\n","date":"February 16, 2013 at 9:47 am","url":"https://shroudstory.com/2013/02/16/imagining-the-shroud-of-turin-again-and-still-by-mathew-n-schmalz/","cat":"news_&_views","id":"comment-24437","author":"Kelly Kearse","site":"shroudstory"},{"title":"Imagining the Shroud of Turin AGAIN, and still by Mathew N. Schmalz","post":"What a fascinatng and beautiful set of comments, Kelly, and I like your analogies very much – they’re not trivial at all. \n1.  On Theology:  It is my persistent view that God will not compel belief – He invites it! Come share My Life with me is the invitation.  To reject God in the face of irrefutable proof is the sin against the Holy Spirit for which there can be no forgiveness.  But God is merciful.  So He hides His irrefutable proof, and it still remains an invitation, notwithstanding the five “proofs” by St Thomas Aquinas. \n2.  On Proof:  There are various degrees of proof.  My school years, now long gone, were at the time when Euclid was still part of the core math syllabus.  My teachers were such that we learnt his proofs of geometry, not merely by rote, but by means of logical induction, developing our sense of critical thinking.  In the early 1900s, Russell & Whitehead became dissatisfied with Euclid’s proofs, considering them non-mathematical.  But their project of transforming mathematics into more rigorous logic eventually failed as a result of Godel’s theorems and is now only of antiquarian and specialist interest.  Nevertheless a more rigorous approach in Pure Mathematics did emerge, and mathematical proofs are now seen as the idealised model of irrefutable methods of proof. \nIn the experimental sciences, the concept of proof is necessarily less rigorous than tht of mathematics, and are subject to amendment as new information comes to hand.  However the standard confidence level of 95% commonly used is entirely arbitrary.  In the Social Sciences and Applied Probability exercises, it is even less rigorous, and margins of error are routinely accepted.  I spent some 10 years with an Internal Audit office, and our conclusions had to be weighed on the balance of probabilities, merely sampling transactions on some systematic basis.  In my engineering days, an impatient supervisor once had to inform me that it was only the scientist who could pursue the rigorous truth, and the engineer had to be satisfied with an answer that would suffice for now.  In a court room, the weight of circumstantial evidence is sufficient to secure a conviction.  So there degrees of proof, depending on the circumstances in all matters of human affairs.  \n3. On Faith:  In contrast to rigours of Truth are matters connected with Faith.  We make several life judgements taken merely on faith.  But they are generally based on the degree of faith that we can feel comfortable with based on our experience and knowledge, that is, a rational or informed faith. A bride and groom make their vows based on the confidence they have come to accept in promises made by the other person.  They may be let down or be eventually disappointed, but hopefully their vows may survive despite what life throws at them.  To make life-changing decisions based on snap judgments only is to trivialize faith, and that way lies inevitable disappointment.  \n4.  The Shroud:  Somewhere between the rigorous requirements of scientific truth and an informed faith lies the mystery of the Shroud.  Each one may come to their own decision as to whether this cloth wrapped the divine body of the Saviour of the world or is something else.  For me personally the weight of evidence is too strong to reject it as anything but the former.  It is the love letter left by Jesus, and is meant for our time, to strengthen our faith.\n\n","date":"February 16, 2013 at 4:06 pm","url":"https://shroudstory.com/2013/02/16/imagining-the-shroud-of-turin-again-and-still-by-mathew-n-schmalz/","cat":"news_&_views","id":"comment-24475","author":"daveb of wellington nz","site":"shroudstory"}]
