[{"title":"Is it Reasonable to Believe in the Resurrection?","post":"Quote : “The very same words could be used to describe Jesus’ resurrection, especially in light of the last studies of the Shroud of Turin. Any attempt to replicate the image impressed on the linen has failed, except for by means of radiations, which by the way should be so conspicuous that cannot be obtained in a laboratory.”\nAgain, we have another good example of someone saying false things about the Shroud, scientifically speaking…  This guy take for granted the ENEA’s experiment like if they really had replicate the Shroud body image in every chemical and physical details.  Sorry but this is completely false.  Even Di Lazzaro would not go as far as this guy because himself, he don’t know for sure if the chromophore of the image is really the primary cell wall of the linen fiber or instead, the thin layer of impurity proposed by Rogers.  If Rogers was right my friends, then we would have to conclude that the ENEA’s results are NOT the same than the Shroud body images.  \nWe have to remember a very big truth here :  Something can look like something else but, when you analyse it in deep, you can realise that it’s not exactly the same.  Remember that Jean-Baptiste Rinaudo too was proclaiming that his own experiments with protons had reproduce exactly the Shroud coloration but, in the end, Ray Rogers showed in a very professional manner (in his book) that it was in fact a big misinterpretation on his part (or a big lie…  On this subject, we have to remember that Rinaudo’s agenda seemed pretty evident).  In reality, Rinaudo’s results looked like the Shroud, but they were somewhat different.  I have a feeling that this is exactly the same thing that’s going on with the ENEA’s experiments…  But, here, it’s just my opinion.  More researches need to be done for a definitive answer.\n\n","date":"March 23, 2012 at 2:28 pm","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9547","author":"Yannick Clément","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"“This guy” is me, an Italian woman. I admit that I might have chosen the scientific explanation for the Shroud of Turin offered by the Vatican, which is the one I like the most. I hope you appreciate my honesty.\n\n","date":"March 23, 2012 at 8:26 pm","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9557","author":"Antonella Garofalo","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"Antonella, we do appreciate your honesty. Forgive the gender error, please. Remember, too, that we all seek the truth.Thanks for adding  your voice to this.\n\n","date":"March 23, 2012 at 9:28 pm","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9558","author":"Dan","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"Sorry for the gender error. I was fooled by the picture of the guy !\nAlso, I want to say this :  I don’t understand what you say about the “scientific explanation offered by the Vatican”.  If you think the Vatican claim the Shroud image come from the resurrection of Christ, you’re completely off-track.  This isn’t, by far, the official position of the Catholic Church !  They don’t even say that the Shroud is really authentic.  They leave those question to the scientific community and I don’t think there is a clear scientific answer yet on those topics, namely the cause of the image and the authenticity of the cloth…\n\n","date":"March 24, 2012 at 5:52 pm","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9587","author":"Yannick Clément","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"Hi Yannick! I know that the Vatican is very cautious and doesn’t claim that the Shroud is authentic. However, an American friend went to see the Shroud in Turin and brought back a tape for me. The scientific explanation suggested by the tape was the one from radiations.\n\n","date":"March 24, 2012 at 7:01 pm","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9597","author":"Antonella Garofalo","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"This explanation is very popular right now, I know.  It is even more popular among people (inside and outside the Church) that have the agenda of “physically proving” the resurrection of Christ.  You MUST be very carefull regarding those supernatural explanations.  And remember that this is NOT AT ALL the official position of the Church.  \nOn this topic, I have a very good advice to you (and anyone else) :  Buy the book of Ray Rogers, the head chemist of the STURP team.  When you’ll read it, you’ll note that he didn’t thought one second that the Shroud body images were caused by a supernatural event !  And on the specific hypothesis of radiations, I remember you that he was a top notch expert in this field since he was working in Los Alamos !!!!  \nHere’s the link to buy Rogers book online :  http://www.lulu.com/shop/raymond-n-rogers/a-chemists-perspective-on-the-shroud-of-turin/paperback/product-3278016.html;jsessionid=CCE9A0E2D82701C9F5A982EE2E939A9F\nThe price of the hardcover book is a bit expensive, so I recommand that you do the same than I did :  buy the PDF version !  It is possible to do so on this website…\nAlong with A doctor at calvary from Pierre Barbet, this is, by far, the best book I’ve read about the Shroud.  Honnest and scientific are the words to describe it.\n\n","date":"March 24, 2012 at 8:35 pm","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9607","author":"Yannick Clément","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"I went to the link ‘On the Road to Jerusalem’, the writer being a professed Christian, one Antonella Garafalo.  I rather feel that Ms Garofalo seems to be purloining Richard Feynman’s words to support her own Christian message, and I don’t know that the eminent physicist had anything to say about the ‘Shroud of Turin’ at all.  Note that the quote marks terminate at “… how it works”, and the remaining words are Ms Garofalo’s.\nRichard Feynmann (1918-1988) remade quantum electrodynamics, theory of interaction between light and matter, devised several problem-solving tools, including his Feynmann diagrams an integral part of explaining nuclear and quantum interactions, was recruited during WWII on the Princeton University atomic bomb project (1941-42) and then at Los Alomos Manhattan Project (1943-45) being the youngest group leader there,\nThe Feynman quotes are directed solely at the mysterious world of quantum mechanics for which there is no classical explanation (Einstein spent his last years fruitlessly searching for one), and Ms Garofalo has simply uplifted his words for her own particular message.  I am personally unaware of Feynman’s own religious beliefs although Encyc Brit includes the following extract:\n“Feynman’s views on quantum mechanics, scientific method, the relations between science and religion, and the role of beauty and uncertainty in scientific knowledge are expressed in two models of science writing, again distilled from lectures: The Character of Physical Law (1965) and QED: The Strange Theory of Light and Matter (1985).”\nYannick: – Note that it is not Feynman referring to the ENEA work, but Garofalo!\n\n","date":"March 23, 2012 at 4:25 pm","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9549","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"Yannick, I agree with you. Coming to the part of evidences, also recently pointed out by Daveb, is the point of the presence of aragonite in the Shroud, that seems to be the same as in Jerusalem. This would be a very strong positive evidence………if independently confirmed by different researches. To my surprise, there seems to be very little scientific work published in peer-reviewed journals on this critical issue and yet, if confirmed, it would represent a major evidence that would take the discussion on the scorch to a 1st century Jerusalem. Can anyone expand on the scientific work on this issue?\n\n","date":"March 23, 2012 at 4:26 pm","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9550","author":"Gabriel","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"Good comment Gabriel.  I agree that this aragonite finding is important for the inquiry of the real origin of the Shroud.  And I agree that there it is not a subject often put forward.  It’s kind of a “lost” clue.  It’s important for the geographic localisation of the man of the Shroud and it is, of course, linked to the question of authenticity…  And I can also see that this aragonite finding can also be taken as a clue that go against Zugibe’s hypothesis of a washing of the body !  This question is less important than the other but it still is important in my mind in order to really categorize and understand the blood transfer on the Shroud.  I’ve read somewhere (I think it was on “the list” of facts concerning the Shroud that was published at the Dallas conference of 2005) that they found this aragonite dust on the knee area on the Shroud.  If this could be confirmed, that can be a pretty interesting argument against Zugibe’s washing hypothesis (about this hypothesis, I remember everyone that Pierre Barbet would have been in total disagreement with Zugibe).  Effectively, if there was really aragonite dirt on the knees, the chance that this area was washed is very low, in my mind.  And, in Zugibe’s mind, this is one part of the body that should have been washed in order to clearly see the scourge marks that are present in this area.  In my opinion, if there really is some dirt on the knees, Zugibe’s washing hypothesis have great chances to be incorrect and that could give more credit to Barbet’s opinion about the blood transfer on the Shroud.  Again, that’s only my personal opinion.  First of all, it would need a real scientific confirmation that there really is dirt in the knee area.\n\n","date":"March 23, 2012 at 4:48 pm","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9552","author":"Yannick Clément","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"I never said that Feynman mentioned the Shroud of Turin. What you are holding against my post is self-evident. I just noticed that the point of view of a scientist may be applied to a matter of faith.\n\n","date":"March 23, 2012 at 8:22 pm","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9556","author":"Antonella Garofalo","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"Hi Antonella,  These men know so much about the research surrounding the Shroud that sometimes I think they lose perspective. If Yannick is completely right, then what he’s saying is that he is not willing to take a leap of faith but is waiting for more proof.  Which is not what he means at all, because he IS a man of faith as well. \nIt always comes down to a leap of Faith, and you “leaped” a lot sooner than he would. But I think even if we traveled down his road of research we would eventually come to another “leap” anyway. \nIn other words, sometimes these manly scientists really lose the poetry of the Shroud. I think this is one of those times. I thought your comments were lovely. \nCyndy\n\n","date":"March 23, 2012 at 10:21 pm","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9562","author":"AnnieCee","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"I enjoyed your comments also. Thank you.\nRon\n\n","date":"March 24, 2012 at 8:48 am","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9575","author":"Ron","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"I appreaciate your comment also Annie.  You’re right.  I am a man of faith and I believe the Shroud is authentic but that doesn’t mean I believe the Shroud image came directly from the resurrection of Christ.  Based on all I know about the Shroud and also, based on my personal theological understanding of God (that isn’t far from the official theological position of the Catholic Church), I prefer to think the Shroud image was created by God using natural laws.\nMy point of view on that question is pretty much the same than all the great French pionners of the beginning of the 20th century (Vignon, Delage, Barbet, etc.).  And I really don’t think that the STURP findings about the Shroud can force us to think that those men were wrong in their understanding of the Shroud…  I really believe that if they were still alive today, they would be like me :  Very upset with this crazyness about the so-called “physical proof” of the resurrection that supposedly is present in the body image of the Shroud !!!\n\n","date":"March 24, 2012 at 6:00 pm","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9588","author":"Yannick Clément","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"Gabriel & Yannick: re travertine aragonite limestone; I found a few postings on this matter, and note that Dan had a posting on this site back in Sept 2011. \nI surmise that the initial discovery seems to come from Joseph Kohlbeck, a scientist at the Hercules Aerospace Center, Utah; and Richard Levi-Setti, a scientist at the Enrico Fermi Institute, University of Chicago\nThey concluded that dirt from the roads of Jerusalem (Travertine Aragonite) may be found on the Shroud on the following parts of Jesus’ Body: 1. The nose; 2. The left knee-cap; 3. Both heels . The dirt on the nose and the left knee cap is almost certainly dirt from the road, as Jesus fell under the weight of the heavy cross beam tied over His shoulders. The dirt on the heel area was probably collected as Jesus stood at Calvary (a quarry area in Northern Jerusalem near Golgotha) waiting to be executed by Crucifixion. Joseph Kohlbeck and Richard Levi-Setti compared dirt samples taken from the Shroud with limestone from ancient Jerusalem tombs. \nWeb-site http://www.factsplusfacts.com/travertine.htm has the following extract:\n“Joseph Kohlbeck, Resident Scientist at the Hercules Aerospace Center in Salt Lake, Utah, and Richard Levi-Setti of the Enrico Fermi Institute at the University of Chicago, examined embedded dirt particles taken from the foot region of the Shroud’s surface. Using a high-resolution microprobe, Levi-Setti and Kolbeck compared the spectra of dirt samples taken from the Shroud with samples of a relatively rare form of calcite, travertine aragonite, found near the Damascus Gate in Jerusalem. The chemical signatures of the Shroud samples and the dust found near Golgotha were identical except for some minute fragments of organic cellulous linen fiber that could not be separated from the Shroud samples.”\nWeb-site http://holyshroudguild.org/ceacutesar-barta.html  has the following:\n“New evidence may explain image on Shroud of Turin” by Kohlbeck and Nitowski. Biblical Archeological Review (BAR), vol 12 n. 4, 1986, pp.23-24): By César Barta & Giorgio Bracaglia\nKohlbeck claims that in Jerusalem there is limestone and that this particular limestone is primarily travertine aragonite (New evidence may explain image on Shroud of Turin” by Kohlbeck and Nitowski. Biblical Archeological Review (BAR), vol 12 n. 4, 1986, pp.23-24) In addition, the Jerusalem samples also contained small quantities of iron and strontium but no lead. When a calcium sample from the Shroud was examined, it turned out to be aragonite which also exhibited small amounts of strontium and iron. Dr. Nitowski concluded that the Shroud at one time must have been in Jerusalem.”\n“Excerpt from a letter to Father Otterbein by Dr. Nitowski:\nLimestone (calcium) samples were collected from as far south as 30 miles from Jerusalem to as far north as the Galilee and Mt. Carmel.  As previously reported, Kohlbeck and Damian had matched a heavy calcium concentration from the foot area on the Shroud of Turin to samples collected in Jerusalem. This evidence was called into question, so sampling around Israel was performed to ascertain if such a test was valid. From as close as 30 miles from Jerusalem, the limestone changes and does not match either Jerusalem or the Shroud of Turin. Therefore, the match between Jerusalem and the shroud is a valid one. The Shroud of Turin was indeed in Jerusalem at one time during its history.\nSister Damian of the Cross, OCD (Dr. Eugenia Nitowski)” \nI get the impression that most of these conclusions were reached in 1986.  I also discovered that there were two other current sites, but these had privileged access rights only, possibly confined to specialist members of the STURP group.\nI aslo recall that some of the investigations showed that a sample was exclusive to a particular tomb associated with Holy Sepulchre.  \nIt looks as if an update on this question of travertine aragonite limestone may be needed, and as Gabriel mentions, possibly some further corroboration is required.  The traces of strontium and iron seem particularly significant, and the fact that the travertine aragonite limestone seems confined to within 30 miles of Jerusalem.\n\n","date":"March 23, 2012 at 5:53 pm","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9553","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"Daveb, the privileged access rights only, “Possibly confined to specialist members of the STURP group” is open in most cases for anyone who request permission. The reason I have certain papers restricted is because some are controversial and this gives ample time for corrections by others. Once the papers or letters have been uploaded over a year on the password protected site, it becomes public access to all.  \nAs far as why Kohlbeck’s work not being peered reviewed, I can only formulate an opinion based on the correspondence I have in my possession. These letters will eventually be uploaded at a later date and you then can make your own conclusion.\n\n","date":"March 30, 2012 at 6:17 pm","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9802","author":"giorgioprimary","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"Very interesting connection, Yannick. If aragonite is present the conclusion on the absence of washing is a very clever one.  But, I repeat my question: how solid scientifically speaking is the claim that\ni) aragonite is present\nii)) aragonite composition is the same as that existing in Jerusalem\nAny help would be appreciated\n\n","date":"March 23, 2012 at 7:44 pm","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9555","author":"Gabriel","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"“If aragonite is present the conclusion on the absence of washing is a clever one” …not that clever, if one reads more in depth on Jewish burial customs, one would be aware that areas where (life-blood) had flowed, would be untouched. Meaning they would deliberately wash around ‘most’ all prominant blood flows.\nI don’t believe there is any conclusive (peer-reviewed) evidence to the claim anyways. But even if there was it would not rule out partial washing of the body.\nRon\n\n","date":"March 24, 2012 at 8:44 am","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9574","author":"Ron","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"One must wonder also how the scourge wounds and even the fine detail welts seen between the dumbbell marks could show up if the body was not atleast partially washed. As they would have been dry for hours.\n\n","date":"March 24, 2012 at 10:20 am","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9578","author":"Ron","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"Quote from Ron : “One must wonder also how the scourge wounds and even the fine detail welts seen between the dumbbell marks could show up if the body was not atleast partially washed. As they would have been dry for hours.”\nOn this particular topic, I say again to you :  Read Barbet’s book again !!!  For him, the transfer on the cloth occured because those dried blood clots get humidified again on their surface because of the aqueous environment in which the body was exposed inside the Shroud.  I submit to your attention that this aqueous environment hypothesis can be linked to the image formation hypothesis of Rogers !  For Barbet, it is clear, a dead body can emit water vapors and that could have been enough to re-humidified the blood clots that were over the scourge wounds, so that a mirror image of those wounds could occured.  To this water vapor, I think we can also add the very probable ammoniac gas that could have come out of the body (maybe of every part of the skin, because of a deposit of urea coming from the dried sweat), along other possible amine gas coming from every pores of the skin.  All those different gas could have been well enough to create the aqueous environment proposed by Barbet.\nWhen you look carefully at the nature of the blood stains on the Shroud (the fact that most of them don’t come from liquid blood and the fact that most of them have a serum halo present around them), I have to say that this is really, by far, the most logical and viable hypothesis (scientifically speaking) that I’ve ever read to explain the presence and the nature of the scourge marks on the Shroud.\n\n","date":"March 24, 2012 at 6:14 pm","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9589","author":"Yannick Clément","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"Hi Antonella, It wasn’t clear to me that the initial posting had come from you until I followed up the link.  My first impression, especially with the accompanying picture, was that Feynman was actually being attributed with the comments re resurrection and shroud.  I recalled that he’d worked on the Manhattan Project and the picture showed him as a young man; second thought was that it must be his son.  It wasn’t until I checked out your link that it all became clear.  I merely sought to dispel any similar false impressions that anyone else might have come to.\nMy ref indicates that he did have some views on the relationship between science and religion.  I haven’t followed to discover what these might have been but maybe if you know something about them, perhaps you could expand a little on them with another comment. \nGabriel & Yannick:  My comments #9 above outline what I was able to discover about travertine aragonite limestone, together with a few published refs.  I’m not sure about the degree of corroboration, but there seem to have been about three different scientists involved.  Maybe it’s time to ask someone for a more recent update or if the Kohlbeck / Levi-Setti / Nitowski work has been corroborated, or is still challenged.\n\n","date":"March 24, 2012 at 2:29 am","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9564","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"Thanks Daveb. I agree corroboration is needed because Kohlbeck and Levi-setti references in the original papers seem to be mainly descriptive and not the result of a systematic approach to this issue.\n\n","date":"March 24, 2012 at 4:22 am","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9565","author":"Gabriel","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"As far as I know Feynman wasn’t a man of faith. I quoted him only because I found interesting that his words could be applied to religious thought.\n\n","date":"March 24, 2012 at 7:08 pm","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9599","author":"Antonella Garofalo","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"Gabriel, check Dan’s postings on this site dated 15 & 16 Sept 2011;  There’s quite a bit more, especially re dirt on soles of feet.  Ian Wilson has also published some info on it liaising with Kohlbeck.  What we’d really like to see I think is a peer-reviewed report on their findings, if such is available.  The original results must be somewhere.  It’s too important to be let go too easily.\n\n","date":"March 24, 2012 at 6:14 am","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9567","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"Thanks Daveb, as a matter of fact I began with those posts and the 2 papers you mention, but my concern goes a little bit further. As I mentioned, those two papers seem to be descriptive so a few questions arise: Where are those aragonite samples in 2012? Is there a traceable custody from the shroud to wherever they are now? Are those samples freely available for independent testing with state-of-the art technologies?\nI mean, in the absence of solid literature – like in the case of blood for example- answering those questions is crucial if the aragonite connection with Jerusalem is to be accepted as a scientific fact.\n\n","date":"March 24, 2012 at 6:36 am","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9568","author":"Gabriel","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"I think the dirt samples were originally found by Ray Rogers in some sticky tape samples he took from the Shroud surface in 1978.  I’m pretty sure he still was in possession of those samples at the moment of his death.  I know that after he diead, his friend Barrie Schwortz (who happen to be my friend too !) received pretty much everything that Rogers had that was related to his research on the Shroud.  Many tape samples were among the package.  I will ask Barrie if he know something about those aragonite samples…  I’ll let you know if I get an answer from him.\n\n","date":"March 24, 2012 at 6:20 pm","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9590","author":"Yannick Clément","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"I have been working on this issue a little bit more. Of the two journals mentioned in the post ( Scanning Electron Microscopy and Biblical Archaeology Review) (BAR) the paper published in BAR cannot be expected to go into technical matters on the aragonite due to its orientation. Ok so far. But regarding the other one published in Scanning Electron Microscopy. a quick consultation indicates that this journal does not belong to  the JCR peer-reviewed system (neither does BAR) and does not have an impact factor, so its conclusions, to say the least, cannot be taken as conclusive and therefore, I would say that the claims on the aragonite and limestone are far from being scientifcally supported.\n\n","date":"March 24, 2012 at 7:36 am","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9572","author":"Gabriel","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"Thanks for your researches Gabriel !  Like many things in the Shroud world, it seem that the “fact” about the aragonite dust is far from being proven…  It’s sad to note the great lack of rigor that we see, on one hand, in Shroud research, and on the other hand, in Shroud conferences and lectures !  Very often, people report things as they would be “proven facts” but it’s not the reality !  This lack of rigor and profesionalism is very sad and it is real.\n\n","date":"March 24, 2012 at 6:25 pm","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9591","author":"Yannick Clément","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"\nYannick Clément :Quote from Ron : “One must wonder also how the scourge wounds and even the fine detail welts seen between the dumbbell marks could show up if the body was not atleast partially washed. As they would have been dry for hours.”\nOn this particular topic, I say again to you : Read Barbet’s book again !!! For him, the transfer on the cloth occured because those dried blood clots get humidified again on their surface because of the aqueous environment in which the body was exposed inside the Shroud. I submit to your attention that this aqueous environment hypothesis can be linked to the image formation hypothesis of Rogers ! For Barbet, it is clear, a dead body can emit water vapors and that could have been enough to re-humidified the blood clots that were over the scourge wounds, so that a mirror image of those wounds could occured. To this water vapor, I think we can also add the very probable ammoniac gas that could have come out of the body (maybe of every part of the skin, because of a deposit of urea coming from the dried sweat), along other possible amine gas coming from every pores of the skin. All those different gas could have been well enough to create the aqueous environment proposed by Barbet.\nWhen you look carefully at the nature of the blood stains on the Shroud (the fact that most of them don’t come from liquid blood and the fact that most of them have a serum halo present around them), I have to say that this is really, by far, the most logical and viable hypothesis (scientifically speaking) that I’ve ever read to explain the presence and the nature of the scourge marks on the Shroud.\nYou didn’t read close enough Yannick, Barbet’s ideas may have a possibility of being correct when dealing with the blood clotted dumbbell areas or larger wounds, but it requires alot of suppositions to reach likelihood, and definately is much more reaching to explain the fine definition of the WELTS. Another thing you missed is that the scourge marks in all probability, would be completely dry, possibly even at the preliminary stages of scabbing, as it would have been many hours that had passed since the scourging-approximately 10 hours or more and in open air!.\nRon\n\n","date":"March 24, 2012 at 6:57 pm","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9595","author":"Ron","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"Here Ron, I will just share a personal experiment I’ve made last summer that PROVE me that Barbet’s hypothesis on the blood transfer COULD be correct !!!\nI was on a little walk in the wood near my parent’s house in St-Alexis-des-Monts, Québec, and during the walk, without even note it, I cut myself on the foreharm (probably with a tree branch).  I only note this little cut when I was on my way back.\nThe injury was pretty much like a scourge wound from the Shroud !  I’m serious.  I wish I could have taken some pictures of it back then !  It had pretty much the same shape and the same size.  \nFirst thing to note :  there was absolutely no blood flow !  The blood that came out wasn’t important enough to flow.  It only stayed inside the cut, filling the hole, if I can use this term.  This prove to me that the scourging of Jesus could well have been pretty much like that and that there was not necessarily big blood flow from the scourging, like most commentators have always mention it.  We have to remember that the metal dumbell at the end of the leather tongues wasn’t like the claws we see in the movie the Passion of the Christ !  I agree that, for the leather tongue injuries, it is another story.  But, for the dumbell shape injury, I’m not convinced at all that they would have created big blood flow (or blood loss).\nSecond and most important thing :  I went to my parent’s house and forget about this little injury.  Then, after maybe 6 hours, I had the genious flash to make a little scientific experiment !  I just put some saliva on top of the clotted wound and then, put a piece a kleenex on it and press it gently on the wound.  Guess what happen ?  I found a very clear mirror image of my wound !!!!  EXACTLY WHAT BARBET WAS SAYING IN HIS BOOK !  Again, I wish I had the presence of mind to take some photos !  Too bad I didn’t do it because that was for me a proof that Barbet’s hypothesis was probably correct !  I was a proof that you don’t need a lot of humidity to re-humidify a dried blood clot, even after many hours after the injury had occured !\nRon, you do what you want with my testimony but I just hope you’ll believe that I just say the truth here.  I’m honnest and I don’t make this up !  This little adventure of mine prove to me that if there was some humidity present on the surface of the blood clots, even if they had dried up since a long time, it was enough to produce a mirror image of those clots on the Shroud.  No washing of the wound is necessary to acheive that and my testimony is a proof of that.\nNow, as I say, you do what you want with my testimony…\n\n","date":"March 24, 2012 at 7:51 pm","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9603","author":"Yannick Clément","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"Just to make things more clear, I want to add that I didn’t had to put a lot of saliva on top of the dried blood clot in order to re-humidified it and I didn’t had to push hard on the kleenex in order to get a nice and well-defined mirror image of the wound.  I think those 2 facts are important in order to analyse the possibility that the scourge wounds on the Shroud could have been transferred to the Shroud in a similar way…  And if that is true and Barbet’s hypothesis was right, we have to understand that what did transferred to the Shroud was not complete blood like we could find in his liquid form but just blood material that was on top of the dried blood clot.  I know this is exacly how Alan Adler desribed the blood stains on the Shroud, and on this topic, he completely agreed with Barbet’s opinion…\n\n","date":"March 24, 2012 at 8:10 pm","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9606","author":"Yannick Clément","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"Re Travertine Aragonite Limestone residues reported by Kohlbeck etc:\nI obtained a very prompt response from Barrie, but sadly unless the original samples can be found in the Ray Roger’s files or samples held by STERA and as yet uncatalogued, it may very well be a lost cause.  The 2002 “Restoration” looks like it spelt Doom for any further new sampling. \nPart extract from Barrie’s response:\n“There has been much discussion of this issue on the SSG as well as Dan’s blog. I don’t recall seeing anything solid that indicates this was ever submitted to a peer reviewed journal, although there are a number of references to it in the literature. In checking Ray Roger’s computer, I could not find specifically which of his tape samples he sent Nitowski or whether they were ever returned. He did send her a Raes sample which she did not return.  However, all that took place before most people used computers, so the information might be in the 8 large, unopened boxes of Roger’s files that STERA, Inc. has in their possession.” \n“Our goal is to scan, OCR and archive each document online, and we are searching for funding to allow that to happen. Rogers’ collection will be the first of many we plan to archive, including the collections of several other STURP team members (Robert Dinegar, William Mottern, etc.) and other Shroud scholars like Fr. Albert “Kim” Dreisbach, Jr. There is a lot of important Shroud information in those documents. Our goal is to develop and write a grant that could make the funding for the project possible, but that is a long, slow process.  We are also hoping to find a benefactor who might be willing to fund the archiving project in its entirety.”\n“I am not sure how this type of research could be taken further, in light of the restoration of the Shroud in 2002, when many parts of the cloth were vacuumed.  This could easily have removed the data that could have been studied in the future to answer the Aragonite Limestone question.  I usually don’t make mention of it in my lectures unless someone asks, and I tell them it was reported by reputable scientists but was never peer reviewed. Sadly, the restoration itself may be the biggest obstacle to answering this question.”\n\n","date":"March 24, 2012 at 7:05 pm","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9598","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"I just had a phone conversation with Barrie and he just told me that he had give this response to Dave !  I think Barrie’s opinion is very good on this topic.  I think we can assume that there really was dirt on some tape sample, but that there is still no peer-reviewed proof of that in the scientific litterature.  I really think this question of the aragonite has not been taken seriously enough by the sindonologists because if it was taken seriously, I’m convinced that there would have been more researches on this subject and that some peer-reviewed papers would have came out.  I agree with Barrie that the restoration of 2002 could have taken away all the dirt that could have been present on the cloth…  I hope not, but I have great fear that it’s true.  If it is, I think the only hope that is left would be that Barrie could find the dirt samples in the boxes of Roger’s files…  But you know what ?  I have a feeling that those samples were never returned to him (as it is the case for other samples) !!!  Maybe Nitowski still have those samples in his possession ?  I wouldn’t be surprised.\n\n","date":"March 24, 2012 at 8:00 pm","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9604","author":"Yannick Clément","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"Yannick you wrote: “Maybe Nitowski still have those samples in his possession ? I wouldn’t be surprised.”\nBTW Nitowski WAS an archaeologist and former NUN. SHE died on June 14, 2007…\n\n","date":"March 25, 2012 at 8:15 am","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9619","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"Actually reading on the topic of the 2002 restoration, apparently they did vacuum the cloth, in co-ordinated (sections) and have categorized and sealed all materials taken. From this I would assume they vacuumed the feet area. I know it also mentioned vacuuming the back of the cloth, which coulds still carry limestone remnants from the tomb.\nI can understand the Vatican’s choice of not carrying out another radiocarbon-dating test, but I truly do not understand their reluctance to permit another STURP type study on it, as in a non-intrusive multifaceted test. There is so much more we could learn from such a test and many questions could possibly be answered, especially with today’s newer technologies!…Big question is; How do we convince the Vatican to allow such testing?\nRon\n\n","date":"March 25, 2012 at 5:22 am","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9613","author":"Ron","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"I think one of the thing that the Shroud custodians were mad at is the fact that many samples taken from STURP and also some more taken from the Italian team that analysed the Shroud before the STURP team in 1978 were scattered all over the world and many of them were completely lost (the best example is the “aragonite” samples) !!!  This situation had the result of making “suspect” any supposed “shroud sample”.  Not good for any seek of truth !  Now, anyone can claim to make research on a real shroud sample while there’s absolutely no way to be sure if this is really the case !  I really think the whole sample thing was really mismanaged and I’m sure that’s one aspect that really bothered the custodians of the Shroud, and maybe that’s the main reason that a new series of direct researches on the Shroud never came to light…\n\n","date":"March 25, 2012 at 8:16 pm","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9646","author":"Yannick Clément","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"Yannick you wrote: “If aragonite is present the conclusion on the absence of washing is a clever one”\nActually it is not that clever (I do agree with Ron). The presence of dust (on the nose, knee and sole areas) is totally consistent with one of the most specific washing & drying-up possible scenari I already developed on this blog viz. Yeshua might well have been, first, tightly wrapped up in a watery solution soaked inner shroud both to purify his shed innocent blood and keep it with his body and then his body been subjected to a myrrhic-aleotic fumigation. This specific form of washing/purifying ritual definitely CANNOT be ruled out AT ALL by the presence of Jerusalem dust on the Shroud. BTW, besides the nose, knee and sole areas, it does seem that no other Shroud areas has been searched for the presenc/absence of additional dust.\n\n","date":"March 25, 2012 at 8:53 am","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9621","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"Max, what can I say, I just don’t agree with you.  If there is really a presence of dust in the knee area, I think the good old Occam razor’s principle would say that the most likely conclusion is that there was no washing at all.  I know it is not a 100% sure conclusion, but I also know that it is the most likely…  That’s how I analyse this possible presence of dirt in the knee and the nose area.\n\n","date":"March 25, 2012 at 3:50 pm","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9635","author":"Yannick Clément","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"Yannick, \n To simply disagree with me (on NO philogical, exegetical, historical, archaeological or legal ground) is a little bit TOO SHORT.\n  Actually, your chronic denial of any forms of washing (whether direct or indirect) of Yeshua’s body rests, first and foremost, on A DIE HARD RECEIVED IDEA namely Yeshua’s burial (which happened to fall on a Friday, Preparation Day on Nissan 14th) was mostly hasty (within half an hour or so) and consequently incomplete/interrupted to preserve the sanctity of the impending great Sabbath of Passover (as you imply). From which you still most SUBJECTIVELY infer the women who returned on the third day were to anoint AND wash his body. Actually there is a great deal more flexibility involved then just the ‘hard stop at astrophysical sundown view’.\nIn the hypothesis the Shroud is Yeshua’s, the TRUE FACTS to be taken into account are: \n–By Judean tradition, Passover begins at twilight, the dividing line between Nissan 14 and 15, NOT at sunset.\n–Yeshua was not executed by the Judean Supreme Court/Sanhedrin but by the Roman state. Had the Sanhedrin executed him, no rites whatsoever should have been observed (Semahot II.6; b. Sanh. 63a).\n–Yeshua as a Sage was given an honorable burial by at least two of his secret disciples (all the more so because of the shedding of his innocent blood).\n–Because of Deuteronomy, Yeshua’s body was to be taken down the cross as soon as possible on Preparation Day which means Yosseph Ha-Ramatayim JUST CANNOT have awaited sunset (i.e. 2:30 after Yeshua’s death) and, then and only then, attended to the business of Yeshua’s corpse (i.e. to have gone to Pilate’s to ask for the body, bought a burial cloth and taken Yeshua’s body down the cross). He attended to the business of his secret master’ corpse as soon as the latter died on the cross i.e. at the 9th hour (about 15:00).\n–By Judean tradition in the Land of Israel in the Second Temple period, the Sage buried in a cave tomb used to be visited during the three or seven days immediately following his death (in the Gospels the women were to anoint Yeshua’s linen wrappings with perfumed spicy oils to mask bad odors on honorary visits to the cave-tomb on the third day NOT to handle and wash Yeshua’s naked body on that same day.\n–Because of the Oral Torah observance, the women were not allowed to prepare (more specifically to grind) spices on Sabbath. Had they prepare them beforehand, then and only then, they would have been allowed to anoint Yeshua’s linen wrappings even into the Sabbath (B. Shab. 23.5).\n–As the first star appeared in the sky, the buriers sealed the tomb entrance with a “rolling stone”. Micro traces of granulized myrrh were detected on the pre-burial sudarium/soudâra — now kept in Oviedo, Spain, — left inside the sole funerary niche of Yeshua’s cave-tomb. Had Yeshua’s been buried into the Sabbath, by the Oral Torah his buriers (a minimum of 4 to form a Holy Brotherhood) would have been allowed to proceed to the preliminary disposal of the body (including its anointing, washing and placing on sand, salt or myrrh) as it took precedence over celebration of the Sabbath (B. Shab. 23.5). \n  Now putting these 7 Judean ethnic milieu and evangelical puzzle pieces together, one should be more than aware that Yeshua’s burial must have occurred within a 4:00 maximum time frame (i.e. immediately after his death on the cross at the 9th hour to the apparition of 3rd star as the dividing time marker between Nissan 14th and 15th). There was no problem to duly complete the specific main burial procedures within a minimum time frame of 2:30 (see one of my previous posts on this blog).\n  Hence to assert Yeshua’s burial main procedures were not duly completed on Preparation Day, Nissan 14th and his body was still to be washed and anointed on the third day so as to preserve the sanctity of the Sabbath (as you imply) is to be totally ignorant of the Hebrew time markers of the day, Judean ethnic milieu burial customs and practices and, last but not the least, Oral Torah. In other words, Yannick, the interpretation you borrowed from Fr Benoît, a Dominican, is cheer anachronism.\n\n","date":"March 26, 2012 at 1:48 pm","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9658","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"Correction: “As the 3rd star appeared”\n\n","date":"March 27, 2012 at 8:29 am","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9690","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"Corrections:\n“Actually there is a great deal more flexibility involved THAN just the ‘hard stop at astrophysical sundown view’”.\n“Yannick, the interpretation you borrowed from Fr. Benoît, a Dominican, is SHEER anachronism”.\n\n","date":"March 26, 2012 at 7:00 pm","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9674","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"This came from the 1969 article written by Maurus Green.  I’m sure this monk Benoît is not the only one to have this point of view about the partial burial of Jesus on friday and it is pretty consistent with the Gospels and the Shroud.  What do you want more Max to be convinced that it was most probably hasty ?  Of course, nobody can really prove this claim, but many elements exist that point in that direction…\n\n","date":"March 27, 2012 at 3:45 pm","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9702","author":"Yannick Clément","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"Many elements point to it not being a hasty burial also!!!. It can be consistent with the Gospels also, as they only state it was ‘hurried’ because of the dawning Sabbath. What did that mean exactly? No one knows for sure. Some in the know have concluded a proper Jewish burial could be basically completed in a short period of time. Ask yourself this question; How long would it take someone to ‘partially’ wipe a body down? Ask yourself; How many people were present to accomplish this ritual? And what did the Jewish laws state about ‘Eve of Sabbath’ burials’? Then tell us which is more likely.\nRon\n\n","date":"March 27, 2012 at 6:10 pm","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9706","author":"Ron","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"Yannick, \n  Most obviously, your last comment DOES prove once more you just CANNOT REALLY THINK OR/AND SERIOUSLY SEARCH BY YOURSELF. Fr. Benoît’s opinion you reported via Green does prove only one thing: THEIR DEFINITELY BEING ignorant in such matters. \n “Your” blindfolded opinion, borrowed from your medical, historical and exegetical gurus, has you believe Yeshua’s burial was only a pre-burial done within half an hour or so and the women had to return on the third day to complete it in terms of handling, anointing and washing his body. \n Shall I repeat here, in the Judean ethnic milieu of the Second Temple period, A QUICK BURIAL IS DEFINITELY NOT A QUICK INCOMPLETE BURIAL as you most subjectively/biasely imply in blatant contradiction with the Oral Torah. \n  According to the oral Torah: “For all other [except his father or mother], he should HASTEN the burial and not make the funeral elaborate. […] In an emergency, however, or on Sabbath Eve […], he should HASTE the burial and not prolong the funeral.” [Semahot IX.9] \n  Besides and curiously enough, you do seem not to make any difference between a maximum 0:30 and a minimum 2:30 time frame for Yeshua’s burial or, to put in other words, between a VERY HASTY and a SIMPLY HASTY burial. You also do seem to superbly ignore the fact that the preliminary disposal of the body (including its anointing, washing and placing on sand, salt or blended perfumes) took precedence over celebration of the Sabbath (B. Shab. 23.5).\n  The very fact that YESHUA’S BURIAL SHOULD BE HASTENED DOESN’T IMPLY AT ALL the core procedures were not done (included washing and purification). \n  Actually, true Shroud Science based on the Gospels, Hebrew Bible, Oral Torah, Judean burial customs & practices of the Second Temple period, pre-70CE Judaism History, Philology, Archaeology, Archaeoastronomy does point in one direction, with nothing (or next to nothing) to suggest the contrary: Yeshua’s burial  was completed (to the sole technical exception of the custom of anointing his linen wrappings).\n  (In all likelihood, pre-burial linen napkins or strips were used to clean Yeshua’s face and body. In the light of the fresh-looking neat wound blood decals on the Shroud, it appears that the linen napkins or strips should have simply been placed on the face and whole body to absorb the blood as much as possible, but not used in any kind of wiping movement. This simplified yet careful washing might well have been completed by purification namely the use of the water/watery solution soaked inner shroud made naturally soapy to purify Yeshua’s shed innocent blood and keep it with his body through rapid drying-up (namely subjection of the tightly fastened body to myrrhic-aloetic/aloetic fumigation). This specific simplified washing via linen napkins or strips and purification via the inner shroud just made soapy (with the water of the Red Heiffer?) and subsequent rapid drying-up through fumigation could well account for possible micro traces of Jerusalem malky stone dust to be still detected on the shroud in the foot sole/knee/nose/ areas).\n\n","date":"March 28, 2012 at 1:27 pm","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9733","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"Quote : “Ask yourself this question; How long would it take someone to ‘partially’ wipe a body down? Ask yourself; How many people were present to accomplish this ritual? And what did the Jewish laws state about ‘Eve of Sabbath’ burials’? Then tell us which is more likely.”\nI would answer :  Most probably, a hasty partial burial because, Ron, you forget one important fact :  the burial of Jesus wasn’t prepared at all !!!!  First, nobody beside Judas knew that Jesus would be arrested on thurday night and at that time, nobody knew that he would be crucified.  And when he was crucified, nobody knew that his body could be buried normally in a normal tomb and not thrown into a common grave with the other victims.  When it was clear that the body could be buried in the tomb of Joseph, what time do you think it was ???  Much more than 3 o’clock of the afternoon for sure !   That doesn’t left many time to buy or found a decent shroud and buy or prepared aloes and myrrh (probably in some solid form) to put around the body to avoid bad odors on Sunday morning…  \nAnd if we take into account the experiments and conclusions of the Spanish team of sindonologists on the Sudarium of Oviedo, they say that it took around 2 hours after death before the body could reach the tomb !   And if we take into account the Gospels, they say that the women did return on Sunday morning to finish the burial.\nAll those clues point in one direction :  a hasty partial burial.  I don’t see why they would have do anything on Friday except putting the body into the Shroud and putting aloes and myrrh in bags all around the body (maybe inside the shroud) to avoid the bad odors on Sunday morning, and then rolling the great stone to close the entrance of the tomb.  Why losing time on other things (like the washing of the body for example) in a context where the Sabbath and the Passover feast were about to start and while they knew all along that, no matter what, they had to come back on Sunday morning ?\n\n","date":"March 30, 2012 at 3:38 pm","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9801","author":"Yannick Clément","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"Correction: “philological “\n\n","date":"March 26, 2012 at 7:01 pm","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9675","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"Correction: “the core procedure of Yeshua’s burial was done at twilight on Friday (the women returned on the third day not to handle, wash and wrapped again his naked body but to perform the 1st century Judean custom of anointing a Hakham/Sage’s linen wrappings for honorary visits to him inside his burial-cave)\n\n","date":"March 30, 2012 at 11:52 am","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9797","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"Correction: “wrap”\n\n","date":"March 30, 2012 at 11:53 am","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9798","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"\nYannick Clément :Quote : “Ask yourself this question; How long would it take someone to ‘partially’ wipe a body down? Ask yourself; How many people were present to accomplish this ritual? And what did the Jewish laws state about ‘Eve of Sabbath’ burials’? Then tell us which is more likely.”\nI would answer : Most probably, a hasty partial burial because, Ron, you forget one important fact : the burial of Jesus wasn’t prepared at all !!!! First, nobody beside Judas knew that Jesus would be arrested on thurday night and at that time, nobody knew that he would be crucified. And when he was crucified, nobody knew that his body could be buried normally in a normal tomb and not thrown into a common grave with the other victims. When it was clear that the body could be buried in the tomb of Joseph, what time do you think it was ??? Much more than 3 o’clock of the afternoon for sure ! That doesn’t left many time to buy or found a decent shroud and buy or prepared aloes and myrrh (probably in some solid form) to put around the body to avoid bad odors on Sunday morning…\nAnd if we take into account the experiments and conclusions of the Spanish team of sindonologists on the Sudarium of Oviedo, they say that it took around 2 hours after death before the body could reach the tomb ! And if we take into account the Gospels, they say that the women did return on Sunday morning to finish the burial.\nAll those clues point in one direction : a hasty partial burial. I don’t see why they would have do anything on Friday except putting the body into the Shroud and putting aloes and myrrh in bags all around the body (maybe inside the shroud) to avoid the bad odors on Sunday morning, and then rolling the great stone to close the entrance of the tomb. Why losing time on other things (like the washing of the body for example) in a context where the Sabbath and the Passover feast were about to start and while they knew all along that, no matter what, they had to come back on Sunday morning ?\nYou didn’t manage to answer one of my questions, at all…nothing!. You just managed to repeat points I intorduced to time interval, as to the Sudarium conclusions!….Answer the specific questions Yannick.\nYour also a little dillusional if you think there are absolutely no signs of even a ‘partial washing’ my friend. Remember one point; Jesus, from the 140+ wounds he suffered; his body would have been almost completely covered in blood, that means all surfaces….So why only blood be only in some areas and not all surfaces such as the torso or arms legs completely? …If humidity, or sweat, or whatever was the cause?\nR\n\n","date":"March 30, 2012 at 6:41 pm","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9807","author":"Ron","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"Good question !  But your assumptions that the body was full covered of blood clots is simply that :  an assumption !  Who can be so sure about that ?  \nRemember what I said the other day about my own little experiment I’ve made last summer ?  The cut was deep enough that blood came out on the skin, but there was not enough blood to make some blood flow on my arm !  Why wouldn’t it be the same for Jesus scourging ?  Remember that the metal balls of a Roman flagrum are not supposed to cut the skin that much, but to make deep bruises instead.  I’ve once talked about that with Thibault Heimburger from France (a doctor who is also a sindonologist) and he agreed with me on this specific point.  He also think that there is some possibility that the metal balls injuries didn’t provoke a great blood flow.  And I can say that even if there was some minor flows, there’s a very great probability that those little flows were completely washed by the important sweating of the victim.  \nHaving say that, I have to say also that, for the leather tongues of the flagrum, it’s another story (I’ve already mention this in another comment).  Most probably, those tongues would cut the skin and provoke some blood flows.  But if you look closely at some Shroud photos, there is not that much leather tongues marks.  Personally, I see them mostly around the thighs and not much in the back or elsewhere.  Maybe it is due to the way the Romans were using the flagrum ?  Maybe the leather tongues were not touching the skin that often, but the way they would use it gave the result that almost only the end of the tongues (with the metal balls) were touching the skin ?  When I look at photos of the Shroud, that’s the impresion I have.  I really don’t have the impression that, normally, there was a very long portion of the leather tongues that were touching the skin.  The fact that the most evident leather tongues marks are located around the thighs is a sign that my feeling can be true, because this particular location seem to mean that the only times a good portion of the leather tongues were touching (and cutting) the skin, it was when there was a hit done from behind but that was done around the body in order to hurt the front of the body.  Beside those hits on the front of the body (that would have been in minority versus the hits on the back part of the body), I think the marks we see on the Shroud seem to indicate that there was not a long portion of the tongues that were touching the body (again, I suppose this could be due to the particular way the Romans could have used the flagrum).  Of course, all I just said is just my personnal interpretation of the blood marks on the Shroud and I can be totally wrong regarding the reality.  But I think my point of view is interesting and deserve some thoughts.\nNow, I can answer your question by saying that my hypothesis can, at least partially, explain why the blood on the Shroud seem to be not enough versus what we assume of a Roman crucifixion.  I think the very important sweating of a tortured victim could have washed a good portion of the blood on the skin that was not clotted yet.  Also, we cannot forget the possibility that, during the crucifixion or shortly after, there could have been some rain that would surely have washed the body.  And we also have to think of the possibility that, because of the traumatic state of the body, the blood that was present in injuries like the scourge marks could have taken more time to clot than the blood that would have been flowing on the skin.  Maybe the traumatic state of the body would have produced some natural products in the blood (like bilirubin, urea, lactic acid, etc.) in greater quantity than normal and that those natural products would have retarded the clotting process, particularly in and near the injuries ?  Barbet in his book also talk about the good probability that most injuries would have been infected in some way.  If this was the case, I think there’s some chances that this also could have retarded the clotting process, especially for the blood in and near those injuries (like the scourge injuries).  In this context, the blood marks we see on the Shroud would be only the blood that would have clotted during a time frame that would hallowed this clotted blood to be humidified again on their surface in order to be able to produce a mirror image.  All the other blood clots (particularly the ones that would have came from blood flowing out of the injuries) would have dried too fast, with the result of producing clots that were too old when there was some kind of humidity around the body.  In this context, those clots would have been too old to be able to leave any kind of mirror image.  Those blood clots would have been present on the skin of the man on the Shroud, but would not have left any traces on the cloth.\nAll this is my personal point of view and you can disagree with me of course.  And please, don’t get so mad at me when I say something that doesn’t fit with what you believe.  On the contrary, just ask yourself the question :  Can Yannick’s idea can be right after all ?  Who knows ?\nAnd, before finishing this long reply, I know one objection that you can say :  if there was more blood clots on the skin, why we can see a body image on the Shroud while we know for a fact that the blood that was transferred on the cloth was able to prevent any image formation ?  First I would say that the kind of blood that was able to prevent any image formation is some blood material in a liquid state that was able to produce a mirror image of some blood clots (mostly blood clots that came from injuries) on the cloth.  Scientifically speaking, it is impossible to be sure if this would be the case for some blood, not in liquid form, but in a clotted and dried state.  And more important, if the image formation process come from some natural and biologic products present on the skin (who came from the body and were left there by the drying sweat), how can we be sure that those products (that would have most probably been present also on the dried blood clots) would not have been able to produce a body image on the cloth ?  Effectively, if this hypothesis is correct, those products would have been in direct contact (or close proximity) with the cloth, between the dried blood clots and the Shroud.  There would have been no screen of any kind (on the contrary of the liquid blood screen of the mirror images) between those products and the cloth in order to prevent the formation of a body image !!!  I’m sure you understand what I’m trying to say.  If the scenario I’ve just develop is correct about the blood transfer on the Shroud, I think the fact that we mostly see blood images that come from injuries (and not much stains coming from blood flows) is very consistent with a natural and chemical image formation process that would have originated from some biological products present on the skin…\nThat’s a scenario I like very much and that came into my brain while looking again and again at some Shroud photos while trying to keep in mind what Pierre Barbet said about the blood.  Who knows ?  Maybe I’m not so far from the truth.  Or maybe I’m completely off-track !!! ;-)  But, in the end, I think my scenario deserve some clever thoughts.  Don’t you think ?\n\n","date":"March 30, 2012 at 8:06 pm","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9810","author":"Yannick Clément","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"One precision about what I said about the fact that I mostly see long leather tongues injuries around the thighs area and nowhere else.  In fact, when I look elsewhere on the Shroud body image, the marks always seem to be more like dumbell shape marks than long leather tongues like we can see in the thighs area (particularly in the frontal image).  Of course, we can see some marks that looks like leather tongues injury somewhere else (along with the dumbell shape marks) but they don’t look very long.  In fact, the scourge marks that are the most evident ones are definately the dumbell shape marks coming from the metal balls (or bones) at the end of the tongues than long leather tongues marks that we are used to see in many artworks.  Again, I think this is mainly due to the very particular way the Roman could have used the flagrum and that would have the effect that just the end of the tongues would normally hit the skin.  Also, the fact that we see much more dumbell shape marks than leather tongues marks on the Shroud (unlike most Christian artiwork from any period of time) is another good indicator that go against any idea of a forger using any artwork method to create a false relic.\n\n","date":"March 30, 2012 at 8:21 pm","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9811","author":"Yannick Clément","site":"shroudstory"},{"title":"Is it Reasonable to Believe in the Resurrection?","post":"Yannick,\nIn the hypothesis the Shroud man is Yeshua’s and as far as his burial is concerned in the light of the famous relic kept in Turin, you are free to ignore the legal, customary and historical data (see Deuteronomy 21:23b, the Oral Torah tractates Semahot, Sanhedrin, Pessah and Sabbath and Flavius Joseph). You are free to ignore the Gospels’ philological data (in terms of Hebrew time markers; Hebrew and Greek object markers; Greek action markers). You are free to think Dr. Villalain’s temporal reconstruction from Yeshua’s pre-burial napkin (known as the Sudarium of Oviedo) is a proven fact when actually his opinion does need to be confirmed by independent studies (e.g. can you tell me how Villalain can exactly determine Yeshua’s body and daytime temperatures, general weather conditions on crucifixion day and discriminate between a man lying with a headdress on at a foot of a cross and inside a tomb antechamber?). You are free to think Yosseph Ha-Ramathayim waited sunset (i.e. 2 hours) until he attended to the business of Yeshua’s corpse. You are free to think it took 2 hours for a holy group of a minimum 4 buriers to just drape naturally the Shroud about Yeshua’s body, loosely bind the latter with a long linen strip and seal tomb entrance. Or to put it in other words, you are free to believe in your HIGHLY SPECULATIVE blabla just fit to convince gullible readers but just don’t expect me or any other serious Shroud researchers to take you seriously…\n\n","date":"April 3, 2012 at 12:45 pm","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","id":"comment-9915","author":"Max Patrick Hamon","site":"shroudstory"}]
