[{"title":"Is Pope Francis a Chemist?","post":"So what? He is the Pope and for that he is qualified. Why did you even bring this up?\n\n","date":"March 14, 2013 at 9:23 am","url":"https://shroudstory.com/2013/03/14/is-pope-francis-a-chemist/","cat":"news_&_views","id":"comment-27290","author":"Frank Ly","site":"shroudstory"},{"title":"Is Pope Francis a Chemist?","post":"I agree. I like what I see in Francis I. With hundreds of news outlets saying he has a masters in chemistry or that he is a chemical engineer or, very significantly, that he is the first pope to have been a scientist, I want to believe it is so. I do, actually (maybe something equivalent to a masters). But, questions have been raised in a very prominent place, his Wikipedia profile. As with the Shroud, I am most interested in finding out the truth. Amd I don’t run from questions.\n\n","date":"March 14, 2013 at 9:39 am","url":"https://shroudstory.com/2013/03/14/is-pope-francis-a-chemist/","cat":"news_&_views","id":"comment-27293","author":"Dan","site":"shroudstory"},{"title":"Is Pope Francis a Chemist?","post":"The jesuits have been represented, perhaps more than any other identifiable Catholic group in Shroud studies combining in all cases, both a scientific and theological approach. Fathers Filas, Jorge Loring and Carreira have addressed this subject and as I mentioned in a previous comment, even the Pope Francis has at least, tangentially shown some interest and prefaced a book which includes a chapter on the Shroud. Some of these fathers can exhibit solid scientific credentials.\nThere is no way to know whether these persons have acted individually and converged by pure chance in this field or it all, reflects a genuine interest by the Order of the Jesuits as such on this relic. If this is the case and knowing how Jesuits are, in my view, it would not be strange that we could see moves on this subject in the next months.\n\n","date":"March 14, 2013 at 3:42 pm","url":"https://shroudstory.com/2013/03/14/is-pope-francis-a-chemist/","cat":"news_&_views","id":"comment-27310","author":"Gabriel","site":"shroudstory"},{"title":"Is Pope Francis a Chemist?","post":"And let us not omit Jesuit scholar Reverend Herbert Thurston, who seems to have conspired to misrepresent the D’Arcis memorandum as demonstrating that the Shroud of Turin was a medieval fraud, soon after Secondo Pia’s first photographs, and when agnostic Sorbonne Anatomy Professor Yves Delage was asserting that it was in fact genuine. Recall that even in the 1930s, Father Rinaldi seeking an opinion was referred by his Jesuit superiors to Thurston’s work. I am unaware that the Jesuits have yet repudiated Thurston’s assertions.  Scholarly gentlemen that they are, as individuals they seem to exercise an independent spirit – I doubt if there is any kind of official unanimity among the Jesuits on the authenticity of the Shroud, notwithstanding that a number of them have contributed to useful research.\n\n","date":"March 14, 2013 at 4:48 pm","url":"https://shroudstory.com/2013/03/14/is-pope-francis-a-chemist/","cat":"news_&_views","id":"comment-27314","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Is Pope Francis a Chemist?","post":"According to Biography (an A&E Network Channel and website, biography.com), which claims: “Fact Check: We strive for accuracy and fairness. If you see something that doesn’t look right, contact us!”:\n“Following his high school graduation, he enrolled at the University of Buenos Aires, where he received a master’s degree in chemistry before beginning training at the Jesuit seminary of Villa Devoto. In March 1958, he entered the Society of Jesus.\n“Bergoglio went on to attend the Philosophical and Theological Faculty of San Miguel, where he earned a degree in philosophy, and later received a doctorate in theology in Freiburg, Germany.”\nOver at Wikipedia, they are still duking it out with multiple revisions. So far there have been no other references in support of the masters other than another article in Catholic Heralld that goes back to 2005.\n\n","date":"March 15, 2013 at 5:57 am","url":"https://shroudstory.com/2013/03/14/is-pope-francis-a-chemist/","cat":"news_&_views","id":"comment-27345","author":"Dan","site":"shroudstory"}]
