[{"title":"At least as potent as the finest icons","post":"Philosophers are fine, until they begin to stick -ism on the end of their adverbs. \nScientists who develop a gut feeling about something –  over and above the mundane business of thinking  – should be allowed to be “positive”, without having the charge of positivism, nay, lay it on with a trowel, fundamentalism, laid at their door… \nWho’s guilty here of fundamentalism? It’s certainly not the scientist whose thoughts have maybe crystallized, aided perhaps by some gut feeling…\n\n","date":"April 27, 2013 at 11:04 am","url":"https://shroudstory.com/2013/04/27/at-least-as-potent-as-the-finest-icons/","cat":"news_&_views","id":"comment-32048","author":"colinsberry","site":"shroudstory"},{"title":"At least as potent as the finest icons","post":"Oh, and what pray tell me, are the ‘”finest icons”?  Do list them.\n\n","date":"April 27, 2013 at 12:41 pm","url":"https://shroudstory.com/2013/04/27/at-least-as-potent-as-the-finest-icons/","cat":"news_&_views","id":"comment-32061","author":"colinsberry","site":"shroudstory"},{"title":"At least as potent as the finest icons","post":"The history of Science is replete with examples of conflicts between contending parties, equally “positive” of their own particular views based on their own “fundamental” concepts, from objections to Niklaus Steno’s stratigraphy in the 17th century to Ernst Mach’s empirical objections to Boltzman’s atom as late as 1905. Check any one of Hal Hellman’s texts in his “Great Feuds” series – Math, Science, Technology or Medicine.  \nThe Science of Chemistry apparently does not extend to the perception of what constitutes a fine icon. \nMinor technical note: The words “positive” and “fundamental” are more properly classified as ‘adjectives’ rather than ‘adverbs’.  Other disciplines also have their rigour.\n\n","date":"April 27, 2013 at 4:41 pm","url":"https://shroudstory.com/2013/04/27/at-least-as-potent-as-the-finest-icons/","cat":"news_&_views","id":"comment-32081","author":"daveb of wellington nz","site":"shroudstory"},{"title":"At least as potent as the finest icons","post":"“Minor technical note: The words “positive” and “fundamental” are more properly classified as ‘adjectives’ rather than ‘adverbs’. Other disciplines also have their rigour.!\nNonsense. The source material used each term with -ism on the end. There was no attempt to use them to qualify nouns – so they were not being used as adjectives. If stripped of their -isms they would be free-standing, and as such would be adverbs.\nIt should be clear from the context that the writer intended us to read “positivism” as in logical positivism, and “fundamentalism” as in religious fundamentalism. He was employing what he was confident that kindred spirits would recognize as coded, pejorative labels. Why else refer to “philosophical muck”? Sorry, Daveb, but in seeing this an an exercise in English grammar, and in trying to act schoolmaster, you have not only shown the deficit in your own understanding of syntax, but have spectacularly missed what the writer is/was trying to do, namely to engage in genteel demonisation of Shroud sceptics.\nAh yes, demonising one’s perceived ideological opponent. It’s a game that anyone can play – and – philosophically speaking – a pretty shabby and disreputable endeavour at that – one with a long dark history.\n\n","date":"April 28, 2013 at 12:53 am","url":"https://shroudstory.com/2013/04/27/at-least-as-potent-as-the-finest-icons/","cat":"news_&_views","id":"comment-32111","author":"colinsberry","site":"shroudstory"},{"title":"At least as potent as the finest icons","post":"Colin, Stick to chemistry. Don’t get into marking any undergraduate’s paper in English grammar, you’ll fluff it! A quick check of any reputable English dictionary will identify the grammar classification of the words ‘positive’ and ‘fundamental’. Nowhere will you find they’re given as adverbs; they’d need an -ly suffix.  \nAs for demonising one’s ideological opponents. Qui moi? I love them! They help my little grey cells to keep ticking over!\n\n","date":"April 28, 2013 at 3:46 am","url":"https://shroudstory.com/2013/04/27/at-least-as-potent-as-the-finest-icons/","cat":"news_&_views","id":"comment-32121","author":"daveb of wellington nz","site":"shroudstory"},{"title":"At least as potent as the finest icons","post":"I can assure you that colinsberry has it right. I’m referring to Positivism and Fundamentalism as fairly standard terminology in studying the philosophy of religion.\nAs far as “finest icons” I would include anything from the the various Pantocrators (I’m partial to the image from St Catherine’s on Mt Sinai), Andrei Rublev’s Trinity, Our Lady of Perpetual Help, etc.\nIt was a total trip to find this comment re-posted here. Thanks!\n\n","date":"July 19, 2013 at 6:38 pm","url":"https://shroudstory.com/2013/04/27/at-least-as-potent-as-the-finest-icons/","cat":"news_&_views","id":"comment-39294","author":"Tom Acemoglu","site":"shroudstory"}]
