[{"title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes","post":"Maybe some statements are inaccurate, but they are not misleading.\nHabermas is right : the Turin Shroud is significant, especially in our secular society.\nMuch more than that, the TS is significant because it gives to the historian (and to the apologist) an other very good reason for thinking that Jesus rose from the dead.\n\n","date":"December 5, 2013 at 4:13 pm","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","id":"comment-56797","author":"Tristan Casabianca","site":"shroudstory"},{"title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes","post":"It appears as though he read something somewhere.  He leads with conclusions as in if the body is Jesus then it must be radiation coming out because you see teeth and the bones of hands. You may think that you see these things.Whoops!\n\n","date":"December 5, 2013 at 6:03 pm","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","id":"comment-56826","author":"Paulette","site":"shroudstory"},{"title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes","post":"I agree with Tristan that the Shroud is significant, but that’s not the main issue the video raises. Nobody, not even Giulio Fanti despite his laser experiments, knows how the image was formed.  To blandly assert that it was radiation emanating from the dead body is entirely speculative, and merely gives more grist to the scoffers.  Other image processes have been suggested, but no-one has yet pursued the question with sufficient perseverance, energy and experiment to obtain any kind of an answer one way or another. \nIf indeed it was radiation, it might well have been an external source, radon gases again, released from within the earth as a result of seismic action, perhaps with variations in the geomagnetic and geo-electric fields. What role did the burial herbs and spices have in this process, or the release of post portem vapours and gases? Nobody knows, because of insufficient experimentation! The only information we have to date is that it seems to be some kind of oxidation process, with no application of pigments. either in the outer fibrils of the linen, or perhaps confined to some kind of saponification coating.\n\n","date":"December 5, 2013 at 7:51 pm","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","id":"comment-56857","author":"daveb of wellington nz","site":"shroudstory"},{"title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes","post":"If Gary Habermas has really understood the post-Easter accounts he should know that the disciples did not carry any burial shroud around to spread the Good News. That is the way de Wesselow understands the Gospel. The big problem with some Protestant scholars is that they become sort of one-track minded, confusing psychical research with spiritualism, and, worse, refusing to read other subjects, subjects which show that there is something beyond matter, and even about developments in science. This was pointed out in a book by one American Protestant scholar. One day or the other fundamentalists will have to confront what the universe shows us, and only those who believe that “everything is true or nothing is true” in the Bible will become agnostics, atheists or even anti-Christian. There are well-known cases. The broad-minded Christians, with a more mature faith, who have read more, at least some lines about what Karl Popper had to say about science, for instance, will know that there is no need to throw faith overboard. Did not the world’s foremost Jesus researcher Monsignor John P. Meier write that many of the things Jesus said are still riddles, that the parables are riddles? He did not say they were meant to  be riddles, but one can be sure that that was precisely Jesus’ intention. The riddles are the key to a deeper faith.    \nThe Turin Shroud may help those whose faith is not strong, or be useful to apologists, but it is secondary in the scene.\n\n","date":"December 5, 2013 at 9:25 pm","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","id":"comment-56870","author":"Louis","site":"shroudstory"},{"title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes","post":"I have a question for anybody who can answer. How were bodies taken down from the cross?  Did Roman nails grip with such  force that a tool such as a crowbar was needed to pry the nails out? Did they have such tools ? It seems to me that using such a tool would mangle the flesh of the hands and feet to an extent that it would be visible to the eye. Does any thing on the shroud show this? If not why not?\n\n","date":"December 5, 2013 at 11:10 pm","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","id":"comment-56873","author":"Paul","site":"shroudstory"},{"title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes","post":"Response to Paul:\nDr Pierre Barbet in his “Doctor at Calvary”, ch 8, ‘Descent from the Cross’ decribes the scenario he envisages. It is essentially the paper he presented at the Societe de Saint Luc, Bulletin March 1938.\nFirst it must be understood, that the condemned person carried the cross-beam, the patibulum, to the place of execution where the upright stipes was kept permanently in place. With the victim lying on the ground with arms outstretched along the patibulum, the victim’s hands (wrists) were nailed to the cross-beam. The stipes would have been about 6ft high only, to make it reasonably easy for the execution party. The patibulum with the victim suspended by his wrists was then lifted onto the top of the stipes, which may have been fitted with a mortice and tenon joint to keep it in place.  The weight of the body, would then have sagged, resulting in the arms being at an angle of about 65deg to the vertical. The feet would then be nailed to the stipes. \nBarbet envisages the following procedure for removal of the body, which would be in a state of rigor mortis: \nFirst the nail through the feet would be removed from the stipes. Barbet does not dwell on the method. However, as an engineer, I can readily envisage a forged pinch-bar made probably of wrought iron which would serve the purpose. Wrought iron has been known from ancient times. The only problem is that it is malleable, and might be likely to bend, unless it was heat-treated and alloyed with some other metal. But I can readily envisage that the nail could be removed without further bodily damage. Remember that the Roman army was equipped with good metallic swords.\nThe patibulum with the victim still suspended would then be removed from the stipes. Barbet envisages a party of five would then transport the deceased, still attached to the cross-beam, to the tomb. This transport would be facilitated by the body being rigid in rigor mortis. He envisages that two men would support the patibulum, two would support the body mid-section using cloth bands, and one would support the feet. He claims to note that the right heel is poorly marked, and that this is the only part of the body touched by the transport party. \nThe absence of post mortem blood flows on the Shroud, points to the likelihood of this blood being lost during transport, (unless it was otherwise collected) and the body being laid on half the shroud, only at the place of burial. The nails would be removed from the patibulum, and the hands then with some little force be moved to the groin position. Barbet asserts that this can be readily done, even in the case of rigor mortis. \nThe above description is necessarily a terse summary of Barbet’s highly detailed description, which includes aspects of the post mortem blood flows. His work should be consulted if more information is desired. \nCrucifixion nails were highly prized by the Roman soldiery as medical talismans, so that few examples now survive. Of the nails that St Helena recovered, Constantine is said to have used one in his helmet, and converted another into a bridle for his horse. \nWith adequate tools, I can readily envisage that it would be quite feasible to remove the nails, without further damage to the body, particularly if the type of wood was selected with this ultimate requirement in mind, and if done with respectful care.\n\n","date":"December 6, 2013 at 4:17 am","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","id":"comment-56896","author":"daveb of wellington nz","site":"shroudstory"},{"title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes","post":"Dan – you like Gary. I don’t know him personally, but I know I generally don’t like his extreme pro-Shroud views. Like Stephen Jones, he is incredibly uncritical in his acceptance of certain Shroud “truths”.\nSuch fundamentalism does not help the pro -Shroud case.\n\n","date":"December 6, 2013 at 4:29 am","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","id":"comment-56898","author":"Matthias","site":"shroudstory"},{"title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes","post":"I like him as a historian. Yes, he is like Jones when it comes to the shroud. This isn’t even fundamentalism. It’s pick-want-you-wantism. I think the shroud is real. But if anyone might think I do because of the stuff Habbermas is throwing about, then I would be embarrassed.\n\n","date":"December 6, 2013 at 9:22 am","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","id":"comment-56932","author":"Dan","site":"shroudstory"},{"title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes","post":"For all anyone knows, Barbet’s explanation may be correct. Or complete fantasy. There is little or no literary or archaeological evidence to support any of it all, other than the bible and the shroud. Nor is the suggestion that crucifixion nails were regarded as talismans, I believe. Some Roman pincers have been found, but more usually in association with medicine (especially animals medicine) than with carpentry. It may be that claw-hammers, of which at least one survives from Pompeii, were the extraction tool of choice.\n\n","date":"December 6, 2013 at 4:44 am","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","id":"comment-56902","author":"Hugh Farey","site":"shroudstory"},{"title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes","post":"Barbet was not into fantasy. He had rather better knowledge of the original Roman and Greek classics than I imagine Hugh Farey might have, and which supported his arguments based on his extensive forensic studies and close examination of the Shroud. As for using a claw hammer, we are not talking home carpentry here with mere 2 inch nails, nor even 4 inch.  Replica crucifixion nails based on archaeological discoveries are typically shown as stout, generally of tapered square section, and are commonly 7 inches to 10 inches. Try using your home carpentry claw hammer on one of those!  I suggest that an experienced forensic pathologist of comparable standing to Pierre Barbet, such as Frederick Zugibe might be qualified to comment usefully on Barbet’s conclusions, but not otherwise.\n\n","date":"December 6, 2013 at 6:19 am","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","id":"comment-56912","author":"daveb of wellington nz","site":"shroudstory"},{"title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes","post":"Did Barbet mention any of the original Roman and Greek classics to which you refer? His knowledge of them was no doubt vastly superior to mine, but he didn’t have Google. I, and anybody else who respects, but isn’t intimidated by scholarship, have at our fingertips resources of which Barbet couldn’t have dreamt. As for a crucifixion nail being 10 inches long, I think that’s absurd. Not that there’s necessarily any truth in http://www.telegraph.co.uk/news/newstopics/howaboutthat/7350166/Nail-from-Christs-crucifixion-found.html, but 4-6 inches would have been entirely adequate, and easily extracted with a claw hammer. I could be wrong, but I’d need references before I retracted…\n\n","date":"December 6, 2013 at 9:04 am","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","id":"comment-56926","author":"Hugh Farey","site":"shroudstory"},{"title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes","post":"For the Holy Nails and their comparison with the one that was found in Jehohanan’s ossuary, see Witnesses of Mystery, Chapter 3. They were roughly 16 cm or 6-7 inches long. According to Micheal Hesemann’s study (this is what Górny relies on) the most probable candidates for authentic Holy Nails are those kept in Rome’s Santa Croce in Gerusalemme, and the one kept in Santa Maria della Scala in Siena, which was brought there from Constantinople in 1359.\nOther sources claim that the third nail, used for feet is kept in Trier since Helena times, with small portion in Toul.\nOf the nails that St Helena recovered, Constantine is said to have used one in his helmet, and converted another into a bridle for his horse.\nOnly small fragments of the nails were probably used for that purpose. Through centuries, the small portions were removed from the original Holy Nails and distributed around the Europe, sometimes melted or attached to new nails. That’s why there are about 36 Holy Nails around Europe.\n\n","date":"December 6, 2013 at 9:30 am","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","id":"comment-56933","author":"O.K.","site":"shroudstory"},{"title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes","post":"Perhaps the nails were left in situ with the hands and feet being yanked off them?\n\n","date":"December 6, 2013 at 9:13 am","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","id":"comment-56929","author":"ChrisB","site":"shroudstory"},{"title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes","post":"Nope! Check the nail heads, alleged replicas. Google on “crufixion nails pictures”.  Very few actual crucifixion nails survive.\n\n","date":"December 6, 2013 at 3:09 pm","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","id":"comment-56959","author":"daveb of wellington nz","site":"shroudstory"},{"title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes","post":"Very few actual crucifixion nails survive.\nNamely 4-5:\n1. The one used to crucify Jehohanan\n2. The one used to crucify Jesus (?), currently in Santa Croce in Gerusallemme, Rome\n3.The one used to crucify Jesus (?), currently in Santa Maria della Scala, Siena\n4.The one used to crucify Jesus (?), currently in Cathedral of Trier.\n5 (?) The one used to crucify Jesus (? or possibly used to join the beams of the cross), currently in Holy Lance (Saint Maurice Lance) in Hofburg, Vienna.\nHave I missed any other?\n\n","date":"December 6, 2013 at 3:53 pm","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","id":"comment-56967","author":"O.K.","site":"shroudstory"},{"title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes","post":"Various hoards of Roman nails, of lengths from a few centimetres to 35 cm or so, have been found. Any of them (around the 10cm length) could just as easily be a ‘crucifixion nail’ as those listed above. Does anyone think the Romans made specially designed nails just for cruxifixion? I don’t.\n\n","date":"December 6, 2013 at 5:23 pm","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","id":"comment-56977","author":"Hugh Farey","site":"shroudstory"},{"title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes","post":"And what of it? From Jehohanan’s ossuary wee know the kind of nail that was used for crucifixions. Not too small, and not too large.\nNow one must find idea how to safely remove the nails from the body, and take the corpse down. We don’t know the exact way it was performed, but it was somehow. There were some suggestions, as far I remember that they sawn off the Jehohanan’s legs, as the nail was stuck in the wood.\n\n","date":"December 6, 2013 at 6:07 pm","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","id":"comment-56981","author":"O.K.","site":"shroudstory"},{"title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes","post":"A few of Barbet’s reasons for the scenario he envisages:\nIt was not until the tomb was reached that the body was placed on the Shroud, as otherwise the back part of the Shroud would have been drenched with blood from the inferior vena cava;\nThe journey was sufficiently long for the inferior vena cava to empty itself of blood;\nThe rigor mortis would be sufficient for the body to be transported horizontally, even if only supported at its extremities;\nHandling of the body was minimal, as blood clots are largely undisturbed. If there had been more handling, the clots would have been wiped away or obliterated;\nThe rear part of the right heel is poorly marked, compared to the rest of the sole, and can be explained if it was the part covered by the hands of the bearer.\nI would observe that it would be a much easier task to remove the nails from the patibulum after it had been removed from the stipes, than attempting to remove the nails while it was still on the stipes.  It is then only a question of whether the nails were removed with the body lying at the foot of the stipes, or whether the body was taken along with the patibulum for the nails to be removed at the burial site. It would only require five men to transport the body with the patibulum to the burial site. \nWhat part of this simple explanation, does Hugh Farey with his contrived skepticism not understand? Or what alternative scenario can he offer, or is that creative task too much of a challenge for him?\n\n","date":"December 6, 2013 at 11:19 pm","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","id":"comment-57032","author":"daveb of wellington nz","site":"shroudstory"},{"title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes","post":"This a contrived way of admitting that Barbet does not in fact quote any “original Roman and Greek classics” in support of his suggestions regarding the deposition and interment of Jesus’s body. It’s not that I don’t understand Barbet’s conclusions, nor that I think they are impossible. They are, however, like nearly all the other details to which the shroud appears to cohere so precisely, derived from the shroud, and cannot be correlated with independent accounts.\nIf it wasn’t for the problems presented by the image on the shroud, it seems far more likely that the body was taken down and interred before the onset of rigor mortis rather than during it. As for going off with the patibulum, one wonders what the Romans would have thought have of that. Did they use a fresh one every time? If so, and the patibulum went with the body to the tomb, did somebody subsequently put it back, so that Helena could find the crosses intact together hundreds of years later? Was the stipes stuck permanently in the ground (concreted, perhaps), or slotted into a hole, so that the whole cross could be laid flat for easy assembly and disassembly? Was the cross guarded? And if so, did the guards remove the body for the friends to dispose of it (once they knew it had been properly authorised), so they could keep the wood and nails for reuse?\nAlternative scenarios? Creative challenges? Anybody can do that.\n“Original Roman and Greek classics.” That’s the problem.\n\n","date":"December 7, 2013 at 4:51 am","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","id":"comment-57064","author":"Hugh Farey","site":"shroudstory"},{"title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes","post":"Hugh: \nI am also critical of Barbet’s reconstruction -although possible, for me it is unlikely. We don’t know how the taking from the cross was performed exactly -however we can be certain it was somehow. We don’t know whether 3 or 4 nails were used. We don’t know a lot, actually most of the details. That’s why more research is needed, comparison with archeological findings, source material etc. Remember, Barbet died in 1961, the sciensce has gone ahead since that time.\nDid they use a fresh one every time? Probably yes at least in Paestine, as such wood would have been cosidered impure by the Jews who had their  influence even on the process of executions. The wood supply in Judea would be certainly some problem, but we don’t know the frequency of executions in Jerusalem, during the Roman rule in the 1st century. 3 executions a week for 60 years? 3×52=156 executions a year, 9360 during 60 years of Roman rule. The population of Jerusalem at this time was 30-70 thousand. \nWas the stipes stuck permanently in the ground (concreted, perhaps), or slotted into a hole, so that the whole cross could be laid flat for easy assembly and disassembly?\nUnlikely from the reasons mentioned above -the fresh wood would be needed each time, besides new studies of the Shroud and the Tunic of Argenteuil suggest the whole cross was carried by the convicts.\nAlternative scenarios? Creative challenges? Anybody can do that.\nSome suggestions  can be derived for example from the alleged visions of Anne Catherine Emmerich, see Chapter L “The descent from the cross” http://www.ccel.org/ccel/emmerich/passion.pdf Although almost certainly fiction composed by Clemens Brentano (there are many discrepancies with our current knowledge of the relics), it may give some creative ideas.\n\n","date":"December 7, 2013 at 9:08 am","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","id":"comment-57090","author":"O.K.","site":"shroudstory"},{"title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes","post":"Was the stipes stuck permanently in the ground (concreted, perhaps), or slotted into a hole, so that the whole cross could be laid flat for easy assembly and disassembly?\nSlotted into a hole -a stone ring (11.5 cm in diameter) serving for that purpose was found in the Church of the Holy Sepulchre in 1986, see Witnesses of Mystery pg. 310-313.\n\n","date":"December 7, 2013 at 9:28 am","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","id":"comment-57094","author":"O.K.","site":"shroudstory"},{"title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes","post":"I can understand why, from the point of view of science, some Shroud experts are uncomfortable with what Gary Habermas has to say. But the reality is this: if the Shroud is authentic(and I am reasonably certain that it is), it has enormous religious significance for the world. Here we have the only burial shroud(that I know of anyway) in existence with an enigmatic and mysterious imprint on it, and that shroud most likely wrapped the body of the one man in history who is said to have risen from the dead. That’s amazing, and why many scientists who are just as rigid in their bias against religion as religionists are in their fervor for religion  will never accept the Shroud, even if it’s proven to be from the 1st century A.D. Because the implications of what it may mean are staggering.\n\n","date":"December 6, 2013 at 11:48 pm","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","id":"comment-57035","author":"chesterbelloc","site":"shroudstory"},{"title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes","post":"Did Gary say, “The conclusion of many if not most studies is that you have radiation coming out from the dead body . . . “?  Many?  Most? Any? \n“and the latest experiments just released six months , , , and that the cause was radiation from a dead body.. .” Did Gary say that?  What experiments were those?\nI’m not a scientist. I believe the shroud is real. I don’t want to believe it is so because of fiction and I don’t want anyone else to, either.\n\n","date":"December 7, 2013 at 6:11 am","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","id":"comment-57075","author":"Dan","site":"shroudstory"},{"title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes","post":"“Scientists who are just as rigid in their bias against religion as religionists are in their fervor for religion.”  What about “Scientists who are rigid in their fervour for religion” and “Religionists who have a bias against Science”? They’re much nore interesting, don’t you think?\n\n","date":"December 7, 2013 at 4:54 am","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","id":"comment-57065","author":"Hugh Farey","site":"shroudstory"},{"title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes","post":"Several of the issues Hugh Farey raises are adequately dealt with in “Doctor at Calvary”, Ch 2, ‘Crucifixion and Archaeology’. Barbet draws on Holmeister’s studies published in Verbum Domini, review of the Pontifical Biblical Institute, March through September 1934, which apparently cites abundant and precise sources, as well as quoting specific classical sources himself. The sources quoted there, have rather more historic value than legendary accounts of St Helena’s peregrinations.\n\n","date":"December 7, 2013 at 6:18 am","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","id":"comment-57077","author":"daveb of wellington nz","site":"shroudstory"},{"title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes","post":"“The sources quoted there…”\nHas anyone noticed that the word “apparently” has increasingly come to mean the same as “allegedly,” instead of “obviously,” whch was its original meaning?\nSadly, although huge tracts of the writings of classical authors are readily available and searchable on the internet, and have, to me, revealed next to nothing about crucifixion, Verbum Domini, and Fr Holmeister’s contributions to it, are yet to be published. They may, for all I know, be the last word in primary sources for first century Palestinian crucifixion. Is it really “contrived scepticism” to remain to be convinced?\n\n","date":"December 7, 2013 at 7:59 am","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","id":"comment-57086","author":"Hugh Farey","site":"shroudstory"},{"title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes","post":"Surely the real problem here is that Habermas and his questioner had not sorted out a suitable soundbite coherently delivered. Why did he not write down the points he wanted to make, absorb them , do one or two test runs before going for it as most people do in such circumstances.  Whether you agree with him or not, it was a wasted opportunity. I had to do an interview with very short answers for a television documentary the other day and if I fluffed my lines, they made me do it again- three or four times on one occasion!\nAnyone heard more about Fanti’s dating- who accepts it as authoritative?\n\n","date":"December 7, 2013 at 8:13 am","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","id":"comment-57087","author":"Charles Freeman","site":"shroudstory"},{"title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes","post":"Barbet quotes several of the sources himself in his Ch 2. Read it! You just might find something there to resolve a few of your doubts.\n\n","date":"December 7, 2013 at 5:45 pm","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","id":"comment-57158","author":"daveb of wellington nz","site":"shroudstory"},{"title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes","post":"Sadly, although I think Barbet’s book was the first I ever read about the shroud, I have never possessed a copy. I shall rectify that immediately, as I think it’s an important work, although I have no doubt whatever that I will not find Chapter Two as convincingly referenced as daveb does.\nOr does he? Would he like to mention just one of the several Roman or Greek sources quoted by Barbet in Chapter Two, and what it refers to, just to whet my appetite?\nNo?\nHmm.\n\n","date":"December 8, 2013 at 6:11 am","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","id":"comment-57226","author":"Hugh Farey","site":"shroudstory"},{"title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes","post":"“Scientists who are just as rigid in their bias against religion as religionists are in their fervor for religion.” What about “Scientists who are rigid in their fervour for religion” and “Religionists who have a bias against Science”? They’re much nore interesting, don’t you think?<<\nI think that the world is full of people who don't want their worldview challenged. Just as a religious person who takes the Bible literally doesn't want to hear that the Genesis account isn't literal history(though I subscribe to the \"age-day\" theory and think that Genesis and science can be reconciled), there are many scientists who will not believe in a miracle, even if they see one before their eyes. The Shroud is interesting to scientists because it's so enigmatic and unexplainable. But to someone who believes that Jesus of Nazareth really rose from death, there are only two conclusions that can be drawn-1)it's a forgery meant to fool people into thinking it's the Shroud of Christ, 2)or it really is the Shroud, and something that science cannot explain is probably the cause for the mysterious imprint. Dr. Habermas takes the latter alternative, mainly because he's as much a theologian as he is an historian. I tend to agree with him, though I have no idea if the Shroud was caused by \"a burst of radiation\". But whatever caused the image, it seems to have been a unique phenomenon. I'll leave it to the scientists to figure out what this phenomenon was; it could be something completely natural. But, even if natural, we have to ask ourselves why this has only happened to one particular burial cloth in history. As I'm sure everyone has deduced, I'm no scientist, but I do love this site. Keep up the excellent work!\n\n","date":"December 7, 2013 at 1:42 pm","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","id":"comment-57122","author":"Chesterbelloc","site":"shroudstory"}]
