[{"title":"It May Be Illegal to Read This in South Carolina","post":"After reading through the various web postings, I can see that this could be a most intriguing situation, and there may well be object lessons to be learnt for other church jurisdictions.  I suspect it would not arise where a church formed part of the legal establishment, such as the Anglican Communion in Britain.  I read that it appears to have arisen in South Carolina because the diocese became an incorporated body under state law in 1973 and presumably the judge is constrained by the contents of the incorporating document and the persons named in that document.  This would be a fairly common situation under several state, national and ecclesiastical jurisdictions.  In NZ for example most RC (arch)diocesan property, including parish churches would be registered under NZ law as the property of the (Arch)bishop of (diocese), “a corporation sole”.  I don’t know that the name of the (Arch)bishop at any particular time would appear on any secular registered state document or not, or whether if any kind of conflict arose whether the matter would be settled by some process based on the discernible facts of the case, and how Catholic Canon Law might influence any such decision.  \nThe ENS site has some fascinating opposing views and comments on the matter, which would be entertaining if they were not so sad.  One comment suggests that if the suit was successfully defended, then the remnant church would then be obliged to maintain several old buildings, which are registered historic places, but would be unable to fund their maintenance with their depleted congregations.  The separation of church and state would seem to have its advantages and disadvantage, the latter particularly when the church depends on the state for proper secular governance of its property.\n\n","date":"January 26, 2013 at 4:32 am","url":"https://shroudstory.com/2013/01/25/it-may-be-illegal-to-read-this-in-south-carolina/","cat":"off_topic","id":"comment-22700","author":"daveb of wellington nz","site":"shroudstory"}]
