[{"title":"Jeffrey Skurka on Buffalo Catholic Radio Station","post":"No. Absolutely not. I do not believe a single word of the last paragraph. I do not believe any of the experiments described were carried out; I do not believe any of the results occurred. This kind of nonsense spreads discredit not only over authenticist belief, but also over shroud study in general; and acts as a powerful disincentive for real historians and scientists to have anything to do with it, which is a great pity.\n\n","date":"January 19, 2015 at 8:48 am","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","id":"comment-184522","author":"Hugh Farey","site":"shroudstory"},{"title":"Jeffrey Skurka on Buffalo Catholic Radio Station","post":"This is pure hokum. Benford is a total kook (pyramid energies etc) and Jeffrey Skurka is a “city engineer”. Knowledge of traffic lights systems does not qualify someone to start taking about “paired electrons” and “magnetic field collapse”. It is truly pitiful that this nonsense is treated with any degree of seriousness.\n\n","date":"January 19, 2015 at 6:01 pm","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","id":"comment-184624","author":"aljones909","site":"shroudstory"},{"title":"Jeffrey Skurka on Buffalo Catholic Radio Station","post":"Sue Benford had 10 peer-reviewed scientific articles published between 1999   and 2001.  She also co-authored 2 in 2008.  Scientific  kookiness  sometimes eventually becomes mainstream.\n\n","date":"January 19, 2015 at 6:10 pm","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","id":"comment-184626","author":"jmarino240","site":"shroudstory"},{"title":"Jeffrey Skurka on Buffalo Catholic Radio Station","post":"It’s extremely rare for “scientific kookiness”, i.e. hypotheses dreamt up by amateurs, to become mainstream. Revolutionary scientific ideas come from real scientists doing hard work. They don’t come from amateurs misusing scientific terms (like “quantum”,  “energy”, “field”)\nPyramid energies, alternative healing energies, crop circles, and spontaneous human combustion are firmly in the “kooky” camp. Crop circles and SHC have straightforward explanations. If anyone can show the efficacy of “pyramid energies” or  “alternative healing energies” then James Randi has a million dollars waiting. It would also overturn QFT (Quantum Field Theory). Our best model of how the universe works.\nHere’s a real scientist, Sean Carroll, talking about ideas of unknown “energies”.\n“The questions are these: what form does that spirit energy take, and how does it interact with our ordinary atoms? Not only is new physics required, but dramatically new physics. Within QFT, there can’t be a new collection of “spirit particles” and “spirit forces” that interact with our regular atoms, because we would have detected them in existing experiments.”\n\n","date":"January 19, 2015 at 7:47 pm","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","id":"comment-184642","author":"aljones909","site":"shroudstory"},{"title":"Jeffrey Skurka on Buffalo Catholic Radio Station","post":"Sue was a co-author with Apollo astronaut Edgar Mitchell on a paper\n pertaining to Quantum Mechanics at the Fifth International Conference on\n Computing Anticipatory Systems(CASYS’01), Liège, Belgium,  August 13-18, 2001.  I\n wouldn’t classify Mitchell as an amateur scientist  and I don’t think he\n lightly chooses his co-authors.\n Regarding Spontaneous Human Combustion, Sue believed it was basically a\n rare medical condition (she was a nurse).  She was actually filmed for a\n documentary saying that but she ended up on the cutting room floor because that\n was too dull of an explanation for a TV program that likes to push  mystery.\n You obviously have your mind made up about Sue so I will end here.\n\n","date":"January 19, 2015 at 8:41 pm","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","id":"comment-184657","author":"jmarino240","site":"shroudstory"},{"title":"Jeffrey Skurka on Buffalo Catholic Radio Station","post":"The image formation explained by Marvel Comics.\n\n","date":"January 19, 2015 at 9:25 am","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","id":"comment-184527","author":"David Goulet","site":"shroudstory"},{"title":"Jeffrey Skurka on Buffalo Catholic Radio Station","post":"Hugh wrote, “I do not believe a single word of the last paragraph. I do not believe any of the experiments described were carried out; I do not believe any of the results occurred.”\nIt’s one thing to believe a certain experiment is silly or brings discredit to sindonology, but it’s another to just dismiss the claim that the experiment was done.  I was not involved in the experiment that Jeffrey refers to, but he did visit Sue and me in 1998 and I do remember them working on this.  I’m not sure I have any documentation in files of Sue that I still have but I recently sent Jeffrey various materials related to some of her experiments, so there might be something in those materials and/or Jeffrey may have some of his own material related to the experiment in question.\n\n","date":"January 19, 2015 at 5:22 pm","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","id":"comment-184616","author":"Joe Marino","site":"shroudstory"},{"title":"Jeffrey Skurka on Buffalo Catholic Radio Station","post":"Sorry Joe, and no disrespect to you or to Sue, but I don’t believe any such experiment was carried out. I do not believe any SHC remains were experimented with at all, I do not believe that a book jacket associated with an SHC event was dated to 2400AD, I do not believe that any skulls shrunk to the size of softballs. If ever extraordinary claims required extraordinary evidence this is such a circumstance, and I don’t believe any such evidence will be forthcoming.\n\n","date":"January 19, 2015 at 5:45 pm","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","id":"comment-184621","author":"Hugh Farey","site":"shroudstory"},{"title":"Jeffrey Skurka on Buffalo Catholic Radio Station","post":"I’ll inquire to Jeffrey regarding any documentation he might have.\n\n","date":"January 19, 2015 at 6:02 pm","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","id":"comment-184625","author":"jmarino240","site":"shroudstory"},{"title":"Jeffrey Skurka on Buffalo Catholic Radio Station","post":"I think any piece of scientific research has to be taken on it own merits, and not necessarily be automatically discredited because its author has some unconventional ideas as well. No one disparages Isaac Newton’s Principia Mathematica on the grounds that its author spent more time on alchemy than he did on maths, and Arthur Conan Doyle’s literary successes with Sherlock Holmes and in journalism are not diminished by his belief in fairies. Sue Benford’s Shroud patch hypothesis was serious and sensible, and in a modified form still has considerable mainstream support (even though I believe it to be almost completely wrong). I have also seen \nNevertheless, scientists, particularly physicists, do seem prone to drift away from the generally accepted foundations of their discipline into realms of arcana which are wholly beyond any formal credibility, and the astronaut Edgar Mitchell (among several other astronauts) was one such. To be associated with his Institute of Noetic Science, or to co-author a paper entitled “QuantaGraphy®: Images from the Quantum Hologram”, or to publish papers in journals of New Energy, Theoretics or Psychical Research suggest a serious intent to investigate unconventional areas of science, but as the field stands, nothing derived from any such research has achieved mainstream respectability.\nJoe is perfectly correct that “Scientific kookiness sometimes eventually becomes mainstream” but in this case – Biological Nuclear Reactions, Spontaneous Human Combustion, Shrunken Heads and the Resurrection – it has a very long way to go.\nI still don’t believe a word of it.\n\n","date":"January 20, 2015 at 3:20 am","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","id":"comment-184787","author":"Hugh Farey","site":"shroudstory"},{"title":"Jeffrey Skurka on Buffalo Catholic Radio Station","post":"I’d be sceptical of Skurka’s claims, I smell overuse of technical jargon intended to mystify, as David G says, Image formation as explained by Marvel Comics.  \nHowever …. :  Current NZ Listener has review of work “Life on the Edge” by Johnjoe McFadden & Jim Al_Khalili, both highly reputable scientists, McFadden is Professor of Genetics at University of Surrey and appears regularly on British Television as science commentator (see wiki for bio on McFadden). \nWeird Quantum things are being discovered as important in molecular biology:  “shocking and unexpected that delicate and quantum behaviour persists inside the warm, wet and complex world of living organisms”;  “electrons exhibit wave-like diffraction behaviour inside photosynthetic cells, signature diffraction patterns observed”;  “entanglement of electron pairs sensitive to earth’s weak magnetic field, such that orientation of robin within this field influences its flight behaviour”;  “quantum activity is normally decohered when subatomic particle surrounded by several other atoms, therefore surprising to see quantum behaviour within living cells “;  “mitochondria respiration involves transport of electrons along enzyme chains, had thought that electrons hopped from one enzyme to next, but now know that electrons quantum-tunnel dematerialising from one point in space and instantly materialising in another”;  “strangest aspect of quantum biology is means by which living cells manage to maintain delicate quantum states for long enough to have biological effects”.  \nObviously there’s a lot more in the box yet to be discovered.  Don’t ask me to explain it, I’m only the messenger here!\n\n","date":"January 20, 2015 at 5:05 am","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","id":"comment-184809","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Jeffrey Skurka on Buffalo Catholic Radio Station","post":"Daveb\nThank you for posting that. I found the book, “Life on the Edge: The Coming of Age of Quantum Biology” on Amazon and I am ordering it.\nI’m sceptical of Skurka’s claims also. Well to be honest I just don’t believe them.\n\n","date":"January 20, 2015 at 8:14 am","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","id":"comment-184839","author":"John Green","site":"shroudstory"},{"title":"Jeffrey Skurka on Buffalo Catholic Radio Station","post":"Here’s a link to the BBC from two years ago (Jan 2013) showing that quantum mechanics has important applications in modern biology. \nQuantum biology: Do weird physics effects abound in nature?\nBy Jason Palmer and Alex Mansfield BBC News and BBC Radio Science Unit\nhttp://www.bbc.co.uk/news/science-environment-21150047\nThe following passage focuses on photosynthesis, where the strongest case can be made, but the article later mentions Dave’s robins too. \n“There are definitely three areas that have turned out to be manifestly quantum,” Dr Turin told the BBC. “These three things… have dispelled the idea that quantum mechanics had nothing to say about biology.”\nDeep within plants’ energy-harvesting machinery lie distinctly quantum tricks\nThe most established of the three is photosynthesis – the staggeringly efficient process by which plants and some bacteria build the molecules they need, using energy from sunlight. It seems to use what is called “superposition” – being seemingly in more than one place at one time.\nWatch the process closely enough and it appears there are little packets of energy simultaneously “trying” all of the possible paths to get where they need to go, and then settling on the most efficient.\n“Biology seems to have been able to use these subtle effects in a warm, wet environment and still maintain the [superposition]. How it does that we don’t understand,” Richard Cogdell of the University of Glasgow told the BBC.\nHowever, before rushing to invoke quantum weirdness to explain anything and everything (junking established scientific laws re the natural world) it’s as well to remember that quantum effects only make themselves apparent on the sub-macroscopic level of existence. Individual living cells are microscopic, but still macroscopic where quantum physics are concerned. The same applies to the subcellular organelles like chloroplasts and mitochondria which have electron transport chains for ATP synthesis that operate “better” than might be expected. But once you take on board the amazing degree of organization of proteins and electron carriers at the molecular level of membrane phospholipid bilayers and their embedded proteins, then you have in all probability a smooth seamless continuum that leads from the macroscopic world of conventional physics to the microscopic, indeed sub-atomic world of conventional physics. That’s where our mental concepts of space and time begin to break down, or at any rate become hopelessly compromised.\nPersonally speaking,I think there’s a lot of conventional science still waiting and needing to be applied to the Shroud image, and meanwhile too much mantra-intoning based on mere impressions. I mentioned a prime example here the other day – the idea that the TS image and associated chemical changes are confined to a superficial layer on linen fibres, 200-600nm thick. Where’s the evidence (hard analytical and quantitative evidence that is)? There’s none, absolutely none that I can see.\n\n","date":"January 20, 2015 at 5:46 am","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","id":"comment-184816","author":"Colin Berry","site":"shroudstory"},{"title":"Jeffrey Skurka on Buffalo Catholic Radio Station","post":"Thanks. Enjoyed this article.\n\n","date":"January 20, 2015 at 8:06 am","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","id":"comment-184837","author":"Dan","site":"shroudstory"},{"title":"Jeffrey Skurka on Buffalo Catholic Radio Station","post":"Sorry, I tried (using “Google translation”) to translate a message that I wrote yesterday…\n— — — — —\nHere’s what I could define as:\n “The theological proof of a simple error in prediction about the Shroud of Turin” …\n What can you tell us the Science of God, theology?\n We know that with the Incarnation the Son of God became man, with Death and subsequent Resurrection Life of the Son of God\n passed by the Incarnation on this Earth to the Mystery of Life Eternal.\n ———————-\n I do not think you can get to say that the Resurrection is arising from a disembodiment of God (perhaps the only infinitesimal moment of the passing of His Body from this World [perishable] to Eternal Life can be seen as a disembodiment, that what may seem the “true Death of God” … a real “disappearance infinitesimal” …). Also I think that a “disembodiment of God” is a strange theological concept and I do not think anyone has ever deepened. Anyway I’ll try to read up about another time …\n— — —\nNow I can not immediately put to argue that, in this step, can not be originated trace extremely significant (ie: the effects of nuclear radiation … and many other gadgets you want to bring up …), but my mind can understand very well that if there is a test observable (ascertainable by anyone with the will to investigate, of course …) of something that is not belonging to the ordinary “natural course of events”, then varies the normal condition of man’s freedom before the Mystery of God …\nIn short, free will it can be “crippled” in the sense that in front of “incontrovertible material evidence” of the Resurrection of Jesus (… And this, in a nutshell, what this means? The likely elimination of a Mystery of Faith! That is a fact not permitted by the normal Christian doctrine …) we would not be free (in our belief) but conditioned by a test material … and therefore the merit of our faith would be much diminished, or perhaps (even) voided (… and, among other things, about what I keep doubts) …\nSo that account (consequential) can be drawn?\nI take it you do not find what they say Antonacci and Linder (= evidence of nuclear radiation, isotopic significant changes, etc.) …and others (Siefker) …\n“Now if Christ is proclaimed as raised from the dead, how can some of you say that there is no resurrection of the dead?”  = 1 Corinthians 15:12 \nYou may get to deduct that existed the Resurrection of Our Lord Jesus Christ (from the testimony of the disciples, the Eucharistic miracles, etc., Etc.),  but give the proof of this on the basis of material effects even currently observable (= altered by nuclear radiation, etc.).\nI think both act contrary to common sense …\nThe Resurrection of Our Lord Jesus Christ was and is only made in the hearts of the disciples, in the conversion … What Hope to save us we could have if we did not have more merits resulting from the Faith?\nIn conclusion:\nScience can not explain a mystery of faith.\nScience is the result of a human construction (and it is coming from the origins sometimes obscure or even mysterious connections = see f.e. the life of Newton […and what seems to us to be able to classify as his biblical and alchemical rantings. B.T.W. : Isaac Newton wrote fellow alchemist Robert Boyle a letter urging him to keep “high silence” in publicly discussing the principles of alchemy…]) during centuries … and sometimes fallible … really it is not infallible …\nIf science comes to really explain a mystery of Faith, then it seems to me possible to infer that the Mystery, in a certain sense, is no longer a mystery, it has become something demonstrated that one can not subtract, and, consequentially, the degree of freedom of man facing a Mystery revealed it is involved …\n— * — * —\nI’d be really curious (and at the same time, almost very intimidated …) if the predictions of Lindner (= radiocarbon dates move into the future!) come true (established after the appropriate controls) …\nIn fact: what sense could have that “radiocarbon date in the future,” seen as “proof of the Resurrection”?\nIn that case we would have still kept our freedom?\nNo doubt it would be a major stumbling block … and perhaps the only logical explanation that would be immediately indicated would be the objection that these radiocarbon results in the future would result from netron irradiation of the Cloth, presumably in modern times …\nStrange stories …\nPerhaps it is better to work in our field more restricted. So the strange matter about emanations of neutrons arising from piezonuclear reaction would not be even a story to be discarded altogether. But apparently this is weak thinking.\nIn any case turns up the question: … at what epoch would receive the Cloth a neutron irradiation?\nObviously, you can not go beyond these speculations without running the risk of entering into delusions … or make rapturous applause without rationality…\n\n","date":"January 20, 2015 at 9:19 am","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","id":"comment-184849","author":"piero","site":"shroudstory"},{"title":"Jeffrey Skurka on Buffalo Catholic Radio Station","post":"I apologize for the bad translation of what I wrote yesterday (in Italian language),\nthe result (despite the attempt done with a correction of text) was not much precise …\nSee also other mistakes : netron instead of neutron, etc. …\nand … Linder instead of Dr. Arthur Lind.\nBecause (perhaps) “Linder” was a sort of mix of Lind and Lindner…\nIn the past Eberhard Lindner presented his hypothesis\n(before the works by Antonacci and  Lind):\nthe high C14 content found by the laboratories is explainable\nif the Shroud was irradiated with neutrons 2000 years ago.\n[link: https://www.shroud.com/pdfs/ssi3233part4.pdf …    B.T.W.: during the same meeting (held in Paris) an old student of the Shroud (since 1942), Dr. Sebastiano Rodante indicated that the Image was formed by natural means: bloody sweat, aloes and myrrh … and several repeated experiments (sometimes on a corpse) in the catacombs of Siracusa have given imprints that are superficial, 3-dimensional and without deformation… ]\nIf neutrons radiated the shroud, the effects can be detectable.\nWhy many people believe that neutrons were emanated during\nthe Resurrection? We have to see a clear proof instead of fairy tales.\nHow  the radiocarbon date would be altered and changed to a younger date ?\nBarbesino, Moroni and Bettinelli have shown us something (in the past).\nWhere are (truly) new proofs?\nReactions with Nitrogen (“indigenous to the flax”…) into the flax???\nSee under:\nhttp://www.acheiropoietos.info/proceedings/LindWeb.pdf\nMark Antonacci is an attorney, instead Dr. Arthur Lind is a senior scientist and\na past manager and research director.\nBut …\nWhere is their true expertise in the field of textile studies?\nLind has spoken in this manner:\n“I like solving problems, so this is a problem that I’m trying to solve.”\nBut, until now, they have not at hand the required proofs.\nAnd then, see also the past strange stories about the Sudarium of Oviedo and\nthe lack of new analyses…\nI would prefer to focus on the old problem of dating, but see my\nold proposal (= a failed attempt sent to Dallas Conference, 2005)\nattempting to use the sensors SSNTD (= Solid state nuclear track detectors)\nin appropriate experiments (in any case treated linen samples\nhave to be observed under adequate AFM controls) …\nNow I have just found a curious information:\nA novel nanometric DNA thin film as a sensor for alpha radiation,\na paper by\nAtul Kulkarni,\nByeonghoon Kim,\nSreekantha Reddy Dugasani,\nPranav Joshirao,\nJang Ah Kim,\nChirag Vyas,\nVijay Manchanda,\nTaesung Kim\n& Sung Ha Park\nAbstract:\n>The unexpected nuclear accidents have provided a challenge for scientists and engineers to develop sensitive detectors, especially for alpha radiation. Due to the high linear energy transfer value, sensors designed to detect such radiation require placement in close proximity to the radiation source. Here we report the morphological changes and optical responses of artificially designed DNA thin films in response to exposure to alpha radiation as observed by an atomic force microscope, a Raman and a reflectance spectroscopes. In addition, we discuss the feasibility of a DNA thin film as a radiation sensing material. The effect of alpha radiation exposure on the DNA thin film was evaluated as a function of distance from an 241Am source and exposure time. Significant reflected intensity changes of the exposed DNA thin film suggest that a thin film made of biomolecules can be one of promising candidates for the development of online radiation sensors.\n— —\nThe unexpected nuclear accidents = See also: The Fukushima nuclear accident on March 2011, etc. …\nThe radiation effect on thin films was also studied using Raman\nspectroscopic analysis to determine the influence of exposure time\nand the distance of the film from the radiation source.\nThen, please, observe the comparative Raman spectra\nwithout and with radiation exposure…\nThe radiation source (in that work) 241Am, emits alpha particles.\nAnd alpha particles, consisting of helium nuclei, are emitted\nby various isotopes of actinides including Th, U, Np, Pu, Am and Cm. …\nSo it remains to see the composition of the stones of the walls\nwhere the Holy Shroud was guarded.\nFor example: I would start examining some site of Turin ….\nWhat do you think of this “obvious idea”?\nLink:\nhttp://www.nature.com/srep/2013/130624/srep02062/full/srep02062.html\n\n","date":"January 20, 2015 at 12:45 pm","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","id":"comment-184887","author":"piero","site":"shroudstory"},{"title":"Jeffrey Skurka on Buffalo Catholic Radio Station","post":"aljones 909 wrote:  “Benford is a total kook…..”  I had the privilege of meeting Sue Benford and getting to know her a bit.  It angers me that there are those out there who would use such a disrespectful term (total kook) to describe one with whom they might disagree.  Whatever you may think of her Shroud-related work, she WAS NOT a “total kook”.  Joe Marino (her husband), is too much of a gentleman to tell you what he might feel regarding such a disparaging description and characterization of his wife.  Sue, who was a lady cannot, because she is not here to defend herself.  Therefore I will.  You owe the man an apology!\n\n","date":"January 20, 2015 at 10:08 am","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","id":"comment-184855","author":"David O.","site":"shroudstory"},{"title":"Jeffrey Skurka on Buffalo Catholic Radio Station","post":"He won’t apologize. The internet makes bullies of us all.\n\n","date":"January 20, 2015 at 11:52 am","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","id":"comment-184875","author":"David Goulet","site":"shroudstory"},{"title":"Jeffrey Skurka on Buffalo Catholic Radio Station","post":"Happy to say he proved me wrong.\n\n","date":"January 22, 2015 at 2:48 pm","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","id":"comment-185442","author":"David Goulet","site":"shroudstory"},{"title":"Jeffrey Skurka on Buffalo Catholic Radio Station","post":"I’m happy to apologise for any hurt that may have been caused. I did not realise the lady was deceased and her partner was an active contributor.\nWhat can not be beyond criticism is pseudo-science.\nThis stuff is certainly “kooky”:\n  pyramid energies\n  alternative healing energies\n  crop circles\n  spontaneous human combustion\n  radionics\n\n","date":"January 20, 2015 at 5:07 pm","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","id":"comment-184923","author":"aljones909","site":"shroudstory"},{"title":"Jeffrey Skurka on Buffalo Catholic Radio Station","post":"Apology  accepted.  In discussions like these, I like to bring up the quote  by the  German philosopher Arthur Schopenhauer (1788-1860):  “All truth  passes  through three stages.  First, it is ridiculed.  Second, it is   violently opposed.  Third, it is accepted as being  self-evident.”  Pseudo-science  is a matter of perspective.  Some Shroud skeptics label the  STURP  scientists, many of whom worked in the U.S.’ space and nuclear  programs, as  pseudo-scientists ostensibly because they wouldn’t declare the  Shroud to be a  fake and/or entertained the idea that it might have wrapped the  historical  Jesus.  Here  are a few more of my favorite quotes regarding thought and reality in   science:  “Old  ideas are not right simply because they are old and new ideas are not  wrong  simply because the are new.”  -Astrophysicist  Tommy Gold  “My  own suspicion is that the universe is not only queerer than we  suppose, but  queerer than we can suppose.”   -J.B.S.  Haldane.  “I  shall not commit the fashionable stupidity of regarding everything I  cannot  explain as a fraud.”  C.G.  Jung  “Nature  never deceives us; It is always us who deceive ourselves.  -Jean  Jacque Rousseau  “All  progress resulted from people who took unpopular  positions.”  -Adlai  Stevenson  “All  great truths begin as blasphemies.”  -George  Bernard Shaw  “…after  a few more flashes in the pan, we shall hear very little more of  Edison or his  electric lamp.  Every claim he makes has been tested and  proved  impracticable.  -New  York Times, January 16, 1880  “X-rays  will prove to be a hoax”  -Lord  Kelvin (1824-1907), English physicist and mathematician, who  performed  mathematical analysis of electricity and magnetism and invented the   absolute-temperature scale.  “Heavier-than-air  flying machines are impossible.”  -Lord  Kelvin, President, Royal Society, 1895  “Anyone  who looks for a source of power in the transformation of the atom  is talking  moonshine.”  -Lord  Rutherford (1871-1937), physicist who developed the theory of atomic   structure  “There  is no likelihood that man can ever tap the power of the atom”  -Robert  Millikan, Nobel Prize physicist, 1923  “It  is entirely possible that behind the perception of our senses, worlds  are hidden  of which we are unaware.”  -Albert  Einstein  When  asked in a Discover Channel documentary about the possibility of the  validity of  the phenomenon called “remote viewing,” a scientist responded,  “I wouldn’t  believe it even if it was true.”  (Now there’s an open-minded   scientist!)\n\n","date":"January 20, 2015 at 6:58 pm","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","id":"comment-184938","author":"jmarino240","site":"shroudstory"},{"title":"Jeffrey Skurka on Buffalo Catholic Radio Station","post":"Here I want to consider another time the following questionable statement\n(taken from the words by Siefker) :\n>The body image would lose its optical properties, a result of alignment being lost\nover time possibly just by moving the cloth through earth’s magnetic field\nsuch as when the cloth is being transported.\n(“The Enigma of the Apparent Age of the Shroud of Turin … etc. …”, slide 67 of 112)\nbecause, in my opinion, this is a too vague hypothesis …\nWhere is the true proof on linen fibrils ?\nWhere are inherent experiments or useful references ?\nYesterday I didn’t consider the questions:\nWhat were the exact conditions during the transport of the relic to/from Montevergine (Avellino)?\nWho was the responsible about the (possible) photographic controls? \nBut I believe that I answered to the following question:\nWhere are the exact comparisons on inherent images?\nbecause I indicated as irrelevant the possible comparison\nand this was due to the inherent (probable) small magnitude\nfor the presumed effects…\n— — —\nHere the last phrase (of the same slide):\n>Also, until confirmed the body image should be protected from any extraneous\nmagnetic fields such as magnets and electrical transformers.\nSo …\nWhich kind of magnetic fields were present during controls of 1978\n(and subsequent “manipulations”)?\nAnother strange thing = slide 65 of 112 :\n“The Resurrection Event” = “The electric current is running along\nthe threads of the linen cloth and normal to the surface\nas is the magnetic field …”\nIn normal conditions electric current doesn’t run along\nthreads of linen because linen is an insulating material.\nSo, Siefker had not specified in a clear manner what\nwere these particular conditions.\nIn short, there is not this useful explanation…\n—————————————–\nHere the last curious thing.\nObserving the document that appears on the slide 83 of 112\nwe can read:\nMeasured C14 age = 106.8 (and then this is not 2400 !)\nThen : near 100 years old = “modern”… as you can easily read in that paper.\nPerhaps that result was a “good approximation” for radiocarbon dating a modern book…\nOn the other side (see at right side of this slide) there was only a simple explanation about the Dendro-Calibration\n( = Calibration of Radiocarbon Age to Calendar Years…) with an example…\nAm I wrong in my conclusion?\nI hope in your attention…\n\n","date":"January 22, 2015 at 12:08 pm","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","id":"comment-185414","author":"piero","site":"shroudstory"},{"title":"Jeffrey Skurka on Buffalo Catholic Radio Station","post":"The ultimate horrible dream that I made last night was that of two dogs … one of them had broken the head of the other poor dog, with bites… and then, after that scene, the living dog complained in a heartbreaking way… I beg your pardon… Sorry!\n\n","date":"January 22, 2015 at 12:20 pm","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","id":"comment-185417","author":"piero","site":"shroudstory"},{"title":"Jeffrey Skurka on Buffalo Catholic Radio Station","post":"Piero, you appear to be absolutely correct. I cannot be sure what the “measured age” of 106.8+/- 0.6% refers to, but the comment “reported result indicates an age of post 0 BP” means that the book was found to have been made after 1950, which is, by convention 0 BP.\nThe page on the left of slide 83 of Sturka’s presentation is a general Explanation Sheet, which shows how a normal test is calibrated. it takes, for example, a date of 2400 +/- 60 BP, and shows how it correlates, on the chart below, to a calendar date of 530 BC to 390 BC. Presumably the same sheet accompanied every report the Dating Company made. In a feat of quite staggering incompetence, Jeffrey Skurka has\n1) assumed that the illustration on the Explanation Sheet actually refers to the radiocarbon test report itself,\n2) assumed that a calculated radiocarbon date of 2400 BP in fact means a calendar date of 2400 AD.\nAt the 2014 conference where he presented this, there were a number of very distinguished, and very experienced physicists, who might have been looking out for evidence of a 2400 AD radiocarbon dating result having read about it in the abstract beforehand.\nPlease, somebody who was there, tell me you noticed!\n\n","date":"January 22, 2015 at 2:32 pm","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","id":"comment-185441","author":"Hugh Farey","site":"shroudstory"},{"title":"Jeffrey Skurka on Buffalo Catholic Radio Station","post":"And it is, of course, the page on the right, not the left. The left hand page is the report on the book cover, the right hand page is the general Explanation Sheet.\n\n","date":"January 22, 2015 at 5:39 pm","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","id":"comment-185474","author":"Hugh Farey","site":"shroudstory"},{"title":"Jeffrey Skurka on Buffalo Catholic Radio Station","post":"Well.\nBut now we have to work a lot for the other open questions…\n— —\nPerhaps my words about “The ultimate horrible dream” were a strange reaction, but really I really had this nightmare, after all (ultimately) our brain is working 24 h / 24 hours …\nNow (perhaps) it is an exaggeration to say that we have foiled the beginning of an attempt to validate the SHC myth / enigma discovering that banal error…\nHere I want to respect the memory of Sue Benford and I am friend of Joe Marino.\nI don’t want to discourage the experiments of who believe in SHC, but (now) I am more inclined to believe what underlined Hugh (at the beginning of this discussion) about a certain strange world…\nNow I pose my question:\nIs it possible that none of the researchers present at the meeting (= during Saint Louis Conference 2014) detected that simple mistake?\nThat story seems to be too strange.\nBut, always, it can happen a simple fall of attention…\n\n","date":"January 23, 2015 at 8:59 am","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","id":"comment-185689","author":"piero","site":"shroudstory"}]
