[{"title":"Joel Bernstein on Good Science, Bad Science, and the Shroud of Turin","post":"I watched the explanation closely, what is it telling us about the Shroud being  the actual burial cloth of Our Lord Jesus Christ ?\n\n","date":"November 14, 2015 at 4:36 am","url":"https://shroudstory.com/2015/11/14/joel-bernstein-on-good-science-bad-science-and-the-shroud-of-turin/","cat":"science_and_religion","id":"comment-214597","author":"Emmett McMahon","site":"shroudstory"},{"title":"Joel Bernstein on Good Science, Bad Science, and the Shroud of Turin","post":"This has to be the “good vs. bad science” everything else has shown that the Shroud is the Shroud of Christ. (by everything I mean all the later checking the 3D the date etc.)\n\n","date":"November 14, 2015 at 5:10 am","url":"https://shroudstory.com/2015/11/14/joel-bernstein-on-good-science-bad-science-and-the-shroud-of-turin/","cat":"science_and_religion","id":"comment-214600","author":"Emmett McMahon","site":"shroudstory"},{"title":"Joel Bernstein on Good Science, Bad Science, and the Shroud of Turin","post":"Oh, dear me, what a pity. I had occasion, a few days ago to criticise a ‘comparison’ between the work of Walter McCrone and Heller & Adler, because although it was a reasonable analysis of the STuRP scientists, it said virtually nothing about McCrone. Here, I was expecting something to justify the blurb: “This talk explores the tension between scientific fact and religious faith in the identification and verification of a sacred relic.” and “Some of the conclusions drawn from that study [the STuRP expedition], and the absence or presence of scientific evidence for those conclusions, has led to perhaps the quintessential conflict between acceptance of the validity and veracity of the scientific method on the one hand, and religious belief and faith on the other.” \nBut no. After a few interesting comments about good and bad science, Joel Bernstein merely recounted, sometimes word for word, Walter McCrone’s account, in ‘Judgement Day for the Turin Shroud’ of how he investigated the Shroud and the conclusions he drew from it. There was not a single mention of any other findings by any other scientist, let alone anything to dissent from McCrone’s painting hypothesis.\nBernstein did recall Carl Sagan’s ‘Baloney Detecting Kit’, whose second tenet is ‘Encourage substantive debate on the evidence by knowledgable proponents of all points of view,’ but no alternative points of view, let alone debate, were even suggested, let alone debated. Another tenet is ‘Can others duplicate the experiment and get the same result?’ Bernstein seemed unaware that others had indeed duplicated the experiment (examining the fibres), but got a different result.\nIn the question and answer session at the end, one of the audience asked if there were any chance of the radiocarbon dating being repeated, to which Bernstein’s reply (verbatim – see 1:12:06) was: “I recently saw another paper – they didn’t re-date it but they checked all the data of those three institutions and came up with the conclusion there were no errors, the sampling was correct, and all that was perfectly legitimate.” I do not believe this is true.\nI have no reason to suppose that Bernstein is particularly interested in the Shroud for itself, and he is correct that it provides an excellent focus for a debate, or a lecture, on the dichotomy between scientific fact and religious faith. Sadly, this video completely misses the opportunity.\n\n","date":"November 14, 2015 at 2:43 pm","url":"https://shroudstory.com/2015/11/14/joel-bernstein-on-good-science-bad-science-and-the-shroud-of-turin/","cat":"science_and_religion","id":"comment-214613","author":"Hugh Farey","site":"shroudstory"},{"title":"Joel Bernstein on Good Science, Bad Science, and the Shroud of Turin","post":"Professor Bernstein exaggerated the amount of work that  McCrone put in this work and missed obvious mistakes in that work.\nAt 47:36 “he examined more than  8,000 fibers”. It is actually Christine Skirius (a junior high school student, back then) who looked at more than 8,000 fibers to count the colored (yellow) and uncolored ones [1, p. 101][2, p. 83]. But that analysis has a trivial result: there is more yellowed fibers in the image area than in the non-image area. Actually, systematically going through the 32 tapes by McCrone to classify the sticky tapes was done in two days [1, p. 92].\nIt is also a bit disconcerting to hear at 34:24 “here’s Rinaldi with the Shroud”. It is not the Shroud but a copy of it on a cloth. Either Bernstein was careless in identifying what was on the photograph or he indeed thought it was the real Turin Shroud. I hope it is the former.\nBut major, and fundamental issues, exist in this work of McCrone, obviously not stated by Bernstein. For example, in Table IV [1, p. 93] several sticky tapes are not classified properly, which can be determined by simply looking at the location of the tapes provided on p. 79. Tapes 1HB, 2AF, and 2BF, classified as in image area but are not, and tapes 3AB, 3BB, and 4CB classified as not in image when actually they are. The study is also completely biased because on p. 92 McCrone states that he restudied some tapes that he previously misclassified but without restudying others. And actually his classification\ncorrelates more with the presence of blood where the sticky tapes were taken then with the body-image (yellow area). McCrone ignores that completely. But it was so obvious to check.\nAlso, Bernstein misunderstand what McCrone stated about the formation of the body-image: a forger is using a diluted paint barely visible when you apply it, then the fibrils would have yellowed to create the image. According to McCrone, the body-image does not come from the red ochre as Bernstein states in this video but the yellowing of the fibrils due to the supposed collagen used.\n[1] Walter C. McCrone, Judgment Day for the Shroud of Turin, 1999.\n[2] Walter C. McCrone, The Shroud of Turin: blood or artist’s pigment?, Acc. Chem. Res., 1990, 23 (3), pp 77–83, DOI: 10.1021/ar00171a004\n\n","date":"November 15, 2015 at 5:20 pm","url":"https://shroudstory.com/2015/11/14/joel-bernstein-on-good-science-bad-science-and-the-shroud-of-turin/","cat":"science_and_religion","id":"comment-214643","author":"Mario Latendresse","site":"shroudstory"},{"title":"Joel Bernstein on Good Science, Bad Science, and the Shroud of Turin","post":"Catholic should obviously be capitalized since the writer is referring to cathedrals that are Catholic.  Scanty historical record does not impugn the relics or the veracity of them.  Not being able to prove they are or not in no way disproves or even sheds doubt.\n\n","date":"November 15, 2015 at 9:28 pm","url":"https://shroudstory.com/2015/11/14/joel-bernstein-on-good-science-bad-science-and-the-shroud-of-turin/","cat":"science_and_religion","id":"comment-214647","author":"Dcn Andy","site":"shroudstory"},{"title":"Joel Bernstein on Good Science, Bad Science, and the Shroud of Turin","post":"Of good science, bad science and its dinosaurs:  \nThis morning I had the wonderful privilege of attending an address and presentation by Dr Swee Tan with my local Probus group.  Tan grew up in Malaysia as one of 14 children in a poor family.  Before coming to New Zealand he trained in medicine in Australia, eventually specialising in plastic surgery.  He has made breakthrough research in the benign tumours known as strawberry birthmarks, a horrible distinctive disfigurement found in infants.  His discoveries have resulted in dramatic shrinkage of these birthmarks using drugs normally prescribed for high blood pressure. \nCoincidentally, I discovered that the current issue of the NZ Listener had also published a fulsome article and interview of Dr Swee Tan.  You can find out more about his work from the web-site of the Gillies McIndoe foundation:\nhttp://gmri.org.nz/cms/  \nThe Listener interview had some interesting observations on his particular research and research generally.  I think these comments might well apply to Shroud research!  \nOn his work in Boston with mentor Professor Judah Folkman, inventor of the world’s first pacemaker, first slow-release contraception, and discovery that tumours could make new blood vessels:-\n“… He was ridiculed by lots of people for years and years and couldn’t get his work published.  People now recognise that he was a great inventor.  There are drugs based on his research now used for people who are going blind. …” \nOn his own research into strawberry birthmarks:-\n“… Our work couldn’t be published for a long time, because people thought we were mad.  / Q. Why did they think you were mad? / A. Science is a very conservative discipline.  It does not take kindly to disruptors.  Those who are regarded as experts often stand in the way of progress.  They are the experts of the past but not the present and certainly not of the future.”  \nAnd there you have it.  Obstructionism from the old guard.  McCrone couldn’t wean himself from his microscope.  We see it today with an unwillingness to consider new ideas which just might reveal the secret of the image.  But in science, even for Tan, there must still be proof, and results must still be obtained. \nBy all means, take a look at the Gillies McIndoe web-site, and see if tells you anything about genuine research, the fruitful results that might be obtained from it, and ponder the obstructionism encountered to arrive at it.  What does it tell you?\n\n","date":"November 16, 2015 at 5:00 am","url":"https://shroudstory.com/2015/11/14/joel-bernstein-on-good-science-bad-science-and-the-shroud-of-turin/","cat":"science_and_religion","id":"comment-214653","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Joel Bernstein on Good Science, Bad Science, and the Shroud of Turin","post":"Interesting thoughts Daveb.\nThis got me thinking about homeopathy…skeptics call it pseudoscience. It doesn’t seem to have any scientific basis. But it also works for many people. It really helped my stomach problems.\nPlacebo? Or something working at a level that science can’t explain?I felt it worked for me at some deeper level, but that might just all be mental.\nthe Shroud…\n\n","date":"November 16, 2015 at 5:37 am","url":"https://shroudstory.com/2015/11/14/joel-bernstein-on-good-science-bad-science-and-the-shroud-of-turin/","cat":"science_and_religion","id":"comment-214654","author":"Thomas","site":"shroudstory"},{"title":"Joel Bernstein on Good Science, Bad Science, and the Shroud of Turin","post":"There is nothing of pseudoscience in the work of Dr Swee Tan, check the Gillies McIndoe web-site.  Like many others in the history of Science, he faced obstruction and skepticism, but despite the opposition he persisted and was able to demonstrate his results.  That is the key to any new theory, and I think it applies to Shroud research.  A version of “By their fruits you will know them” if you like.  \nThere will always be the naysayers as is evident even on this web-site.  Niccolo Machiavelli said it long ago: \n“There is nothing more difficult to take in hand, more perilous to conduct, or more uncertain in its success, than to take the lead in the introduction of a new order of things.”  The Prince.\n\n","date":"November 16, 2015 at 2:54 pm","url":"https://shroudstory.com/2015/11/14/joel-bernstein-on-good-science-bad-science-and-the-shroud-of-turin/","cat":"science_and_religion","id":"comment-214676","author":"daveb of wellington nz","site":"shroudstory"}]
