[{"title":"Just Thinking About Security","post":"I think that Turin has a different situation compared to Rome. \nIn any case I think has already been taken “into due consideration”\nin this blog, the attempt of a dialogue with Islam (= Co.Re.Is…\nWhich, however, does not represent all Muslims in Italy …) implemented\nby Msgr. Ghiberti. Unfortunately our own dialogue was not very fruitful…\n— —\nToday I have read an article (Newspaper source = “Corriere della Sera”) titled:\nTerrorismo: compare il Colosseo sul sito online dell’Isis\nLa scritta: «Domani il Corano a Roma come a Parigi». Lo rende noto il sito Wikilao\nRough translation =\nTerrorism: the Coliseum appears on the site online Isis. The inscription: “Tomorrow the Koran in Rome as in Paris.” This was announced by the site Wikilao\nROMA – Sono molti gli avvertimenti minacciosi per l’Italia comparsi sul web all’indomani delle azioni in Francia dei fratelli Kouachi e di Amedy Coulibaly, alcuni dei quali esaminati con particolare attenzione dagli 007…\nRough translation =\nROME – Many warnings threatening Italy appeared on the web in the aftermath of the shares in France brothers Kouachi and Amedy Coulibaly, some of which have been examined with particular attention by  the 007 agents…\n— — —\nHere what appeared in the past (= last year),\nposted on Aug, 29 2014 @ 04:17 PM \n>the Roman newspaper “Il Tempo” published a disturbing report\nthat Francis is “in the crosshairs” of ISIS for “bearing false witness” against Islam.\nCiting anonymous sources within Italy’s intelligence community\nand pointing to notable heightened security in Rome, the paper\nwent on to say that ISIS plans to heat things up by “raising the level\nof confrontation” with Europe, Italy and very specifically Pope Francis,\nthe “greatest exponent of the Christian religions.”\n>The Vatican downplayed the concerns, calling them unfounded\ndespite growing concern in Italy that it is not just the Pope who\nis under threat. “There is nothing serious to this,” Vatican spokesman\nFederico Lombardi told Catholic News Agency. “There is no particular\nconcern in the Vatican.” … …\n— —\nHere another question: \nManfredonia, nasce il premio “Je Suis Charlie” = “Vietate le vignette contro le religioni”\nFa discutere il regolamento del concorso “Carnevale in satira” dedicato alla rivista parigina colpita dall’attacco del 7 gennaio.\nRough translation:\nManfredonia, founded the prize “Je Suis Charlie” = “Prohibited cartoons against religions”\nDebates on regulation about competition “Carnival in satire” dedicated to the Parisian magazine affected by the attack of 7 January.\nLink:\nhttp://www.tgcom24.mediaset.it/cronaca/puglia/manfredonia-nasce-il-premio-je-suis-charlie-vietate-le-vignette-contro-le-religioni-_2089721-201502a.shtml\nThe Carnival of Manfredonia, now in its 62nd edition, will start on 17 January.\nBut there is time until February 13 to try to win the first “Award Carnival Satire: Je Suis Charlie”.\n— — — **** — — —\nIn Conclusion …\n …But who would have an interest in destroying\nthat Ancient Linen cloth?\nI don’t know.\nWhat are your views on the problem of security?\n\n","date":"January 16, 2015 at 9:43 am","url":"https://shroudstory.com/2015/01/13/just-thinking-about-security/","cat":"2015","id":"comment-183725","author":"piero","site":"shroudstory"}]
