[{"title":"Keep it Simple: Can Anyone Help?","post":"I am reasonably certain that the speaker has a specifically NZ accent, but am unable to identify him otherwise. In the centre top background is a yin-yang symbol. The mosaic circles at bottom left background may be a representation of a stylised NZ Maori motif.\n\n","date":"January 7, 2014 at 3:59 pm","url":"https://shroudstory.com/2014/01/07/keep-it-simple-can-anyone-help/","cat":"news_&_views","id":"comment-72502","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Keep it Simple: Can Anyone Help?","post":"DaveB\nYou never disappoint me. Thanks.\n\n","date":"January 7, 2014 at 4:25 pm","url":"https://shroudstory.com/2014/01/07/keep-it-simple-can-anyone-help/","cat":"news_&_views","id":"comment-72506","author":"John Klotz","site":"shroudstory"},{"title":"Keep it Simple: Can Anyone Help?","post":"His name is Ian Lawton. See here: http://www.soulseeds.com/grapevine/\n\n","date":"January 7, 2014 at 4:38 pm","url":"https://shroudstory.com/2014/01/07/keep-it-simple-can-anyone-help/","cat":"news_&_views","id":"comment-72507","author":"Jeffrey Liss","site":"shroudstory"},{"title":"Keep it Simple: Can Anyone Help?","post":"BTW, I also found a site that attributes the quote originally to Thomas Cathcart, [ http://www.goodreads.com/quotes/tag/sherlock ] author of “Plato and a Platypus Walk into a Bar: Understanding Philosophy Through Jokes.”  If the joke is printed in the book, it will probably make for a better reference.\n\n","date":"January 7, 2014 at 4:46 pm","url":"https://shroudstory.com/2014/01/07/keep-it-simple-can-anyone-help/","cat":"news_&_views","id":"comment-72510","author":"Jeffrey Liss","site":"shroudstory"},{"title":"Keep it Simple: Can Anyone Help?","post":"One more thing. Jeffrey if you wish to be kept in touch with my progress, we are rounding the far turn and heading into the home stretch, my E-Mail address is klotzlaw@gmail.com That invitation is not open to everybody.\n\n","date":"January 7, 2014 at 6:10 pm","url":"https://shroudstory.com/2014/01/07/keep-it-simple-can-anyone-help/","cat":"news_&_views","id":"comment-72517","author":"John Klotz","site":"shroudstory"},{"title":"Keep it Simple: Can Anyone Help?","post":"Jeffrey, Thanks for identifying the speaker. His web-site says they’re an Australian family living in America. But I thought his accent seemed more typically NZ than Australian. The Aussie “i” seems more of an “ee” sound to NZ ears, and I couldn’t detect that.\n\n","date":"January 7, 2014 at 6:14 pm","url":"https://shroudstory.com/2014/01/07/keep-it-simple-can-anyone-help/","cat":"news_&_views","id":"comment-72519","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Keep it Simple: Can Anyone Help?","post":"Were it not for the trolls (maybe we all need a troll once in awhile) this web site would be beyond belief. My E-Mail to Dan has inspired such an intelligent dialogue and provided an answer to a not quite idle questioned, I am thoroughly humbled – and that takes some doing.\nThanks everybody, and especially thank you Dan.\n\n","date":"January 7, 2014 at 6:31 pm","url":"https://shroudstory.com/2014/01/07/keep-it-simple-can-anyone-help/","cat":"news_&_views","id":"comment-72520","author":"John Klotz","site":"shroudstory"},{"title":"Keep it Simple: Can Anyone Help?","post":"John, I think the criterion of simplicity is not the only one, and not even the most important of all.\nAccording to Christopher B. MacCullagh you have (Justifying historical descriptions, p.28), in decreasing order: 1) plausibility: does our knowledge in other well-known fields support or reinforce the hypothesis? 2) Explanatory scope: can the hypothesis do justice to all the facts? 3) Explanatory power: the hypothesis has to be specific and accurate, rather than ambiguous. 4) Less ad hoc: ceteris paribus, the hypothesis should not invoke or rely on unverified data (this includes the criterion of simplicity).\n\n","date":"January 7, 2014 at 5:10 pm","url":"https://shroudstory.com/2014/01/07/keep-it-simple-can-anyone-help/","cat":"news_&_views","id":"comment-72511","author":"Tristan Casabianca","site":"shroudstory"},{"title":"Keep it Simple: Can Anyone Help?","post":"Tristan,\nMany thanks for your comment. I have obtained a copy of your recent article in the Heythrop Journal but have not had a chance to dig into it yet. My goal is write in voice that is intellectually correct but understandable by a general audience.\nIf you would send me your E-Mail address, it might be very helpful for us to correspond directly. Dan’s blog is important and I really have found the responses extremely helpful but I do not want to excite the trolls who have been so far silent – and I hope they remain that way.\nMy E-Mail address is klotzlaw@gmail.com\n\n","date":"January 7, 2014 at 6:03 pm","url":"https://shroudstory.com/2014/01/07/keep-it-simple-can-anyone-help/","cat":"news_&_views","id":"comment-72515","author":"John Klotz","site":"shroudstory"},{"title":"Keep it Simple: Can Anyone Help?","post":"If the simplest explanations are usually the best (which I believe, very often, it is), I have to think that:\n1- The Mandylion was a small towel showing the (most probably painted) face of the living Jésus-Christ without showing any bloodstains or bruises.\n2- The Shroud of Turin is the authentic Shroud of Jesus of Nazareth.\n3- The body image on it was produced by some form of a natural interraction between the top surface of the cloth (probably with impurities) and some products (probably biological) released by the dead corpse of Jesus shortly after his death and burial.\n\n","date":"January 7, 2014 at 5:37 pm","url":"https://shroudstory.com/2014/01/07/keep-it-simple-can-anyone-help/","cat":"news_&_views","id":"comment-72513","author":"Anonymous","site":"shroudstory"},{"title":"Keep it Simple: Can Anyone Help?","post":"I demur from one point of your analysis. Given the lack of similar artifacts of any kind, I think the image was caused by the transformation of the body by the Resurrection. The Shroud is s singular object and so is the Resurrection. They intersect. As to the authenticity, I agree that it is the only reasonable explanation of the Shroud, As to the Resurrection, we have to work on that but I see no other explanation.\n\n","date":"January 7, 2014 at 6:07 pm","url":"https://shroudstory.com/2014/01/07/keep-it-simple-can-anyone-help/","cat":"news_&_views","id":"comment-72516","author":"John Klotz","site":"shroudstory"},{"title":"Keep it Simple: Can Anyone Help?","post":"Quote: “The Shroud is s singular object and so is the Resurrection. They intersect.”\nOf course, I disagree completely with your point of view.  On this subject, here’s a good question for you:  And why not the intersection could not be found between the dead and tortured corpse of Jesus BEFORE his resurrection and the image on the cloth?  Why not?  Because there are no other shroud with a body image like this elsewhere?  This is not an argument since we don’t have any other intact burial shroud of a crucified person for antiquity!  And why is it that way?  Because the fact that someone was buried in a pure linen shroud of high quality during antiquity after he had been crucified with the Roman method is most probably ALSO UNIQUE, as it is for the Resurrection!  So, I think it’s fair to say that the Shroud is a singular object and so is the burial of a crucified man in a pure linen shroud of high quality, which can be one major cause of the image formation.  Another one is most certainly the fact that this man did not stayed in contact with his Shroud for more than 72 hours, which is another pretty “singular” feature for a dead corpse that has been buried during antiquity!\nSo, you see?  The Resurrection is NOT the only “singular” feature that is associated with the Shroud and, therefore, your argument is pretty weak.\n\n","date":"January 8, 2014 at 4:50 pm","url":"https://shroudstory.com/2014/01/07/keep-it-simple-can-anyone-help/","cat":"news_&_views","id":"comment-72617","author":"Anonymous","site":"shroudstory"},{"title":"Keep it Simple: Can Anyone Help?","post":"What I really meant in my previous comment is the fact that there are other “singular” features related to the Shroud, other than the possibility that this man was risen from the dead, and some of those (i.e. the singular fact that the body only stayed in contact for a short period of time and the singular fact that a crucified man has been buried in such an expensive Shroud) can well have had a huge impact on the formation of an image on the cloth. Note that these 2 “singular” features are most certain facts than the possibility that this man was risen from the dead…\n\n","date":"January 8, 2014 at 5:37 pm","url":"https://shroudstory.com/2014/01/07/keep-it-simple-can-anyone-help/","cat":"news_&_views","id":"comment-72619","author":"Anonymous","site":"shroudstory"},{"title":"Keep it Simple: Can Anyone Help?","post":"If the simplest answers are the best , then researching the relics from the ‘Lord’s Tomb’ that are documented as arriving in northern France DIRECTLY from the Holy Land in the second half of the first millennium close to Lirey is obviously far simpler   than suggesting\n1) 550 years of unknown provenance for the Shroud .\n2) Very tenuous evidence indeed that the Shroud is the Image of Edessa.\n3) No reliable evidence  for the provenance of the Shroud between 1204 and 1355.\nThe reference for those who want to follow this up is  ‘Hagiographical horizons: collecting exotic relics in early medieval France’ Chapter Ten , in Michael McCormick, Origins of the European Economy,Cambridge, 2001.\nMargaret de Charny climbed that the Shroud came to her grandfather as ‘a spoil of war’. She may or may not have been correct but the most likely wars were those in which Charny fought ( and died at Poitiers in 1356) in northern France in the 1350s about the same time as the first documentation for the Shroud. These cities were being fought over and certainly relics were an acknowledged spoil of war( compare the Crusaders in 1204), so it would not be unusual for a relic captured by one side or the other in these protracted wars to be taken as a spoil of war. \nLots more research needed but so far I have never read that de Charny may well have gained the Shroud when he was fighting the English but this is what he was doing at the time when he he seems to have first got it and his grand-daughter may have been right all along!!\n\n","date":"January 9, 2014 at 7:42 am","url":"https://shroudstory.com/2014/01/07/keep-it-simple-can-anyone-help/","cat":"news_&_views","id":"comment-72715","author":"Charles Freeman","site":"shroudstory"},{"title":"Keep it Simple: Can Anyone Help?","post":"interesting. Perhaps a fertile area of research for anyone who can read and understand old French texts (not I!)\n\n","date":"January 9, 2014 at 7:54 am","url":"https://shroudstory.com/2014/01/07/keep-it-simple-can-anyone-help/","cat":"news_&_views","id":"comment-72718","author":"Matthias","site":"shroudstory"},{"title":"Keep it Simple: Can Anyone Help?","post":"Sorry ‘claimed’ not ‘climbed’!\n\n","date":"January 9, 2014 at 7:43 am","url":"https://shroudstory.com/2014/01/07/keep-it-simple-can-anyone-help/","cat":"news_&_views","id":"comment-72716","author":"Charles Freeman","site":"shroudstory"},{"title":"Keep it Simple: Can Anyone Help?","post":"Charles,\nI think your post is valuable and I would not deign to argue with you about it. However, I have never regarded the historical provenance (since its creation circa 30 CE) to be an issue. To me providence is the interesting aspect of the Shroud.\nThe issue is authenticity and we may never know a complete provenance of the Shroud from time it disappeared from the tomb until it was displayed in Lirey circa 1350 CE and I am really not sure that matters.\nMartin Kemp is a colleague of yours (I mean a fellow art historian) who made a quite a splash with is involvement authenticating a drawing of a young woman as an original daVinci. A few years earlier, Christies had  evaluated at $20,000 and sold it on consignment. A couple of years later, a new owner showed it to a visitor. He had it stashed in a drawer and the visitor told him that it looked like a da Vinci. Enter Martin Kemp of Oxford, a da Vinci specialist. The known provenance of La Principessa was only from the late nineteenth century at best.\nHe made an exacting scientific examination and determined after that examination that it was a genuine da Vinci and its worth ballooned to over $100,000,000,  .let me spell it out: one hundred million dollars. \nKemp became the center of a heated debate. His finding was disputed (if not ridiculed) by other experts. He continued his attempts to  determine its earlier provenance. He was successful. In Poland he found a folio that celebrated the wedding of a Italian noble’s illegitimate daughter. The noble was a da Vinci patron. She was, as I recall only thirteen and died from complications of pregnancy a few months after her wedding. The folio was bound on the left side. There were holes on the left side of the La Principessa that matched the binding of the folio.\nIt was impossible to determine when La Principessa was removed from the folio, but it was. We (and Kemp)  do not know the name of the thief and in what era he operated. However, the discovery of the folio was definitive as to provenance. \nNot the gaps in possession and provenance that span centuries. Note the deciding  factor as holes that matched the binding. Note the acceptance of the La Principessa and the astronomical jump in its evaluation.\nAs far as the Shroud is concerned, Kemp recently wrote a book on icons: From Christ to Coke. He identified the image of Christ as the greatest of historical icons.\nAlas, he indicated at one point in his book that he was more or less an agnostic. (He kind of let that slip.) It’s my interpretation of what he wrote.\nHe dismisses the Shroud as early Renaissance from the north of Italy or France. He apparently did this a merely a visual observation of photographs of the Shroud. He certainly did not conduct the actual painstaking examination that he did with La Principessa. Seriously, if here is one thing the STURP examinations demonstrated: it was not a painting.\nI am not ready to write iy today but this episode will be recited in my manuscript. Here’s the important fact. Based on his evaluation, the value of La Principessa was increased by a factor of 10,000X. And there are still huge gaps in his provenance and there is no chain of title complete from da Vinci’ patron to modern times. Indeed, the determining fact were binding holes in the side of the drawing. Matching holes – there is something about that. Can you think of an analogy?\nI can, guess what?\n{I am writing this on the fly. I would really appreciate your prospective on this, or if I misstated anything – in your opinion. I am familiar with your dismissal of the poker holes (which were not poker holes).\n\n","date":"January 9, 2014 at 8:44 am","url":"https://shroudstory.com/2014/01/07/keep-it-simple-can-anyone-help/","cat":"news_&_views","id":"comment-72725","author":"John Klotz","site":"shroudstory"},{"title":"Keep it Simple: Can Anyone Help?","post":"Wikipedia tells me that Geoffroi de Charny participated in a Crusade led by Humbert II of the Viennois. It appears to have been somewhat abortive. Does anyone know if it even reached Constantinople? If the shroud really was a “spoil of war,” de Charny is more likely have received it fighting the English than the Turks.\n\n","date":"January 9, 2014 at 8:02 am","url":"https://shroudstory.com/2014/01/07/keep-it-simple-can-anyone-help/","cat":"news_&_views","id":"comment-72720","author":"Hugh Farey","site":"shroudstory"},{"title":"Keep it Simple: Can Anyone Help?","post":"John- an interesting case study. Unhappy as I am with the Edessa theory which has been around for many years without finding a single specialist in this period of Byzantine history/ Byzantine relics to support it, I am simply interested in alternatives that may have more to back them and be in general more plausible. As the Shroud of Compiegne, also in northern France, showed, once a relic was in the possession of a church, in this case since 876, it tended to be looked after and this is a crucial point with linen that is so vulnerable to damp. The survival of a linen cloth over two thousand years has always been a a crucial difficulty (if not always acknowledged as such) for those who think it authentic and so one must look for places where it may have been safely stored( I am not convinced AT ALL by that gateway in Edessa as a dry storage space!).\nNorthern France was rich in relics including those of the Passion. One thing that amazes me is that we are constantly told that the Shroud is the most researched artefact in history and I, admittedly not from wide reading, have never seen a single account that discusses this possibility that it was among the relics that came directly from the Holy Land to northern France hundreds of years before the Crusades. Again, as I have said earlier, I have never seen a single account that suggests that de Charny may have won it as ‘a spoil of war’ in the wars with the English that took up the last years of his life and fit exactly with the dates of first account of the Shroud in his possession.\nI doubt whether we would be able to confirm any of this but it stares me in the face as many times more likely that the Edessa route.\nPerhaps Hugh can use his editorship to put together some of these alternative routes (another is the influx of relics to the Blachernae chapel in Constantinople in the fifth century directly from Jerusalem when Jerusalem was still part of the Byzantine empire- we all know what was seen in that chapel by Robert de Clari eight centuries later and it would have been kept safe from damp here as well!).\n\n","date":"January 9, 2014 at 11:08 am","url":"https://shroudstory.com/2014/01/07/keep-it-simple-can-anyone-help/","cat":"news_&_views","id":"comment-72739","author":"Charles Freeman","site":"shroudstory"},{"title":"Keep it Simple: Can Anyone Help?","post":"Keep at it Charles. Your opinions and expertise are valuable. I commend all those who are dedicated to tracking the complete provenance from Tomb to Turin. If it is ever unraveled I am sure that it will be a fascinating story full of interesting characters, some  saints, some not so saintly.\nRecently in my draft which is now up to date and has only the ramification chapters to go, I referred to the resignation of Benedict and the fact that-his greatest gift to the Church may have been establishing a precedent for elderly popes to resign rather than clinging to their office even though severely incapacitated. (The idea of the being Benedict’s greatest gift is not original with me but I can’t put a finger on where I read it right now.)\nHere’s what I have written:\n“Benedict had been a confident of his predecessor and was at his side throughout his decline. In 2013, Benedict was a year older than John Paul was at the time of his death. There is no reason not to take Benedict’s stated reason at face value and in his resignation he established a precedent for other popes in declining years. The precedent he set may very well be his greatest contribution to the Church. He certainly fared better than the last previous pope to truly voluntarily resign: Pope Celestine XII in 1294. He wished to return to his pre-papacy life as a hermit. Alas, Celestine was arrested by his successor and died a papal prisoner”\nThe irony is that after I wrote that and put Chapter 13 to bed, I discovered on a lamp table a book about Celestine. I asked my wife about it. It turns out she had purchased it at Barnes and Noble but hadn’t gotten into it yet: Coincidence, providence, provenance????\nGo figure.\n\n","date":"January 9, 2014 at 11:44 am","url":"https://shroudstory.com/2014/01/07/keep-it-simple-can-anyone-help/","cat":"news_&_views","id":"comment-72747","author":"John Klotz","site":"shroudstory"},{"title":"Keep it Simple: Can Anyone Help?","post":"Some few months back, Max Patrick Hamon had a posting on this site depicting the ‘scourging of Christ’ from the Carolingian Stuttgart Psalter of 800-814. The illustration seemed to have some allusions that may be Shroud related, or possibly just coincidence. They included an unusually naked Christ being scourged by two executioners either side using Roman flagra. The Christ figure had several scourge marks on his back and legs, and with hands crossed over his loins. There were also hand signs suggesting the forehead eta shaped blood-flow on the head. \nCharlemagne did have some contact with Constantinople, and his court might therefore have had some knowledge of the Shroud figure if it had been revealed at that time. Daniel Scavone’s analysis of sources makes a strong case for the Shroud being in Constantinople before 1204. Or is it just possible, as Charles infers, that the Shroud might already have been in France during the reign of Charlemagne? Large volumes of records in France were destroyed during the 18th c. Reign of Terror there, and during various wars. Any trail that once might have existed is likely now cold and has disappeared from history. We may now never know!\n\n","date":"January 9, 2014 at 4:23 pm","url":"https://shroudstory.com/2014/01/07/keep-it-simple-can-anyone-help/","cat":"news_&_views","id":"comment-72785","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Keep it Simple: Can Anyone Help?","post":"Jesus spoke to me on November 24, 2013, the Feast Day of Christ the King. He said, “I am Christ the King.” He hugged my heart three times in succession. Without speaking, He conveyed a message. He wanted everyone (humanity) to know: He loves you.\nJesus has interacted with me numerous times. I simply report these contacts. I have read about the Shroud, and I have identified with Our Lord’s suffering. In His sacrificial act, He inspires us to trust in Him and in His love. \nMay God bless you.\n\n","date":"January 9, 2014 at 5:13 pm","url":"https://shroudstory.com/2014/01/07/keep-it-simple-can-anyone-help/","cat":"news_&_views","id":"comment-72790","author":"Elizabeth","site":"shroudstory"},{"title":"Keep it Simple: Can Anyone Help?","post":"Next time you talk with him, tell him that I can’t wait to meet him in Heaven!  I’m sure at that moment, I won’t care about the Shroud of Turin AT ALL… :-)\n\n","date":"January 9, 2014 at 5:34 pm","url":"https://shroudstory.com/2014/01/07/keep-it-simple-can-anyone-help/","cat":"news_&_views","id":"comment-72792","author":"Anonymous","site":"shroudstory"}]
