[{"title":"Because it Needed to be Said: Contaminated in the Weaver’s Workshop","post":"I listened to the presentation by Paul Maloney few years ago already on the website Russ Breault. Since that day, I never understood why these provocative statements of Maloney have not been the subject of public debates on this blog and elsewhere concerning the question of whether or not the substances found by Rogers (and also Adler concerning the presence of aluminium) and later confirmed by John Brown for the C14 corner are truly unique to this area of the Shroud or if they are not, in fact, present almost everywhere on the shroud, like Maloney seem to suggest in his presentation.\nBut one thing’s for sure :  If Maloney understanding of Nitowski and McCrone’s analyses is correct, it would be incredible to note how different this conclusion is versus Rogers own analyses of the same material taken from the Shroud’s surface in 1978! \nPersonally, I have a great problem to believe someone as profesionnal and skilled as Ray Rogers when it comes to chemistry would not have come to the same conclusion than Maloney if that was really the case.  Again, we must understand that the material analyzed by Nitowski and McCrone is the very same material that was used by Rogers to do his comparative analyse between the C14 corner and the main body of the Shroud. \nI really wonder what my friend Barrie Schwortz has to say about these comments by Maloney…\n\n","date":"May 18, 2013 at 4:25 pm","url":"https://shroudstory.com/2013/05/18/because-it-needed-to-be-said-contaminated-in-the-weavers-workshop/","cat":"uncategorized","id":"comment-33965","author":"Yannick Clément","site":"shroudstory"},{"title":"Because it Needed to be Said: Contaminated in the Weaver’s Workshop","post":"One more comment to complete my first one:  Even if Maloney’s hypothesis would be correct concerning the possibility that there can be madder rose, an aluminum mordant and gum Arabic everywhere on the cloth and not just in the C14 zone (I don’t think so, but let’s assume it is true), the simple fact that we can see an evident difference on the Quad mosaic photos between the C14 corner and the main body of the cloth is enough to be highly suspicious about the possibility that the C14 dating of 88 could have been done with a truly representative sample of the main cloth…\n\n","date":"May 19, 2013 at 6:15 pm","url":"https://shroudstory.com/2013/05/18/because-it-needed-to-be-said-contaminated-in-the-weavers-workshop/","cat":"uncategorized","id":"comment-34070","author":"Yannick Clément","site":"shroudstory"},{"title":"Because it Needed to be Said: Contaminated in the Weaver’s Workshop","post":"I never really spent much time on the process of the quad mosaic and what does it mean.  If I’m not mistaken it was panchromatic film exposed with primary colors, R.G.B.\nThe image itself is very warm so I’m assuming that the three different exposures were not gray balanced to each other. ( there might be a reason for that) I believed I used  a 7 step gray wedge when I made separations for proper exposure of each of the primary colors. (It’s been a very long time). For me, looking at the final color transparency of the quad image, I’m not sure what you can determine from the results, especially chemically. strictly talking about the film characteristics, I can conclude the panchromatic film for each exposure is experiencing exposure deficiency from obstruction during the back lighting when photographing the TS.  All I can conclude is the reproduction of the final image on the transparency demonstrates color crossovers.\n\n","date":"May 20, 2013 at 11:21 am","url":"https://shroudstory.com/2013/05/18/because-it-needed-to-be-said-contaminated-in-the-weavers-workshop/","cat":"uncategorized","id":"comment-34126","author":"Giorgio","site":"shroudstory"},{"title":"Because it Needed to be Said: Contaminated in the Weaver’s Workshop","post":"I communicated with Paul regarding the madder rose.  I’ve asked him to put something together for me to post but he’s not gotten back with me.  Basically, he said madder rose is not found throughout the Shroud, just in 3 areas:  the Raes corner and STURP area 3-CB and 3-AB.\n\n","date":"May 20, 2013 at 9:30 pm","url":"https://shroudstory.com/2013/05/18/because-it-needed-to-be-said-contaminated-in-the-weavers-workshop/","cat":"uncategorized","id":"comment-34154","author":"Joe Marino","site":"shroudstory"},{"title":"Because it Needed to be Said: Contaminated in the Weaver’s Workshop","post":"Joe, these informations contradict your own paper entitled “Discrepancies in the Radiocarbon Dating Area of the Turin Shroud”, in which you state that the potential trace of madder rose was only found in one sample (1FH and not 3CB or 3AB) that was immediately adjacent to the C14 corner :  see my own comment below (https://shroudstory.com/2013/05/18/because-it-needed-to-be-said-contaminated-in-the-weavers-workshop/#comment-34197).\nCan you give us more explanation about your own statement versus the infos you get from Paul please?  I must say that I’m a bit lost… If what you said in your paper is correct (i.e. the only sample where potential madder rose was found is adjacent to the C14 corner), then the hypothesis you described in your paper has a very good chance to be correct.  But if Paul Maloney is correct and if samples 3CB and 3AB are located far from the C14 corner, then I don’t know what to think.  \nCan you tell me where exactly the samples 3CB and 3AB are located?  I’m not very familiar with the mapping done by STURP.\n\n","date":"May 21, 2013 at 10:43 am","url":"https://shroudstory.com/2013/05/18/because-it-needed-to-be-said-contaminated-in-the-weavers-workshop/","cat":"uncategorized","id":"comment-34215","author":"Yannick Clément","site":"shroudstory"},{"title":"Because it Needed to be Said: Contaminated in the Weaver’s Workshop","post":"Thank you Joe. I also have McCrone’s slides that Paul mentioned  in his presentation at the 2008 Ohio conference.\nOn the slide mounts  and letters McCrone sent to Fr. Otterbein, McCrone mentions many more slides than the 3-AB and the 3-CB that contains iron oxide an inorganic substance. Nitowski has photographed and archived over 500 slides and has indicated many more area’s that contained iron oxide. If you recall  Kohlbeck  analyzed sticky tape 6BF which is the front area of the spear wound where he made his  observation and refuted Dr. McCrone’s claim that the blood was Iron oxide. \n I still think the major problem  has been the nomenclature in the TS research defining what is present on these sticky tape. The term “The yellow amorphous tubular flaked like material resin” means what? Iron oxide, Myrrh, starch, biocoating, or blood?\nBelow is an excerpt of http://holyshroudguild.org/dr-raes-problematic-threads_3.html\nJoe if you can elaborate further please do. \n “A wonderful observation occurred on the day that Dr. Kohlbeck reexamine the sticky tapes. Because of Dr. Kohlbeck observation after 3 months in Cargille oil, he deemed the red particles that Dr. McCrone claimed as Iron Oxide was in fact an organic substance and presumed it was blood based on Dr. Heller’s findings.  Dr. Kohlbeck did tell Dr. McCrone about his observation.  Sadly, Dr. McCrone never did mentioned that in his book “Judgement day of the Turin Shroud”, published in 1997. Dr. McCrone had 15 years to refute Dr. Kohlbeck’s finding but undoubtedly didn’t. Why?\nI had the pleasure speaking with Dr. Kohlbeck on August 26th 2011.  I contacted him so I could  ask him if he had any knowledge of the Raes thread. He explained to me that he had  no knowledge of Dr. Nitowski’s claim that the thread was switched. We then began to discuss the red particles. Dr. Kohlbeck explained to me that Sue Benford contacted him and requested if he could send her his microscopic photographs of the lance wound area where Dr. Kohlbeck made his observation. (6-BF). She explained to him that she believes what Dr. Heller thought was blood is actually the gum,dye,mordant coating which Dr. Kohlbeck simply referred in his findings as Starch. Sue Bedford continued to  explain the invisible weave theory to Dr. Kohlbeck which he found to be very fascinating. Sue Bedford’s explanation was very plausible to him and would easily concede that the  theory that it was blood was wrong”.\n\n","date":"May 20, 2013 at 11:54 pm","url":"https://shroudstory.com/2013/05/18/because-it-needed-to-be-said-contaminated-in-the-weavers-workshop/","cat":"uncategorized","id":"comment-34159","author":"Giorgio","site":"shroudstory"},{"title":"Because it Needed to be Said: Contaminated in the Weaver’s Workshop","post":"Last year, I did some researches concerning Nitowski and Kohlbeck’s analyses of samples of the Shroud taken by STURP.  When I did those researches, I took some notes and last evening, I read again those notes and found a probably better explanation than the one proposed by Paul Maloney concerning the claim made by Nitowski that she was able to find traces of aloes and myrrh in a Shroud sample.  Maloney believed that the material Nitowski took for traces of aloes and myrrh was in fact madder rose and gum Arabic that would have been used in the manufacture of the Shroud and would then be present everywhere on the cloth.  I’m glad I retrace my notes on the subject because it can truly help to set the record straight.  The other explanation comes from a paper written by Sue Benford and Joe Marino and presented at a Shroud conference in 2008 (in Columbus, Ohio). \nHere’s what the two authors wrote about the conclusion made by Nitowski: “An archaeologist, the late Dr. Eugenia Nitowski, who obtained numerous Shroud fibers from (Raymond) Rogers, conjectured that the red particle contaminates discovered by Kohlbeck were the burial spices Aloes and Myrrh. However, this assumption was based solely on her comparison of the debris with reference photos of the suspected substances and not via chemical analyses. She reported: “The study could go no further (beyond photo comparison), because of the inability to perform testing which would either remove or destroy materials from the tapes.” Along with the lack of any chemical characterization of the debris, the fact that the singular yarn (1FH) with the impurities came from the ventral missing-corner-exposed-medieval Holland cloth and not the main Shroud, argues strongly against Nitowski’s assumption that the debris was from burial spices. Based on the Quad-Mosaic data and Roger’s findings, it is far more plausible that the 1FH impurities were also red Madder and Gum Arabic as chemically-verified by Rogers in multiple adjacent samples.” \nNote that this red Madder and Gum Arabic have only been found by Rogers in the corner of the Shroud where the C14 samples have been taken in 1988 and allowed him to conclude that the results of this radiocarbon dating are certainly not accurate because this particular corner of the Shroud is not representative at all of the main body of the cloth in term of chemical composition. Note also that this 1FH sample of the exposed Holland backing cloth was collected by STURP in 1978 in a zone that is immediately adjacent to this C14 corner and it is highly probable that a portion of the alien substances found there by Rogers was able to moved over time and contaminated the whole area where this 1FH sample had been taken. Effectively, it is a well-established fact that the numerous folding and unfolding of the Shroud over the years have caused an important mechanical stress that has allowed the different particles present on the cloth to move away from their original locations. \nTo summarize the situation correctly, we can say that unless new direct chemical and/or spectroscopic tests on the Shroud can confirm the presence of aloes and myrrh and/or madder rose and gum Arabic elsewhere on the cloth, it’s much better to consider Nitowski’s claim that there is aloes and myrrh on the Shroud and Maloney’s claim that madder rose and gum Arabic were used in the fabrication of the cloth as scientifically unfounded. So, in the end, instead of seeing Nitowski’s claim has an indication that there can be aloes and myrrh on the cloth or that there can be madder rose, gum Arabic and an aluminium mordant everywhere on the Shroud, we can see instead her finding as another potentially good confirmation of Rogers’ findings concerning the anomalous C14 corner.  I also think that Paul Maloney’s conclusion that these substances were in fact used in the manufacture of the original Shroud is quite simply a pure extrapolation on his part, most probably done to contradict McCrone’s conclusion that the Shroud spend some times in an artist studio.  Truly, such a highly speculative conclusion cannot be backed-up scientifically since no other traces of the material discovered by Nitowski has been found in other Shroud samples taken from STURP in 1978 elsewhere on the cloth…  In fact, such an extrapolation on the part of Maloney remind me a great deal of what many Shroud experts have done years ago when they took the discovery done by textile expert Raes who found cotton in the sample he took from the same corner where the C14 sample was later taken and they extrapolate that finding to the whole cloth.  \nBased on the whole spectrum of data collected by the STURP team in 1978, it’s important to understand that these two very similar extrapolative conclusions concerning the cotton found by Raes and the other substances found by Nitowski near the C14 corner are most probably wrong and come from the same type of erroneous reasoning that we can summarize like this:  “Because some specific substances have been found in one tiny area of the Shroud, we can conclude that these substances are most probably present everywhere on the cloth”.  Such an extrapolative reasoning is not scientific at all and the two cases I just described are two very good examples of the great danger of making huge mistakes when you make this kind of extrapolation.  Note that this is also true for the C14 dating that was done in 1988, which only dated one tiny part of the whole cloth…\nHere’s the complete reference for the paper written by Benford and Marino: Sue Benford and Joseph G. Marino, Discrepancies in the Radiocarbon Dating Area of the Turin Shroud, Proceedings of the Columbus International Conference entitled “The Shroud of Turin – Perspectives on a Multifaceted Enigma”, Columbus, Ohio, August 14 – 17, 2008 (link: http://www.ohioshroudconference.com/papers/p09.pdf). And for more information about Rogers findings concerning the C14 area of the Shroud, see: Raymond N. Rogers, Studies on the Radiocarbon Sample From the Shroud of Turin, Thermochimica Acta, 425:1-2, 20 January 2005 (link: http://www.sciencedirect.com/science/article/pii/S0040603104004745). See also: Raymond N. Rogers, A Chemist’s Perspective on the Shroud of Turin, Barrie Schwortz Editor and Publisher, July 2008 (link: https://itunes.apple.com/us/book/a-chemists-perspective-on/id439942278?mt=11).\n\n","date":"May 21, 2013 at 8:31 am","url":"https://shroudstory.com/2013/05/18/because-it-needed-to-be-said-contaminated-in-the-weavers-workshop/","cat":"uncategorized","id":"comment-34197","author":"Yannick Clément","site":"shroudstory"},{"title":"Because it Needed to be Said: Contaminated in the Weaver’s Workshop","post":"What you stated is very plausible as well as Sue Benford’s hypothesis that the “blood” (Kohlbeck), “Iron Oxide” (McCrone) is actually the gum,dye,mordant coating. Iron Oxide is found everywhere until you add a few drops of Cargille oil and let it sit for three months. Keep in mind, Paul had to answer to the critics of Dr. Ray Rogers paper notably, Steven Schafersman. Steve is correct to point out that McCrone was the first to mention madder root.  Until we clarify each researcher’s interpretation of Dr. Ray Rogers sticky tape everything becomes speculative. Now for the most important question to my buddy up north, What the heck happened to the Islanders?\n\n","date":"May 21, 2013 at 9:39 am","url":"https://shroudstory.com/2013/05/18/because-it-needed-to-be-said-contaminated-in-the-weavers-workshop/","cat":"uncategorized","id":"comment-34206","author":"Giorgio","site":"shroudstory"},{"title":"Because it Needed to be Said: Contaminated in the Weaver’s Workshop","post":"My friend Giorgio, to answer your last question, I would say that it is still the “curse of 1993” that is against us!!!\nI think the Gods of Hockey have not accepted the fact that we eliminated the Great Mario and his gang in 1993 (with the OT goal of David Volek)…  Since that day, everything went wrong for my Islanders!!!  We have not been able to win one single playoff serie since that time and we also are still waiting to see the Isles win one game in overtime since the goal of Volek!\nIt’s totally incredible…  One thing’s for sure:  To be and remain a fan of the Islanders like me, you must have a very strong sense of fidelity (I would even say “a strong faith”)!  ;-)\n\n","date":"May 21, 2013 at 10:48 am","url":"https://shroudstory.com/2013/05/18/because-it-needed-to-be-said-contaminated-in-the-weavers-workshop/","cat":"uncategorized","id":"comment-34216","author":"Yannick Clément","site":"shroudstory"},{"title":"Because it Needed to be Said: Contaminated in the Weaver’s Workshop","post":"Paul Maloney does not believe that madder rose is found all over the cloth.  The fact that it was found on the 2 STURP tapes away from the Raes corner could be from a simple trace migration.  Paul and I will be having a discussion soon and I will post more as I get it.\n\n","date":"May 21, 2013 at 9:35 pm","url":"https://shroudstory.com/2013/05/18/because-it-needed-to-be-said-contaminated-in-the-weavers-workshop/","cat":"uncategorized","id":"comment-34262","author":"Joe Marino","site":"shroudstory"},{"title":"Because it Needed to be Said: Contaminated in the Weaver’s Workshop","post":"In this comment, I want to apologize to Paul Maloney for having completely misunderstood his comment about the potential presence of Madder rose, Gum Arabic and an aluminium mordant in two samples (if we believe McCrone’s conclusion) taken from the main body of the Shroud.\nYesterday evening, I watched again the entire presentation made by Maloney at the Columbus conference in 2008 and I can definitively say that he was truly a defender of the invisible repair hypothesis proposed by Benford and Marino and backed-up later on by Ray Rogers and John Brown.  In fact, Mr. Maloney’s critical view of McCrone’s conclusion that the Shroud must have been in an artist studio is nothing else than a supportin favor of Benford and Marino’s hypothesis.\nWhat Mr. Maloney said in reality is that it is truly possible that some particles of Madder rose, Gum Arabic and an aluminium mordant were scattered in other places of the Shroud (like in the two areas where McCrone discover them) and this could be due to a light contamination of these areas by a medieval reviewer.  It’s important to note that this could also have been caused by the numerous manipulations and the numerous folding and unfolding of the cloth over the centuries…  I’m surprise that Maloney did not talked about that possibility in his speech because, in my mind, this is the most probable one.\nBut in the end, what’s important to understand is the fact that Maloney’s point of view on this question is truly a critical review of McCrone’s conclusion that the Shroud has spend some time in a medieval artist studio and also a critical review of Nitowski’s conclusion concerning a possible presence of aloes and myrrh on the cloth than anything else, as well as a support in favor in favor of Benford and Marino’s hypothesis.  And when we consider the important fact that Ray Rogers himself never found traces of these substances elsewhere on the Shroud than in the C14 area, I have no difficulty to follow Maloney’s opinion…  \nThe only question that remains open is why Rogers never wrote about McCrone’s findings reported by Mr. Maloney when he published his own findings about the C14 threads he analyzed.  It’s a bit strange and Giorgio was right to bring that on the table.  But in the end, I think it’s fair to presume that if Rogers would have address that issue, his explanation would have been pretty much the same as the one proposed by Mr. Maloney, which is by far the most rational one in the light of the fact that McCrone have only reported having found these substances in only two samples over the whole batch collected by STURP all over the cloth.\n\n","date":"May 22, 2013 at 8:26 am","url":"https://shroudstory.com/2013/05/18/because-it-needed-to-be-said-contaminated-in-the-weavers-workshop/","cat":"uncategorized","id":"comment-34315","author":"Yannick Clément","site":"shroudstory"},{"title":"Because it Needed to be Said: Contaminated in the Weaver’s Workshop","post":"Correction for my previous comment:  McCrone only stated he found the presence of trace of Madder rose in two samples from the Shroud and not Gum Arabic and/or an aluminium mordant, which was only found by Rogers in the threads coming from the C14 corner.  Sometimes, I really write too fast!  Sorry…\n\n","date":"May 22, 2013 at 10:38 am","url":"https://shroudstory.com/2013/05/18/because-it-needed-to-be-said-contaminated-in-the-weavers-workshop/","cat":"uncategorized","id":"comment-34327","author":"Yannick Clément","site":"shroudstory"}]
