[{"title":"A Thread Dedicated to Vincenzo Giovanni Ruello’s Proposal","post":"This is it Dan, the foundation to the theory, I sink or swim on this. It involves the Shroud of Turin and the Vatican Veronica. The screen is tilted and the positive images appear in both cloths. This does not require even any scientific verification as it is self verifying, and there is no distortion. We can see the true face of Christ in the Shroud without reversal of left to right ,the Veronica because its small was photographed in close up once revealed and futher processed. Please show this to the prospective team as this is the foundation and evidence to the theory thanks. Please also understand I actually photographed the Veronica image and processed film revealing the same image on my website\nhttp://gloria.tv/?media=524164\n\n","date":"December 16, 2013 at 7:14 am","url":"https://shroudstory.com/2013/12/16/a-thread-dedicated-to-vincenzo-giovanni-ruellos-proposal/","cat":"news_&_views","id":"comment-60188","author":"Vincenzo Giovanni Ruello","site":"shroudstory"},{"title":"A Thread Dedicated to Vincenzo Giovanni Ruello’s Proposal","post":"What I have done in scientific terms is discover a form of infared filming where tilting the screen back filters out certain colours allowing us to see through the true images encoded in the Shroud and the Vatican Veronica. Infared cameras are programmed to filter or enhance colours allowing people to see in the dark or to examine paintings and the cosmos. This is a simple and effective form of infared filming, mechanical in nature.\n\n","date":"December 16, 2013 at 8:12 am","url":"https://shroudstory.com/2013/12/16/a-thread-dedicated-to-vincenzo-giovanni-ruellos-proposal/","cat":"news_&_views","id":"comment-60221","author":"Vincenzo Giovanni Ruello","site":"shroudstory"},{"title":"A Thread Dedicated to Vincenzo Giovanni Ruello’s Proposal","post":"In spite of his 27 years of experimental photography, Vincenzo seems unaware of the phenomenon of solarization, which looks to me to be the effect anybody at all can observe by tipping the screen of their laptop away from them. On my laptop (Macbook Pro), this only occurs if I hold the screen in ‘landscape’ format, and not when I hold it sideways in ‘portrait’ format. I suppose it is something to do with the way the liquid crystal display units are arranged. Although a solarization has many of the characteristics of a negative, it isn’t, nor is it anything to do with infra-red radiation, as suggested on Vicenzo’s website.\nAlmost nothing in Vincenzo’s article above is true. Angular Filming does not act as a negative/positive inverter, it does not enhance detail, nor allow for close up magnification. It is a very poor filter system. Angular filming does not work in segments, it depends entirely on the angle between the screen and the camera, although, as a camera is more precise than the human eye, you do need several positions to take photos of the whole screen. The Wikipedia image is not the best image of the Vatican Veronica on the internet. Try http://www.holyfacedevotion.com/images/VeronicaVeil.jpg.\nAs for the similarity between the faces of the Shroud and the Vatican veil, you don’t need to squint at a badly focussed solarisation of either to observe them. Just superimpose the two on a document. Hardly surprisingly, the eyes, nose and mouth can be fairly accurately superimposed on one another – but then that’s true of just about every other portrait on the planet. I do not see any other correlation, specifically no injury marks on the cheeks. The conclusion that the Veronica will authenticate the Shroud of Turin and vice versa is extremely far-fetched, in my opinion. \nSorry Vincenzo, I will not be joining the team that solved the mystery of the Shroud of Turin.\n\n","date":"December 16, 2013 at 10:04 am","url":"https://shroudstory.com/2013/12/16/a-thread-dedicated-to-vincenzo-giovanni-ruellos-proposal/","cat":"news_&_views","id":"comment-60283","author":"Hugh Farey","site":"shroudstory"},{"title":"A Thread Dedicated to Vincenzo Giovanni Ruello’s Proposal","post":"That link is not the Veronica from wikipedia it is a copy painted which I have processed also a fake. What is true regardless of my description whether or not it is a form or infared or solarisation is the fact the Shroud face  has appeared and the Veronica image has appeared also. I am the first to use this technique on both cloths. Thanks for watching, I am only after qualified scientists who believe in my work and discovery.\n\n","date":"December 16, 2013 at 10:43 am","url":"https://shroudstory.com/2013/12/16/a-thread-dedicated-to-vincenzo-giovanni-ruellos-proposal/","cat":"news_&_views","id":"comment-60299","author":"Vincenzo Giovanni Ruello","site":"shroudstory"},{"title":"A Thread Dedicated to Vincenzo Giovanni Ruello’s Proposal","post":"And ps you are incorrect in stating that AF does not work as a positive negative inverter because in the processing clip the Shroud face which is a HD photo is converted to a positive face image without reversal how can you dispute this ? Explain the face of Christ appearing in the angular tilt of the Shroud face. And I state once again that link you provided is a painting completely different frame and different image.\n\n","date":"December 16, 2013 at 10:50 am","url":"https://shroudstory.com/2013/12/16/a-thread-dedicated-to-vincenzo-giovanni-ruellos-proposal/","cat":"news_&_views","id":"comment-60303","author":"Vincenzo Giovanni Ruello","site":"shroudstory"},{"title":"A Thread Dedicated to Vincenzo Giovanni Ruello’s Proposal","post":"While I don’t believe photographing an optical effect on a monitor can achieve anywhere near the detail, precision, or repeatability of modern image processing software, I can agree the Vatican cloth should be photographed with modern imaging equipment.  There’s really no reason not do take some pictures.\nOne of the most valuable thing researchers can do right now is probably the development of detailed protocols for future study — not just of the Shroud, but any other cloth, any other relic as well.  It would be beneficial, for example, to have a specified set of imaging techniques and use the same exact (if given the opportunity) on the Shroud, the Sudarium, and the Vatican veil.  Likewise, protocols for chemical analysis, DNA testing, etc. should be developed and published in advance even of the request to study any of these relics. At the very least, it would define the sense of the research community of what should be done, by whom, under what conditions, etc.\nThis is probably redundant.  I’m new to this subject, so work along these lines may have already been done.  If so, please point me to it.  I know there’s a document detailing plans for a “STURP-II,” but I can only imagine many of the methods proposed are dated.  I guess what I’m proposing is a publicly available, possibly-crowd-sourced, “Torino Protocol” that is kept constantly up-to-date and ready to go should the pope ever give the “papal nod” authorizing new tests.\n\n","date":"December 16, 2013 at 11:19 am","url":"https://shroudstory.com/2013/12/16/a-thread-dedicated-to-vincenzo-giovanni-ruellos-proposal/","cat":"news_&_views","id":"comment-60310","author":"Jeff","site":"shroudstory"},{"title":"A Thread Dedicated to Vincenzo Giovanni Ruello’s Proposal","post":"The image you showed in the link is the Holy face of Vienna not the Vatican Veronica Veil Hugh Farey\n\n","date":"December 16, 2013 at 11:58 am","url":"https://shroudstory.com/2013/12/16/a-thread-dedicated-to-vincenzo-giovanni-ruellos-proposal/","cat":"news_&_views","id":"comment-60325","author":"Vincenzo Giovanni Ruello","site":"shroudstory"},{"title":"A Thread Dedicated to Vincenzo Giovanni Ruello’s Proposal","post":"Quite right; so it is. My apologies.\nTry http://holyfaceofmanoppello.blogspot.co.uk/2009_06_01_archive.html.\n\n","date":"December 16, 2013 at 12:25 pm","url":"https://shroudstory.com/2013/12/16/a-thread-dedicated-to-vincenzo-giovanni-ruellos-proposal/","cat":"news_&_views","id":"comment-60340","author":"Hugh Farey","site":"shroudstory"},{"title":"A Thread Dedicated to Vincenzo Giovanni Ruello’s Proposal","post":"I don’t think that link is it either. In fact, I don’t think there is a decent image of it.\n\n","date":"December 16, 2013 at 2:02 pm","url":"https://shroudstory.com/2013/12/16/a-thread-dedicated-to-vincenzo-giovanni-ruellos-proposal/","cat":"news_&_views","id":"comment-60395","author":"ChrisB","site":"shroudstory"},{"title":"A Thread Dedicated to Vincenzo Giovanni Ruello’s Proposal","post":"http://holyfaceofmanoppello.blogspot.co.uk/2009/06/sad-but-also-necessary-views-of-actual.html\n\n","date":"December 16, 2013 at 7:13 pm","url":"https://shroudstory.com/2013/12/16/a-thread-dedicated-to-vincenzo-giovanni-ruellos-proposal/","cat":"news_&_views","id":"comment-60558","author":"Raymond Frost","site":"shroudstory"},{"title":"A Thread Dedicated to Vincenzo Giovanni Ruello’s Proposal","post":"Hello Dan thankyou for this but have decided to bite the bullet and will now hire a freelance scientist to copy and verify my work and submit to journals. I do not need a team just one qualified person. Thankyou for your help anyway\n\n","date":"December 16, 2013 at 10:08 pm","url":"https://shroudstory.com/2013/12/16/a-thread-dedicated-to-vincenzo-giovanni-ruellos-proposal/","cat":"news_&_views","id":"comment-60637","author":"Vincenzo Giovanni Ruello","site":"shroudstory"},{"title":"A Thread Dedicated to Vincenzo Giovanni Ruello’s Proposal","post":"You are welcome. Good luck. Let us know when you get published.\n\n","date":"December 17, 2013 at 5:17 am","url":"https://shroudstory.com/2013/12/16/a-thread-dedicated-to-vincenzo-giovanni-ruellos-proposal/","cat":"news_&_views","id":"comment-60754","author":"Dan","site":"shroudstory"},{"title":"A Thread Dedicated to Vincenzo Giovanni Ruello’s Proposal","post":"Merry xmas and safe new year Dr Dan\n\n","date":"December 23, 2013 at 7:23 am","url":"https://shroudstory.com/2013/12/16/a-thread-dedicated-to-vincenzo-giovanni-ruellos-proposal/","cat":"news_&_views","id":"comment-65506","author":"Vincenzo Giovanni Ruello","site":"shroudstory"}]
