[{"title":"Last update this year to shroud.com","post":"Does anybody know if the Third Encounter of the two linens in Jerusalem that Barry mentions in his update-, now delayed to next February- is open to anyone? I have googled it but it seems to be quite a private meeting….\n\n","date":"November 21, 2012 at 9:06 am","url":"https://shroudstory.com/2012/11/21/last-update-this-year-to-shroud-com/","cat":"news_&_views","id":"comment-19296","author":"Gabriel","site":"shroudstory"},{"title":"Last update this year to shroud.com","post":"Now with the blessed coming of all the issues of Shroud Spectrum International on Barrie’s website, I will have the joy to read the paper published in it by Jackson concerning the ancient fold marks he supposedly found on the Shroud and judge for myself if he got some strong arguments or not… :-)  And this is just one example because there are many very interesting papers that were published in that journal over the years.\n\n","date":"November 21, 2012 at 9:43 am","url":"https://shroudstory.com/2012/11/21/last-update-this-year-to-shroud-com/","cat":"news_&_views","id":"comment-19298","author":"Yannick Clément","site":"shroudstory"},{"title":"Last update this year to shroud.com","post":"I have just seen the new and interesting images.\nIt will be interesting to see the UV photographies …\nWhere are ?\nAt present it seems that Barrie Schwortz was not able to obtain these simple and useful UV controls.\nIn any case, if in the next year we can see the other images, then I hope to read the inherent explanations …\nWhat is your opinion ?\n\n","date":"November 21, 2012 at 9:59 am","url":"https://shroudstory.com/2012/11/21/last-update-this-year-to-shroud-com/","cat":"news_&_views","id":"comment-19299","author":"Piero","site":"shroudstory"},{"title":"Last update this year to shroud.com","post":"Barrie Schwortz’s photos are very exciting. However it would be interesting to know which side of each fragment was the image side, and which the non-image. One side seems remarkably flat, and the other has very raised warp (or weft) threads. The two samples have been photographed with a different side first. It would also be interesting to know exactly whereabouts on each original sample each bit came from. Maybe someone can work it out?\n\n","date":"November 21, 2012 at 10:52 am","url":"https://shroudstory.com/2012/11/21/last-update-this-year-to-shroud-com/","cat":"news_&_views","id":"comment-19304","author":"Hugh Farey","site":"shroudstory"},{"title":"Last update this year to shroud.com","post":"Hugh, the image side is indicated by Schwortz in the captions as “Side 1” (Top in Fig. 1, Bottom in Fig. 2). The warp threads are in evidence on Side 1 and they run vertically in Fig. 1, horizontally in Fig. 2. As far as I can tell by comparing with a photo of the whole piece of cloth that was removed, this subsample comes from the top part of the (larger fragment of the) original sample. I mean “top” with reference to the standard manner of showing the Shroud, with the C14 corner on top left. The subsample is the same that had already been photographed and published by Jull (and Rachel Freer-Waters) in 2010. It is a pity that Schwortz could not take a photo of the other subsample that should be still extant in Tucson. Such a photo might confirm that the other subsample is the smaller of the two fragments of the original sample. Hopefully, a photo of the other subsample will be soon made available. If Schwortz cannot travel to Tucson again, the photo can be taken by Jull himself or by the staff in Tucson.\n\n","date":"November 22, 2012 at 9:08 am","url":"https://shroudstory.com/2012/11/21/last-update-this-year-to-shroud-com/","cat":"news_&_views","id":"comment-19357","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Last update this year to shroud.com","post":"This is fascinating. At fairly high magnification, it looks to me (I hope this isn’t a ‘think I see’) that the ribbed, image side seems very uniformly coloured (just what one would expect if there’s no image there), but the other, flat, non-image side seems to show distinct variation in the depth of colour even along individual fibres, particularly on the raised bits. Does anybody else think this?\n\n","date":"November 22, 2012 at 5:22 pm","url":"https://shroudstory.com/2012/11/21/last-update-this-year-to-shroud-com/","cat":"news_&_views","id":"comment-19379","author":"Hugh Farey","site":"shroudstory"}]
