[{"title":"Late Breaking Website News!","post":"It’s unfortunate that bad science gets most of the press.\n\n","date":"December 6, 2009 at 9:51 am","url":"https://shroudstory.com/2009/11/23/late-breaking-website-news/","cat":"2010","id":"comment-876","author":"Mark","site":"shroudstory"},{"title":"Late Breaking Website News!","post":"It tells us in the Bible that the” Linen cloths” were lying by themselves two things here prove the shroud of Turin not to be that which Jesus was wrapped in, the first being there were two cloths and the second that the cloths were made of linen, these facts can be found in Luke 24:12\nand John 20:5-7\n\n","date":"December 30, 2009 at 7:25 pm","url":"https://shroudstory.com/2009/11/23/late-breaking-website-news/","cat":"2010","id":"comment-905","author":"mary farr","site":"shroudstory"},{"title":"Late Breaking Website News!","post":"Mary, there were two cloths: the shroud and the sudarium. The Shroud of Turin is almost certainly that shroud. The Shroud of Turin IS IN FACT linen. The other cloth may very well be the Sudarium of Oviedo. It is also linen but a different weave. There is no contradiction between the Bible and the Shroud of Turin.\n\n","date":"December 31, 2009 at 7:59 am","url":"https://shroudstory.com/2009/11/23/late-breaking-website-news/","cat":"2010","id":"comment-906","author":"Episcopalian","site":"shroudstory"},{"title":"Late Breaking Website News!","post":"Found your blog on Ask and was so glad i did. That was a warming read. I have a small question.Is it OK if i send you an email???…\n\n","date":"January 29, 2010 at 12:26 am","url":"https://shroudstory.com/2009/11/23/late-breaking-website-news/","cat":"2010","id":"comment-967","author":"Janet","site":"shroudstory"},{"title":"Late Breaking Website News!","post":"In Matthew Mark and Luke there is no mention of burial clothes at the discovery of the empty tomb.\nIn John it is noted that that the face cloth was folded and strips of fabric lay on the ground.\nThe Shroud  itself therefore is absent from all four gospels. The only logical conclusion is that it remained with the body after it was removed from the tomb of Joseph of Aramathea and placed elsewhere.\nThe very existence of the shroud presents a problem for the ressurrection theory.\nHad it been there the empty Shroud with the first ever photograhic negative imprinted on it would have been much more complelling evidence of ressurrection than an empty tomb.\n\n","date":"April 24, 2010 at 2:10 pm","url":"https://shroudstory.com/2009/11/23/late-breaking-website-news/","cat":"2010","id":"comment-1269","author":"Philip Simmons","site":"shroudstory"},{"title":"Late Breaking Website News!","post":"The empty tomb is what the entire foundation of Christianity is based on.  He was crucified, died, and on the third day HE ROSE AGAIN.\nWithout an empty tomb, he was just another prophet.  Jesus Christ is the one and only human being to have lived, died, and risen from the dead.  According to the book of Acts and many other historical manuscripts more than 500 people witnessed Jesus in the flesh after his resurection.  People ate with him, drank with him.  This is why Easter is actually the MOST important holiday in the Christian faith..\nWhether or not the shroud is authentic (which I am inclined to believe it is) nothing is more powerful or proof positive of Jesus being the Son of God than the EMPTY TOMB.\n\n","date":"June 2, 2010 at 3:33 pm","url":"https://shroudstory.com/2009/11/23/late-breaking-website-news/","cat":"2010","id":"comment-1303","author":"Amy P","site":"shroudstory"},{"title":"Late Breaking Website News!","post":"I am a dedicated catholic, I feel impelled to give my testimony because one needs to witness to the truth where and when necessary. In 1981 I was very privileged to have had a vision of our lord Jesus Christ in a historic church that was dedicated to St.Peter and St.Paul, I saw our Lords face, so sad.And the crown of thorns on his head so clear was this vision i could see the string of thorns encircled many times and the thorns so clear as if one would be pricked by them, I was totally awestruck and as you can imagine this vision took me from being a christian with many question marks to a fervent believer, after the vision i went to my mothers home when i went in to her living room i told my mother of my wonderful vision and was overwhelmed to discover that my mother had a copy of the shroud of Turin on her wall.I immediately said to my mother, this is Jesus Christ, this is who i saw actually as he is. It is him. The holy shroud image is that of Jesus Christ, I can’t prove it but i would lay my life on this because it is true. I have since 1981 had many other experiences which have also confirmed to me the authenticity of the holy shroud and that it is of our Lord Jesus Christ. One day it will be recognised as true and venerated as the wonderful relic that it is, and i look forward to that day. Yours in Christ … Fred\n\n","date":"June 5, 2010 at 8:28 pm","url":"https://shroudstory.com/2009/11/23/late-breaking-website-news/","cat":"2010","id":"comment-1337","author":"Fred","site":"shroudstory"},{"title":"Late Breaking Website News!","post":"I am a devout christian. In 1995 I came across the Shroud of Turin with a friend.  I took the picture (it was just a photocoy of the shroud) to a Photo studio and asked him to photograph the shroud.  When developed I got a real photo of Jesus face clear and eyes open looking at me with eyes of love and sadness.  I was shocked by the picture.  I know exactly what Jesus looked like when he was alive because I have his photograph.  I treasure this picture and I look at it lovingly because this is a miracle for me.  I would like those people who doubt and also those who try to prove the authenticity of the holy shroud that it is real and not a fake.  I know this with all my heart because of the miracle.  I would like to get in touch with them but I don’t know how.  Yours in Christ – Luiza\n\n","date":"October 6, 2010 at 11:45 am","url":"https://shroudstory.com/2009/11/23/late-breaking-website-news/","cat":"2010","id":"comment-1493","author":"Luiza","site":"shroudstory"},{"title":"Late Breaking Website News!","post":"Fred Ablitt, in my oppinion ,there is no doubt that the shroud of turin is the same shroud that Joseph of Arimathea wrapped the body of Jesus as in the gospel of Mark chapter 15 verses 42…46. Pope Benedict xv1 recently in Turin stated himself that the holy shroud of turin is like a photograph,positive and negative, he also said it is a burial cloth which enshrouded the corpse of a crusified man, and corresponds to what the gospels tell us about Jesus. I personaly believe that there is a whole stack of evidence to back up the holy shroud of turins true authentisity , but the real problem is that one still needs to look at the whole situation with the eyes of faith ,through an open mind,which is where most non believers stumble because they then have to accept that the God they dont believe in might actualy exist, which totaly contradicts there views, and puts there non beliefe to the test. In my view the real problem is that when true authentisity is being debated with those who dont believe in the existance of God, they inevitably wont take into consideration anything that might oppose there views, so in reality there is a stalemate, they then base there whole analysis on desisions they have made according to there own human ability to judge which is prone to error, using no more than tests to detemine age, carbon dating which has been proven unreliable, in the tests that have been carried out on the holy shroud of turin, so i ask those scientists lets look at this with an open mind, with a full compleate and unbiased analysis of all the evidence without exeption, then a true and fare conclusion can start to take place, if only for the sake of common sence…YOURS IN CHRIST…FRED…\n\n","date":"June 5, 2010 at 8:29 pm","url":"https://shroudstory.com/2009/11/23/late-breaking-website-news/","cat":"2010","id":"comment-1338","author":"Fred","site":"shroudstory"},{"title":"Late Breaking Website News!","post":"Doing research on the Shroud for a UCLA project.  Please, conmtact me through Facebook.  Thank you — Migdia Chinea\n\n","date":"November 13, 2010 at 1:14 pm","url":"https://shroudstory.com/2009/11/23/late-breaking-website-news/","cat":"2010","id":"comment-1686","author":"Migdia Chinea","site":"shroudstory"},{"title":"Late Breaking Website News!","post":"I admit I dont know what to believe. I saw a history channel show about the shroud and the team doing the 3-D image of who they claim to be Jesus. I was looking at the pictures on the internet to see the location of the blood stains. I was sent to a christian school, college, etc. and have had some limited medical training. I have for years thought “christians” were so stupid. I always thought everyone thought it was possible for a human body to be nailed to a cross through the palms of the hands. This would never work because the weight of the person would tear the nail or spike through the hand, there is not enough tissue to support the his weight. What I see in the shroud is that the spikes were more likely put through the wrist where the weight of the body could be supported by Radius and Ulnar and kept attached by the ligaments and tendons in the wrist and hand. All the pictures ie: the crucifix at the catholic churches always show the nails in the palms. My wife is catholic and I admit I always get a good laugh when I am forced to attend something at her church. Anyway, I see that the location of the blood stain is close to the wrist so if it were real I think this would be a correct placement, not the palm.  Just my opinion.\n\n","date":"January 25, 2011 at 8:13 pm","url":"https://shroudstory.com/2009/11/23/late-breaking-website-news/","cat":"2010","id":"comment-2287","author":"Brandon","site":"shroudstory"},{"title":"Late Breaking Website News!","post":"This is to Brandon.\nChristians are not stupid, although some may not be as intelligent as others. We believe in Jesus Christ. NOTHING in the Holy Bible can be proven wrong. Yes, typically it is shown in paintings, on crosses that hang in churches, etc that the hands of Jesus are nailed. Don’t you think that when the people were actually crucifying other people they would notice that it would rip through the hands of those crucified! Duh!!! I mean it does not take a medical student to figure that out. Just look at the people that was doing the crucifying, they were idiots and they figured it out! They crucified OUR LORD and Savior. The Shroud of Turin is not fake, it is real. Is it so hard for you to read the Bible and open your heart and mind to accept Christ? One day you and all the other non-Christians will really regret not doing so. I’ll pray for you. GOD bless!!!\n\n","date":"February 2, 2011 at 6:31 am","url":"https://shroudstory.com/2009/11/23/late-breaking-website-news/","cat":"2010","id":"comment-2330","author":"Sherry","site":"shroudstory"},{"title":"Late Breaking Website News!","post":"Barry wrote: \n“To make matters worse, Marion and Courage based all of their imaging work solely on the 1931 Giuseppe Enrie photographs.” Totally wrong, the true fact is they based their work on BOTH 1931 Enrie’s and 1978 Miller’s Sindon face photograph.\nHe also wrote: \n“As for the Marion and Courage inscriptions themselves, these were carefully evaluated from a linguistic point of view in 1999 by Shroud scholar and language expert, Mark Guscin”. The very fact both late Pr. Marion & Ms. Courage have misread several ghost inscriptions/writings does not mean there is no ghost inscriptions/writings on and around the Sindon face at all. \nContrary to Italian palaeographer, Pr. Marastoni who did identify a few Latin and Greek inscriptions/writings around and on the Sindon face and French optic ingeneer, late Pr. Marion who did confirm the presence of such inscriptions on the linen cloth, Guscin is neither a palaeographer nor a papyrologist or an epigraphist or an optic ingeneer. As a mere linguist, Guscin’s opinion on THE PRESENCE OR THE ABSENCE of ghost plaeographic inscriptions/writings on the linen cloth is, first and foremost,  that of a non qualified expert in both optic ingeneering and palaeography and should be taken as such.\n\n","date":"December 6, 2012 at 10:39 pm","url":"https://shroudstory.com/2009/11/23/late-breaking-website-news/","cat":"2010","id":"comment-19951","author":"Max Patrick Hamon","site":"shroudstory"}]
