[{"title":"Leonardo da Vinci Forged the Shroud of Turin?","post":"Have you noticed recently how some people are determined to make a case that there are “Christian” terrorists and “Christian” terrorist cells? Which is completely absurd of course and I’m sure the people who are pushing the idea KNOW it’s absurd, but I think they like to provoke response. And I think they like to plant slanderous ideas and hope they stick. \nThis relentless badgering also seems to be a form of brainwashing, hoping to train the minds of the public to eventually embrace stupid ideas as truth. \nThe relentless attacks against the Shroud seem to be very similar. Doesn’t matter if it makes sense. Doesn’t matter if the facts have been verified. They’re not looking for truth or else they would be willing to engage in intelligent, honest conversation. IMO they just want to discredit the Shroud for the sake of discrediting the Shroud — and it has nothing to do with a Quest for Truth.\n\n","date":"July 29, 2011 at 6:17 am","url":"https://shroudstory.com/2011/07/29/leonardo-da-vinci-forged-the-shroud-of-turin/","cat":"news_&_views","id":"comment-3466","author":"AnnieCee","site":"shroudstory"},{"title":"Leonardo da Vinci Forged the Shroud of Turin?","post":"I’ve read this charge so many times, (that Leonardo created the Shroud) and it is totally rediculous.No one ever mentions the fact that he kept a log of everything he did, every penny he spent etc; etc; So why no mention of the Shroud in his papers? He also was very impatient, hence why so many of his works never got finished.So I cannot see him taking the time to produce such a work as the Shroud (If possible).Don’t get  me wrong he was a man ahead of his time, a great artist and thinker but if I was to choose someone to reproduce the Shroud, I would have picked Michelangelo.Plus there is the hard fact the shroud material itself comes from atleast 700 years before Da Vinci’s time! (If you go by the findings of R.Rogers and the lack of Lignin in the fibrels).So what? he just happen to find a 700 year old sheet which he had only one chance to get the image on there right? …yeah okay!\nAnnieCee’s final remark above, I believe is right on the mark and personally I find it very frustrating that that is the way things seems to be.On topics like this, with religious implications, people seem not to want to think for themselfs and jump on any theory proposed that refutes the Shroud.Maybe it’s that they don’t want to believe the Shroud may be authentic, because that would force them re-evaluate the lives they lead.\nthanks for listening,\nRon\n\n","date":"July 29, 2011 at 7:54 am","url":"https://shroudstory.com/2011/07/29/leonardo-da-vinci-forged-the-shroud-of-turin/","cat":"news_&_views","id":"comment-3468","author":"Ron","site":"shroudstory"},{"title":"Leonardo da Vinci Forged the Shroud of Turin?","post":"Anyone who read carefully the conclusions and observations from STURP and the later works done by STURP members like Ray Rogers, Alan Adler and other know that the chances that the Shroud is a forgery are so thin it would need a bigger miracle to explain it than the resurrection !  With all the scientific knowledge we possess now about the Shroud of Turin, one thing’s for sure :  it can’t be the work of Leonardo or any other artist from any period of time.  PERIOD.  Forget Leonardo, he’s out of the game !\nWe’re left with two possibilities :  The image is due to some very complex and natural process (possibly a complex chemical process) or the image is due to a supernatural process and, if it is the case (from all I know about the Shroud, I don’t think so), it would go beyond the spectrum of science…\nOne important thing to remember :  even if we’re sure that the image on the Shroud is not a forgery, if we want to stay scientifically credible, we have to say that it doesn’t necessarily mean it is the authentic burial Shroud of Jesus-Christ.  On the other hand, many evidences and facts point in this direction…\n\n","date":"July 29, 2011 at 10:41 am","url":"https://shroudstory.com/2011/07/29/leonardo-da-vinci-forged-the-shroud-of-turin/","cat":"news_&_views","id":"comment-3471","author":"Yannick Clément","site":"shroudstory"},{"title":"Leonardo da Vinci Forged the Shroud of Turin?","post":"Quite apart from all the other consideration, check this out from Da Vinci’s notebooks:\n“To lie is so vile, that even if were speaking well of Godly things, it would take off something from God’s grace; and truth is so excellent, that if it praises but small things they become noble.” (Moral Sayings)\nI find it very hard to believe that a man with such disgust for lies would perpetrate a fraud of such magnitude as the Shroud of Turin.\n\n","date":"July 30, 2011 at 1:14 pm","url":"https://shroudstory.com/2011/07/29/leonardo-da-vinci-forged-the-shroud-of-turin/","cat":"news_&_views","id":"comment-3489","author":"Tim","site":"shroudstory"},{"title":"Leonardo da Vinci Forged the Shroud of Turin?","post":"And if he ever done something like this, you can bet your house that the false relic would have been kept in a cathedral or an important pilgrimage place in Italy (or even at the Vatican !), and not an obscure little town somewhere in France !!!\n\n","date":"July 30, 2011 at 4:05 pm","url":"https://shroudstory.com/2011/07/29/leonardo-da-vinci-forged-the-shroud-of-turin/","cat":"news_&_views","id":"comment-3490","author":"Yannick Clément","site":"shroudstory"},{"title":"Leonardo da Vinci Forged the Shroud of Turin?","post":"What I think is hilarious is: it’s Leonardo da Vinci. AGAIN. And AGAIN. And again….  I wonder if that old artist is laughing in his grave. How many conspiracies and weird things has he been associated with anyway?  Historically I don’t think there’s any real evidence he ever did anything other than paint pictures and yet he’s typecast as some kind of magic man. \nReminds me of the Isuzu commercial guy who had a hard time getting work as a serious artist because all anybody could see, after that, was the crazy Isuzu guy.  If DaVinci was here today, I think he’d be sick of all the silly rumors because I doubt all the theories have anything to do with the real DaVinci. \nThey lost credibility with ME as soon as they used his name. What a joke.\n\n","date":"July 30, 2011 at 6:44 pm","url":"https://shroudstory.com/2011/07/29/leonardo-da-vinci-forged-the-shroud-of-turin/","cat":"news_&_views","id":"comment-3493","author":"AnnieCee","site":"shroudstory"},{"title":"Leonardo da Vinci Forged the Shroud of Turin?","post":"It’s the same thing with all the Mary Magdalen stories !  She must laugh in his grave even harder than Da Vinci !!! :-)\n\n","date":"July 31, 2011 at 8:03 pm","url":"https://shroudstory.com/2011/07/29/leonardo-da-vinci-forged-the-shroud-of-turin/","cat":"news_&_views","id":"comment-3503","author":"Yannick Clément","site":"shroudstory"},{"title":"Leonardo da Vinci Forged the Shroud of Turin?","post":"Leonardo da Vinci was illumanti, he forged the Turin cloth for the Catholic church so they could continue to treat Christs followers as idiots.   I saw a documentary where the photographic techniques he used were duplicated, he used the body from the morgue (he quite often used to get bodies for dissecting).  He used his own face – this has been proved because the spaces between eyes, nose etc  & other features of the face are like finger prints & can’t be forged.  Now that these facts have been discovered the Catholic church has locked the Turin cloth away & won’t let anyone exam it.  The implications of this is that every image you see of Jesus Christ in statues & paintings all over the world in religious institutions & churches are actually images of Leonardo da Vinci.  So people are using his image in their prayers etc.  Satanists like to make Christians untruthful even if they are not aware of it – it gives them energy.  The Last Supper is also a da Vinci picture which they are now analyzing & saying that there are clues in it to say that Jesus & Mary Magdalene had a child.  They are trying to make the da Vinci code bullshit a reality.  This is a set up to declare that the antichrist (Prince William) is actually a descendant of Jesus!  The Mona Lisa is also a self portrait of Da Vinci – now you know why she has that smirk on her face, Da Vinci must have thought he was so smart.    The Catholic church has been planning this for hundreds of years.  I have a saying for satanists “If they can’t beat it they take it over” & this is exactly what happened with the Catholic church.  Read how the Catholic church was 1st formed in Rome & don’t believe any of there bullshit.\n\n","date":"October 8, 2011 at 6:20 pm","url":"https://shroudstory.com/2011/07/29/leonardo-da-vinci-forged-the-shroud-of-turin/","cat":"news_&_views","id":"comment-4146","author":"Jo","site":"shroudstory"}]
