[{"title":"Lest the wrath of God descend upon them like a ton of bricks","post":"Emiliani renowned for his work on marine sediments, follows in the footsteps of the pioneer geologist Blessed Nicolaus Steno 1638 – 1686, beatified by Pope John Paul II on 23 October 1992, ironically on the anniversary of the date of the world’s creation according to Archbishop James Ussher.  I wonder if Emiliani’s condemnation of those who mix science and religion extends to the Papal Academy of Sciences?!\n\n","date":"September 21, 2014 at 6:54 am","url":"https://shroudstory.com/2014/09/21/lest-the-wrath-of-god-descend-upon-them-like-a-ton-of-bricks/","cat":"humor","id":"comment-153125","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Lest the wrath of God descend upon them like a ton of bricks","post":"You know the problem of the C14 dating is more basic and has much to do with bad sampling and arrogance. You know the problem of Colin has much to do with promoting scorching on a bogus basis and arrogance.\nThe Vatican supports science, evolution, astronomy and whatever makes sense.\n\n","date":"September 21, 2014 at 7:19 am","url":"https://shroudstory.com/2014/09/21/lest-the-wrath-of-god-descend-upon-them-like-a-ton-of-bricks/","cat":"humor","id":"comment-153133","author":"anoxie","site":"shroudstory"},{"title":"Lest the wrath of God descend upon them like a ton of bricks","post":"Contact scorching is a feasible model with a sound scientific basis. But then I would not expect troll anoxie to know much about the role and rationale of scientific models and their testing. Fanatical belief and personal vituperation are more her tasse de thé. \n\n","date":"September 21, 2014 at 7:32 am","url":"https://shroudstory.com/2014/09/21/lest-the-wrath-of-god-descend-upon-them-like-a-ton-of-bricks/","cat":"humor","id":"comment-153140","author":"Colin Berry","site":"shroudstory"},{"title":"Lest the wrath of God descend upon them like a ton of bricks","post":"I agree with Colin, there is nothing antithetical about his work.  He should try to disprove it as authentic and should also be ready for the level of scrutiny given to those attempting to prove the opposite.  \nSince the fact there is no conflict between science and religion, I do not comprehend Emiliani’s comment.\n\n","date":"September 21, 2014 at 9:39 am","url":"https://shroudstory.com/2014/09/21/lest-the-wrath-of-god-descend-upon-them-like-a-ton-of-bricks/","cat":"humor","id":"comment-153197","author":"Andy","site":"shroudstory"},{"title":"Lest the wrath of God descend upon them like a ton of bricks","post":"Thank you Andy for that fair-minded comment. Notwithstanding the charge from the site’s host of inconsistency, I reserve the right to return to a site that I’ve otherwise abandoned if the alternative is to leave character attacks unanswered. In this instance it’s the absurd attempt to turn the promotion or defence of an idea into some kind of character slur or defect which I simply can’t allow to go unanswered. \nHere’s a comment I’ve just placed on my own site that sets out my current position re the likely provenance of the TS after many months of reading and research:\nIt is unhelpful and unconstructive to judge the TS as a choice between authentic or non-authentic. It’s like deciding whether a stuffed swan one is about to see in a natural history museum is black or white – it could be either.\nThe rational and constructive way of viewing it is to ask whether the TS is a contact or non-contact scorch.\nIf it’s a contact scorch, then it’s fairly certain the image is man-made, using a heated template to imprint the image (which will of course be a negative, explaining what might otherwise seem peculiar at least from an artistic standpoint, being much more photogenic centuries later when Secondo Pia-era photography and light/dark reversal became practicable).\nIf it’s a non-contact scorch, then all options are open, pro-authenticity ones included, radiocarbon dating notwithstanding.\nBut while there are groups who promote their own preferred non-contact scenarios (laser beams, corona discharges, sugar-seeking putrefaction vapours, earthquake-releases of radioactive emissions etc) few if any of them are willing to generalize and say it’s a non-contact process that is being proposed, and that the image characteristics are consistent with, and can be modelled in the laboratory as a non-contact process with a qualitatively-different outcome from the simple, uncomplicated man-made contact one I favour.\nIn short, we see systematic evasion of the scientific essentials, the latter based on model-testing and evaluation. Not a pretty sight.\nSome folk’s thinking might be described as pre-Renaissance. Indeed, there may well be a hankering for pre-Renaissance certainties, when everyone, the unwashed, uneducated classes especially, knew their place and did not dare to question their social and intellectual superiors.\n\n","date":"September 21, 2014 at 3:56 pm","url":"https://shroudstory.com/2014/09/21/lest-the-wrath-of-god-descend-upon-them-like-a-ton-of-bricks/","cat":"humor","id":"comment-153284","author":"Colin Berry","site":"shroudstory"},{"title":"Lest the wrath of God descend upon them like a ton of bricks","post":"Hi Colin,\n               Is “contact scorch” the same thing as ” bas-relief ” ?\n               All the best\n\n","date":"September 22, 2014 at 12:35 am","url":"https://shroudstory.com/2014/09/21/lest-the-wrath-of-god-descend-upon-them-like-a-ton-of-bricks/","cat":"humor","id":"comment-153401","author":"PHPL","site":"shroudstory"},{"title":"Lest the wrath of God descend upon them like a ton of bricks","post":"Good morning PHPL (British Summer Time).\nI use “contact scorch” to indicate there is no imaging except where template is in direct physical atom-to-atom contact with hot metal, ceramic, whatever. If there’s the slightest air gap, then there’s essentially no scorching, though a slight yellowing might just be possible from hot convected gases.\nThere are those who maintain that the TS image includes parts of the subject that could not have been in contact with linen. They have yet to convince this sceptic. All the important parts, i.e. raised relief,  could or would be accessible, especially if linen were draped over template (whether bas relief or fully 3D) and then manually and forcibly impressed in and around important contours. The places most likely to get ‘missed’ are precisely those that appear as pale poorly or non-imaged  areas on the TS (eye sockets, around the crossed hands, the gaps or even curvature between fingers etc.).\nI use bas relief to imply something like the head on a coin with a little raised relief but much less in relative terms than the real live or dead subject, or a fully 3D representation of the latter (statue, bust etc). The wiki definition is OK seems OK for starters:\n“Bas-relief is a type of sculpture that has less depth to the faces and figures than they actually have, when measured proportionately (to scale). This technique retains the natural contours of the figures, and allows the work to be viewed from many angles without distortion of the figures themselves.”\nI believe the face (at least) of the TS image was imprinted from a bas relief (as incidentally did Prof Luigi Garlaschelli). The sharpish break in image continuity between cheek and hair on both sides is the give-away, suggesting there to have been a groove or trough in the template such that no imaging was possible in that gap. The idea that the break is just a banding effect in the linen, that the ‘missing’ image is retrievable with the right ‘enhancement’ with computer software etc, simply does not stand up to close critical scrutiny. That knob-twiddling-solves-all view is an example of what is known technically in boring old mainstream science as “pure tosh”.\n\n","date":"September 22, 2014 at 1:40 am","url":"https://shroudstory.com/2014/09/21/lest-the-wrath-of-god-descend-upon-them-like-a-ton-of-bricks/","cat":"humor","id":"comment-153426","author":"Colin Berry","site":"shroudstory"},{"title":"Lest the wrath of God descend upon them like a ton of bricks","post":"Thanks for this excellent reply Colin. I am very grateful.\nAll the best\nPatrick\n\n","date":"September 22, 2014 at 4:07 am","url":"https://shroudstory.com/2014/09/21/lest-the-wrath-of-god-descend-upon-them-like-a-ton-of-bricks/","cat":"humor","id":"comment-153467","author":"PHPL","site":"shroudstory"},{"title":"Lest the wrath of God descend upon them like a ton of bricks","post":"You’re welcome Colin.  I do disagree with you about ‘contact scorch’.  I do not find any evidence on the Shroud to support the statement.  You are, of course, entitled to your statement.  I am merely pointing out I do not accept that term as indicative of how the image got on the Shroud.  I cannot prove any alternate perhaps to your satisfaction, but no one has given me any evidence to even consider it.\n\n","date":"September 27, 2014 at 3:27 pm","url":"https://shroudstory.com/2014/09/21/lest-the-wrath-of-god-descend-upon-them-like-a-ton-of-bricks/","cat":"humor","id":"comment-157271","author":"Andy","site":"shroudstory"},{"title":"Lest the wrath of God descend upon them like a ton of bricks","post":"Andy: “Since the fact there is no conflict between science and religion, I do not comprehend Emiliani’s comment.” \nIt’s apparent that the Emiliani comment was tongue in cheek irony.  As a front-runner in geological research, with many now accepted new theories to his credit, Emiliani would see the theories of biblical literalist Creationists as a particular target for his ire, and an easy one for spoofing.  \nDespite a Google search, I was unable to discover very much about his personal views on religion or philosophy, other than his principal interest being geological research,  He has attempted a reform of the calendar, based on the absence of a year zero in the normal BC/AD calendar.\n\n","date":"September 21, 2014 at 5:09 pm","url":"https://shroudstory.com/2014/09/21/lest-the-wrath-of-god-descend-upon-them-like-a-ton-of-bricks/","cat":"humor","id":"comment-153299","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Lest the wrath of God descend upon them like a ton of bricks","post":"Thanks Dave.  I can only take his comment at face value since I do not know him (I presume it is he?).\n\n","date":"September 27, 2014 at 3:32 pm","url":"https://shroudstory.com/2014/09/21/lest-the-wrath-of-god-descend-upon-them-like-a-ton-of-bricks/","cat":"humor","id":"comment-157273","author":"Andy","site":"shroudstory"},{"title":"Lest the wrath of God descend upon them like a ton of bricks","post":"Andy: “He should try to disprove it as authentic and should also be ready for the level of scrutiny given to those attempting to prove the opposite.”\nPre Judging is a common mistake of a human being. Why can’t we take a neutral stand until some one prove it or disaprove it. So far no one has come to a conclusion without ant doubt.\nAccording to my stand Science is the only tool which we can use to prove the Authenticity of TS.\n\n","date":"September 21, 2014 at 6:46 pm","url":"https://shroudstory.com/2014/09/21/lest-the-wrath-of-god-descend-upon-them-like-a-ton-of-bricks/","cat":"humor","id":"comment-153318","author":"Sampath Fernando","site":"shroudstory"},{"title":"Lest the wrath of God descend upon them like a ton of bricks","post":"Sampath ~ This is usual in Shroud studies to be critically evaluated.  Do you consider this bad?  I consider it good.  I am referring to critical studies & evaluation to ideas, not critical personal remarks.\n\n","date":"September 27, 2014 at 3:31 pm","url":"https://shroudstory.com/2014/09/21/lest-the-wrath-of-god-descend-upon-them-like-a-ton-of-bricks/","cat":"humor","id":"comment-157272","author":"Andy","site":"shroudstory"},{"title":"Lest the wrath of God descend upon them like a ton of bricks","post":"SF:  “According to my stand Science is the only tool which we can use to prove the Authenticity of TS.” \nThe problem with this approach is that there is no scientific test known which can infallibly identify the purported subject of the image, Jesus of Nazareth.  Only circumstantial evidence is available, such as the correspondence with the wounds of the subject with those of the gospel texts.  One would need to take the position that persuasive circumstantial evidence needs to suffice, otherwise perpetual skepticism must needs remain.  Also it depends on what is mean by Science.  Would it for example include historical evidence, would it include the correspondence with early portraits or icons which showed Shroud-like features, would it include proof that the flax used for the linen had a Middle East provenance, would it suffice to demonstrate that the linen dated from no later than the first century, and so on. \nThere is evidence which claims that the dirt on the feet, nose and elbow of the image corresponds to the travertine aragonite limestone particular to Jerusalem.  Does one accept this evidence, or claim that no formal scientific peer-reviewed paper has ever been submitted to and accepted by the scientific community?  Nevertheless there are reputable and qualified investigators who make this claim. \nMost of our life-decisions do not demand an infallible level of proof, and life would become intolerable if we attempted to do so.  We are normally satisfied with a reasonable level of probability, and people are imprisoned or are liberated in our justice courts every day on this basis.  The problem of the distinction between faith and knowledge is also related to this question.  A reasonable faith also demands a reasonable level of rationality.  \nMothers always know with complete certainty which of the family’s children are theirs and those which are not.  However only a few fathers demand paternity tests to determine who sired their children, and the majority of us are content to accept a reasonable level of confidence on this issue.  But a pedant would say that this was not knowledge!  What level of certainty does one set to accept the authenticity of the Shroud?\n\n","date":"September 22, 2014 at 5:06 am","url":"https://shroudstory.com/2014/09/21/lest-the-wrath-of-god-descend-upon-them-like-a-ton-of-bricks/","cat":"humor","id":"comment-153500","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Lest the wrath of God descend upon them like a ton of bricks","post":"Thank you very much Davab.\nEven Popes’ discarded TS as a fake painting. However Development of science completely changed that opinion (starting from 1894 AD) (yes photography and based on scientific evidence such as dirt, limestone, pollen etc).\n\n","date":"September 23, 2014 at 5:55 pm","url":"https://shroudstory.com/2014/09/21/lest-the-wrath-of-god-descend-upon-them-like-a-ton-of-bricks/","cat":"humor","id":"comment-154490","author":"Sampath Fernando","site":"shroudstory"},{"title":"Lest the wrath of God descend upon them like a ton of bricks","post":"It was only in 1978, when the STURP team discovered that the painting hypothesis could definitely be ruled out.  Notwithstanding, Walter McCrone insisted to his dying day that it was painted, alleging presence of ochre and cinnabar,  \nIt is not only science and its many disciplines that will discover the truth about the Shroud.  Other disciplines will also make their contribution:  medicine, forensic pathology, textile specialists, historical research, philosophy (logic and critical thinking), biblical studies, audit appraisals, and even general studies.\n\n","date":"September 23, 2014 at 9:40 pm","url":"https://shroudstory.com/2014/09/21/lest-the-wrath-of-god-descend-upon-them-like-a-ton-of-bricks/","cat":"humor","id":"comment-154613","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Lest the wrath of God descend upon them like a ton of bricks","post":"The ‘shroudological’ concept of what a painting is, and what might constitute evidence for one, has changed a lot since the 70s. Why this should be I’m not sure – possibly because ‘Science’ trumped ‘Art’ when it came to authority in those days, and the scientists involved in the Shroud showed little evidence of knowing much about painting. There was much talk of ‘a painting would seep through the cloth and be visible on the back’ and ‘a painting always shows the directionality of brush strokes’ and ‘a painting always has shadows which show where the light was coming from’ and even, ‘a painting always has outlines,’ all of which seem rather naive, and fairly obviously to anybody who’d actually visited an art gallery, simply untrue.\nThey were on better ground in the search for pigment, although even here, they did not really know how much pigment could be sufficient, so that their arguments were not about whether there were any iron oxide particles, but whether there were enough to create an image. McCrone thought there were, and produced at least one experiment which appeared to demonstrate it. I do not know if it was challenged by any counter-experiments showing the opposite.\nThe scientists were on even better ground in their search for a colourless binder that would hold the pigment to the cloth. This, it could be reasoned, might remain even when most of the pigment had rubbed (or been washed) off. According to STuRP (Schwalbe & Rogers), McCrone’s chemical test for a proteinaceous binder (amido black) shows positive for any linen and could not have identified anything on top of it, while their own tests were more specific and definitely ruled out any protein on the image area. However they also ruled out any possibility of starch being the binder, a finding that was later retracted by Rogers, who decided he could find some after all. This suppported his ‘starch and saponin’ surface layer hypothesis, but could also support McCrone in his search for a binder.\nEven lower, as it were, than the binder, would be any chemical deterioration of the cloth itself, caused by pigment, binder, or carrier, all of which had disappeared. Guarlaschelli’s painting hypothesis depends on this, I think, and chemically, has not been demonstrated to be untenable.\nSo, no, the painting hypothesis has not definitely been ruled out.\n\n","date":"September 24, 2014 at 3:19 am","url":"https://shroudstory.com/2014/09/21/lest-the-wrath-of-god-descend-upon-them-like-a-ton-of-bricks/","cat":"humor","id":"comment-154779","author":"Hugh Farey","site":"shroudstory"},{"title":"Lest the wrath of God descend upon them like a ton of bricks","post":"The clincher would seem to be that when the cloth was subject to back-lighting, the only visible objects were the ‘blood-stains’.  Or is Hugh asserting that there exist pigments which not only reflect light, but also transmit it completely so that the pigments do not show??!!  Painting = pigments!!\n\n","date":"September 24, 2014 at 5:42 am","url":"https://shroudstory.com/2014/09/21/lest-the-wrath-of-god-descend-upon-them-like-a-ton-of-bricks/","cat":"humor","id":"comment-154851","author":"daveb of wellington nz","site":"shroudstory"}]
