[{"title":"Let the Debates Begin","post":"These days, there are multifarious ways of reacting to wonderful manifestations (of which there are many) in the world around us. Because of my scientific and technological background, I’m inspired primarily by scientific and technological manifestations. But the antiquated manifestations of religion concern and interest me greatly, too, because they’re synonymous with what might be termed our humanity. \nIn the region of France where I live, not far away from Chambéry, people are aware of the early days of the alleged shroud of Jesus. It so happens that the ecclesiastic historian Ulysse Chevalier wrote about this strange object in several interesting French-language articles (which can be downloaded today from the Gallica database). Chevalier’s articles constitute, to my mind, a splendid presentation of the legendary background of the discovery and context of this object. Today, personally, I would not wish to waste too much time talking emptily with anybody who has not examined closely these comments of the great regional historian Ulysse Chevalier, who happens to be my constant reference in everything that concerns the ancient history of my adoptive home in the Dauphiné.\nAs for more recent analyses of this cloth, I have nothing to add to what has already been exposed abundantly.\nFor everything concerning allegedly “miraculous” manifestations of certain facets of Humanity (as interesting as they are), I recommend strongly the reading of books by Richard Dawkins, who is a brilliant and serious dispeller of bullshit.\nAs for me, I must state “graciously” that I have nothing more to add to any eventual debate about the so-called Shroud of Turin… which bores me infinitely. Read some Dawkins!\nPS I don’t “call myself” a journalist. I don’t call myself anything, for that matter. So, please do likewise. Simply answer me objectively instead of trying out silly naming tricks.\n\n","date":"January 3, 2011 at 8:51 am","url":"https://shroudstory.com/2011/01/02/let-the-debates-begin/","cat":"news_&_views","id":"comment-2084","author":"William Skyvington","site":"shroudstory"},{"title":"Let the Debates Begin","post":"William,\nreading this blog you could find information about Emmanuel Poulle’s articles:\nhttps://shroudofturin.wordpress.com/2011/01/01/historian-emmanuel-poulle-and-the-shroud-of-turin/\nAbout Chevalier you can read: “Le Linceul de Turin victime d’Ulysse Chevalier”.\nIf you don’t know Emmanuel Poulle you can read:\nhttp://fr.wikipedia.org/wiki/Emmanuel_Poulle\nhttp://www.aibl.fr/fr/membres/academ/poulle.html\n\n","date":"January 4, 2011 at 4:40 am","url":"https://shroudstory.com/2011/01/02/let-the-debates-begin/","cat":"news_&_views","id":"comment-2108","author":"domenico","site":"shroudstory"}]
