[{"title":"Light Fun: The Renault 4L Pope Mobile","post":"I only hope this man lives to be 100. Not just the Catholic Church, not just Christianity but the whole of humanity needs this man. He is not a breath of fresh air, he is a huuricane of the Holy Sprit.\n\n","date":"October 6, 2013 at 5:07 am","url":"https://shroudstory.com/2013/10/06/light-fun-the-renault-4l-pope-mobile/","cat":"humor","id":"comment-46292","author":"John Klotz","site":"shroudstory"},{"title":"Light Fun: The Renault 4L Pope Mobile","post":"“Holy Spirit”\n\n","date":"October 6, 2013 at 5:08 am","url":"https://shroudstory.com/2013/10/06/light-fun-the-renault-4l-pope-mobile/","cat":"humor","id":"comment-46293","author":"John Klotz","site":"shroudstory"},{"title":"Light Fun: The Renault 4L Pope Mobile","post":"NZ once had a fine tradition of keeping old cars on the road, and many went for 200,000 miles, in the era when a handy chap could do all his own maintenance. Some 20 miles north of here there’s a fine old car museum, founded by Len Southward at Paraparaumu; includes a few gangsters’ models from the USA Prohibition era, with bullet proof windows, also one used by Marlene Dietrich, a few used for Royal tours, many veteran models, one or two steam cars. If you’re ever visiting here it’s worth a site visit. Even today, 100,000 miles is not all that uncommon, but most on the road these days are usually recent Japanese imports!\n\n","date":"October 6, 2013 at 6:06 am","url":"https://shroudstory.com/2013/10/06/light-fun-the-renault-4l-pope-mobile/","cat":"humor","id":"comment-46297","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Light Fun: The Renault 4L Pope Mobile","post":"Father Hans Küng has been making a big noise in favour of reform in the Catholic Church, and he is right, to a certain extent. Well, the reform appears to have started with Pope Francis himself giving a good example. Now, will Father Küng begin his own, private reform, by driving an old car? George Weigel had something to say about last year:\nhttp://www.firstthings.com/onthesquare/2010/04/an-open-letter-to-hans-kung\n\n","date":"October 6, 2013 at 12:32 pm","url":"https://shroudstory.com/2013/10/06/light-fun-the-renault-4l-pope-mobile/","cat":"humor","id":"comment-46314","author":"Louis","site":"shroudstory"},{"title":"Light Fun: The Renault 4L Pope Mobile","post":"Weigel’s letter is dated April 2010.\n\n","date":"October 6, 2013 at 3:16 pm","url":"https://shroudstory.com/2013/10/06/light-fun-the-renault-4l-pope-mobile/","cat":"humor","id":"comment-46320","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Light Fun: The Renault 4L Pope Mobile","post":"That’s right, if Fr. Küng still has that car, suitable for a playboy perhaps, than he has still not read what George Weigel wrote. As a systematic theologian it would have been better for him to concentrate on the science-theology dialogue, about which Pope Francis has said nothing so far, and leave the vacuum cleaning to the pontiff and his eight-cardinal commission, with excellent prelates: Sean O’Malley (Boston), Andres Maradiaga (Honduras), George Pell (Sydney) and Reinhard Marx (Munich). Pope John Paul II refused to meet Küng, Benedict XVI spoke to him for four hours and Pope Francis, open to suggestions, will probably give the green signal.\n\n","date":"October 6, 2013 at 3:34 pm","url":"https://shroudstory.com/2013/10/06/light-fun-the-renault-4l-pope-mobile/","cat":"humor","id":"comment-46321","author":"Louis","site":"shroudstory"}]
