[{"title":"Likely Error in Hamon’s Frascati Acheiropoietos Workshop Poster","post":"Early in the year 2010, as I was starting re-investigating on the coin-on-eye issue, I sent Barrie Schwortz an e.mail ending on the following request:\n“Because most of the right eye lettering which used to be readily visible to the naked eye on 1898 Pia’S, 1931 Enrie’s, 1969 Judica-Cordiglia’s and 1978 Miller’s photographic negatives seem no longer visible to-day [on 1997 Durante’s Shoud face photograph], allow me to get You back to your memory as one of the 1978 STURP team members. Could You remember and tell me if Swiss criminologist Dr Max Frei lifted pollen grains with his sticky tapes BEFORE or AFTER You and Vernon Miller took pictures of the Shroud Face? Or else was it IN BETWEEN? I do suspect him to have partially fragmented or damaged the already faint and incomplete blood decals on the right eye area by his too vigorous pressure of a sticky tape on the linen cloth in 1978.”\n\n","date":"October 26, 2011 at 7:26 am","url":"https://shroudstory.com/2011/10/26/likely-error-in-hamons-frascati-acheiropoietos-workshop-poster/","cat":"news_&_views","id":"comment-4350","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Likely Error in Hamon’s Frascati Acheiropoietos Workshop Poster","post":"Here was Barrie’s reply: \n“As for your final and most important question, Max Frei did NOT take ANY sticky tape samples from the face! He was about to do so when John Jackson stopped him.  Rogers also did not take tape samples from the face.  There is no way sticky tape samples could have impacted the supposed coin images. That is a fact.”\n\n","date":"October 26, 2011 at 7:31 am","url":"https://shroudstory.com/2011/10/26/likely-error-in-hamons-frascati-acheiropoietos-workshop-poster/","cat":"news_&_views","id":"comment-4352","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Likely Error in Hamon’s Frascati Acheiropoietos Workshop Poster","post":"IF THIS IS A FACT, how come then Avinoam Danim did study at least one stycky tape lifted up by Frei from the Shroud Face? Could Barrie explain it? \nMatter of fact, the footpage note you quote from my summary about Frei was deleted from the final version. This is just an intermediary version of my summary you are commenting on. \nIt took me some time before I got 2002 Durante Shroud face photograph. I was relieved to see the lettering was still there and corrected my first summary accordingly. \nMy studies are based not only on 1931 Enrie’s Shroud face photographs, but also on 2002 Durante’s and a recent HD Still.\n\n","date":"October 26, 2011 at 7:51 am","url":"https://shroudstory.com/2011/10/26/likely-error-in-hamons-frascati-acheiropoietos-workshop-poster/","cat":"news_&_views","id":"comment-4353","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Likely Error in Hamon’s Frascati Acheiropoietos Workshop Poster","post":"This is an extract from my paper : \n4/ Can the reading of “UCAI” on the Shroud be a “mere figure in clouds” due to the photographic procedure, the computer processing or the variegations on the linen cloth?\n  If we take a glance at digitized 2D reversed photographic enlargements of the right eye area from 1931 Giuseppe Enrie’s, 1978 Vernon Miller’s and 2002 Gian Carlo Durante’s photo-negative of the Shroud face, the same letter-grouping-like shapes can be detected (though as if a little bit out of focus on both Miller’s and Durante’s compared to Enrie’s). This means it is not an artefact of a certain photographic procedure as it can be depicted by photographs shot in different techniques whether orthochromatic, traditional silver and extensive digital. \nFigure 7 Photographic enlargement comparison of the right eye area from Shroud face reversed photonegatives\n  The letter images are not apparent on 1978 Schwortz’s and 1997 Durante’s Shroud face photograph just because of the use of two different lighting techniques. In 1978, Schwortz lit the Shroud from the front so as to minimize weave appearance to invisibility thus causing some already faint bloodstain patterns nearly standing out on the Shroud fabric to technically disappear from the photographs. In 1997, the “UCAI” sequence orientation happened to be nearly aligned with the incoming light direction thus causing a form of obfuscation from illumination to occur.\n\n","date":"October 26, 2011 at 8:08 am","url":"https://shroudstory.com/2011/10/26/likely-error-in-hamons-frascati-acheiropoietos-workshop-poster/","cat":"news_&_views","id":"comment-4354","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Likely Error in Hamon’s Frascati Acheiropoietos Workshop Poster","post":"“A bouquet of rock rose, which I had noted along with the crown chrysanthemum in 1995, appears on the right cheek of the human profile on the shroud. Dr. Frei had placed his adhesive tape No. 6bd at that spot and actually found some grains of rock rose pollen long before anyone had discovered images of the plant on the shroud. The fact that the existence of this plant’s image on the shroud has been demonstrated by two independent botanical methods proves beyond a reasonable doubt that plants of this species were placed on the shroud at one time.”\ncf. Where Did the Shroud of Turin Originate?\nA Botanical Quest by Avinoam Danin\nERETZ Magazine, November/December 1997\nTO BE READ ON.. Barrie Schwortz website!\n\n","date":"October 26, 2011 at 10:02 am","url":"https://shroudstory.com/2011/10/26/likely-error-in-hamons-frascati-acheiropoietos-workshop-poster/","cat":"news_&_views","id":"comment-4358","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Likely Error in Hamon’s Frascati Acheiropoietos Workshop Poster","post":"Well tried Danny to destabilized me. But you just failed ;)\n\n","date":"October 26, 2011 at 10:21 am","url":"https://shroudstory.com/2011/10/26/likely-error-in-hamons-frascati-acheiropoietos-workshop-poster/","cat":"news_&_views","id":"comment-4359","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Likely Error in Hamon’s Frascati Acheiropoietos Workshop Poster","post":"destabilize you?\n\n","date":"October 26, 2011 at 11:28 am","url":"https://shroudstory.com/2011/10/26/likely-error-in-hamons-frascati-acheiropoietos-workshop-poster/","cat":"news_&_views","id":"comment-4362","author":"episcopalian","site":"shroudstory"},{"title":"Likely Error in Hamon’s Frascati Acheiropoietos Workshop Poster","post":"I was just kidding, I am Libra…\n\n","date":"October 26, 2011 at 12:06 pm","url":"https://shroudstory.com/2011/10/26/likely-error-in-hamons-frascati-acheiropoietos-workshop-poster/","cat":"news_&_views","id":"comment-4365","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Likely Error in Hamon’s Frascati Acheiropoietos Workshop Poster","post":"Here, I don’t want to comment about the paper presented by Max but I just want to redo the summary of the situation regarding the coins issue because I want to add something very important that can help to understand that the use of coins during Jesus burial is VERY UNLIKELY.  \nIf we summarize this question :\n1- There is no exact reference in ancient jewish litterature (Thora, Mishna, Talmud, etc.) about the fact that putting coins over the eyes was a normal procedure in ancient jewish burials.\n2- The procedure of putting coins over the eyes (or into the mouth) was a pagan rite and this rite could have been taken  as an act of idolatry by the pious jews like the Pharisees and surely also by the vast majority of the Jews who were following the law of Moses (it is fair to believe the family and followers of Jesus enter in this category).\n3- The coins that are claimed to be on the shroud are Roman coins. Those coins were not hallowed in the Temple by the jewish authorities.\n4- If there was some Jews who used the coins during their burial, it is fair to presume it was almost exclusively Hellenistic Jews.\n4- Jesus and his followers (including his family) were all pious Jews who followed the law of Moses and they were not not hellenistic jews.\n5- The burial rite after Jesus death was only partially done on friday and they had to come back on sunday to do an anointing of the body.\nHere is my addition :  6- the average Jew at the time of Christ believed that after death the person was going directly into the Sheol and was awaiting the general resurrection of the dead at the end of time.  IN THIS CONTEXT, WHAT WOULD BE THE NEED FOR COINS ???  THE NORMAL JEW OF THE TIME OF CHRIST DIDN’T BELIEVED THAT HE NEEDED COINS TO GO TO THE SHEOL OR THAT HE NEEDED COINS FOR THE GENERAL RESURRECTION OF THE DEAD !  Only those with some Pagan beliefs thought that they needed coins to cross the Styx river ! \nIf you do not trust me, just read the story of the raising of Lazarus.  It’s the best part of the New Testament to read for a good understanding of the normal belief of the Jews and the normal Jewish burial practice during the time of Christ.  Here’s an important part where we can understand the average belief of the Jews during the time of Christ : “Jesus said to her, “Your brother will rise again.”\n Martha answered, “I know he will rise again in the resurrection at the last day.”  (Gospel of John (chapter 11, verses 23 and 24).  Martha in his answer to Christ expressed the normal belief of a Jew during the time of Christ (except for the Saducees who didn’t believed in resurrection).  NO NEED FOR ANY COIN IN THIS BELIEF OF THE AVERAGE JEW !!!\nSo, if some Jews during the time of Christ believed they needed coins to cross the Styx river, it was Jews who could followed part of the law of Moses but, at the same time, had some heretic beliefs and, most likely, they were Hellenistic Jews (and some Saducees were surely among those).  They were a bit like some modern Christian who belived in Reincarnation…  \nSo, again, when you take all these facts and put it all together to see the whole picture of the situation, HOW IN THE WORLD THE FOLLOWERS OF JESUS AND HIS FAMILY WOULD HAVE WANTED TO USE COINS OVER THE EYES DURING HIS PARTIALLY DONE BURIAL ???\nI think the probability for this happening is near ZERO !\n\n","date":"October 26, 2011 at 11:03 am","url":"https://shroudstory.com/2011/10/26/likely-error-in-hamons-frascati-acheiropoietos-workshop-poster/","cat":"news_&_views","id":"comment-4360","author":"Yannick Clément","site":"shroudstory"},{"title":"Likely Error in Hamon’s Frascati Acheiropoietos Workshop Poster","post":"Yannick,\nI do know you  INTELLECTUALLY JUST CANNOT believe in me as much as you believe in Barrie. Still let me tell you, I have done SOME extensive reserach work (archaelogy of the Gospels and rabbinic literature) to discover that both Yossef Ha-Ramathaïm and Boni ben Gwryon dit Nikodemos were not only Hakamim but also literate Hellenistic Judeans from the isle of Cyprus (Kryptos in Greek)…. Be sure I won’t waste  my precious time to convince you.\n\n","date":"October 26, 2011 at 11:27 am","url":"https://shroudstory.com/2011/10/26/likely-error-in-hamons-frascati-acheiropoietos-workshop-poster/","cat":"news_&_views","id":"comment-4361","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Likely Error in Hamon’s Frascati Acheiropoietos Workshop Poster","post":"I think you’re a bit off-track here…  I don’t need Barrie or anyone else to make up my own mind.  Max, please, if you got literary evidences from ancient Jewish sources to support your claim, show them !  It’s not a battle to know if you’re more intelligent than me or than Barrie or something like that.  It’s just a debate to know THE TRUTH.  So, if you think the 6 points I’ve written are wrong, show us a real PROOF that I’m wrong.\n\n","date":"October 26, 2011 at 1:01 pm","url":"https://shroudstory.com/2011/10/26/likely-error-in-hamons-frascati-acheiropoietos-workshop-poster/","cat":"news_&_views","id":"comment-4367","author":"Yannick Clément","site":"shroudstory"},{"title":"Likely Error in Hamon’s Frascati Acheiropoietos Workshop Poster","post":"By the way Lazarus was also from Kryptos… And I just can’t telll you all I discovered about Lazarus…\n\n","date":"October 26, 2011 at 11:32 am","url":"https://shroudstory.com/2011/10/26/likely-error-in-hamons-frascati-acheiropoietos-workshop-poster/","cat":"news_&_views","id":"comment-4363","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Likely Error in Hamon’s Frascati Acheiropoietos Workshop Poster","post":"Behind the placing of coins over Yeshua’s eyes, there was a “kavannah”, a secret intent….\n\n","date":"October 26, 2011 at 11:50 am","url":"https://shroudstory.com/2011/10/26/likely-error-in-hamons-frascati-acheiropoietos-workshop-poster/","cat":"news_&_views","id":"comment-4364","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Likely Error in Hamon’s Frascati Acheiropoietos Workshop Poster","post":"Unfortunately, most of the followers of this blog has never had the opportunity to analyze the Shroud. I would add that most of us have never had the opportunity to analyze the photographs this discussion is based upon (1931 Enrie’s Shroud face photographs, but also on 2002 Durante’s and a recent HD Still), simply because they are not available so easily. Perhaps, if someone could provide the readers of this blog with that whole set of photographs, we could make an opinion by ourselves…..Otherwise, the whole discussion is based upon the results of the analysis of photographs carried out by Max, Barry and the erst. For me at least, I come to a point where I do not know who to give credit, because I am bound to believe someone’s results based on the credibility of that person instead of an impartial and open analysis of the photographs….Umm! I bet we will never see those photographs.\n\n","date":"October 26, 2011 at 2:07 pm","url":"https://shroudstory.com/2011/10/26/likely-error-in-hamons-frascati-acheiropoietos-workshop-poster/","cat":"news_&_views","id":"comment-4369","author":"Gabriel","site":"shroudstory"},{"title":"Likely Error in Hamon’s Frascati Acheiropoietos Workshop Poster","post":"If I may give you an advice, try to find all the STURP papers and read them carefully.  That’s the corner stone of all the Shroud research.  I think we can trust a lot of their work and conclusions.  By the way, I’ve never seen a STURP team member being an advocate of those ghost images (coins, flowers, writtings, etc.).  Maybe there’s a few of them who believe those things are there but I’ve never read a scientific paper signed by one of the STURP member that show any evidences to support those doubtful claims.  The only scientist I know who really support those claims (especially for the coins issue) and who was there in Turin in 1978 is Baima Bollone…  \nSince science isn’t able yet to PROVE that those images are really there, we deal with probabilities here.  I think all the facts and arguments that I’ve bring here in the past few days shows that the probabilities that those images really exist are very low.  I know, it’s just a probability and not a certainty, but the probability is high that on friday night, there was only the dead body of a man in the Shroud, and nothing else.  \nIf I’m wrong, fine.  No problem.  But before someone prove me wrong on this topic, he will need to show me scientific PROOFS and not just some “Me I see it, why don’t you ?” or “Me I see it, but you are not as qualified than me, so it’s normal that you don’t see a thing !”.  Those claims are easy to do.  Bringing real scientific proofs is another thing.  \nTo finish, I want to say this : the burden of proof rests on the shoulders of those who make such doubtful claims.  And so far, those people have failed to bring the unquestionable proof I’m waiting for…\n\n","date":"October 26, 2011 at 3:33 pm","url":"https://shroudstory.com/2011/10/26/likely-error-in-hamons-frascati-acheiropoietos-workshop-poster/","cat":"news_&_views","id":"comment-4371","author":"Yannick Clément","site":"shroudstory"},{"title":"Likely Error in Hamon’s Frascati Acheiropoietos Workshop Poster","post":"One last message to Gabriel :  When you don’t know who you can trust, maybe you can start by giving a little bit more credence to papers that have been published in a peer-reviewed scientific journal (like every STURP paper I just mentionned) ?  I think it would be a good start.\n\n","date":"October 26, 2011 at 3:39 pm","url":"https://shroudstory.com/2011/10/26/likely-error-in-hamons-frascati-acheiropoietos-workshop-poster/","cat":"news_&_views","id":"comment-4372","author":"Yannick Clément","site":"shroudstory"},{"title":"Likely Error in Hamon’s Frascati Acheiropoietos Workshop Poster","post":"Hello Gabriel\nAny time your around my neck of the woods I’ll be happy to show you the actual 1931 original prints Father Filas used for his study. In the mean time you can access the HSG’s paper titled Discover Pilate’s Lepton Coin which explains Fr. Filas procedure.\nA password is required, which you can request at http://holyshroudguild.org/hsg-archives.html.\n\n","date":"October 26, 2011 at 5:10 pm","url":"https://shroudstory.com/2011/10/26/likely-error-in-hamons-frascati-acheiropoietos-workshop-poster/","cat":"news_&_views","id":"comment-4374","author":"HSGppf","site":"shroudstory"},{"title":"Likely Error in Hamon’s Frascati Acheiropoietos Workshop Poster","post":"Thanks a lot. I hace already requested a password and when I get one I will have a look at that paper. Thanks again\n\n","date":"October 26, 2011 at 6:33 pm","url":"https://shroudstory.com/2011/10/26/likely-error-in-hamons-frascati-acheiropoietos-workshop-poster/","cat":"news_&_views","id":"comment-4377","author":"Gabriel","site":"shroudstory"}]
