[{"title":"Lisa Miller on American Catholics","post":"Interesting piece. I was protestant but converted to Catholicism about 2 years ago. The tradition and sacraments greatly appealed / appeal. Also, for me the protestant churches have become too wishy washy “everything goes”. The centralism of the Vatican and its dogma appealed. Yet…..there are still aspects of doctrine and the vatican’s authority that I am not 100% comfortable with, and I certainly do not believe in papal infallibility.\nBut I am certainly very comfortable overall in my conversion, and see some of the issues as matters of human frailty and fallibility rather than anything rotten at the heart of Catholicism. Hopefully the new Pope will get on top of some of these issues.\n\n","date":"March 3, 2013 at 5:53 am","url":"https://shroudstory.com/2013/03/03/lisa-miller-on-american-catholics/","cat":"news_&_views","id":"comment-26231","author":"Matthias","site":"shroudstory"},{"title":"Lisa Miller on American Catholics","post":"In 1992, Bill Clinton won the Presidency of the US running on the theme: “It’s thee economy, stupid.” I sometimes think that a theme for all Christianity is: It’s the Resurrectton, Stupid.” What makes Christianity unique is the Resurrection and that is why so many who find belief in God, who God a bother, are so adamant that thee Shroud is a forgery despite a mountaiin of evidence that it is not.\nAll of the proclaimed scientific detachment aside, the principal reasons, in my opinion, that people like Dawkins and CB can’t accept the Shroud is that they can’t accept the Resurrection. The  Shroud is a Revelation for our times. It is difficult not to see a hand of Providence in the fact that for nearly two millenia it has been among us, often hidden and always misunderstood. The “rationalist” recoils from what science has now has revealed.\nThe words of Francis Thompson in the Hound of Heaven come to mind:\n“I FLED Him, down the nights and down the days;\n  I fled Him, down the arches of the years;\nI fled Him, down the labyrinthine ways\n             * * *\n“‘Rise, clasp My hand, and come!’\n  Halts by me that footfall:\n  Is my gloom, after all,\nShade of His hand, outstretched caressingly?\n  ‘Ah, fondest, blindest, weakest,\n  I am He Whom thou seekest!;”\nIt is Lent, Easter glimmers on the horizon.\n\n","date":"March 3, 2013 at 8:34 am","url":"https://shroudstory.com/2013/03/03/lisa-miller-on-american-catholics/","cat":"news_&_views","id":"comment-26251","author":"John Klotz","site":"shroudstory"},{"title":"Lisa Miller on American Catholics","post":"Typos corrected:\nIn 1992, Bill Clinton won the Presidency of the US running on the theme: “It’s the economy, stupid.” I sometimes think that a theme for all Christianity is: It’s the Resurrection, Stupid.” What makes Christianity unique is the Resurrection and that is why so many who find belief in God, who God a bother, are so adamant that thee Shroud is a forgery despite a mountain of evidence that it is not.\nAll of the proclaimed scientific detachment aside, the principal reasons, in my opinion, that people like Dawkins and CB can’t accept the Shroud is that they can’t accept the Resurrection. The Shroud is a Revelation for our times. It is difficult not to see a hand of Providence in the fact that for nearly two millenia it has been among us, often hidden and always misunderstood. The “rationalist” recoils from what science has now has revealed.\nThe words of Francis Thompson in the Hound of Heaven come to mind:\n“I fled Him, down the nights and down the days;\nI fled Him, down the arches of the years;\nI fled Him, down the labyrinthine ways\n* * *\n“‘Rise, clasp My hand, and come!’\nHalts by me that footfall:\nIs my gloom, after all,\nShade of His hand, outstretched caressingly?\n‘Ah, fondest, blindest, weakest,\nI am He Whom thou seekest!; ”\nIt is Lent, Easter glimmers on the horizon.\n\n","date":"March 3, 2013 at 8:41 am","url":"https://shroudstory.com/2013/03/03/lisa-miller-on-american-catholics/","cat":"news_&_views","id":"comment-26252","author":"John Klotz","site":"shroudstory"},{"title":"Lisa Miller on American Catholics","post":"Francis Thomson’s poem has been a favourite since my 20s.  He fell into poverty and ill health, was cared for by the Meynells who published his works, generally all of a mystic nature, including the “Hound of Heaven”. \nDan: “Only American Catholics?”  Here in the antipodes, Rome is a very long way away indeed.  Some sample NZ responses I received on Lisa Miller’s article:\nAn 85 year od married lady: “Very interesting. I will spare you my hobby horse…  (I think it’s probably about the need for women priests)\nAn 85 year old spinster: “[Priest returning from Holland] said there is a strong feeling among the clergy that the Church is going to sink very low and then there will  be a dramatic rise, let’s hope so.  The huge number of people farewelling Pope Benedict cant be thinking like the Americans, I thought it was wonderful.\nA senior Catholic male parishioner: “I essentially agree that my relationship with The Lord is the most important thing. And the church in Rome and whoever is the Pope is quite distant to what is important to us and our fellow parishioners.”\nA recently widowered close male relative: “It seems we’re to have an Italian because Italy and the Vatican not Catholics need it.\nI am rather sure any South American cardinal would know all about political jiggery pokery rather like Jimmy Carter the American president who had to put up with shonky relations and had every crooked deal tried out on him during elections, hence he was often used as an observer in the elections in overseas countries as he knew by experience how crooked things can work. Seen by overseas politicians and U.N. as very astute and honest.\nIt is a rather sad state of affairs and one I can understand. Still the world doesn’t centre around America or Italy. How about a Polynesian Pope the Polynesians have been involved in Politics from time existed or Polynesians did. Bonney [dog] will still play and lick regardless of who will be pope.\nJK: “It’s the Resurrectton, Stupid.” Amen to that!\n\n","date":"March 3, 2013 at 3:28 pm","url":"https://shroudstory.com/2013/03/03/lisa-miller-on-american-catholics/","cat":"news_&_views","id":"comment-26285","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Lisa Miller on American Catholics","post":"That’s right, it is correct to ask “Only American Catholics?” There are millions of examples all around the world and the question of obedience can apply to Protestants, Orthodox as well, as anyone who knows what transpired between Freud and the Rev.Oskar Pfister will understand. The door is open for Garry Wills to leave the Church, as it is for Hans Küng. In the case of the latter, no Protestant church would like a rabble-rouser like him in the midst of its fold. He would have to open a one-man, Swiss-made church. \nSome left the Church because of doctrine and doubts about who has apostolic tradition, then thought twice about the decision and came back after a couple of years, during which a lot of time was devoted to deep thought. That was the case with Francis Beckwith, professor of philosophy at Baylor and author of the book “Return to Rome.”\nThe problem seems to be discoveries in science that clash with what is stated in the Bible, particularly in the Old Testament. What about the New Testament? J.P. Meier tells us that Jesus spoke in riddles, that the parables are riddles. He is right because they were meant to be riddles, but he has kept quiet about the rest of the story, beyond the parables.The real Jesus is to be found there, that perhaps being the reason why he says ‘the real Jesus is not the historical Jesus and the historical Jesus is not the real Jesus’.\n\n","date":"March 3, 2013 at 5:41 pm","url":"https://shroudstory.com/2013/03/03/lisa-miller-on-american-catholics/","cat":"news_&_views","id":"comment-26292","author":"Louis","site":"shroudstory"},{"title":"Lisa Miller on American Catholics","post":"the sex crimes scandel and hush money pay off shows that the primary goal of any bureaucracy is self preservation above all else. This applies to any organization religious or otherwise. religion is manmade christianity is not.\n\n","date":"March 5, 2013 at 12:25 am","url":"https://shroudstory.com/2013/03/03/lisa-miller-on-american-catholics/","cat":"news_&_views","id":"comment-26477","author":"Paul","site":"shroudstory"}]
