[{"title":"Living Free: The Thomas Aquinas and Pierre Teilhard de Chardin Part","post":"“That is simply not true. Ninety-Seven per cent of Planned Parenthood activities are devoted to women’s health issues, a part of the 97% does include contraception services, BUT, the number one way to prevent abortions is contraception.”\nYou need to do your research better, Dan.  Your statement is simply false from PPs own records.\n\n","date":"January 11, 2013 at 11:36 am","url":"https://shroudstory.com/2013/01/11/living-free-the-thomas-aquinas-and-pierre-teilhard-de-chardin-part/","cat":"uncategorized","id":"comment-21888","author":"Andy Weiss","site":"shroudstory"},{"title":"Living Free: The Thomas Aquinas and Pierre Teilhard de Chardin Part","post":"Andy,\nThe fact that John Kyle claimed that providing abortions was 90% of  Planned Parenthood’s principal activity was pretty thoroughly rebutted last year. John Stewart and Steven Colbert made short shrift of Kyle in their usual sardonic way: The actual figure reported was 3%.\nhttp://www.npr.org/blogs/itsallpolitics/2011/04/12/135347030/jon-stewart-stephen-colbert-tweak-sen-kyl-on-planned-parenthood\nThe same information was reported by other news outlets. I believe that life and death medical decisions should be left to the woman and her doctor. In Ireland recently, a woman died because the hospital applied Catholic theology to a problem of he woman. She, as I recall was a Hindu.  I don’t know of any man other than not a devout Catholic but a blinkered one who will tell a doctor, go ahead let my wife die under those circumstances. I believe it was a Arizona  Archbishop who disciplined a nun who was a hospital administrator when she agreed with a medical teams decision to perform an abortion that saved the mother’s life. She should have followed Catholic doctrine and let the mother die. Finally in Brazil, a doctor and a nine year old girl who had been raped by her step father and was carrying twins were excommunicated on Vatican orders for performing an abortion when to carry the child would have resulted in the girl’s death because her body was not developed enough to complete the pregnancy. \nIt’s a very tough thing for those caught in that situation.  Pray that you will never have to face it and I will pray that no woman’s life will ever depend on your judgment.\n\n","date":"January 11, 2013 at 3:58 pm","url":"https://shroudstory.com/2013/01/11/living-free-the-thomas-aquinas-and-pierre-teilhard-de-chardin-part/","cat":"uncategorized","id":"comment-21900","author":"John Klotz","site":"shroudstory"},{"title":"Living Free: The Thomas Aquinas and Pierre Teilhard de Chardin Part","post":"Sorry, John, that’s false.  See below.  The numbers are taken from PP’s own report.  Get it and read it if you will.  Relying on a sardonic article is doing you a disservice.\n\n","date":"January 14, 2013 at 9:31 am","url":"https://shroudstory.com/2013/01/11/living-free-the-thomas-aquinas-and-pierre-teilhard-de-chardin-part/","cat":"uncategorized","id":"comment-21992","author":"Andy Weiss","site":"shroudstory"},{"title":"Living Free: The Thomas Aquinas and Pierre Teilhard de Chardin Part","post":"Not my research, Andy. But I suspect that John is right.\n\n","date":"January 11, 2013 at 4:11 pm","url":"https://shroudstory.com/2013/01/11/living-free-the-thomas-aquinas-and-pierre-teilhard-de-chardin-part/","cat":"uncategorized","id":"comment-21901","author":"Dan","site":"shroudstory"},{"title":"Living Free: The Thomas Aquinas and Pierre Teilhard de Chardin Part","post":"Dan Porter’s shroudstory.com site has become  the Shroudie Readers Digest of the internet, re-publishing lengthy chunks of other people’s content, but with one important difference – he can’t be bother to seek the author’s permission. He republishes so much of other people’s postings so that the courtesy link in blue need rarely to be accessed, his having provided what his devotees trust to be the gist of the (selected) core content. As I say  – Shroudie Readers Digest-  with Dan deciding what to quote, what to leave out  – control freakery by any other name, filtering, attenuating, dampening other people’s signals.\nYes, it’s piracy (and more besides) by any other name – a Shroudie news aggregating, news filtering site –  guaranteed user-friendly to those who seek generally pro-authenticity copy, carefully  iinterspersed  with comfort-inducing RC/quasi- RC (Episcopalean) stuff (Akiane’s Jesus etc, probably most of it fake) and fliers from Russ Breault etc on their Shroud-mystery marketing roadshows.\nA tiny proportion of his readership contributes comments, and a major proportion of those who do so are in the grip of one or other agenda-driven or pro-authenticity obsession.\nYou need to clean up your act, Dan Porter. Editorial blandness may have protected you so far, but where this outpost of Shroudie scepticism is concerned, that ends today. The gloves are off.\n\n","date":"January 11, 2013 at 4:47 pm","url":"https://shroudstory.com/2013/01/11/living-free-the-thomas-aquinas-and-pierre-teilhard-de-chardin-part/","cat":"uncategorized","id":"comment-21902","author":"colinsberry","site":"shroudstory"},{"title":"Living Free: The Thomas Aquinas and Pierre Teilhard de Chardin Part","post":"Sorry Dan.  I misread it.  The facts don’t lie, John.  Read these numbers and then dispute their numbers if you wish.\nPlanned Parenthood recently released its 2011-2012 annual report indicating this non-profit government funded (over $500 million) performed a record-high 333,964 abortions during 2011.\n– 92 percent of Planned Parenthood’s pregnant clients received abortions\n– Prenatal care patients accounted for 7 seven percent\n– Adoption referrals were less than one percent\n\n","date":"January 14, 2013 at 9:28 am","url":"https://shroudstory.com/2013/01/11/living-free-the-thomas-aquinas-and-pierre-teilhard-de-chardin-part/","cat":"uncategorized","id":"comment-21990","author":"Andy Weiss","site":"shroudstory"},{"title":"Living Free: The Thomas Aquinas and Pierre Teilhard de Chardin Part","post":"Colin,\nDan had my explicit decision to re post my article rather than simply link to it. I expect your attack on Dan which factually in error reflects your research standards.\n\n","date":"January 11, 2013 at 4:58 pm","url":"https://shroudstory.com/2013/01/11/living-free-the-thomas-aquinas-and-pierre-teilhard-de-chardin-part/","cat":"uncategorized","id":"comment-21903","author":"John Klotz","site":"shroudstory"},{"title":"Living Free: The Thomas Aquinas and Pierre Teilhard de Chardin Part","post":"John:  leaving aside the fact that Dan did not bother to state he was publishing with your permission, you overlook one fact.  I did not mention you by name. In fact, my comment was prompted by that of Andy Weiss before yours, no stranger to this site,  and a seasoned website manager himself as I recall, posting a comment that had clearly assumed your words to be those of the blog site owner’s. His mistake was understandable in my view, given Dan’s  nominal 8 word preamble making no clear demarcation between his and yours (e.g. no quotation marks, or use of the WordPress facility for indenting quotes from others).\nAs for my research – I endeavour wherever possible to give sufficient experimental detail such that genuine sceptics can check out  – and hopefully confirm  – my findings for themselves. I stand or fall by reproducibility  – not by your vicious agenda-driven put-downs. If you have specific complaints – then make them.  Address the issue – not the man. I have no time for ad hominem sniping on websites.\n\n","date":"January 11, 2013 at 5:27 pm","url":"https://shroudstory.com/2013/01/11/living-free-the-thomas-aquinas-and-pierre-teilhard-de-chardin-part/","cat":"uncategorized","id":"comment-21905","author":"colinsberry","site":"shroudstory"},{"title":"Living Free: The Thomas Aquinas and Pierre Teilhard de Chardin Part","post":"Yeah, right, Colin. You can dish it out but you can’t take it. Talk about cudgels, ha! You don’t see it, do you?\n\n","date":"January 12, 2013 at 8:25 am","url":"https://shroudstory.com/2013/01/11/living-free-the-thomas-aquinas-and-pierre-teilhard-de-chardin-part/","cat":"uncategorized","id":"comment-21931","author":"Paulette","site":"shroudstory"},{"title":"Living Free: The Thomas Aquinas and Pierre Teilhard de Chardin Part","post":"Concerning ‘colinsberry’ comment:: “re-publishing lengthy chunks of other people’s content, but with one important difference – he can’t be bother(ed) to seek the author’s permission”..\nI can confirm that I have a copy of an email sent by John Klotz to Dan Porter dated 11 Jan 2013, adivising the content of the John Klotz “lengthy” posting above which includes the comment “Dan Porter: Feel free to link or post. Probably posting is better.” \nSo Colin – Eat that!\n\n","date":"January 11, 2013 at 5:08 pm","url":"https://shroudstory.com/2013/01/11/living-free-the-thomas-aquinas-and-pierre-teilhard-de-chardin-part/","cat":"uncategorized","id":"comment-21904","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Living Free: The Thomas Aquinas and Pierre Teilhard de Chardin Part","post":"I’ll take your word for it, not being privy to what’s in other people’s email inboxes. I can only respond to what I see. And what I see here is a complete cut-and-paste of someone else’s posting, one that appeared just yesterday, reproduced here with no explanation for why it has been duplicated on another site, while still awaiting a first comment on its own,  There is scarcely any ‘top’ and no ‘tail’ so is it any wonder that at least one person has read it as Dan Porter’s own posting? Is it any wonder that this site appears near the top of search engine listings when it systematically hoovers up other people’s blog postings within hours of their appearing, with scarcely any input from the blog site owner?\nBut it’s not the piracy to which I object to most. See my previous comment re drawing any perceived sting etc … This site needs to be more open and honest about its true raison d’etre. Calling itself simply “Shroud of Turin” blog, given the essentially RC agenda, while hoovering up everyone else’s content is not what I would call a legitimate use of the internet. It is essentially parasitic.\n\n","date":"January 11, 2013 at 8:11 pm","url":"https://shroudstory.com/2013/01/11/living-free-the-thomas-aquinas-and-pierre-teilhard-de-chardin-part/","cat":"uncategorized","id":"comment-21908","author":"colinsberry","site":"shroudstory"},{"title":"Living Free: The Thomas Aquinas and Pierre Teilhard de Chardin Part","post":"John Klotz’s efforts are worthy of appreciation. The problem is that only part of the story has been told so far and the finished manuscript will have to include what is missing.\n\n","date":"January 11, 2013 at 8:50 pm","url":"https://shroudstory.com/2013/01/11/living-free-the-thomas-aquinas-and-pierre-teilhard-de-chardin-part/","cat":"uncategorized","id":"comment-21909","author":"Louis","site":"shroudstory"},{"title":"Living Free: The Thomas Aquinas and Pierre Teilhard de Chardin Part","post":"Louis,\nThank you for your comment. The reason I post issues I am dealing with is to get feedback. It is quite helpful and I, believe it or not, really appreciate criticism. I intend to complete this manuscript and  probably initially E-Book it. I was hoping to finish before Easter, but unfortunately, Easter comes early this year – just as it did in 1978, the year of the STURP examination of the Shroud,\n\n","date":"January 11, 2013 at 11:58 pm","url":"https://shroudstory.com/2013/01/11/living-free-the-thomas-aquinas-and-pierre-teilhard-de-chardin-part/","cat":"uncategorized","id":"comment-21910","author":"John Klotz","site":"shroudstory"},{"title":"Living Free: The Thomas Aquinas and Pierre Teilhard de Chardin Part","post":"You’re welcome John. It looked necessary to make the comment in view of the importance of the topics you are dwelling on, particularly the bit on Chardin.\n\n","date":"January 12, 2013 at 8:03 am","url":"https://shroudstory.com/2013/01/11/living-free-the-thomas-aquinas-and-pierre-teilhard-de-chardin-part/","cat":"uncategorized","id":"comment-21923","author":"Louis","site":"shroudstory"},{"title":"Living Free: The Thomas Aquinas and Pierre Teilhard de Chardin Part","post":"John, my advice is not to publish this. From a layman’s perspective it just looks loony and quite frankly smacks of hysteria and extreme narcissism IMHO. It sounds like something Colin would write.\n\n","date":"January 12, 2013 at 8:15 am","url":"https://shroudstory.com/2013/01/11/living-free-the-thomas-aquinas-and-pierre-teilhard-de-chardin-part/","cat":"uncategorized","id":"comment-21929","author":"Chris","site":"shroudstory"},{"title":"Living Free: The Thomas Aquinas and Pierre Teilhard de Chardin Part","post":"Chris,\nWhen I said I like to receive criticism, I was thinking of something more substantive :-)\nYour viewpoint would be a minority of one from what I’ve heard. For example, I believe I posted a bit on Father Rinaldi including a link to a Sign Magazine article that he wrote in 1934 when still a seminarian in Italy.\nThat article was the beginning of the serious Shroud study  in the US for it attracted the attention of many thousands of Catholics including Father Wuenschel who went on to found the Holy Shroud Guild.  Fr. Rinaldi who immigrated to he US became, along with Fr. Otterbein, a star in the Shroud world. Rinaldi was probably the single most important person 44 years later in STURP being formed and in gaining access to the Shroud (I don’t mean to gainsay the contributions and organizational talents of Dr. Robert Jackson in writing that). \nWhen my book is complete, you will be able to read about it. That chapter is already drafted and has received favorable reviews from those I shared it with privately and  who commented. It’s not for publication yet.\nMy digging Rinaldi’s article out of an archive in Pennsylvania got some attention from some very interesting quarters including one across the Pond in GB.\nI really don’t want to be so defensive about this but I do resent the “loony” part. Has someone profiled me and  figured out how to get under my skin? Not that I am paranoid or anything.\nThe working title of my manuscripts is: “The Coming of the Quantum Christ: The Shroud of Turin and the Future of Science and Humanity.” I owe a portion of that title to Dame Isabel Pizek who once said: “The future of science is the Shroud of Turin.”\nThe reason she could say that is ultimately I think she believes as I do, that the issue of the Shroud image will be resolved at the level of quantum mechanics. Now if you want loony, try quantum mechanics. Richard Dawkins, the atheist pope (my description cc) is quoted in the introduction to my manuscript drafted a year ago:\n“Perhaps there are some genuinely profound and meaningful questions that are forever beyond the reach of science. Maybe quantum theory is already knocking on the door of the unfathomable. But if science cannot answer some ultimate question, what makes anybody think that religion can?”\nNow that’s loony, or is it?\n\n","date":"January 12, 2013 at 8:58 am","url":"https://shroudstory.com/2013/01/11/living-free-the-thomas-aquinas-and-pierre-teilhard-de-chardin-part/","cat":"uncategorized","id":"comment-21933","author":"John Klotz","site":"shroudstory"},{"title":"Living Free: The Thomas Aquinas and Pierre Teilhard de Chardin Part","post":"“The future of science is the Shroud of Turin”. John, honestly, aren’t you going too far?\n\n","date":"January 12, 2013 at 11:19 am","url":"https://shroudstory.com/2013/01/11/living-free-the-thomas-aquinas-and-pierre-teilhard-de-chardin-part/","cat":"uncategorized","id":"comment-21934","author":"Gabriel","site":"shroudstory"},{"title":"Living Free: The Thomas Aquinas and Pierre Teilhard de Chardin Part","post":"\nPaulette :\nYeah, right, Colin. You can dish it out but you can’t take it. Talk about cudgels, ha! You don’t see it, do you?\nI take seriously any comments addressed to the issues Paulette, but ignore those that are merely crank-it-out  ad hominem  put-down- and/or-snuff -out comments, which sadly have become this site’s speciality. Thank you though for your appreciative comment re my critique of Ray Rogers’ FAQs.\nAs for “dishing it out”, note that  my initial comment was addressed, yet again, to a sore point with me –  an issue note – namely the cutting-and-pasting of lengthy but  incomplete selections other blog postings, often within hours of their being posted, leaving this site’s readers little or no incentive to visit those other sites for the entire story, warts an’ all. \nReaders Digest? Target Readership Easy To Digest” more like it. It was someone else, not me, who first suggested there was a certain smoothie mellifluous  PR man’s modus operandi at work here –  drawing the sting, pre-empting, any off-site internet comment deemed threatening to this one’s (unarticulated) agenda, presenting a Kremlinesque (or should that be Vaticanesque?) air-brushed version instead. Ever read Orwell’s 1984?\n\n","date":"January 12, 2013 at 8:58 am","url":"https://shroudstory.com/2013/01/11/living-free-the-thomas-aquinas-and-pierre-teilhard-de-chardin-part/","cat":"uncategorized","id":"comment-21932","author":"colinsberry","site":"shroudstory"},{"title":"Living Free: The Thomas Aquinas and Pierre Teilhard de Chardin Part","post":"Gabriel,\nThat is a direct quote from Isabel Pizek. She may have been quoting a  European physicist when she said it. I don’t know what your position is on the Shroud or the Resurrection of Jesus Christ. The are some who take the attitude I guess of the old song: “How do I know, the Bible tells me so.” Biblical interpretation (exegesis) is not easy and to read the Bible as something dictated by God with human authors playing stenographers doesn’t do justice to the Bible, the putative stenographers or, for that matter, God.\nIf the Shroud of Turin is the authentic burial cloth of Jesus Christ, and I believe it is, then the simplest solution to the mystery of its image is the Resurrection. At that point it becomes the most important object on the face of the Earth. \nI believe that ultimately it will be science that will unlock the mystery of the image and I  believe it will be unlocked at the quantum level of existence. (The late Ray Rogers has already been there in one sense, a tiny fingerprint of the quantum is in his calculations.) \nThe quantum, IMVHO is the interface between the primordial consciousness (God) from which our existence sprung at the Big Bang and that existence. The Shroud is a link between science and God . Revealing that primordial existence will be a scientific accomplishment beyond measure. It’s the future of science and religion, the synthesis of which was predicted by Pierre Teilhard de Chardin.\nThank you for challenging me. You just made me clarify my thoughts.\n\n","date":"January 12, 2013 at 12:11 pm","url":"https://shroudstory.com/2013/01/11/living-free-the-thomas-aquinas-and-pierre-teilhard-de-chardin-part/","cat":"uncategorized","id":"comment-21935","author":"John Klotz","site":"shroudstory"},{"title":"Living Free: The Thomas Aquinas and Pierre Teilhard de Chardin Part","post":"I second Gabriel. With all respect to Isabel Piczek (notice the “c” in her name):  people say that she is a physicist, but is that really the case? What are the papers she ever published in physics? And what exactly is the meaning of “quantum” in the context of your book? It does not seem that it is the concept of quantum in physics. If not, why use this word?\n\n","date":"January 12, 2013 at 1:10 pm","url":"https://shroudstory.com/2013/01/11/living-free-the-thomas-aquinas-and-pierre-teilhard-de-chardin-part/","cat":"uncategorized","id":"comment-21936","author":"Mario Latendresse","site":"shroudstory"},{"title":"Living Free: The Thomas Aquinas and Pierre Teilhard de Chardin Part","post":"Mario,\nI cover these issues on my blog at http://johnklotz.blogspot.com/2012/08/michael-redux-quantum-mechanics.html\nThere is a video linked on that page which discusses the human brain as quantum computer and speculates about near death experiences bein essentially an upload to the quantum information of all existence and the snap back to life being a download.\n\nYou may disagree with me but I believe that science is beginning to deal with human intelligence as a quantum phenomenon (QP), perhaps a singularity (whatever that is)  If our intelligence is a QP, what  is God, in whose image and likeness we are made?\n\n","date":"January 12, 2013 at 2:09 pm","url":"https://shroudstory.com/2013/01/11/living-free-the-thomas-aquinas-and-pierre-teilhard-de-chardin-part/","cat":"uncategorized","id":"comment-21938","author":"John Klotz","site":"shroudstory"},{"title":"Living Free: The Thomas Aquinas and Pierre Teilhard de Chardin Part","post":"John, please let me know when your manuscript is ready.\n\n","date":"January 13, 2013 at 5:24 pm","url":"https://shroudstory.com/2013/01/11/living-free-the-thomas-aquinas-and-pierre-teilhard-de-chardin-part/","cat":"uncategorized","id":"comment-21968","author":"Louis","site":"shroudstory"},{"title":"Living Free: The Thomas Aquinas and Pierre Teilhard de Chardin Part","post":"I promise not to keep it a secret :-) Thanks for the interest. \nMy E-Mail address is klotlaw@gmail.com\n\n","date":"January 13, 2013 at 7:12 pm","url":"https://shroudstory.com/2013/01/11/living-free-the-thomas-aquinas-and-pierre-teilhard-de-chardin-part/","cat":"uncategorized","id":"comment-21970","author":"John Klotz","site":"shroudstory"},{"title":"Living Free: The Thomas Aquinas and Pierre Teilhard de Chardin Part","post":"Thanks a lot, John. I’ll get in touch with you the soonest possible. There is no way of keeping it a secret as many will be waiting to read it!\n\n","date":"January 13, 2013 at 7:15 pm","url":"https://shroudstory.com/2013/01/11/living-free-the-thomas-aquinas-and-pierre-teilhard-de-chardin-part/","cat":"uncategorized","id":"comment-21971","author":"Louis","site":"shroudstory"},{"title":"Living Free: The Thomas Aquinas and Pierre Teilhard de Chardin Part","post":"Reply to Andy Weiss\nAndy, in your summary of the report you state:\n– 92 percent of Planned Parenthood’s PREGNANT clients received abortions (emphasis added)\nYou don’t state how many non-pregnant clients PP actually had except that 7% received prenatal care. How many does that represent compared to the number of abortions. The whole point is contraception and health services. Is it not a fact that the number far exceeds the number of pregnant women who receive abortions.?\nI am not a proponent of abortion as birth control or being used as an excuse to ignore reasonable precautions. Every abortion is a failure. Sometimes the reasons for the abortion arise from natural circumstances beyond the control of the woman, her doctor, her husband or companion. The cases I cited: two in which the Catholic Church penalized individuals who acceded to an abortion where the life of the mother was in stake and one in Ireland where Catholic doctors enforced anti-abortion laws and the mother died – as the doctors knew she would.\nSince you seem conversant with the figures, how many women received health related services from PP WHO WERE NOT PREGNANT. That would certainly include health screenings and contraception. I believe the number would be far, far in excess of those who were pregnant. And if PP were a single minded abortion organization, how did those who were pregnant escape its clutches with their pregnancy intact? Could be that PP helped the women carry to term? Do you know? Your statement indicates that many women received pre-natal care. Where those women go if PP were defunded?\nBy the way, do you believe contraception other than the rhythm method is immoral? Do you believe all the women who sought contraception aid from PP were immoral? Do you believe that all the women who received cancer screenings and or health assistance were immoral?\nDo you believe that a doctor who refuses to perform an abortion knowing that the woman would die acted morally?\nDo you believe that your morality should be enforced on women and doctors  by the criminal code?\nAre you married Andy? Do you have a wife? Have you ever comforted a wife through a difficult pregnancy? Have you ever told a wife, you are going to have to die because of my/our religious beliefs?\nSince you seek to enforce your religious beliefs through the civil and criminal law on others, these are relevant questions. \nI see that in response to the furor over the female ordination controversy a single male who was a member of Opus Dei who had taken a vow of celibacy. Don’t you find that a little weird? I do. If a single male can handle celibacy, his place would probably be with the celibate clergy – either brother or priest.\nBy the way, I have never advised a woman to have an abortion. And my advice has been asked. The circumstances are private.\nI expect that a large number of individuals who accept the authenticity of the Shroud or at least find it reasonable are “Right to Life” adherents who oppose abortions under all circumstances. That is their choice. When it comes to appropriate civil and criminal law in a pluralistic society, my choice is different.\n\n","date":"January 14, 2013 at 10:32 am","url":"https://shroudstory.com/2013/01/11/living-free-the-thomas-aquinas-and-pierre-teilhard-de-chardin-part/","cat":"uncategorized","id":"comment-21996","author":"John Klotz","site":"shroudstory"}]
