[{"title":"Max thinks I’m a half-blind arch-skeptic","post":"OK, So I found all three cats, and I didn’t know where to start searching for them. Picture are in technicolour, and it would be a lot more difficult to find them in monochromatic.  I know where the eyes are on the Shroud image, so I know where to look, but most of the images we see are monochromatic. No matter how hard I try I cannot even persuade myself that there may be coins there. They may have been there once, but theycannot be seen now.  \nI think I have to stand by my remarks at posting headed Vincenzo Giovanni Guerrelo, #20, May 22, 7:50am. Also, see Theseus’ lines, W Shakespeare, “Midsummer Night’s Dream” Act V, Sc 1, lines 2-21, below: \n“… I never may believe\nThese antique fables, nor these fairy toys.\nLovers and madmen have such seething brains,\nSuch shaping fantasies, that apprehend\nMore than cool reason ever comprehends.\nThe lunatic, the lover and the poet\nAre of imagination all compact:\nOne sees more devils than vast hell can hold,\nThat is, the madman: the lover, all as frantic,\nSees Helen’s beauty in a brow of Egypt:\nThe poet’s eye, in fine frenzy rolling,\nDoth glance from heaven to earth, from earth to heaven;\nAnd as imagination bodies forth\nThe forms of things unknown, the poet’s pen\nTurns them to shapes and gives to airy nothing\nA local habitation and a name.\nSuch tricks hath strong imagination,\nThat if it would but apprehend some joy,\nIt comprehends some bringer of that joy;\nOr in the night, imagining some fear,\nHow easy is a bush supposed a bear!”\n\n","date":"May 24, 2013 at 5:05 am","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34573","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"Dan, thank you for publishing my slightly provocative response to your slightly provocative posting and other’s too final comments. BTW two pictures are missing here… where have they gone?\n To Dave: Are you trying to hide-and-seek behind W Shakespeare? BTW was it really Shakespeare who wrote those very lines you lavishly quote?  Are you dead sure?\n My reply: Many look, few see still many have certainties.(This is not Shakespeare)\n Re coins over eyes, you wrote: “No matter how hard I try I cannot even persuade myself that there may be coins there.” There are no coin there! Only their very partial tiny imprints . They can be seen only on enhanced digitized/digital authentic photographs. Which photograph(s) are you relying on? \n  If you’re are relying on a photograph from Mario’s website, bear in mind what I wrote on June 10, 2012 at 1:55 pm #6 reply:  \n  “BEWARE! What is presented on SST as “2002 Durante Shroud Face Photograph” is actually nothing but a detailed view of the 2002 Durante overall Shroud photograph. Many significant tiny details are lost. Anyway Mario is doing a great job with his website.”\n\n","date":"May 24, 2013 at 6:35 am","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34583","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"Additional comment to Dave post: How easy is Shakespeare supposed to have written those lines.\n\n","date":"May 24, 2013 at 6:37 am","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34584","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"Dave you also wrote: “OK, So I found all three cats, and I didn’t know where to start searching for them.”\nSo, next time, would you allow me to help you to know where to start searching for two Pilate coin obverse very partial tiny imprints, or wouldn’t you?\n\n","date":"May 24, 2013 at 6:44 am","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34587","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"Reminder for Dave: the Greek name for theatre – theatron – stems from theasthai, which means ‘to regard’ or ‘to look’. Theatron therefore is the ‘place from where you look’. Too bad you just don’t know where to start searching even within a space as narrow as that of the a  ‘Globe’.\n\n","date":"May 24, 2013 at 6:49 am","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34588","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"Very well written Max\n\n","date":"May 24, 2013 at 6:51 am","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34589","author":"Vincenzo Giovanni Ruello","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"Grazie mille Vincenzo.\n\n","date":"May 24, 2013 at 8:55 pm","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34688","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"Dave (again), you wrote: “OK, So I found all three cats”. How come, Dan published only 2 pictures out of the three I emailed him? Don’t you tell me you have been a victim of a the ‘I think I see’ syndrome too (besides the ‘I think I see nothing’ syndrome)…\n\n","date":"May 24, 2013 at 7:03 am","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34590","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"The controversy over the coins on the eyes is in my mind a distraction. You have I believe two overwhelming facts about the Shroud: the blood and the body image.  Frankly, my problem with the coins has to do with the body image. \nWe know, I can fairly state, that blood and the image are the esults of  two different processes. That i can readily understand. But the coins are metalic. Are there anyother parts of the body image that are man-made? Am I wrong to note that it appears to me that the identifiable parts of the image are all parts of the body.\nIf there were coins over the eyes what  ought to have resulted  is a blockage of the 1mage, not a part of it. \nThis doesn’t answer the question of whether there were coind on the eyes. It raises an issue of image formation. \nThe image appears to be primarily the biological body. Anything like a coin is an add-on. Add-ons exists on the Shroud, but are any part of the image non-biological  add-ons?\nI am going to say something now which may seem a little off message. Please no invective or insults in any response. If you need further definition of the question, let me know.\n\n","date":"May 24, 2013 at 7:32 am","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34595","author":"John Klotz","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"John, I do understand your viewpoint BUT it does seem you totally missed a comment of mine (see my December 11, 2012 post on this very blog):\n“3/Would not the Turin Shroud’s three up, one down twill-weave linen fabric have been far too coarse to resolve the average 1.5mm high letters on such a small coin?\nThe Shroud thread count is 38 lengthwise (warp) threads of 0.14mm in average diameter and 26 widthwise (weft) threads of 0.25mm in average diameter woven into a measured one-centimeter square of the shroud fabric6.\nThe 0.5cm Shroud body image resolution limit should not be mistaken for the 0.5mm Shroud blood imprint resolution limit that is also the visual resolution limit. Now – and contrary to the body image – it should be here emphasized that the intriguing faint and very tiny faint brown letter-grouping-like patterns on the right eye area do appear photographically positive like the blood stains on the linen cloth. If we apply the Occam razor principle (i.e. if we try to give the simplest explanation to account for sharply defined appearance of the very tiny impressions), in the light of a funeral custom, it might well be the kind of incomplete decal or tell-tale sign a coin manipulated with blood-stained fingertips and placed over the right eyelid of the deceased is expected to leave on the internal upper side of a shroud soaked with a watery solution and pressed to the face. This has been demonstrated by experiments [Rodante’s and Moroni’s]7 (see figure 6) and just bypasses the theoretical objection that the threads would be too large to show this type of faint brown tiny letters on the Shroud face image.”\nMost likely, the Pilate coin obverse partial tiny imprints are bloodstain patterns (see 2002 Durante digital authentic or second generation copy on paper of the Turin Shroud face). Their colour can vary from faint mauve/brown to mauve/carmin brown or mauve/red brown depending on the lighting.\nYes coins are metallic BUT….\n\n","date":"May 24, 2013 at 8:24 am","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34605","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"Very interesting. I think your explanation might work and it would be consistent with a separate process for the coins and the body image. It might also explain the very sketchy letters and image of the  coins.\nThat being said, I still think the most important thing are the blood stains and the body image which you  long ago recognized are two very different processes. We have no argument about that.\n\n","date":"May 24, 2013 at 6:30 pm","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34683","author":"John Klotz","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"Correction: Their colour can vary from faint mauve/brown to mauve/carmin brown or MAUVE/RED depending on the lighting.\n\n","date":"May 24, 2013 at 8:27 am","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34606","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"Shakespeare’s “Dream”: The play appears in the 1st & 2nd Quarto, and all four Folios. All attribute Shakespeare as the author. There are a few plays in the Shakespearean catalogue where it is evident that at least two authors had a hand, including for example Henry VIII. Few serious scholars subscribe to the various alternative authorship speculations that abound.  I was an active member of the Wellington Shakespeare Society some 15 years, when it arranged and commissioned the three major hangings in the new Globe Thestre in London under Sam Wannamaker. The hangings were prepared by various embroidery guilds throughout New Zealand. I was obliged to study the “Dream” several years ago as part of an English Lit course I was undertaking at the time, using the excellent text edited by Harold F Brooks, which has copious annotations. MSND was written about 1595-96, evidently intended as part of a wedding entertainment. A recurring theme throughout the play is the contrasts between reality and illusion, between perception and objectivity. It is specifically covered in the essay I previously mentioned: “A Bush or a Bear?” by Cory Akin found at: http://www.nwc.cc.wy.us/waw/essays/Essay54.pdf This theme is neatly summarised in the Theseus lines I quoted.\nI saw a relevant connection with the very many discussions arising on pareidolia controversies on this site. \nCats: Dan may only have posted two pictures, but I quite quickly saw at least three cats. If I persist in looking more closely, I can see even more of them. If in fact there are only two real cats in the two pictures, then I think that reinforces some of the points I was attempting to make in this whole discussion.\n\n","date":"May 24, 2013 at 8:40 am","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34608","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"Dave you wrote: “Dan may only have posted two pictures, but I quite quickly saw at least three cats”. The TRUE fact is there is REALLY only ONE CAT per picture. That’s says it all….\nBy the way I am also “le Président d’une association pour la création théatrale à Nantes” called “Pour en Finir” after the title of a play by Bukowski… I also studied “Shakespeare”’s “”Latewinter Days’s Dave Dream” and… “Much Ado About I Think I See Nothing But”…\n\n","date":"May 24, 2013 at 9:15 am","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34610","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"Actually, I am not even sure you have correctly identify the cat each time….\n\n","date":"May 24, 2013 at 9:45 am","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34616","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"Check the answers to “gatos escondidos en imagenes”.\n\n","date":"May 24, 2013 at 9:50 am","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34618","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"Typo: Dave’s Latewinter Days’ Dream\n\n","date":"May 24, 2013 at 9:17 am","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34612","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"I’m unaware of the two plays Max mentions, perhaps he has not quoted the titles correctly. However I did also study Samuel Becket’s “Waiting for G.o.d.ot” where nothing happens twice. The heavily burdened ‘Lucky’ arrives but apparently remains unrecognised. Illusion and reality again! \n“Actually, I am not even sure you have correctly identify the cat each time….” Further reinforcement of the points I was making!\n\n","date":"May 24, 2013 at 4:30 pm","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34664","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"SOMEthing  actually did happen in Act One: you were the victim of BOTH  falsely positive AND/OR negative perceptions as far as a hidden cat in full view was concerned… and it did happen once and twice, thrice in all I had not to wait to long for you to flunk the test).\nBTW did you check out each perceptive test solution (see: gato escondido en imagenes)?\n\n","date":"May 24, 2013 at 5:07 pm","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34671","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"“G.o.d.ot: “… nothing happens twice …” – open to two possible interpretations. Illusion and reality again. The third Act is a mirror of the first Act. Nothing happens in both Acts.\n\n","date":"May 24, 2013 at 4:35 pm","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34665","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"See above (with correction: “(actually) and it did happen once and twice, thrice in all. I had not to wait to long for you too ‘brilliantly’ flunk the test.\n\n","date":"May 24, 2013 at 5:10 pm","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34674","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"But you would say that, regardless! There are cats everywhere in the second picture. Anyhow I’m in good company. Even our cricketers have an uncanny ability to snatch defeat from the jaws of victory!\n\n","date":"May 24, 2013 at 6:18 pm","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34681","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"I cannot help thinking you’re indulging in sarcastic replies just not to acknowledge the fact you do have a blind spot (like most people actually) in your eye-and -brain coordination system.\n\n","date":"May 24, 2013 at 8:16 pm","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34687","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"Reminder: A truly honest Shroud scholar and/or researcher must search for both favourable and disfavourable evidence as a fair survey of both sides of the issue whatever which side the coin may finally fall on.\n\n","date":"May 24, 2013 at 9:42 pm","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34691","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"Typo: whichever\n\n","date":"May 24, 2013 at 9:47 pm","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34692","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"I attempted the retort reminiscent, the retort perceptive, the retort rational, and the retort jocose. When none of these worked, I can assure you that I still spared you the retort sarcastic!\n\n","date":"May 25, 2013 at 4:24 am","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34704","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"I Give you the least word for it.\n\n","date":"May 25, 2013 at 7:17 am","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34713","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"2John Klotz re coins and image.\nYou unconciously progect the image formation as a photography or X-rays where metallic obgects and body tissue will behave differnetly adn tissue will be obliterated by the metal image.\nHowever, the image formation might not involve those types of the rays – in ultrasound image or MRI the waveforms behave differently. If the process of image formation involves some kind of waveform refraction, it might not be behaving the way we see it in the X-rays.\nI do not necesaily see any coins but I would not exclude the possibility 100% just on the premise of obliteration of the image\n\n","date":"May 24, 2013 at 9:23 am","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34613","author":"jesterof","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"Jesterof, the Pilate coin partial tiny images are not obliterated. They still can be found on 1931 Enrie’s, 1978 Miller’s and 2002 Durante’s digitized/digital authentic and second generation copies of the Shroud face (not on the corresponding overall photographs).\n\n","date":"May 24, 2013 at 9:39 am","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34615","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"Max, the objection from John is not that Pilate coin is obliterated but that the coin itself should obliterate the image formation and it did not.\nSo I just explained that not every waveform ( if the image formation is connected to the waveforms) will be impaired by the metal coin\n\n","date":"May 24, 2013 at 9:53 am","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34620","author":"jesterof","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"Ok jesterof. However I am still not sure exactly what yo mean by “image”. Reminder there are 4 different types of images involved on the orbital areas: body, blood,non-body and bloody non-body images.\n\n","date":"May 24, 2013 at 10:50 am","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34627","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"Typo: non-bloody non-body and bloody non-body images.\n\n","date":"May 24, 2013 at 10:58 am","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34632","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"Dr Dan I have processed the right eye and a Roman coin with a face in the middle has been revealed. This can easliy be verified by finding a Roman coin with these outer markings and middle face impressions","date":"May 24, 2013 at 11:57 am","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34637","author":"Vincenzo Giovanni Ruello","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"Vincenzo, you have to be extra-careful when it comes to identify partial faint tiny coin features especially when recurring to this very low definition image processing technique that is far from being appropriate for detection, extraction and identification in terms of accurate location, colour, shape and numismatic distribution. Visions and semblances can very easily take over. Best.\n\n","date":"May 24, 2013 at 4:53 pm","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34669","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"Max all I can identify is the round circular shape with pattern edges and a face in the centre. We now need a numismatic expert to try and reveal this coin\n\n","date":"May 24, 2013 at 10:28 pm","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34695","author":"Vincenzo Giovanni Ruello","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"Since not everyone can see the supposed coins on the eyes, you’d have to come up with an objective way to measure values that would prove this.  I cannot imagine how this would be done, but while I cannot see the coins on the eyes, one certainly cannot use Enrie’s photos since they do not show what is really there but are enhanced and actually lose image information in the enhancement.\n\n","date":"May 24, 2013 at 5:09 pm","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34673","author":"Andy Weiss","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"Reminder for  Andy, orthochromatic photographs were used as late as the 1980s for scientific research.\nBesides, you totally missed my point: RAKING LIGHT is a must along with amplification in terms of contrast in order to decode latent or half latent images. Most obviously  you are neither a computer science expert nor a professional orthophotographer or a criminologist or a cryptologist with ancient graffitis as one of your specialities…\n\n","date":"May 24, 2013 at 5:19 pm","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34675","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"Typo: a forensic computer science expert\n\n","date":"May 24, 2013 at 9:20 pm","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34690","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"Ever heard of the Lucus software program?\n\n","date":"May 24, 2013 at 5:24 pm","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34677","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"Dr Dan,its definitley a coin have done an extreme close up maybe Jewish not Roman","date":"May 25, 2013 at 12:20 am","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34697","author":"Vincenzo Giovanni Ruello","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"Vincenzo, the very lack of clarity and resolution here actually forbids to scientifically or archaeologically reach any conclusive identification whatsoever (coin, potshard, petal-less flower head etc)\n\n","date":"May 25, 2013 at 7:34 am","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34718","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"No Max it may not have resolution but it has enough features to say it is a coin, and PS: Have commenced to process the left eye and it is virtually identical to this one,will place clip up of left eye asap\n\n","date":"May 25, 2013 at 11:00 am","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34741","author":"Vincenzo Giovanni Ruello","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"Max if its not a coin it is a carved piece of stone with a face in the centre\n\n","date":"May 25, 2013 at 11:01 am","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34742","author":"Vincenzo Giovanni Ruello","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"Vincenzo, although I do agree,  originally coins were placed over the TS man’s eyes, I very much doubt your angular image processing is the best way to scientifically and archaeologically demonstrate they are really there as identifiable coins.\n\n","date":"May 25, 2013 at 12:45 pm","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34757","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"Vincenzo, I do hope you’ll prove me wrong.\n\n","date":"May 25, 2013 at 12:48 pm","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34758","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"Max at this stage I would have to say that my latest image of the object on the eye is the best image ever seen of this object and am sure it will assist many experts.\n\n","date":"May 25, 2013 at 9:51 pm","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34826","author":"Vincenzo Giovanni Ruello","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"The number 12 at bottom of the coin is seen and there is another number next to it.\n\n","date":"May 26, 2013 at 1:16 am","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34845","author":"Vincenzo Giovanni Ruello","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"Vincenzo, just beware of pareidoliae… we do have to get out of BOTH falsely positive and falsely negative perceptions and finally see ‘the real things’ as far as faint tiny partial coin imprints are concerned ..\n\n","date":"May 26, 2013 at 1:41 pm","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34889","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"Max, I have just processed a stage 3 of the right eye,you can see it kindly placed up by Dr Dan on the other article abut conspiracy Vincenzo Giovanni Ruello. I never believed in the coin theory till now.\n\n","date":"May 26, 2013 at 10:22 pm","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-34988","author":"Vincenzo Giovanni Ruello","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"Andy you wrote: “Since not everyone can see the supposed coins on the eyes, you’d have to come up with an objective way to measure values that would prove this. I cannot imagine how this would be done.”\nA traditional algorithmic approach (e.g. via Lucus software program), an original eidomatic-numismatic reading-grid based on (archaeological) bloodstain pattern analysis and a digital attempt at faithfully reconstructing each time a Pilate coin type (from the faint intriguing bloodstain-like patterns on the suspected area) can do the job all right.\n\n","date":"May 27, 2013 at 2:04 pm","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-35036","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"Typo: tiny partial Pilate coin imprints (1,5mm high in average).\n\n","date":"May 27, 2013 at 6:32 pm","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-35055","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"Dr Dan your afraid to show the clip with the face processed from the coin ? please let people see it\n\n","date":"May 28, 2013 at 9:45 am","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-35115","author":"Vincenzo Giovanni Ruello","site":"shroudstory"},{"title":"Max thinks I’m a half-blind arch-skeptic","post":"No. I’m not going to continue acting as a link farm for what I think are never ending senseless videos. Send me some evidence that your methods are valid. I can’t imagine anything less than agreement from a couple of real university, corporate or government scientists that your method is scientifically valid. This matter is closed until then.\n\n","date":"May 28, 2013 at 6:48 pm","url":"https://shroudstory.com/2013/05/24/max-thinks-im-a-half-blind-arch-skeptic/","cat":"news_&_views","id":"comment-35148","author":"Dan","site":"shroudstory"}]
