[{"title":"Mean and Picayune","post":"I’m rougher on high school students who need to learn to write scientifically. This paper is very unscientific and thus works against Jackson’s hypothesis. The topics are interesting so keep them coming.\n\n","date":"February 7, 2013 at 7:44 am","url":"https://shroudstory.com/2013/02/07/mean-and-picayune/","cat":"news_&_views","id":"comment-23677","author":"Paulette","site":"shroudstory"},{"title":"Mean and Picayune","post":"I’m personally fascinated by the vast unknowns in our own studies about the Holy Shroud …\nAFM based (chemical and mechanical) properties mapping technique can be the useful ways to open the doors.\nWhat is your idea ?\n Regards,\nPiero\n\n","date":"February 8, 2013 at 9:59 am","url":"https://shroudstory.com/2013/02/07/mean-and-picayune/","cat":"news_&_views","id":"comment-23773","author":"Piero","site":"shroudstory"},{"title":"Mean and Picayune","post":"Dan wrote: “…the paper was written by two good people with the best of intentions.”\nREALLY?  Wow…  I disagree completely with that notion.  Just like the paper written in 2010 by Fanti, Di Lazzaro, Heimburger and some other members of the SSG, this paper written by the Colorado team is obviously an attempt to back-up their own little hypothesis concerning the image formation.  To me, this is as obvious as the nose in anyone’s face.\nNote: concerning the paper written in 2010 by Fanti et al., it’s important to note that Thibault Heimburger, on the contrary to Fanti and Di Lazzaro, had not a personal hypothesis to promote and defend at all cost.  Nevertheless, he put his name on that paper and to me, that was a big mistake on his part.  Of course, this is just my personal opinion.\n\n","date":"February 7, 2013 at 9:31 am","url":"https://shroudstory.com/2013/02/07/mean-and-picayune/","cat":"news_&_views","id":"comment-23685","author":"Yannick Clément","site":"shroudstory"},{"title":"Mean and Picayune","post":"A paper which dares to call itself “A critical review …” of anything should itself be beyond reproach,  Careful writing and editing needed to be exercised by its authors.  Its title invites adverse comment, if its authors fail to come up to the standard implied by such a title.\n\n","date":"February 7, 2013 at 3:36 pm","url":"https://shroudstory.com/2013/02/07/mean-and-picayune/","cat":"news_&_views","id":"comment-23708","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Mean and Picayune","post":"Last year I read (on nanotechweb.org) the following title :\n“Probing delicate samples: stiff AFM mechanics at soft forces” See\n: http://nanotechweb.org/cws/article/lab/48521 And then the\ninteresting words for the useful research about the ancient linen\nfibrils (coming from the samples taken in the past from the Holy\nShroud) were : >Atomic force microscopy (AFM) measurements\nof nanoscale mechanical properties can require relatively large\nforces to probe elastically stiff materials such as metals or\nceramics. Such forces are potentially damaging, particularly to\nthin or delicate samples. >Recently, researchers have\ndemonstrated a solution to this dilemma. >The new method\nenables AFM measurements of elastic modulus with forces less than\n20 nN, roughly 10 times the force needed to break a single atomic\nbond. >Researchers Jason Killgore and Donna Hurley at the\nNational Institute of Standards and Technology in Boulder, US,\nachieved these results using an AFM technique called contact\nresonance spectroscopy So … Bulder is located in Colorado … Am\nI right or not ? I tried to see under the address :\nhttp://en.wikipedia.org/wiki/National_Institute_of_Standards_and_Technology\nbut there is not a great amout of informations. In any case this\ntechnique was the point where the concrete hope to know the truth\nabout the linen fibrils of the Holy Shroud can start. And now\n(perhaps) there are the interesting improvements for this way. —\n— What is your opinion ? Have you tried to look ? — —\nRegards, Piero P. S. Instead, in the case of the Jospice Imprint\n(Liverpool Man : http://www.shroud.com/pdfs/mattress.pdf = “The\nJospice mattress cover image”, by Dr. Fred Zugibe) the outside\ncoating was polyurethane, because the manufacturers indicated that\nthe nylon was nylon 6 and that the outside coating was polyurethane\n… So I tried to search something of interest and then I think\nthat under the address :\nhttp://www.sciencedirect.com/science/article/pii/S001430571000340X\nYou can find the following study : Quantitative mapping of elastic\nmoduli at the nanoscale in phase separated polyurethanes by AFM\nEuropean Polymer Journal Volume 47, Issue 4, April 2011, Pages\n692–698 >Nanoscale mechanical properties of segmented\npolyurethanes have been investigated by two novel dynamic imaging\nmodes of AFM. Varying stoichiometric ratio of isocyanate and\nhydroxyl groups resulted in polyurethanes samples with\ncharacteristic fingerprint AFM phase images. AFM resolves the\nelastic moduli of stiff and soft segments of the phase separated\npolyurethane samples at nanoscale resolution. >Mechanical\nmappings were in excellent agreement for both modes, opening novel\navenues for nanoscale mechanical characterization of heterogeneous\npolymers. > The PU samples studied show characteristic\n“fingerprint” AFM phase images. >Novel dynamic imaging modes\nof AFM, including HarmoniX material mapping and Peak Force Tapping\nwere used to assess the mechanical performance of phase separated\npolyurethanes quantitatively as a function of their molecular\nstructure. >The values of surface elastic moduli were\ndetermined with nanoscale resolution and were in excellent\nagreement for both AFM modes. >While tensile testing\nprovides a bulk average value for the elastic modulus of the\nelastomers, the novel AFM based elastic moduli mappings introduced\nenable the study of surface stiffness with nanoscale resolution in\na quantitative way. I hope that you can find an answer for these\nlong gossiping (or boring ?) technical (= Applied AFM on linen,\n“ghosts” and Jospice Imprint) notes (without measurements or\nexperiments !). PI\n\n","date":"February 8, 2013 at 10:28 am","url":"https://shroudstory.com/2013/02/07/mean-and-picayune/","cat":"news_&_views","id":"comment-23779","author":"Piero","site":"shroudstory"},{"title":"Mean and Picayune","post":"I have found the following title : MML Publishes “How To”\nGuide for AFM-Based Nanomechanics under the address :\nhttp://www.nist.gov/mml/acmd/afm_based_nanomechanics_bookchapter.cfm\n>Publication information is as follows: “Contact Resonance\nForce Microscopy Techniques for Nanomechanical Measurements,” D. C.\nHurley, in Applied Scanning Probe Methods Vol. XI, eds. B. Bhushan\nand H. Fuchs (Springer-Verlag, Berlin Heidelberg New York, 2009),\nChapter 5, pp. 97-138. The original publication is available at\nhttp://www.springerlink.com. (Date created : February 9, 2009 |\nLast updated: October 2, 2012) — — — Regards, Piero and the\naddress was the following : Material Measurement Laboratory (MML)\nMaterials Reliability Division 325 Broadway, MS 853 Boulder, CO\n80305-3328 http://www.nist.gov/mml/ >The Material\nMeasurement Laboratory (MML) serves as the national reference\nlaboratory for measurements in the chemical, biological and\nmaterial sciences through activities ranging from fundamental and\napplied research, to the development and dissemination of certified\nreference materials, critically evaluated data, and other programs\nand tools to assure the quality of measurement results. MML is also\nresponsible for coordinating the NIST-wide Standard Reference\nMaterial and Standard Reference Data programs — — I have read\nthat : >The Material Measurement Lab has more than 900 staff\nmembers and visiting scientists, an annual budget of more than $160\nmillion, and serves as the nation’s reference laboratory for\nmeasurements in the chemical, biological and materials sciences\nthrough activities ranging from fundamental research in the\ncomposition, structure and properties of industrial, biological,\nand environmental materials and processes, to the development and\ndissemination of certified reference materials, critically\nevaluated data and other measurement quality assurance programs …\n—- —- Unfortunately in the interesting paper written by the\nColorado team there is not the word “AFM” … Then, see under the\naddress :\nhttps://www.fbo.gov/index?s=opportunity&mode=form&id=2d71e63be27052a2a76409e051de7578&tab=core&_cview=0\nAsylum AFM, Model MFP-3D Retrofit Upgrade Jan 18, 2013 5:23 pm\n>The Department of Commerce, National Institute of Standards\nand Technology (NIST), intends to negotiate a firm-fixed price\npurchase order, on a sole source basis, with Asylum Research\nCorporation, Santa Barbara, CA for the purchase of an Atomic Force\nMicroscope (AFM), model MFP-3D upgrade to allow top down optics for\nimaging opaque samples under other than full and open competition.\n… … >Asylum Research Corporation holds the proprietary\nrights to the specialized hardware and software components of the\nAtomic Force Microscope (AFM), model MFP-3D system. … … — —\nIf the scientists were able to do something on Mars (also using the\nAFM), then they have to be able to control the Holy Shroud using\nthe advanced microscopy. What is your answer ? Have you a Project ?\nDo you know the AFM instruments ? — — — PI\n\n","date":"February 8, 2013 at 10:53 am","url":"https://shroudstory.com/2013/02/07/mean-and-picayune/","cat":"news_&_views","id":"comment-23783","author":"Piero","site":"shroudstory"}]
