[{"title":"Medjugorje and the Shroud and What Mark Shea Wrote","post":"1. Wrist nailing:  The only scriptural source we have for Christ being nailed to the cross, as against having his arms tied to the cross-beam can be found in John ch 20.  This is the post-resurrection story about Doubting Thomas.  There appears to be no other gospel reference. Possibly other references might be found in prophetic utterances under Isaiah.  Thomas’s statement and Jesus’ response are respectively:  “Unless I can see the holes that the nails made in his hands and can put my finger into the holes they made, and unless I can put my hand into his side, I refuse to believe. … ”  “Put your finger here; look, here are my hands.  Give me your hand; put it into my side. … ”  Jn 20:25-27.\nThe Greek word (transliterated) used here for “hand(s)” is ‘kefir’s, lit hand.  Ian Wilson makes the point that the word also includes the wrist.  We see an example of this in Acts 12:7, when Peter escapes from prison.  “and all the chains fell off his wrists”.  The same word ‘kefir’s is used.  The four major reputable English translations of John 20, all use the word hand.  However at Acts 12:7, three of them use wrist, and only the New Revised American Bible use hand at Acts 12:7.  The three that translate ‘kefir’s as wrists at Acts 12:7 are: NRSV, Revised English, New Jerusalem.\nSomebody may be able to check a copy of the Latin Vulgate, and I would speculate that Jerome translated the Greek as “manus” rather than “carpus”.  Consequently generations of artists have shown portrayals of the crucifixion with nails through the palms of the hands rather than the wrists. \n2.  Height of Jesus:  Forensic pathologist Kelly Kearse has recently debunked the myth that 1st c Palestinian men were only 5’-0″ tall, she has an earlier posting on this site covering this matter. \n3: Stigmatists:  It seems that stigmatists generally receive the marks of the crucifixion wounds, in those parts of the body where they personally believed they occurred at Christ’s crucifixion.  Regardless of whether the stigmata are authentic or not, it seems that there are also some psychological elements at work.  It cannot be assumed that Christ’s actual wounds are necessarily the same as those shown on stigmatists.\n\n","date":"May 21, 2012 at 8:11 am","url":"https://shroudstory.com/2012/05/21/medjugorje-and-the-shroud-and-what-mark-shea-wrote/","cat":"news_&_views","id":"comment-11489","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Medjugorje and the Shroud and What Mark Shea Wrote","post":"David,\nWhat a lucid analysis of biblical exegesis  on hands and wrists.  I hope someone can answer the question about St. Jerome’s translation. That is a fascinating hypothesis. While I am clearly a Vatican II Catholic, I have my problems with  modern translations. Two for example: “No room at the Inn” becoming “No room at the place where travelers lodge” and the “eleventh hour” becoming “late in the afternoon.”\n\n","date":"May 21, 2012 at 8:29 am","url":"https://shroudstory.com/2012/05/21/medjugorje-and-the-shroud-and-what-mark-shea-wrote/","cat":"news_&_views","id":"comment-11490","author":"John Klotz","site":"shroudstory"},{"title":"Medjugorje and the Shroud and What Mark Shea Wrote","post":"Okay, I couldn’t let it go. In about 10 seconds, I found a Douy Rheiems-King James- Latin Vulgate side by side exposition of the Bible.\nThe key passage in John 20 in the Vulgate is:\n“deinde dicit Thomae infer digitum tuum huc et vide manus meas et adfer manum tuam et mitte in latus meum et noli esse incredulus sed fidelis”\nDavid’s hypothesis that is was all St. Jerome’s fault is on the money.\n\n","date":"May 21, 2012 at 8:38 am","url":"https://shroudstory.com/2012/05/21/medjugorje-and-the-shroud-and-what-mark-shea-wrote/","cat":"news_&_views","id":"comment-11491","author":"John Klotz","site":"shroudstory"},{"title":"Medjugorje and the Shroud and What Mark Shea Wrote","post":"The Koine Greek/ Hebrew word for hands (Sorry the word escapes me right now) could have implied hands, wrist or forearm. The Shroud shows only the back of the hand, wrist and  forearm….I have argued on here before that we have absolutely no idea where the nail was implanted on the other side. So it may have been driven into the lower part of the palm, which to the early writers since they had no word for that specific part of the hand, they would use the generic word,…case still open.\nThe whole height thing is a joke, people obviously do no studying before making remarks such as Jesus was 6 feet tall, lol. It has been shown by our scientists best efforts that the man on the Shroud was 175cm +/- 2cm, making him 5’8″ to 5′ 11″ tall…Normal height for a Semitic male of the first century. Romans on the other hand were on average 5’6″ tall. These figures also come from many, many archeological finds and studies.\nAs for the stigmata, I’ll go with Dave’s #3 point.\nR\n\n","date":"May 21, 2012 at 4:25 pm","url":"https://shroudstory.com/2012/05/21/medjugorje-and-the-shroud-and-what-mark-shea-wrote/","cat":"news_&_views","id":"comment-11505","author":"Ron","site":"shroudstory"},{"title":"Medjugorje and the Shroud and What Mark Shea Wrote","post":"Thanks for that John, I’ve been wondering about this since last Easter, after I had chased up our local scholar priest who looked into the matter for me and provided the information I’ve shown above.  I thought I might be able to track it down in an old Latin missal I had, but the closest I came was the Communion verse:  “Mitte manum tuam, et cognosce loca clavorum …” ‘Place of the nails’ the Latin liturgist was hedging his bets. \nIan Wilson in his 1978 book, cites one other known case of wrist nailing.  They’re apparently hard to find as the Roman soldiers usually recovered the nails of crucifixion victims as they were highly prized as medical talismans, but in poor old Jehohonan’s case a nail.had bent and jammed in the bone.\n\n","date":"May 21, 2012 at 4:54 pm","url":"https://shroudstory.com/2012/05/21/medjugorje-and-the-shroud-and-what-mark-shea-wrote/","cat":"news_&_views","id":"comment-11508","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Medjugorje and the Shroud and What Mark Shea Wrote","post":"A knowledgable Roman soldier if he knew about the carpal bones, and knew he could get the correct placing on one side would surely strive to get the correct placing on the other arm.  Wrist nailing experiments on cadavers and amputated arms cited by Wilson, result in thumb flexure.  No thumbs are visible on the Shroud image for both arms!  A fair bet that both arms were wrist nailed!\n\n","date":"May 21, 2012 at 5:02 pm","url":"https://shroudstory.com/2012/05/21/medjugorje-and-the-shroud-and-what-mark-shea-wrote/","cat":"news_&_views","id":"comment-11509","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Medjugorje and the Shroud and What Mark Shea Wrote","post":"Yes, I agree, bravo daveb!\nThe Vulgate in e-Sword provides the following: Acts 12:7 is manibus & John’s passage is as follows:\nJoh 20:25  dixerunt ergo ei alii discipuli vidimus Dominum ille autem dixit eis nisi videro in manibus eius figuram clavorum et mittam digitum meum in locum clavorum et mittam manum meam in latus eius non credam\nJoh 20:26  et post dies octo iterum erant discipuli eius intus et Thomas cum eis venit Iesus ianuis clausis et stetit in medio et dixit pax vobis\nJoh 20:27  deinde dicit Thomae infer digitum tuum huc et vide manus meas et adfer manum tuam et mitte in latus meum et noli esse incredulus sed fidelis \nThe nails in the wrists not agreeing with sigmatist’s wounds has nothing to do with the issue, unless of course you believe the stigmata is intended to be an exact representation of the wounds of Christ.  I would reject that interpretation as nonsensical.  Otherwise they would have wounds at the base of the palm into the wrist on the back.  Yet the Greeks considered the entire thing the wrist.  Where’s the difficulty understanding that?\n\n","date":"May 21, 2012 at 8:06 pm","url":"https://shroudstory.com/2012/05/21/medjugorje-and-the-shroud-and-what-mark-shea-wrote/","cat":"news_&_views","id":"comment-11526","author":"Andy Weiss","site":"shroudstory"},{"title":"Medjugorje and the Shroud and What Mark Shea Wrote","post":"As far as Mr. Shea poo-pooing the Međugorje apparitions, is he aware the Communists were actually instrumental in spreading deceit and lies concerning this?  This would speak volumes for me about the event.\n\n","date":"May 21, 2012 at 8:10 pm","url":"https://shroudstory.com/2012/05/21/medjugorje-and-the-shroud-and-what-mark-shea-wrote/","cat":"news_&_views","id":"comment-11527","author":"Andy Weiss","site":"shroudstory"}]
