[{"title":"Merry Christmas Everyone","post":"What a wonderful Christmas present, one of the most beautiful Nativity scenes I’ve seen.  Thanks Dan.  It has dawned a beautiful summer Christmas morning here in Wellington – our native Christmas tree, the pohutukawa, a myrtle species, is in full bloom with brilliant red flowers, with many lining our streets and avenues.  We gave midnight Mass a miss this year and opted for the Children’s vigil service instead – the children put on a lovely Christmas pageant, well narrated by the seniors supplemented by congregation cue cards, shepherds and angels everywhere, with three kings on cardboard cut-out camels travelling to Bethlehem, to see the one-week old baby Jesus cradled by Mary, a packed church. with overflow into the foyer, side-chapel and choir loft.  Having been a Christmas present for my own mother, I now enter my 74th year.\n\n","date":"December 24, 2012 at 3:24 pm","url":"https://shroudstory.com/2012/12/24/merry-christmas-everyone/","cat":"news_&_views","id":"comment-21073","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Merry Christmas Everyone","post":"Ok tell me this why on the shroud of turin is jesus left side seem to be the mark of the spear? For 2000 yrs its been on right side!\n\n","date":"December 25, 2012 at 10:33 pm","url":"https://shroudstory.com/2012/12/24/merry-christmas-everyone/","cat":"news_&_views","id":"comment-21110","author":"michael","site":"shroudstory"},{"title":"Merry Christmas Everyone","post":"The scriptural reference for the wound in the side is the gospel of John 19:34.  However John does not say on what side the wound was given.  There are several references in the early Fathers of the Church establishing a tradition that the wound was given on the right side, and this is precisely what analysis of the Shroud image shows. \nNow, the Shroud itself acts as a mirror.  Imagine yourself holding up say a bed-blanket by its corners, and imagine that your bodily image is projected onto the blanket on the side facing you.  This is roughly the way that a Shroud would be draped over a human body. Your right-hand side will be projected onto the.left side of the blanket image. and vice-versa your left-hand side will be projected onto the right side of the blanket, just as looking in a mirror.  On the original Shroud cloth the wound certainly appears to be on the left hand side because of this.  But you need to view it on one of the several photographic negative images to reorient it to the correct view, when the image will then appear correctly on the right-hand side.  Similarly on the Shroud cloth, the right foot appears to be crossed over the left, when in actual fact, the left foot crosses over the right and is therefore in front, also as shown on the Shroud negative photographs. \nThere is quite a lot that can be said about the wound in the side, and forensic pathologist Dr Pierre Barbet conducted several investigations into the various wounds, examining the negative photographs and experimenting with recently dead cadavers and amputated limbs during the 1930s.  His book “A Doctor at Calvary” published in the 1950s is a classic in Shroud forensic literature.  \nHe considers that the cross could not be more than about six foot high as both the crucifixion and the blow itself had to be given by foot soldiers in the execution squad.  The blow itself was not part of the actual execution, but was a legal requirement to establish the fact of death before delivering the body to relatives.  The blow itself seems to have been given by the Roman “lancea”, a long bladed spear, and the size of the wound matches the size of the lancea blade exactly, from various Roman military artifacts which have been recovered. \nDr Barbet discussed the details of the side wound in chapter 7 “The wound to the heart” of his book.  He considers that the blow was delivered above the sixth rib, obliquely but almost horizontally, and the soldier would be seeking to pierce the right auricle of the heart which is always filled with blood.  The water described in John 19:34 is pericardial fluid which would have accumulated in a great amount from the trauma of crucifixion.  Barbet was also a classicist of some ability and is able to support his analysis by reference to considerable Roman military and other sources as well as by his forensic abilities. \nI hope these few notes might give you a better understanding of the various technicalities implicit in your question.\n\n","date":"December 26, 2012 at 4:22 am","url":"https://shroudstory.com/2012/12/24/merry-christmas-everyone/","cat":"news_&_views","id":"comment-21121","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Merry Christmas Everyone","post":"Concerning Christmas, I just want to remind people that it is the celebration of the Incarnation of God.  And because the Shroud can truly be seen (as I do) like the relic of the Incarnation of God (even before the relic of Jesus’ Passion and way before the relic of his Resurrection), I think there’s a great link that can be made between Christmas and the Shroud…\nFor me, these two moments (at the very beginning and at the very end of Jesus life on Earth), more than anything else, are the most revealing moments of who God really is and in both occasions, Jesus didn’t have to make a long speech!  His face during these two events was more telling than any discourse that he could have done about God. So, in this blessed time of year, I think it would be a good idea to look at the Shroud for a moment and meditate on God’s Incarnation in our human nature, which was, already at the moment of Jesus birth, a hidden sign that we were already all saved because of the infinite greatness of his Love for us!  \nIsn’t sad to noticed so many Christian who greatly neglect this most important aspect of the Christian faith (the Incarnation) while focussing almost only on Jesus’ teaching (many of them focussing much more on the scary parts of this teaching instead of the beautiful, tender and loving parts) and Resurrection ?!?  When I see how people generally see the Shroud and his image here on the blog, I’m truly surprise to see that the focus is almost entirely put on the Resurrection at the expense of the great sign (we can even say “proof”) of God’s incarnation we can detect in the Shroud’s image and bloodstains…  Each time I see the Shroud, I say to myself: The Incarnation of God is far from having been a joke like many Gnostic Christian have thought over the centuries !\n\n","date":"December 26, 2012 at 7:23 pm","url":"https://shroudstory.com/2012/12/24/merry-christmas-everyone/","cat":"news_&_views","id":"comment-21149","author":"Yannick Clément","site":"shroudstory"}]
