[{"title":"Merry Christmas","post":"Christmas is the Feast of the Incarnation of God in our humanity, which is, to me, the most hard-to-believe dogma of them all.  But I think we can see something of this on the Shroud, which can help our poor faith…\n\n","date":"December 24, 2013 at 6:47 pm","url":"https://shroudstory.com/2013/12/24/merry-christmas/","cat":"news_&_views","id":"comment-66926","author":"Anonymous","site":"shroudstory"},{"title":"Merry Christmas","post":"I really enjoy you card, one question, the young man right behind Holy Mary’s right arm appears to be wearing a hat with a large brim ??  I was not aware that they were being produced back in BC ??\n\n","date":"December 24, 2013 at 7:57 pm","url":"https://shroudstory.com/2013/12/24/merry-christmas/","cat":"news_&_views","id":"comment-66963","author":"Emmett McMahon","site":"shroudstory"},{"title":"Merry Christmas","post":"Emmett you’re thinking ultra-realism in representational art. Gerrit van Honthurst, 1590-1656; Utrecht, Dutch school, but followers of Caravagio. Several religious scenes, some time in Italy, also court of Charles I in England, but most of his time in Utrecht. Think 17th c Dutch shepherds, not 1st c. Judean. Best!\n\n","date":"December 24, 2013 at 8:53 pm","url":"https://shroudstory.com/2013/12/24/merry-christmas/","cat":"news_&_views","id":"comment-66981","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Merry Christmas","post":"Blessings to all this Christmas.\nEspecially our host Dan who never seems to sleep\n\n","date":"December 24, 2013 at 10:46 pm","url":"https://shroudstory.com/2013/12/24/merry-christmas/","cat":"news_&_views","id":"comment-67026","author":"Gerard","site":"shroudstory"},{"title":"Merry Christmas","post":"One never knows what a day might bring.  In an earlier posting, #16 under the header at “Did the Apostles notice …” I waxed lyrical on the family day we were all looking forward to, which would also mark a personal milestone. I fetched my daughter from the city, and my younger son and his wife arrived, all of us looking forward to a family Christmas meal, and exchanging our gifts.  However no sooner had they arrived, than they received word that my son’s mother-in-law was dying in Palmerston N hospital, some 100km north of here, a 2 hour drive. A van arrived to pick them up and whisk them away. Mercifully they arrived there while the lady was still conscious, and she died during the afternoon.  It is easy to forget that for some families, the season of good will and cheer, can sometimes mark a cause for grief.  Death does not sleep just because it’s Christmas. There will be a week of mourning and a funeral to work through, hopefully we may gather again soon during the New Year. We will exchange our joys and sorrows, and perhaps our hopes and plans for the year ahead.\n\n","date":"December 25, 2013 at 6:19 am","url":"https://shroudstory.com/2013/12/24/merry-christmas/","cat":"news_&_views","id":"comment-67276","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Merry Christmas","post":"One thing about the nativity is usually missed. A manger, in the Middle East, is a filthy place. I remember when I was young I refused to step into one because the ground was covered in animal excrement. I think one needs to see a manger in the middle east for himself to understand the depth of the humbleness of the Son of God. To choose a place like this to come to earth is beyond comprehension.\n\n","date":"December 25, 2013 at 10:34 am","url":"https://shroudstory.com/2013/12/24/merry-christmas/","cat":"news_&_views","id":"comment-67429","author":"Mike Morcous","site":"shroudstory"},{"title":"Merry Christmas","post":"Merry Christmas!\n\n","date":"December 25, 2013 at 12:37 pm","url":"https://shroudstory.com/2013/12/24/merry-christmas/","cat":"news_&_views","id":"comment-67539","author":"Andy Weiss","site":"shroudstory"},{"title":"Merry Christmas","post":"Merry Christmas\n\n","date":"December 25, 2013 at 3:35 pm","url":"https://shroudstory.com/2013/12/24/merry-christmas/","cat":"news_&_views","id":"comment-67664","author":"Paulette","site":"shroudstory"}]
