[{"title":"More about banding on the Shroud of Turin","post":"What’s the betting that Hugh’s pre-secondary (?) school pupils are not old enough to realize they have a scientific heavy-hitter as head of department.?\nSome of us are old enough to recall the days when UK science teachers had their own journal for reporting their original scientific research (Physics Review?).  Maybe they still do. It was ostensibly project-based for classes, but would have passed muster in any mainstream scientific journal.\nYou are a throw-back Hugh – in the nicest possible way.\n\n","date":"August 29, 2014 at 1:25 pm","url":"https://shroudstory.com/2014/08/29/more-about-banding-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-147137","author":"Colin Berry","site":"shroudstory"},{"title":"More about banding on the Shroud of Turin","post":"“Illusion” ? Hugh, if you leech, at least do it intelligently.\n\n","date":"August 29, 2014 at 3:08 pm","url":"https://shroudstory.com/2014/08/29/more-about-banding-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-147155","author":"anoxie","site":"shroudstory"},{"title":"More about banding on the Shroud of Turin","post":"What on earth does this mean?\n\n","date":"August 29, 2014 at 3:28 pm","url":"https://shroudstory.com/2014/08/29/more-about-banding-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-147157","author":"Hugh Farey","site":"shroudstory"},{"title":"More about banding on the Shroud of Turin","post":"Another problem of translation?\n\n","date":"August 29, 2014 at 4:10 pm","url":"https://shroudstory.com/2014/08/29/more-about-banding-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-147164","author":"anoxie","site":"shroudstory"},{"title":"More about banding on the Shroud of Turin","post":"Hugh, in your conclusion, I read:\n” So the light vertical\nareas defining the sides of the cheeks are really\npresent, but they are not as precise or as well\ndefined as they appear, and are not merely\nartifacts of the cloth, but real areas where the\nimage making process just didn’t happen.”\nI think you have just shown the contrary.\nCan you please explain me the steps of your reasoning by using the most simple English words as possible ?\nThank you.\n\n","date":"August 29, 2014 at 4:43 pm","url":"https://shroudstory.com/2014/08/29/more-about-banding-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-147172","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"More about banding on the Shroud of Turin","post":"It is difficult to convey, I understand. What I’m saying is that all the darker areas on the shroud are shaped entirely by whatever it was that made the image, and are not artifacts of the cloth. There are no clearly defined straight lines. However, where, by coincidence, the edge of a darker patch more or less coincides with a natural line in the cloth, usually one of the spines connecting two directions of herringbone ‘pitch’, then it appears to an observer that the area is defined by that line, especially when it is observed from a distance where the weave of the cloth is not itself clear. Thus the sides of the cheeks appear to be cut off by a clear vertical edge, when in fact they are not so well defined; they just appear so because of the weave. A photo tends to emphasise this effect, which would, I suspect, be much less obvious if the cloth itself could be inspected from different angles.\n\n","date":"August 29, 2014 at 5:35 pm","url":"https://shroudstory.com/2014/08/29/more-about-banding-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-147181","author":"Hugh Farey","site":"shroudstory"},{"title":"More about banding on the Shroud of Turin","post":"Sorry, Hugh, but this seems like ‘I think I see that I think I see.’ Let’s just say that I am skeptical here of your skepticism. But that is okay. Now I have something more to think about while I walk the dog and watch the alligators swimming in the lagoon on this beautiful South Carolina morning.\n\n","date":"August 30, 2014 at 7:22 am","url":"https://shroudstory.com/2014/08/29/more-about-banding-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-147305","author":"Dan","site":"shroudstory"},{"title":"More about banding on the Shroud of Turin","post":"Thank you Hugh for clarification.\n ” The face on the shroud has a ‘vertically aligned’ look, with sharply cut-off cheeks and vertically falling hair. The question is, are these light bands true representations of the model (dead body, bas relief,painting or whatever), or are they artifacts of the cloth, or of the photographs in which they appear?”\nThe banding problem is not some kind of “all or nothing”.\nThere are several kinds of bands on the Shroud. Here we are speaking of the alternated regular light and dark vertical bands.\nYou have shown that these bands are clearly connected to the herringbone weave of the fabric. I fully agree and some weeks ago I also discovered the same fact in the hands area.\nThe light bands on both sides of the TS man face are connected to the herringbone weave ( ‘pitch’) of the fabric.\n   “So the light vertical areas defining the sides of the cheeks are really present, but they are not as precise or as well defined as they appear, and are not merely artifacts of the cloth, but real areas where the image making process just didn’t happen.”\nHow can you conclude that in those areas “the image making process just didn’t happen.”\nSee:\nhttp://thierrycastex.blogspot.fr/2012/04/filtrage-dans-le-domaine-de-fourier.html\nand:\nhttp://thierrycastex.blogspot.fr/2012_05_01_archive.html\nand:\n\nThierry Castex is a true expert in imaging techniques.\nFrom Castex and your studies, one can conclude:\n1) there is an image in these light vertical areas.\n2) The light vertical bands are closely related to the herringbone weave\n3) If you exclude the effect of the weave, you obtain a much more realistic image.\nNow, the true question is: how can we explain the relationship between the herringbone weave and the image ?\n\n","date":"August 30, 2014 at 2:15 pm","url":"https://shroudstory.com/2014/08/29/more-about-banding-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-147364","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"More about banding on the Shroud of Turin","post":"Just tell me, this is a joke or you haven’t read the post: banding? Is it real?\n\n","date":"August 30, 2014 at 3:10 pm","url":"https://shroudstory.com/2014/08/29/more-about-banding-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-147375","author":"anoxie","site":"shroudstory"},{"title":"More about banding on the Shroud of Turin","post":"Thanks so much for posting the Castex link, which has explained much that I didn’t understand when anoxie simply posted some of his images. I think we are close to agreeing, except that I think the effect of the weave is apparent rather than actual, and perhaps would not be visible at all under different lighting conditions. That may be an answer to your ‘true question.’\n\n","date":"August 30, 2014 at 6:11 pm","url":"https://shroudstory.com/2014/08/29/more-about-banding-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-147410","author":"Hugh Farey","site":"shroudstory"},{"title":"More about banding on the Shroud of Turin","post":"“1- it’s a sharp, clear-cut edge\n2- the dark band on the face starts on a spike\n3- the zig zag pattern has an independent role on image perception (image – différence)\nSynchronisation ? Let’s have a break on banding and the “no sharp edge” claim of CB.”\nThird time.\nAnd i can’t resume the whole thread.\nI’ve largely mentionned these three point based on this image to explain why banding is real and not an illusion. \nI’ve suggested to Dan to insert at least this image in the post where he has promoted “a new paradigm”.\nhttps://shroudstory.com/2014/08/29/a-new-paradigm-for-banding/\nThis is a farce.\n\n","date":"August 31, 2014 at 2:07 am","url":"https://shroudstory.com/2014/08/29/more-about-banding-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-147478","author":"anoxie","site":"shroudstory"},{"title":"More about banding on the Shroud of Turin","post":"Hi Hugh,\nUnfortunately Shroud 2.0 app is only for those who have an Ipad etc. I do not understand why Shroud 2.0 is not available for Android and/or Windows !!\nHowever, my friend Sebastien sent me months ago some pictures from Shroud 2.0. I also have many HD pictures from HaltaDefinizioni, as well as Enrie, Durante, Barrie Shwortz and Flury-Lemberg photographs.\nIn all of them the “banding effect” is obvious.\nOf course, it is more or less marked, depending on the illumination. But it is there.\nBy “banding effect”, I mean: the fact that the alternation of light and dark vertical (and horizontal) bands impacts on the TS image density.\nYou wrote for example (in your PDF): ” We can now see a number of narrow vertical stripes, but the light and dark ‘bands’ do not extend into the hair”\nI disagree. The light and dark ‘bands’ do extend into the hair.\nMoreover there are also some horizontal bands which are clearly seen in some photographs that also impacts on the TS image density.\nThe banding effect is not an illusion.\nWhatever the imaging process,the TS image,as we see it, is the result of the interaction between the “template” (“dead body, bas relief, painting or whatever”) and the cloth.\nI strongly suspect that the “banding effect” is one of the keys of the understanding of the TS image.\nHowever, I have no time enough to study it in depth for the moment. I have to write my third and last PDF about the “scorch hypothesis” and much more.\nIf Hugh or anybody else wants to contact me for more information, just send me an email ( just ask Dan if necessary).\n\n","date":"August 31, 2014 at 2:57 pm","url":"https://shroudstory.com/2014/08/29/more-about-banding-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-147577","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"More about banding on the Shroud of Turin","post":"To discuss the paper, this may be helpful too:\nhttps://shroudstory.com/2014/08/27/banding-is-it-real/\nIt is not an illusion, it is real. But i already knew Hugh was an illusionist, it all started with cotton fibers.\n\n","date":"August 30, 2014 at 2:06 am","url":"https://shroudstory.com/2014/08/29/more-about-banding-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-147259","author":"anoxie","site":"shroudstory"}]
