[{"title":"More on don’t confuse him with facts, his mind is made up","post":"“reverse sun bleaching of the cloth under a painted piece of glass”\nAt least that one is really creative. :)\n\n","date":"February 9, 2012 at 6:29 am","url":"https://shroudstory.com/2012/02/09/more-on-dont-confuse-him-with-facts-his-mind-is-made-up/","cat":"news_&_views","id":"comment-8085","author":"AnnieCee","site":"shroudstory"},{"title":"More on don’t confuse him with facts, his mind is made up","post":"How would you react to someone giving you a set of modern oil paints  some paint brushes and a canvas and being challenged to produce a facsimile of the Mona Lisa that would fool Sothebys? But that’s what you Dan and other folk are doing here when you list all the supposedly peculiar or unique characteristics of the Shroud –  superficiality, double image, lack of fluorescence, response to diimide and other chemicals – and expect a retired science bod to supply answers. I could have a reasonable stab at doing so, certainly, although the comments section on someone else’s blog is hardly the ideal place for setting out some very detailed and technical arguments, especially when there are so many who see scepticism as an attack on faith (my primary concern is with misapplications of so-called  science, and is nothing to do with faith).\nThe scientist does not approach the Shroud at the level of minute detail. A more structured approach is called for. The first is to establish the nature of the image – a scorch etc- and then the likely source of energy that produced the image, and then how the energy and linen interacted in a fairly orderly fashion to produce so interesting an end result.\nI am now 99.9% convinced that the image IS a scorch, that it was not produced by radiation, but by intimate contact with a heated 3D object. The energy entered the linen by close contact under a degree of applied pressure, i.e.by conduction, necessitating a zero air gap.\nBit by bit I can account for features of the Shroud, notably the presence of front and rear images with no side image, the crease marks at the extremities of the head, the basis of 3D-encoding (being as much about angle of contact between cloth and hot metal and resultant force of impression as anything to do with physical relief).  I shall shortly be addressing some of the finer issues, including the ones you raise, but I will NOT be adding to my existing posts on ‘science buzz’, 20 or so being quite sufficient for this one topic. I’ll use the Comments section on existing posts to flesh out details, and maybe venture a comment here from time to time, provided the cat-call brigade can hold their tongues long enough for me to sketch out what I hope will be seen as informed arguments. I think I can now explain the double-image, and only wish that  Raymond Rogers was still around to hear it,  albeit with its unavoidable critique of his own underestimation of the structural strength of that very remarkable molecule – cellulose –  the one that allows plants to stand upright without supporting canes. \nThere will be a loss of contact later today – I am travelling back to the UK, weather permitting…\nColin Berry\n\n","date":"February 9, 2012 at 6:57 am","url":"https://shroudstory.com/2012/02/09/more-on-dont-confuse-him-with-facts-his-mind-is-made-up/","cat":"news_&_views","id":"comment-8086","author":"sciencebod","site":"shroudstory"},{"title":"More on don’t confuse him with facts, his mind is made up","post":"If you support the idea of scorch in contact with a heated 3D object, I understand that you have already ruled out your previous difficulty regarding the different sizes of the front and back images.\n\n","date":"February 9, 2012 at 9:16 am","url":"https://shroudstory.com/2012/02/09/more-on-dont-confuse-him-with-facts-his-mind-is-made-up/","cat":"news_&_views","id":"comment-8089","author":"Gabriel","site":"shroudstory"},{"title":"More on don’t confuse him with facts, his mind is made up","post":"I can assure you that the apparent size difference, frontal v dorsal, is still a source of intense interest to me, Gabriel, and occasionally irritation too on account of the cavalier and unscientific attempts to explain it away in the literature.\nIt’s not just length that is at issue, but general build:\n frontal v dorsal \nThey could be two entirely different people, and invoking “cadaveric rigidity following crucifixion” is what is politely known as “begging the question” (some other descriptions spring to mind).\nbent model \nIt is totally misleading to suggest that the differences are down to “foreshortening” due to bent posture etc since that is to borrow the language of optics and photography in the absence of a shred of evidence that either of those were involved in image formation.\nIf as I believe the image was created by forcing cloth against a heated 3D object, e.g. a bronze statue or bas relief, then all kinds of distortions become possible in the imprinted image, depending on what parts made contact and what parts did not. The underside of the chin, if imaged, would create the impression of an over-long neck (which some have commented upon) The imaging of the foot on the dorsal side could end at the heel, or the tips of the toes (running along the sole of the foot), or even longer if the cloth then ran back along the top of the foot.\nWe urgently need a re-analysis of the entire body imprint to see whether the assumptions of “photography” onto a cloth – loosely draped or stretched flat – are totally, totally wrong and misleading, and  as I said a minute ago, BEGGING THE QUESTION.\nI personally believe the image will be found to fit a model in which a lifesize 3D replica of a human being, e.g a single bronze statue or cobbled together bas reliefs, has been imaged by impressing cloth against the heated replica. The latter can add or subtract to length and width dimensions, depending on whether all contours are followed, including ones that do not add to “real” vertical body height, e.g that underside of the chin mentioned earlier, or which subtract, due to “tenting” of the cloth between prominences (easily detectable by unexpected gaps in the image).. \nThe time is long overdue for question-begging junk science to be ruthlessly stripped out of “shroudology” and the purveyors of said junk science sent packing…  A retired science bod can say that, having nothing to lose..\n\n","date":"February 9, 2012 at 10:15 am","url":"https://shroudstory.com/2012/02/09/more-on-dont-confuse-him-with-facts-his-mind-is-made-up/","cat":"news_&_views","id":"comment-8093","author":"sciencebod","site":"shroudstory"},{"title":"More on don’t confuse him with facts, his mind is made up","post":"Interesting…but in my opinion, once you admit that the effect of wrapping a bas relief with a linen is that you “can add or subtract to length and width dimensions, depending on whether all contours are followed” this might well apply to a dead body\n\n","date":"February 9, 2012 at 11:02 am","url":"https://shroudstory.com/2012/02/09/more-on-dont-confuse-him-with-facts-his-mind-is-made-up/","cat":"news_&_views","id":"comment-8096","author":"Gabriel","site":"shroudstory"},{"title":"More on don’t confuse him with facts, his mind is made up","post":"“… once you admit that the effect of wrapping a bas relief with a linen is that you “can add or subtract to length and width dimensions, depending on whether all contours are followed” this might well apply to a dead body”\nI assume you mean an image of a dead body imprinted by some means other than scorching by direct contact with heat, maybe radiation, wavelength unspecified. But what mechanism precisely? And what is the nature of the image in that different mechanism? Why not admit it – you don’t have one, because none of those airy-fairy mechanisms that involve something other than direct scorching ever specify the chemical nature of the image, far less the process by which such an image came to be formed without a credible source of radiation, or an imaging system (converging lens etc\nMy theory may be wrong, but it at least specifies the source of energy (thermal), the method of heat transfer (conduction), the chemical nature of the scorch (semi-pyrolysed cellulose and/or other carbohydrates). What’s more, it totally rules out any kind of imprinting at a distance. Heat conduction requires that two bodies be directly in contact, i.e. with a zero air gap.\nSorry, Gabriel, but you have failed to make any point or objection that advances the SCIENTIFIC debate. \nIf you want to be scientific, then try to  falsify the conduction model.  But I don’t envy you that task (given that the model can be verified in the kitchen at home, to give an image with “3D-encoded information” using a free downloadable bit of software off the internet).\n\n","date":"February 9, 2012 at 11:25 am","url":"https://shroudstory.com/2012/02/09/more-on-dont-confuse-him-with-facts-his-mind-is-made-up/","cat":"news_&_views","id":"comment-8097","author":"sciencebod","site":"shroudstory"},{"title":"More on don’t confuse him with facts, his mind is made up","post":"I must admit that, however grateful I am for this blog, I do at times feel disheartened by how harsh the rhetoric can get here, on both sides of the divide. It’s true that the skeptics seem to have an astonishingly difficult time just facing the evidence, and that does need to be pointed out. But there has to be a way of doing it while still remaining respectful. I think most believers would agree that if the Shroud is for real, then it records events which at their heart were about love. I personally feel that unless we can strive to reflect that love, even while we hold skeptics’ feet to the fire, we are not doing justice to the meaning of the cloth. We can be honoring its science while not honoring its real import. I know this is all easier said than done, but I think just setting it as an ideal can elevate the level of discourse.\n\n","date":"February 9, 2012 at 9:17 am","url":"https://shroudstory.com/2012/02/09/more-on-dont-confuse-him-with-facts-his-mind-is-made-up/","cat":"news_&_views","id":"comment-8090","author":"Robert","site":"shroudstory"},{"title":"More on don’t confuse him with facts, his mind is made up","post":"\nsciencebod :“… once you admit that the effect of wrapping a bas relief with a linen is that you “can add or subtract to length and width dimensions, depending on whether all contours are followed” this might well apply to a dead body”\nI assume you mean an image of a dead body imprinted by some means other than scorching by direct contact with heat, maybe radiation, wavelength unspecified. But what mechanism precisely? And what is the nature of the image in that different mechanism? Why not admit it – you don’t have one, because none of those airy-fairy mechanisms that involve something other than direct scorching ever specify the chemical nature of the image, far less the process by which such an image came to be formed without a credible source of radiation, or an imaging system (converging lens etc\nMy theory may be wrong, but it at least specifies the source of energy (thermal), the method of heat transfer (conduction), the chemical nature of the scorch (semi-pyrolysed cellulose and/or other carbohydrates). What’s more, it totally rules out any kind of imprinting at a distance. Heat conduction requires that two bodies be directly in contact, i.e. with a zero air gap.\nSorry, Gabriel, but you have failed to make any point or objection that advances the SCIENTIFIC debate.\nIf you want to be scientific, then try to falsify the conduction model. But I don’t envy you that task (given that the model can be verified in the kitchen at home, to give an image with “3D-encoded information” using a free downloadable bit of software off the internet).\nExcept for  a couple of non-relevant and accusational comments made towards those with previous studies of the Shroud, I find Bod’s recent comments seem to have a slight trend to a more serious study of the Shroud, which I may add is refreshing. Now for Bod’s assumption that this image was created by conduction from possibly a metal sculpture; Understanding I am no physics expert by any means but I have plenty of knowledge when it comes to metal working; I think Bod must consider IF a bronze or whatever metal was used; How possibly did they manage “uniform” temperatures across the whole surface of the relief or statue and also manage “uniform” .0002 image depth across both ventral and dorsal images? All metals, except ‘maybe’ very highly refined types will show ‘hot spots’ when heated. To me this FACT alone counts out any type of bas-relief method, not to mention the basically impossible notion that someone could place uniform ‘pressure’ throughout the whole surface of the cloth within a finite amount of time to create the image we see. We would need an expert in metallurgy, with unmatched skill in sculpturing, surpassing even the likes Michelangelo and with an unpresedented knowledge in physics and a dexterity only matched by a computer controlled machine to “pull-off” such an amazingly realistic image. Not to mention a totally unconventional/unorthodox artistical style to boot!….Bod I also don’t think any person here is expecting any answers from you, as you state. But I’ll admit you never cease to intrigue us with your persistent research.\nR\n\n","date":"February 9, 2012 at 5:41 pm","url":"https://shroudstory.com/2012/02/09/more-on-dont-confuse-him-with-facts-his-mind-is-made-up/","cat":"news_&_views","id":"comment-8104","author":"Ron","site":"shroudstory"},{"title":"More on don’t confuse him with facts, his mind is made up","post":"How possibly did they manage “uniform” temperatures across the whole surface of the relief or statue and also manage “uniform” .0002 image depth across both ventral and dorsal images? \nNothing had to be managed, Metals are without exception good conductors of heat, especially copper, due to delocalised clouds of electrons. A typical bronze is 90% copper. In any case, what gives you the idea that the image is equal quality all over? Not so – the hands are much better defined than the feet, for example?\nAll metals, except ‘maybe’ very highly refined types will show ‘hot spots’ when heated. To me this FACT alone counts out any type of bas-relief method, not to mention the basically impossible notion that someone could place uniform ‘pressure’ throughout the whole surface of the cloth within a finite amount of time to create the image we see. \nAgain, you are suggesting that the image is perfect in all respects, with no “problematical” areas. Strange then that I was reading just the other day someone commenting on an unexpected dark area on one of the hands, which might be one of your hot spots. I would find that more credible than the explanation offered, namely that an obscured thumb had been x-rayed – along with all the bones in the hands and fingers… Ah, the wacky world of the Shroud, where anything and everything is possible, where simple branding technology, possible at humble blacksmith level, is dismissed as too mundane for words, “unscientific” even…  Shroudology should carry a health warning to mainstream scientists…\nWe would need an expert in metallurgy, with unmatched skill in sculpturing, surpassing even the likes Michelangelo and with an unpresedented knowledge in physics and a dexterity only matched by a computer controlled machine to “pull-off” such an amazingly realistic image. \nMaybe you are not au fait with the method for casting bronzes. Nobody had to sculpt metal. They would carve their model in wood, then uses a sand/clay mould in a lost-wax method that involved pouring in molten copper/tin alloy. Bronze is exceptionally good for casting – expanding slightly when it solidifies to give a good impression of every detail on the carved timber  template. . \nNot to mention a totally unconventional/unorthodox artistical stye to boot!….Bod I also don’t think any person here is expecting any answers from you, as you state. But I’ll admit you never cease to intrigue us with your persistent research.\nWell the image is certainly unconventional, given it is a light/dark reversed negative iand hardly attractive until viewed centuries later as a photpgraphic positive. But that’s the major point in favour of the branding theory – that it DOES create a negative image off the 3D template., and is entirely feasible with medieval technology.  Indeed, the sand casts used to create bronzes may well have inspired the idea to use them to facilitate the branding onto linen – making the outcome more practicable and predictable than if carried out manually akin to brass-rubbing. No burned fingers if you use a sand bed, and thump down from on top, say with a wooden log, to get a good impression!\nI am pleased you find my ideas intriguing (although they are not as original as you may think – John Jackson having laid most of the groundwork –  I’m just filling in the gaps).\n\n","date":"February 10, 2012 at 5:24 am","url":"https://shroudstory.com/2012/02/09/more-on-dont-confuse-him-with-facts-his-mind-is-made-up/","cat":"news_&_views","id":"comment-8109","author":"sciencebod","site":"shroudstory"},{"title":"More on don’t confuse him with facts, his mind is made up","post":"“Nothing had to be managed”; -Not exactly!, which comes to my point; How was the presence of heat spots ‘managed’? and actually bod according to many writings the images are of a uniform depth across both images, (I’am not talking visual appearance here, but depth of image), which IS one of the ‘attributes’ that must be considered when speculating on any image theory and cannot be overlooked…..Also in your conduction hypothesis, how have you dealt with the blood issue? Seeing as the blood had adhered to the cloth ‘BEFORE” the image creation???\n“Problematic areas”; -They are only so if you believe they are. The very notion that probable thumb or finger bones markings could be due to ‘unsuspected’ hot-spots is rediculous and the very notion that heat spots would somehow appear to specifically replicate anatomical parts is really reaching!….I would question who’s avenue of thinking is wacky here.\n“Au fait”; -I guess you didn’t understand my point or maybe your just trying to shirk the obvious. Someone had to ‘sculpt’ in the process of creating your bronze statue or relief, and whomever did so had a talent beyond any mortal man has been able to depict in all of history! If this is not ‘blatantly’ obvious to you, then I quess I would suggest again a new prescription for glasses.\n“Certainly unconventional”; -Well we agree on something atleast but again you shirk the obvious; which is the ARTISTICAL depiction is more of a unconventional method, which is what I meant. Never seen in the history of ART before or even immmediately after the suggested dates of the image creation. Depictions; Such as the two fold images, the complete nakedness, the extensive wounds etc.etc;…But you are right the light /dark reversed negative is a good analogy. \nI’m always ready to show appreciation to different ideas, was more my point, but it’s nice you would differ to Dr. Jackson as he deserves much appreciation from anyone interested in the Shroud as he has dedicated much of his life to ‘intense’ study of the Shroud, much much more then anyone alive actually. So to this point, whenever spoken of, demands respect.\nR\n\n","date":"February 10, 2012 at 6:36 pm","url":"https://shroudstory.com/2012/02/09/more-on-dont-confuse-him-with-facts-his-mind-is-made-up/","cat":"news_&_views","id":"comment-8122","author":"Ron","site":"shroudstory"}]
