[{"title":"More on Freeing the HAL 9000: Yes, what is the Archdiocese of Turin afraid of?","post":"Good point Ron.  But I think a big part of the answer is in your questions !  The Vatican and the Centro in Turin were so criticized (rightly) that they probably prefer to let the dust settle now with respect to the shroud.  And I think it’s a wise decision for the moment…  But I’m sure one day (maybe with a new pope), a new series of direct tests will be done (it must !) and then, at this moment, the HD images will probably be very useful.  I think it’s just a question of choosing the right time and the right scientists to analysed those images.  And I think this should not be done lightly.  Next time the Vatican will permit a new series of direct tests, they must do it better than what was done in 1988 and 2002 !  And to accomplish this, they must ear the advises of a scientific commity.  And the best would be a commity composed of scientist who never worked on the Shroud before to avoid bias opinions and decisions…  That’s what I think.  The time tight now is maybe not so good but you can be sure that one day, it will be.\n\n","date":"October 13, 2011 at 10:44 am","url":"https://shroudstory.com/2011/10/13/more-on-freeing-the-hal-9000-yes-what-is-the-archdiocese-of-turin-afraid-of/","cat":"news_&_views","id":"comment-4185","author":"Yannick Clément","site":"shroudstory"},{"title":"More on Freeing the HAL 9000: Yes, what is the Archdiocese of Turin afraid of?","post":"During the 2002 restoration burnt fibres from the medieval fire were removed. They were perfect for a new radiocarbon test and along with the HAL9000 high resolution images, they represent a whole body of information to be (re)analized. The Catholic Church has always been very well connected with the scientific community and most probably has already carried out -secretly- new radiocarbon tests and in-depth analysis on the HAL9000 images.\nPut yourselves in the place of the Church. If on the one hand, you had all these new information and on the other hand, a group of very good experts who you trust 100%, what would you do? Wouldn`t you put all those evidences in their hands and analyze their conclusions without the pressure of the media? Most probably they already reached a conclusion about the Shroud by 2007 or 2008 and in the light of these conclusions they organized the 2010 exhibition.\nThe Vatican felt that the laboratories that carried out the 1988 radiocarbon tests did not fulfilled their compromises regarding the way that results would be made public. In this sense, it seems quite logical that now it is them who carried out all the tests privately with their own scientists in the first place. It just does not seem plausible that they keep all the HAL9000 images in a DVD hidden somewhere waiting for a image analyst from outside the Church to analyze them.\n\n","date":"October 13, 2011 at 9:06 pm","url":"https://shroudstory.com/2011/10/13/more-on-freeing-the-hal-9000-yes-what-is-the-archdiocese-of-turin-afraid-of/","cat":"news_&_views","id":"comment-4186","author":"Gabriel Spain","site":"shroudstory"},{"title":"More on Freeing the HAL 9000: Yes, what is the Archdiocese of Turin afraid of?","post":"It’s a very interesting point.  Remember that the 2002 restoration was keep completely secret before a journalist put out the information in the media…  Who knows ?  It’s something possible but personaly, I don’t think so.  Maybe some preliminary analysis were done but a vast set of direct tests including a C14 dating ?  Not sure about that.  One thing’s for sure, if they already have new scientific informations, they must tell the public before another journalist find out the info !  If that would be the case, the credibility of the Vatican would be destroy almost forever regarding the Shroud…  But again, I don’t think so.  I think the most probable answer is that the Church only wait for the right time to go on with a kind of STURP 2 investigation team work.\n\n","date":"October 14, 2011 at 8:30 am","url":"https://shroudstory.com/2011/10/13/more-on-freeing-the-hal-9000-yes-what-is-the-archdiocese-of-turin-afraid-of/","cat":"news_&_views","id":"comment-4188","author":"Yannick Clément","site":"shroudstory"},{"title":"More on Freeing the HAL 9000: Yes, what is the Archdiocese of Turin afraid of?","post":"Please note that nowadays, using current technology a radiocarbon dating of a burnt fibre from the Shroud can be easily done in a few hours and a whole set of preliminary tasks which in the past could take days are not needed any longer. Current devices are much more sophisticated and results are almost straightforward. Hundreds of tests are being currently carried out everyday and a “special test” like this could easily go unnoticed in a busy laboratory, specially if it is located in one of the many high level Catholic Universities. Not to mention the analysis of the HAL9000  images. It is a process that can be easily decentralized and put in the hands of let`s say, ten top experts you trust 100%  in parallel and wait for the results. This is the way current research teams work on science. Physical meetings like the one we saw with the STURP where all scientists are present are not very common nowadays since everyone uses Internet. You don`t need a STURP team anymore and I think that we will never see one again. If you were the Church wouldn`t you like to know what the hell the Shroud really is? First, privately and then you could take your time to tell the world by yourself, whatever the truth is. The other possibilty of having frozen all the analyses and kept all the burnt fibers and rest of material from the restoration along with the  HAL9000 images in a “safe place“ waiting for future analysis carried out by a STURP2 seems to me unbelievable. Perhaps the –in principle, not scheduled- exhibition of 2010 is related to the fact that the Church already has got a veredict about whether it is a fake or not. Though a Catholic myself, I feel doubts on how to interpretate whether the exhibition of 2010 is a positive confirmation on the authenticity of the Shroud or not. The Catholic Church is  2000 years old and  her concept of time is different, but if I had to choose I would say that if they considered that the Shroud was certainly  a fake they would have let the whole subject die. They have done so with many other relics that in the past were venerated all over Europe. Nowadays only a few of them are still given any attention:The Shroud of Turin, the Shroud of Oviedo, the chalice of Valencia and a few more. All of them are relics that can exhibit solid –though perhaps not definitive- historical credentials. For most of the  hundreds or perhaps thousands of relics that in the past were venerated, the Church has let their devotion die little by little. I think that the Catholic Church would have acted the same with the Shroud of Turin if they thought it was a fake and the 2010 exhibition would have never taken place. But this is not more than my doubtful impression.\n\n","date":"October 14, 2011 at 9:26 am","url":"https://shroudstory.com/2011/10/13/more-on-freeing-the-hal-9000-yes-what-is-the-archdiocese-of-turin-afraid-of/","cat":"news_&_views","id":"comment-4189","author":"Gabriel Spain","site":"shroudstory"},{"title":"More on Freeing the HAL 9000: Yes, what is the Archdiocese of Turin afraid of?","post":"I agree with your reasoning that the exhibition of 2010 wouldn’t have taken place if the Church were aware that, without any serious doubt, the Shroud is not 2000 years old.  You can bet on that.  But is it the reality ?  The Church would be aware of the fact that the Shroud is really 2000 years old for many years and they would keep this information secret ?  I’m not sure about that.  If it’s true, why keep this information secret ?  Seriously, I think the truth is that the Church is waiting the right time to allow another series of direct tests on the relic.  I think this probability has more chances to be the reality.  As you say, the time of the Church is not the time of the World !!!  The Church can wait for 10 or 20 more years without doing any move about the Shroud and I wouldn’t be surprise at all !!!  Just a question like that : Maybe the Vatican think it’s not a bad thing after all that we’re still in a doubt zone with the Shroud ?  This way, that leaves the door open for everyone to be totally free to believe or not that this object is really the burial shroud of Christ…  Maybe that’s why the Church is not in a hurry with a new Shroud research.\n\n","date":"October 14, 2011 at 10:30 am","url":"https://shroudstory.com/2011/10/13/more-on-freeing-the-hal-9000-yes-what-is-the-archdiocese-of-turin-afraid-of/","cat":"news_&_views","id":"comment-4190","author":"Yannick Clément","site":"shroudstory"},{"title":"More on Freeing the HAL 9000: Yes, what is the Archdiocese of Turin afraid of?","post":"Hi everybody !\nBecause this subject was the starting point of this “debate”, I just want to share a personal reflection with you about the possible images of coins, flowers and other objects found on the Shroud by some researchers.  It is a logical argument that goes against all those possibilities.  \nWhen it comes to analyse the Shroud, we always have to remember the context of the burial.  It’s so important and, unfortunately, it’s an aspect of the question that is often forgotten !  We found a pretty good description of the burial of Jesus and the 2 days after in the 4 gospels.  From this description, it is pretty clear that the burial rite was only partially done on friday because there was not enough time left to perform it completely (because the Sabbath and the Passover was at end and everyone had to be at home).  From the gospel accounts, we know that the women had to go back to the tomb early Sunday morning to complete the burial rite with, among other things, an anointing with a perfume.  \nOn the other hand, we have to understand that the action of putting flowers, coins or other objects into the Shroud, if it ever was planned, was an action surely reserved for the conclusion of the burial rite.  It’s just logical to think that way.  You don’t put coins over the eyes or throw flowers on the body before doing all the task of the burial rite, like an anointing with a perfume !\nSo, in this context, HOW IN THE WORLD THE PEOPLE WHO PERFORMED THE PARTIAL RITE ON FRIDAY WOULD HAVE PUT THINGS LIKE COINS, FLOWERS OR ANYTHING LIKE THAT ON THE BODY OF JESUS (OR BESIDE THE BODY, IN THE SHROUD) WHILE THEY ALREADY KNEW THEY DIDN’T HAD TIME TO COMPLETE THE RITE AND THEY HAD TO COME BACK TO THE TOMB ON SUDAY MORNING TO FINISH THE JOB AND PERFORMED AN ANOINTING ON THE BODY ?  \nWhen you use your logic, that make absolutely NO SENSE !!!  If those objects were left in the Shroud on Friday, they would have to take them out of the shroud on Sunday morning, performed the ritual anointing, and then place again those objects in the Shroud at the very end of the ritual.  It’s not logical at all !  If those objects were planned to be left on the body or beside it in the Shroud, it’s almost sure they would have waited until the very end of the burial rite to do it.  In the context describe above of an evident lack of time on Friday, wouldn’t you have done the same and wait until the end of the ritual on Sunday morning to add those objects in the Shroud (if there was any object at all to be place there) ???  I really think so !      \nI think this little reflection is enough to understand that those objects are simply not there on the Shroud…  Or, if there really is images of those objects (I really don’t think so), they were surely formed in a separated event that is not related at all to the body image formation and this other image formation process had to take place AFTER the body image formation process was completed, during another period of time that could have taken place decades, if not centuries later.  One thing’s for sure, if there really is some images of those things on the Shroud, they are not related to the burial of Jesus-Christ…\nOne last comment :  The practice of putting coins over the eyes was directly taken from a pagan rite of Egypt.  In this rite, the family would put coins over the eyes of the dead because they thought he would need money to pay is right to cross the Styx river !  So, in the context of the dead of Jesus, don’t you think it would be VERY strange for his family and disciples to perform a pagan rite during his entombment ???  That makes no sense to me…  If there was any Jews who performed this kind of ritual, they were surely Hellenistic Jews and not pious Jews who practice the laws and rules received from Moses…  This portrait doesn’t seem to correspond to the family and the disciples of Jesus who was not at all an Hellenistic Jew !!!\n\n","date":"October 16, 2011 at 8:03 pm","url":"https://shroudstory.com/2011/10/13/more-on-freeing-the-hal-9000-yes-what-is-the-archdiocese-of-turin-afraid-of/","cat":"news_&_views","id":"comment-4204","author":"Yannick Clément","site":"shroudstory"},{"title":"More on Freeing the HAL 9000: Yes, what is the Archdiocese of Turin afraid of?","post":"Hi Yannick.  You make some good points, let me give you a ‘possible’ explanation(s) for some or all of these ‘artifacts’ being present on the Shroud. Following scripture; I, for one do not believe they were in that much of a rush as most conclude, has apparently Jesus died at approximately 3pm, another 2 hours or so passed before they actually took him down and carried him off to the tomb. That would give them probably one or possibly nearly two hours before the moon dropped below the horizon, hense starting the Passover (If I’ve calculated properly). In that time, much can be accomplished! Lets look at it from the view of the persons actually preparing Jesus after they reached the tomb. They, knowing very well that somone would have to come back on the Sunday to complete the annointing/ritual. Time still allowed for possibly a partial wash to be performed (Zugibe), Jesus was then laid in the Shroud, flowers were placed with some spices, as they knew the body would definitely be emitting odours by Sunday and placing such items was done to possibly lesson or restrict the smell. The coins on the eyes were placed to keep the eyes closed and from some recent findings by archeologists, apparently this WAS a Jewish practice of the time, as coins have been found in skulls found in 1st century Jerusalem tombs. They then placed Jesus in the position we see by braking the rig of the arms, then improvised by cutting a strip from the shroud to tie him in position, possibly knowing that by Sunday rigor moris would be waning. All these things may have been done in light that the woman would be back and also done with their frail emotions/conditions in mind. Imagine the woman coming into the tomb on the Sunday to find the tomb wreaking of decay with the body sprawed unceremoniously and the eyes wide open! …What a frightning and horible scene that would be! …I think the ‘preparers’ would have more sense and sensitivity, then to leave things in that manner.\nAlthough alot of people do not put much faith in these ‘articles’ existing on the Shroud, we cannot just completely dismiss them also, just because we don’t ‘believe’ they are there. That my friend also is not very open minded or scientific either. Until further, more complete and exhaustive examinations are done on the Shroud with new technologies, I think IMHO, that it would be good to keep an open mind to all possibilities.\nRon\n\n","date":"October 19, 2011 at 7:44 am","url":"https://shroudstory.com/2011/10/13/more-on-freeing-the-hal-9000-yes-what-is-the-archdiocese-of-turin-afraid-of/","cat":"news_&_views","id":"comment-4217","author":"Ron","site":"shroudstory"},{"title":"More on Freeing the HAL 9000: Yes, what is the Archdiocese of Turin afraid of?","post":"Note a correction for the line above should read; That would give them one or possibly two hours before the moon RAISED ABOVE the HORIZON, hense starting the Passover.\nSorry for the error….long night at work ;-)\n\n","date":"October 19, 2011 at 8:04 am","url":"https://shroudstory.com/2011/10/13/more-on-freeing-the-hal-9000-yes-what-is-the-archdiocese-of-turin-afraid-of/","cat":"news_&_views","id":"comment-4218","author":"Ron","site":"shroudstory"}]
