[{"title":"A Winning Shroud of Turin Expository Speech","post":"Great find! I hope she stays engaged in Shroud research.  We need the younger generation to pick up the torch.  I do have a question about the xx chromosome. I had never heard that before.  Where was that published?  Is that Garza Valdez?\n\n","date":"August 16, 2012 at 11:01 am","url":"https://shroudstory.com/2012/08/16/a-winning-shroud-of-turin-expository-speech/","cat":"news_&_views","id":"comment-15069","author":"Russ Breault","site":"shroudstory"},{"title":"A Winning Shroud of Turin Expository Speech","post":"Just doing a google search on the matter I believe the XX claim comes from Frank Tipler a physicist. Supposedly the blood DNA on the shroud was analyzed with the results published in an “obscure Italian journal”. The results were a photocopy of the output of the analysis with no accompanying interpretation. Mr. Tipler claims to have been able to instantly interpret the data and the story it tells is that the DNA on the shroud came from an XX male which is completely consistent with a Virgin Birth. \nFascinating to ponder but I wouldn’t put any stock in at all right now because in everything I’ve read I never saw a link or even a name reference to the Italian magazine it was supposedly published in. I did, however, see plenty of links to Mr. Tipler’s book (Physics of Christianity) where this is claimed. Perhaps he’s more forthcoming in his book, but I haven’t read it so I don’t know. I couldn’t find anything on Barry’s site except a reference in the British Society for the Shroud of Turin’s newsletter. That doesn’t mean that there’s not something more there just that I couldn’t find anything in the short search I did. \nIf anything this is a far fetched claim that will need further study before it can even be considered. \nFor what it’s worth overall this was a decent presentation but I think the presenter does get a few minor points wrong.\n\n","date":"August 16, 2012 at 1:45 pm","url":"https://shroudstory.com/2012/08/16/a-winning-shroud-of-turin-expository-speech/","cat":"news_&_views","id":"comment-15076","author":"Chris","site":"shroudstory"},{"title":"A Winning Shroud of Turin Expository Speech","post":"A “xx chromosome” found in blood sample from the Shroud…  Looks like the Lunatic (supernatural) fringe strikes again !!!  It’s incredible how a lot of people seem to only seek any marvelous thing that could be linked in some (often crazy) way with the Shroud of Turin.\nOn a theological level, I would say that, to me, somebody who don’t think Jesus really had a chromosome X and a chromosome Y like anyone else is denying the heart of what the Church has called “the Incarnation of God”…  Jesus my friends was not an alien from outer space.  He was a real human being with a real body like anyone of us and he died like anyone of us and after death, his corpse started to emit some gases and other biological substances like any other human corpse until the Resurrection event came in.  Like I said in one comment I’ve made this morning :  The Incarnation didn’t stopped at the moment Jesus died on the cross !  I think this is a great line to meditate for a while.\nJesus had a devine nature, yes I believe this.  BUT…  Never forget that he had a human nature as well !!!  And when I say “human nature”, that mean Jesus had a real human body like any other body and a real human psychological side like any other human being…  Let’s never forget that my friends !!!\n\n","date":"August 16, 2012 at 4:39 pm","url":"https://shroudstory.com/2012/08/16/a-winning-shroud-of-turin-expository-speech/","cat":"news_&_views","id":"comment-15084","author":"Yannick Clément","site":"shroudstory"},{"title":"A Winning Shroud of Turin Expository Speech","post":"One last comment from me to emphasize what I just said before : if anyone would be tempted not to believe my previous comment that “The Incarnation didn’t stopped at the moment Jesus died on the cross”, I would simply say this to him :  My friend, you just have to consider all the post-mortem blood flows on the Shroud, especially the one that come from the side wound, to understand that the dead body of Jesus was reacting in the same exact manner than anyone else’s corpse that would have suffered the same tortures just prior to his death.  That statement can be backed-up by almost every medical experts that have studied the body image and the blood and serum stains we can see on the cloth…  Let’s never forget that most important information about Jesus that the Shroud of Turin has to say to everyone of us :  Jesus was a real human being with a real body (and consequently a real corpse) that was not different than anyone else.  I know this can sound “chocking” for some religious people, but that’s what the Shroud has to say and that’s exactly what the Church is teaching and that’s also exactly what we can interpret from the Gospel accounts of Jesus life and death.  There’s a very good coherence between all this in order to understand that the Incarnation of God WAS NOT A JOKE, despite all the different heresies (like the Monophysites who were totally denying the human nature of Jesus) about that aspect of Christ that have constantly arised in every era since Jesus death and Resurrection happened.  To me, the Shroud is a wonderful proof (I dare to used the word) of the humanity of Jesus-Christ.  In that respect, you can be sure that he had the same kind of chromosome than anyone else, just like it was proven that he had the same kind of blood than anyone else.  I think we should all meditate a very long time on that because it contain a great message about who God really is.\n\n","date":"August 16, 2012 at 5:46 pm","url":"https://shroudstory.com/2012/08/16/a-winning-shroud-of-turin-expository-speech/","cat":"news_&_views","id":"comment-15087","author":"Yannick Clément","site":"shroudstory"},{"title":"A Winning Shroud of Turin Expository Speech","post":"Oh, I just forget to add this :  If you really want to find a sign (not a proof) of the Resurrection on the Shroud, why not starting to consider the undisturbed aspect of the bloodstains on the cloth instead of searching for some crazy “xx chromosome” in the blood ?  Effectively, the undisturbed aspect of these bloodstains rest on solid ground and was recognized by many medical experts who studied the Shroud in deep like Barbet and Baima Bollone…  Of course, that doesn’t necessarilly mean that Resurrection of Christ is truly responsible for this, but with the eyes of faith, I think a Christian can see a great sign (not proof) there.  And what makes me believe that this can really be a sign of the Resurrection is the fact that in front of it, anyone is still free to believe what he wants !!!  This sounds much more like the God of Love I know (the one who respect human freedom so much that he let himself be killed by these same humans)…\n\n","date":"August 16, 2012 at 5:56 pm","url":"https://shroudstory.com/2012/08/16/a-winning-shroud-of-turin-expository-speech/","cat":"news_&_views","id":"comment-15089","author":"Yannick Clément","site":"shroudstory"},{"title":"A Winning Shroud of Turin Expository Speech","post":"Not lunatic! Not incredible!  The mother of Jesus would normally have no XY chromosomes to pass on to her progeny.  I have heard that it is remotely and rarely possible for a woman to inherit and contain XY chromosomes from her father, but knowledgable medical geneticists may be able to supply more authoritative comment.\nThere is a “medical/theological” problem with doctrines of virgin births coupled with doctrines of incarnation.  The birth of Jesus is one such example, and in history of religions, there are also a few others.\nThe problem is this.  If Jesus was truly man, he must have had XY chromosomes, and the question is “Where did they come from?”.  The standard Catholic doctrine is that Jesus inherited all of his human nature from his mother.  But she could not normally provide XY chromosomes.  A liberal stance would be to deny the doctrine of the virgin birth.  This could not be accepted by Catholic theologians in good standing.\nIt seems that Mr Frank Tipler, is attempting to get around the problem, by asserting that Jesus only had XX chromosomes.  But only women have XX chromosomes.  And the logical conclusion from Tipler’s assertion would be that Jesus would therefore actually be a woman.  However there is a gospel account in Luke that Jesus was circumcised when he was about 8 days old.\nBut I don’t think that this would be an adequate reason for the Vatican to consider that it might now  permit the priestly ordination of women!\nThe doctrine of the Virgin birth was only formulated around the 4th century, and is derived from the gospels of Matthew and Luke.  The question is now: “When did Jesus become God?”  For Mark it was when he was baptised by John in the waters of the Jordan.  For both Matthew and Luke, it was at his conception.  For the evangelist John, it was from the very beginning “In the beginning was the Word (logos), and the Word was with God and the Word was God … “,\n\n","date":"August 16, 2012 at 6:39 pm","url":"https://shroudstory.com/2012/08/16/a-winning-shroud-of-turin-expository-speech/","cat":"news_&_views","id":"comment-15092","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Winning Shroud of Turin Expository Speech","post":"So apparently it is a exceedingly rare but a natural thing for a woman to pass on an XX genetic code with the Y gene imbedded in one of the X’s. From the very little I’ve read on this today it’s not a reach for this to happen. There’s something that’s called an “SRY” gene (I think) that gets turned on inside one of the X genes and it acts as the Y chromosome and at the same time the X gene it’s implanted in is “turned off”. This makes the person with this disposition a full male. I gather the gist of it is that he got that way by a round about approach.\nWhat’s being alleged is that this has been confirmed with the blood evidence on the shroud. I find it very hard to accept though because there is almost nothing to back up the claim. That and the fact that other scientists have claimed that the  DNA on the shroud is too old and to fragmented to yield anything of worth make me very skeptical that any such information can be gleaned from the biological evidence left on the shroud.\nIf it can be published, interpreted and reviewed in an acceptable scientific manner then it might be something worth looking at but otherwise I don’t see any merit to the claim. And I don’t think it wise that this lady should have included this claim in her presentation because it just cuts her credibility away to nothing. It does more harm than good to  her cause of educating folks on the Shroud. Just my 2 cents.\n\n","date":"August 16, 2012 at 8:08 pm","url":"https://shroudstory.com/2012/08/16/a-winning-shroud-of-turin-expository-speech/","cat":"news_&_views","id":"comment-15097","author":"Chris","site":"shroudstory"},{"title":"A Winning Shroud of Turin Expository Speech","post":"No matter if the doctrine of the Virginal birth of Jesus is true or simply metaphoric (which is exactly what I believe), the fact that Jesus was a REAL human being who lived and died like anyone of us is clear enough for me to understand that he had the same kind of chromosomes than any other human being who ever lived on this planet.  And if Jesus really had no human father, don’t you think the Holy Spirit wasn’t strong enough to make sure he would have the same kind of chromosomes as you or me ???  After all, if God is the creator of all the material world, I’m sure he could have found a way to make sure Jesus would have a NORMAL human body like anyone else…  This science-fiction hypothesis comes from someone who wants (again) to take advantage of the Shroud and his great “mystery” in order to do sensationalism and get the spotlight on him.  That’s all my friends !  And if we have any desire to stay scientifically credible, we should never fall in the trap of according any credibility to these kinds of lunatic claims that ARE VERY FAR FROM BEING PROVEN SCIENTIFICALLY.  I have absolutely no difficulty to put this hypothesis in the same bag as the ones who claim they can clone Jesus from the Shroud !  This is the same kind of craziness that always pollute the Shroud would…  If it’s true that this girl have some “potential” to do a good Shroud speaker, she should learn to separate what are solid confirmed and accepted facts and observations regarding the Shroud from what’s not…\n\n","date":"August 18, 2012 at 6:42 pm","url":"https://shroudstory.com/2012/08/16/a-winning-shroud-of-turin-expository-speech/","cat":"news_&_views","id":"comment-15192","author":"Yannick Clément","site":"shroudstory"},{"title":"A Winning Shroud of Turin Expository Speech","post":"Yannick, presuming Jesus truly came only from Mary, his body wouldn’t be just like anyone else for the mere fact of what a virgin birth indicates.  I imagine you said that to point out that he had a human body and so, was like us.\n\n","date":"August 19, 2012 at 8:35 am","url":"https://shroudstory.com/2012/08/16/a-winning-shroud-of-turin-expository-speech/","cat":"news_&_views","id":"comment-15208","author":"Andy Weiss","site":"shroudstory"},{"title":"A Winning Shroud of Turin Expository Speech","post":"Chris, I agree.  She did a fine job on her presentation but she should not have made a big deal about something so speculative.  But I do hope she stays with her research.  We need more young people like her to get excited and run with the message.\n\n","date":"August 16, 2012 at 9:28 pm","url":"https://shroudstory.com/2012/08/16/a-winning-shroud-of-turin-expository-speech/","cat":"news_&_views","id":"comment-15099","author":"Russ Breault","site":"shroudstory"},{"title":"A Winning Shroud of Turin Expository Speech","post":"Hi, Yannick Clément. XX males are actual physically-real people.\nRuss Breault, there’s nothing speculative about these DNA results on the Shroud of Turin and the Sudarium of Oviedo, as these results are from physical testing, not a priori theorizing. The team of Italian researchers who conducted these tests on both the Turin Shroud and Oviedo Cloth in January 1995 were lead by Prof. Marcello Canale of the Institute of Legal Medicine in Genoa, Italy. This team included several researchers who had invented the standard DNA test for gender.\nThe Shroud of Turin and the Sudarium of Oviedo are both known to have quite divergent histories and different purported carbon-14 datings, and yet they both display the same XX male blood samples, results for which the world-renowned DNA scientists who collected and studied the samples on both artifacts had no explanation for (see Lucia Casarino, et al., “Ricerca dei polimorfismi del DNA sulla Sindone e sul Sudario di Oviedo”, Sindon Nuova Serie, Quaderno n. 8, dicembre 1995, pp. 36-47). Such was this research group’s confusion that they simply published the raw data without any attempt to provide analysis in an obscure Italian journal (which is quite remarkable, since Shroud of Turin and Sudarium of Oviedo research typically gets published in leading journals such as Nature and Science). Yet this is precisely the result to be expected from a virgin birth.\nThe extreme rarity of a human parthenogenic birth would be one of the confirmations that a miracle had occurred if Jesus was a virgin birth. Prof. Tipler proposes that at the very least the Y gene that encodes for maleness (the SRY gene) was inserted into one of Mary’s X chromosomes (if not all the Y genes, of which there are 28), but only became active in Jesus. DNA tests on the Turin Shroud and the Oviedo Cloth have both confirmed the DNA of an XX male, i.e., the blood is that of XX chromosomes but with Y genes present, which is strong evidence that the blood is that of an XX male. For more on this, see Ch. 7: “The Virgin Birth of Jesus”, pp. 154-193 of Frank J. Tipler, The Physics of Christianity (New York: Doubleday, 2007).\nFor those who would like to learn more about physicist and mathematician Prof. Frank J. Tipler’s Omega Point cosmology, which is a proof of God’s existence according to the known laws of physics (i.e., the Second Law of Thermodynamics, General Relativity, and Quantum Mechanics), and the Feynman-DeWitt-Weinberg quantum gravity/Standard Model Theory of Everything (TOE), see my following article:\nJames Redford, “The Physics of God and the Quantum Gravity Theory of Everything”, Social Science Research Network (SSRN), Aug. 6, 2012 (orig. pub. Dec. 19, 2011), doi:10.2139/ssrn.1974708, http://archive.org/details/ThePhysicsOfGodAndTheQuantumGravityTheoryOfEverything .\nFor a great deal of interesting information on the Shroud of Turin, see the below video:\nmhfm1 (Most Holy Family Monastery), “Proof that the Shroud of Turin is the Burial Cloth of Jesus Christ!”, YouTube, Apr. 1, 2011, http://www.youtube.com/watch?v=WRB16BARvz0 .\n\n","date":"August 17, 2012 at 1:16 pm","url":"https://shroudstory.com/2012/08/16/a-winning-shroud-of-turin-expository-speech/","cat":"news_&_views","id":"comment-15130","author":"James Redford","site":"shroudstory"},{"title":"A Winning Shroud of Turin Expository Speech","post":"Quote :  “Yannick Clément. XX males are actual physically-real people”\nI will believe this when I see independent and serious papers (on the plural) published about that in serious peer-reviewed scientific journals.\nI think we can wait for a very long time before seeing this.\n\n","date":"August 18, 2012 at 6:41 pm","url":"https://shroudstory.com/2012/08/16/a-winning-shroud-of-turin-expository-speech/","cat":"news_&_views","id":"comment-15191","author":"Yannick Clément","site":"shroudstory"},{"title":"A Winning Shroud of Turin Expository Speech","post":"No problems, Yannick.  You can find them on Wikipedia: XX Male Syndrome Wikipedia:\nhttp://en.wikipedia.org/wiki/XX_male_syndrome  \nExtracts:\n“XX male syndrome (also called de la Chapelle syndrome, for a researcher who characterized it in 1972[1]) is a rare sex chromosomal disorder. Usually it is caused by unequal crossing over between X and Y chromosomes during meiosis in the father, which results in the X chromosome containing the normally-male SRY gene. When this X combines with a normal X from the mother during fertilization, the result is an XX male.\nThis syndrome occurs in approximately four or five in 100,000 individuals, making it less common than Klinefelter syndrome ” [XXY ,  There are also XXYY ]. \n“Symptoms usually include small testes and subjects are invariably sterile. Individuals with this condition sometimes have feminine characteristics, with varying degrees of gynecomastia but with no intra-abdominal Müllerian tissue.[4] According to research at the University of Oklahoma health science centers, most XX males are not stereotypically feminine and are typical boys and men[citation needed] although other reports suggest that facial hair growth is usually poor and libido is diminished, with notable exceptions.” \nThe article gives citations.  So it does occur!\nWhether it occurred in Jesus in this form, or whether he had some other chromosome arrangement, we have no way other way of knowing, except the papers commented on above.\nI still maintain there is a theological difficulty.  If Jesus had XY chromosomes, and that this was part of his human nature, then he had to obtain Y from a human father.  It still creates a theological difficulty if you say he had them from the Holy Spirit, as he is supposed to have his human nature solely from his mother.  \nDoctrine of the Virgin birth dates only from the 4th century.  The early doctors of the church postulated that Jesus’ brothers (named in Mark) and his sisters were from an earlier marriage by Joseph, or were cousins.  However, John P Meier, a highly reputable Catholic biblicist is insistent that the Greek word used for brothers means precisely that.  A further explanation, which I tend to favour is that they may well have been adopted, as adoption of orphans was very common in those days because of high mortality rates, and adoption gave exactly the same rights as birth, both in Roman and Jewish law.  \nYou may believe that the doctrine of the Virginal birth was metaphorical, and there are other non-Christian religious traditions also asserting that it occurred elsewhere, (e.g. Siddhartha Gautama = Buddha).  However, that metaphorical interpretation is not the intent of the Catholic doctrine.\n\n","date":"August 18, 2012 at 8:33 pm","url":"https://shroudstory.com/2012/08/16/a-winning-shroud-of-turin-expository-speech/","cat":"news_&_views","id":"comment-15196","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Winning Shroud of Turin Expository Speech","post":"I was talking about the ADN that was found on the Shroud…  \nI never saw one peer-reviewed paper published in a serious scientific journal that proclaim there really is such a finding that was made in the ADN from the Shroud.  By the way, this ADN of the Shroud is badly degraded, so any findings made from it should be regarded with a great caution.\nPersonally, as I said, the dogma of the Virgin Mary is not something I follow, simply because I don’t see the point !  In my mind, whether Mary was truly a virgin or not when she conceived Jesus didn’t matter to me at all.  I really don’t care one second about that.  If Jesus really was conceived like anyone else (from a normal sexual relation) and if Mary was not a virgin at all and if Jesus brothers and sisters were just that : brothers and sisters, what would that change versus the gact that Jesus had both natures and that Mary was a truly remarkable person ???  Nothing at all !  In my mind, if God was able to create the world from nothing, he is surely able to incarnate himself in the embrio issued from a normal sexual act !\nI truly believe, like many scholars, that this part of Luke and Matthew is severily tint of Christian legendary tales and as no great value from a historical point of view (just like rising of the Saints reported only in Matthew after the death of Christ).  For this reason, I prefer to see these stories as symbolic texts that contains nevertheless some bery good spiritual meanings. You can see that I’m a “rational” and “liberal” Chritian, just like most Quebecers and unlike most Americans…\n\n","date":"August 18, 2012 at 9:00 pm","url":"https://shroudstory.com/2012/08/16/a-winning-shroud-of-turin-expository-speech/","cat":"news_&_views","id":"comment-15198","author":"Yannick Clément","site":"shroudstory"},{"title":"A Winning Shroud of Turin Expository Speech","post":"Error :  You should read “versus the fact” instead of “versus the gact”…  Sorry !\n\n","date":"August 18, 2012 at 9:01 pm","url":"https://shroudstory.com/2012/08/16/a-winning-shroud-of-turin-expository-speech/","cat":"news_&_views","id":"comment-15199","author":"Yannick Clément","site":"shroudstory"},{"title":"A Winning Shroud of Turin Expository Speech","post":"Another error :  You should read “some very good spiritual meanings” insead of “some bery good spiritual meanings”.\n\n","date":"August 18, 2012 at 9:03 pm","url":"https://shroudstory.com/2012/08/16/a-winning-shroud-of-turin-expository-speech/","cat":"news_&_views","id":"comment-15200","author":"Yannick Clément","site":"shroudstory"},{"title":"A Winning Shroud of Turin Expository Speech","post":"I would like to summarize my thinking about Mary and the dogma of his virginity in order to make it more clear (for Andy and others) :  In my mind, this dogma was largely influenced by ancient legendary tales of ancient pagan cultures present all around Israel which often put in scene a virginal birth in the case of a hero or a liberator.  I also think it was in a way caused by a problem that the Church (greatly influenced by the pharisaic side of St Paul) had at the time concerning sexuality, which was always wrongly considered as something automatically bad, mean, bestial and dirty…  \nSo, for me, this dogma has nothing to do with the historical reality (there’s great clues to think this in the Gospels themselves) and as I say, I look at it with a smile, trying to only search the symbolic message of spiritual purity (instead of the “pharisaic” obsession for physical purity) in it.  And in the end, for me, this dogma is not important at all because, true or false, it doesn’t change ANYTHING versus who Jesus was (the Son of God who possessed the 2 natures), what he accomplished (the definitive revelation of who God really is) and the great human and spiritual value of Mary of Nazareth.  \nIn fact, if this dogma would had never been present in the Credo of the Church, I really don’t think that would have change a thing concerning the heart of the Christian message which is supposed to be focussed around the revelation of who God really is (i.e., Love) by Jesus.  A revelation that reached a pinnacle with his Passion, death and Resurrection…\n\n","date":"August 19, 2012 at 8:04 pm","url":"https://shroudstory.com/2012/08/16/a-winning-shroud-of-turin-expository-speech/","cat":"news_&_views","id":"comment-15230","author":"Yannick Clément","site":"shroudstory"},{"title":"A Winning Shroud of Turin Expository Speech","post":"Thanks for those insightful comments, James.  Do you have a background in this specialty?\n\n","date":"August 19, 2012 at 8:33 am","url":"https://shroudstory.com/2012/08/16/a-winning-shroud-of-turin-expository-speech/","cat":"news_&_views","id":"comment-15207","author":"Andy Weiss","site":"shroudstory"},{"title":"A Winning Shroud of Turin Expository Speech","post":"Not in the Shroud of Turin and the Sudarium of Oviedo. I was (somewhat) raised as a Protestant (I say “somewhat”, because really I was raised by a rather free-thinking mother who believed in Jesus, but she never pushed any belief-system upon me other than reading Bible stories to me from a set of children’s books of Bible stories and occasionally going to a Lutheran church until I was around age five, when we stopped going, and she was nominally Lutheran; and after that I don’t recall her ever talking to me about religion until after my own conversion to Christ), and so I have tended to regard interest in these artifacts as being a part of the Catholic obsession and worship of relics. My conclusion as to Jesus’s divinity isn’t influenced in the least as to the status of these relics.\nSo it doesn’t affect me if they are fakes, but obviously they are very important if they are real.\nThe only reason I became interested in them is due to the writings of Prof. Frank J. Tipler. When I first encountered his original article on these relics I thought he had somewhat gone off the deep end (as I had previously accepted his argument as to the logical necessity of the Omega Point cosmology based upon the known laws of physics). But as I thought more about his arguments as to how via the Principle of Least Action it is possible for such miracles to occur, it made his interest in these relics less strange to me, as I could see how it was actually physically possible per the known laws of physics, as strange as it might seem. (And that is another detail about science: about how contrary to commonsense it is. For example, General Relativity and Quantum Mechanics are so strange and contrary to commonsense that no one even thought to rebuke them before they were developed, precisely because they are so contrary to commonsense that no one even contemplated their possibility before they were actually formulated. That is: reality isn’t merely strange; rather, it is so utterly strange that humans can’t even imagine it without first deriving it via empirical science.)\nHence, I don’t really spend much time in researching or contemplating these artifacts, since their status doesn’t affect my conclusion as to Jesus’s divinity. (Although, as I said, if they are real then obviously they are very important. But their importance in that regard would principally be in relation to non-believers in Jesus’s divinity.) My conclusion regarding Jesus’s divinity is instead based upon other matters, of which I detail in my below article:\nJames Redford, “The Physics of God and the Quantum Gravity Theory of Everything”, Social Science Research Network (SSRN), Aug. 6, 2012 (orig. pub. Dec. 19, 2011), doi:10.2139/ssrn.1974708, http://archive.org/details/ThePhysicsOfGodAndTheQuantumGravityTheoryOfEverything .\n\n","date":"August 20, 2012 at 11:47 am","url":"https://shroudstory.com/2012/08/16/a-winning-shroud-of-turin-expository-speech/","cat":"news_&_views","id":"comment-15269","author":"James Redford","site":"shroudstory"},{"title":"A Winning Shroud of Turin Expository Speech","post":"M. Redford, in your interesting comment, you talk much about the divinity of Jesus (and how your faith in this is not driven at all by the Shroud and the Sudarium) and you also talk much about the importance of the Shroud and the Sudarium if both relics are authentic.  I agree with you to a certain point BUT…  Did you stop asking yourself this question :  And what if the Shroud and/or the Sudarium were talking to us much more about the humanity of Jesus-Christ than his divinity ???\nAlmost every person (I’m not talking about you here) that is interested in the Shroud these days seem to always focus on the divine nature of Christ in relation with the body image on the Shroud to the detriment of the great proofs of his human nature (if these relics are authentic, as I believe they are) !!!!  I think it would be a very good think for most Christians interested in these relics if they could start to focus more on the material proofs (there are many) of the human nature of Jesus that we can trace on these cloths instead of always seeking the marvelous and the supernatural.  By doing this, I’m sure they would start to understand a bit more who Jesus really was and, by implication, who God really is !!!  \nThe Incarnation of God was not a joke and, for me, we can see some great proofs of that on the Shroud of Turin (and maybe also on the Sudarium, except for the fact that I’m not so sure about the authenticity of this other relic associated with Jesus).  And if we push the reflection ever further, we can see the greatness of the love of God in these material proofs of his Incarnation.  That a God accept to share the same humanity (a real humanity like anyone else that was not a semblance of humanity like some heretics thought over the centuries) than ours (with all the implications that goes with this), it tells you a lot about his love for us all !!! \nI think everyone interested in the Shroud should meditate on that for a while…  Personally, the more I look at the Shroud and the more I study it, the more I see the human side of Jesus instead of his divinity (which doesn’t mean I don’t trust in his divine nature).  The Shroud for me represents a great proof of the Incarnation of God, which is really extraordinary (even more than the mysterious image of his body).\n\n","date":"August 23, 2012 at 10:50 am","url":"https://shroudstory.com/2012/08/16/a-winning-shroud-of-turin-expository-speech/","cat":"news_&_views","id":"comment-15406","author":"Yannick Clément","site":"shroudstory"},{"title":"A Winning Shroud of Turin Expository Speech","post":"Dan, that’s an excellent presentation.  I liked her board.  Unique use of low-tech media.\n\n","date":"August 19, 2012 at 8:37 am","url":"https://shroudstory.com/2012/08/16/a-winning-shroud-of-turin-expository-speech/","cat":"news_&_views","id":"comment-15209","author":"Andy Weiss","site":"shroudstory"},{"title":"A Winning Shroud of Turin Expository Speech","post":"Dan, do you know or can anyone provide a link or an address where that incredible paper regarding “the XX male” can be obtained from? Who was in that research team? How did they get access to both cloths and obtain the samples? Is it another fake?\n\n","date":"August 23, 2012 at 12:16 pm","url":"https://shroudstory.com/2012/08/16/a-winning-shroud-of-turin-expository-speech/","cat":"news_&_views","id":"comment-15408","author":"Gabriel","site":"shroudstory"},{"title":"A Winning Shroud of Turin Expository Speech","post":"I added this video to our Multimedia Library (http://shroudnm.com/library.html).\n\n","date":"August 24, 2012 at 8:21 pm","url":"https://shroudstory.com/2012/08/16/a-winning-shroud-of-turin-expository-speech/","cat":"news_&_views","id":"comment-15455","author":"Andy Weiss","site":"shroudstory"},{"title":"A Winning Shroud of Turin Expository Speech","post":"\nJames Redford :\nNot in the Shroud of Turin and the Sudarium of Oviedo. I was (somewhat) raised as a Protestant (I say “somewhat”, because really I was raised by a rather free-thinking mother who believed in Jesus, but she never pushed any belief-system upon me other than reading Bible stories to me from a set of children’s books of Bible stories and occasionally going to a Lutheran church until I was around age five, when we stopped going, and she was nominally Lutheran; and after that I don’t recall her ever talking to me about religion until after my own conversion to Christ), and so I have tended to regard interest in these artifacts as being a part of the Catholic obsession and worship of relics. My conclusion as to Jesus’s divinity isn’t influenced in the least as to the status of these relics.\nSo it doesn’t affect me if they are fakes, but obviously they are very important if they are real….\n\nThanks James for your lengthy answer.  I meant do you specialize in DNA, Physics or the other areas to which you refer?\nAndy\n\n","date":"August 24, 2012 at 8:24 pm","url":"https://shroudstory.com/2012/08/16/a-winning-shroud-of-turin-expository-speech/","cat":"news_&_views","id":"comment-15456","author":"Andy Weiss","site":"shroudstory"},{"title":"A Winning Shroud of Turin Expository Speech","post":"To Yannick – while you mention that the Shroud reveals the human nature of Jesus, it is EQUALLY true that it does reveal the historical TRUTH of His Resurrection as well –  and thus His DIVINE nature.\n Case in point – at the exact moment of the resurrection, a VAST outpouring of X-rays and gamma rays occured leaving behind an imprint for the doubting Thomases of the modern world. The exact nature of this imprint has been studied deeply by experts and they have opined that NO such technology existed in history at that time to confer a “negative”  (as colour-INVERTED in photography)  image on the Shroud. \nThe process is x-ray lithography or laser lithography and most important it is a 3-D Rendition which is IMPOSSIBLE to forge considering the argument of skeptics that it was a forgery!\n Much marterial pointing out to this FACTUM is readily accessible on the Internet for those who need  to validate these statements. In TRUTH, God does NOT need us – rather WE need GOD!\n The funny part is skeptics and athiests readily believe in NDE’s and other Lazarus-like experiences. However, we theorize and rationalize when it comes to Jesus and His Resurrection.\n\n","date":"June 7, 2013 at 9:15 am","url":"https://shroudstory.com/2012/08/16/a-winning-shroud-of-turin-expository-speech/","cat":"news_&_views","id":"comment-36371","author":"orsonmike","site":"shroudstory"}]
