[{"title":"More on The Power of Few Movie","post":"This looks bad… at least they don’t bother with C14 dating, and women, you could see Jesse Bradford “single but dating”.\n\n","date":"February 23, 2013 at 9:09 am","url":"https://shroudstory.com/2013/02/23/more-on-the-power-of-few-movie/","cat":"news_&_views","id":"comment-25399","author":"anoxie","site":"shroudstory"},{"title":"More on The Power of Few Movie","post":"I’ll wait until I see the movie (thinking rental) to vote The Facts of Few, but can they just give it a rest, already?  This movie is the 2nd cloning Jesus from the bloodstains adventure so far this year, following the release of “The Sixth Station” novel last month (the 3rd if you count the final installment of the Punk Rock Jesus comic book series).  In the novel-SPOILER ALERT for those who are wanting to read the book-a 24 chromosome Savior is revealed-half of the normal number plus a Y.\nThis film may experience a similar free fall as the “I’m not Jesus, Mommy” movie, although it  features some pretty well known actors.  The release date of the film is designed to capitalize on, some might even say counteract, the rise in popularity of the Shroud during the Lenten/Easter season.  It’s a pet peeve of mine, admittedly, but such media further erodes the perception of the Shroud in the mainstream-it sets the bar even higher for reaching a level of objectivity.  It was probably the picture of Christopher Walken is the Clone Jesus t-shirt that tipped me over the edge-somehow, I can see these on sale at Target\n\n","date":"February 23, 2013 at 10:21 am","url":"https://shroudstory.com/2013/02/23/more-on-the-power-of-few-movie/","cat":"news_&_views","id":"comment-25405","author":"Kelly Kearse","site":"shroudstory"},{"title":"More on The Power of Few Movie","post":"Funny how both lead actors have the name “Christ” in their name…Christopher Walken and Christian Slater.  Hmmmmm  Maybe they’re onto something!\n\n","date":"February 23, 2013 at 12:39 pm","url":"https://shroudstory.com/2013/02/23/more-on-the-power-of-few-movie/","cat":"news_&_views","id":"comment-25413","author":"Russ Breault","site":"shroudstory"},{"title":"More on The Power of Few Movie","post":"Good one!  :) :)\n\n","date":"February 23, 2013 at 1:33 pm","url":"https://shroudstory.com/2013/02/23/more-on-the-power-of-few-movie/","cat":"news_&_views","id":"comment-25417","author":"Kelly Kearse","site":"shroudstory"},{"title":"More on The Power of Few Movie","post":"Whether the movie is good or bad, it’s safe to say this movie would not have been released in 1989.\n\n","date":"February 23, 2013 at 9:55 pm","url":"https://shroudstory.com/2013/02/23/more-on-the-power-of-few-movie/","cat":"news_&_views","id":"comment-25450","author":"Joe Marino","site":"shroudstory"}]
