[{"title":"25,000 Comments and Counting","post":"“John” (aka the “Beloved Disciple”) and Peter finding the burial cloths together without the body is “Story”, Yannick, written nearly a full half century after the undocumented life and times of Jesus…   almost like you as the Beloved Disciple and the Church rediscovering the burial cloths (aka the Shroud and the Sudarium) today.  I can, however, document that I went to Woodstock with my younger sister and our guitar teacher in 1969.\n\n","date":"March 1, 2014 at 6:32 am","url":"https://shroudstory.com/2014/03/01/25000-comments-and-counting/","cat":"news_&_views","id":"comment-83738","author":"Annette Cloutier","site":"shroudstory"},{"title":"25,000 Comments and Counting","post":"Congratulations! \nHere’s to the next 25k \nDavid \nSent from mobile. \n>\n\n","date":"March 1, 2014 at 7:56 am","url":"https://shroudstory.com/2014/03/01/25000-comments-and-counting/","cat":"news_&_views","id":"comment-83762","author":"davidrolfe126","site":"shroudstory"},{"title":"25,000 Comments and Counting","post":"I saw Arlo when he recorded Alice’s Restaurant  at the Newport Folk Festival…1969?  Not sure the year.  My dad was with the Kiwanis club that handled all the concessions.  We got in free for many years during my early teens.  Then I saw him again about five years ago.  Sounded the same 40 years later.  I don’t want a pickle, I just want to ride my motorsickle.  Congrats on 25K comments!\n\n","date":"March 1, 2014 at 8:19 am","url":"https://shroudstory.com/2014/03/01/25000-comments-and-counting/","cat":"news_&_views","id":"comment-83768","author":"Russ Breault","site":"shroudstory"},{"title":"25,000 Comments and Counting","post":"Re the famous #25,000 comment: \n  “[…] the most important thing to understand from this account is the fact that not only did he and Peter found the tomb empty that morning, but also ALL [my upper cases] the burial cloths that were left there without the body. That’s what really matter.”\n  On which ground can Yannick assert “ALL” the burial cloths were left there without the body? How can he tells for sure? This is just an aprioristic opninon. \n  What about the (real) possibility of the long inner shroud or sindon missing and Yeshua appearing not stark naked to Mary Magdalene but draped in it like a gardener (Reminder in the Second Temple period, a long sindon could be used as inner garment, indoor wear, spring/summer outdoorwear and… workwear).\n The exegesis of John’s account of the empty tomb is far more tricky than YC can think.\n\n","date":"March 1, 2014 at 10:16 am","url":"https://shroudstory.com/2014/03/01/25000-comments-and-counting/","cat":"news_&_views","id":"comment-83801","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"25,000 Comments and Counting","post":"You don’t miss a thing Max.  Ok…  You can forget the “all” in my comment and concentrate on the heart of the comment (which is not found in the word “all”). \nNevertheless, along with the “sudario” that was folded in another place, the word “othonia” normally mean “cloths” in the plural…  So, I assume there were more than one cloth found and, if it is so, I don’t have a hard time believing the total was the same as the total that was used during the burial procedure on Friday.\n\n","date":"March 1, 2014 at 10:08 pm","url":"https://shroudstory.com/2014/03/01/25000-comments-and-counting/","cat":"news_&_views","id":"comment-83943","author":"Yannick Clément","site":"shroudstory"},{"title":"25,000 Comments and Counting","post":"Yannick, \nOthonia is Greek in the DIMINUTIVE plural, which means they were distinct from the soudarion, a MUCH LARGEr shroud (soudarion is Greek transcription for Aramaic sudara) that was rolled up on itself and left on the burial vaulted bench. \nThe inner long sindon/shroud as a large shroud too could itself have been distinct from the othonia and yet not be the soudara. This is a real possibility. Then it could account for Yeshua appearing to the Magdalene wearing a (stained) sindon in the manner of a gardener (reminder: RED earth is best earth for fruit trees and vegetables) and all the pieces of the puzzle fit together. \nIf you “miss” that, you just cannot really account for the Magdalene identifying the messengers/angels as messengers/angels yet mistaking at first sight her very own master for a gardener.\n\n","date":"March 4, 2014 at 7:43 am","url":"https://shroudstory.com/2014/03/01/25000-comments-and-counting/","cat":"news_&_views","id":"comment-84792","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"25,000 Comments and Counting","post":"Did I win something??? A Shroud replica or maybe an official photo taken by Barrie Schwortz??? :-)\n\n","date":"March 1, 2014 at 10:03 pm","url":"https://shroudstory.com/2014/03/01/25000-comments-and-counting/","cat":"news_&_views","id":"comment-83940","author":"Yannick Clément","site":"shroudstory"},{"title":"25,000 Comments and Counting","post":"The Trophy went to Anonymous :-)\n\n","date":"March 1, 2014 at 11:07 pm","url":"https://shroudstory.com/2014/03/01/25000-comments-and-counting/","cat":"news_&_views","id":"comment-83955","author":"Mike M","site":"shroudstory"},{"title":"25,000 Comments and Counting","post":"Ha ha ha!  Great reply!  Yesterday, I though to write “At least, the winner was not Anonymous!”. ;-)\n\n","date":"March 2, 2014 at 5:51 pm","url":"https://shroudstory.com/2014/03/01/25000-comments-and-counting/","cat":"news_&_views","id":"comment-84195","author":"Yannick Clément","site":"shroudstory"}]
