[{"title":"A “Y” Shaped Crucifixion According to the Shroud of Turin?","post":"The Y cross is not a new idea. But a T cross could still have been used depending on the slumping of the body downward, creating the same Y effect. The main argument against a Y cross is where did Pilate’s edict get placed. Tradition has it above the accused, but there is no ‘above’ with a Y.\n\n","date":"April 2, 2014 at 4:18 pm","url":"https://shroudstory.com/2014/04/02/a-y-shaped-crucifixion-according-to-the-shroud-of-turin/","cat":"news_&_views","id":"comment-95920","author":"David Goulet","site":"shroudstory"},{"title":"A “Y” Shaped Crucifixion According to the Shroud of Turin?","post":"It is nothing new, we all have known this for a long time. What bothers me is this:\nFinal paragraph:\nWhoever made the Shroud must have been a skilled forger to create the correct blood spatter for a crucifixion. The alternative is that they made the right pattern by chance. “It could be that the artist just decided to draw the rivulets of blood parallel to the arms for artistic reasons,” says Borrini.\nWhy do they have automatically assume that Shroud is a fake?\n\n","date":"April 2, 2014 at 4:22 pm","url":"https://shroudstory.com/2014/04/02/a-y-shaped-crucifixion-according-to-the-shroud-of-turin/","cat":"news_&_views","id":"comment-95921","author":"O.K.","site":"shroudstory"},{"title":"A “Y” Shaped Crucifixion According to the Shroud of Turin?","post":"The only way you can produce a fake shroud of Christ with these sorts of blood and serum stains on it is to envelop the tortured, scourged and crucified corpse of a man for several hours (but no more than a few days).  In the light of the bloodstains evidence, that’s the ONLY forgery scenario that could have any chance to be true in the case of the Shroud and, seriously, the odds against that are very high.\n\n","date":"April 2, 2014 at 4:34 pm","url":"https://shroudstory.com/2014/04/02/a-y-shaped-crucifixion-according-to-the-shroud-of-turin/","cat":"news_&_views","id":"comment-95923","author":"Yannick Clément","site":"shroudstory"},{"title":"A “Y” Shaped Crucifixion According to the Shroud of Turin?","post":"The video shows that whatever direction blood travels in, it tends to travel in more or less a straight line. The shroud ‘rivulets,’ whether down the arms, from the spear wound or across the back, have an entwined or zigzag patten which is artistic rather than realistic. An attempt to explain them was that Jesus varied his position from ‘slumped’ (the Y shape), with his weight entirely on the nails in his hands, to ‘upright,’ with his weight entirely on the nails in his feet. It didn’t really succeed in explaining the twisted blood trails though.\n\n","date":"April 2, 2014 at 6:26 pm","url":"https://shroudstory.com/2014/04/02/a-y-shaped-crucifixion-according-to-the-shroud-of-turin/","cat":"news_&_views","id":"comment-95948","author":"Hugh Farey","site":"shroudstory"},{"title":"A “Y” Shaped Crucifixion According to the Shroud of Turin?","post":"Actually it’s the other way around. Its usually zigzag rivulets in real life, see\nhttp://www.smh.com.au/entertainment/movies/actor-thrown-through-taxi-windscreen-20100805-11h6j.html\nOne reason would be the uneven surface of the arm as different muscles are conracted. Also as the blood continues to flow, blood clots form on the skin and the blood has to find a different route.\n\n","date":"April 2, 2014 at 7:27 pm","url":"https://shroudstory.com/2014/04/02/a-y-shaped-crucifixion-according-to-the-shroud-of-turin/","cat":"news_&_views","id":"comment-95959","author":"Mike M","site":"shroudstory"},{"title":"A “Y” Shaped Crucifixion According to the Shroud of Turin?","post":"\nHugh Farey :\nThe video shows that whatever direction blood travels in, it tends to travel in more or less a straight line. The shroud ‘rivulets,’ whether down the arms, from the spear wound or across\nthe back, have an entwined or zigzag patten which is artistic rather than realistic. An attempt to explain them was that Jesus varied his position from ‘slumped’ (the Y shape), with his weight entirely on the nails in his hands, to ‘upright,’ with his weight entirely on the nails in his feet. It didn’t really succeed in explaining the twisted blood trails though.\n\nCould sweat, dirt, grime play a factor?  Partial wiping, removal of certain blood areas, if for example a cloth was used to support the lower back in the lowering, transport of the body?\nIt would seem a lot of details are unknown.\n\n","date":"April 2, 2014 at 7:06 pm","url":"https://shroudstory.com/2014/04/02/a-y-shaped-crucifixion-according-to-the-shroud-of-turin/","cat":"news_&_views","id":"comment-95957","author":"Kelly Kearse","site":"shroudstory"},{"title":"A “Y” Shaped Crucifixion According to the Shroud of Turin?","post":"Barbet provides a very rational explanation. The arms were laid along the horizontal patibulum on the ground, sometimes with binding to prevent struggling. After nailing the hands or wrists, the patibulum was raised onto the stipes, the weight of the body resulted in the arms taking up a position at 65 degrees to the vertical, which matches the line of blood flows. Barbet provided some calculations showing how this was the natural angle for the arms to take. Subsequent investigators, even Zugibe, have accepted the 65 degree angle asserted by Barbet.  It is not necesary for a Y-shaped cross to obtain this angle; it is the natural result of the body falling under its own weight. Barbet was able to cite classical references describing the Roman method of crucifixion.  There is no evidence tht a Y-shaped cross was ever used by the Romans.\n\n","date":"April 2, 2014 at 8:12 pm","url":"https://shroudstory.com/2014/04/02/a-y-shaped-crucifixion-according-to-the-shroud-of-turin/","cat":"news_&_views","id":"comment-95967","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A “Y” Shaped Crucifixion According to the Shroud of Turin?","post":"I agree 100% with all you said.\n\n","date":"April 3, 2014 at 8:30 am","url":"https://shroudstory.com/2014/04/02/a-y-shaped-crucifixion-according-to-the-shroud-of-turin/","cat":"news_&_views","id":"comment-96134","author":"Yannick Clément","site":"shroudstory"},{"title":"A “Y” Shaped Crucifixion According to the Shroud of Turin?","post":"I don’t think there is any suggestion in either the video above or the New Scientist article that the cross was Y-shaped, and think the whole point of the exercise may have been mis-represented, as I don’t think I have ever seen a crucifix attempting to be a more or less accurate depiction that didn’t have the arms elevated above the horizontal, so a ‘discovery’ that the arms were in a Y position is utterly unexciting. However, there have only been a few, unsatisfactory, attempts to produce shroud-shaped dribbles down the arms, and further research into how, or whether, those patterns could have been produced naturally is welcomed.\n\n","date":"April 3, 2014 at 4:09 am","url":"https://shroudstory.com/2014/04/02/a-y-shaped-crucifixion-according-to-the-shroud-of-turin/","cat":"news_&_views","id":"comment-96073","author":"Hugh Farey","site":"shroudstory"}]
