[{"title":"More Testing? Maybe.","post":"I am not sure what Willard Libby had to do with the 1988 testing as he died in 1980- perhaps an intervention disputing the findings from on high.\nAnyway good news that the archbishop seems open to new testing- there are lots of respected conservation labs able to do it.\n\n","date":"April 13, 2015 at 4:02 am","url":"https://shroudstory.com/2015/04/13/more-testing-maybe/","cat":"science","id":"comment-196190","author":"Charles Freeman","site":"shroudstory"},{"title":"More Testing? Maybe.","post":"“On his previous history and its antiquities ‘there’ agreement: radiometric dating with the technique of Carbon 14, performed in 1988 and considered inadequate by the same creator, American chemist Willard Libby, has dated the construction of the sheet between 1260 and 1390, but supporters of authenticity ‘of the relic argue that the samples used could also come from parts mended after the fire of 1532.”\nThis includes Google’s common and unfortunate tendency to ignore negatives. A better translation might be:\n“On its previous history and provenance there is no agreement. Radiometric dating in 1988, using the Carbon 14 technique invented by American chemist Willard Libby, who himself acknowledged its limitations, dated the manufacture of the cloth between 1260 and 1390, but supporters of authenticity of the relic argue that the samples used could also come from parts mended after the fire of 1532.”\nMaking the translation a little more correct makes the whole article a little less incorrect, although it is surely acknowledged by everyone that any repair to the C14 corner was not as a result of the 1532 fire.\n\n","date":"April 13, 2015 at 4:24 am","url":"https://shroudstory.com/2015/04/13/more-testing-maybe/","cat":"science","id":"comment-196193","author":"Hugh Farey","site":"shroudstory"},{"title":"More Testing? Maybe.","post":"Science requires openness. Start by releasing the HD version of HAL9000, not just the iPad toy. Make the carbon scrapings and other vacuumed dust from the 2002 conservation available for testing. Do the same with the photographs taken in 2002.\n\n","date":"April 13, 2015 at 5:11 am","url":"https://shroudstory.com/2015/04/13/more-testing-maybe/","cat":"science","id":"comment-196197","author":"Paulette","site":"shroudstory"},{"title":"More Testing? Maybe.","post":"Agreed.\n\n","date":"April 13, 2015 at 9:16 pm","url":"https://shroudstory.com/2015/04/13/more-testing-maybe/","cat":"science","id":"comment-196264","author":"Andy","site":"shroudstory"},{"title":"More Testing? Maybe.","post":"“found on samples of wire traces of human blood group AB;”\nReally? What’s the evidence for that claim?\n“All historians believe documented the history of the relic from the middle ‘of the fourteenth century, the date of his appearance.”\nThis mades Hugh’s point that the C14 dates agree with the historians. What are the odds of that? DaveB makes the point that samples should have been taken from other parts of the Shroud. That might be a wise idea.\nI’m still on the fence on the Shroud.\n\n","date":"April 13, 2015 at 5:59 am","url":"https://shroudstory.com/2015/04/13/more-testing-maybe/","cat":"science","id":"comment-196202","author":"John Green","site":"shroudstory"},{"title":"More Testing? Maybe.","post":"It is not clear when exactly Archbishop Cesare Nosiglia made these comments. Anyway, if authorisation is obtained from Pope Francis, the following would have to be done:\n– an examination of all the material collected during the restoration. It would help to have what remains of the pollen grains in Max Frei Sulzer’s collection, now in the US.\n– an examination of the almost 2000 microphotographs, also in the possession of the archdiocese of Turin\n– non-invasive examination of the relic. An exception would be confirmation of non-image areas below the bloodstains\n– scientists/institutions would have to be chosen very carefully, preferably under the supervision of Archbishop Marcelo Sánchez Sorondo, Chancellor of the Pontifical Academy of Sciences\nSince high complexity is involved when it comes to the Shroud, and doubts will arise, it would be advisable to examine the Sudarium of Oviedo simultaneously:\nhttps://www.academia.edu/11804110/Is_the_Sudarium_of_Oviedo_the_key_to_unraveling_the_mystery_of_the_Shroud_of_Turin\n\n","date":"April 13, 2015 at 8:12 am","url":"https://shroudstory.com/2015/04/13/more-testing-maybe/","cat":"science","id":"comment-196217","author":"Louis","site":"shroudstory"},{"title":"More Testing? Maybe.","post":"Since there has been a great deal of work done on ancient  linens in recent years, including many with images on them, one would hope that there would be comparative studies with these as well. STURP famously said that it had not examined any painted linens. Now is the time to try!\n Again it is about time someone did some work on ancient and medieval looms and related them to the patterns and dimensions of the Shroud. And, de Wesselow having failed to explore this aspect of the Shroud at all, the iconography of the pattern of bloodstains and scourge marks needs exploring by art historians, relating those on the Shroud to other examples. \nMuch of this can actually be done without examining the Shroud, just as the dating of the horses of St. Mark’s in Venice could be done by establishing (from other examples of gilded copper) a date line of copper gilding to which the horses’ own gilding could be neatly fitted in and so confirm that they were second-third century AD and not several centuries earlier.\nAbove all there needs to be the will to do what the archbishop says and approach the Shroud without any preconceptions.\n\n","date":"April 13, 2015 at 8:42 am","url":"https://shroudstory.com/2015/04/13/more-testing-maybe/","cat":"science","id":"comment-196219","author":"Charles Freeman","site":"shroudstory"},{"title":"More Testing? Maybe.","post":"It seems to me that our discussions sometimes (or perhaps often)\nending up in dead spots …\nSee for example the past argument:\n“The Manoppello: This little cloth cannot be further ignored in Shroud research!”\n(June 18, 2014)\n“OK” answered (to me) in this manner:\n>Spectroscopic analysis are of course possible.\n>There is some minor problem with glass, which has its systematic effect on transparency indifferent wavelenght, which should be taken into account.\n>According to interview with prof. Jaworski (see  http://www.manoppello.eu/html/jaworski.html , only polish version, sorry,\ntry Google Translator), the glass is not transparent in the UV band that\nis responsible for byssus fluorescence.\n>The blood should be no great problem, but if you want to know my opinion, I doubt that those blood stains are real blood. Rather images of bloodstains.\nHave you perhaps heard interesting news about new spectroscopic\nexaminations on the Veil of Manoppello?\nIf we want to try to enter in the “great scientific game”\nwe can not limit ourselves only to opinions…\nDemonstrate the ability to do a spectrosocpic check\nin transparency of a marine byssus is not difficult.\nIn June 20, 2014 I wrote:\n>… years ago I have sent a request to I.N.O.A. (Florence)…\n>Until now (and despite the very interesting claims by Donato Vittore, Giulio Fanti, etc.)\nI have not yet seen the inherent useful spectroscopic examinations\n(= transparence spectroscopy, etc.).\nI do not think that the transparence spectroscopy (despite the problems highlighted by OK = … systematic effect on transparency in different wavelength, which should be taken into account, … the glass is not transparent in the UV band that Is responsible for byssus fluorescence, … etc.) is so difficult to obtain.\nI believe it is necessary to have work plans credible and possibly already adequately funded… or fundable.\nThe same can be said for the controls on the materials already collected\n(ie, already available […if then will come the necessary permissions to perform the work!]\nand without having to perform additional manipulations of the Cloth) by the Holy Shroud …\nCharles pointed the finger toward the great deal of work done on ancient linens in recent years…\nWell. I don’t know what exactly he has in his mind…\nInstead I am sure that we have to start with what we already can have at disposal, without other manipulation on the Ancient Linen.\nYou can get thousands of euros in support of innovation if you have credible plans.\nThat is, if possible, with plans of multinational collaboration …\nSo we need to work in the field of textile innovation in order to be credible\nand access to finance.\n— — —\nAlthough I judge the provocative idea of Charles as actually\nan impossible solution, I would like to see emerge (as contrast)\nthe real possibility of new tests and also AFM controls on linen fibers,\nin order to be able to give probabilistic indications on the age\nof the precious material without having to destroy the same\nwith the C14 tests!\n— —\nSo…\nWho should give money to the adventurers?\nWho should give money to the adventurers, who\n(perhaps) want to do new (spectacular) manipulations on the Cloth?\nFirstly we have to work with the material already taken.\nIn my opinion we have not yet reached the right level\n(apart few particular/interesting attempts by Eng. Fanti)\nto do the preparatory works…\nThe issue appears to be quite serious.\nI hope that the Pope, the Cardinal caretaker (the Keeper,\nthe actual Archbishopp Nosiglia) who is in Turin\nand the scientific advisers may well ponder the question…\nWhat is your opinion?\n\n","date":"April 13, 2015 at 9:59 am","url":"https://shroudstory.com/2015/04/13/more-testing-maybe/","cat":"science","id":"comment-196222","author":"piero","site":"shroudstory"},{"title":"More Testing? Maybe.","post":"Research on ancient linens. Piero says that he does not know what I am getting at. In recent years there has been an outburst of research on what had been a neglected area of art history, medieval painted linens. In particular, there has been research on the pigments used, the way that these have been built up to make an image and the problems of decay of pigments. So anyone researching the surface of the Shroud should be up-to-date with this research.\n\n","date":"April 14, 2015 at 1:03 am","url":"https://shroudstory.com/2015/04/13/more-testing-maybe/","cat":"science","id":"comment-196278","author":"Charles Freeman","site":"shroudstory"},{"title":"More Testing? Maybe.","post":"Can you point me to some of this research? Surely, some papers are online re “research on the pigments used, the way that these have been built up to make an image and the problems of decay of pigments.”\n\n","date":"April 14, 2015 at 4:28 am","url":"https://shroudstory.com/2015/04/13/more-testing-maybe/","cat":"science","id":"comment-196290","author":"Dan","site":"shroudstory"},{"title":"More Testing? Maybe.","post":"Thanks, Dan. A good place to start is Caroline Villers’ (ed.) The Fabric of Images : European Paintings on Textile Supports in the Fourteenth and Fifteenth Centuries (Archetype Publications, 2000). The essays here have a lots of information on all these issues, many of them from experts who have been working on repairing decayed painted linens.\nThere is a new Archetype volume on painted linens out last year but it is too expensive for me at the moment and i am trying to track down a library copy.\nIf you google ‘medieval painted linens’ you get a variety of papers showing just how prevalent painted linens were in the medieval period.\nThe journal Medieval Textiles also has articles.I liked the discussion of painted wall hangings in York by Dr. Charles Kightly in the June 2001 edition. He shows how vulnerable the painted surfaces were so that despite the many wall hangings mentioned in medieval inventories we do not have a single English survival today.\nHowever, my point is that it is clear from these articles that there are a number of people involved in the restoration of painted textiles and that one would hope that they would be involved in an ideology/preconception free analysis of the Shroud.\n\n","date":"April 14, 2015 at 5:14 am","url":"https://shroudstory.com/2015/04/13/more-testing-maybe/","cat":"science","id":"comment-196293","author":"Charles Freeman","site":"shroudstory"},{"title":"More Testing? Maybe.","post":"… And here is what is my opinion: the study\n[= Caroline Villers, ed., The Fabric of Images: European Paintings on Textile Supports in the Fourteenth and Fifteenth Centuries. London: Archetype Publications, 2000. Paper. Pp. x, 117 plus color figures; black-and-white figures and 1 table]\npublished in 2000 can not be a good starting point because I think it is necessary to use advanced microscopies (SPM = AFM, CFM, SNOM) in order\nto demonstrate the probable truth about\nthe probable epoch of the Shroud of Turin!\n\n","date":"April 15, 2015 at 9:40 am","url":"https://shroudstory.com/2015/04/13/more-testing-maybe/","cat":"science","id":"comment-196415","author":"Piero","site":"shroudstory"},{"title":"More Testing? Maybe.","post":"I wrote:\n>Archbishopp Nosiglia\nInstead of:\n>Archbishopp Nosiglia\nI beg your pardon.\n—- —-\nIn short: the heat of the speech has prevailed on the correct writing\n—- —– —-\nI don’t think that most skeptics think the image is not a burial shroud, but a painting and a pious hoax. Another thing: I don’t know the exact weight of such a opinion…\nIn any case I should be curious to observe the reactions regarding my past proposal (as in a good remake …submitted to the large public).\nWhat is your idea ?\n\n","date":"April 13, 2015 at 10:16 am","url":"https://shroudstory.com/2015/04/13/more-testing-maybe/","cat":"science","id":"comment-196223","author":"piero","site":"shroudstory"},{"title":"More Testing? Maybe.","post":"If he’s the archbishop, he is not a monsignor.\n\n","date":"April 13, 2015 at 9:15 pm","url":"https://shroudstory.com/2015/04/13/more-testing-maybe/","cat":"science","id":"comment-196263","author":"Andy","site":"shroudstory"},{"title":"More Testing? Maybe.","post":"Andy, he signs his name: + Mons. Nosiglia, Metropolitan Archbishop of Turin. I’m told that once the honorific title is granted, it may be used for life. Pope Francis is simplifying things, however. According to Wikipedia: “Soon after his election in March 2013, Pope Francis suspended the granting of the honorific title of Monsignor except to members of the Holy See’s diplomatic service.[11][12] In December of the same year he communicated his definitive decision to accept no further requests from bishops for appointments to any class but that of Chaplain of His Holiness, the lowest of the three classes, and that candidates presented must be at least 65 years old. He himself, during his 15 years as archbishop of Buenos Aires, never asked that any of his priests receive the title, and he was understood to associate it with clerical “careerism”.[13]\nYou also might want to check out the Diocese of Turin website page at http://www.diocesitorino.it/diocesi_di_torino/arcivescovo/00024135_Arcivescovo.html. It is clearly his preference as most news articles also show him as Mons. Cesare Nosiglia.\n\n","date":"April 13, 2015 at 11:29 pm","url":"https://shroudstory.com/2015/04/13/more-testing-maybe/","cat":"science","id":"comment-196272","author":"Dan","site":"shroudstory"}]
