[{"title":"Mount Everest is only 29,000 feet high","post":"And the top of Mt Everest would you believe is marine limestone, presumably manufactured by trilobites 100s of millions of year ago!  That flies in the face of the creationists.  You never know where natural curiosity may lead, except that the results are often surprising and enlightening about the nature of the divine.\n\n","date":"September 20, 2012 at 4:12 pm","url":"https://shroudstory.com/2012/09/20/mount-everest-is-only-29000-feet-high/","cat":"news_&_views","id":"comment-16607","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Mount Everest is only 29,000 feet high","post":"I simply find the subject fascinating and have been touched by my own studies, little though they may be when compared to others.\n\n","date":"September 21, 2012 at 11:04 am","url":"https://shroudstory.com/2012/09/20/mount-everest-is-only-29000-feet-high/","cat":"news_&_views","id":"comment-16683","author":"Andy Weiss","site":"shroudstory"},{"title":"Mount Everest is only 29,000 feet high","post":"Touché\nI’m sorry Daveb, but science and religion have never been the enemies you think.  Much as people like to repeat it, for the most part, it’s just not true.  You do have your “young earth” proponents but it matters not to the faithful when “God created…”  He inhabits eternity–what’s a few million years?  Can you wrap your mind around that?\nBlessings!\nDan,\nYour answer was very kindly fielded and made me laugh!  And thanks to you, I’m headed to Charlotte next weekend with some others!  Thanks again!\n\n","date":"September 22, 2012 at 11:13 am","url":"https://shroudstory.com/2012/09/20/mount-everest-is-only-29000-feet-high/","cat":"news_&_views","id":"comment-16742","author":"Sheila","site":"shroudstory"},{"title":"Mount Everest is only 29,000 feet high","post":"Sorry to you Sheila, you misunderstand the intent of my comment.  My barb was aimed at biblical literalists who interpret the poetry of Genesis too literally.  The reference to marine limestone on the top of Mt Everest comes from “The Seashell on the Mountain Top” by Alan Cutler, Heinemann 2003, the biography of Nicolas Steno, 1638-86, Danish pioneer geologist who laid the foundations of modern stratigraphy.  Few scientists accepted Steno’s theories, except for Gottfried Leibniz, they all believed that fossils were remnants of Noah’s flood, or that they grew within the rocks, and that the earth was only 6000 years old.  The Catholic Church, having learnt its lesson from the Galileo case were one of the few institutions that were prepared to accept Steno’s theories.  Steno became disenchanted with the bickerings within the scientific establishments of his time, entered Holy Orders and lived a life of extreme frugality.  Pope John Paul II beatified him in 1992, somewhat ironically on October 23 the same date that Archbishop Ussher had set for the creation of the world.  I think the best line in the book is “The summit of Mount Everest is marine limestone.”\n\n","date":"September 22, 2012 at 5:07 pm","url":"https://shroudstory.com/2012/09/20/mount-everest-is-only-29000-feet-high/","cat":"news_&_views","id":"comment-16760","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Mount Everest is only 29,000 feet high","post":"Daveb,\nMy apologies to you!  I suppose I misunderstood your generalization of “creationists.”  Sorry ’bout that.\n\n","date":"September 23, 2012 at 10:41 am","url":"https://shroudstory.com/2012/09/20/mount-everest-is-only-29000-feet-high/","cat":"news_&_views","id":"comment-16801","author":"Sheila","site":"shroudstory"},{"title":"Mount Everest is only 29,000 feet high","post":"I had asked Mr. P about his efforts here in an email & he posted it above.  I went from mildly curious to wildly fascinated.  Mostly because I still have no idea why one would invest so much in this area – either way – prove or disprove.  Neither can be accomplished and to do would accomplish what?  So … this is just a hobby?  What is it exactly?  Do you hope to try & prove the authenticity?  If yes … why?  An entire site dedicated to what exactly, regarding the shroud?  Honestly, I’m now hung on just trying to grasp the purpose :-)\nBTW – I would like to point out to DaveB that anything “presumably manufactured” cannot fly in the face of anything.  Additionally, the assertion that anything involved here is 100 million yrs old … is literally & can only be “presumed” as any existing science from the geologic timetable to physical dating efforts in a lab cannot prove this; as dating efforts have massive limitations in only going back a couple thousand years & the geo-timetable is built completely and necessarily on speculation.\nI agree in part w/ Shelia that truth & science shall never conflict.  Religion & science do so daily.  However, I consider myself among the faithful & when God created the earth matters to me & I believe should.  You may feel comfortable embracing the earth being a few million years older but it presents massive problems with your ability to gain much (& ultimately possibly anything) from the bible, if you do.  If God hung the sun & moon on the 4th day – that established a day as 24 hr increments that remain to this day.  It would be completely inconsistent and in fact make no real sense at all if God referred to the first few days in poetic terms of ‘day’ when they were really collections of millennia – only to establish Swiss precision on the 4th day while using the exact same descriptions for his creative process.\nTo DaveB, I share that I am a biblical literalist as scientifically, I must be.  There exists no scientific reason to not be so & indeed every reason scientifically to embrace the bible as issued.  Meaning, I may dismiss it as nonsense but I am scientifically disallowed buffeting my selections of what truth, I may derive from it.  Where clearly conveying literal events … literal.  Where analogy … analogy.  Poetry … etc.  I’m just saying that the coolest aspect of what is purported to be God’s inerrant word, mandates that we recognize it as structured and designed as an information repository.  Science determines this.  Any other approach to understanding it at all becomes a cloudy virtual pointless exercise in selective literalism, it’s-a-cool-old-book-w/-religious-stuff-in-it, or similar.\nAnyway – thoughts? tim\n\n","date":"September 24, 2012 at 12:03 pm","url":"https://shroudstory.com/2012/09/20/mount-everest-is-only-29000-feet-high/","cat":"news_&_views","id":"comment-16867","author":"Tim Davis","site":"shroudstory"},{"title":"Mount Everest is only 29,000 feet high","post":"Response to Tim:\nFrom the known rate of conversion of Hydrogen to Helium, we know that our sun is about half-way through its expected life of 8 billion years, and is now about 4 billion years old.  We know that the heaviest element that can be produced by nuclear synthesis in the sun is Iron, about half-way through the Periodic Table.  The other heavier elements can only be produced by an explosive super nova.  From the known constant speed of light, the rate of recession of remote galaxies and the limits of our visibility, we know that the universe is roughly 14 billion years old, about three sun lives.  We are in fact made of star-dust! \nNone of this was known to the ancient patriarchs, nor the writers of the New Testamment and it has only become known to us in the last few hundred years, or even less.  They had a calling to communicate the Word of God, and this had to be done within a comprehensible cultural context of their time and place.  To God, a million years is but a day, in fact there is no time with God, – everything for God is NOW, our ancient past and our unknown future!  Who can know the mind of God?  \nThe Old Testament was not written down complete and “issued” once and for all at one paricular time.  It was a process that took some thousands of years, from ancient folk stories told around camp fires, through the monotheism of Abraham, the Exodus and wanderings through the desert, the Davidic dynasty, the Babylonian exile, and the triumphalism of the Macchabees.  There is poetry and music there in the Psalms and the Canticles of Canticles, there are guides to proper behaviour in the Proverbs and Wisdom selections, There is a call to repentance in the prophets, and there is a history of a peoples on their way to God. \nThe original Creation story is in chapter 2 of Genesis.  It is a primitive story, God is seen as anthropomorphic, He walks in the Garden, and talks, He asks questions “Where are you?”, He forms the woman from a rib taken from Adam.  We have a talking snake.  Around 540 BC, the banished exiles encountered Babylonian science, and so reformulated a more elevated story of Creation which we find now placed in Chapter 1 of Genesis.  However they were not about to abandon the truths they felt were contained in the ancient story of Chapter 2, and retained it.  They heard of the flood stories such as those in the Epic of Gilgamesh, resulting from random unpredictable flooding of the Tigris and Euphrates.  They took this story, gave it a divine meaning to their purposeful God, and incorporated it into their ancient story of Noah.   \nWhen we come to the Shroud, it remains a scientific mystery.  Some see it as primary evidence of the Resurrection, a fifth gospel, a love letter from Jesus, comprehensible only in our own time with our technology.  Modern man imagines he knows better than the ancients, dismisses the old religion as myths now irrelevant, “God is dead!” The guide to proper behaviour, if there is such thing, is enlightened self-interest.  The Resurrection of Jesus is impossible to contemplate.  The Shroud has the potential to be a silent witness to those lies!\n\n","date":"September 25, 2012 at 5:27 pm","url":"https://shroudstory.com/2012/09/20/mount-everest-is-only-29000-feet-high/","cat":"news_&_views","id":"comment-16909","author":"daveb of wellington nz","site":"shroudstory"}]
