[{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"Thanks very much, Dan, Thibault, and Barrie!\n\n","date":"November 18, 2013 at 5:24 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-51859","author":"Hugh Farey","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"Great one to start with as it shows, what Gilbert Raes spotted, that the threads of the Shroud vary considerably in thickness. That should give the weaving experts something to talk about because it says something about the quality of the cloth compared  to others where there has been a deliberate attempt to achieve consistency. One for the textile experts to enlighten us on.\n\n","date":"November 18, 2013 at 5:58 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-51861","author":"Charles Freeman","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"I think that this is an impressive display. My first impression is the randomness of transient, promiscuous [secondary meaning],   detritus (a lot of big words) fibers and such that do not appear to be apart of the original fabric. \nPerhaps the this display gives us common ground so that skeptics or authenticity advocates can make specific reference to one of these photos which are the best definition readily available for discussion.\nAs far as Charles F’s comment, I would say these pictures as well as the issue of the Shroud in general demands a multi-disciplinary approach. For example the highest resolution of these photos appears to 64X in item 5-2. Brown went to more than 3000x for his Scanning Electronic Microscope photographs.\n While each discipline as some thing to add, each is in its own way is incomplete. We are literally like the blind man and the elephant. Or to turn to another cliche, we have to see the forest that is composed of the trees. The fact is that STURP was multi-disciplinary. \nFor example when Machthild Flury-Lemberg says there cotton throughout the Shroud was she talking about transients isolated fibers like some of fibers we see in these 32X or 64X photos, Or is he talking about something she observed at 3000x with a SEM? Did she use a pocket magnifier? Was the power as high as 32X? I have my doubts she used 64X or even 32X. (OMG, am I a skeptic?) \nPlease skeptics state your magnification for any observation you wish to make.  \n(Dan I expect your problem with this is that PDF file is protected from copying.)\n\n","date":"November 18, 2013 at 8:38 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-51872","author":"John Klotz","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"‘The fact is that STURP was multi-disciplinary.’ Well, only to a point, it had no expert in ancient textiles, no historian and no art historian. So we have no STURP report on the weave,for instance placing it alongside other linen weaves that are known from earlier periods. We know a lot about the contexts in which the Shroud was stored and displayed since 1350 and there needed to be a report on how this might have affected/ damaged the images -one can hardly expect there have to be no effect over this length of time.  So a historian needed to list everything that is known about the expositions – many took place in the open air  and would not be cancelled if it rained on the Shroud’s feast day 4th May when huge unmanagable crowds had gathered in Turin.\nAs a result the STURP reports cannot be considered to be definitive- they simply leave too many gaps. Again, while the STURP team said that it wanted to be non-invasive of the Shroud ,etc, there is no record of them having a textile conservationist on hand in Turin to advise them on this as they went about their work. I am not an expert but have worked with archaeologists on ancient materials  and I squirmed when reading Heller’s account of the STURP assault on the Shroud.\nRogers and Schwalbe’s Physics and Chemistry of the Shroud acknowledged the gap. They state ‘Eastlake [author of a classic nineteenth century study of Italian painting] noted that tempera and watercolor paintings on linen were common in England and Germany in the 14th century. Unfortunately, we have not examined any of these and have no basis for comparison with the Shroud image. Our conclusions are based mainly in direct observations and the results of other follow-up studies.’  Quite so. They needed an expert who HAD examined the few surviving paintings on linen to rule in or out comparisons with the Shroud.As it is the STURP reports do not mention a single one but they do exist.\n\n","date":"November 18, 2013 at 9:41 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-51875","author":"Charles Freeman","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"What these long-awaited close-up pictures show is the subtlety of the Shroud image fibres, inasmuch as they are a faint yellow, mainly on the most superficial parts of the weave, but with some encroachment into the interstices via the oblique “diving down” threads.\nI had previously thought this subtlety was difficult to explain in a simple contact scorch scenario, i.e. by pressing a hot metal template vertically into linen that is spread over a layer of sand or similar. I now realize that was the wrong model, because it did not permit close-enough imprinting, if relying purely on contact between substrate and linen under applied pressure (too much “tenting”).  Something more “tactile ” was needed, and if using a hot metal template, a means of detecting heat (and minimizing over-scorching) by finger-tips alone. \nI now believe I know how it was done, to produce a very faint image, with pale yellow fibres, as per these welcome pictures, mainly but not exclusively on the more superficial crowns. \nBasically what it required was a reversal of the geometry I had been using previously, now laying a hot metal template down onto a hard surface. placing COTTON fabric on top initially, then covering with a double layer of damp cloth, and  pressing/moulding around the contours of the template with one’s finger tips. As soon as there is excessive heat detected, one has two options. One is to fold the damp cloth to get a double thickness, and go on moulding to take more heat out of the template until satisfied it will not excessively scorch more expensive linen (though fortunately linen is actually harder to scorch than cotton). When the hot template has passed the finger tip  test one takes away the cotton, replaces with linen and repeats the procedure, moulding fabric to contours with finger tips, monitoring temperature. One can lift a corner if need  be to check on progress.\nFinally, one draws back the linen, and if the result is like the ones I obtained this morning ones sees a VERY FAINT image of one’s template with no reverse side penetration or scorching. It’s in fact difficult to see the image except at a distance (ring any bells?) and under a x10 hand lens there is no obvious localisation of discoloration to the crown threads as might be expected from scorching off an over-hot template. There are subtleties, which I shan’t  try to explain now, but ones that might well impact on 3D imaging, giving an odd quality. \nThe take- away message is this: don’t get too hung up on the science (and I’m as guilty of that as anyone). Think technology – of doing things in slightly different ways to achieve slightly different more subtle end-results, while all the time imagining oneself to be a medieval artisan or similar..\nI’ll try and put together a posting in the next day or two of the new results. Warning: one or two oft-cited mantras might be hurt in the making of that post..\n\n","date":"November 18, 2013 at 10:36 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-51879","author":"colinsberry","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"It would have taken a great artistic genius to make your hot metal template. Any candidates from art history? And where did he study medicine?\nFrankly, your solution requires more assumptions than the Resurrection.\n\n","date":"November 18, 2013 at 10:42 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-51881","author":"John Klotz","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"But there was great artistic genius in medieval times, John – like magnificent cathedrals with highly detailed and life-like interior and exterior representations of people, the crucified Jesus included.. \nThere would have been life-size statues in bronze and similar that could have been used to get imprints via “tactile” moulding of linen to contours (and I can show you permanent semi-3D replicas one can obtain by that method, given the way that fabric responds to heating and stretching and contour memory-imprinting to form a kind of shell-like mask.\n As for the face, I consider (following Luigi Garlaschelli) that a separate more shallow bas relief was used. But we “pseudo-skeptics” do not imagine for a moment that anything we say will make the slightest impression on minds that are already made up…  ;-).\n\n","date":"November 18, 2013 at 10:58 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-51882","author":"colinsberry","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"Charles,\nIf you are going to insist hat this might be a painting, you are a pseudo skeptic, That is whatever the evidence you will search for a reason to demure. The Shroud image as been examined down to the atomic level. It showed no signs of directionality  in the strokes and no direction in the lighting. There were no evidence of pigments in the image itself. Was the “artist” left or right handed? A good art critic or historian can tell. If I ever get my current chapter finished, I will dissect one of the most famous ones as a part of the next and demonstrate how his casual opinion of the Shroud was at odds with his own professional discipline. Trust me on that. “Oh that mine enemy has written a book.” (Not de Wesselow) If I can find his address I will give him a chance to rebut.\nYou  will contribute nothing by raising a dead issue. I think an art historian might have something to say about the artistic conventions he might see in the image but the reason for those conventions was the copying of the Shroud itself. If you can show a convention that predates 300 CE or so that contains elements of the Shroud image that might be a start of an interesting conversation but insisting on it being a painting without a shred of evidence other than McCrone’s claims which varied by the month then you as big a fool as he was. \nI have quoted Gove for the proposition that McCrone  was intent on polishing his reputation by proving the Shroud a fake.\nAs a matter of fact, many of the STURP team were skeptics in the beginning. The facts they found changed many of their minds.\nI don’t mean to puff them up, but future generations  will read about  Barrie Schwartz and the STURP  team if they ever study religion.\n\n","date":"November 18, 2013 at 10:37 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-51880","author":"John Klotz","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"John. No, I am a genuine skeptic, not a pseudo-skeptic. The STURP might have gained some credibility in the wider world of scholarship if they had had an expert in painted linens who could show the particular characteristics of these, especially when they have aged over time, and then compared the Shroud with them. To give a small instance, comparison of surfaces of these paintings show that whether brush strokes are visible today or not depends on the liquidity of the paint and if you can’t see any strokes  it simply means that the paint was more liquid when applied. \nI won’t go further other that to reiterate my point that there are large areas of research on the Shroud that STURP neglected to undertake.\n‘I don’t mean to puff them up, but future generations will read about Barrie Schwartz and the STURP team if they ever study religion.’ \nMaybe in the filed of religion- Il leave it to scientists to comment on whether they will be similarly revered by scientists. As they did not engage in the history of the Shroud,they don’t feature within my discipline.\n\n","date":"November 18, 2013 at 11:42 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-51887","author":"Charles Freeman","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"John. The reason that I am a genuine  sceptic is that in my experience of working on medieval relics there has not been one that has yet been traced back the first century. So scepticism about the Shroud being the exception is the default position. So far I have not see any scientific evidence that provides a specific date within the range of 1-35 AD.\nIn the video Barry Schwortz says that he hesitated for seventeen years but was then convinced by a single statement from Adler that suggested that blood dried red if the victim had been tortured before death. For some reason Barry did not ring up his local forensic lab and ask if that were true or suspend judgement until Adler’s tests had been replicated- as they do not appear to have been. That was up to him but I am afraid it would not have been good enough for many people including myself  and so the default ‘remain sceptical’ setting stays in place.\n\n","date":"November 18, 2013 at 12:34 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-51896","author":"Charles Freeman","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"I don’t want to give away too much now, as I said, if you think about it you would probably know who I am referring to. Indeed, if I get this things done and published in one way or another, you might want to write a withering critique of me and a staunch defense of your colleagues inanities. \nIn anu event I just checked his book and among the first few illustrations of the most important image of all time (Christ’s, his judgment) at FIRST glance were some that Paul Vignon and Ian Wilson have identified as being executions of conventions that arose from the Shroud. Honestly, I am not ready to write it now, but I didn’t expect it would be so easy. \nYou may disagree. In horse racing parlance, I don’t want to get too excited and “spit the bit.”\n\n","date":"November 18, 2013 at 2:05 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-51904","author":"John Klotz","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"No John, I would not get too excited until you have read Paul Zanker’s The Mask of Socrates that traces the beard of Christ back to  fourth century Rome with illustrations. Paul Zanker is one of the most distinguished historians of Roman art so just check him out before you get hooked on Wilson and Vignon.\n\n","date":"November 18, 2013 at 2:17 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-51908","author":"Charles Freeman","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"Colin, if you are successful in reproducing a copy of the Shroud using your method that would indeed be a groundbreaking achievement — again it would not disprove or prove authenticity but merely establish that a medieval artisan could have made the image with the available technology. But that technology is actually so simple that could we not then say that it could have been made by someone from the 10th century, 5 century, 1st century, or even prior to that?\nWhy stop at the medieval era for our mystery artisan?\n\n","date":"November 18, 2013 at 1:27 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-51900","author":"David Goulet","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"Where would he get the vast quantity of linen needed to support development of this technique by trial and error?  If that’s the claim, we’re not talking about just one linen shroud. Colin knew what he was trying to achieve and had some ideas about what wouldn’t work from the work of others.  Our conjectural forger would presumably be making this up as he went.  Hard to believe he nailed it on the first try, and experimentation with other materials surely would not yield the same results.  So who footed the bill?\n\n","date":"November 18, 2013 at 4:52 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-51937","author":"Jeffrey Liss","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"I suppose a welathy benefactor would have been involved. not out of the ordinary in medieval times. And of course any earlier attempts would have been destroyed so that no one would know of the technique and spoil the relic’s status. I’m not saying I accept the theory, but your objections are not insurmountable.\n\n","date":"November 18, 2013 at 5:19 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-51942","author":"David Goulet","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"Each time I see those photomicrograph, the first thing that struck me is how subtle the image really is at fiber level.  It’s hard to really distinguish between a colored and  a non-colored fiber.with 100% certainty.  That’s one of the main reason that lead me to conclude that only a weak amount of energy (most probably natural) must have been involved there…\n\n","date":"November 18, 2013 at 2:04 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-51903","author":"Anonymous","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"Whatever was involved was natural. It’s our understanding of what’s natural that’s defective. If the Resurrection happened, it was just unique but not unnatural.\n\n","date":"November 18, 2013 at 2:08 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-51905","author":"John Klotz","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"Resurrection being natural?  Not in regard of the known laws od nature John…  Or else, Jesus’ Resurrection was just a biological “re-animation” of the same nature than the one of Lazarus where the body got back to this earthly life and eventually died again some times later.\n\n","date":"November 18, 2013 at 4:38 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-51934","author":"Anonymous","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"Hello again David\nNo matter ‘how well things go’, I could never claim to have been “successful in reproducing a copy of the Shroud”. The best I could hope to do was produce a reasonable facsimile, one that satisfied me and a fellow I talk to down at the pub..\nGroundbreaking achievement? Again, I hardly think so, since there would always be those who would say that one or other characteristic had still not been reproduced.\nIf I could just stop my regular newspaper (the Daily Telegraph) printing headlines that say “Italian study claims Turin Shroud is Christ’s authentic burial robe”\nhttp://www.telegraph.co.uk/news/religion/8966422/Italian-study-claims-Turin-Shroud-is-Christs-authentic-burial-robe.html\nor  the Independent’s: “Scientists say Turin Shroud is supernatural”\nhttp://www.independent.co.uk/news/science/scientists-say-turin-shroud-is-supernatural-6279512.html\nthen I’d be content. \n Call me old-fashioned, but I’m fussy about claims made in the name of science, especially those that involve any kind of magic. Science is complicated enough as it is, especially quantum mechanics or the mechanisms of abiogenesis and evolutionary change, or memory imprinting in the brain,or Big Bangs and singularities, parallel universes etc without having to acquiesce to officially-prescribed magic (wishful thinking or a means of mind-control as often as not).\nI have no problem with the Christian narrative, and a great deal of respect for the Christian ethic. Being outsmarted by a 14th century blacksmith (or 13th, 12th, 11th etc ) is something else. If he’s looking down on us now, he must be laughing his socks off (or long johns, knitted hose whatever)….\n\n","date":"November 18, 2013 at 2:29 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-51910","author":"colinsberry","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"Keep up the good fight, sir. We can all do with a bit more reason and lot less superstition.\nBTW, our long-gone artisan will be in good company perhaps with those pirates that built the Oak Island treasure pit.\n\n","date":"November 18, 2013 at 3:31 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-51919","author":"David Goulet","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"Colin said: “I could never claim to have been “successful in reproducing a copy of the Shroud”.\nOf course you can’t Colin because you completely neglect to reproduce also the blood and serum stains that we see on the Shroud, which is, for someone who seriously pretend of trying to replicate the Shroud image, a total shame in my book.\n\n","date":"November 18, 2013 at 4:40 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-51935","author":"Anonymous","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"I’ll say it again and again and again:  The Shroud must be consider in his totality, which include all the blood and serum stains…  Unfortunately, all those that I know who pretend over the years to have been able to reproduce the Shroud or to have come close to succeed have all neglected to try to replicate also the blood and serum stains in a way that they could fool the medical and forensic experts.  And sorry for all those who still think the Shroud can be the work of a forger, but I think we’ll all be happy in Paradise when someone will succeed to replicate all the different blood and serum stains that are visible on the Shroud with a high level of credibility…  This is normal because to do so, you need a scourged and crucified corpse with a majority of bloodstains on it that have been able to clot.  Hard to find, don’t you think?\n\n","date":"November 18, 2013 at 4:45 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-51936","author":"Anonymous","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"In other words, what I say basically is this :  The only hypothesis involving a forger must include the use of a real tortured and crucified body that suffered the exact same tortures as Jesus of the Gospel.  If you got some judgment, that’s the only forgery hypothesis that can have some chances to work regarding the Shroud and, seriously, this kind of wild scenario must be considered as highly improbable.\n\n","date":"November 18, 2013 at 5:07 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-51940","author":"Anonymous","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"\nCharles Freeman :\nJohn. The reason that I am a genuine  sceptic is that in my experience of working on medieval relics there has not been one that has yet been traced back the first century. So scepticism about the Shroud being the exception is the default position.\n\nCharles, Goebbels could be proud of you.\nDO YOU HAVE A SINGLE ARTIFACT THAT CAN BE DOCUMENTED BACK TO THE FIRST CENTURY?,/u>\n\nCharles Freeman :\nSo far I have not see any scientific evidence that provides a specific date within the range of 1-35 AD.\n\nOne of the favorites of the sceptics’ propaganda.\nThere is evidence! It is HIM who provides chronological evidence! Who else he can be?\n\n","date":"November 18, 2013 at 2:30 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-51911","author":"O.K.","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"Goebbels expected commitment not skepticism! You had to swallow the myth without questioning it.\n\n","date":"November 18, 2013 at 2:39 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-51914","author":"Charles Freeman","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"Commitment in spreading half-truths and ordinary lies, you have, I must admit this, Charles.\n\n","date":"November 18, 2013 at 2:50 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-51917","author":"O.K.","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"‘Commitment in spreading half-truths and ordinary lies, you have, Charles.’\nWhen I read this kind of thing, I feel that I must have won the argument!\n\n","date":"November 18, 2013 at 4:18 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-51927","author":"Charles Freeman","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"\nCharles Freeman :\n‘Commitment in spreading half-truths and ordinary lies, you have, Charles.’\nWhen I read this kind of thing, I feel that I must have won the argument!\n\nNo, leaving Goebbels aside you didn’t answer my question:\nDO YOU HAVE A SINGLE ARTIFACT THAT CAN BE DOCUMENTED BACK TO THE FIRST CENTURY?\n\n","date":"November 18, 2013 at 4:22 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-51929","author":"O.K.","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"One wonders how many folk seeing a collection of image threads and fibres for the first time – say Fig.4.2 dense image (foot) – would have immediately declared: “Oh, how peculiar, there are just two kinds of fibre – with and without colour – and those with colour all have the same intensity of colour.”\nAm I the only one here to think that if you took a random sample of 100 people off the street, showed them that photo, and asked what they thought was unusual about the fibres,\n the number saying there was a strict either/or classification at the fibre level would be essentially zero? \nIn fact, even when knowing what one is supposed to be looking for – the so-called “half tone” effect – it would be well nigh impossible to arrive at that conclusion without teasing out threads to show fibres separate from each other, and even then one would have to be on one’s guard against refraction artefacts that make light microscopy of individual linen fibres fraught with hazard, says he having prematurely cried “eureka” not so long ago re linen nodes.  Let’s not dwell on that  :-(   What price the alleged “half-tone” effect? \n\n","date":"November 19, 2013 at 3:26 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-51987","author":"colinsberry","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"\nAnonymous :\nI’ll say it again and again and again:  The Shroud must be consider in his totality, which include all the blood and serum stains…  Unfortunately, all those that I know who pretend over the years to have been able to reproduce the Shroud or to have come close to succeed have all neglected to try to replicate also the blood and serum stains in a way that they could fool the medical and forensic experts.  And sorry for all those who still think the Shroud can be the work of a forger, but I think we’ll all be happy in Paradise when someone will succeed to replicate all the different blood and serum stains that are visible on the Shroud with a high level of credibility…  This is normal because to do so, you need a scourged and crucified corpse with a majority of bloodstains on it that have been able to clot.  Hard to find, don’t you think?\n\nSee my previous comment re the futility of trying to debate with someone who yo-yos between naturalistic and miraculous narratives (image and bloodstains respectively) and more generally between objective/subjective analysis (Mode 1/Mode2).\n\n","date":"November 19, 2013 at 4:12 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-51989","author":"colinsberry","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"Colin, I’m not sure if I buy the idea that the shroud may have been created from an existing statue….let me start with one major problem:we would expect to see the modesty protecting cloth on the shroud image, which is nearly universally depicted in paintings and as far as I am aware universallly depicted in statues\n\n","date":"November 19, 2013 at 10:04 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-52007","author":"Matthias","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"A lot of Byzantine images of the naked Christ, particularly in baptism scenes, although often covered with a diaphanous wisp of cloth or some wavy lines symbolising water, simply miss out the genitalia altogether. I don’t know whether any statues, carvings or bas reliefs do the same.\n\n","date":"November 19, 2013 at 10:13 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-52010","author":"Hugh Farey","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"well in a recent trip to Spain I probably saw more than 50 statues of Christ from the 1300s – 1500s, and every one had a loin cloth. And in pouring through numerous texts on Christian art history I’ve never seen a statue without loin cloth.\nYes, I’ve seen a few (a lot? that is an exaggeration) baptism pictures of a naked Christ, partly disguised as you say, but that is beside the point.\nI reiterate my point that the lack of loin cloth on the Shroud image suggest that it is unlikely that the image was created from an existing statue. Maybe a remote chance it was created from a custom made one.\n\n","date":"November 20, 2013 at 7:37 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-52110","author":"Matthias","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"Hello Matthias\nI hesitate to mention it, but there’s that iconic late 12th century Codex that we are forever hearing about on this site as evidence that the Shroud was around pre-14th century.\nhttp://greatshroudofturinfaq.com/History/Greek-Byzantine/Pray-Codex/pray3.html\nIt shows the crucified Jesus laid out naked, with hands crossed to protect modesty. So if that was permitted in 2D art, then why not 3D as well? Admittedly there are fewer uses for a horiizontal statue in  that mode and specific biblical setting, than the classic nailed on cross posture, but it’s not impossible. Indeed, if it had outraged sensibilities, might someone not have hit on the idea for using it as a template for a back-to-2D thermal imprint?\n\n","date":"November 19, 2013 at 10:25 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-52013","author":"colinsberry","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"PS: How many folks here are aware of the presence of the so-called sedillis marks on each of the buttocks (symmetrical sets of 3 marks each forming a triangle)?\nhttp://www.sindonology.org/papers/bloodMarksButts.shtml\nMario Latendresse interprets them as an additional torture device of Roman crucifixion, and Yannick Clement, mentioned at the end of the above link, thinks they may be  burns marks, not blood. \nI think they are where mounting bolts(sawn off to flush stubs) or maybe open bolt holes for a lifesize crucifix existed and which imaged onto the dorsal view as a scorch. They were subsequently disguised as blood marks.\nI’m presently revisiting some older ideas I expressed many moons ago that the Shroud was made from a crucifixion bronze from which the arms were removed and re-positioned. There was probably a loin cloth to be disposed of too, but that could help resolve some oddities re the figure on the Lirey badge, especially that curious coiled belt, which Wilson interpreted as blood from the lance wound, gathered on the underside of the back, and which I previously thought could be a chain used to secure a victim.\n\n","date":"November 20, 2013 at 7:03 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-52108","author":"colinsberry","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"But the pray codex was not an object for public display. the image is buried in a clerical text, so its a different context\n\n","date":"November 20, 2013 at 7:40 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-52111","author":"Matthias","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"Quote: “They were subsequently disguised as blood marks.”\nEven if I completely disagree with your hypothesis concerning these marks, I want to say that they are not at all “disguised” as blood marks.  They are scorches in fact.  Look at the Shroud scope, around the area where those marks are and you’ll see other scorches looking pretty much the same color and intensity.  Look at this area for example and compare the color and intensity of these obvious scorches with the marks Latendresse interpreted as blood: http://www.dshroud.com/shroudScope/shroudScope.shtml?zl=11&image=4&lon=17358&lat=1948\nRemember that these marks that were described as blood by Latendresse where described as “probable scorches” by Miller and Pellicori in their analysis of the UV fluorescence photos of the Shroud…\n\n","date":"November 20, 2013 at 4:43 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-52168","author":"Anonymous","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"\nDavid Goulet :\nI suppose a welathy benefactor would have been involved.\n\nYes, once supposition is unleashed, pretty much anything is possible I suppose.\n\n","date":"November 19, 2013 at 10:15 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-52011","author":"Jeffrey Liss","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"Well, there’s supposition and then there’s stretching reason. Most major works of fine art in that era were at the expense of some well-to-do patron so it’s not a stretch. There are other aspects of the theory that are stretchy.\n\n","date":"November 19, 2013 at 11:47 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-52027","author":"David Goulet","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"\nMatthias :\nwell in a recent trip to Spain I probably saw more than 50 statues of Christ from the 1300s – 1500s, and every one had a loin cloth. And in pouring through numerous texts on Christian art history I’ve never seen a statue without loin cloth.\nYes, I’ve seen a few (a lot? that is an exaggeration) baptism pictures of a naked Christ, partly disguised as you say, but that is beside the point.\nI reiterate my point that the lack of loin cloth on the Shroud image suggest that it is unlikely that the image was created from an existing statue. Maybe a remote chance it was created from a custom made one.\n\nGood day Matthias. Here’s one for you to (shortly) sleep on there in Oz.\nI’m now returning to the idea that the image was imprinted from a life-size crucifixion bronze, and yes, it would have had a loin cloth, but the artistically-rumpled up parts that identify it immediately as a tied-off cloth could easily have been filed off. What;s interesting me at the moment, especially thinking about the Shroud’s peculiar hands and fingers is the possibility that arms may have been sawn off and re-positioned to create the horizontal entombment posture with crossed hands, My little brass crucifix, bought a year ago in France, is providing lots of clues as to what needed to be done to re-model a crucifixion statue as a post-crucifixion template for the tomb scene.\n\n","date":"November 20, 2013 at 8:05 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-52113","author":"colinsberry","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"Colin\nI still have a number of “problems” with the non-authentic arguments…here’s one top of mind – the blood stains on the feet, particularly the right foot with the stain appearing to trickle or smudge well off to the side of the foot: makes little sense to me as a non-authentic man made creation\nThoughts?\nPS can’t wait for the Ashes\n\n","date":"November 20, 2013 at 8:09 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-52114","author":"Matthias","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"I’ll give some thought to that, Matthias, and no doubt ‘anonymous; will be along soon to remind us of the evidence of the blood that excludes all possibilities bar authenticity.\nAs a boring old science bod, I deal in boring old hypotheses that are testable, at least in principle (and practice too if Pope Francis were to permit a second week of investigation)\nI say those sedillis  of Mario Latendresse (see earlier) arrived first, as unwanted details of body image off a template, i.e. bolt fixture markings, and were subsequently disguised as blood.\nOK, so here’s the prediction: if one gets 5 grades of sticky tape with increasing stickiness, and applies each in turn to the same sedillismark, the blood will come off first; revealing the scorch image underneath. (In fact, I would make the same prediction for all the blood stains on the Shroud, but that can wait).\n\n","date":"November 20, 2013 at 8:18 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-52115","author":"colinsberry","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"Colin / others – any further thoughts on those feet wounds ?\n\n","date":"November 22, 2013 at 5:59 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-52366","author":"Matthias","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"I now find that the topic of Mario’s sedillis* was covered by Dan on Jan 29, 2012, provoking a lively debate as to whether the marks were scorches or blood.\nhttps://shroudstory.com/2012/01/29/quote-for-today-by-mario-latendresse/\nI say they were both, acquired in that order.\n* Am not sure that the italics are necessary, but I’m using them for now since it’s not a word in common usage in English, and refers in this context to a little known feature of certain crucifixion practice (not mentioned in the biblical account needless to say). I’m also assuming, rightly or wrongly, that the same word serves for both singular and plural (sorry, my Latin’s a bit rusty).\n\n","date":"November 20, 2013 at 8:48 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-52119","author":"colinsberry","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"\ncolinsberry :\nPS: How many folks here are aware of the presence of the so-called sedillis marks on each of the buttocks (symmetrical sets of 3 marks each forming a triangle)?\nhttp://www.sindonology.org/papers/bloodMarksButts.shtml\nMario Latendresse interprets them as an additional torture device of Roman crucifixion, and Yannick Clement, mentioned at the end of the above link, thinks they may be  burns marks, not blood.\nI think they are where mounting bolts(sawn off to flush stubs) or maybe open bolt holes for a lifesize crucifix existed and which imaged onto the dorsal view as a scorch. They were subsequently disguised as blood marks.\nI’m presently revisiting some older ideas I expressed many moons ago that the Shroud was made from a crucifixion bronze from which the arms were removed and re-positioned. There was probably a loin cloth to be disposed of too, but that could help resolve some oddities re the figure on the Lirey badge, especially that curious coiled belt, which Wilson interpreted as blood from the lance wound, gathered on the underside of the back, and which I previously thought could be a chain used to secure a victim.\n\nYou’re off on another interesting angle. I have to say the sedellis theory does make sense as Mario posits. It was a known addition to crucifixion crosses. So it’s a logical presumption. Your full size reconfigured statue theory has some challenges. \nI’m not sure most of the crosses I’ve seen have the buttocks secured/bolted on the cross, it’s usually the hands and feet – just like the real victim experienced. Also this is becoming a bit of a major medieval team-project. You need the scorch expert, the benefactor, some men to help with carrying the heavy statue, the blacksmith — and not any horse-shoe banger — this would need to be someone so expert with working metal that he could remove the arms and reattach them without leaving so much as a seam on the image. He would have needed a team of workers because while a small crucifix heats easily and even enough on a stove, how do you get that even heating with a large corpus that would have had to have been heated in a foundry? Where did they get the statue? For your theory they are using an existing one — while certainly not uncommon to find, most statues remained in churches.\nI’ll help you out here. Maybe the crucifix survived a fire in its host church. It was taken to a foundry (for repair or storage) covered with a sheet. The soot on the cross left an imprint on the sheet, which someone discovered. This gave them the inspiration (heat + linen equals image) to create the fake relic, and since this cross was out of commission anyway it made for the perfect model to use – since no one would be missing it. Any major church fires in that time period and locale?\nHowever, with any conspiracy (and this would have been a conspiracy if one was trying to make a fake relic) the more people involved the more chance the secret is blown. One artisan, working alone, might have taken the secret process to his grave — but a whole team? No one tried to use the same technique to create other relics? No pilgrims noticed that the Shroud image reminded them of a cross that once adorned that burnt church in the next town?\nWhy switch to this new theory when the one you had before (powdered body with bas relief head) was less cumbersome? \nIt’s a great thought experiment.\n\n","date":"November 20, 2013 at 9:56 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-52127","author":"David Goulet","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"You make some interesting points. As regards manpower and secrecy, the Shroud is believed is said by authenticists to have been in the protection of the Templars prior to its first display in the mid 1350s. They were, as we know, a highly secretive order so would have had little difficulty in keeping their possession of the relic known only to themselves. By the same token they surely had the ability to fabricate it too, and keep that a secret (and money and manpower would have been no problem, at least prior to their liquidation by Philip the (Un) Fair). So Templar involvement could be said to cut both ways where the debate between authenticity and medieval fabrication is concerned.\nAs for the nuts and bolts, I frankly don’t know enough about medieval bronzes to know if they were solid or hollow, but am inclined to think they were the first. That would make them an enormous weight. My own brass crucifix from the French street market is less than 15 cm from head to foot, but weighs a whopping 300grams!\nIf I place it against a wall, the only points of contact are the hands and, guess what – the buttocks? If one tried to secure by the feet there would be an unsightly gap, and the bolts would have to be angled if doubling as crucifixion nails. Frankly I doubt whether 4 crucifixion nails, through hands and feet, could have safely doubled as securing bolts to a wall, even indoors. My crucifix has a long threaded bolt into the middle of the back, but a better, neater solution for a full size effigy would surely be the buttocks, especially as they are flush against the wall, making for an invisible attachment if viewed from the side.\nI’m fairly certain that the torso at least would have been modelled on a statue rather than bas relief (and have always considered the head to have a bas-relief mask-like  appearance what with that token vertical hair, the sharp cut-off at both sides of face, being unconvinced by the bleaching/banding arguments). It’s the feet that are the give-away. No bas relief would have made the feet so problematical from an imprinting point of view. There is scarcely any imprinting of frontal feet, at least none recognizable as feet with toes, and it’s not difficult to see why if imprinting from a statue with the feet almost at right angles to the legs and torso.\nEnough for now. I’ll give some thought to your other points.\n\n","date":"November 20, 2013 at 11:21 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-52135","author":"colinsberry","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"I am disappointed.\nI provided the pictures and what ?\nSo many “comments” without any kind of connection to the subject !\nThere are so many questions without  answer. More later, if necessary.\nAnd I don’t see any kind of interesting discussion.\nPlease look at the pdf and give me/us your comments and most importantly your ideas/questions..  \nColin wrote: “I now believe I know how it was done, to produce a very faint image, with pale yellow fibres, as per these welcome pictures, mainly but not exclusively on the more superficial crowns.”\nThis is a testable claim.\nColin, I have seen you experiment on your blog.\nInteresting.\nYou asked me to provide high resolution microphotos.\nNow, you have them.\nI would like to see your high resolution microphotos to compare them with the ME photos.\n\n","date":"November 20, 2013 at 5:39 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-52176","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"\nAnonymous :\nQuote: “They were subsequently disguised as blood marks.”\nEven if I completely disagree with your hypothesis concerning these marks, I want to say that they are not at all “disguised” as blood marks.  They are scorches in fact.  Look at the Shroud scope, around the area where those marks are and you’ll see other scorches looking pretty much the same color and intensity.  Look at this area for example and compare the color and intensity of these obvious scorches with the marks Latendresse interpreted as blood: http://www.dshroud.com/shroudScope/shroudScope.shtml?zl=11&image=4&lon=17358&lat=1948\nRemember that these marks that were described as blood by Latendresse where described as “probable scorches” by Miller and Pellicori in their analysis of the UV fluorescence photos of the Shroud…\n\nDistinguishing blood from  scorch by colour alone  is not a straightforward matter, as this picture will show, if it transfers. \nThe problem is the heterogeneity that can exist within a single blood area, at least under maximum contrast settings. “Blood” can appear as both a plum colour and a superimposed red-brown. New(er) blood? Old(er) blood?\nOne needs chemical tests, obviously, like iron, haemochrome and other degraded haemoglobins, porphyrins etc (and dare I say mineral salts) to make a positive identification of blood.\n\n","date":"November 20, 2013 at 5:31 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-52172","author":"colinsberry","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"OK, so it didn’t embed. Here’s a old-fashioned link to the image in question:\nhttp://shroudofturinwithoutallthehype.files.wordpress.com/2013/11/triangle-and-side-wound-710015.png?w=640&h=181\n\n","date":"November 20, 2013 at 5:33 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-52174","author":"colinsberry","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"\nThibault HEIMBURGER :\nI am disappointed.\nI provided the pictures and what ?\nSo many “comments” without any kind of connection to the subject !\nThere are so many questions without  answer. More later, if necessary.\nAnd I don’t see any kind of interesting discussion.\nPlease look at the pdf and give me/us your comments and most importantly your ideas/questions..\nColin wrote: “I now believe I know how it was done, to produce a very faint image, with pale yellow fibres, as per these welcome pictures, mainly but not exclusively on the more superficial crowns.”\nThis is a testable claim.\nColin, I have seen you experiment on your blog.\nInteresting.\nYou asked me to provide high resolution microphotos.\nNow, you have them.\nI would like to see your high resolution microphotos to compare them with the ME photos.\n\nThibault, just being curious.\nWhat do you think about this: http://ok.apologetyka.info/racjonalista/caun-turynski-faszerstwo-niedokonane-cz-3,560.htm\n(Figures 13, and XXIII).\nOne sceptic tried to reproduce the TS image via schorch & iron technique. I refuted his article, but nevertheless his (failed) attempt is interesting enough to hear a comment of an expert about it.\n\n","date":"November 20, 2013 at 5:42 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-52179","author":"O.K.","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"OK,\nI don’t read Polish, sorry.\nIf Fig.13 and 23 were obtained via “scorch and iron technique” (what kind of technique ?), they show the typical characteristics of contact imprint which have nothing to do with the characteristics of the TS image.\n\n","date":"November 20, 2013 at 5:57 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-52182","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"No problem. The guy (his name is Aleksander Głowacki) tried to utilize hot cloth iron technique -he  was pressing the surface of the cloth laid on the bas relief. The final result is of course very far from the Shroud, but how would you describe its flaws in more technical terms? I guessed (based on your paper) this is VLS (Very Light Schorch). His results may be a good example of some shortcomings of his method. If you could give us a small lecture here -we would be grateful.\nBTW: How to obtain STURP papers listed here: http://www.shroud.com/78papers.htm Are there some requirements, any credentials needed, or just I should e-mail to Barrie Schwortz and write: “could I ask you for those papers because I am interested in the Shroud”.\nBecause in my articles I used secondary sources, if some primary sources were available to me, this would be very beneficial for me.\n\n","date":"November 20, 2013 at 6:05 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-52185","author":"O.K.","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"I wasn’t going to start the microscopy for a few days, Thibault, but you asked, so here’s the first using my revised technique (linen on top of heated template, damp cloth on top of linen, gentle manual pressure).\nLet me say first of all that the procedure produces very faint scorches, dare I say Shroud-like, so faint that one can scarcely see them at all under a hand lens. Here’s a picture I have just taken at x40, the lowest magnification on my USB microscope.\nhttp://shroudofturinwithoutallthehype.files.wordpress.com/2013/11/2013_11_20_22_16_43_100.jpg?w=640&h=480\nI’d say the threads and fibres were a pale yellow, with no obvious “patchiness” or restriction to crowns of threads only, but these are early days.\n\n","date":"November 20, 2013 at 6:33 pm","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-52188","author":"colinsberry","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"What is the temperature of your “hot” template ?\nCould you quantify the pressure ?\n\n","date":"November 21, 2013 at 4:12 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-52240","author":"anoxie","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"\nanoxie :\nWhat is the temperature of your “hot” template ?\nCould you quantify the pressure ?\n\nGood morning anoxie.\nI place my template on a halogen ring turned up to its maximum value (incandescent red) and leave it there for at least 5 minutes until a small swab of fabric, touched against its top surface instantly chars to a toasted colour.\nI had not thought seriously about measuring temperature precisely, making no secret of working in a kitchen But you have just given me an idea. If I drop my heated 320g template into a known volume of water, and measure the temperature rise, then knowing the specific heat capacity of brass (approx) it should be possible to work out its temperature.\nI could give you ballpark estimates of course, based on the fact that the template is not hot enough to affect cellulose appreciably, the scorch presumably being a chemical dehydration of the more reactive hemicellulose constituents. \nThere’s a useful paper that gives the pyrolysis temperature of hemicellulose as 220\n– 315 degrees C compared with 315 to 400 degrees C for cellulose.\nhttp://www.sciencedirect.com/science/article/pii/S001623610600490X\nPressure?  Apply fingers lightly based on the fact that the overlay gets hot quite quickly. Sorry I can’t be more precise, but this is less about science now, more about hands-on technology…\n\n","date":"November 21, 2013 at 4:56 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-52242","author":"colinsberry","site":"shroudstory"},{"title":"Must See:  The Informative Mark Evans Photomicrographs","post":"\nMatthias :\nColin / others – any further thoughts on those feet wounds ?\n\n“Why would a forger do that?” is not a question that can be addressed scientifically, so any view I offered would probably be no better than anyone else’s and probably a good deal worse.\nIf it’s a scientific view you want, Matthias, based on hours spent examining every bloodstain in Shroud Scope, and doing so under different contrast and brightness settings in my photo-editing software, then you have only to ask,. But you might not like the answer. Oops – I warned “anonymous” a couple of days ago about the colour heterogeneity within Shroud bloodstains, and what it might be due to, as seen through an ageing increasingly jaundiced eye (except any jaundice in my eye would indeed be due to bilirubin, unlike anything blood-like on the Shroud that  looks too good, especially too red, to be true).\n\n","date":"November 22, 2013 at 6:43 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","id":"comment-52374","author":"colinsberry","site":"shroudstory"}]
