[{"title":"Mystery is never ever proof of anything","post":"Dan, I agree with this in general, however when it comes to the Shroud, I see mystery as a key component.  All the deep things of God are all mysteries.  Who can explain the Incarnation–the Word made flesh?  Even the resurrection–how does a body just disappear?  How does that same body walk on water or pass through a wall?  How does one command a storm or feed 5,000 with a boys lunch?  The Church may call them miracles but I just call them mysteries.  So, if today we discovered a collection of relics associated with Jesus, and one of them was his burial shroud, the cloth that wrapped his bloody crucified body and was impacted by the resurrection event, wouldn’t it be consistent that the cloth itself would also remain a mystery?  The fact that the Shroud of Turin remains a mystery, despite thousands of hours of analysis is not proof of authenticity, but it is consistent with the deep things of God,  which are all mysteries.\n\n","date":"September 13, 2014 at 8:39 am","url":"https://shroudstory.com/2014/09/13/mystery-is-never-ever-proof-of-anything/","cat":"science_and_religion","id":"comment-150689","author":"Russ Breault","site":"shroudstory"},{"title":"Mystery is never ever proof of anything","post":"John Hathaway wants to know about how miracles and the laws of nature relate. I would say that God is not by the laws of nature he created for us humans.\n\n","date":"September 13, 2014 at 9:49 am","url":"https://shroudstory.com/2014/09/13/mystery-is-never-ever-proof-of-anything/","cat":"science_and_religion","id":"comment-150704","author":"Louis","site":"shroudstory"},{"title":"Mystery is never ever proof of anything","post":"Actually, I want to know. \n\n","date":"September 13, 2014 at 9:59 am","url":"https://shroudstory.com/2014/09/13/mystery-is-never-ever-proof-of-anything/","cat":"science_and_religion","id":"comment-150706","author":"Dan","site":"shroudstory"},{"title":"Mystery is never ever proof of anything","post":"Sorry, I meant God is not bound by the laws of nature. Even the best Jewish scholars today are unable to explain the power of Jesus to heal and cure. They do not deny it, in fact ancient Jewish literature mentions this power. One Israeli archaeologist wrote that it was precisely because of this power  that the religious authorities feared him and paved the way for the crucifixion. One problem: he feels that Jesus learnt some form of medicine somewhere, but he did not say where, much less how come this knowledge was lost by the school of medicine. Johns Hopkins must do some research.\n\n","date":"September 13, 2014 at 10:14 am","url":"https://shroudstory.com/2014/09/13/mystery-is-never-ever-proof-of-anything/","cat":"science_and_religion","id":"comment-150712","author":"Louis","site":"shroudstory"},{"title":"Mystery is never ever proof of anything","post":"Perhaps miracles can be divided into supernatural and hypernatural categories?  http://www.reasons.org/articles/hypernaturalism-integrating-the-bible-and-science-to-explain-god-s-miracles\n\n","date":"September 13, 2014 at 11:03 am","url":"https://shroudstory.com/2014/09/13/mystery-is-never-ever-proof-of-anything/","cat":"science_and_religion","id":"comment-150727","author":"Ryan","site":"shroudstory"},{"title":"Mystery is never ever proof of anything","post":"Wiki has a comprehensive discussion on miracles including: Teaching of the Catholic Church and of Protestantism; Teaching of several other non-Christian religions;  Commentaries by various Doctors of the Church;  Various philosophical commentaries; Various criticisms against miracles.\nhttp://en.wikipedia.org/wiki/Miracle \nIt includes some extracts from St Thomas Aquinas’ ‘Summa contra Gentiles’ on the subject of miracles.  He categorises three types: a) God does something that nature cannot do; b) God does something that nature can do but in a different order;  c) God does something that nature can do but without the operation of the natural principles.   \nThe Catholic position seems to be that Catholics are required to believe in miracles, but beyond those contained in the Creeds, are not normally required to believe in specific miracles as an article of faith.  The Church may recognise specific miracles, such as when examining the causes of saints, but these are not usually compelling on Catholics.  \nIn considering the reported miracles of Jesus and the apostles in the New Testament, it needs to be remembered that the gospels and other writings were written for the purpose of proclaiming Jesus as Lord, and all may not necessarily have occurred as actual events.  Thus we may readily accept the miracles reported as cures or exorcisms, but we may have a mental reservation about such reported miracles as the conversion of water into wine at Cana, Jesus walking on water, the multiplication of loaves and fishes, or the calming of the storm.  There may have been other explanations, or they may have been the particular author’s interpretation of actual events that occurred. \nHaving said all that, it is within the power of God as author of nature, to set aside the laws of nature that He has devised. \nThe evidence of witnesses may be compelling, as seems to have been the case of Fatima in Portugal on 13 October 1917: \n“Anywhere between 70,000 and 100,000 people, who were gathered at a cove near Fátima, witnessed the sun dim, change colors, spin, dance about in the sky, and appear to plummet to earth, radiating great heat in the process. After the ten-minute event, the ground and the people’s clothing, which had been drenched by a previous rainstorm, were both dry.”   \nIt might be asserted that the cause was a mass hallucination, but this explanation seems unlikely, and merely begs the question.  Such hallucination would normally demand a high level of uniform hypnotic suggestion, and would normally be more diverse in what was reported as observed.\n\n","date":"September 13, 2014 at 4:43 pm","url":"https://shroudstory.com/2014/09/13/mystery-is-never-ever-proof-of-anything/","cat":"science_and_religion","id":"comment-150785","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Mystery is never ever proof of anything","post":"Two Jewish scholars, both deceased, studied Jesus’ healing and curing activity as described in the NT. Pinchas Lapide wrote that he cured both physical and mental diseases, while Geza Vermes, who I had occasion to interview, said he was a “healer and exorcist.” Was Jesus an exorcist or did he cure mental disturbances? The WHO has officially stated that the mind and body are one unit, and it is known that 86% of diseases are of psychosomatic origin. How could Jesus only heal the physically sick and leave those with mental disturbances aside? I learnt of one solution during a course in parapsychology, the clue is in the case of the Gerasene demoniac, but that is a topic for a paper. \nIt can only tackle a part of the discussion because we are still left with the problem of evil, in fact yesterday Australian Cardinal George Pell, now at the Vatican, warned people in England who are endeavouring people to bring ex-Christians back to the faith that it is a problem they will face.\nBultmann,the biblical scholar, had dismissed the miracle stories, influenced as he was by Heidegger, the existentialist. He continued to be a Lutheran, and Heidegger, the ex-seminarian who had fought with the Jesuits, returned to Catholicism, not failing to call a priest to his house to make sure he would be given a Catholic burial.  \nIt is important to remember the extrabiblical testimony of Josephus about Jesus as a “worker of wondrous deeds”. So how we can clear doubts about whether to refer to the healing and curing as miracles or mysteries? In the synoptics they are called “deeds of might”, John refers to them as “works, deeds” and even “signs”. “Miracle” is derived from the word “miraculum” in the later Latin theological traditionter. Whatever term one might prefer, all have a Christological aspect.\nThe great difficulty in accepting the miracle tradition is a philosophical one. It arose with the so-called Enlightenment and the prominent spokesman was Hume, who is quoted in the context till today. It is not the answer we are looking for. How can a modern philosophical interpretation of today’s world be an answer to an historical question?      \nI had been to Fatima years ago. Sister Lucia 1917 revelations turned out to be correct, the best example being the end of communism in the USSR. Her sister Jacinta’s body was found to be incorrupt when taken from the grave in the local cemetery to the basilica.\n\n","date":"September 13, 2014 at 6:14 pm","url":"https://shroudstory.com/2014/09/13/mystery-is-never-ever-proof-of-anything/","cat":"science_and_religion","id":"comment-150802","author":"Louis","site":"shroudstory"},{"title":"Mystery is never ever proof of anything","post":"What did C. G. Jung think about the Shroud? Was it a miracle or mystery to him? He hung a copy of the Shroud face in his study, behind a small curtain. We do not know who gave it to him since he had many Catholic friends, the American Dominican Father Victor White, living in Blackfriars, England was his closest friend.\nhttps://www.academia.edu/6823292/What_did_Jung_see_in_the_Shroud\n\n","date":"September 13, 2014 at 6:33 pm","url":"https://shroudstory.com/2014/09/13/mystery-is-never-ever-proof-of-anything/","cat":"science_and_religion","id":"comment-150805","author":"Louis","site":"shroudstory"},{"title":"Mystery is never ever proof of anything","post":"Here is the report about the views of Cardinal George Pell, former archbishop of Melbourne, and now in the Vatican. He is one of the eight cardinals from all continents chosen by Pope Francis to propose reforms in the Church:\n  http://www.catholicherald.co.uk/news/2014/09/11/cardinal-pell-tells-new-school-expect-attacks-from-the-devil/\n\n","date":"September 13, 2014 at 7:09 pm","url":"https://shroudstory.com/2014/09/13/mystery-is-never-ever-proof-of-anything/","cat":"science_and_religion","id":"comment-150813","author":"Louis","site":"shroudstory"},{"title":"Mystery is never ever proof of anything","post":"Cardinal George Pell was a former Archbishop of Melbourne in the Australian state of Victoria (1996-2001) and was then appointed as eighth Archbishop of Sydney in New South Wales (2001-2014).  In February 2014, Pope Francis appointed Cardinal Pell to be the first Cardinal-Prefect of the newly created Secretariat for the Economy. In this role, Pell will become responsible for the annual budget of the Holy See and the Vatican. As a result of his appointment, the see of Sydney fell vacant. \nHe is well-known in this part of the world as being one of the few very out-spoken prelates, and has had his own daily newspaper column in Sydney.  \nAs previous editor of my local church magazine I recall publishing two articles on issues which he had highlighted.  One of these concerned “Religious Freedom” which Pell saw as being threatened by a secular agenda, promoted by Race Discrimination Commissioner. Tom Calma in September 2008.  A sample of Cardinal Pell’s approach to this issue: \n“In case there was any doubt about the matter, in August Mr Calma and Conrad Gershevitch delivered a conference paper on the inquiry which opened with these words: “The compatibility of religious freedom with human rights is the subject of the most comprehensive study ever undertaken in Australia in this area. …’”\n“Let us spell this out.  The clear meaning of these words is that religious freedom is not a human right and may not be compatible with human rights.  This is an astonishing claim from a senior officer of the body responsible for the protection and advancement of human rights in Australia.  Mr Calma announced the inquiry in a similar vein, comparing religion and human rights to oil and water – substances that do not mix.”  \nThe particular article with references given can be found at:\nhttp://tawacatholic.org.nz/wp-content/uploads/2014/06/TCN_mar_2010.pdf\nat pages 25-27.  However several other matters he has also high-lighted are easily found on the web.  Wiki is as good a place as any to start finding out about this forthright prelate and his views on many important and controversial issues.\n\n","date":"September 13, 2014 at 11:42 pm","url":"https://shroudstory.com/2014/09/13/mystery-is-never-ever-proof-of-anything/","cat":"science_and_religion","id":"comment-150853","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Mystery is never ever proof of anything","post":"Dan,\nNEVER use “never”, “ever”, or “never ever” in a (philosophical) argument…\n\n","date":"September 15, 2014 at 9:42 am","url":"https://shroudstory.com/2014/09/13/mystery-is-never-ever-proof-of-anything/","cat":"science_and_religion","id":"comment-151171","author":"Nabber","site":"shroudstory"}]
