[{"title":"National Catholic Reporter: Ordain Women as Priests","post":"Been there! Done that!  Daveb & Yannick: “Right on!”  Andy Weiss: “No way!”  Maybe we should leave it at that.  Otherwise the Huff Post item seems to present a fair summary on the present position.  I see that National Catholic Reporter has also recently run an item symathetic to same-sex civil unions.  NCR is an independent “Catholic” paper run by lay persons immune from Church authorities – I suppose they could ban sales in the churches if they wanted.  In NZ right now, our Parliament will soon be considering a  bill allowing same sex formal marriage.  General opinion seems it will probably pass into law.  If a distinction between church and civil marriages is still retained, I guess they can call it what they like.  We’re  also likely to go down the track of legalising euthanasia, some say with the most liberal legislation in the western world.  \nSo long as we’re off-topic, I was recently reading that 18th c. Jansenism was a strong influence in Catholic outlooks in the French and Irish churches whence it spread to Australia, NZ and Quebec.  It was apparently strong in Quebec, which would explain a few of Yannick’s recent comments in an overly-liberal reaction to the previous stern and severe outlook of Catholicism in the Quebec Church.  I’m old enough to remember some of the hell-fire and brimstone preaching that was occasionally heard in NZ from some of the more ardent mission priests.  Like Quebec, we probably reacted too far in the opposite direction, but there are now signs of a more conservative reaction restoring(?) some balance.\n\n","date":"December 4, 2012 at 3:47 pm","url":"https://shroudstory.com/2012/12/04/national-catholic-reporter-ordain-women-as-priests/","cat":"off_topic","id":"comment-19831","author":"daveb of wellington nz","site":"shroudstory"},{"title":"National Catholic Reporter: Ordain Women as Priests","post":"If we believe in Revelation, then we can also believe that God would not have chosen the Jews, but the English, with their Anglo-Saxon culture, so that there could be women priests.\n\n","date":"December 4, 2012 at 9:17 pm","url":"https://shroudstory.com/2012/12/04/national-catholic-reporter-ordain-women-as-priests/","cat":"off_topic","id":"comment-19841","author":"Louis","site":"shroudstory"},{"title":"National Catholic Reporter: Ordain Women as Priests","post":"The National Catholic Reporter is not known for its excellence in journalism or Catholicism.  This kind of story is useless.  God is not calling women to ordination.\n\n","date":"December 4, 2012 at 9:28 pm","url":"https://shroudstory.com/2012/12/04/national-catholic-reporter-ordain-women-as-priests/","cat":"off_topic","id":"comment-19842","author":"Andy Weiss","site":"shroudstory"},{"title":"National Catholic Reporter: Ordain Women as Priests","post":"Says God or says you?\n\n","date":"December 8, 2012 at 10:37 pm","url":"https://shroudstory.com/2012/12/04/national-catholic-reporter-ordain-women-as-priests/","cat":"off_topic","id":"comment-20072","author":"Mary Bethany","site":"shroudstory"},{"title":"National Catholic Reporter: Ordain Women as Priests","post":"It is Our Sunday Visitor, headed by Greg Erlandson, and not NCR, with John Allen at the steering wheel, that should be taken seriously.\n\n","date":"December 4, 2012 at 9:46 pm","url":"https://shroudstory.com/2012/12/04/national-catholic-reporter-ordain-women-as-priests/","cat":"off_topic","id":"comment-19844","author":"Louis","site":"shroudstory"},{"title":"National Catholic Reporter: Ordain Women as Priests","post":"I shall continue to look in vain for one single intelligent argument why women priests would not be acceptable to God.  I do not expect my search to be satisfied any time soon!  In the present age, arbitrary edicts and ukases are signs of an organisation in inevitable decline.\n\n","date":"December 4, 2012 at 10:23 pm","url":"https://shroudstory.com/2012/12/04/national-catholic-reporter-ordain-women-as-priests/","cat":"off_topic","id":"comment-19847","author":"daveb of wellington nz","site":"shroudstory"},{"title":"National Catholic Reporter: Ordain Women as Priests","post":"As commented some time ago on this blog, the Church should be careful with Quislings. There is a nice article on the NCR by William Oddie on the catholicherald.co.uk website.\n\n","date":"December 8, 2012 at 9:34 pm","url":"https://shroudstory.com/2012/12/04/national-catholic-reporter-ordain-women-as-priests/","cat":"off_topic","id":"comment-20069","author":"Louis","site":"shroudstory"},{"title":"National Catholic Reporter: Ordain Women as Priests","post":"I see the same edition of the Catholic Herald also considers Coppola’s “The Godfather” the best film ever, because it involves a Catholic criminal activity (article by Lucie-Smith a doctor of moral theology).  Anglicans and Methodists don’t apparently make good(?) criminals.  William Oddie is apparently an authority on G K Chesterton,  GK’s poetry is OK.  But his religious writings are now Old Hat emphasising outdated triumphalism.  Wasn’t there a Vatican Council II or something?  Enjoy your reading!\n\n","date":"December 10, 2012 at 6:11 am","url":"https://shroudstory.com/2012/12/04/national-catholic-reporter-ordain-women-as-priests/","cat":"off_topic","id":"comment-20124","author":"daveb of wellington nz","site":"shroudstory"}]
