[{"title":"National Post: Quality punditry from across the globe","post":"I note one comment on the Wordsworth column mentions that the Israeli courts have thrown out the charge that “the James, son of Joseph, brother of Jesus ossuary” is a fake –  red faces in the IAA??  She’s on thin ice claimimg that the Shroud of Turin is a fake.  That only leaves the Coptic fragment she could be right about, or wrong.  Wait until the ink’s tested!\n\n","date":"September 26, 2012 at 6:42 am","url":"https://shroudstory.com/2012/09/26/national-post-quality-punditry-from-across-the-globe/","cat":"news_&_views","id":"comment-16935","author":"daveb of wellington nz","site":"shroudstory"},{"title":"National Post: Quality punditry from across the globe","post":"She is mixing things up, and three months before the IAA declared part of the James ossuary inscription to be a forgery this author published an article saying exactly this, even though it meant disagreement with a renowned scholar involved in the issue with whom another important article in the area of biblical studies had been published. Again, what big difference will it make if the papyrus is a forgery or not? There is highly suspect ideology behind it and the agenda is still there. As for the Shroud, this seems to be pure prejudice.\n\n","date":"September 26, 2012 at 9:21 am","url":"https://shroudstory.com/2012/09/26/national-post-quality-punditry-from-across-the-globe/","cat":"news_&_views","id":"comment-16943","author":"Louis","site":"shroudstory"},{"title":"National Post: Quality punditry from across the globe","post":"Louis: If it’s a forgery, such as a composite from Gnostic Gospel of Thomas, as alleged by Prof Watson, then there’s little more to be said about it.  If it’s not a forgery, then it merely contributes a little more to scholars’ knowledge and understanding about whatever gnostic sect originated it.  When it comes to gnostic and other ancient writings (scribblings?) you need to know that they are sometimes deliberately obscure.  For example:  “Is the writer wanting to make a claim that is to be literally interpreted?  Or was he intending it to be interpreted allegorically?  Is the wife intended to be a person?  Or was he intending to say that the wife is the Church?  Even the phrase ‘She can be my disciple’ can still be interpreted allegorically.”  Scholars may debate this issue for their academic entertainment for years to come. \nIt does seem that King does have a proactive feminist agenda, as evident in her other writings, and her having worked worked with Elaine Pagels.  She is apparently a strong advocate for female ordination, but then there’s not a great deal wrong with that.  I know several very effective Protestant women pastors for instance. \nOne highly suggestive comment I spotted referred to the trial by Internet blogging.  The commenter wondered what would have been the outcome with the Nag Hamadi and Dead Sea scrolls discoveries if the Internet had been around at that time.  There is a present conflict between the demands of newsdesks, public wanting to know, and proper academic study of such discoveries.  They are all somewhat irreconcilable and work against each other, so that a proper understanding of these matters is seriously compromised.\n\n","date":"September 26, 2012 at 4:31 pm","url":"https://shroudstory.com/2012/09/26/national-post-quality-punditry-from-across-the-globe/","cat":"news_&_views","id":"comment-16956","author":"daveb of wellington nz","site":"shroudstory"},{"title":"National Post: Quality punditry from across the globe","post":"Thank you for the comments, David. It looks like Professor Watson has assumed the role of Sherlock Holmes in trying to figure out the origin of the papyrus and his efforts are indeed worthwhile, however it is doubtful if the Gospel of Thomas had more to do with it. He seems to have overlooked another possibility, and that is the “style” adopted was the one used to compose the Gospel of Thomas, but the “inspiration” came from the Valentinian school. Thus, it is not difficult to agree with him that the papyrus could date to the fourth century or it is a modern forgery — the intention being the same. As for the obscurity you mention, yes, that does indeed complicate matters, but that is the gnostic trademark. Yet, the mischief-making element also seems strong.\nAs regards the James ossuary, the disagreement mentioned in the previous comment arose because there was no choice but to tell renowned scholars that God gave me good eyesight and even a layman could see that there were two different hands working on the inscription. There were of course other reasons to disagree. Why would Jesus, when nailed to the cross, and sensing that death was approaching,ask a disciple to look after his mother if he had a brother around? Perhaps, today, with the discussion about the papyrus, we can add, And why also if his mother had a daughter-in-law? \nAs far as I know the IAA did not condemn anyone at the trial but continues to maintain that the inscription was partially forged, in fact Dr.Amos Kloner, who was for a while the Jerusalem District Archaeologist, had written a report for the Israeli authorities telling them that the inscription was not genuine.\nYou are right about Karen King’s “proactive feminist agenda” and that is precisely what makes her attitude suspect, and, also leads her to cunningly ignore the words of Jesus on the “eunuchs” and tell Smithsonian that the fragment cast doubt on “the whole Catholic claim of a celibate priesthood based on Jesus’ celibacy.” \nWhen it comes to female ordination, I am sure you know that Pope John Paul II said that the disciples chose were all men, and, needless to say, that does not mean he was against women participating in Church activities, but in other roles. If we go deeper into it, we are led to think about why God chose a particular people, with their own, distinctive culture, and at a particular time, to intervene in history.\n\n","date":"September 26, 2012 at 9:57 pm","url":"https://shroudstory.com/2012/09/26/national-post-quality-punditry-from-across-the-globe/","cat":"news_&_views","id":"comment-16967","author":"Louis","site":"shroudstory"},{"title":"National Post: Quality punditry from across the globe","post":"I had the opportunity of reading the “Gospel of Thomas” during the 1980s, when I was pursuing a major in Religious Studies.  It is obviously a gnostic work.  Prof Watson claims to recognise that the Coptic fragment has been compiled from a copy and paste of bits and pieces from a Coptic translation of the Gospel of Thomas, and therefore asserts it is a forgery.  Hopefully a chemical analysis of the ink will settle the matter one way or the other.\nThe gnostic gospels are not the only “scripture” to be obscure.  John’s gospel was written towards the end of the 1st C, during an intense period of persecution, and consequently we can expect a sub-text to have been written into it.  Albert Dreisbach for instance in a Shroud Conference paper, Atlanta 2005, asserts that there is a hidden message concerning Jesus’ burial cloths in the resuscitation story of Lazarus, which only occurs in John. \nMark’s gospel is much more primitive and tells his story in a more direct way.  It his gospel that identifies the names of the brothers of Jesus and his trade as a woodworker.  Matthew’s and Luke’s gospels are rather more circumspect.  From the Greek word used for brother (adelphos), John P Meier asserts that they were blood brothers of Jesus, not half-brothers or cousins.  My own view of this is that they could easily have been adopted by Mary and Joseph.  Adoption was very prevalent in those times because of parents’ early mortality.  There were several orphans, and adoption gave precisely the same rights as blood under both Jewish and Roman law.  That is one reason why I would be prepared to concede that Jesus himself may have adopted a son and there may be more to the inscriptions on the Talpiot ossuaries that many are prepared to admit.  He may well have been the disciple whom Jesus loved.  The whole business of the Talpiot ossaries was very badly handled archaeologically by the IAA, (merely in the interests of expediting a residential development) and now we shall never know because of their cleaning of the ossuaries and disposal of the contents in a common grave.  Consequently I see the controversy concerning the James ossuary as an IAA exercise in futile damage control and covering their backsides. \nNotwithstanding the words of Pope John Paul II on the issue of ordaining women, it was to be expected that Jesus would appoint men only as his disciples because of the prevalent culture of the time and place, not for any theological reason.  His own attitude towards women was a revolutionary breakthrough, and in the Acts it is apparent that women were occasionally appointed as deacons, and not merely in passive supportive roles.  The gnostic gospels, were for what they’re worth, might suggest that Mary Magalene had a very prominent role in missionary activity, which was downplayed by the orthodox.  We shall probably never know for sure.\n\n","date":"September 27, 2012 at 4:47 pm","url":"https://shroudstory.com/2012/09/26/national-post-quality-punditry-from-across-the-globe/","cat":"news_&_views","id":"comment-16996","author":"daveb of wellington nz","site":"shroudstory"},{"title":"National Post: Quality punditry from across the globe","post":"Father Albert Dreisbach was a very good man, a true Christian in many ways, but certainly no scripture scholar, so I must say that a lot of guesswork went on in the area of Shroud studies. He also never went beyond any limit, as did some authors whose imagination ran wild. \nRegarding the IAA, I will not hesitate to defend them, not only due to personal experience, but also because they demonstrated a lot more ethics than the people behind the TV documentaries and the books on the so-called “Jesus family tomb” and the “James ossuary”. It is easy to see that they had no dog in the fight, no secret agendas and one must add that the uproar demanded an explanation from real scholarly circles, therefore the second documentary, which was an interview with some top scholars and those who promoted the “Jesus family tomb.” It turned out to be a success because Ted Koppel handled it very well and there was no doubt about who won the debate.\nOne must not forget that, most important of all, to give the sensationalists who promoted the “Jesus family tomb” (Talpiot tomb) credibility also means calling those who wrote the Gospels (read in churches of all Christian denominations) liars who hid the truth, so where does that get us?\nJohn P. Meier has on the whole been good, but, as he himself wrote, the “historical Jesus” is not the “real Jesus”, and writing to please Catholics, Protestants, Jews and Agnostics is really not ideal. He should write about what he thinks are correct findings, not to please anyone. As for the shortcomings, they have been demonstrated by Professor Luke Timothy Johnson (USA) and Father Anthony Kelly (Australia).\nThere is absolutely no surety about when the four gospels were written, John only being the more theological among them, and the disciples and primitive Christians came from an oral tradition. It seems clear that Jesus discarded a lot of things from the prevalent culture and would not have hesitated to appoint a woman as a disciple if he wished to do so.\n\n","date":"September 27, 2012 at 9:13 pm","url":"https://shroudstory.com/2012/09/26/national-post-quality-punditry-from-across-the-globe/","cat":"news_&_views","id":"comment-17002","author":"Louis","site":"shroudstory"}]
