[{"title":"New Permanent Shroud of Turin Exhibit","post":"Mar 1, 2010? New?\n\n","date":"September 3, 2014 at 11:19 am","url":"https://shroudstory.com/2014/09/03/new-permanent-shroud-of-turin-exhibit/","cat":"news_&_views","id":"comment-148293","author":"anoxie","site":"shroudstory"},{"title":"New Permanent Shroud of Turin Exhibit","post":"Whoops? Maybe. Good catch. It just popped up in Yahoo News yesterday. Those things happen every now and then. I didn’t see the date at the top.\n\n","date":"September 3, 2014 at 11:58 am","url":"https://shroudstory.com/2014/09/03/new-permanent-shroud-of-turin-exhibit/","cat":"news_&_views","id":"comment-148298","author":"Dan","site":"shroudstory"},{"title":"New Permanent Shroud of Turin Exhibit","post":"From shroud.com\n“Who Is The Man Of The Shroud? Permanent Exhibit\nOn Saturday, February 27, 2010, a permanent exhibit titled Who is the Man of the Shroud? opened at the National Shrine of Our Lady of Guadalupe in Sacramento, California. Founded by the Legionaries of Christ, this is the third permanent Shroud exhibit the order has established. The first, the Pontifical Institute Notre Dame of Jerusalem Center, was opened in Jerusalem in 2006 (which I have reported on previously) and the second at the University of Rome. Plans are to continue to open similar exhibits in other countries around the world. Each exhibit includes a lifesize replica of the Shroud, two lifesize holographic images by Petrus Soons showing the three dimensional characteristics of the Shroud image, replicas of the instruments of the crucifixion and a beautiful, lifesize bronze sculpture of the man of the Shroud by Luigi Mattei.\nWho Is The Man Of The Shroud?\nNational Shrine of Our Lady of Guadalupe\n1909 7th Street\nSacramento, CA 95811-7027, USA\nTel: (916) 442-3211\nFax: (916) 442-3679”\n\n","date":"September 3, 2014 at 12:02 pm","url":"https://shroudstory.com/2014/09/03/new-permanent-shroud-of-turin-exhibit/","cat":"news_&_views","id":"comment-148299","author":"Hugh Farey","site":"shroudstory"},{"title":"New Permanent Shroud of Turin Exhibit","post":"So perhaps it is time to make a special exhibit of a replica of the Guadalupe tilma now? It also has many secrets.\n\n","date":"September 3, 2014 at 12:31 pm","url":"https://shroudstory.com/2014/09/03/new-permanent-shroud-of-turin-exhibit/","cat":"news_&_views","id":"comment-148308","author":"Louis","site":"shroudstory"},{"title":"New Permanent Shroud of Turin Exhibit","post":"I remember many years ago (maybe twenty …or thirty !)\nI saw a replica of the Virgin of Guadalupe’s icon that was\nin display at the Notre Dame Cathedral in Paris, France …\n— —\nI have read that:\n>Some claim that upon appearance of Our Lady of Guadalupe\nin the hill of Tepeyac where Tonatzin’s temple had been burnt\nby the Spanish priests, the natives accepted Our Lady of Guadalupe\nas Tonantzin !\nBut the word Guadalupe may derive from Coatlaxopeuh, meaning:\n“the one who crushes the serpent”, and thus perhaps relates etymologically\nto Quetzalcoatl, the word for the feathered serpent itself …\n\n","date":"September 4, 2014 at 8:16 am","url":"https://shroudstory.com/2014/09/03/new-permanent-shroud-of-turin-exhibit/","cat":"news_&_views","id":"comment-148497","author":"Piero","site":"shroudstory"}]
