[{"title":"Noah’s Ark, the Shroud of Turin and the Grand Canyon","post":"This is an interesting article and I find that the short quotation from Mr. Coyne provided shows some glaring errors for the following response for you, Dan, and perhaps him if he is interested.\n1. Sure some fringe elements in Christianity expect perhaps to prove the existence of God through the rediscovery of Noah’s ark, for example.  \n2. Concerning the Shroud, with what I know of it, I understand that it is not possible to prove that the image is of Jesus of Nazareth, yet there is much evidence to support that thesis.  There is a world of difference between evidence and proof and I speak of the Shroud’s evidence.  We do not have his DNA for comparison, no driver’s license, dental records or any other way to positively identify Jesus as the man on the cloth with 100% certainty.  There are similarities that are uncanny between the image of the man on the linen and the records of what was done to Jesus of Nazareth, the King of the Jews.  But aside from these kinds of things about which Mr. Coyne could read up, I have something else to offer.\nI consider the affect the Shroud has had on those who study it and I offer that as interesting evidence.  One can read my own reflection on its affect on my own life at http://shroudnm.com/, “Why is the Shroud important?,” in either English or Spanish.  Shroud.com also has some great Shroud researchers (I do not include myself in that list, but am more of a generalist and am unsure I have an expertise that I could offer in its study) and their own experiences with the Shroud.  I have heard the effect it has had on some of my friends such as Barrie Schwortz, Dr. John Jackson, Dr. Petrus Soons, Pete Schumacher and Larry Schauff.  I would suggest to Mr. Coyne that he should consider this evidence in his calculations concerning this linen cloth if he chooses.  There’s no doubt he might find that study of interest.\n3. There have been healings and other evidences of inexplicable “miraculous” cures that he perhaps is unaware.  There is a lady in Italy who has no corneas, yet can see.  I would love to hear a rational explanation for this inexplicable event in this woman’s life.\n4. I can state unequivocally that my prayers have been answered over my years.  But I am unsure that Mr. Coyne can test those in a lab or in reason, yet I have no doubt whatever what has happened in my life.  The mere fact that I remain vertical and breathing is proof there is a God, in my estimation.  I can cite several instances in my life from which I should not have been able to recover, yet I am still here living on this patch of earth.\n5. There are things that exist, such as the winding staircase in a decommissioned church in Santa Fe, NM which was built and is a marvel.  No one knows who built it and it is built using techniques that are perhaps uncommon to human engineering.  There are no nails.  (I am not an engineer, so I cannot claim these methods are unknown.)\nIf I were to posit “proof” for the existence of God (which I would not do anyway since I prefer evidence), I would offer the complexity of the human body, the complexity of the earth and all its preciseness and the truth of the Big Bang and the expanding universe and its implication that in order to have a big bang, logically there has to have been a first cause.\n\n","date":"June 28, 2012 at 2:35 pm","url":"https://shroudstory.com/2012/06/28/noahs-ark-the-shroud-of-turin-and-the-grand-canyon/","cat":"news_&_views","id":"comment-13148","author":"Andy Weiss","site":"shroudstory"},{"title":"Noah’s Ark, the Shroud of Turin and the Grand Canyon","post":"Coyne has a look in the picture that screams “Good God I am smart, and also refined”. However, when I view the photo he looks like Elmer Fudd with hair.\n\n","date":"June 30, 2012 at 6:01 pm","url":"https://shroudstory.com/2012/06/28/noahs-ark-the-shroud-of-turin-and-the-grand-canyon/","cat":"news_&_views","id":"comment-13243","author":"Tim","site":"shroudstory"},{"title":"Noah’s Ark, the Shroud of Turin and the Grand Canyon","post":"Do you mean smug?  I find it useless to insult others who differ from me.  My response here is probably something he will not read, but his responses to my post would be interesting.  Be he fully intelligent or full of himself, that would become clear from an exchange of ideas.  I enjoy intelligent conversations, even with those with whom I disagree.\n\n","date":"July 2, 2012 at 8:02 pm","url":"https://shroudstory.com/2012/06/28/noahs-ark-the-shroud-of-turin-and-the-grand-canyon/","cat":"news_&_views","id":"comment-13347","author":"Andy Weiss","site":"shroudstory"},{"title":"Noah’s Ark, the Shroud of Turin and the Grand Canyon","post":"I am happy for you, but he still looks like a preening Elmer Fudd…\n\n","date":"July 3, 2012 at 6:23 am","url":"https://shroudstory.com/2012/06/28/noahs-ark-the-shroud-of-turin-and-the-grand-canyon/","cat":"news_&_views","id":"comment-13375","author":"Tim","site":"shroudstory"}]
