[{"title":"After CNN","post":"There is one minor sentence I disagree:\nbiblical scholarship is predominantly Protestant\n??? Candida Moss, one of the “experts” in the recent CNN show is catholic for example http://en.wikipedia.org/wiki/Candida_Moss\nBut except for that the post is good:\nTo my knowledge, that is where things stand with most Jesus researchers. They don’t know what to do with the Shroud. And so they do nothing. After all, the Shroud is not a “text” and does not enter the historical record until the fourteenth century. Moreover, Shroud-science, or “Sindonology,” requires professional expertise in numerous scientific disciplines, none of which biblical scholars are qualified to adjudicate. \nI sign both hands below that.\n\n","date":"March 4, 2015 at 3:41 am","url":"https://shroudstory.com/2015/03/04/after-cnn/","cat":"news_&_views","id":"comment-192354","author":"O.K.","site":"shroudstory"},{"title":"After CNN","post":"Yes I am agreeing with you OK. We must not give any credit to Catholic or Protestant. Although I was a protestant, thanks to Shroud of Turin (or real burial cloth of Jesus), now I am a follower of Jesus. Now I am not calling myself as neither a Catholic nor a Protestant. Sorry to say that in the past and even now Protestants and Catholics are confusing Christians.  However, now. I go to any church (Protestant or Catholic) when possible and pray to my Father.\n\n","date":"March 4, 2015 at 4:59 pm","url":"https://shroudstory.com/2015/03/04/after-cnn/","cat":"news_&_views","id":"comment-192435","author":"Sampath Fernando","site":"shroudstory"},{"title":"After CNN","post":"More to say:\nPredominantly is not a synonym for best. Has he heard about Father Joseph A.Fitzmyer, SJ judged to be the ‘scholars’ scholar’ in his home country and one of the 20th century’s foremost biblical scholars, Monsignor John P. Meier, John J. Collins, Émile Puech, OP, Eugene Ulrich, Elizabeth Schussler Fiorenza, Pheme Perkins, Joseph Blenkinsopp, to name just a few?\n\n","date":"March 4, 2015 at 7:03 am","url":"https://shroudstory.com/2015/03/04/after-cnn/","cat":"news_&_views","id":"comment-192369","author":"Louis","site":"shroudstory"},{"title":"After CNN","post":"The word “predominantly” does not mean “exclusively”. There are obviously scholars of all backgrounds in the field: Catholic, Jewish, Atheist to name a few. The author is not saying that biblical scholarship is “only” Protestant. He is correct, however, that a majority of biblical scholars come from a Protestant background. This is a thought provoking and well written piece. The original article is even more compelling.\n\n","date":"March 4, 2015 at 12:33 pm","url":"https://shroudstory.com/2015/03/04/after-cnn/","cat":"news_&_views","id":"comment-192403","author":"Prema","site":"shroudstory"},{"title":"After CNN","post":"He is correct, however, that a majority of biblical scholars come from a Protestant background. \nMaybe in the US, where protestants are still majority. Globally,  situation is probably different. I haven’t checked any statistics but I hardly believe that there are fewer Catholic biblical scholars (anyway Catholic Church is still the greatest one) than Protestant biblical scholars in the world.\n\n","date":"March 4, 2015 at 5:33 pm","url":"https://shroudstory.com/2015/03/04/after-cnn/","cat":"news_&_views","id":"comment-192437","author":"O.K.","site":"shroudstory"},{"title":"After CNN","post":"Sorry, I understand English as well as another language derived from Sanskrit, from which your name — or the one used — is derived. I therefore stand by what I commented.\n\n","date":"March 4, 2015 at 5:17 pm","url":"https://shroudstory.com/2015/03/04/after-cnn/","cat":"news_&_views","id":"comment-192436","author":"Louis","site":"shroudstory"},{"title":"After CNN","post":"The comment was regarding scholars – not practitioners or theologians. While Catholicism may be the leading denomination of Christianity – biblical scholarship was born of the Protestant movement. It started in Germany then moved to England then the US. \n For over 200 years it was a primarily Protestant field. It wasn’t until the mid 20th century that Catholics were allowed to approach the texts critically.\nAnd no need to insult ones ethnicity or name.\n\n","date":"March 4, 2015 at 7:33 pm","url":"https://shroudstory.com/2015/03/04/after-cnn/","cat":"news_&_views","id":"comment-192442","author":"Prema","site":"shroudstory"},{"title":"After CNN","post":"I am a follower of Jesus not Protestant or Catholic. Last year I went to Turin to pay my respect to the burial cloth of Jesus (Shroud of Turin). Before I left one Anglican Priest from Sydney told me that “why are your going there it is a fake one”. So majority of Protestants condemn Shroud of Turin because they don’t know much about it and they like to condemn images of Jesus because of that Protestant movement started in Germany.\n\n","date":"March 4, 2015 at 7:50 pm","url":"https://shroudstory.com/2015/03/04/after-cnn/","cat":"news_&_views","id":"comment-192443","author":"Sampath Fernando","site":"shroudstory"},{"title":"After CNN","post":"also don’t give mary much respect\n\n","date":"March 4, 2015 at 8:15 pm","url":"https://shroudstory.com/2015/03/04/after-cnn/","cat":"news_&_views","id":"comment-192447","author":"rick","site":"shroudstory"},{"title":"After CNN","post":"Once I told those priests not to condemn Mother Mary from their pulpits.\n\n","date":"March 4, 2015 at 8:22 pm","url":"https://shroudstory.com/2015/03/04/after-cnn/","cat":"news_&_views","id":"comment-192448","author":"Sampath Fernando","site":"shroudstory"},{"title":"After CNN","post":"Directed to Prema:\nPlease read the comments carefully, keeping emotion aside as far as possible. Where did you find insults relating to ethnicity or name?\nBiblical scholarship did not begin with Protestant scholars in Germany. It was preceded by Biblical criticism that began with Spinoza, a Portuguese Jew living in Holland, and Hobbes, an Englishman.\n\n","date":"March 5, 2015 at 9:38 am","url":"https://shroudstory.com/2015/03/04/after-cnn/","cat":"news_&_views","id":"comment-192504","author":"Louis","site":"shroudstory"},{"title":"After CNN","post":"There is much that could be stated on the history of biblical criticism, too much to encapsulate here in a brief comment.  \nMuch of the New Testament itself includes an attempt to interpret the ancient scriptures in terms of the new Christianity, to see those who had accepted Jesus as Lord and Saviour as the new People of God, supplanting the exclusiveness of Judaism by extending salvation to the gentiles. \nIn the first few hundred years of Christianity, the patristic period, the preferred method of interpreting the scriptures seems to have been an allegorical approach (Clement & Origen in Alexandria).  Thus Origen claimed that the most meaningful aspects of divine revelation could be extracted only by allegorization, a view echoed by Clement. \nLater from about 350 AD, Theodore of Mopsuestia (c. 350-428/429) and John Chrysostom (c. 347-407), patriarch of Constantinople, developed an exegesis that took more account of literal meaning and historical context. But the allegorizers could claim that their method yielded lessons that, while arbitrary, were more relevant and interesting to ordinary Christians.   \nIn the West, the Alexandrian method was adopted by both Ambrose and Augustine.  Augustine, though not primarily an exegete, composed both literal and allegorical commentaries and expository homilies on many parts of Scripture, and his grasp of divine love as the essential element in revelation supplied a unifying hermeneutical principle that compensates for technical deficiencies.  Jerome paid close attention to the grammatical context, often appealing from the Greek Septuagint to the “Hebraic verity”.    \nThe scholastics made further progress during the medieval period.  Thus for Thomas Aquinas, the literal sense, expressing the author’s intention, was a fit object of scientific study; the figurative senses unfolded the divine intention.  There is much more that could be said on the contribution of the medievalists. \nThe Protestant Reformation, with its emphasis on scripture as the sole source of divine revelation could hardly have occurred without the contemporaneous invention of printing.  However both Luther and Calvin reverted to favouring the literal approach as that to be preferred against the allegorical.  Hence it is hardly surprising as a strategy that the first steps in modern biblical criticism to recover from this position were those by German Protestants. \nPerhaps the first steps were taken by Griesbach in 1776 who printed the gospels of Matthew, Mark and Luke in parallel columns, giving them the name synoptic.  Others also made their various contributions: Bengel, Lowth, Lachmann, Wellhausen and others.  \nMajor breakthroughs occurred at the start of the 20th century from both Schweitzer and Bultmann.  Butlmann in particular seems to have been particularly concerned at the apparent conflicts between science and religion, which he attributed to the mythological world view current at the time the scriptures were written, and which he saw as inessential to the fundamentals of faith, but which in the modern context masked it.  Other Protestant scholars followed on, such as Karl Barth with his existential approach.  \nThe Catholic response was much more slow, anchored as it was in the Greek Septuagint, as prevalent in New Testament times, and in Jerome’s Latin Vulgate.  Perhaps the first breakthrough occurred with the 1893 encyclical of Pope Leo XIII “Providentissimus Deus” ‘On the Study of Holy Scripture’.  There followed the war-time 1943 encyclical of Pope Pius XII “Divino Spiritu Afflante”, ‘ On Promoting Biblical Studies’.  Both encyclicals are reproduced in a 1955 Douay-Rheims translation I still hold of the Latin Vulgate.  I recall reading both encyclicals there as a young man.  Perhaps the greatest impetus and encouragement to modern Catholic Biblical Studies arose from the 1965 Vatican II Council document, “Dei Verbum” ‘On divine revelation’.  Thus the footnotes of the Jerusalem Bible version (a translation from French to English) provide a critical commentary in themselves for the general reader.\nCatholic scholars in biblical studies had a lot of catching up on their Protestant colleagues.  However in some quarters, it is now considered that they have well overtaken them.  \nAnd even yet I have said very little on the various types of criticism whether: textual, philological, literary, form, tradition or historical criticisms.  All are vast subjects in themselves.\n\n","date":"March 5, 2015 at 12:11 am","url":"https://shroudstory.com/2015/03/04/after-cnn/","cat":"news_&_views","id":"comment-192460","author":"daveb of wellington nz","site":"shroudstory"},{"title":"After CNN","post":"Simon J. Joseph wrote: “After all, the Shroud is not a “text” and does not enter the historical record until the fourteenth century.” \nLITERALLY speaking the TS as an ancient textile is a ‘text’ since Latin textus can mean both “textile” and “text”. Indeed it is a sanguis-et-corpuscript. \nUNOFFICIALLY speaking the relic enters the historical record, which means it was cryptically referred to and even depicted prior to the fourteenth century CE. Actually what is missing are unambiguous information transmission chains (historical gaps) from 1208 to 1352 CE and the last decades of the 2nd century CE to 957 CE.\n\n","date":"March 5, 2015 at 4:21 am","url":"https://shroudstory.com/2015/03/04/after-cnn/","cat":"news_&_views","id":"comment-192469","author":"Max patrick Hamon","site":"shroudstory"}]
