[{"title":"Of People Who Drink Medicinal Wine from a Teaspoon","post":"Any of us working on the Shroud are continually bombarded by misinterpretations of what limited evidence there is. I suspect the lying on the back one is a misinterpretation from one of my points in my HT article..\nOf course, i never use the word ‘fake’ as I don’t believe the Shroud was created to deceive anyone.\nIf you examine the early depictions of the Shroud you will see gaps between the elbows and the body (they have now been swallowed up by the firemarks). If you lie on the ground and hold that position you will not also be able to cross your hands in the front. So this and other evidence suggests that these are not images simultaneously taken from the same body,\n\n","date":"June 16, 2015 at 11:41 am","url":"https://shroudstory.com/2015/06/16/of-people-who-drink-medicinal-wine-from-a-teaspoon/","cat":"news_&_views","id":"comment-202366","author":"Charles Freeman","site":"shroudstory"},{"title":"Of People Who Drink Medicinal Wine from a Teaspoon","post":"“If you lie on the ground and hold that position you will not also be able to cross your hands in the front. “ \nEs la cosa  MÁS ESTÚPIDA que se haya escrito sobre la TS y su gran éxito entre los escépticos abre muchos interrogantes mentales.\n La leí por vez primera en artículo del escéptico Hernán del Toro en la revista del CSICOP “Pensar” hace varios años:\n“ Cualquier persona que quiera simular la posición del supuesto”cadáver”, puede hacer lo siguiente: acostarse en el SUELO boca arriba, dejar reposar los codos sobre el suelo, tomar una de las muñecas con la otra mano, Y SIN DESPEGAR LOS CODOS DEL SUELO, tratar de ocultar los genitales… lograr esta posición es tan imposible como morderse el codo.”\n(las mayúsculas son mías)\nComo todos los “mortales” (sin malformación del brazo) pueden alcanzar sus genitales cuando están tumbados sin el mínimo problema, las condiciones SINE QUA NON para realizar  la estúpida propuesta son:\n1.- Estar sobre una superficie totalmente PLANA .\n2.- REPOSAR y FIJAR los codos sobre dicha superficie PLANA.\nEs sorprendente que Charles Freeman la exprese.\n\nCarlos\n\n","date":"June 16, 2015 at 1:59 pm","url":"https://shroudstory.com/2015/06/16/of-people-who-drink-medicinal-wine-from-a-teaspoon/","cat":"news_&_views","id":"comment-202380","author":"Carlos","site":"shroudstory"},{"title":"Of People Who Drink Medicinal Wine from a Teaspoon","post":"A Google translation of the above excellent comment by Carlos:\n“If you lie on the ground and hold that position you will not also be able to cross your hands in the front. “\nIt’s the stupidest thing ever written about the TS and its success among the skeptics opens many mental questions.\nI read the first article of the skeptical Hernán del Toro CSICOP magazine “Think” several years ago:\n“Anyone who wants to simulate the position of the alleged” body “can do the following: lie on the floor face up, let rest your elbows on the floor, take one wrist with the other hand, and without taking elbows SOIL, trying to hide the genitals … achieve this position is as impossible as biting your elbow. ”\n(capitals mine)\nLike all the “deadly” (without malformation of the arm) can achieve their genitals when they are lying without the slightest problem, the conditions sine qua non for the stupid proposal are:\n1. Being on a totally flat surface.\n2. SET SLEEP and elbows on said flat surface.\nCharles Freeman surprisingly the expressed.\nCarlos\n\n","date":"June 17, 2015 at 12:35 am","url":"https://shroudstory.com/2015/06/16/of-people-who-drink-medicinal-wine-from-a-teaspoon/","cat":"news_&_views","id":"comment-202450","author":"Dan","site":"shroudstory"},{"title":"Of People Who Drink Medicinal Wine from a Teaspoon","post":"Dan, you misleadingly wrote (as usual) “using such coins (Pilate’s coin minted for Jews) to close the eyes of Jews was not a Jewish burial custom.”\nThe true fact is SPORADIC placings of a small coin over each eye to be later found in the deceased’s mouth as the body decays is NOT inconsistent AT ALL with thanathology, halakha (religious Judean/Jewish law) and Second Temple period archaeological finds. To claim to the contrary is BAD archaeology. How long shall I have still to DE-poison the well?\nSeveral 1st c. CE tombs  yielded 46 (forty-six) Pilate coins throughout the Land of Israel. Hence archaeologically speaking and no matter how sporadically,  Roman\nProcurators coins, among which mostly Pilate coins  were used on Second Temple period burial practices (unless Dan anachronologically thinks alike Joe Zias, an anthropologist –not an archaeologist!–,  ALL the Pilate coins found in STP tombs ‘simply fell out of the POCKETS(sic!) (upper cases mine) of the STP buriers or mourners. The numismatic archaeological finds in Second Temple tombs just cannot any longer be denied (see  L.Y.RAHMANI, “Jason’s Tomb”, Israel Exploration Journal 17(1967) 100 and L.Y.RAHMANI, A Catalogue of Jewish Ossuaries. Re his totally biased (and agenda driven) opinion/reliability on the TS coin-on-eye issue, in 1980, Rahmani stated “No coins of the period 50 BC to 70 AD were found in any tomb” while, in 1956, Jason’s Tomb (excavated by Prof. Rahmani himself!), yielded no less than 55 coins among which 28 Pilate coins (both lepton simpulum and dilepton littus types). This is not serious!)\nBesides thanatologically speaking, they could have been placed over the eyes of the TS man. Indeed it has been demonstrated experimentally a prutah or dilepton type coin (i.e. a thin small coin), placed over the eye of a deceased lying in a supine position with his head held upright (as if on a headstone or head-rest) or tilted forward (as if on a pillow), by a “piggybank effect” may drop through the lower fissure in the back of the eye socket and fall into the mouth, as the body decays. It may also happen with a coin placed over both eyes. \nStill the fact remains though the very partial Pilate coin tiny patterns  haven’t been correctly/convincingly extracted so far  from the linen cloth pattern in which they are unfortunately embedded (eidomatically and numismatically speaking and in conjunction with archaeological bloodstain pattern analysis/cryptanalysis, markings –no matter how incomplete- left by Pilate coin obverses can be seen on the TS man’s eyelid areas. Hope I’ll finally publish a research paper I wrote in 2011 CE demonstrating beyond the shadow of a rational doubt the very partial Pilate coin obverse impressions are really there).\nReminder one for Dan: one American professional numismatist and two scholar numismatists and Jewish ancient coin experts did identify the partial imprint of a Pilate coin (dilepton lituus type) on the TS man’s right eye. \nIs Dan a Jewish ancient coin expert and/or an eidomatic numismatic/archaeological bloodstain pattern analyst or cryptanalyst? He definitely is not. \nReminder two for Dan: Both ‘I think I sees’ (or false positives) and ‘I think I don’t sees’ (or false negatives) just cannot make up for the real thing. \nReminde three, on March 19, 2014 at 9:00 am, I wrote: \n“Most likely too Pilate coins were used in Second Temple period funerary practices. All the more so as, symbolically speaking, Pilate coin central devices were specifically designed (or ambivalent enough as ‘aniconic designs’) to agree with both 1st c CE Judean and Roman sensibilities and be used by Judeans on an everyday basis. The fact is aniconic lepta and dilepta were allowed in the Jerusalem Temple treasure chamber (re-read Mark and the ‘widow’s mite/Pilate coin episode’). Had Pilate coins feature really offensive central devices, they just could not have been used by Judeans, which is not the case.\nArchaeologically speaking, Pilate coins were used in Second Temple period/1st c. CE funerary practices too (nearly a dozen of Jewish tombs yielded 46 Pilate coins both dilepta (lituus type) and lepta (simpulum type). That’s a fact unless like Zias you think all the Pilate coins found in STP tombs ‘simply fell out of the pockets (sic!)of those visiting or preparing the tomb'(dixit). If so in the Jason’s Tomb for instance (Greenhut’s reference), they were many to have a hole in ‘their pockets’ and to lose Pilate coins since, in 1956, it yieded more than 55 coins among which no less than 28 Pilate coins (at the feet and nearby the body remains). Sporadic Second Temple funerary practices have not been convincingly cleared up yet (see Greenhut). Placement of Roman aniconic coins over the deceased’s eyes (no matter how sporadic) just cannot thus be totally excluded in the state of our knowledge of 1st c. CE Jewish burials. The fact remains 59 coins of “Roman procurators” + 12 “Roman” coins were found inside a dozen of Second Temple period tombs (the issue here is on coins found in SECOND TEMPLE PERIOD TOMBS untouched by robbers and still closed at the time of investigation (implied). More than half of the coins found are Pilate coins (augur wand and pail types). This speaks volumes re the use of Roman coins in Second Temple period funerary pratices. It was a Second Temple period sporadic funerary pratice at worse, yet a funerary practice all the same.Besides Roman coins, Herodian coins too shall be taken into account, which involved 27 Second Temple period tombs (hence more than two dozens) and 124 coins in all (in 2005) thus more than 10 dozens of coins. Methinks they might well be only the tip of the Second Temple period funerary monetary iceberg respective of the percentage of coins inside tombs that were undiscovered, or else disappeared with time and given the fact only 8-9 hundreds of Second Temple period TOMBS were excavated so far.\nThe body image resolution is 0.5cm while the blood image (and thus any blood smeared object images) resolution is 0.4-0.5mm. Experimentally, Moroni, Rodante and myself could record Pilate coin or one Euro cent coin tiny characters on a 3/1 twill fabric providing the coin is partially smearded with blood. This is an experimental fact.\nMy (archaeo)cryptological theory: Yosseph Ha-Ramathaym/Yossef Bar Naba could have placed himself the coins over Yeshua’s eyes on burial as the very name Yossef was given to the eldest son/disciple (Ben = Tamid = Disciple in Hebrew)for him to close not only his father’s eyes but also his master’s (aka Yeshua Ha-Nostry’s/Jesus of Nazareth’s).\nThe placing of coins over Yeshua’s eyes had nothing to do with the Charon’s obol. Most likely it was both to keep his eyelids closed or to cover his still open/half open eyes AND to read as a silent/coin rebus-like/coin puzzle-like eulogy as eulogy was not allowed to be pronounced in the month of Nissan, the month in which Yeshua was put to death. According to Jewish traditional custom, the eulogy should not be PRONOUNCED to honour the departed during the entire month of Nisan. Hence recurring to a monetary rebus to silently honour the departed Rabbi is therefore a real possibility to finally account for the placement of coins over eyes in the Second Temple period. Most likely, the placement of coins over Yeshua as great Torah Scholar’s eyes was done with this kavannah, i.e. in this specific design. The word kavvanah (literally “direction”)refers to one ‘s state of mind/intention i.e. concentration on the meaning of the words recited, the act performed (here silent eulogy), or the theological goal (such as the acceptance of the sovereignty of God). \nThe placing of coins over the deceased eyes is sort of an original recycling/revisiting of the Hellenistic custom of placing a coin or two in the deceased’s mouth.\nMost likely, there were specific circumstances in which (rich?) Judean buriers or mourners recurred to placing coins over eyes not only to prevent the deceased’s eyelids to lift up or to hide his/her open/half open eyes but also to honour the deceased’s memory and abide by the Halakha(Judean religious law) when the eulogy was not allowed to be pronounced.\nTherefore it would be good archaeology not to too rapidly rule out the real possibility for such small thin bronze coins to have been originally placed over the eyes in order both to keep the deceased’s eyelids closed (or cover his eyes) and pay a last tribute to the deceased’s memory in the manner of a rebus-like silent eulogy (see my 2005 unpublished paper “Linceul de Turin : L’Eloge Funèbre du Christ Retrouvée ? ou Tentative de décrytptage d’un très singulier rebus monétaire”).”\nDan just means uninitiated opinion, I mean facts and consistent theory as a professional (archaeo)cryptologist.\n\n","date":"June 16, 2015 at 12:39 pm","url":"https://shroudstory.com/2015/06/16/of-people-who-drink-medicinal-wine-from-a-teaspoon/","cat":"news_&_views","id":"comment-202373","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Of People Who Drink Medicinal Wine from a Teaspoon","post":"“ Hope I’ll finally publish a research paper I wrote in 2011 CE demonstrating beyond the shadow of a rational doubt the very partial Pilate coin obverse impressions are really there).\nReminder one for Dan: one American professional numismatist and two scholar numismatists and Jewish ancient coin experts did identify the partial imprint of a Pilate coin (dilepton lituus type) on the TS man’s right eye”. \nHello Max, is your draft available on line and who and what sources were used by the numismatics to make that claim.\nThanks Max\n\n","date":"June 16, 2015 at 2:23 pm","url":"https://shroudstory.com/2015/06/16/of-people-who-drink-medicinal-wine-from-a-teaspoon/","cat":"news_&_views","id":"comment-202383","author":"Giorgio HSG","site":"shroudstory"},{"title":"Of People Who Drink Medicinal Wine from a Teaspoon","post":"“Reminder three, on March 19, 2014 at 9:00 am, I wrote…” You did, Max, you did. You were wrong then, and you’re no less wrong now. The occurrence of sporadic coins is not evidence of a custom. Does anybody apart from you think it was? Not Rahmani, not Haklili, not Zias, not Charlesworth. Nobody doubts that coins occur in funerary situations, mostly in ossuaries, and perhaps they were appropriate for keeping eyes closed from time to time, but you specifically criticise Dan’s use of the word ‘custom,’ which criticism, I feel, you have failed to support.\n\n","date":"June 16, 2015 at 2:21 pm","url":"https://shroudstory.com/2015/06/16/of-people-who-drink-medicinal-wine-from-a-teaspoon/","cat":"news_&_views","id":"comment-202382","author":"Hugh Farey","site":"shroudstory"},{"title":"Of People Who Drink Medicinal Wine from a Teaspoon","post":"Hugh,\nI never said it was a ‘sporadic custom’ but only a sporadic pratice (cannot you read me?)\nI had hoped you could have discriminated between custom and practice and not misrepresented again my theory. Methinks I was only wrong in that.\n\n","date":"June 16, 2015 at 3:36 pm","url":"https://shroudstory.com/2015/06/16/of-people-who-drink-medicinal-wine-from-a-teaspoon/","cat":"news_&_views","id":"comment-202388","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Of People Who Drink Medicinal Wine from a Teaspoon","post":"What is the difference between a custom and a practice, archaeo-cryptologically speaking?\n\n","date":"June 16, 2015 at 3:49 pm","url":"https://shroudstory.com/2015/06/16/of-people-who-drink-medicinal-wine-from-a-teaspoon/","cat":"news_&_views","id":"comment-202391","author":"David Goulet","site":"shroudstory"},{"title":"Of People Who Drink Medicinal Wine from a Teaspoon","post":"Custom can be defined as a general law   whereas practice as a particular\n\n","date":"June 16, 2015 at 4:47 pm","url":"https://shroudstory.com/2015/06/16/of-people-who-drink-medicinal-wine-from-a-teaspoon/","cat":"news_&_views","id":"comment-202394","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Of People Who Drink Medicinal Wine from a Teaspoon","post":"Custom cannot be sporadic and can be defined as a general law (i.e. followed by many people in a society or culture whereas a practice can be sporadic as a particular tiny habit followed by few people from a specific cultural milieu within the society.\n\n","date":"June 16, 2015 at 5:19 pm","url":"https://shroudstory.com/2015/06/16/of-people-who-drink-medicinal-wine-from-a-teaspoon/","cat":"news_&_views","id":"comment-202398","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Of People Who Drink Medicinal Wine from a Teaspoon","post":"In other words ‘a custom’ per se is commonly, usually or regularly observed whereas ‘a practice’ per se is occasionally and irregularly observed.\n\n","date":"June 16, 2015 at 7:04 pm","url":"https://shroudstory.com/2015/06/16/of-people-who-drink-medicinal-wine-from-a-teaspoon/","cat":"news_&_views","id":"comment-202419","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Of People Who Drink Medicinal Wine from a Teaspoon","post":"It is likely that some Sadducees, unable to believe that there is no life after death, that we go to “nothing”, — after all,they were not Buddhists — used coins to pay Charon to ferry their souls across the Styx.\n\n","date":"June 16, 2015 at 3:42 pm","url":"https://shroudstory.com/2015/06/16/of-people-who-drink-medicinal-wine-from-a-teaspoon/","cat":"news_&_views","id":"comment-202390","author":"Louis","site":"shroudstory"},{"title":"Of People Who Drink Medicinal Wine from a Teaspoon","post":"Methinks it is unlikely. All the more so as a Sadducee could become a Pharisee (see Joseph Flavius), an Essene or a Zealot.\n\n","date":"June 16, 2015 at 5:23 pm","url":"https://shroudstory.com/2015/06/16/of-people-who-drink-medicinal-wine-from-a-teaspoon/","cat":"news_&_views","id":"comment-202400","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Of People Who Drink Medicinal Wine from a Teaspoon","post":"…not to mention a Notseree (a Christian)\n\n","date":"June 16, 2015 at 5:29 pm","url":"https://shroudstory.com/2015/06/16/of-people-who-drink-medicinal-wine-from-a-teaspoon/","cat":"news_&_views","id":"comment-202401","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Of People Who Drink Medicinal Wine from a Teaspoon","post":"On June 21, 2013 at 12:20 pm, I wrote:\n“(…)in the context of a Judean burial of the Second Temple period, the Charon’s obol theory is a most unconvincing explanation as it creates more questions than answers and has a potential to mislead. For instance, in the Jericho D/18 tomb case, why exactly a Judean burier or mourner would have felt the need to place two coins instead of only one in the deceased’s mouth as Charon’s obol? Would the two coins have been intended for a return trip? In the Caiaphas’ daughter’s intact skull case, why exactly would a high priest family of Jerusalem have felt the need to recur to the pagan custom to bury one of its deceased members? It actually verges on sheer anachronism.”\n\n","date":"June 16, 2015 at 5:58 pm","url":"https://shroudstory.com/2015/06/16/of-people-who-drink-medicinal-wine-from-a-teaspoon/","cat":"news_&_views","id":"comment-202405","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Of People Who Drink Medicinal Wine from a Teaspoon","post":"Well, that was always possible, but I am referring to Sadducees (Saduquim) who died without becoming Pharisees, Essenes, Zealots or Notzrim.\n\n","date":"June 16, 2015 at 5:54 pm","url":"https://shroudstory.com/2015/06/16/of-people-who-drink-medicinal-wine-from-a-teaspoon/","cat":"news_&_views","id":"comment-202404","author":"Louis","site":"shroudstory"},{"title":"Of People Who Drink Medicinal Wine from a Teaspoon","post":"Which are they, any specific reference?\n\n","date":"June 16, 2015 at 6:00 pm","url":"https://shroudstory.com/2015/06/16/of-people-who-drink-medicinal-wine-from-a-teaspoon/","cat":"news_&_views","id":"comment-202406","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Of People Who Drink Medicinal Wine from a Teaspoon","post":"A Sadducee who is “unable to believe that there is no life after death, that we go to “nothing”” by mere definition just cannot be any longer a Sadducee but is, by choice, either a Pharisee from Sadducean origin, an Essene from Sadducean origin or a Notsree from Sadducean origin. Period.\n\n","date":"June 16, 2015 at 6:06 pm","url":"https://shroudstory.com/2015/06/16/of-people-who-drink-medicinal-wine-from-a-teaspoon/","cat":"news_&_views","id":"comment-202409","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Of People Who Drink Medicinal Wine from a Teaspoon","post":"Typo: Which ones, any specific reference?\n\n","date":"June 16, 2015 at 6:13 pm","url":"https://shroudstory.com/2015/06/16/of-people-who-drink-medicinal-wine-from-a-teaspoon/","cat":"news_&_views","id":"comment-202410","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Of People Who Drink Medicinal Wine from a Teaspoon","post":"It could be, but what I am saying is that although he may have believed only in the Torah, and not Tanakh, like Saduceees in general, doubts about nothingness after death led him to Greek (pagan) beliefs. Greco-Roman influence was strong in Jerusalem, the Sadducees liked to imitate the Greeks in some ways.\nNothingness? Not even Buddha could explain it. It is said that he told disciples who asked him questions for which he had no responses to think about getting out of the karmic cycle instead of indulging in speculation.\n\n","date":"June 16, 2015 at 6:21 pm","url":"https://shroudstory.com/2015/06/16/of-people-who-drink-medicinal-wine-from-a-teaspoon/","cat":"news_&_views","id":"comment-202411","author":"Louis","site":"shroudstory"},{"title":"Of People Who Drink Medicinal Wine from a Teaspoon","post":"References? What references? Who knows what was going on in individual (Sadducean) minds?\n\n","date":"June 16, 2015 at 6:24 pm","url":"https://shroudstory.com/2015/06/16/of-people-who-drink-medicinal-wine-from-a-teaspoon/","cat":"news_&_views","id":"comment-202412","author":"Louis","site":"shroudstory"},{"title":"Of People Who Drink Medicinal Wine from a Teaspoon","post":"Re. Max’s comment; “Would the two coins have been intended for a return trip? In the Caiaphas’ daughter’s intact skull case, why exactly would a high priest family of Jerusalem have felt the need to recur to the pagan custom to bury one of its deceased members? It actually verges on sheer anachronism.”\nReally? Didn’t you know that some priests at the Temple indulged in witchcraft to get to the post of High Priest? They got a nice example from Solomon, who built the Jerusalem Temple “Beit Jahveh” (House of Yahveh) and another smaller one dedicated to the goddess Ishtar. Haven’t you read in the New Testament how Jesus spoke against those Jews who worshipped Ba’al?\nMonotheism then, was not as it is understood now. It was really defined by the Council of Nicaea, in AD 325, and for other reasons.\n\n","date":"June 16, 2015 at 6:56 pm","url":"https://shroudstory.com/2015/06/16/of-people-who-drink-medicinal-wine-from-a-teaspoon/","cat":"news_&_views","id":"comment-202418","author":"Louis","site":"shroudstory"},{"title":"Of People Who Drink Medicinal Wine from a Teaspoon","post":"Louis, don’t you mix Salomon days with Second temple period, please. To have a Sadducee believe there is a life after death is totally contrary to Sadducees’ very beliefs. \nReminder for Louis: For the Sadducees  there is no resurrection of the dead neither angel nor spirit. They did not believe any such species of beings as angels, nor indeed any spirits whatever, which were immaterial or immortal; for as for the spirit or soul of man, they took that to be only the temperament of the body, and that it died with it, and did not exist in any separate state after this life: for so Josephus says, that they deny the permanence of the soul, and rewards and punishments in the invisible state. And, according to the Talmudic writers, they denied that there was any other world than this. Now you want us to belief Sadducee pay Charon’s Obol to cross the Styx. It did not make sense at all for a Sadduccee. Yes indeed, it is sheer anachronism.\n\n","date":"June 16, 2015 at 7:20 pm","url":"https://shroudstory.com/2015/06/16/of-people-who-drink-medicinal-wine-from-a-teaspoon/","cat":"news_&_views","id":"comment-202422","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Of People Who Drink Medicinal Wine from a Teaspoon","post":"Typo: Now you want us to believe some Sadducees paid Charon’s Obol to cross the Styx!\n\n","date":"June 16, 2015 at 7:22 pm","url":"https://shroudstory.com/2015/06/16/of-people-who-drink-medicinal-wine-from-a-teaspoon/","cat":"news_&_views","id":"comment-202423","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Of People Who Drink Medicinal Wine from a Teaspoon","post":"Indeed Sadducees had neither hope of eternal happiness, nor dread of eternal misery. Don’t you mistake Sadduceans for Phariseees or Christians on the specious assumption “(nobody) knows what was going on in individual (Sadducean) minds”.\n\n","date":"June 16, 2015 at 7:43 pm","url":"https://shroudstory.com/2015/06/16/of-people-who-drink-medicinal-wine-from-a-teaspoon/","cat":"news_&_views","id":"comment-202425","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Of People Who Drink Medicinal Wine from a Teaspoon","post":"…why not Christians!\n\n","date":"June 16, 2015 at 7:26 pm","url":"https://shroudstory.com/2015/06/16/of-people-who-drink-medicinal-wine-from-a-teaspoon/","cat":"news_&_views","id":"comment-202424","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Of People Who Drink Medicinal Wine from a Teaspoon","post":"Max, please respect other people’s opinions, particularly when they are professionally involved in the field they are discussing. You are deviating from the topic by making claims that you cannot substantiate because what went on in individual minds during that period can also be seen today. There are several things that you need to know:\nSecond Temple Judaism was not as clear-cut as you think:\nhttps://www.academia.edu/12734802/Book_Review_Beyond_the_Essene_Hypothesis_The_Parting_of_the_Ways_between_Qumran_and_Enochic_Judaism\nFurther, do you think the Essenes got all their beliefs from Torah? How come their eschatological army was based on a Hebrew Herodian army manual (War Scroll) which, in turn, was derived from a Roman army manual? Are you familiar with what top scholars have said?:\nhttps://www.academia.edu/12851672/The_Historical_Jesus_The_view_of_Professor_Geza_Vermes\nDo not forget that “Sheol” was in the collective unconscious of Sadducees, Pharisees and Essenes during that period.\nIf you think religious beliefs in general were always clear-cut and are still so today, please tell me;\n1) Why do some Orthodox Jews today burn fingernails after they are cut?\n2) How do some groups of Orthodox Jews tackle “demoniacal possession”?\nIf you want more, Freud accused C.G. Jung of “dabbling in the occult” and he himself some time later began to study ESP.\n\n","date":"June 17, 2015 at 9:05 am","url":"https://shroudstory.com/2015/06/16/of-people-who-drink-medicinal-wine-from-a-teaspoon/","cat":"news_&_views","id":"comment-202506","author":"Louis","site":"shroudstory"},{"title":"Of People Who Drink Medicinal Wine from a Teaspoon","post":"It all starts with medicinal wine with a teaspoon, skulls of some Sadducees covering their hereafter bets by having coins placed on their eyes, some pareidoleists claiming to see Pontius Pilate lepta on the TSM’s eyes, ergo Jesus was a Sadducee.  I really don’t think so.  Placing coins over the eyes of the dead is a very old folk custom, probably dates from the time of Croesus who invented coinage, and before that it was pebbles.  The Charonic obol legend is merely a piece of aetiology, a false explanation to rationalise a long-held fairly universal practice, in the local contemporary terms of Greek mythology.  It signifies no more than what family members believed was a respectful duty towards the deceased.\n\n","date":"June 16, 2015 at 11:30 pm","url":"https://shroudstory.com/2015/06/16/of-people-who-drink-medicinal-wine-from-a-teaspoon/","cat":"news_&_views","id":"comment-202444","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Of People Who Drink Medicinal Wine from a Teaspoon","post":"That’s cute.\n\n","date":"June 17, 2015 at 7:13 am","url":"https://shroudstory.com/2015/06/16/of-people-who-drink-medicinal-wine-from-a-teaspoon/","cat":"news_&_views","id":"comment-202492","author":"Dcn Andy","site":"shroudstory"}]
