[{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"The starting point of Tipler’s theory is the Big Bang as a beginning and the Big Crunch. Since he wrote his book the perspectives that scientists are exploring have substantially changed. For example, 15 years ago or even 10years ago, nobody would be interesting in studying anything that may have happened before the Big Bang because not only space and matter but also time began with the Big Bang . However, now we have leading scientists like Penrose exploring what he thinks are gravitational waves originated before the Big Bang. When we come to the fate of the universe, more than 73% of matter is dark matter……that nobody knows what it is. However it is considered to be crucial to elucidate whether the universe will expand forever or the gravitational forces will bring it to a Big Crunch. Coming to the multiverse theory….it is a theory with no evidence so far. It is used as an explanation for the fact that the exact values of six cosmological constants -and not any others- are responsible for the universe as it is, and for the laws that have made possible after an evolution process, life and conciousness. The multiverse theory is used to explain that if you throw your dices an infinite number of times, you will find by pure chance the only universe -ours- in which these six cosmological constants adopt the exact values that make consciousness possible. The rest of “results” with your dice configure an infinite number of empty universes -that is,  a multiverse- with “wrong” values associated with those six cosmological constants. But, I would like to stress the idea that there is not a single physical evidence on this theory so far. Gibbs bosson and the many particles yet to be discovered in the future in CERN also pose a strong challenge to Typlers theories, since the final structure of matter is far from being understood.\nTo summarize, Typler just made a nice story with the ingredients he had at hand, but most of them are currently under discussion.\nIn sharp contrast with this, we have the case of saint Agustin who in the fifth century was able to write in his book Confessions that when God created the world He also created time. He was able to reach this conclussion just by reading the book of Genesis. Now, 15 centuries later scientists also agree that time began with the Big Bang, regardless this event has taken place by chance or is a positive act of creation by God. Little people know that the joke Stephen Hawkins often makes in his conferences\n\n","date":"June 29, 2015 at 4:44 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204076","author":"gabriel","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"SORRY I WILL FOLLOW HERE;\nStephen Hawkins (an agnostic himself) makes the same joke at many of his conferences:”what was God doing before creating the world? Perhaps he was thinking on how to punish those of us that wonder about these things:”\nEverybody laughs without knowing that St Agustin made exactly the same joke 15 centuries ago and wrote it in his “Confessions”. 15 centuries from now in the future nobody will do anything similar with Typlers jokes….\n\n","date":"June 29, 2015 at 5:08 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204080","author":"gabriel","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"Gabriel, you will find something about how Stephen Hawking thought, and still thinks to some extent, in the introduction here:\n https://www.academia.edu/4700001/What_do_we_know_about_the_Bible_An_interview_with_Joseph_A._Fitzmyer_SJ\nAfter reading this you will notice that he keeps on changing his mind, he is a good scientist, also influenced by biology although he is a physicist.\n“What was God doing before the creation of the world”? We came after t=o. Get the message?\n—-\nRegarding the Eucharist (including transubstantiation) it has an extremely profound meaning, nothing to do with science, it is beyond the material. To really understand Jesus you have to read between the lines.\n\n","date":"June 30, 2015 at 10:28 am","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204141","author":"Louis","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"I thought Hawkins was an atheist, not agnostic\n\n","date":"June 30, 2015 at 12:44 am","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204096","author":"Thomas","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"Re multiverses:  Gabriel may be aware of a particular text, “Parallel Worlds – A journey through creation, higher dimensions, and the future of the cosmos”  Michio Kaku, Doubleday, 2005, recommended reading for anyone interested in such scientific speculations.  In it Kaku has a fascinating Chapter 8 “A Designer Universe?” where he expands on the idea of ‘Goldilocks Zones’, of which there are several, all persuasive arguments for a designer universe.   He explores the idea of multiverses quite thoroughly.  It seems to be quite a valid proposition, but seems likely to remain only a speculative concept, unless there is a major breakthrough allowing us to penetrate beyond our own universe.  The “anthropic principle” invoked by some seems to say little more than “We’re here because we’re here”, hardly a remarkable insight. \nThe historic changes in human understanding of reality has I think influenced modifications to our understanding of religious matters, often for the better.  Genesis chapter 2 was the first of the biblical creation stories, an anthropomorphic God, a desert nomad camp-fire story perhaps, but with a difference from other contemporary creation stories in that God was a separate being from His creation.  The Babylonian exile ~540 BC exposed the early Israelites to more scientific concepts, and they wrote a more compelling story of creation which we now find in Genesis chapter 1, apparently influencing Augustine, but they still did not throw out the older story.  \nIt gave us a three tiered universe;  above the earth in the sky was the abode of the gods and the heavenly host;  below was Sheol the abode of the dead and the demons.  Despite any advances in Greek astronomy the three-tiered concept remained intact well into medieval times, infuencing such writers as Dante, until finally put to rest by Copernicus, Galileo and Kepler.  \nThe old Genesis stories remained dogma, even influencing men of science.  Niklaus Steno was obliged against his better judgment to compress his discoveries of stratigraphy into a period of 6000 years, and could find few to support him otherwise.   However Laplace’s dogmatic determinism was dealt the death blow by the discoveries in quantum mechanics, where outcomes became matters of probability.  \nCharles Darwin’s theories posed more challenges for traditional concepts of creation, but I think Teilhard de Chardin showed us a better way with his insights.  I am not familiar with Tipler’s writings, but I would affirm that there always needs to be an ongoing dialogue between science and religion.  All new ideas are challenged, as they disturb our comfortable received concepts of reality.  But having been tested in the crucible, the truth will always emerge.  \nI have few problems with the concept of transubstantiation.  We are not the same people we were as recently as seven years ago, not a single atom of us.  If God can renew the material reality of every human being on earth in that space of time, then it can be no problem for His Christ to be truly present in a piece of consecrated bread, nor in a chalice of wine, any appearances to the contrary.\n\n","date":"June 30, 2015 at 4:29 am","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204112","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"Multiverses:  the last gasp of atheist/agnostic scientists to avoid the God of the Big Bang.\nThe universal acknowledgement of the Big Bang in the 20th Century was the biggest blow to Atheism (a religion, ironically) in History.  Some of the atheist leaders immediately set to work on multiverses.  Multiverses, string theory, 17 dimensions:  absolutely no physical proof.  Nice mental exercise.  Even allowing for multiverses, they are still stuck with the Ultimate Cause.  There is no approaching those scientists who cannot allow for both Natural and Supernatural levels of existence (I suggest reading Paul Davies).  An endless argument ensues….\n\n","date":"June 30, 2015 at 7:50 am","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204129","author":"Nabber","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"PbWO4 (= Lead tungstate) crystals are used in the CMS\n(= Compact Muon Solenoid’s) electromagnetic calorimeter.\nStolzite is a mineral, a lead tungstate; with the formula PbWO4.\nIt is similar to, and often associated with, wulfenite which is\nthe same chemical formula except that the tungsten\nis replaced by molybdenum. …\nLinks:\nhttps://en.wikipedia.org/wiki/Stolzite\nhttps://en.wikipedia.org/wiki/Compact_Muon_Solenoid\n>The goal of CMS experiment is to investigate a wide range\nof physics, including the search for the Higgs boson, extra dimensions,\nand particles that could make up dark matter.\n>The Electromagnetic Calorimeter (ECAL) is designed to measure\nwith high accuracy the energies of electrons and photons.\n>… The ECAL is constructed from crystals of lead tungstate, PbWO4.\n>This is an extremely dense but optically clear material, ideal for\nstopping high energy particles.\n>Lead tungstate crystal is made primarily of metal and is heavier\nthan stainless steel, but with a touch of oxygen in this crystalline form\nit is highly transparent and scintillates when electrons and photons\npass through it.\n>This means it produces light in proportion to the particle’s energy.\n>These high-density crystals produce light in fast, short, well-defined\nphoton bursts that allow for a precise, fast and fairly compact detector. …\nWell.\nI think there is not the same level of precision (at present) in Shroud studies!\nCMS and PbWO4:\n>The CMS electromagnetic calorimeter consists of\nover eighty thousand lead tungstate crystals … etc. …\n>… PbWO4 is a birefringent, tetragonal, scheelite-type crystal\nbelonging to the space group I4 1/a or monoclinic raspite.\n>It is grown from a 50%–50% mixture of lead oxide (PbO) and\ntungsten oxide (WO3) which melts congruently at 1123°C,\nwithout a phase transition during cooling.\n— —\n“Current trends in scintillator detectors and materials”\nNuclear Instruments and Methods in Physics Research Section A: Accelerators, Spectrometers, Detectors and Associated Equipment\nVolume 487, Issues 1–2, 11 July 2002, Pages 123–128\n3rd International Workshop on Radiation Imaging Detectors\nAbstract\n>The last decade has seen a renaissance in inorganic scintillator\ndevelopment for gamma ray detection.\n>Lead tungstate (PbWO4) has been developed for\nhigh-energy physics experiments, and possesses exceptionally\nhigh density and radiation hardness, albeit with low luminous efficiency.\n>Lutetium orthosilicate or LSO (Lu2SiO5:Ce) possesses a unique combination of high luminous efficiency, high density, and reasonably short decay time, and is now incorporated in commercial positron emission tomography cameras. There have been advances in understanding the fundamental mechanisms that limit energy resolution, and several recently discovered materials (such as LaBr3:Ce) possess energy resolution that approaches that of direct solid state detectors. Finally, there are indications that a neglected class of scintillator materials that exhibit near band-edge fluorescence could provide scintillators with sub-nanosecond decay times and high luminescent efficiency.\nLink:\nhttp://www.sciencedirect.com/science/article/pii/S0168900202009555\nI believe that discussions about the presumed\n[http://www.scientificamerican.com/article/gravity-waves-cmb-b-mode-polarization/\nor: http://blogs.scientificamerican.com/critical-opalescence/gravitational-waves-reveal-the-universe-before-the-big-bang-an-interview-with-physicist-gabriele-veneziano/ ]\n“gravitational waves originated before the Big Bang”, the Big Bang,\nLHC, Charles Darwin’s theories, etc. and other arguments … are (probably)\nfar from the Shroud and the Person of Jesus…\nFor example: I don’t even know if Christ was really suspended with\na certain amount of weight tied to His feet in preparation\nto be scourged (and, frankly, this seems to me a strange idea =\nwhere is the proof?)…\nI think that the physical evidence about the theory (or theories)\nshould be sought with great skill and patience … or not?\n— —\n>February 05, 2015\n>Message from the Big Bang –“Confirms Quantum Origin of the Universe”\nLink:\nhttp://www.dailygalaxy.com/my_weblog/2015/02/-messages-from-the-big-bang-confirms-quantum-origin-of-the-universe.html\n>Data from the Planck telescope have confirmed beyond\nany reasonable doubt a theory of the quantum origin of structure in the Universe. … etc. …\nAnother link:\nhttps://en.wikipedia.org/wiki/Quantum_fluctuation\n\n","date":"June 30, 2015 at 11:39 am","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204156","author":"piero","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"I think that experiments about gravity and the motion of the Earth\naround the Sun (and the insistence on Geocentricism\n[or, also, Anthropocentrism??!? Please, read the note at the end])\nhad given serious problems because there was a certain\nfundamentalism in the Church …\nPerhaps the same can happen with gravity waves, with the\n“vacuum fluctuations” present before the Big Bang and\nthe alleged “hidden dimensions” of the Universe …\nIn short: science and cosmogonies should be separate from religion.\nIe: religion can not dictate science (unless thre are in play questions\nof ethical principles …) and the same is true for the reverse case.\nThat is, this is the beginning to seriously consider the separated magisteria.\nThen, try also to read what was said by Stephen Gould …\n>Non-overlapping magisteria (NOMA) is the view advocated\nby Stephen Jay Gould that science and religion each represent\ndifferent areas of inquiry – fact vs. values – so that there is a\ndifference between the “nets” over which they have “a\nlegitimate magisterium, or domain of teaching authority,” and\nthese two domains do not overlap. …\nLink:\nhttps://en.wikipedia.org/wiki/Non-overlapping_magisteria\n— — —-\nI believe that you already know the topic, however it is\nalways good to remember these issues …\nReferences about Earth’s rotation and experiments:\n– Jean Bernard Léon Foucault:\nDémonstration du Mouvement de Rotation de la Terre\nau moyen du Pendule. Comptes rendus de l’Academie des Sciencies, 32, 5, 1851.\n– Pendulum: Leon Foucault and the Triumph of Science\nby Amir D. Aczel\nSUNY Press, Nov 2007\n>In 1851, struggling, self-taught physicist Léon Foucault\nperformed a dramatic demonstration inside the Panthéon in Paris.\n>By tracking a pendulum’s path as it swung repeatedly across\nthe interior of the large ceremonial hall, Foucault offered the\nfirst definitive proof — before an audience that comprised\nthe cream of Parisian society, including the future emperor,\nNapoleon III — that the earth revolves on its axis. … etc. …\n>…Richly detailed and evocative, Pendulum tells of the illustrious\nperiod in France during the Second Empire; of Foucault’s relationship\nwith Napoleon III, a colorful character in his own right;\nand — most notably — of the crucial triumph of science over religion.  …\nBut, despite this particular “crucial triumph of science over religion”,\nfew years later, in 1858, there was the message of Holy Virgin in Lourdes  …\nIn any case:\n>…The veracity of the apparitions of Lourdes is not\nan article of faith for Catholics. Nevertheless, all recent Popes\nvisited the Marian shine. Benedict XV, Pius XI, and John XXIII\nwent there as bishops, Pius XII as papal delegate.\n>Working with Le pèlerinage de Lourdes he also issued,\nan encyclical on the hundredth anniversary of the apparitions\nin 1958. John Paul II visited Lourdes three times. … …\n—  *** — *** —\nAnthropocentrism, religion… and findings in Paleoanthropology. \nReference:\nDoes Jesus Save the Neanderthals?\nTheological Perspectives on the Evolutionary Origins\nand Boundaries of Human Nature.\nin Zygon®  \nAbstract. \n>The concept of human uniqueness has long played a central role\nwithin key interpretations of the hominid fossil record\nand within numerous theological understandings of the imago Dei.\n>More recently, the status of humans as evolutionarily unique\nhas come under strong criticism owing to the discovery of\ncertain nonhuman hominids who, as language and culture-bearing\nbeings, lived as contemporaries with early anatomically modern humans.\n>Nevertheless, many scholars, including those in the field of religion\nand science, continue to interpret the remains of these other hominids\nin light of empirically ungrounded implicit assumptions about human\nuniqueness, which the author calls “anthropocentrism of the gaps.”\n>This paper argues that “anthropocentrism of the gaps” is\nphilosophically unwarranted and thus should not be assumed by\nscholars in religion and science when evaluating contemporary\nfindings in paleoanthropology.\nSo, discussing the problems around the origin of the Universe\nI have felt into the Grotto of Lourdes with questions about the salvation\nof other humanities (… which at present are only “other humanities” lost\nin the fog of a prehistorical past …or imaginary “other humanities”, because we don’t know what particular story of progress they would be able to achieve)….\nEnding remarks:\nHow many thousands of years these “creatures of\na different kind of humanity” would have consumed\nto measure both cellulosic Degree of Polymerization\nand Young’s modulus of linen fibrils?\n\n","date":"July 1, 2015 at 10:52 am","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204249","author":"piero","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"Errata corrige:\n>… I have felt myself into the Grotto of Lourdes with questions about the salvation of other humanities …\nInstead of:\n>… I have felt into the Grotto of Lourdes with questions about the salvation of other humanities …\n— — —\nor:\nI have seen as I was staying in front to the Grotto of Lourdes with questions about the salvation of other humanities …\nor:\n>… I have realized that I was staying in front to the Grotto of Lourdes with questions about the salvation of other humanities …\n— — —\nNeanderthals had a 1500cc brain volume, while modern humans have 1400cc. \n>Neanderthals, Denisovans, and modern humans (H. s. sapiens) are all descended from H. heidelbergensis. Between 300,000 and 400,000 years ago, an ancestral group of H. heidelbergensis became independent of others shortly after they had left Africa. One group branched northwest into Europe and West Asia, and eventually evolved into Neanderthals.\n>The other group ventured eastwards throughout Asia, eventually developing into Denisovans. H. heidelbergensis evolved into H. sapiens approximately 130,000 years ago.\nLinks:\nhttps://en.wikipedia.org/wiki/Homo_heidelbergensis\nhttps://en.wikipedia.org/wiki/Homo_rhodesiensis\nhttps://en.wikipedia.org/wiki/Archaic_humans\nhttps://en.wikipedia.org/wiki/Archaic_humans#/media/File:Sapiens_neanderthal_comparison.jp\n— — —\n>The researchers Konrad Lohse of the University of Edinburgh and Laurent Frantz from Wageningen University investigated the biological relationship between modern humans and a previous human species that became extinct around thirty thousand years ago.\n>Experts already agreed that both groups came from a common ancestor in Africa before they spread all over the world. Research has shown that both groups have appeared at different times, where the Neanderthals left Africa 200 000 years earlier than humans.\n>Previous research by other groups resulted in two theories: Genetic exchange between Neanderthals and modern humans and an alternative explanation that modern Europeans and Asians are related to Neanderthals because they descended from the same sub-populations from Africa … …\nLink:\nhttps://www.wageningenur.nl/en/newsarticle/DNAresearch-confirms-recent-interaction-between-Neanderthals-and-humans.htm\nBut, unfortunately, these facts and considerations have nothing or few to do …with the claim (or test) by Tipler about the consecrated host…\n\n","date":"July 2, 2015 at 9:05 am","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204358","author":"piero","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"By Matt K – Moved Here from Another Thread:\nAt the risk of setting off a flame war in the comments, the opening scene of the video is potentially offensive to Catholic or Orthodox Christians who don’t believe women should impersonate the priesthood. Since the politics of outrage is way overdone these days, I’m going to leave it at that: no further comments or efforts on this topic. Thanks for the chance to state this important belief.\n\n","date":"June 30, 2015 at 12:53 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204165","author":"Dan","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"Impersonate?  Offensive? You don’t have to watch the video. \nAnd by the way, I have many Catholic friends who think the priesthood in the Catholic Church should be open to women.  \nRight after 911, Cardinal Egan invited Trinity Wall Street Episcopal Church in New York City to conduct services at the Shrine of St. Elizabeth Ann Seton at Our Lady of the Rosary Parish, a Catholic church.  Trinity, buried in ash and debris, was closed for months. For many weeks Episcopal priests said high mass in this beautiful Catholic church, officiated sometimes by women priests. Catholic priests, a Catholic organist and other parishioners assisted. Catholic bishops from the diocese visited and on one occasion preached while a woman celebrated mass. No one was offended.  \nI’m sure The Most Right Rev. Michael Curry, the new Presiding Bishop, who is just incidentally replacing a woman Presiding Bishop, meant no offense in preparing that video. And I meant none in showing it here in this blog. You may disagree with the idea of woman being priests. But why are you offended by watching members of another Christian tradition practicing their faith their way?\n\n","date":"June 30, 2015 at 1:32 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204171","author":"Dan","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"Dan,  don’t ever forget that the Catholic Church does not recognize the apostolic succession of priests of the Anglican and/or Episcopal churches.  Therefore, even if you believe in transubstantiation (and I, a non-Catholic, happen to), the RC Church does not believe it is legitimate even in a properly-conducted Anglican Mass.  So they really have no problem being in the same church area or preaching there while the Protestant charade (sorry, but accurate) goes on, in the name of ecumenism.  Their minds are made up and there is no change possible; especially about women priests.  (Pope JP-II spoke ex-cathedra on this subject).\nAnd, there is this:\nhttp://catholicexchange.com/ten-facts-most-catholics-don%e2%80%99t-know-but-should\n#7:  There is No Salvation Outside the Catholic Church:\nThis dogma was declared at the Fourth Lateran Council and is a source of confusion for Catholics and non-Catholics alike.  \nIt does not mean that non-Catholics cannot achieve salvation.\n“Individuals who are unaware that the Catholic Church is the one, true Church may still achieve salvation through the merits of the Church, despite their lack of knowledge.”\n\n","date":"June 30, 2015 at 2:21 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204180","author":"Nabber","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"And yet hundreds of Anglican priests (many married) have been accepted into the Catholic Church of late and carry on as ordained priests. Are we to believe that the Eucharist was not being consecrated before, but suddenly is now? What magic is this! :)\n\n","date":"June 30, 2015 at 2:33 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204182","author":"David Goulet","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"So if I am unaware, and I remain unaware because I cannot believe it even though I’m told it, then I may be okay.\nI think I’ll stick to what I believe, thank you very much. See you all there, someday.\n\n","date":"June 30, 2015 at 3:01 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204185","author":"Dan","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"David, you are to believe whatever floats your boat. \nThe point is that the RC Church does not believe in the priesthood of Protestant priests, and so most certainly DOES NOT recognize the consecration of Protestant Eucharist(s).  The Protestant religions don’t even believe in transubstantiation anyway (officially).\nOnce they are Roman Catholic priests, there is no longer any issue.  But they still have to have a RC Bishop “lay hands” upon them.\n\n","date":"June 30, 2015 at 3:12 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204188","author":"Nabber","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"catholics who don’t support what the church teaches are not catholics dan…….they probably sould go to a man made religion……please…no more “some of my best friends” arguments\n\n","date":"June 30, 2015 at 3:53 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204194","author":"rick","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"None of us living now can be held responsible for the human errors of our religious forbears.  We should not seek to defend such errors, but we can attempt to understand the reasons for them.  They are of another era.  We live now in the present and with hope for the future. \nI respectfully suggest to Nabber that he might read the Vatican II document, Lumen Gentium, the Dogmatic Constitution on the Church, particularly Chapter 2 where the emphasis is on the People of God.  It is remarkably inclusive, and he may find there a refreshing change from the strictures of earlier pronouncements.  \nAs a young man, now some 60 years ago, I had read the 1896 encyclical of Pope Leo XIII, Apostlicae Curae, on the validity of Anglican Orders.  It had stemmed from the work of the Oxford Movement, led by such as Henry Newman, now recently canonised.  It had seemed to me then that there was therefore little hope of any reconciliation at all.  However we now seem to be moving in an entirely different and better direction, and anything might become possible.   \nWe often now share in joint worship, even though as yet, full communion remains a barrier. \nMany churches in NZ are now facing considerable reconstruction costs and disruption in order to comply with new national standards of earthquake resistance.   My own parish church will remain inaccessible over the next several months while it is being brought up to the required standard.  Our relationships with the Anglican church across the road is cordial.  Its lady vicar has graciously consented to our parish priest celebrating his popular daily Mass in its main worship area, using the same altar she uses for her own Sunday communion services, unthinkable fifty years ago.  In this atmosphere of mutual cooperation, anything may become possible!\n\n","date":"June 30, 2015 at 3:44 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204193","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"daveb, I remain hopeful for Unification.  I went to RC school for 8-9-10-11 grades, did very well in the Catechism (as an Episcopalian) and still have a fondness for the RC Church.  I do find them to be very inclusive.  The list of 10 things that Catholics ought to know that they “believe”, is, however, in concrete.\n\n","date":"June 30, 2015 at 5:08 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204195","author":"Nabber","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"well….again, at Fatima much of the catholic churches dogma was supported…of course, only 70,000 people witnessed the miracle of the sun…..the church should not be a political party….\nyou can see how “great” our new “enlightened” world is…we are inclusive to the sinner…but the sin is still a sin….\n\n","date":"June 30, 2015 at 6:10 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204196","author":"rick","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"Does Rick imagine that there is more sin outside the Catholic Church than inside it.  I would remind him that fuller knowledge must imply greater culpability.\n\n","date":"June 30, 2015 at 6:36 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204197","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"I very much appreciated Bishop Curry’s exposition on the Eucharist.  And while I am a lifelong and devout Catholic, I also understand that God is not the Catholic Church and the Catholic Church is not God.  It wasn’t so long ago that Catholic education included not-so-veiled warnings that only Catholics could go to heaven.  And there was a very strict list of “mortal” sins the commission of a single one of which would condemn one to a fiery eternity of suffering and remorse unless first confessed to a priest.  So, now let’s think about this a bit.  Who among us would torture someone with fire for even a little while for missing Mass, or masturbating, petty lying or cheating, or just having lust in our hearts?  Yet we used to blithely teach that God would do just that.  And who among us would condemn to hell a kindly and loving ex-Catholic, even one who remarried, much less a homosexual person?  Yet many so-called “good Catholics” have said that God will do exactly that.  No wonder poor George Carlin could not remain in the faith.  \nThe sad thing about these views is that it makes God much inferior to us in the loving department because as bad as we all are, no civilized person would condemn these individuals to cruel punishments of fire and torture.  These are not the things that constitute evil.  Evil comes from hate and anger, destructive impulses, greed and selfishness.  God’s love for us is infinite and eternal and so vastly beyond our comprehension that we can only humbly say “thank you” and try to love Him and our fellow human beings better as we live out our lives.  I feel sorry for so-called “good Catholics” who drag out their rule books and solemn papal pronouncements and think that those in any way offer reliable judgments about God’s ways or those who try to do his will.  So distorted did this approach to Christianity become that it wasn’t too long ago that dissenters were burned alive in the belief that this would meet with God’s approval.  What a strange and horrible god that would be–more likely to be the one down yonder than the Creator and Redeemer.  And if anyone chooses to take issue with this by quoting Christ’s warnings in the New Testament, there are ways to properly interpret those comments without turning God into a sadistic and vindictive tyrant.  This is not the forum for that discussion.  But suffice it to say that we will all be judged by whether we loved.  Those who die with an unloving heart will not be able to be in the presence of Love Eternal.  From that separation come all the agonies of hell.  \nIt is worth reviewing the NDE literature to get a far more accurate view of the nature of God and the afterlife.  Just don’t get carried away with it.  It is very reliable for helping us to understand that God loves all of us–and probably has no objection whatsoever to female priests–and welcomes all those with good hearts into His eternal kingdom regardless of their religious affiliation or even if they have any religious belief at all.  The near death reports don’t tell us much, however, about our placement in that kingdom or whether there may be a process of “re-education” needed based upon our failure to adequately serve God and love in this life.  \nAs for Tipler, consider this quote from Dan’s summation above: \n“It is with mankind’s technology that immortality will be achieved.”\nNow if I am certain about anything, it is that mankind will never achieve immortality on its own.  It is a free gift from God made available to us through the redemption of Jesus.  Good grief.  Mankind has hardly done a good job with our one planet and its resources.  If left to this species to save the universe, well, might as well plan to move to another one if the opportunity presents itself.\nAs for the whole notion of multiverses themselves, I don’t know why this is deemed such a far out notion.  We already know there are multiple dimensions in the universe–Jesus and his mother, Mary, have moved in and out of them on several occasions in history.  How many are there?  No one knows, of course, but it would make sense that there may be multiple dimensions for persons of different levels of holiness for those would logically determine proximity to God.  And cosmology’s “string theory” with its core conclusion that everything in existence consists of vibrating energy, not to mention the strange relationships of quantum mechanics, seems to draw science and faith closer together than ever.\n\n","date":"June 30, 2015 at 7:06 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204198","author":"Jim Carney","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"just remember the primary objective of any bureaucracy and I mean all of them is self preservation. They are composed of  humans.\n\n","date":"June 30, 2015 at 7:53 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204200","author":"Paul","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"Jim Carney, thank you for your comments, most of which I can easily agree with.  After reading Michio Kaku’s text that I mentioned above, I felt I had gained some deeper insight into the concept of the world of the supernatural, if only by analogy.\n\n","date":"June 30, 2015 at 11:09 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204205","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"Yes, thanks, daveb, for the reference to Michio Kaku.  I have not read that work but will now.\n\n","date":"July 1, 2015 at 12:48 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204257","author":"Jim Carney","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"So, Jim, you are a lifelong and devout Catholic.  How do you so quickly cast aside JP-II’s ex cathedra statement on women priests?  You are some kind of Catholic, but my good friend Juan Carlos would label you a “cafeteria Catholic.”  \n“God loves all of us ….and welcomes all those with good hearts into His eternal kingdom regardless of their religious affiliation or even if they have any religious belief at all. ”\nSounds good–and goes over very well down at the corner Unitarian Church (the guys who believe, you know, that Jesus was a good teacher.)  \nYour quote is not what the RC Church teaches.  But I guess as a RC, you get to make up your own rules.  It’s a Brave New World.\n\n","date":"July 1, 2015 at 2:07 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204261","author":"Nabber","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"Pope John Paul II’s ‘ex cathedra’ statement (and it’s debatable if it was validly ex cathedra) can be over turned by another Pope who speaks ex cathedra. How is that possible? Because when Jesus gave the authority to Peter ‘whatever you bind on Earth will be bound in heaven’ He immediately qualified it with ‘and whatever you loose on Earth will be loosed in heaven.’  \nJesus is essentially saying to  Peter “you will eventually tie yourself in a knot and will need to loosen that knot to proceed. Whatever is done can be undone.”\nWe have God’s permission to make mistakes and correct them. Nothing we do is irreversible. The Church’s current understanding of ‘ex cathedra’ is incomplete.\n\n","date":"July 1, 2015 at 6:56 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204288","author":"David Goulet","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"Nabber and other “non-cafeteria Catholics”:  \nThere have been only two ex cathedra pronouncements in the 2,000 year history of the Church: Mary’s Immaculate Conception in 1854 and Mary’s Assumption into Heaven in 1950.  Speaking emphatically and dogmatically does not convert a papal pronouncement into an ex cathedra pronouncement.  The Church, in order words, commonly leaves room for dissent and modifications no matter how much it discourages it.  Pope John Paul II stressed the overriding importance of conscience and the fact that every individual is free to follow his informed conscience in matters of faith and morals.  Of course, one’s conscience may take one out of a particular religion’s category if there is rejection of key elements of that faith.\nThe key elements of being a Catholic are listed in the Nicene Creed.  I fully subscribe to all of those.  I remain a Catholic in spite of many wrong-headed pronouncements by the hierarchy because there I find Christ in the sacraments, especially the Eucharist, in the Word of God, and the communion of the faithful.  \nI reject the notion that “membership” has anything whatsoever to do with salvation.  Membership in the Catholic Church as well as other Christian denominations provides great advantages in pursuing a life that will result in salvation because we hear the teachings of Jesus and learn how we are to form our lives in conformance with those.  But no one who shows up at the gates of heaven is going to be admitted solely upon showing their Catholic ID card.  And many noncatholics are going to be (and have been and are now) joyfully admitted because they are loving human beings who desire to be in the presence of God.\nAlmost every Catholic I know who is strict about following all the rules and quick to condemn “cafeteria Catholics” is judgmental and self-righteous–usually accompanied, however, by a good measure of fear.  Their path to God is filled with trepidation and warnings of how easy it is to go to hell and how difficult to get to heaven.  What love they have for Christ and their fellow human beings is well-hidden in their condemnations and angst.  There is probably no other command expressed more frequently in the New Testament by Jesus than to not judge others.  We cannot do it correctly and it is an offense to God to even try because judging souls is His job.\nMy advice is to learn to see the forest for the trees.  Jesus taught us that there are two great commandments which contain all the rest: love God with all our hearts, minds, souls  and strength and our neighbor as ourselves.  And the Apostle John reminded us that loving God means loving our neighbor.  This is the way to heaven and it not only points to eternal joy with God but it also lights our paths here on earth with happiness and grace.  \nAnother guiding principle is to always remember that God is far more loving than you.  If you can see the good in other people who do not share your religious faith (which you are required to do, by the way, by your Catholic faith as well), certainly God can see it far more clearly.  If other people seem to revel in the presence of a good person who radiates caring and concern, you can be certain that God wants that person around also.  As I mentioned before, the NDE literature gives us a very good picture of the nature of God.  It is quite reassuring as I know that Jesus meant us to feel joyful and happy about his “Good News.”  This, in fact, may be why we are hearing so much about near death experiences now–God is tired of the bad rap he’s been getting from people quite willing to speak for Him when they assert the likely eternal condemnation of those who do not share their particular religious beliefs.\nIn short, stop worrying so much about being a good Catholic and concern yourself with being a good Christian.  You’ll find they blend nicely when you do that and, suddenly, it won’t be so hard to recognize that gays and women are loving human beings, too, with all the capabilities and spiritual beauty of heterosexual men–including as religious leaders.\n\n","date":"July 2, 2015 at 5:12 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204392","author":"Jim Carney","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"There were women deacons in the early church, however Pope John Paul II based himself on the fact that Jesus had only male disciples. It can be dangerous if we now say that was Jesus’ decision during the period and things are different now. If that is done a whole lot of what is in the NT can be challenged and there will be nothing for Christians to believe in.\nThere was some discussion about woman deacons  in “America”, the American Jesuit monthly, some time ago.\nhttp://americamagazine.org/issue/422/article/catholic-women-deacons\n\n","date":"July 1, 2015 at 2:36 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204264","author":"Louis","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"There’s something here about Graham Leonard, Anglican bishop of London, who became Catholic after strong opposition to the ordination of women:\nhttp://www.theguardian.com/world/2010/jan/06/monsignor-graham-leonard-obituary\nI remember reading an interview he gave to 30 days not long after this, but this was more than a decade ago.\nCatholics and Anglicans (Episcopalians) will no doubt have a wide range of opinions.\n\n","date":"July 1, 2015 at 3:32 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204268","author":"Louis","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"We might attain to a perspective on the status of women in 1st century Palestine, by observing certain modern cultures where they continue to be deemed as subordinate to their menfolk.  In Saudi Arabia, they may not be licensed to drive, and in public must always be accompanied by a man, such is the retention of an archaic desert nomadic morality.  In Afghanistan there has been a continuing battle for the education of young girls, often accompanied with mass slaughter of those who so dare to challenge.  In India in not so distant centuries, it was expected that the widows would also mount the funeral pyre, and if dowries were not as expected the in-laws would persecute the bride.  In African tribal societies, similar subordination is prevalent.  \nI have personal acquaintance with similar perspectives in Maori and Polynesian societies.  A close female relative was to receive an award for her artistic achievements.  Protocol demanded that she be excluded from sitting in the front row with the other recipients, only on account of her gender, and with some distaste I was obliged to sit in her place, although I had little to do with what was her own personal achievement.  Such subordination practices are quite common here in these societies.  However it also seems to continue in certain conservative European societies, the background milieu of most or all 20th century Popes who may thereby be influenced by their upbringing and culture.  Equal status in the workplace and the right to a vote are comparatively recent innovations even in societies we might regard as enlightened.   \nJesus challenged such perspectives, and his relationships with women, engaging them in discussion as recorded in the gospels was a signal departure from the common practices of the time.  However, a female apostle in those times would not be at all practicable and would only give rise to scandal and gossip and was clearly not then achievable.  In the minds of many of those times there might well have been an unwarranted association with the temple prostitution of pagan cults.  In fact it is remarkable that the early church went as far as ordaining women as deacons. \nOf the 23 pairs of chromosomes in the human gene, only one pair determines gender, a random accident of the individual’s conception.  Such an accident is a poor indicator of one’s ability to function effectively as any kind of pastor.  I see it as depressing for the Catholic Church that we might yet be overwhelmed by conservative Anglicans, even their bishops, converting on the grounds of their objection to women ordinands.  In Canada and New Zealand, Anglican women priests are not at all uncommon, and in NZ we have seen at least two strikingly effective women Anglican bishops.  \nI cannot see what differences in floppy bits can possibly have to do with the acceptability of women priests or bishops in those cultures prepared to accept them, Papal edicts to the contrary notwithstanding.\n\n","date":"July 1, 2015 at 6:36 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204282","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"I stand by the position taken by John Paul II, who did not claim to read Jesus’ mind, in order to find out why he only chose male disciples. It does seem that this position is binding for those who claim to be Catholics (see Nabber’s comment above). As commented by me last year, I have never seen anyone chained to a pew in a Catholic church, the door is always open for anyone to leave.\n\n","date":"July 1, 2015 at 6:56 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204287","author":"Louis","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"The stock response of the arch-conservative to the indefensible.  Why abdicate, when the truth must be eventually victorious!\n\n","date":"July 1, 2015 at 7:37 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204292","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"Let’s make it clear what JP-2 was saying:  he was witnessing to an infallible dogma by the ordinary and universal Magisterium of the Roman Catholic Church.   So, while Jim Carney is correct about the 2 official Papal ex cathedra statements,  a Papal Statement attesting to an infallible Magisterium, is, in effect, infallible.\nAnd Jim needs to read:\nhttp://catholicexchange.com/ten-facts-most-catholics-don’t-know-but-should\nAnd Jim can spare me all the “peace and love” between cafeteria-Catholics and the rest.\nAnd I’m not RC.\n\n","date":"July 3, 2015 at 10:54 am","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204450","author":"Nabber","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"Re: baryon annihilation via electroweak sphaleron tunneling. The bible describes the taking away of Enoch the 7th from Adam as being “translated” — might this be some kind of removing to a different, higher dimension (ie, the 3rd heaven?) here postulated?\nAnd Enoch walked with God: and he was not; for God took him. –Gen 5.24\nBy faith Enoch was translated that he should not see death; and was not found, because God had translated him: for before his translation he had this testimony [cf. v3 By faith we understand that the worlds were prepared by the word of God, so that what is seen was not made out of things which are visible.], that he pleased God. –Heb 11.5, v3 in brackets.\nAn interesting point on the invisible giving substance to the physical world and Enoch being taken to this invisible dimension perhaps.\nThe other time in the New Testament a similar language and theme is used is in Colossians 1.12-17: Giving thanks unto the Father, which hath made us meet to be partakers of the inheritance of the saints in light: Who hath delivered us from the power of darkness, and hath translated us into the kingdom of his dear Son: [his…: Gr. the Son of his love] In whom we have redemption through his blood, even the forgiveness of sins: Who is the image of the invisible God, the firstborn of every creature: For by him were all things created, that are in heaven, and that are in earth, visible and invisible, whether they be thrones, or dominions, or principalities, or powers: all things were created by him, and for him: And he is before all things, and by him all things consist.\nThe translation here is associated with inheriting light. Is there light during the translation process I wonder?\nElijah the prophet is also said to have been taken up. We are told he left behind a shroud-like cloth from his body at the time, a mantle. Elisha the prophet ‘took up the mantle’ (where this phrase originally alludes to) and used it to strike the Jordan river speaking “Where is the Lord God of Elijah?” and then crossed over when the water parted. Read 2 Kings 2.11-14\nIs this a prophetic preview of the cloth left behind before Christ ascended? Is the shroud here to help us cross the waters of chaos as we ask where is the Lord God?\nThe last words recorded between Elijah and Elisha in 2 Kings 2.9-10: When they had crossed over, Elijah said to Elisha, “Ask what I shall do for you before I am taken from you.” And Elisha said, “Please, let a double portion of your spirit be upon me.” He said, “You have asked a hard thing. Nevertheless, if you see me when I am taken from you, it shall be so for you; but if not, it shall not be so.”\nDo you see Christ when he was taken in the shroud?\n\n","date":"July 1, 2015 at 7:32 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204290","author":"AONU","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"I might add that after Elijah was taken up Elisha tore apart his own clothes, then he took up Elijah’s mantle (2Ki2.12-4). But after crossing the Jordan with the mantle on himself presumably since he tore his own clothes, the sons of the prophets at Jericho saw him and said that the spirit of Elijah rests on Elisha (v15). Is this a reference to the mantle? If so, why are they associating the spirit of Elijah with his mantle? Could this be another prophetic preview in light of the burial shroud of Christ? Is the image on the shroud an image of Christ’s spirit at the time of his translation? \nMaybe the reason Elisha rent his clothes after Elijah’s translation was because he thought he missed seeing Elisha taken away thus failing to fulfill the terms needed to gain a double portion of Elijah’s spirit, or so he thought (vv9-10), after all the text says a chariot of fire came between them and took Elijah away (v11). But when the sons of the prophets saw Elisha wearing Elijah’s mantle they understood he had the spirit of Elijah on him seeming to indicate it bore some mark or image of Elijah’s spirit when he was translated, thus fulfilling the terms, just as the shroud of Christ bears the image of his spirit at the time of his translation.\n\n","date":"July 2, 2015 at 6:21 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204394","author":"AONU","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"AONU: Interesting comments.  When I need to refer to a biblical text when on line, I sometimes find the US Conference of Catholic Bishops (USCCB) version convenient.  You can find the particular chapter at: http://www.usccb.org/bible/2kings/2  \nI suggest that your seeing a prophetic symbol of the Shroud is no more than an insight personal to yourself.  I would see the mantle as a kind of symbol of Elijah’s prophetic office which now passes to Elisha.  The metaphor of the mantle falling to a successor is common enough even in modern secular language.  A Jerusalem Bible (JB) annotation mentions that the “sons of the prophets” were groups who lived in community, and although Elijah himself was a lone prophet, Elisha seems to have been closely associated with them.  \nJB also comments on Elisha’s request for a double-portion of Elijah’s spirit, as befitting an elder son who inherited a double portion of his father’s goods, even though the prophetic spirit is not inherited but is a gift from God.  JB comments that God indicates that the request is granted by allowing Elisha to see what is hidden from human eyes, while the “sons of the prophets” see only the human circumstances, not the spiritual reality behind them.  The “sons of the prophets” recognise that the spirit has now passed to Elisha, by reason of the mantle, or perhaps by seeing Elisha using it to part the waters.  \nThere are some other interesting annotations at the foot of the USCCB page, which you may like to check out from the link I’ve given above.\n\n","date":"July 3, 2015 at 5:32 am","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204422","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"Dave, the difference between my interpretation (which I have not seen put forth before vis a vis the image) and others is that mine helps answer some of the other curious elements of the narrative (why Elisha was so upset when Elijah left after he had already accepted the fact; how the double portion was fulfilled ie, 1. Elijah’s spiritual power over the elements such as parting water and 2. Elijah’s spiritual image) which are otherwise left, well, a curiosity and only guessed at (ie, Passing of the mantle = passing of the office, yet there is no biblical precedence for this and prophets had been carrying on long long before Elijah and Elisha and long after. On the other hand what I’m suggesting sets a precedence which is followed up by Christ and the shroud and this is one thing God seems to always do particularly with important events, that is he sets up foreshadows and patterns fulfilled later to a higher degree so that we will know the certainty of a matter). \nOn its face we have important and rare elements that clearly sync up: Christ’s translation (if you will) and Elijah’s translation as well as leaving behind coverings from their persons at the event and both taken up in some type of powerful meteorological event described as a whirlwind or vortex (the chariot(s) apparently didn’t take Elijah up closer examination of the text (v11) but only really served to separate Elijah and Elisha), Acts 1.9 refers to a cloud and even gives us an important detail that the departure happened out of their sight, which helps us understand that Elijah too must’ve been taken out of the sight of Elisha and so didn’t fulfill the terms for the double portion as most would think without a deeper understanding of the text in view of the shroud Christ left behind. The image on the shroud isn’t made obvious in the text, particularly John’s Gospel, but leaves enough of a hint that isn’t (can’t be?) fully realized until the shroud image is seen just as the proposed image on Elijah’s mantle isn’t made obvious in the text until the shroud image is made known.\nNow the other elements less obvious in the picture I simply connect the dots to sync it up more clearly, thus providing us some deeper insights when the OT and NT texts are played off against each other. That’s what good interpretations are supposed to do, almost like a science. A parallel example would be Isaiah’s suffering servant which most Christians clearly see as a preview of Jesus because important elements sync up with the narrative in the NT about the Passion of Jesus and his sufferings, once that is established we can learn more about Jesus’ sufferings from Isaiah which are not mentioned in the NT. A similar phenomenon occurs between the narratives surrounding Elijah’s mantle and Christ’s shroud.\nJoseph was also a typology of Jesus, and he too left behind a special garment bearing bloody marks which was used as evidence of his death though he did live and was enthroned next to the king (Pharaoh) after his brethren rejected him and he ruled over the Gentiles but eventually revealed himself to his brethren and opened their eyes and saved them. This is a prophetic preview of Jesus and still his brethren reject him today.\n\n","date":"July 4, 2015 at 9:24 am","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204506","author":"AONU","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"AONU said, ” The image on the shroud isn’t made obvious in the text, particularly John’s Gospel”.  \nTrue enough, but there are parts of the background to the New Testament and its authors, that were left behind by other sources such as the early Church Fathers.  Spain’s Mozarabic Rite Easter Week Liturgy is documented back to the late 500s AD – “Peter ran with John to the tomb and saw the recent marks of the dead and risen Man on the linen.”  — St. Isidore, the Bishop of Seville, Spain, is considered the author; he visited Constantinople in 582.\n\n","date":"July 4, 2015 at 9:35 am","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204511","author":"Nabber","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"Nabber, I understand what you mean, but the authors of the bible saw fit to conceal things only to be revealed when those with eyes to see could see. In that way the bible is progressive and not static. At time the biblical authors wrote things they themselves did not understand and still passed them on faithfully for future generations. There are still many things the bible states that are not sourced outside the bible (yet), but that shouldn’t invalidate them. I’m only using the biblical text to interpret the biblical text, that’s not to discount extra-biblical text which I often consult, but I’ve tested the text so many times in so many different ways and have come away so impressed that now it has become my baseline and used rather to test extra-biblical texts not the other way round. That was not an easy position to come to for me and it was not earned lightly and I realize that puts me in the extreme minority now and to be scoffed at in today’s world. What can I say, you either choose the world or you choose Christ.\n\n","date":"July 4, 2015 at 12:05 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204516","author":"AONU","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"Jesus said, “A house divided against itself cannot stand.”\n\n","date":"July 1, 2015 at 7:44 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204294","author":"Louis","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"Lest I be misunderstood:\nI will always accept Anglican woman priests and bishops as fellow Christians, but not more. Above all, we Christians are all united in Christ.\nWhen I was in college a group to which I belonged, the Catholic Students Union, went to do some social work in a village and we were accompanied by a chaplain. I asked a close friend, a Protestant, to join us and he did so without hesitation, with no objection from the Catholic chaplain. He participated in the daily mass, but never received communion, and he told me why. I understood his feelings as a Protestant. It did not pose a problem to me. He accepted the Catholic group as fellow Christians.\n\n","date":"July 1, 2015 at 7:57 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204297","author":"Louis","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"I think you may have misunderstood what was going on with your Protestant friend.  His refusal to receive Catholic communion, out of acting on his own will, was invalid.  \nThe RC priest is forbidden to give communion to Protestants.\n\n","date":"July 3, 2015 at 10:57 am","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204452","author":"Nabber","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"He did know that RCs accept transubstantiation and his Protestant denomination did not. Sometimes it seems that God does not mind what RC priests forbid because he knows people’s minds and hearts better than the priests do:\nhttp://www.telegraph.co.uk/news/worldnews/europe/italy/1487608/Pope-miraculously-cured-Jewish-millionaire.html\n\n","date":"July 3, 2015 at 11:19 am","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204457","author":"Louis","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"You seem to be under the impression that RC priests forbid things because they are enforcing some vague doctrine.  That couldn’t be further from the truth.  They are enforcing the Magisterium that makes up what the Church is and what it stands for.  Individuals by themselves cannot receive the Inspired word, regardless.  If you are not willing to enforce it in your own life, then “you may be a cafeteria Catholic.”\n\n","date":"July 4, 2015 at 9:27 am","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204508","author":"Nabber","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"I stand by what I said and have seen “cafeteria Anglicans”, “cafeteria Protestants”, “cafeteria Muslims”, “cafeteria Hindus”, “cafeteria Zoroastrians”. In today’s news I see a big “cafeteria Buddhist”, which leads me to think that Rupert Murdoch was correct:\n  http://news.yahoo.com/dalai-lama-celebrates-80th-birthday-california-summit-154400188.html\n\n","date":"July 4, 2015 at 10:45 am","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204513","author":"Louis","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"Nabber’s link to the 10 facts Catholics should know because they define what it means to be Catholic took me right back to my pre-Vatican II days.  It’s no wonder that Church membership has declined so severely in the Western world and why so many young people are staying away.  These authoritarian claims with their not-so-veiled threats of eternal damnation if one dares to question or deviate are far from inspiring.  They induce little but fear and trepidation and suffocate the joy and inspiration that we should be finding in the teachings of Jesus and the revelation of God as our eternal Father who loves us beyond measure.  Nabber’s request to be spared the “peace and love” between so-called cafeteria Catholics  and the rest says it all.  If God and Jesus are not all about love and peace, then we’re all pretty much doomed.  And, frankly, heaven is not all that appealing if it means being surrounded by people proclaiming their rules and comparing their sufferings and “tsk tsking” over the vast numbers of people who failed to fall into line during their lives on earth and now are roasting in the flames of hell as their just punishment.  \nFortunately, we have the testimony of countless near death experiencers who give us a far different picture of the afterlife with God.  It’s clear from their testimony that when Jesus spoke of the two great commandments of loving God and our neighbor (fellow humans) he meant that to define the proper way to live.  When he speaks in Matthew 25 about the Last Judgment’s review of how we treated the least of his people as the standard for life with God, or gives us the example of the Good Samaritan, a person whom the Jews (God’s chosen people by His own word) regarded as an offense to God because of the Samaritans’ failure to practice their religion as the Jews did, or tells us the parable of the Prodigal Son and his joyful reception by his father after years of dissolute living, we get a true picture of what God values.  Nothing in the life of Jesus as we find it in the New Testament suggests that the love of God and the invitation to be with Him in heaven is limited to Catholics, especially when to be a so-called “good Catholic” has little to do with the heart and everything to do with intellectual assent and compliance.  \nNabber also asserts that “Individuals by themselves cannot receive the Inspired word.”  It is true that public revelation ended with the death of the last apostle (John) and that private revelation since then is never binding.  But this in no way means that God does not communicate directly in extraordinary ways with many souls on earth.  And God has sent Mary back to earth on many occasions to give us guidance and assistance.  Each of us has a direct spiritual line to heaven through prayer and divine inspiration is often the result of that.  It’s not binding on anyone else but it is reliable guidance for the person receiving it.  \nYou will find God in and through your heart.  By your works and attitude thereafter you will know if you got the message.  It’s all about peace, love, and the invitation of God to all peoples to share His life in heaven.  It may be that the staunch and intolerant Catholics will have their own special Heaven–St. Paul himself referred to the “third heaven”–but those who seek God with a good heart will find Him both here and in the afterlife and eternal joy in His presence.  No claims of infallibility by very fallible human beings, no matter how united, will make the Catholic Church the equivalent of Jesus and his Father themselves.  A little humility in this sphere would go a long ways.  \nPope Francis has inspired millions of people worldwide, both Catholic and non-Catholic, precisely because he seems to be all about universal love and much less about being Catholic with all the answers and a demand to adhere to his pronouncements whether they seem loving or not.  The Church hierarchy would do well to follow his guidance and offer Catholicism as a sacramental refuge in this harsh world, a place where we can find Christ directly in the Eucharist and grow his love by helping and caring for one another in every way that we can.\nBishop Curry spoke very eloquently and movingly of the Eucharist.  Catholic priests and bishops would do well to emulate his example.  We might start getting some more people interested in becoming Catholic. \nNow, Dan, we are indeed way, way off topic.  I have said my piece and plan to say no more.\n\n","date":"July 4, 2015 at 3:04 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204525","author":"Jim Carney","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"Okay, just one more comment.  I do have to thank Nabber and Louis for provoking this discussion.  It has made me realize a couple of things about myself.  From now on, I will call myself a member of the Catholic Church and a devout Christian.\n\n","date":"July 4, 2015 at 4:19 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204530","author":"Jim Carney","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"Thanks, Jim. We can also learn from your experience and comments.\nBy the way, the comment on the “cafetaria Buddhist” above was not meant to direct a personal attack at a religious leader. I simply cannot see how celebrating birthdays and a negative soteriology can mix.\n\n","date":"July 4, 2015 at 5:26 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-204538","author":"Louis","site":"shroudstory"},{"title":"Off Topic Warning:  About the Eucharist and Then Some","post":"Reblogged this on Best of Shroud Story.\n\n","date":"July 11, 2015 at 6:25 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","id":"comment-205314","author":"Dan","site":"shroudstory"}]
