[{"title":"On Wild Ducks","post":"Thank you Mr. Porter. But it wasn’t just a scatter gun, was it? It was a hunting rifle, fitted with telescopic sights, and you were aiming straight at my heart, namely my claim to operate primarily as a scientist. \nApart from keeping me up till 3am, researching that crazy comparison with the late Bertrand Russell, also the victim of gross misrepresentation, I now find myself composing a post detailing the science that I have posted here, in real time, these last few weeks  with copies to my own site almost an afterthought.There are at least 11 topics in that list already, many making predictions on what might or would be found were the Shroud to be re-opened to scientific, photographic and microscopic investigation.\nI’m tempted to say I’ll take another long break right now from shroudstory, but in a spirit of reconcilation will describe it instead as giving the site a long break from me.\nHugh (and other friends): please keep an eye on my own site. I really do think my smartass “LOTTO” method is the way to go, judging by microscopic appearance, and the sheer difficulty of over-scorching, even when trying deliberately to do so.\n\n","date":"November 23, 2013 at 6:57 am","url":"https://shroudstory.com/2013/11/23/on-wild-ducks/","cat":"news_&_views","id":"comment-52497","author":"colinsberry","site":"shroudstory"},{"title":"On Wild Ducks","post":"Colin, I don’t know what else to say. I think you are taking this thing far too personally and far too seriously. Are you particularly upset with how Benjamin Wallace-Wells misrepresented Russell or how he misrepresented science: “This strange hybrid method, through which a literary genre convinces itself it is a science.”\nYou wrote: “you were aiming straight at my heart, namely my claim to operate primarily as a scientist.”\nNo I wasn’t.\n\n","date":"November 23, 2013 at 7:56 am","url":"https://shroudstory.com/2013/11/23/on-wild-ducks/","cat":"news_&_views","id":"comment-52501","author":"Dan","site":"shroudstory"},{"title":"On Wild Ducks","post":"Thanks, Dan Porter, I’ve said all I want to say. \nI leave folk here to draw their own conclusions. To the suggestion I am overreacting, folk could do a lot worse than pull out the many postings on this site going back to January 2012 that have my name in their title, and discern the recurring message.  It’s generally the same: “Who are you, little man, to question the greats of US science?”. John Klotz put it more succinctly: “You are a poodle barking at a Great Dane”. Pity the particular comparison did not stand up to Google Scholar verification, and neither did many of the others vis-a-vis STURP when put to the same test (“anonymous” please note). All of them, myself included can make no claim to have been more than middle-ranking scientists, little known outside their respective specialties, and having made no huge impact on science prior to working on the Shroud.\nI shall now retire to my scorched linen and microscope, than hang around here to be insulted on a daily basis. (If it weren’t for the good guys like David Goulet, Matthias etc I’d have taken off long  before now). \nYour posting was the last straw, Dan Porter. If you don’t see that, then one has to question your fitness to front an internet forum. You have no business wielding a shotgun, far less a sniper’s rifle.\n\n","date":"November 23, 2013 at 8:40 am","url":"https://shroudstory.com/2013/11/23/on-wild-ducks/","cat":"news_&_views","id":"comment-52504","author":"colinsberry","site":"shroudstory"},{"title":"On Wild Ducks","post":"I love being a wild duck! Fire away, all ye that still dwell in cages! Adler was a wild duck (one of the wildest); so was Rogers, so, are Joe and Mark and Giulio and Colin. All with ideas and speculations, probably mostly completely bonkers, but stimulating and exciting, and the seed bed of further speculation. The biophoton theory, the scorch theory, the Ma(i)llard theory (there’s a wild duck for you), the nuclear radiation theory, the photographic theory, the wrapped, draped, horizontal, hung vertical and stiff as a board (Pray codex) theory. This is what science is all about, an explosion of possibilities, and no-one knows which one will eventually gain the upper hand, and truly become established fact. (or FACT!!! as some people think it’s spelt)\nWhat do the rest of you do? Read one book, watch one documentary and think: well that’s it then, another problem put to rest.\nHow dull.\n\n","date":"November 23, 2013 at 10:24 am","url":"https://shroudstory.com/2013/11/23/on-wild-ducks/","cat":"news_&_views","id":"comment-52511","author":"Hugh Farey","site":"shroudstory"},{"title":"On Wild Ducks","post":"Dan’s posting was humorous. There was absolutely nothing insulting about it. You’ve got to admit, Colin, that your scenarios sound crazy. Dan didn’t even say so. He used your words.  Can you laugh at yourself?Dan has poked fun at others along the way. That was all he was doing. Colin, go down to the pub, cool down with a pint, and come back tomorrow.\n\n","date":"November 23, 2013 at 10:38 am","url":"https://shroudstory.com/2013/11/23/on-wild-ducks/","cat":"news_&_views","id":"comment-52513","author":"Paulette","site":"shroudstory"},{"title":"On Wild Ducks","post":"And I say there’s a Goebbels-like quality, both as regards the depiction of Bertrand Russell by that pretentious buffoon of a journalist, and my own through being linked to that grotesque misrepresentation, one that sees science as a phoney affectation, whether the individual made/makes no claims to being a scientist (Russell) or whether he does (me).  Sorry, but I recognize both positive, and in this instance, negative opinion-shaping,  Madison Avenue style, when I see it. No thanks. \nI also happen to believe my views on those sedillis are every bit as valid as those of Mario Latendresse, indeed more so, since mine are consistent with the radiocarbon dating, and I intensely disliked his triumphalist tone. You may think my scenarios are “crazy” as you put it. What will you say if they are one day proved correct? \nNope, I don’t suppose you’ll lose a second’s sleep over heaping ridicule on someone for having views different from your own. Yours are the correct, conventional views, right, and anyone who thinks otherwise is a bit of a nutter right? So don’t let anything I say alter your comfy world view, full of cosy certainties. Just don’t forget there are Goebbels out there, shaping and influencing your views. Like those who, in spite of all the evidence, go in front of TV cameras stating that red blood and bilirubin are the clincher where Shroud authenticity is concerned, while placing appeals for voluntary donations on this site for the Shroud of Turin Education and Research Association ($TERA.Inc), cleaning up on a raft of licences acquired through STURP, treating the data and images as though they were their personal property.\nGod bless America.\n\n","date":"November 23, 2013 at 1:42 pm","url":"https://shroudstory.com/2013/11/23/on-wild-ducks/","cat":"news_&_views","id":"comment-52523","author":"colinsberry","site":"shroudstory"},{"title":"On Wild Ducks","post":"I agree with Paulette. In Dan’s posting I only see humor and absolutely no insult but exactly the contrary: “You are constructively skeptical. Your smart and you’re a smart ass. All of this is appreciated. It isn’t (or at least should not be) about being pro-authenticity or anti-authenticity but about being pro-truth. That takes a lot of high-flying, wild duckism. Yours is a valuable role.”\nColin, your new  LOTTO method (Linen-On-Top-Then-Overlaid) scorch method seems to be much more valuable than the old basic scorching method I criticized in my pdf (which was probably not so wrong..).\nYes I will test it with a template similar to yours.\nI’ll try to look at the results at every scale (fabric, thread and fibers).\nI need some weeks.\nTo be honest, I am still skeptic about the possibility for the TS image to be a scorch of any kind for several reasons.\nBut, because I am not agenda-driven and since the new LOTTO method has never been studied (to my knowledge), it is a duty for me (and for everybody who has a microscope) to test it.\nColin, Hugh, we need you ;-))\n\n","date":"November 23, 2013 at 4:34 pm","url":"https://shroudstory.com/2013/11/23/on-wild-ducks/","cat":"news_&_views","id":"comment-52547","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"On Wild Ducks","post":"Thanks Thibault. It may surprise you to know that I too am still sceptical about the TS image being a scorch –  but not enough to embrace any kind of radiation model (so what does that leave – discounting Maillard?) .  \nBut no, the site does not need me. It only needs to have heard of me and my “crazy” unscientific ideas – ones that elicit hoots of derision here, or stuck-in-groove restatement of  biblically-correct mantras, or slyly crafted put downs from the site’s host that attempt to portray me as all ideas, all verbiage, no real science..\n Please do check out the facts on LOTTO, Thibault,  as soon as you can. I think you will impressed. I was. Try deliberately over-scorching. Just make sure the overlay is properly damp (but wring out as much surplus water as you can to avoid excessive cooling).\nThanks for adopting my acronym. It makes communication so much easier.\n\n","date":"November 23, 2013 at 4:51 pm","url":"https://shroudstory.com/2013/11/23/on-wild-ducks/","cat":"news_&_views","id":"comment-52548","author":"colinsberry","site":"shroudstory"},{"title":"On Wild Ducks","post":"BTW: Dan, I sent a small article for posting here on the blog.\n\n","date":"November 23, 2013 at 2:41 pm","url":"https://shroudstory.com/2013/11/23/on-wild-ducks/","cat":"news_&_views","id":"comment-52527","author":"O.K.","site":"shroudstory"},{"title":"On Wild Ducks","post":"The comment that Colin thought I had discarded has been recovered. It was flagged by an automatic spam filter (Akismet). I don’t know why. It is comment number 6 above. Note to everyone: If a comment doesn’t post, send me an email.\n\n","date":"November 23, 2013 at 5:37 pm","url":"https://shroudstory.com/2013/11/23/on-wild-ducks/","cat":"news_&_views","id":"comment-52558","author":"Dan","site":"shroudstory"},{"title":"On Wild Ducks","post":"OK. But I’m not removing my post, Dan Porter, since some kind of Big Brother (or Sister)  censorship system would seem to be operating in the background, without either the commentator or you knowing about it.\n I have simply cut-and-pasted your latest comment saying that the immediate problem has been solved. But it still leaves unanswered the question as to why comments threads are being interfered with in this fashion. And they call me a smartass…\n\n","date":"November 23, 2013 at 6:12 pm","url":"https://shroudstory.com/2013/11/23/on-wild-ducks/","cat":"news_&_views","id":"comment-52562","author":"colinsberry","site":"shroudstory"}]
