[{"title":"One that comes to mind is a favorite photographer around here","post":"Allen’s theory that the Shroud is a medieval “photograph” is fascinating and clever — but in the end, it seems to answer only half of the questions raised by the Shroud and ultimately strikes me as fairly pointless even as an exercise in the history of photography. I’m not a Shroud expert of any kind at all, just an interested reader. But as a photographer, Schwortz’s paper (2000) critique of Allen’s theory strikes me as sound.\nIt doesn’t bother me too much that there’s no historical corroboration for Allen’s theory. It’s possible if not probable that there have been unknown geniuses throughout history who came up with something brilliant but who for whatever reason weren’t interested in publishing their ideas or weren’t able to do so. It doesn’t strike me as impossible that somebody in the middle ages came up with a photo-sensitive solution, a way to apply it to a cloth and a way to expose and then fix it — but never mentioned it to anybody else. Odd and perhaps unlikely, but not impossible.\nNo, for me the problems with Allen’s theory are four.\nFirst, it seems to me inconceivable that a lone genius could not only have invented photography all by himself half a millennium before Niepce and a bunch of others thought of roughly the same idea in the 1830s, but that this same genius could have come up with the heretical idea of using this astonishing technology for a single purpose, namely, to fake the burial shroud of Christ. And that’s what Allen wants us to believe. \nSecond,  there’s the fact that both Allen’s image and the image on the Shroud are remarkably clear and precise. Compare them to Niepce’s famous first photo from around 1825 (the “View from the Window”). Even when you are told what you’re looking at in Niepce’s photo, it’s hard to understand the image. As a matter of history, once the ball got rolling in the 1820s, photographic technology advanced pretty quickly, so that by the time of the American Civil War forty years later photographers were able to take impressively clear and detailed images. But it didn’t happen overnight in one photographer’s workshop. It’s not absolutely inconceivable that a lone genius experimented for, oh, a decade or two and was extremely lucky, so that he discovered and solved all the problems that his invention had at first. Not absolutely inconceivable, but almost.\nThird, on a more mundane practical level, there’s the extreme difficulty of registration or alignment of the medium (the linen cloth) for multiple exposures. I do find it inconceivable that the blood stains were placed on the cloth first and then the exposure made in exactly the right place. (Toss in the separate exposure for the head and it’s more difficult still.) Even today with all the tools at our disposal it’s hard to do a precisely aligned double exposure in a single frame of film.\nFourth, there’s the difference in the way the Shroud’s image is “projected” on the Shroud and the Allen image is projected. If I follow Schwortz’s argument and the current explanations of other leading sindonologists, the Shroud is a sort of contour map likely to be generated only by direct contact with a three-dimensional body, that is, the image on the Shroud was generated when the Shroud was not lying flat but was draped over a body. That’s certainly not what we get in a photo or in Allen’s image. Allen’s image—while a clever hypothetical demonstration—looks like a photographic negative made on a sheet hanging more or less flat and NOT like a contact-print. Schwortz rightly emphasizes this issue.\nMy un-expert two cents….\n\n","date":"April 6, 2015 at 11:49 am","url":"https://shroudstory.com/2015/04/06/one-that-comes-to-mind-is-a-favorite-photographer-around-here/","cat":"uncategorized","id":"comment-195503","author":"William Porter","site":"shroudstory"},{"title":"One that comes to mind is a favorite photographer around here","post":"Very cogent and well written Professor Porter.\n\n","date":"April 6, 2015 at 12:21 pm","url":"https://shroudstory.com/2015/04/06/one-that-comes-to-mind-is-a-favorite-photographer-around-here/","cat":"uncategorized","id":"comment-195505","author":"Stan Walker, MD","site":"shroudstory"},{"title":"One that comes to mind is a favorite photographer around here","post":"p.s. About the title “professor.” It tickles me to be so addressed, but I don’t deserve that honorfic. In the late 1990s I didn’t just retire, I gave up tenure and left the university. And while I still have my doctorate in classical studies, none of my scholarly work was even close to giving me expertise that’s pertinent to Sindonology. So I wouldn’t want anybody to confuse me with one of the properly qualified experts in this field! I’m speaking simply as an interested and curious “civilian”. Well, I dared to speak up here because I am a (moderately) experienced photographer. But I’m not even an expert in photographic science and certainly no expert in its application to the Shroud. I repeat: I’m just an ordinary person on the sidelines hoping the Shroud is what it seems to be and trying for myself to assess the arguments con and pro. The good arguments look to me like they’re mostly on the pro side, but I try to keep an open mind. More perhaps than some on the con side of the issue are capable of doing. :-)\nWill\n\n","date":"April 7, 2015 at 1:58 pm","url":"https://shroudstory.com/2015/04/06/one-that-comes-to-mind-is-a-favorite-photographer-around-here/","cat":"uncategorized","id":"comment-195636","author":"William Porter","site":"shroudstory"},{"title":"One that comes to mind is a favorite photographer around here","post":"The photo hypothesis deserves credit for stirring up interest in the unique image properties.  But besides the problems Prof Porter mentions, there is also the fact that the shroud image is not made up of various shades as a monochrome photo. It is shaded like a pencil or charcoal drawing, made entirely of a uniform dark color dispersed on a light background. And yet it has detail similar to a photo, which would take an amazing artist to pull off.\n  A second problem is the lack of light directionality in the shroud image. This is easy to see by comparing it to the well-known “photo shroud” made by Prof. Allen.  The photo image shows overexposure on the feet and shadows cast by other physical body parts.\n\n","date":"April 6, 2015 at 10:07 pm","url":"https://shroudstory.com/2015/04/06/one-that-comes-to-mind-is-a-favorite-photographer-around-here/","cat":"uncategorized","id":"comment-195542","author":"Matt Kowalski","site":"shroudstory"},{"title":"One that comes to mind is a favorite photographer around here","post":"Matt, you raise two interesting issues that I hope you won’t mind me responding to.\nA photo doesn’t have to have lots of different “shades” — not even a black and white photo. If the exposure range of a scene is very limited and if the sensitivity of the capture medium is very low (certainly the case with Allen’s linen sheet), the exposure range of the resulting image could be quite small. And in any case, I don’t think it’s quite true that the Shroud lacks shades. Schwortz mentions the variations in the “density (or darkness) of the image” on the Shroud, when he’s talking about the work of the STURP team.\nForgive me if I’ve misunderstood you.\n•\nAs for the lights and shadows in Allen’s image being tell-tale signs of of directional lighting not evident in the Shroud: Is this really a strong proof that the Allen theory is wrong? I doubt it. Many photos fail to exhibit very directional lighting, either on purpose (say, in fashion photography) or by accident or inadvertence (say, when you take a photo outside on a very cloudy afternoon). Schwortz mentions that Allen is aware of this. It’s why Allen suggests that the Shroud “exposure” would have been made when the sun is low, allowing for flatter frontal lighting. Now, Schwortz proceeds to explain what’s wrong with THAT idea, but even so, if Allen had managed the light better, I’d bet he could have produced a BETTER, flatter, less directionally lighted image that looked even more like the authentic Shroud. \nMy wild guess is that Allen’s experimental exposure — which, remember, took days, and must have been hard to calculate — simply overexposed the feet. That overexposure of the feet could perhaps have been remedied by, say, preventing light from reaching the foot area of the linen for a day or so. And the entire Allen image could more closely mimic the real Shroud’s “non-directional” lighting if our imaginary medieval super-genius had figured out how to make an exposure with soft lighting. I have no idea how hard this would be to do with a camera obscura the size of a bedroom, relying on uncertain lighting from outdoors, and especially if you have to take days to get an image. But this medieval photographer must have been Ansel Adams, Leonardo, Newton and Dan Brown all rolled in one (well, aside from utterly lacking Dan Brown’s genius for self-promotion). So he was a good bit smarter than I am and could probably have solved this problem.\n•\nMy point is, I don’t think the problems with Allen’s hypothesis lie so much in the quality of his results. He’s produced an image that, at first glance, resembles the Shroud image. If I were teaching a course in the history of photographic technology and Allen submitted this as his final paper, I’d absolutely give him an A+. And I bet, if Allen were to keep trying, he could produce another image and then another that even more closely resemble the Shroud. \nI don’t encourage him to waste his time, though. \nBecause, as a historical theory, it simply won’t do. We could sit around all day and, with our superior knowledge of what has happened since antiquity — what in fact is possible and how to do it — we could cook up theories about what the ancients MIGHT have done and then turn those theories into secret accomplishments. Topic: Heron of Alexandria around the time of Christ invented a steam engine. Discuss amongst yourselves. Except don’t! This is a parlor game, not a historical argument.\nAnd even if rational people were willing to play that game, Schwortz reminds us that the more important fact is that Allen’s theory is fatally incomplete as an explanation of the Shroud.\n\n","date":"April 7, 2015 at 1:55 pm","url":"https://shroudstory.com/2015/04/06/one-that-comes-to-mind-is-a-favorite-photographer-around-here/","cat":"uncategorized","id":"comment-195635","author":"William Porter","site":"shroudstory"},{"title":"One that comes to mind is a favorite photographer around here","post":"The first reply here is most excellent and really describes some of the many issues with this theory which, in my thinking, is like trying to grasp straws.\n\n","date":"April 7, 2015 at 7:10 am","url":"https://shroudstory.com/2015/04/06/one-that-comes-to-mind-is-a-favorite-photographer-around-here/","cat":"uncategorized","id":"comment-195596","author":"Andy","site":"shroudstory"},{"title":"One that comes to mind is a favorite photographer around here","post":"Not only did Allen’s photographer invent the art of photography all by himself, but he was able to anticipate some 500 years or so of hitherto unknown forensic knowledge.  He only ever did it once, left no record of his remarkable achievements, his workshop has never been discovered, and all traces of his trial attempts and failures have also vanished, as have any bas-reliefs or other models for his work.  \nWilliam also happens to mention Heron of Alexandria, a remarkable engineer, credited with inventing a toy steam engine.  Among his several achievements he is also known to have invented a vessel creating the illusion of converting water into wine, a feat which Luke’s gospel recounts as replicated more authentically by a contemporary of Heron’s at Cana in Galilee. \nWe know quite a bit about Heron of 2000 years ago.  We know nothing of Allen’s medieval illusory photographer.\n\n","date":"April 7, 2015 at 3:08 pm","url":"https://shroudstory.com/2015/04/06/one-that-comes-to-mind-is-a-favorite-photographer-around-here/","cat":"uncategorized","id":"comment-195641","author":"daveb of wellington nz","site":"shroudstory"},{"title":"One that comes to mind is a favorite photographer around here","post":"Yes you have misunderstood me, but only to the degree that I don’t have the technical language to describe precisely.  The difference in the shroud’s shading and Allen’s photo is easier to understand by comparing the images, both macro and microscopic.  I would refer readers to the analysis of experts rather than try to explain it here.\n  I completely agree with your historical critique of the photo hypothesis. But there are important distinctions to be made about the images also.\n\n","date":"April 9, 2015 at 8:19 pm","url":"https://shroudstory.com/2015/04/06/one-that-comes-to-mind-is-a-favorite-photographer-around-here/","cat":"uncategorized","id":"comment-195890","author":"Matt Kowalski","site":"shroudstory"},{"title":"One that comes to mind is a favorite photographer around here","post":"Some of what I wanted to day is best explained by Barrie Shwartz over at the shroud.com site.  http://www.shroud.com/pdfs/orvieto.pdf\n\n","date":"April 9, 2015 at 8:33 pm","url":"https://shroudstory.com/2015/04/06/one-that-comes-to-mind-is-a-favorite-photographer-around-here/","cat":"uncategorized","id":"comment-195891","author":"Matt Kowalski","site":"shroudstory"}]
