[{"title":"Christmas Card","post":"The biblical reference to crucifixion must also be considered. Sunset beginning a Passover sabbath (John’s reference) or simply a sabbath (Mark et al) necessitated speeding up the deaths. Remember, crucifixion served more than as a means to execute a criminal. It was a form of torture and public humiliation. And it served as a graphic warning to others. As such, the longer it went on, the better.\nTo hasten death that day, the soldiers “broke the legs” of the other two, but not of Jesus who was already dead. Roman law dictated that the heart be pierced to ensure the person was really dead and not just comatose.\nSo if the soldiers were going around jabbing convicts in the heart, why not stab the other two as well? Because, IMO, broken legs would hasten death but not immediately cause it. Unable to lift themselves up by their feet to counter their body weight, asphyxiation would indeed result in one final display of cruelty.\n\n","date":"December 21, 2013 at 10:09 am","url":"https://shroudstory.com/2013/12/20/christmas-card/","cat":"news_&_views","id":"comment-64185","author":"Joe Veneroso","site":"shroudstory"},{"title":"Christmas Card","post":"thank you! merry christmas & happy new year.\n\n","date":"December 21, 2013 at 1:57 pm","url":"https://shroudstory.com/2013/12/20/christmas-card/","cat":"news_&_views","id":"comment-64361","author":"mike","site":"shroudstory"},{"title":"Christmas Card","post":"Joe V: “So if the soldiers were going around jabbing convicts in the heart, why not stab the other two as well? Because, IMO, broken legs would hasten death but not immediately cause it. Unable to lift themselves up by their feet to counter their body weight, asphyxiation would indeed result in one final display of cruelty.” \nSee separate thread Stephen Jones’ on Zugibe vs Barbet. Barbet’s theory was that that the crucifarius had to exercise a see-saw motion transferring weight between arms and legs to maintain breathing; this could not be sustained indefinitely and the usual cause of death was therefore asphyxiation. Zugibe claimed that the weight could be taken on the legs and that breathing was therefore not a problem, cause of death being shock. By breaking the legs, death would be by asphyxiation regardless. \nGospel accounts claim that the soldiers broke the legs of the other two because of the forthcoming sabbath. J P Meier claims that John’s gospel is the more accurate, the Friday being Preparation day for Passover, the year probably being 30 AD. Exposing crucified bodies when Passover occurred on the sabbath was particularly objectionable. When they came to Jesus, he was already dead so they followed the legal requirement of percussio, piercing the heart, enabling the body to be released to the family. From reading Barbet, I get the impression that it was not unusual for the bodies to be exposed for perhaps several weeks, suggesting that the sabbath was not usually a  consideration, unless some Roman concession recognising local Jewish sensibilities perhaps made it an exception.\n\n","date":"December 21, 2013 at 4:21 pm","url":"https://shroudstory.com/2013/12/20/christmas-card/","cat":"news_&_views","id":"comment-64467","author":"daveb of wellington nz","site":"shroudstory"}]
