[{"title":"Opinion: Reliability of Shroud of Turin fails on faith, not science","post":"I agree with YOU that it’s a hodge podge of good and bad information. And I don’t know what the point of the article is. In fact, I’m really puzzled. What is he trying to SAY? \nOne point to make: the Old Testament says that the body of Jesus did not suffer decay. “Rotting corpse” is not right, according to scripture. \n“And after that’s gone, what’s left?” …..  The Risen Lord!! Christ risen from the dead is glory enough for anyone anytime anywhere. If he can’t see THAT, then his faith is barely blipping on the faith-o-meter, I’d say.\n\n","date":"January 3, 2012 at 5:33 pm","url":"https://shroudstory.com/2012/01/03/opinion-reliability-of-shroud-of-turin-fails-on-faith-not-science/","cat":"news_&_views","id":"comment-6513","author":"AnnieCee","site":"shroudstory"},{"title":"Opinion: Reliability of Shroud of Turin fails on faith, not science","post":"I agree with this particular comment and I can ensure you that it fits closely the theological doctine of the Catholic church.\n\n","date":"January 3, 2012 at 6:40 pm","url":"https://shroudstory.com/2012/01/03/opinion-reliability-of-shroud-of-turin-fails-on-faith-not-science/","cat":"news_&_views","id":"comment-6517","author":"Yannick Clément","site":"shroudstory"},{"title":"Opinion: Reliability of Shroud of Turin fails on faith, not science","post":"Sorry, but Philip mathias is another example of why owners of newspapers shouldn’t give the right to any ignoramus to write articles.\nHe like most skeptics of the shroud keep bringing up the old and tired argument of the bible itself proving the shroud isn’t authentic . How many times must I keep swing sudariummmmmm of oviedoooooo.\nThe bible itself shows the authentic of the shroud because that separate head cloth is the sudarium that’s in a church in Spain. Forensic pathology experts like max frie and others proved the shroud and the sudarium both touched the same body at close intervals of time.\nThe blood stains on the shroud matched perfectly with the blood stains on the sudarium. The one difference being that the blood stains on the shroud are from when the man was dead and the blood stains from the sudarium are from a man that was very wounded but still alive, and forensic experts also found out that the shroud was wrapped probably 45 minutes after the sudarium was taken off.\nThe pollen found on the sudarium and the head image of the shroud match perfectly and come from a specific species of thorny bush only found in Jerusalem and judea area. I have been studying the shroud and sudarium intensly for over 2 years.\nAfter all of this study, how can this not be the burial shroud of Christ.\nI can go on and on about the vanillin tests, but the fact that mathias brought up Walter mccrone shows me that either mathias hasn’t dOne any credible research on the shroud or he is biased against it.\n\n","date":"January 14, 2012 at 4:27 am","url":"https://shroudstory.com/2012/01/03/opinion-reliability-of-shroud-of-turin-fails-on-faith-not-science/","cat":"news_&_views","id":"comment-6956","author":"Bob smith","site":"shroudstory"}]
