[{"title":"Personal Attacks on Others","post":"To be fair, Colin’s not the only one who needs this reminder. There’s enough high horses around here at times to start a Leipzig show.\n\n","date":"June 26, 2013 at 11:54 am","url":"https://shroudstory.com/2013/06/26/personal-attacks-on-others/","cat":"news_&_views","id":"comment-38103","author":"David Goulet","site":"shroudstory"},{"title":"Personal Attacks on Others","post":"To be fair, yes. But Dr. Berry’s attack on “Professor” Max was over the top. It was mean, just plain mean. I’m surprised Dan didn’t pull the plug sooner.\n\n","date":"June 26, 2013 at 2:17 pm","url":"https://shroudstory.com/2013/06/26/personal-attacks-on-others/","cat":"news_&_views","id":"comment-38110","author":"Paulette","site":"shroudstory"},{"title":"Personal Attacks on Others","post":"This is a good step, moderation is something I had suggested months ago on this very blog. Hope this step applies to self-appointed judges too…\n\n","date":"June 26, 2013 at 5:14 pm","url":"https://shroudstory.com/2013/06/26/personal-attacks-on-others/","cat":"news_&_views","id":"comment-38116","author":"Louis","site":"shroudstory"},{"title":"Personal Attacks on Others","post":"A welcome change, Dan.  You ought to take that approach with everyone when you notice ad hom attacks.\n\n","date":"June 26, 2013 at 8:38 pm","url":"https://shroudstory.com/2013/06/26/personal-attacks-on-others/","cat":"news_&_views","id":"comment-38132","author":"Andy Weiss","site":"shroudstory"},{"title":"Personal Attacks on Others","post":"Folk seem to be assuming that it was my attack on MPH for claiming he was once a University professor (as the term is generally understood) that warrants this post. Possibly, although it’s worth noting that MPH’s responses were being blocked while I was still free to comment, so it was not a one-way street.\nWhat folk don’t seem to appreciate is that I have been forthright these last few days towards others too, first DaveB for failing to understand the scientific method (you do not attack someone who proposes a new round of experimentation, no matter what you think about the underlying ideas) and then STURP for its fostering  of poorly-argued science (Rogers’ starch/amine, with no consideration of the PCW, and Adler’s castle-building in the sky with those anomalous blood findings).\nI have already had a comment rejected here – stating that I will not be submitting any more on account on the threatened pre-moderation/vetting.\nThis one, perhaps my last, is simply to flag up the fact that what Dan Porter refers to as “personal attacks” without being specific may be as much to do with the others mentioned above as it does to MPH.\nDan and I obviously differ in what is meant by a “personal attack”,  and is perhaps unaccustomed to robust internet debate, but I do not intend to go into that while there is any chance of my comments here failing to appear (including this one) or even being partially blue-pencilled.\nI may decide to give a fuller background on my sciencebuzz site, depending on what happens in the next day or two.\nhttp://colinb-sciencebuzz.blogspot.fr/\nTo Louis, with whom our discussion on existentialism and other matters was interrupted, the post with our exchange is no longer visible in the sidebar, either Posts or Recent Comments,  was:\nhttps://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/\n\n","date":"June 27, 2013 at 3:52 am","url":"https://shroudstory.com/2013/06/26/personal-attacks-on-others/","cat":"news_&_views","id":"comment-38158","author":"colinsberry","site":"shroudstory"},{"title":"Personal Attacks on Others","post":"I do not accept Dr Berry’s accusation that I fail to understand the scientific method. I view it as his defensive knee-jerk reaction to some disagreement we had, and I don’t intend a post mortem on the circumstances. I had reason for working closely with a variety of scientists during my engineering career. Some impressed me, others less so, for they all happened to be human. I consider myself particularly well-informed on the history of science, from ancient times to the present, so I think I understand science well enough, and the methods of scientists. My engineering superiors occasionally accused me of being too scientific, as practical considerations of the moment demand sufficing answers, not necessarily the ideal. My general views on how matters should be discussed here are stated below.\n\n","date":"June 27, 2013 at 6:10 am","url":"https://shroudstory.com/2013/06/26/personal-attacks-on-others/","cat":"news_&_views","id":"comment-38178","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Personal Attacks on Others","post":"good to see, and as David said Colin isn’t the only culprit. Let’s all act with respect and like adults rather than kindergarten children\n\n","date":"June 27, 2013 at 4:06 am","url":"https://shroudstory.com/2013/06/26/personal-attacks-on-others/","cat":"news_&_views","id":"comment-38161","author":"Matthias","site":"shroudstory"},{"title":"Personal Attacks on Others","post":"There are known facts, there are speculations, and there are interpretations. I have few problems with others disagreeing with what I may have to say, particularly if it is done in a courteous manner, and if they can demonstrate that they’re no less informed than I may happen to be. We might even have a good discussion about it. And if you can persuade me, I hope you’ll allow me the dignity of changing my mind, without seeing it as a point scoring contest. And if I happen to be better informed on some particular topic, I hope I can allow you the freedom of seeing the matter differently, without my feeling aggrieved. And if you have a particular expertise, which leads you to radical unconventional conclusions, but fail to explain them adequately or clearly, then you ought not to take it as a personal insult if you have failed to persuade me. Abusing my ignorance wll not change my mind, and the fault may very well be yours! In matters of discussion, there has to have been a good reason why the Good Lord gave us two ears, but only one mouth! A corresponding principle needs apply to blogging. Listen before speaking! Read before commenting!\n\n","date":"June 27, 2013 at 5:40 am","url":"https://shroudstory.com/2013/06/26/personal-attacks-on-others/","cat":"news_&_views","id":"comment-38172","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Personal Attacks on Others","post":"Doctor Colin Berry wrote: “although it’s worth noting that MPH’s responses were being blocked while I was still free to comment, so it was not a one-way street.”\nThe TRUE fact is ALL my comment were published by Dan. All of them were just awaiting moderation while (most curiously) Doctor Colin Berry’s & wife’s were free to spit on me…\nMax Patrick Hamon ancien Professeur/Oustadh à l’Université de Riyad\n\n","date":"June 27, 2013 at 6:02 am","url":"https://shroudstory.com/2013/06/26/personal-attacks-on-others/","cat":"news_&_views","id":"comment-38176","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Personal Attacks on Others","post":"English translation for Ustadh fi Al-Djamieh Er-Riyadh: “Professor at the University of Riyadh”, whether Doctor Berry & Wife like it OR NOT.\n\n","date":"June 27, 2013 at 6:10 am","url":"https://shroudstory.com/2013/06/26/personal-attacks-on-others/","cat":"news_&_views","id":"comment-38177","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Personal Attacks on Others","post":"Or in other words Ustadh fil-kulie(t) el-Adab (كلية الآداب) wa el-kulie et-terbieh (كلية التربية), “Professor at the faculty of Arts and the college of education”.\n\n","date":"June 27, 2013 at 6:19 am","url":"https://shroudstory.com/2013/06/26/personal-attacks-on-others/","cat":"news_&_views","id":"comment-38180","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Personal Attacks on Others","post":"Sorry Dave if don’t like reading Arabic on Dan’s blog.\n\n","date":"June 27, 2013 at 6:27 am","url":"https://shroudstory.com/2013/06/26/personal-attacks-on-others/","cat":"news_&_views","id":"comment-38183","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Personal Attacks on Others","post":"typo: see script/transcription in Arabic\n\n","date":"June 27, 2013 at 6:29 am","url":"https://shroudstory.com/2013/06/26/personal-attacks-on-others/","cat":"news_&_views","id":"comment-38184","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Personal Attacks on Others","post":"BTW, I STILL can speak and read Arabic (modern standard Arabic + a few Eastern Arabic language varieties)\n\n","date":"June 27, 2013 at 6:31 am","url":"https://shroudstory.com/2013/06/26/personal-attacks-on-others/","cat":"news_&_views","id":"comment-38185","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Personal Attacks on Others","post":"Max, I’ve removed a couple of your comments. Don’t push your luck.\n\n","date":"June 27, 2013 at 6:41 am","url":"https://shroudstory.com/2013/06/26/personal-attacks-on-others/","cat":"news_&_views","id":"comment-38186","author":"Dan","site":"shroudstory"},{"title":"Personal Attacks on Others","post":"Dan, which ones?\n\n","date":"June 27, 2013 at 6:49 am","url":"https://shroudstory.com/2013/06/26/personal-attacks-on-others/","cat":"news_&_views","id":"comment-38189","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Personal Attacks on Others","post":"Dan, Which ones?\n\n","date":"June 27, 2013 at 6:45 am","url":"https://shroudstory.com/2013/06/26/personal-attacks-on-others/","cat":"news_&_views","id":"comment-38188","author":"chantal boisselier","site":"shroudstory"},{"title":"Personal Attacks on Others","post":"Reminder for Dan: I had to pass my comments via my girlfriend’s computer to reply to Doctor Colin Berry & Wife’s ‘darling’ ad homs.\n\n","date":"June 27, 2013 at 6:58 am","url":"https://shroudstory.com/2013/06/26/personal-attacks-on-others/","cat":"news_&_views","id":"comment-38192","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Personal Attacks on Others","post":"Dan, how come then, STILL TO PRESENT, I just cannot pass comment under my name on THREE THREADS and had to recur to my girlfriend name to pass my comments in reply to the Doctor Colin and Wife’s ‘blog show’ when the latter ARE FREE to do so?\n\n","date":"June 27, 2013 at 7:07 am","url":"https://shroudstory.com/2013/06/26/personal-attacks-on-others/","cat":"news_&_views","id":"comment-38197","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Personal Attacks on Others","post":"Typo: WERE/ARE STILL FREE TO DO SO?\n\n","date":"June 27, 2013 at 7:08 am","url":"https://shroudstory.com/2013/06/26/personal-attacks-on-others/","cat":"news_&_views","id":"comment-38198","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Personal Attacks on Others","post":"If ONLY Doctor Colin Berry could stick to his element (chemical/comical matter)…\n\n","date":"June 27, 2013 at 7:47 am","url":"https://shroudstory.com/2013/06/26/personal-attacks-on-others/","cat":"news_&_views","id":"comment-38202","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Personal Attacks on Others","post":"Max, you are perceptive, so you know that the realm of Shroud studies has always been a minefield and you need a lot of patience. Maybe you didn’t read the tip I gave you and Colin on this blog: Although you don’t have much time, do think of a homepage or about putting your papers in pdf and contacting Shroud websites which would be willing to post them, providing links to them on this blog. Both you and Colin have an advantage, and that is the fact that both of you can be located, which is not the case with bloggers hiding behind pseudonyms and making aggressive comments, behaving like self-appointed judges. I hope Dan Porter thinks about rejecting anonymous bloggers, as he too seems to have reached the limits of his patience. From what can be seen in some of the comments above, his advice seems to be falling on deaf ears and it is a sign of intelligence to learn from mistakes.  Best.\n\n","date":"June 27, 2013 at 10:27 am","url":"https://shroudstory.com/2013/06/26/personal-attacks-on-others/","cat":"news_&_views","id":"comment-38219","author":"Louis","site":"shroudstory"}]
