[{"title":"Philosophy: The Way of the Agnostic (and the Shroud)","post":"Over the years, I have become just a little sceptical about the capability of modern philosophy to comment usefully about religion.  Frankly I prefer a phenomenological approach, such as that taught in the better Religious Studies departments, and which tends to be more comprehensive in its understanding of Religions generally.  It seems to be a trend within the history of philosophy that whenever it pontificated about some esoteric topic, that the topic became specialised in a way that proved more successful outside Philosophy’s hallowed halls.  It was true of Aristotle’s Physics for example, and I think it is very likely true of Religion.  The philosopher’s approach often seems to be narrow, even reductionist, with what seems to be the Philosopher’s emphasis on “knowledge”, and the “nature of knowledge” where it might better apply itelf.  What modern philosophy has to say about religion is a far cry from St Thomas’ Summa Theologica for instance, notwithstanding Professor Gutting’s 12 years of training with the Jesuits, and his instructing of Catholic students at a prestigious university.  \nHis criteria for evaluating religions:  “the three great human needs religions typically claim to satisfy: love, understanding, and knowledge” are just too reductionist for me, and I doubt if I can agree that,this is what religions are indeed about.  There is nothing here for instance of the divine, the spiritual, the otherness, little about the role of social cohesion, or sense of community, or “The Idea of the Holy” (e.g. Rudoph Otto), the numinous, the mysterium tremendum, or the cosmic and the ultimate end of humanity.  It is little more than a warm fuzzy!   \nProfessor Gutting is apparently a specialist authority on the work of Michel Foucault, who along with Jaques Derrida have both been an unfortunately powerful influence in much of 20th century thought and development, but who have also been variously described as two French clowns who contributed little that was worthwhile, whenever it did occur to them to be at least comprehensible.  I doubt that Michel Foucault ever had anything of worthwhile utility to say about Religion.  If modern Philosophy has anything at all useful to say about Religion, it would very likely be confined to commenting on the nature of religious knowledge, and very little else, a very circumscribed aspect indeed.\n\n","date":"January 23, 2013 at 7:41 pm","url":"https://shroudstory.com/2013/01/23/philosophy-the-way-of-the-agnostic-and-the-shroud/","cat":"news_&_views","id":"comment-22483","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Philosophy: The Way of the Agnostic (and the Shroud)","post":"Swinburne is good on the whole, exception taken to his interpretation of the Gospel of John, the result of immersion in natural theology. Plantinga is more interesting and a must read is the encyclical “Fides et Ratio” that came from Pope John Paul II, a philosopher in his own right.\n\n","date":"January 23, 2013 at 10:11 pm","url":"https://shroudstory.com/2013/01/23/philosophy-the-way-of-the-agnostic-and-the-shroud/","cat":"news_&_views","id":"comment-22488","author":"Louis","site":"shroudstory"},{"title":"Philosophy: The Way of the Agnostic (and the Shroud)","post":"Correct me if I am misreading this, but it sounds like an educated way to say one should approach religion cafeteria-style: take what one wants and ignore or dispose of the rest.  This is completely illogical.  If the religion is worth anything, one cannot just take a religion piecemeal because it ought to be integral – everything in the religion should fit together.  If it doesn’t, it isn’t much of a religion.\n\n","date":"January 24, 2013 at 9:31 pm","url":"https://shroudstory.com/2013/01/23/philosophy-the-way-of-the-agnostic-and-the-shroud/","cat":"news_&_views","id":"comment-22577","author":"Andy Weiss","site":"shroudstory"},{"title":"Philosophy: The Way of the Agnostic (and the Shroud)","post":"I can understand where Andy is coming from as it expresses the faith of the fully committed Christian.  But that is not the reality of where many people seeking a faith happen to be at.  What should one say to these – “Sorry, that it is all or nothing – you’re either in it totally or you’re out!”  That does not seem to me to be the truly Christian approach.  For many, the fulness of faith is something that can develop over a period of time.  We get a hint of this in Matthew’s gospel, 19:1-9, where the Pharisees question Jesus about divorce.  They asked: “Then why did Moses command that a writ of dismissal should be given in cases of divorce?” Jesus replied “It was because you were so unteachable that Moses allowed you to divorce your wives, but it was not like this from the beginning.”  I think we see here that there can be degrees of commitment, according to the capability of the person, even though it is not the way of perfection.  \nAs I’ve indicated above, I’m not at all happy with Professor Gutting’s approach, that all religions are about “the three great human needs … love, understanding and knowledge”.  That to me is too anthropocentric, and is not what religion is about at all.  As my local pastor is so fond of saying: “It’s not about me; It’s not about you; It’s all about God!”  But that is a way of perfection, and many of us are still children in the faith.  However the God-centric approach does not appear to be part of Prof Gutting’s consideration at all in what he has recently posted, but perhaps he is providing a way for the tepid or agnostic.\n\n","date":"January 24, 2013 at 11:09 pm","url":"https://shroudstory.com/2013/01/23/philosophy-the-way-of-the-agnostic-and-the-shroud/","cat":"news_&_views","id":"comment-22581","author":"daveb of wellington nz","site":"shroudstory"}]
