[{"title":"An American Jew in Favor of Authenticity","post":"“It is probably nothing more than crappy paraphrasing when we read, “modern science is still incapable.””\nA lot of simple things in science turn out to be complicated, see the physics of coffee stains: http://www.npr.org/2011/08/17/139681851/scientists-crack-the-physics-of-coffee-rings\nThe science of what happened on the Shroud is made of a series complex steps.\nSo when you read such claims, keep in mind we had a poor understanding of coffee stains until 2011…\n\n","date":"May 15, 2015 at 7:50 am","url":"https://shroudstory.com/2015/05/15/an-american-jew-in-favor-of-authenticity/","cat":"other_sites","id":"comment-199176","author":"anoxie","site":"shroudstory"},{"title":"An American Jew in Favor of Authenticity","post":"Barrie Schwartz is a Hero, you cannot have the Shroud with out the Kin of Our Lord. Remember His Kin are The Jewish People… Thank you Barrie Schwartz and all of you please pray for me.\n\n","date":"May 15, 2015 at 7:52 am","url":"https://shroudstory.com/2015/05/15/an-american-jew-in-favor-of-authenticity/","cat":"other_sites","id":"comment-199177","author":"Joshua","site":"shroudstory"},{"title":"An American Jew in Favor of Authenticity","post":"Barrie Schwortz is a Hero. A unique Hero.\n\n","date":"May 15, 2015 at 7:54 am","url":"https://shroudstory.com/2015/05/15/an-american-jew-in-favor-of-authenticity/","cat":"other_sites","id":"comment-199178","author":"joshua8b2015","site":"shroudstory"},{"title":"An American Jew in Favor of Authenticity","post":"I agree.  And I know Barrie to be precisely correct.\n\n","date":"May 15, 2015 at 8:54 am","url":"https://shroudstory.com/2015/05/15/an-american-jew-in-favor-of-authenticity/","cat":"other_sites","id":"comment-199182","author":"Dan","site":"shroudstory"},{"title":"An American Jew in Favor of Authenticity","post":"You know whats interesting? It seems that there are two things, that The Jewish People (Barrie is a member) are not afraid of or intimidated by, when it comes to Christianity, The Shroud of Turin, (The Holy Shroud) and The Person of The Sacred Virgin Mary. There is a really good documentary on Chartres Cathedral, they mentioned some of their pilgrims are Orthodox Jews… There are deep mysterious similarities between Traditional Catholics and The Orthodox Jewish communities… They have a similar vein… Its curious…  Well thank you for this blog, its fascinating.\n.\n\n","date":"May 15, 2015 at 1:28 pm","url":"https://shroudstory.com/2015/05/15/an-american-jew-in-favor-of-authenticity/","cat":"other_sites","id":"comment-199220","author":"joshua","site":"shroudstory"},{"title":"An American Jew in Favor of Authenticity","post":"Hi, Joshua.\nWhat you have stated is true about Barrie Schwortz and your elaboration of “The Jewish People (Barrie is a member),” also brings to mind, lest we forget, Jesus is also a member.\nAs an aside, I have seen more and more Messianic Rabbis, taking center stage in the media, trumpeting the name of Yehshua Ha-Messchiach.\nBlessings on you, Joshua.  :)\nBest,\n\n","date":"May 15, 2015 at 2:38 pm","url":"https://shroudstory.com/2015/05/15/an-american-jew-in-favor-of-authenticity/","cat":"other_sites","id":"comment-199228","author":"Angel","site":"shroudstory"},{"title":"An American Jew in Favor of Authenticity","post":"edit:  Yeshua Ha-Mashiach\n\n","date":"May 15, 2015 at 2:42 pm","url":"https://shroudstory.com/2015/05/15/an-american-jew-in-favor-of-authenticity/","cat":"other_sites","id":"comment-199229","author":"Angel","site":"shroudstory"},{"title":"An American Jew in Favor of Authenticity","post":"Fortunately for us someone in the past (and still) has\nbeen busy for the Shroud …!\nThe documentation of Barrie Schwotz is truly remarkable.\n — — —\nInstead it seems that the city of Palymira (UNESCO site)\nis ending in the hands of the barbarians of ISIS. \nIt seems to me that in the museum of the city are preserved\ntextile remains that are interesting also to understand the Shroud.\nAm I wrong?\n— —\nI hope that their goals are far from the Museum,\nperhaps are the destruction of the temple of Baal and\nand the damages to the main colonnaded avenue.\nI have read that:\n>The Temple of Baal is an ancient stone ruin located in Palmyra, Syria.\nThe temple, consecrated to the Semitic god Baal, worshipped at Palmyra in triad with the lunar god Aglibol and the sun god Yarhibol, formed the center of religious life in Palmyra and was dedicated in 32 CE.\n>Aedeen Cremin considers its ruins the “best preserved” at Palmyra.\n>The Great Colonnade at Palmyra was the main colonnaded avenue\nin the ancient city of Palmyra in the Syrian Desert. The colonnade\nwas built in several stages during the second and third century CE\nand stretched for more than a kilometer. It linked the Temple of Bel,\nin the southeastern end of the city, to the West Gate and\nthe Funerary Temple in the northwestern part.\nLinks:\nhttp://en.wikipedia.org/wiki/Temple_of_Bel\nhttp://en.wikipedia.org/wiki/Great_Colonnade_at_Palmyra\nBut all this (which covers the presumed or probable horrible\ndestructive activities of ISIS) is therefore very far from\nthe important (and longstanding) great documentation work\nof an American Jew … who is friend not only of leading researchers,\nexperts on that Ancient Sheet, but friend of all the civilized World.\nThe possible systematic demolition of idolatries can pass through\nthe careful examination of Science. It is not with the destructive\nviolence that leads citizens to monotheism (and here I want to clarify\nthat I am neither Jew nor Muslim).\n\n","date":"May 15, 2015 at 9:50 am","url":"https://shroudstory.com/2015/05/15/an-american-jew-in-favor-of-authenticity/","cat":"other_sites","id":"comment-199191","author":"piero","site":"shroudstory"},{"title":"An American Jew in Favor of Authenticity","post":"The Society makes no mention of future testing, and there seems to be some agreement between its position, that of Cardinal Anastasio Balletrero and PAS Chancellor Archbishop Marcelo Sánchez Sorondo. French archbishop Marcel Lefebvre was misunderstood by Pope Paul VI, although he himself had been the victim of some of the things the prelate had been denouncing. His excommunication was lifted, but there is no chance of reconciliation between the Society and Rome if it depends on the German priest Father Franz Schmidberger. The Society’s seminary is in Econe, Switzerland:\n http://www.seminaire-econe.ch/gbcom/\nRome is silent for the time being, and some of the reasons can be found in the last questions in the two following interviews:\nhttps://www.academia.edu/8841978/Professor_Giulio_Fanti_discusses_the_controversies_in_the_realm_of_Shroud_studies\nand\nhttps://www.academia.edu/11355553/Dr._Paolo_Di_Lazzaro_explains_his_research_on_image_formation_on_the_Shroud_of_Turin\n\n","date":"May 15, 2015 at 10:01 am","url":"https://shroudstory.com/2015/05/15/an-american-jew-in-favor-of-authenticity/","cat":"other_sites","id":"comment-199194","author":"Louis","site":"shroudstory"},{"title":"An American Jew in Favor of Authenticity","post":"I do not want to controversy with anyone but I should mention that\n>Prominent members of the SSPX, including Lefebvre himself,\nhave, at various times, expressed approval or support for a restoration\nof an absolutist French monarchy; the Vichy government (1940–1944);\nand the party of Jean-Marie le Pen.\n>On the basis of statements made by Bishop Richard Williamson,\nthe Anti-Defamation League has accused the Society\nof being “mired in anti-Semitism”…\nBut now I would like to remind (repeating my tedious “mantra”…)\nthat you can get interesting information using AFM techniques.\nNano-indentation allows for hardness and stiffness to be\ndirectly measured at the submicron level\nBurgert (see for example: “Micromechanics of Cell Walls”,\nIngo Burgert and John W.C. Dunlop) indicated the study\nby Gindl W, Schoberl T (2004):\n“The significance of the elastic modulus of wood cell walls\nobtained from nanoindentation measurements.”\n(Compos A Appl Sci Manuf 35:1345–1349).\nSo, Burgert recalled us that mechanical parameters\n(= elastic modulus and hardness) can be\ndetermined at the location of the indent\n(from the force–displacement curve and a knowledge\nof the shape of the tip).\n— — —\nYou should then be able to work well\n(= without useless destructions) using\nthe AFM apparels…\nThere are many interests that can slow Shroud studies,\nbut I would not want to be counted among those\nwho have blocked or block scientific research …\n\n","date":"May 16, 2015 at 5:17 am","url":"https://shroudstory.com/2015/05/15/an-american-jew-in-favor-of-authenticity/","cat":"other_sites","id":"comment-199263","author":"piero","site":"shroudstory"},{"title":"An American Jew in Favor of Authenticity","post":"Barrie Schwortz nailed it when he said “because the research is biased by huge ideological implications”. Many of the  scientists, those who believe they are smarter than everyone else because they have an affinity for physics, chemistry, biology, are blinded by their own lack of objectivity when it comes to certain subjects such as God, spirituality and faith. They will continue to kick the can down the road with missives like “it’s a fake and we must do more testing” when confronted with challenges to recreate it themselves or to definitively explain how it got there.\nI can say I am objective on the subject of the Shroud, and when the results of the carbon-dating were published in 1988, I was disappointed, but able to accept it likely dated back to the Middle Ages.\nHowever, years later’ I ran into some of Ray Rogers studies and his opinions based on further, independent analysis (Let’s not forget, Rogers was one who believed the Shroud was a Medieval creation as he was heavily involved with the carbon-dating testing).\nAfter reading what Rogers had to say, as well as people like Barrie Schwortz, plus the discovery of pollen from plants that grow only in and around Jerusalem, plus the precision of the image, I have objectively determined it’s the burial cloth of Jesus.\nTo me the image does not prove or disprove that there is a God, nor does it prove the resurrection of Jesus, but the evidence is overwhelming that it is Jesus’ burial cloth.\nAnd, no, the first the Shroud was mentioned is not the 14th or 15th century. The cloth was mentioned way back to at least the 5th century – “the Cloth of Edessa”.\nThe face is the exact face on the Byzantine painting known as “Christos Pantocratur”. Ray Rogers determined this when he placed the face on the Shroud over 5th century painting and found the two figures are perfect matches except the eyes are closed on the face on the Shroud and it also shows evidence of bruising and injury.\n\n","date":"May 15, 2015 at 10:15 am","url":"https://shroudstory.com/2015/05/15/an-american-jew-in-favor-of-authenticity/","cat":"other_sites","id":"comment-199195","author":"leon ward","site":"shroudstory"},{"title":"An American Jew in Favor of Authenticity","post":"Hi, Leon.\nAs well, check out google images “Justinian II pantocrator coin, gold solidus” and the silver vase, on this link below (this site).\nhttps://shroudstory.com/?s=ancient+silver+vase+with+image+of+Jesus\nThe first and third image (first row) on the google images Justinian coins looks exactly as the image on the silver vase.\nBest,\n\n","date":"May 15, 2015 at 2:56 pm","url":"https://shroudstory.com/2015/05/15/an-american-jew-in-favor-of-authenticity/","cat":"other_sites","id":"comment-199231","author":"Angel","site":"shroudstory"},{"title":"An American Jew in Favor of Authenticity","post":"The all-too-often preoccupation on this site with the question of authenticity, distracts from the message of the Shroud.  As it is with the Shroud, so it was with Jesus.   Many rejected him, a few accepted him.  Among those who accepted him, they all too often broke up into individual warring sects.  The first 500 years or so of Christianity, was dominated by abstruse questions of theology, and within these debates, his message of salvation and fraternal love was heard too seldom.  \nA persistent message of recent Popes, has been what meditation on the image of the man of sorrows shown on the Shroud, can tell us about the suffering of the man Jesus, and it sets aside the question of whether it is the true burial cloth or not, a matter of lesser importance.  We see too  little of this message in the all too frequent contentious comments here.  \n“For the wisdom of this world is foolishness to God. As the Scriptures say, “He traps the wise in the snare of their own cleverness.” ”  I Cor 3:19\n\n","date":"May 15, 2015 at 3:32 pm","url":"https://shroudstory.com/2015/05/15/an-american-jew-in-favor-of-authenticity/","cat":"other_sites","id":"comment-199233","author":"daveb of wellington nz","site":"shroudstory"},{"title":"An American Jew in Favor of Authenticity","post":"Well said! \nYet,  you must keep in mind, Christians do not require evidence for (or proof of) His existence, but non-believers demand no less.\nWith that in mind, the Shroud’s authenticity is detrimental to ultimately silencing the atheists.   \nJust a thought.\nBest,\n\n","date":"May 15, 2015 at 7:31 pm","url":"https://shroudstory.com/2015/05/15/an-american-jew-in-favor-of-authenticity/","cat":"other_sites","id":"comment-199242","author":"Angel","site":"shroudstory"},{"title":"An American Jew in Favor of Authenticity","post":"Does it bug scientists they have yet to figure it out and seem to not even be close? Just wondering why the wording bothers you, Dan.\n\n","date":"May 15, 2015 at 10:38 pm","url":"https://shroudstory.com/2015/05/15/an-american-jew-in-favor-of-authenticity/","cat":"other_sites","id":"comment-199251","author":"Andy","site":"shroudstory"},{"title":"An American Jew in Favor of Authenticity","post":"Not just for the benefit of The Shroud, but for the benefit of the Catholic Church and all of Christianity, keep the ISIS out of Rome.\n\n","date":"May 16, 2015 at 12:36 am","url":"https://shroudstory.com/2015/05/15/an-american-jew-in-favor-of-authenticity/","cat":"other_sites","id":"comment-199254","author":"Emmett McMahon","site":"shroudstory"},{"title":"An American Jew in Favor of Authenticity","post":"Very likely the advance undercover agents and sleepers are already there and elsewhere in Europe.  Are all the “refugees” crossing the Mediterranean from Libya bona fide?\n\n","date":"May 16, 2015 at 3:55 am","url":"https://shroudstory.com/2015/05/15/an-american-jew-in-favor-of-authenticity/","cat":"other_sites","id":"comment-199260","author":"daveb of wellington nz","site":"shroudstory"}]
