[{"title":"Picture of the Week:  Lighting up the night on the South Jersey Shore","post":"Two of my favourite enigmas linked in one photo: the Shroud and the Brendan voyage. Nice.\n\n","date":"July 2, 2014 at 12:13 pm","url":"https://shroudstory.com/2014/07/02/picture-of-the-week-lighting-up-the-night-on-the-south-jersey-shore/","cat":"uncategorized","id":"comment-134892","author":"David Goulet","site":"shroudstory"},{"title":"Picture of the Week:  Lighting up the night on the South Jersey Shore","post":"The secret of the surname Brendan:\nCryptologically speaking (medieval etymology), the surname Brendan (feminine form Brenda) plays with the Latin words brandeum and its plural form brandea, i.e. a textile contact relic as substitute and can refer to a Holy relic or even the Relic of relics namely the Shroud.\nEtymologically speaking (scientific etymology) this is a Celtic name that literally means “he (the Virgo male) with a stag head” referring to a young man wearing a white stag mask with real antlers symbolic of Divine Power. In the feminine form, “she (the Virgin) of the stag-headed (young virgo male)” symbolic of Materia Prima (the Human condition) in conjunction with a fecundation rite dedictated to Celtic G-od Cernunos.\nIconosteganlogically speaking, you can see the young stag head (as archaeoprareidolia\n/optical illusion) in the TS man’s bloodied image of his forearms. This TS steganic image accounts for the parallelled hagiographic legends of saint Stacey/cie, saint Julian and saint Hubert. \nNow:\n– the scientific etymology for Stacey/cie is Greek word eu-stachys, “nice ear (of barley/wheat)” (and can be read in light of the TS weave pattern). All the more so as the latter surname  plays with Greek word Anastasis, “Resurrection” too. \n– the surname Julian derives from the Greek word ioulos, “whole (ear of barley)”, which echoes Stacey/cie). \n– the scientific etymology for Hubert is ()possibly) Germanic hug, “thought, reflection, intellect” and bert,  “to shine,enlighten, awaken”. The former copies the Aramaic word HOug, “mental activity” and Chaldaic HâGoH, “to meditate, think, reflect, reason, deduce”. In Celtic houg/huw, “meditation, thought, inspiration”. \nAll this speaks volumes on icono/cryptosteganology image and word interconnections.\nThen finally one can also notice the word brend (“antlers”) derived from the Celtic brand “to split (a host)”, “to divide (into TWO)”. The Celtic word comes from the Aramaic word PRaD “to divide, split, share” (Heb. PâRaD). The latter plays with the Heb. Para ‘Aduma, ‘”the Red Heifer”, which plays in his turn with Heb. Phar, “bullock” referring to the covenant between G.od and Man, of a bullock cut into two. Now Torino/Turin/torino, the Italian name of the city in which the Shroud is kept is the very word for bullock…\n\n","date":"July 2, 2014 at 2:00 pm","url":"https://shroudstory.com/2014/07/02/picture-of-the-week-lighting-up-the-night-on-the-south-jersey-shore/","cat":"uncategorized","id":"comment-134916","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Picture of the Week:  Lighting up the night on the South Jersey Shore","post":"Typo: The Celtic word comes from the Aramaic word PRaD “to divide, split, share” (Heb. PâRaD). The latter plays with the Heb. PARA ‘ADuma, ‘”the Red Heifer”, which plays in his turn with Heb. PAR, “bullock” referring to the covenant between G.od and Man, of a bullock cut into two. Now Torino/Turin/torino, the Italian name of the city in which the Shroud is kept is the very word for bullock…\nAdditional Note: The Greek word PARADeisos, “Paradise” stands for a garden sePARAteD from our own world,\n\n","date":"July 2, 2014 at 6:54 pm","url":"https://shroudstory.com/2014/07/02/picture-of-the-week-lighting-up-the-night-on-the-south-jersey-shore/","cat":"uncategorized","id":"comment-134959","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Picture of the Week:  Lighting up the night on the South Jersey Shore","post":"…and the dorsal and ventral Shroud bloodied images do appear as those of a man sagitally cut into two…\n\n","date":"July 2, 2014 at 2:14 pm","url":"https://shroudstory.com/2014/07/02/picture-of-the-week-lighting-up-the-night-on-the-south-jersey-shore/","cat":"uncategorized","id":"comment-134917","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Picture of the Week:  Lighting up the night on the South Jersey Shore","post":"In Old Celtic word caro means “stag, deer”. Now in medieval ecclesiastical Latin the homonym caro means Christ’s body…\n\n","date":"July 2, 2014 at 2:19 pm","url":"https://shroudstory.com/2014/07/02/picture-of-the-week-lighting-up-the-night-on-the-south-jersey-shore/","cat":"uncategorized","id":"comment-134918","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Picture of the Week:  Lighting up the night on the South Jersey Shore","post":"David, now you can re-read saint Brendan’s Voyage in this crypto- and iconosteganological light. Enjoy it.\n\n","date":"July 2, 2014 at 2:22 pm","url":"https://shroudstory.com/2014/07/02/picture-of-the-week-lighting-up-the-night-on-the-south-jersey-shore/","cat":"uncategorized","id":"comment-134919","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Picture of the Week:  Lighting up the night on the South Jersey Shore","post":"And don’t forget ‘Brendan’ is an anagram giving us the old Germanic word ‘Bandern’ -a plural form meaning ‘ribbons’ or ‘swaths’ of linen — a clever nod to the Shroud and it’s dual images.\n\n","date":"July 2, 2014 at 2:23 pm","url":"https://shroudstory.com/2014/07/02/picture-of-the-week-lighting-up-the-night-on-the-south-jersey-shore/","cat":"uncategorized","id":"comment-134922","author":"David Goulet","site":"shroudstory"},{"title":"Picture of the Week:  Lighting up the night on the South Jersey Shore","post":"David,\nOn April 23, 2014 at 6:07 pm, I wrote: \n“The Gundestrup cauldron (a richly decorated silver vessel, thought to date to the 1st century BC) depicts people and deities from Celtic mythology. The most famous image from the cauldron is that depicting the celtic antlered God (one of the five rectangular long inner plates) that is mostly identified as Cernunnos, the G-od of fecundity and master of the animals. ” \n“He wears a zigzag weave patterned linen cloth. The god is more usually associated with antlers, especially of the red deer. ”\n“Now in old Celtic language caro means “deer/stag” and its Latin homonym caro is liturgical Latin to designate Christ’s body/flesh… Zigzagged weave patterned linen cloth in conjunction with Christ body and a deer, Christ turning into a deer, Merlin riding a deer, a deer appearing to Saint Hubertus, Julianus and Eustachius etc; ring any medieval symbolical/historiographic/legendary bell?”\n“Actually, on the TS bloodied forearm area lies the dormant archaeopareidolia (or semblance/Rorschach-image-test-like vision) of a deer/stag head with a small cross over its head… you just have to turn the positive bloodied forearm image upside down…”\n\n","date":"July 2, 2014 at 6:00 pm","url":"https://shroudstory.com/2014/07/02/picture-of-the-week-lighting-up-the-night-on-the-south-jersey-shore/","cat":"uncategorized","id":"comment-134954","author":"Max patrick Hamon","site":"shroudstory"}]
