[{"title":"Pictures to Consider for the Posting: “Baked-In Creases. Really?”","post":"Thanks Dan,\nThis is further to the previous post where it is claimed that the double track  creases (with a clear centre is evidence for a scorch. Although, as you have indicated they can be caused by any image formation mechanism (natural or supernatural), checking them in Shroud 2.0 shows those double tracks off-image thus they can’t be produced by the hot statue as Colin has postulated  (check the legend on the top right corner for the location of the crease). Furthermore, The crease below the chin shows the image continuous, so the colourless middle is not really that colourless.\n\n","date":"March 25, 2014 at 5:42 am","url":"https://shroudstory.com/2014/03/25/pictures-to-consider-for-the-posting-baked-in-creases-really/","cat":"uncategorized","id":"comment-93013","author":"Mike M","site":"shroudstory"},{"title":"Pictures to Consider for the Posting: “Baked-In Creases. Really?”","post":"Colin, I realize you never claimed images # 3 & 4 were a double track creases. How could you when they are clearly off-image. # 3 sure looks like one though, lighting factors applies for all the creases not just the off-image ones. I included #4 because Hugh referred to it, IMHO it doesn’t look like a double track crease, there is an interesting double line to the right of it (at an angle) that looks like an imperfection in the weave, may be Mario was referring to that? The main point is; 1-the creases you mentioned extend off-image & 2- the middle line below the chin contains image information.\n\n","date":"March 25, 2014 at 7:16 am","url":"https://shroudstory.com/2014/03/25/pictures-to-consider-for-the-posting-baked-in-creases-really/","cat":"uncategorized","id":"comment-93036","author":"Mike M","site":"shroudstory"},{"title":"Pictures to Consider for the Posting: “Baked-In Creases. Really?”","post":"You’re right about #4. And how extraordinary! Compare Mike’s Shroud 2.0 photo above with the maximum enlargment of the same place in Shroudscope. They’re totally different. The double line of darkness on Shroudscope now appears to be nothing but shadows on either side of a brightly lit ridge. It casts into question how reliable Shroudscope is for this kind of investgation, where shadows might be involved.\n\n","date":"March 25, 2014 at 11:36 am","url":"https://shroudstory.com/2014/03/25/pictures-to-consider-for-the-posting-baked-in-creases-really/","cat":"uncategorized","id":"comment-93104","author":"Hugh Farey","site":"shroudstory"},{"title":"Pictures to Consider for the Posting: “Baked-In Creases. Really?”","post":"Mike, yes, the imperfection you pointed out near the wrist on #4 is a good example of weave imperfection I was referring to. It is not the only one. To be systematic and clear, I am hoping to have URLs that point directly to the locations on Shroud Scope with the Shroud 2.0 images with them (as an overlay, so you can popup the Shroud 2.0 photograph sections from the Durante 2002 photograph and compare). \nHugh writes “It casts into question how reliable Shroudscope is for this kind of investgation”. To be more precise, it casts into question the reliability of some of the features of specific Shroud photographs used for some investigations (note: Shroud Scope does not apply ANY modification to publicly available photographs). Of course, Shroud Scope tries to provide as many Shroud photographs as possible to mitigate the issues of each specific Shroud photograph. If I had the images done by Haltadefinizione, and their authorization, you can be certain that it would be available on Shroud Scope. I will try again to convince them to provide their image but that also depends on the authorities at Turin (and I understand their objections). Also, note that Shroud 2.0 DOES NOT have the highest resolution images done by Haltadefinizione, see my web site (sindonology.org) on that subject.\n\n","date":"March 25, 2014 at 12:01 pm","url":"https://shroudstory.com/2014/03/25/pictures-to-consider-for-the-posting-baked-in-creases-really/","cat":"uncategorized","id":"comment-93111","author":"latendre","site":"shroudstory"},{"title":"Pictures to Consider for the Posting: “Baked-In Creases. Really?”","post":"You’re quite right, Mario, and I did not intend any disrespect to Shroudscope, which for many investigations (such as measurement) is as good or better than Shroud 2.0. For this kind of investigation, however, namely the darkening around creases, then the shadows created by Durante’s lighting scheme render the reliability of any observations about the actual cloth unsound.\n\n","date":"March 25, 2014 at 2:53 pm","url":"https://shroudstory.com/2014/03/25/pictures-to-consider-for-the-posting-baked-in-creases-really/","cat":"uncategorized","id":"comment-93152","author":"Hugh Farey","site":"shroudstory"},{"title":"Pictures to Consider for the Posting: “Baked-In Creases. Really?”","post":"\nlatendre :\n I am hoping to have URLs that point directly to the locations on Shroud Scope with the Shroud 2.0 images with them (as an overlay, so you can popup the Shroud 2.0 photograph sections from the Durante 2002 photograph and compare).\n\nMario, As Hugh has mentioned the Shroudscope is indespensable in giving researchers the capacity to measure 2 points on the shroud, coupling that with shroud2.0 resolution would be priceless. I hope you can get approval for this.\n\n","date":"March 25, 2014 at 6:22 pm","url":"https://shroudstory.com/2014/03/25/pictures-to-consider-for-the-posting-baked-in-creases-really/","cat":"uncategorized","id":"comment-93224","author":"Mike M","site":"shroudstory"},{"title":"Pictures to Consider for the Posting: “Baked-In Creases. Really?”","post":"\nHugh Farey :\nYou’re quite right, Mario, and I did not intend any disrespect to Shroudscope, which for many investigations (such as measurement) is as good or better than Shroud 2.0. For this kind of investigation, however, namely the darkening around creases, then the shadows created by Durante’s lighting scheme render the reliability of any observations about the actual cloth unsound.Hugh Farey :\nYou’re quite right, Mario, and I did not intend any disrespect to Shroudscope, which for many investigations (such as measurement) is as good or better than Shroud 2.0. For this kind of investigation, however, namely the darkening around creases, then the shadows created by Durante’s lighting scheme render the reliability of any observations about the actual cloth unsound.\n\nI would take seriously any suggestion that what I have been describing as creases, especially those that are intrinsic to the image (“baked-in”) and contemporaneous with the image-imprinting processes, were mere shadow.artefacts.\nYes, we know such artefacts exist, and are abundant near the ends pf the Shroud, presumably where excessively centralized lighting becomes more oblique. But it’s not difficult to see they are shadows on account of a lack of fine structure, especially when one twiddles with contrast. (Ignore the warnings here about my placing “unscientific” reliance on colour changes – I certainly don’t, and never did in a series of over 12 postings on Shroud Scope in 2012 (totally ignored on this site btw)  where the contrast control was used merely to assist discrimination within an image between one discrete feature and another).\nTo illustrate my point I have just kept the same elevated contrast on the chin crease where it crosses hair, and turned down the brightness.\n\nIgnore any colour differences. The key thing to note is the way that the denser side of the twin track, largely homogeneous in the default Shroud Scope setting now breaks up into  spotty fine structure, while other recognizable structures, such as bloodstains in hair,  serving as an internal control, do not, retaining their characteristic morphology. So the chin “crease”  cannot possibly be shadow. It is most likely to be body image that has been efficiently imprinted onto a bulging crease in the fabric.\nI still intend to respond to Steve Hammond and Mike M when I’ve some time to spare.\n\n","date":"March 26, 2014 at 7:07 am","url":"https://shroudstory.com/2014/03/25/pictures-to-consider-for-the-posting-baked-in-creases-really/","cat":"uncategorized","id":"comment-93424","author":"colinsberry","site":"shroudstory"},{"title":"Pictures to Consider for the Posting: “Baked-In Creases. Really?”","post":"The twin-track under the chin, and that below the blood-fringe on the back of the head, are clearly visible on Shroud 2.0, and are therefore definitely not merely shadows. The twin-track upwards from the wrist so clear on Shroudscope is spectacularly absent in Shroud 2.0, and I think shadows are responsible for it. The only way to be sure that any crease discolouration on Shroudscope is not a shadow is to compare it with Shroud 2.0.\n\n","date":"March 26, 2014 at 7:55 am","url":"https://shroudstory.com/2014/03/25/pictures-to-consider-for-the-posting-baked-in-creases-really/","cat":"uncategorized","id":"comment-93432","author":"Hugh Farey","site":"shroudstory"},{"title":"Pictures to Consider for the Posting: “Baked-In Creases. Really?”","post":"Thanks for the prompt answer – and the agreement (?) that I have not chosen the wrong type of crease quote unquote on which to focus attention re likely imprinting mechanism.\nI have taken that Shroud 2.0 photo of the chin crease and entered it into my MS photoediting program to adjust contrast and brightness (upwards and downwards respectively). The result is essentially the same as I see with Shroud Scope. See link to picture:\n\nI’m not sure why you claim 2.0 to be the gold standard when it has an even more washed-out appearance than Durante 2002 on SScope. One cannot hope to make a scientific case with either in my opinion without giving some extra contrast and/or other adjustment so that one can see clearly the features of interest.  Yes, it goes without saying (or with saying in some instances!) that twiddling controls risks introducing artefacts, but as I said above, there are ways of guarding against that through use of internal reference points.\nAnyway, I’ve said what I wanted to say on this thread, and will now remain silent unless further noteworthy objections or reservations are raised.\n\n","date":"March 26, 2014 at 8:41 am","url":"https://shroudstory.com/2014/03/25/pictures-to-consider-for-the-posting-baked-in-creases-really/","cat":"uncategorized","id":"comment-93447","author":"colinsberry","site":"shroudstory"},{"title":"Pictures to Consider for the Posting: “Baked-In Creases. Really?”","post":"“I still intend to respond to Steve Hammond and Mike M when I’ve some time to spare”\nThen\n“I’ve said what I wanted to say on this thread, and will now remain silent unless further noteworthy objections or reservations are raised.”\nI am still waiting?\n\n","date":"March 26, 2014 at 5:19 pm","url":"https://shroudstory.com/2014/03/25/pictures-to-consider-for-the-posting-baked-in-creases-really/","cat":"uncategorized","id":"comment-93600","author":"Mike M","site":"shroudstory"},{"title":"Pictures to Consider for the Posting: “Baked-In Creases. Really?”","post":"Here’s something that doesn’t add up for me. If I’m a medieval artisan, who has presumably experimented extensively to perfect this technique, why would I accept such an imperfection as a crease on the facial area? This would be the one area I’d want to ensure was perfect. How was I so sloppy as to allow a crease to occur on an area that should be among the more ‘easy’ to scorch without creasing (vs the area between arms and body)?\n\n","date":"March 26, 2014 at 10:19 am","url":"https://shroudstory.com/2014/03/25/pictures-to-consider-for-the-posting-baked-in-creases-really/","cat":"uncategorized","id":"comment-93477","author":"David Goulet","site":"shroudstory"},{"title":"Pictures to Consider for the Posting: “Baked-In Creases. Really?”","post":"I don’t find the creases are evidence for scorching or any other image formation theory.\n\n","date":"March 26, 2014 at 8:17 am","url":"https://shroudstory.com/2014/03/25/pictures-to-consider-for-the-posting-baked-in-creases-really/","cat":"uncategorized","id":"comment-93439","author":"Andy","site":"shroudstory"},{"title":"Pictures to Consider for the Posting: “Baked-In Creases. Really?”","post":"Good question David, and there are no flip answers.\nIf you’d asked me that a few months ago, I’d have said that linen is expensive, and if the technique did not forsee the possibility of baked-in creases when hot template and linen were pressed together with contact area out of sight, our artisan would have hoped the crease would be mistaken as having come later (and many now do – shroudologists included!). But there’s another less mundane, altogether more tendentious  explanation.\nAre you fully up to date with my hypothesis that the Mark 1 Shroud was conceived initially as a kind of totem to symbolize the last of the Templars, slow-roasted St.Lawrence style:\nhttp://shroudofturinwithoutallthehype.wordpress.com/2014/02/21/flow-chart-summarising-a-novel-hypothesis-for-how-the-shroud-of-turin-came-into-existence-and-fooled-generations-of-scholars/\nHaving already suggested that the L-shaped poker holes were deliberate – to help convey immediately to surviving Templars and/or late-arriving initiates that the image WAS indeed a scorch to represent a semi-roasted martyr –  then it’s a small step to say that the chin level crease was also deliberate, the fabric being carefully pleated prior to imprinting. The need to make clear it was a scorch may have been especially important if using a life-sized crucifix as template, to defend against the  charge of blasphemy should the local bishop suspect that the man represented was not Jacques de Molay(?) as claimed, despite the image being a less-than-photogenic hard-to-recognize-with absolute-certainty negative.\n(Later someone had the idea of re-inventing the image as a life-size Veronica-style ‘sweat imprint’. That explains the references to “boiling in oil” etc, not to test the permanence as imagined, but to artificially age the background, and attenuate the image intensity relative to background.)\nSorry. That’s the best I can do on the spur of  the moment, and now have grandfatherly duties to attend to.\n\n","date":"March 26, 2014 at 11:03 am","url":"https://shroudstory.com/2014/03/25/pictures-to-consider-for-the-posting-baked-in-creases-really/","cat":"uncategorized","id":"comment-93486","author":"colinsberry","site":"shroudstory"},{"title":"Pictures to Consider for the Posting: “Baked-In Creases. Really?”","post":"Thanks for the extensive reply. I’ll chew on it while you enjoy being grampsbod.\n\n","date":"March 26, 2014 at 11:51 am","url":"https://shroudstory.com/2014/03/25/pictures-to-consider-for-the-posting-baked-in-creases-really/","cat":"uncategorized","id":"comment-93503","author":"David Goulet","site":"shroudstory"},{"title":"Pictures to Consider for the Posting: “Baked-In Creases. Really?”","post":"\nMike M :\n“I still intend to respond to Steve Hammond and Mike M when I’ve some time to spare”\nThen\n“I’ve said what I wanted to say on this thread, and will now remain silent unless further noteworthy objections or reservations are raised.”\nI am still waiting?\n\nSorry to keep you waiting Mike M. If you were following comments earlier in the day, you might have seen that I have stumbled on some new settings in my photedit program that give what I consider more detailed images of the chin crease and environs than those I have been using up until now. The new ones might be called high contrast/low brightness (previously high contrast only).\nLink to new image (hot from the press)\n\nI”ll try and get something up on my own sciencebuzz site by tomorrow evening GMT. That’s after I’ve had time to apply the new settings across the board generally by way of overview, digested the results, and then back to that intriguing chin crease for a hopefully better informed response to yours and Steve’s questions.\n\n","date":"March 26, 2014 at 6:49 pm","url":"https://shroudstory.com/2014/03/25/pictures-to-consider-for-the-posting-baked-in-creases-really/","cat":"uncategorized","id":"comment-93619","author":"colinsberry","site":"shroudstory"},{"title":"Pictures to Consider for the Posting: “Baked-In Creases. Really?”","post":"Thanks Colin\n\n","date":"March 26, 2014 at 6:51 pm","url":"https://shroudstory.com/2014/03/25/pictures-to-consider-for-the-posting-baked-in-creases-really/","cat":"uncategorized","id":"comment-93622","author":"Mike M","site":"shroudstory"},{"title":"Pictures to Consider for the Posting: “Baked-In Creases. Really?”","post":"Thanks Colin,\nAs I said on the other thread, I appreciate your research and efforts and think it’s quite valuable. (Though I lean fairly strongly toward authenticity.) I do think the chin crease is the most important for your argument, though it doesn’t falsify the scorch hypothesis if it isn’t “baked-in”. I look forward to what you have to say regarding the crease crossing the “gap” between the face image and the hair.\n\n","date":"March 26, 2014 at 7:32 pm","url":"https://shroudstory.com/2014/03/25/pictures-to-consider-for-the-posting-baked-in-creases-really/","cat":"uncategorized","id":"comment-93635","author":"Steve Hammond","site":"shroudstory"},{"title":"Pictures to Consider for the Posting: “Baked-In Creases. Really?”","post":"Colin, I personally keep an open mind in terms of your scorch theory, and look forward to hearing your progress.\nHowever I must say I find the “Templar Totem” fanciful, although certainly imaginative!\nIn my view, if the image was a scorch then it was done to portray Christ.\nI do have several problems with the artistic creation theory. I articulated one a day or two ago.\nAnother major problem in my view is the display of buttocks. That’s a huge departure from the historical depiction of Christ with a loin cloth, and its difficult to comprehend why an artist intent on fooling the gullible masses would show buttocks which would not only be a major departure from artistic norms but would probably also be considered highly offensive (potentially punishable?)\n\n","date":"March 26, 2014 at 6:49 pm","url":"https://shroudstory.com/2014/03/25/pictures-to-consider-for-the-posting-baked-in-creases-really/","cat":"uncategorized","id":"comment-93620","author":"Thomas","site":"shroudstory"},{"title":"Pictures to Consider for the Posting: “Baked-In Creases. Really?”","post":"Fanciful maybe, but try re-reading this, and ask yourself  whether Barbara Frale had not over-interpreted (as is her tendency).\nhttp://www.theguardian.com/world/2009/apr/06/turin-shroud-templars\nThe original prototype for the present TS, redesigned from scratch after the (incomplete) liquidation of the  Templar order?\n\n","date":"March 26, 2014 at 7:07 pm","url":"https://shroudstory.com/2014/03/25/pictures-to-consider-for-the-posting-baked-in-creases-really/","cat":"uncategorized","id":"comment-93628","author":"colinsberry","site":"shroudstory"},{"title":"Pictures to Consider for the Posting: “Baked-In Creases. Really?”","post":"Thomas, we have seen 2 fanciful extremes recently on that blog. “The Hacking” on the authenticity side and the “roasted Templar” on the (anti-authenticity side) both have no evidence whatsoever, both proponents have invested a lot of time and effort in their research, both were sincerely wrong. It is very unlikely that either of them will change his mind. I will credit Colin though that at least he is listening, (and I hope willing to change his mind when the evidence leads him in the opposite way).\n\n","date":"March 26, 2014 at 7:44 pm","url":"https://shroudstory.com/2014/03/25/pictures-to-consider-for-the-posting-baked-in-creases-really/","cat":"uncategorized","id":"comment-93638","author":"Mike M","site":"shroudstory"},{"title":"Pictures to Consider for the Posting: “Baked-In Creases. Really?”","post":"\nMike M :\n I will credit Colin though that at least he is listening, (and I hope willing to change his mind when the evidence leads him in the opposite way).\n\n I agree, Mike. Looking at his blog, there are some very interesting things that haven’t been fully explored yet. Most interesting to me is the nature of the “flagrum” scourge marks…being raised on 3D imaging and the “blood” marks associated with them. The next time this topic is raised I may have something useful to add. ;)\n\n","date":"March 26, 2014 at 7:59 pm","url":"https://shroudstory.com/2014/03/25/pictures-to-consider-for-the-posting-baked-in-creases-really/","cat":"uncategorized","id":"comment-93642","author":"Steve Hammond","site":"shroudstory"},{"title":"Pictures to Consider for the Posting: “Baked-In Creases. Really?”","post":"Why don’t you start your own post, send your ideas/images to Dan’s email. You being a physician can definitely add to our understanding of the medical aspects of the blood stains.\n\n","date":"March 26, 2014 at 8:16 pm","url":"https://shroudstory.com/2014/03/25/pictures-to-consider-for-the-posting-baked-in-creases-really/","cat":"uncategorized","id":"comment-93651","author":"Mike M","site":"shroudstory"},{"title":"Pictures to Consider for the Posting: “Baked-In Creases. Really?”","post":"Thanks, Mike,\nI’ll see if I can get something together this weekend and get it to Dan.\n\n","date":"March 26, 2014 at 8:56 pm","url":"https://shroudstory.com/2014/03/25/pictures-to-consider-for-the-posting-baked-in-creases-really/","cat":"uncategorized","id":"comment-93681","author":"Steve Hammond","site":"shroudstory"},{"title":"Pictures to Consider for the Posting: “Baked-In Creases. Really?”","post":"There are gaps to to be filled in the Templar hypothesis proposed by Ian Wilson and  expanded by Barbara Frale. Her first victory was the discovery of the “Chinon Parchment”, and her work has been appreciated by Malcolm Barber.\n\n","date":"March 26, 2014 at 8:01 pm","url":"https://shroudstory.com/2014/03/25/pictures-to-consider-for-the-posting-baked-in-creases-really/","cat":"uncategorized","id":"comment-93644","author":"Louis","site":"shroudstory"}]
