[{"title":"Ponderable for Today","post":"If it’s the product of artwork then it’s expected to have comparable artwork from the same era. But if it’s the result of a first century miracle then it’s supposed to be unique, as unique as the miracle which brought it into existence.\n\n","date":"January 17, 2015 at 7:25 am","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","id":"comment-184020","author":"MikeM","site":"shroudstory"},{"title":"Ponderable for Today","post":"If it was the product of the resurrection of Jesus then it’s expected to be unique since this was a unique event in history. If it was the product of an artwork then it’s expected to have comparative artwork from that era. Art techniques don’t just pop-up in history and then disappear.\n\n","date":"January 17, 2015 at 7:41 am","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","id":"comment-184024","author":"MikeM","site":"shroudstory"},{"title":"Ponderable for Today","post":"Yes… I did think of adding a rider to the effect that the uniqueness of the Shroud could of itself be considered a sign of authenticity if it was connected to a supernatural miracle, but I don’t usually involve myself in such considerations (valid though they be), and anyway I knew my comment was going to be quite long enough!\n\n","date":"January 17, 2015 at 8:31 am","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","id":"comment-184035","author":"Hugh Farey","site":"shroudstory"},{"title":"Ponderable for Today","post":"I suppose that, even without invoking the supernatural, one could argue that the uniqueness of the 1st century event – a body being removed from its shroud shortly after being wrapped in it – might result in a unique memento. On the other hand one might also suppose that needing a contact image from a body (or statue, or whatever) was also an extremely rare requirement and may have been entirely restricted to depictions on Christ’s burial cloth. Perhaps one of more of the other Quem Quaeritis shrouds (which undoubtedly exisited) had body images on, or perhaps other shroud relics, such as the Shroud of Besançon, were produced with images. It seems that no Quem Quaeritis shrouds remain today, with or without images, and that the only shrouds with images that do remain today are advertised copies of the Turin one rather than original creations. What a pity all the others were destroyed in the French revolution.\n\n","date":"January 17, 2015 at 9:05 am","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","id":"comment-184040","author":"Hugh Farey","site":"shroudstory"},{"title":"Ponderable for Today","post":"Dan you wrote: “I think it is significant that the shroud is unique, which, of course, cannot be proven.”\nWhy “of course” and “cannot be proven”? If we say “It is unique”, then it is either true or false.\nIf you think it is true, you would have a (subconscious?) proof for it, otherwise, “It is unique” would be meaningless.\nIn the realm of physical objects, we have to use a reasonable approach to “proof”. What is a proof in that case?\nI think it is reasonable that such a proof would entail to show that no one has been able to show the existence of a similar image or report that a similar one existed. And that has been proven, minus the description of the image of Edessa when it arrived in Constantinople in 944.\nTake another well-known example: has it been proven that we have never observed a physical object going at a speed higher than the speed of light? It is reasonable to answer, yes. No such event has ever been reported. It is based on decades of experiment and research.  It is hard to believe that a physicist would answer: “This has not been proven”. \nStating that the Shroud image is unique, is correct and proven because no one has reported any other similar image (again minus other cases related to the image of Edessa). \nThere is a major difference in stating: we just found this object, we believe it is unique as it looks odd, but we need to investigate further to look for more. Indeed, in such a case, the uniqueness has not been proven. \nThe Shroud of Turin has been proven unique based on such a definition of proof.\n\n","date":"January 17, 2015 at 6:50 pm","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","id":"comment-184126","author":"Mario Latendresse","site":"shroudstory"},{"title":"Ponderable for Today","post":"Hugh, you wrote: “Perhaps one of more of the other Quem Quaeritis shrouds “.\nNote: you used “other” implying that the Shroud of Turin was used in a Quem Quaeritis.\nHas it been shown that the Shroud of Turin was used in a Quem Quaeritis? Any reference?\nWe have references describing the Quem Quaeritis at Besançon used with a shroud, in the 16th century. Do we have the same for the Shroud of Turin in Lirey, Chambéry, Turin or any other places it was exposed to the public? Any reference?\n\n","date":"January 17, 2015 at 7:00 pm","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","id":"comment-184128","author":"Mario Latendresse","site":"shroudstory"},{"title":"Ponderable for Today","post":"No, I can’t agree with that, Mario. While I think my statement is true: “I don’t think anyone disputes that the Shroud is unique,” there are reasons to think that similar shrouds may have existed, or may still exist and may yet be rediscovered. There is no doubt, for instance, that at one time hundreds of Shrouds were exhibited as part of the Quem Quaeritis ceremony, none of which survive. Some of them may have appeared very similar. The fact that something is undisputed does not mean that it is true, still less that it is proved true.\n\n","date":"January 17, 2015 at 7:05 pm","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","id":"comment-184130","author":"Hugh Farey","site":"shroudstory"},{"title":"Ponderable for Today","post":"Sorry, Mario, we overlapped. If the Shroud is medieval, it must have been made for a purpose. The Quem Quaeritis ceremony is a possible candidate, a straight forged relic another. Either way, it may not have been unique. Charles Freeman suggested the former and several others the latter. Charles does not suppose that the Shroud was used as a stage prop after 1350, but that it may have been originally made to be used as one, and was re-employed as a genuine relic at a later time, or in a different place. I did not know that there were records of the Besançon shroud being used in a Quem Quaeritis, but I suppose it’s not unreasonable.\n\n","date":"January 17, 2015 at 7:13 pm","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","id":"comment-184131","author":"Hugh Farey","site":"shroudstory"},{"title":"Ponderable for Today","post":"The main point: there is not a bit of evidence that the Shroud of Turin was used in a Quem Quaeretis ceremony, before or after 1350. To state that it is not supposed that it was used as such after 1350 is dodging the subject entirely because the Shroud of Lirey was never recorded to be shown before 1350 in Lirey. \nThe most natural conclusion from the existence of the Quem Quaeretis ceremony, is that the Shroud of Lirey was not forged for it: many shrouds were created for such a ceremony, like the one in Besançon, but that was never recorded for the Shroud at Lirey. \nIn other words: The preponderance of documented evidence is that the Shroud of Lirey was not forged for such a ceremony, that is, the Quem Quaeretis ceremony itself promotes the Shroud of Lirey as not forged. \nDo you put aside all documented evidence and then start imagining all other kinds of possibilities leaving aside the most evident conclusion?\n\n","date":"January 17, 2015 at 10:49 pm","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","id":"comment-184172","author":"Mario Latendresse","site":"shroudstory"},{"title":"Ponderable for Today","post":"Yes, it is well recorded that the Shroud of Besançon was used in such a Quem Quaeretis ceremony, essentially a theatrical play. This is described at length in the manuscript Ms 826 of the Besançon archives, in its second dissertation. You can read a transcript (in French) online on Google books, see \nhttps://books.google.com/books?id=JecQAQAAIAAJ&pg=PA225&lpg=PA225&dq=bergier+dissertation+suaire+besan%C3%A7on&source=bl&ots=kzx2DxeuUD&sig=a0X7c7rIKF55aKpWWGZ34jr91Tk&hl=en&sa=X&ei=biu7VPKELYq4ggSRoYPYBg&ved=0CCsQ6AEwAQ#v=onepage&q=bergier%20dissertation%20suaire%20besan%C3%A7on&f=false\nand also see Dorothy Crispino, “Doubts Along the Doubs”, https://www.shroud.com/pdfs/ssi14part5.pdf, where she refers to Bergier’s dissertation and the Quem Quaeretis ceremony at Besançon.\nMoreover, what Charles is doing, from all appearances, is to take the story of the Besançon Shroud and applies it to the Shroud of Lirey. You have to read the full history of how the Besançon Shroud came to be to understand that point. But he misunderstands what the Shroud of Besançon looks like by claiming that its creator understood well how to create a “real Shroud” whereas its clear description by Bergier shows many errors, one of which is painting the side wound on the wrong side.\n\n","date":"January 17, 2015 at 11:03 pm","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","id":"comment-184175","author":"Mario Latendresse","site":"shroudstory"},{"title":"Ponderable for Today","post":"Many thanks for the references, Mario. I was unfamiliar with the first and had read in the past but forgotten the second. I think Dorothy puts to much credence in the ‘discovery’ in 1794, by French revolutionary iconoclasts, of a ‘stencil’ from which the Besançon shroud was apparently made some 200 years previously. I think she also misses the point about the credibility of relics. It was not “silly” to believe that the Besançon shroud was the genuine shroud even though it looked obviously like a painting; being miraculous, it could have looked like anything. The French revolutionaries did not have to show that it was a painting, they had to show that it was fabricated by a human, not a God, which is why they had to concoct their stencil. In exactly the same way, but with less success, Bishop d’Arcis did not have to demonstrate the Lirey Shroud did not look realistic, he only had to establish a human painter rather than a divine one!\n\n","date":"January 18, 2015 at 5:29 am","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","id":"comment-184245","author":"Hugh Farey","site":"shroudstory"},{"title":"Ponderable for Today","post":"Hi Hugh, I am not sure what you are trying to imply by “Dorothy puts to much credence in the ‘discovery’ in 1794” \nand in parallel \n“Bishop d’Arcis did not have to demonstrate the Lirey Shroud did not look realistic, he only had to establish a human painter rather than a divine one!”.\nIt appears that you are putting on the same footing the Shroud of Besançon and the Shroud of Lirey, that is, we could conclude that the Shroud of Lirey were a painting if we use the same reasoning as Dorothy Crispino used for the Shroud of Besançon.\nYet, Dorothy only covers part of the story. You really have to read the Bergier manuscript, and probably other documents. As far as I know, almost all historians have concluded that the Shroud of Besançon, as it was in the 18th century, was a painting. There are no doubts about it, whatever the Revolutionaries did (and I believe the stencil was really used in the 18th century). See also Palu Vignon and Dan Scavone.\nIn summary, we have plenty of documentations supporting that the Shroud of Besançon in the 18th century was painting, whereas it is not the case for the Shroud of Lirey.\n\n","date":"January 18, 2015 at 4:59 pm","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","id":"comment-184329","author":"Mario Latendresse","site":"shroudstory"},{"title":"Ponderable for Today","post":"I don’t really know how obvious either Shroud was in the 15th century. Illustrations of both look fairly dreadful, and Chifflet’s comparison between them in 1624 shows them looking much the same. The Lier copy at least suggests that he got the Turin Shroud wrong – perhaps he got the Besançon one wrong too. My own view is that the Turin Shroud was more ‘realistic’ than the Besançon one, but that was not really my point, which was that a relic did not have to look realistic to be accepted as genuine, it only had to have official sanction. Whether or not the revolutionaries really found a 200 year-old stencil, the fact that they said they had was sufficient to discredit the Besançon shroud which has been accepted as genuine by saints and pilgrims for two hundred years.\nI have read Bergier carefully, and am intrigued as to why he particularly wanted to discredit the Besançon shroud, but was not particularly interested in supporting or denying all the other shrouds he knew. He says the the Turin shroud better represents the sort of cloth that might wrap a dead body, but does’t go so far as to say he thinks it, or any of the others, genuine. My guess is that as an alumnus of the University of Besançon, the idolatry of his home town shroud was perhaps particularly irksome.\n\n","date":"January 18, 2015 at 6:49 pm","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","id":"comment-184346","author":"Hugh Farey","site":"shroudstory"},{"title":"Ponderable for Today","post":"Hugh, you wrote “15th century”, did you mean “16th century”? There is no clear documentation that states that there was a Shroud in Besançon in the 15th century.\nYou wrote “The Lier copy at least suggests that he got the Turin Shroud wrong – perhaps he got the Besançon one wrong too.” You used “he” twice in that sentence, but I can’t see who you are referring to with it. Chifflet? That can’t be since Chifflet has nothing to do with the Lier copy.\nJean-Jacques Chifflet (17th century) had direct access to the Shroud of Besançon but not the Shroud of Turin. So, he could describe precisely the Shroud of Besançon but not the Shroud of Turin. Bergier the same, he could describe precisely the Shroud of Besançon as one might assume that he could access it but does not appear to have access to the Shroud of Turin. Moreover, the first dissertation (not the one written by Bergier) of manuscript Ms 826 (17th century) describes in details the Shroud of Besançon and it appears as a painting as the image was seen on both sides of the cloth. Quite different to the Shroud of Turin. Bergier, if he really is the real author of the second dissertation of Ms 826, from all appearances did not have access to the Shroud of Turin and could not reliably evaluate its physical aspect and probably did not know what was claimed about its full history.  In any case, Bergier relies his arguments on earlier documentations and the story about the existence of a Shroud of Besançon prior to the 16th century which he shows could not be the case. On the other hand, his first “preuve” (proof) would also discredit the Shroud of Turin because he claims that the Jewish custom of the first century was to use only strips of linen to embalm the body. Whether or not this is true for all cases is hard to tell.\nOne interesting comment made by Bergier is the following: one long sheet would have been bought, then they (Nicodemus and Joseph)  would have tear it apart to make strips of linen to wrap the body. But one can see that this would have taken much time, and they were out of time to embalm Jesus, they probably give up after creating one strip, which we still see today on the Shroud of Turin.\nNote: the first and second dissertations of Ms 826 are not written by the same author(s) and probably more than 30 (perhaps up to 70) years separate their writing.\nIn summary, the story of the Besançon Shroud and the Shroud at Lirey are completely different. And this is based on many concrete documents we have today.\nAs for a Shroud being considered genuine based on authority, this was probably true for the past but this is no longer true for today or when you have access to all the information that we have today for the past relics.\n\n","date":"January 18, 2015 at 7:34 pm","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","id":"comment-184355","author":"Mario Latendresse","site":"shroudstory"},{"title":"Ponderable for Today","post":"In fact, we find in Bergier’s “Dictionnaire de Théologie” (Volume 7), that he didn’t believe any of the Shrouds were genuine. After a description of biblical events he says:\n“De lå on conclut que le corps de Jésus-Christ ne fut point enveloppé d’un linceul entier, mais seulement avec des bandelettes comme Lazare. ainsi les linceuls ou suaires que l’on montre dans plusieurs églises ne peuvent avoir servi à la sépulture du Sauveur, d’autant plus que le tissu de ces suaires est d’un ouvrage assez moderne.”\nAfter a description of the Quem Quaeritis ceremony, Bergier goes on to make exactly Charles Freeman’s point, that all these Shrouds were in fact theatrical props.\n“Au mot ‘sudarium’ on montroit au peuple un linceul empreint de la figure de Jésus-Christ enseveli. Ces linceuls ou suaires conservés dans les trésors des églises, pour qu’ils servissent toujours au même usage, ont été pris dans la suite pour des linges qui avoient servi à la sépulture de notre Sauveur; voilà pourquoi il s’en trouve dans plusieurs églises différentes, à Cologne, à Besançon, à Turin, à Brioude, etc.; et l’on s’est persuadé qu’ils avoient été apportés de la Palestine dans le temps des croisades.\n“Il ne s’ensuit point de là que ces suaires ne méritent aucun respect, ou que le culte qu’on leur rend est superstitieux. Ce sont d’anciennes image de Jésus-Christ enseveli, et il paroît certain que plus d’une fois Dieu a récompensé par des bienfaits la foi et la piété des fidèles qui honorent ces signes commémoratifs du mystère de notre rédempteur.”\nI can hardly refrain from recommending that Mario investigate Nicolas-Sylvestre Bergier rather more carefully that he has so far. He clearly thought, as long ago as 1790, exactly what Charles Freeman thinks today.\n\n","date":"January 18, 2015 at 7:15 pm","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","id":"comment-184350","author":"Hugh Farey","site":"shroudstory"},{"title":"Ponderable for Today","post":"Hugh, my posting just crossed yours. Sorry, I found ironic that you wrote \n“I can hardly refrain from recommending that Mario investigate Nicolas-Sylvestre Bergier rather more carefully that he has so far.”\nI believe I have read it much more carefully than you did.\nThe fundamental point that I believe you missed is that Chifflet and Bergier had full access to the Shroud of Besançon but not the Shroud of Turin. The description they give all look like a painting. Moreover, and that probably trumps almost all the discussion on the subject, the instigation of the creation of the Shroud of Besançon started in 1523 where it is stated that a shroud would be created for the theatrical play. The chapitre of Besançon wrote that. Did you read the description of the creation of the Shroud of Besançon in 1523? This is documented as an act of the church of Besançon. So, obviously, today, everybody agrees that the Shroud of Besançon in the 16th-18th centuries was a painting. Do you realize that this stated by all modern historians say and this is fully documented?\nAlso, there is no documentation that says that the Shroud of Lirey was ever used in a theatrical play. That must be stated very clearly, which Charles Freeman does not state clearly (just to confuse people I guess). That sets it apart in a major manner. You have to at least starts with the documents that exist.\nAs for Bergier stating that it must be strips of linen that must have been used, did you read the whole story? Bergier assumes that a whole cloth was bought, then strips of line were created from it *at the time of embalming*. Did the whole embalming of Jesus took place? No, so there is an error in his reasoning.\n\n","date":"January 18, 2015 at 7:55 pm","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","id":"comment-184360","author":"Mario Latendresse","site":"shroudstory"},{"title":"Ponderable for Today","post":"Sorry, Mario, I think I was confusing. I understand your point that Chifflet and Bergier had not seen the Shroud of Turin, and they may have assumed that it was as crude as the Shroud of Besançon, which in fact it was not. My mention of the Lier copy was to establish that the Shroud of Turin did not look like Chifflet’s depiction of it.\nHowever, it is clear that Bergier did not believe that any of the shrouds were genuine, and that they had all been manufactured for religious ceremonies. It is also notable that he recognises that shrouds used for this ceremony had the image of Christ on them. This is exactly Charles Freeman’s belief as well.\nI’m not sure how secure is Dorothy’s Crispino’s assertion that the Besançon shroud was actually created as a prop for the 1523 exposition. If you have a text for this it would be useful. She says that on “March 27, the chapter made a formal decision that ‘the shroud’ should be secured in a chest with three locks and three keys.” I find that strange, for a ‘theatrical prop.’ She goes on to say that “Paul de Gail sees in this event the recent acquisition by the church of what came to be called the Besançon shroud.” The word acquisition is significant. Acquired from where? From an artist’s studio? Or from some other source? Although it was clearly used in the Quem Quaeritis ceremony, it was obviously given some considerable veneration, possibly, as Dorothy guesses, because it had been touched to the true shroud elsewhere, or possibly because it was much older and had some more respectable provenance. Only ten years later (1535) we are told: “thirty thousand pilgrims came to the city of Doubs on the day of an exposition.” To leap from recently painted stage prop to authentic shroud of Christ in ten years is a remarkable feat of commercial marketing.\n\n","date":"January 19, 2015 at 3:04 am","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","id":"comment-184459","author":"Hugh Farey","site":"shroudstory"},{"title":"Ponderable for Today","post":"Andrea Nicolotti provided me with the Bergier extract and it was, of course, one piece of evidence I used in building up my case. There were hundreds of these clothes around originally, most of then produced locally I assume and many must have been replacements for earlier ones that had become worn out after centuries of service. ( Young traces  the ceremonies back to the 900s and some believe they started even earlier.)\nWe would be lucky indeed if we have the specific document that linked the Lirey Shroud to the Quem Queritis ceremony but the Lirey Pilgrim Badge with two clergy holding the Shroud in extenso in front an empty tomb is exactly the theatrical gesture that the ceremony required before the cloth was processed in ceremony to the High Altar on which it was laid before the beginning of the main Easter Mass. So that is why I have put it forward as a hypothesis only  – there  were other contexts in which painted cloths were put on the altar during Lent.\nPerhaps I have missed it but can Mario tell us which in this context is the ‘wrong’ side. The conventional side looking at a crucifixion is the right, if you are doing an imprint it would be on the left, as on the Lirey Shroud.\nBTW. I don’t understand why Mario talks of the Shroud being ‘forged’for the ceremony. It would have been a straightforward  commission – ‘we have got Easter coming up, the old grave cloth is pretty worn out, please paint us a new one – you can copy  the one they have  at Troyes ( or wherever) if you need to know how it should be done.’\n\n","date":"January 19, 2015 at 3:11 am","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","id":"comment-184464","author":"Charles Freeman","site":"shroudstory"},{"title":"Ponderable for Today","post":"Personally I don’t think the Shroud was originally made for the church at Lirey- its size suggests a substantial altar where it would be displayed after the Quem Queritis ceremony.\nA possible but undocumented scenario is that it was associated with some miracle and this gave it status. It may have been grabbed by Geoffrey as a prize of war ,of course, ( this is what his grand-daughter thought) while he was fighting the English in Northern France. We have to remember that,  until the Savoys got it, all attempts to present it as authentic had failed.\n\n","date":"January 19, 2015 at 3:27 am","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","id":"comment-184467","author":"Charles Freeman","site":"shroudstory"},{"title":"Ponderable for Today","post":"Yes. Bergier suggests that just because they weren’t genuine was no reason to treat them with disrespect.\n“Il paroît certain que plus d’une fois Dieu a récompensé par des bienfaits la foi et la piété des fidèles qui honorent ces signes commémoratifs.”\n\n","date":"January 19, 2015 at 5:27 am","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","id":"comment-184486","author":"Hugh Farey","site":"shroudstory"},{"title":"Ponderable for Today","post":"And I think the  Shroud should be treated with respect too. Something must have impelled Clement VII to give it spiritual status, its own indulgence, even though he did not believe in its authenticity. And,if I am right, historian of drama should also be interested to this sole survivor of what must have been many originals.\n\n","date":"January 19, 2015 at 6:07 am","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","id":"comment-184496","author":"Charles Freeman","site":"shroudstory"},{"title":"Ponderable for Today","post":"Creo que las generalizaciones son muy peligrosas.\nJuntar en un mismo paquete el “Quem Quaeritis” (un tropo cantado, en gregoriano generalmente) con sus derivados, “Dramas- sacros” y “Misterios” da lugar a confusiones. \nLa ceremonia descrita en ” Dissertation sur le Saint Suaire de Besançon” pertenece a los “MISTERIOS” (“Ce ne fut bientót qu´un spectacle frivole et de pure curiosité”, escribe Bergier).\nY falta justamente en esa ceremonia “teatral” el texto esencial que da el nombre al “Quem Quaeritis”:\n“Quem quaeritis in sepulchro, o Christicolae?\nJesum Nazarenum crucifixum, o caelicolae.\nNon est hic; surrexit, sicut praedixerat. Ite, nuntiate quia surrexit de sepulchro”\nEl texto que cita Bergier en el “Misterio” que describe es:\n“Dic nobis, María,quid vidisti in viá?\nSepulcrum Christi viventis et gloriam vidi resurgentis, angelicos testes, sudarium et vestes\nSurrexit Christus spes mea, etc”\n“Innocent III in 1210, if he did not condemn them altogether, condemned their abuse, her synods forbade priest holding “theatrical plays” in the church buildings.”\nHistory of the Christian Church, VolumeV: The middle Ages. A.D. 1049-1294. Philip Schaff.\nAsí que es MUY DUDOSO que la Sábana de Besançon fuera alguna vez utilizada en el “Drama-litúrgico”, en el “Drama-sacro” o en los “Misterios” y MUY PROBABLE que fuera utilizada SOLAMENTE para las ostensiones, según la iconografía que de ella tenemos con la presencia de clérigos.\nCarlos\n\n","date":"January 19, 2015 at 7:28 am","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","id":"comment-184510","author":"Carlos","site":"shroudstory"},{"title":"Ponderable for Today","post":"That’s interesting, Carlos. So what do we make of the Chapter of St Etienne, who sent a special emmissary to find out how to put on an Easter performance, in conjunction with their newly acquired shroud, which was to kept in a triple-locked box?\n\n","date":"January 19, 2015 at 8:12 am","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","id":"comment-184515","author":"Hugh Farey","site":"shroudstory"},{"title":"Ponderable for Today","post":"Hugh:\nEstá muy claro que fueron OSTENSIONES las que se realizaron en Saint-Etienne.\n“Encore un coup telle fut la première ostention de notre saint suaire. Elle attiroit pourtant les regards du peuple qui aime naturellement les représentations, et celle-ci excitoit tellement sa dévotion qu´on dit que l´église de Saint-Etienne se trouva par la suite trop étroite pour le tout contenir.\nCependant cette repréentation fut supprimée par la suite. Cést même quelques-uns disent que le saint suaire a été quelque temps inconnu, et ce ne fut que pour suppléer à cette cérémonie et pour satisfaire à la dévotion des peuples, qu´en l´an 1522 on bâtit prés de légise Saint-Etienne une estrade de bois, d´oú on le montroit seulement le jour de Pâques. Et l´an 1549, e chaitre assemblé fit un nouveau réglement pour le montrer encore le dimanche dans l´octave de l´Ascensionn. Cést tout ce qui est resté dès-lors de la représentation de Pâques.” Bergier\nCarlos\n\n","date":"January 19, 2015 at 11:43 am","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","id":"comment-184558","author":"Carlos","site":"shroudstory"},{"title":"Ponderable for Today","post":"Hugh, Charles, I can see that the discussion is getting complex and chaotic and that you have not read the relevant references. I do not say that to end this discussion abruptly but to point out that this is getting out of the capacity of comments in a blog and these documents have to be entirely read to pick up all the nuances. \n1) May I point out that Bergier does not put too much attention to the Shroud of Turin among many others. We can read in his dissertation: \n“Que tous ces saints suaires et d’autres encore soient authentiques ou non, peu m’importe. Je me borne ici à examiner celui de Besançon et je soutiens que l’empreinte qu’il porte est une marque évidente de sa fausseté, parce qu’elle est incroyable en elle-même et impossible.”\nBergier at this point does not even argue for authenticity or not of the Shroud of Turin. This is not of is concern. Moreover, again, he probably based most of his comments about the Shroud of Besançon on Chifflet’s description. So Chifflet should also be consulted for a description of the Shroud of Besançon. And the first dissertation of the MS 826 manuscript should also be read for such a description where its author clearly appears to have accessed to analyze and make many measurements on the Shroud of Besançon.\n2) Charles, the side wound was painted on the wrong side on the Shroud of Besançon because the image was painted more prominently on one face of the cloth (yes, the image appeared on the recto and verso of the cloth as the paint went through the cloth (no gesso here!)), and on that face the side wound is on the wrong side. Besides, the very fact that the image appears recto and verso just points out to a painting. You have to read Chifflet (French), and Paul Vignon if you want to read an English text, but Vignon quotes Chifflet. \n3) Charles, if the only reference is the badge of Lirey found in the seine to support the performance of a theatrical play at Lirey using the Shroud of Turin, this is not much. The documents does not point out to such a play but at a solemn display of the Shroud at Lirey. That trumps that reasoning of a play.\n\n","date":"January 19, 2015 at 12:18 pm","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","id":"comment-184565","author":"Mario Latendresse","site":"shroudstory"},{"title":"Ponderable for Today","post":"  “… if the only reference is the badge of Lirey found in the Seine to support the performance of a theatrical play at Lirey using the Shroud of Turin, this is not much. The documents does not point out to such a play but at a solemn display of the Shroud at Lirey. That trumps that reasoning of a play.”\nThank you Mario. Yes Indeed. Spot on in fact. The notion of building a small church, albeit humble,  in an out-of-the-way village purely to house a visual aid for a once-a-year Easter ceremony makes no sense whatsoever. The sensible conclusion surely is that Lirey was intended to be a site of year-round pilgrimage to see a highly-realistic and credible-looking holy icon, or as some preferred to think, relic. Why else produce a packed-with-detail pilgrim’s badge (or badges, if one includes the Machy mould for a second) with the de Charnys’ coats of arms for added stamp of authority? The Shroud was intended to be seen as something unique, something to be celebrated far and wide, which is how it is regarded now, and was almost certainly then too.\nThat local bishop at Troyes would not have gone firing off letters  if the Shroud had been seen an unremarkable theatrical prop, especially if had been an obviously painted linen in pristine condition, lacking that undefinable ‘ghostly’ quality.\n\n","date":"January 19, 2015 at 1:32 pm","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","id":"comment-184575","author":"Colin Berry","site":"shroudstory"},{"title":"Ponderable for Today","post":"Colin, the Quem Queritis ceremony was one ritual within the whole annual circuit of liturgies- it was something many churches did and, as all of them involved having grave clothes with a makeshift tomb ,they would all have had their own grave clothes as these formed a central part of the liturgy (  an ostension of the grave clothes in front of  the tomb, procession to the high Altar, laying on altar, etc.\n However, the Turin Shroud appears to have been larger than a small church like Lirey would need and so this suggests it was brought in from somewhere else. Furta sacra, holy thefts were quite common, there is a whole book on them of that name by the historian Patrick Geary- and this might well have been one , taken or looted by Geoffrey in the chaotic fighting in which he was involved in Northern France with the English and in which he lost his life.\nI suspect that in his absence it was Jeanne who had a go at saying it was the real thing but the Church very quickly squashed that one while accepting( Clement VII) that it did have some spiritual status. Perhaps it already had a reputation for bringing miracles which is why Geoffrey got it for his new family chapel.\n\n","date":"January 19, 2015 at 5:33 pm","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","id":"comment-184618","author":"Charles Freeman","site":"shroudstory"},{"title":"Ponderable for Today","post":"No, no, Mario, don’t give up; keep teaching us! I am so grateful to your providing these references, and I agree with most of your interpretation, that Bergier knew a lot about the Besançon shroud but less about the Turin one. I merely pointed out that he thought all the shrouds were fakes. Other authors of the same time think all the Shrouds are genuine and tie themselves in knots trying to reconcile them with the gospels.\nAnd OK, although your quoting is a little overselective, you have hit upon an elegant middle path between pure theatre and pure devotion. Bergier definitely considers that ‘notre suaire’ was originally nothing more than a theatrical prop, but seems to suggest that it grew in sanctity even while still being used as such.  A few sentences before your quotation, we hear that during the course of the ‘victimae paschale laudes’, “tout ce dialogue étoit accompagné de signes de la main; à ‘sepulchrum’ et à ‘Angelicos testes’, elles montroient les anges et l’autel, et quand on disoit ‘sudarium’ on développoit le saint suaire, et telle fut la première ostentation.” Later on, the ceremony faded away, and only the ostentation remained.\n\n","date":"January 19, 2015 at 3:32 pm","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","id":"comment-184594","author":"Hugh Farey","site":"shroudstory"},{"title":"Ponderable for Today","post":"The Quem Queritis ceremony was a standard Easter ceremony. You should read Young on it. He had documented evidence for it in four hundred churches and monasteries mostly in Germany. So it would have been quite usual to find it and it was intrinsic to the ceremony to bring out and display grave clothes some of which had painted images on them. The liturgy describes Peter and John, dressed as priests, going into the tomb, taking out the clothes and holding them in extenso in front of the tomb before processing up to the main altar where the cloth is laid before the Easter Mass begins. The Lirey Badge appears to show just this, two clergy, the Shroud in extenso , the empty tomb. So can you provide a better explanation?\nAs Young makes clear, see my earlier quote, there were lots of these cloths around. So mine is a reasonable hypothesis.\nAs suggested earlier, the Shroud seems to have been made for a larger audience and altar than seems to have been the case at Lirey. Yet Clement seems to have known of some event associated with the Shroud that made it worthy of an indulgence even though he was certain it was not authentic. These cases usually involve a miracle or two.\nIt is possible that Geoffrey’s grand daughter was right that it was a spoil of war and taken from a larger  church where G. was fighting the English but the Lirey Pilgrim Badge suggests that its original purpose had not been forgotten. Certainly the nature of these clothes would have been common knowledge then – I am sure Young would only have tracked down a small\nproportion of the original ceremonies- even  if we have forgotten the QQ ceremony today .\n\n","date":"January 19, 2015 at 4:56 pm","url":"https://shroudstory.com/2015/01/17/ponderable-for-today/","cat":"news_&_views","id":"comment-184608","author":"Charles Freeman","site":"shroudstory"}]
