[{"title":"Pope Benedict XVI to Resign February 28","post":"The real issue for this blog is who will be the new “owner” of the Shroud.\n\n","date":"February 11, 2013 at 9:27 am","url":"https://shroudstory.com/2013/02/11/pope-benedict-xvi-to-resign-february-28/","cat":"news_&_views","id":"comment-23973","author":"John Klotz","site":"shroudstory"},{"title":"Pope Benedict XVI to Resign February 28","post":"I would be very surprise if the Shroud would be on the top-10 list of priorities of the new pope (which I hope will bring a bit of fresh air to the Vatican).  You can bet your house that this newcommer will have much more important things to fix and to reflect upon than to think about the Shroud of Turin. Also, let’s not forget that the next public exhibition of the Shroud is only planned for 2025 and I would be very surprise if a new series of direct test on the cloth would be allowed before that time.  While we wait for this day to come, I think the first intelligent step for the Church would be to put together an international team of credible and UNBIASED imagery experts in order to analyse properly the high-resolution photos that were taken in 2000 and 2002 and publish a scientific report on that…\n\n","date":"February 11, 2013 at 11:44 am","url":"https://shroudstory.com/2013/02/11/pope-benedict-xvi-to-resign-february-28/","cat":"news_&_views","id":"comment-23981","author":"Yannick Clément","site":"shroudstory"},{"title":"Pope Benedict XVI to Resign February 28","post":"Most probably, they have already done so.\n\n","date":"February 11, 2013 at 1:30 pm","url":"https://shroudstory.com/2013/02/11/pope-benedict-xvi-to-resign-february-28/","cat":"news_&_views","id":"comment-23988","author":"Gabriel","site":"shroudstory"},{"title":"Pope Benedict XVI to Resign February 28","post":"If they have done so as you said Gabriel, then why they never publish it anywhere?  I seriously doubt your assumption here.  The official answer of Turin is that all these data have been locked inside a safe and are waiting for the approval of the Vatican to allow some scientific study of it.  Right now, I have no reason to doubt that official version.\n\n","date":"February 11, 2013 at 2:01 pm","url":"https://shroudstory.com/2013/02/11/pope-benedict-xvi-to-resign-february-28/","cat":"news_&_views","id":"comment-23991","author":"Yannick Clément","site":"shroudstory"},{"title":"Pope Benedict XVI to Resign February 28","post":"Since Linus (67-78 CE) was the first pope after Peter/Kêpha as the representative of Yeshu’a on earth, I suggest the next pope would be called Linus/Lino/Linen II so that hopefully, scientific, archaeological and historical research on the Turin Shroud as Yeshu’a’s most likely  burial linen cloth could be promoted, the HAL9000 microphotographs finally released for study and… Dan’s wishes regarding the relic and the new pope fulfilled ;-)\n\n","date":"February 13, 2013 at 3:44 pm","url":"https://shroudstory.com/2013/02/11/pope-benedict-xvi-to-resign-february-28/","cat":"news_&_views","id":"comment-24166","author":"Max Patrick Hamon","site":"shroudstory"}]
