[{"title":"Pope Francis: We encounter the Living God through His wounds","post":"There was a report that Francis was going to issue a statement originally authored by Benedict. I am no unalloyed fan of Benedict, but I wonder if a reference to the Shroud may have been excised.\nHowever, the bottom line in this: The Shtoud is a “silent witness” to what “they” are writing about (if one supposes joint authorship). Dealing with the  authenticity if the Shroud is per force greatly elevated. My thought that it is an inexplicable act of providence. The truth revealed by the Shroud has been hiding in plain sight for two millenia. It has taken the advances of science to reveal it as  truth.\n\n","date":"July 4, 2013 at 6:41 am","url":"https://shroudstory.com/2013/07/04/pope-francis-we-encounter-the-living-god-through-his-wounds/","cat":"uncategorized","id":"comment-38604","author":"John Klotz","site":"shroudstory"},{"title":"Pope Francis: We encounter the Living God through His wounds","post":"i’m a huge fan of benedict….but i’m pretty conservative\npeople talk about pope francis andh is humility…..think benedict showed even more when he\nstepped down\n\n","date":"July 5, 2013 at 11:15 pm","url":"https://shroudstory.com/2013/07/04/pope-francis-we-encounter-the-living-god-through-his-wounds/","cat":"uncategorized","id":"comment-38649","author":"rick","site":"shroudstory"},{"title":"Pope Francis: We encounter the Living God through His wounds","post":"I have for many years considered that the heart of the Christian message is contained in the text of Matthew 25:31-46, although the other evangelists don’t seem to make it quite so explicit. It paints the scene of the Last Judgment when the Son of Man comes in his glory, escorted by all the angels, and separates the sheep from the goats. The essential criterion are the corporal works of mercy: “Come … For I was hungry and you gave me food; I was thirsty and you gave me drink; (etc)”.  This seems to be the main theme of the present sermon of Pope Francis.  He associates it with putting your hands into the wounds of Christ, maybe “getting your hands dirty” would be an Anglophile way of expressing it.  It is also significant I think that this text immediately precedes the Passion narrative, when Christ incurs those wounds. \nComing from Pope Francis with his South American background it is a refreshing re-emphasis of the core of this Christian message. The Latin population expressions of religion have often in the past seem to have been marked by extreme mortifications, such as the Lenten flagellations and personal self crucifixions, seen in these countries. Meditation and other expressions of personal piety has also, I think, tended to have been over-emphasised, at the expense of this reaching out to those with real suffering. Yes, fasting, prayer, penance and meditation all have their place, but need not be taken to such extremes that they displace the real caring and reaching out on which we will be finally judged. Such works as those of Mother Theresa of Calcutta, the work of the St Vincent de Paul Society, founded by Blessed Frederick Ozanam, and the personal or institutional efforts of many Christians, such as nursing, missionary charity, prison chaplaincy, are various ways in which this message can be realised.\n\n","date":"July 4, 2013 at 6:13 pm","url":"https://shroudstory.com/2013/07/04/pope-francis-we-encounter-the-living-god-through-his-wounds/","cat":"uncategorized","id":"comment-38614","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Pope Francis: We encounter the Living God through His wounds","post":"huh?….i’m not sure that a small subset of catholics in latin America, who may do what you consider  “extreme” reflects the church there; no more that snake handlers reflect the  non-Catholic christian population in the southern part of the u.s\nPopes have been teaching what francis has been saying for years….besides the children of FATIMA practices some of these devotions as well….\n\n","date":"July 5, 2013 at 11:12 pm","url":"https://shroudstory.com/2013/07/04/pope-francis-we-encounter-the-living-god-through-his-wounds/","cat":"uncategorized","id":"comment-38648","author":"rick","site":"shroudstory"},{"title":"Pope Francis: We encounter the Living God through His wounds","post":"It is possible that Pope Francis I also thought about the Shroud when he uttered those words. As Archbishop of Buenos Aires he visited the slums every day to help the needy there, cooked his own food and the bus and tube were his means of transport. That is why Archbishop Justin Welby, Primate of the Church of England, referred to the pope’s “extraordinary humanity” after their first meeting. This approach will mark his pontificate, leading the faithful to understand how the primitive Christians lived and how there should be an inner transformation.\n\n","date":"July 4, 2013 at 8:17 pm","url":"https://shroudstory.com/2013/07/04/pope-francis-we-encounter-the-living-god-through-his-wounds/","cat":"uncategorized","id":"comment-38617","author":"Louis","site":"shroudstory"},{"title":"Pope Francis: We encounter the Living God through His wounds","post":"think the last several popes where very humble…..jean paul probably didn’t bet much press for it since he was busy bringing down communisim in the soviet untion (as our lady of Fatima used him as that instrument)\n\n","date":"July 5, 2013 at 11:18 pm","url":"https://shroudstory.com/2013/07/04/pope-francis-we-encounter-the-living-god-through-his-wounds/","cat":"uncategorized","id":"comment-38650","author":"rick","site":"shroudstory"},{"title":"Pope Francis: We encounter the Living God through His wounds","post":"John Paul II and Benedict XVI came from Europe, where the gap between the rich and the poor was not as big as it is in South America, so they probably left this part of Church activity to the appropriate organs, aware, of course, of the kind of charity being done.\nWho brought the question to the limelight was the Peruvian priest Father Gustavo Gutiérrez, also influencing Lutherans and Anglicans in the process. Remember Anglican Father Tim Jones, who roughly did the same thing not long ago, and in the “Spirit of Christ”? Since Francis I lived in the reality of South America he has a more realistic view of what the Church should be like,much more than superficial church attendance, get-togethers with coffee as though participating in club activity and so on…\n\n","date":"July 6, 2013 at 12:47 pm","url":"https://shroudstory.com/2013/07/04/pope-francis-we-encounter-the-living-god-through-his-wounds/","cat":"uncategorized","id":"comment-38660","author":"Louis","site":"shroudstory"},{"title":"Pope Francis: We encounter the Living God through His wounds","post":"Rick’s comments are I think somewhat naive. Historically, the churches’ position on a social option for the poor and oppressed has been uneven. It has ranged from an outlook that has promoted a philosophy of passive Christian patience, forbearance and acceptance of one’s lot to the then somewhat radical but essentially conservative social teaching of Pope Leo XIII, sometimes described as the Catholic Church’s “best kept secret”.  \nThe Industrial Revolution of the 19th century led to the gross exploitation of the working classes, not only male workers but women and children as well, at the behest of capitalist profit. There have always been extreme right wing regimes oppressing the poor for similar reasons.  These factors inevitably led to the teachings of Karl Marx who saw Religion as the opiate of the poor, their only available refuge. The response of the churches to these conditions has often seemed ambiguous.\nThe Liberation Theology of the late 20th century as one solution to these problems was often condemned. In South America some Catholic churchmen joined underground revolutionary movements and took up arms to fight against reactionary government forces, fifty Bolivian priests openly espoused armed revolution, and a group of Maryknoll priests and nuns assisted Guatemalan guerrillas. There is a diversity of theological commitment, but also a unity of shared concerns and theological perspectives. \nAn excellent essay on the topic by Ernest Wallwork can be found in the textbook “Critical Issues in Modern Religion” – ‘Christians in the Revolution of the Oppressed’. \nThe extreme religious escapism evident in Filipino flagellations and self-crucifixions, and by similar devotional excesses elsewhere I do not see as a minority practice such as the snake handlers of some southern USA groups, but as a more general outlet of religious expression and social frustration. \nI see the sermon of Pope Francis as a signal, and hopefully heralding a repositioning and coming of age of a theology and option for the poor and oppressed.\n\n","date":"July 6, 2013 at 5:25 pm","url":"https://shroudstory.com/2013/07/04/pope-francis-we-encounter-the-living-god-through-his-wounds/","cat":"uncategorized","id":"comment-38668","author":"daveb of wellington nz","site":"shroudstory"}]
