[{"title":"Pope Francis’s visit to an ancient basilica in Rome","post":"I’ll cheer tomorrow, maybe, or maybe, I’ll cry.\nIt’s impossible for me not to be dubious about a man who champions the poor, but opposes contraception for the poor.  Genesis gives us dominion of the world but we have reached a point where the pressure of increasing population is feeding the degradation of our dominion.\nIn Tacitus, a British chieftain denounces the Romans: “They have made a desert and called it peace.” (some translate desert as solitude) We are literally creating deserts now and the result will not be peaceful.\nIt will be interesting to see how this works out in the United States. Will Pope Francis  honor the “Nuns on the Bus.” Will he rebuke the President of the United States for supporting contraceptive services in Obamacare? Will he call down fire from heaven on those Catholic politicians who support same sex marriage?\nThe politicians in this country who support the Church’s positions on contraception and abortion are are usually the ones most at war with the poor. There are some exceptions. Bob Casey, for example, who are not. But practically speaking, in this diverse nation, the consensus seems very strong with the social liberals. \nI think the first real test will be the nuns. Will the inquisition of the social justice nuns continue. Will the pressure to have them don medieval habits and return to the classroom continue?\nStay tuned.\n\n","date":"March 14, 2013 at 7:31 am","url":"https://shroudstory.com/2013/03/14/pope-franciss-visit-to-an-ancient-basilica-in-rome/","cat":"news_&_views","id":"comment-27283","author":"John Klotz","site":"shroudstory"},{"title":"Pope Francis’s visit to an ancient basilica in Rome","post":"Francis I has made a good start as Bishop of Rome and should set an example for clergy around the world. At this rate his pontificate will be appreciated, in England for example, where Catholic politicians keep Church doctrine in mind, an approach that could not be more different from those of most US Catholic politicians whose Catholicism can be questioned.\n\n","date":"March 14, 2013 at 8:19 am","url":"https://shroudstory.com/2013/03/14/pope-franciss-visit-to-an-ancient-basilica-in-rome/","cat":"news_&_views","id":"comment-27286","author":"Louis","site":"shroudstory"}]
