[{"title":"Posting For a Slow News Day","post":"Dan I wish you had discussed falsely NEGATIVE optical illusions in terms of embedded informations and datas, which you haven’t (or cannot?). Reminder: an optical illusion is not ipso facto a false POSITIVE (I think I see what is not really there), it can be a false NEGATIVE too (I think I don’t see A CAT that is really there).\n\n","date":"July 28, 2015 at 5:24 am","url":"https://shroudstory.com/2015/07/28/posting-for-a-slow-news-day/","cat":"uncategorized","id":"comment-206739","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Posting For a Slow News Day","post":"Write a guest posting.  \n\n","date":"July 28, 2015 at 6:21 am","url":"https://shroudstory.com/2015/07/28/posting-for-a-slow-news-day/","cat":"uncategorized","id":"comment-206746","author":"Dan","site":"shroudstory"},{"title":"Posting For a Slow News Day","post":"Does that include cat-fish?  As it’s Slow News day, I trust the summer fishing is OK in South Carolina, but if it’s trout you’re after, check out our Lake Taupo in the middle of the North Island.  I see it’s just 11 deg C in Johannesburg, about the average sort of temperature we see in Invercargill in our extreme south, although Wellington has dropped below that over the last month of our mid-winter.  \nNeels Blom has an amusing style of writing, but I guess you’d need to be South African to pick up the satire,  Jacob Zuma in the detritus of an ash-tray?  Well, that’s a variation from the pictures one sees in toast.  There’s a story about an Irish-man whose toast landed butter-side up on the floor.  Even when the bishop called the Vatican, they couldn’t declare it a miracle, as quite likely he’d buttered it on the wrong side.  Slow news, indeed!\n\n","date":"July 28, 2015 at 5:54 am","url":"https://shroudstory.com/2015/07/28/posting-for-a-slow-news-day/","cat":"uncategorized","id":"comment-206742","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Posting For a Slow News Day","post":"Slow news day? Not on my site…  Were you aware that STURP’s Robert Bucklin MD, consultant pathologist, was in fact doing his virtual biopsy a year before STURP’s trip to Turin (which Bucklin may or may not have joined, depending on whose account one believes), so was NOT done on the “Shroud” itself but on PHOTOGRAPHS. What’s more, the photographs used were long-in-the-tooth 1931 Enrie negatives, as this video still from David Rolfe’s “Silent Witness” shows, made in 1977 (released in 78) a year before STURP.\n\nHow many people reading Bucklin’s autopsy would realize it was NOT based on the “Shroud” itself, seen in natural colour with his own eyes, but a B/W negative on which he claims to see “wounds” etc and much else besides? One suspects that Bucklin’s “autopsy report for STURP was written well before the STURP descent on Turin, so could not have benefited from the new photography done by Barrie Schwortz, Mark Evans and other documenting photographers, far less the far superior imagery we now have from Durante (2002) on Shroud Scope. \nGiven the autopsy relied entirely on ancient photographs, why was ‘true-believer’ Bucklin(his own admission) selected as officlal STURP pathologist? Why weren’t the same photographs sent to other pathologists for their opinion?  The more I learn about STURP and its largely self-selected  personnel, the less I like.\n\n","date":"July 28, 2015 at 6:14 am","url":"https://shroudstory.com/2015/07/28/posting-for-a-slow-news-day/","cat":"uncategorized","id":"comment-206745","author":"Colin Berry","site":"shroudstory"},{"title":"Posting For a Slow News Day","post":"Always with the negative waves, Moriarity….","date":"July 28, 2015 at 7:04 am","url":"https://shroudstory.com/2015/07/28/posting-for-a-slow-news-day/","cat":"uncategorized","id":"comment-206751","author":"Nabber","site":"shroudstory"},{"title":"Posting For a Slow News Day","post":"Actually, until proven otherwise, in the late 70s and early 1980s CE, Bucklin based his TS man’s autopsies from both Enrie’s and Miller’s life sized negative and positive photographs + VP8 image analyser 3D  reconstructions (see Bucklin, Robert, M.D., J.D. “The Shroud of Turin: A Pathologist’s Viewpoint.” Legal Medicine Annual, 1981).\n\n","date":"July 28, 2015 at 7:01 am","url":"https://shroudstory.com/2015/07/28/posting-for-a-slow-news-day/","cat":"uncategorized","id":"comment-206750","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Posting For a Slow News Day","post":"Thanks for posting this video Colin. Even worse than I had expected.\n\n","date":"July 28, 2015 at 9:28 am","url":"https://shroudstory.com/2015/07/28/posting-for-a-slow-news-day/","cat":"uncategorized","id":"comment-206767","author":"PHPL","site":"shroudstory"},{"title":"Posting For a Slow News Day","post":"How one can take seriously a “mise-en-scène” autopsy for the real thing? Bucklin never studied the TS man’s double bloodied body imprint just for the time of a 10 minutes’ film sequence! Are PHPL and CB really that naive? Bucklin wrote a research paper on 1981, i.e. three years after the 1978 STURP expedition. Shall I repeat, until proven otherwise, in the late 70s and early 1980s CE, Bucklin based his TS man’s autopsies from both Enrie’s and Miller’s life sized negative and positive photographs + VP8 image analyser 3D reconstructions.\n\n","date":"July 28, 2015 at 11:29 am","url":"https://shroudstory.com/2015/07/28/posting-for-a-slow-news-day/","cat":"uncategorized","id":"comment-206782","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Posting For a Slow News Day","post":"“The imprint on the burial cloth represents the body of an adult male, 71 inches in height\nand weighing an estimated 160 to 170 pounds.”\n“Height is estimated at between 5 ft. 9 in. and 5 ft. 11 in. (175-180 cm), weight at 165-180 lb. (75-81 kg), and age at 30 to 45 years.”\n“Lorenzo Ferri, for example, reported that the body image was 186cm (74 inches); Father Peter Wayland estimated the height to be 71.4 inches when he measured the French Commission enlargements [but his print was 3.5 inches shorter than the real thing which] would afford a height of 72.5 inches.”\n“An anatomist, Dr Luigi Gedda, arrived at a measurement of 72 inches during the private exposition of the Shroud at Montevirgine in 1946. Both Dr Giovanni Judica-Cordiglia estimated the height of the man in the Shroud to be 70 inches.”\n“The height of the Man, 174 ± 2 cm, was therefore measured with different techniques and the\nresults obtained were compared with the anthropometric indices derived from bibliography.”\n“I determined the height to be 5’11½” to 6’1″, give or take 1″ for linen stretch and shrinking, both of which are possible.”\nSo, that’s: 180.3, 175-180, 186, 184.1, 182.9, 177.8, 172-176, 181.6-185.4 (± 2.5), and a range of 14cm.\nExperts, that’s who I trust!\n\n","date":"July 28, 2015 at 9:36 am","url":"https://shroudstory.com/2015/07/28/posting-for-a-slow-news-day/","cat":"uncategorized","id":"comment-206770","author":"Hugh Farey","site":"shroudstory"},{"title":"Posting For a Slow News Day","post":"Mean value of the various heights that Hugh lists is 180.50 cm, standard deviation of 4.26 cm, a variation of 2.36%.  The variations might be explained by changes in the length of the cloth as a result of unrolling and re-rolling, together with small errors in photo enlargement, and individual variations in photo processing.  Possibly a more significant cause could well be the effect of the bent knees of the TSM, with its impact on height estimates, either over- or under-estimating the effect, or possibly even a failure to recognise the effect. \nFor an appreciation of this effect, check out the bronze statue by sculptor Luigi Mattei.  Google on “Luigi Mattei bronze statue shroud”, check ‘Images’ .  Several of his other works can also be seen, but included in the images are several photos of his statue based on his geometrical studies of the Shroud, also the VP-8 imagery, all from different viewing angles.\n\n","date":"July 28, 2015 at 5:11 pm","url":"https://shroudstory.com/2015/07/28/posting-for-a-slow-news-day/","cat":"uncategorized","id":"comment-206801","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Posting For a Slow News Day","post":"I want to underline something about Carl Sagan\n(a phrase written by him, taken as a sort of\nan “Ipse dixit”…) and the Shroud …\n>Carl Sagan suggested pareidolia is not a psychosis\nbut an innate human tendency necessary for survival.\n>In The Demon-Haunted World, he wrote: “As soon as\nthe infant can see, it recognises faces, and we now know\nthat this skill is hardwired in our brains. … etc. … etc. …\nSource:\n“ON THE WATER: Beware the face of the man in the ashtray\nby Neels Blom, July 27, 2015, 06:30”\nLink:\nhttp://www.bdlive.co.za/opinion/columnists/2015/07/27/on-the-water-beware-the-face-of-the-man-in-the-ashtray\n— —\n>…As an example, he recounts an encounter he had with a cab driver in which the driver asserted a belief in a variety of somewhat silly ideas: frozen extraterrestrials, channeling, Nostradamus’s prophecies, astrology, the Shroud of Turin, and so on. In each case Sagan had to point out that the driver’s belief was almost certainly misplaced, primarily because the evidence supporting those beliefs was lacking. …\nLink:\nhttp://dreamingaboutotherworlds.blogspot.it/2012/08/review-demon-haunted-world-science-as_5784.html\nIpse dixit.\n>Ipse dixit, Latin for “he himself said it”, is a term used to identify and describe a sort of arbitrary dogmatic statement, which the speaker expects the listener to accept as valid.\n>The fallacy of defending a proposition by baldly asserting that it is “just how it is” distorts the argument by opting out of it entirely: the claimant declares an issue to be intrinsic, and not changeable. …\nLink:\nhttps://en.wikipedia.org/wiki/Ipse_dixit\n— —\nSo, in my opinion, in “The Demon-Haunted World”,\nSagan simply wrote a false statement about the Shroud…\nThen, we still have to check the truth, another time\n(using the adequate instruments and\navoiding destructive approaches!).\n— —\nAt the end… I suggest you to read Paul Grice\n(= philosophical logic, divergences and conversation…).\nLink:\nhttp://www.ucl.ac.uk/ls/studypacks/Grice-Logic.pd\n\n","date":"July 28, 2015 at 10:43 am","url":"https://shroudstory.com/2015/07/28/posting-for-a-slow-news-day/","cat":"uncategorized","id":"comment-206778","author":"piero","site":"shroudstory"},{"title":"Posting For a Slow News Day","post":"When it comes to the height of the TS man recorded on a 3:1 herringbone twill linen planar surface and estimated on different displays, points in time and techniques, it is not at all surprising it can vary from 174cm-182cm in average depending on the real field of expertise of each expert. This the main disagreement as far as medical forensic is concerned.\n  Don’t archsceptics make too much of it to misleadingly dismiss all the anatomo-pathological datas that tell out the shroud wrap a real corpse/body, most likely of a crucifixion victim who was severely flogged, crowned with ferocious thorns, nailed, sidewounded. \nReminder: in less than 3,5 years CB –who repeatedly claims to be an expert in biochemistry and chemistry– have had several most contradictory theories to account for the TS image and each time it was a scientific and archeaological dead-end not to say total flop (no bloodstain recorded at all, very remotely reminiscent object/body imprints). Most curiously, CB is Hugh’s main expert for TS image formation process!\n\n","date":"July 28, 2015 at 10:44 am","url":"https://shroudstory.com/2015/07/28/posting-for-a-slow-news-day/","cat":"uncategorized","id":"comment-206779","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Posting For a Slow News Day","post":"Max:\nY luego leemos que las imágenes obtenidas por Nickel, Garlaschelli, etc,etc, son CASI INDISTINGUIBLES  de las de la Sabana Santa.\n¿Pareidolia o “empanada mental”?\nCarlos\n\n","date":"July 28, 2015 at 2:31 pm","url":"https://shroudstory.com/2015/07/28/posting-for-a-slow-news-day/","cat":"uncategorized","id":"comment-206795","author":"Carlos","site":"shroudstory"}]
