[{"title":"Pounding the square peg into the round hole","post":"It’s not clear from his statement whether Al is a scientist or not, but the trouble with most of us (I consider myself one) is that, by relying on evidence, there is practically nothing that we can be sure of. While this is highly commendable in theory, it can be extremely frustrating to non scientists, who are certain of practically everything, and is an almost unworkable position in everyday life. (Shall I eat this egg? It may be infected with salmonella! Or maybe not. But I can’t be sure!) For the sake of an easy life, we make little ‘leaps of faith’ every minute of every day, tipping the balance of evidence firmly down one side or the other depending on the weight we see piled on each side (It’s probably not infected. I’ll eat it). At present, Dan and I, and many of the scientists on this and other sites, are all acquainted with all the evidence about the shroud, and in truth, would all agree with Dan’s statement: “We simply do not have enough reliable information to arrive at a scientifically rigorous conclusion.” However, we ascribe different weights to each piece of evidence, and when pushed, plump for one side or the other, and sometimes hope to persuade our fellows to change their minds about the value of one bit of evidence or another, so that their ‘little leap of faith’ changes too. But really we wander through the world in complete uncertainty….\n\n","date":"June 10, 2013 at 8:22 am","url":"https://shroudstory.com/2013/06/10/pounding-the-square-peg-into-the-round-hole/","cat":"news_&_views","id":"comment-36614","author":"Hugh Farey","site":"shroudstory"},{"title":"Pounding the square peg into the round hole","post":"It also depends on the size of the square.\n\n","date":"June 10, 2013 at 8:48 am","url":"https://shroudstory.com/2013/06/10/pounding-the-square-peg-into-the-round-hole/","cat":"news_&_views","id":"comment-36617","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Pounding the square peg into the round hole","post":"Hume must have read the same Bible that we (including Dawkins) read today and one mistake lies in making more and more translations to try to “pound the square peg into the round hole”. Centuries after the sceptical English philosopher we meet Heidegger and Wittgenstein, with no God in their philosophies, but with the feeling that something is missing well alive and kicking inside them. Heidegger, the son of a sacristan, and an ex-Jesuit seminarian, fought with the Jesuits and stopped going to Church. Towards the end of his life he walked a lot in the forests, thinking as usual, and when in the city, he entered the church he was passing by and blessed himself. Shortly before dying he called a Catholic priest to his house and requested a Catholic burial. History had told him that he was right in his faith, he said.\nWhat about Wittgenstein? Born 3/4th Jewish and baptised and raised Catholic he had no room for God in what he wrote in his philosophy, however like Heidegger he knew something more was needed. He spent a year at the Klosterneuberg monastery in his native Austria, sometimes in a hut somewhere in the mountains, always thinking about becoming a monk. Just before dying he asked his “Catholic friends” — philosopher Anscombe among them — to pray for him and they therefore called a priest to his bedside and gave him a Catholic burial.\nThe point is this: Hume, Heidegger, Wittgenstein were interpreting the Bible as generally most Christians do today. Although they knew there was the need to “pound the square peg into the round hole” the German and Austrian philosophers were unable to do it and opted for God in the end, whether led by intuition or not.  Both fundamentalist and allegorical readings of the Bible are wrong. The time is coming, when depending on our interpretation of Scripture, there will be no need to pound the square peg into the round hole. Jesus said…\n\n","date":"June 10, 2013 at 9:48 am","url":"https://shroudstory.com/2013/06/10/pounding-the-square-peg-into-the-round-hole/","cat":"news_&_views","id":"comment-36618","author":"Louis","site":"shroudstory"},{"title":"Pounding the square peg into the round hole","post":"“If anything, being honest and not denying science (e.g. by quoting scripture or an apologetic argument) elevates science.”\nInteresting how simply quoting scripture is now equated with denying science. Sounds very Dawkins-inspired kind of thinking. Shall we just edit out the reality that nearly all the founders of the modern fields of science (later hijacked by the World Socialists/Atheists political front) were inspired by those very scriptures that now ‘believers’ in this woeful age seem to be embarrassed of in a scientific discussion? Scripture is deceptively simple on the surface yet so far over the tiny mind of the typical modern thinker that it takes the brilliant gift of a Newton or Planck to perceive and dedicate themselves to exploiting its other-worldly, timeless, divine treasures over against mass-marketed worldly conventional wisdom that would divorce scripture from science and vice-versa.\n“There are more sure proofs of authenticity in the Bible than in any secular history. *All my discoveries have been made in answer to prayer.* I can take my telescope and look millions of miles into space; but I can go away to my room and in prayer get nearer to God and Heaven than I can when assisted by all the telescopes of Earth!” -Isaac Newton\n\n","date":"June 11, 2013 at 4:50 am","url":"https://shroudstory.com/2013/06/10/pounding-the-square-peg-into-the-round-hole/","cat":"news_&_views","id":"comment-36678","author":"EGM","site":"shroudstory"},{"title":"Pounding the square peg into the round hole","post":"The above comment is good and demonstrates that Newton, the scientist, anticipated philosophers Heidegger and Wittgenstein. As for Hume, the “empiricist”, he was not really an empiricist at all and did not go deep enough and Einstein claimed to have been inspired by him to write his theory of relativity. That is only part of the story, for Einstein looked to Spinoza for metaphysics and did not also go as far as he needed to go because he was one-track minded. Now we have scientists claiming that all that we can know about is the universe, full stop. That was also the mistake made by Hume, Spinoza, Einstein, because, unlike Newton, Heidegger and Wittgenstein they limited their quest and thought they had found everything.\n\n","date":"June 11, 2013 at 8:48 am","url":"https://shroudstory.com/2013/06/10/pounding-the-square-peg-into-the-round-hole/","cat":"news_&_views","id":"comment-36694","author":"Louis","site":"shroudstory"}]
