[{"title":"PZ Myers is a Fundy","post":"@Dan Porter – “Atheism, despite how strenuously some Atheists deny it, is a belief about religion; non-belief to all except those incapable of logic is belief.”\n———-\nUm, okay. Let’s change things around a bit to illustrate the massive absurdity of your statement:\n“Baldness, despite how strenuously some bald people deny it, is a color of hair; baldness – to all except those incapable of logic – is exactly the same as having a hair of a certain color.”\n“Not collecting stamps, despite how strenuously some people who do not collect stamps deny it, is a hobby about stamp collecting; not collecting stamps – to all except those incapable of logic – is exactly the same as collecting stamps.”\n“The absence of belief in the Loch Ness Monster, despite how strenuously some Nessie-deniers deny it, is a belief about a giant, pre-historic water dinosaur; The absence of belief in Nessie – to all except those incapable of logic – is exactly the same thing as belief in Nessie.”\nSo, black is white, there is the same as not-there, one equals zero, and the absence of a belief is the same as the belief itself.\nSeriously? And you wonder why we consider folks like you to be delusional?\n\n","date":"November 23, 2010 at 1:37 pm","url":"https://shroudstory.com/2010/11/23/pz-myers-is-a-fundy/","cat":"news_&_views","id":"comment-1768","author":"Brent Rasmussen","site":"shroudstory"},{"title":"PZ Myers is a Fundy","post":"Seriously? Is there no understanding that belief about is not the same as belief in. ‘I don’t believe there is a Loch Ness monster’ is a belief about a monster, perhaps mythological or imagined. It is not a belief in Nessie. The same is true with regards to belief in or about God. I might not believe in God or any gods and that is a belief about God or gods, mythological perhaps, even imagined (the old imaginary friend problem). It is still a belief and it is silliness to think otherwise by thinking that bald might be thought of as a color by silly people. I fell out of my crib when I heard that one. How many times must it be repeated in absence of logical arguments. \nThe point was that, like Richard Dawkins, but very much unlike Michael Ruse, Jerry Coyne or Christopher Hitchens who are open-minded Atheists, PZ Myers is a my-mind-is-made-up Fundy.\n\n","date":"November 23, 2010 at 2:32 pm","url":"https://shroudstory.com/2010/11/23/pz-myers-is-a-fundy/","cat":"news_&_views","id":"comment-1769","author":"Episcopalian","site":"shroudstory"},{"title":"PZ Myers is a Fundy","post":"Episcopalian, you are 100% correct.  Rasmussen is using fundy logic.\n\n","date":"November 23, 2010 at 8:32 pm","url":"https://shroudstory.com/2010/11/23/pz-myers-is-a-fundy/","cat":"news_&_views","id":"comment-1772","author":"Theologian","site":"shroudstory"}]
