[{"title":"Quake Reveals Day of Jesus’ Crucifixion (or something like that)","post":"I’ll go with John P Meier on this one [A Marginal Jew – Rethinking the historical Jesus – Vol 1; John P Meier; Doubleday 1991].  The Synoptic gospels attempt to connect the Last Supper with the Passover meal may have been a late stage insertion, and for the Synoptic evangelists a symbolic passover meal.  John asserts that the Friday was Preparation Day.  This made the actual Passover fall on the sabbath and consequently of particular solemnity that year.  It’s the main reason why the three bodies could not stay on their crosses beyond the Friday.  There are two years that fit the bill, either 30AD or 33AD.  \nThere are only four major chronological events that give us any indication of when significant dates in Jesus’ life occurred.  These are: (1) his birth – about 6BC or 7BC,  a few years before the death of Herod the Great in 4 BC; (2) John the Baptist commences his preaching in the 15th year of Tiberius – depending on the method of counting this is sometime between Sept, 27AD to Aug, 29AD; (3) Pontius Pilate procurator 26 – 36AD; (4) Jesus dies on a Friday which is also Preparation Day when Pilate is procurator. \nMeier concludes that the date is Friday, April 7, 30AD.  Essentially it depends on how long Jesus’ ministry lasted commencing with John the Baptist’s preaching, and Jesus’ death.  Reading the Synoptics, it’s only about 18 months.  In John, Jesus goes up to Jerusalem from Galilee, for a number of great feasts, probably when there would be large crowds.  Meier concludes that the ministry lasted 2 years and a few months.  Only if the ministry was some three years longer, could the 33AD date be accepted as the year of Jesus’ death.\n\n","date":"May 26, 2012 at 7:13 am","url":"https://shroudstory.com/2012/05/26/quake-reveals-day-of-jesus-crucifixion-or-something-like-that/","cat":"news_&_views","id":"comment-11618","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Quake Reveals Day of Jesus’ Crucifixion (or something like that)","post":"The problem of the apparent contradiction between the synoptic gospels and John has been resolved by Colin Humphreys in his recent book “The mystery of the last supper” (Cambridge UP 2011). Basically, Christ and his followers (and also groups such as the Samaritans and some Essenes) used the original Mosaic pre-exile Jewish calendar and held their passover meal according to that calendar. At the temple, the modified post-exile and ‘official’ calendar was used. The synoptic gospels refer to the non-offical calendar, as is stated implicitely in Marc 14:12 (see Humphreys p.152 ff). The fact that John refers (11:55), not simply to ‘the Passover’, but to the ‘Jewish Passover’, indicates, according to Humphreys (p.162 ff), that he refers to the ‘official’ calendar. The ‘last supper’ was on Wednesday April 1st, 33, that was Passover day according to the pre-exile calendar. I highly recommend the book by Humphreys; the whole argument is impossible to summarize here.\nAs to the birthday of Jezus, it should be noted that the gospels seem to relate two different births. For instance, the genealogies in Matt.1 and Luke 3 are different, and the stories in both these gospels have but very few common elements. The possibility should be considered, that there where indeed two births. According to the esoteric christian tradition represented f.i. by the flemish painter P.P.Rubens, there are even three time points that should be taken into account: Tuesday 15 september 7 BC, 18:10; Friday 14 january 1 AD, 21u05; and Sunday 25 december 1 AD, especially 23u50 (local time, Jerusalem & surroundings, julian calendar).\n\n","date":"May 26, 2012 at 10:39 am","url":"https://shroudstory.com/2012/05/26/quake-reveals-day-of-jesus-crucifixion-or-something-like-that/","cat":"news_&_views","id":"comment-11620","author":"Jos Verhulst","site":"shroudstory"},{"title":"Quake Reveals Day of Jesus’ Crucifixion (or something like that)","post":"Dave,\nThanks for the explanation. I think the diversity of the individuals who blog here is remarkable and edifying. Unlike seismic analysis based upon literal interpretations of the New Testament without taking into account the differing paths of the Gospels to the New Testament, the Shroud is an existing physical fact that teaches about the Crucifixion and, ultimately, the Resurrection. \nI rejoice in the diversity. The Shroud, here and now existent, unites us. Teilhard predicted a merger of science and religion and that is now at the Shroud. That’s why I regard it as a new Revelation (some have called it a Fifth Gospel). \nTo me the enduring command of Christ as recorded in the Gospels is to love one another. Whatever the origins of Christianity, there was a  new hymn we sang in the heady post Vatican II days: You’ll know we are Christians by Our Love. Unfortunately we no longer sing it. It’s our challenge to act it.\nAs a result of a quick internet research for this comment, I discovered that the hymn was written by Peter Scholtes in the 1960s a priest who later left the priesthood but not Christianity. Here’s a version on U-Tube:","date":"May 26, 2012 at 8:44 am","url":"https://shroudstory.com/2012/05/26/quake-reveals-day-of-jesus-crucifixion-or-something-like-that/","cat":"news_&_views","id":"comment-11619","author":"John Klotz","site":"shroudstory"},{"title":"Quake Reveals Day of Jesus’ Crucifixion (or something like that)","post":"JK:  Thanks for your comments John.  Here at the end of the world, our music groups still occasionally sing that hymn at Mass – the full force of the conservative reaction now prevalent elsewhere has still a little way to go in NZ.  I remember the hymn being very popular in various youth and family groups during the 1960s. \nJV:  I believe that one only sees contradictions in the gospels if you fall into the trap of interpreting them literally.  To do this one ignores the literary artistry that is a gospel.  Each one of the evangelists has his own purpose in writing a gospel.  Both infancy narratives place their birth stories in Bethlehem, to suit a “prophecy” that the Messiah will be born there.  It is quite likely that Jesus was actually born in Nazareth.  Matthew does not even know that Nazareth is the home town of Joseph and Mary, and mentions no stable nor inn.  Matthew’s purpose is at least two-fold – his gospel is intended to include the gentiles, so he has wise men coming from the east, and includes Ruth a Moabite in the genealogy; he also wants to present Jesus as the new Moses and uses several devices to show this.  He wants to bring him out of Egypt, so has to have a reason for getting him there first.  The Last Supper was not a Passover meal, but a farewell meal, which symbolically became associated with the Seder.  And so on. \nMeier’s text is extremely authoritative, and has been cited by Pope Benedict in some of his writings.  It was partly written as a reponse to tendencies in the Jesus Seminar group.  You can probably find Meier’s credentials on the web. At the time of writing his book 1991, the jacket blurb included the following: \n“John Paul Meier is a Biblical scholar and Catholic priest. He attended St. Joseph’s Seminary and College (B.A., 1964), Gregorian University [Rome] (S.T.L, 1968), and the Biblical Institute [Rome] (S.S.D., 1976).  Meier is the author of nine books and more than 60 scholarly articles. He was editor of The Catholic Biblical Quarterly and president of the Catholic Biblical Association.  Meier is Professor of New Testament in the Department of Theology at the University of Notre Dame. Before coming to Notre Dame, he was Professor at The Catholic University of America.”\n\n","date":"May 26, 2012 at 4:48 pm","url":"https://shroudstory.com/2012/05/26/quake-reveals-day-of-jesus-crucifixion-or-something-like-that/","cat":"news_&_views","id":"comment-11623","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Quake Reveals Day of Jesus’ Crucifixion (or something like that)","post":"I really don’t think the explanation given by Joe, even if it is interesting (I’ve heard about it before), have been backed-up by a majority of scholars.  Personally, I think it is dangerous to always try to resolve the contradictions found in the Gospels because it is highly probable that those contradictions are real.  The fact that, except for John, the other 3 Gospels have been written by men who WERE NOT close followers of Jesus is enough to understand why there is such contradictions.  And generally, those contradictions are not very important versus the heart of the message those Gospels want to deliver.  So, for me who is a Catholic, some minor contradictions like the date of the crucifixion of Christ is not something that prevents me from sleeping at night.  In other words, I don’t think it is very important, since the heart of the message in all 4 Gospels is the same.  And more than this, I even go further and say that those small contradictions are a type of evidence that shows that those 4 books were not part of an evil plan to fool us but, on the contrary, they are 4 different testimonies that are really reliable.  In court, when all the witnesses always say the same thing, it is very suspect !  It’s the same thing here…  As I say, the importance is the heart of the message those books want to deliver.\nThe reality is this :  Based on the gospels, it is impossible to know the truth since the Synoptics and the gospel of John gave 2 different dates that can well be April 3, in the year 33 for the Synoptics and April 7, in the year 30 for John.  \nI said it before, personally, like the majority of the scholars, I favored the date given by John (that is most probably April 7, in the year 30), mostly because he is the sole author of the gospels we can be sure that he was there with Jesus during those events.  It is possible that Mark was at the last supper and at Gethsemani, but it is far from being proven.  And for Luke and Matthew, you can forget it.  It is highly probable that those 2 persons became Christians a long time after Jesus resurrection and they never knew him personally.  Important note :  If we believe the majority of the scholars, Matthew is surely not the Matthew that was an apostle of Jesus since this author based a good portion of his book on the Gospel of Mark.  If it was the apostle Matthew who had written this Gospel, no way he would have need an external source like Mark to finish the job !  In fact, we can bet that his personal Gospel would have been very different, just like the Gospel of John is very different than the others.\nBut in the end, so what ???  I’m ready to accept either dates if someone brings me a solid proof…  I really don’t care too much about that.  As I say, things like that are far from being what’s at the heart of those Gospels !!!  Gospel meaning “good news”, I think that the new face of God as revealed by Jesus (a face of pure Mercy and Love), is much more important than the date of his crucifixion…\n\n","date":"May 26, 2012 at 6:17 pm","url":"https://shroudstory.com/2012/05/26/quake-reveals-day-of-jesus-crucifixion-or-something-like-that/","cat":"news_&_views","id":"comment-11624","author":"Yannick Clément","site":"shroudstory"},{"title":"Quake Reveals Day of Jesus’ Crucifixion (or something like that)","post":"Well said.\n\n","date":"May 26, 2012 at 9:23 pm","url":"https://shroudstory.com/2012/05/26/quake-reveals-day-of-jesus-crucifixion-or-something-like-that/","cat":"news_&_views","id":"comment-11627","author":"John Klotz","site":"shroudstory"},{"title":"Quake Reveals Day of Jesus’ Crucifixion (or something like that)","post":"Thank you John.  It’s cool that someone here can agree with me on one topic !  For once, it feels different… ;-)\n\n","date":"May 27, 2012 at 6:01 pm","url":"https://shroudstory.com/2012/05/26/quake-reveals-day-of-jesus-crucifixion-or-something-like-that/","cat":"news_&_views","id":"comment-11645","author":"Yannick Clément","site":"shroudstory"},{"title":"Quake Reveals Day of Jesus’ Crucifixion (or something like that)","post":"Although I agree with your comment of the “Heart of the Gospels” meaning. I must disagree that John’s Gospel or points therein, can be accepted anymore then anyother Gospel. No one knows for sure who wrote what, if one is totally honest…and I include even top scholars in the mix. Therefore one cannot assume the writer(s) of John’s Gospel was closer to the actual event in anyway. One must assume so. Does the actual date of the crucifixion or ressurection mean anything, really? Who knows for sure. Do the contradictions found in the Gospels say anything?, again who knows? Thing is it does in the sense that opponents to our faith will use these against the word! Do they have a case, especially If one states the Gospel writers and writings were dictated by God? Maybe. Proponents of the word will always defend the many discrepencies with the statement that they were written by man, with his own shortcomings etc; SO who is right? …I say; That IS THE question of faith…..hope that makes sense.\nAs for the actual date of crucifixion, I tend to believe April 3, 33. Why? because the number 3 tends to be God’s prominant number…ludicrous? Maybe, but thats what I feel and it may play a role in the Lord’s return.\nR\n\n","date":"May 28, 2012 at 8:46 am","url":"https://shroudstory.com/2012/05/26/quake-reveals-day-of-jesus-crucifixion-or-something-like-that/","cat":"news_&_views","id":"comment-11658","author":"Ron","site":"shroudstory"},{"title":"Quake Reveals Day of Jesus’ Crucifixion (or something like that)","post":"I think there’s enough evidences in the Gospel of John to understand that this one is most probably the only one who was written by an eye-witness of the events of the Passion, death, entombment, the discovery of the empty tomb (and the empty Shroud !) and the apparitions of the risen Lord.  And as a Shroudie Ron, I don’t understand how you can miss that !!!  The Shroud of Turin is a proof that John was there and that he saw everything with his own eyes !  It’s particularly true for the violent scourging (done more violently than usual because Pilate thought that it would calm down the Jewish leaders and prevent Jesus from being crucified) and the lance stab done after death (only report in this gospel).  And also, we should not neglect the fact that the author emphasize his testimony by the words : “The man who saw it has given testimony, and his testimony is true. He knows that he tells the truth, and he testifies so that you also may believe.” (John 19, 35)\nNow, unless you think he’s a liar, I think this single statement is a proof that the writer of this Gospel (whether it was John the Apostle, John the Presbyter or another person) was there and that he really was a true disciple of Jesus.  And if you don’t believe him when he clearly state that he was an eye-witness of the Passion, death, entombment, the discovery of the empty tomb (and the empty Shroud !) and the apparitions of the risen Lord, then, I really wonder how can you believe in the resurrection of Jesus !!!!\n\n","date":"May 28, 2012 at 10:50 am","url":"https://shroudstory.com/2012/05/26/quake-reveals-day-of-jesus-crucifixion-or-something-like-that/","cat":"news_&_views","id":"comment-11660","author":"Yannick Clément","site":"shroudstory"},{"title":"Quake Reveals Day of Jesus’ Crucifixion (or something like that)","post":"I agree with a lot of what Yannick expresses here. In the end the actual date isn’t all that relevant. What the writers were trying to convey – mainly that they saw a man who proclaims to be “The Way, The Truth and The Life” suffer death and then rise from the dead. Jesus is the real deal, not some charlatan looking to get a following. Their primary purpose was to write down what was being passed on via oral tradition in the first few years after the resurrection and ascension. They needed to combat inaccuracies and set the record straight in their growing community.\nI will depart with Yannick and others here though: Matthew the apostle almost assuredly wrote his own gospel and he is an eye witness to the events. Mark copies Matthew and Luke not the other way around. And John wrote his gospel many years after the events so some details are probably not accurate with regards to peripheral facts but his recounting of Jesus’s words are probably very accurate given his age at the time of his following of Jesus. All the gospels were written before the revolt. It looks like the majority of you would probably disagree with this interpretation and I respect that but this is the perspective that I come from though.\n\n","date":"May 30, 2012 at 1:39 pm","url":"https://shroudstory.com/2012/05/26/quake-reveals-day-of-jesus-crucifixion-or-something-like-that/","cat":"news_&_views","id":"comment-11724","author":"Chris","site":"shroudstory"},{"title":"Quake Reveals Day of Jesus’ Crucifixion (or something like that)","post":"You know what I think Chris ?  I think the 3 Synoptics are achieved forms of some little books of quotes and deeds of Jesus that were in circulation well before those Gospels were written down.  I’m sure the 3 authors of the Synoptics used some kind of textual sources (now lost) to write their “history of Jesus”, along with oral tradition.  The scholars talk about the lost source Q, but I’m pretty sure that there was more than just on written source that now is lost and that have been used by the authors of the Gospels (particularly for the authors of the Synoptics).  If the scholars are correct and these books were published mostly after 70AD, I just can’t believe that, in the 40 years gap between the resurrection of Jesus and their time, there was absolutely no written record of some sayings and deeds of Jesus !!!  And one of those short books could have been written by the tax collector named Levi (or Matthew) !!!  I have absolutely no difficulty to believe this.  So, my feeling is this :  No so long after the resurrection, and surely by the time Paul wrote his letters from the beginning of the 50s and on, there was some short written books of quotes and deeds of Jesus in circulation, probably written by some close followers of Jesus and mainly used as references (some help for their memory) for those who were preaching the good news.  Then, after most of the those who knew Jesus personally were killed or died, around the time of the Jewish revolt of 70 AD, some disciples of these dead Apostles decided to wrote down more complete stories about Jesus to be sure that the doctrine preached by the Apostles would not die with them.  And that’s when and why the Gospels we know now were born !  And some 10 or 20 years later, there was a close follower of Jesus who was still alive (whether it be John the Apostle, John the Presbyter or another person) and who decide to wrote the story of Jesus in his own word (hello Ray Rogers !!!) before he died.  Maybe he felt that the first 3 Gospels didn’t go profound enough about Jesus ?  Maybe he felt that he had go more deep into the heart of his message of love ?  I don’t know why exactly but he did it nevertheless !\nIn summary, the way I see things is that there was some short texts of sayings and deeds of Jesus in circulation sometime after his resurrection and, for most of them, they were probably written by eye-witnesses who were close followers of Jesus.  Then, near the time of the Jewish revolt of 70 AD, the 3 Synoptics were written by some disciples of the Apostles, who based partially their work on oral tradition and partially on these short texts (that could well have been pretty much like the Gospel of Thomas, but without the Gnostic philosophy behind many quotes of Jesus).  If my feeling is right, we can assume that the 4 Gospels we have all contain pretty solid eye-witness accounts of Jesus deeds and sayings, but they also contain theological and spiritual aspects that were added over it in the pure writing tradition of the ancient Middle Eastern people.\n\n","date":"May 30, 2012 at 4:41 pm","url":"https://shroudstory.com/2012/05/26/quake-reveals-day-of-jesus-crucifixion-or-something-like-that/","cat":"news_&_views","id":"comment-11731","author":"Yannick Clément","site":"shroudstory"},{"title":"Quake Reveals Day of Jesus’ Crucifixion (or something like that)","post":"The evangelists were not writing history; They were writing gospels.  In the gospel of Matthew, the disciple named as Levy the tax collector in Mark, is changed to Matthew, presumably to give this gospel apostolic authority.  \nPapias writing in the second century says that Mark was Peter’s amanuensis (secretary), although one of the Fathers also says that Papias is a person of very little brain (I think it was Irenaeus).  In the concluding verse of I Peter, apparently written by Sllvanus at Peter’s behest, “my son Mark .. (sends you greetings)”.  However some authorities dispute this, as I Peter is written in the best Greek (i.e. not Galilean – although Silvanus might be competent).  So the guarantor of Marks’ gospel is said to be Peter. \nLuke’s gospel is said to have been written by the companion of Paul, and frequently addresses gentiles.  Encyc Brit ,makes the following comments: ” … style of this preface follows the pattern of Greek historiography, and thus Luke is called the “historical” Gospel. Historically reliable information cannot be expected, however, because Luke’s sources were not historical; they rather were embedded in tradition and proclamation.  Luke is, however, a historian in structuring his sources, especially in structuring his chronology into periods to show how God’s plan of salvation was unfolded in world history. …” \nEncyc Brit makes the following comments about John’s gospel:  “Irenaeus calls John the beloved disciple who wrote the Gospel in Ephesus. Papias mentions John the son of Zebedee, the disciple, as well as another John, the presbyter, who might have been at Ephesus. From internal evidence the Gospel was written by a beloved disciple whose name is unknown.”  Thus it cannot be assumed that it was the disciple John who wrote the gospel of that name.  One hypothesis is that John’s gospel and the epistles of that name were written and edited by a Johnannine school in Ephesus towards the end of the 1st century.  There is much debate among the authorities, and it seems nothing is certain. \nAn enlightening insight into the varying purposes of the gospels is arrived at by asking the question “When does Jesus become the son of God?”  In Mark’s gospel, it is when the Holy Spirit descends on him at his baptism by John in the Jordan.  In Matthew’s and Luke’s gospel it is at his conception.  In John’s gospel, it is from the beginning of time “In the beginning was the Word”  so each one of the gospels has its own particular intent and focus.  But don’t expect a literalist’s history!\n\n","date":"May 26, 2012 at 8:23 pm","url":"https://shroudstory.com/2012/05/26/quake-reveals-day-of-jesus-crucifixion-or-something-like-that/","cat":"news_&_views","id":"comment-11626","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Quake Reveals Day of Jesus’ Crucifixion (or something like that)","post":"I agree with most of what you say Daveb, except maybe for John.  Personally, I tend to think more and more that this gospel was written by another John than the apostle we know, probably the presbyter mentioned by Papias, because it seem really hard to believe that the son of Zebedee could have been well known by the leaders of the Sanhedrin.  It really seem that the beloved disciple was someone that was not an apostle but simply a disciple of Christ (one of the 72 mentioned by Luke ?  It’s possible !) who was living in Jerusalem instead of Galilee.  Have you noticed that he never use the term “apostle” in his gospel ?  That is very telling for me !  It’s probably because this guy never thought that the 12 had to be considered with more pride than the other disciples like him.  That’s what I feel about that.  And that’s where I disagree a bit with the idea that this gospel was written by a Johnannine school.  Maybe some additions were done by some disciples of this presbyter John, near the end of the 1st century (or at the beginning of the second century), but I’m almost sure that most of the gospel was first written by an eye-witness of Christ who knew Jesus and Jerusalem very well.  And I think the Shroud is a very good confirmation of this idea.  In fact, the observations and facts that come from the Shroud are a very good indicator that the story of the Passion, death, entombment and resurrection of Christ we can read in this book was really written by a direct disciple of Jesus (named John, a very common name at the time) !  He was really there and he saw almost everything !  And what he said is true.  That’s why I tend to favored the day given by John for the crucifixion of Christ. \nFor the question of when Jesus became the Son of God, if we follow the Catholic teaching, I think we have to agree with John’s vision :  from all eternity !  But that doesn’t mean that Jesus was fully aware of his divine nature from the moment he was conscious.  We have to understand that he was also fully human (he had both natures from the time he was conceived).  That’s the mystery of the Incarnation of God and it’s not sometime I think we can fully understand in this life.  It’s a bit like the mystery of the Holy Spirit !  Who can proclaim he totally understand this mystery ?  Only when we will be in the Kingdom of God and that we will be plunged into the light that we will fully understand everything.  That’s what I believe.\nLast thing I want you to realize and this is very telling !  Have you noticed that every scholars always focus on the question regarding the historical date of Jesus crucifixion and death and never about the question of the historical date of his resurrection (or, at least, of the finding of the empty tomb) ?  I think it’s very interesting to note that they seem much more concern by his death than his resurrection, even if this later event is the corner stone of Christianity !  On the contrary, I think we should focus more our attention on the date of Jesus resurrection (maybe, theologically speaking, it is truer to talk about the day of the founding of the empty tomb).  And for me, following John’s Gospel, I believe this event came on the morning of April 9, in the year 30…\n\n","date":"May 27, 2012 at 5:56 pm","url":"https://shroudstory.com/2012/05/26/quake-reveals-day-of-jesus-crucifixion-or-something-like-that/","cat":"news_&_views","id":"comment-11644","author":"Yannick Clément","site":"shroudstory"},{"title":"Quake Reveals Day of Jesus’ Crucifixion (or something like that)","post":"It may only be poetry, but I have to side with John on this. I can still remember at Midnight Mass some years ago when I first really took to heart the reading of Psalm 109 for the first time: “before the day star I begot you.” It gave me a chill then and it still does. To me however, the “day star” is the big bang. The beginning of John’s Gospel which used to be read at Mass as the “last Gospel” grapples with a similar sentiment: “In the beginning was the word.” Religion and Science are meeting at the Shroud, but I also believe at quanta.\n\n","date":"May 26, 2012 at 11:14 pm","url":"https://shroudstory.com/2012/05/26/quake-reveals-day-of-jesus-crucifixion-or-something-like-that/","cat":"news_&_views","id":"comment-11629","author":"John Klotz","site":"shroudstory"},{"title":"Quake Reveals Day of Jesus’ Crucifixion (or something like that)","post":"\nYannick Clément :I think there’s enough evidences in the Gospel of John to understand that this one is most probably the only one who was written by an eye-witness of the events of the Passion, death, entombment, the discovery of the empty tomb (and the empty Shroud !) and the apparitions of the risen Lord. And as a Shroudie Ron, I don’t understand how you can miss that !!! The Shroud of Turin is a proof that John was there and that he saw everything with his own eyes ! It’s particularly true for the violent scourging (done more violently than usual because Pilate thought that it would calm down the Jewish leaders and prevent Jesus from being crucified) and the lance stab done after death (only report in this gospel). And also, we should not neglect the fact that the author emphasize his testimony by the words : “The man who saw it has given testimony, and his testimony is true. He knows that he tells the truth, and he testifies so that you also may believe.” (John 19, 35)\nNow, unless you think he’s a liar, I think this single statement is a proof that the writer of this Gospel (whether it was John the Apostle, John the Presbyter or another person) was there and that he really was a true disciple of Jesus. And if you don’t believe him when he clearly state that he was an eye-witness of the Passion, death, entombment, the discovery of the empty tomb (and the empty Shroud !) and the apparitions of the risen Lord, then, I really wonder how can you believe in the resurrection of Jesus !!!!\nFirst of all, why do you always respond to my comments using the quote feature? Secondly, I have absolutely no issue with my faith, thank-you, this isn’t the first time you’ve questioned my faith. I can say the same for you, as you keep asserting there is a “Natural” cause to the image formation i.e. Nature can do amazing things lol. – You don’t believe GOD can create anything he wishes, maybe? Don’t think God has power over and beyond what we understand as nature? … I’m just stating fact here and you are completely wrong as there is NOT enough “evidences” to say John the Apostle actually wrote the Gospel of John…thats a fact and reality. That does not mean I personally question what the scriptures say!!…If you can’t discern from the two, that is not my problem.\nR\n\n","date":"May 28, 2012 at 11:17 am","url":"https://shroudstory.com/2012/05/26/quake-reveals-day-of-jesus-crucifixion-or-something-like-that/","cat":"news_&_views","id":"comment-11661","author":"Ron","site":"shroudstory"},{"title":"Quake Reveals Day of Jesus’ Crucifixion (or something like that)","post":"Nevermind who wrote the Gospel of John, the evidence point toward the fact that it was an eye-witness of these events.  And this statement of mine is backed-up by many modern scholars and all the Father of the Church.  As I said, the Shroud is a very good evidence that this particular gospel was written by an eye-witness, whether it is John the Apostle, John the Presbyter or someone else.  That was the main point of my last comment.\n\n","date":"May 28, 2012 at 1:02 pm","url":"https://shroudstory.com/2012/05/26/quake-reveals-day-of-jesus-crucifixion-or-something-like-that/","cat":"news_&_views","id":"comment-11665","author":"Yannick Clément","site":"shroudstory"},{"title":"Quake Reveals Day of Jesus’ Crucifixion (or something like that)","post":"I am the primary author of the research article discussed in this article. We DID NOT determine the date of the crucifixion. This article grossly mischaracterizes our research. We dated an earthquake in Judea to have occurred between 26 and 36 AD based purely on what we saw in the sediments. I created a site to explain this research to the general public. It is http://www.crucifixionquake.info.\n\n","date":"May 28, 2012 at 11:38 pm","url":"https://shroudstory.com/2012/05/26/quake-reveals-day-of-jesus-crucifixion-or-something-like-that/","cat":"news_&_views","id":"comment-11673","author":"Jefferson Williams","site":"shroudstory"},{"title":"Quake Reveals Day of Jesus’ Crucifixion (or something like that)","post":"I think nobody can determine the date of the crucifixion of Jesus with 100% accuracy !  It’s as simple as that and really, it doesn’t really matter.  What matter is the FACT that Jesus died on the cross and resurrect !  And I think the Shroud of Turin is a great proof of the crucifixion and death of Jesus and a great SIGN of his resurrection !!!  Much better than any heartquake that could have occured between 26 and 36 AD !!!\n\n","date":"May 29, 2012 at 8:28 am","url":"https://shroudstory.com/2012/05/26/quake-reveals-day-of-jesus-crucifixion-or-something-like-that/","cat":"news_&_views","id":"comment-11683","author":"Yannick Clément","site":"shroudstory"},{"title":"Quake Reveals Day of Jesus’ Crucifixion (or something like that)","post":"I want to make a little precision about my last comment :  When I use the term « FACT » regarding the resurrection of Jesus, I hope you understand that it is from the standpoint of a believer.  But nevertheless, even if someone don’t believe it, I think he must be honest enough to admit that, at least for the standpoint of the apostles and other close followers of Jesus, this event of the resurrection was a FACT !  You don’t go to martyrdom if you’re not convinced of the event you preach !\n\n","date":"May 29, 2012 at 8:50 am","url":"https://shroudstory.com/2012/05/26/quake-reveals-day-of-jesus-crucifixion-or-something-like-that/","cat":"news_&_views","id":"comment-11685","author":"Yannick Clément","site":"shroudstory"},{"title":"Quake Reveals Day of Jesus’ Crucifixion (or something like that)","post":"Mr. Williams, I think that was understood. Atleast I recognised that your research did not in any way predict a specific date or year for the quake. My comments, if that was what you were refering too, were my own personal thoughts.\nR\n\n","date":"May 29, 2012 at 3:40 pm","url":"https://shroudstory.com/2012/05/26/quake-reveals-day-of-jesus-crucifixion-or-something-like-that/","cat":"news_&_views","id":"comment-11698","author":"Ron","site":"shroudstory"}]
