[{"title":"Questions, Questions Everywhere and not one on the Shroud of Turin","post":"I’ve followed your blog for several years now and it seems to me you are unduly biased, to a fault, toward scientific inquiry.  Three key disciplines are missing from the Shroud research teams; 1) a Buddhist Master who understands the practice of Dzogchen and the Buddha’s teachings on Emptiness and the Nature of Mind,  2) a bold, open minded, free thinking Christian theologian to reframe Jesus’ teachings in an Eastern context so that we will know truly who He was and what he taught, and 3) a cell biologist who can can explain why human cells dissolve into their atomic elements (emitting radiation) when exposed to a blood stream that is totally empty of emotion chemicals when all sensory experience ends. \nHuman bodies have been disappearing in a burst of radiation for thousands of years.  For sure we know that the words of Genesis 3:19, “You are dust and to dust you shall return” are wrong.  They need to be appended with the words, “….unless you so choose.”  And, with that change the doctrine of Original Sin and the walls of Christianity come tumbling down.\nA practicing Catholic for almost 74 years I fear for my religion.  It is teetering on the precipice.  For years now we have recognized the Shroud as the great evidence in support of Christian teaching.  As it turns out, it is its undoing.  And therein lies the true roadblock to understanding.\n\n","date":"December 29, 2013 at 11:07 am","url":"https://shroudstory.com/2013/12/29/questions-questions-everywhere-and-not-one-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-69830","author":"Tom Devins","site":"shroudstory"},{"title":"Questions, Questions Everywhere and not one on the Shroud of Turin","post":"The a absence of the shroud from the magazine doesn’t upset me. Science was never drawn to the shroud willingly, it was always the, in your face, shocks that kept the interest (the negative image, 3d information, forensic accuracy, superficiality at fibre level, half tone effect, absence of pigments…etc) and it has always been an uphill climb to overcome the burdens .periods of interest and lake of interest vacillate all over shroud history and it won’t be long that scientists will be drawn again as better analytical methods reveal more secrets.\n\n","date":"December 29, 2013 at 11:34 am","url":"https://shroudstory.com/2013/12/29/questions-questions-everywhere-and-not-one-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-69838","author":"Mike","site":"shroudstory"},{"title":"Questions, Questions Everywhere and not one on the Shroud of Turin","post":"When blogmaster Dan’s friend says “you ponderers”, does it mean he is not given to pondering? If not, then it is high time that he devotes at least some time to it. May I suggest he read at least a bit of Karl Popper?\nNeither scientists nor clergymen can jump to conclusions. Cardinal William Henry O’Connell of Boston accused Albert Einstein of atheism, after which Rabbi Herbert Goldstein of the  Institutional Synagogue in New York tried to defend the scientist and made an even bigger blunder with his interpretation.\nWhat did the rabbi do? He sent Einstein a telegram asking him about his belief in God and when told that the deity was “Spinoza’s God” — a deity that even Spinoza could not really define! — the rabbi reached his conclusion.\nAnd what was this conclusion? That monotheism could be proved scientifically! Of course, Einstein kept quiet. A personal God and monotheism was never in his mind. Didn’t the rabbi know that in Judaism it is not possible to confuse God and creation?\nThe possibility that consciousness exists everywhere, even in inanimate matter in a way, was hinted at by Nietzsche. Neuroscience has produced remarkable results, that can be called signs, but there is no hard evidence so far. We have the case of neuroscientist James Fallon, who began as a genetic determinist and then changed his mind because of what he discovered in his own brain. Is it biology that tells us the difference between good and evil? There is a lot more research to do.\nIt does not seem that Buddha knew the answer to everything, despite his wisdom, he did leave questions answered. That is why it seemed that those monks who ruled Tibet as a theocracy before China came into the picture were not bothered about emptiness and the nature of the mind. This I learnt while talking to Tibetan refugees who were selling coarse woolen sweaters they made to eat their daily bread outside Tibet. Life was not better for them before China invaded the country, but of course it would be better if Tibetans ruled their own country. Literacy in that country was 4% with the monks in power, today it is 54%.\n\n","date":"December 31, 2013 at 10:55 am","url":"https://shroudstory.com/2013/12/29/questions-questions-everywhere-and-not-one-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-70545","author":"Louis","site":"shroudstory"}]
