[{"title":"Quote for Today on Carbon Dating of the Shroud","post":"I don’t know if nearly everybody wanted to carbon date the Shroud “in the worst way”, but I know that the dating result  was the worst possible one  for those who believe in it’s authenticity and confirmed skeptic’s predictions (they were NOT wise after the event …) prior to the radiocarbon dating.\n\n","date":"October 18, 2014 at 3:47 am","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163378","author":"PHPL","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"“Nearly everybody”? Name one single person who wanted the Shroud dated in the worst way.\n\n","date":"October 18, 2014 at 6:27 am","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163414","author":"Hugh Farey","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"Here’s three: \nHarry Gove, Rev David Sox (who fed inside information from STURP to Gove) and Walter McCrone.\nThe ASM carbon dating labs wanted a test case to prove the effectiveness of their new method.  And yes they wanted it in the worst way because it would lead to a whole new industry, not to mention government grants from both England and the US which were used jn financing  the carbon dating.\nIf you don’t know who any one of these three are then your knowledge of what happened is deficient.\nThe whole process was an ethical mess. It’s covered in my book.\n\n","date":"October 18, 2014 at 6:55 am","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163418","author":"John Klotz","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"Hugh, you have said that you have been studying the Shroud for 30 years but you seem to be unaware about what went on. I read Ian Wilson’s book in 1978 but the Shroud was not my priority. I began writing about it in 1992.\nI was in London in October 1988, researching mediaeval history, reading in libraries, taking photographs and so on and one day I came home after a usual tiring day and watched the news on BBC TV. There was a report about the the TS and the Jospice Mattress Imprint, but even then I did not pay that much attention to the Shroud. I missed the press conference at the BM.\nI agree with what John stated and was glad to see that he covered it in his book. Rev. David Sox behaved like a mischief maker and traitor, Edward Hall came to the scene with his head full of pre-conceived ideas. It even seems that it would make little difference if half of the sample cut by Giovanni Riggi was given to the laboratories. Scientists were present when the sample was cut. They just kept quiet.\n\n","date":"October 18, 2014 at 7:47 am","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163431","author":"Louis","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"I seem to have misunderstood what was meant by “the worst way.” All the people mentioned wanted the Shroud to be radiocarbon dated in the best way possible. Walter McCrone was hoping it would prove to be 1st century when he first suggested carbondating in 1974, and confident that it would prove to be 13th/14th century in 1988. Harry Gove wanted the best radiocarbon test ever as it would publicise the whole procedure. I can’t say what was in David Sox’s mind, but is there a reason he wanted the dating badly done? I was assuming that “the worst way” meant that all these people wanted an unrepresentative sample to be taken and that the actual procedure would be so clumsily done that no conclusions could be drawn at all. I don’t believe this to be the case. Can anyone clarify this?\n\n","date":"October 18, 2014 at 8:23 am","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163442","author":"Hugh Farey","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"I too am not sure what Mr Klotz means by “the worst way”. It’s ambiguous.\n\n","date":"October 18, 2014 at 9:05 am","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163453","author":"PHPL","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"What is ambiguous about it? John does not indulge in spoon feeding.\n\n","date":"October 18, 2014 at 9:07 am","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163455","author":"Louis","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"You understand things in only one way, I don’t.\n\n","date":"October 18, 2014 at 9:37 am","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163458","author":"PHPL","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"You understand things in only one way. Others don’t.\n\n","date":"October 18, 2014 at 9:41 am","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163460","author":"PHPL","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"“Can anyone clarify this?” That’s a “No” then, is it?\n\n","date":"October 18, 2014 at 11:32 am","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163493","author":"Hugh Farey","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"Ian Wilson, who is undoubtedly the “dean of the department of Shroud studies” does not show Rev. David Sox in a favourable light. In my view, he was the politician par excellence in the scene:\n http://www.oocities.org/gregory_fewer/shroud.htm\nCardinal Ballestrero faced a lot of pressure to get the carbon dating going and there can be no doubt that he finally bowed to this pressure. Shortly before his death he gave an interview saying that he had been “manipulated”.\nWhy be surprised that Turin has learnt from mistakes and is now treading cautiously?\n\n","date":"October 18, 2014 at 8:58 am","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163449","author":"Louis","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"PHPL: The Shroud is not the basis for my faith, but I do see that everything went wrong, from beginning to end, in 1988. Why did the BM have to announce the results, and what was the reason for the exclamation mark? Did they have to dictate the terms and have everyone swallow everything hook, line and sinker?\n\n","date":"October 18, 2014 at 9:55 am","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163461","author":"Louis","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"“Why did the BM have to announce the results, and what was the reason of the exclamation mark ?”\nLet’s say that you decide to travel by airplane to Nepal as you want to see mountain Everest. The plane is somewhat overload, one of the pilots had a few drinks, one passenger’s passport is a fake one, and so one. Will these trivia elements prevent you airplane from carrying you to Kathmandu? That’s extremely unlikely, otherwise most air flights would be doomed.\nThe Turin Shroud was submitted to a Radiocarbon 14 dating test so as to know it’s age. The fact that the protocol was not fully followed, that the results were leaked  in the media, that there was an exclamation mark, et cetera, are nothing more than trivia elements that didn’t have any impact on the Radiocarbon dating test.\nCordialement\nPatrick\n\n","date":"October 18, 2014 at 10:59 am","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163482","author":"PHPL","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"Patrick, I appreciate when people begin to provide reasons as you have done. I was No.1 in Logic in a class of 500 students during my second year in college.\nWell, everything is relative and there are missing links in the story and I think that it is these that led to the exclamation mark.\n\n","date":"October 18, 2014 at 12:54 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163513","author":"Louis","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"Louis: “Shortly before his death he [Ballestrero] gave an interview saying that he had been “manipulated”.” I would not think that Ballestrero said that he had been manipulated. At any rate, his interview is reproduced here (in Italian):\nhttp://www.mondosindone.com/Site/documenti/DSS001_10%20-%20intervista%20Ballestrero.pdf\n\n","date":"October 18, 2014 at 10:34 am","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163472","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"In the text of the Ballestrero interview I linked above, there are just a few spelling mistakes. In particular, the year of the death of Ballestrero is given as 1989 instead of 1998. The interview was published in 1997.\n\n","date":"October 18, 2014 at 10:47 am","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163479","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"Gian Marco, Thanks for sending this link, the second time you have done it. Was it published in the Carmelite monthly in Italy? I am puzzled because I read somewhere that Cardinal Ballestrero had clearly stated that he had been manipulated and there were more details, which are not seen in the link you sent me.\n\n","date":"October 18, 2014 at 12:58 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163515","author":"Louis","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"The interview was first published in “Messaggero di Gesù Bambino di Praga”, the monthly of the sanctuary of Arenzano (near Genova) of the “Padri Carmelitani Scalzi”. I have that issue here at home, even if not at hand at the moment. The text was subsequently reproduced in various places and sometimes with some slight changes. From what I can recall, the text in the above link should probably be true to the original, but I have not checked now.\nIf you can read Italian, there is a 2010 interview with Father Giuseppe Caviglia and he speaks just of the Shroud:\nhttp://www.arenzanotracieloemare.it/IMMAGINI/2010_03_SINDONE/ArenzanoSindone.PDF\nCaviglia, former secretary of cardinal Ballestrero, was the author of the 1997 interview.\n\n","date":"October 18, 2014 at 2:11 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163530","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"It is, I think, here, Louis (from the link):\nQuestion: “In tutta questa vicenda potrebbe averci messo lo zampino la massoneria? E le pressioni esterne?”\nAnswer: “Penso sia indiscutibile! Com‟è possibile che qualcuno che non sia in malafede o malintenzionato abbia potuto pensare che io quello che ho fatto l‟abbia fatto da me?”\n\n","date":"October 18, 2014 at 2:12 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163532","author":"Hugh Farey","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"Gian Marco, Thanks for the link. I am a bit slow in Italian but can manage. This has left me even more puzzled because I remember reading the word “manipulated” in connection with Ballestrero. I also do not have the material at hand now and I think it was something I received from the late Daniel Raffard de Brienne.\n\n","date":"October 18, 2014 at 2:27 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163535","author":"Louis","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"Some people, prone to conspiracy hypotheses, have made much of this reference to freemasonry, I think that there has been a misunderstanding. I consider this issue in section 16 (“Il cardinale Ballestrero e la Massoneria”) of this critical article about the conspiracy thesis in an Italian documentary, “La notte della Sindone” by Francesca Saracino:\nhttp://sindone.weebly.com/uploads/1/2/2/0/1220953/notte_complottopart_1.pdf\nAs it seems that you both, Louis and Hugh, can read Italian, possibly you might find something interesting, if not just in this article, in some of the many other articles in the website sindone.weebly.com.\n\n","date":"October 18, 2014 at 2:50 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163545","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"For the whole story, and to learn what the Shroud can mean for us:\nhttp://www.amazon.com/Coming-Quantum-Christ-Apocalypse-Selfishness-ebook/dp/B00O3KFY0E/ref=sr_1_wsc1?s=books&ie=UTF8&qid=1413637300&sr=1-1-wordsplitter&keywords=quantum+christ+shroud+klotz\n\n","date":"October 18, 2014 at 9:06 am","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163454","author":"Louis","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"Oops! I have just started reading John’s book, and on page 315 what do we find but: “It has even been claimed that the Shroud is a photograph created by da Vinci who managed to insert his own face onto the cloth. That is fiction. Da Vinci was born approximately 100 years after the first documented exhibition of the Shroud in Lirey France.” Of course the reference is to Picknett and Prince, who were perfectly aware of da Vinci’s dates, and never claimed that the Shroud exhibited at Lirey was the photograph they went on to describe. See my comments on the previous blog entry.\n\n","date":"October 18, 2014 at 12:10 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163504","author":"Hugh Farey","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"Wow, just started at page 315. You must be a fast reader Hugh, or are you just skimming for problems?\n\n","date":"October 18, 2014 at 12:57 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163514","author":"Mike M","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"Which of the previous blog entries?\n\n","date":"October 18, 2014 at 1:00 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163516","author":"Louis","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"Sorry, Mike; the quotation is from the first paragraph of Chapter 1. I don’t have a Kindle, and have downloaded an app onto my iPad. This tells me I am on “Loc. 315 of 7256,” which I take to be the Kindle equivalent of a page number. What a suspicious mind you have!\nAnd Louis, I mentioned Picknett and Prince in the post previous to this one, “A Significant Article by Charles Freeman in History Today.” I do not have a lot of time for their hypothesis, although my first article for the BSTS, many years ago, was about an experiment to find out if their chemistry was correct (it was). However, they are mostly derided for the discrepancy between the date of the Shroud’s first appearance and da Vinci’s birth. This is a fatuous criticism, as they were well aware of this, and explained it, in detail, in their book.\n\n","date":"October 18, 2014 at 1:51 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163525","author":"Hugh Farey","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"Hugh, thanks for sending me that Italian stretch. I did remember it now, but what I am looking for is the word “manipulated” I had read in some other text, probably sent to me by the late Daniel Raffard de Brienne.\n\n","date":"October 18, 2014 at 2:30 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163539","author":"Louis","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"Hugh, thanks for the clarification. Do you have this in pdf or in which issue was it published?\n\n","date":"October 18, 2014 at 2:13 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163533","author":"Louis","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"My experiment on the chemistry of the photographic hypothesis is at: http://www.shroud.com/pdfs/n39part6.pdf, but this does not discuss the physics, which I found far fetched, or the history, which has largely been discredited by later research.\n\n","date":"October 18, 2014 at 2:29 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163538","author":"Hugh Farey","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"Hugh, thanks again. I remember this too and had forgotten about it. It will be stored to be read shortly. See my second last comment.\n\n","date":"October 18, 2014 at 2:34 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163541","author":"Louis","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"Gian Marco, thanks again for the material on weebly. Do you know where I can find the documentary?\n\n","date":"October 18, 2014 at 3:22 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163552","author":"Louis","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"For “La Notte della Sindone” I have the DVD that was sold until recently, but now I see that amazon.it says that at present it is not available. Possibly it may be found on the second-hand market. The documentary was aired, not long ago, by a national television in Italy (Rete 4). The DVD has some supplementary material besides the television documentary. I have once found the entire documentary online in a Russian site but it was spoken in Russian.\n\n","date":"October 18, 2014 at 6:05 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163593","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"Thanks for the tip. I shall try to find a way to get a copy.\n\n","date":"October 18, 2014 at 6:55 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163608","author":"Louis","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"Hot tip from the latest research!! I was indeed wrong about what “the worst way” meant. It appears that it is an obscure American idiom, unknown in British English, meaning “very much.” There is an British English expression “very badly” which means the same, so I can hardly object; I just didn’t know the American expression. Although I think I would still have been confused if John had said that “everybody wanted the shroud to be dated very badly”!\nExcept, the rest of the quotation above now doesn’t make sense; “Nearly everybody wanted to carbon date the Shroud [very much] and that is precisely what happened.” Nope. Still confused. I bet the rest of you are too, now!\n\n","date":"October 19, 2014 at 12:43 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163787","author":"Hugh Farey","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"Hugh,\nIt’s called irony and it involves a play between wanting something in “the worst way” and then when you get it, performing “in the worst way.” Dan’s posting of the story about Abraham Lincoln asking Mary Todd, the future Mrs. Lincoln to dance because he wanted to dance with her in “the worst way” and then he danced with her, dancing “in the worst way.” in a more literal sense.\nI don’t see the mystery of what the second part means. Using your phrase “very badly” it meas that the radio carbon labs wanted to do the tests “very badly” and then performed the tests “very badly.” You may disagree, a great many wold not.\nCall me a Yankee or a Rebel, but I like the turn of phrase as it was used by Mary Todd Lincoln. As I said, it’s called irony, at least on this side of the Pond.\n\n","date":"October 19, 2014 at 2:01 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163808","author":"John Klotz","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"Yes, got it. When I read the Lincoln quote I thought he meant he meant “with the worst possible motives” involving lascivious intentions! That turned out to make sense too, I suppose!\nPS. Loving the book. I disagree with quite a lot, as you can imagine, but I like the breadth of scholarship and the style of writing. Well done, Sir.\n\n","date":"October 19, 2014 at 2:12 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163812","author":"Hugh Farey","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"I do not expect I, or anyone else, would convince you. Giving it a fair reading is all I can expect.\n\n","date":"October 19, 2014 at 2:28 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163816","author":"John Klotz","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"Why not just test it again? I suspect the Vatican’s scientific advisers know the game would be up. They’d rather keep it as a possible ‘genuine’ relic. The tests were sound. It’s an obvious fake. The ‘theories’ get more and more preposterous. Earthquake induced radiation. Anti matter reaction. Now it’s gone quantum. Whenever a non scientist starts to use ‘quantum’ you know you’re knee deep in utter foolishness.\n\n","date":"October 19, 2014 at 7:20 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163862","author":"aljones909","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"Spoken like a true follower of Jerry Coyne. And just like Jerry, you fail by generalizing and clumping every shoroudie scientist in the fringe.\n\n","date":"October 19, 2014 at 7:51 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163869","author":"Eric","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"* shroudie\n\n","date":"October 19, 2014 at 7:53 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163871","author":"Eric","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"“generalizing and clumping every shoroudie scientist in the fringe”\nShroud ‘science’ is a pseudo-science. A diligent band of non scientists – or scientists operating outside their field of expertise. Regarded as ‘authorities’ by the faithful. The most far fetched ideas are given credence (anti-matter, neutrons, bilirubin, quantum mumbo jumbo). It’s not science at all. It’s religion with a thin veneer of scientific gobbledy-gook. Nuclear scientists and engineers armed with millions of dollars worth of equipment furiously gathering meaningless data when a measuring tape is all that’s needed to show it’s a fake.\nRogers was an honourable exception – until he seized on the crackpot theory of ‘shroud experts” Benford and Marino (qualifications – registered nurse and BA in theology). Here’s the blurb from her book:\n“M. Sue Benford is a registered nurse, health care researcher, and Executive Director of a non-profit biomedical organization in Ohio. Her education is diverse, from the in-depth study of religion to pursuing scientific testing of unexplained paranormal phenomena, e.g., the Shroud of Turin, pyramid energies, alternative healing energies, crop circles, and Spontaneous Human Combustion.\nBenford’s experiences with psychic phenomena are responsible for the redirection of her life into the pursuit of spiritual enlightenment.  In 1997, she contacted Fr. Joseph Marino, a Benedictine Monk and Catholic Priest at a St. Louis Abbey. Their divinely inspired meeting, and subsequent joining as life partners, served a research liaison that is credited with uncovering vital information leading to the authentication of the Shroud and, quite possibly, proving the existence of the soul. ”\nIt’s all there. Shroud science, pyramid energy, crop circles and spontaneous human combustion.\nHere’s the best description of the STURP crusaders from reporter Michael Thomas:\n“mad Faustian defenders of the faith dreaming up hardware that make Hiroshima look like a love bite……\n[they work on] hunter-killer satellites and directed energy weapons like satellite launched high-energy lasers and particle beams that convert a couple of kilotons of underground blast into a 100 billion billion angry protons beaming through the atmosphere that will obliterate all known matter and leave no trace in the time it takes some idiot to press a green button.”\n[they’re in Turin] “with their glossy little wives and eerie kids……the reason they’re here is to raise Jesus Christ from the dead.”\n\n","date":"October 28, 2014 at 8:10 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-166356","author":"aljones909","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"Don’t you know why he thought the C14 corner had been manipulated?\n\n","date":"October 29, 2014 at 1:42 am","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-166442","author":"anoxie","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"“Don’t you know why he thought the C14 corner had been manipulated?” Yes, he believed the ‘invisible mending’ hypotheses by registered nurse Benford and Marino (BA in theology). He then found ‘evidence’ in his home laboratory using threads of unverifiable provenance. The chief shroud restorer of 2002, Mechthild Flury-Lemberg, ridicules the idea. See http://www.shroud.com/pdfs/n65part5.pdf\n“The real reason for the theory has been the desire to find a plausible explanation for the unsatisfying result of the carbon-14 analysis. Similar wishes, although understandable, have lead all too often in the history of the shroud to untenable theories. ..\nits weaving structure is cohesive and untouched even at the corners. Therefore at no time has the need to reinforce the corner parts arisen!”\nShe goes on\n“Answers to these questions are lacking in the hypothesis of Benford/Marino and Rogers. They can only be given in a competent way by textile experts. One of them, who was present when the sample was taken, the late Gabriel Vial, confirmed repeatedly that the sample was taken from the original cloth!\nThis affirmation seems to be unacceptable to a natural scientist even if it comes from such an excellent textile scholar as Gabriel Vial who moreover made this judgment in his very own field of expertise.\nIn any case, neither on the front nor on the back of the whole cloth is the slightest hint of a mending operation, a patch or some kind of reinforcing darning, to be found,” \nShe then, sadly, commits the same sin for which she condemns Rogers. Straying miles from her own field she speculates that the collected grime could have skewed the C14 result. If only the scientists at 3 world renowned laboratories had thought of cleaning the samples!\n\n","date":"October 29, 2014 at 7:18 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-166706","author":"aljones909","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"What’s your field of expertise Al Jones?\n\n","date":"October 29, 2014 at 8:36 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-166714","author":"David Goulet","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"“What’s your field of expertise ?” I wouldn’t claim to have an area of expertise. A little digging below the surface is all that’s required to expose the true nature of ‘shroud science’. The most outlandish ideas given undue reverence I’ve already talked about Benford and Marino (registered nurse and BA in theology). We see the likes of Isabel Piczek praised for her insightful articles. Naively accepted as a ‘particle physicist’ by shroudies.\n“The entire Resurrection process is akin to the Big Bang creation of the universe when something was created from nothing,” explains Piczek. “You can read the science of the Shroud, such as total lack of gravity, lack of entropy (without gravitational collapse), no time, no space—it conforms to no known law of physics.”\nShe then goes on about time reversing, black holes, event horizons and quantum effects.\nNo sense of embarrassment at her parroting of some ‘sciencey’ words she has heard. Jesus has gone quantum. \nLets see how qualified she is. Must have written lots of papers (while doing her day job as an artist). No – nothing. A big fat zero. No papers. No teaching position. No idea what she’s talking about. An old, batty, catholic lady feted as a scientist. \n.\n\n","date":"October 30, 2014 at 7:42 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-166992","author":"aljones909","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"Oh Al, you commit the same sin that you condemn. You came here parroting the skeptic crowd without cutting the shroudies any slack. I will let the ones posting in here do introductions and list their credentials… But before that happens, know that this is not a cheerleading site. However, I will grant that most of the information and so-called “theories” reported by the media are pretty fantastic and fringe. \nAlso, not every one of those that publicly state their belief have any sort of religious motive. Barrie is probably the best example to prove otherwise and if you actually bother to reach him, just as you used his website, I am sure that he will have an interesting take on what does and does not fall into the fringe in his view.\nAnd don’t get me wrong, I have criticized several instances of pseudo-science, if you go back a few weeks back you will find my opinion about the “irradiation” hypothesis and more recently, I was forced into a week-long argument regarding this -very odd- case of a pseudo-medical claim. With that said, claiming that *all* science dealing with the shroud is pseudo-science is ridiculous, we have people here that are actually testing the different ideas that emerge, others examining the properties of the cloth… Not every one of the shroudies is “out there” in the fringe and by minimizing those that are not, you are also mocking the work of the skeptics that post here. Since it is so “obvious”, then they are surely wasting their time, right? And boy, are they mediocre if they can copy something that is so *obviously* a fake! No, it may very well be fake, but it is one interesting and rather complex fake. Trying to understand its properties is not any more pseudo-scientific that studying the subtleties of a lost artist by studying his work.\nIn other words, try to avoid the Coyne mistake of being ever so pretentious and at least try to test the waters first.\n\n","date":"October 30, 2014 at 10:10 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-167024","author":"Eric","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"* if they CAN’T copy\n\n","date":"October 30, 2014 at 10:12 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-167025","author":"Eric","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"Oh, by the way, I believe that the last time that I saw Piczek mentioned here was in late 2013. At least, most of the shroudies rarely quote her, in the same way that few skeptics still quote McCrone (albeit Charles is trying a comeback).\nStill, at least her wild claims had the weight of having earned a degree. Which is why it was at least fairly evaluated, before falling into obscurity. Yours (admittedly) was in what, Google searching? If you fail to establish that you even have the educational baggage, then you surely can’t expect to be taken seriously when you come in guns blazing and trying to put labels… Because even those loonies have an expertise that outranks yours.\n\n","date":"October 30, 2014 at 10:30 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-167035","author":"Eric","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"Qualifications? A humble physics degree – and I don’t expect to be taken seriously by the religiously committed. I have no interest in how the image was formed although I recognise that it is probably of interest to art historians. I’m just trying to put across a simple fact. The elephant in the room for shroudies – the carbon dating is conclusive proof it’s a fourteenth century artefact. There is no serious science that challenges that.\n\n","date":"November 1, 2014 at 7:47 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-167767","author":"aljones909","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"“Still, at least her wild claims had the weight of having earned a degree.” In what?\n\n","date":"November 1, 2014 at 8:11 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-167772","author":"Hugh Farey","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"There we go. Exactly which branch of I may b so bold to ask?\nBTW, I was not trying to criticize your belief in the C14 testing, just your  assumptions. Everybody in here has a different opinion, I am mostly interested in the formation processes and the possibility that medical knowledge was more advanced -at least by the 1300s- than we think. If you want to support that, go ahead, but try to ‘shroud’ your bias a little. By avoiding the pretentiousness and accusations in your first post, at least you would avoid being treated like an ordinary troll.\n\n","date":"November 1, 2014 at 8:45 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-167775","author":"Eric","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"@Hugh\nIn art history AFAIR (don’t ask me how that evolves into “PPs”). Is it really relevant to her extrambotic hypothesis? No. But by at least knowing that she had a degree, people discussed her work. Why? Because she was introduced properly and took the time to make an attempt at a paper that backs up her claims. She did not come out of the blue and posted some bold assertions in a forum. Which was my point. \nThe fact that she was completely out of her element did not prevent her work from being discussed (Charles is way out of his by placing all of his work on top of the “gesso” argument. His conclusion was reached without any scientist’s help, and he is as bold as to claim that this work overcomes real scientists based on logic… Yet it is still being seriously discussed) while other works such as the “lirey toga” fiasco of last week passed pretty much undiscussed. The degree, as unrelated as it is, allows some people to gravitate towards her and support her work… And the other camp to respond. And thus, the discussion follows.\nNot that I find the logic of your question, since she is not really a key component of any serious debate and I sure wasn’t defending her.\nPD- Scratch the several months of not being mentioned, as Mike just quoted her paper >.<\n\n","date":"November 1, 2014 at 9:23 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-167782","author":"Eric","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"* “Exactly which branch of psychics, if I may be so bold.”\n\n","date":"November 1, 2014 at 9:28 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-167784","author":"Eric","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"“Exactly which branch of PSYCHICS, if I may be so bold.”\nIf it had been psychics I could be making good money from the gullible.\nIt was ‘applied physics with no particular specialisation.\nI don’t claim to be a scientist or have particular expertise. My career has been in IT.\nYou said about Piczek “The fact that she was completely out of her element did not prevent her work from being discussed ”\nIt should have. That’s what separates real science from pseudoscience.\n\n","date":"November 2, 2014 at 7:56 am","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-167887","author":"aljones909","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"Aljones. Yes, I am as bemused as you  are by some of these claims –  but the Church does not claim that the Shroud is a genuine relic. After all it commissioned the radio carbon dating of 1988 and has never repudiated it. If the Church was claiming it was a genuine relic, then I would be in deep trouble with my new article that argues for a medieval origin. They would claim that I was undermining the exposition when, in fact, I am giving extra reasons for visiting it -in that the Shroud may well be the only survivor from the Easter ceremonies when they held up a grave cloth to show that Jesus had risen.\nI organise tours to the Mediterranean – we actually did Turin last year- and there are large numbers of tours being organised to visit the Shroud – many of which will make very good money for their organisers. ( Only us insiders know how much mark-up there often is on the actual cost of arrangements.)  It will be interesting to see if the tour promoters  claim, beyond what the Church, and so one assumes the organisers of the exposition, itself claims, that they will see the real thing.\n\n","date":"October 20, 2014 at 1:44 am","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-163937","author":"Charles Freeman","site":"shroudstory"},{"title":"Quote for Today on Carbon Dating of the Shroud","post":"Isabelle Piczek is a self declared particle physicist and a trained artist.\n\n","date":"November 2, 2014 at 9:54 am","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","id":"comment-167902","author":"Paulette","site":"shroudstory"}]
