[{"title":"Dates for 2010 Exhibition of the Shroud of Turin","post":"Hi shroudies\nI´m a member of Centro Portugês de Sindonologia ( it´s a center for Shroud studies in Portugal that´s the country where last Savoy´s owner of the relic died in exhile ).\nIt´s a great joy for all portuguese Shroud devoutees to have soon the happyness to contemplate the face of our Saviour as He left His imprint to testify the Resurrection.\nWe hope our good american friends who without any material profit allow access to so wonderful and reliable information in their websites have new scientific information about Ohio Shroud Conference .\nI´m very curious about what skeptics will claim…\nPerhaps they´ll say again that´s pseudoscience…\nWe are planning to make new Shroud activities next Lent \n                                          c   you\n                          greetings \n                       Maria da Glória\n\n","date":"August 20, 2008 at 7:28 pm","url":"https://shroudstory.com/2008/08/20/dates-for-2010-exhibition-of-the-shroud-of-turin/","cat":"2010","id":"comment-2","author":"Maria da Glória Gonçalves Barroso","site":"shroudstory"},{"title":"Dates for 2010 Exhibition of the Shroud of Turin","post":"Hello Maria da Gloria,\nI am very much pleased to hear about the Exhibition 2010 of Shroud of Turin. I am of the opinion that this is the genuine cloth in which Holy Jesus Was wrapped after removing from the Cross. The picture was formed by the Special Ointment rubbed on the body of the Jesus. This ointment is said to have some volatile components, which evaporated by the heat of the body and were absorbed or deposited on the cloth. This further indicated that The Holy Jesus was alive at that moment, otherwise cold body had not evaporated the ointment rubbed on his body. Only a hot body can do it. The appearance of negative image on the shroud is the scientific proof that he never died on the cross and Romans / jews failed to kill him. His prayer was accepted by the Father God and he was spared from disgraceful death. Please read the book ‘Jesus Papers’ which details life of Jesus after crucifaction.\nThe Jesus lived about 120 years, as per some stories and died in Kashmir India. His Tomb has been discoverd in Sari Nagar Kashmir, India.\nBest Regards,\nAyaz.\n\n","date":"January 2, 2010 at 12:44 am","url":"https://shroudstory.com/2008/08/20/dates-for-2010-exhibition-of-the-shroud-of-turin/","cat":"2010","id":"comment-911","author":"Ayaz Ayaz","site":"shroudstory"},{"title":"Dates for 2010 Exhibition of the Shroud of Turin","post":"Thank you for that Ayaz it is really funny. Assuming that you are not from the Indian tourist board the only other conclusion is serious delusion.\n\n","date":"April 2, 2010 at 3:40 pm","url":"https://shroudstory.com/2008/08/20/dates-for-2010-exhibition-of-the-shroud-of-turin/","cat":"2010","id":"comment-1223","author":"paul","site":"shroudstory"},{"title":"Dates for 2010 Exhibition of the Shroud of Turin","post":"I believe Jesus lived in India, not sure to age 120 though?\nYou should read the book ‘Jesus Lived in India’ then decide who’s deluded?\nYou could also read some genuine books on Sathya Sai Baba and then maybe you’ll wake up a bit\n\n","date":"April 7, 2010 at 2:28 am","url":"https://shroudstory.com/2008/08/20/dates-for-2010-exhibition-of-the-shroud-of-turin/","cat":"2010","id":"comment-1234","author":"Peter","site":"shroudstory"},{"title":"Dates for 2010 Exhibition of the Shroud of Turin","post":"Dear Paul,\nMay God Bless you with better and impartial intellect.\nThank you for your comments,\nToday these look funny, but 100 years later, these will look facts, overlooked by researchers. Look into the literature which details formulation of this Ointment for Holy Jesus Christ. You will be forced to look into this puzzle, in my way.\nThanks,\nAyaz.\n\n","date":"April 7, 2010 at 3:42 pm","url":"https://shroudstory.com/2008/08/20/dates-for-2010-exhibition-of-the-shroud-of-turin/","cat":"2010","id":"comment-1235","author":"Ayaz","site":"shroudstory"},{"title":"Dates for 2010 Exhibition of the Shroud of Turin","post":"I believe what’s written in the Bible. No second opinion is required. We all an immagination, but, the truth as written by the apostle remains forever\n\n","date":"April 9, 2010 at 9:26 pm","url":"https://shroudstory.com/2008/08/20/dates-for-2010-exhibition-of-the-shroud-of-turin/","cat":"2010","id":"comment-1242","author":"Gianni LaRosa","site":"shroudstory"}]
