[{"title":"An Oh-So-True Observation","post":"“it is widely accepted that the Shroud of Turin is the single, most studied artifact in human history”\n(Lloyd A. Currie, PhD NIST Fellow Emeritus in the Chemical Science and Technology Laboratory. Journal of Research of the National Institute of Standards\nVolume 109, Number 2, March-April 2004)\nI think it’s fair to say that it’s the most studied and discussed artifact.\n\n","date":"April 27, 2014 at 4:29 pm","url":"https://shroudstory.com/2014/04/27/an-oh-so-true-observation/","cat":"news_&_views","id":"comment-104468","author":"Mike M","site":"shroudstory"},{"title":"An Oh-So-True Observation","post":"Even Turin would agree that there is much to be systematically investigated, that being one of the reasons why the material obtained during the controversial restoration is carefully stored.\n\n","date":"April 27, 2014 at 5:26 pm","url":"https://shroudstory.com/2014/04/27/an-oh-so-true-observation/","cat":"news_&_views","id":"comment-104478","author":"Louis","site":"shroudstory"},{"title":"An Oh-So-True Observation","post":"There is an underlying premise that the Shroud has been pored over scientifically, almost to the point of exhaustion.  I don’t believe that’s truly the case.   Hence, the comment in a previous posting. No disrespect intended to Dr. Currie.\n\n","date":"April 27, 2014 at 7:22 pm","url":"https://shroudstory.com/2014/04/27/an-oh-so-true-observation/","cat":"news_&_views","id":"comment-104520","author":"Kelly Kearse","site":"shroudstory"},{"title":"An Oh-So-True Observation","post":"Kelly, I understand. Just the fact that there is so much more to be done (after all the work that has already been done from 1902-2014) adds to the fascination with the Shroud. How a piece of linen cloth challenges our understanding and demands so much study is beyond comprehension.\n\n","date":"April 27, 2014 at 7:30 pm","url":"https://shroudstory.com/2014/04/27/an-oh-so-true-observation/","cat":"news_&_views","id":"comment-104526","author":"Mike M","site":"shroudstory"},{"title":"An Oh-So-True Observation","post":"Is the Shroud of Turin the most studied artifact in human history ?\nI don’t agree on that false statement !\nSee also : the lack of SPM studies and the claims on radiations, etc. !\nThere is a lot of work to do …\n— — —\nFor example :\nHere an unsolved problem connected to the paper\nby Thibault Heimburger\n(https://shroudofturin.files.wordpress.com/2012/10/scorch-paper-en.pdf)\nThis problem is the finite element discretization of heat transfer equations\nand then (taking into account the different heat conduction values for : cellulose, hemicellulose, lignin and pectin…) we have to try to sketch the exact temperature distribution into the linen fibril …\n\n","date":"April 28, 2014 at 11:14 am","url":"https://shroudstory.com/2014/04/27/an-oh-so-true-observation/","cat":"news_&_views","id":"comment-104960","author":"Piero","site":"shroudstory"},{"title":"An Oh-So-True Observation","post":"Much of what is done is carried out on a part-time basis by voluntary enthusiasts, all with other priorities and life commitments. The only way ahead for a major push is to interest a corporate or philanthropic foundation to provide adequate funding.  Identifying the benefits to encourage such funding would be a major challenge in creative thinking.\n\n","date":"April 28, 2014 at 5:55 pm","url":"https://shroudstory.com/2014/04/27/an-oh-so-true-observation/","cat":"news_&_views","id":"comment-105174","author":"daveb of wellington nz","site":"shroudstory"},{"title":"An Oh-So-True Observation","post":"“Much of what is done is carried out on a part-time basis by voluntary enthusiasts, all with other priorities and life commitments. The only way ahead for a major push is to interest a corporate or philanthropic foundation to provide adequate funding. Identifying the benefits to encourage such funding would be a major challenge in creative thinking.”\nPerhaps a radical idea, or maybe not, If the Church itself actually took the lead, to authorize testing for the purpose of more fully understanding what the Shroud may or may not be.  Whether or not the interest is there in taking it more forward on a scientific level, who knows?  The Pontifical Academy of Sciences has an impressive roster, including multiple Noble laureates in various, relevant disciplines, more than capable of spearheading a type of feasibility study to consider the possibility of further testing with current technology, if the Church so desired.  Not that any in the above quote should assume a holding pattern until such a directive is issued, it may never happen.  Funding for Shroud-related studies from a corporate or philanthropic foundation would be a major push-have any such sources earmarked for “Shroud grants” existed in the past?\n\n","date":"April 30, 2014 at 6:53 am","url":"https://shroudstory.com/2014/04/27/an-oh-so-true-observation/","cat":"news_&_views","id":"comment-106642","author":"Kelly Kearse","site":"shroudstory"},{"title":"An Oh-So-True Observation","post":"David Rolfe succeeded in raising $500,000 for film “Silent Witness”, a record amount for a documentary at that time. After the film’s release, he also obtained an advance of 25,000 English pounds remitted as seed money to the Shroud Guild for STURP project team that John Jackson was gathering together at the time.  Subsequently Thomas D’Mulhala of Nuclear Technology and various others acquired by gift or loan $2.5 million worth of analytical equipment and devices for shipping to Turin for use by STURP team.  John Klotz may have further details.\n\n","date":"April 30, 2014 at 4:15 pm","url":"https://shroudstory.com/2014/04/27/an-oh-so-true-observation/","cat":"news_&_views","id":"comment-107114","author":"daveb of wellington nz","site":"shroudstory"}]
