[{"title":"Ray Downing of “The Real Face of Jesus?” TV Documentary received an Emmy for “Stealing Lincoln’s Body”","post":"Enjoyed the show regarding the shroud of turin.  Ray Downings’ effort to bring the face dimension is a great effort but he looks too good.  Scripture tells us that he actually was not a comely man.  The pictures we see in this day and age of jesus always portray him as rather handsome because that is what we like to see.  Also the face you are portraying doesn’t look at all like the shroud.  The face in the shroud is definitely not comely but I believe it is definitely Jesus.\n\n","date":"April 24, 2011 at 6:04 pm","url":"https://shroudstory.com/2010/09/30/ray-downing-of-the-real-face-of-jesus-tv-documentary-received-an-emmy-for-stealing-lincolns-body/","cat":"news_&_views","id":"comment-3012","author":"Denise Robinson","site":"shroudstory"},{"title":"Ray Downing of “The Real Face of Jesus?” TV Documentary received an Emmy for “Stealing Lincoln’s Body”","post":"I was impressed by the History International showing of the Real Face of Jesus with Ray Downing’s fantastic work. In opposition to Denise Robinson’s comment, I don’t remember ever seeing anything in the Scriptures about what Jesus looked like. He was loving and king to people in need, he became angry with the money changers in the Temple, He exorcised demons who inhabited bodies of victims, He knew hunger and thirst, and all of these features showed up on Ray Downing’s rendition of Jesus’ face in three dimension. For years I’ve had a picture of Jesus of the Shroud and when you viewed the picture from a different angle, it changed into the artist’s idea of what Jesus of Nazareth looked like. Ray Downing’s 3D image is what I would thing Jesus looked like. Do I believe it is the shroud of Jesus? Absolutely. Those who believe need no further evidence, and those who do not believe would hold this stance regardless of the amount of evidence to the contrary. That’s why they call it FAITH.\n\n","date":"June 1, 2011 at 11:58 pm","url":"https://shroudstory.com/2010/09/30/ray-downing-of-the-real-face-of-jesus-tv-documentary-received-an-emmy-for-stealing-lincolns-body/","cat":"news_&_views","id":"comment-3212","author":"Rosalie Giansante","site":"shroudstory"},{"title":"Ray Downing of “The Real Face of Jesus?” TV Documentary received an Emmy for “Stealing Lincoln’s Body”","post":"I thought the representation was probably very close. It looked like a good looking “Middle-Eastern” man in his early 30s.; not the reddish-hair, Indo-European man that we have grown accustomed to seeing in most paintings.\nGreat Work!\n\n","date":"July 16, 2012 at 10:56 am","url":"https://shroudstory.com/2010/09/30/ray-downing-of-the-real-face-of-jesus-tv-documentary-received-an-emmy-for-stealing-lincolns-body/","cat":"news_&_views","id":"comment-13896","author":"Tony Filipone","site":"shroudstory"}]
