[{"title":"Regrettably","post":"I was editing a picture of the four Beasts of the book of Revelation yesterday: trying to turn a black and white image into one with some color. The lion with wings, the bear, the cat with several heads and of course the fearsome Beast with all those nasty horns, especially the large horn with the arrogant, blasphemous speech. I don’t know what these beasts mean, I think the book of Revelation is frustrating with it’s odd symbolism. But I do think that the large prominent horn with the big bold ugly haughty blasphemous speech surely seems to represent modern day Atheism.\n\n","date":"March 12, 2012 at 2:31 pm","url":"https://shroudstory.com/2012/03/12/regrettably/","cat":"news_&_views","id":"comment-9260","author":"AnnieCee","site":"shroudstory"},{"title":"Regrettably","post":"And don’t forget that Stephen Jones is a “a boil on the bum of the blogosphere,” LOL. Honestly, I’ve sort of come to appreciate Colin’s writings as bombastic self-parody, but I can see why people trying to have a serious conversation would be less amused by it.\n\n","date":"March 12, 2012 at 2:49 pm","url":"https://shroudstory.com/2012/03/12/regrettably/","cat":"news_&_views","id":"comment-9261","author":"The Deuce","site":"shroudstory"},{"title":"Regrettably","post":"It seems ColinB, who claimed to be skeptical, advocates a conspiracy theory.\n\n","date":"March 12, 2012 at 3:01 pm","url":"https://shroudstory.com/2012/03/12/regrettably/","cat":"news_&_views","id":"comment-9262","author":"anoxie","site":"shroudstory"},{"title":"Regrettably","post":"Lighten up folks  edited by moderator\n\n","date":"March 12, 2012 at 4:34 pm","url":"https://shroudstory.com/2012/03/12/regrettably/","cat":"news_&_views","id":"comment-9264","author":"colinsberry","site":"shroudstory"},{"title":"Regrettably","post":"“Dr. Collins [Berry] has tried to prove superficiality possible by scorching an onion skin laid over linen. What folly. If you will but toss a bit of linen and an onion skin into a fry pan you can see why. The onion skin turns brown quickly. I suspect that it caramelizes at lower temperatures and much faster than linen scorches. You just don’t mess with different materials without testing or researching, not if you are a good scientist.”\nWell, there is a simple experiment I can do, or rather refine, to address that criticism. I shall simply press the hot template down with part in contact with onion epidermis, and part in contact with linen. When I have a faint or even strong imprint on the linen, i shall then peel back the onion epidermis to see if it has protected the underlying linen. I believe it should be possible to produce that result, based on some existing results of mine, unpublished, where there is very faint, incipient scorching of linen, but heavy scorching of epidermis. Yes, the epidermis does scorch more readily. I have already acknowledged that, and suggested that different chemistry operates – forming Maillard sugar-protein reaction products and pyrolysed hemicellulose/cellulose respectively.\nHowever, i shall add that experiment onto the end of the post describing the onion skin data. I shall not be discussing science here in future in view of the  pre-moderation/editing policy now in force to say nothing of general unpleasant backbiting tone of many of the comments.\n I must also ask Dan to desist from pirating pictures and text off my site describing my original research, at least until a decent time period has elapsed, say 1 week. Would it not be courteous, to say the least, to write a brief summary and provide a link to my own site?  \nColin Berry\n\n","date":"March 12, 2012 at 9:00 pm","url":"https://shroudstory.com/2012/03/12/regrettably/","cat":"news_&_views","id":"comment-9270","author":"colinsberry","site":"shroudstory"}]
