[{"title":"Rejecting Authenticity Out of Hand","post":"So I presume these Protestant Christians also reject the miracles of Jesus described in the New Testament.  That is a popular theme among revisionist Christians (who really should find a new name for themselves) who like to assert such claims as that the miracle of the loaves and fishes was just the power of Jesus’ personality inducing the crowd to share what they had intended to keep for themselves.  Presumably, the resurrection itself must be suspect if it is not possible that the Shroud was miraculously left behind as photographic evidence of Jesus’ reality, suffering and resurrection.  \nOn the other hand, of course, their opinion may simply be a kind of subconscious residue of a general discrediting of religion by science so that the only thing left to support religious beliefs is our “faith.”  If so, some of them may turn out to be open to a persuasive presentation on the Shroud.  It would also serve them well to read Dr. Frederick Zugibe’s book, “The Crucifixion of Jesus: a Forensic Inquiry” (2005).\nThe one amusing thing in the group’s opinion is the belief that the Shroud cannot be real despite the carbon-14 dating when the results of that testing in 1988 purported to prove that the Shroud was, in fact, not a real artifact that wrapped the body of Jesus.  Obviously, this group is woefully uninformed about multiple things.  Their views also lend support to those who say we should just forget about further carbon-14 dating since it would just be rejected out of hand by those who refuse to believe.\n\n","date":"May 24, 2015 at 4:57 pm","url":"https://shroudstory.com/2015/05/24/rejecting-authenticity-out-of-hand/","cat":"news_&_views","id":"comment-200097","author":"Jim Carney","site":"shroudstory"},{"title":"Rejecting Authenticity Out of Hand","post":"I was born as a Methodist. But I attended most of the protestant Churches on Sundays as well as Roman Catholic Church Masses. Protestant Churches condemn Mother Mary as well as Images and also they give higher status to Epistles of Paul than the teachings of Jesus.\nFurthermore they don’t know the meaning of the parable of Goats and Sheep. They give higher value to Grace than the “New Commandment of Love” given by Jesus. Or they think believing in Jesus is more important than the things Jesus asked us to do to enter into the Kingdom of God. That is why there are more than 41, 000 denominations of Protestants. These Protestants compete with each other for power. That is why they carry the message of Grace. \nYes Protestants sometimes reject the miracles performed by Jesus. \nOn the other side of the story once St Mary’s Cathedral Sydney refused give me Holy Communion (or Eucharist) on 2014 Ash Wednesday. I was saddened by that event and stop calling myself as a Christian. Now I am only a follower of Jesus without any denomination.\nI am giving priority to teachings of Jesus over any other teachings or writings. So for me Shroud of Turin is the most important thing. Even I like to give more respect to the Shroud of Turin than the Holy Bible because Shroud of Turin show the Love of God and how Son of God suffered for us.\n\n","date":"May 24, 2015 at 5:44 pm","url":"https://shroudstory.com/2015/05/24/rejecting-authenticity-out-of-hand/","cat":"news_&_views","id":"comment-200103","author":"Sampath Fernando","site":"shroudstory"},{"title":"Rejecting Authenticity Out of Hand","post":"Don’t let anyone, whether they call themselves Catholic, Protestant, or just Christian, affect your relationship with Jesus.  I have been a Catholic all my life and I strongly believe in the sacraments and that they can be traced to Jesus through the apostles.  But I have also known a lot of jerk priests, too.  Ignore them.  I do not accept the Church’s teaching on artificial birth control and believe that using that position to oppose the huge extension of health care (“Obamacare”) for millions of people in America is a travesty.  Talk about the “goats and the sheep.”  They should read Matthew 25 every day until they realize the few things Jesus enumerates as specific criteria for our salvation include providing health care for our “neighbor.”  You are free to follow your conscience.  In fact, you pretty much have to do so.  \nThe Catholic Church believes  that the Sacrament of the Eucharist is the true body and blood of Jesus.  So do I.  Because of this, some churches and priests get carried away with trying to make sure no one receives communion who is not a registered Catholic.  Personally, I don’t think Jesus is upset when a person of faith receives the Eucharist.  That is the relationship you have with him and you should follow your conscience on it.  Of course, if you believe in the Eucharist as Catholics do, you might want to consider becoming a Catholic.    \nBut if you are “gay,” of course, and in a homosexual relationship, the Catholic Church excludes you from membership.  Well, if homosexuality is your nature and not simply a choice, that is the way you are and I know that God loves you as much or more than me.  (I’m not suggesting you are gay, Sampath, since I don’t know you at all.  I’m just describing one of the many ways that Christ’s alleged representatives simply do not comprehend his message of love, compassion, forgiveness and inclusion.)  \nBut, like Thomas suggests below, the New Testament has far more for us than the Shroud of Turin.  The Shroud confirms what we are told there but says nothing else about the teachings of Jesus.\n\n","date":"May 25, 2015 at 7:12 pm","url":"https://shroudstory.com/2015/05/24/rejecting-authenticity-out-of-hand/","cat":"news_&_views","id":"comment-200188","author":"Jim Carney","site":"shroudstory"},{"title":"Rejecting Authenticity Out of Hand","post":"sampath fernando let me jump in here.  Anyone can go to the catholic church , gay, divorced, or not a baptized catholic.  You can go to the services and participate.  You just can’t receive communion.  Anyone in the state of mortal sin cannot receive communion.  They must go to confession first. Members know this.  If gays want to receive .communion they must change their way of living. Same goes for divorced people that co-habitate\n\n","date":"July 11, 2015 at 11:18 am","url":"https://shroudstory.com/2015/05/24/rejecting-authenticity-out-of-hand/","cat":"news_&_views","id":"comment-205254","author":"sampath fernando","site":"shroudstory"},{"title":"Rejecting Authenticity Out of Hand","post":"Yes, Sampath, that is the doctrine but understanding and applying it are not so simple.  For example, no one but God and the particular individual can say whether that individual has chosen to separate from God, which is what mortal sin means.  The tidy little catalog of “mortal sins” that the Church has promulgated over the centuries has become pretty pharisaic, in my opinion.  As for gays and the state of their souls, I do not believe that gays in a committed relationship are offensive to God even if they do engage in sexual activities.  As Pope Francis recently said, who are we to judge?  I ask two questions: (1) Where is the compassion for people who have the same desires as everyone else for a committed sexual relationship with another person but, because of a flaw in their nature, are attracted to persons of the same sex? (2) If people are genuinely homosexual by nature, why is it sinful for them to live like everyone else?  We make accommodations for all kinds of disabilities and handicaps.  Why not this one?\nI have been friends with many gay people in my lifetime.  Most of them have been warm and caring human beings.  I believe their lives have exemplified God’s call to love and service better than many heterosexual people I have known, even those who attend church regularly and regard themselves as upstanding Christians.  Love is the measure.  A lot of people are going to be very surprised in the next life to discover that people they were quick to condemn were pleasing in God’s eyes because of their loving hearts while many so-called righteous souls will find out they had little love in their own hearts.\n\n","date":"July 11, 2015 at 12:17 pm","url":"https://shroudstory.com/2015/05/24/rejecting-authenticity-out-of-hand/","cat":"news_&_views","id":"comment-205259","author":"Jim Carney","site":"shroudstory"},{"title":"Rejecting Authenticity Out of Hand","post":"One additional comment.  If you have committed a serious sin, you may receive communion before confessing that sin if your intent is to go to confession at your earliest reasonable opportunity and confess it.\n\n","date":"July 11, 2015 at 12:21 pm","url":"https://shroudstory.com/2015/05/24/rejecting-authenticity-out-of-hand/","cat":"news_&_views","id":"comment-205260","author":"Jim Carney","site":"shroudstory"},{"title":"Rejecting Authenticity Out of Hand","post":"This is a delicate topic and we must remember that the Cathecism of the Catholic Church says that we do not yet know about the genesis of homosexuality and Freud did not reach a definite conclusion.\nI personally do not discriminate depending on race, socioeconomic status, sexual orientation.\nThe Vatican focussed on Oscar Wilde not long ago:\n http://www.theguardian.com/books/2009/jul/17/vatican-embraces-oscar-wilde\nWe also know that he was a religious person, went for mass and benediction dozens of times although he belonged to the Church of Ireland and even believed he was cured — after a papal blessing — of the effects of food poisoning after eating mussels, which could have been fatal.\n\n","date":"July 11, 2015 at 1:34 pm","url":"https://shroudstory.com/2015/05/24/rejecting-authenticity-out-of-hand/","cat":"news_&_views","id":"comment-205267","author":"Louis","site":"shroudstory"},{"title":"Rejecting Authenticity Out of Hand","post":"Pope Francis correctly said, Who am I to judge?\nhttps://www.academia.edu/6085481/Why_was_Wittgensteins_burial_attended_by_a_religious_ceremony\n\n","date":"July 11, 2015 at 1:49 pm","url":"https://shroudstory.com/2015/05/24/rejecting-authenticity-out-of-hand/","cat":"news_&_views","id":"comment-205269","author":"Louis","site":"shroudstory"},{"title":"Rejecting Authenticity Out of Hand","post":"This year, both Australia and New Zealand are marking the centenary of the abortive ANZAC landings at Gallipoli in Turkey on April 25, 1915, during WWI .  The campaign was a major influence in shaping a sense of national identity in both countries.  We are seeing several TV documentaries and magazine articles from archives and records of soldier’ memories.  Recently there have been documentaries on the chaplains’ roles. \nIt seems that during both world wars, it was a common practice before battle for the Catholic padres accompanying the troops on the front lines to invite all who wanted to receive Holy Communion beforehand, regardless of their religious affiliation.  In fact the relationship between all the different padres generally seems to have been cordial and cooperative.  When the troops returned home after cessation of hostilities, they were disappointed to discover that the old sectarian differences had again resurfaced, and that the unity of purpose once evident in the thick of battle against the common enemy had now been set aside.  Some commentators have attributed this apparent hypocrisy as being one cause of a falling away from religion that occurred during the 20th century from the 1920s onward.   \nPerhaps we are seeing more of a sense of unity between the churches now, initiated by Pope John XXIII, and followed up by his successors, and also by the Second Vatican Council.  \nIn Wellington there is an Ataturk memorial, commemorating the conciliatory attitude of Kemal Ataturk, founder of modern Turkey, and victorious commander of the Turkish forces at Gallipoli.  It was largely through his efforts that has enabled access to the many ANZAC war graves there.  However in modern Turkey, it is now a different story, where the trend to Islamisation away from a secular state, seeks to downgrade the memory of Ataturk, and to attribute the Turkish victory solely to the will of Allah.  Such are the fickle perceptions and reactions of humankind, forgetful of the past, and mindful only of the aspirations of a moment.\n\n","date":"May 25, 2015 at 8:23 pm","url":"https://shroudstory.com/2015/05/24/rejecting-authenticity-out-of-hand/","cat":"news_&_views","id":"comment-200192","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Rejecting Authenticity Out of Hand","post":"Thank you Daveb. Although I am not belong to any denomination I am more aligned to Catholic Church than Protestant Churches. Even when Pope Francis gave his first Easter Message in Italian Language I was at Vatican.\nEverday I attended lunch time Mass at St. Mary’s Cathedral in Sydney. Althogh I am supporting Catholic version of Holy Communion, now I am reluctant to go and recieve it from the Catholic Church.\n\n","date":"May 25, 2015 at 9:57 pm","url":"https://shroudstory.com/2015/05/24/rejecting-authenticity-out-of-hand/","cat":"news_&_views","id":"comment-200199","author":"Sampath Fernando","site":"shroudstory"},{"title":"Rejecting Authenticity Out of Hand","post":"Why don’t you just go to the RCA study groups to learn the history and dogma of the church and the instructions needed to be a baptized member?  This is much needed to understand the catholic church.  Without this study you will not understand WH some people cannot take communion they(host).\n\n","date":"July 11, 2015 at 11:29 am","url":"https://shroudstory.com/2015/05/24/rejecting-authenticity-out-of-hand/","cat":"news_&_views","id":"comment-205255","author":"sampath fernando","site":"shroudstory"},{"title":"Rejecting Authenticity Out of Hand","post":"Hello Sampath:  On 27 May I received a message from Catherine Hilder, Director of the Catholic Catechumenate Centre in Sydney.  She tells me that she would be very happy to meet and talk with you about advancing the RCIA process if you so wish.  Her office is located at: Level 11 / Polding Centre /  133 Liverpool Street / Sydney;  Tel (02) 9307 8480; Email – rcia@sydneycatholic.org  –\nKind regards, Daveb\n\n","date":"July 11, 2015 at 3:37 pm","url":"https://shroudstory.com/2015/05/24/rejecting-authenticity-out-of-hand/","cat":"news_&_views","id":"comment-205282","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Rejecting Authenticity Out of Hand","post":"Bless you Sampath. Put your misgivings aside. You will find love and foregiveness in the Bible.\nVery sadly, many Christians fall well short of the behaviour Christ demands of us. I’ve seen plenty of shocking behavior from Church congregants. Often worse than non-Believers. It does make you wonder what Bible some of these people are reading.\n\n","date":"May 24, 2015 at 10:20 pm","url":"https://shroudstory.com/2015/05/24/rejecting-authenticity-out-of-hand/","cat":"news_&_views","id":"comment-200116","author":"Thomas","site":"shroudstory"},{"title":"Rejecting Authenticity Out of Hand","post":"This out of hand rejection is not limited to the categories of people discussed above.  In my experience, some people refuse to even accept the possibility it is authentic.  To be fair, there are people on the other extreme who insist it is authentic and will not even consider any evidence or appearance of evidence to the contrary.\n\n","date":"May 25, 2015 at 2:13 pm","url":"https://shroudstory.com/2015/05/24/rejecting-authenticity-out-of-hand/","cat":"news_&_views","id":"comment-200167","author":"Andy","site":"shroudstory"}]
