[{"title":"Remember When Nobody Had Heard of the Shroud of Turin?","post":"Unbelievable. Something is astir lads and lassies. I am reminded again of Yeats:\n The darkness drops again but now I know\n    That twenty centuries of stony sleep\n    Were vexed to nightmare by a rocking cradle,\n    And what rough beast, its hour come round at last,\n    Slouches towards Bethlehem to be born?\nOne of my theses in my manuscript is perhaps an allegory but may be real: Science is the vehicle of the Second Coming. Whether Christ or anti-Christ is up to us.\n\n","date":"August 4, 2013 at 10:00 am","url":"https://shroudstory.com/2013/08/04/remember-when-nobody-had-heard-of-the-shroud-of-turin/","cat":"humor","id":"comment-40425","author":"John Klotz","site":"shroudstory"},{"title":"Remember When Nobody Had Heard of the Shroud of Turin?","post":"It is good that the Shroud is used as a metaphor for anything mysterious.  Despite the reference however, there are still vast swaths of people, especially young people who are totally unaware.  Maybe they will take to Wikipedia to uncover the meaning.  Most however won’t make the effort. Kudos to all who do what they can to advance the knowledge of the Shroud.\n\n","date":"August 4, 2013 at 12:37 pm","url":"https://shroudstory.com/2013/08/04/remember-when-nobody-had-heard-of-the-shroud-of-turin/","cat":"humor","id":"comment-40431","author":"Russ Breault","site":"shroudstory"},{"title":"Remember When Nobody Had Heard of the Shroud of Turin?","post":"Russ, have you checked english wikipedia article about the Shroud? http://en.wikipedia.org/wiki/Shroud_of_Turin There are several guys, ncknamed FergusM1970 and Wdford, and perhaps a few other, who are actively working to make it a disaster, and and nothing more than anti-authenticity propaganda.\n\n","date":"August 4, 2013 at 1:07 pm","url":"https://shroudstory.com/2013/08/04/remember-when-nobody-had-heard-of-the-shroud-of-turin/","cat":"humor","id":"comment-40432","author":"O.K.","site":"shroudstory"},{"title":"Remember When Nobody Had Heard of the Shroud of Turin?","post":"I have not checked Wikipedia lately.  I just assumed it would be the first place many people would check.  Maybe we need to get more active on Wikipedia to set the record straight!\n\n","date":"August 4, 2013 at 11:18 pm","url":"https://shroudstory.com/2013/08/04/remember-when-nobody-had-heard-of-the-shroud-of-turin/","cat":"humor","id":"comment-40461","author":"Russ Breault","site":"shroudstory"},{"title":"Remember When Nobody Had Heard of the Shroud of Turin?","post":"So very true Russ. I have brought up the topic of the Shroud of Turin many times to many young people I am acquainted with, some older folk also, that have never even heard of the Shroud! A lot of these folk are also of the Catholic faith?…go figure. The fact that the Shroud exists, however it is brought up, is always a good thing.\nR\n\n","date":"August 4, 2013 at 1:15 pm","url":"https://shroudstory.com/2013/08/04/remember-when-nobody-had-heard-of-the-shroud-of-turin/","cat":"humor","id":"comment-40433","author":"Ron","site":"shroudstory"}]
