[{"title":"Responding Directly to Colin Berry","post":"So, if your objections to the radiocarbon dating are so genuine, well-informed and high-minded as you would have us believe Dan, why did you fail to respond directly to Brad Gore, one of the paper’s authors, instead of exposing him to further ridicule* on your site?\n* some of it, I might add, being chemically illiterate, and of questionable statistical literacy too\n Do you not think that your wholesale repudiation of the radiocarbon dating (see under “About” tab above) requires at least the courtesy of a reply to one of its authors, given he took the trouble to write, and did so in a gentle, quizzical, dare one say Christian manner?\nHere’s what he sent verbatim to this site some 5 years ago, under that same “About” tab, for which further comments were then closed (why????).\nSeptember 27, 2008 at 10:48 pm | #1\nExactly where is the data that discredits the Radiocarbon dating. Have other parts of the Shroud been dated for comparison. Is cotton vs. linen the only “evidence”. In other words are we still in need of information. And what the notion of a neutron flux at the resurection…as put forward in the issue of Nature with our shroud paper. Careful fellow humans for we are without the final truth and in a perfect creation we do not want to give out a dream of our own imagining as a replacement. As one of the original authors of the dating I am still waiting to see something interesting and have remained silent. I see many have a lot to say and seem to know all the secrets of the universe. Besides fragile human ego I see nothing so far. More will be revealed beyond the fragility of human nature …I pray.\nBrad H. Gore\n\n","date":"October 10, 2013 at 6:00 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46780","author":"colinsberry","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"I hadn’t seen this originally, being a latecomer to this blog. I was expecting a smoking gun. I got a rubber dart. Colin, Mr. Gore’s romantic comment is just that a comment, a vent. It’s a nice one. His ‘question’ is a rhetorical one. He seems quite aware of the arguments against the RCD and is stating aloud his opinion that they are weak. You give such great respect to this scientist – assuming he is above reproach — but have never given the same respect to any of the STURP scientists, especially Rogers. If you want to point out hypocrisy…\nWhy Dan closed the comments off, he will have to explain.\n\n","date":"October 10, 2013 at 7:30 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46803","author":"David Goulet","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"So, a scientist’s response to criticisms of his work have to be phrased in a manner that suits your own sensibilities and interpretation of motives if it is to be dignified with a reply. Maybe we scientists need to attend evening school classes on how to project ourselves in the public domain if we wish to be taken seriously on internet web forums.\nYou also seem to be saying that it for others to determine which scientists I should respect. Maybe they would like to do the background reading and research as well – it would save me so much time .\n\n","date":"October 10, 2013 at 7:41 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46806","author":"colinsberry","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"Here’s a reply I sent earlier, which seems to be stuck in “pre-moderation”, or which has been censored.\nLet’s see if it’s second time lucky.\nSo, a scientist’s response to criticisms of his work have to be phrased in a manner that suits your own sensibilities and interpretation of motives if it is to be dignified with a reply. Maybe we scientists need to attend evening school classes on how to project ourselves in the public domain if we wish to be taken seriously on internet web forums.\nYou also seem to be saying that it for others to determine which scientists I should respect. Maybe they would like to do the background reading and research as well – it would save me so much time\n\n","date":"October 10, 2013 at 8:39 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46818","author":"colinsberry","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"Colin, I have no idea why I didn’t reply to Brad Gore in 2008. Back then, when this blog was but an experiment, I didn’t give it much attention. And then, before I learned how to manage a blog, I often cut off comments as a way to block spam; to simply have the word “dating” in a posting or comment generates countless, automatically generated spam comments. That may have been why. But I don’t remember. You can be as suspicious as you want.\nThis blog and many sites document adequate reason to call the carbon dating I’m not going to restate them now. But let look at what I might have written to Gore (his text in bold).\nExactly where is the data that discredits the Radiocarbon dating. Perhaps discredits is the wrong word. Calls into question is a better way to put it. \nHave other parts of the Shroud been dated for comparison. Brad knows the answer. I wish they had been (or that they will be.\nIs cotton vs. linen the only “evidence”. That isn’t even a good reading of Rogers. Or Villarreal.  And the answer is no, anyway. The statistical evidence that the samples are not homogenous raises serious questions. The Blue Quad Mosaic does too. Why aren’t all the subsamples documented and the raw measurements detailed for each. Why wasn’t a full chemical characterization carried out on the samples (Yes, it wasn’t part of the protocol). \nIn other words are we still in need of information. Exactly. \nAnd what the notion of a neutron flux at the resurection…as put forward in the issue of Nature with our shroud paper. This is Red Herring. Personally, I think it is ludicrous. In fact, personally, I don’t “believe” that the Resurrection produced any energetic byproducts including light (UV too), heat, electrical, (earth, wind, fire and water, too) that created an image or rejuvenated the C14 content. There we go, now I’ve said it, and I have no words to explain why. But don’t get the idea that I think it is a fake. I don’t. \nCareful fellow humans for we are without the final truth and in a perfect creation we do not want to give out a dream of our own imagining as a replacement. I have no issue with that. And that is why scientists must listen to historians and philosophers. Maybe the Hungarian Pray Manuscript (just an example) begs us question scientific findings. \nAs one of the original authors of the dating I am still waiting to see something interesting and have remained silent. I see many have a lot to say and seem to know all the secrets of the universe. Besides fragile human ego I see nothing so far. More will be revealed beyond the fragility of human nature …I pray. Is there one person here who thinks he has all the secrets? Anyone with fragile human ego? I don’t think that is a fair criticism. \nBe suspicious if you want, Colin. I’d be suspicious if I had removed Brad’s comment. He had his say and now that we have thousands of people reading it, maybe someone else will comment as well. Thanks for bringing this out in the open.\n\n","date":"October 10, 2013 at 7:58 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46810","author":"Dan","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"Am busy right now – and a reply I composed to one point then disappeared, thanks to an automatic update on my laptop. What it said basically is that the dismissal of the radiocarbon dating on statistical grounds (lack of homogeneity etc) is a cheap shot, given that the three labs were fobbed off with a specimen from a corner that was then subdivided. If you want a valid statistical analysis that tells you something about the age of the entire Shroud, then you have to set up your sampling frame accordingly, and ensure that it is randomised. \nWhat you don’t do is give a tiny specimen, and then treat the rudimentary stats that accompanied the results as if they were reporting the age of the entire Shroud. They were simply reporting the age of the specimen provided. The stats are there simply to summarise lab-to-lab variation in testing the three contiguous specimens,where any systematic trends in results is nothing to do with the accuracy or precision of dating the entire Shroud, but to do with the fact that non-identical clean-up procedures were employed by the three labs.\nAll is not lost. While fobbed off with a single corner, the data constitute a ranging shot exercise that gives at least some of us a reasonable degree of confidence in AMS technology. Probably any one of the three labs is competent now to date the entire Shroud, given randomised sampling.\nWhat’s not needed on this persistent talk about “fiascos” from this site, or dark insinuations about collusion between labs to produce a false answer, or attempts to dismiss radiocarbon dating completely on the grounds that it cannot be reliably applied to fabric (Why not? Because the ranging shot result was not the one expected?  RIP scientific objectivity).\nFolk here would be pushing the Shroud custodians to approve Phase 2 radiocarbon dating, say with 5 or 6 random samples from non-image areas of the dorsal Shroud.  If anyone then wants to dismiss those results on non-scientific grounds (i.e. the imaging may have altered the ratio of C14 to C12?!) then extend the sampling to image-bearing zones, but I shall not be the one to propose that, not wishing to be accused of defacing a holy relic.\nIf they want to persist with objections based on hypothesised contaminants (unscientific if the contaminants are not specified) then take a sample of linen, solubilize the cellulose, reprecipitate, check it analyses as 100% glucose after hydrolysis, then re-date.\nIt’s time to cut to the chase – and stop all this slandering and demonising of the radiocarbon labs.\n\n","date":"October 10, 2013 at 9:24 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46825","author":"colinsberry","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"I post here what I posted on the other thread:\nThe impact of both tiny invisible mendings AND a 1st c. CE Judean purifying and drying specific burial ritual should be investigated to make sure “a little something” along the CD line has not been TOTALLY overlooked.\nThis is the one of the two cores of my 2007-2008 unpublished paper on the CD fiasco.\nReminder for Dr I. Colinsberry: Veritas est adaequatio rei et intellectus, “Truth is the adequation] of things and intellect” (Ninth Century neoplatonist Isaac Israeli’s).\n\n","date":"October 10, 2013 at 6:37 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46794","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"Correction: 1863 CE tiny invisible mendings\n\n","date":"October 10, 2013 at 6:39 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46795","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"dear Max,\nAre you sure for the mendings ?\nB.T.W. : … 1863 or 1868 ?\n— —\nSeeing the fingers of the statue (= the Truth),\nunder the address :\n\nit seems that you are not yet in the same condition …\n— —\nWhere are the analytical proofs (… or limitations on evidence ??) for the process against\nthe past results from the “wrong 14C test” ?\n— —\nIn 1998 I indicated the AFM way …\nBut …\nUntil now we have not yet these proofs !\n— —\nRegards\n\n","date":"October 10, 2013 at 9:17 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46823","author":"Piero","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"Dear Piero, \n“1868 “CE was a typo. It shall read 1863 CE.\nDid you read ALL the excerpts (on this blog) from my unpublished paper in French? BTW can you really read French? ONLY if you REALLY can, I can send you my 2007-2008 paper. Just ask Dan my email.\n\n","date":"October 10, 2013 at 10:30 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46842","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"BESIDES intrinsic proofs, both my iconographic crypanalysis of the MPH and my 2010-2012 cryptanalysis of the TS man’s eye areas will be two extrincisc proofs the C14 result was TOTALLY wrong.\n\n","date":"October 10, 2013 at 10:40 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46845","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"I asked (your e-mail address) to Dan … Unfortunately I have not yet received the answer !\nIn any case the textile analyses using the SPMs (Scanning Probe Microscopies = AFM, CFM, SNOM) is an interesting solution in order to discover the truth.\nBut, after 15 years, we cannot see these analyses …\nWhat is your opinion about that situation ?\n— — —\nWhat is your particular solution ?\nIs it the extraction of cryptographic secrets ???\n\n","date":"October 11, 2013 at 9:57 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-47016","author":"Piero","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"You also seem to be saying that it for others to determine which scientists I should respect. Maybe they would like to do the background reading and research as well – it would save me so much time\nYou’re right, Colin, absolutely right. Always were, always will be.\n\n","date":"October 10, 2013 at 9:24 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46824","author":"David Goulet","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"Stop the dark insinuations? Who was the one that suggested Rogers was fudging his final papers, or even better, was being duped by others who were using him like a marionette? you do keep a record of your postings for later reference, right?\nPress for new testing of the Shroud? Have you been reading this blog the past month? Everyone here has been discussing just that and David Rolfe even tried a crowd-funding project to that end.\nCut to the chase? Try cutting the bull first.\n\n","date":"October 10, 2013 at 9:33 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46826","author":"David Goulet","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"David Rolfe was after crowd-funding for a docu-soap. The suggestion ( ead sales ploy) that it might attract funding for research by way of spin-off came much later – as the deadline approached.\nDon’t talk to me about Rogers. You know my views.\n\n","date":"October 10, 2013 at 9:40 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46828","author":"colinsberry","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"Rolfe’s approach wasn’t my first choice either (as you must know having read all the comments). The point is that everyone here would very much like new data, new testing. What you seem unaware of, so let me educate you, is that Church doesn’t give a rat’s petunia what any of us would like and no amount of lobbying will change that.\nAnd yes, I know your views on Rogers, but if your dark conspiracy theories are to be given a free pass, then what’s good for the goose…\n\n","date":"October 10, 2013 at 9:47 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46830","author":"David Goulet","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"Dan, you wrote: “MAYBE (uppercases mine)  the Hungarian Pray Manuscript (just an example) begs us question scientific findings.”\nProfessionally it is pretty busy around here. I still need 3-4 sessions of an hour each to complete my iconographic cryptnalysis of the PHM  folio 28v lower panel which will prove beyond the shadow of a rational doubt the TS was in existence AT LEAST 233-237 years before the RCDate (1325 ± 65 calendar year)…\nStay tuned.\n\n","date":"October 10, 2013 at 9:34 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46827","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"Sorry: AT LEAST 130-133 years before the RCDate (1325 ± 65 calendar year)…\n\n","date":"October 10, 2013 at 10:22 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46840","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"#13: How can you possibly know what the Church wants re the question of the Shroud and its authenticity especially now there’s a new man in charge? Who’s’ to say that the new man does not also see the injustice of inviting 3  labs to provide a state-of-the-art dating, and then to have them slagged off by true-believers when they return the wrong answer? Do you seriously imagine that the new man is happy to preside over that kind of anti-science bigotry, especially as the Vatican has previously, over many centuries, taken no position over authenticity?\nAs for my own alleged conspiracy theory, it would involve at most 2 or 3 flawed individuals who may have considered themselves to be acting from the highest motives, protecting what they considered to be the interests of the Church, or not wishing to be remembered as folk who had caused embarrassment through being over-confident initially that radiocarbon dating would return a 1st century AD answer. Maybe they had been too easily persuaded by the kind of advocacy deployed on this site (image of Edessa, Pray Manuscript, pollen, blood supposedly under image etc etc), failing to appreciate that numerous lines of suspect or less-than-convincing evidence do not add up to a watertight case.\n\n","date":"October 10, 2013 at 10:35 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46843","author":"colinsberry","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"Like I said above. You have an answer for everything. The scientists that agree with your skepticism are above reproach, those that would disagree are pawns in some conspiracy. We’re all a bunch of anti-science wingnuts. So why don’t you leave us to our little fantasy world and go off and play with the real scientists. Or do care for us that much, doggedly hoping to pull us out of our ignorance? That’s it isn’t it? You really care. You can’t give up hope on us.\nGive me a hug you big lug.\n\n","date":"October 10, 2013 at 11:26 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46855","author":"David Goulet","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"Don’t take this personally,  but it’s not you or your beliefs that are my prime concern. It’s whether that length of linen,  with its front-and-back image and bloodstains was imprinted freshly approx 33AD from the crucified Christ.\n\n","date":"October 10, 2013 at 11:52 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46858","author":"colinsberry","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"Dr Ig. Colinsberry, BESIDES intrinsic proofs, both my iconographic crypanalysis of the MPH and my 2010-2012 cryptanalysis of the TS man’s eye areas will be two extrinsic proofs the C14 dating was skewed beyond the shadow of a rational doubt… Mark my words.\n\n","date":"October 10, 2013 at 10:49 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46846","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"Typo PHM\n\n","date":"October 10, 2013 at 10:50 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46848","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"The C14 dating is anything bur a watertight case: it takes water (Dr Ig. CB’s Titanic syndrome).\n\n","date":"October 10, 2013 at 10:55 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46850","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"Re “blood under image”, on August 6, 2012 at 6:31 am | #6\nI wrote:\n“There is one more thing CB seems not to be much aware of: bloodstains and other body fluids on old linens shall be studied AT LEAST not only from reflected but also transmitted and raked light images + UV and X ray images.His approach is totally unscientific.”\nRe RCDating reliability, on August 7, 2012 at 10:19 am | #12\nI also wrote:\n“Statistically speaking, the true reliability of 14c dating is only about 70% (from Barta’s, Meacham’s and Voruz & Meanen’s studies). It is even lower for textile samples.”\nCan Dr Ig. Colinsberry do his homework before passing comments?\n\n","date":"October 10, 2013 at 11:07 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46851","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"It is written all over the walls that the 1988 carbon dating was a complete fiasco, starting with Cardinal Anastasio Ballestrero, who let himself be led by others and did not make any decisions, to the labs communicating with each other (why?), to the announcement of the results. Why was “1260-1390!” written on the blackboard? Why the exclamation mark? It was because the scientists knew that they had not announced the gospel truth and would meet opposition. The unconscious can be loud.\n\n","date":"October 10, 2013 at 11:11 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46852","author":"Louis","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"Try not to confuse style with substance. The beauty of science is that if you dislike the style and then start to doubt the substance, you can always demand a recount. So let’s be having a recount ASAP (radiocarbon dating).\nBut let’s not mince our words (especially as I’m no longer being pre-moderated).  There are regulars here who shudder at the prospect of a recount. That reveals yet another  facet of science, beautiful or otherwise. Whilst the big S cannot tell you if there’s a God or not, it can quickly separate the rationalists from the ideologues – the genuine enquirers from the axe-grinders. Those who panic at the prospect of  radiocarbon recount are exposing themselves as ideologues and axe-grinders. The last thing they want are new data, new complications. Their minds are made up. Don’t confuse them with the facts. \n Science always seeks, indeed demands, new confirmatory data – or better still, conflicting data (it being conflicting data that drives science).\n\n","date":"October 10, 2013 at 11:39 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46857","author":"colinsberry","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"As far as I know no one in the realm of Shroud studies is worried about the prospect of radiocarbon count, on the contrary some Shroud scientists even think that there should be another one. Once again, it will not be worthwhile pressing for this if the controversy is still raging. It does not worry Rome because the relic is not an article of faith and the creed does not say “..and was buried wrapped in the Turin Shroud.” Dr. Rowan Williams was right in wanting academics to get into the debate as we will then have even more trained minds to share views and offer suggestions. \nIt is doubtful if the distinction between rationalists and ideologues is so clear cut, there are many belonging to the former group who hide under the mask of rationalism and are in fact ideologues. It is not only science that meets conflicting data, Freud, Jung, Heidegger also encountered it. As written previously, God does turn down the blinds.\n\n","date":"October 10, 2013 at 12:45 pm","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46868","author":"Louis","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"If only Dr Ig. big S Colinsberry could deliver substantial practice to his stillizing  theoritical speech!\nJust re-read his analysis of both the Pray Hungarian MS and the Lirey pilgrim badge. Just poorly amateurish.\n\n","date":"October 10, 2013 at 11:55 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46859","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"The same goes for his  alleged “bloodstain pattern analysis” (used of biased or inappropriate photographs).\n\n","date":"October 10, 2013 at 11:58 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46861","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"When it came to analyze the Shroid Image, he could not even tell exactly on which side of the shroud it was: the weft side or the warp side etc. And the man keeps thinking he is the spokesman of big S(cience)…\n\n","date":"October 10, 2013 at 12:03 pm","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46863","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"#27 (currently)\n“It is doubtful if the distinction between rationalists and ideologues is so clear cut, there are many belonging to the former group who hide under the mask of rationalism and are in fact ideologues.”\nOr there again, there are some of us who saw Rolfe’s “Silent Witness” back in the 70s, and the contemporaneous Sunday Times colour-supplement feature (apologies for the UK-centric p.o.v,)  and were shaken to the core.\nThen came the radiocarbon dating, years later, that separated the starry-eyed from the hard-nosed, and subsequently the ideologues from the rationalists. (Thanks to the site host for reminding me of “rationalists” as a handy catch-all term for those who refuse to let their hearts – or anatomically-harder – to-locate souls- rule their heads)\nNice video, David Rolfe, as we would now say. Shame about the facts.\n\n","date":"October 10, 2013 at 1:10 pm","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46871","author":"colinsberry","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"Here’s one fact I like: no one has been able to reproduce the Shroud – though many have tried. And this one: no other relic has been found created with the same image formation process – though many have looked.\nAnd this one for balance: no one has been able to replicate the C-14 results – but that was only attempted the one time.\n\n","date":"October 10, 2013 at 1:33 pm","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46874","author":"David Goulet","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"“…no other relic has been found created with the same image formation process – though many have looked.”\n“There are more things in heaven and earth, Horatio,\nThan are dreamt of in your philosophy. ”\nWho would have thought that nature would bequeath us fossils of extinct organisms that lived millions of years ago, enabling us to build our evolutionary trees? Would the fossilization process have been predicted by early scientists? Would the latter have been able to figure out retrospectively how it happened in precise detail?\n“There are more things in heaven and earth, Horatio,\nThan are dreamt of in your philosophy. “\n\n","date":"October 10, 2013 at 1:45 pm","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46876","author":"colinsberry","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"If ever the TS is proven to be really Yeshua’s long inner burial shroud with his bloodied body image, methinks a genuine scientist or/and archaeologist should be happy to correct errors once brought to his attention.  Methinks Dr. IGg. big S Colinberry would not.\n\n","date":"October 10, 2013 at 2:52 pm","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46889","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"David, was there ever any chemical testing performed on Luigi Garlaschelli’s reproduction of the Turin Shroud?\nhttp://www.theglobeandmail.com/news/world/scientist-reproduces-shroud-of-turin/article4287821/\n\n","date":"October 15, 2013 at 12:44 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-47517","author":"Angel","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"Well, first came the documentary, then came the carbon dating …. and the heated controversy followed. Whoever kept in touch with what was going on should now be up to date. Now to the rationalists and ideologues: There are some giants in history who swept doubts under the carpet, either because they were too tired to think any more or encountered conflicting data that they were unable to countenance. From a book about Freud sent to me for review I was able to confirm that his files are locked up in the Library of Congress,perhaps for eternity, and access is only allowed to those in the inner circle. It seems to have been convenient for Einstein to say full stop after “Spinoza’s God.” If RD is so convinced about his theories why does he meet quite often — and publicly — with Dr. Rowan Williams, the authority who was influenced by the documentary and has asked academics to take interest in the Shroud?\n\n","date":"October 10, 2013 at 1:47 pm","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46877","author":"Louis","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"So maybe the site’s name should be changed to RDstory.com. One suspects that it would suit a lot of folk’s private agenda –  presently masquerading as Shroud  interest – possibly yours (and David Rolfe’s) included.\n\n","date":"October 10, 2013 at 1:54 pm","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46878","author":"colinsberry","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"He’s on to us Louis. The jig is up. Our private agenda has been exposed. We’ll have to go to Plan B and set up that new blog Inquisitionstory.com  No one expects the Inquisitionstory!\n\n","date":"October 10, 2013 at 2:01 pm","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46881","author":"David Goulet","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"My stand has always been independent, not depending on the support of any one in the realm of Shroud studies. The truth has to be told, whether it is in the realm of Shroud literature or not. Dan’s blog should remain shroudstory. Why? Is there something better online where there can be good discussions about the Shroud? Have you seen the stats?\nBy the way, it is a sign of intelligence to learn from mistakes. Personal attacks from your end are raising their head again, and that could mean…\n\n","date":"October 10, 2013 at 2:39 pm","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46887","author":"Louis","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"“There are more things in heaven and earth, Horatio,\nThan are dreamt of in your philosophy. ”\nKeep dreaming Horatio.\n\n","date":"October 10, 2013 at 1:55 pm","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46879","author":"David Goulet","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"He’s on to us Louis. The jig is up. Our private agenda has been exposed. We’ll have to go to Plan B and set up that new blog Inquisitionstory.com No one expects the Inquisitionstory!\nBut that’s where this site falls down. There is no inquisition, small or capital I. All one finds are lame and convoluted responses to the rationalist’s gentle interrogation…  I had expected better from an Episcopalian (being some kind of Protestant, or so wiki leads us to believe). You just can’t get the Protestants these days.\n\n","date":"October 10, 2013 at 2:08 pm","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46882","author":"colinsberry","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"“Gentle interrogation”? Well, there’s been no water-boarding, I’ll grant you that, but “gentle”?  I suppose a bull in a china shop could be considered gentle, when compared to a tank.\n\n","date":"October 10, 2013 at 2:38 pm","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46885","author":"David Goulet","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"So who are the inquisitors on this site? It’s hardly Randi’s 24/7 thumb-screwing forum, is it?\n\n","date":"October 10, 2013 at 2:48 pm","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46888","author":"colinsberry","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"Randi’s forum. Truth served with a spirit of viciousness. Just another type of lie really.\n\n","date":"October 10, 2013 at 3:06 pm","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46894","author":"David Goulet","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"Correction: \nIf ever the TS was proven to be really Yeshua’s long inner burial shroud with his bloodied body image, methinks a genuine scientist or/and archaeologist should be happy to correct errors once brought to his attention. Methinks Dr. Ig. big S & Me Colinberry just would not and even could not then.\n\n","date":"October 10, 2013 at 2:59 pm","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46890","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"#37  “By the way, it is a sign of intelligence to learn from mistakes. Personal attacks from your end are raising their head again, and that could mean…”\nSame old, same old.  Never mind. I’ve said what I want to say –  like “Please commission a second round of radiocarbon dating please, Mr. New Pope”. \nThe thin skins on display here would be ideal for imprinting a Shroud image (“amazingly superficial” etc). Enthusiasts could sport the Shroud image on their foreheads like a faith-affirming tattoo. \nTime now to move on, having more important things in my twilight years than argue the toss with relic-fixated obsessives.\n\n","date":"October 10, 2013 at 3:04 pm","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46891","author":"colinsberry","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"Relic fixated obsessives….like the type that would take the time to experiment with leeches to see if that was how the blood got on the relic? Yeah there’s a few of us here. Good company.\nThin skinned — said the carrot to the apple.\nI like the tattoo idea, though.\n\n","date":"October 10, 2013 at 3:12 pm","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46897","author":"David Goulet","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"In the most likely hypothesis the TS is genuine, spiritually and archaeologically speaking, the historical Yeshua did deserve to be met. This is neither a relic/artefact fixated obsession nor an object of faith just the ‘pretextile’ for an enduring quest for truth…\n\n","date":"October 10, 2013 at 3:44 pm","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46903","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"Colin, see # 47 below.\n\n","date":"October 10, 2013 at 3:21 pm","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46899","author":"Louis","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"David, you’re right, there’s nothing to worry about since there are no “private” agendas and good discussions are taking place.\nColin: You are hitting below the belly and that is not welcome anywhere in the world, not only here. It could be a sign that there are no more arguments in your treasury. Fossils? So what? I for one do not subscribe to natural theology, in fact I beg to differ from Richard Swinburne when it comes to this. Go beyond science, the horizon is much further away, scientism is no answer, even Hawking seems to be aware of this and is a member of the Pontifical Academy of Science. I used to love England while I was there mainly because there were many places where you could get good books to read, the facilities provided to researchers were excellent. You could make good use of this first and then tackle people in the realm of Shroud studies because you would be more prepared and stop hitting below the belly. But, also remember there is no guarantee that you will come up with formidable arguments to present to Shroudies.\n\n","date":"October 10, 2013 at 3:05 pm","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46892","author":"Louis","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"Oh, one other thing – STURP, mentioned earlier. Yes, it’s hard to be enamoured of the STURP intervention, given its terms of reference seemed to be concerned mainly with what the image is not (painted-on pigment) as distinct from what it is. For the latter we have to be content with two useful scraps of information, namely that the reflectance spectrum of image-bearing areas resembles that of a “scorch” i.e. pyrolysed carbohydrate, aka dehydrated carbohydrate and that the colour is bleached with the powerful reducing agent diimide. That essentially is it, and on that somewhat flimsy foundation, or as some might say, despite it,  Rogers built his starch impurity hypothesis which this commentator regards as a giant red herring distracting from the concept of the image as a simple thermal scorch, replaced with the largely untested idea of a Maillard reaction product requiring both reducing sugars and exogenous amines of some description. (The latter handily suggesting the presence of a decomposing corpse and putrefaction amines – never mind the time and/or temperature scales).\nIf as I hope the new Pope gives a go-ahead at some point a new round of investigation, hopefully well-targeted, then there is a fairly simple straightforward way of characterizing and quantifying carbohydrate pyrolysis. It involves borrowing analytical methodology from dietary fibre research (a major preoccupation in my own career). If anyone’s interested in the details, I’d be only too happy to oblige. With a little luck, it should tell us straightaway whether the image is on a starch impurity layer, or on that of non-starch polysaccharides, NSP (either cellulose, or non-cellulosic NSP, e.g. xylans and other hemicelluloses etc associated primarily but not exclusively with the highly superficial PCW (primary cell wall) of flax fibres.\n\n","date":"October 11, 2013 at 12:33 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46958","author":"colinsberry","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"CB, with your last aragraph you FINALLY makes a very good point.\n\n","date":"October 11, 2013 at 7:11 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46992","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"Or as you would put it in English, you FINALLY hit the nail (never too late).\n\n","date":"October 11, 2013 at 7:20 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46994","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"It was not until 1969 that any serious scientific work on the Shroud proper was ever undertaken. Until then the only serious work had been the forensic pathology examination of the photographs of Pia(1898) by Vignon and Delage, and of Enrie(1931) by Barbet, Bucklin and Willis. The work of the 1969 Commission was all done in secret, the names of the participants not even being known until 1973.  Nearly all of them were chosen from the diocese of Piedmont, although all reasonably expert in their particular specialties. They were not all Catholics, but included agnostics and Protestants.  The nature of the cloth was not even known until Raes was able to confirm that it was indeed linen of a particular flax, and with some contamination of cotton. In 1973, Frei was commissioned to offer some photographic advice, based on his reputation in police investigation work. Frei was able to take the opportunity only then of collecting his first pollen samples. The findings of the 1973 commission were necessarily limited by the constraints of the intended scope of their work.\nThe impetus for the STURP team possibly originated with the discovery of the 3-D properties of the photographs using the VP8 analyser, and the decision of a few American scientists to attempt exploiting the opportunity of the intended 1978 ostentation. At this stage the nature of the image was completely unknown.  Barrie Schworz was recruited to join the team. He tells of his anticipation of a free trip to Turin and expectation that it was no more than a painting and that would be the end of it.  But of course that was not to be, and the rest is history. Such was the state of ignorance even as late as 1978.  \nThe setting of the 1988 C14 Radiocarbon dating was fraught with conflicts of egos, thwarted intentions of sampling protocols, the scepticism of some custodial authorities, the ignorance of so-called experts in textiles and other disciplines, and an assortment of various personal and professional agendas, and finally the selection of a totally unrepresentative sample.  Few I feel could come out of the whole sorry exercise with any kind of worthwhile credit at all. \nWhat assurances can there ever be that human egos can be set aside, and a proper disciplined professional approach to any future scientific investigation can ever be achieved?  Is it possible for human subjectivity to be set aside in any such investigation? Or will fallen human nature, with all its personal ambitions and agendas, always compromise what ought to be a proper objective assessment of this most important treasure?\n\n","date":"October 11, 2013 at 6:35 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46987","author":"daveb of wellingon nz","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"“… what ought to be a proper objective assessment of this most important treasure?…”\nSpot the non-objective term in that sentence, then you need look no further for reasons why so much that passes for Shroud “science” is nothing of the sort. It’s that same lack of  objectivity that is used to to give a veneer of pseudo-scientific respectability, one that brings science into disrepute.\nExample?  Raymond Rogers was recruited to STURP to seek evidence for or against the Shroud being 1st century AD. So what on earth was he thinking when he posited the presence of a starch impurity coating, citing Pliny as his authority, and then egging the pudding by claiming that the image was on that impurity coating, not the linen carbohydrates per se? It is hard to imagine a less objective approach to estimating the age of the Shroud chemically (pre-radiochemically) or on which to base a claim for the image pigment being chemically-modified starch.\nThe objective scientist is of course permitted to dream up the idea of an extrinsic starch impurity coating. But he then puts that idea into a mental compartment when he enters the lab.   What he does when he arrives at the bench is first systematically check for the presence of starch over the entire Shroud, both image and non-image regions, then demonstrate there is less measurable starch in image regions, then perhaps demonstrate that the image can be easily washed or digested out along with any unreacted starch, leaving intrinsic image-free flax carbohydrates. \nThen and only then might Pliny get a mention. then and only then might the cautious objective scientist speculate that the Shroud was 2000 years old, given the possibility that sizing starch was a marker for 2000 year old technology.\nInstead we have a edifice of non-objective so-called science, almost certainly influenced initially by non-objective theology, one that distracted from the real task of determining the true location and chemical nature of the Shroud image.\nThere is a Danish scientist I used to collaborate with by the name of Dr.Hans Englyst. He and his co-worker John Cummings developed methods for planrt cell wall analysis that while developed for dietary fibre analysis could in principle be used to determine which components of flax linen fibres survive the image-imprinting intact, potentially allowing the target molecules to be deduced by a process of elimination. I can give more details if anyone is interested. I can even produce a group photograph that has me, John Cummings and Hans Englyst at the same scientific congress, approx mid 1980s. Sir Richard Doll is in the same picture too (smoking/lung cancer link). \nWe have scarcely begun to investigate the Shroud using well tried-and-tested methodology – physical, chemical and biological. Of course, none of it might have been necessary if the Shroud custodians had provided samples from the main body of the cloth (the dorsal side would have sufficed initially) instead of fobbing off THREE labs no less with a snip from one corner.  Maybe they too (the samplers, the in-house so-called science advisers) were inhibited by the (non-objective) thought that what was being sampled was a “treasure” – a preconception that was supposed to be under critical scrutiny, not assumed. Hasn’t the Vatican always said that it has no position on authenticity? So why the insulting specimen, and why the insults and slander that are now routinely heaped here on this site and elsewhere on the 3 labs?\n\n","date":"October 11, 2013 at 7:31 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-46995","author":"colinsberry","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"\ncolinsberry :\nThere is a Danish scientist I used to collaborate with by the name of Dr.Hans Englyst. He and his co-worker John Cummings developed methods for planrt cell wall analysis that while developed for dietary fibre analysis could in principle be used to determine which components of flax linen fibres survive the image-imprinting intact, potentially allowing the target molecules to be deduced by a process of elimination. I can give more details if anyone is interested. I can even produce a group photograph that has me, John Cummings and Hans Englyst at the same scientific congress, approx mid 1980s. Sir Richard Doll is in the same picture too (smoking/lung cancer link).\nWe have scarcely begun to investigate the Shroud using well tried-and-tested methodology – physical, chemical and biological. Of course, none of it might have been necessary if the Shroud custodians had provided samples from the main body of the cloth (the dorsal side would have sufficed initially) instead of fobbing off THREE labs no less with a snip from one corner.  Maybe they too (the samplers, the in-house so-called science advisers) were inhibited by the (non-objective) thought that what was being sampled was a “treasure” – a preconception that was supposed to be under critical scrutiny, not assumed. Hasn’t the Vatican always said that it has no position on authenticity? So why the insulting specimen, and why the insults and slander that are now routinely heaped here on this site and elsewhere on the 3 labs?\n\nI’d be interested in hearing some more details (don’t have to include the group photograph), regarding the methodology of determination of flax carbohydrates in situ (harvested plant), processed flax, & post-image formation.\n\n","date":"October 11, 2013 at 8:07 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-47007","author":"Kelly Kearse","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"Here’s an abstract for starters that summarises the methodology quite well. It uses amylase enzymes to determine starch, and then differential acid hydrolysis to distinguish between cellulose and non-cellulosic polysaccharides.\nDetermination of the non-starch polysaccharides in plant foods by gas-liquid chromatography of constituent sugars as alditol acetates \nH. Englyst, H. S. Wiggins and J.H.Cummings   \nAnalyst, 1982,107, 307-318\nhttp://pubs.rsc.org/en/Content/ArticleLanding/1982/AN/an9820700307#!divAbstract\nGiven it works across a wide range of foodstuffs (its been officially tested in interlab comparisons) I see no reason why it should not work for both freshly-harvested flax and final spun or woven linen. \nI’m assuming that the final glc separation of the carbohydrate derivatives will detect the sugars that have NOT been modified by image-formation. It might be interesting to compare patterns before and after diiimide reduction to see if one can get more direct evidence on the specific carbohydrates that are modified. One could also do lots of model studies with different imaging procedures – contact, radiation, sulphuric acid dehydration etc – to see if one can detect specific fingerprints that give a clue as to the mechanism that generated the Shroud image..\n\n","date":"October 11, 2013 at 8:28 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-47010","author":"colinsberry","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"Dr Berry objects to my use of the word “treasure” in referring to the TS. It is certainly considered as such by its owners, and by a very large catchment of Christians throughout the world. It is not a “laboratory specimen” – It is unique.  It is true, as he ssys, that this subjective value necessarily influences what can be done and not done in any scientific investigation. For instance, it constrains the amount of destructive testing that might be carried out. \nNor were normal laboratory conditions with its more usual lack of time constraints available to the STURP team.  The programmes they formulated had to be planned so as to be completed within whatever time would be allowed to them. Shortly before their departure, the custodial authorities asked that their “12 hour programme” be sent; in response they sent their 96 hour protocol instead.  It was clear that Turin politics were at work, another hurdle they had to deal with.  There were delays in arrival of essential equipment. The Italian Customs authorities also impounded the equipment, merely because of the standard radiation sticker on their X-ray machines. These are only some of the obstacles that STURP had to overcome.  It is a tribute to their peristence and determination that they achieved as much as could be done within the time available. \nDr Berry also castigates the commenters on this blog, for tarnishing the reputation of the three laboratories in question. It is not merely the laboratories who may have been at fault.  For a comprehensive summary of all that was wrong with the C-14 exercise, check out the paper by Emmanuela Marinelli:\nhttp://www.shroud.com/pdfs/marinelliv.pdf  \nIn my lamentation above of the record of the way that science in TS investigations has been subjected to personal egos and agendas, I neglected to mention the 2002 so-called “restoration”, where proper advice was ignored and neglected, so that much of potential future value has now been irretrievably lost. The catalogue of errors seems unending.\n\n","date":"October 11, 2013 at 3:32 pm","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-47081","author":"daveb of wellingon nz","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"\ncolinsberry :\nHere’s an abstract for starters that summarises the methodology quite well. It uses amylase enzymes to determine starch, and then differential acid hydrolysis to distinguish between cellulose and non-cellulosic polysaccharides.\nDetermination of the non-starch polysaccharides in plant foods by gas-liquid chromatography of constituent sugars as alditol acetates\nH. Englyst, H. S. Wiggins and J.H.Cummings\nAnalyst, 1982,107, 307-318\nhttp://pubs.rsc.org/en/Content/ArticleLanding/1982/AN/an9820700307#!divAbstract\nGiven it works across a wide range of foodstuffs (its been officially tested in interlab comparisons) I see no reason why it should not work for both freshly-harvested flax and final spun or woven linen.\nI’m assuming that the final glc separation of the carbohydrate derivatives will detect the sugars that have NOT been modified by image-formation. It might be interesting to compare patterns before and after diiimide reduction to see if one can get more direct evidence on the specific carbohydrates that are modified. One could also do lots of model studies with different imaging procedures – contact, radiation, sulphuric acid dehydration etc – to see if one can detect specific fingerprints that give a clue as to the mechanism that generated the Shroud image..\n\nOkay-Thanks very much for the reference.  \nCertain non-cellulosic saccharides (for example, xylose, uronic acid derivatives) can be relatively resistant to acid hydrolysis-mentioned because these are two byproducts of saponin (if one includes saponaria as a potential surface coating of the cloth).  I think the type of approach you suggested is important to help characterize the details of (specific) carbohydrate involvement.  \nIf an image fiber was subjected to diamide reduction & then subsequently treated with a reducing agent (to oxidize), do you think the “image” would be reformed, i.e. do you think the process is reversible?\n\n","date":"October 11, 2013 at 7:10 pm","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-47107","author":"Kelly Kearse","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"Certain non-cellulosic saccharides (for example, xylose, uronic acid derivatives) can be relatively resistant to acid hydrolysis-mentioned because these are two byproducts of saponin (if one includes saponaria as a potential surface coating of the cloth). I think the type of approach you suggested is important to help characterize the details of (specific) carbohydrate involvement. \nMy preference would be to start without any preconceptions as to what might or might not be there, and simply compare the sugars peaks on one’s glc trace with that of flax and modern linen v older specimens. One expects to see glucose peaks for cellulose and NCPs, and pentosan peaks that correspond  to the arabinoxylans and other hemicellulose sugars, and of course those uronic acids from pectins.  It’s my hunch (purely that) one will see depletion of hemicelluloses in image-bearing zones, but retention of most of the cellulose, on the assumption that the image is on the superficial PCW hemicelluloses. \nAnything unusual or unexpected can be investigated using the fragmentation pattern from glc-mass spec’.  Specifically looking for saponins from those “Tales of Mystery and Imagination” would come rather low down my list of priorities. As indicated earlier, the real fun is to see what happens to those sugar profiles if one takes linen that has had its surface discolored by varying degrees of carbohydrate dehydration, aka pyrolysis or caramelisation or just plain “scorching”. \nI realize that this type of study, probably requiring sizeable samples for analysis, could only be done after a de-mythologizing second round of C-14 dating, with a confirmation of medieval provenance and change in perceptions by no means certain.\nMore later (in response to your second para’).\n\n","date":"October 12, 2013 at 2:54 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-47162","author":"colinsberry","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"Non-destructive testing (NDT) can solve the problem.\nColin wrote : “…Anything unusual or unexpected can be investigated using the fragmentation pattern from glc-mass spec’. Specifically looking for saponins from those “Tales of Mystery and Imagination” would come rather low down my list of priorities. As indicated earlier, the real fun is to see what happens to those sugar profiles if one takes linen that has had its surface discolored by varying degrees of carbohydrate dehydration…” \nUsing this kind of technology seems to be an old way to proceed :\na destructive analysis ! …\nI prefer to wait and see the results obtained from the SPM analyses.\nThe non-destructive way is the right way.\n— —\nScanning probe microscopes (SPM) is a branch of microscopy that creates images of surfaces using a physical probe that scans a specimen.\n— —\nI want to add :\nThe SPM results can see in comparison with the Raman Spectroscopy results.\n\n","date":"October 12, 2013 at 5:56 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-47183","author":"Piero","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"Yes, Piero, but would AFM in one or other of its different variants tell us precisely what we want to know about the Shroud image – like what class of carbohydrate has been modified and in what manner (dehydration? oxidation?)? Or would it only show topological relief?\nI’m broadly aware of the technique, having reported on one of its successes some years ago with pentacene:\nhttp://colinb-sciencebuzz.blogspot.fr/2009/08/scientists-finally-image-single.html\nBut that particular molecule lends itself well to the technique – atypically well perhaps – it being recently acknowledged that the kind of detail revealed with a linear polycyclic hydrocarbon cannot be achieved, at least in the short term, with just any old organic molecule. Can you supply links that would suggest otherwise, or show that I’m being overly pessimistic?\nYes, conventional wet chemistry is destructive. But what if a repeat of the radiocarbon dating with a proper sampling frame were to again return that same medieval dating? It would still leave us with an unsolved mystery as to how the image had been created (and for what purpose)? \nMaybe the dorsal side, or a portion thereof,  could then be sacrificed for uninhibited scientific research – says he to anticipated howls of outrage… But does it not seem overly self-indulgent to release just enough science over many decades to much fanfare, whetting everyone’s appetite, only – in an admittedly hypothetical scenario-  to stomp off with a de-mythologized shroud if or when the science had been unable to vouch for its authenticity? So what say we repeat the radiocarbon dating, and then review again the state of AFM. If still considered unfit- or sufficiently undeveloped for-purpose, then we  should think about reaching for those scissors a second or third time.\n\n","date":"October 12, 2013 at 7:24 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-47194","author":"colinsberry","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"Daer Colin,\nthank you for your answer.\nThere are a lot of links …\nNow I have no time …\n— —\nWe can see something of interest using the CFM (Chemical Force Microscopy) and also  … there are the other techniques (Raman controls included).\n— —\nNo destructive controls are required !\n— —\nIf you want to improve the work (or to try another way) you have to wait … because the future works will be interesting.\nSeveral years ago (in 2004) Dan Rugar answered (to me) about my question :\n>If your device could be useful for investigating the atomic structure inside materials… then (I think) this is interesting also for textile fibers…\n>Do you agree ?\nHere the answer by DR :\n>I am sorry, but our instrument is not sufficiently developed to be used to analyze the materials you mention. It is still in an early stage of research.\n— —\nHave you read the recent news about the MRI at nanoscale ?\nHere the title :\n Nanoscale Fourier-Transform Magnetic Resonance Imaging\nby John M. Nichol, Tyler R. Naibert, Eric R. Hemesath,\nLincoln J. Lauhon, and Raffi Budakian,\npublished in :\nPhysical Review X 3, 031016 (2013)\n— —\n\n","date":"October 16, 2013 at 12:47 pm","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-47665","author":"Piero","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"Piero, 100% agreed. CB the destroyer should be refrained…\n\n","date":"October 12, 2013 at 7:25 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-47195","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"Reply to Kelly Kearse (Part 2)\n“If an image fiber was subjected to diamide reduction & then subsequently treated with a reducing agent (to oxidize), do you think the “image” would be reformed, i.e. do you think the process is reversible?”\nTrying to find the precise chemistry of carbohydrate dehydration is proving a real trial. Most of the literature where plant material is concerned is to do with cellulose, and with high temperature treatment (with a view to making semi-synthetic fuel oils).\nSo it’s back to first principles in trying to guess what kind of products one might be dealing with where discoloration of linen is concerned, especially if as seems likely it is  hemicelluloses that are the more susceptible to chemical change.\nIf one were to take as one’s model a fairly mainstream, uncontroversial model, it would be the pyrolysis of xylans to furfural (an aldehyde). First the xylan polymer de-polymerises, releasing free xylose sugar. That then loses three molecules of water to form furfural.\nC5H10O5 → C5H4O2 + 3 H2O\nBut there’s a problem. Pure furfural is colourless. However, it does yellow quickly on exposure to air (not surprising, given that aldehydes are reactive, and tend to polymerise etc).  So when they speak of carbohydrate dehydration it may in fact be dehydration plus simultaneous aerial oxidation. That would then account for the ability to bleach the product with diimide – by reversing the secondary oxidation – but presumably leaving the initial dehydration step(s) intact.\nSo what are the products of furfural oxidation that are yellow?\nFrom a quick literature search:\n“A problem associated with the use of furfural, however, is its tendency to oxidize in the presence of atmospheric oxygen to form oxidation products such as furoic acid or formyl acrylic acid or formic acid which further, upon heating, forms furfural acidic polymers.”\nhttp://www.google.com/patents/US5332842\nSo where does that leave us? It’s possible that diimide reduction will return us to furfural, or a related aldehyde, and given its volatility, it should not be difficult to detect on glc.  But if the yellow product is a polymer, formed with one or more oxidation steps, then it’s possible that while it could be bleached, it would still remain polymeric, and fail to reveal itself on glc.\nAnswer: Approach the task with a completely open mind. Attempt to spot patterns in the data. Or as an Australian boss of mine used to say: “Just suck it and see”.\n\n","date":"October 12, 2013 at 9:45 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-47210","author":"colinsberry","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"\ncolinsberry :\nReply to Kelly Kearse (Part 2)\n“If an image fiber was subjected to diamide reduction & then subsequently treated with a reducing agent (to oxidize), do you think the “image” would be reformed, i.e. do you think the process is reversible?”\nTrying to find the precise chemistry of carbohydrate dehydration is proving a real trial. Most of the literature where plant material is concerned is to do with cellulose, and with high temperature treatment (with a view to making semi-synthetic fuel oils).\nSo it’s back to first principles in trying to guess what kind of products one might be dealing with where discoloration of linen is concerned, especially if as seems likely it is  hemicelluloses that are the more susceptible to chemical change.\nIf one were to take as one’s model a fairly mainstream, uncontroversial model, it would be the pyrolysis of xylans to furfural (an aldehyde). First the xylan polymer de-polymerises, releasing free xylose sugar. That then loses three molecules of water to form furfural.\nC5H10O5 → C5H4O2 + 3 H2O\nBut there’s a problem. Pure furfural is colourless. However, it does yellow quickly on exposure to air (not surprising, given that aldehydes are reactive, and tend to polymerise etc).  So when they speak of carbohydrate dehydration it may in fact be dehydration plus simultaneous aerial oxidation. That would then account for the ability to bleach the product with diimide – by reversing the secondary oxidation – but presumably leaving the initial dehydration step(s) intact.\nSo what are the products of furfural oxidation that are yellow?\nFrom a quick literature search:\n“A problem associated with the use of furfural, however, is its tendency to oxidize in the presence of atmospheric oxygen to form oxidation products such as furoic acid or formyl acrylic acid or formic acid which further, upon heating, forms furfural acidic polymers.”\nhttp://www.google.com/patents/US5332842\nSo where does that leave us? It’s possible that diimide reduction will return us to furfural, or a related aldehyde, and given its volatility, it should not be difficult to detect on glc.  But if the yellow product is a polymer, formed with one or more oxidation steps, then it’s possible that while it could be bleached, it would still remain polymeric, and fail to reveal itself on glc.\nAnswer: Approach the task with a completely open mind. Attempt to spot patterns in the data. Or as an Australian boss of mine used to say: “Just suck it and see”.\n\nColin, Thanks very much for your reply.  I think the use of a panel of specific glycosidases might also help to sort out what products may or may not be present.  Regarding this, might be an interesting experiment to treat image samples (real or simulated) with glycosidases to evaluate which carbohydrate(s), linkages the “image”, coloration was sensitive to.\n\n","date":"October 12, 2013 at 11:02 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-47228","author":"Kelly Kearse","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"Enzymatic action? Glycosidases?  I like the idea in principle, Kelly (me being a biochemist by training) to say nothing of fewer losses as by-products of acid hydrolysis.  But would it be feasible in practice? To reduce a complex heteropolymer such as hemicellulose(s) down to its constituent hexose and pentose sugars on a realistic time scale you would presumably need a cleverly-contrived mix of endo- and exoglycosidases, the first to act at particular links within the polymer chains to effect a quick reduction to smaller more manageable fragments, and then the second, working inwards from the new terminals, to release the individual sugars.Sounds a tall order to me, if you don’t mind my saying.\n\n","date":"October 13, 2013 at 5:13 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-47349","author":"colinsberry","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"\ncolinsberry :\nEnzymatic action? Glycosidases?  I like the idea in principle, Kelly (me being a biochemist by training) to say nothing of fewer losses as by-products of acid hydrolysis.  But would it be feasible in practice? To reduce a complex heteropolymer such as hemicellulose(s) down to its constituent hexose and pentose sugars on a realistic time scale you would presumably need a cleverly-contrived mix of endo- and exoglycosidases, the first to act at particular links within the polymer chains to effect a quick reduction to smaller more manageable fragments, and then the second, working inwards from the new terminals, to release the individual sugars.Sounds a tall order to me, if you don’t mind my saying.\n\nColin,\nI don’t mind you saying at all, it could be a tall order-was actually referring to using these in combination with the previously mentioned approach, particularly to help define any species that may be resistant to acid hydrolysis or a more end-stage purification-not necessarily chopping away at the entire structure from the beginning.  Labeled sugar nucleotides used in conjunction with glycosyltransferases to identify particular terminal or individual saccharides might also prove helpful-just a thought-[I myself, used the latter technique years ago in my first postdoc in Gerald Hart’s lab who studied nuclear glycosylation, O-GlcNAc.  I also used this in my own lab to look at trimming & readdition of Glc residues on newly synthesized proteins in the ER-I have photos!].  Plant carbohydrates are certainly more involved, but if there’s a linkage there is a glycosyltransferase to make it & a glycosidase to break it; many of these have now been purified & cloned.  I think considering the specifics of exactly what carbohydrate(s) are being modified and how are central questions in Shroud science\n\n","date":"October 13, 2013 at 9:33 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-47364","author":"Kelly Kearse","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"I’m not sure how relevant the zoological/medical context is to plant chemistry, especially where cell walls are concerned. In the first one has sialo-and other glycoproteins that are cell-surface associated and critical for cell-cell recognition, as well as binding water at the cell surface. Sooner of later those cells die and the detritus has to be digested by endogenous lysosomal enzymes, using those glycosidase enzymes.Otherwise the organism would get clogged up with its own cast-offs.\nIt’s an entirely different situation in plant cells walls. Cellulose provides the fibres for mechanical strength, especially in the secondary cell wall, and hemicelluloses provide a ground substance or cement. The difference is that plants do not recycle their dead and dying cell wall components. After lignification they continue to provide support after death. Finally they drop off, and the only type of organism that can then recycle the carbon are the saprophytic fungi with their invasive feeding hyphae. But fibrous strands, or even hemicelluloses within those strands, are a tough substrate, which is why it can take years or decades even for dead wood and other vegetation finally to disappear. So the enzymes for hemicellulose digestion are not indigenous to the plants that made them, but in an entirely different organism, so are unlikely to show the kind of exquiste selectivity that one might desire if seeking to use, say, purified fungal glycosidases to effect an efficient step-by-step dismantling of hemicelluloses (and let’s not  forget that they they have chains that can have hundreds of sugar residues strung together.).\nI did a year of botany as subsidiary subject at University (if only because the zoology course was oversubscribed!). Did you do any botany, Kelly?\n\n","date":"October 13, 2013 at 1:05 pm","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-47380","author":"colinsberry","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"\ncolinsberry :\nI’m not sure how relevant the zoological/medical context is to plant chemistry, especially where cell walls are concerned. In the first one has sialo-and other glycoproteins that are  cell-surface associated and critical for cell-cell recognition, as well as binding water at the cell surface. Sooner of later those cells die and the detritus has to be digested by endogenous lysosomal enzymes, using those glycosidase enzymes.Otherwise the organism would get clogged up with its own cast-offs.\nIt’s an entirely different situation in plant cells walls. Cellulose provides the fibres for mechanical strength, especially in the secondary cell wall, and hemicelluloses provide a ground substance or cement. The difference is that plants do not recycle their dead and dying cell wall components. After lignification they continue to provide support after death. Finally they drop off, and the only type of organism that can then recycle the carbon are the saprophytic fungi with their invasive feeding hyphae. But fibrous strands, or even hemicelluloses within those strands, are a tough substrate, which is why it can take years or decades even for dead wood and other vegetation finally to disappear. So the enzymes for hemicellulose digestion are not indigenous to the plants that made them, but in an entirely different organism, so are unlikely to show the kind of exquiste selectivity that one might desire if seeking to use, say, purified fungal glycosidases to effect an efficient step-by-step dismantling of hemicelluloses (and let’s not  forget that they they have chains that can have hundreds of sugar residues strung together.).\nI did a year of botany as subsidiary subject at University (if only because the zoology course was oversubscribed!). Did you do any botany, Kelly?\n\nNo botany here, I was a bit allergic to anything with a chloroplast-I appreciate the difference in chain length & structure, but if there’s a terminal end you might find a key that fits-very well put discussion by the way.  Many of the saccharides that could constitute a suggested impurity layer at the surface would be amenable to analysis by the aforementioned techniques-I’m not saying it’s there or not-that’s where one of the fundamental issues lies, on which sugars, cloth or cloth-bound does the image reside?\n\n","date":"October 13, 2013 at 3:28 pm","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-47392","author":"Kelly Kearse","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"\nAngel :\nDavid, was there ever any chemical testing performed on Luigi Garlaschelli’s reproduction of the Turin Shroud?\nhttp://www.theglobeandmail.com/news/world/scientist-reproduces-shroud-of-turin/article4287821/\n\nI  may have mentioned it some months ago, albeit briefly: there’s a strategy that is maybe worth pursuing that is a blend  (OK, mishmash) of Luigi Garlaschelli’s ideas and my own. It would start with his use of a pigment paste to imprint features from a real subject onto linen (being careful to avoid going “too far round the sides, i.e. being content with a shallow bas-relief effect. Now if you go to his papers you will see there is then a baking stage in an oven (intended partially or primarily to mimic age-related yellowing of the linen), but there is also mention of pigment subsequently flaking off, leaving a residual image, the nature of which is unspecified. Hugh Farey here has for some time been hypothesizing that the Shroud image is a ‘shadow’  or faint signature of something that was originally more prominent, prior to a flaking off (and I have said the same previously re partially or extensively flaked-off bloodstains).\nIs anyone thinking what I am thinking? The oven treatment did more than just artificially age the linen. It produced a more pronounced  and highly localized chemical reaction between the pigment and the underlying linen that might be described as thermochemical imprinting via temperature-assisted chemical ‘scorching’. The phenomenon is not too dissimilar to the one I described in my very first posting on the TS, referred to as thermo-stencilling:\nhttp://colinb-sciencebuzz.blogspot.fr/2011/12/turin-shroud-could-it-have-been.html\nThere I used charcoal as the pigment, and radiant heat at a distance to get it hot (rather than baking in an air oven, or direct contact say with a hot iron). But the end -result is/was (or could have been) the same – localised scorching of the linen in contact with pigment. This model has similarities and differences with the direct scorching model that I later adopted using heated metal or ceramic templates like a “cattle brand” instead of a real subject. But then ideas evolve (sometimes getting side-tracked!) and I have always been impressed with Garlaschelli’s end-result, differing only with his interpretation of how the end-result was achieved, a closer scrutiny of  that oven-baking step perhaps being required.\nThere’s more one could say about the chemistry that produces the scorch,  which probably involves chemical dehydration reactions that are a sub-group of “scorching”, but that can be explored another time. The role of iron and its compounds is worth studying, especially in the light of McCrone’s (prematurely?) discredited results and interpretation thereof, recalling that Luigi used ochre – a form of iron oxide – as his imprinting pigment. Might it have had acidic impurities, producing thermochemical dehydration of linen carbohydrates, allowing scorching at lower temperatures than required for direct hot template contact? \nThanks for the reminder re Luigi G. and his fascinating experiment.\n\n","date":"October 15, 2013 at 1:46 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-47524","author":"colinsberry","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"PS: see also this pdf from Thibault Heimbuger in 2008, obtained by searching “ochre acidic impurities”  – a paper that also placed the spotlight on acids and their propensity to chemically modify linen carbohydrates.\nhttp://www.shroud.com/pdfs/thibault-lg.pdf\nIt reminds one that Luigi Garlaschelli compared both dry powders and pastes in his “frottage” technique. I omitted to mention the first of these.\n\n","date":"October 15, 2013 at 3:59 am","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-47529","author":"colinsberry","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"If Luigi Garlaschelli had produced a really good and complete reproduction it would sound a death knell for Shroud studies …. and there would be no Shroudstory to post comments today. Randi,Nickell, et al would have the last laugh and devote their attention to other matters.\n\n","date":"October 16, 2013 at 3:27 pm","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-47676","author":"Louis","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"How can the image be said to be “good” when it’s incredibly faint, with some saying one has to stand metres away to discern it as the image of a man? \nOne need hardly say that the faintness is almost certainly due partly to age. Some might think it improbable that the present faint image would have been such a big draw in medieval times.By the same token, anyone attempting to reproduce all the subtle tones and fuzziness of the present image would be having to simulate centuries at least of ageing – a tall order.\nIt’s unrealistic, indeed unfair, to expect anyone, Garlaschelli included, to produce a perfect facsimile of the Shroud image. For my part, I have always ignored the challenge if expressed in those terms. It’s the claim that science has been totally unable to reproduce essential Shroud characteristics that irritates me, especially when negative character, superficiality or 3D properties are raised. Superficiality has never been determined rigorously (the 200nm figure being a a guesstimate, and probably achievable anyway with a light imprinting with conventional materials and/or sources of energy), and 3D properties can be demonstrated in any image in which the highest density corresponds with highest relief (a charcoal sketch sufficing). \nScience does not have access to a time machine to see exactly how the image was produced, and how it has subsequently aged. So let’s not set the bar impossibly high, certainly not using subjective aesthetic criteria.  It should be sufficient for science to produce a reasonable approximation of the Shroud image to show there are no insuperable obstacles to producing a highly superficial negative image with 3D properties. \nOh, and one final thing. If you take a negative image of a face, and perform a light/dark reversal together with some 3D enhancement, you will often find the end result has a serene ghostly quality as per TS. That is fully explainable in terms of terms of inversion of light v dark space, harshness becoming soft focus etc. How many folk here have experimented in this area, say with ImageJ? I have (and reported on it). The subtle qualities of the Shroud image can be quickly de-mystified by spending just an hour or two with ImageJ.\n\n","date":"October 16, 2013 at 4:02 pm","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-47677","author":"colinsberry","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"What really needs here to be de-mystified as far as the TS is concerned is your pseudo Big S(science) in archaeological image analysis and crypanalysis. \nReminder for DR. I. Colinsberry: no long ago; you could not EVEN say on which side of the TS the image was????!!!!! I had to tell you…\nStop pausing as a Big Scientist…which you are definitely not by far as far as the TS is concerned.\n\n","date":"October 16, 2013 at 5:53 pm","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-47688","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"Keep moving the goalposts, you’ll score eventually,\n\n","date":"October 16, 2013 at 7:00 pm","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-47691","author":"David Goulet","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"Keep passing unsubstantiated comment, you’ll be unnoticed\n\n","date":"October 16, 2013 at 8:12 pm","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-47701","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Responding Directly to Colin Berry","post":"I am in full agreement with blogmaster Dan in the thread “Holding the Shroud to an impossible standard?”. We have to keep an open mind and Pope John II left the issue to science. Some of this science has been able to produce a few of the Shroud’s characteristics and there is still a lot to be done. Since no fresh hands-on examination is on the Church’s agenda  we have to depend on new studies scholars and scientists will produce. What I was trying to say is that if you place the relic and Luigi Garleschelli’s reproduction side by side the difference is very obvious and we cannot forget that a true reproduction will need to demonstrate all the characteristics.\n\n","date":"October 16, 2013 at 4:59 pm","url":"https://shroudstory.com/2013/10/10/responding-directly-to-colin-berry/","cat":"science","id":"comment-47680","author":"Louis","site":"shroudstory"}]
