[{"title":"Resting on Our Laurels","post":"What many beliefs about the shroud need to be confirmed? Colin, to his credit, has not rested on his laurels. Many others have not. Many have. Many do. \nWhom do you have on mind?\n\n","date":"August 25, 2014 at 7:22 am","url":"https://shroudstory.com/2014/08/25/resting-on-our-laurels/","cat":"news_&_views","id":"comment-146010","author":"O.K.","site":"shroudstory"},{"title":"Resting on Our Laurels","post":"Let me amend what I said: Many, to my way of thinking, have and still do rest on their laurels. Not having facts to support the claim, I don’t want to name anyone.\n\n","date":"August 25, 2014 at 8:34 am","url":"https://shroudstory.com/2014/08/25/resting-on-our-laurels/","cat":"news_&_views","id":"comment-146021","author":"Dan","site":"shroudstory"},{"title":"Resting on Our Laurels","post":"Agreed. But truly, I am under impression, that if I had to name those who have rested on their laurels, there will be many great names mentioned.\nSadly, I think many great Shroud scholars from 70-80s, and even 90s,  are either dead, or have their best years behind. \nNot discounting, nor disputing their achievements, and actually having great respect for them, nevertheless I think it is time for a new generation of Shroud scholars to take the baton. We need new people, fresh minds, fresh ideas, fresh insight, to carry on with further Shroud research. The advent of Internet makes it much easier achievable. I think the future of Shroud reasearch, in absence of the access to the cloth itself, is not only in the laboratories, nor at the conferences, but in the places like shroudstory, where people may virtually gather and exchange insights, thanks to your efforrt Dan.\n\n","date":"August 25, 2014 at 9:01 am","url":"https://shroudstory.com/2014/08/25/resting-on-our-laurels/","cat":"news_&_views","id":"comment-146026","author":"O.K.","site":"shroudstory"},{"title":"Resting on Our Laurels","post":"For me, there’s no immediate prospect of resting on laurels, not while attempts are still being made on this very site to pdf me into submission. (Two ”potpourri de fantasie’  have been returned to sender.  Here’s hoping the third – and allegedly last – promises, promises- is a little more sweet-smelling).\nDefending the contact-imprinting/non-radiation model feels more like a bed of nails right now. The laurels will have to wait.\n\n","date":"August 25, 2014 at 7:52 am","url":"https://shroudstory.com/2014/08/25/resting-on-our-laurels/","cat":"news_&_views","id":"comment-146012","author":"Colin Berry","site":"shroudstory"},{"title":"Resting on Our Laurels","post":"It rather looks like pet theory pushing, science will have to wait.\n\n","date":"August 25, 2014 at 12:14 pm","url":"https://shroudstory.com/2014/08/25/resting-on-our-laurels/","cat":"news_&_views","id":"comment-146064","author":"anoxie","site":"shroudstory"},{"title":"Resting on Our Laurels","post":"Fortunately  I don’t depend on troll anoxie to tell me if I’m on the right track or not. That’s the beauty of the scientific method – it liberates one from the otherwise negative and dispiriting anoxies of the internet, who stalk the internet in search of candidates for the demonising thereof.\n\nOh, et elle ne semble pas savoir la différence entre une théorie et un modèle de travail («hypothèse scientifique»).\n\n","date":"August 25, 2014 at 1:23 pm","url":"https://shroudstory.com/2014/08/25/resting-on-our-laurels/","cat":"news_&_views","id":"comment-146075","author":"Colin Berry","site":"shroudstory"},{"title":"Resting on Our Laurels","post":"Time will tell.\n\n","date":"August 25, 2014 at 12:33 pm","url":"https://shroudstory.com/2014/08/25/resting-on-our-laurels/","cat":"news_&_views","id":"comment-146067","author":"Louis","site":"shroudstory"},{"title":"Resting on Our Laurels","post":"It was rethoretical, the TS is not a scorch.\nBut i’m still puzzled by Thibault’s answers, not mentionning the crystal strutcture of flax fibers or characteristics of high temperature rapid heating to discard scorching.\n\n","date":"August 25, 2014 at 1:30 pm","url":"https://shroudstory.com/2014/08/25/resting-on-our-laurels/","cat":"news_&_views","id":"comment-146077","author":"anoxie","site":"shroudstory"},{"title":"Resting on Our Laurels","post":"Anoxie,\n“But i’m still puzzled by Thibault’s answers, not mentioning the crystal structure of flax fibers or characteristics of high temperature rapid heating to discard scorching.”\nRogers already answered: “Microscopy proves that image fibers are quite different in structure and composition. The distribution of color is different, even at the level of single fibers. The image was NOT formed by scorching the linen fibers”.\nRogers used a petrographic microscope. I have a microscope with polarized light. However a petrographic microscope, although using polarized light, is much more sophisticated than my microscope.\nFor example, Rogers have shown that the medulla of a “LIGHTLY scorched fiber” from the TS shows “darker coloration than the rest of the fiber” while in “an unusually  deeply colored image fiber, the medulla is completely colorless” ( A chemist perspective…, p. 32, with photographs).\nThis is the kind of facts that are completely ignored by Colin.\nI guess that he does not even have this fundamental book.\n\n","date":"August 25, 2014 at 4:31 pm","url":"https://shroudstory.com/2014/08/25/resting-on-our-laurels/","cat":"news_&_views","id":"comment-146105","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Resting on Our Laurels","post":"Too true I don’t have Rogers’ ‘book, and have no intention of doing so (though am able to read key sections re scorching online, as I have just this minute done to refresh my memory).\nYou see, I was confronted with the quoted passage from his book on my very first visit to this site, and can recall vividly my very first reaction.\n“Why was that STURP investigator talking about linen as if it were pure cellulose”? Why was he assuming that scorching would affect something as physically and chemically stable as cellulose?  Was he not aware that there are other polymeric polysaccharides in linen that are far more chemically reactive that need to be considered first as the prime target of contact scorching? There are the pectins, and, more importantly, the hemicelluloses, especially as the latter are a major constituent of the primary cell wall, the most superficial exposed part of the linen fibre.\nHow did I know these things? Answer – because I spent 12 years researching dietary fibre  as Head of Nutrition and Toxicology at a cereal research institute – i.e. plant cell wall polymers. I also researched resistant starch, collaborating with specialists using differential scanning calorimetry to characterize it as retrograded short chain amylose, and with that background knew instantly that Rogers was focused on entirely the wrong constituent of linen fibres. It did not take long to learn that the first components of linen to dehydrate and pyrolyse, starting at about 230 degrees, are the hemicelluloses. The cellulose does not pyrolyse until much higher temperatures are reached (see paper by Wang et al).\nWhat worries me right now is that I’ve been placed on standby, in anticipation of TH’s 3rd pdf, and here he is still talking up Rogers and his work from long, long ago, seemingly indifferent or ignorant of the profound gaps in Rogers’ knowledge of the plant fibres and their detailed chemical make-up, treating them as I say as if they had been pure cellulose.\nI shall not be waiting with bated breath to see that 3rd pdf, given TH’s failure to acquaint himself with everything I have been saying for months, indeed years. It’s customary, indeed courteous, to find what one’s opponents are thinking and writing before subjecting them to critiques, especially when the latter offer no facility for commenting and correcting the record.\nI’ve said it before and I’ll say it again: Dan Porter should not be allowing hugely under-informed TH to subject me to trial by unanswerable pdf on this site, AND highlight those same pdfs in his sidebar. Why has he not relayed some of the criticism voiced on my own site, given that he’s covered so much of the other content?  How many people here know that I have found major faults with TH’s experimental methodology (pdf 1, totally unsuitable template) and been totally unable to reproduce the major “finding” of his pdf2 (“impossible to scorch superficially at the thread level”).\nTH should stick to his medicine. He is not trained in research methods. It takes a minimum  of 6 years at a UK university to reach doctorate level – which is one year longer than a bachelor’s degree in medicine. Does he seriously imagine that his medical degree equips him to do scientific research as well? He hasn’t the first clue about designing OBJECTIVE research protocols. The bias literally leaps out of the page at one (try reading his Introduction to pdf1 – which would never have got past peer review in a reputable scientific journal).\n\n","date":"August 25, 2014 at 5:47 pm","url":"https://shroudstory.com/2014/08/25/resting-on-our-laurels/","cat":"news_&_views","id":"comment-146120","author":"Colin Berry","site":"shroudstory"},{"title":"Resting on Our Laurels","post":"Colin, I only have a high school degree in science and I know how to use “scielntific methodology”. You want to have a go at TH, be my guest, but get off that bloody high horse first. I know scores of people who have no degree and who are just as versed in the scientific method as any of you pontificiating blowhards here. I don’t care who is published in what journal. I don’t care if you present your opinions/studies in pdf’s,on papernapkins or written in the sand. \nI think it best I take a break from this blog, all Shroud blogs for awhile, because the lot of you are becoming insufferably pretensious boors. .\n\n","date":"August 25, 2014 at 10:34 pm","url":"https://shroudstory.com/2014/08/25/resting-on-our-laurels/","cat":"news_&_views","id":"comment-146160","author":"David Goulet","site":"shroudstory"},{"title":"Resting on Our Laurels","post":"That’s the trouble, DavidG – everyone thinks they know how to use the scientific method. It’s like everyone claiming to be a competent plumber, electrician or physician. Why do you think a postgraduate training in research methods takes upwards of three years?\nPeople cannot simply be told and trusted to be objective, self-critical, fair-minded, responsive to reasonable criticism etc etc. All these things take more than self-discipline. They require the watchful eye of supervisors, colleagues, professors, conference attendees, journal referees etc etc. One evolves and indeed is fashioned  by degrees over months and years into an objective and trustworthy scientist – it does not happen overnight.\nYes, it’s essentially about trust – and the grounding in professional MO that underpins trust, DavidG. Unlike medicine, there’s no Hippocratic Oath in science – just an appreciation of what is expected of one, and what one can reasonably expect of others who claim to be scientists, especially where there’s been no formal research training and/or lack of research qualifications.\nNope. It’s not about ego or self-aggrandisement. It’s about protecting the brand. Medics especially should understand that.\nDon’t go, by the way, DavidG. You’re needed here. Others aren’t – not if they are pretend-scientists, using the site and their pdfs to snipe at the ideas and working models of others, while having nothing constructive of their own to offer. \n As a retired professional scientist, I am entitled  to speak my mind about those who target me specifically, promoting their dogma and their agendas while kidding themselves and maybe others it’s science, and indeed packaging it up as look-alike science. \n Pdfs should be banned from the site. What’s wrong with guest-postings, as used on occasions by others, with or without formal training in research? A long pdf could be replaced by a two or three-part guest-posting, allowing time and space for those all-important comments. (It’s called free speech, democracy etc etc – an essential ingredient of the scientific MO. Not everyone knows that).\n\n","date":"August 26, 2014 at 1:27 am","url":"https://shroudstory.com/2014/08/25/resting-on-our-laurels/","cat":"news_&_views","id":"comment-146192","author":"Colin Berry","site":"shroudstory"},{"title":"Resting on Our Laurels","post":"Colin, While I appreciate your input, I think I’ll continue to run the blog the way I do, PDFs and all. It is working well for most of us.\nI don’t want to see David Goulet go. He is insightful and thought provoking. Also, he is right when he tells you to get off that bloody high horse of yours. You need to hear it. Your insulting and ridiculing mannerisms descend like a blinding fog over your presentation of science. One need only look at the most recent post in your own blog to see this. You wrote: “Meanwhile, shroudology’s dwindling number of surviving non-contact models, some with total loss of brain stem activity,  remain on life-support, being drip fed in a desperate attempt to keep them alive, or at any rate in a permanent zombie state, one that hovers somewhere between life and death.”\nYes, I am critical of some of these non-contact methods. Others are as well. But we try not to resort to mean-spirited ridicule: something that strikes me as not very professional, scientifically that is.\n\n","date":"August 26, 2014 at 6:22 am","url":"https://shroudstory.com/2014/08/25/resting-on-our-laurels/","cat":"news_&_views","id":"comment-146244","author":"Dan","site":"shroudstory"},{"title":"Resting on Our Laurels","post":"My  advice is “Don’t let it beat you, David G.”  Keep on keeping on if you can.  Ignore the slings and arrows and the backbiting.  They don’t really matter.  A few old regulars from a year ago no longer seem to blog here, possibly for similar reasons, which is a pity.  Knowledge nowadays is a highly specialised commodity, but Shrouding crosses several disciplines, and no single specialty has the answer.  The specialist becomes focused on the single tree, and sometimes fails to see the forest, even when he does ride a high horse.  We shall discover what we are meant to know, and no more, as Adam once discovered in Eden despite deceitful words from a talking snake.\n\n","date":"August 26, 2014 at 1:31 am","url":"https://shroudstory.com/2014/08/25/resting-on-our-laurels/","cat":"news_&_views","id":"comment-146195","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Resting on Our Laurels","post":"There’s nothing wrong with PDFs.  Unless they’re in ‘secure’ mode, it’s an easy matter to add whatever comments one deems desirable.\n\n","date":"August 26, 2014 at 1:37 am","url":"https://shroudstory.com/2014/08/25/resting-on-our-laurels/","cat":"news_&_views","id":"comment-146197","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Resting on Our Laurels","post":"There’s everything wrong with pdfs when they are used specifically to target another researcher and his ideas, with no thought given to providing a practical, easily accessible interactive comments facility. \nIt gets worse when the pdfs are billboarded on this site, and when their unchallenged/unchallengeable claims get cited in the wiki entry on Shroud of Turin as “scientific evidence” against thermal imprinting models.\nSee my earlier comment re the essentially undemocratic “we’ll have the final word” nature of the pdf format, which circumvents both peer review and open internet-based discussion, Dan’s blog is being used as a one-way street. \nWhy is TH allowed to use someone else’s website in this way, when he has one of his own (albeit dormant but still accessible).\n\n","date":"August 26, 2014 at 2:23 am","url":"https://shroudstory.com/2014/08/25/resting-on-our-laurels/","cat":"news_&_views","id":"comment-146204","author":"Colin Berry","site":"shroudstory"},{"title":"Resting on Our Laurels","post":"PS: why should posting photographs be a problem for TH, necessitating that pdf format, or so he maintains. \nTH set up his own website years ago.\nhttp://www.suaire-science.com/auteur.htm\nHe could use his site as a halfway house, posting his photos into an archive there, and then pasting the URL of those pix into guest postings on this site. It ain’t rocket science.\n\n","date":"August 26, 2014 at 2:09 am","url":"https://shroudstory.com/2014/08/25/resting-on-our-laurels/","cat":"news_&_views","id":"comment-146201","author":"Colin Berry","site":"shroudstory"},{"title":"Resting on Our Laurels","post":"Gents, I must apologize. I was in a terse mood last night (for various reasons) and should have refrained from posting until after a good night’s sleep. I am sensitive, I suppose, to people who flash their degrees around. Neither of my parents attended university, my mom didn’t even finish high school and my dad was a country undertaker. My town was made up of farmers and lumbermen – not a degree among them. But many of them were absolutely brilliant thinkers, engineers and ‘scientists’. Colin, your educational background and experience as a scientist is impressive – and anyone here that belittles it is foolish to do so. You have a right to defend your hard earned knowledge, but be mindful when doing so that life is a pretty good university. All of us have earned degrees of some form at that school — even if we don’t have the paperwork to hang on a wall.\n\n","date":"August 26, 2014 at 7:48 am","url":"https://shroudstory.com/2014/08/25/resting-on-our-laurels/","cat":"news_&_views","id":"comment-146260","author":"David Goulet","site":"shroudstory"},{"title":"Resting on Our Laurels","post":"DavidG: I suggest your re-read troll anoxie’s comment, and the reply it elicited from Thibault Heimburger. \nThere’s a difference, as indeed you seem to recognize, between defending one’s scientific credentials and flaunting them. I do defend. I don’t do flaunt.\n\n","date":"August 26, 2014 at 8:21 am","url":"https://shroudstory.com/2014/08/25/resting-on-our-laurels/","cat":"news_&_views","id":"comment-146269","author":"Colin Berry","site":"shroudstory"},{"title":"Resting on Our Laurels","post":"You were provoked, agreed. Flaunting is not the right word. But there was collateral damage with your defense, in my opinion. I know that was not your intention.\nIf I may add one further observation on this point (before I become the tedious boor), I really appreciate the attitude of Hugh Farley on this site. He’s as patient as Job, even when the jabs come his way. His defense is not a tirade but a relentless sticking to the facts. This prevents debate spiraling off into these very kinds of discussions we’re having now. I find this attitude forces me to also stick to the facts, the science (while still allowing for some out of the box thinking).\nThe end result is the science is better served, better defended. There is an expression (Flaherty?) “to the hard of hearing one must shout”. But it is also true that if you shout all the time, others go deaf.\nNow let’s get back to the good stuff. I wish there was a Shroud Expo where guys like you and TH could meet and would have access to a lab and could do these experiments right there. No need for pdfs. They have these communal labs in many cities now, where entrepreneurs and tinkerers can share 3D printers and other technology. Why not a Shroud Expo like that instead of just dry lectures all the time? If we can’t get the Vatican/Turin to allow STURP 2.0 could we not at least try something like this?\n\n","date":"August 26, 2014 at 9:16 am","url":"https://shroudstory.com/2014/08/25/resting-on-our-laurels/","cat":"news_&_views","id":"comment-146277","author":"David Goulet","site":"shroudstory"},{"title":"Resting on Our Laurels","post":"Dan, I’m sure you mean well, but it’s not for you or anyone else to dictate the tone of my commentary. If you disapprove of what I write on my own site, then why give my words wider currency by quoting them here?\nRest assured that I shall remain a free spirit, saying what I want, when I want, where I want. \nI shall not be restrained from saying what I think about agenda-driven so-called science that attempts to ridicule or dismiss contact-imprinting, whether it’s by monotonous repetition of dodgy tendentious claims from the past, or with careless and/or rigged experimental designs. \nYou are of course free to publish TH’s third polemical anti-scorch pdf here if you wish, overriding  my protests.  But any response I make on my own site will carry a copyright warning. Take it as read you no longer have permission to cut-and-paste my verbatim content here. That will constitute an infringement of my copyright.\n\n","date":"August 26, 2014 at 8:01 am","url":"https://shroudstory.com/2014/08/25/resting-on-our-laurels/","cat":"news_&_views","id":"comment-146263","author":"Colin Berry","site":"shroudstory"},{"title":"Resting on Our Laurels","post":"Sorry, Colin. But once you post anything on the internet, it’s public domain. As long as Dan credits you properly there’s nothing you can do about it. That being said, Dan, I would ask that you honour Colin’s request as I believe that he is owed that professional courtesy. A simple link to his response would be fair.\n\n","date":"August 26, 2014 at 9:21 am","url":"https://shroudstory.com/2014/08/25/resting-on-our-laurels/","cat":"news_&_views","id":"comment-146280","author":"David Goulet","site":"shroudstory"},{"title":"Resting on Our Laurels","post":"Fair Use Quoting vs. Chilling Effect Censorship:  From Wikipedia: “In a legal context, a chilling effect is the inhibition or discouragement of the legitimate exercise of natural and legal rights by the threat of legal sanction.[1] The right that is most often described as being suppressed by a chilling effect is the US constitutional right to free speech. A chilling effect may be caused by legal actions such as the passing of a law, the decision of a court, or the threat of a lawsuit; any legal action that would cause people to hesitate to exercise a legitimate right (freedom of speech or otherwise) for fear of legal repercussions.”\nHere in the U.S. chilling effect censorship isn’t very popular. I don’t know about the U.K.  As I remind Stephen Jones, I use Fair Use principles and Fair Use law when quoting. Your blogging facility has even created a feature called Blog This to simplify quoting. So has mine, called Reblog. But go for it. You are free to try to define your own copyright rules above and beyond the provisions of the law. You may also file a complaint if you think I am going beyond fair use. You might want to read what Blogspot and WordPress have to say about this. They don’t like chilling effects censorship — nobody does except maybe repressive governments. In fact, WordPress sues and either hosting company may shut down bloggers from their own systems who file unwarranted complaints. \nYou are free to quote me anytime. I stand by what I write. I have no problem with anyone quoting me. \nHere is a guidelines from the highly respected Electronic Frontier Foundation:\nQuestions About Copyright\nI found something interesting on someone else’s blog. May I quote it?\nYes. Short quotations will usually be fair use, not copyright infringement. The Copyright Act says that “fair use…for purposes such as criticism, comment, news reporting, teaching (including multiple copies for classroom use), scholarship, or research, is not an infringement of copyright.” So if you are commenting on or criticizing an item someone else has posted, you have a fair use right to quote. The law favors “transformative” uses — commentary, either praise or criticism, is better than straight copying — but courts have said that even putting a piece of an existing work into a new context (such as a thumbnail in an image search engine) counts as “transformative.” The blog’s author might also have granted you even more generous rights through a Creative Commons license, so you should check for that as well.\nWhat is fair use?\nThere are no hard and fast rules for fair use (and anyone who tells you that a set number of words or percentage of a work is “fair” is talking about guidelines, not the law). The Copyright Act sets out four factors for courts to look at (17 U.S.C. § 107):\nThe purpose and character of the use. Transformative uses are favored over mere copying. Non-commercial uses are also more likely fair.\nThe nature of the copyrighted work. Is the original factual in nature or fiction? Published or unpublished? Creative and unpublished works get more protection under copyright, while using factual material is more often fair use.\nThe amount and substantiality of the portion used. Copying nearly all of a work, or copying its “heart” is less likely to be fair.\nThe effect on the market or potential market. This factor is often held to be the most important in the analysis, and it applies even if the original is given away for free. If you use the copied work in a way that substitutes for the original in the market, it’s unlikely to be a fair use; uses that serve a different audience or purpose are more likely fair. Linking to the original may also help to diminish the substitution effect. Note that criticism or parody that has the side effect of reducing a market may be fair because of its transformative character. In other words, if your criticism of a product is so powerful that people stop buying the product, that doesn’t count as having an “effect on the market for the work” under copyright law.\n\n","date":"August 26, 2014 at 9:34 am","url":"https://shroudstory.com/2014/08/25/resting-on-our-laurels/","cat":"news_&_views","id":"comment-146283","author":"Dan","site":"shroudstory"},{"title":"Resting on Our Laurels","post":"I repeat: I shall be attaching a copyright statement to all my future postings. That will continue for as long as material critical to my ideas appears on this site, notably by third parties in pdf form, where there is no facility for defending one’s work. One cannot have one’s research findings, the product of days or maybe weeks of work, lifted verbatim from one’s own site, and then attacked here by third parties who are protected from criticism. It’s a clear and flagrant abuse of the internet to have one’s copy used against one in this manipulative fashion. Dan: it’s time you desisted from this control freakery. You should cease acting like some kind of Godfather of Shroudology.\nI hope WordPress gets to read this soon, and will see the justice of my position,.\n\n","date":"August 26, 2014 at 10:03 am","url":"https://shroudstory.com/2014/08/25/resting-on-our-laurels/","cat":"news_&_views","id":"comment-146289","author":"Colin Berry","site":"shroudstory"},{"title":"Resting on Our Laurels","post":"If you don’t play by my rules and let me win I’ll take my ball and go home.\n\n","date":"August 26, 2014 at 11:14 am","url":"https://shroudstory.com/2014/08/25/resting-on-our-laurels/","cat":"news_&_views","id":"comment-146300","author":"Paulette","site":"shroudstory"},{"title":"Resting on Our Laurels","post":"… Or throw my toys out of the cot!\n\n","date":"August 26, 2014 at 4:21 pm","url":"https://shroudstory.com/2014/08/25/resting-on-our-laurels/","cat":"news_&_views","id":"comment-146341","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Resting on Our Laurels","post":"Go to the wiki entry on the Shroud of Turin, then scroll down to Bas Relief, then read the entry relating to research by one Thibault Heimburger linked to his pdf on this site. There you will learn that scorch images can never have the properties of the TS image. Shame his experiments did NOT use a bas-relief. Indeed, they used a plate of steel with no bas relief properties, indeed the precise opposite (sunken relief). So there you will find a total misrepresentation of everything that ‘scorch researchers’ myself included have been saying for many years, based on a totally unsuitable choice of template. \nI have pointed out TH’s appalling choice of template several times. TH has shrugged it off, the site owner has chosen to ignore my protests, while wiki, many folk’s first port of call, continues to broadcast what can best be described as misinformation.\nThat was followed by pdf2, making absurd claims about it being impossible to imprint a superficial scorch on a linen thread – that it’s a choice between scorching all the fibres or none of them. That is totally absurd, as I showed recently. One can scorch just a few superficial threads.\nSo we now have 2 pdfs that are shown in this site;s sidebar, the second at the very top, highlighted in red font, yet neither can be commented on or criticized, yet as I say  are being linked to elsewhere as if the scientific gold standard. They are not. Both in their separate ways are hugely flawed, yet neither TH nor Dan Porter does a thing about it. To cap it all, we are warned that a third pdf is on the way.\nThis site is being used to disseminate false information re the ‘scorch hypothesis’ or ‘contact imprinting’ model as I now prefer to call it.\nChildish putdowns from this site’s regulars will not stop me from flagging up what I consider to be a gross abuse of an internet sitet to attack what I consider to be a working model that explains an increasing number of TS characteristics. They include ones that   initially we were told were “unique” to the TS image (3D properties, superficiality) or which have been played down for lack of  a pro-authenticty explanation (negative character), excluding ‘magic’ radiation unknown to conventional physics.\nI come here to argue the nitty gritty science, not to pander to those who want everything gift-wrapped in ambiguity. Sorry – I don’t do ambiguity.\n\n","date":"August 26, 2014 at 4:49 pm","url":"https://shroudstory.com/2014/08/25/resting-on-our-laurels/","cat":"news_&_views","id":"comment-146344","author":"Colin Berry","site":"shroudstory"},{"title":"Resting on Our Laurels","post":"CB: ““Why was that STURP investigator talking about linen as if it were pure cellulose”? Why was he assuming that scorching would affect something as physically and chemically stable as cellulose? Was he not aware that there are other polymeric polysaccharides in linen that are far more chemically reactive that need to be considered first as the prime target of contact scorching? There are the pectins, and, more importantly, the hemicelluloses, especially as the latter are a major constituent of the primary cell wall, the most superficial exposed part of the linen fibre.”\nCB should know the history of  STURP studies. He does not.\nCB should know that the discovery of the color being only confined to the most superficial layers of image fibers came later.\nCB should thanks Adler and Rogers for this discovery.\nCB:”I’ve said it before and I’ll say it again: Dan Porter should not be allowing hugely under-informed TH to subject me to trial by unanswerable pdf on this site, AND highlight those same pdfs in his sidebar. Why has he not relayed some of the criticism voiced on my own site, given that he’s covered so much of the other content? How many people here know that I have found major faults with TH’s experimental methodology (pdf 1, totally unsuitable template) and been totally unable to reproduce the major “finding” of his pdf2 (“impossible to scorch superficially at the thread level”).\nYears ago, I proposed you to write with me a paper in witch we could discuss your opinions and findings. This might be the beginning of a fruitful discussion; You disagreed (!!). Therefore my PDFs.\nRegarding my previous PDFs (PDF 1 and 2), CB has to wait for my last PDF (PDF3)\nCB: “PS: why should posting photographs be a problem for TH, necessitating that pdf format, or so he maintains.\nTH set up his own website years ago.\nhttp://www.suaire-science.com/auteur.htm\nHe could use his site as a halfway house, posting his photos into an archive there, and then pasting the URL of those pix into guest postings on this site. It ain’t rocket science.”\nBecause the software I used for my own site is no longer available.\nMore later…\n\n","date":"August 26, 2014 at 5:22 pm","url":"https://shroudstory.com/2014/08/25/resting-on-our-laurels/","cat":"news_&_views","id":"comment-146349","author":"Thibault HEIMBURGER","site":"shroudstory"}]
