[{"title":"Ridiculous Quote for Today","post":"The life of James Ussher 1581-1656 overlapped by some 18 years that of a founder of modern geology Nicolaus Steno 1638-1686. Ussher was no intellectual slug, was an expert on semitic languages, and remains a highly respected biblical scholar for his time. In particular he is credited with correctly distinguishing authentic and spurious epistles credited to Ignatius of Antioch of the 2nd century. By back-working the biblical genealogies he had calculated the date of Creation during the Saturday evening of October 22, 4004BC, somewhat older than that calculated by Johannes Kepler, who was famous for his laws of planetary motion. \nThe Danish Nicolaus Steno, originally trained in medecine, made major break-throughs in anatomy, including discovering the parotid salivary duct, and other discoveries in anatomy which had remained unchanged since the time of Galen. Appointed as physician to Grand duke Ferdinand in Florence, he became fascinated with the layered limestone strata of Italy. He made major discoveries in crystallography, particularly quartz.   \nSteno was the first to realize that the Earth’s crust contains a chronological history of geologic events and that the history may be deciphered by careful study of the strata and fossils. He rejected the idea that mountains grow like trees, proposing instead that they are formed by alterations of the Earth’s crust.\nMost scientists of his time considered that fossils such as shells either grew in the rocks, or else were the inundation remnants of Noah’s flood, and Steno found little support for his ideas, except from Gottfried Leibniz. Steno was constrained by the religious bigotry of his time to compress his geology into a period of 6000 years. Having learnt their lesson from the Galileo case, the Catholic Church was one of the first institutions to abandon the 6000 year old world history concept. Nevertheless elsewhere the idea survived well into the 18th century. \nDisillusioned with the backbiting and rivalries within science, Steno abandoned it and caught religion, converted to Catholicism (he had worked with the younger Medici family in Florence) took Holy Orders, and was commissioned as the Pope’s envoy to Germany and Scandinavia where he lived and died in extreme voluntary frugality. Pope John Paul II beatified him in 1992, somewhat ironically on October 23 within a day of the same date that Archbishop Ussher had set for the creation of the world.  \nSteno’s biography can be found in Alan Cutler’s “The Seashell on the Mountain Top”, Heinemann 2003. I think the best line in the book is “The summit of Mount Everest is marine limestone!”\n\n","date":"April 24, 2014 at 7:00 am","url":"https://shroudstory.com/2014/04/24/ridiculous-quote-for-today/","cat":"quotations","id":"comment-103153","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Ridiculous Quote for Today","post":"Discussing on Earth’s Crust…\nGeologic events and Steno :\n“… he became fascinated with the layered limestone strata of Italy. He made major discoveries in crystallography, particularly quartz.  Steno was the first to realize that the Earth’s crust contains a chronological history of geologic events … etc. …”\nSo … in our times…\nWhat is the new idea ?\nHave you read the article by Carpinteri, Lacidogna, Manuello and Borla on Earth’s Crust ?\nEvidence of piezonuclear reactions: From geological and tectonic transformations to neutron detection and measurements\nExperimental Mechanics on Emerging Energy Systems and Materials, Volume 5\nConference Proceedings of the Society for Experimental Mechanics Series\n2011, pp 41-48 \nLink :  http://link.springer.com/chapter/10.1007%2F978-1-4419-9798-2_6\nAbstract\n>Neutron emission measurements, by means of helium-3 and neutron bubble detectors, were performed on solid specimens during three different kinds of mechanical tests: compression tests under displacement control, under cyclic loading, and by ultrasonic vibration. The material used for the tests was Green Luserna granite. Since the analyzed material contains iron, our conjecture was that piezonuclear fission reactions involving fission of iron into aluminum, and of iron into magnesium and silicon, should have occurred during compression damage and failure. It is also interesting to emphasize that the present natural abundances of aluminum (~8%), and silicon (28%) and scarcity of iron (~4%) in the continental Earth’s crust should be possibly due to the piezonuclear fission reactions considered above.\nAnd then, see also :\nGeomechanical and Geochemical Evidence of Piezonuclear Fission Reactions in the Earth’s Crust\nA. Carpinteri, A. Manuello\nPolitecnico di Torino, Department of Structural Engineering & Geotechnics, Corso Duca degli Abruzzi 24, 10129 Torino, Italy\nStrain 11/2011; 47(s2):267 – 281. \nAbstract\n>Piezonuclear reactions, which occur in inert and non-radioactive\nelements, are induced by high pressure and, in particular, by\nbrittle fracture phenomena in solids under compression. These\nlow-energy reactions generally take place in nuclei with an\natomic weight that is lower or equal to that of iron (Fe). The\nexperimental evidence, obtained from repeatable measurements\nof neutron emissions [Strain 45, 2009, 332; Strain (in press);\nPhys. Lett. A. 373, 2009, 4158], can be also recognised\nconsidering the anomalous chemical balances of the major\nevents that have affected the Earth’s crust, oceans and\natmosphere, over the last 4 billion years. These anomalies\ninclude (i) abrupt variations in the most abundant elements\nin correspondence with the formation of tectonic plates;\n(ii) the ‘Great Oxidation Event’ (2.7–2.4 billion years ago),\nwith a sharp increase in atmospheric oxygen and the\nsubsequent origin of life; (iii) the current climate acceleration\npartially because of ‘carbon pollution’. Natural piezonuclear\nreactions are induced by fault sliding and plate subduction phenomena.\nHere another title :\nReply to “Comments on ‘Geomechanical and Geochemical Evidence of Piezonuclear Fission Reactions in the Earth’s Crust’  by  A. Carpinteri and A. Manuello”  by  U. Bardi and G. Comoretto\nIt was the answer by Alberto Carpinteri and Amedeo Manuello …\nAbstract\n>In the paper entitled “Comments on ‘Geomechanical and Geochemical Evidence of Piezonuclear Fission Reactions in the Earth’s Crust’ by A. Carpinteri and Manuello” by U. Bardi and G. Comoretto, the authors criticise the hypothesis based on piezonuclear reactions for the interpretation of the compositional evolution of the Earth’s crust. We report a detailed reply of how the traditional theories, used by the authors of the comments, are obviously inadequate to describe this new kind of nuclear phenomena. Only very recently, independent authors proposed a theoretical model explaining the anomalous energy emissions in the form of neutrons, involved in piezonuclear reactions, during fracture of nonradioactive rocks. It is also known how the evidences that Bardi and Comoretto claim to be non-existent could be found in many independent works that appeared in most important journals about unexplained questions of the Earth’s crust and environment. The data reported in the original work and the details included in this reply show that it is incorrect to consider impossible or simply to ignore the existence of unexplained phenomena only because they cannot be described by traditional models and conventional theories.\nLink :\nhttp://www.researchgate.net/publication/259556161_Reply_to_Comments_on_Geomechanical_and_Geochemical_Evidence_of_Piezonuclear_Fission_Reactions_in_the_Earth%27s_Crust_by_A._Carpinteri_and_A._Manuello_by_U._Bardi_and_G._Comoretto\nUnfortunately, until now, I have not yet see the use\nof SSNTD (= solid state nuclear track detector) during\nthe experiments … or the AFM images of stones before\nand after piezonuclear reactions …\nCarpinteri used only FESEM = Field Emission Scanning Electron Microscope.\nLink :\nhttp://staff.polito.it/alberto.carpinteri/papers/CARPINTERI_2012_N.683_EM.pdf\nSee at p. 11 of 21 (= FESEM for quantitative elemental analyses) and see also at p. 13 (of 21).\nThen, here the possible title about the inherent study :\nAtomic force microscopy study of several stone surfaces, before and after piezonuclear reactions.\nBut we have to investigate two ideas\n1) that neutron emissions from an ancient earthquake that rocked Jerusalem could have created the iconic image,\n2) … and messed up the radiocarbon levels …\n\n","date":"April 24, 2014 at 8:47 am","url":"https://shroudstory.com/2014/04/24/ridiculous-quote-for-today/","cat":"quotations","id":"comment-103192","author":"piero as piezonuclear zealot","site":"shroudstory"},{"title":"Ridiculous Quote for Today","post":"I am aware of the Carpinteri et al paper. There was some discussion on this site about it in posting of Feb 14, 2014, to which I note we both contributed comments. There may also have been additional postings. I also note that the posting had comment from Barrie Schwortz on his shroud.com site. You will also be aware of De Liso’s work on the effects of earthquakes on testing of image formation to which I have often referred. \nThe authors speculate about a devastating earthquake in Jerusalem for which I think there is scant evidence and is unnecessary. A moderate earthquake is quite capable of tossing rocks about. Earthquakes have not affected the C14 dating of any other object, and it is highly speculative and dubious to assert that it affected the Shroud dating, when other more credible explanations for skewing the date are available (e.g. cotton contamination of C14 sample). \nThe late Ray Rogers gave strong arguments as to why the Shroud image was not caused by radiation of any kind.  The release of radon gas during seismic activity together with other seismic effects, such as variations in geo-magnetic and electric fields may have been a necessary contributing factor but it is questionable as a primary cause.  De Liso noted that she could only obtain images when all factors were present.  \nThe posting above is aimed at pseudo-science, and I fear that the Carpinteri paper may well qualify as such.\n\n","date":"April 24, 2014 at 4:21 pm","url":"https://shroudstory.com/2014/04/24/ridiculous-quote-for-today/","cat":"quotations","id":"comment-103317","author":"daveb of wellington nz","site":"shroudstory"}]
