[{"title":"Rolling My Eyes: The News Cycle of Jesus’ Wife","post":"If she is so interested in what is going on the field of biblical archaeology it would have been advisable to go deeper into many of the “findings”. That would enable her to see, for instance in the case of the so-called James ossuary, that many of the Israeli archaeologists, several of them secular Jews, take the New Testament accounts more seriously than many “Christians”. Being Jewish and Israeli, they understand more than many other people abroad how their ancestors thought 2000 years ago.\n\n","date":"October 3, 2012 at 8:19 am","url":"https://shroudstory.com/2012/10/03/rolling-my-eyes-the-news-cycle-of-jesus-wife/","cat":"news_&_views","id":"comment-17187","author":"Louis","site":"shroudstory"},{"title":"Rolling My Eyes: The News Cycle of Jesus’ Wife","post":"Why does the Huffington Post, on its leading Religion page publish a columnist who on her own admission is not religious, and also on her own admission is ignorant about archaeological religious discoveries, or on any religious matter at all?  Has the Huffington Post not get anything else worthwhile to say on the matter of religion, or do columnists who might be so knowledgeable ignore the Huffington Post as a publishing vehicle for their work?\nIs it possible that the Huffington Post has nothing worthwhile to say about the topic of Religion at all?  If so, why bother with it?\n\n","date":"October 3, 2012 at 3:20 pm","url":"https://shroudstory.com/2012/10/03/rolling-my-eyes-the-news-cycle-of-jesus-wife/","cat":"news_&_views","id":"comment-17195","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Rolling My Eyes: The News Cycle of Jesus’ Wife","post":"Here’s a clue.  When they start talking about Jesus’ wife, roll your eyes.  This is so tired as to not be worth responding.\n\n","date":"October 3, 2012 at 10:02 pm","url":"https://shroudstory.com/2012/10/03/rolling-my-eyes-the-news-cycle-of-jesus-wife/","cat":"news_&_views","id":"comment-17204","author":"Andy Weiss","site":"shroudstory"}]
