[{"title":"Rutler: The Mainstream Media Falls for the Latest Hoax","post":"To my mind, this proves to anyone who is even partially objective that the NY Times and the Washington Post are biased anti-Christian rags not worth the paper they are printed on, be that physical or electronic.  And people ask me why I ignore these publications!\n\n","date":"October 6, 2012 at 9:32 am","url":"https://shroudstory.com/2012/10/06/rutler-the-mainstream-media-falls-for-the-latest-hoax/","cat":"news_&_views","id":"comment-17262","author":"Andy Weiss","site":"shroudstory"},{"title":"Rutler: The Mainstream Media Falls for the Latest Hoax","post":"Father Rutler is right in drawing attention to what some dailies say in headlines and corrections that appear in  “shipping news” sections. This is a worldwide phenomenon and the reason lies in the fact that sensationalism sells, so one just has to follow the money line to understand the rationale.\nBut it is not only newspapers that are involved in leaping before looking; books also come into the picture. Take one book on the so-called James ossuary, where Ben Witherington proudly announced that the Catholic Church would have to “rethink” the Virgin birth. As soon as another, even bigger, piece of sensationalism — the “Jesus Family Tomb” — came on the scene he distanced himself from what he had said previously by saying that James was buried elsewhere, that is, not in the tomb. It is clear that it is not the media alone that can be guided by prejudice.\nIt is not difficult to find serious scholars who have no dog in the fight. Many of the top and highly respected Israeli archaeologists believe in the NT accounts. Take, for instance, Dan Bahat and Amos Kloner.\n\n","date":"October 6, 2012 at 9:35 am","url":"https://shroudstory.com/2012/10/06/rutler-the-mainstream-media-falls-for-the-latest-hoax/","cat":"news_&_views","id":"comment-17263","author":"Louis","site":"shroudstory"},{"title":"Rutler: The Mainstream Media Falls for the Latest Hoax","post":"Rev Rutler makes a good point concerning the sensationalistic seeking media.  However his choice of hoax examples is a mixed bag, designed to suit his own apparently overly-conservative outlook.  His assertion that Mgr Ronald Knox was the leading 20th century biblical scholar would seem to circumscribe his acquaintance with more knowledgable scholars than Knox, competent scholar ‘though he was.  Whereas he castigates hoaxers he finds fault with, Knox’s hoax to Londoners that Big Ben was about to fall over seems to him to be a playful prank.  Conservative that he is, he seems to be too prepared to accuse Teilhard de Chardin of involvement with the hoax of the Piltdown man, although this has never been proven.  \nBy way of contrast, the Wellington diocesan newspaper Wel-Com October issue has just published on its p.17, Michael Peppard’s affirmative piece on ‘Jesus said to them, ‘My wife’ ‘, even though Peppard does not include in his article anything concerning the debate on the fragment’s authenticity.  The piece does not appear on the Wel-Com’s web-site although other October articles are so shown.  You can find Peppard’s piece on:\nhttp://www.commonwealmagazine.org/blog/?p=20815, together with his various other comments supporting the fragment’s authenticity, along with various blog comments.   \nThe point is that despite the Rutler’s and Peppard’s opposing views on this fragment, neither know yet whether the fragment is authentic or not,  That has yet to be tested. \nNice surprise for Andy Weiss:  When the sun next rises in your time zone, Sunday Oct 7, you’ll find the Google title has a nicely decorated header for Niels Bohr’s 127th birthday!\n\n","date":"October 6, 2012 at 3:47 pm","url":"https://shroudstory.com/2012/10/06/rutler-the-mainstream-media-falls-for-the-latest-hoax/","cat":"news_&_views","id":"comment-17272","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Rutler: The Mainstream Media Falls for the Latest Hoax","post":"Father Rutler made a mistake by saying that the “Jesus’ wife” papyrus can be ruled out because although most experts seem to have dismissed it the tests have yet to be made. There are many magazines, including liberal Catholic ones, not known for material written by top scholars, who will continue to devote attention to this “finding”, may in fact support Karen King’s contention. Quislings within Catholicism are not uncommon and contribute to the slow downfall of the “fortress” that Malcolm Muggeridge wrote about. If the priest was so worried about what is being — and has been — announced all he had to do was to go to the right sources. He would soon learn that, whatever the result of the tests made on the papyrus, it makes no difference to Christianity.\n\n","date":"October 6, 2012 at 10:27 pm","url":"https://shroudstory.com/2012/10/06/rutler-the-mainstream-media-falls-for-the-latest-hoax/","cat":"news_&_views","id":"comment-17275","author":"Louis","site":"shroudstory"},{"title":"Rutler: The Mainstream Media Falls for the Latest Hoax","post":"Following on from my comment above, Rev Rutler is something of a hoaxer himself with his carefully worded insuations against Teilhard de Chardin.  The hoax ocurred at Piltdown Common,in Sussex England following a series of discoveries there in 1910-12.  It was one of the most successful scientific hoaxes ever perpetrated, and puzzled scientists for over 40 years, as it appeared to be an anomaly in the evolutionary chain, some referring to it as the missing link,  Further genuine discoveries highlighted the anomaly, and in 1953 a close examination of the Piltdown remains showed them to be a modern cranium, the jaw and teeth of an orangutan, and the tooth of what was likely a chimpanzee, all fraudulently planted in shallow gravels.  The fragments had been deliberately stained with chromium and iron sulfate, and the teeth subjected to artificial abrasion. \nIdentity of the perpretator remained a mystery, Suspects included the discoverer Charles Dawson, motive – seeking admission to Royal Society; a friend of Dawson’s – Samuel Woodhead; Sir Arthur Conan Doyle who lived nearby; Sir Arthur Keith prominent in museum circles.  Teilhard worked with Dawson and was also a suspect;  Rev Rutler says Stephen Jay Gould a palaeontologist was convinced of Teilhard’s guilt, but Gould only obtained his PhD in 1960, so could not have been privy to the identity of the hoaxer. \nIn 1996 two British palaeontologists examined contents of a trunk stored at the British museum in 1975, and discovered bones stained exactly the same way as the Piltdown remains.  The trunk belonged to one Martin A C Hinton, keeper of zoology at British Museum in 1936.  Hinton had worked with Dawson in 1912, and his requests for a weekly wage had been rebuffed.  It seemed that Hinton had planted the bones to embarass Dawson, and had used the bones in the trunk to practise on beforehand.  \nSo even reverend gentlemen such as Rev Rutler can poison the well, and besmirch the character of those whose theology they disagree with.  But Teilhard leaves a better legacy than Rutler can ever hope to attain.\n\n","date":"October 7, 2012 at 2:35 am","url":"https://shroudstory.com/2012/10/06/rutler-the-mainstream-media-falls-for-the-latest-hoax/","cat":"news_&_views","id":"comment-17278","author":"daveb of wellington nz","site":"shroudstory"}]
