[{"title":"Saint John Paul II and the Shroud of Turin","post":"At times that respect and freedom are not wanted by many because they have their conclusion and try to fit the study into the conclusion, like putting the cart in front of the horse.\n\n","date":"July 7, 2013 at 9:46 am","url":"https://shroudstory.com/2013/07/07/saint-john-paul-ii-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-38694","author":"Andy Weiss","site":"shroudstory"},{"title":"Saint John Paul II and the Shroud of Turin","post":"I have posted on my Quantum Christ web site concerning JPII that he was in fact responsible for teh flawed carbon dated. He was no doubt distracted by his other concerns at the time, but tyhe decision on the protocols was his.\nBetter that the carbon dating not be done rather have it done by a “shoddy process.”\nhttp://quantumchrist-jck.blogspot.ca/\nI hope this works, I am on vacation in BC. That’s why the “.ca”\n\n","date":"July 7, 2013 at 11:10 am","url":"https://shroudstory.com/2013/07/07/saint-john-paul-ii-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-38697","author":"JOHN kLOTZ","site":"shroudstory"},{"title":"Saint John Paul II and the Shroud of Turin","post":"Pope John Paul II did not place much importance on the relic and left the question of authenticity to science. He also knew that authenticity would not answer all the questions and that demonstrated his intellectual honesty.\n\n","date":"July 7, 2013 at 2:56 pm","url":"https://shroudstory.com/2013/07/07/saint-john-paul-ii-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-38702","author":"Louis","site":"shroudstory"},{"title":"Saint John Paul II and the Shroud of Turin","post":"And, most of all, like every Pope I know, John Paul II knew very well that the Shroud and the image on it will never be able to physically prove the resurrection of Christ and all it can prove is the historical reality of Jesus’ Passion and death and the overall consistency of the Gospel accounts…  \nI remember that when he came to the Cathedral of Turin where the Shroud was publicly exposed (in 1998 I think), he made a prophetic move when he first knelt in front of the Blessed Sacrament for a few minutes BEFORE he knelt in front of the Shroud.  That theatrical gesture of the Pope said more than any discourse he could have done on the subject.  It was like he said to all of us:  If you want to find the Living Christ, it’s not on the Shroud that you will find him!   \nBut in reality, the most truthful move he could have made in the light of the Revelation of Jesus Christ would have been to knelt first in front of any human being that was present there before he came to see the Shroud (because God live inside each one of us – which is the most profound meaning of the Eucharist)!\n\n","date":"July 7, 2013 at 5:21 pm","url":"https://shroudstory.com/2013/07/07/saint-john-paul-ii-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-38703","author":"Yannick Clément","site":"shroudstory"},{"title":"Saint John Paul II and the Shroud of Turin","post":"come on….he approved the protocol base on known methods at the time…..I think many at the time had their own agendas\n\n","date":"July 7, 2013 at 6:21 pm","url":"https://shroudstory.com/2013/07/07/saint-john-paul-ii-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-38705","author":"rick","site":"shroudstory"},{"title":"Saint John Paul II and the Shroud of Turin","post":"The involvement of Pope John Paul in the 1988 C-14 tests was minimal. Extract from Emmanuela Marinelli paper “The setting for the radiocarbon dating of the Shroud”, at Valencia conference , 2012: \n“On the validity of the radiocarbon method, Cardinal Ballestrero asked the Pontifical Academy of Sciences, getting a positive response from the President, the Brazilian biologist Carlos Chagas. On the advisability of dating the Shroud, the Cardinal asked the Congregation\nfor Divine Worship and the Congregation for the Doctrine of the Faith, obtaining the nihil obstat from both. Cardinal Joseph Ratzinger, at that time Prefect of the Congregation for the Doctrine of the Faith, stated that there were no objections to date the Shroud, provided that the operation was well planned and carried out among other tests that would complete those of 1978.” \nNone of the stated requirements were satisfied. Marinelli’s paper runs for some 30 pages, including detailed citations and references. It makes provocative reading, and details the poisonous atmosphere and many errors made and the roughshod setting aside of the protocols specified by Chagas. It can be found at:\nhttp://www.shroud.com/pdfs/marinelliv.pdf\n\n","date":"July 7, 2013 at 7:08 pm","url":"https://shroudstory.com/2013/07/07/saint-john-paul-ii-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-38708","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Saint John Paul II and the Shroud of Turin","post":"The statements I have made about the participation of JPII in the final adoption of the truncated protocols is based upon a great deal  of research including communications by the Archbishop of Turin and a previously not rep,orted exchange between a well know Shroud personality and Gonella. When an objection was made to the sudden abandonment of the protocols which were approved by both the Archbishop of Turin and the head of the Pontifical Scientific Advisory Committee Chagas all Gonella could reply: “It came from higher authority.” \nThat higher authority could only be Pope John II, the official owner of the Shroud. Essentially, he stripped down the protocols and thus unwittingly sabotaged the scientific authority of the carbon dating. \nWith all due respect that statement that the adopted protocols were the represented the best science available is simply wrong. Protocols recommended in a conference at Trondheim Norway as well as a conference held in Turin in 1987 all called for sampling of different areas to prevent anomalous results. The three carbon labs tested from samples drawn from the same limited area of the Shroud which was in fact anomalous. The exclusion of STURP from the selection process ultimately doomed the carbon dating to failure. STURP data and detailed examination of the entire Shroud clearly indicated that the sample area was anomalous.\nI hope I am not shocking anybody when I suggest deep Vatican politics as well as simple greed of the carbon labs were involved.\nJPII had other matters on his plate, but the final decision was his and his alone.He personally was the owner of the Shroud.  It was a disaster and the resulting carbon dating, in the words of Thomas de Wesselow, a “fiasco.”\n\n","date":"July 8, 2013 at 12:17 am","url":"https://shroudstory.com/2013/07/07/saint-john-paul-ii-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-38712","author":"JOHN kLOTZ","site":"shroudstory"},{"title":"Saint John Paul II and the Shroud of Turin","post":"not sure how much power you think jean paul had…if you read what happen to mother angelica, you whould realize that there are powers in the vatican that move independantly from the pope..so not sure i buy\n“could only be jean paul”\n\n","date":"July 8, 2013 at 7:26 pm","url":"https://shroudstory.com/2013/07/07/saint-john-paul-ii-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-38754","author":"rick","site":"shroudstory"},{"title":"Saint John Paul II and the Shroud of Turin","post":"as far aws the sturp selection process from different areas of the shroud, i believe some of them had their own agenda….jean paul is not the owner of the shroud (by the way, here’s a newsflash..he doesn’t own saint peters bacilica either)\n\n","date":"July 8, 2013 at 7:29 pm","url":"https://shroudstory.com/2013/07/07/saint-john-paul-ii-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-38755","author":"rick","site":"shroudstory"},{"title":"Saint John Paul II and the Shroud of Turin","post":"John, your comment agrees with my own, in #3, at least to some extent. If, therefore, Professor Gonella’s “higher authority” referred to Pope John Paul II then it should be no cause for surprise but it is also possible that he left the matter with Cardinal Anastasio Ballestrero, who may have made the last decision and was as indifferent as the pontiff when it came to relics ( see the interview-article with Fr. Pfeiffer recently posted on the HSG website). In my view, if Cardinal Ballestrero, as a Carmelite, was wary about relics, Pope John Paul II, also as philosopher, knew that authenticity would leave many questions unanswered. My suggestion is that the encyclical “Fides et Ratio” should be read first as it is a very important document that merited further study by the late American Cardinal (and renowned theologian) Avery Dulles. If anyone has doubts, allow me to go further and say that more homework should be done. After reading the encyclical see the saintly pontiff’s attitude when visiting Nirmal Hriday, Mother Teresa’s shelter in Calcutta. He took a plate and a spoon and began feeding the inmates but he became silent when it came to the rest. And what was the rest? The questions…\n\n","date":"July 8, 2013 at 10:23 am","url":"https://shroudstory.com/2013/07/07/saint-john-paul-ii-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-38728","author":"Louis","site":"shroudstory"},{"title":"Saint John Paul II and the Shroud of Turin","post":"Cardinal Ballestrero received a supposedly secret directive from the Pope in May 1987. It was at that time that Gonella and Rolfe pulled the plug on a proposed film by David Rolfe that did not fit the reduced protocols. Rolfe was told by Gonella that the directive  was from the highest authority. The contents of the “secret” directive were leaked to Harry Gove, prime enemy of STURP. In October when the announcement of the three labs was made by Ballestrero, he made in clear that he was proceeding pursuant to instructions he received in May from Rome. \nThat communication was from the pope to cardinal, there was no intermediary.\nI am on vacation, replying on the fly. I have received a compliment from one very knowledgeable participant/observer congratulating me on finding the “smoking gun.” I found nothing that wasn’t there. It’s question of connecting the dots in a coherent  manner.\nSimilarly, a well know Shroud authority congratulated me on connecting the Oxford 1988 yellow cotton report with Ray Rogers (some 12 years later). \nBecause of the centrality of the carbon 14 testing to the issue of authenticity I am tempted to release my 30 page draft chapter on the issue.Those who have been helping me are somewhat enthusiastic. You will recognize their names when the time comes but I do not want to jump the gun until the project is completed.\n\n","date":"July 8, 2013 at 6:59 pm","url":"https://shroudstory.com/2013/07/07/saint-john-paul-ii-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-38750","author":"JOHN kLOTZ","site":"shroudstory"},{"title":"Saint John Paul II and the Shroud of Turin","post":"ha ha…you’ve got to be kidding\n\n","date":"July 8, 2013 at 7:30 pm","url":"https://shroudstory.com/2013/07/07/saint-john-paul-ii-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-38756","author":"rick","site":"shroudstory"},{"title":"Saint John Paul II and the Shroud of Turin","post":"So it could be that the Pope listened to Professor Gonella, who was a scientist, and turned a deaf ear to Cardinal Ballestrero, who was a Carmelite. Some orchestration was surely going on, but, whatever the case, you can be sure that all three, pontiff, cardinal, and, if the information I received was correct, scientist, did not place much faith in the authenticity of the relic. As for Professor Chagas, the day he died TV showed a ten-minute interview he had given denying the authenticity of the Shroud.\n\n","date":"July 9, 2013 at 9:35 am","url":"https://shroudstory.com/2013/07/07/saint-john-paul-ii-and-the-shroud-of-turin/","cat":"news_&_views","id":"comment-38787","author":"Louis","site":"shroudstory"}]
