[{"title":"Did Jesus Eat Fish? Not according to the Shroud of Turin. Go Figure.","post":"Does anyone really care what Jesus ate? Does it really matter? …I tend to think that it doesn’t matter…What he said is what’s important, isn’t it?  I’m also aware of some vegetarians that do eat fish, …so what!\nBut the point about the hair, that one always cracks me up. I’ve heard many people claim the man of the Shroud could not be Jesus because the hair is too long LOL. I always come back with, Were you there in the 1st century? Do you know what the ‘style’ was then? Some people even ‘quote’ scriture on this one??? …It is just one of many rediculous claims that are unsubstantiated. Like the Shroud itself does not follow scripture, of what was found in the tomb…laughable.\nR\n\n","date":"December 29, 2011 at 5:11 pm","url":"https://shroudstory.com/2011/12/29/did-jesus-eat-fish-not-according-to-the-shroud-of-turin-go-figure/","cat":"news_&_views","id":"comment-6263","author":"Ron","site":"shroudstory"},{"title":"Did Jesus Eat Fish? Not according to the Shroud of Turin. Go Figure.","post":"Quote : “Many Biblical scholars believe Jesus was a member of the Nazarene Essenes, a Jewish religious sect that followed a vegetarian diet and rejected animal sacrifices.”\nForget about that folks !  Almost 100% of the REAL and respected biblical scholars doesn’t agree one bit about this idea that Jesus was an Essenes.  In fact, there’s absolutely NOTHING in the new testament, early christian writtings or even in non jewish ancient writtings to suggest such an idea.  To me, this is one more bad example of what I call “The Da Vinci Code syndrom” !!!  Everything to make Jesus look more “mysterious”…  Unfortunatelly, many people are making big $$$ exploiting those ideas.  This is what I call “Jesus inc.” !  I don’t know if you realize this but Jesus-Christ is one of the most important multinational company on earth !!!  Sad but true…  If he wasn’t resurrected, I think Jesus would turn over in his grave ! ;-)\n\n","date":"December 29, 2011 at 8:49 pm","url":"https://shroudstory.com/2011/12/29/did-jesus-eat-fish-not-according-to-the-shroud-of-turin-go-figure/","cat":"news_&_views","id":"comment-6272","author":"Yannick Clément","site":"shroudstory"},{"title":"Did Jesus Eat Fish? Not according to the Shroud of Turin. Go Figure.","post":"Oh, I just forget something important about this Essenes hypothesis :  This sect (because that’s what it was) lived completely withdrawn from the world, exactly the contrary than Jesus during his ministry who was willing to meet everybody and who didn’t live outside his society.  Also, they were like the Pharisees in the sense that they always wanted to separate themselves to the public sinners.  Again, Jesus was exactly the opposite of this !  \nJust from those 2 examples, it is pretty obvious that Jesus wasn’t related to those people.\n\n","date":"December 29, 2011 at 8:54 pm","url":"https://shroudstory.com/2011/12/29/did-jesus-eat-fish-not-according-to-the-shroud-of-turin-go-figure/","cat":"news_&_views","id":"comment-6273","author":"Yannick Clément","site":"shroudstory"},{"title":"Did Jesus Eat Fish? Not according to the Shroud of Turin. Go Figure.","post":"Yannick, your second example IS a very strong argument for Jesus not being related to the Essenes….I agree wholeheartedly.\nR\n\n","date":"December 31, 2011 at 12:05 pm","url":"https://shroudstory.com/2011/12/29/did-jesus-eat-fish-not-according-to-the-shroud-of-turin-go-figure/","cat":"news_&_views","id":"comment-6377","author":"Ron","site":"shroudstory"},{"title":"Did Jesus Eat Fish? Not according to the Shroud of Turin. Go Figure.","post":"And you know what is the strongest argument of all Ron ?  There’s absolutely NO ancient sources (whether it’s a christian source, a jewish source or a pagan source) that make any direct or even veiled reference to Jesus as someone that was relate to the Essenes.  That tells A LOT !\n\n","date":"December 31, 2011 at 9:34 pm","url":"https://shroudstory.com/2011/12/29/did-jesus-eat-fish-not-according-to-the-shroud-of-turin-go-figure/","cat":"news_&_views","id":"comment-6393","author":"Yannick Clément","site":"shroudstory"},{"title":"Did Jesus Eat Fish? Not according to the Shroud of Turin. Go Figure.","post":"Hello.\nI would like to point out that the words you are quoting me to have said are not my words. In fact, if you look at the blog post to which you are referring, you will notice that I was quoting a biblical website. I provided the link to that site in the blog post. If you care about intellectual honesty, please clarify that I did not say anything about the shroud, I merely quoted another website.\nThanks,\nKhaetlyn Grindell\n\n","date":"March 24, 2012 at 5:03 pm","url":"https://shroudstory.com/2011/12/29/did-jesus-eat-fish-not-according-to-the-shroud-of-turin-go-figure/","cat":"news_&_views","id":"comment-9584","author":"khaetlyn","site":"shroudstory"},{"title":"Did Jesus Eat Fish? Not according to the Shroud of Turin. Go Figure.","post":"And your comment serves that purpose. Thank you for clarifying. Thank you for getting in touch.\n\n","date":"March 24, 2012 at 5:12 pm","url":"https://shroudstory.com/2011/12/29/did-jesus-eat-fish-not-according-to-the-shroud-of-turin-go-figure/","cat":"news_&_views","id":"comment-9585","author":"Dan","site":"shroudstory"}]
