[{"title":"Satan and his clever Shroud of Turin trickery","post":"I think his point is made mute by, in my sense anyways, the Shroud does in NO WAY get one’s attention off of God, on the contrary I believe it causes one to look even further for God…imho.\nThe aphorisms in his article are old and it’s a wonder anyone would still use them today, as in; Jesus would not have long hair, more then one cloth was used therefore the Shroud does not conform to scriptures etc; …simply closed minded in the sense alternatives are not tolerated or ventured and rely on ‘possible’ misinterpretations of scriptures.\nR\n\n","date":"January 23, 2012 at 12:46 pm","url":"https://shroudstory.com/2012/01/23/satan-and-his-clever-shroud-of-turin-trickery/","cat":"news_&_views","id":"comment-7422","author":"Ron","site":"shroudstory"},{"title":"Satan and his clever Shroud of Turin trickery","post":"I agree, Ron. If this author thinks that the shroud would lead folks away from Jesus he’s been sucker-punched be the devil himself. It’s a classic judo movement of the evil one to use one’s own sin of pride to hide the truth before one’s lying eyes.\n\n","date":"January 23, 2012 at 1:54 pm","url":"https://shroudstory.com/2012/01/23/satan-and-his-clever-shroud-of-turin-trickery/","cat":"news_&_views","id":"comment-7427","author":"Chris","site":"shroudstory"},{"title":"Satan and his clever Shroud of Turin trickery","post":">If Satan, as the father of lies, can disguise himself as an angel of light (2 Corinthians 11:14), then he’s probably clever enough to provide some trickery in this world. . . .\nOn that basis, maybe Satan faked Jesus’ miracles, as the Jewish religious leaders claimed (Mt 12:24; Mk 3:22; Lk 11:15), up to and including the resurrection?!\nNo, first, the evidence overwhelmingly points to the Shroud’s authenticity, and the only evidence against it is: \n1. A draft (not the original) 1389 memo by a French Bishop who claimed his predecessor (not he himself, therefore just hearsay) thirty-four years previously knew the artist who painted the Shroud (except the Shroud is not a painting);\n2. A 1988 radiocarbon test by three labs, on a tiny 1.2 x 0.8 cm, postage stamp sized sample of the Shroud, taken from the worst possible location: a damaged, patched, highly contaminated corner, claimed in a 1989 Nature paper, that the Shroud was “medieval … AD 1260-1390.” But a table in that Nature paper, giving the actual results of those test, on the same tiny sample, divided amongst the three labs, using the same AMS method of C14 dating, showed a spread of ages of the Shroud from a maximum of 795+65=860 years (Oxford) to a minimum of 591-30=561 (Arizona), i.e. 299 years. This can only be explained (assuming that at least two of the three labs did not simply bungle the test) by there being contamination from new carbon (e.g. from a 16th century invisible repair) which the labs pre-cleaning had not removed.\nSecond, the Shroud has led uncountable millions to faith in Christ, not least in the first ~1500 years of Christianity before the invention of the printing press and the translation of the Bible into national languages. If the Shroud is a trick by Satan then the joke is on him (the same applies to Picknett & Prince’s claim that Leonardo faked the Shroud as a prank played on Christianity)! \nJesus gave us a test to detect Satan’s fakes: “By their fruit you will recognize them” (Mt 7:16,20). On that criterion the Shroud has produced good fruit in the lives of uncountable millions, including mine.\nFor myself, although I had been a Bible-believing evangelical protestant Christian for nearly 40 years when I encountered the Shroud in 2005, and was already leading a happy and consistent Christian life, my knowledge of the Shroud has since lifted my love for Jesus to new heights that I could not have imagined. I feel that I now know that Jesus lived, suffered, died, and was resurrected, in the same way that the Apostle John, when he entered the empty tomb, “saw and believed” (Jn 20:8)!\n\n","date":"January 24, 2012 at 5:34 am","url":"https://shroudstory.com/2012/01/23/satan-and-his-clever-shroud-of-turin-trickery/","cat":"news_&_views","id":"comment-7458","author":"Stephen E. Jones","site":"shroudstory"},{"title":"Satan and his clever Shroud of Turin trickery","post":"“Faith without reason is fanatacism; Reason without faith is fascism” (Benedict XVI).  The Shroud puts the Biblical literalists into a similar bind as it does the skeptics!  Christianity is a product of history and the canon of scripture is the product of the early Church, not the other way round!  The writers of scripture were not concerned to write history in the style of Heredotus or even Josephus, but to proclaim their understanding of the gospel for the congregations of their time.  The Shroud image is not mentioned in the gospels for a very good reason!  It would no doubt have confused and perplexed the Jewish disciples for whom any image was anathema.  Likewise the “unclean” burial cloth was also an embarrassment.  Doubtless they were relieved to send it off to a ‘good home’ in non-Jewish Edessa.  \nNo doubt American Creationists will continue to believe in the literalism of Genesis, and not see it for what it is, an Israelite expression of the truth that God is the Master of Creation;  Our modern understanding that He chose to do this through an evolutionary process does not change this fundamental truth.  I recommend they read “The Seashell on the Mountaintop” by Alan Cutler, Heinemann 2003, the story of Nicolaus Steno, 1638-1686, the founder of modern geology.  The best line in the book is: “The summit of Mt Everest is marine limestone.”  Creationists no doubt believe the devil put it there!  I think Jesus had a similar problem with the Sanhedrin.  Pope John Pau II beatified Nicolaus in 1992, on October 23, ironically the same date that Archbishop Ussher had set for the creation of the world!\n\n","date":"January 24, 2012 at 6:36 am","url":"https://shroudstory.com/2012/01/23/satan-and-his-clever-shroud-of-turin-trickery/","cat":"news_&_views","id":"comment-7459","author":"Daveb of Wellington NZ","site":"shroudstory"}]
