[{"title":"Scientific truth is a pathway to God","post":"American Jesuit Father William R. Stoeger, who died in March this year, did a good job at the Observatory and now we see Brother Guy Consalmagno in the limelight.\nObserving the universe and life one can only partially agree with him. He did,however, mention direct experience of God, and that is good, but it is a mystical experience, one that science cannot explain.\n\n","date":"October 24, 2014 at 7:24 am","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","id":"comment-165133","author":"Louis","site":"shroudstory"},{"title":"Scientific truth is a pathway to God","post":"Nice post, Dan. Brother Guy is a favourite of mine. His ability to present faith and reason as not being mutually exclusive makes him a Christian for our times.\n\n","date":"October 24, 2014 at 9:46 am","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","id":"comment-165161","author":"David Goulet","site":"shroudstory"},{"title":"Scientific truth is a pathway to God","post":"I have read that\n>A mission to the moon has become one of Russia’s top priorities in space. Russia plans to launch three lunar spacecraft – two to the moon’s surface and one into orbit – by the end of the decade. …\nSo it seems that there is always money to fund space missions of prestige, but the money for the studies on the Shroud are scarce. It seems to me that only Eng. Giulio Fanti was able to get a nice financial aid…\nThis also depends on the knowledge and personal skills. Therefore (going beyond the concrete results of Fanti and Malfi …) … is not it a beautiful thing to see some interesting study on the Shroud?\nThose jobs can always be a starting point …\nOr not?\n— — —\nMoving on to another topic …\nI would be interested to know the opinion of Consolmagno about the strange stigmatized Giorgio Bongiovanni (he is alleged contact with extraterrestrial entities … See also : Moving on to another topic …\nI would be interested to know the opinion of Consolmagno about the strange stigmatized Giorgio Bongiovanni. He is claims to be in contact with extraterrestrial entities …(see also : the “beings of light” Ashtar Shenar and Adoniesis… … ect.) and see also : the strange question of the third (or fourth!) secret of Fatima…\n— — —\nSee also Socci :\nhttp://www.fatima.org/news/newsviews/010207fourthsecret.asp\nIl Quarto Segreto di Fatima (= The Fourth Secret of Fatima)…\nHowever, I beg you to forgive me for the possibility of enormous confusion. There are several strange stories and we have learned that there is only the Third Secret of Fatima, this was the official Truth!\nBut Archbishop Capovilla, former secretary of Pope John XXIII, admitted there are two texts … (Mr. Socci had been in contact with Mr. Solideo Paolini, the young journalist…) \nSocci’s conclusions seemed to be consistent with reported remarks of the Pope Benedictus\nXVI himself (when he was still Cardinal Ratzinger) that his “hands were tied” on Fatima by the dictates of the former Vatican Secretary of State …\nWith the publication of Socci’s book, the “hypothesized” censorship of Sister Lucy will be seen as a grim reality by more and more people.\nIt is quite difficult to follow all these stories …\n\n","date":"October 24, 2014 at 9:57 am","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","id":"comment-165168","author":"piero","site":"shroudstory"},{"title":"Scientific truth is a pathway to God","post":"Personal testimony: I can honestly say that the God revealed by Jesus is, by far, the God that is the closest to the one I have encountered already twice in my life (spiritual-mystical experiences)…  A God who is love and nothing else.  A God who doesn’t take our sins into account.  A God who loves us not for what we do or not do, but simply for what we are (i.e. his children).  A God who is the Creator and the Saviour of all mankind (and also of all the rest of his creation) instead of being some kind of Allmighty God sitting on a throne who will judge everyone at the end of time.  A God who let his sun shine on everyone of us (good or bad, doesn’t matter).  A God who’s only plan is to take care of his whole creation right until all life he created will finally entered into his spiritual and eternal world.\nThat’s the God I know by experience.  That’s the God revealed by Jesus, especially during his Passion.  To me, the washing of the feet and his death on the cross are the pinnacle moments where Jesus revealed the true face of the only God that exist.\nWe can see something of this on the Shroud…\n\n","date":"October 24, 2014 at 10:56 am","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","id":"comment-165185","author":"Yannick Clément","site":"shroudstory"},{"title":"Scientific truth is a pathway to God","post":"I am sure that the right way is the one that inspires our hearts!\nSo, see also: the devotion to the Hearts of Jesus and Mary …\n— —\nThey are however a little upset by the idea of other civilizations in our galaxy or in our universe …\nAnother question:\nLast Saturday I read a letter published by a magazine (= “Miracoli” =”Miracles”)\nwhere the cults to extraterrestrials were defined as satanic rituals.\nIt was listed as a character identifiable as Eugenio Siragusa (the master of\nGiorgio Bongiovanni …) which (if I remember correctly) said to contact extraterrestrial entities on the slopes of Mount Etna, in Sicily!\nSee also :\nhttp://solexmaluniversallanguage.blogspot.it/p/first-meeting-on-sona-mount-etna-sicily.html\nExtraterrestrial Intelligent Life ???\n>… in 2005, a member of the Jesuit order, Father Guy Consolmagno,\nan astronomer at the Vatican Observatory, a scientist who is the\nworld’s leading authority in the study of meteors, published a small\npocket volume entitled:\n“Intelligent Life in the Universe? Catholic Belief and the Search for Extraterrestrial Intelligent Life”\npublished by the “Catholic Truth Society”, an English Catholic group. The scientist in this text affirms to believe in extraterrestrials and explains that this is not a choice  incompatible with the faith.\nlink:\nhttp://en.giorgiobongiovanni.org/heavenly-messages/2013/3609-the-merkabah-the-chariot-of-the-gods.html\n— —\nHere a strange face on wood …\nlink:\nhttp://en.giorgiobongiovanni.org/some-news/108-celestial-signs/3492-face-of-jesus-appears-on-cemetery-tree-stump.html\n\n","date":"October 24, 2014 at 11:18 am","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","id":"comment-165191","author":"piero","site":"shroudstory"},{"title":"Scientific truth is a pathway to God","post":"Errata corrige:\nNot\n>They are however in a little upset by the idea …\nBut:\n>I am however in a little upset by the idea … …\n\n","date":"October 24, 2014 at 11:21 am","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","id":"comment-165192","author":"piero","site":"shroudstory"},{"title":"Scientific truth is a pathway to God","post":"Quote: “They are however a little upset by the idea of other civilizations in our galaxy or in our universe …”\nFrom my personal experiences of God, there is no problem at all thinking he can have created other form of life elsewhere in our material universe.  God is a Creator and I don’t have any theological problem with the idea that he could have created other living creatures outside our little planet.  Now, for the question regarding UFO’s and things like that, that’s another question…\n\n","date":"October 24, 2014 at 11:31 am","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","id":"comment-165197","author":"Yannick Clément","site":"shroudstory"},{"title":"Scientific truth is a pathway to God","post":"I did not write:\n“They are However a little upset by the idea of other civilizations in our galaxy or in our universe …”\nBecause it was a simple mistake of the translator (= Google traslator)\n… As you can see from my subsequent correction!\n— — —\nIt seems to me that a famous monk, St. Padre Pio da Pietrelcina,  replied that there are other intelligent beings in the Universe…\nI have read that :\n>The book written in 1974 by the priest Don Nello Castello, “Così parlò Padre Pio” (“Thus Spoke Padre Pio”), says that someone in Padre Pio’s confraternity asked him “Father, I thought Earth was nothing compared to the stars and all the other planets”, to which Padre Pio replied “Yes, and if we leave the Earth we are nothing. The Lord certainly didn’t restrict his glory to this little planet. On other planets, there will be beings without sin.”. \n… And this was reported in a curious interview with Monsignor Corrado Balducci at the Second Ufological Conference of Ancona, entitled “Alien civilizations: between doubt and reason” on 17 April 1999….\n(= Many saints believed in extraterrestrial life !!!?!?)\nLink:\nhttp://ufodigest.com/vaticanufos.html\n… and it is for this reason that I would like to understand the position of Consolmagno about the strange case of stigmatized Bongiovanni (a character that a scientist atheist [Margherita Hack] described as fanatical [that in reply to my question]. What happened more than 16 years ago … now Hack is dead and also died the well-known physicist Tullio Regge [CICAP] = http://en.wikipedia.org/wiki/Tullio_Regge   … …)\n\n","date":"October 25, 2014 at 10:23 am","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","id":"comment-165461","author":"piero","site":"shroudstory"},{"title":"Scientific truth is a pathway to God","post":"Piero, you should note Br. Guy Consolmagno has two degrees in planetary science. In the past decade, planetary science has exploded, and the question of life with it, as a jesuit, it’s almost part of his job. I think “…the religious people seem to think they are more flexible than outsiders believe that religion would be…”.\n“Theology is not, a set of beliefs written in stone that people subscribe to, but it’s a way that people make sense of their experience… in one sense dealing with the discovery of extraterrestrial life for a believer is the same thing as dealing with say the tragic experience of a death of a loved one…”\nRobin Lovin, in an interesting discussion: http://www.loc.gov/today/cyberlc/feature_wdesc.php?rec=6330\nBack to the Shroud, i think the Vatican is more flexible than outsiders believe, what is needed are good outsiders.\n\n","date":"October 24, 2014 at 3:03 pm","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","id":"comment-165240","author":"anoxie","site":"shroudstory"},{"title":"Scientific truth is a pathway to God","post":"This is something for systematic theologians.\n\n","date":"October 24, 2014 at 3:06 pm","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","id":"comment-165241","author":"Louis","site":"shroudstory"},{"title":"Scientific truth is a pathway to God","post":"The Shroud or extraterrestrial life?\n\n","date":"October 24, 2014 at 3:23 pm","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","id":"comment-165245","author":"anoxie","site":"shroudstory"},{"title":"Scientific truth is a pathway to God","post":"Not the Shroud because the Church has made no official pronouncement.\n\n","date":"October 24, 2014 at 3:26 pm","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","id":"comment-165247","author":"Louis","site":"shroudstory"},{"title":"Scientific truth is a pathway to God","post":"It was a joke.\n\n","date":"October 24, 2014 at 3:38 pm","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","id":"comment-165250","author":"anoxie","site":"shroudstory"},{"title":"Scientific truth is a pathway to God","post":"… Crop circles would be the clear signs that herald the second coming of Christ … (!?!?!) \n>Another sign would be just Giorgio Bongiovanni who would live in itself a remarkable syncretism being both a contactee experiences of cosmic character / alien is one stigmatized “with mystical experiences.\n>Jaime Maussan, a famous Mexican journalist and researcher, a personal friend of Giorgio Bongiovanni, wanted him to Mexico.\n>During an interview with Giorgio Bongiovanni explained his great interest in the crop circles. His spiritual experience started young age has always been related with UFOs, and then continue with the mystical phenomenon of Marian apparitions and messages of Jesus Christ (!!! ???!) ….\n>For the first time Giorgio was able to walk in the middle of a crop circle in the interview and expressed his excitement for the cosmic significance and the inherent spiritual message.\n… …\n>The researcher interviewed by Pier Giorgio Caria Jaime played Giorgio’s visit to England with his sacred stigmata as something very important; in his opinion from the moment something could change about the manifestation of the same phenomenon of crop circles.\nAt the end of the program the journalist Jaime Maussan talked about his relationship with Giorgio Bongiovanni that dates back more than 20 years ago.\nHe was very impressed to see him in 1993, at the Hotel Gemellaro, located at the foot of Mount Etna (Sicily), when walking along the corridor of the hotel came into the room where George lying in a bed was bleeding from the stigmata …\n(…and this was my rough translation)\nLink:\nhttp://www.giorgiobongiovanni.it/messaggi-2014/5650-segni-chiamano-segni-cronaca-delle-attivita-di-giorgio-bongiovanni-e-jaime-maussan-nei-cerchi-del-grano-in-inghilterra-prima-parte.html\nAt this point it would be really interesting to know the opinion by Consolmagno on “the phenomenon of Giorgio Bongiovanni” …\nSo, what do you think?\nI have read that :\n>While the crop circle phenomenon in England tends to attract its share of fans and curiosity seekers, the addition of a Jesus theme to the already mystical events has added new found meaning.\nAt the moment I think maybe it’s a huge mess …\nand yet there are already a lot of confusions in our poor world full of war …\nDoes the future of intelligence lie with machines, and if so what will they care about?\nHave you read “The Eerie Silence: Are We Alone in the Universe?”, by Paul Davies ?\n\n","date":"October 27, 2014 at 10:59 am","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","id":"comment-165947","author":"piero","site":"shroudstory"},{"title":"Scientific truth is a pathway to God","post":"Nice to hear wonderful words from Yannick. \nOne addition – Breaking the “New Commandment” is the only sin I know. New Commandment is the only one can bring Peace to this World. I can see the New Commandment on the Shroud.\n\n","date":"October 24, 2014 at 5:06 pm","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","id":"comment-165267","author":"Sampath Fernando","site":"shroudstory"},{"title":"Scientific truth is a pathway to God","post":"I agree.\n\n","date":"October 24, 2014 at 2:26 pm","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","id":"comment-165233","author":"Andy","site":"shroudstory"},{"title":"Scientific truth is a pathway to God","post":"…with Br. Guy Consolmagno.\n\n","date":"October 24, 2014 at 2:31 pm","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","id":"comment-165234","author":"Andy","site":"shroudstory"},{"title":"Scientific truth is a pathway to God","post":"It is very unlikely there is any other intelligent life in our galaxy. Proffessor Brian Cox makes that clear in Are We Alone.\nThe Catholic church has been forced to move with the times or die, and many mainstream churches have done the same. Being forced to move is nothing to be proud of and its time they moved towards contraception.\nWe are moral beings in a hostile amoral universe. Our morality o\nis often weak or absent hence the state of the world. That God should create such a crazy situation seems to me and many highly unlikely.\n\n","date":"October 24, 2014 at 3:02 pm","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","id":"comment-165239","author":"magnocrat","site":"shroudstory"},{"title":"Scientific truth is a pathway to God","post":"what the heck are you talking about…..catholics don’t change…man changes….you can “move with the times”…the times are pretty bad….\nwe are not a political party…we are the church established by Jesus….we follow his rules..not what the “times” dictates…fatima clearly proves this\n\n","date":"October 24, 2014 at 6:30 pm","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","id":"comment-165286","author":"rick","site":"shroudstory"},{"title":"Scientific truth is a pathway to God","post":"You are right the times are bad on that we are agreed.\nYou are mistaking the long levity of the Catholic Church with unchangableness.\nProgress changes everything, opinions, beliefs , habits, life- style patterns of thought ect.\nThe Catholic Church once supported the once believed scientific theory the sun went around the earth which was the centre of the universe.\nThis is hardly surprizing it was the upheld belief at that time.\n\n","date":"October 25, 2014 at 2:10 am","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","id":"comment-165356","author":"magnocrat","site":"shroudstory"},{"title":"Scientific truth is a pathway to God","post":"I cannot see any scientific or theological reason why there cannot be other universes outside our own observable universe,  A “multiverse”!  “In my Father’s house there are many dwelling places. If there were not, would I have told you that I am going to prepare a place for you?” John 14:2.  There may be more in Jesus’ words here than implied in the traditional interpretations of it.\n\n","date":"October 24, 2014 at 3:07 pm","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","id":"comment-165242","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Scientific truth is a pathway to God","post":"The question for Dave is:  Why should there be other material worlds outside of this one who is almost infinite in space?  Maybe I didn’t get you right Dave, bu if there is a creator, that makes no sense to me that he would have created other material worlds outside this one…  The dwelling places mentioned by Jesus is a metaphoric way for him (remember that Jews always used metaphor when it comes to talk about God) to tell that, in God’s heart (or in his “kingdom” if you will), which is a spiritual “place” with no space-time, everyone have a place.  \nIn the Old Testament, we got another nice metaphor when the prophet Isaiah make God says this to all of us: “Behold, I have graven thee upon the palms of my hands.”  This is another way to express the same thing: that we’re all saved by his infinite mercy and we have all a place prepared for us “on the other side”, which is truly another universe, but which is spiritual and, therefore, got nothing to do with another material universe that would exist outside this one.\n\n","date":"October 24, 2014 at 3:45 pm","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","id":"comment-165252","author":"Yannick Clément","site":"shroudstory"},{"title":"Scientific truth is a pathway to God","post":"This universe is not infinite in space, and “nearly infinite” is meaningless.  If our universe was infinite the night sky would be a blaze of light, but it’s not, so it’s finite.  It’s about 13.6 billion light years radius. and that’s not infinite nor “nearly so”.  We cannot tell if there are parallel universes or not.  But to quote Douglas Adams, the first thing to know about parallel universes is that they are not really parallel.  \nBefore 1492, the world comprised Eurasia and the unknown African continent;  so that on Yannick’s argument, the Americas didn’t really exist before 1492.  \nI recommend a reading of “Parallel Worlds – A journey through creation, higher dimensions, and the future of the cosmos” – Ch8 “A Designer Universe?”, Michio Kaku, Doubleday, 2005.  Kaku talks a lot about Goldilocks Zones, as an indicator of a designer universe.  \nStephen Hawking when I last read him seemed to think that our universe (including our space) at the “Big Bang” was created by some kind of gravitational aberration.  How many times could that happen? We don’t know! \nSure, the traditional interpretation of John 14:2 refers to a heavenly realm.  I’m merely suggesting that maybe Jesus knew more about the complexity of his Father’s creation than our limited minds might be able to conceive!\n\n","date":"October 25, 2014 at 4:30 am","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","id":"comment-165377","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Scientific truth is a pathway to God","post":"Parallel world will never be something that could be proven anyway unless someone can create a window to see what goes on there, which will probably never happen. So far, it is a purely intellectual concept that doesn’t rely on any facts or tangible observations.\nMy argument is this: Mostly because of the 2 spiritual experience of God I made in my life, I came to understand that our life here in this space-time universe is not a test design by God to evaluate who merit to live forever in his Kingdom and who merit to live forever in hell (which is a false concept that has been completely discredited by Christ during his Passion), but simply a painful growing process (which growing process is not painful?) that will eventually lead to our spiritual birth in God’s spiritual “world”.  I truly believe that our space-time material universe was design by God to do the same job for every single one of his children as the maternal womb is doing for the feotus.  \nSo, if I’m right about God’s plan for everyone of us who live in this material universe, the question would be: Why creating several material universes (with probably different kinds of physical conditions)?  Don’t you think that one big divine maternal womb is not enough to fully realize the “game plan” of God, which is to give eternal birth to every single one of his beloved living creatures?\n\n","date":"October 25, 2014 at 5:33 pm","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","id":"comment-165512","author":"Yannick Clément","site":"shroudstory"},{"title":"Scientific truth is a pathway to God","post":"My final question for Dave should read like this: Don’t you think like me that one big divine maternal womb is well enough for God to fully realize his “game plan” concerning his creation, which is to give eternal birth to every single one of his beloved living creatures?\nNow, that’s better…  Would be nice if Dave dare to answer this!\n\n","date":"October 26, 2014 at 4:38 pm","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","id":"comment-165717","author":"Yannick Cément","site":"shroudstory"},{"title":"Scientific truth is a pathway to God","post":"A bit off-track but worth reading:\nhttp://www.huffingtonpost.com/mick-mooney/how-jesus-the-glutton-and_b_6040778.html\n\n","date":"October 24, 2014 at 4:01 pm","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","id":"comment-165258","author":"Louis","site":"shroudstory"},{"title":"Scientific truth is a pathway to God","post":"Thanks Louis.  I think it means involvement with community.  The Salvation Army and the St Vincent de Paul Society have been doing this for over a hundred years.  The corporal works of mercy come into it.  \nOur great NZ poet James K Baxter set up a commune for waifs and strays at a place called Hiruharama (= Jerusalem) a long way up the Wanganui River which had been a former mission station led by Blessed Mother Mary Aubert (from Lyons). \nIn the foreword of his “Jerusalem Daybook” he tells the story of a certain hermit who bought a large corrugated tank and furnished it with the necessities of life.  There he lived a blameless life without interruption from the world.  But there was one great hardship.  Every morning and evening volleys of bullets would rip through the walls of his tank.  He learned to lie on the floor to avoid being shot, but occasionally sustained wounds;  the walls were pieced by many holes that let in the wind and the daylight and sometimes the rain.  At first he plugged up the holes, but gradually began to use them for a useful purpose.  He began to watch the people passing by, and to see the outside world.  Eventually the tank rusted away and fell to pieces, and he walked out of it with little regret.  There was a man with a gun standing outside.  \n“I suppose you will kill me now” said the hermit, “but I would like to know why have you been persecuting me, why are you my enemy when I have never done you any harm?” \nThe other man laid the gun down and smiled at him.  “I am not your enemy”, he said.  And the hermit saw that there were scars on the other man’s hands and feet, and these scars were shining like the sun.  \nBut Baxter tells the story much better than my brief paraphrase of it.  There’s a great world out there, but we need to be involved with it!\n\n","date":"October 24, 2014 at 7:22 pm","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","id":"comment-165291","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Scientific truth is a pathway to God","post":"The story reminds me Wilde’s The Selfish Giant.\n\n","date":"October 24, 2014 at 8:19 pm","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","id":"comment-165295","author":"David Goulet","site":"shroudstory"},{"title":"Scientific truth is a pathway to God","post":"David, Wilde was a deep thinker. He wrestled with religion throughout his life. Perhaps he said that he was “not a Catholic” but a “violet papist” because he  believed he was cured of food poisoning that could be fatal after a papal blessing by Leo XIII.\n http://www.catholiceducation.org/articles/arts/al0093.html\n\n","date":"October 25, 2014 at 6:25 pm","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","id":"comment-165520","author":"Louis","site":"shroudstory"},{"title":"Scientific truth is a pathway to God","post":"Daveb, that’s right. The article rang a bell in my mind, making me remember Christmas while in school and college when Catholics and Protestants and their respective clergymen got together to pray. More important than that was the Christmas party organised by the Catholic Womens’ League for the poor members of the community, when presents were also distributed.\nThe Salvation Army does a lot of good work in many countries. When I was in London I once went with a friend who had to exchange an oil jacket he had bought there at the Brent Cross Shopping Centre before flying back to NYC. Uniformed members of the Salvation Army were there trying to collect money for the poor and they were having a hard time.\nI agree with you when you say that there’s a great world out there and we need to be involved with it. But it should  begin in the community, which should never become a social club. It has to go much beyond the recitation of the Lord’s Prayer, giving the sign of peace by shaking hands.\n\n","date":"October 25, 2014 at 5:51 pm","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","id":"comment-165516","author":"Louis","site":"shroudstory"},{"title":"Scientific truth is a pathway to God","post":"Louis, the Jeffrey Tucker reference you gave above is one of the most profound articles that I have ever read about Oscar Wilde.  \nOne of the many treasured literary gifts I was given at my 21st birthday, now over five decades ago, was his Collected Works edited by G F Maine.  It was from a fellow student at the Engineering School, a Malay, I think he was a token Moslem.  I still have it.  That same year, another then close acquaintance Vincent O’Sullivan had completed his Master’s thesis on Wilde, and I recall presented a brief summary to us at a Catholic student’s weekend camp.  Vincent is now NZ’s official Poet Laureate, and the author of innumerable works and anthologies, and is the doyen emeritus of the NZ Literary scene. \nI have read most of the works from Aziz’s special gift.  Like many great authors, including our own James K Baxter I mentioned above, and indeed even the likes of Graham Greene, the range of Wilde’s connection with the profane and the spiritual make him and all such writers enigmatic, interesting, contentious, deep and sometimes a mystery, which take us back to them time and again.  \nI have but one doubt in my mind concerning Wilde, and that his weakness at his own self-deception.  That to me raises questions.  But who can plumb a man’s soul but God?  We are all no more than weak flesh striving to do what we think is the best, and perhaps that is the case with Wilde.  His ‘De Profundis’ is a powerful spiritual work.\n\n","date":"October 26, 2014 at 12:32 am","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","id":"comment-165573","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Scientific truth is a pathway to God","post":"David, I had a hardbound copy of Wilde’s complete works many years ago. You have expressed your doubt about him correctly and even offered the solution. The Protestant-born Irish author had something in common with the Jewish-born poet Siegfried Sassoon, who was a descendant of the Baghdadi Jewish Sassoon merchant family from Bombay, India on his father’s side.\nBoth attacked what they found to be the weaknesses of English society. Wilde was influenced by Pius IX, Manning and Newman, Sassoon by Knox and Belloc. The latter is buried just a few feet away from the monsignor at Saint Andrew’s, Mells.\n    http://www.catholicauthors.com/sasoon.html\n\n","date":"October 26, 2014 at 11:15 am","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","id":"comment-165661","author":"Louis","site":"shroudstory"},{"title":"Scientific truth is a pathway to God","post":"Years ago I read the book on Giorgio Bongiovanni written by journalist and\nwriter Paola Giovetti. In that book (1997) Bongiovanni pointed to a particular interpretation of the prophecy of Fatima belied by what was shown in 2000… \nAccording to the idea of Socci (2014) novelty of Fatima would be contained in an official publication of the Carmel of Coimbra, the one where she lived and died (in 2005) Sister Lucia dos Santos, the last seer. It is entitled: “A caminho sob or olhar de Maria” and is a biography of Sister Lucia, written by the sisters, with the valuable unpublished documents of the same seer…\nIf you want to answer you have to try to understand my speech.\nI do not believe the heresies of Bongiovanni (= reincarnation, etc.), but I’m curious about this strange phenomenon. If this is not a fake could be the testimony of a living phenomenon of Paranormality.\nGiorgio Bongiovanni presented an investigative film, the discovery of a hidden symbolic language or meaning, a “Cosmic Code” in the Crop Circle formations which began to appear in a whirlwind of mystery in the early 1990s and continues to this day “with stunning geometric complexity, grandeur and beauty”…\nLink:\nhttps://panoffolin.wordpress.com/tag/paranormal/\nDo you think it is possible that Bongiovanni has really found the “secret language of crop circles”?\n— — —\nHere some words, according to Paul Brosio, journalist and writer:\n“We are on the countdown, there is not much time because the secrets be fulfilled.” \nThe same Brosio also says:\n“… Until now has been revealed just a metaphor and not the prophecy of Fatima.”\nand\nalso :\n“… Before the triumph of the Immaculate Heart of Mary we have to do\npath of Calvary, because you do not get to the Resurrection without going through Friday. You have to go to the Passion, and has already begun. Watch what happens in Africa, China, Iraq, outbreaks where Christians are persecuted. And that’s just the physical persecution …”\nLink (in Italian language):\nhttp://www.intelligonews.it/segreti-brosio-in-esclusiva-siamo-al-conto-alla-rovescia-i-segni-i-100-anni-a-satana-la-madonna-e-papa-francesco/\nFirst you need to be able to discern in order to well understand…\nSo, what do you think of these “complex stories”?\n\n","date":"October 28, 2014 at 9:58 am","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","id":"comment-166196","author":"piero","site":"shroudstory"},{"title":"Scientific truth is a pathway to God","post":"Sometimes you have to play a role unwanted…\nAnd then,\nsee for example:\nJohn Cantlie, a British journalist who is being held captive by Isil inside Syria and has appeared in a sixth propaganda video …\n(British journalist John Cantlie used as ‘Isil reporter’ inside Kobane\nlink:\nhttp://www.telegraph.co.uk/news/worldnews/islamic-state/11191477/British-journalist-John-Cantlie-used-as-Isil-reporter-inside-Kobane.html )\nIn any case :\nHe (John Cantlie, the prisoner!) does admit that the air strikes “which cost half a billion dollars” prevent ISIL using its heavy armour such as tanks.  …\n\n","date":"October 28, 2014 at 10:12 am","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","id":"comment-166198","author":"piero","site":"shroudstory"},{"title":"Scientific truth is a pathway to God","post":"Reblogged this on Best of Shroud Story.\n\n","date":"November 6, 2014 at 3:20 pm","url":"https://shroudstory.com/2014/10/24/scientific-truth-is-a-pathway-to-god/","cat":"off_topic","id":"comment-169330","author":"Dan","site":"shroudstory"}]
