[{"title":"Second Annual Bertrand Russell Award in Sindonology","post":"I like the new Colin Berry better than the old one or is  he spinning around as he orbits the Shroud presenting a different face with each rotation, unlike the Moon which has always hidden one face from the Earth.\n\n","date":"November 22, 2014 at 9:12 am","url":"https://shroudstory.com/2014/11/22/second-annual-bertrand-russell-award-in-sindonology/","cat":"news_&_views","id":"comment-172529","author":"John Klotz","site":"shroudstory"},{"title":"Second Annual Bertrand Russell Award in Sindonology","post":"A good scientist keeps an open mind, does not indulge in scientism, and Colin knows that we have still have mystery in the Shroud.\n\n","date":"November 22, 2014 at 11:08 am","url":"https://shroudstory.com/2014/11/22/second-annual-bertrand-russell-award-in-sindonology/","cat":"news_&_views","id":"comment-172540","author":"Louis","site":"shroudstory"},{"title":"Second Annual Bertrand Russell Award in Sindonology","post":"You might not care for me in my new incarnation either, John Klotz, namely as categorical hard-nosed post October 2014 retired science bod. (But lawyers should be no stranger to hard-nosed positions).\nThis retired science bod is not accustomed  to making categorical statements unless he’s  >99.9% certain of his position, which he now is (see below).\nIn passing. I’m heartened to see that the Dutchman “ArtScience” has come back after a lengthy absence,  following previous exchanges here in early 2012, mainly but not exclusively on the same wavelength, agreeing that the TS body image is a contact scorch, probably derived from a bas relief template.  I like his (her?)  suggestion that use of a pressure-imprinting roller might account for the ruck in the linen across the chin/neck and maybe other locations. That curious “baked-in”  transverse neck crease (my description) has been a focus of interest on my two sites on and off throughout the course of some 250 postings since Dec 2011.. \nCategorical statement? The TS was intended to represent a notional sweat imprint of a traumatized body. But it was almost certainly not executed using wet chemistry, whether as real sweat or sweat-substitute,  but using DRY physics (maybe with chemical assistance) – probably as a some kind of contact scorch.\nNo Charles. The TS is not, and never was a painting. You have a blind spot for history as well as science. You as an art historian do not have a monopoly on the facts. Do not pass GO. Do not collect (more than) £200.  ;-)\n\n","date":"November 22, 2014 at 11:22 am","url":"https://shroudstory.com/2014/11/22/second-annual-bertrand-russell-award-in-sindonology/","cat":"news_&_views","id":"comment-172543","author":"Colin Berry","site":"shroudstory"},{"title":"Second Annual Bertrand Russell Award in Sindonology","post":"hi Colin, yes I sort of gave up around that time over 2 years ago though occasionally drop in to see what new developments were happening. I think it was soon after the Italian scientist did the coin scorch demo and said how difficult it would be to get it uniform, I could see that having a roller contact at a constant speed running up the length of the shroud would enable a sort of uniformity of imprint (note however that the contact pressure varies according to the contact size and smaller areas like head and feet, ankle might then produce a darker image….I know the head is darker but not sure of the others). I couldn’t figure out how all the other details appeared on shroud and being busy normally didn’t give me time to write up properly.\nColin, do you know of any brass rubbing plates that have say the subtlety of modelling for the person of say a coin? Most seem to be binary (raised or depressed levels), and linear (i.e. clearly outlining figure and anatomical details)….these would not be appropriate for giving the subtlety of the shroud.\n\n","date":"November 22, 2014 at 1:27 pm","url":"https://shroudstory.com/2014/11/22/second-annual-bertrand-russell-award-in-sindonology/","cat":"news_&_views","id":"comment-172559","author":"ArtScience","site":"shroudstory"},{"title":"Second Annual Bertrand Russell Award in Sindonology","post":"The key word is “imprint”,  ArtScience, whether too uniform, not sufficiently uniform, too dark, too light, as in a negative imprint made by a heated 3D or bas-relief template.\nSubtlety? It depends what you mean by sublety. Faintness of image? Try lower temperature, lower contact pressure, more damp underlay or overlay.  \nFuzziness? Interpose some kind of inert powder between template and linen, or even white flour to get a tan-coloured Maillard product at temperatures lower than required to scorch linen. \nEthical note to pro-authenticity so-called scientists: desist from making claims in one’s press releases that one has tried for years to produce a TS image with conventional science,  and been unable to do so, when it’s abundantly clear one has not done the experimental ground work. Descriptions (on this site)  of one-off experiments with over-heated coins held too long against linen with no protective underlay give the lie to such assurances.\nYou criticized me in Feb 2012  ArtScience, for bandying  around the term ‘pseudo-science’.  I still bandy around the term ‘pseudo-science’ – and with good reason. It’s my blogging credo – identifying and condemning pseudo-science wherever I find it. Pseudo-science damages the brand, and the reputations of those who devote their careers to pursuing non-agenda-driven science, simply following their nose, going in whichever direction the data point,  putting to one side preconceptions when planning and interpreting experiments. On should always state one’s hypotheses, to avoid any taint of harbouring private preconceptions.\nScience is under attack from all quarters. Shroudology is one of them.\n\n","date":"November 22, 2014 at 2:34 pm","url":"https://shroudstory.com/2014/11/22/second-annual-bertrand-russell-award-in-sindonology/","cat":"news_&_views","id":"comment-172567","author":"Colin Berry","site":"shroudstory"},{"title":"Second Annual Bertrand Russell Award in Sindonology","post":"Hi Colin, I can’t remember exactly the instance but yes sorry if I   came across as defending pseudo-science (which I don’t, though I distinctly remember that you did have an awful way of rubbing people up the wrong way unnecessarily, so perhaps I was pissed off enough as to contradict you …hehe! ) ….but additionally I did feel at the time that the shroud needed more than a dismissive “its just a painting/scorch” which seemed to me to be sloppy science. Follow up data is necessary. You have shown through your persistence that you like myself are not willing to settle at that explanation without some sort of physical/chemical mechanism backing that claim. The scorch imprint theory initially had some problems but I think I have some solutions to them. I’m not sure if my ideas are right but they might explain some of the markings on the shroud. Testing is important of course.\n\n","date":"November 22, 2014 at 3:22 pm","url":"https://shroudstory.com/2014/11/22/second-annual-bertrand-russell-award-in-sindonology/","cat":"news_&_views","id":"comment-172574","author":"ArtScience","site":"shroudstory"},{"title":"Second Annual Bertrand Russell Award in Sindonology","post":"BTW why did you thing I was Dutch? I grew up in South America but educated at same college as the guy in this award named after and it also appear Charles Freeman also.\n\n","date":"November 22, 2014 at 1:38 pm","url":"https://shroudstory.com/2014/11/22/second-annual-bertrand-russell-award-in-sindonology/","cat":"news_&_views","id":"comment-172561","author":"ArtScience","site":"shroudstory"},{"title":"Second Annual Bertrand Russell Award in Sindonology","post":"Sorry ArtScience.  It was your picking up  a while ago on my liking for Dutch band ‘Hocus Pocus’ and maybe confusing you with someone else who also shared my musical taste for frenetic rock and whose name clearly was Dutch   His precise name I can’t be sure of, but initials were JH. Maybe he still follows this site. He was interested in Ray Rogers views re temperature effects on Maillard reactions. Jan Verhulst? Something like that.\n\n","date":"November 22, 2014 at 2:53 pm","url":"https://shroudstory.com/2014/11/22/second-annual-bertrand-russell-award-in-sindonology/","cat":"news_&_views","id":"comment-172572","author":"Colin Berry","site":"shroudstory"},{"title":"Second Annual Bertrand Russell Award in Sindonology","post":"Concerning Bertrand Russell….I’d think he’d be aghast to know that his helpful insights into the Kennedy Assassination has given birth to a worldwide industry of obfuscation and conspiracy theories. There’s a fictional short story by writer Will Self called The Quantity Theory of Insanity, that makes a claim that there’s only some much rationality in the world and if you try and become more rational in one place, elsewhere there is a plague of irrationality. Its fiction but I sometimes think there’s a nugget of truth in it. Industrialized, rational countries seem to be plagued by conspiracy theories, mental problems, ufo sightings (I had one on a beach in Brazil but it turned out to be an controlled explosion in the upper atmosphere).\nI haven’t really followed Colin’s latest of many theories but there is a nice playfulness about them that keeps me amused and perhaps coming in from a different perspective you get a new insight….I don’t believe them but then I also don’t believe in Newton’s biblical ramblings but he was highly rational in a couple other fields.\n\n","date":"November 22, 2014 at 3:25 pm","url":"https://shroudstory.com/2014/11/22/second-annual-bertrand-russell-award-in-sindonology/","cat":"news_&_views","id":"comment-172575","author":"ArtScience","site":"shroudstory"},{"title":"Second Annual Bertrand Russell Award in Sindonology","post":"So you’re willing to entertain the idea, ArtScience, that TS body image was created as an imprint off a heated bas-relief template. It’s surely only a small step to infer that it was intended to be seen as an age-yellowed sweat imprint – there having been a celebrated precedent (the Veil of Veronica) in the 14th century, notwithstanding the latter’s miraculous image-enhancement (nowadays we have digital software to do the same). \nNo, not a conspiracy theory, as the tediously recycled title of this post would have us believe. It was more by way of a devilishly clever confidence trick –  and a brilliantly successful one at that – one which continues to cast its spell to this very day.\n\n","date":"November 22, 2014 at 3:46 pm","url":"https://shroudstory.com/2014/11/22/second-annual-bertrand-russell-award-in-sindonology/","cat":"news_&_views","id":"comment-172576","author":"Colin Berry","site":"shroudstory"},{"title":"Second Annual Bertrand Russell Award in Sindonology","post":"“small step to infer” ….not so sure as you….but certainly worth chasing up the idea.  I don’t know about Veil of Veronica (is this same as The Manoppello Image?), but are you saying that the Shroud was someone trying to do one better i.e. full body image and trying to look like a sweat imprint. Maybe.\nBut then why all the crazy detail invisible to the eye and only appearing on image enhancement?\nI wish we had a list of all the definitely know facts about the shroud (e.g. 3d info, are there whip marks invisible to eye yet appear on image enhancement, the blood serum images real) as oppose to wishful thinking facts (e.g. coin details over the eye that no one else can see).\nSorry Colin, though I admire your attempts to get further with this (and I don’t discourage you from pursuing it), at moment the fake sweat imprint theory is still just a good guess. Do you know if it was early on described as a sweat imprint if that was what the creators of this image had in mind? Earliest mention seems to say it was a painting (though perhaps thats was just a generic term for image on canvas)\n\n","date":"November 22, 2014 at 4:16 pm","url":"https://shroudstory.com/2014/11/22/second-annual-bertrand-russell-award-in-sindonology/","cat":"news_&_views","id":"comment-172580","author":"ArtScience","site":"shroudstory"},{"title":"Second Annual Bertrand Russell Award in Sindonology","post":"Also remember that we have a1449 description of the Shroud as ‘admirably painted’. We also know that the gesso for a painted linen was placed only on the outer fibrils of the cloth and that, north of the Alps, calcium carbonate was used in the gesso mix. We must be grateful to STURP as, although they admit they never examined any painted linens, they did report both the outer image and the calcium carbonate ( in ‘large’  quantities and spread across the cloth). A good start.\nThen you have to explain away features that different artists over 150 years saw on the Shroud that are no longer there, of which the Crown of Thorns is perhaps the most important with the same pattern of thorns clearly shown in different pictures and we have a separate description of it by an observer of the Shroud in the early sixteenth century so it is pretty clear it was once there. This forms the core of my lecture and I can show how similar the pattern of bloodstains on the Shroud are to those of early fourteenth century iconography.\nSo was the Crown put on by some form of scorch?\nA painted cloth, with images decayed, such as is seen in the Zittau Veil linen panels, is the best fit hypothesis. We know that hundreds of thousands of these painted linens once existed (evidence from church inventories) but we don’t know of a single one of Colin’s sweat images which is why he is having to make it up as he goes along ( as he clearly is from one posting to the next) .\nBest fit hypothesis. That is my position.\n\n","date":"November 22, 2014 at 4:55 pm","url":"https://shroudstory.com/2014/11/22/second-annual-bertrand-russell-award-in-sindonology/","cat":"news_&_views","id":"comment-172585","author":"Charles Freeman","site":"shroudstory"},{"title":"Second Annual Bertrand Russell Award in Sindonology","post":"Hi Charles, though Colin’s scorch using a low relief does have the advantage of encoding 3d data into the image. I can’t see how your flaked painting theory can produce this at all unfortunately. As I mentioned previously, going with your shadow theory, there might be a mechanism by which dark pigments produced greater of a shadow than light pigments and so giving a negative image on the linen (which is different to the Zittau Veil – that being a faded positive image from what I can make out) but I can’t see a mechanism to encode 3d information.\n\n","date":"November 23, 2014 at 8:27 am","url":"https://shroudstory.com/2014/11/22/second-annual-bertrand-russell-award-in-sindonology/","cat":"news_&_views","id":"comment-172669","author":"ArtScience","site":"shroudstory"},{"title":"Second Annual Bertrand Russell Award in Sindonology","post":"“Do you know if it was early on described as a sweat imprint if that was what the creators of this image had in mind? ”\nI’m sure I don’t need to remind you ArtScience that there’s scarcely any written record regarding the TS in the mid-14th century, apart from the irate letters from the local  bishop asserting it was “cunningly painted” and a forgery. \nHowever there is a later letter from an impeccable authority (St.Francis de Sales) written to his mother from Annecy in 1614, where it’s quite clear that he viewed the image as being one formed of sweat and blood (no supernatural agency being hinted at).\n“Whilst waiting to see you, my very dear Mother, my soul greets yours with a thousand greetings. May God fill your whole soul with the life and death of His Son Our Lord! At about this time, a year ago, I was in Turin, and, while pointing out the Holy Shroud among such a great crowd of people, a few drops of sweat fell from my face on to this Holy Shroud itself. Whereupon, our heart made this wish: May it please You, Saviour of my life, to mingle my unworthy sweat with Yours, and let my blood, my life, my affections merge with the merits of Your sacred sweat! My very dear Mother, the Prince Cardinal was somewhat annoyed that my sweat dripped onto the Holy Shroud of my Saviour; but it came to my heart to tell him that Our Lord was not so delicate, and that He only shed His sweat and His blood for them to be mingled with ours, in order to give us the price of eternal life. And so, may our sighs be joined with His, so that they may ascend in an odour of sweetness before the Eternal Father.\nBut what am I going to recall? I saw that when my brothers were ill in their childhood, my mother would make them sleep in a shirt of my father’s, saying that the sweat of fathers was salutary for children. Oh, may our heart sleep, on this holy day, in the Shroud of our divine Father, wrapped in His sweat and in His blood; and there may it be, as if at the very death of this divine Saviour, buried in the sepulchre, with a constant resolution to remain always dead to itself until it rises again to eternal glory. We are buried, says the Apostle, with Jesus Christ in death here below, so that we may no more live according to the old life, but according to the new. Amen.\nFrancis, Bishop of Geneva\nThe 4th of May 1614\nThe mere fact that the image is what today we call a”negative” was one that the medievals would quickly have seen as a bodily imprint (NOT a painting).  The mere fact that both frontal and dorsal images were shown head to head must surely have made clear that the image was to be seen as an imprint, and if not in sweat, then what else? Uv excimer laser beam scorches? Radioactive emissions from earthquakes? Corona discharges of ionized air molecules?  Nope. Let’s stick with good old bodily sweat from a traumatized victim of Roman crucifixion, as per Veil of Veronica, especially as there were copious amounts of another bodily fluid there as well (blood). It’s the double-image that is the give-away (and the fact that the TS was immediately branded a “forgery” i.e. evidence that it had  been misrepresented as the real burial shroud, not a mere painting as Charles Freeman would have us believe).\n\n","date":"November 22, 2014 at 5:01 pm","url":"https://shroudstory.com/2014/11/22/second-annual-bertrand-russell-award-in-sindonology/","cat":"news_&_views","id":"comment-172586","author":"Colin Berry","site":"shroudstory"},{"title":"Second Annual Bertrand Russell Award in Sindonology","post":"“there’s scarcely any written record regarding the TS in the mid-14th century, apart from the irate letters from the local bishop asserting it was “cunningly painted” and a forgery”\nI suppose that was my point is that it is first described as a painting say around mid 1300s not as a sweat print as you say the creators intended. Then 250 years later its described as having sweat and blood (not necessarily as you say being formed of sweat and blood), but I can accept that it does look like sweat and blood.\nAre you saying that the phrase “cunningly painted” hints that it is not an ordinary painting involving pigments? Maybe\n\n","date":"November 23, 2014 at 4:24 am","url":"https://shroudstory.com/2014/11/22/second-annual-bertrand-russell-award-in-sindonology/","cat":"news_&_views","id":"comment-172637","author":"ArtScience","site":"shroudstory"},{"title":"Second Annual Bertrand Russell Award in Sindonology","post":"Take your pick: was it a look-alike body imprint that was intended to deceive OR a cunningly-executed ‘painting’ that was made to resemble a body imprint, intended to deceive, or BOTH?\nIt’s simply a matter of semantics, is it not? What’s certain is that forgery, least of all forgery by passive-imprinting, as with counterfeit bank notes, should not be considered to lie within the realms of art.\n\n","date":"November 23, 2014 at 4:30 am","url":"https://shroudstory.com/2014/11/22/second-annual-bertrand-russell-award-in-sindonology/","cat":"news_&_views","id":"comment-172639","author":"Colin Berry","site":"shroudstory"},{"title":"Second Annual Bertrand Russell Award in Sindonology","post":"Russell’s comments about the JFK assassination brings out an important point:  despite thousands of books and articles that suggest that the Oswald-did-it-alone theory is not plausible, there are plenty of people who still buy into it.  In other words, evidence doesn’t play a big factor in their opinion of what happened.  It’s similar with the Shroud–and I realize that pro and con both feel that the other side is the one ignoring the weight of the evidence.\n\n","date":"November 23, 2014 at 10:22 pm","url":"https://shroudstory.com/2014/11/22/second-annual-bertrand-russell-award-in-sindonology/","cat":"news_&_views","id":"comment-172744","author":"Joe Marino","site":"shroudstory"}]
