[{"title":"And so, is the Shroud of Turin another “So What?”","post":"Revelation chapter 3 describes the Church of Laodicea as being materialistic and self-absorbed. Jesus is frustrated because he can’t MOVE them to care about anything. Their prosperity has made them deaf and dumb, unable to have compassion for others and unable to care about their own spiritual development. Jesus begs them to pray for spiritual help for themselves! \nLaodicea is the final church in the list of churches. It seems to describe the current condition of not only the Church but also of society itself. I have become aware of this because I’m trying to help a small orphanage in Haiti, with which I have direct connections. I can’t find anybody to give a darn about these kids. It wasn’t like this when I was growing up; society was much more caring back in the 1960’s in my opinion. I think the changes are very distressing. I’m especially disappointed in my own family who completely ignore my reports of progress on the kids. My experience with trying to help this orphanage makes me more aware of how absolutely COLD people have become. This attitude can be analyzed in many different ways and there are some valid reasons for some of the cynicism, but it doesn’t excuse us in God’s eyes for catering to our own pleasures constantly rather than show a little compassion when the opportunity presents itself. Christians will be judge for their compassion, so if we want to lay up treasures for ourselves in heaven this is what we need to be doing. \nThe “So What” attitude is prevalent in secular AND Christian society and it’s very alarming, in my opinion.\n\n","date":"January 6, 2012 at 12:01 pm","url":"https://shroudstory.com/2012/01/06/and-so-is-the-shroud-of-turin-another-so-what/","cat":"news_&_views","id":"comment-6598","author":"AnnieCee","site":"shroudstory"},{"title":"And so, is the Shroud of Turin another “So What?”","post":"And I disagree with the Right Rev. Mariann Edgar Budde who says these people are honest. I would say they’re selfish.\n\n","date":"January 6, 2012 at 12:05 pm","url":"https://shroudstory.com/2012/01/06/and-so-is-the-shroud-of-turin-another-so-what/","cat":"news_&_views","id":"comment-6600","author":"AnnieCee","site":"shroudstory"},{"title":"And so, is the Shroud of Turin another “So What?”","post":"People are designed to seek and see god. It’s a function of our design, a predisposition. Spirituality is difficult to discuss in the modern forum ideas because materialism, and its high-church sect scientism, control the Grand Inquisition of the realm. Stuff to distract us from beauty and truth, narcotics and alchohol to numb the angst of existance and perverse sexuality to tantalize the flesh and deaden any sense of the sacred have placed a shroud over the soul of western man. We can deny the existance of the sun as long as we refuse to look up, as long as we shuffle through life from one endorphine high to the next. We can deny the Son by doing the same.\n\n","date":"January 6, 2012 at 3:28 pm","url":"https://shroudstory.com/2012/01/06/and-so-is-the-shroud-of-turin-another-so-what/","cat":"news_&_views","id":"comment-6610","author":"royalcanadian2011","site":"shroudstory"},{"title":"And so, is the Shroud of Turin another “So What?”","post":"Well said Royal.\n\n","date":"January 6, 2012 at 7:44 pm","url":"https://shroudstory.com/2012/01/06/and-so-is-the-shroud-of-turin-another-so-what/","cat":"news_&_views","id":"comment-6622","author":"Tim","site":"shroudstory"},{"title":"And so, is the Shroud of Turin another “So What?”","post":"They may be many who wear a BLACK shroud over their soul, happily I met and heard of a few whose black shroud was suddenly taken off (often times in very extraordinary circumstances).\n\n","date":"January 7, 2012 at 9:28 am","url":"https://shroudstory.com/2012/01/06/and-so-is-the-shroud-of-turin-another-so-what/","cat":"news_&_views","id":"comment-6635","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"And so, is the Shroud of Turin another “So What?”","post":"They all went through a spiritual EPIPHANY!\n\n","date":"January 7, 2012 at 9:31 am","url":"https://shroudstory.com/2012/01/06/and-so-is-the-shroud-of-turin-another-so-what/","cat":"news_&_views","id":"comment-6637","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"And so, is the Shroud of Turin another “So What?”","post":"They may be not unlike those who “came out of the[ir life-]graves after Rabbi Yeshua’s raising from the dead in Matthew 27:53. Of course this is just an hypothesis ;-)\n\n","date":"January 7, 2012 at 9:37 am","url":"https://shroudstory.com/2012/01/06/and-so-is-the-shroud-of-turin-another-so-what/","cat":"news_&_views","id":"comment-6638","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"And so, is the Shroud of Turin another “So What?”","post":"Mentioning a black shroud, had Rabbi Yeshua not been seen as innocent of the crimes if was accuded of, he would have been wrapped up in a BLACK SHROUD not a white one. This imply his buriers did think him innocent.\n\n","date":"January 7, 2012 at 9:44 am","url":"https://shroudstory.com/2012/01/06/and-so-is-the-shroud-of-turin-another-so-what/","cat":"news_&_views","id":"comment-6639","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"And so, is the Shroud of Turin another “So What?”","post":"Dan, that is just where the Shroud comes in…\n\n","date":"January 7, 2012 at 9:54 am","url":"https://shroudstory.com/2012/01/06/and-so-is-the-shroud-of-turin-another-so-what/","cat":"news_&_views","id":"comment-6640","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"And so, is the Shroud of Turin another “So What?”","post":"…Innocence.\n\n","date":"January 7, 2012 at 9:57 am","url":"https://shroudstory.com/2012/01/06/and-so-is-the-shroud-of-turin-another-so-what/","cat":"news_&_views","id":"comment-6641","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"And so, is the Shroud of Turin another “So What?”","post":"In nonsense.\n\n","date":"January 7, 2012 at 9:59 am","url":"https://shroudstory.com/2012/01/06/and-so-is-the-shroud-of-turin-another-so-what/","cat":"news_&_views","id":"comment-6642","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"And so, is the Shroud of Turin another “So What?”","post":"I can also give a more serious explanation to Matthew 27:53 to account for saints coming out of their tombs after Rabbi Yeshua’ resurrection.\nIn the Second Temple period, it was rather usual for both possessed and holy men to live an eremetic live in grottoes or DESUSED TOMBS. If we half rule out here the use of a literary device (dramatic emphasis) by Matthew, this is the best solution, in my eyes, we are left with to historically account for this long misunderstood passage.\n\n","date":"January 7, 2012 at 11:12 am","url":"https://shroudstory.com/2012/01/06/and-so-is-the-shroud-of-turin-another-so-what/","cat":"news_&_views","id":"comment-6644","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"And so, is the Shroud of Turin another “So What?”","post":"OMG, I can’t believe it but I’ve had the same thoughts as Max! ;-)\nI don’t know if this came to me more recently or as a child, but it (the passage), always struck me as a ‘dramatic account’, a ‘metaphor’ lets say, and not a literal writing, meaning; People weren’t actually raised from their graves, but came out from their isolation, boldly, to preach the truth. \nR\n\n","date":"January 7, 2012 at 12:29 pm","url":"https://shroudstory.com/2012/01/06/and-so-is-the-shroud-of-turin-another-so-what/","cat":"news_&_views","id":"comment-6647","author":"Ron","site":"shroudstory"},{"title":"And so, is the Shroud of Turin another “So What?”","post":"You understand it perfectly Ron.  By the way, most biblical scholars said that a lot of elements in the story of the miracle birth of Jesus and many elements that are proper to Matthew in the Passion narative (this passage in particular, along with the earthquake, the story of that the tomb was guarded, etc.) came directly from popular legends that were in circulation in his Judeo-Christian community (possibly located in Antioch) and have no real historic bases.  Matthew (who was surely a completely different person than Matthew the apostle) add those elements in his gospel, probably to give some spiritual teachings.  That’s why we always have to be prudent with the historicity of every parts of the bible and not take everything literally.  Many aspects of the gospel have most probably a true historical base, but we always have to remember that those books are not what we call now a “Biography” and were written some 40 or 50 years after the facts and we also have to remember that the writers wanted also to teach a spiritual lesson to their communities…  So, it’s most probable that they add some of their own theological ideas (that could well have been different from Jesus ideas) in their writting.\n\n","date":"January 7, 2012 at 8:06 pm","url":"https://shroudstory.com/2012/01/06/and-so-is-the-shroud-of-turin-another-so-what/","cat":"news_&_views","id":"comment-6654","author":"Yannick Clément","site":"shroudstory"},{"title":"And so, is the Shroud of Turin another “So What?”","post":"Hence , it does not mean at all, holy men literally resurrected then. It means several of them  just showed up in Jerusalem after the event.\n\n","date":"January 7, 2012 at 11:28 am","url":"https://shroudstory.com/2012/01/06/and-so-is-the-shroud-of-turin-another-so-what/","cat":"news_&_views","id":"comment-6645","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"And so, is the Shroud of Turin another “So What?”","post":"Just in case Matthew is not only using “dramatic emphasis” here.\n\n","date":"January 7, 2012 at 11:33 am","url":"https://shroudstory.com/2012/01/06/and-so-is-the-shroud-of-turin-another-so-what/","cat":"news_&_views","id":"comment-6646","author":"Max Patrick Hamon","site":"shroudstory"}]
