[{"title":"Shroud Encounters of the Wikipedia Kind","post":"Not wishing to be provocative (would I ever be such a thing?) I’m coming round to the view that the TS man does not necessarily have a beard and moustache. My wife agreed with me instantly in the case of moustache.\n Expect to see a new posting in due course (it was the Enrie B/W photographs on two recent postings here that implanted the idea).\n\n","date":"June 29, 2014 at 7:09 am","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","id":"comment-134288","author":"Colin Berry","site":"shroudstory"},{"title":"Shroud Encounters of the Wikipedia Kind","post":"We discussed those issues here:\nhttps://shroudstory.com/2014/05/15/even-in-china-they-know-jesus-characteristic-features/\nThe Wikipedia article “Depiction of Jesus” is relatively good, despite several drawbacks.\nColin:\nNot wishing to be provocative (would I ever be such a thing?) I’m coming round to the view that the TS man does not necessarily have a beard and moustache. My wife agreed with me instantly in the case of moustache.\nThe Manoppello Image also has no moustache visible, although it has been proven that it shows exactly the same face as the Shroud. See: \nhttps://shroudstory.com/2014/06/14/imagej-used-to-compare-the-shroud-of-turin-and-the-manoppello-image/\nand \nhttps://shroudstory.com/2014/06/18/the-manoppello-this-little-cloth-cannot-be-further-ignored-in-shroud-research/\n\n","date":"June 29, 2014 at 8:47 am","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","id":"comment-134299","author":"O.K.","site":"shroudstory"},{"title":"Shroud Encounters of the Wikipedia Kind","post":"Well OK, that’s one congruence (of sorts) . Five more to go and I should be home and dry, at least in the eyes of one image-comparison expert!\n\n","date":"June 29, 2014 at 8:55 am","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","id":"comment-134303","author":"Colin Berry","site":"shroudstory"},{"title":"Shroud Encounters of the Wikipedia Kind","post":"If you study my second article, I list there twelve. And I suppose there are more!\n\n","date":"June 29, 2014 at 9:03 am","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","id":"comment-134304","author":"O.K.","site":"shroudstory"},{"title":"Shroud Encounters of the Wikipedia Kind","post":"‘The conventional image of a fully bearded Jesus with long hair did not become established until the 6th century in Eastern Christianity, and much later in the West.’\nNo, it was the other way round.The text of  Paul Zanker’s The Mask of Socrates can be accessed online with illustrations and he takes the first examples appearing in the west about AD 300. An excellent example of an early western example is the Christ in the Church of San Pudenziana in Rome of c. 390-420. I don’t think we have any eastern examples ( though i am open to others being provided) until 150 years after that. Zanker ties it in with the adoption of Christ as ‘the true philosopher’. If you look at Google Images for Plutarch (the philosopher  died AD 120) at Delphi you will see the template.\n\n","date":"June 29, 2014 at 9:30 am","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","id":"comment-134307","author":"Charles Freeman","site":"shroudstory"},{"title":"Shroud Encounters of the Wikipedia Kind","post":"Actually you can just put in ‘Greek philosophers’ into Google images to get the range of haircuts, beards and moustaches.  Many of these statues are Roman copies but I am not sure, without rereading Zanker, why it was in the west rather than the east that Christ was first adopted in the guise as a ‘Greek philosopher’. We certainly find him being described  by Clement of Alexandria, early third century, as the true philosopher who had transcended pagan philosophy. No real need to look further for the origin of the bearded Christ but read Zanker is you are still not convinced.\nI am not going to get myself bogged down in an endless argument that that bearded Christ came into art from the Shroud in the sixth century. The earlier examples are too obvious for there to be any serious debate on this.\n\n","date":"June 29, 2014 at 9:48 am","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","id":"comment-134311","author":"Charles Freeman","site":"shroudstory"},{"title":"Shroud Encounters of the Wikipedia Kind","post":"The Jesus of history was a “hasid” in many ways and would not be clean-shaven like the Romans.\n\n","date":"June 29, 2014 at 9:25 am","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","id":"comment-134306","author":"Louis","site":"shroudstory"},{"title":"Shroud Encounters of the Wikipedia Kind","post":"Even a simple historian, let alone biblical scholars, will know what Jesus would have looked like just reading the New Testament and understanding the Jewish background and would laugh out of court anyone trying to prove what Jesus looked like through relics, Google images and what not.\n\n","date":"June 29, 2014 at 9:39 am","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","id":"comment-134309","author":"Louis","site":"shroudstory"},{"title":"Shroud Encounters of the Wikipedia Kind","post":"After many years of writing on Biblical Studies and Biblical Archaeology, and several occasions to interview the world’s top Biblical scholars the picture of Jesus that emerged was the one of a rabbi, and “healer and exorcist”, as the late Professor Geza Vermes, of Oxford, called him. Professor Vermes was one of those interviewed and he was convinced that Jesus was a “hasid” and I would add that that was one of the reasons why he avoided Sepphoris, very close to the places where he preached. The reason was that it was a city under heavy Greek influence, with many Hellenized Jews in the region.\nI think Ian Wilson understood this clearly when he wrote about a “very Jewish Jew” called Jesus.\n\n","date":"June 29, 2014 at 10:09 am","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","id":"comment-134314","author":"Louis","site":"shroudstory"},{"title":"Shroud Encounters of the Wikipedia Kind","post":"Readers; Please make a note of the timings of the above comments. Jesus said ….\n\n","date":"June 29, 2014 at 10:23 am","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","id":"comment-134316","author":"Louis","site":"shroudstory"},{"title":"Shroud Encounters of the Wikipedia Kind","post":"Good morning, Dan!\nI would consult Wikipedia and read what is posted there with a grain of salt, particularly when it comes to those “citation needed”, which is generally rubbish.\n\n","date":"June 29, 2014 at 10:44 am","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","id":"comment-134321","author":"Louis","site":"shroudstory"},{"title":"Shroud Encounters of the Wikipedia Kind","post":"Jewish rabbis have long hair and beards, unless liberal, bald or female.  See posting here of some six weeks ago, May 15:\nhttps://shroudstory.com/2014/05/15/how-can-you-argue-with-this-2/\n\n","date":"June 29, 2014 at 4:39 pm","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","id":"comment-134354","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Shroud Encounters of the Wikipedia Kind","post":"Yeah… Nevertheless, this face on Manoppello with a moustache shaven is a mystery, isn’t it?\n\n","date":"June 29, 2014 at 4:45 pm","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","id":"comment-134356","author":"O.K.","site":"shroudstory"},{"title":"Shroud Encounters of the Wikipedia Kind","post":"The intention is to try and keep the blog free from ad hominem attacks, silly jokes, more rationality and less emotion. It is strange that the ones who are making the most noise are the same ones who keep silent when challenged with a checkmate. They are also the same ones who are defend Christianity but show little in practice.\nThis is getting us closer to Freud, not to Jesus.\nThe discussion is about what first-century Jewish men would look like, particularly (free-lance) rabbis like Jesus.\n\n","date":"June 29, 2014 at 4:58 pm","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","id":"comment-134358","author":"Louis","site":"shroudstory"},{"title":"Shroud Encounters of the Wikipedia Kind","post":"I don’t know what exactly you have on mind Louis.\n\n","date":"June 29, 2014 at 5:00 pm","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","id":"comment-134360","author":"O.K.","site":"shroudstory"},{"title":"Shroud Encounters of the Wikipedia Kind","post":"I think you know, OK. Have a look at what has been posted during the last few weeks. I have no time to copy ,paste, bring the comments together, that is spoonfeeding. The realm of Shroud studies is a minefield and the blog is part of it, but there are limits.\n\n","date":"June 29, 2014 at 5:11 pm","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","id":"comment-134361","author":"Louis","site":"shroudstory"},{"title":"Shroud Encounters of the Wikipedia Kind","post":"My sympathy is with O.K.  He felt passionate about the topic, approached it with proper sincerity, there were others that agreed with his point of view. I can appreciate his sense of frustration with those with a different perspective who disagreed with him, I felt so myself.  He may at times have tested the boundaries, I think he seldom overstepped the mark.\n“The intention is to try and keep the blog free from ad hominem attacks, silly jokes, more rationality and less emotion.”  I have not read that so explicitly in terms of conditions of use, and it would make for a very boring interchange.  It’s over to the moderator to blow the whistle when he sees fit.  \nI have come to a decision to be less forthcoming with my pearls in future.  I don’t like seeing them trampled in the mire.\n\n","date":"June 29, 2014 at 10:20 pm","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","id":"comment-134379","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Shroud Encounters of the Wikipedia Kind","post":"Louis, DaveB. Easy, guys! Debating with several chaps who play unfair (because they cannot otherwise) may indeed be frustrating at times, but I still control the situation. They cannot refute my arguments, so they want to force me to insults, to declare their victory. But they won’t succeed.\nMy goal is not to convince them that HPM was based on the Shroud -I know that convincing fanatics is impossible. No. The purpose is to show everyone they are wrong and dishonest. So either they admit that HPM was based on the Shroud, or they turn out to be complete morons. Let they fear.\n\n","date":"June 30, 2014 at 9:11 am","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","id":"comment-134475","author":"O.K.","site":"shroudstory"},{"title":"Shroud Encounters of the Wikipedia Kind","post":"‘My goal is not to convince them that HPM was based on the Shroud -I know that convincing fanatics is impossible. No. The purpose is to show everyone they are wrong and dishonest. So either they admit that HPM was based on the Shroud, or they turn out to be complete morons. Let they fear.’\nWell, at least we know what O.K.s purpose is now, so clearly expressed in his own words. Quite how those who fail to see the Shroud in the Pray Codex are therefore dishonest and what they should be fearful of, God only knows!\n\n","date":"June 30, 2014 at 5:14 pm","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","id":"comment-134545","author":"Charles Freeman","site":"shroudstory"},{"title":"Shroud Encounters of the Wikipedia Kind","post":"O.K. You are doing a good job,but, you know something? Write a pdf paper where all your arguments can be stated, refuting what your opponents say, and post it. It will save you a lot of time and energy.\nAs for the rest, I was referring to comments on this thread that had nothing to say, serving purposely, to detract from the main discussion. They show deceit, envy, attempts to flatter the moderator for obvious reasons, what Max called “blind spots” a long time ago.\n\n","date":"June 30, 2014 at 12:54 pm","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","id":"comment-134510","author":"Louis","site":"shroudstory"},{"title":"Shroud Encounters of the Wikipedia Kind","post":"O.K. You are doing a good job,but, you know something? Write a pdf paper where all your arguments can be stated, refuting what your opponents say, and post it. It will save you a lot of time and energy.\nLouis, it is not that. Everything what is needed to prove HPM-Shroud connection is in hat article, every word of it remains valid. No need to add anything new.\nThe purpose for which I sacrifice my time and energy is to show everyone that the sceptics have actually nothing to say. They cannot undermine the evidence of the Hungarian Pray Manuscript. Every their attempt has shown to be futile. Thus giving us in practical certainty to the existence of the Shroud before 1200 -that is before the 4th crusade, and Robert de Clari’s relation about the presence of the shroud with a figure of Christ in Constantinople.\nSo now in every discussion with every sceptic maintaning that the Shroud didn’t exist before 1260-1390, one can refer to that thread about about HPM, and say we have undeniable evidence, the HPM. No sceptic has been able to undermine it. And no will.\n\n","date":"June 30, 2014 at 1:18 pm","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","id":"comment-134514","author":"O.K.","site":"shroudstory"},{"title":"Shroud Encounters of the Wikipedia Kind","post":"Fully agreed, OK. Robert de Clari’s assertion is hard evidence and hopefully there should be more, like the Pray Manuscript, as time goes by. As you may have read in my interview with with Fr. H. Pfeiffer, the Vatican does not make relics available for research. This is one big impediment, as Ian Wilson noted in his book on the topic.\nI am waiting for some material to arrive to write an article on the mediaeval period, much depending on what can be judged as evidence for the existence of the relic much before it came into the hands of Geoffrey de Charny.\n\n","date":"June 30, 2014 at 2:28 pm","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","id":"comment-134526","author":"Louis","site":"shroudstory"},{"title":"Shroud Encounters of the Wikipedia Kind","post":"Two days ago I was ignorant, irrelevant, uncomprehending, illogical, obsessive, absurd, desperate and poisonous, and today I’m dishonest, deceitful, envious, fearful, fanatical and a complete moron. Have I accused OK or Louis of being any of these things? I just think they’re wrong, that’s all. I have explained why I think so, and have given many relevant references. I don’t mind if they disagree with me, but I’m disappointed that they have nothing to counter me with than abuse. Is that all? I think the rectangular slab is a slab. Why? With reference to dozens of similar paintings and carvings. That’s why. You think the rectangular slab is the Shroud. Why? Because it has a pattern on it that you think derives from the Shroud weave, and four circles in an L-shape like those on the Shroud. That’s fine. Let’s just disagree pending more evidence. I seriously think that calling me, Charles and maybe Colin, in the space of a few days, ignorant, irrelevant, uncomprehending, illogical, obsessive, absurd, desperate, poisonous, dishonest, deceitful, envious, fearful, fanatical, sychophantic and a complete moron weakens your case. Don’t you?\n\n","date":"June 30, 2014 at 6:08 pm","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","id":"comment-134553","author":"Hugh Farey","site":"shroudstory"},{"title":"Shroud Encounters of the Wikipedia Kind","post":"On my part, I can say that there is misunderstanding here. The discussion was going in the right direction and was serious till 10.44 AM when the next comment, at 4.39 PM, brought nothing new and serious but what could be interpreted as a silly joke. My advice to this commenter is the following: if you do not understand the topic and cannot contribute anything serious and useful to the discussion, leave the jokes aside and let those who have written on this for years (see my comment of 10.09 AM) say what they have to say and invite those who have something useful to contribute to comment.\nHas anyone noticed that my rejoinder has been met with silence? That is another tactic adopted by this commenter, quietly waiting for the dust to settle to start all over again, but on a different thread. He has been called a “hypocrite” by Max and one who is not aware of “blind spots”. It is indeed a blind spot to think that no one is noticing the flattery and deceit.\nThat is why I said this was getting us closer to Freud, not to Jesus..\nIn no comment did I make any personal attack against Hugh or the other commenters cited. My contention was on the level of serious discussion. I simply could not see why we have to appeal to Google images and what not (9.39 AM) to discover what the Jesus of history, a first-century, hasid-like Jew would have looked like. I say it again: we have the New Testament and the Semitic —  not Roman —  background of this book.\nI regret having to post such comments, but there has been no choice. There are envious people, who think no one can know more than them, and who do not want to learn from mistakes, preferring to resort to deceit.\n\n","date":"June 30, 2014 at 7:04 pm","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","id":"comment-134557","author":"Louis","site":"shroudstory"},{"title":"Shroud Encounters of the Wikipedia Kind","post":"My comment at 4:39pm was definitely not intended as some kind of silly joke, and I deeply resent it being treated as such!  I was deadly serious!  It is frequently argued that Jesus was beardless and short-haired by a certain well-known extremist Protestant sect, who often quote a verse from I Corinthians to support this strange view.  The lie to it is easily refuted simply by surveying the general hirsuteness of Jewish rabbis in general.  This is quite easily done on Google images, which displays a random selection of Jewish rabbis, but which may also happen to include liberal, bald, or female rabbis, as well as the more conventional orthodox male rabbis who may still retain some of their locks.  There are pages and pages of them all showing that the common convention among rabbis is the wearing of beards and long hair, among those who still manage to retain it.  If some can see some humour in it, that is not my concern, but the question of hair length and beards  is the principle topic of this particular posting!  I fail to see what kind of silly joke I am accused of perpetrating!\n\n","date":"July 1, 2014 at 8:24 am","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","id":"comment-134667","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Shroud Encounters of the Wikipedia Kind","post":"What is revealed here is that knowledge of biblical archaeology and biblical studies is next to nothing, therefore the appeal to Google images. The reference to liberal, bald or female rabbis thus becomes a silly joke, more so because the discussion is about first-century Jews.\nI lived in a mainly Orthodox Jewish district when in London and an acquaintance who belonged to this community was a nice clean-shaven Jew. He jokingly told me one morning when we were having coffee together that their community was considered to be liberal. Many Orthodox Jews were clean-shaven in the nineteenth century, so Google images are irrelevant.\nI am also aware that there are Shroudies who believe that the Resurrection is metaphor, although they pretend it is not so, so that they can write for parish bulletins and upload the pdf on a Shroud website. They have also defended Jacobovici, the “Jesus family tomb”, Bart Ehrman and the rest. This is deceitful behaviour.\n\n","date":"July 1, 2014 at 9:50 am","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","id":"comment-134688","author":"Louis","site":"shroudstory"},{"title":"Shroud Encounters of the Wikipedia Kind","post":"Further to the above:\nFirst quote\n“it would make for a very boring interchange.”\nSecond quote:\n“I was deadly serious!”\nThird quote:\n” I have come to a decision to be less forthcoming with my pearls in future. I don’t like seeing them trampled in the mire.”\nNote the contradictions in the first two quotes. As for the third one, one must ask, Are those pearls natural or artificial?\n\n","date":"July 1, 2014 at 10:36 am","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","id":"comment-134690","author":"Louis","site":"shroudstory"},{"title":"Shroud Encounters of the Wikipedia Kind","post":"Louis, perhaps you should take a break from posting for a while, you are starting to make a fool of yourself with these petty attacks. You have better insights to offer than that.\n\n","date":"July 1, 2014 at 11:08 am","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","id":"comment-134694","author":"David Goulet","site":"shroudstory"},{"title":"Shroud Encounters of the Wikipedia Kind","post":"David, so you think I posted rubbish? In my view, I was taking the discussion in the right direction —- which you can see in the previous comments — till someone came along and posted irrelevant material. Tell me, what have we learnt from Google images here?\n\n","date":"July 1, 2014 at 12:19 pm","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","id":"comment-134705","author":"Louis","site":"shroudstory"},{"title":"Shroud Encounters of the Wikipedia Kind","post":"I’ve pulled some comments. I couldn’t see the point in them.\n\n","date":"July 2, 2014 at 2:36 am","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","id":"comment-134817","author":"Dan","site":"shroudstory"},{"title":"Shroud Encounters of the Wikipedia Kind","post":"It is good that you used your red pencil, Dan. All the commenters here, whether pro- or anti-authenticity, good in the fields of images, history and science, have been laying their cards squarely on the table, with nothing to hide under the sleeve. This has brought fruitful discussion.\n\n","date":"July 2, 2014 at 8:25 am","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","id":"comment-134858","author":"Louis","site":"shroudstory"},{"title":"Shroud Encounters of the Wikipedia Kind","post":"Hi Dan, I knew you would delete more comments after I posted the last one above. I have it stored for use, if necessary.\n\n","date":"July 3, 2014 at 9:11 am","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","id":"comment-135088","author":"Louis","site":"shroudstory"},{"title":"Shroud Encounters of the Wikipedia Kind","post":"It is probable that Jesus followed the style and trims that were typical of the Jewish men of the time. Judas had to identify him in Gethsemane and he could slip away easily when needed during his ministry.\n\n","date":"July 3, 2014 at 9:31 am","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","id":"comment-135095","author":"Louis","site":"shroudstory"},{"title":"Shroud Encounters of the Wikipedia Kind","post":"Good point. Had Jesus been clean shaven he would have stood out for that alone, given the milieu. For the Gospel depictions of him, especially during his final days, I picture a man more akin to John the Baptist in appearance. He certainly didn’t go the cross clean shaven — beard torn by an angry mob perhaps — but not barbershop fresh that’s for sure.\n\n","date":"July 3, 2014 at 9:42 am","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","id":"comment-135096","author":"David Goulet","site":"shroudstory"},{"title":"Shroud Encounters of the Wikipedia Kind","post":"That’s right,David. He would be more akin to John the Baptist in appearance, although he ate and drank better than the voice crying in the wilderness.\nBeyond the controversy surrounding the depictions of Jesus we are discussing, I found three differences between scholars when it came to some things Jesus was aware of. Professor Geza Vermes (cited in comment above said one thing, Yigael Yadin said the exact opposite and Father Joseph A. Fitzmyer said something in between, being a more careful scholar. That perhaps made the American Jesuit even more well-known as one of the world’s leading NT scholars, also known as the “scholar’s scholar” in the US.\n\n","date":"July 3, 2014 at 10:06 am","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","id":"comment-135099","author":"Louis","site":"shroudstory"},{"title":"Shroud Encounters of the Wikipedia Kind","post":"I have reflected more on the photos with Colin’s observation in mind: is there really a moustache and beard on the man in the Shroud or could it be impactogram affect? It is a great question.\nIf this is the face of Jesus then we are talking about a man whose face has taken a beating. It is a death mask. What kind of swelling might have occurred around his chin and mouth area? Did he fall on his face while carrying the cross? How badly was he struck on the face by guards or the mob? Was his facial hair torn out by zealous Jewish guards or clerics and what does such violence do to the area where the hair is pulled out?\nHow much blood, saliva, and dirt encrusted into his facial hair? How much might have been wiped away by the mourners? Was his face and facial hair anointed with oil and other products affecting image formation?\nIf this is Jesus then impact does play a great part in that facial image, but it is the impact not of a funeral shroud that weighs heaviest but the impact of human violence — and hopefully thereafter, human love.\n\n","date":"July 3, 2014 at 10:35 am","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","id":"comment-135102","author":"David Goulet","site":"shroudstory"},{"title":"Shroud Encounters of the Wikipedia Kind","post":"Great comments, with the right questions asked. I think that had anyone faked the Shroud then then the person depicted would not have been clean-shaven, and a hasid-like Jesus would have a full-grown beard.\n\n","date":"July 3, 2014 at 10:41 am","url":"https://shroudstory.com/2014/06/29/shroud-encounters-of-the-wikipedia-kind/","cat":"wikipedia_content","id":"comment-135104","author":"Louis","site":"shroudstory"}]
