[{"title":"Shroud of Turin presentation coming to Fayette’s Summit Church Near Atlanta","post":"Archeologist Shimon Gibson with his colleagues found the tomb discovery in Jerusalem 2009. The discovery exposed remains of the man who had suffered leprosy and died tuberculosis. The researches records that deceased have lived in 1-50 A.D. (in the time of Jesus) and the tomb was obviously the family tomb of upper class or priest family.\nGibson said that the man had been buried according to manners of the Jews at that time. The manner was that the body wrapped to linen clothes, and the head wrapped with separate face linen. Gibson said that if the person wasn’t actually dead and woke up, he could shake and blow off the face linen and shout for help.\nProfessor Shimon Gibson said that the shroud of Turin doesn’t fit together for burial practices in first century Palestine. Gibson said that the shroud of Turin is a single sheet made with a twill weave. According to Gibson the twill weave was known only from the medieval period.\nShimon Gibson’s archeological evidence is accord with the testimony of the Bible.  According to the Bible Lazarus and Jesus had been wrapped with linen clothes and the head with the separate napkin.\nJohn 11: And he that was dead came forth, bound hand and foot with graveclothes: and his face was bound about with a napkin. Jesus saith unto them, Loose him, and let him go.\nJohn 19:40 Then took they the body of Jesus, and wound it in linen clothes with the spices, as the manner of the Jews is to bury.\nJohn 20:\n6 Then cometh Simon Peter following him, and went into the sepulchre, and seeth the linen clothes lie,\n7 And the napkin, that was about his head, not lying with the linen clothes, but wrapped together in a place by itself.\nThe Bible gives the testimony that the bodies, hands and feet of Lord Jesus and Lazarus wrapped linen clothes and with the separate napkin. In the case of Lazarus Greek text use from the word graveclothes word keiria, which is in plural. This means that Lazarus’ body, hands and feet had been wrapped with several linen clothes. In the case of Lazarus the napkin is in Greek text soudaria and in a singular form. According to John 11:44 Lazarus’ head wrapped with the separate napkin (face linen) as his body, hands and feet. Shimon Gibson’s archeological discovery’s man had been wrapped the exactly same way as the Bible describes wrapping of Lazarus.\nJohn 19:40 the napkin word is in Greek text othonion, which is in this verse plural. John 20:6 the linen clothes is in Greek text othonion and in plural form. John 20:7 the napkin is in Greek soudarion and in a singular form. The discovery of Shimon Gibson with his colleagues is accord with the testimony of the Bible, because Jesus’ body, hands and feet had been wrapped with several linen clothes and in His head had been separate face linen (the napkin).\nAccording to the theory of the shroud of Turin Jesus’ had been wrapped on a large linen (shroud). According to the testimony of the Bible, the shroud of Turin is the deception and the fake.\nmore info: http://koti.phnet.fi/petripaavola/shroudofturin.html\n\n","date":"February 4, 2011 at 3:13 am","url":"https://shroudstory.com/2011/01/18/shroud-of-turin-presentation-coming-to-fayettes-summit-church-near-atlanta/","cat":"news_&_views","id":"comment-2390","author":"Pekka","site":"shroudstory"},{"title":"Shroud of Turin presentation coming to Fayette’s Summit Church Near Atlanta","post":"Pekka, you have posted this nonsense all over the net and in several forums, and I can understand how most christians, if they read your post and the article would think that your actually telling the truth, but this nonsense has been disproven many times, and now I will disprove this info here.\nhttp://www.acheiropoietos.info/proceedings/FulbrightAkeldamaWeb.pdf\nThere are many other examples but i couldnt copy and paste from the pdf file.\nThis provides the truth on the evidence of your false accusations my friend. This article  totally destroys your claims on all grounds.\nThe fact that your even posting info from Gibson shows me that you have done little to no research on the shroud or this particular area at all.\nThe claim by Gibson that akadelma tombs site in jerusalem disprove the authenticity of the shroud is completely refuted on the basis of ancient textile evidence from the judean desert and elsewhere.\nPietro Savio published a cloth woven in a herringbone pattern dated to 130C.E. Discovered in the excavations of the necropolis at Antinoe. Plus there pre-dynasty burials described by Petrie and Mackay involving large textiles with the characteristic selvedge fringe. In one example a long cloth lay below the body and was folded over it in the same manner as the shroud of turin.\nTwill-weave textiles of shroud fragments and nearly intact shrouds have been found at various excavation sites in the judean desert and all around in egypt to europe from even before the era of Jesus that have shown this type of weave.\n\n","date":"August 28, 2011 at 4:06 pm","url":"https://shroudstory.com/2011/01/18/shroud-of-turin-presentation-coming-to-fayettes-summit-church-near-atlanta/","cat":"news_&_views","id":"comment-3713","author":"bob smith","site":"shroudstory"}]
