[{"title":"Shroud of Turin Quote for Today by Sharon Hill","post":"“but that is no reason to resort to supernatural explanations.”\nOhhh… why not? Loosen up a little. “And so because those dewy-eyed dopes keep building up impossible hopes, IMPOSSIBLE!! Things are happening every day!” \nThat song quote is from Rogers & Hammerstein’s Cinderella and yes, it’s a fairytale, but I like it because it accurately describes the phenomenon of Faith. Supernatural things happened all the time around Jesus Christ. It’s more LIKELY that the Shroud has a supernatural explanation, than not. \nJesus could not do many miracles in Galilee because the people had little faith. Lack of faith is disappointing to Jesus and to God the Father. The more faith, the more likely that prayers will be answered and supernatural things might happen. Supernatural or Divine assistance is far more common than people realize. \nSo… I think the scoffers and the skeptics and the doubters can continue to drive themselves crazy looking for a “natural” explanation, but considering that the Shroud of Christ (if it’s real) was and is directly connected to the supernatural event known as the Resurrection, I highly doubt there will EVER be a natural explanation for that Shroud. \nAssuming it’s real, which I think it probably is because of the way the Shroud has got so many people all annoyed and irritated with it. :D\n\n","date":"December 21, 2011 at 5:17 am","url":"https://shroudstory.com/2011/12/21/shroud-of-turin-quote-for-today-by-sharon-hill/","cat":"news_&_views","id":"comment-5815","author":"AnnieCee","site":"shroudstory"},{"title":"Shroud of Turin Quote for Today by Sharon Hill","post":"Watch what you say about people looking for a “Natural explanation”, you might get Yannick all riled up.\n;-)\n\n","date":"December 22, 2011 at 10:30 pm","url":"https://shroudstory.com/2011/12/21/shroud-of-turin-quote-for-today-by-sharon-hill/","cat":"news_&_views","id":"comment-5992","author":"Ron","site":"shroudstory"}]
