[{"title":"And the problem is a four-pedal loom?","post":"Quote from Fulbright paper:\n“Another important example is the girdle (or sash) of\nRameses III, who reigned during the middle of the twelfth\ncentury B.C.E. It is characterized by an intricate design\nand excellent workmanship. It is woven in five colors, in\na design consisting of 3:1 herringbone twill, alternating\nwith 4:1 and 5:1 herringbone twills. This sash is 17 feet in\nlength and tapers in width from 5 inches down to a little\nless than 2 inches [28].”\nReference[28]:”A. Braulik,Altägyptische Gewebe, A. Bergstrasser,\nStuttgart, p. 8 with fig.2 (1900). Braulik describes\nseveral other examples of ancient Egyptian textiles woven\nin various herringbone patterns. This girdle is also\ndescribed in T. D. Lee, “The Linen Girdle of Rameses\nIII,” inAnnals of Archaeology and Anthropology\nof the Liverpool Institute of Archaeology, Vol. V, pp. 84-96\n(1912). More readily accessible is Fr. E. Wuenschel’s\ndiscussion of several very ancient herringbone twills in\n“The Truth About the Holy Shroud,”American\nEcclesiastical Review, pp. 10 f., (1953), heavily dependent\non Braulik. Tyrer,op. cit., p. 21, describes the Rameses\ngirdle as “a plain lift weave,” unlike descriptions by\nBraulik, Lee and Wuenschel. Possibly the alternating\nherringbone weaves comprised a decorative edging.”\n\n","date":"July 27, 2013 at 7:26 am","url":"https://shroudstory.com/2013/07/27/and-the-problem-is-a-four-pedal-loom/","cat":"news_&_views","id":"comment-39844","author":"O.K.","site":"shroudstory"},{"title":"And the problem is a four-pedal loom?","post":"Quote: “Some experts had said the Shroud fabric is not possible in the Palestine of the 1rst Century for different reasons.”\nComment:  And who said the Shroud must have been weaved in Palestine?  It could well have been made in Egypt or Syria or in some other places during the first Century A.D. where some historical évidences exist concerning the manufacturing of large cloths like the Shroud…  If that’s the case, then we must assume that the Shroud was eventually sold to a Jew in Palestine after it had been woven elsewhere.  I don’t see any historical or geographical problem with such a scenario.\n\n","date":"July 27, 2013 at 4:56 pm","url":"https://shroudstory.com/2013/07/27/and-the-problem-is-a-four-pedal-loom/","cat":"news_&_views","id":"comment-39870","author":"Yannick Clément","site":"shroudstory"},{"title":"And the problem is a four-pedal loom?","post":"It would seem unlikely that the Shroud was woven in Egypt. All their known yarns of ancient fabrics are generally ‘S’ twist. The Shroud yarn is ‘Z’ twist. However, very large cloths with intricate deigns were far more common during ancient times up to say 300 AD, than occurred during the Dark Ages in Europe, or even during the Middle Ages. In probabilistic terms, it seems far more likely that such a large cloth as the T.S. would have been woven in the 1st century Middle East, than anywhere else during medieval times. Even the renown medieval tapestries were woven on smaller looms, than were prevalent in ancient times.\n\n","date":"July 28, 2013 at 12:03 am","url":"https://shroudstory.com/2013/07/27/and-the-problem-is-a-four-pedal-loom/","cat":"news_&_views","id":"comment-39899","author":"daveb of wellington nz","site":"shroudstory"},{"title":"And the problem is a four-pedal loom?","post":"It is more probable the Shroud was woven in Syria, but does not eliminate the possibility of it being woven in Judea by Syrian artisan’s. All evidence points to the Shroud being fabricated in antiquity, …not later.\nR\n\n","date":"July 28, 2013 at 2:37 pm","url":"https://shroudstory.com/2013/07/27/and-the-problem-is-a-four-pedal-loom/","cat":"news_&_views","id":"comment-39970","author":"Ron","site":"shroudstory"},{"title":"And the problem is a four-pedal loom?","post":"\nRon :\nIt is more probable the Shroud was woven in Syria, but does not eliminate the possibility of it being woven in Judea by Syrian artisan’s. .\nR\n\nIf the Shroud was made with a loom of four pedals in Middle East and Nort Africa it can’t be previous to 4th or 6th Centurie when the Silk Road was open. For Europe the date is ulterior.\nI think Chinese or Indian alternatives are too exotic.\n\n","date":"July 29, 2013 at 1:15 am","url":"https://shroudstory.com/2013/07/27/and-the-problem-is-a-four-pedal-loom/","cat":"news_&_views","id":"comment-39999","author":"David Mo","site":"shroudstory"},{"title":"And the problem is a four-pedal loom?","post":"“”Middle East OR NORTH Africa”, of course.\n\n","date":"July 29, 2013 at 1:30 am","url":"https://shroudstory.com/2013/07/27/and-the-problem-is-a-four-pedal-loom/","cat":"news_&_views","id":"comment-40001","author":"David Mo","site":"shroudstory"},{"title":"And the problem is a four-pedal loom?","post":"It is “assumed” a four pedal loom was needed, not fact.\nR\n\n","date":"July 29, 2013 at 1:30 pm","url":"https://shroudstory.com/2013/07/27/and-the-problem-is-a-four-pedal-loom/","cat":"news_&_views","id":"comment-40050","author":"Ron","site":"shroudstory"},{"title":"And the problem is a four-pedal loom?","post":"No se necesita un telar de 4 pedales para realizar la sarga 3:1, sino de 4 “lizos” o “lisos”,\nLos lizos o lisos eran manejados manualmente por varios operarios independientes del “tejedor”.\nLa introducción de los pedales supuso la mejora “mecánica” del telar pues permitía manejar los lizos por el “tejedor” sólo, sin necesitar el trabajo de otros operarios.\nCarlos Otal\n\n","date":"July 29, 2013 at 4:31 am","url":"https://shroudstory.com/2013/07/27/and-the-problem-is-a-four-pedal-loom/","cat":"news_&_views","id":"comment-40009","author":"carlos","site":"shroudstory"},{"title":"And the problem is a four-pedal loom?","post":"which Google translates as:\nYou do not need a loom 4 pedals for 3:1 twill, but 4 “Heald” or “smooth”,\nThe heddles or smooth were handled manually by several independent operators “Weaver”.\nThe introduction of the pedals marked improvement “mechanical” loom heddles handle it allowed for the “weaver” only, without requiring the work of other operators.\nCarlos Otal\n\n","date":"July 29, 2013 at 4:38 am","url":"https://shroudstory.com/2013/07/27/and-the-problem-is-a-four-pedal-loom/","cat":"news_&_views","id":"comment-40011","author":"Dan","site":"shroudstory"},{"title":"And the problem is a four-pedal loom?","post":"“And the problem is that such a loom is known in Mediterranean area just after the 4th Century when it came from China. About this Fulbright says nothing.”\nNo one other than David has really touched on this problem.\nCan someone verify that the shroud would have had to have been made with a loom of 4 pedals? And if so, can someone verify that 4 pedal looms did not appear in the mediterranean til after the 4th century, coming via China?\nIf this is correct, then it places great doubt on authenticity, as it is highly unlikely that the shroud would have been obtained from China in 1st century palestine.\n\n","date":"July 29, 2013 at 4:39 am","url":"https://shroudstory.com/2013/07/27/and-the-problem-is-a-four-pedal-loom/","cat":"news_&_views","id":"comment-40012","author":"Matthias","site":"shroudstory"},{"title":"And the problem is a four-pedal loom?","post":"ok almost simultaneous assistance there from Dan via Google translation!\nAny further thoughts?\n\n","date":"July 29, 2013 at 4:40 am","url":"https://shroudstory.com/2013/07/27/and-the-problem-is-a-four-pedal-loom/","cat":"news_&_views","id":"comment-40013","author":"Matthias","site":"shroudstory"},{"title":"And the problem is a four-pedal loom?","post":"El experto textil F. Lopez – Amo, de la Universidad Politécnica de Catalunya, escribe en “ESTUDIO TÉCNICO-TEXTIL DE DOS PIEZAS SINGULARES DE LA ARQUEOLOGÍA PALEO-CRISTIANA: LA SINDONE DE TORINO Y EL SUDARIO DE OVIEDO [Parte 1ª] ·)”\n“Su textura o ligamento es una sarga de cuatro (3e1), como se representa en el histograma de la Figura 4, en unas semi-fajas longitudinales, y otra sarga de cuatro en sentido inverso (1e3), Figura 5, en semi-fajas alternadas con las anteriores, de manera que forman la sarga a punta y retorno de la Figura 6, generalmente conocida como “espiga” (“chevron” en francés, “spina di pesce” en italiano, y “brokentwill”o “herring-bone” en inglés).”\n“Estos tejidos de sarga en espiga y sus derivados a cuadros o rombos (“losange” en francés) son conocidos desde la Edad del Hierro (5000 a 2000 a. J.C.) cuando menos, aunque casi siempre los más antiguos son tejidos de lana.”\nCarlos Otal\n\n","date":"July 29, 2013 at 4:54 am","url":"https://shroudstory.com/2013/07/27/and-the-problem-is-a-four-pedal-loom/","cat":"news_&_views","id":"comment-40014","author":"carlos","site":"shroudstory"},{"title":"And the problem is a four-pedal loom?","post":"and again thanks to Google translation:\nThe textile expert F. Lopez – Love, Polytechnic University of Catalonia, writes in “TECHNICAL STUDY TWO PIECE UNIQUE TEXTILE OF THE PALEO-CHRISTIAN ARCHAEOLOGY: THE SHROUD OF TURIN AND THE SHROUD OF OVIEDO [Part 1] ·)”\n“The texture or twill weave is a four (3e1), as shown in the histogram in Figure 4 in a semi-longitudinal stripes and another twill four in reverse (1e3), Figure 5, in semi-stripes or earlier, so as to form the tip twill and return to Figure 6, generally known as “spike” (“chevron” in French, “spina di pesce” in Italian, and “brokentwill” or “herring-bone “in English).”\n“These herringbone twill fabrics and derivatives plaid or argyle (” lozenge “in French) are known from the Iron Age (5000-2000 a. JC) at least, but almost always the oldest are woven of wool. ”\nCarlos Otal\n\n","date":"July 29, 2013 at 5:25 am","url":"https://shroudstory.com/2013/07/27/and-the-problem-is-a-four-pedal-loom/","cat":"news_&_views","id":"comment-40019","author":"Dan","site":"shroudstory"},{"title":"And the problem is a four-pedal loom?","post":"Fulbright’s paper gives adequate evidence of elaborate complex weaves from all over the place well before the first century. They range from northern Europe to the Judean desert and further afield. It includes the sash of Rameses III who reigned in the 12th century BCE; The sash is of intricate design, excellent workmanship, five colours, in a design consisting of a 3:1 herringbone twill, alternating with 4:1 and 5:1 herringbone twills. The sash is 17 ft in length and tapers from 5 inches in width to under 2 inches. There is a fragment of a silk shroud with a five-shaft satin weave found in a child’s coffin in Kent from Roman times; There is a 2:2 woollen cloak from Sweden dating to ~900 BCE. No Charles, there is not a large linen cloth sample of a 3:1 weave, as if that were relevant. The TS seems unique in that respect. But in the light of what was achieved in ancient times throughout the then known world, let alone what was achieved in pre-Columbian America with no known contact with Chinese 4 pedal looms, it beggars belief that weaving the TS was beyond the capability of 1st century Middle Eastern weavers.\n\n","date":"July 29, 2013 at 5:16 am","url":"https://shroudstory.com/2013/07/27/and-the-problem-is-a-four-pedal-loom/","cat":"news_&_views","id":"comment-40017","author":"daveb of wellington nz","site":"shroudstory"},{"title":"And the problem is a four-pedal loom?","post":"I agree that the TS was technically possible- no problems there – but if you want large linen cloths just search ‘Medieval tablecloths’.\n\n","date":"July 29, 2013 at 5:58 am","url":"https://shroudstory.com/2013/07/27/and-the-problem-is-a-four-pedal-loom/","cat":"news_&_views","id":"comment-40021","author":"Charles Freeman","site":"shroudstory"},{"title":"And the problem is a four-pedal loom?","post":"Your  point Charles? That the shroud was a medieval tablecloth?\n\n","date":"July 29, 2013 at 6:58 am","url":"https://shroudstory.com/2013/07/27/and-the-problem-is-a-four-pedal-loom/","cat":"news_&_views","id":"comment-40024","author":"matthias","site":"shroudstory"},{"title":"And the problem is a four-pedal loom?","post":"No, of course not!! Simply that they did make large fine linen cloths in the Middle Ages, something that seemed to be challenged in another posting.\n\n","date":"July 29, 2013 at 10:17 am","url":"https://shroudstory.com/2013/07/27/and-the-problem-is-a-four-pedal-loom/","cat":"news_&_views","id":"comment-40037","author":"Charles Freeman","site":"shroudstory"},{"title":"And the problem is a four-pedal loom?","post":"I searched, read a lot of bumph, only vaguely descriptive, not a single linear dimension quoted anywhere. Can you steer me to some specific examples, quoting dimensions. Do you have specific examples in mind? Anything of TS size will do, preferably liinen.\n\n","date":"July 29, 2013 at 4:15 pm","url":"https://shroudstory.com/2013/07/27/and-the-problem-is-a-four-pedal-loom/","cat":"news_&_views","id":"comment-40059","author":"daveb of wellington nz","site":"shroudstory"},{"title":"And the problem is a four-pedal loom?","post":"DAVEB. If you are seriously into weaving you need access to the Cambridge History of Western Textiles, two volumes (2003). The section on the treadle loom, introduced in c. 1000 AD is important  and is discussed on Volume One,  pages 194-7. It could produce thin cloths, linen or wool or silk, up to 25 metres – the details are there. It came from China via Islam – probably the Shroud of Cadouin and the Veil of Apt were woven on treadle looms c. 1090 in Egypt. You can get the dimensions of fine medieval linen from making estimates from the table and altar cloths that were in linen and are known from many depictions. if they have figures with them you can work out the dimensions.  There were also linen dossals and frontal pieces, which went behind and in front of altars, that tend to be rectangular.\nI am not relating this to the Shroud in any way but when I had a conversation with someone who recreates ancient weaving patterns, they said I had to master the different kinds of loom used in the ancient world before I could say anything of any value as different lengths, widths, and patterns were made by different kinds of looms.So perhaps your researches should concentrate on what type of ancient loom would have been needed to create a cloth the size of the TS. Over to you.\n\n","date":"July 30, 2013 at 3:38 am","url":"https://shroudstory.com/2013/07/27/and-the-problem-is-a-four-pedal-loom/","cat":"news_&_views","id":"comment-40104","author":"Charles Freeman","site":"shroudstory"},{"title":"And the problem is a four-pedal loom?","post":"Carlos:\nProfessor López-Amo makes the same mistake than Diane Fulbright (and similar to Mr. Tyrer also): techniques to weave wool are not techniques to weave linen. Théo Jean Flamme, former expert at the Institut de Recherche Scientifique Belge pour l’Industrie et l’Agriculture, maintains that this type of tissue of about 1000 threads per box and about 230g per m needs a loom of four pedals. Is the kind of tissue that complicates its weaving. But it is easy to him, Mistress Fulbright o Mr. Tyrer: let them show us a cloth with the same features (size, linen, 3:1, Z, etc.) of the first Century in Mediterranean Area. They have failed hitherto. \nI will read attentively the paper of López-Amo. But it seems to me not good: just at first glance and I have seen some big mistakes (pollens and Mr. Kuznetsov, for example).\nPS: I’m glad you are in form. \nTranslation without Google. \nCarlos:\nEl profesor López-Amo comete el mismo error que Diane Fulbright (y similar al del Sr. Tyrer, también): las técnicas para tejer lana no son las de tejer lino. Jean-Théo Flamme, antiguo experto del Institut Belge de Recherche Scientifique pour l’Industrie et l’Agriculture, mantiene que este tipo de tejido de unos 1000 hilos por cuadro y de unos 230g por m. necesita un telar de cuatro pedales. Es la clase de tejido la que complica el tejido, no su tamaño. Pero tanto López-Amo, como la Sra. Fulbright o el Sr. Tyrer, tienen la demostración fácil: que nos muestren un tejido con las mismas características (tamaño, lino, 3:1, Z, etc.) del siglo I y en el área Mediterránea. Hasta ahora han fallado. \nLeeré atentamente el artículo de López Amo. Pero a primera vista no me parece muy bueno. He encontrado algunos errores de bulto (pólenes y Mr. Kuznetsov, por ejemplo).\nPS: Me alegra que sigas en forma.\n\n","date":"July 30, 2013 at 2:21 am","url":"https://shroudstory.com/2013/07/27/and-the-problem-is-a-four-pedal-loom/","cat":"news_&_views","id":"comment-40094","author":"David Mo","site":"shroudstory"},{"title":"And the problem is a four-pedal loom?","post":"How do I put up a cute icon like the one David Mo uses?\n\n","date":"July 30, 2013 at 10:35 am","url":"https://shroudstory.com/2013/07/27/and-the-problem-is-a-four-pedal-loom/","cat":"news_&_views","id":"comment-40121","author":"Fr. M.","site":"shroudstory"}]
