[{"title":"So, swings and roundabouts: Darn, Dawkins didn’t ask about the shroud.","post":"I’ve never understood how people can believe it was only a spiritual and not a physical resurrection? What do they believe happened to the body? How do they explain what the apostles found and didn’t find in the tomb? (specifically no body)?…I may step on toes here, nevertheless, to me that type of thinking does not show ‘true’ faith and definately not ‘true’ Christian thinking as taught by the lord Jesus Christ…Am I missing something here?\nR\n\n","date":"February 17, 2012 at 8:32 pm","url":"https://shroudstory.com/2012/02/17/so-swings-and-roundabouts-darn-dawkins-didnt-ask-about-the-shroud/","cat":"news_&_views","id":"comment-8416","author":"Ron","site":"shroudstory"},{"title":"So, swings and roundabouts: Darn, Dawkins didn’t ask about the shroud.","post":"Ron, good point. Also, not believing in a physical resurrection does not square with the Apostles actions from there on out. They were zealous in carrying out Christ’s command to make believers of all men. What’s more telling is they did not fear death at all. What takes men from the abject terror they had after Jesus’ arrest and death and makes them unflinching of persecution and death to spread His story? If they had not seen the Risen Lord they would not have done what they did. It simply doesn’t make sense otherwise. I mean these guys suffered horrible tortures but remained unwavering. It’s one thing to die for something you have Faith in it’s quite another to die for something you have seen with your own eyes. That’s what sets Christianity apart from pretty much every other religion. It’s based on eye-witness testimony.\n\n","date":"February 17, 2012 at 10:27 pm","url":"https://shroudstory.com/2012/02/17/so-swings-and-roundabouts-darn-dawkins-didnt-ask-about-the-shroud/","cat":"news_&_views","id":"comment-8419","author":"Chris","site":"shroudstory"},{"title":"So, swings and roundabouts: Darn, Dawkins didn’t ask about the shroud.","post":"I agree, very good point. That is probably the best evidence against anyone’s idea that the NT is just made-up or that our religion is just a fable. People do not carry on as the apostle’s did unless they are 100% sure of their convictions.\nR\n\n","date":"February 18, 2012 at 4:44 am","url":"https://shroudstory.com/2012/02/17/so-swings-and-roundabouts-darn-dawkins-didnt-ask-about-the-shroud/","cat":"news_&_views","id":"comment-8423","author":"Ron","site":"shroudstory"},{"title":"So, swings and roundabouts: Darn, Dawkins didn’t ask about the shroud.","post":"40 years ago when I was only 19 years ago…I had a “most” unusual experience.I had thought I was dying…and as I lay in bed I pleaded with God to give me another chance because I felt i wasn’t ready to die and that I could do better with my life.Many events led up to this experience and many events followed but I will get to exactly what happened as I implored God.\nImmediately I felt something like a vibration in and of my heart…as all in one motion my arms involuntarily sprung open wide and I was drawn into a 3/4 sit up position while a light burst and radiated upon me,and I suppose within and through me as well.I also burst into an ecstatic cry of joy and a river of tears as it was happening.My first words were,”My God it’s true!Your really there…you really care…your really there ! The whole experience couldn’t have lasted more than five to several seconds…but I then fell back onto my pillow as the door opened to my room and a nurse entered.She didn’t know what had just happened…and I have never forgotten.\nI afterwards had fellowship with every denomination you can think of in my town and other parts of the country.A Russian Orthodox commune and Trappist monastery being the last two places I spent some time until I settled into the faith I was raised in.I’ve witnessed to my faith countless times but rarely shared this particular event regarding my “road to Damascus” experience which entailed a similar light to that of St. Paul.\nSo now I feel I am ready to share this “miraculous” experience and to tell it like it is…I didn’t know how to share it before and was mostly always afraid that no one would believe it.But I will leave that up to whoever hears it and to God.I have no fear of what others will think about this anymore because I know that I will need to give an account to God Himself and it’s what He thinks that really matters.\nWhy it took 40 years to prepare me to speak out about this I do not know…I can only quote something from scripture which may explain it some.”Silver is for the smelter,gold is for the furnace,but the purification of the heart by fire is of God.\nGod bless…as a final comment I want to say…. that I have an absolute certainty or conviction that the Shroud of Turin is undoubtedly the true burial cloth of Christ.I believe that it was a burst of light during his “predicted” resurrection which left the image on the cloth.It was left to us as both a testament and legacy for future generations.\n\n","date":"February 18, 2012 at 12:21 am","url":"https://shroudstory.com/2012/02/17/so-swings-and-roundabouts-darn-dawkins-didnt-ask-about-the-shroud/","cat":"news_&_views","id":"comment-8421","author":"john macgillivray","site":"shroudstory"},{"title":"So, swings and roundabouts: Darn, Dawkins didn’t ask about the shroud.","post":"Great comment, John! I love hearing about these kinds of things.Thanks for sharing.\n\n","date":"February 18, 2012 at 12:47 pm","url":"https://shroudstory.com/2012/02/17/so-swings-and-roundabouts-darn-dawkins-didnt-ask-about-the-shroud/","cat":"news_&_views","id":"comment-8436","author":"Chris","site":"shroudstory"}]
