[{"title":"So which hypothesis, of all those ever proposed, do I prefer?","post":"Whether Francis I has a Master’s degree in Chemistry or not will make no difference to Shroud research, at least for the time being. His attention is now turned to studying the brain chemistry of those in the Curia.\n\n","date":"April 24, 2013 at 8:54 am","url":"https://shroudstory.com/2013/04/24/so-which-hypothesis-of-all-those-ever-proposed-do-i-prefer/","cat":"news_&_views","id":"comment-31757","author":"Louis","site":"shroudstory"},{"title":"So which hypothesis, of all those ever proposed, do I prefer?","post":"And why not making also a proper check-up of the heart of those in the Curia??? ;-)  Here in Quebec, we got a nice expression that fits pretty well concerning the situation of the Curia at the Vatican : Power is a heady wine!  It’s time for a big change there my friends.  Anyway, since I’m a free thinker and put a lot more value on my own consciousness and spiritual experience of God than on what some old guys in Rome are doing, thinking and saying about God, the fact that there will be some changes or not is not that important to me in the end.  The only sad thing (but maybe this is a will of the Holy Spirit), is this: if things remains unchanged, the Catholic Church will fall to the ground in a near future.  Who knows if that’s not what would be the best thing to happen?  Every Resurrection needs a death first…\n\n","date":"April 24, 2013 at 10:46 am","url":"https://shroudstory.com/2013/04/24/so-which-hypothesis-of-all-those-ever-proposed-do-i-prefer/","cat":"news_&_views","id":"comment-31768","author":"Yannick Clément","site":"shroudstory"},{"title":"So which hypothesis, of all those ever proposed, do I prefer?","post":"It is not up to you, Yannick, to decide what is needed to be done in Catholic Church. Catholics will decide themselves without the “good intentions” from outsiders :)\n\n","date":"April 24, 2013 at 8:46 pm","url":"https://shroudstory.com/2013/04/24/so-which-hypothesis-of-all-those-ever-proposed-do-i-prefer/","cat":"news_&_views","id":"comment-31806","author":"jesterof","site":"shroudstory"},{"title":"So which hypothesis, of all those ever proposed, do I prefer?","post":"Yannick, if your a catholic you know what Christ said about his church and the gates of hades not prevailing over it right?\n\n","date":"April 25, 2013 at 3:19 am","url":"https://shroudstory.com/2013/04/24/so-which-hypothesis-of-all-those-ever-proposed-do-i-prefer/","cat":"news_&_views","id":"comment-31832","author":"Bippy123","site":"shroudstory"},{"title":"So which hypothesis, of all those ever proposed, do I prefer?","post":"Free-thinkers! A quaint out-moded movement dating back to Theophile de Viau (a self-contradictory cognomen) 1590-1626, as a reaction to his Calvinist-Huguenot roots, more an aspiring poet and dramatist rather than a philosopher. In the 18th century it became associated with the philsophes or libertins, all with divergent views, but united in their arrogant conviction of the supremacy and total efficacy of human reason. It included such worthies as Voltaire, Montesquieu, Rousseau, Diderot and the like, united in their anti-clericalism, and lacking the humility to admit the possibility of any kind of divine revelation whatsoever. It can boast as its ultimate logical outcome the Reign of Terror which followed the French Revolution, the founding of Freemasonry, and Free-thinkers dominated the French Academy of Science when Yves Delage attempted to present a scientific paper on the forensics of the Shroud of Turin. Having no objective criterion but one’s own subjective interpretation of what comprises adequate reason, it ultimately led to the totally subjective philosophy of Michel Foucault and others of his ilk.  These are they who would turn their backs on the Act of Providence that bestowed a Church which is heir to Christ’s guarantee of the charism of a divine authority. I assert that enlightened humility is a precious virtue!\n\n","date":"April 25, 2013 at 7:49 am","url":"https://shroudstory.com/2013/04/24/so-which-hypothesis-of-all-those-ever-proposed-do-i-prefer/","cat":"news_&_views","id":"comment-31845","author":"daveb of wellington nz","site":"shroudstory"},{"title":"So which hypothesis, of all those ever proposed, do I prefer?","post":"And this is the sad thing about the Shroud, that even if one day it is proven to be the death shroud of Jesus, Christians will still argue and debate over its significance and exploit it to prove their own religious dogmatic convictions. If this precious relic cannot unify us by its awesome existence then it would be better it be proven a fraud.\n\n","date":"April 25, 2013 at 9:46 am","url":"https://shroudstory.com/2013/04/24/so-which-hypothesis-of-all-those-ever-proposed-do-i-prefer/","cat":"news_&_views","id":"comment-31855","author":"looneytombs","site":"shroudstory"},{"title":"So which hypothesis, of all those ever proposed, do I prefer?","post":"I have yet to see a Catholic chained to the altar or a bench in his Church. The door is always open for him to leave. And always open for him to return.\nSome left, had second thoughts, and returned, and that was the case, for example, of Professor Francis Beckwith, at Baylor University, author of “Return to Rome”.\n\n","date":"April 25, 2013 at 1:20 pm","url":"https://shroudstory.com/2013/04/24/so-which-hypothesis-of-all-those-ever-proposed-do-i-prefer/","cat":"news_&_views","id":"comment-31890","author":"Louis","site":"shroudstory"}]
