[{"title":"And While We Are Talking About Australians","post":"We already discussed this, see “And we are all mathematicians … “, start at Louis comment, Jul 27, 4:07 pm.   \nYou can find maps both in NZ & Australia which show the South Pole at the top of the page, but then it’s a mere convention.  But it’s your man from California who’s upside down!\n\n","date":"July 29, 2015 at 5:45 am","url":"https://shroudstory.com/2015/07/29/and-while-we-are-talking-about-australians/","cat":"tinfoil_hats","id":"comment-206841","author":"daveb of wellington nz","site":"shroudstory"},{"title":"And While We Are Talking About Australians","post":"Hello daveb\nThat’s right, and I even thought you may be able to have coffee with him and then post your comments for us here to read, but then Thomas said that depending on the man’s location the distance would be the same as between London and Jerusalem.\nJokes aside, these kind of claims appear now and then because religion is in decline in the West and people are looking for some “palpable” demonstration that God exists. Quite often even Christians ask, What is the meaning of it all?\nPersonally I think that systematic theology has been unable to provide satisfactory answers and Rome, at least, cannot make any pronouncements because many claims in physics and biology are yet to be verified. What I have read so far from that end are the responses Benedict XVI gave to the German journalist Peter Seewald in many of the interviews he granted and which have been published in books also available in English.\nThe big problem is that the questions being asked today are not exactly new, they can be traced even to the biblical period, even before the Essenes formed their community, trying to find a way to please God, that is, to separate themselves as the “sons of light” and keep away from the “sons of darkness”, the rest of humanity:  https://www.academia.edu/12734802/Book_Review_Beyond_the_Essene_Hypothesis_The_Parting_of_the_Ways_between_Qumran_and_Enochic_Judaism\nIn our own period I have seen top biblical scholars also trying to make sense of some of the things stated in the Bible, looking for the same responses:  https://www.academia.edu/12851672/The_Historical_Jesus_The_view_of_Professor_Geza_Vermes\nThere are also renowned authors, in the field of literature, who try to do the same:  https://www.academia.edu/12823419/Book_Review_Jesus_and_Yahveh_the_names_divine\nAs you know, it is also the reason why many look to the Turin Shroud for an answer.\n\n","date":"July 29, 2015 at 9:36 am","url":"https://shroudstory.com/2015/07/29/and-while-we-are-talking-about-australians/","cat":"tinfoil_hats","id":"comment-206863","author":"Louis","site":"shroudstory"},{"title":"And While We Are Talking About Australians","post":"Nice, in a demented sort of way.\n\n","date":"July 29, 2015 at 7:03 am","url":"https://shroudstory.com/2015/07/29/and-while-we-are-talking-about-australians/","cat":"tinfoil_hats","id":"comment-206849","author":"Dcn Andy","site":"shroudstory"},{"title":"And While We Are Talking About Australians","post":"Out of my love and respect for our Lord, I will say nothing about the fraud the article is about.\n\n","date":"July 29, 2015 at 7:42 am","url":"https://shroudstory.com/2015/07/29/and-while-we-are-talking-about-australians/","cat":"tinfoil_hats","id":"comment-206854","author":"ekmcmahon","site":"shroudstory"},{"title":"And While We Are Talking About Australians","post":"The fellow lives 300 km north of Brisbane.  It’s very hot up there, I have seen people at Surfers Paradise getting a sun-tan on the beach in late winter.  In summer they live in their swimming pools.  The heat obviously goes to some of their heads. \nBut Louis makes a valid point.  With the decline in religion, it still seems to be part of our natural instinct to look for a substitute and would-be aspirants will attempt to take up the role.  Others will worship at the altar of skepticism.  \nIs it fraud?  Perhaps, but there are also the self-deluded who would be better served by taking their medication.  Occasionally such movements can turn violent, and of course there have been incidents of mass suicide, by those following a false messiah.  Some will see it as the anti-christ at work.  \n“Our hearts are restless until they rest in Thee, O Lord” – Augustine.\n\n","date":"July 29, 2015 at 3:31 pm","url":"https://shroudstory.com/2015/07/29/and-while-we-are-talking-about-australians/","cat":"tinfoil_hats","id":"comment-206898","author":"daveb of wellington nz","site":"shroudstory"},{"title":"And While We Are Talking About Australians","post":"Daveb,the Australian is a copycat. There is another one who began before him, and lives in a place that is not hot. He also makes a link with the Shroud.\nSoon we will have to begin to ask, Will the real “Jesus” please stand up?:\nhttp://www.inricristo.org.br/index.php/en\n\n","date":"July 29, 2015 at 5:16 pm","url":"https://shroudstory.com/2015/07/29/and-while-we-are-talking-about-australians/","cat":"tinfoil_hats","id":"comment-206905","author":"Louis","site":"shroudstory"},{"title":"And While We Are Talking About Australians","post":"At least the Australian reincarnated Christ doesn’t kill Christians like those in the Eastern Lightning cult of the female reincarnated Christ, who is referred to as “Lightning Deng.”\nQuote from one of the cult memebers:\n“Go to hell, demon,” one of the accused, Zhang Lidong, yelled as he beat the woman with a steel mop handle, telling her she would “never come back in the next reincarnation.”\nhttp://www.cnn.com/2014/06/06/world/asia/china-eastern-lightning-killing/\n\n","date":"August 4, 2015 at 11:53 am","url":"https://shroudstory.com/2015/07/29/and-while-we-are-talking-about-australians/","cat":"tinfoil_hats","id":"comment-207416","author":"Angel","site":"shroudstory"},{"title":"And While We Are Talking About Australians","post":"This guy is mad and so mad. There are many people like him and they call themselves as they are incarnations of past religious leaders.\nIf that mad guy read the Gospels he has to understand that Jesus is not to reincarnate again.\nI am waiting for spring to go to Canberra to see Floriade.\n\n","date":"July 29, 2015 at 4:42 pm","url":"https://shroudstory.com/2015/07/29/and-while-we-are-talking-about-australians/","cat":"tinfoil_hats","id":"comment-206903","author":"Sampath Fernando","site":"shroudstory"},{"title":"And While We Are Talking About Australians","post":"Mammon is slowly winning in some places:\nhttp://america.aljazeera.com/articles/2015/7/29/anger-grows-ny-archdiocese-closing-churches.html\n\n","date":"July 29, 2015 at 6:11 pm","url":"https://shroudstory.com/2015/07/29/and-while-we-are-talking-about-australians/","cat":"tinfoil_hats","id":"comment-206907","author":"Louis","site":"shroudstory"}]
