[{"title":"And you thought you knew all about peer reviewed journals.","post":"I know a couple of additional Open-access editors that do not appear in the list and unfortunately, among many other papers on a wide range of subjects, have also published “scientific” works on the Shroud.\nThe only scientific literature commnly accepted in the academia (and elsewhere) corresponds to the journals belonging to the Journal of Citation Ranks (JCR) with its peer-reviewed and impact factor system. I know that it is not perfect, but it is by far the best we have. To my surprise, a few months ago I discovered that there are quite a lot of papers on the Shroud published in JCR journals. These are the ones that -even with a dose of skepticism, OK so far- are, in principle, to be considered serious research.\n\n","date":"January 13, 2012 at 6:54 am","url":"https://shroudstory.com/2012/01/13/and-you-thought-you-knew-all-about-peer-reviewed-journals/","cat":"news_&_views","id":"comment-6907","author":"Gabriel","site":"shroudstory"},{"title":"And you thought you knew all about peer reviewed journals.","post":"I think that the process of scientific publication is misunderstood by some. I have read many declarations that show basic misunderstanding. The most naive ones are of the form “This paper was peer-reviewed, so its result should be accepted” (that one comes from a well-known shroud authority). The review process greatly varies depending on the journal and the field of research. At first, there is no indication of the quality of a paper by simply stating that it was “peer-reviewed”. It could be trash, it could be of the highest quality. For some journals, it might appear that they have a weak review process. But that could be a misleading first impression. At one extreme of the spectrum are journals that appear to have a weak peer-review process: the author(s) suggest reviewers (the journal is not obligated to accept them), and pay to have it published. This is actually a common process in many fields: hundred of thousands of papers were published in Biology using that process. But it is an uncommon process in Computer Science . At first, this process is not bad: the suggested reviewers might be screened to make sure that they are respected researchers in the field and no apparent conflicts exist between these reviewers and the authors of the paper. For some journals, you always need to pay to have your paper published since this is their modus operandi (PLoS ONE is one well-known example for scientific papers). The cost of publishing is high and if you want your paper freely accessible that is one way to go: you pay the publisher so that the readers do not have to pay. Other journals do not charge a publication fee (they will charge the readers), but you can optionally pay to have your paper freely accessible on their Web site. The other extreme might be good or bad: the publisher do not charge any publication fee (they will charge the readers) and states that a peer-review process is taking place. But you have some such journals that accept almost any paper as they run mostly as a business without much scientific supervision while still claiming a fair peer-review process. The Web has unfortunately brought many new such journals. I have seen many papers being published on the Shroud in such journals (claimed as peer-reviewed): their content was so empty of any new results that you had the feeling that the authors simply patched together random pieces of text from the Web. How do you know your way through all of this? I think you need to do some basic analysis: reading the instructions for authors, sampling some of the papers published, and verify the credentials of the editorial board. Also, as pointed out by Gabriel, the Impact Factor of the journal can help. This system is new and has been criticized, but a good Impact Factor (I would say above 3) is not a bad indicator (certainly when you reach an Impact Factor of 20, you know this is a very serious journal).  But most importantly, every paper speaks for itself.  There is nothing that replace a deep analysis of the results published, the methodology used, the cross-referencing of every fact stated in the paper, and more. If as a researcher you cannot differentiate between a good and a bad paper, you are in trouble.\n\n","date":"January 13, 2012 at 2:05 pm","url":"https://shroudstory.com/2012/01/13/and-you-thought-you-knew-all-about-peer-reviewed-journals/","cat":"news_&_views","id":"comment-6935","author":"Mario Latendresse","site":"shroudstory"},{"title":"And you thought you knew all about peer reviewed journals.","post":"Interesting and true comment.  I want to comment specifically about one point :  What Mario said about the Impact Factor of a scientific journal.  \nI just want to say that it is not because the journal have a good impact factor, a high degree of seriousness or a great deal of credibility that a paper published in this journal is necessary a good one !  One doesn’t necessarily go with the other.  It is also important to remember this fact.  \nThat’s exactly like the NewYork Yankees in baseball !  It is not because you play for the Yankees that you’re necessarily an extraordinary player !!!  It’s the same thing with a scientific journals versus a scientific article.  Of course, this fact make things even more complex when it’s time to judge the pertinence or the importance of a scientific article, but this is the reality and we cannot change it.  \nPersonally, when it comes to judge an article, I focus mainly on the conclusions of the article and compare them with all the data and observations we know for sure (or with a high level of certainty) about the Shroud.  After that, I have to reflect upon those conclusions (and often about the methology that was used to reach them) to see if it make sense versus all the Shroud data.  It’s not an easy task !!! \nBut in the end, I think there’s 2 very important principles that we must keep in mind when it comes to judge the pertinence of any scientific paper (I talked about it before) : \n1- Never take for granted a paper JUST because it is published in a peer-reviewd scientific journal (and this is true no matter what’s the prestige associated to this journal).\n 2- ALWAYS wait until there’s an INDEPENDENT confirmation of the findings reported in this paper before taking those conclusions for granted. \nI think those 2 principles can really help us to judge the real pertinence of any article that come out about the Shroud…\n\n","date":"January 14, 2012 at 10:30 pm","url":"https://shroudstory.com/2012/01/13/and-you-thought-you-knew-all-about-peer-reviewed-journals/","cat":"news_&_views","id":"comment-6981","author":"Yannick Clément","site":"shroudstory"},{"title":"And you thought you knew all about peer reviewed journals.","post":"Could you be more specific?\n“I have seen many papers being published on the Shroud in such journals (claimed as peer-reviewed)”…\nNames please…\n\n","date":"January 15, 2012 at 5:47 am","url":"https://shroudstory.com/2012/01/13/and-you-thought-you-knew-all-about-peer-reviewed-journals/","cat":"news_&_views","id":"comment-6988","author":"domenico","site":"shroudstory"},{"title":"And you thought you knew all about peer reviewed journals.","post":"was ‘The Microscope journal’, published and owned by dr. McCrone, a proper peer reviewed journal in 1980?\n\n","date":"January 14, 2012 at 6:23 am","url":"https://shroudstory.com/2012/01/13/and-you-thought-you-knew-all-about-peer-reviewed-journals/","cat":"news_&_views","id":"comment-6962","author":"domics","site":"shroudstory"},{"title":"And you thought you knew all about peer reviewed journals.","post":"The first JCR rank  available dates back to 1997. Neither in 1997 nor in 2010 there is a journal called “The microscope Journal” so, at least in that period the journal is not in the JCR system because\ni)it is not published any longer\nii) its quality is so poor, that is no considered into the system\nBy the way,some recent papers published in the JOURNAL OF IMAGING SCIENCE AND TECHNOLOGY  have been commented  in this blog. This journal has an impact factor of 0.513 and is in position 15th out of 19 in the field of IMAGING SCIENCE & PHOTOGRAPHIC TECHNOLOGY.\n\n","date":"January 14, 2012 at 10:08 am","url":"https://shroudstory.com/2012/01/13/and-you-thought-you-knew-all-about-peer-reviewed-journals/","cat":"news_&_views","id":"comment-6968","author":"Gabriel","site":"shroudstory"},{"title":"And you thought you knew all about peer reviewed journals.","post":"I was referring to this:\nhttp://mcri.org/home/section/71-72/the-microscope-journal\n\n","date":"January 15, 2012 at 5:49 am","url":"https://shroudstory.com/2012/01/13/and-you-thought-you-knew-all-about-peer-reviewed-journals/","cat":"news_&_views","id":"comment-6989","author":"domenico","site":"shroudstory"},{"title":"And you thought you knew all about peer reviewed journals.","post":"Speaking of imaging, or at any rate computer-aided imaging, can anyone explain to me why the so-called 3D-encoded image on the Shroud includes not only the victim, presumed to be 1st century AD, despite totally spurious (we are told) carbon dating to the contrary, but extends to the later 1532 fire damage as well?  Re the latter: look for the 4 framing elongated diamond-shaped additions that intrude upon and spoil an otherwise perfect snapshot, one which would only be possible  – acccording to a group of Italian scientists  – using state-of-the-art short-wave uv laser beams. \n (Shhh – don’t mention the lack of a converging lens, concave mirror, or even pinhole camera, without which no imaging is possible, at least not according to boring old 20th/21st century science),  …\nhttp://colinb-sciencebuzz.blogspot.com/2012/01/sure-turin-shroud-has-3d-encoded-image.html\n\n","date":"January 14, 2012 at 1:34 pm","url":"https://shroudstory.com/2012/01/13/and-you-thought-you-knew-all-about-peer-reviewed-journals/","cat":"news_&_views","id":"comment-6972","author":"sciencebod","site":"shroudstory"}]
