[{"title":"Strong ignorance is not strong evidence","post":"BT makes a good point.  This is exactly why I never say that the Shroud is in fact the burial cloth of Jesus.  Based on data for and against, assessing the preponderance of evidence, I believe it could be. That is far as I can take it.  The Catholic church does not officially call it a relic or an icon, they recognize it as a “symbol of Christ’s suffering worthy of veneration.”  I like the use of the word symbol, it forges a middle path.  Whether authentic or not, it certainly remains a symbol.  However, the word I use is mystery.  It is a profound mystery and why not, all the deep things of God are all mysteries anyway.  Who can comprehend either the incarnation or the resurrection?  Seems reasonable that the Shroud would remain a mystery too.\n\n","date":"November 30, 2012 at 1:04 pm","url":"https://shroudstory.com/2012/11/30/strong-ignorance-is-not-strong-evidence/","cat":"news_&_views","id":"comment-19684","author":"Russ Breault","site":"shroudstory"},{"title":"Strong ignorance is not strong evidence","post":"Authenticity means different things to different people. I suppose in our arrogant modern way we reckon that if we can’t figure out how something was done by a fellow human, then it was more likely to have occurred accidentally, naturally, or at any rate without whoever created it knowing what they were doing. I think that’s fair. Some people infer that this is some evidence, weak or strong, for the shroud being a real shroud which covered a real person, rather than a faked up cloth. A step further is that the real person is more likely to have been the historical Jesus than anybody else, and one further still that the image appeared by miraculous, supernatural or scientifically inexplicable means. Different claimants of authenticity stop at different points along this spectrum, and I think very few, at least on this blog, go all the way to the end.\n\n","date":"November 30, 2012 at 1:19 pm","url":"https://shroudstory.com/2012/11/30/strong-ignorance-is-not-strong-evidence/","cat":"news_&_views","id":"comment-19685","author":"Hugh Farey","site":"shroudstory"},{"title":"Strong ignorance is not strong evidence","post":"“No one in this age has figured out if there is but one universe”\nIn this example, there is a “multi universe” theory fitting current data, but not enough observationnal/experimental data to confirm it.\nConcerning the shroud, a theory is needed to explain the data we have.\n\n","date":"November 30, 2012 at 1:53 pm","url":"https://shroudstory.com/2012/11/30/strong-ignorance-is-not-strong-evidence/","cat":"news_&_views","id":"comment-19686","author":"anoxie","site":"shroudstory"},{"title":"Strong ignorance is not strong evidence","post":"It is certainly not evidence of the authenticity of the cloth.  No doubt about that.  But there is a preponderance of evidence for the authenticity and not much against it.  We certainly need a theory or theories that fit all the data.  Agreed anoxie.  No pet theories will work.\n\n","date":"November 30, 2012 at 3:14 pm","url":"https://shroudstory.com/2012/11/30/strong-ignorance-is-not-strong-evidence/","cat":"news_&_views","id":"comment-19688","author":"Andy Weiss","site":"shroudstory"},{"title":"Strong ignorance is not strong evidence","post":"I see an analogy between the Big Bang and the Holy Shroud. The Big Bang is a sign that God inspired the human authors of the Bible because the Bible says God created the universe from nothing. The Holy Shroud is a sign because the Catholic Church venerates the relic and teaches that there is life after death. \nSaying the Shroud is authentic is like saying God caused the Big Bang. There is no evidence God caused the Big Bang. Saying so just confuses atheists and causes them to think that believing in God is irrational.\n\n","date":"November 30, 2012 at 4:04 pm","url":"https://shroudstory.com/2012/11/30/strong-ignorance-is-not-strong-evidence/","cat":"news_&_views","id":"comment-19689","author":"David Roemer","site":"shroudstory"},{"title":"Strong ignorance is not strong evidence","post":"I would think that I would go further than some of the comments above.  In BT’s original comment for instance, I think that there can be a presumption that the technology available to any medieval forger, with all the properties that the TS is known to have, ought to be discernible to a competent technologist of the 21st century, if the TS had indeed been forged.  That no such technology can be so discerned, is for many a persuasive argument that forgery is at least a very unlikely.scenario.  Yannick Clement has often made the point that the bloodstains have been made before the image was formed, and that there is no image under the bloodstains   Furthermore the flow of the bloodstains conform with that of a crucufied man.  This has been discussed in considerable depth by a number of forensic specialists.  \nWe then would have to say that by some means your unknown forger was able to create an image which was a true negative, that the brightness of individual “pixels” encoded 3-D information, and so on, all that trouble just to produce a result  that on first inspection gives just a watery looking pale image that could only be truly discerned in the 20th century from photography, or VP8 analysis.  The word “symbol” is an understatement, and “mystery” is much closer to the mark.  \nMost of us are well past the point of claiming as BT alleges, that as the image cannot be explained, Shroudies claim that this is ” a convincing argument for authenticity”.  But together with all the other properties of the image, it still remains a powerful argument for authenticity.  \nThere are various naturalistic theories of how the image may have been formed, but none have been subjected to the crucible of rigorous testing.  Neither a naturalistic, nor artificial, nor even a miraculous means can yet be asserted, despite all the research that the TS has been subjected to.\n\n","date":"November 30, 2012 at 7:53 pm","url":"https://shroudstory.com/2012/11/30/strong-ignorance-is-not-strong-evidence/","cat":"news_&_views","id":"comment-19694","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Strong ignorance is not strong evidence","post":"With revelation we believe exactly what God wants us to believe. People believe in Jesus because God has given them the gift of faith. Faith is both a decision and a gift from God. One of the reasons I believe in Jesus is the inexplicability of the blood marks and body images on the 1st or 2nd century piece of linen with dimensions that suit perfectly the goal of creating the front and back images but don’t serve any other purposes, so far as I know. Thus, my faith comes from God and the Holy Shroud comes from God. There is very little evidence that God gave us the Holy Shroud without the help of human craftsmen and a piece of linen that never touched Jesus.\n\n","date":"December 1, 2012 at 12:03 am","url":"https://shroudstory.com/2012/11/30/strong-ignorance-is-not-strong-evidence/","cat":"news_&_views","id":"comment-19698","author":"David Roemer","site":"shroudstory"}]
