[{"title":"Teaser of the Day (#4): Body image in noncontact zones?","post":"Where no contact was made, no mark of contact appears. I don’t think anybody would dispute that.\nWhere there is a mark of contact, there was contact made. That seems pretty irrefutable too.\nWhat this has to do with the image forming mechanism of the shroud escapes me…\n\n","date":"February 4, 2013 at 8:56 am","url":"https://shroudstory.com/2013/02/04/teaser-of-the-day-4-body-image-in-noncontact-zones/","cat":"teaser_of_the_day","id":"comment-23408","author":"Hugh Farey","site":"shroudstory"},{"title":"Teaser of the Day (#4): Body image in noncontact zones?","post":"This is stale news, as anyone involved in Shroud research knows. Top Shroud scientists wrote papers on this years ago.\n\n","date":"February 4, 2013 at 9:59 am","url":"https://shroudstory.com/2013/02/04/teaser-of-the-day-4-body-image-in-noncontact-zones/","cat":"teaser_of_the_day","id":"comment-23411","author":"Louis","site":"shroudstory"},{"title":"Teaser of the Day (#4): Body image in noncontact zones?","post":"This, and Yannick’s thorough insistence that there is no sign of smearing on the shroud, leads me to pose a corollary. Has anyone considered how Jesus was carried from the cross to the tomb? On this shroud? Another shroud? With his face covered by the Oviedo cloth, but the genitals uncovered? On a stretcher; in a cart; carried by four strong men each holding a corner of a sheet? Simply carried in someone’s arms? Each of these possibililties carries profound implications for what the body looked like when it was enclosed by the shroud for the last, image-making, time.\n\n","date":"February 4, 2013 at 7:33 pm","url":"https://shroudstory.com/2013/02/04/teaser-of-the-day-4-body-image-in-noncontact-zones/","cat":"teaser_of_the_day","id":"comment-23448","author":"Hugh Farey","site":"shroudstory"},{"title":"Teaser of the Day (#4): Body image in noncontact zones?","post":"This is, indeed, a very question, one that I had thought about years ago.\n\n","date":"February 4, 2013 at 7:54 pm","url":"https://shroudstory.com/2013/02/04/teaser-of-the-day-4-body-image-in-noncontact-zones/","cat":"teaser_of_the_day","id":"comment-23449","author":"Louis","site":"shroudstory"},{"title":"Teaser of the Day (#4): Body image in noncontact zones?","post":"Sorry, I meant, a very good question.\n\n","date":"February 4, 2013 at 7:55 pm","url":"https://shroudstory.com/2013/02/04/teaser-of-the-day-4-body-image-in-noncontact-zones/","cat":"teaser_of_the_day","id":"comment-23450","author":"Louis","site":"shroudstory"},{"title":"Teaser of the Day (#4): Body image in noncontact zones?","post":"In the Proceedings of The National Academy of Sciences a new paper has just been published where once again, previously established dating using C14, have proven to be wrong, thus indicating that radiocarbon dating techniques in the 80’s were far from being accurate.\nhttp://m.pnas.org/content/early/2013/01/29/1207656110\n\n","date":"February 5, 2013 at 3:56 am","url":"https://shroudstory.com/2013/02/04/teaser-of-the-day-4-body-image-in-noncontact-zones/","cat":"teaser_of_the_day","id":"comment-23481","author":"Gabriel","site":"shroudstory"},{"title":"Teaser of the Day (#4): Body image in noncontact zones?","post":"What’s your current preferred theory Hugh? Is it the scorch theory?\nalthough I see some good points in Colin’s ideas, there are a few things that still trouble me about the scorch theory, including:\n– the general anatomical correctness of the image: statues of the 1300s were still struggling with anatomy\n– certain characteristics of the image – eg. the rear foot sole imprints – very much appear as genuine organic images from a real body, rather than images generated from a bas relief template or equivalent\n– the “wrist problem” – why the blood on the wrist when this was basically unknown in artistic depictions. Surely the wound would have been placed on the hand\n– the general appearance of wounds across the body appear quite authentic to my eyes, rather than something ‘faked’\n– why the absence of loin cloth, again a historical norm. A fake created by scorching on a bas relief could have built in a loin cloth into the relief. Again why the big departure from the cultural norms of the time?\n\n","date":"February 5, 2013 at 4:34 am","url":"https://shroudstory.com/2013/02/04/teaser-of-the-day-4-body-image-in-noncontact-zones/","cat":"teaser_of_the_day","id":"comment-23482","author":"Matthias","site":"shroudstory"},{"title":"Teaser of the Day (#4): Body image in noncontact zones?","post":"Hi Matthias; the shroud is such a varied topic that I don’t have any theory encapsulating the entire thing. I’m mostly exploring the scorch idea for three reasons:\na) Several of the original papers by the STURP team describe the shroud as having many of the characteristics of a scorch, in particular the relationship between pressure or distance and image intensity and the fact that the image seems to be made of degraded cellulose.\nb) Scorching linen and observing the results is something anybody can do in their kitchen!\nc) Although degrading cellulose by scorching may not be the answer, experiments with superficiality, 3-D imaging and UV fluorescence may suggest a mechanism that can be achieved in other ways (gas diffusion or painting, for example).\nAll the difficulties you mention are entirely valid, and were the main reasons the STURP team rejected the hypothesis, but they are, for time being, outside my purlieu, as it were!\n\n","date":"February 5, 2013 at 6:34 am","url":"https://shroudstory.com/2013/02/04/teaser-of-the-day-4-body-image-in-noncontact-zones/","cat":"teaser_of_the_day","id":"comment-23487","author":"Hugh Farey","site":"shroudstory"},{"title":"Teaser of the Day (#4): Body image in noncontact zones?","post":"So Hugh I am right to assume you are agnostic with regard to the question of the Shroud’s authenticity (as the burial shroud of Jesus)\nI’m agnostic tending towards believer (I’m a believer though in the Catholic faith!)\n\n","date":"February 6, 2013 at 2:54 am","url":"https://shroudstory.com/2013/02/04/teaser-of-the-day-4-body-image-in-noncontact-zones/","cat":"teaser_of_the_day","id":"comment-23560","author":"Matthias","site":"shroudstory"}]
