[{"title":"Teaser of the Day (#5):  Double Superficiality Expialidocious","post":"While I also think I see a second face, I don’t think this is an established fact. That is a weakness that should be changed in this paper. If the second face is there, it seems to lend more credence to a solution along the lines proposed by Rogers.\n\n","date":"February 5, 2013 at 6:39 am","url":"https://shroudstory.com/2013/02/05/teaser-of-the-day-5-double-superficiality-expialidocious/","cat":"teaser_of_the_day","id":"comment-23488","author":"Paulette","site":"shroudstory"},{"title":"Teaser of the Day (#5):  Double Superficiality Expialidocious","post":"I basically agree with Mario’s review and again, at the risk of repeating myself, it would be great if original material used by Fanti could be granted free access for independent confirmation.\nHowever, after watching the video enbedded in the recent post “Video: National Geographic–Ancient X Files–Holy Shroud” a major question arises at this point. In this video we can see Fanti’s lab and an experiment of corona discharge taking place. I mean, it is well known that he supports the idea of corona discharge as the mechanism for image formation.\nHowever, IF corona discharge is involved, the laws of electricity, indicate that we would not see a double superficiality with the layers in between remaining untouched. On the contrary, a gradient would be expected with the linen surface closer to the higher electricity potential pole having a higher degree of coloration, the inner layers being also coloured, and finally the last layer exhibiting this tiny imprint known as “double superficiality”.\nIn the absence of any degree of coloration in the inner layers of the Shroud, it is impossible to explain the formation mechanism as originated by a corona discharge breaking the continuity of electric charges flowing through and crossing the Shroud.\nI mean, double superficiality and corona discharge are mutually not compatible.\n\n","date":"February 5, 2013 at 6:40 am","url":"https://shroudstory.com/2013/02/05/teaser-of-the-day-5-double-superficiality-expialidocious/","cat":"teaser_of_the_day","id":"comment-23489","author":"Gabriel","site":"shroudstory"},{"title":"Teaser of the Day (#5):  Double Superficiality Expialidocious","post":"In the interview he granted me some time ago (HSG website) Professor Giulio Fanti said that corona discharge alone could produce the “double superficiality” without colouring the inner layers. He tried without success to have access to more information like the microphotographs and so on to confirm his findings. The Turin archdiocese and Prof Bruno Barberis rejected his findings,much in the same way that Msgr. Giuseppe Ghiberti and Mme. Mechthild Flury-Lemberg dismissed the reweaving hypothesis. What can be done?\n\n","date":"February 5, 2013 at 6:58 am","url":"https://shroudstory.com/2013/02/05/teaser-of-the-day-5-double-superficiality-expialidocious/","cat":"teaser_of_the_day","id":"comment-23492","author":"Louis","site":"shroudstory"},{"title":"Teaser of the Day (#5):  Double Superficiality Expialidocious","post":"Dear Louis,\nThe main way to obtain the solution for the Enigma is the adequate control using the advanced microscopy as I underlined in the past messages …\nFor example, there is a paper :\n“Characterization of linen modified by low temperature plasma and enzymatic hydrolysis”\nby Wong, Ka-kee\nIt is retrievable under the address :  http://repository.lib.polyu.edu.hk/jspui/handle/10397/2104\nand\n(in that paper) we can read :\n>With the image processing techniques and Atomic Force Microscopy, a comprehensive understanding of the surface morphology of low temperature plasma treated flax fibers was achieved …\nIf I am right Professor Giulio Fanti (or the Prof. Paolo Di Lazzaro, in the case of the VUV hypothesis) has not yet used that modern way to control the material.\nI hope this is a little help for your interesting message.\nI want to add :\nIf the researchers have the right contacts, then ,in my opinion,\nthe inherent controls are very easy to do and we can see what is the answer\nfrom these experiments because with the microphotographs we cannot observe\nthe important and useful details.\nSee also : the controls about the noncontact and the contact areas (and the BIF), etc.\n— —\nRegards,\nPiero\n\n","date":"February 5, 2013 at 8:59 am","url":"https://shroudstory.com/2013/02/05/teaser-of-the-day-5-double-superficiality-expialidocious/","cat":"teaser_of_the_day","id":"comment-23503","author":"Piero","site":"shroudstory"},{"title":"Teaser of the Day (#5):  Double Superficiality Expialidocious","post":"Piero, Thanks for the remarks. The problem is that I do not generally go deep into scientific details and leave it to scientists to provide a summary. As you know, Professor Fanti and Prof. Maggiolo published their peer-reviewed paper, one that was contested in Turin, but nothing was published. That certainly is not the way to conduct scientific studies. It is like putting Shroud politics in the place of Shroud science.\nThe information I have from many scientists is incomplete as they have been working on details and it has been followed by requests to keep it confidential and that is something I will always respect. Hopefully, there should be some news from my end by the middle of this year. Turin could make things easier by calling for a fresh examination. You yourself have said that the microphotographs do not help. It is of course not a priority in the Church and Benedict XVI does surely know that the aggressive agnostics he spoke against recently will not be convinced by pro-authenticity Shroud studies. Best regards.\n\n","date":"February 5, 2013 at 4:02 pm","url":"https://shroudstory.com/2013/02/05/teaser-of-the-day-5-double-superficiality-expialidocious/","cat":"teaser_of_the_day","id":"comment-23534","author":"Louis","site":"shroudstory"},{"title":"Teaser of the Day (#5):  Double Superficiality Expialidocious","post":"While it is certainly not obvious that there is a face of the back of the cloth, there are certainly dark patches which correspond with dark patches on the front side, and few anomalies such as dark patches on one side corresponding to light patches on the other. If it is true that the front is only coloured on the upper edges of each thread, then some mechanism must be adduced to account for this. My experiments have been inconclusive so far. I have succeeded in soaking a cloth in quite a strong wheat flour suspension, drying it, and when heating it, discolouring the starch on both sides quite badly without affecting the linen fibres. However this may not be due to anything so subtle as Rogers’s evaporation concentration, simply that a strong suspension doesn’t penetrate the weave.\nI have tried to produce coronal discharge images following Fanti’s description, but without any success at all so far, so I can’t comment on it.\n\n","date":"February 5, 2013 at 1:21 pm","url":"https://shroudstory.com/2013/02/05/teaser-of-the-day-5-double-superficiality-expialidocious/","cat":"teaser_of_the_day","id":"comment-23519","author":"Hugh Farey","site":"shroudstory"},{"title":"Teaser of the Day (#5):  Double Superficiality Expialidocious","post":"Can we be sure this is a double-IMAGE and not just blood soaked thru the cloth? As for Rogers statement; “When a cloth is dried on a line, impurities concentrate on both evaporating surfaces; however, more impurities will deposit on whichever surface dries faster. Any concentration of impurities can take part in the image-formation reactions. This can explain the “doubly ­superficial” image.” -Can we elimainate the possibility that ‘some’ impurities would still be imbedded in the fibres, inbetween the evaporation surfaces? Notice he mentions “ANY concentration of impurities can take part”\nR\n\n","date":"February 5, 2013 at 4:31 pm","url":"https://shroudstory.com/2013/02/05/teaser-of-the-day-5-double-superficiality-expialidocious/","cat":"teaser_of_the_day","id":"comment-23535","author":"Ron","site":"shroudstory"},{"title":"Teaser of the Day (#5):  Double Superficiality Expialidocious","post":"The bloodstains are almost certainly soaked through. They look deeply embedded on micrographs of the front surface, and I’m sure flakes of dried blood would be found throughout the thickness of the cloth. The image marks, on the other hand, may be a different matter. They look as if they only graze the surface on one side, do not continue along the fibres where they fold in under other fibres, and do not continue along threads where they fold in under other threads. For the image to appear on both sides but not in the middle, we may postulate a layer of substance on both sides, that either never reached the middle (a thick suspension) or leached out of the middle by evaporation (maybe a thinner suspension or solution). That substance was more easily degraded (by whatever the image making mechanism was) so that the outside of the cloth went brown while the inside stayed pale. I scattered fragments of linen, icing sugar, wheat flour and maize flour on a hot plate and gradually increased the temperature. The wheat flour went brown several notches before anything else, which is why I chose it for my experiments.(Sadly my hotplate does not have a thermometer so I don’t know what the temperature was.)\n\n","date":"February 6, 2013 at 5:13 am","url":"https://shroudstory.com/2013/02/05/teaser-of-the-day-5-double-superficiality-expialidocious/","cat":"teaser_of_the_day","id":"comment-23568","author":"Hugh Farey","site":"shroudstory"}]
