[{"title":"Teaser of the Day (#6): There are no stars in the sky","post":"Colin Berry is wrong in calling this paper pseudoscience. It doesn’t rise to that level. This paper hurts legitimate shroud science. John Jackson should withdraw it from his website.\n\n","date":"February 6, 2013 at 7:52 am","url":"https://shroudstory.com/2013/02/06/teaser-of-the-day-6-there-are-no-stars-in-the-sky/","cat":"teaser_of_the_day","id":"comment-23578","author":"Paulette","site":"shroudstory"},{"title":"Teaser of the Day (#6): There are no stars in the sky","post":"BTW, I see one star.\n\n","date":"February 6, 2013 at 7:53 am","url":"https://shroudstory.com/2013/02/06/teaser-of-the-day-6-there-are-no-stars-in-the-sky/","cat":"teaser_of_the_day","id":"comment-23579","author":"Paulette","site":"shroudstory"},{"title":"Teaser of the Day (#6): There are no stars in the sky","post":"From shroud.wikispaces.com it is an easy matter to take front and back images and superimpose them, adjusting the opacity to taste. I do not detect any variation of image ‘transfer’ between the front and back images, and must state that for me, at least, the first statement is simply wrong, and therefore there is no need to account for it.\nThe illusion of a more complete image on the front may have been brought about by the blood marks, particularly on the arms, which help to define the middle of the body shape on the ventral, but not, of course, on the dorsal image.\nIn fact by carefully surveying the entire picture, I cannot find anything on the back of the shroud which is not present on the front – except one thing, which other researchers may be able to explain. Here goes:\nThe colouration of the back of the shroud is mostly typified by a dark longitudinal stripe right down the middle, with a sharp edge on the nail-wound side, and a more attenuated edge on the spear-wound side. At first thought, one would guess that it was due to different batches of warp thread, differently processed, and so producing differently coloured longitudinal bands. However, I have always understood that the front side of the shroud was the side with the greater warp thread visibility – 75% –  (thanks to the 3/1 twill), while the proportion of visible warp thread on the back was only 25%. That being so, longitudinal bands should be more pronounced on the front side, which is not what we observe.\n\n","date":"February 6, 2013 at 12:08 pm","url":"https://shroudstory.com/2013/02/06/teaser-of-the-day-6-there-are-no-stars-in-the-sky/","cat":"teaser_of_the_day","id":"comment-23603","author":"Hugh Farey","site":"shroudstory"},{"title":"Teaser of the Day (#6): There are no stars in the sky","post":"Picking up Dan’s final paragraph:  STURP team examined the front-of-cloth image with a variety of lighting conditions, including Wood’s light (UV), Infra-red, and raking light.  Does anyone know if similar lighting was used for the back-of-cloth, and does this give any new information on what is observed on the back-of-cloth image?  \n[BTW: The planet Venus is also very occasionally visible in full daylight.  I saw it clearly visible mid-afternoon in 1962.]\n\n","date":"February 6, 2013 at 3:15 pm","url":"https://shroudstory.com/2013/02/06/teaser-of-the-day-6-there-are-no-stars-in-the-sky/","cat":"teaser_of_the_day","id":"comment-23627","author":"daveb of wellington nz","site":"shroudstory"}]
