[{"title":"Thank You, Everyone","post":"Thanks for your effort / in your retirement look into the ORIENT FOREST HISTORY and I believe you shall find as I did, a Radiant New Research / the Shroud still very important !\n\n","date":"December 15, 2015 at 6:57 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216556","author":"Eugene Ray","site":"shroudstory"},{"title":"Thank You, Everyone","post":"You will be missed. Thank you for your efforts as I have thoroughly enjoyed your blog. God Bless your future endeavors.\n\n","date":"December 15, 2015 at 7:16 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216557","author":"Dennis Compton","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Speaking as someone who has considerable experience in digging a hole for himself (e.g. raosted Templars) and then finding a way out, don’t hesitate to ask, Dan, if you ever need  help in composing a letter to your Church friends, one that  explains why you have oh-so-reluctantly  been forced to change your mind about spending more time with them, and how you now feel bound to restore the previous status quo, i.e. re-activating a sadly soon-to-be dormant website (this one).\nIf that’s an improbable scenario, like so much else that appears on this site, Dan, then thanks for the memories.\n\n","date":"December 15, 2015 at 7:22 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216558","author":"Colin Berry","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Oh, goodness me. This is a real blow and no mistake. To my mind, shroudstory has been a perfect example of what a collaborative blog should be, regardless of its subject. At times heated, pernickity, creative or just plain bonkers, it has never lost sight of its purpose, and I think real research and new insights have been stimulated, explored, presented and discussed in a way unparalleled in other discussion forums. The chief credit for this is not due to the contributors, but to the gentle authority of its moderator, who has modestly kept himself almost in the background of his own blog, stepping in only occasionally if he thought things were getting out of hand. Although few of us are ‘experts’, many of the contributors have brought new aspects of the Shroud to public attention and things which seemed to an individual obvious or proven, historical, scientific, artistic or whatever, have turned out to be no such thing under scrutiny. Much has been said about peer-review here, with reference to academic journals, but this site has been by a long way the best peer-review process any sindonologist could hope for, be he a published scientist or an armchair speculator.\nFrom the bottom of my heart Thank You, Dan, for the last seven years. God bless you, and a very Happy Christmas and a Restful New Year!\n\n","date":"December 15, 2015 at 7:45 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216560","author":"Hugh Farey","site":"shroudstory"},{"title":"Thank You, Everyone","post":"You have totally ruined my routine!  Now what am I going to read in the morning?  The news?  How boring.  Thanks Dan for all your work on this blog.  There have been many many stellar contributions.  I hope one day to get to Hilton Head to see you again like I did in NYC.  Be blessed in your new phase of life.\n\n","date":"December 15, 2015 at 7:59 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216561","author":"Russ Breault","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Thank you Dan for your openness and kindness. I can only wish you the best in your future endeavors.\nIf anyone knows of a website where it’s possible to read and post comments about the shroud on a daily basis, please provide the link.\n\n","date":"December 15, 2015 at 8:13 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216564","author":"PHPL","site":"shroudstory"},{"title":"Thank You, Everyone","post":"I’m really sorry to hear this.  I’m glad to hear, though, you’ll keep the blog up for future research and reading–it’s an absolutely indispensable resource.  Thanks for all your efforts on this.  Good luck on all your future endeavors.\n\n","date":"December 15, 2015 at 8:56 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216569","author":"Joe Marino","site":"shroudstory"},{"title":"Thank You, Everyone","post":"There’s nothing that comes close. You could try:\nhttp://www.skeptiko-forum.com/threads/carbon-dating-dinosaurs-and-the-shroud-of-turin.823/page-16 which is not abusive, but tends to wander aimlessly, or\nhttp://www.internationalskeptics.com/forums/showthread.php?t=299015&page=51 which is mostly a bunch of arch-sceptics ganging up on Richard Savage (Jabba), with much unkind ribaldry, as, to be fair, Richard does not defend his position very well, or\nhttp://discussions.godandscience.org/viewtopic.php?f=6&t=225&start=1380 which is indiscriminately pro-authenticity without much analysis, or\nhttp://www.skepticforum.com/viewtopic.php?t=22563 which is indiscriminately non-authenticity without much analysis\nThere are no doubt others (suggestions, please?), but these are depressing enough…\n\n","date":"December 15, 2015 at 8:57 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216570","author":"Hugh Farey","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Thank you SO MUCH to ‘the crochety old man’ for enduring me (I am a fiercely free spirit and thinker). I’ll soon prove (hope before the end of the year) you were wrong re images of ancient coins (actually most uncompleted Pilate coin patterns), plants (actually mostly fresh flower-head ghost images), and ghost writings (actually a short portion of a transferred text/letter in Nestorian type Syriac script + large portions of Yeshua’s titulus damnationis transferred inscriptions in Greek and Hebrew) etc.\n\n","date":"December 15, 2015 at 9:09 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216571","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Hi Hugh,\n                  Thanks for sharing some links. I will certainly go on these websites and hope to read your comments there. As you once said, you have impeccable logic and I can only agree with most of your writings ! Thanks God you didn’t suggest Stephen E. Jones’ website. His latest ramblings ( read the latest ‘comments section’ on his blog) is that all those who reject the Shroud’s authenticity will face eternal damnation… This guy definitely needs to look at himself in the mirror ! But maybe that we shall take all this with humor …\n\n","date":"December 15, 2015 at 9:16 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216572","author":"PHPL","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Oh Dan, thank you sincerely for making the Shroud come alive for me all these 7 years.  What a marvelous person you are!  And, just as you will never truly “know” whether or not the Shroud is ‘authentic’ but believe it to be, so you will never really “know” the depth of goodness and grace, curiosity and intelligence, insight  and esteem, you have given to all those participating in your beautiful and enriching blog:  ShroudStory.com!\nI feel as if I am losing a ray from the Light of Christ in losing you now.  But I shall the rest of my days bask in the Light you have allowed to shine!\nAnnette Cloutier, a devoted fan\n\n","date":"December 15, 2015 at 9:37 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216575","author":"clublu22014","site":"shroudstory"},{"title":"Thank You, Everyone","post":"This blog was my gateway drug into the addictive realm of Shroudology. I sensed this day was coming, hoped it would be a long while yet.\nIf, as Louis suggests, Turin/Rome does monitor this site I’d hope this blog has demonstrated how essential it is to convene STURP 2.0. Wheels are spinning needlessly while the object of our affection lies waiting to share its secrets. Faith never need fear science, because both seek the Truth. If the Shroud is not authentic it remains a work of art that inspires faith. If it is authentic it’s formation should inspire science.\nLet’s stop talking about what it could be and start discovering what it is. To keep the status quo, of opaque science and transparent superstition, is an insult to the Creator.\nThanks Dan for all your hard work, wit and patience. This Catholic is grateful an Episcopalian led the way in providing the penultimate platform for Shroud discussion.\nHat tip to Dan!\n\n","date":"December 15, 2015 at 10:08 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216579","author":"David Goulet","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Couldn’t agree more, David. What needs to happen for STURP 2.0 to come to fruition? A team of skeptical and believing scientists? Detailed test proposals? Op-Eds in major secular and Catholic newspapers, or even a scientific journal or two, pushing for another round of testing? A youtube video (STURP 2.0 trailer so to speak) that could be widely disseminated on Facebook and Twitter?\n\n","date":"December 15, 2015 at 11:13 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216583","author":"Ryan Jaroncyk","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Yes, hat tip to Dan !\n\n","date":"December 15, 2015 at 10:10 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216580","author":"PHPL","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Thanks, Dan. It has been fun to keep up with. Great you have kept a wide variety of views alive. I stick to my view that we will have a fairly definitive solution to the mystery of the Shroud within the next ten years but thanks for keeping the debates on their way.\n\n","date":"December 15, 2015 at 11:04 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216582","author":"Charles Freeman","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Dan,\nI’m very sorry for the fact of seeing this blog\nthat starts the end of activity …\nFor example:\nI would be curious to read the interventions\nof Prof. Marco Leona (he is in NY, so not\ntoo far away from you …) or other experts\nin the field of analytical chemistry about the\nconcrete possibility to show something to\nthe people about the results obtainable from\nSERS and TERS on linen fibrils (= samples\nproperly treated) … and the inherent meaning\nof these analytical controls for the progress\nof the researches on the ancient Enigma of the Shroud…\nDan, I’m sorry if I put on this blog\n(see f.e. the recent, very short, attempt:\n“TERS Bibliography”) some message\nquite intrusive, putting informations\nabout SERS and TERS (and before these informations,\nother notes about the SPM techniques… ), perhaps\nweighing down the readability of the blog.\nStill I felt the need to improve what Rogers had\noutlined when he spoke on Raman spectrometry in\nhis book (“A Chemist’s Perspective on the Shroud of Turin”):\n“Raman spectrometry is much like IR spectrometry:\nHowever, it sees different motions of the chemical\nfunctional groups. It provides a good complement to IR … etc …”\nSee the topic on December 11, 2011:\n“Mark Andersen Disputed Walter McCrone. Substantiated?”\nlink:\nhttps://shroudstory.com/2011/12/11/mark-anderson-disputed-walter-mccrone-substantiated/\nThe ultrasensitive identification of molecules\nobtained using SERS and TERS can be an\nimportant step to achieve during next controls\non linen samples, in order to see the truth about\nsome claims (by Adrie can der Hoeven, etc.)…\nI apologize to everyone if I could not well\ncommunicate with the other friends in some\ndiscussions …\nI think what is important for all, it is the fact\nof being able to reach the experimental\ndemonstrations of what is presumed to be\nthe right path to follow in order to show the\nscientific truth to the whole world.\n\n","date":"December 15, 2015 at 11:31 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216584","author":"piero","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Here I was inspired to the book:\n“Superforecasting: The Art and Science of Prediction”…\n(I refer to the book by Philip E. Tetlock and Dan Gardner,\npublished last September 29, 2015)\nPerhaps we are near to reach\nthe level of “Shroud Superforecasters”…\nWhat prof. Barberis will communicate\non scientific research?\nWhat will happen to the field of\n“Shroud Science” in the next one year?\nWhat kind of impact of “advanced tools”\non scientific research about the Shroud\nare we going to see in the next six months?\nI hope that Next Year 2016 will improve\nthe present situation.\n\n","date":"December 15, 2015 at 12:40 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216592","author":"piero","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Financiers, demographers, and climatologists have long mastered the science of forecasting based on leading indicators. This (at short term) can be surprisingly easy.\nBut …\n“God hides the end of future time in misty night,/\nAnd laughs if mortal worries at what’s right…”\n[Horace]\n\n","date":"December 15, 2015 at 12:47 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216593","author":"piero","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Perhaps the right phrase, in Latin,\nwas as follows:\n…Prudens futuri temporis exitum\ncaliginosa nocte premit Deus;\nridetque, si mortalis ultra\nfas trepidat. …\n[Quintus Horatius Flaccus] \nLink:\nhttps://archive.org/stream/oxfordbookoflati00garruoft/oxfordbookoflati00garruoft_djvu.txt\nA wise deity shrouds in gloomy night the events of the future, and smiles if a mortal is solicitous beyond the law of his being.\n=> Q. Horatii Flacci Poëmata … Third edition. Edited by J. Boyd (1837) [The British Library]\nOr:\nGod is wise and dives into the deepest night the events of tomorrow and laughs if a deadly anxious escapes where it can not escape.\n— — —\nHere …\nthere is another lapidary phrase\n(to built a sort of “digital sundial”…)\naddressed both to Colin B. and\nto posterity:\nDimidium facti qui coepit habet;\nsapere aude; incipe!\nLink:\nhttps://en.wikiquote.org/wiki/Horace\nHe who has begun has half done.\nDare to be wise; begin!\n— — —\nDan,\nThank you for your work on this blog.\n\n","date":"December 16, 2015 at 11:38 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216658","author":"piero","site":"shroudstory"},{"title":"Thank You, Everyone","post":"piero\nI read Superforecasting a few weeks ago. On page 196 they talk about the problem of groupthink and they tell us that groups that get along too well don’t question assumptions or confront uncomfortable facts. Doesn’t appear to be a problem here.\n\n","date":"December 16, 2015 at 12:45 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216663","author":"John Green","site":"shroudstory"},{"title":"Thank You, Everyone","post":"I apologize if I did not answer before.\nPerhaps we have to build a little monument\nto Dan and his last “experimentum crucis”\n(So… Is Dan Porter similar to Newton, who performed his “crucial prism experiment” ? See also: K. Popper. Link: https://en.wikipedia.org/wiki/Experimentum_crucis)…\nThen, see, f.e., under the address:\nhttp://cubify.com/\nWe have tried to challenge the past groupthink about the Shroud …and … then:\nWhat is that we are really able to obtain (at the end) with this blog?…\nI, strangely enough …\nI’d be tempted to respond to you\nwith a curious digression,\nquoting Israel Zangwill:\n“The goyim refuse us equal rights because\nthey know we’re their superiors.”\n“Ghetto Tragedies”\nIsrael Zangwill\n\n","date":"December 21, 2015 at 12:36 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216968","author":"piero","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Perhaps there has always been a certain amount of violence (…βιαστος, βία, βίαιη) in the relationships of dialogue. Instead meekness (…πραότητα, ήπιος), gentleness, not seem to have had much success in the various communications …\nAm I wrong in my “feebles considerations”?\n\n","date":"December 21, 2015 at 12:53 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216969","author":"piero","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Dear Dan,\nThere is never a good time to say goodbye, so let’s not. Call me at any time for any reason, and thank you, my good friend.\nRay\n\n","date":"December 15, 2015 at 12:13 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216589","author":"Ray Downing","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Hi Dan\nModeration aside, you did some very good work and I think you will do something even better in your church community.\nDon’t forget the needy, in particular, they are the ones who most need our attention. Remember Pope Francis and Archbishop Justin Welby, who are doing their part of the job.\n\n","date":"December 15, 2015 at 12:56 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216595","author":"Louis","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Dear Dr. Dan Porter\nIt’s hard to believe that such a wonderful forum of discussion has come to an end.\nI and my wife Maria da Glória (who is learning Theology and teaching cathechesis in a parish) feel very sad for this great sindonological loss.\nWe hope to have given a small contribution to your blog and we thank also the contrbution from all honest people who commented in this blog.\nOn behalf of Centro Português de Sindonologia I praise your commitment to spreading reliable Shroud knowledge and all persons who seek the truth about the Shroud have a debt of gratitude to you.\nWe have learned a lot from you and your blog and we keep in our archives many posts and comments.\n                                                           warmest regards and God bless you\n                                                       Antero de Frias Moreira\n                                                               and\n                                                      Maria da Glória Gonçalves Barroso\n\n","date":"December 15, 2015 at 2:55 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216602","author":"Antero de Frias Moreira","site":"shroudstory"},{"title":"Thank You, Everyone","post":"I think that 2015 was an important year for the\nfour hundredth anniversary of Galileo’s letter …\n>In February 1615 Galileo Galilei wrote an important\nLetter to Mary Christine of Lorraine, the mother of\nCosimo de’ Medici, the Duke of Tuscany, in the\ncourt of whom Galileo worked as mathematician\nand philosopher.\n>This letter is entirely dedicated to the relationship\nbetween scientific knowledge and biblical exegesis.\n>In those years, the Italian scientist endorsed the\nheliocentric Copernican system which, still\nlacking clearly established physical proofs,\nwas considered by the theological establishment\nas contrary to sacred Scripture’s teachings.\n>Intuiting troubles and misunderstandings\ncoming soon, by this letter Galileo intended\nto gain Madame Christina’s protection\nagainst Roman opponents to heliocentrism.\n>Galileo’s anxiety became reality on March 3,\n1616, when the Holy Office judged heliocentric\nthesis as theologically erroneous and asked\nthe scientist to hold it only “ex suppositione”,\nthat is, as a mathematical resort having\nno necessary relationship with the real\ndevelopment of phenomena. … etc. …\n==>  “To the Most Serene, Grand Duchess Mother”\n“Some years ago, as Your Serene Highness\nwell knows, I discovered in the heavens many\nthings that had not been seen before our own age.\nThe novelty of these things, as well as some\nconsequences which followed from them in\ncontradiction to the physical notions commonly\nheld among academic philosophers, stirred\nup against me no small number of professors—as\nif I had placed these things in the sky with my\nown hands in order to upset nature and\noverturn the sciences. … etc. … etc. …\n>The reason produced for condemning\nthe opinion that the earth moves and the\nsun stands still is that in many places in\nthe Bible one may read that the sun moves\nand the earth stands still. Since the Bible\ncannot err, it follows as a necessary\nconsequence that anyone takes an\nerroneous and heretical position who\nmaintains that the sun is inherently\nmotionless and the earth movable.\n>With regard to this argument, I think\nin the first place that it is very pious to\nsay and prudent to affirm that the holy\nBible can never speak untruth—whenever\nits true meaning is understood. But I believe\nnobody will deny that it is often very abstruse,\nand may say things which are quite different\nfrom what its bare words signify. Hence in\nexpounding the Bible if one were always\nto confine oneself to the unadorned\ngrammatical meaning, one might fall\ninto error. Not only contradictions and\npropositions far from true might thus be\nmade to appear in the Bible, but even\ngrave heresies and follies. … etc. … etc. …\n… etc. … etc. …\nLink:\nhttp://inters.org/Galilei-Madame-Christina-Lorraine\nWhat do you think?\nWhat is your idea about the “STOQ project”\n(= Science, Theology and the Ontological Quest)?\n— — —\nThree days after the beginning of the Jubilee,\nthe day before the feast of Our Lady\nof Guadalupe, on December 11 last,\nthe Lord called to Himself Fr Héctor Guerra LC,\nin Madrid at the age of sixty-two, forty-six\nof which He spent in the service of the Legion of Christ.\nHe, with Father Rafael Pascual LC,\ndirector of the Institute on Religion and\nScience, founded in 2009 “Othonia”, an\ninternational NGO, non-profit organization…\nWere You members of “Othonia”?\n— — —\nSurfing the Web (= Celebrating Galileo, with\nthe moral patronage of the Science and\nFaith – STOQ Foundation and the\nPontifical Council for Culture),\nunder the address:\nhttp://luc.edu/theology/codychairevents2015-2016/\nafter the announcement of\na past interesting\nRound Table:\nFriday, November 20, 2015 from 9:00 a.m. – 12:00 p.m.\nRound Table Discussion and Advanced Graduate Seminar\n“Cosmos, Past and Present: An Interdisciplinary\nDiscussion of Galileo’s Letter to Christina of Lorraine”\nI have found another subject for\na next appointement:\nThursday and Friday, February 18 – 19, 2016\nA Thursday afternoon lecture and a Friday\nmorning seminar / round table discussion\n(tentative title: ‘What Does the “Galileo Thing”\nMean Today?’) with Alice Dreger, PhD,\nauthor of “Galileo’s Middle Finger” …\nThen I have read that:\n>Alice Domurat Dreger is an American bioethicist,\nauthor, and former professor of Clinical Medical\nHumanities and Bioethics at the Feinberg School\nof Medicine, Northwestern University in Chicago, Illinois\nhttps://en.wikipedia.org/wiki/Alice_Dreger\nUnfortunately I see I’m falling\nin another area of research:\n>Galileo’s Middle Finger is a 2015 book\nby Alice Dreger, an American bioethicist\nand author, about the ethics of medical research.\nDreger explores the relationship between\nscience and social justice by discussing a\nnumber of scientific controversies.\nThese include the debates surrounding\nintersex genital surgery,… etc. … etc. …\nhttps://en.wikipedia.org/wiki/Galileo%27s_Middle_Finger\nSo…\nProbably your wife Maria da Glória,\nwho is learning Theology, can help you\nin a better manner…\n\n","date":"December 17, 2015 at 10:44 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216721","author":"piero","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Thank you Dan. I got a lot of information about the Shroud from your site.\n\n","date":"December 15, 2015 at 3:36 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216605","author":"Sampath Fernando","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Great job Dan, and good luck in the future. \nRuss do I hear that you’ll be picking up Dans blog?\n\n","date":"December 15, 2015 at 3:44 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216606","author":"Giorgio HSG","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Dan, \nThank you for your work on this blog. At least a few good ideas and references came out of it for me. Lots of chaotic discussions, but this is part of the media. One needs to live with it.\nAt some point, moving on is necessary. Enjoy the new crowd of your local community. \nHappy Holidays!\n\n","date":"December 15, 2015 at 4:02 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216607","author":"Mario Latendresse","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Dan, you did an amazing job with this blog and we were blessed with your commitment.   I know many of us will suffer withdrawal…\n\n","date":"December 15, 2015 at 4:10 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216609","author":"Randy Schreiner","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Dear Dan, \n   I liked you on the History Channel with Ray Downing…  Maybe there is some way that I would be able to help you continue… I think you are a valued presence. Thank you for hosting The Ray Downing and The Barrie Schwartz. I hope that you continue it would be sad to see you go. I beleive The Shroud is Jesus’s The Messiah, I hold that it is obvious… Just by seeing it…. \nThank you and G-d bless you, \nJoshua \nOn Tue, Dec 15, 2015 at 6:44 AM, Shroud of Turin Blog  wrote: \n> Dan posted: “This is my last posting. I’m retiring from blogging. I need > to. It’s time to move on. I’m now more involved in the community where I > live and I want to become more active in the church. I’ll let commenting > continue for a few days and then shut down comm” Respond to this post by > replying above this line > New post on *Shroud of Turin Blog* >  Thank You, Everyone >  by Dan >  > > [image: image] > This is my > last posting. I’m retiring from blogging. I need to. It’s time to move on. > I’m now more involved in the community where I live and I want to become > more active in the church. > > I’ll let commenting continue for a few days and then shut down comments > for good by years’ end. I’ll keep the blog up for future research and > reading. > > Thank you, everyone! > > If you want to take over in some way, write to me and we’ll try to figure > out something. > —————————— > > [image: image] > I started > this experiment seven years ago with the hope of beginning an ongoing > conversation about any and all topics related to the shroud. The slow pace > of papers and the length of time between conferences, very much the > time-tested way, was too slow for my temperament. There was the Shroud > Science Group conducting discussions in private by email. I enjoyed that. > But its membership was restricted. It reminded me of the proverbial > boy-hood tree house with the sign that read, “No Girls Allowed.” > > Maybe that’s unfair: You had to be nominated. You had to be invited. No > one was ever turned away although a couple of people were eventually kicked > out of the group for email misbehaving. If there had been a sign and > someplace to hang it, it would have read, “No Skeptics Allowed.” At least, > it felt that way. > > Skepticism is the healthiest of attitudes with all things having to do > with religion. I believed that. For instance, a Christian should never fear > new discoveries in science and history. There can be no better test of the > strength and truth of one’s faith than to face the questions posed by new > views of reality. > > We needed to be tempted, not by going into the desert but into the > jostling crowd. It took a long time. Thank, God, for Colin Berry and all > the others. > > At first I didn’t do blogging correctly and this blog didn’t catch on. > Eventually, I learned to say less and encouraged others to become the > center of the discussion, something I’m not good at. In doing so I created > an opportunity to learn a lot from skeptics and non-skeptics alike. I hope > this has been true for others because this blog was never intended for my > benefit alone. > > This blog has exceeded all my expectations. Lately, I have been posting > almost every day, sometimes two or three times a day. Comments pour in. > They are good comments, not those meaningless short comments you see in so > many blogs. There has been a lot of constructive discussion. > > In looking back over seven years, I realize that my overall views on the > shroud have not changed significantly. You’ll note that in the right hand > column of every page, I say, “The Shroud of Turin may be the real burial > cloth of Jesus.” I used to say it *probably is* instead of *may be*. I > still gut-think it is probably authentic but in all honesty I can’t defend > the word *probably* with real-world science and objective history. > > Belief is a less cautious word than knowing. I can say with more honesty > that from all the evidence discussed here, with everyone’s input > considered, I believe the shroud is indeed authentic. But I can’t say I > know it. > > As I leave blogging about the shroud, I want to leave a few thoughts > behind. This is today’s list. I may awake to a new list tomorrow but I > won’t go back and change it. I’m really out of here. > > *On Overwhelming Evidence:* From time to time, people have tried to > convince me that the evidence in favor of authenticity is overwhelming. > Similarly, others have tried to convince me that the evidence against > authenticity – particularly the carbon dating – is overwhelming. No, it is > not. It is underwhelming. That is why this blog has over 4000 postings with > a total of more than 46,000 comments. That is why this blog has accumulated > 3.3 million page views. That is why 790 people subscribe to receive email > copies of every posting. > > *Redo the Carbon Dating: *Of course. > > *On Seeing Things on the Shroud:* I don’t think there are any images of > ancient coins, plants, teeth or written messages in Greek, Latin or Hebrew; > all these are wishful misperceptions or pareidolia. See: *I Don’t See > Flowers and Coins and Teeth on the Shroud of Turin* >  > > *On 3D Encoding:* I think the ability to plot a 3D representation of the > body from the image of a man on the shroud with tools like the VP8 Image > Analyzer or ImageJ is a valid image characteristic. However, I don’t think > that the data – essentially greyscale values of the image – necessarily > represents cloth to body distance. To think so requires the assumption that > the shroud covered the body. It probably did if the cloth is authentic, but > we are not there yet. Nonetheless, I’ve listened to others preposterously > trying to prove the authenticity of the cloth from the facts and > measurements derived from this assumption. > > Moreover, it is often said that it is impossible to plot 3D informati\n\n","date":"December 15, 2015 at 4:20 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216612","author":"joshua8b2015","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Dan, Thank you for all your effort keeping this blog running and may God bless your Future projects.\n\n","date":"December 15, 2015 at 6:00 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216616","author":"MikeM","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Sad! Although I tend to think recent discussions have kind of reached a stalemate position.\nThanks so much for your efforts Dan. I’ll miss it.\nGod Bless and Merry Christmas, from Down Under.\n\n","date":"December 15, 2015 at 6:22 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216617","author":"Thomas","site":"shroudstory"},{"title":"Thank You, Everyone","post":"this was the first place I came to when I signed in….dan it won’t be the same without you…wish you could still be involved but spend less of your time on the blog……\n\n","date":"December 15, 2015 at 6:52 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216619","author":"rick","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Dear Dan, your blog has always challenged us ‘authenticists” to work harder to provide better arguments and better research.  That has been a very important contribution. Someone in a comment above stated that we have kind of reached a stalemate.  That is true of course.  If the Shroud is authentic then one might ask why has it remained such an enigma?  Why wouldn’t providence simply make it absolutely clear?  It didn’t and it probably won’t. Maybe the Shroud is just a knock at the door. Is it a sign? The answer appears to be “you decide.”  \nFor our generation you have done as well as any to promote the discussion.  You are to be saluted.  Thank you. God bless you.\nBob Siefker\nTurin Shroud Center of Colorado\n\n","date":"December 16, 2015 at 1:35 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216631","author":"Robert W. Siefker","site":"shroudstory"},{"title":"Thank You, Everyone","post":"I haven’t entered all that many comments into this blog, but I enjoyed reading this blog, and looking at all the comments. I certainly did learn plenty. I’m an ordinary high schooler who is utterly fascinated by the Turin Shroud, and this blog did not decrease that fascination it only increased it. Hope someone keeps this blog alive.\nMatt L.\n\n","date":"December 16, 2015 at 2:17 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216634","author":"Matthew L","site":"shroudstory"},{"title":"Thank You, Everyone","post":"“As you set out for Ithaka\nhope the voyage is a long one,\nfull of adventure, full of discovery.\nLaistrygonians and Cyclops,\nangry Poseidon—don’t be afraid of them:\nyou’ll never find things like that on your way\nas long as you keep your thoughts raised high,\nas long as a rare excitement\nstirs your spirit and your body.\nLaistrygonians and Cyclops,\nwild Poseidon—you won’t encounter them\nunless you bring them along inside your soul,\nunless your soul sets them up in front of you.\nHope the voyage is a long one.”\nBut here it will be a big hole for that we care about the shroud.\n\n","date":"December 16, 2015 at 2:45 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216635","author":"David Mo","site":"shroudstory"},{"title":"Thank You, Everyone","post":"But here it will be a big hole for those who care about the shroud.\n(Oh my God! I make spelling mistakes even in my farewell!)\n\n","date":"December 16, 2015 at 2:50 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216637","author":"David Mo","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Bye Dan. Thank you for all your efforts. Your custodianship and friendly scepticism of both sides of the “Shroud Story” has been very welcome – and very needed.\n\n","date":"December 16, 2015 at 4:32 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216640","author":"Adam Crowl","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Dan,\nThanks for your hard work.  Take care\n\n","date":"December 16, 2015 at 7:53 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216644","author":"Kelly Kearse","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Thanks for the blog, Dan.\n\n","date":"December 16, 2015 at 8:15 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216645","author":"Dcn Andy","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Well, Dan I guess you must have got the message by now. This forum, along with your cheerful twisted grin above it, will be much missed.\n\n","date":"December 16, 2015 at 9:43 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216651","author":"David Rolfe","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Thanks, Dan, for running a very interesting blog.  I learned some things, found other points to be off the mark, and still others to be way off.  But it was also interesting and informative and I, for one, will miss it.  Best of luck to you!\n\n","date":"December 16, 2015 at 10:53 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216654","author":"Jim Carney","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Thank Dan for running this blog. A lot of interesting people and interesting worldview. All things end, but the debate will go on even if they do new testing, Some will find problems with it, heck I couldn’t get some people to understand the earth is old than 10,000 years.\n I remember reading this once,\nTo every thing there is a season, and a time to every purpose under the heaven:   \nMaybe this season is over for now.\n\n","date":"December 16, 2015 at 11:19 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216656","author":"John Green","site":"shroudstory"},{"title":"Thank You, Everyone","post":"I’m sad, because this blog has been part of my daily routine for a few years, and I loved being able to keep up with news on the Shroud on a regular basis. Thank you, Dan, and God bless!\n\n","date":"December 16, 2015 at 1:33 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216666","author":"Larry","site":"shroudstory"},{"title":"Thank You, Everyone","post":"You’ve accomplished a lot here, Dan. I hope you find somebody or a group of people to take over the blog for you. Even if you don’t, the archives should help a lot of people for many years to come, as you’ve already helped so many people, including me. Your work has been significant and appreciated.\nI also appreciate what the commenters here have offered. I’m indebted to all of you.\n\n","date":"December 16, 2015 at 8:27 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216689","author":"Jason Engwer","site":"shroudstory"},{"title":"Thank You, Everyone","post":"I am discombobulated, and my days are ruined!  No, not really.  But there never has been, and I think never will be, another web-site to match Dan Porter’s shroudstory blog site.  But nothing stays the same, and everything changes.  So I suppose I can now attend to that long list of “things to be done” compiled by the other long-tolerant member of my household. \nIt has been a wonderful experience meeting you all on-line, even when our views were completely different.  The tragic loss for me is that I’m unlikely to meet you all again, except by happen-stance.  \nHere at the other end of the world, there seems to be little interest in the Shroud of Christ.  Even during the exposition earlier this year, there was scarcely a mention of it in the Catholic News media, and I note that even CathNews NZ has only a few token news items about it on its web-site.  I ought to have written something about it for them, but I didn’t.  I did run a few well-attended lectures about the Shroud for my U3A group,  Perhaps with the extra free time now available, I can develop that into something more. \nGod seems seldom to intrude into human affairs, but treats us all as free spirits.  This was the way that Dan Porter ran his blog, seldom intruding, no heavy-handed moderating, nor imposing his own particular perspective, but leaving us free to exchange our views, no matter how well or how badly informed we might have been.  There was always someone else only too ready to correct us, contradict or lampoon even, no matter that they themselves were right or wrong. \nAs a child, I recall my Nana had a small icon of the Shroud facial image, and sometimes I came across the occasional popular magazine article.  My first real education on the Shroud began in 1960 with a presentation, likely based on Barbet’s work and given by our University Dominican chaplain,to a roomful of sceptical engineering students, but it impressed a few of us at the time.  Much of the content has since been debated on this site, and will now persist in being argued elsewhere.  I purchased Ian Wilson’s 1970 book, and learnt a great deal more about it.  \nI found Dan’s site I think in 2011, and convinced by Wilson that the Shroud was the Mandylion, blogged accordingly.  My views have since changed and I now think it was something else, perhaps the Image of Camuliana, the Image of God Incarnate.  The pollen debate has been disconcerting but still an adequate argument.  \nI continue to be persuaded that the Shroud is the authentic burial cloth of Jesus of Nazareth.  No-one in medieval times had the anatomical knowledge to persuade 20th century pathologists that it was nothing else, perfection of Greek statuary notwithstanding, and the historic clues prior to Lirey are adequate or at least suggestive.  The Jerusalem aragonite limestone on the feet is persuasive, and the image is a close match with the gospel accounts of the crucifixion.   \nThe cause of the Image continues to be enigmatic, but I suspect not necessarily a divine mystery.  It took Colin Berry some four years of experimenting before he persuaded himself that he might have found some kind of an answer, but if it was a medieval artisan, then we don’t know who it was, and he left no trace of what must have been several failures before he struck gold.  And he never ever did it again.  \nSome thoughts on professionals and amateurs.  The patriarch Abraham began as a herdsman, Jesus as some kind of woodworker;  the followers he chose were ordinary common folk, fishermen mainly, and Paul was a tent-maker, hardly prepossessing material for a major religious movement which now pervades the globe.  \nThe mathematics of Pythagoras remain as true as they ever were.  But in the other sciences, what was heresy yesterday is tomorrow’s dogma, and what was dogma is now heresy.  Similarly history, always written by pro tem victors, is persistently rewritten.  The Renaissance men knew nothing of such specialisation but sought an all-round general education and comprehensive world-experience, and it is they I have sought to emulate. \nI shall miss you all.  Thank you so much for being a significant part of my life.  I shall turn 77 this Christmas, with some aches and pains and hearing loss, but some adequate mental faculties still mercifully remain.  Where’s that list of outstanding chores, too long neglected? \nBlessings to you all. \nDavid Belz, Tawa, Wellington, New Zealand\n\n","date":"December 16, 2015 at 10:26 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216692","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Thank You, Everyone","post":"DaveB\nYes, Happy Birthday. \nYou know when I was in first grade and saw a globe with NZ at the lower end I wondered why people didn’t fall off the earth. I look back and have to laugh now how foolish that was. It’s very clear now, they wear gravity boots!\n\n","date":"December 17, 2015 at 9:57 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216717","author":"John Green","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Have a wonderful Christmas, birthday, and new year(s), DaveB.  Of all the comments on this site, yours were the ones I most valued–and Louis’, too.  Colin Berry’s often silly musings (my opinion), such as his recent “ransom” theory, were a good counterpoint to the ones I took seriously and a good test for a temperament that runs to the impatient.  As for the Shroud’s authenticity, it seems overwhelmingly clear that it is genuine.  That arguments are many and well-known but a basic starting point is the fact that it is a perfect photographic negative.  Hardly something that could have been created by a medieval artist when photography, much less negatives, were unknown.\n\n","date":"December 18, 2015 at 8:15 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216820","author":"Jim Carney","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Hi Jim\nThanks for the comments, which I noticed only now. I have gone through the material on the site you indicated and can understand your point of view. I was brought up to think in similat terms, however I fear things have changed to such an extent that a lot of rethinking will be required if we are to understand what faith can mean today.\nAfter years of writing and conducting interviews in the field of New Testament studies and archaeology a decision was taken to go further back and explore Old Testament archaeology, prompted by the scepticism that has been promoted by atheists and scientists who indulge in scientism.\nOne result:\nhttps://www.academia.edu/18994343/The_key_role_of_Biblical_Archaeology_in_Exegesis_An_Interview_with_Professor_Israel_Finkelstein\nThere is really nothing to fear, it is not the end of faith, as Sam Harris would have it. Just some fine tuning will be needed and we in the 21st century can do this easily,\nI wish you a blessed Christmas.\n\n","date":"December 19, 2015 at 8:02 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216878","author":"Louis","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Happy Birthday David\n\n","date":"December 17, 2015 at 8:10 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216714","author":"Giorgio HSG","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Today, December 17th, Pope Francis\ncelebrates his 79th birthday.\nBirthday wishes are coming from all over the world…\nYesterday, at the end of the general audience\nin St Peter’s Square, the devotees sang\n“Happy Birthday”, and a Mexican journalist\ngave the Holy Father a special sombrero-shaped\ncake from the people of Mexico who\nwill be waiting for him next February…\n\n","date":"December 17, 2015 at 12:30 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216726","author":"piero","site":"shroudstory"},{"title":"Thank You, Everyone","post":"“I’ll let commenting continue for a few days and then shut down comments for good by years’ end. I’ll keep the blog up for future research and reading.”\nCould you clarify please Dan? What will be visible post-Apocalypse? Your postings and the legacy comments they attracted, or just the postings?\n\n","date":"December 17, 2015 at 8:48 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216715","author":"Colin Berry","site":"shroudstory"},{"title":"Thank You, Everyone","post":"All postings and all comments associated with them will remain. The only reason I’m shutting down the ability to add additional comments after the end of this year is because of the time involved and the problems with moderating them.  I hope that answers your question.\n\n","date":"December 17, 2015 at 10:07 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216718","author":"Dan","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Thank you Dan. I didn’t seriously imagine you would stop comments this side of Christmas, and then wipe the whole lot on New Year’s Eve, a possible interpretation of your action plan, aka pessimist’s worst case scenario, but just needed to be sure.\n\n","date":"December 17, 2015 at 10:21 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216720","author":"Colin Berry","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Hi Colin,\n                    Shroudstory will soon be dormant, maybe that you could consider taking over with your own blog.\n\n","date":"December 18, 2015 at 6:02 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216780","author":"PHPL","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Thanks for the vote of confidence, PHPL. But there are two problems. First, my blog does not have the upmarket software of this one, and I’ve no experience of hosting a forum site. More importantly, I’d be far too partisan, wanting constantly to mix it below the line, and probably being far too quick to show the red card to miscreants bar one (myself).\nFolk are of course free to use my site as a kind of methadone maintenance therapy if or when suffering acute withdrawal symptoms, but as I say, it’s really a very modest affair, mainly personal research-oriented.\nI tried my latest idea on a VIP this morning – the notion that the Shroud  was commissioned to serve as a standby alternative to cash to pay part or all of a King’s ransom in the event of capture by the enemy.  Alternatively, Geoffroi de Charny, himself having been captured and held to ransom in Brittany (see wiki) may have intended it for his own fully comp insurance policy. But I reckon it took a lot of expensive trial-and-error R&D to get the Shroud looking so authentic, and that probably needed asubstantial input of funds from King John himself, probably coinciding with the founding of the Order of the Star one year after his 1350 coronation.\nThe first hurdle of approval has been successfully surmounted – Mrs.Berry approves of my latest thinking.\n\n","date":"December 18, 2015 at 6:22 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216782","author":"Colin Berry","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Wow Dan, I feel a bit like the rest of the folks here, at the same time utterly grateful that you’ve provided this wonderful service for the past 7 years, yet a bit shocked and saddened by the idea that you are leaving it behind! I appreciate the thought you’ve put into your last post as well. I’m not sure what the rest of us will do now, I would urge you to consider allowing somebody to keep the website going, as the value of the commenting section is quite incredible – but I myself would be nowhere near qualified to moderate. I’d be happy to host the site though, as well as help preserve/and or convert the data if need be. I’ll contact you privately about that. God Bless you in all of your new endeavors – you will be greatly missed!\n\n","date":"December 17, 2015 at 12:58 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216729","author":"staceyreiman","site":"shroudstory"},{"title":"Thank You, Everyone","post":"If you google APOD: 2014 May 28 – The Cone Nebula from Hubble, does it look like the Romans would stop at nothing to humiliate anyone who would claim to be a king?\n\n","date":"December 17, 2015 at 1:26 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216730","author":"nag","site":"shroudstory"},{"title":"Thank You, Everyone","post":"This blog having closed, the following information is just too late for Dan to post it (although I bet he’s tempted). At the Shroud Science Group Giulio Fanti has just publicised the publication of the papers presented at a workshop on the Shroud at Padua University last June. Here is his post:\n“Dear all,\nI am happy to inform you that you can read at the link reported above the results of WOPSAS a Paduan Workshop made last June at my University about the results on the TS obtained from an University Research Project.\nJesus Christ has made this present to me: the presentation of the TS papers just before Christmas and I publicly thank Him!\nAlso my thanks to the Rector of my University Prof. Giuseppe Zaccaria who paid the publication of these papers.\n[There follow links to all the papers.]\nHave a good reading!\nI take the occasion to wish all of you Holy Christmas!\nGiulio\nP.S. to Dan: you are allowed to copy this message in your blog.”\nI won’t post all the links here; the papers can be found at:\nhttp://www.matec-conferences.org/articles/matecconf/abs/2015/17/contents/contents.html\nAnd for what it’s worth, the next BSTS Newsletter, which will be posted by Barrie at shroud.com in the new year, contains an actual, recent example of ‘invisible mending’, and the results of an experiment involving the dropping of an iron plate at 1000°C on 32 layers of folded linen cloth.\n(I’ve also posted this on “Why didn’t I think of that?” which is still being commented on.)\n\n","date":"December 18, 2015 at 5:59 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216779","author":"Hugh Farey","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Hi Hugh,\n                I enjoy reading your comments. Are there any other websites where you post comments (and not only related to the Shroud). I like to read what intelligent people write.\n\n","date":"December 18, 2015 at 6:12 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216781","author":"PHPL","site":"shroudstory"},{"title":"Thank You, Everyone","post":"I don’t contribute to anything regularly at the moment, PHPL, although I keep a watching brief on various things. Another possible Shroud forum could be at Catholic Answers (http://forums.catholic.com), but they have started dozens of Shroud threads in the past, mostly of the ‘yes-it-is, no-it-isn’t’ kind, and as usual, minimal research, which fairly quickly peter out.\n\n","date":"December 18, 2015 at 9:38 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216789","author":"Hugh Farey","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Thanks Hugh!!!\nI knew nothing of that past meeting\nheld in Padua in June 2015…\nIn order to improve the study made\nby Adrie van der Hoeven about the\npresumed “Madder-Heme lake”,\nit would be interesting to read\n(at least) the intervention by\nIng. Gabriele Bedon, CRIS:\n“Analisi colorimetrica delle macchie di sangue”\n(= Colorimetric analysis of bloodstains.)\nThe same can said about the “ATR-FTIR calibration”\n(… etc. …) and the intervention by Prof. Pietro Baraldi\n(UniMoRe):\n“Datazione opto-chimica della Sindone”\n(= Opto-chemical dating of the Shroud)…\n\n","date":"December 18, 2015 at 11:09 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216794","author":"piero","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Just now I have found the paper titled:\n“Study of the Bloodstains in the Shroud of Turin: Chromatic\nAnalysis and Possible Interpretation”\nGabriele Bedon, Matteo Linguanotto, Ivan Simionato, and Francesco Zara\nI never hear the acronym KMC in the field of Colorimetry…\n[the Kline-McClintock (KMC) formula is connected to the Kline & McClintock method, that is a useful tool for uncertainty analysis. Kline & McClintock (1953) defined uncertainty as “A possible value the error might\nhave” and this is the definition we still work with today. ].\nInstead I remember the CMC formula…\n>CMC l:c\n>In 1984 the CMC (Colour Measurement Committee of the Society of Dyes and Colourists of Great Britain) developed and adopted an equation based on LCH numbers. Intended for the textiles industry, CMC l:c allows the setting of lightness (l) and chroma (c) factors. As the eye is more sensitive to chroma, the default ratio for l:c is 2:1 allowing for 2x the difference in lightness than chroma (numbers). There is also a ‘commercial factor’ (cf) which allows an overall varying of the size of the tolerance region according to accuracy requirements. A cf=1.0 means that a delta-E CMC value When several independent variables (X’s) are used in calculating the Result, R, the individual terms are combined by a root-sum-square method (Method due to Kline and McClintock (1953)) \nSource:\nhttp://antipasto.union.edu/~andersoa/mer331/Week1_UncertaintyAnalysis.pptx\n\n","date":"December 18, 2015 at 12:24 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216798","author":"piero","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Someone has distorted and crippled my communication!\nHere the omitted text:\nBut, eliminated the possible trivial source of confusion,\nthat is the acronym KMC (versus the useful acronym CMC) we still have to do quite a lot of work …\nI am very curious to observe the differences in color arising from experiments with linen fabrics treated with madder or left as they are (and then stained with blood … and finally suitably aged), this must always be seen with reference to colorimetry the shroud.\n— — —\n>When several independent variables (X’s) are used in calculating the Result, R, the individual terms are combined by a root-sum-square method (Method due to Kline and McClintock (1953)) \nSource:\nhttp://antipasto.union.edu/~andersoa/mer331/Week1_UncertaintyAnalysis.pptx\n\n","date":"December 18, 2015 at 12:27 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216799","author":"piero","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Here the words about\nthe CMC formula…\n>CMC l:c\n>In 1984 the CMC (Colour Measurement Committee of the Society of Dyes and Colourists of Great Britain) developed and adopted an equation based on LCH numbers. Intended for the textiles industry, CMC l:c allows the setting of lightness (l) and chroma (c) factors. As the eye is more sensitive to chroma, the default ratio for l:c is 2:1 allowing for 2x the difference in lightness than chroma (numbers). There is also a ‘commercial factor’ (cf) which allows an overall varying of the size of the tolerance region according to accuracy requirements. A cf=1.0 means that a delta-E CMC value <1.0 is acceptable. \nLink:\nhttp://www.colorwiki.com/wiki/Delta_E:_The_Color_Difference\n\n","date":"December 18, 2015 at 12:29 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216800","author":"piero","site":"shroudstory"},{"title":"Thank You, Everyone","post":"I think these annoying “little disturbances” to messages (that I have previously sent) have no serious influence about the comprehension of the problem about the unsolved color measurement (thus: regarding the color of bloodstains, with and without treatment based on madder…).\n\n","date":"December 18, 2015 at 12:38 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216803","author":"piero","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Adrie van der Hoeven indicated (as reference)\nthe following address:\nhttp://www.haltadefinizione.com/it/la-sindone\nSo…\nWe have to continue to work in the field\nof Colorimetry…\nHave you tried?\n\n","date":"December 18, 2015 at 12:52 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216807","author":"piero","site":"shroudstory"},{"title":"Thank You, Everyone","post":"I beg your pardon.\nI should have behaved better on this blog…\nI am not completely sure of what\nAdrie van der Hoeven wrote [in particular about (met)hemoglobin…].\nFor example at p. 713 of tthe paper I have read something that doesn’t convince myself about the acid ferric heme and presumed pinkish red color because this color can be obtained with ferrous iron (Fe 2+) and not with ferric iron (Fe 3+)…\nIn other words:\nwith ferrous iron = deep violet,\nwith ferric iron = brownish black\nReference:\n“Chemistry of Colour”\nM. Satake, Y. Mido\nDiscovery Publishing House, 1995\nSee at page 133\nThis book deals with all aspects of\nthe Chemistry of colour…\nInstead, for what concerns the careful Colorimetric Analyses and the possible experiments (with blood stains on linen fabric treated and untreated) the discussion to do would be even longer … \n…\n\n","date":"December 20, 2015 at 8:58 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216894","author":"piero","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Errata corrige:\n>For example at p. 713 of the paper I have read\nthere is something that doesn’t convince myself regarding the claims by A.v.d.H. on “acid ferric heme” and presumed pinkish red color…\nInstead of:\n>For example at p. 713 of tthe paper I have read something that doesn’t convince myself about the acid ferric heme and presumed pinkish red color…\n\n","date":"December 20, 2015 at 9:05 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216895","author":"piero","site":"shroudstory"},{"title":"Thank You, Everyone","post":"The title of an old AFM study was as follows:\n“Structural analysis of red blood cell membrane\nwith an atomic force microscope.”\nYamashina S, Katsumata O.\nLink:\nhttp://www.ncbi.nlm.nih.gov/pubmed/11108033\nI think that you could consider to use the AFM\nto improve the control of what happens with\nlinen treated with madder and then stained with blood.\nSee also what happens in the experiments of Giovanna De Liso with the use of madder …\n\n","date":"December 21, 2015 at 12:58 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216970","author":"piero","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Being relatively hot from the press, albeit after a lengthy gestation period, I couldn’t resist the temptation to flag up a new idea re the reasons for the TS appearing in history when it did, i.e. to meet a medieval era French king or maybe knight’s ransom if captured in battle. But this is no longer the time nor place to develop it further, far less to defend it against the inevitable criticism it will attract. Dan has decided to wind up the site, and graciously given us a few days in which to complete outstanding business. I respect his decision and courtesy, so shall now draw a line under my personal shroudstory experience. \nI currently have not just one but two postings in preparation for my own site, link below. The first is the final part 3 of my fluorescence project. The second is a fuller exposition than provided here of the King John II (The Good) /Geoffroi de Charny shroud-as-insurance policy hunch that will have to depend for now at any rate on extensive cut-and-paste from wikipedia.\nBest wishes for the future to everyone reading this, Dan especially, and a Merry Christmas and Happy New Year to all who have contributed to this site, past and present.\nThere is but one word left to say, and appropriately enough it is French. Adieu!\nhttps://shroudofturinwithoutallthehype.wordpress.com/\n\n","date":"December 18, 2015 at 10:43 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216793","author":"Colin Berry","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Merry Christmas and Happy New Year to you, as well, Colin.\nFor all the posters on this forum, I leave you with the following:\nThe Christmas Angel\nBy Me\nAs snowfall paints\nthe Christmas scene this eve\nand burning embers in the fireplace fade\nto cast the faintest glow\nupon the room\nwhich shines upon our weighted\nChristmas tree\nof antiqued ornaments\nand candy canes\nred garland\nand a hanging carousel\nmy eyes seek out the top\nthe highest peak\nand I find solace, peace, contentment there\nin an angel whose flowing satin gown\nholds pearls which hang from loops\nof golden thread.\nAnd at her back are spread\ntwo gilded wings\ntranquility to still the raging heart\nI see the ray of hope shine in her face\nand in her eyes I see my birth, my death.\nYet I contented, knowing she stands guard,\ngaze nightfall from a frosted window pane\nto find the star of peace there in the sky\nand whisper gently as I watch you sleep.\n“May the Christmas angel light your path,\nand grant you what you dared only to dream\nBest always,\n\n","date":"December 23, 2015 at 12:41 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217123","author":"Angel","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Thank you Angel, and a Merry Christmas to you from the ghost of Colin past (apologies to Dickens’  seasonal ‘Christmas Carol’).\nTodays’ iconoclastic, well, ‘relicoclastic’ posting \nhttps://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/\nYup. Just like Pope Francis, some of us distinguish between an icon and a relic, especially as Hugh Farey has intimated how it was done with that now-you-see-it-now-you-don’t wooden statue placed on the Lirey Shroud INITIALLY as a “liturgical illustration”. The person who hit on the idea of removing the statue, while leaving the Shroud, has a lot to answer for – some 6 centuries of more of continuing controversy (and deep fascination).\n\n","date":"December 23, 2015 at 1:03 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217126","author":"Colin Berry","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Colin, although your analysis is precise, with reference to food for thought, what I fail to comprehend is a quote by Ashley Demarco (below) that negates any type of forgery theory, whether it be a painting or a scorch.\nQuote from link:  “The hair of the man on the Shroud is another notable feature, one which a forger would not have imagined, for it was not the traditional idea. On the Shroud, the man’s hair is tied in a ponytail in the back of his head. This is a feature of Christ that was not imagined in the Middle Ages.”\nhttp://shroud2000.com/AshleyDemarco.htm\nAnd, it is fact, the ponytale was the hairstyle for Jewish males in the first century.\nPS.  Have you ever considered writing a murder mystery or applying for part-time employment with Scotland Yard?   Wouldn’t it be nice to take up residence at 221B Baker St.?   :)\n\n","date":"December 24, 2015 at 2:52 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217164","author":"Angel","site":"shroudstory"},{"title":"Thank You, Everyone","post":"I’ve responded to your point re the supposed ‘ponytail’ as a comment on my own site, Angel. See my contrast-restored screen grab from Shroud Scope:\nhttps://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/#comment-6590","date":"December 24, 2015 at 3:49 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217166","author":"Colin Berry","site":"shroudstory"},{"title":"Thank You, Everyone","post":"I don’t know whoever was the first to dream up the idea of the ponytail. The early depictions of the Shroud, without any exception that I know of, show the hair falling fully back across the neck. What we have is the result of deterioration of the original image which could possibly be interpreted as a pony tail but only by someone who had never studied the original depictions we have of the Shroud.\n\n","date":"December 24, 2015 at 4:40 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217169","author":"Charles Freeman","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Windows performed a maintenance update just as I was posting and the closing quote in the sentence was deleted.\nThe line should read, “May the Christmas angel light your path,\nand grant you what you dared only to dream.”\nHope all of you have a wonderful and blessed holiday season.\nMay the force (that permeates the Shroud) awaken you.     :)\n\n","date":"December 23, 2015 at 1:07 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217127","author":"Angel","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Thank you for all your years of ShroudStory blogging, Dan.  It was and always will be an excellent site and I agree with virtually all you write – except one little thing I noticed in your posts, and which I hesitated to talk about in this comment (hope you don’t mind) but here goes, for whatever it’s worth.  I first heard of the Shroud almost 40 yrs ago but didn’t start to read as much as I could about it until 1999 or so (and I went to the Dallas symposium).  Around the same time, I also began to study – and I know this sounds to some that I wear a tin foil hat – crop circles.  I tried to keep these two interests of mine separate, but the more I researched crop circles, the more I could not dismiss them all as man-made, in the same way I cannot dismiss the Shroud as the possible burial cloth of Christ.  I have been in crop circles in the UK and here in Canada; I could go on about how many Canadian formations were inadvertently discovered by crop dusting pilots and/or farmers in vast prairie fields (with no tramlines and therefore no entrance pathways) or how I’ve personally visited ones in Ontario that were only reported to me the night before, never received media attention and where I found no evidence of ‘planking or pranking’.   Rather than get into a debate I’ll refer any interested reader to the Burke, Levengood, Talbott website (bltresearch.com) for more detailed information and there are many other resources, like temporarytemples.co.uk or cropcircleconnector.com too.  When I visited Turin, to personally view the Shroud in 2010.  I’m Catholic and did all the usual prayers but I also asked, ‘does this have something to do with crop circles’ and ‘why hasn’t there been a Shroud crop circle?’.  And then there was one.  It may very well be man-made but when you’ve studied them as much as I have, you realize there’s the possibility – a very strong one actually – that it isn’t.  It’s mind-boggling and something I don’t think one should close his or her mind to (in much the same way many do about the Shroud).  Two physical, tangible enigmas that are often ignored or discredited in the media.  Thanks again for your blog and Merry Christmas & Happy New Year!\n\n","date":"December 18, 2015 at 12:31 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216801","author":"Joanna","site":"shroudstory"},{"title":"Thank You, Everyone","post":"I become quite nervous when I read\nstrange claims about crop circles …\nIn fact I believe that these crop circles are\nhoaxes organized by artists well-skilled.\nObviously I can not be certain for this origin\nof crop circles to 100 percent, but I think\nthe odds are very very high…\n\n","date":"December 20, 2015 at 9:09 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216896","author":"piero","site":"shroudstory"},{"title":"Thank You, Everyone","post":"I would like to remember that:\n>The creative power of God is free, unlimited and certainly superior to human rationality. It is therefore not possible to exclude or not to accept the possibility that there may be other forms of life in the universe for which, like us, God has set the rules and limits. All this does not absolutely contradict Christian theology that sees in Jesus Christ the only creator and redeemer of the universe according to which everything exists and has been created… \n… and in any case you must be very careful to possible\nneopagan phenomena …\nAlso you have to think …:\n> One thing is to consider the possibility of extra-terrestrial life and its study on technical and scientific (UFO) and another problem are UFOs and all the phenomena that gravitate around them including the spiritual movements led by strange persons (here an example: Giorgio Bongiovanni) and pseudo-gurus…\nLinks:\nhttp://en.giorgiobongiovanni.org/history/biography/first-part.html\nhttp://en.giorgiobongiovanni.org/heavenly-messages/2015/3736-extraterrestrial-aviation-is-present-and-operating.html\nhttp://en.giorgiobongiovanni.org/some-news/ufo-and-irrefutable-evidence/3469-fidel-castro-spacecraft-at-a-russian-base.html\n\n","date":"December 22, 2015 at 12:02 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217058","author":"piero","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Errata corrige:\n> One thing is to consider the possibility of extra-terrestrial life and its study on technical and scientific basis and another problem are UFOs …\nInstead of:\n> One thing is to consider the possibility of extra-terrestrial life and its study on technical and scientific (UFO) and another problem are UFOs …\n— — —\n>… Due to its role as a development site for new technology, Kapustin Yar is also the site of numerous Soviet-era UFO sightings and has been called “Russia’s Roswell”.\nLink:\nhttps://en.wikipedia.org/wiki/Kapustin_Yar\n>Kapustin Yar was the former Soviet Union’s most sensitive air base, even exceeding America’s Area 51 for the levels of secrecy that shrouded it. UFO Files claimed that it was to present never-before-seen footage of the base, reconnaissance photos and even a virtual tour of its hidden depths.\n>Kapustin Yar was created as the site for the development of the Soviet Union’s space program after the end of World War II. It lies over 500 miles south of Moscow and about 60 miles east of Volgograd, the former Stalingrad. These days it lies close to the Kazakhstan border, but back in those days, the base was deep inside Soviet territory. It was here that captured V2 rockets and the German scientists that created them were set to work with not only the single task of getting into space before the Americans, but also designing and testing new aircraft, missiles and other weapons systems. The base was deemed so secret that the nearby town of Zhitkur was emptied of its population and levelled because it was too close. …\nLink:\nhttp://www.rolfwaeber.com/mystery/russian-roswell/index.html\n— — — —\nSo…\nWhat was Kapustin Yar?…\nEvidence of the importance of Kapustin Yar was obtained by Western intelligence through debriefing of returning German scientists and spy flights…\n… and now…\nWhat is Kapustin Yar?…\n>”We should yet again explain to our partners in Brussels and Washington that the training range ‘Ashuluk’ and ‘Kapustin Yar’, where the drills are held, are almost 800 kilometers away from the southeast of Ukraine… … etc. …”\nLink:\nhttp://sputniknews.com/russia/20150528/1022675913.html\n>On November 17, 2015 at 15:12 MSK (12:12 UTC) the Strategic Rocket Forces carried out a successful launch of a Topol/SS-25 missile from the Kapustin Yar test site. According to the official statement, the purpose of the launch was “to test new combat payload for future ICBMs.” The warhead was said to have successfully reached its target at the Sary-Shagan test range. \nLink:\nhttp://russianforces.org/blog/2015\n>”A week of tests” kicked off at the Kapustin Yar range of the Russian Strategic Missile Forces, in the Astrakhan Region. …\nLink:\nhttp://sputniknews.com/videoclub/20151221/1032070573/russia-weapons-tests.html\n/11/topol_launch_from_kapustin_yar_2.shtml\n\n","date":"December 22, 2015 at 12:31 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217059","author":"piero","site":"shroudstory"},{"title":"Thank You, Everyone","post":"I wanted to mention 2 things before the postings are stopped:  1)  Just a reminder that the St. Louis conference site (http://www.stlouisshroudconference.com/) will be taken down on or around January 19th.  The papers and videos of the presentations are at shroud.com so those will not be lost.  What will go away is the forum that was set up for readers to interact with the conference speakers.  2)  I’ve recently started what will likely be a 3 part article regarding the background of the 1988 C-14 test.  I’m hoping to have part 1 done by January 21 so that Barrie can link to it in his 20th anniversary update.\n\n","date":"December 18, 2015 at 7:18 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216819","author":"jmarino240","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Joe, you’ve been in the realm of Shroud studies for such a long time, acquiring so much information, that you are the right person to make this analyis. I’m sure everyone will be eager to read it.\n\n","date":"December 19, 2015 at 4:45 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216836","author":"Louis","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Off-track, but it is a bit of news that will go down in history.\nHRH Prince Charles has spoken out while other leaders who could have kept quiet:\nhttp://www.catholicherald.co.uk/news/2015/12/18/prince-charles-warns-middle-east-christianity-under-threat-like-never-before/\n\n","date":"December 19, 2015 at 6:06 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216848","author":"Louis","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Dan, the days won’t be the same without you and your “baby.”  Thank you, thank you, thank you.  I’ll even miss Hugh and Colin.  May God bless your future endeavors.  Don’t be a stranger…\n\n","date":"December 19, 2015 at 11:36 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216857","author":"Nabber","site":"shroudstory"},{"title":"Thank You, Everyone","post":"I noticed an interesting observation by a seamstress-historian who identified the stitch used in the hem of the Shroud as being of a type that was used in the shrouds used at Masada, some years later, but which ,was never used in the Mediaeval Period.  The tests in Padua University in 2008 indicated an early 1st Century date for the original parts of the Shroud.  The blood type was tested as type AB (5% occurrence). We can never demonstrate that it was Christ’s Shroud, but we cannot say definitely that it was not..\n\n","date":"December 20, 2015 at 2:24 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216888","author":"ntesdorf","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Ntesdorf; If you mean the seam, that type of stitch has always been used in the middle ages and down the centuries until now. If you mean the selvedge, it is not true that a similar type has been found in Masada. Would you please name that “seamstress-historian”?\n\n","date":"December 20, 2015 at 10:24 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216900","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Thank You, Everyone","post":"It is lack of respect to address Dr. Mechthild Flury-Lemberg as “seamstress-historian”. She was the curator of the Abegg Foundation.\nI agree with Gian Marco. In a recent (October) interview with Professor Israel Finkelstein, Israel’s foremost archaeologist, we dwelt on Masada:\nhttps://www.academia.edu/18994343/The_key_role_of_Biblical_Archaeology_in_Exegesis_An_Interview_with_Professor_Israel_Finkelstein\nIf contamination is taken into account to explain why the 1988 carbon dating results may have been skewed we must remember that the Masada cloths were correctly dated to AD 70 by Dr. Willard Libby, in 1950.\nThe wrappings used on the Dead Sea Scrolls were also correctly dated to the period Father Roland de Vaux, the Qumran excavator, had ascribed to the texts.\n\n","date":"December 20, 2015 at 10:39 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216902","author":"Louis","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Mechthilde Flury-Lemberg never claimed that the seam joining the sidestrip to the Shroud was unique to the 1st century. She used the comparison with a similar stitch in the Massada to say that a 1st century origin could not be eliminated, not that it was established. Her words are:\n“It can be said that the linen cloth of the Shroud of Turin does not display any weaving or sewing techniques which speak against its origin as a high quality product of the textile workers of the first century A.D.” (Sindon, December 2001).\n\n","date":"December 20, 2015 at 12:59 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216905","author":"Hugh Farey","site":"shroudstory"},{"title":"Thank You, Everyone","post":"And  that same stitch is used to this day to sew two different textiles together. My wife recognised it immediately( from a photocopy of the original Masada report) as one she used in her days as a theatre costume designer.  In the report of the Israeli textile specialist ( sorry I am in the US at present and haven’t the article to hand) he told of similar ninth century examples.\nA search for Flury-Lemberg online will show her expertise. I was always worried that the comment about the stitch was taken from an interview and we have no idea how the interviewer interpreted or quoted her remarks. I prefer her articles as she was in control of the whole text, not subject to the interpretation of an interviewer who may have had biases of their own.\nHowever as no three in one herringbone weave has ever been found from the first century, I am not sure how she talks of the weave being compatible with the first century. Perhaps she knows of examples that other experts on ancient textiles I have consulted are not aware of. The fullest account by a specialist I have talks of possible tunics in this weave in wool in the second century ( from Egypt) and in silk in the third and fourth centuries. This three in one weave is especially good in silk as it catches the light and that is why it was used for Rowan William’s inauguration robes as Archbishop of Canterbury.\n\n","date":"December 20, 2015 at 3:02 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216907","author":"Charles Freeman","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Charles, Flury-Lemberg gives just one example, as far as I know, of a 3/1 twill in wool:\nDominique Cardon, Les damassés de laine de Krokodilo (100-120 apr. J.-C) in: “Bulletin du CIETA”, no. 76, Lyon, pp. 7-21.\n\n","date":"December 20, 2015 at 3:31 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216909","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Thanks- I have an  (English) article on the woollen three in one at home but probably the same second century example that you quote, from a remote location on one of the trade routes across the eastern desert of Egypt. So far as I remember the fragments are so decayed that it is only speculation that they are tunics, possibly Roman, rather than Greek. As F-L would seem to confirm, they are unique to this location.\n\n","date":"December 20, 2015 at 8:24 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216919","author":"Charles Freeman","site":"shroudstory"},{"title":"Thank You, Everyone","post":"I have not that article available but some information is here:\nhttp://www.igl.ku.dk/~bulow/Krok97.html\nI quote a passage:\n“Un type de production, représenté par une dizaine d’exemples parmi les textiles étudiés, mais non encore attesté parmi les textiles des autres sites, contemporains ou plus tardifs, du désert Oriental égyptien, s’avère particulièrement intéressant à cet égard: ce sont des sergés bayadères 3 lie 1 / 1 lie 3, dessinant des chevrons sens trame en reliefÝ: or l’exécution de ce type de tissu implique très clairement l’emploi d’un métier à tisser à chaîne horizontale équipé d’un corps de remisse de 6 lisses, donc une machine déjà perfectionnée et dont l’origine et l’introduction progressive dans le monde méditerranéen et en Europe est un problème historique d’importance majeure.”\n\n","date":"December 20, 2015 at 8:56 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216923","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Thanks, Giano Marco. Very interesting on the woollen or goat hair textiles. I need to read it carefully. I assume that the English article I was sent on this site was possibly a translation or resume.\nThey make the point that the torsion of the spin is always ‘s’, typical of these Egyptian textiles which suggests that there is no link to the Shroud as an Egyptian textile as  the Shroud is ‘z’ spin. They also stress the unique nature of this weave so I do not think there is anything here for Shroud studies especially as we are looking for linen examples, not wool or goat’s hair.\n\n","date":"December 20, 2015 at 9:43 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216924","author":"Charles Freeman","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Here is an example of a fragment in 4/1 from Israel, but it is of the Byzantine period (after the 4th century). It is in cotton and Z-spun. Probably it was imported from abroad.\nhttp://www.academia.edu/2276718/Cooke_W.D._and_Shamir_O._2000._A_Textile_from_Deir_Abu_Mghar._In_U._Dahari._Monastic_Settlements_in_South_Sinai_in_the_Byzantine_Period._The_Archaeological_Remains._IAA_Reports_No._9._Jerusalem._Pp._247-248\nThe fragment is very small and the original dimensions are not known. Dimensions are important because for a textile so large as the Shroud a type of loom was necessary that permitted a rather quick execution.\nThe same fragment is also considered in another paper where, among other things, O. Shamir gives information about the chronology of the introduction of cotton in Israel.\nhttp://www.academia.edu/2276733/Shamir_O._2001._Byzantine_and_Early_Islamic_Textiles_Excavated_in_Israel._Textile_History_32_93-105\n\n","date":"December 21, 2015 at 5:27 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216934","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Some more information about Roman textiles, including those mentioned above, can be found in the Purpureae Vestes series, such as “PURPUREAE VESTES – Actas del I Symposium Internacional sobre Textiles y Tintes del Mediterráneo en época romana”. The articles are in several languages, but a particularly interesting one is “TAQUETÉ AND DAMASK FROM MONS CLAUDIANUS: A DISCUSSION OF ROMAN LOOMS FOR PATTERNED TEXTILES” by Martin Ciszuk.\n\n","date":"December 21, 2015 at 12:23 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216928","author":"Hugh Farey","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Since Joseph was a rich man one cannot rule out the possibilty that he used an imported cloth. It is known that there was contact between ancient India and Palestine/Israel, The recent Shroud paper published in “Nature” suggests that the word “Sindon” is of Indian origin. I am familiar with some Indo-Aryan languages but could not trace this word to India. It seems that the authors of the paper cannot substantiate their claim.\n\n","date":"December 20, 2015 at 3:38 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216910","author":"Louis","site":"shroudstory"},{"title":"Thank You, Everyone","post":"My Greek lexicon does suggest that the word sindon was originally used by the Greeks of fine cloth from India ( Sind is a region of India) but then became a word to use generically of any fine cloth, usually in linen. Hence its use in the New Testament by which time the Indian origins had been forgotten. If you are suggesting that any of the DNA found on the Shroud hooverings is related to the orIginal weave and not to the vast amount of handling by later generations, then you are spoilt for choice of where it might have been woven. Yet, why, when we have so much evidence of handling over the centuries, any of the DNA samples  might specifically be assigned toto the original weave of the cloth defeats me.\n\n","date":"December 20, 2015 at 8:34 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216920","author":"Charles Freeman","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Sorry- Sind was allocated to Pakistan not India in 1947 but the name for the region goes right back and there were early Greek trading contacts.\n\n","date":"December 20, 2015 at 8:39 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216921","author":"Charles Freeman","site":"shroudstory"},{"title":"Thank You, Everyone","post":"I have had Hindu Sindhis as friends.\nSo if the Greeks coined the word “sindon” it explains why I could not trace it to an Indo-Aryan language. The Parthians traded with people in ancient India, but the country was known for silk, not linen.\nI hope to be able to write something about the blood on the Shroud next year.\n\n","date":"December 21, 2015 at 6:24 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216944","author":"Louis","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Good luck in all your future endeavors, Dan.  \nYou’ve presented us with a wonderful blog, but eventually everything must come to an end.\nAnd with all the work you’ve, no doubt, put into this site, you deserve a well-earned rest in the form of retirement.\nThanks for all you’ve done!   Take care of yourself and enjoy life!  :)\nBest,\n\n","date":"December 20, 2015 at 7:55 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216917","author":"Angel","site":"shroudstory"},{"title":"Thank You, Everyone","post":"One of the things I have been mulling over the last few days is this….\nWhy would a medieval artist do a back and front portrayal of Jesus’s burial sheet?\nWe know there were traditions of an imaged face cloth, and even a sheet with a body image.\nBut it’s not as if there was a tradition – that we know of at least – of a front and back image of a tortured and naked Christ.\nPretty hard to contemplate what blokes in the 14th century may have been thinking, but for what it is worth wouldn’t there be other more obvious fake relics eg. Maybe a bloodied and partially imaged (just head?) linen.\nJust a thought. You see I do my best to think of possible non-authentic scenarios but I generally struggle…\n\n","date":"December 21, 2015 at 5:14 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216933","author":"Thomas","site":"shroudstory"},{"title":"Thank You, Everyone","post":"I agree with your position, Thomas, in that an artist wanting to forge a miraculous image would have no cultural context or tradition to produce a double front-and-back portrait. At this late stage (the 14th century was towards the end of the relic making – or discovering – craze), he might have decided not to produce an out-and-out painting which was simply declared miraculous (like most of the other imaged cloths), and, as a sop to the increasing rationality of the age, produced one in monochrome that could be thought of as a ‘sweat’ or ‘blood’ imprint, but at first sight there seems no reason to produce a long thin cloth (most un-shroud-like) with a double image.\nHowever! If he was not producing a ‘relic’, but a liturgical illustration, for the particular purpose of being displayed across the Sanctuary of a church, held in front of or behind an altar on Easter Sunday, having wrapped a wooden body of Christ (quietly removed by clerics on Saturday evening) lying in a side chapel since being placed there on Good Friday, then he might well have produced a long thin cloth, with a representation of what a real body might have produced had it laid within it.\nThis explanation would seem fanciful if we did not have countless accounts of just such a re-enactment occurring in monasteries, churches, and then outside during the development of mystery plays. The ‘Shrouds’ undoubtedly existed, and in vast numbers across Europe, although, in common with almost every other similar mystery play prop, not a single one remains. It is true that we have no description of any such Shroud, imaged or otherwise, and the few paintings of the scene do not show an image either, but such vestiges as remain can hardly be considered representative of the whole.\nI struggle myself with non-authenticist scenarios, as it happens, but this seems to me both sensible, possible, and historically justified.\n\n","date":"December 21, 2015 at 5:57 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216941","author":"Hugh Farey","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Hugh, it is interesting how you apply the reasoning that no traces exist of suppose shrouds with images before the 14th century (not one, besides the Shroud) yet some probably existed; but on the other hand you reasoned recently that if the double image of the Shroud existed before 1355 we should have such traces from Constantinople or Edessa. One reasoning contradicts the other. \nBesides, the Shroud of Lirey was considered a fake by the authority of Troyes solely based on the presence of the image itself. The authorities argued that since the Gospels did not state that the shroud of Christ had an image, none with such an image could be considered authentic. \nThat contradicts the argument that such shrouds were used in the Easter ceremony in or before the 14th century.\nWe have no historical documents at all that supports that idea. The historical documents support the opposite: it was not considered appropriate to have such an image.\n\n","date":"December 21, 2015 at 11:38 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216964","author":"Mario Latendresse","site":"shroudstory"},{"title":"Thank You, Everyone","post":"No I don’t think there’s a contradiction, Mario. If an ancient ‘authentic relic of Christ’ had had a miraculous double image, I think Colin is correct in supposing that it would have been most unlikely not to have been well known. However, a mere liturgical prop need not have excited any particular interest, regardless of its illustration. At some point, of course, Charles Freeman’s contention is that the cloth was transformed from ‘mere prop’ to ‘authentic relic’  and it was at that point that Henri de Poitiers stepped in to correct the misapprehension. He knew that such liturgical ‘shrouds’ were common, and considered it absurd that the Canons of Lirey were attempting to pass one off as an authentic relic.\nSo far, I think, so sensible. However, I do see some major objections to this scenario. If the Shroud had been brought from a long way away, from an area where the Quem Quaeritis was common to a place where it was unknown, or if it had been hidden away for a long time after the Quem Quaeritis tradition had died out, then its transformation would be understandable, but Bishop Henri claimed to have known the painter, which suggests recent, local manufacture. Charles thinks that a supposed ‘miracle’ associated with the cloth might have enhanced its reputation, but nobody who had known it before the miracle would have accepted it as the authentic burial cloth, miracle or not. One might speculate that a painter from somewhere else could have created a deliberate forgery based upon his knowledge of Quem Quaeritis shrouds (and assuming that Lirey had no such tradition), but I agree that there is no evidence for such a speculation. I agree completely that the historical and artistic arguments for a 13th/14th century manufacture are far from decisive, but then, the authenticist route from Jerusalem to Lirey, via Edessa, Constantinople, the Templars, the Crusades, the Mandylion and other possibilities is also far from decisively established.\n\n","date":"December 21, 2015 at 12:27 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216966","author":"Hugh Farey","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Hugh, I think you are clearly distorting the historical documents on the matter.\nYou wrote: ” However, a mere liturgical prop need not have excited any particular interest, regardless of its illustration.”\nThe historical documents say something quite different. We have no historical witness or documents that state that an image (double, frontal or face only) was used in the Easter ceremony of the three Mary. On the contrary, we have a study made by Chifflet who mentions shrouds but none of which has an image on it. That is, a highly recognised historian of the 17th century denies the existence of an Easter ceremony (or any Church ceremony) of the 14th century or before with a shroud having an image. \nMoreover, the shroud of Lirey is never described to have been used in such a ceremony. \nThere is only one shroud with an image (any image)  attested in the 14th century or before being shown to a crowd: this is the Shroud at Lirey. \nThe religious authorities at Troyes reasoned that such an image could not exist, claimed to be genuine or not. Therefore, why would any religious ceremony at a church in the 14th century or before used such an image?\nThe Holy Shroud of Besançon was extremely popular for three centuries starting from the 16th century, and it was the only other shroud besides Lirey that had an image. And it clearly was a copy of the Shroud of Lirey.  The claim that some other such shrouds (with an image) probably existed before the 14th century is against all known historical documents. Chifflet and all other historians could not state the existence of any.\nWhat Charles Freeman is doing is to avoid stating the reality of the historical documents to make some scenario historically sensible when in fact when you take into account the historical documents, these scenarios are proven to be highly implausible.\nIf the Mandylion was indeed a face-only image, why was it never shown in a ceremony to a crowd?\n\n","date":"December 21, 2015 at 1:25 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216974","author":"Mario Latendresse","site":"shroudstory"},{"title":"Thank You, Everyone","post":"No, Mario, I’m not sure you understand the distinction I am making. The development of the liturgical drama involving characters, a tomb in a side-chapel, and a shroud seem to have begun in the 9th or 10th century (see, for example, The Latin Passion Play, Its Origins and Development, by Sandro Sticca). By the 14th century its use was widespread all over Europe. Chifflet was talking of actual relics; he does not even mention the liturgical props, with or without an image on them. He certainly does not deny their existence.\nAlthough there are countless mentions of such shrouds, they are not described at all, and none remain. Such a lack of evidence does not preclude the possibility that some were painted.\nI’m not sure what you mean by: “The religious authorities at Troyes reasoned that such an image could not exist”. Bishop d’Arcis did say that had the real Shroud of Christ had an image on it the Gospels would have mentioned it, but the shrouds exhibited as part of the Quem Quaeritis ceremony were not intended to be mistaken for the real thing. They were illustrative, and educational, and I do not think that precludes the possibility that some were painted either.\nAs I said above, there are some serious flaws in the ‘ritual-to-relic’ hypothesis, but I don’t think the image itself is one of them.\n\n","date":"December 21, 2015 at 3:09 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216979","author":"Hugh Farey","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Hugh, you wrote, “Chifflet was talking of actual relics; he does not even mention the liturgical props, with or without an image on them.”\nThis is incorrect. Chifflet mentions the showing of a holy shroud during the ceremony of Three Maries. See at the end of page 41 of his book (translated from Latin to French)\nhttps://books.google.com/books/reader?id=ubFwTFNHEZEC&printsec=frontcover&output=reader&pg=GBS.PA40\nYou wrote, “The development of the liturgical drama involving characters, a tomb in a side-chapel, and a shroud seem to have begun in the 9th or 10th century (see, for example, The Latin Passion Play, Its Origins and Development, by Sandro Sticca)”\nThe book you cite does not appear to have the word “shroud” or even “cloth” in it. Where are the hundred cases showing a shroud during the ceremony of the Three Maries? Before 1355? Original sources stating the cities where they were shown should be found.\nCompare your two claims:\n1) “[the double image] would have been most unlikely not to have been well known” (fact: only a few high ranking officials in Constantinople saw the Mandylion).\n2) “Although there are countless mentions of such shrouds, they are not described at all, and none remain.” \nYou do not see a contradiction?\n\n","date":"December 22, 2015 at 3:10 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217039","author":"Mario Latendresse","site":"shroudstory"},{"title":"Thank You, Everyone","post":"I agree with Hugh. The Quem Queritis ceremony early on Christmas morning required a burial cloth to be held up to show Christ had risen. Some were known to have been painted though we don’t know exactly how. In a large church and in the dim early light the priority must have been impact and this is what was  achieved by a double image with vivid blood as the early accounts suggest.\nThe need for impact above all else also explains why the two images, now only discoloured linen, do not match each other, in length or in the way the arms are shown( you could not hold the position of the arms on the back image simultaneously with those on the front).\nSome accounts of these ceremonies do, as Hugh suggests, involve an actual Effigy of Christ but the Shroud images do not reflect being laid over a three dimensional image- they appear to be straightforward representations from above of a body crucified according to the  gospel accounts with some elements, e.g the scourging on both sides reflecting post 1300 iconography.\n\n","date":"December 21, 2015 at 7:19 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216948","author":"Charles Freeman","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Charles, you wrote: “The Quem Queritis ceremony early on Christmas morning required a burial cloth to be held up to show Christ had risen. Some were known to have been painted though we don’t know exactly how.”\nWhich ones? Please provide a reference supporting that statement?\n\n","date":"December 21, 2015 at 8:37 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217027","author":"Mario Latendresse","site":"shroudstory"},{"title":"Thank You, Everyone","post":"And I mean more precisely: Charles do you have a reference to the statement “Some were known to have been painted” ?\n\n","date":"December 21, 2015 at 8:45 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217028","author":"Mario Latendresse","site":"shroudstory"},{"title":"Thank You, Everyone","post":"I am sitting in the airport at San Francisco waiting for my flight back to the UK so you will need to wait for the moment until I get back to the references!\n\n","date":"December 21, 2015 at 9:57 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217030","author":"Charles Freeman","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Charles I have to say you have a quite nice theory but I am afraid to say it falls down on many counts, in my opinion. So where do I start?\n‘The Quem Queritis ceremony…required a burial cloth to be held up to show Christ had risen’\nProblems:\n– the Shroud image is not one of a glorified risen Christ\n– people such as yourself argue that the silence of history in describing an imaged shroud is a problem for the authenticist’s case. But then you argue for an imaged (front and back for good measure) shroud to be held up in a ceremony as opposed to say a non imaged but bloodied shroud. I think this is logically inconsistent. Why show an imaged burial shroud ‘to show Christ had risen’ if there was no tradition of a full body imaged shroud?\n– the Shroud itself is of such length as to be quite a nuisance to ‘hold up’\n– why ‘manufacture’ a front and back image? A frontal image would have been enough and a lot easier to manage. Your theory suggests a purely ceremonial origin for the shroud but the ultra realistic front and back image flies in the face of this.\n– the nude image goes against the art history grain….yes yes there were one or two rare exceptions but they were discrete images not things for widespread public display. And sorry I don’t buy your argument at all that there was originally a loin cloth on the image that wore off.\n– I just don’t buy your argument that the image is the product of a faded painted image. For many reasons. A painted shroud makes sense for an Quem Queritis object, a novel and as of yet inadequately explained image does not (when a painted image would be all that was required for an abstract and symbolic ceremonial use)\n\n","date":"December 22, 2015 at 4:18 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217041","author":"Thomas","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Hi Thomas, thanks for your comments. I have tried to explain how the precise features of the Shroud fit the Quem quaeritis ceremony above and in other posts…\n1) “The Shroud image is not one of a glorified risen Christ.” Well, of course not. As explained above, it was specifically to show the traces of a dead body. The whole point was that it was the shreds left behind, not anything to do with the Resurrection.\n2) “Why show an imaged burial shroud ‘to show Christ had risen’ if there was no tradition of a full body imaged shroud?” There was no tradition of any particular kind of Shroud. I think the faint image (and I differ from Charles on this point) was not to show a miraculous effect – which would certainly have been talked about and well known if such a tradition had been extant – but simply to differentiate this cloth as a ‘shroud’ from any other cloth, such as a table cloth or bed sheet.\n3) “The Shroud itself is of such length as to be quite a nuisance to ‘hold up’”. It certainly required two people, but I think that was the whole point, to be able to hold up something clearly ’empty’ before an entire congregation.\n4) “Why ‘manufacture’ a front and back image?” Holding up a ‘shroud’ for all the congregation to see meant that long and thin was obviously easier for the back rows than a squarer sheet, much of which was too low. Having decided on long and thin – a most unlikely shape for a real shroud, I may say – then the shape of the man wrapped in it, back and front, would fill the space better than a single image in the middle. Elsewhere I have also suggested that this may also be the reason why the images are placed head-to-head – also an unlikely configuration for a real shroud – rather that feet-to-feet.\n5) “The nude image goes against the art history grain.” Yes, it does, but again, I don’t think this scenario should be considered ‘art’ in any modern sense. Medieval theatre props were produced in their thousand, and not a single one remains. This was not a ‘work of art’ but a utilitarian indication of a body in a shroud for a drama. As such, I don’t think it broke any taboos. (And no, Charles has never said that there was originally a loin cloth that wore off. He suggested that at a much later date a loin cloth was painted on and that that has worn off, or been removed. That possibility is also highly debatable, but it is irrelevant to the origin of the Shroud.)\nNothing definitive, I quite agree, and to those who think the Quem quaeritis hypothesis untenable, I have nothing but sympathy. However, I hope that they will at least have some idea why I think it could provide a reasonable context for a medieval origin, and have some sympathy in return!\n\n","date":"December 22, 2015 at 5:59 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217045","author":"Hugh Farey","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Sorry, EASTER morning! That time of year is getting to me!\nI have argued elsewhere ( History Today article easily found on Google ) that the original purpose of the Shroud gives it the right to be venerated within Catholic tradition as pope Francis recently demonstrated without any acknowledgement of authenticity.\nIf it were a fake there would be no reason to venerate it.  It is,I believe, one of thousands of medieval ‘ relics’ which are not what they claim to be but which have been given spiritual status by continuous veneration over centuries. The medieval  Volto Santo in Lucca is a good example. It is known to be medieval even by its most devoted adherents but it is venerated as a supposed replacement of the first century original.\n\n","date":"December 21, 2015 at 7:47 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216951","author":"Charles Freeman","site":"shroudstory"},{"title":"Thank You, Everyone","post":"In the hypothesis the TS is Yeshua’s, which BTW is the most likely, both archaeologically and scientifically speaking, the best hypothesis to account for the very redness of the bloodstains on the Turin Sindon and the slightly translucent straw-yellow body image, does imply the idea of (speedy) purification ritual and use of a mildly corrosive sort of lye water (the red heifer waters) in conjunction with starch residues present in old linen + thermal impression while purifying shed innocent blood and drying out (in-soaking the inner burial sindon aka TS with the red heifer waters and subjecting the wrapped-up corpse to xyloaloetic fumigation).\nNote: Re image formation hypotheses based on the assumption that the Shroud is of 14th century origins, 2014 CE Joseph Accetta’s DYE imprinting  scenario and 2015 CE Colin Berry’s PLAIN WHITE FLOUR & NITRIC ACID FUMIGATION imprinting scenario are just singeing/recycling my 1997 CE RED HEIFER WATER IN-SOAKING & XYLOALOETIC FUMIGATION IMPRINTING (providential bloodied image made from a front and back contact AND loss of front ad back contact process on a drying procedure namely a fumigation => light mordanting)\n\n","date":"December 21, 2015 at 8:43 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216953","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Edit: my 1997 CE RED HEIFER WATER IN-SOAKING & XYLOALOETIC FUMIGATION IMPRINTING or fumigation/mordanting scenario\n\n","date":"December 21, 2015 at 8:48 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216954","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Your “1997 CE RED HEIFER WATER IN-SOAKING & XYLOALOETIC FUMIGATION IMPRINTING”? What’s that? Is it available to read?\n\n","date":"December 21, 2015 at 10:06 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216957","author":"Hugh Farey","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Moons ago, I wrote:\n “(Re the image formation process and my fumigation/mordanting scenario) The fact is I first had “an inspired guess” on the night just after reading the Heller report late in 1988 CE (I had only very remotely heard of the TS until then and was neither for nor against the TS authenticity). \n  “It was not until 1994 CE I really put “my inspired guess”/my TS image formation fumigation/pre- or light mordant theory pen to paper based on my first attempt to reconstruct Yeshua’s tetanised body/stiff rigid corpse wrapping in shrouds in light of Christolipsology (studies and research on Christ’s contact relics). \n  “In 1997, I submitted two research paper resumes (“La Soluzione Archeologica Dell’Enigma O Verso Una Nuova Orientazione Delle Ricerche Sulla Generazione Dell’Imagine Sul Lenzuolo Mortuario Di Torino” and “Decriptazione Ex-Novo Delle Tace D’Iscrizioni Sul Lenzuolo Mortuario Di Torino E Messa In Correlazione Col Frammento Del “Titulus Damnationis” Conservato A Roma”) to the Centro Internazionale in Turin. Both were accepted. Unfortunately, the day before the presentation of my oral papers, I was told I would be allowed only seven minutes to present my findings because they were too many orators. \n  “Overnight I rewrote a paper in French “En Vue De La Solution Archéologique De l’Egnime” and could only tackled the Yeshua’s burial time-frame as pre-logic issue.” I still have the drafts of the three papers yet they need to be up-dated and translated into English.\n\n","date":"December 21, 2015 at 12:34 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216967","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Well, now we’ll meet less often on the web, Max, perhaps you’ll find the time to do that and then publish them on acedemia.edu or submit them to shroud.com? At least Louis commits his researches to open scrutiny…\n\n","date":"December 21, 2015 at 1:17 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216973","author":"Hugh Farey","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Hugh, I havê been a profissional religion writer for 20 years for the same newspaper. Some of my articles, written much earlier, are preserved in an university library as well as in the library of a renowned institution for reference.As part of my work I havê interviewed some of the world’s top bíblical scholars and archaelogists as well as Shroud scholars. Some of this was published in leading dailies in more than one country, and they are not online. What is online is less than 5% of what I published.\nI did not videotape the burial of Jesus and do not indulgênce in wild speculation. I also know how to respect people, maintaining distance from people who say they are scholars and havê the crude manners of someone coming from peasant stock. Of course,  I havê always hit back when someone hás attacked me for no good reason.\n\n","date":"December 21, 2015 at 1:50 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216976","author":"Louis","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Quite. What I was hoping was that, Max, who as long as I have known him on this blog has referred to various unpublished articles and papers, might follow your example and actually publish them.\n\n","date":"December 21, 2015 at 3:13 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216980","author":"Hugh Farey","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Hugh, You have contradicted yourself. Not long ago I pointed out, on this very blog, that you were encouraging people who were making nasty attacks against other commenters by engaging with them. You agreed and apologised and now you start all over again. As editor of the BSTS newsletter you should have a look at several blogs and websites where top scholars and commenters who do not insult anyone are allowed to comment.\nLet me tell you something more: I have received many messages from top Shroudies complaining against the blog, whose identity I will not reveal. It would have been a better blog if Dan had the time for moderation.\nThere are many sites and blogs where papers can be published and I myself received requests from webmasters of\nin more than one country to allow them to post some of the things I wrote. That is because I did not write rubbish nor claim to have a profession that does not exist.\n\n","date":"December 21, 2015 at 3:52 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216984","author":"Louis","site":"shroudstory"},{"title":"Thank You, Everyone","post":"To interview world’s top biblical scholars and archaeolgist doesn’t make Louis de Figueiredo a true biblical scholar or true achaeologist! The man is self-delusional! Methinks his alleged “knowledge” of the Tanakh and Talmudic literature is mostly superficial. \nThough a Catholic, he even proved a very poor NT exegete and most obviously knows very little about Christic relics too (see the Kornelimüsnter sudarium “that had covered the head of Jesus”) and nothing or next to nothing as far as Biblical Aramaic and Hebrew are concerned (see e.g. Hebrew time markers and their translation entropy to koine Greek the man is not even aware of!). Actually Louis de Figerido  IS the man coming from pseudo-intellectual/religious peasant stock yet boasting to be a confirmed Biblical scholar, which he is not! How can he judge of what he is not even aware!\nNote:  Myself  I have (almost) always hit back whenever an arrognorant and/or disinformative alleged “journalist” attacked me or attempted to underrate me as a professional cryptologist. I thought a true Christian should love his enemies and pray for them. It speaks volume how sel–delusional Louis de Figereido is as an alleged “Christian”!\n\n","date":"December 21, 2015 at 4:14 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216990","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Are you Christian, Mr. Max Patrick Hamon?\n\n","date":"December 21, 2015 at 4:58 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216996","author":"Louis","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Hi Dan,\nThank you so much for your work.\nWhere will I read now so many meaningful posts and comments ?\nThanks to all of you, particularly to Hugh, Colin, Charles, Mario, Louis, Kelly and many others.\nColin wrote: “adieu”.\nI hope that it’s not the end of the story.\nThanks again Dan.\nThibault.\n\n","date":"December 21, 2015 at 3:16 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216981","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Hugh, You have contradicted yourself. Not long ago I pointed out, on this very blog, that you were encouraging people who were making nasty attacks against other commenters by engaging with them. You agreed and apologised and now you start all over again. As editor of the BSTS newsletter you should have a look at several blogs and websites where top scholars and commenters who do not insult anyone are allowed to comment.\nLet me tell you something more: I have received many messages from top Shroudies complaining against the blog, whose identity I will not reveal. It would have been a better blog if Dan had the time for moderation.\nThere are many sites and blogs where papers can be published and I myself received requests from webmasters of\nin more than one country to allow them to post some of the things I wrote. That is because I did not write rubbish nor claim to have a profession that does not exist.\n\n","date":"December 21, 2015 at 3:52 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216985","author":"Louis","site":"shroudstory"},{"title":"Thank You, Everyone","post":"I have never encouraged anybody to make a nasty attack, Louis, nor have I agreed that I have, nor have I apologised for so doing. I have no idea what you are talking about. If you think I want Max to publish rude comments at academia.edu, then you have missed my point. As long as I have known him here, Max has asserted various bits of information, almost invariably unsubstantiated, but occasionally with reference to numerous researches, papers and articles which are all either unfinished or need updating. I hope they were about Second Temple burial practices, and I hope they weren’t rude. With the closure of this blog, perhaps he will have time to publish something. Whether it is rubbish or not we will not be able to determine until he has.\n\n","date":"December 21, 2015 at 4:09 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216988","author":"Hugh Farey","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Hugh, I have no time to look for what you said. All I can say is that you did admit you were wrong and apologised and it was around two months ago.\nI will be working on a Shroud article when I have time these days.\nChristmas is approaching and clothes and foodstuff have to be distributed to the needy, particularly the homeless. That is something being done right from college days. I will never forget people from the Salvation Army asking for contributions, even pennies, from the folks at the Brent Cross shopping centre just before Christmas  in London many years ago. Hardly anyone looked at them.\nSince Dan has said that he will be devoting more time to church activity I told him not to forget the needy. They are the ones who most need our attention. He has always been willing to listen and is a good guy on the whole, so I’m sure he will do some good work at his parish.\n\n","date":"December 21, 2015 at 4:25 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216991","author":"Louis","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Louis de F.: “That is because I did not write rubbish nor claim to have a profession that does not exist.”\nYou do write rubbish. In this very blog you wrote iI was “a Polish immigrant living in France” (when actually both my parents were French! You mistake your wildest fancies for facts! How reliable you’re as a “journalist”!\nSince july/august 2015, You sytematically underrate my comments (when in the past you were doing the exact opposite!).  Reminder: you’re neither a true Biblical scholar nor an archaeologist! You’re a mere free lance journalist. \nI was a professional cryptologist for ten years and  stopped my professional occupation this summer. You’d better GET INFORMED again! \nStill waiting for Mr. Louis  de Figueiredo,  the alleged “great Biblical scholat” to account for Second Temple period Jewish people keeping as a memento a shroud that was in direct contact with a stiff rigid body all covered in shed innocent blood, which is a pollutant? How was it purified?\n\n","date":"December 21, 2015 at 4:40 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216994","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Why don’t L de F ask ‘HIS’ world’s top bíblical scholars and archaelogists (since he is no scholarly man enough to answer the question for himself)?\n\n","date":"December 21, 2015 at 4:57 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216995","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Thank You, Everyone","post":"I have a message for Mr. Max Patrick Hamon. Please don’t try to fool others. First of all, please put a recent photograph, not one taken about two decades or more ago, on your Facebook profile:\nhttps://www.facebook.com/maxpatrick.hamon\nThe other “photograph” you posted on another site is a caricature.\n\n","date":"December 21, 2015 at 5:04 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216997","author":"Louis","site":"shroudstory"},{"title":"Thank You, Everyone","post":"I mean halachic issue, you mean profile picture on FB!  YOU’re only fooling yourself, you cannot fool me.\n\n","date":"December 21, 2015 at 5:53 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217002","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Well, I agree with your last paragraphs whole-heartedly, Louis, and look forward to anything new you post at academia.\n\n","date":"December 21, 2015 at 5:53 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217003","author":"Hugh Farey","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Reminder for the alienated lance journalist: a FB profile picture is NOT a FBI profile picture!\n\n","date":"December 21, 2015 at 6:05 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217006","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Hugh, I am thinking about a website next year, which someone else can handle.\n\n","date":"December 21, 2015 at 6:14 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217007","author":"Louis","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Mr. Max Patrick Hamon, at Rezé, France. What are you hiding? I know you are an oldish man, with white hair. You can only fool the gullible. Please put the correct photograph on Facebook.\nYou did not answer my question about whether you were a Christian. I know you are hiding something.\nDid you go to the burial in New  York, to see if the man would resurrect? You are badly informed, but that is something one can expect from someone who tries to fool others by inventing a profession.\nIf you were more intelligent you would undertstand that what you said here will be used against you.\n\n","date":"December 21, 2015 at 6:22 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217010","author":"Louis","site":"shroudstory"},{"title":"Thank You, Everyone","post":"I do know I’m not politically correct and I don’t care. I leave it to hyprocrites.If you were intelligent too, you’ll know you are making a perfect fool of yourself with your clutching at FaceBook straws and my alleged “white hair” (BTW I’ve got a white beard now) when addressed a halachic issue with which you just cannot deal because you’re are no scholarly man enough to.\nRe FB profile picture: don’t you make too much of your sole potatoe!\n\n","date":"December 21, 2015 at 7:01 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217014","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Mr. Figureout, how long shall I repeat, I don’t belong to any church, temple, mosque, synagogue, organization, sect etc. I am a free spirit and thinker.\nRe your “Did you go to the burial in New York, to see if the man would resurrect? You are badly informed.”\nI haven’t the foggiest notion to what you’re alluding and I cannot care less.\n\n","date":"December 21, 2015 at 7:14 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217016","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Whether you care or not, you took the wrong tram, Mr. Max Patrick Hamon. If I was a fool I would swallow the photograph you posted on Facebook, which you should change the soonest possible for your own good. Don’t come with the nonsense you call archaeocryptology to justify why you put the wrong photograph.\nAlso don’t try to stuff halachic material down my throat, I know about Judaism much more than you — although I am not ashkenazi — and have contributed articles which are are preserved at one of the world’s best universities for reference. Do you understand what is hidden in early rabbinic literature? It seems that you are swallowing things, hook, line and sinker.\nIt seems you are one-track minded and completely outmoded in your way of thinking. You can fool others on this blog but you don’t fool me.\nWhy did’nt you answer the query and comment I posted earlier?:\nHere it is:\n ” You did not answer my question about whether you were a Christian. I know you are hiding something.\nDid you go to the burial in New York, to see if the man would resurrect? You are badly informed, but that is something one can expect from someone who tries to fool others by inventing a profession.”\n\n","date":"December 21, 2015 at 7:27 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217018","author":"Louis","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Directed to Thibault Heimburger:\nI  also wish to thank you for your contributions to this blog, from which I learnt quite a lot. Although there were some things here and there with which I could not agree, in general it is clear that you always asked the right questions and made some excellent remarks.\nI hope to be able to write on the blood detected on the Shroud next year and that is where your contributions and views, as a medical practitioner, will be most welcome.\n\n","date":"December 21, 2015 at 4:10 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216989","author":"Louis","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Thibault,\nDo you know how to use\nthe “Hollow AFM cantilever”?\nIt seems to be very easy to try to do something using\nthe “Hollow AFM Chip” on a very little area of a\nlinen cloth in order to observe what happens at\nmicro- and nano-level with blood (as reagent) on\ntreated (with Madder, Saponaria officinalis, etc.)\nlinen materials …\nHere a possible reference:\n“Hollow AFM cantilever pipette”,\nMurali Krishna Ghateksar, Hector Hugo Perez Garza, Urs Staufer\n“Microelectronic Engineering”\nVol. 124, 25 July 2014, pages 22-25\n— — —\nWhat is your answer?\n\n","date":"December 23, 2015 at 10:41 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217113","author":"piero","site":"shroudstory"},{"title":"Thank You, Everyone","post":"I believe that “Hollow AFM cantilevers”\nare more useful to improve the studies in\nthe field of “Fluid force microscopy”…\n>Fluid force microscopy combines the\npositional accuracy and force sensitivity of\nan atomic force microscope (AFM) with\nnanofluidics via a microchanneled cantilever.\n>However, adequate loading and cleaning\nprocedures for such AFM micropipettes\nare required for various application situations. …\nSource:\n“A Multifunctional Frontloading Approach for\nRepeated Recycling of a Pressure-Controlled\nAFM Micropipette”\nPhillip Roder,  Carsten Hille \nLink:\nhttp://journals.plos.org/plosone/article?id=10.1371/journal.pone.0144157\nProbably the controls for what happens on\ntreated (and not treated) linen, with blood as\nreagent, can easily be done without problems at\n“macro level”…\nIn any case, in my opinion, exact studies\n(= high precision. Then see the possible use\nof “Hollow AFM cantilevers”) about the blood\ncan be helpful for the case of bloodstains on\nHoly Shroud and for the other relic/repert:\nbloodstains on linen of Sudarium of Oviedo…\nand see also: the improved study of fibrinolysis\nusing AFM tools.\n\n","date":"December 23, 2015 at 11:48 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217119","author":"piero","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Mario’s comments above make a great deal more sense to me than those of the other correspondents here.  Besides the Lirey Shroud, there was only one other contemporaneous one, that at Besancon, and known to be a copy of the Lirey.  As I recollect, it did not even show a dorsal view.  Although it no longer exists, I would hazard a guess that it would not have been difficult to identify it as a painting.  Whereas we still do not know how the Lirey Shroud image was imprinted.  \nAs far as I’m aware, the only basis for asserting that Bishop Henry objected in 1355 to the Lirey expositions, is the material written by Pierre D’Arcis, whereas Henry is on record as being extremely supportive of Geoffrey I de Charnay.  \nWe have Robert de Clari’s evidence that a very similar cloth was exhibited at the Blachernae church in Constantinople every Friday, regardless of whether it was Easter or Christmas.  \nI would also hazard a guess that the western “relic craze” up to the 14th century, was merely a copycat mimicking of the several relics known to have been pillaged from Constantinople, with small-time forgers attempting to cash in on some of the topical action. \nThe challenge “Make one if you can” has never been successfully met, and I won’t be holding my breath waiting.\n\n","date":"December 21, 2015 at 3:24 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216982","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Put the Besancon image alongside the Shroud and you can see clearly that one is not a copy of the other, nor is there any documentary evidence linking the two.\nThe ‘relic craze’ began in the west soon after the east. Augustine was welcoming relics by the early 400s. You are right. to say that the 1204 Crusade encouraged forgeries. That is why Pope Inncocent III tightened things up in 1215 and new relics had to have papal approval. That is why the Shroud was turned down in 1390 by Clement VII and was not allowed to be exhibited without saying it was not authentic.\n\n","date":"December 21, 2015 at 3:55 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-216987","author":"Charles Freeman","site":"shroudstory"},{"title":"Thank You, Everyone","post":"CF: “That is why the Shroud was turned down in 1390 by Clement VII and was not allowed to be exhibited without saying it was not authentic.”  \nThat is too much stretching of the facts.   The Shroud was not “turned down in 1390 by Clement VII”, nor was it required to state that “it was not authentic.”  Permission was obtained to exhibit it on the understanding that the De Charnays should continue to describe it as a “likeness or representation”.  Rather than being prompted by the Bishop D’Arcis’ memo on the matter, Clement may well have suspected its true Constantinopolitan origins, and therefore adopted this requirement for reasons of discretion.  If Clement had any real reasons for suspecting a forgery because of the D’Arcis memo, he would not have twice ordered D’Arcis to perpetual silence on the matter under pain of excommunication, nor would he have permitted the exhibitions to continue.  His actions are more consistent with seeking to avoid an adverse reaction from either Rome or Constantinople. \nConcerning the Besancon Shroud:  It may well be the case that it was a planted substitute for the true Shroud, and its somewhat similarly vague presentation was an attempt at imitating some of its principal features.  Quite likely this was the actual cloth giving rise to D’Arcis complaint being mistakenly  misinformed as being painted, his error being to ascribe this to the Lirey Shroud.\n\n","date":"December 21, 2015 at 11:31 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217033","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Talk of “peasant stock” is so elitist, so yesterday, and so suggestive of the vestiges of an Indian caste system. \nMy own forbears were a motley lot: several master mariners, a professor of mathematics, a blacksmith, bush-fellers, a butcher or two, a jeweller, a rural mid-wife, members of the royal house of Orange-Nassau, a high-born Ngapuhi lady – daughter of a renown ariki in the north, a dress-maker, a hawker, and other assorted types.  I have yet to discover any small-time farmers or feudal serfs.\n\n","date":"December 21, 2015 at 6:20 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217009","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Really? What about the Kennedys, the famous Boston Brahmins that they are, and the blue bloods in Europe?\n\n","date":"December 21, 2015 at 6:27 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217011","author":"Louis","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Don’t distort my words, Mr; Max Patrick Hamon. I commented that one cannot claim to be a scholar and show the crude manners of a peasant. I never said I was a “top journalist”, although I have published in leading dailies in more than one country and in different languages. Mr. Max Patrick Hamon, the “archaeocryptologist” —  Hugh could not find that word anywhere, except in his comments —- is unknown in France. I had occasion to interview Daniel Raffard de Brienne, who happened to be blue blood, and was always very courteous. He worked with Mitterand after WW II and wrote for the best history magazines in France,\n\n","date":"December 21, 2015 at 7:38 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217020","author":"Louis","site":"shroudstory"},{"title":"Thank You, Everyone","post":"This exchange is over!\n\n","date":"December 21, 2015 at 7:49 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217023","author":"Dan","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Great, Dan. If you read right from the beginning you will notice that it was Max Patrick Hamon who began the attacks, as usual. He has insulted Barrie Schwortz, one of the twentieth century’s greatest biblical scholars, who I had occasion to interview, and whom I quoted on this blog, and other commenters on this blog. That was taking advantage of the fact that there was no moderation.\n\n","date":"December 21, 2015 at 7:59 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217024","author":"Louis","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Mario, this is fascinating; thank you or bringing the passage to my attention. I see it begins (page 40): “Or incontinent apres le commencement du 13. siecle l’on voit la ceremonie de la monstre du sainct Suaire au jour de Pasques, couchee dans un certain ceremonial escrit devant l’union des deux Eglises de S. Jean, & de S. Estienne, faite en l’annee 1253. car cette ceremonie n’est point descripte dans le Rituel, comme nouvelle, mais bien comme en usage quelques annees auparavant: ce qui nous fait conjecturer que la ville de Besançon fut bien-heuree de ce present environ l’an 1100.” You may be able to help with the translation, as although it seems clear to me that the Quem Quaeritis ceremony was obviously well known in Besançon long before the arrival of its more famous Shroud, it also seems that the people may have been using another, non-authentic, shroud before the ‘authentic’ one appeared.\nIn the book I mentioned, The Latin Passion Play, mentions on page 23 “two documents, both of the tenth century: the Regularis Concordia of St. Ethelwold of Winchester and the Quem quaeritis version from Saint-Martial of Limoges. Composed between 965 and 975, the Regularis Concordia contains rules […] and describes religious ceremonies […]. In it are found the earliest stage directions for the performance of an Easter play: the Quem quaeritis:” The Latin directions are then quoted, including:\n“Quo viso, deponant turribula, que gestaverant in eodem Sepulchro, sumantque linteum et extendant contra clerum, ac veluti ostendentes, quod surrexit Dominus et iam non sit illo involutus, […]. Superponante linteum altari.”\n“Having seen this, they lay down the thuribles with which they have been honouring the Tomb, and pick up the shroud, holding it out towards the clergy, as if to show that the Lord has risen from it and is no longer wrapped in it. … They place the shroud on the altar.”\nIn the few pages, the book goes on to discuss both antecedents to and the extensive expansion of the ceremony in its dramatic form over the next few centuries.\nIn all this, however, I can find no description of the shroud – big or small, square or long, painted or not. However I do not think that my reconstruction, particularly as it pertains to quite a late-comer to the field (400 years later), by which time the ceremony was much more clearly developed, is merely fanciful. The very fact that the Besançon shroud, which seems to have been an obvious painting, existed, lends some credibility to this hypothesis, don’t you think?\n\n","date":"December 22, 2015 at 5:30 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217042","author":"Hugh Farey","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Hugh, yes the text by Chifflet points to a Three Maries’ ceremony at the church of Saint-Étienne in Besançon. (That church no longer exists as it was destroyed to make place for the Vauban fortress.) He is writing in the 17th century. A shroud, or piece of cloth, was shown by one of the canons during that ceremony. This is according to Chifflet and this is before 1355. Yet, there is no image mentioned and Chifflet could not confirm any. And from the description, only one person was showing the piece of cloth. There is not a hint of an image on this cloth and the formal description of the ceremony that you describe above does not state an image.\nThe Shroud of Besançon that would come later around 1520 is very different. We actually discussed that in January of this year.\nBut you have not answered the question I asked: how do we know that there were hundreds of these ceremonies? Charles Freeman even claims to have references to painted cloth used in that ceremony. He has not provided any so far. This is my main question.\nWhat is clear to me: if there were hundreds of such ceremonies being held across Europe all of  them appear not have shown any image. The very idea of the image on that cloth was so new to the clergy at Troyes that they rejected the authenticity of shroud of Lirey *solely* on that non existence. Of course, they knew absolutely nothing of the Mandylion. So, they would have fail to know anything about shrouds with an image being used in the Three Maries ceremony as it would weaken their argument. \nThe lack of any documents and witnesses to such an image prior to 1355 strongly points to the uniqueness of the Lirey shroud, not the other way around as you tried to infer from totally unbalanced reasonings about the Mandylion vs the existence of images on the cloth used in the Three Maries ceremony.\nAgain, please compare the two: we have no document or witness that states that images were on the cloth used in the Three Maries ceremony, yet you claim that some may have existed; on the other hand we have many documents that state that the Mandylion was not shown to the public and that it was kept hidden for centuries, yet you claim with certainty that the image that was on it would have been widely known.\nDon’t you see that your supposition that the Shroud at Lirey is not authentic makes you create reasonings that are contradictory?\n\n","date":"December 22, 2015 at 11:55 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217057","author":"Mario Latendresse","site":"shroudstory"},{"title":"Thank You, Everyone","post":"You are certainly stimulating more research, Mario!\nProf. Sticca says, on page 39, “When the single dialogue is assigned to Marys and angels, with rubrics for action, the trope becomes a play, the Visitatio Sepulchri. Young discusses more than 400 texts of these Easter versions of Visitatio Sepulchri, which became actual drama.”\nThe ‘Young’ referred to is, I think Karl Young, and his book ‘The Drama of the Medieval Church’, which alas is not available at Google.books.\nBut you’re right about the lack of reference to an image on any of these shrouds. I don’t think an image implausible, especially an unmiraculous blur such as the one on the Shroud, but for the meantime, there is no evidence for one. That won’t stop me looking, though!\n\n","date":"December 22, 2015 at 1:29 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217061","author":"Hugh Farey","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Hugh, the head of the trail to find such an image could be at Dijon. Supposedly, the Besançon ritual of the Three Maries was reestablished after an inquiry at Dijon. See (in French)\nhttps://books.google.com/books?id=rbAXAAAAYAAJ&pg=PA5&lpg=PA5&dq=besancon+saint+suaire+dijon&source=bl&ots=oRVzNLkQC3&sig=Hc9j8nysVNE0eu7Tp4J3CFSBc3c&hl=en&sa=X&ved=0ahUKEwiS48jMnPDJAhUBHmMKHUXmCzwQ6AEIHzAA#v=onepage&q=besancon%20saint%20suaire%20dijon&f=false\nFor some description of the theatrical presentations done at Besançon, you could read (in French):\nhttps://books.google.com/books?id=y4z9THaKQtwC&pg=PA53#v=onepage&q&f=false\nThese two references are given in my book on the Shroud of Besançon.\nThe more people search this possibility, the better. But I doubt that you will find anything significant which will strengthen the arguments for the authenticity of the Shroud of Turin.\nBut the image on the Shroud of Besançon is most likely from the Shroud at Lirey. Nothing else was ever found on that matter.\n\n","date":"December 22, 2015 at 2:51 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217066","author":"Mario Latendresse","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Correction to “But I doubt that you will find anything significant which will strengthen the arguments for the authenticity of the Shroud of Turin.”\nIt should read:\n“But I doubt that you will find anything significant. That  will only strengthen the arguments for the authenticity of the Shroud of Turin.”\n\n","date":"December 22, 2015 at 4:56 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217073","author":"Mario Latendresse","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Oh, and the extract, “deponant turribula, que gestaverant in eodem Sepulchro, sumantque linteum et extendant contra clerum”, containing four plural verbs, definitely suggest more than one person holding out the shroud.\n\n","date":"December 22, 2015 at 2:50 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217065","author":"Hugh Farey","site":"shroudstory"},{"title":"Thank You, Everyone","post":"The Quem Queritis ceremony was a re-enactment  of the Easter morning at the tomb and had alternative presentations- with the three Mary’s or Peter and John. In the case of the latter they go into the tomb as per the gospel accounts and find the discarded grave cloths. Often there were two as John’s account but Karl Young quoted many accounts where there is a single linen. The Cambridge UL has a copy of the Young and it has many many accounts of these ceremonies – in fact, though dated,  it was the single most important book in my researches which led to my hypothesis of the Shroud coming from the Quem Queritis ceremonies.The TWO of them, although the still dressed as priests, come out of the tomb then hold up the linen before the congregation in front of the empty tomb to show that Christ had once been there but had now risen leaving the grave  cloths.\nThe linen is then. carried to the High Altar and laid there. For a possible illustration of this which fits the liturgical account ,see the Lirey  Pilgrim Badge. Young has a ninth century illustration from the monastery of St.Gall with the Three Mary’s approaching the tomb and you can see the wrapped grave cloths inside. As per the required ritual the Marys in this illustration also carry an incense burner. Well, you go into a dark tomb to find the cloths to bring them out and some incense just gets spilt onto the cloth . . . . .\n We may never know but I wonder whether there was some miracle associated with the holding up,of the cloth one Sunday which is why the exposition is shown on the badge. This would not be untypical of these events.\nBack home, I am too tired and with too much to do , but will answer any other queries when I am back with my reference books.\nI would agree with Mario that searching these accounts for evidence of the authenticity of the Shroud is a dead end. Rather it provides evidence of the possible/ probable medieval liturgical origins of the Shroud.\n I will also hope to give a reference from Hans Belting to the Image of Edessa being venerated by crowds who would sprinkle water on its eyes, one more reason why this was never the Shroud. No sign of the sprinkling!\n\n","date":"December 22, 2015 at 4:00 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217069","author":"Charles Freeman","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Charles, I do not see yet references that you promised for a Three Maries ceremony where a cloth is shown with an image. \nYou also wrote “For a possible illustration of this which fits the liturgical account ,see the Lirey Pilgrim Badge.” Which one?\nYou know that there are two known such badges, one without any tomb? So, I think you are not covering the latest historical finds.\nYou wrote, “I would agree with Mario that searching these accounts for evidence of the authenticity of the Shroud is a dead end. Rather it provides evidence of the possible/ probable medieval liturgical origins of the Shroud.”\nActually, this is not what I meant, but I can see now how the sentence I wrote could be interpreted that way. I meant the opposite, that is, that the search will likely not find any cloth with an image like the Shroud of Lirey (and also any image) used in a Three Maries ceremony (or any other ceremony actually). So, we can state: researchers convinced that the Shroud is inauthentic have tried to find a similar image on a cloth before it appears in Lirey, but none could be found. We certainly can now state something similar because many have searched already.\nYou wrote: “I will also hope to give a reference from Hans Belting to the Image of Edessa being venerated by crowds who would sprinkle water on its eyes, one more reason why this was never the Shroud. No sign of the sprinkling!”\nYou are probably referring to the an interpolation found in the Narratio first composed in 945. But it is not said that the water was sprinkled on the eyes.\nWhat sign do you expect?\n\n","date":"December 22, 2015 at 4:55 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217072","author":"Mario Latendresse","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Mario- I have just flown in from the States and have a mountain of things to do before Christmas but the three works referencing the images on cloths will be sent when I can get to my office- tomorrow- promise!\nKarl Young is fundamental to these researches as his is the fullest account, if in the Latin original- of these ceremonies.\n\n","date":"December 22, 2015 at 5:23 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217074","author":"Charles Freeman","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Charles, I understand. I’ll wait for your references. But in 2016, you will not be able to post them here.\n\n","date":"December 22, 2015 at 6:48 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217077","author":"Mario Latendresse","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Thanks for your help, Mario. The search goes on!\n\n","date":"December 22, 2015 at 3:25 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217067","author":"Hugh Farey","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Conjecture:  From a Mario posting above it seems that reports of Quem quaeritis date back to at least 1100, and the Troyes comment suggests that an imaged shroud was unlikely to be used in these ceremonies.  However following Robert de Clari’s (and probably other crusaders’) sighting at Blachernae in 1204, could it seem possible that an imaged shroud may have been an adopted innovation into the western ceremonies?\n\n","date":"December 22, 2015 at 11:58 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217088","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Ah! The old chicken-and-egg conundrum. Was the Turin Shroud the model for the painted shrouds of the 13th/14th centuries, or was it the other way round? I don’t think there is sufficient evidence either way so far…\n\n","date":"December 23, 2015 at 8:05 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217110","author":"Hugh Farey","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Hugh, this argument was used by Ian Wilson in one of his Shroud books and one can understand this because he is a careful scholar.\nAssuming that the Knights Templar did really possess the Shroud after the Fourth Crusade, in which they did not take part, but where they had spies, what made them chant psalm 67 during their special masses and build the round churches, using Jerusalem’s Church of the Holy Sepulchre as model?\nPerahps something they saw told them that the artefact had something to do with the Resurrection.\n\n","date":"December 23, 2015 at 8:45 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217112","author":"Louis","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Mario. I am very busy and jet lagged but here are the references. I cannot guarantee to return to this site so I hope this settles outstanding matters.\nOne.To the Image of Edessa being the subject of veneration.\n ‘The rituals of the feast of the cloth image in Edessa  are described retrospectively by a writer apparently a court theologian, from Byzantium, ….. The relic, concealed behind a white or purple cover, was usually kept in a shrine and was set up on a ‘throne’ only on special days. On feast days it was approached with water that the people sprinkled on its eyes.’\nHans Belting, Likeness and Presence, p.211. There is a great deal more on the Image of Edessa in Belting. Required reading for all those who persist in seeing it as the Shroud of Turin!\nTwo. References to Easter ceremonial cloths being painted. (N.B. The only way to get an image on a linen cloth is to embroider it ( as in the famous Bayeux Tapestry) or paint it after the linen has been sealed. Painting was obviously the most economical way but shelf lives tended to be short unless it was expertly done or the image was preserved on a backing. Otherwise the painted surface tended to disintegrate after too many foldings. This is why we have so few survivors from the many thousands of painted cloth images that are recorded in inventories.)\nI am sure that much more can be done on this, but this is just the preliminary results of my researches which show clearly that there were painted cloths, with images on them, used at the Easter ceremonies.\na)The Mozarabic Rites that originate in the seventh century and are followed in some parts of Spain to this day. The Easter Preface reads: ‘Peter ran with John to the tomb and saw the recent imprints of the dead and risen man on the linens.’ This would date well before the Shroud was created. As no ‘imprints’ are mentioned in the gospels, it would seem that there may have been actual cloths with a double image on them.\nb)Karl Young is the crucial source here. In the ceremonies of the Visitatio Sepulchri in which John and Peter appear and display  (the Latin word ostendo with its connotations of ‘stretching out’ is used) cloths that have an ‘Imago Domini’, ‘an image of the Lord’, on them. Among the places where this is recorded, in examples given by Young, are Aquileia, Salzburg, Chiemsee (a nunnery on this Bavarian lake), Passau, and the abbey of St. Florian (near Linz). None of these provide details of the images but this simply confirms that there were images on the cloth and that these were shown to the congregation, in this case by clergy representing Peter and John (?as shown in the Musée de Cluny Lirey Pilgrim Badge).\nc)In her exhaustive study of medieval Easter Sepulchres in England, Pamela Sheingorn finds many references to painted cloths although sadly most inventories or church records do not tell us what the subject of the paintings are. Even so (and I have not been through all her many references to inventories) in the church of St.Peter-in-Cornhill in London, among other ‘steyned clothes’, is one ‘of the burying of our lorde with Image of three Marys’. In his will of 1559, long after the Reformation, Sir Rich Rede bequeathed to St. Paul’s Cathedral ‘my little embodered Cloath wrought with the Resurrection of our Saviour Christe Jesus, which I thinke was made to hang aboute the middest of an Altare, about or beneath in the feast daye of the Resurrection.’ In Lincoln Cathedral, the Easter Sepulchre was embellished with ‘a whyte steyned cloth of damask silke for the sepullcour with ye passion and the Ressurecion of owr lord’.\nd)In the third volume of the theology section (1790) of the mammoth Encyclopedie Méthodique the Abbé Bergier contributed the article on Suaire (‘Shroud’). He describes the Gospel texts and concludes that the linens or shrouds that one sees ‘in several churches’ could not possibly be the actual burial cloth of Jesus. He goes on to note that in the Easter ceremonies, which he dates back to the 12th and 13th centuries, a linen cloth empreint de la figure de Jesus-Christ enseveli (empreint, ‘printed’, enseveli, ‘buried’) is displayed to the congregation [ in other words he suggests that this was normal practice to have an image of the buried Christ]. He goes on to tell how these cloths are preserved in church treasuries, which is why there are so many of them. He notes specifically those displayed at Cologne, Besançon, Turin and Brioude and argues that despite their lack of authenticity as the original Shroud they should still command veneration.\ne)A French Bible dictionary of 1912 states that there were ‘linen cloths, in which in former days it was the custom to paint the body of Christ in the tomb and spread them afterwards on the altar to serve for the mass on Easter Sunday.’\nFurther research need on pilgrim badges to see how the Lirey badge relates to others. The question that needs to be researched further is whether there are examples of pilgrim badges that record a miraculous event- was there an (unrecorded) miracle associated with the display of the Shroud one Easter? We do have lots of recorded cases where an object, not seen as a relic as such, became venerated after a miracle or vision was reported. The odd thing about the early accounts of the Shroud is that no miracles are reported (perhaps one reason why the Church authorities were able to dismiss it so easily). The Savoys did, however, produce several miracles- and these are described in Beldon Scott. (I really have no time for those who do not have this book at hand as it is not expensive in second hand copies and has a mass of vital information about the Shroud.)\nHappy Christmas to all, and especially Dan!  So much more research to be done- we have hardly started but I do think it should be over to the linen conservationists who deal with these linen cloths close-up to take over!\n\n","date":"December 23, 2015 at 5:01 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217099","author":"Charles Freeman","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Charles, you do not provide references to support the claim that a cloth with an image was used during the ceremony of the Three Marys prior to 1355. Or any church ceremonies. Often your references are also vague or does not point to the primary source. This is not the work of an historian.\nIn general what you are doing is giving secondary references, and in several cases, misinterpreting them.\nFor example, and this is on another subject that you introduced in your answer, the Image of Edessa,  you cite Hans Belting. But the text you cite comes from the Narratio written shortly after 944. You appear unaware of it. And why do you cite this text about the ceremony of the Three Maries?\nAnother example, you cite at (d) Abbé Bergier, who writes in French, and you write your own interpretation as “He goes on to note that in the Easter ceremonies, which he dates back to the 12th and 13th centuries, a linen cloth empreint de la figure de Jesus-Christ enseveli (empreint, ‘printed’, enseveli, ‘buried’) is displayed to the congregation [ in other words he suggests that this was normal practice to have an image of the buried Christ]”.\nThis is not case at all. Bergier writes that it was *possible* that such images was used prior to the appearances of shrouds such as Besançon, Turin and Lirey, but he has no references to backup this possibility that such shrouds/image existed in the 12th or 13th century. Bergier is writing in the 18th century, long after the events he is trying to describe.\nYou are working with secondary sources *and* misinterpret them.\nI really do not need to point out all shortcomings of what you are citing but they are far from the claim you have made about examples of painted cloths for the Three Maries ceremony prior to 1355.\n\n","date":"December 23, 2015 at 10:48 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217114","author":"Mario Latendresse","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Mario- you need to read Young as he painstakingly takes back the story to the tenth century and actually has a tenth century illustration ( from the monastery of St. Gall- a primary source if ever there was one) that shows the ceremony. The Three Marys are approaching the tomb. Inside you can see two cloths wrapped up. We would be extraordinarily lucky to have an actual illustration of these cloths with images on them.\nKarl Young notes that, while in actual depictions of the grave clothes the sudarium (‘facecloth’) and the linteamina (the wrappings of the body) are usually shown separately (as in the tenth century St. Gall illustration) , ‘the dramatic ceremonies at the sepulchre followed the Gospel traditions with considerable freedom, using sometimes a single [N.B.] cloth called sindo or linteum , sometimes a cloth called sudarium, sometimes several pieces called linteamina, and again both a sudarium and linteamina.’ \nYou really have to work through Young in detail on this as he very carefully traces the developments of these ceremonies from the tenth century in the west. He notes how the Quem Queritis ceremony began as part of the Easter morning Mass but was then separated out to become a  independent ceremony  at dawn with more and more emphasis on the display of the linen grave cloth-or cloths. Although I don’t think he made this point, this emphasis on public display of relics  was very much a feature of the Gothic period which is why Gothic churches had more windows and processional space.\nWhile an Easter connection with the Shroud seems to have been maintained in the first half of the fifteenth century on the banks of the river Doubs- it was only exhibited there on Easter Sunday so far as we know – the Savoys converted it into their family prestige relic  and the link with Easter was broken with a new feast day of 4th May. Beldon Scott, has the best account that I know of of the crucial transformation of the Shroud from a rejected outsider  (rejected again by the bishop of Liege in 1449) to a prestige relic with stories of its own miracles and a transfer, not from the Lirey church, but to the kings of Cyprus by Patriarch Heraclius of Jerusalem in 1087 (Beldon Scott, ‘King of Kings, King of Cyprus’,pp 31-7).  By doing this the Savoys were doing what you had to do if anyone was to take your relic seriously- have a miracle record and a story which in this case needs to go back to Jerusalem. Of course, the researches of Chevalier exploded this Savoy myth of the Shroud having come direct to them from Jerusalem via the Lusignon kings of Cyprus but how else could the Savoys maintain the pretence of authenticity? They must have realised that the Lirey origin would get them nowhere so they dumped it!! Yet, as Beldon Scott shows they could hardly dump Margaret de Charny who actually handed the Shroud over so they created a story that Margaret de Charny was descended from the kings of Jerusalem; fled from Cyprus with the Shroud at the fall of Constantinople to the Turks (1453), and handed it over to the duchess Anne of Savoy who was her Lusignon family relative.\nMario is right- it is very difficult to get the truth from medieval documents. Yet I think that there is sufficient overlapping evidence to show that some of the cloths used at the Visitatio Sepluchri ceremony (see Young again as how this emerged as an alternative to the ceremony with the Three Marys) had images on them. I cannot think how these images would have been created other than through the well-tested if usually rather ephemeral methods of painting on the cloth.\nJust as I cannot see the Shroud anywhere in the Pray Codex, i cannot possibly see how the Besancon Shroud is a copy of the Turin Shroud. Remember you have lots of other models to work from if you want to represent a laid out body with folded arms on a cloth , the epitaphioi, the Holy Graves of the Rhineland, the Klosterneuberg altar, etc. etc..  The Besancon image is even cruder than that of the Shroud which in itself does not even have matching bodies. That is why I think that the original artist was concerned ,in the dim morning light, to create something with impact- hence the heavy emphasis on the blood, so typical of the fourteenth and fifteenth century, and so remarked on by everyone who saw the Shroud in its early years. No one would bother much if the Shroud bodies were of different lengths and the arms at the back could not possibly have been the same arms folded at the front. After all Christ had risen- only the grave cloths where his body had lain were left and by displaying them you made the point. Bring the cloth to the altar lay it out ( the length of the Shroud matches an altar such as the one in Cologne Cathedral) and rejoice!!\n\n","date":"December 23, 2015 at 12:45 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217125","author":"Charles Freeman","site":"shroudstory"},{"title":"Thank You, Everyone","post":"P.S. ( Sorry, interruption to set up a bed in my ground floor office so that my 95 year old father-in-law can be with us for Christmas!)\nWith so many of the painted cloths around, with an Imago Domini on them,there is no reason to link the de Clari image in Constantinople specifically with the Shroud of Turin especially when de Clari’s was, like many others, a single image. We must accept that there was nothing unusual about a painted image on cloth  of Christ buried or resurrected. No evidence that the Latin- speaking de Clari would have been able to communicate with the Greek-speaking heretical Orthodox Christians to find out about the Blachernae cloth anyway. (One reason why  the Crusaders were able to loot all the Constantinople relics is that they were, after 1045, held by excommunicated heretics.)\n\n","date":"December 23, 2015 at 5:33 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217101","author":"Charles Freeman","site":"shroudstory"},{"title":"Thank You, Everyone","post":"I always believed that the Image of Edessa/TS was stolen and this point of view shocked a top “Shroudie” who had sought my views about his own hypothesis. Years later, Dr. Barbara Frale, a historian at the Vatican Secret Archives, confirmed the problem of stolen relics during an interview:\nhttps://www.academia.edu/7447446/Was_there_a_link_between_the_Knights_Templar_and_the_Turin_Shroud_An_interview_with_Dr._Barbara_Frale\nI don’t think the Orthodox Christians were heretics because the problem with Rome had nothing to do with theology but with papal authority.\nDe Clari was a soldier and would therefore be armed and perhaps go wherever he wanted to go, and thus see the image he wrote about,\nI am working on the post- Fourth Crusade period, when the Shroud appeared in Europe, going just half a step beyond Ian Wilson, and the article should be online this week.\n\n","date":"December 23, 2015 at 7:11 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217105","author":"Louis","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Wow! Plenty to work on here, Charles. Busying myself among some of your references, I find that the ‘imago domini’ seems to refer to a figurine rather than a painting as often as not, and the extensive section on painted cloths in “The sepulchre of Christ in art and liturgy; with special reference to the liturgic drama” by Neil C. Brooks doesn’t even mention shrouds. Suggestive, but no smoking gun yet.\nThen we get to “Encyclopédie méthodique. Théologie. T. 3” (about 1790) at http://gallica.bnf.fr., and Abbé Bergier’s conclusion that “on conclut que le corps de Jésus-Christ ne fut point enveloppé d’un linceul entier, mais seulement avec des bandelettes comme Lazare. Ainsi les linceuls ou Suaires que l’on montre dans plusieurs Eglises ne peuvent avoir servi à la sépulture du Sauveur, d’autant plus que le tissue de ces Suaires est d’un ouvrage assez moderne.\n     Il est probable que dans le douzième & le treizième siècles, lorque [sic] la coutume s’introduisie de représenter les Mystères dans les Eglises, on représenta le jour de Pâques la Résurrection de Jésus-Christ. On y chantoit la Prose Victimae Pascali, etc. dans laquelle on fait dire à Madelaine: Sepulchrum Chrisit viventis & gloriam vidi resurgentis, Angelicos testes, sudarium & vestes: Au mot Sudarium on montroit au peuple un linceul empreint de la figure de la figure de Jésus-Christ enseveli. Ces linceuls ou Suaires conservés dans les trésors des Eglises, pour qu’il servissent toujours au même usage, ont été pris dans la suite pour des linges qui avoient servi à la sépulture de notre Sauveur; voilà pourquoi il s’en trouve dans plusieurs Eglises différentes, à Cologne, à Besançon, à Turin, à Bripoude, &c. & l’on s’est persuadé qu’ils avoient été apportés de la Palestine dans le temps des croisades.”\n“A sheet imprinted with the figure of the buried Jesus Christ.” We’re getting close…\nNow I’m assuming that ‘A French Bible dictionary of 1912’ is that of Paul Vigouroux, whose entry on Suaire includes: “Les autres ne serait que des nappes sur lesquelles on peignait autrefois le corps du Christ au tombeau et que l’on étendait ensuite sur l’autel pour célebrer la messe de Pâques.”\n“Cloths on which were once painted the body of Christ.”\nSure, dictionaries are not primary sources, but it is clear that Charles is not alone in thinking that painted representations of Christ inhis shroud were used in the old Visitatio ceremony.\n\n","date":"December 23, 2015 at 7:59 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217108","author":"Hugh Farey","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Hugh, if you are using Bergier to try to track down shrouds with an image used in the ceremony of the Three Maries (prior to 1355), you are going to be disappointed. The French text you cite  mentions Besançon and Turin. But of course Turin never used the Shroud for such a ceremony, and the Shroud at  Besançon with an image is after 1520, which was likely a copy of the Shroud of Turin. And for the others, for which dates and where are the images? Bergier is a very well-known text with nothing new to offer.\nThe dictionary of Vigouroux: speculations.\n\n","date":"December 23, 2015 at 11:11 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217115","author":"Mario Latendresse","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Very true, Mario, very true. As I said above, dictionaries are not primary sources. Vigouroux may well have been based on Bergier, for instance. And I guess Bergier knew that Turin never used its Shroud for the Visitatio Sepulchri ceremony, but then, he probably also knew that it had not been in Turin for ever, and may have been used for such a ceremony somewhere else. I don’t have access to Young’s book at the moment, but I have ordered it, and hope to pursue the investigation further when it arrives.\n\n","date":"December 23, 2015 at 11:23 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217116","author":"Hugh Farey","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Hugh, \nOf course, Bergier knew that the Shroud at Turin was from Lirey. By the way, for over a century, the second dissertation (against the authenticity of the Shroud of Besançon) in the manuscript MS 826 of the municipal archives of Besançon was ascribed to him, but he was not the author of it (although I did think for a while that he was possibly the author). But Bergier had no more information than you and me about the whereabouts of the Shroud at Lirey before 1355. And the whole discussion is going into a circle if you are referring to the Shroud of Turin as a possible source of examples of cloths being used in a the ceremony of the Three Maries. The history of the Shroud of Lirey has been looked at so thoroughly! What is obvious is that Bergier is very vague and uses examples that we know very well today cannot correspond to what you are searching for. \nI think this is all very basic. You have to go back to primary sources to find what you are looking for. \nBy the way, about the Narratio, and in particular the ceremony of the Image of Edessa, and whether or not the crowd could see the Image, see the work of Irma Karaulashvili, \nhttps://www.academia.edu/19780359/_Abgar_Legend_Text_and_Iconography._Kadmos_Ilia_State_University_6_2014_164-240\nOn page 205: “On the fourth day of the middle week of the Lent the high priest\nwent there, opened the chest in which the image was kept, wiped the icon\nwith an unused sponge that was soaked with water, first gave the water that\nhe squeezed out to the people then sprinkled the water over them. Ordinarily\nthe chest with the image was kept behind the doors of the sacristy, which were\nopened on Wednesday and Friday. Everybody was able to see the chest from a\ndistance but nobody was allowed to approach and touch It.”\nThis is of course her translation of the Greek text of an excerpt of the Narratio. The image is in the Chest, but the crowd can only see the Chest on Wed and Fri (during Lent). The crowd does not see the Image at any moment.\nAlso, see \nhttps://www.academia.edu/6711329/_The_Abgar_Legend_Illustrated_Interrelation_of_the_Narrative_Cycles_and_Iconography_in_Byzantine_Georgian_and_Latin_Traditions_._in_Interactions_Artistic_Interchange_between_the_Western_and_Eastern_Worlds_in_The_Medieval_Periods_ed._C._Hourihane._Princeton_2007_pp._220-243\nAnd it shows how difficult it is to come with a clear description of what the Image of Edessa/Mandylion was. She even think, like Averil Cameron, that the Mandylion was probably not even a cloth!\nThe claim by many that the image of Edessa was clearly only a face is a myth. It is not clear.\nThese articles are a good first read for primary sources about the Image of Edessa/Mandylion.\n\n","date":"December 23, 2015 at 12:14 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217120","author":"Mario Latendresse","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Yes, you’re quite right that to use 14th century imaged cloths as evidence that the Shroud is a Visitatio Sepulchri prop would be too circular to be convincing. And that primary sources are what we need. Between them, Karl Young and Neil Brooks have transcribed hundreds of versions of the Visitatio rite, and perhaps, somewhere among them, there will be an earlier reference to a stained, printed or painted shroud. But maybe not!\n\n","date":"December 23, 2015 at 12:43 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217124","author":"Hugh Farey","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Dan…….I just wanted to express my appreciation for the enormous contribution your Shroud blog has become for Shroud scholarship.  Certainly, those in sindonology will long remember…..(and use)…..the myriad topics and forums your efforts brought to the table for us to react to…..or not react to!  Thanks again for all your contributions that benefited so many of us.  I hope to see you at something Shroud-related…..down the road.\n\n","date":"December 23, 2015 at 1:31 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217128","author":"David Onysko","site":"shroudstory"},{"title":"Thank You, Everyone","post":"I am not sure why Mario is insisting on the Three Marys ceremony which is an early version of the Visitatio Sepluchri with Peter and John, in other words two clerics instead of three. Of course we should be happy with images from either of these ceremonies but I think the latter is more likely as there seems to be more emphasis on the display of the cloth in the recorded liturgies of the Visitatio. The theatrical impact  would have been enormously enhanced if there were images on the displayed cloths.\nHaving spent two and a half years  and more on medieval relic cults, I am used to so many stories ( and miracles ) invented in the hope of getting pilgrims to believe that you had an authentic relic that I dispair of actually finding out what really happened at Lirey. It is always interesting to me that neither of the de Charney males are linked to the claim for authenticity. There is no evidence that the much  in demand Geoffroi senior was ever at Lirey in these years before his death in 1356 and Geoffroi  junior seems to have been happy to exhibit the Shroud with the restrictions Imposed  on him by Clement VII ( that it had to be announced that it was not authentic).\nThe difficulty is intensified by the period. With a third to half the population dead from the Black Death and a highly traumatises surviving population many of whom believed that the Black Death was a punishment from God, people flocked to new shrines. Lirey was clearly a new early 1350s shrine but we have no record of how it might have related to the traumas left by the Black Death. However, we should be sensitive to this context.\nI am frustrated that Belting did not give a reference for the sprinkling of water on the eyes as he implies that this was a ceremony at Edessa, not Constantinople.Is it clear from the text Mario quoted that this is a cloth and not a wooden icon? Wiping an image on a cloth with water does not seem a sensible thing to do if you were interesting in preserving the image or the cloth which would decay if damp. It would seem, unless there is a clear reference to this being a cloth, that we are talking of a wooden icon. Having said that , Belting’s alternative scenario of pilgrims sprinkling water on the open( we presume) eyes of the Edessa image also seems to be sure way to have a decayed cloth!\n\n","date":"December 23, 2015 at 1:45 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217129","author":"Charles Freeman","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Christmas musings:\nIsaiah 9:6\n For to us a child is born,\n    to us a son is given,\n    and the government will be on his shoulders.\nAnd he will be called\n    Wonderful Counselor, Mighty God,\n    Everlasting Father, Prince of Peace.\n(New International Version (NIV))\nThe Jewish-born South African Jesuit Father David Neuhaus, at the Hebrew Vicariate, Latin Patriarchate of Jerusalem, has published a very interesting piece of exegesis in the English Jesuit monthly “Thinking Faith”:\nhttp://en.lpj.org/2015/12/21/a-reflection-on-the-expression-mighty-god-by-father-david-neuhaus/\n\n","date":"December 23, 2015 at 3:22 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217132","author":"Louis","site":"shroudstory"},{"title":"Thank You, Everyone","post":"According to Gospel of Hebrews (GOH) – Jesus gave the linen cloth to the servant of Priest. I don’t know why the author of GOH stated this linen cloth in 2nd century?\n\n","date":"December 23, 2015 at 9:20 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217139","author":"Sampath Fernando","site":"shroudstory"},{"title":"Thank You, Everyone","post":"“The source Karaulashvili uses to try and show that the Image was a wooden board actually states it was a cloth”. Mark Guscin, “The Tradition of the Image of Edessa”, A thesis submitted for the degree of Doctor of Philosophy at the University of London (Royal Holloway and Bedford New College), August 2014. p. 45.\nMario I advice you the reading of this text, easily available on line. It is clear that all descriptions of the Mandylion (except some latin late traditions that are not properly descriptions) are coincident in that the Mandylion was a face on a cloth.\n\n","date":"December 24, 2015 at 6:20 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217149","author":"David Mo","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Another near miss!\nThe Passion de Semur – about 1450 – includes a scene in which Mary Magdalen calls on the audience/congregation to look at the 10500 wounds of Christ on the shroud. See ‘Le Mystere de la Passion en France du XIVe au XVIe Siècle’, Emile Roy, page 180.\n“Capiat sudarium et ostendat.”\n“La doleur part a son suaire, Que les felons ly firent traire. Dix mille y a et cinq cents goutes, Et plux quil les compteroit toutes, De son sang dont il fust moillé Quant a l’estaiche fust lyé; En tant de lieux fust sa char route, Et souffri celle doleur toute …”\n\n","date":"December 24, 2015 at 10:57 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217156","author":"Hugh Farey","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Fascinating source,Hugh. Now is this THE Shroud or another one? In 1450, it was still in the possession of Margaret de Charny and she had just been ticked off by the bishop of Liege for exhibiting it without papal approval. She is then recorded as taking it to Macon before going on to give it to the Savoys.\nCf. th is account with that of the St. Clare’s ‘s  nuns in 1534.\n\n","date":"December 24, 2015 at 1:43 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217161","author":"Charles Freeman","site":"shroudstory"},{"title":"Thank You, Everyone","post":"The 10,005 wounds of Christ is a new one on me. The normal calculation in the obsessive attempts to pin down the number is 5,466 individual wounds. This is attributed  to St.Gertrude but she may be simply reflecting earlier traditions of there being many wounds ,in addition to the Five Sacred Wounds that were the subject of intense veneration based on gospel sources. If you read the visions of say Bridget of Sweden (fourteenth century) and others you get a concentration on the wounds and the blood of Christ that is also reflected in the iconography of threat period . I leave it to individual researchers to relate or fail to relate these to the Shroud.\n‘About 1450’ is vague but with the condemnation of Margaret de Charny in 1449 for exhibiting the Shroud and the threat of excommunication hanging over her for possessing what the ecclesiastical courts ruled  was not hers anyway, it is most unlikely that a pre1453 text referring to  a shroud is referring to the Turin Shroud but to another that was similarly marked with wounds from the scourging. If so this is a very important text for anyone interested in the display  of shrouds/ grave cloths in this period. and I hope to find out more from Hugh on this.\n\n","date":"December 26, 2015 at 3:49 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217234","author":"Charles Freeman","site":"shroudstory"},{"title":"Thank You, Everyone","post":"10500. Dix mile et cinq cents. The extant copy in the Bibilotèque Nationale is dated 1488, but it is clearly the result of many revisions and additions over the years. There’s another paper, “Evolution of a Passion Play: La Passion de Semur” by Graham A. Runnals, which traces its roots “to the 14th century, if not further”, but the Mary Magdalen episode seems more recent. St Gertrude floreat at the end of the 13th century and St Bridget at the beginning of the 14th, and both were popularisers of the thousands of wounds of Christ, which seem to be related to the number of days of the year, multiplied by a number of prayers to be said each day, although the exact number varies.\n\n","date":"December 26, 2015 at 5:49 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217236","author":"Hugh Farey","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Thanks, Hugh.I assume that the Semur is the medieval town which still has its core intact today. There would appear to be a tradition of exhibiting a shroud there with many wounds of Christ on it . It is hard to know these wounds would not have been seen without having been painted on. So here we MAY ( lots more work to be done)have a reference to a similar ceremony to that at which the Turin Shroud was first exhibited. An important new avenue of research.\n\n","date":"December 26, 2015 at 7:18 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217238","author":"Charles Freeman","site":"shroudstory"},{"title":"Thank You, Everyone","post":"If Dan were still posting, I bet he’d be posting this:\nhttp://www.bbc.co.uk/news/magazine-35120965\nNo comment!\n\n","date":"December 24, 2015 at 11:32 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217157","author":"Hugh Farey","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Professor Joan Taylor is a Quaker and has tried to dump some oats down our throats, which most of us discussing the Shroud must have tasted long ago. What she did was to rehash material that was sensationalised all along these years and add the latest views.\nHer expertise is in the field of Second Temple Judaism and Early Christianity and she takes us to Moses. There is very little we can know with certainty about pre-Second Temple Judaism, the Babylonian Captivity having brought a radical change in the theology. There was no real monotheism before that period, which only began to appear during the Hasmonean period. If Professor James Hoffmeier is correct in placing Moses in the Egyptian court, how would he have worn his hair?.\n https://www.academia.edu/18994343/The_key_role_of_Biblical_Archaeology_in_Exegesis_An_Interview_with_Professor_Israel_Finkelstein\n\n","date":"December 24, 2015 at 4:24 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217168","author":"Louis","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Also essential: Nicolotti, Andrea:  Dal Mandylion di Edessa alla Sindone de Torino, Alessandria, Edizione dell’Orso, 2011.. In Italian.\n\n","date":"December 24, 2015 at 12:55 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217159","author":"David Mo","site":"shroudstory"},{"title":"Thank You, Everyone","post":"The Thermochimica Acta short communication about the mass spectrometry analysis of Ray Rogers and the comments of Marco Bella, Luigi Garlaschelli and Roberto Samperi is available online for free until February 12, 2016.\nhttp://www.sciencedirect.com/science/article/pii/S0040603115004724\n\n","date":"December 24, 2015 at 1:13 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217160","author":"Mario Latendresse","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Also see Paul Zanker, The Mask of Socrates, which traces the beard back to Rome about AD 300. Ties in the development to Christ as a philosopher. The book is available online with illustrations free.\nThe idea that a single image could spark off an artistic revolution across a very wide area but leave no documentation was always far- fetched. In so far as the earliest representations of the bearded Christ are in Rome, It would assume that the Shroud was originally in Rome , not the east , but no documentation to support this.\nAgain the Shroud could simply have been copying the conventional iconography of the medieval Christ . . . . .\n\n","date":"December 24, 2015 at 1:53 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217162","author":"Charles Freeman","site":"shroudstory"},{"title":"Thank You, Everyone","post":"The early portrayal of a bearded Christ in Rome is not at all surprising.  There were early Jewish Christian conclaves there, even in apostolic times, and certainly Sts Peter and Paul were both there.  It did not require the presence of the imaged Shroud of Christ for a knowledge of his actual appearance, and it seems likely that many Jewish men were in fact bearded, and wore their hair long, which contrasted with the prevailing Greek and Roman fashions, clean shaven and cropped locks.  \nHowever there is at this time a variety of appearance in such iconography as there is, and this would seem to be an important point.  The iconography needs to make a connection with those to whom it is directed, and therefore an artistic and evangelizing imperative prevails, that the subject should not seem culturally alien.  \nA case study example:  The first Catholic missionaries to New Zealand were French Marists from Lyons to the Maori mission stations, soon followed by Irish clergy for the Catholic settlers, perhaps fleeing the Irish troubles, or the penal colonies in Australia.  Even in my boyhood, the statuary and holy pictures of Christ, the Holy Family and the various saints, inevitably reflected a European complexion, blue eyes and fair-skinned which I heard one priest describe as the “Iced-lolly” variety.  \nBut this is not the only kind that occurs.  Try this simple Google experiment:  search on “Maori Christ” and click on ‘Images’, and you will see the tattooed moko, the feathered cloaks, and the highly prized huia feather as hair adornment showing high-born status, together with the other cultural features, such as unshod feet.  Doubtless other cultural ‘icongraphy’ also occurs, whether it be Chinese, Korean, or Filipino.  \nThe earliest Shroud-like images of Christ appear to be the St Catherine’s Pantocrator, the Homs vase image, and the gold solidus of 692, all seemingly commissioned by Justinian II.  Following his defeats and eventual reinstatement, Justinian seems to have interpreted his earlier representations as a sign of divine wrath, and abandoned these earlier attempts at realism.  The iconoclastic movement also no doubt played a part. \nHowever the Image of Edessa also seems to have had a major influence in church iconography at this time, and there is an almost universal consistency in the portrayals claiming to be of Mandylion status.  \n I think it is extensive enough to demonstrate that indeed, a single image can and did in fact spark off an artistic revolution across a very wide area!\n\n","date":"December 25, 2015 at 4:27 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217190","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Dan, again sorry to see you go…i’ve been thinking of something you said….that comment about someone saying the shroud was a Catholic relic…not sure if I said it, but it sounds like something I would say.\nIf it was me, I probably said it because someone took a direct or indirect shot at the Catholic faith….that happened from time to time on this blog.\nI also had to smile when you wrote your “if it was up to me” examples in regard to communion and baptism…guess that’s why there are so many denominations…because men say “if it were up to me”…doubt Jesus meant us to have 1000 different interpretations on what he said.\nWhile I understands that we don’t really know where the shroud was early in it’s history….it could have very well been in Catholic hands…..one thing for sure….it’s now where God wants  it…in Catholic hands…whether the shroud is real or not.\nI’ll miss you and this blog…hope you have a great Christmas and good luck with your good work in your church\n\n","date":"December 25, 2015 at 10:26 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217228","author":"rick","site":"shroudstory"},{"title":"Thank You, Everyone","post":"“The earliest Shroud-like images of Christ appear to be the St Catherine’s Pantocrator, the Homs vase image, and the gold solidus of 692, all seemingly commissioned by Justinian II”.\nAbsolutely not. Claudine Chavanne-Mazel (“Popular Belief and the Image of Beardless Christ”, Visual Resources, Vol 19, nº 1; p. 28) says he image of Christ was interchangeabily bearded or beardless from the late third century. The first was representation of wisdom and the second the eternal life. Some examples:\nChrist teacher fresco, Ipogeo degli Aureli, Rome, 3th century,\nhttp://www.nisandbyzantium.org.rs/doc/zbornik6/PDF-VI/09%20Tamara.pdf\nSanta Prudenziana, Roma, 4th century (el Cristo es antiguo; retoques en los apóstoles)\n \nSarcophage, Christ enseignant, Musée du Louvre, Fin du IVe siècle après J.-C.\n \nSanta Constanza, Roma: Cristo entregando la ley a Moisés, mitad del siglo IV\nhttp://jeannetifft.photoshelter.com/image/I0000g0Z4nD61yN8 \nChrist Between Peter and Paul, 4th century, Catacomb of Saints Marcellinus and Peter on the Via Labicana,\n \nMural de la catacumba de Comodilla, finales del siglo IV.\nhttp://contemporaneoshistoriadelarte3.blogspot.com.es/ \nI can not verify the links. I am travelling and I have not many time. The same for translations. In any case, the representation of bearded Christ existed long before the Byzantine iconography of Pantocrator and the Mandylion. Christ represented as bearded philosopher/teacher was an image borrowed from pagan iconography.\n\n","date":"December 26, 2015 at 6:03 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217237","author":"David Mo","site":"shroudstory"},{"title":"Thank You, Everyone","post":"‘ “The earliest Shroud-like images of Christ appear to be the St Catherine’s Pantocrator, the Homs vase image, and the gold solidus of 692, all seemingly commissioned by Justinian II”.\nAbsolutely not. ‘\nThank you for the pictures, David but I see rather more Shroud-like features in the three artefacts I mentioned, than merely long hair and a beard, and these features are not displayed in the pictures you have provided, interesting as they are.  The comment on wisdom vs eternal life is one interpretation which might well be correct, but perhaps another possible interpretation is whether the artist perceived Christ as a Jewish rabbi or was merely reflecting Greco-Roman fashions.  Augustine in the early fifth century of course made the claim that no-one knew Christ’s physical appearance.  But to me and many others, the St Catherine’s Pantocrator, the Homs vase and the 692 solidus display a striking similitude to the Shroud image.  \nI wish you well for the future, and for peace of mind.  daveb\n\n","date":"December 26, 2015 at 2:14 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217254","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Thank You, Everyone","post":"You can consider the similarities which you like, but Christ the Teacher (i.e. as the Louvre sarcophagus, etc.) is usually considered as a version of Pantocrator (your examples). He is a bearded man with a book, depicted often with the right hand raised. He is a symbol of wisdom and truth. He is  not the image of a dead and naked man lying in the tomb. This a big difference.\nThe iconographic sources of the Byzantine Pantocrator are very clear.\n\n","date":"December 27, 2015 at 10:07 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217284","author":"David Mo","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Jews invariably wore beards.\n\n","date":"December 26, 2015 at 8:36 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217240","author":"Louis","site":"shroudstory"},{"title":"Thank You, Everyone","post":"My article on the Templars and their possible possession of the Shroud will be ready in about two or three days, taking Ian Wilson’s hypothesis half a step further.\n\n","date":"December 26, 2015 at 10:44 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217245","author":"Louis","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Maybe there’s a Templar link, maybe not. But one thing’s for certain. This blogger is back with a shameless plug for his own partisan views, one that will now be visible for posterity near the top of Recent Comments ho ho.\nhttps://shroudofturinwithoutallthehype.wordpress.com/2015/12/23/what-happened-to-make-geoffroy-de-charnys-humble-chapel-the-first-undisputed-mid-14th-century-home-of-the-turin-shroud-a-second-ransom-demand/#comment-6595\n Is one permitted to play Santa Claus on Dan’s twilight site, awarding oneself a late Christmas present? Show me where it says one cannot….\nThis is now the cue for Dan to say he is allowing 9 more comments only  so as to preserve in aspic this blogger’s place in the Final Top Ten. …   ;-)\n\n","date":"December 26, 2015 at 12:58 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217252","author":"Colin Berry","site":"shroudstory"},{"title":"Thank You, Everyone","post":"I see Colin is now arguing that the Shroud was never owned by the canons. I am sure he has read through the judgements of the various ecclesiastical courts of the first half of the fIteenth century whichsaid that they did have title as was acknowledged when the Shroud was removed for safe keeping by Margearet’s husband.\nThe canons managed to threaten Margaret with excommunication when she did not give it up and they persisted even after she passed it on to the Savoys in1453. Eventually they had to give up.\nBut no doubt Colin has found alternative sources which deny this.\n\n","date":"December 26, 2015 at 3:29 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217259","author":"Charles Freeman","site":"shroudstory"},{"title":"Thank You, Everyone","post":"P.S. so far as I remember Beldon Scott claims that Geoffrey senior gave the Shroud to the canons.  ( Can’t get to my study to check now we have settled my 95 year old father in law down for the night there,)\nAs it is a mantra of professional historians that all knowledge, especially in the very complex area of medieval texts, is provisional, I am happy for Colin to put forward alternative explanations but it is not clear whether he has read the evidence of the ecclesiastical courts backing the canons and rejected it for some reason or not been aware of it all.\nI can’t be bothered to wade through yet more of Colin’s rapidly changing thoughts as ,as soon as one has read and digested one of his suggestions, he has moved on to another, so probably by the time I am back in my study it will be too late to comment here. Still It is for Colin to build up his own following on his own website. It would be good if he could actually stay still for a bit or come to a conclusion without us having to wade through acres of changing ideas, and not taking them seriously because he may have changed his mind 24 hours later!\n\n","date":"December 26, 2015 at 4:03 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217262","author":"Charles Freeman","site":"shroudstory"},{"title":"Thank You, Everyone","post":"“All Science is either Physics or Stamp Collecting”  Baron of Nelson NZ,  Lord Ernest Rutherford, Physicist, Awarded Nobel Prize in Chemistry, 1908.\n\n","date":"December 26, 2015 at 2:29 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217255","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Thank You, Everyone","post":"When in name-dropping mode, especially where pulling rank or claiming superior social connections are concerned, it’s as well to remember that some stamp collections are superior to others, indeed exponentially so.\nhttps://en.wikipedia.org/wiki/Royal_Philatelic_Collection\nOops. I’ve gone and leapfrogged that affable Louis again under “Recent Comments”… How careless of me.\n\n","date":"December 26, 2015 at 2:58 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217257","author":"Colin Berry","site":"shroudstory"},{"title":"Thank You, Everyone","post":"I have always placed importance on professionals in their fields, particularly in this blog with amateurs disrupting the comments, and have therefore read Colin. I have not always agreed with him, but must say that he has a quality that many scientists (and historians) lack: he is open-minded. He also has a good sense of humour, not surprising given his …err Scotch-Irish ancestry. No doubt, he has also shown bias, but then top “Shroudies” have demonstrated the same thing, at times even taking Shroud studies in the wrong direction. \nColin has raised some very important issues regarding the world we live in, ones that have always kept me thinking without stopping for days and nights. They have guided me in my work, like in the recent interview with Israel’s top biblical archaeologist:\nhttps://www.academia.edu/18994343/The_key_role_of_Biblical_Archaeology_in_Exegesis_An_Interview_with_Professor_Israel_Finkelstein\nAfter the article on the possible Knights Templar- Turin Shroud is ready, I will have to get back to “Jesus of history” studies with a review of an important and lengthy academic book on the topic, going beyond the so-called Third Quest.\nSo it is Jesus everywhere, whether in Shroud studies, historical studies… and existential issues.\n\n","date":"December 26, 2015 at 3:40 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217260","author":"Louis","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Scotch-Irish ancestry? I didn’t realize my ancestors were ethnically so diverse. There I was thinking they hailed mainly from Norfolk and the London suburbs…\nAdmittedly I married a Scot, but didn’t realize that brought with it invasive elements for one’s own genetic make-up. Believe me, I’d have stayed south of the border if I’d realized,  and simply have contented myself with travelogues of Scotland and Ireland over a glass of single malt or Irish whiskey. Will this modern-day Braveheart wake up in the night screaming “Freedom!” and proceed to moon his pale and atavistic warlike bare behind around the English home counties at his fellow sassenachs? Have you any idea about the realities of inclement English weather?\nSilly me, believing all that nonsense they taught me at school about the conservative nature of  DNA replication.\n\n","date":"December 26, 2015 at 4:27 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217263","author":"Colin Berry","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Well, there’s not much difference between the English, the Scots, the Irish and the Welsh. While I was in England what I noticed was the difference in temperament, the Scots and the Irish being very humourous, whether they were drinking Guinness, Bailey’s or whiskey in a pub or not. It was also a great pleasure to do research among the English, who provided the best support and were very educated.\n\n","date":"December 26, 2015 at 4:54 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217264","author":"Louis","site":"shroudstory"},{"title":"Thank You, Everyone","post":"My article will dwell on the face of Jesus and include an image that does not appear in Ian Wilson’s book. Unfortunately  one “clue” that I found while researching medieval history in England many years ago cannot be included because the authorities involved, who should know, were reluctant to provide information when it came to dating. It is precisely the doubts about the dating that made me raise the question and I have decided to leave the “clue” out, encouraged by what historian Eamon Duffy wrote in his history of the popes.\nNow that we will no longer have Dan’s blog, which has been an invaluable source of information, anyone wishing to read the article should contact me through Dan.\nThere is another Jesus image that I have a government’s written permission to publish but have faced the opposition from the people who have to write a report on all the objects found in the region. They want their report published before my paper,\n\n","date":"December 26, 2015 at 2:42 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217256","author":"Louis","site":"shroudstory"},{"title":"Thank You, Everyone","post":"“I have always placed importance on professionals in their fields, particularly in this blog with amateurs disrupting the comments, … ”\nA year’s university course in Critical Thinking administered by their Philosophy Department together with 10 years of auditing, along with 40 years of a professional engineering career and a fulsome life gave me, I think, the discernment to differentiate the definitely true, the probably true, the uncertain, the questionable, and the deliberately false. \nI have never presumed to instruct the webmaster how to administer his blog-site, and I believe there is little that is amateurish in anything I may have written here in the last few years!\n\n","date":"December 26, 2015 at 9:57 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217270","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Thank You, Everyone","post":"The artefact we are discussing is the Turin Shroud, not the rack where Edmund Campion was stretched 4″. The amateurs culled material from sources that they sometimes refused to identify and pasted it on the blog as though the need for spoon-feeding arose. They also attacked the professionals, behaving like self-appoined judges.\nThe webmaster made his blog a very good source of information. The only problem I could find was the lack of moderation, prompting the amateurs to indulge in provocations, character assassination and nasty insinuations.\n\n","date":"December 27, 2015 at 9:52 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217282","author":"Louis","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Today someone told me about\nthe strange ideas of Fomenko …\nWhat do you think about Fomenko?\n>Anatoly Timofeevich Fomenko is the son\nof Timothy Grigorievich Fomenko (Russian:\nТимофей Григорьевич Фоме́нко), an industrial\nengineer, and Valentina Polikarpovna (née\nMarkova) (Russian: Валентина Поликарповна\n Маркова), a philologist and teacher of Russian\n language and literature. His parents would later\nco-author his works on history in 1983 and 1996.\n>Born in Donetsk, then called Stalino, he was\nraised and schooled in Magadan. In 1959, his\nfamily returned to Eastern Ukraine and settled\nin the city of Luhansk, where Fomenko attended\nSecondary School No. 26. During secondary\nschool, Fomenko participated in many competitions\nrelating to mathematics and won several medals\n as a result. …\nLink:\nhttps://en.wikipedia.org/wiki/Anatoly_Fomenko\n>The New Chronology is a fringe theory\nregarded by the academic community as\npseudohistory, which argues that the\nconventional chronology of Middle Eastern\nand European history is fundamentally flawed,\nand that events attributed to the civilizations of\n the Roman Empire, Ancient Greece and Ancient\nEgypt actually occurred during the Middle Ages,\nmore than a thousand years later.\n>The central concepts of the New Chronology\nare derived from the ideas of Russian scholar\nNikolai Morozov (1854-1946), although work\nby French scholar Jean Hardouin (1646-1729)\ncan be viewed as an earlier predecessor.\n>However, the New Chronology is most commonly\nassociated with Russian mathematician Anatoly\nFomenko (b. 1945), although published works\non the subject are actually a collaboration\nbetween Fomenko and several other mathematicians.\n>The concept is most fully explained in History:\nFiction or Science?, originally published in Russian.\n>The New Chronology also contains a reconstruction,\nan alternative chronology, radically shorter than\n the standard historical timeline, because all\nancient history is “folded” onto the Middle Ages.\n>According to Fomenko’s claims, the written\nhistory of humankind goes only as far back as\nAD 800, there is almost no information about\nevents between AD 800–1000, and most known\nhistorical events took place in AD 1000–1500. … …\n>The New Chronology is rejected by mainstream historians… \nLink:\nhttps://en.wikipedia.org/wiki/New_Chronology_(Fomenko)\n\n","date":"December 27, 2015 at 9:24 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217281","author":"piero","site":"shroudstory"},{"title":"Thank You, Everyone","post":"The New Chronology is terribly dated, piero. maybe you weren’t aware that it was replaced in 1963 by The Even Newer Chronology. Taking the New Chronology as its inspiration, it proposed that world history did not in fact start until the mid 19th century (1851 to be precise). How, why you may ask? Well, it’s not easy to summarize in a few sentences, and the clock is ticking where this site is concerned. Suffice it so say that 1851 was the year of the Great Exhibition in Hyde Park London, conceived as a show piece for what then was state-of-the-art engineering. One of its lesser known exhibits was a primitive hologram-generator. A man behind a curtain wound a handle, and history (well, virtual history) was displayed as a faint image on a screen (an intricately-woven linen, or so I’m led to believe). Thus was generated the so-called Middle Ages, and when you wound some more you got the Roman Empire and before that the glories of Ancient Greece, but sad to say the further back you went the fainter the images. It was all fake history, needless to say, since the earliest history is the Dark Ages, before which there was the Even Darker Ages, but you know those Victorians – they liked to put on a show and were very inventive, except when building railway bridges over the Tay  estuary which tended to collapse under the weight of a fully-loaded passenger train.\n Btw, those images are/were exceedingly superficial, a mere 200nm thick some say, though rumour has it there was a little man with a paint pot who used to brush furiously onto the roll of linen as it wound past. According to that theory, the painted linen then went through a high-speeed instant ageing machine before passing in front of the assembled spectators. The latter daren’t blink, however, given the risk that the aged paint would flake off before they had a chance to perceive the image details.\n\n","date":"December 27, 2015 at 10:21 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217285","author":"Colin Berry","site":"shroudstory"},{"title":"Thank You, Everyone","post":"” … except when building railway bridges over the Tay estuary which tended to collapse under the weight of a fully-loaded passenger train.”  Technical Error! \nThe original bridge which collapsed in 1879, was designed by Sir Thomas Bouch.  Bouch had sought advice on wind loading, but surprisingly as a result of that advice failed to allow for wind loading.  The collapse was not caused by the weight of the train, but occurred during a violent storm, and failed because the lateral bracing was insufficient to withstand the wind loading from the storm.  \nI spent some 5 years on Railway bridge construction and another eight years in a Bridge Design Office early in my engineering career, so it’s something I was once expert in.  Most of the early railway bridges in New Zealand were designed by British trained engineers, who failed to account for the local conditions here.  On reviewing the record, we discovered that there had been about 40 failures over 40 years due to foundation scour.  NZ topography results in much steeper river beds, and foundations inevitably have to be in alluvial material rather than bedrock.  Other failures occurred because of inadequate seismic design, a general failure to appreciate the significance of metal fatigue, particularly in notched gusset plates, and also the significance of secondary stresses as a result of eccentric connections.   \nhttps://en.wikipedia.org/wiki/Tay_Bridge_disaster \nWilliam McGonagall of course wrote three of his epic doggerel poems on the Tay Bridge:  1) Upon the construction of the original bridge; 2) Upon its disastrous failure; 3) Upon the replacement bridge.\n\n","date":"December 27, 2015 at 2:29 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217289","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Thank You, Everyone","post":"The New Chronology makes a lot of sense in the world of biblical archaeology and has guided Israel’s top biblical archaeologist, interviewed in October:\n https://www.academia.edu/18994343/The_key_role_of_Biblical_Archaeology_in_Exegesis_An_Interview_with_Professor_Israel_Finkelstein\nWe now know that proof of the existence of Abraham, Isaac and Jacob will probably never be found, that David and Solomon were not that mighty (and good), and were not exactly monotheists. When it comes to Moses things become even more difficult, if we are to rely on the studies of top Egyptologists, biblical archaeologists and biblical scholars. They sing together: there was no revelation at Sinai because man does not see God face to face. One world-renowned biblical archaeologist even went as far as to cite Freud’s classic. That is also roughly the opinion of top theologians in Europe, both Catholic and Protestant, not forgetting some Israeli biblical scholars.\nSo where does that get us?\nGood scientists change their minds as more discoveries are made, as can be seen in Stephen Hawking’s approach. In the last two decades traditional conceptions of order have been challenged by the scientific discovery that ‘chaos’ permeates the behaviour of natural systems in our cosmos. If Einstein were with us today he would be obliged to change his mind about the “harmony” he saw as well as forget about Spinoza becasue he did not go beyond the philosopher.\nOne Anglican priest, who devoted a lifetime to science, also working at NASA for seventeen years, had his own theory to offer:\nhttps://www.academia.edu/16566394/An_introduction_to_chaos_theology\nIt is not the end of faith. Some fine tuning will be needed when it comes to our understanding of the creation story.\n\n","date":"December 27, 2015 at 10:29 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217286","author":"Louis","site":"shroudstory"},{"title":"Thank You, Everyone","post":"I’m surprised and somewhat disappointed, daveb, that you an engineer managed to spot only one of my two deliberate errors.\nThe other of course was the description of the 1851 History Holograph Generator as hand-cranked. It was of course steam-powered, which explains how it was able to achieve its 1 century/min backtrack rating, vastly superior to the inferior US rival machine (the latter quickly withdrawn from the Exhibition).\n\n","date":"December 27, 2015 at 3:42 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217291","author":"Colin Berry","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Quote\n“A year’s university course in Critical Thinking administered by their Philosophy Department together with 10 years of auditing, along with 40 years of a professional engineering career and a fulsome life gave me, I think, the discernment to differentiate the definitely true, the probably true, the uncertain, the questionable, and the deliberately false.”\nUnquote.\nAmateurs need time to think.\n\n","date":"December 27, 2015 at 7:37 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217297","author":"Louis","site":"shroudstory"},{"title":"Thank You, Everyone","post":"And yet there are those who seem incapable of any kind of original creative thought at all, but merely write up what they have heard from others and accept it uncritically, and even get paid for it!\n\n","date":"December 27, 2015 at 10:10 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217299","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Reblogged this on Best of Shroud Story.\n\n","date":"December 27, 2015 at 1:28 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217287","author":"Dan","site":"shroudstory"},{"title":"Thank You, Everyone","post":"Goodnight Mrs. Calabash wherever you are.","date":"December 28, 2015 at 3:48 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","id":"comment-217304","author":"Dan","site":"shroudstory"}]
