[{"title":"Anglican vs Catholic Communion Wafers","post":"‘2 He called a little child to him, and placed the child among them. 3 And he said: “Truly I tell you, unless you change and become like little children, you will never enter the kingdom of heaven. 4 Therefore, whoever takes the lowly position of this child is the greatest in the kingdom of heaven. 5 And whoever welcomes one such child in my name welcomes me.” ‘ Matt 18:2-5\nI don’t imagine that little children have much in the way of advanced knowledge in baryonic science or quantum physics. So maybe Frank Tipler hasn’t quite got all his theory right just yet. Incidentally, scientific determinism  went out at the end of the 19th century with the discovery of quantum mechanics – it’s all probabilities!\n\n","date":"September 24, 2013 at 7:35 am","url":"https://shroudstory.com/2013/09/24/anglican-vs-catholic-communion-wafers/","cat":"science_and_religion","id":"comment-45256","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Anglican vs Catholic Communion Wafers","post":"Clearly, Tippler is on the edge and his work is speculation. Frankly, I have to read it (in my spare time, Ha!) However, Dan, don’t forget Abramoff and his speculation on the relation of quantum mechanics to near death experiences. And then again there is Teilhard.\nWhether Tippler’s speculations are over the top is a possibility. But that he points the way to a direction that science and religion are heading, is another question. Science is treading on religious ground and has been doing so ever since science determined that Mauna Loa wasn’t a god but a volcano.\n\n","date":"September 24, 2013 at 7:53 am","url":"https://shroudstory.com/2013/09/24/anglican-vs-catholic-communion-wafers/","cat":"science_and_religion","id":"comment-45257","author":"John Klotz","site":"shroudstory"},{"title":"Anglican vs Catholic Communion Wafers","post":"Dare I write it again from the not so old but abndoned by the Vatican: “Love makes symbols real.” Thing is, I really believe that. Really!!\nPardon my hang-up on the word “real” but it’s a quantum thing.\n\n","date":"September 24, 2013 at 7:56 am","url":"https://shroudstory.com/2013/09/24/anglican-vs-catholic-communion-wafers/","cat":"science_and_religion","id":"comment-45258","author":"John Klotz","site":"shroudstory"},{"title":"Anglican vs Catholic Communion Wafers","post":"Frank Tippler wrote a very interesting book, however there is no need to explain everything in terms of science. If he read the NT carefully he would quickly grasp the fact that Jesus described himself not only as someone different from the prophets but also from the rest of mankind!\n\n","date":"September 25, 2013 at 8:24 pm","url":"https://shroudstory.com/2013/09/24/anglican-vs-catholic-communion-wafers/","cat":"science_and_religion","id":"comment-45455","author":"Louis","site":"shroudstory"},{"title":"Anglican vs Catholic Communion Wafers","post":"Louis,\nI believe you have a touch of Jansenist in you. Whatever your biblical exegesis. the fact is that the consistent position of the Church for a millennium or so is that Christ was a true man (among other things) and also a true God.\nI quote Elaine Pagels from her landmark work The Gnostic Gospels:\n“In its portrait of Christ’s life and his passion, orthodox\nteaching offered a means of interpreting fundamental\nelements of human experience. Rejecting the gnostic view\nthat Jesus was a spiritual being, the orthodox insisted that he,\nlike the rest of humanity, was born, lived in a family,\nbecame hungry and tired, ate and drank wine, suffered and\ndied. They even went so far as to insist that he rose bodily\nfrom the dead. Here again, as we have seen, orthodox\ntradition implicitly affirms bodily experience as the central\nfact of human life. What one does physically—one eats and\ndrinks, engages in sexual life or avoids it, saves one’s life or\ngives it up—all are vital elements in one’s religious\ndevelopment. But those gnostics who regarded the essential\npart of every person as the “inner spirit” dismissed such\nphysical experience, pleasurable or painful, as a distraction\nfrom spiritual reality—indeed, as an illusion. No wonder,\nthen, that far more people identified with the orthodox\nportrait than with the “bodiless spirit” of gnostic tradition.\nNot only the martyrs, but all Christians who have suffered\nfor 2,000 years, who have feared and faced death, have\nfound their experience validated in the story of the human\nJesus.\n\n","date":"September 26, 2013 at 8:15 am","url":"https://shroudstory.com/2013/09/24/anglican-vs-catholic-communion-wafers/","cat":"science_and_religion","id":"comment-45511","author":"John Klotz","site":"shroudstory"},{"title":"Anglican vs Catholic Communion Wafers","post":"Hullo John\nLooks like you misunderstood me because what I stated is fully in keeping with traditional Christian teaching, agreeing with what the German scripture scholar Father Rudolf Schnackenburg meant when he said that Jesus “hovered” above the Gospels. You may know that Joseph Ratzinger/Benedict VI says in his “Jesus of Nazareth” that he began where Schnackenburg finished and he did a good job too. Yet there is much more he has to say, which he couldn’t say in the series about Jesus, because it is about science. He began this week by asserting that RD had written science fiction.   \nPlease, there is not even a bit of the Jansenist in me. They were more linked with the Calvinists, with their predestination and other issues, with which it is very difficult to agree, and I like biblical studies much more than theology because lately theologians have come up with many strange ideas. While systematic theology is essential for the science-theology dialogue there does not seem to be much consensus when it comes to theologians, in fact I had to tell one scientist-theologian friend of mine that it looked like they have to imitate the icon artists — who pray for inspiration before painting— before they write something.\nRegarding the quotation form Elaine Pagels, it is something one could expect since she had no choice but to say some things like that. At least she admitted what the orthodox thought and did, although she did not agree. There are top scholars, some of them at universities at your end, who have gone much beyond her.\nThat is why your book will be interesting. When do you think you will finish?\n\n","date":"September 28, 2013 at 3:52 pm","url":"https://shroudstory.com/2013/09/24/anglican-vs-catholic-communion-wafers/","cat":"science_and_religion","id":"comment-45751","author":"Louis","site":"shroudstory"},{"title":"Anglican vs Catholic Communion Wafers","post":"Hi, Dan Porter. For the details on how physicist and mathematician Prof. Frank J. Tipler’s Omega Point cosmology precisely matches the cosmology described in the New Testament, see my following article:\nJames Redford, “The Physics of God and the Quantum Gravity Theory of Everything”, Social Science Research Network (SSRN), Sept. 10, 2012 (orig. pub. Dec. 19, 2011), 186 pp., doi:10.2139/ssrn.1974708. http://archive.org/details/ThePhysicsOfGodAndTheQuantumGravityTheoryOfEverything\nAdditionally, in the below resource are six sections which contain very informative videos of Prof. Tipler explaining the Omega Point cosmology, which is a proof (i.e., mathematical theorem) of God’s existence per the known laws of physics (viz., the Second Law of Thermodynamics, General Relativity, and Quantum Mechanics), and the Feynman-DeWitt-Weinberg quantum gravity/Standard Model Theory of Everything (TOE), which is also required by the known laws of physics. The seventh section therein contains an audio interview of Tipler. I also provide some helpful notes and commentary for some of these videos.\nJames Redford, “Video of Profs. Frank Tipler and Lawrence Krauss’s Debate at Caltech: Can Physics Prove God and Christianity?”, alt.sci.astro, Message-ID: jghev8tcbv02b6vn3uiq8jmelp7jijluqk[at sign]4ax[period]com , July 30, 2013. https://groups.google.com/forum/#!topic/alt.sci.astro/KQWt4KcpMVo\n\n","date":"December 5, 2013 at 1:52 pm","url":"https://shroudstory.com/2013/09/24/anglican-vs-catholic-communion-wafers/","cat":"science_and_religion","id":"comment-56762","author":"alphaomegapoint","site":"shroudstory"}]
