[{"title":"The Barefoot Man: It is Christ’s Shroud not Turin’s","post":"As a second generation German American (all four of grandparents were born in Germany well before the turn of  the twentieth century)I found this to be an extraordinary rewarding post. It has value as culinary report but goes much deeper.\nI believe it is Christ’s Shroud because applying Occam’s Razor, it is the simplest explanation of its mysteries. It is also some evidence of the Resurrection.\nOne the article makes is an valuable semiotic/semantic point. Perhaps the time as come when we drop the “Turin” from the Shroud identification and adopt the “Christ’s Shroud” appellation. That strange little man he encountered and the repetition of the encounter on the web, is  an epochal event. In a way, he was playing John the Baptist.\nI believe that the Shroud has been waiting for the moment when human science advanced to the point when we could begin to understand it’s meaning. The issue is not provenance but providence.\nI have two blogs.  The first is more general. The second is focused on the thesis that the Shroud is an allegorical (at least) Second Coming, gifted by Science.\nhttp://johnklotz.blogspot.com\nhttp://quantumchrist-jck.blogspot.com/\n\n","date":"August 17, 2013 at 7:44 am","url":"https://shroudstory.com/2013/08/17/the-barefoot-man-it-is-christs-shroud-not-turins/","cat":"news_&_views","id":"comment-41439","author":"John Klotz","site":"shroudstory"},{"title":"The Barefoot Man: It is Christ’s Shroud not Turin’s","post":"Thank You.  The most obvious use of words.  This is the Shroud of Jesus known to be from Turin.  In the future I will try to remember that it is the Jesus Shroud.\n\n","date":"August 17, 2013 at 2:12 pm","url":"https://shroudstory.com/2013/08/17/the-barefoot-man-it-is-christs-shroud-not-turins/","cat":"news_&_views","id":"comment-41457","author":"Emmett McMahon","site":"shroudstory"},{"title":"The Barefoot Man: It is Christ’s Shroud not Turin’s","post":"When Dominic described his strange encounter, I immediately thought of James K Baxter (1926-1972), arguably New Zealand’s greatest poet.  You can find a compendium of his works at:\nhttp://www.nzlf.auckland.ac.nz/author/?a_id=8&qsid=30\nA potted biography can be found on Wiki.\nLikewise the images of Baxter can also be found, but are rather more respectable than the memory I have of him walking barefoot, and unkempt with straggly beard around Wellington Railway station, sometimes fingering rosary beads. He struggled with alcoholism for much of his life, converted to Catholicism, had a profoundly spiritual awareness, and wrote not only some hard-nosed poetry, plays and other works, but also regular columns for the Catholic newspapers. He was named for James Keir Hardy a notable founder of the Labour movement in Britain, his father a conscientious objector during the Great War was subject to severe military punishment on the front lines. In later life James K founded a commune for waifs and strays at Hiruhirama ( = Jerusalem) on the Wanganui River at the site of an early mission station established by Susan Aubert. He had an intense awareness of Maori spirituality and this permeates some of his work (e.g. “Jerusalem Daybook”). \nI can easily imagine Dominic’s strange little man as a kind of incarnation of Baxter, who brought an awareness of Christ with his presence.  We ought not to dismiss too lightly such as those who unkempt and bedraggled walk our streets.  They may well be closer to Christ than we may imagine ourselves to be. And they may conceal an unrecognised profundity behind their unprepossessing appearance.\n\n","date":"August 17, 2013 at 5:04 pm","url":"https://shroudstory.com/2013/08/17/the-barefoot-man-it-is-christs-shroud-not-turins/","cat":"news_&_views","id":"comment-41462","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Barefoot Man: It is Christ’s Shroud not Turin’s","post":"Yes daveb of wellington, I quite agree with your last paragraph.\nFrancis Thompson, author of the many famous poems (including ‘the Hound of Heaven’) essays, and some books (notably his beautiful ‘Life of St. Ignatius’), was another such character. Thompson was a real misfit and street wanderer for much of his life, but a man of great talent and imagination, and a devout Catholic.\n\n","date":"August 18, 2013 at 2:08 pm","url":"https://shroudstory.com/2013/08/17/the-barefoot-man-it-is-christs-shroud-not-turins/","cat":"news_&_views","id":"comment-41507","author":"kathleen","site":"shroudstory"},{"title":"The Barefoot Man: It is Christ’s Shroud not Turin’s","post":"Thompson’s “The Hound of Heaven” has been one of my favourite poems for very many years. His illness and lack of worldly success made him much more vulnerable than Baxter, but he was probably more of a mystic. He was rescued from obscurity by Wilfred and Alice Meynell.  Baxter’s way of life was deliberate, independent and, apart from his battle with alcoholism, was self-chosen.  Baxter was an incredibly prolific writer, and he was much preoccupied with the theme of death, but he was also able to reach out to the weak and vulnerable, empathise with them and give them emotional support. Much of his poetry has a raw edge to it, reflects human situations, whereas Thompson’s poetic genius seems more concerned with the divine.\n\n","date":"August 18, 2013 at 4:16 pm","url":"https://shroudstory.com/2013/08/17/the-barefoot-man-it-is-christs-shroud-not-turins/","cat":"news_&_views","id":"comment-41517","author":"daveb of wellington nz","site":"shroudstory"}]
