[{"title":"The Belt of Mary","post":"It is sad that the Vatican is so unresponsive about assisting with testing. But I’ve heard this about the Vatican before, that they are difficult to deal with. I think this is regrettable because their resistance and all their long delays give a bad appearance to the Church and makes them seem even less relevant, in an age when the Church really NEEDS to be relevant.\n\n","date":"November 24, 2011 at 10:24 am","url":"https://shroudstory.com/2011/11/24/the-belt-of-mary/","cat":"news_&_views","id":"comment-4968","author":"AnnieCee","site":"shroudstory"},{"title":"The Belt of Mary","post":"I think it is mainly due to all the bad press they get after the C14 dating of 1988 and also, after the 2002 restoration.  I think it’s also due to the fact that there are many researchers in the Shroud world these days with some “not so catholic” agendas !  And don’t worry, the Vatican is no fool about those kind of acting.  I don’t think the Vatican want to gave them some help…  \nSo my friend, I think we will have to be VERY patient until new direct tests can be performed on the Shroud.  VERY partient…  I really think they want to let things calm down a bit regarding the Shroud and that can be a long process.  \nAs some have said :  The time of the Church is not the time of the world !!! ;-)\n\n","date":"November 24, 2011 at 11:40 am","url":"https://shroudstory.com/2011/11/24/the-belt-of-mary/","cat":"news_&_views","id":"comment-4973","author":"Yannick Clément","site":"shroudstory"},{"title":"The Belt of Mary","post":"I just want to give my point of view on relic like the belt of Mary :  as a catholic, I just don’t understand why people want to venerate those king of material things that bring nothing spiritually.  The Shroud and even the Sudarium of Oviedo are in another category because when we contemplate the image on the Shroud or the stains on the Sudarium, it can be a real good help for our meditation on the life, the Passion, the death and the resurrection of Christ.  But the belt of Mary ?  COME ON !  To me, that’s like we get back to the Middle Ages again…\n\n","date":"November 24, 2011 at 11:44 am","url":"https://shroudstory.com/2011/11/24/the-belt-of-mary/","cat":"news_&_views","id":"comment-4974","author":"Yannick Clément","site":"shroudstory"},{"title":"The Belt of Mary","post":"Well, in fact the Church has got her own rythms…….and ways.\nRecently, a comment was posted mentioning the following paper on the Shroud G. Fazio & G. Mandaglio. Stochastic distribution of the fibrils that yielded the Shroud of Turin body image. Radiation Effects and Defects in Solids 2011; 166 (7) :476-479.As I mentioned in a previous comment I have decided to focus on this kind of literature. Since this journal is peer-reviewed and belongs to the JCR, last week, I ordered a copy.\nBefore any discussion on its content, I was surprised that in “Acknowledgements” (pp.5) the authors “ wish to thank the “Arcidiocesi di Torino”, who has furnished the photographs of the Shroud of Turin taken after the 2002 restoration.”\n\n","date":"November 24, 2011 at 3:09 pm","url":"https://shroudstory.com/2011/11/24/the-belt-of-mary/","cat":"news_&_views","id":"comment-4978","author":"Gabriel","site":"shroudstory"},{"title":"The Belt of Mary","post":"The content of this paper is based on a very close-up analysis of the fibers which leads the authors to the conclusion that colouring pattern distribution on affected fibers is stochastic (random). To reach such a conclusion, the analysis can only be carried out with very high resolution images which can provide details at the fiber scale.\n\n","date":"November 24, 2011 at 3:11 pm","url":"https://shroudstory.com/2011/11/24/the-belt-of-mary/","cat":"news_&_views","id":"comment-4981","author":"Gabriel","site":"shroudstory"},{"title":"The Belt of Mary","post":"I think they just confirmed what STURP had already concluded which, in my mind, proves that the STURP team did a very great job !  Some close-ups of the fibrils from Mark Evans of STURP seem to show exactly what the authors you cite conclude.  And, by the way, this conclusion, for me, seem to go well with the hypothesis of Ray Rogers about the thin layer of sugar that would have been colored during the image formation process.  Since this layer would have been put mainly on the surface of the Shroud by a natural phenomenon called “evaporation-concentration”, I think it’s fair to assume that this layer of impurity would have been concentrated at the surface of the cloth in a random manner.  To me the fact that the coloration is found in a random manner on the Shroud is another good clue (along with some other clues) that Rogers was right about his hypothesis that it was a thin layer of sugar that was colored.  But again, only direct chemical tests of some samples from the Shroud surface could determine without any doubts if Rogers truly was correct about this very important aspect of the question regarding the image formation.\n\n","date":"November 24, 2011 at 4:33 pm","url":"https://shroudstory.com/2011/11/24/the-belt-of-mary/","cat":"news_&_views","id":"comment-4993","author":"Yannick Clément","site":"shroudstory"},{"title":"The Belt of Mary","post":"By the way, the belt of Mary is not owned by the Vatican. It is kept in the Greek Orthodox monastery of Vatopediu in Mount AThos http://www.youtube.com/watch?v=vNE7AfScV3E\n\n","date":"November 24, 2011 at 3:13 pm","url":"https://shroudstory.com/2011/11/24/the-belt-of-mary/","cat":"news_&_views","id":"comment-4984","author":"Gabriel","site":"shroudstory"},{"title":"The Belt of Mary","post":"No matter who owns it, I found this kind of worship to look like the Middle Ages.\n\n","date":"November 24, 2011 at 3:46 pm","url":"https://shroudstory.com/2011/11/24/the-belt-of-mary/","cat":"news_&_views","id":"comment-4991","author":"Yannick Clément","site":"shroudstory"},{"title":"The Belt of Mary","post":"Fazio and Mandanglio seem to support a natural biochemical mechanism for the formation of the image. However, the stochastic nature of the fibers affected by coloration poses a major additional challenge for any Shroud formation theory.\n\n","date":"November 24, 2011 at 3:17 pm","url":"https://shroudstory.com/2011/11/24/the-belt-of-mary/","cat":"news_&_views","id":"comment-4986","author":"Gabriel","site":"shroudstory"},{"title":"The Belt of Mary","post":"It don’t seem to have been the case for Rogers !!! ;-)  If it was really a thin layer of impurities made of sugar that was colored at the surface, I don’t see any problem at all regarding this conclusion that the coloration is found in a random manner.  Of course, that doesn’t told us what was the mechanism of image formation but this conclusion, as I said, seem to confirm STURP conclusion about the random repartition of the coloration and seem to give more support for Rogers hypothesis about the thin layer of sugar.  So, it’s not a banal conclusion !  By the way, it’s interesting to see that there’s still some researchers that support a natural biochemical mechanism for the image formation !  I can see that I’m not the only one… ;-)\n\n","date":"November 24, 2011 at 4:38 pm","url":"https://shroudstory.com/2011/11/24/the-belt-of-mary/","cat":"news_&_views","id":"comment-4994","author":"Yannick Clément","site":"shroudstory"},{"title":"The Belt of Mary","post":"If those images are not the HAL-9000 images, they really have a very high resolution…What seems to me fascinating of their work (in a peer-reviewed, JCR journal) is that all the affected fibers have the same degree of colouring and it is only the proportion of coloured fibers by unit area that provides a 3D effect to the naked eye. Furthermore, inside each unit area the distribution of colured fibers is random.  Any image formation theory must also explain why a fiber is coloured and its neighbour is not.\n\n","date":"November 24, 2011 at 4:28 pm","url":"https://shroudstory.com/2011/11/24/the-belt-of-mary/","cat":"news_&_views","id":"comment-4992","author":"Gabriel","site":"shroudstory"},{"title":"The Belt of Mary","post":"To answer your last question, personally I don’t think it’s a so great mystery than most people think !  I think this is almost completely due to the evaporation-concentration phenomenon that Rogers talked about.  We have to assume that a natural phenomenon like that WOULD NOT distribute the sugar in an homogeneous way on the surface of the cloth.  At the end of the process, we can assume also that some superficial fibrils will have a thin layer of sugar on top of them, while some other fibrils would not (even if they could be located just beside the one who possess this layer).  I think the natural phenomenon called “evaporation-concentration” is the great responsible for this observation on the Shroud.  Again, of course, more chemical and microscopic analysis will be necessary to know if my feeling is right about that.  For the moment, I really think the explanation I just gave you is the most logical we have to explain this observation…\n\n","date":"November 24, 2011 at 4:45 pm","url":"https://shroudstory.com/2011/11/24/the-belt-of-mary/","cat":"news_&_views","id":"comment-4995","author":"Yannick Clément","site":"shroudstory"},{"title":"The Belt of Mary","post":"Again, I’ll say it to you Gabriel and to all of you who will read this :  GO AND BUY ROGERS BOOK !  You will learn lots of things about the Shroud…  I truly recommand this book to anyone interested in Shroud science.  It’s a must !!!\n\n","date":"November 24, 2011 at 4:47 pm","url":"https://shroudstory.com/2011/11/24/the-belt-of-mary/","cat":"news_&_views","id":"comment-4996","author":"Yannick Clément","site":"shroudstory"},{"title":"The Belt of Mary","post":"Honestly, I don’t know what to think……I don’t know so much chemistry as to decide by myself if such a mechanism can colour one fibre but not the next one……It is such a small case (micrometers)…… The authors also seem to be in favour of a biochemical mechanism and their results represent an important difficulty for the energy field/radiation hypothesis since all the affecetd fibers have the same degree of colouring and does not vary with distance…….I have to think it all over\n\n","date":"November 24, 2011 at 5:25 pm","url":"https://shroudstory.com/2011/11/24/the-belt-of-mary/","cat":"news_&_views","id":"comment-4997","author":"Gabriel","site":"shroudstory"},{"title":"The Belt of Mary","post":"I agree totally with the thinking of those authors…  Those body images seem to me like they came from a chemical reaction between the cloth and the corpse and all the facts, observations and conclusions I’ve read from STURP papers, Rogers book or Adler’s book just confirm this idea.  Of course, it’s not a 100% sure bet but it is the most probable and logical kind of process in the circumstances of a burial Shroud with a dead and tortured body in it…\n\n","date":"November 24, 2011 at 5:38 pm","url":"https://shroudstory.com/2011/11/24/the-belt-of-mary/","cat":"news_&_views","id":"comment-5000","author":"Yannick Clément","site":"shroudstory"},{"title":"The Belt of Mary","post":"If we come to statistics, there is another point. The only record in history of a milliard or similar chemical reaction on a linen, takes place precisely short before the only resurrection in History and still would NOT be connected.Two unique records in History take place  at the same place and in almost the same time frame. One of them (image formation) is natural, has never taken place again and is not reproducible. The other one (resurrection) is not natural, has never taken place again and is not reproducible. If you break the time and space connection between both, it seems statistically more feasible. I mean, this would be an argument in favour of a medieval forgery somewhere in Europe, because two unique events in History would be more separated……\n\n","date":"November 25, 2011 at 12:34 pm","url":"https://shroudstory.com/2011/11/24/the-belt-of-mary/","cat":"news_&_views","id":"comment-5008","author":"Gabriel","site":"shroudstory"},{"title":"The Belt of Mary","post":"My previous comment is based on the “black swan” theory. http://en.wikipedia.org/wiki/Black_swan_theory . I think it can be applied to this case. Which are the probabilities for 2 unique events (black swans=image formation (natural but not reproducible)+resurrection(not natural)) of taking place at the same location (a jewish tomb) and time(more or less 9 April 30 CE) in world History?\nThese probabllities must be very close to 0. If we either\ni)connect the two events and we only have one black swan (the image is a byproduct of resurrection) or\nii)separate both events (the image is medieval forgery)\nin both cases, the probabilities must be higher\n\n","date":"November 25, 2011 at 1:49 pm","url":"https://shroudstory.com/2011/11/24/the-belt-of-mary/","cat":"news_&_views","id":"comment-5010","author":"Gabriel","site":"shroudstory"},{"title":"The Belt of Mary","post":"Hello Gabriel !\nYour interesting comment deserves a reply from me.  I’ll expose you my reflection on this question and I hope that will help your own reflection.  Of course, I don’t pretend I have the Truth about all this but maybe I’m close…\nYou wrote : “One of them (image formation) is natural, has never taken place again and is not reproducible”.  This argument is often used by the pro-supernatural people and it’s a bad argument from my point of view.   They use it to make believe that since there’s only one cloth with a body image on it (by the way, this is false.  Remember the Jospine matress ?), there’s only one possibility to explain the Shroud : a supernatural event.   To me, that’s too simplistic. \nOn this particular question, we have to consider as a fairly good possibility that those body images (with their proper chemical and physical properties) could not have been formed other than by a natural chemical interaction between A TORTURED AND  CRUCIFIED BODY and A LINEN BURIAL SHROUD PREPARED IN THE ANCIENT WAY DESCRIBE BY PLINY THE ELDER.  If this is correct, that would mean that it is logical to assume that there was other body images formed on linen burial shroud through history but those other cloths have not survived (on this topic, see this very good text : http://www.shroudstory.com/faq-burial-of-caiaphas.htm).  Why ?  Simply because they were burial shroud and they all disappeared with the rotting of the corpse !  All that the archaeologists can find sometimes is only tiny remains of burial Shroud, so it’s normal that no body images can be seen on those samples…  \nIn that sense, we cannot talk about a “unique record” when it comes to the Shroud of Turin.  I think it would be more realistic to talk about a very rare event, because we can assume that it took many “good conditions” for the beginning of this chemical reaction before the corpse started to decay.  But “unique” ?  I don’t think so.  Not in the sense you mean.  To me, the uniqueness of this cloth is the fact that it was preserved through history and that the corpse that was wrapped in it disappeared without any traces before the first signs of putrefaction !  And that’s where the resurrection of Jesus enter the portrait !  If the disciples were not convinced that Jesus was resurrected, you can bet your house that they would never have kept this impure burial cloth !  It’s only in the light of the resurrection as an historic event, that we can understand why some disciples would have kept this Shroud and why it is still here with us today !  And in that sense, the Shroud is really a “unique record” (and the resurrection event too, of course !).  So, to me, the “unique record” is not to be found so much in the body images than in the fact that this authentic burial cloth (that has really contained a dead body) was preserved with great care !!!  \nIn this context, It is possible to believe that the Will of God is responsible for the Shroud images in the sense that the possible chemical reaction that was at work in the tomb to form those images was completely stopped at the right time when the body disappeared, without disturbing those images or the blood decals on the cloth.  In that sense, the resurrection can be seen by the faithful as the big responsible for the high quality of the body images, because the disappearing of the corpse came at the best moment to stop the chemical reaction, so that it prevent a color saturation that would have destroyed the quality of the body images.\nIn that sense, the Shroud with his body images of so high quality can be really seen as a miraculous event ! \nOf course, this is just my personal opinion and you can think otherwise.\nP.S. :  I correct your date :  The crucifixion of Jesus happened more likely the 7th of april of the year 30. ;-)\n\n","date":"November 25, 2011 at 4:21 pm","url":"https://shroudstory.com/2011/11/24/the-belt-of-mary/","cat":"news_&_views","id":"comment-5014","author":"Yannick Clément","site":"shroudstory"},{"title":"The Belt of Mary","post":"Yannick, I need some time to think about it all…..However, although I understand you don’t support it, I see this theory is rather near to a supernatural byproduct explanation not in the classical approach by Fanti et al, but  in the sense that a supernatural Will should have acted at a very accurate moment to stop a natural process (the chemical reactions) that were taking place. I stil see two black swans (God’s double Will stopping reactions and resurrecting His Son) simultaneously operating in the early morning of April 9th…..However, I am truly confused because the whole set of evidences seem impossible to be organized in a rational way. Being rather newby at this issue of the Shroud I feel I am walking more and more into a very slippery area……\n\n","date":"November 25, 2011 at 5:25 pm","url":"https://shroudstory.com/2011/11/24/the-belt-of-mary/","cat":"news_&_views","id":"comment-5019","author":"Gabriel","site":"shroudstory"},{"title":"The Belt of Mary","post":"April 7th Gabriel !  It’s april 7th…  A small detail but this is the right date.\nYou said : “I feel I am walking more and more into a very slippery area……”  Don’t worry my friend, I’ve felt the same way than you do !  I had to do a very long reflection with a lot of scientific reading before I could have some clear view of the situation and even then, I must admit that many things are still unclear !  The mystery is alive and well.  But in my mind, this Shroud is the authentic burial Shroud of Christ and even if I don’t think the resurrection had a direct impact on the images (in the sense of a by-product), I still think it those images were part of God’s plan nevertheless.  I think God is wise enough so he could use the Wonders of his Creation to do what he wants.  I really think the resurrection (dematerialization of Jesus body) happened at the best possible moment so the chemical reaction that was in place was stopped just as the body images were nearly perfects and just before the coloration could saturated the cloth.  And in that sense, I think the resurrection had something to do with the images but not in the Hollywood-like manner that many people think…  I think God doesn’t need to use lasers or radiations or electric discharge to do what he want !  In my mind, God is much more subtle than that.  That’s my profound belief.  Look at the gospels.  When they talk about Jesus miracles, you never read something like “There was a burst of light (or a burst of energy) coming out of him so the person was healed !”.  One time we read that a force came out of him but I really think we shouldn’t read that line in the litteral sence.  I think, like many gospel parts, that it was just an image that was used…\n\n","date":"November 25, 2011 at 5:45 pm","url":"https://shroudstory.com/2011/11/24/the-belt-of-mary/","cat":"news_&_views","id":"comment-5020","author":"Yannick Clément","site":"shroudstory"},{"title":"The Belt of Mary","post":"Lets take another look at this, another point of view lets say; One thing which is probably the most important point is the fact that the blood stains left on the Shroud are ‘UNDISTURBED’ with absolutely no sign they have been ‘pulled’ from a body and leaving exact forensic blood-flow imprints as would have been expected on the body, which means the body must have simply vanished from beneath the cloth!..It is basically clear-cut there is no image beneath the blood (concluded by many including Adler, Rogers etc). Basically eliminating any ‘forgery’, conclusively, and proving something ‘very’ strange occurred…Now the milliard reaction; it does not answer many questions, such as; Why is the image not MUCH denser on the dorsal side? and How could vapours react to the same depth on the fibrels when touching a cloth and also too fibrels centimeters from it or color one fiber and not another immediately adjacent to it or most intriquing to reproduce a complete and perfectly defined body image from all points equally? Including hair, eye sockets and any orifices! This hypothesis is just full of too many unanswered questions, AND PLEASE remember even Rogers admitted it didn’t answer the question completely for the Image formation ( I think he had his doubts to his hypothesis himself). I personally think there is enough evidence pointing us to this being a result of the resurrection DIRECTLY and not just a ‘by-product’ of such. A ‘mechanism’ which science will never understand, as I believe God intended. This leaves one wondering would God just sit and wait for a natural chemical reaction to occur before removing the body alas to create these images? Sorry but this sounds rediculous to me, to be honest. These images are there only through the power of God and to say it simply; therefore there can be NOTHING NATURAL about them.\nR.\n\n","date":"November 28, 2011 at 5:08 am","url":"https://shroudstory.com/2011/11/24/the-belt-of-mary/","cat":"news_&_views","id":"comment-5053","author":"Ron","site":"shroudstory"},{"title":"The Belt of Mary","post":"Oh and most recent conclusions put the crucifixion date at April 3, 33.\nR.\n\n","date":"November 28, 2011 at 5:13 am","url":"https://shroudstory.com/2011/11/24/the-belt-of-mary/","cat":"news_&_views","id":"comment-5054","author":"Ron","site":"shroudstory"},{"title":"The Belt of Mary","post":"Again Ron, your interesting comment deserves a reply from me.  I’ll take it point by point :\n1-I totally agree with you that the undisturbed blood stains are one of the most important aspects of the Shroud when it comes to talk about the possible effect of the resurrection on this piece of cloth.  Maybe science one day will be able to explain this fact rationally, but for the moment, science is not able to fully explain this.  It’s a mystery that can relate directly to the resurrection event.  But to see a connection there, someone need faith first, even if science cannot explain it (at least, for the moment) !  In fact, the sign of the blood stains undisturbed was the only clear sign of the resurrection for the doctor Pierre Barbet and I think the same, personally.  Contrary to most people, I always think that the sign of the resurrection is to be found in the blood stains and not directly in the body images.\n2-For the Maillard reaction, I agree with you.  Read again my recent posts !  I never claim that the hypothesis of Rogers, alone, could explain everything.  But, at the same time, I really believe that this chemical reaction involving a gaseous diffusion is a part of the image formation process, and maybe a very big part.  For the moment, my reflection leads me to search for a hybrid formation process involving a gaseous diffusion but also, something else.  This something else can be many thing and more researches would be necessary to know more about that.  I tend to favor some kind of molecular transfer from some biological product that could have been present on the skin (and maybe also in the derma of the skin).  But what exactly ?  I’m not sure yet, even if I have some ideas in mind…  But I repeat it, just to be clear :  the hypothesis of Rogers, alone, don’ t seem to be enough to fully explain the totality of the images.  But, while I wrote that, I must admit that, since we don’t know for sure what caused the images, who knows ?  Who knows if some rare conditions were present in the tomb during those 36-40 hours before the shroud was found empty and those conditions could have favored the image formation from a gaseous diffusion alone ?  Who knows ?  So, I’ll leave the door open for this possibility, even if it’s not the most probable answer in my mind.  I think a combined and complex chemical process involving a gaseous and a molecular transfer can be closer to the truth…\n3-Now, for the good questions you ask, I’ll give you my own answers (it’s just my personal opinion of neophyte) :\na.Why is the image not MUCH denser on the dorsal side?  It’s bizarre that you ask this question because, in my mind, if a gaseous diffusion would be the only responsible for the formation of the images, I would expect that the frontal side would be much more denser !  In normal condition, a gas go up and not down !  So, why both images doesn’t possess a big difference in color density ?  I think it’s because the fact that it was generally just a thin layer of impurity that have been colored.  If it would have been the linen fibers themselves that have been colored, in a gaseous diffusion context, I don’t see why there would not have been more color penetration in the frontal side since those gas goes up and not down.  But since it’s not the case (except maybe for the image of the hair, the mustache and the beard), I think the answer is to be found in the real possibility that it was just a thin layer of impurity (more or less the same on the frontal and back side) that have been colored.  I have to admit that this fact is one of the hardest for me when it comes to think that the hypothesis of Rogers, alone, can explain everything.  Normally, if it was only a gaseous process, I would expect to see a denser image in the frontal part of the Shroud.  That’s the way I see it.  I agree that the dorsal image is harder to explain by a natural process than the frontal image.  But it’s not because it seemed harder to explain it that I will start to look for some kind of miraculous process or some by-product of the resurrection !  Nature can be surprising !!!\nb.How could vapours react to the same depth on the fibrels when touching a cloth and also too fibrels centimeters from it or color one fiber and not another immediately adjacent to it or most intriquing to reproduce a complete and perfectly defined body image from all points equally?  I think a big part of the solution is again to be found on the good possibility that it was generally just a thin layer of impurity that has been colored on the surface of the cloth and to the fact that this layer of impurity was created by the evaporation-concentration phenomenon.  I’m not an expert in chemistry but I have a hard time to think that this natural phenomenon could leave a completely homogeneous layer on the surface.  That’s why I think it’s normal that the STURP team has found some non-colored fibers adjacent to some colored fibers in the body image region.  That’s the only rational answer I’ve found to this day for this particular question.  Here, I have to say that this layer of impurity is independent of the hypothesis of Rogers concerning a gaseous diffusion in the sense that it could well be another image formation process that could have colored the impurity layer (for example, we can think of some other products that could have created a chemical reactions).  I really think a big part of the mystery is due to the possibility that it was just a thin layer of impurity that was colored during the image formation process.  And if it’s true, then that mean that the image formation process was really mild because, generally, it wasn’t able to colored the linen fibers themselves.\n4-You wrote : “This leaves one wondering would God just sit and wait for a natural chemical reaction to occur before removing the body alas to create these images?”    The easy answer for me would be to say : Why not ?  Why God could not have used the laws of his creation to leave an imprint on this cloth ?  When I said that, for me, the body disappeared at the right time, I was only reporting a reality we can see (of course, in the context of a natural process of image formation).  So, in that regard, it’s pretty evident that if the body would have left the Shroud much sooner or much later, we would not have those body imprints with very high resolution !  In other word, when the body left the Shroud, the timing seemed to be right !  And if it’s what really happened 2000 years ago, then we have to think it was part of God’s Will.  Why it would have been that way ?  I don’t know !  Maybe it’s simply because God wanted to leave us a sign of the resurrection (and a picture of himself !) and not a proof of this event, so that we can still be free to believe in it or not.  This is my guess.  In front of a proof, how can someone still be free ?  And God wants his children to be free !!!  How can you love if you’re not free ?  He doesn’t want us to be forced to believe in him or not.  I really think so !  So, I just can’t imagine why he would have left a proof of the resurrection on a piece of cloth…  That just doesn’t fit.  So, my answer to your question is this :  if God used the laws of nature to create an imprint of his body, maybe it’s just because he didn’t wanted to leave a proof of this event so that we can still be free !!!  Meditate on that…  Talking about the bizarre Will of God, I can ask you :  Why did God had to roll the bog stone in front of the tomb if his body simply disappeared ?  My answer would be the same : the leave a sign (and not a proof) of his resurrection !\nI think we should see the Shroud as a great sign of the resurrection of Jesus-Christ and not try to find any proof of it.  That’s what I think and it’s only my personal reflection on the subject.  One thing’s for sure : I don’t need the Shroud to believe in the resurrection !  But I’m happy that he’s there for my personal meditation.\n\n","date":"November 28, 2011 at 3:24 pm","url":"https://shroudstory.com/2011/11/24/the-belt-of-mary/","cat":"news_&_views","id":"comment-5064","author":"Yannick Clément","site":"shroudstory"},{"title":"The Belt of Mary","post":"We can discuss a long time on this debate.  I prefer the date of 7 april 30 because it come from the gospel of John who was most probably the only of the 4 writers of the Gospel to have been a direct eye witness of the event.  Look at the Shroud and you can see that I’m right about that !!!  John was there and he saw everything…\n\n","date":"November 28, 2011 at 9:33 am","url":"https://shroudstory.com/2011/11/24/the-belt-of-mary/","cat":"news_&_views","id":"comment-5058","author":"Yannick Clément","site":"shroudstory"}]
