[{"title":"The Day Was Not About the Shroud","post":"Dan,\nThanks for this post and its invaluable links.\n\n","date":"June 22, 2015 at 5:58 am","url":"https://shroudstory.com/2015/06/22/the-day-was-not-about-the-shroud/","cat":"2015","id":"comment-203179","author":"John Klotz","site":"shroudstory"},{"title":"The Day Was Not About the Shroud","post":"According to News- “Skeptics say the cloth bearing the image of a crucified man is a medieval forgery.”\nWithout any proof how these skeptics say “image is a medieval forgery”\nAre their decision based on controversial Carbon Dating Results? or based on Mr. Freeman’s hypothesis of “painting”? or any other reason?\n\n","date":"June 22, 2015 at 5:00 pm","url":"https://shroudstory.com/2015/06/22/the-day-was-not-about-the-shroud/","cat":"2015","id":"comment-203261","author":"Sampath Fernando","site":"shroudstory"},{"title":"The Day Was Not About the Shroud","post":"No, it can’t be based on anything of mine as I always argue that the Shroud was never created to deceive but was a cloth created for some other liturgical function but  which was adopted as a relic.\nIt was a painting if the early depictions are anything to go by, but with the surface disintegrated we appear to only be left which the discoloured linen under the gesso and paint.\n\n","date":"June 23, 2015 at 12:10 am","url":"https://shroudstory.com/2015/06/22/the-day-was-not-about-the-shroud/","cat":"2015","id":"comment-203298","author":"Charles Freeman","site":"shroudstory"},{"title":"The Day Was Not About the Shroud","post":"Reminder  for Charles: \nWhat makes a detective good is the ability to notice small details. In this light, the TS just cannot have been a gessso-coated painted canvass that ‘entirely’ flaked off.\nAs such It just could not account for the following archeological bloodstain patterns (among several others):\n– The negative impression left by three bent and tensed fingers (little, middle and ring fingers) in the bloodstain on the left heel area (the impression being that of a left hand in a position typically of someone strengthening the hold of the TS man’s left foot (with the missing thumb and index fingers naturally placed on the top of the TS man’s foot) or, in other words, the unusual marks left by three fingers in the blood running down from the hole in the left foot \n-The shooting-star-shaped like diluted bloodstain passive pattern off right elbow consistent with body wrapped up in shrouds and diluted blood droplet first pearling at elbow tip to be drained from the corpse and then, running down (over an air-gap and/or screening object) according to a parabolic trajectory to finally fall down onto the edge of the long inner winding burial sheet.\nBesides and last but not least, there was no reason for gesso since the long canvass used as an alleged “liturgical cloth” ‘alike a long standard of Christians’ Salvation) could not have been intended to be stationary as wall hanging! Indeed gesso was NOT to be used (unless you think the medieval super genius artist was also dumb!) because it would have interfered with its very flexibility, seeing that the gesso would crack if it was rolled up or folded in several layers.\n\n","date":"June 23, 2015 at 2:55 am","url":"https://shroudstory.com/2015/06/22/the-day-was-not-about-the-shroud/","cat":"2015","id":"comment-203312","author":"Max patrick Hamon","site":"shroudstory"},{"title":"The Day Was Not About the Shroud","post":"Max,\nExcellent post. \nWhat it demonstrates once again is what I call the blind men and the elephant syndrome. Charles is a art historian. Thus for him to be relevant the Shroud must be a painting, Thus he can not see is a science, Forget about non-art history, forget about biblical exegesis, forget about the pathologists who have demonstrated that the image of the man in the Shroud accurately portrays features  that a medieval painter could have not possessed the  knowledge or the means  to create, forget that scientific examination brought to light attributes that were invisible until fluoresced.\nCharles is an “art historian” therefore it is a painting.\n\n","date":"June 23, 2015 at 3:43 am","url":"https://shroudstory.com/2015/06/22/the-day-was-not-about-the-shroud/","cat":"2015","id":"comment-203318","author":"John Klotz","site":"shroudstory"},{"title":"The Day Was Not About the Shroud","post":"John, according to the Wikipedia entry on Charles he is not an “art historian”. He is a “historian”. I would think there is a significant difference.\nThomas de Wesselow is a highly credentialed art historian. \nJohn, you are a lawyer. I presume in a court the art historian would hold greater expert authority than a historian in terms of the art historical aspects of the Shroud?\n\n","date":"June 23, 2015 at 4:26 am","url":"https://shroudstory.com/2015/06/22/the-day-was-not-about-the-shroud/","cat":"2015","id":"comment-203325","author":"Thomas","site":"shroudstory"},{"title":"The Day Was Not About the Shroud","post":"I am familiar with Freeman’s Wikipedia entry. I deliberately forego snipping about it, He simply isn’t in De Wesselow’s league.\n\n","date":"June 23, 2015 at 7:54 am","url":"https://shroudstory.com/2015/06/22/the-day-was-not-about-the-shroud/","cat":"2015","id":"comment-203345","author":"John Klotz","site":"shroudstory"},{"title":"The Day Was Not About the Shroud","post":"Thank you, John.\nThe fact is Charles is described in Wiki as “a scholar and freelance historian specializing in the history of ancient Greece and Rome” not an art historian. How could he otherwise have confused the simple notion of a mirror image for a negative image? How could he otherwise have thought TS image details are totally irrelevant? How could he otherwise have such a poor descriptive knowledge of the TS image?\n\n","date":"June 23, 2015 at 4:47 am","url":"https://shroudstory.com/2015/06/22/the-day-was-not-about-the-shroud/","cat":"2015","id":"comment-203327","author":"Max patrick Hamon","site":"shroudstory"},{"title":"The Day Was Not About the Shroud","post":"Sampath, there is a book for you to read that will clear many of your doubts. It is Ian Wilson’s “The Shroud. The 2000-year-old mystery solved”.\nSTURP did a good job, but there are tiny gaps to be filled that will require another hands-on examination, mostly non-invasive. As for your other doubts:\nhttp://www.catholicherald.co.uk/news/2014/10/29/scientist-dismisses-new-turin-shroud-claims/\n\n","date":"June 22, 2015 at 5:32 pm","url":"https://shroudstory.com/2015/06/22/the-day-was-not-about-the-shroud/","cat":"2015","id":"comment-203264","author":"Louis","site":"shroudstory"},{"title":"The Day Was Not About the Shroud","post":"The Catholic Herald did not address any of the real issues in my article and I sent a letter of complaint to the Editor in that his chosen expert did not seem to know anything about the medieval context which my article was concerned with.  What we need to work from is the mass of depictions which have not in themselves faded and other info. such as medieval treadle looms and the iconography of the front and back scourge marks.\nThere was no evidence from anything I have read of Barrie’s that he is up to speed on the medieval context within which my article was set and I am surprised the Herald did not ask a medievalist to comment. Still one cannot control what the press say. Anyone who wants to read my arguments can easily find my article in  a Google search under Shroud Turin and apparently it continues to be widely read.\n\n","date":"June 23, 2015 at 12:21 am","url":"https://shroudstory.com/2015/06/22/the-day-was-not-about-the-shroud/","cat":"2015","id":"comment-203299","author":"Charles Freeman","site":"shroudstory"},{"title":"The Day Was Not About the Shroud","post":"Thank you Louis. I know that image was created by some sort of Supernatural activity.\nYes I am 100% agreeing with Mr Schwortz .\n\n","date":"June 22, 2015 at 6:18 pm","url":"https://shroudstory.com/2015/06/22/the-day-was-not-about-the-shroud/","cat":"2015","id":"comment-203274","author":"Sampath Fernando","site":"shroudstory"},{"title":"The Day Was Not About the Shroud","post":"You’re welcome.\n\n","date":"June 22, 2015 at 6:23 pm","url":"https://shroudstory.com/2015/06/22/the-day-was-not-about-the-shroud/","cat":"2015","id":"comment-203275","author":"Louis","site":"shroudstory"},{"title":"The Day Was Not About the Shroud","post":"We will hope other 17 years before Mr. Schwortz can be able to understand that what many sceptics think is that the Shroud was not painted as now appears. It seems a more difficult task than discovering the  formation process.\n\n","date":"June 23, 2015 at 2:24 am","url":"https://shroudstory.com/2015/06/22/the-day-was-not-about-the-shroud/","cat":"2015","id":"comment-203308","author":"David Mo","site":"shroudstory"},{"title":"The Day Was Not About the Shroud","post":"Correction: We will await…\n\n","date":"June 23, 2015 at 2:26 am","url":"https://shroudstory.com/2015/06/22/the-day-was-not-about-the-shroud/","cat":"2015","id":"comment-203309","author":"David Mo","site":"shroudstory"},{"title":"The Day Was Not About the Shroud","post":"Not long ago Barrie Schortz explained on this blog that STURP members did check any medieval context and it seems that the “Catholic Herald”, devoted to religion, and therefore not an art journal, cannot give a lengthy report on this topic. The STURP professional photographer gave the minimum information necessary to rule out the painting hypothesis.\n\n","date":"June 23, 2015 at 11:38 am","url":"https://shroudstory.com/2015/06/22/the-day-was-not-about-the-shroud/","cat":"2015","id":"comment-203364","author":"Louis","site":"shroudstory"}]
