[{"title":"The Holy Ghost Communications Channel and the Shroud of Turin","post":"LMAO, it’s worth watching for a good laugh :-)\n\n","date":"March 8, 2012 at 8:06 am","url":"https://shroudstory.com/2012/03/08/the-holy-ghost-communications-channel-and-the-shroud-of-turin/","cat":"tinfoil_hats","id":"comment-9070","author":"Ron","site":"shroudstory"},{"title":"The Holy Ghost Communications Channel and the Shroud of Turin","post":"Not having watched the video the narrative reminds me of some of the ridiculous claims made by some a few decades back about the Ark of the Covenant was actually a primitive radio for talking to God.\nI also find it interesting that the Holy Ghost would not answer questions of who is where in the afterlife. Apparently Mary hasn’t been given the message as the children at Fatima reported that she answered their question regarding a local girl who had died recently. When they asked Mary if the girl went to Heaven Mary’s reply was that the girl had gone to Purgatory and would be there until the end of the world. Couple that with the vision of Hell Mary showed them and it’s hard to believe that the information would be classified for anyone communicating with a supernatural being.\nI get the feeling somebody’s got a ham radio or something and is having fun at others people’s expense.\n\n","date":"March 8, 2012 at 10:23 am","url":"https://shroudstory.com/2012/03/08/the-holy-ghost-communications-channel-and-the-shroud-of-turin/","cat":"tinfoil_hats","id":"comment-9074","author":"Chris","site":"shroudstory"},{"title":"The Holy Ghost Communications Channel and the Shroud of Turin","post":"I was intrigued and was waiting for his meter to respond…but then he took a break, edited the video and obviously doctored the results…or so it seems.  Needless to say, I won’t be running out to buy his ELF meter.\n\n","date":"March 10, 2012 at 9:49 am","url":"https://shroudstory.com/2012/03/08/the-holy-ghost-communications-channel-and-the-shroud-of-turin/","cat":"tinfoil_hats","id":"comment-9149","author":"Russ Breault","site":"shroudstory"}]
