[{"title":"The Makeshift Body Bag of Turin","post":"We learn from Scripture that although the final burial arrangements were delayed till Sunday morning something unexpected happened and so this was not possible.\n\n","date":"November 27, 2014 at 7:29 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173287","author":"Louis","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Kudos to Colin. He has put together some facts about the burial that harmonize the Gospel accounts particularly the fact Nicodemus brought 100 lbs of spices and stuff to the tomb. It was the recent You Tube video posted here which explained why such an extraordinary amount was necessary: it was the practice to disinfect or protect the walls with a mixture of such.\nThat work, and the complete preparing of the body, could not be completed before sundown on Friday, the beginning of the Sabbath, because of the lateness in the afternoon of Christ’s death and the fact the body hung on the cross for sometime after his death. The women led by Mary Magdalene were returning at daybreak Sunday to help complete the anointing. Mary looking into the tomb ran and reported to the Apostles; “They have taken his body and we do not where it is. Peter and John (or whoever the disciple Jesus loved was) ran to the tomb and discovered the body was missing and “body bag” was still there. \nNow Colin adopts and explains the use of the Shroud as body bag (citing Wilson).\nMaybe at some point, Colin will finally throw in the towel and admit the POSSIBILTY of the Shroud’s authenticity. It won’t be an act of defeat if, and when, he does. It will be act of considerable intellectual courage and integrity. Even Einstein admitted, on occasion, to being wrong\n\n","date":"November 27, 2014 at 7:35 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173289","author":"John Klotz","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Thanks John. I just go wherever the evidence leads. If it leads to authenticity then that’s OK by me, though I may need to stipulate that my burial shroud be made of asbestos.So far the evidence leads me to consider that the TS was an exceptionally clever confidence trick, based on an extrapolation of the Veil of Veronica idea to a burial shroud (or that preliminary makeshift body bag).\nIs one allowed to suggest that John got it wrong? He heard that Nicodemus had brought myrrh and aloes to the tomb, but assumed that was myrrh, the expensive resin, completely overlooking the fact that there was 100lbs of the stuff(including the aloes)\nMight it be that it was the thorny branches of the myrrh tree that were brought to the tomb, not as incense,but the raw material that grows in the wild, which he proceeded to heap up around the blood and sweat stained body bag and its occupant. Its real purpose?  To serve as protection  for the body for the duration of the compulsory day-of-rest sabbath, acting as a physical barrier against rodents and other unwelcome visitors? It was the Marys who brought the real refined ointments etc, not Nicodemus with his donkey-load of wild thorny vegetation. (Sorry, not sure what role the aloes played, being a non-thorny succulent in the natural state).\n\n","date":"November 27, 2014 at 8:47 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173302","author":"Colin Berry","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"But we know the TS Image was not made from sweat and blood, so why the supposition?\nWhy bring up the Besancon Shroud when there is no current comparison?\n\n","date":"November 27, 2014 at 8:30 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173299","author":"clublu22014","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Jesus was almost given a beggar’s funeral in comparison to what Herod got and the tetrarch had of course to get a lot more.\nI think Turin and Rome have not opened thrown their doors open as they should have done by now, and that involves churches not in these two cities. Professor Avinoam Danin was unjustly criticised for what he said he detected on the relic. He stands by Dr. Uri Baruch when it comes to pollen grains, which can receive more support when what was vacuumed from the relic during the restoration becomes available, going beyond what Professor Fanti said in the recent interview he gave me.\nOne thorn — Zizyphus spina christi —- sent to me from Israel soon after it was plucked in the outskirts of Jerusalem corresponds exactly to an image Professor Danin detected on the relic.\nI must emphasise that no one has challenged the Danin/Baruch findings by writing a paper.\nRead the last paragraph in article no. 7 in the following link:\n  http://newvistas.homestead.com/MediaRePatch.html\n\n","date":"November 27, 2014 at 9:15 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173307","author":"Louis","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Excuse me, Dan. These are not my words, but a mixture of  André Baillet (Les vies des saints et l’histoire des festes de l’annee . T. IV. Paris, Louis Roulland, 1703, p. 261) and Google Translator.It could be widely improved. Sorry, I have not time now.\n\n","date":"November 27, 2014 at 9:54 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173311","author":"David Mo","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"And right now I’m stuck in an airport and can’t look into it. Colin, can you shed some light on this?\n\n","date":"November 27, 2014 at 10:14 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173314","author":"Dan","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"I too am busy right now, so would just add this in the hope that it clears up any confusion.\nFirst, here are both of DavidM’s comments in which he quotes the 17th century monsieur:\nDavid Mo \nNovember 26, 2014 at 3:30 am \nBegel is quoting André Baillet (1649-1706), Les vies des saints et l’histoire des festes de l’annee . T. IV. Paris, Louis Roulland, 1703, p. 261. Free in Google Books p. 28.\n« L’autre Suaire qui porte ausi une empreinte du corps de Jesus-Christ est celui qu’on appelle le saint Suaire de Besançon. La peinture n’y est pas si forte ni les traits si distinguez que le Suaire de Turin. »\n»\nDavid Mo \nNovember 26, 2014 at 3:48 am \nMore interesting:\n« L’autre Suaire qui porte aussi une empreinte du corps de Jesus-Christ est celui qu’on appelle le saint Suaire de Besançon. La peinture n’y est pas si forte ni les traits si distinguez que le Suaire de Turin. C’est ce qui a fait dire à ceux qui ont donné l’histoire de l’un & de l’autre, que celui de Turin avoit servi à envelopper le corps tout ensanglanté à la descente de la croix, & que celui de Besançon avoit servi à l’ensevelir après qu’il eut été lavé & embaumé ».\nIt was a common belief that the mark of Turin Shroud was made with blood.\nI was content to quote just the second part of those two from André Baillet,  in which he presciently anticipated my 21st century hunch by some 300 years. Clever, these French…\nWhy then is DavidM  whom incidentally I thank for unearthing that fascinating opinion from 300+ years ago , so keen to dissociate himself from the idea of there having been two shrouds, with the TS being what I inelegantly term a makeshift body bag (sorry, alternative descriptions invited)?  Why describe it as “interesting” unless he sees some merit in the suggestion?\n It seems eminently sensible to me that there should have been one piece of linen  (Joseph of Arimathea’s) for  transporting  Jesus from crucifixion site to tomb, and a separate subsequent  one for the final burial shroud, once the body had been made more presentable by washing free of blood, applying sweet-smelling ointments etc.\n\n","date":"November 27, 2014 at 11:46 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173325","author":"Colin Berry","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"While I can applaud Colin’s rigour in exploring all possible avenues of enquiry, I don’t think I can buy into his body bag argument.  \nAt the cross, the arms would have been set fixed in the outstretched position of crucifixion by rigor mortis.  The image of course shows the arms brought down to the sides with the hands carefully crossed covering the pubis.  The question arises as to when the burial party forced the arms into this position, which probably took some effort to do. \nIt was Barbet’s opinion that the taking down from the cross and the transport to the tomb was accomplished simply by a party not needing more than five men who merely removed the cross-beam from the upright, two carrying the cross-beam with the arms still attached, two supporting the trunk, and one at the feet.  There may have been a cloth casually wrapped around the body to catch any blood for its inclusion with the burial.  At the tomb, the arms would have been removed from the cross beam and brought into their final position for the burial.  \nA particular problem with the image I’ve often noticed and mentioned, is that it is a near orthogonal projection like a photograph, and it is difficult to imagine how this could have come about.  This does not seem to me like a body bag image which ought to show the sides and the top of the head, and would also show a more distorted randomised image, if that was the case.  I’ve sometimes wondered if some of the 100 lb package that Nicodemus brought was used to pack the sides of the body, which would go some way to explaining orthogonality. \nDespite the assertions made that the Besancon Shroud was also an authentic burial cloth, I think that this is a misapprehension made merely to assert its validity, and that it is more likely to have been a painted copy commissioned by Jeanne de Vergy in her efforts to placate the Besancon authorities that the Shroud she had taken for safe-keeping had been restored to them.  That her stratagem worked is attested by the spurious claims made for her substitution.  It would seem that Bishop D’Arcis believed in the existence of a painted copy, but was confused as to which cloth was the copy.\n\n","date":"November 27, 2014 at 1:54 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173335","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"I’ve ALWAYS thought of the Shroud in this way.\nOn the third day, the intention was to execute Jesus’s burial in accordance with proper rites.\nThe shroud was a temporary “tool” to transport and then temporarily enshroud Him.\n\n","date":"November 27, 2014 at 3:17 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173342","author":"Thomas","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"So if the TS is the temporary tool, why do some see it as the permanent one, i.e. the arguably more permanent burial shroud?\nAre we seeing mortal remains (in blood etc) on a temporary ‘body bag’? Or are we seeing a final snapshot imprinted on a latterly-acquired burial shroud at the instant of departure from a mortal coil?\nMaybe we should simply view it as a medieval painting – so much simpler, no wracking of the brain for answers.\n\n","date":"November 27, 2014 at 3:44 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173348","author":"Colin Berry","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Colin,\nThe reason we can’t treat the Shroud as a medieval painting is the same reason we can’t simply treat it as a photograph taken by Leonardo DaVinci. It simply isn’t a DaVinci photograph and it simply isn’t a painting. \nI find your “body bag” analogy intriguing but in the end it isn’t necessarily decisive. In effect it was used as a body bag. Christ hung on the cross after he died long enough for rigor mortis to have set in. There is evidence of dislocation in the  shoulders that is consistent with the rigor mortis having been broken.\nI think DaveB is wrong on this point. I can not envision Christ in a state of rigor mortis being taken down and carried to the tomb arms out stretched rigid from rigor mortis. I can envision after being taken down from the cross, his arms being forced into a position where they were not a hindrance, The breaking was not of bones but of ligaments and muscle in the shoulder,\nWhether the Shroud was intended for temporary use or not it functioned as a body bag. The truth is that for whatever reason before the preparations of the body could be completed, the Shroud and the body parted company because at daybreak Sunday, the Shroud was found in the tomb but the body wasn’t there.\nThe question of whether a replacement was intended was thus rendered “academic.”\n\n","date":"November 27, 2014 at 4:33 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173351","author":"John Klotz","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"The image is too clear-cut to argue in favour of two shrouds. It is possible that the body was laid on some kind of stretcher wrapped in the shroud and placed in this manner in the sepulchre. There was little time left with the approaching Sabbath and the stretcher was kept where it was, with the body, to be only taken away on daybreak on Sunday, when the final preparations would have to be made.\n\n","date":"November 27, 2014 at 4:35 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173352","author":"Louis","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"From the pro-authenticity point of view, the TS cannot be a “body bag” used to transport the body from the cross to the tomb. The blood marks would have been completely blurred.\nWhat we see on the TS can only be explained if the body has been hastily  transported from the cross to the tomb as it was on the cross and without any kind of “body bag” or sheet of any kind, except perhaps with the help of a strap below the lower part of the thorax, which explains the amazing “blood belt”.\nPlease read Barbet.\nFrom an anti-authenticity point of view, I can’t comment the new Colin’s “research”: “the so-called Turin Shroud was never intended to represent the final burial shroud. It was a makeshift body bag used to transport Jesus from the cross to his final resting place, the rock tomb.” or ” Indeed, it’s clear it was intended primarily for transporting body from cross to tomb”\nColin quoted the Evangelists. In none of them, I can find something about the alleged sheet used to transport the body from the cross to the tomb.\nWhere are you going, Colin?\n\n","date":"November 27, 2014 at 4:40 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173353","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Colin is taking any data about the Shroud, relabel it with his forgery narrative, and writes a new post.\nYou’re still looking for anything making sense?\n\n","date":"November 28, 2014 at 2:40 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173407","author":"anoxie","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"I think Thibault is to the point when he says “Please read Barbet.”  Specifically, chapter 8, ‘Descent from the Cross, Journey to the Tomb, The Entombment’.  The absence of smears on the cloth make it unlikely that it was used as a body bag, and also that there was a minimum of handling of the body.   \nBarbet is specific on the cause of the blood belt on the back.  \nCrucifixion was carried out with the victim made to lie on the ground, his arms possibly temporarily bound to the cross-beam, while the hands / wrists were nailed to it.  The execution squad would then lift the cross-beam onto the top of the upright, and probably tacking it to stop it from tipping.  The feet were then nailed to the upright, Barbet claims by a single nail.  \nAfter he had expired, it was then a simple matter to remove the nail from the feet and then to lift the cross-beam off the upright.  Rigor mortis would have set in, and the body would have been quite rigid and would not sag if it was carried horizontally.  Barbet claims that it was not until they had reached the tomb that the body was placed on the Shroud, as otherwise it would have been drenched with the blood from the interior vena cava.  He is quite detailed on this point, mentioning discussions he had with officials from a local abattoir who were familiar with this particular blood flow.  \nDuring the journey the greater part of the blood was either lost or collected.  Only that remained which coagulated on the skin.  He maintains that the rear part of the right heel is poorly marked compared to the sole, and that this was the only part of the body that was handled.  He postulates that a band or a twisted sheet was used to support the thorax, and that this is the cause of the blood belt.  The flow has congealed transversally on the back, has even managed partly to reascend, and consists of irregular windings, which bifurcate and come together again several times.  The band would have become saturated with blood, but only a small part of it shows on the skin as the blood belt from the folds within the twisted sheet. \nWith the minimum of handling so evident, he considers that the cross-beam was used to support the top half of the body and it was not removed until they reached the tomb, which was nearby.  In Barbet’s detailed scenario there is no need for a stretcher or body bag, and it seems that the distance that the body was carried was not far.    \nJohn 19:40-42:  “40 They took the body of Jesus and bound it with burial cloths along with the spices, according to the Jewish burial custom. 41 Now in the place where he had been crucified there was a garden, and in the garden a new tomb, in which no one had yet been buried. 42 So they laid Jesus there because of the Jewish preparation day; for the tomb was close by.”\nNote:  ‘a garden in the place where he had been crucified;  in the garden a new tomb;  the tomb was close by’.\n\n","date":"November 27, 2014 at 5:53 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173356","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"There are two entirely different narratives getting mixed up here. The first is the pro-authenticity narrative which is the one we are accustomed to see being discussed in detail here.  In that, Joseph’s purchase of fine linen  is seen as the final burial shroud, with imprints of clotted/reliquified (?) blood arriving first, and the body image second, with no agreed mechanism as to how the latter was generated, whether instantly in flash (a byproduct of resurrection) or slowly from vacated post-resurrection mortal remains.\nThe second is the medieval forgery narrative. It had to explain how both blood AND body image came to be imprinted on a length of linen (since the first and subsequent cohorts of pilgrims were bound to ask). The narrative for that could have invoked (a) a flash of miraculous light at the instant of resurrection, though I doubt it, or (b) it could have proposed some slow post-mortem process (but that would surely have led to degradation of blood stains). What this blogger has been seeking is a third option (c) that is neither of the two above, but which fits with my reading of the 4 gospels, which may not be the same as others here.\nIn the medieval forgery narrative, option (c) the fine linen purchased by Joseph of Arimathea was used as a makeshift body bag, into which Jesus was placed immediately after taking down from the cross,  taking whatever steps were needed to deal with rigor mortis if present. There would have been one or more ties for ease of handling, as in the modern-day photograph above. In this forgery model one then has the scenario that explains both the body image – imprinted as sweat – and the blood simultaneously from an unwashed body. In this model there is no need to imagine that all the blood had first dried and/or clotted, requiring one to speculate as to how it reliquified or re-moisted.  The imprint of sweat and blood formed immediately the body was placed in the linen. \nYes, there are question marks as to how a sharp imprint and image could be formed, but the same questions were no doubt asked of the Veil of Veronica image on a makeshift face cloth that was used to “wipe” sweat and blood from the face of the still-living Jesus. It’s anyone’s guess as to the answers given, but one can be fairly certain that the same answer was given for both Veil and Joseph’s linen: there was an initial imprint that then miraculously transformed into a fully-fledged image – maybe immediately, or maybe over a passage of time, which could have been hours, days, decades even. \nAnyway, that’s the bare bones of what I’m proposing, based on an IMAGINED imaging onto a body bag that was never intended as the final burial shroud, and which medieval forgers could then set about simulating, i.e. modelling,  using simulated sweat and real or simulated blood.  That simulating could be IDEALIZED please note.  The scorch model is still very much in business folks, given that a faint thermal imprint off a heated template could have been passed off as a yellowed,  age-degraded sweat imprint, the tone that we now refer to as the superficial negative image with no directionality and 3D properties. Look –  no paint pigments (not for the body image at any rate – blood or “blood” is another matter). Move along please art historians – there’s nothing to see here…\n\n","date":"November 27, 2014 at 11:10 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173392","author":"Colin Berry","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"I believe the 2nd law of thermodynamics proves that the shroud has always been a negative  image. The law states entropy in a system always goes from order (low entropy) to disorder (higher entropy). If our eyes had the to see in the negative then at the time the shroud was made it would have been a realistic image of a human body either 700 or 2000 years ago.The image would be at least clear or probably clearer than it is now as the entropy of the image would have been lower than now thus the order higher. As time passes and as entropy increases the disorder of the image would increase and the image would become less clear to our negative capable eyes. We need to understand that the shroud actually is a negative image with all information intrinsic in itself (low entropy) at the time of formation(order) of the image. As time passes the image entropy will increase thus disorder increases causing a loss of information and a less clear negative image. Entropy can never decrease over time. Consider racked balls on a pool table; they are at low entropy(ordered) then they are hit by cue ball and scattered entropy increases (disordered) They then will not ever roll back to their racked positions at the end of their motion back to original entropy (ordered state). It is not a matter of probabilities it is impossible. In the case of a painting it is also impossible because looking at a painting with our negative capable eyes we will see a very blurry not realistic human form (high entropy)disorder. Over time as paint flakes off our negative capable eyes will see a human form coming into shape becoming more realistic( entropy decreasing)order increasing.This is a violation of the 2nd law of thermodynamics.As a matter of fact the final entropy of the image that our negative capable eyes would  see has a lower entropy than the original image our negative capable eyes would see.\n\n","date":"November 27, 2014 at 11:13 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173395","author":"Paul","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"correction If our eyes had the ability to see        in the third line\n\n","date":"November 27, 2014 at 11:16 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173396","author":"Paul","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"About the French text, in a previous post above, extracted from Adrien Baillet’s (http://en.wikipedia.org/wiki/Adrien_Baillet) “Les vies des saints, et l’histoire des festes de l’année”, T. IV. See a digital copy at Google Books: http://goo.gl/2n6KUp.\nThe quoted text, in French from a previous post, is missing an essential sentence.\nThe relevant quoted text\n“C’est ce qui a fait dire à ceux qui ont donné l’histoire de l’un & de l’autre, que celui de Turin avoit servi à envelopper le corps tout ensanglanté à la descente de la croix, & que celui de Besançon avoit servi à l’ensevelir après qu’il eut été lavé et embaumé”\nessentially says that some people have the opinion that the Turin Shroud was used to wrap His body, entirely covered with blood, after it was taken down from the cross whereas the Besançon Shroud was used after He had been washed and embalmed.\nAnd, here is the missing sentence, Adrien Baillet adds his own analysis of this opinion by:\n“Ce qu’il y a d’incommode pour cette opinion, c’est que l’on a observé la même fixation (?) des membres dans l’une et l’autre peinture, jusqu’à lui croiser les mains et lui couvrir les reins de la même manière.”\nwhich essentially says that this opinion is mistaken because it was observed that both images are very similar: the legs and arms have the same position to the point of crossing the hands the same way.\nSo, Adrien Baillet did not think that these two shrouds were different but that between the Turin and Besançon shrouds, one appeared to be a copy of the other. It corresponds to the current knowledge we have today about the (now gone) shroud of Besançon: it was a copy of the Turin Shroud.\nAnd we should add, that if such an opinion existed, it appears to be based on the fact that the shroud of Besançon did not show any prominent bloodstains whereas the Turin Shroud does.\n\n","date":"November 27, 2014 at 11:49 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173398","author":"Mario Latendresse","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Well, if the Besancon Shroud is a copy of the Turin Shroud you could have fooled me!\n\n","date":"November 28, 2014 at 2:08 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173404","author":"Charles Freeman","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Then I respectfully suggest you do a little more research.  My original views on it were formed from Scavone’s paper.  Following your comment above, I searched on Besancon Shroud, and that also seems to be the general opinion on the sites I explored, including an authoritative one with the Besancon coat of arms.  It also referred to a window in a Swiss church showing the Besancon Shroud, with Besancon clergy and the shroud shown there is claimed to be a virtual copy of the Turin Shroud with the double image.  Clearly differences of viewpoints will always appear on the web expressed in different ways, and they’re not always accurate.  However the general consensus of opinion I’ve found is that although the original Shroud from Constantinople was sent to Besancon from Athens, it was in the possession of the Charnay-Vergy family when St Stephen’s was destroyed by fire.  A cloth claiming to be the true Shroud was later displayed at Besancon in the new church.  I did not pursue whether the Swiss illustration was of the original or its supposed replacement, but the church window was I think 15th century, well after 1355.  But I think there are other illustrations of it.  Possibly these only display a ventral image.  The inference to be made is that Jeanne de Vergy provided a substitute copy she had commissioned to replace the original one held at Besancon.  Whatever cloth was held at Besancon was destroyed in the 18th century during the French Revolution.\n\n","date":"November 28, 2014 at 3:38 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173417","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Where is this church and this windows? Do you have images?\n\n","date":"November 28, 2014 at 6:32 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173431","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Colin has, I think, come closest to pulling the threads of this discussion together.  The whole idea of two or three, or half a dozen, undisputed “Shrouds”, and a similar number of smaller cloths or coifs, is generally untenable to modern thinking (although I note there are a few sites which still support it, and the Oviedo cloth has similar acceptance to the Turin Shroud). However, for several centuries previously, all these cloths were considered authentic, and a rationale had to be concocted to account for them. Whether Jesus was wrapped up in all these cloths simultaneously or at different times was variously sorted out by different people, who probably disagreed with each other. Whatever Adrien Baillet’s own enlightenment view (thanks Thibault), the idea that both that the Besancon and Turin Shrouds were authentic was clearly current in his time. What’s more, whereas we now think (rationally) that no clear image could be obtained while lowering or carrying a body in a cloth, this was not a problem to earlier minds, for whom even an obvous painting could have simply been an example of a miracle. Earlier on this subject, someone commented that nobody could imagine that after wiping his sweaty blood-smeared face with a cloth, a beautiful painting could have been left on it, when in fact this was exactly what people thought, and in some cases still do.\nIn some ways, it occurs to me, the Turin Shroud was ahead of its time, bearing a more or less “realistic” imprint, when there was really no need for it to be anything more than a painting. Could this be because the late 13th century was really quite late in the craze for relics, and a more rational approach to miracles had already begun to manifest itself?\n\n","date":"November 28, 2014 at 3:35 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173415","author":"Hugh Farey","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Hugh is certainly right that. People began to question relics more as they travelled around. I am not sure whether you can find the full text online but I wrote an article on Guibert Nogent  ( died 1124) for History Today as he began to questions certain cults that had sprung up around him that had no basis in reality.\nBut my argument is that no one who knew that gospel accounts would have been fooled by a single cloth with images on it and no forger would have bothered to try it on. This was surely a cloth created for another purpose that then, probably because of miracles associated with it, converted into something else.in 1390 the Church( Clement VII) reaffirmed that it deserved veneration and even an indulgence but that it was not the real thing. I think he was just reasserting the original status quo. If it had a reputation for miracles, of course, it would have  been worth a visit.\n\n","date":"November 28, 2014 at 3:44 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173418","author":"Charles Freeman","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"P.S. All we have on what the Besancon Shroud looked like is the painting(?) of it made by Pierre  D’Argent  in the 1560s and still in the archives at Besancon. We had to ask for permission to use it in my article and at first no one at Besancon knew where it was and sent us an illustration from a seventeenth century book they had with it in it. Then they announced they had found the original and sent the HT picture researcher a big copy of it that we had of course to pay to use. As everyone seeing the Shroud in the fifteenth and sixteenth centuries remarked on the prominence of the blood stains, the scourge marks, the Crown of Thorns, then these would surely have been reproduced on a copy – and the head is so very different! It is also, of course, a single image not a double one.\nIt is surely obvious that the same body was not represented on the Shroud of Turin as on the Besancon Shroud, so the theory that they were used consecutively in Jerusalem doesn’t make any sense.\nMy own view, as I put it in my article with backing from a 1790  source, is that this was another of the Quem  Queritis cloths – what is has in common with the Shroud is that the wound is not shown on the conventional right (conventional not from any gospel source but  the medieval iconographic convention) but on the left side of the body as these cloths ( whether you agree with me or not that the Turin Shroud is one of them)  were symbolic representations of the marks Christ might have left on the burial cloth if he had lain on it.\n\n","date":"November 28, 2014 at 3:36 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173416","author":"Charles Freeman","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Charles, the painting by Pierre d’Argent they sent you… is not made by Pierre d’Argent, but by Jean de Loisy. Do you know how much is necessary to pay to publish it?\n\n","date":"November 28, 2014 at 6:40 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173433","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"No I don’t. It is attributed to Pierre D’Argent  in Diane Wolfthal’s The Beginnings of Netherlandish Canvas Painting, Cambridge 1989. It is perhaps this misattribution that was the reason why they could not find it at first when they were asked for it.\n\n","date":"November 28, 2014 at 7:36 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173439","author":"Charles Freeman","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"The image was partially published by De Vregille some years ago","date":"November 28, 2014 at 12:38 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173484","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"The Shroud of Turin was never a body bag.  There was no need for one.  The tomb was quite near the crucifixion site.  \nI cannot concede that it is at all possible to deceive an independent succession of trained medical forensic pathologists (Barbet, Willis, Bucklin, Zugibe and various others) that any painting or other man-made image is actually that of a real crucified person, but that is their unanimous opinion of the Shroud image, and they comment on detailed features and aspects of it.  How could any pathologist worthy of the name identify any painting as a valid subject for his forensic examination, without recognising it as no more than a painting? Particularly one from the 14th century when modern anatomy was not even in its infancy, but was still tied to Galen.     \nThe allegation is not worthy of any serious consideration by anyone at all informed of the properties of the Shroud image.\n\n","date":"November 28, 2014 at 3:58 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173420","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"“I cannot concede that it is at all possible to deceive an independent succession of trained medical forensic pathologists (Barbet, Willis, Bucklin, Zugibe and various others)”. None of these people are independent and dispassionate. All of them were drawn to the shroud because of strong religious belief. This is the hallmark of all shroud “scientists”. They see what they want to see  – evidence for their religious belief.\n\n","date":"December 4, 2014 at 5:56 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174592","author":"aljones909","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Was there a succession of non-christian forensic pathologists who disputed their claims. You cannot just dispute the claims of professionals because of their religious beliefs. Do you dispute Stephen Hawkins claims about the origins of the universe because of his atheism?\nBy the same token “You may be missing what you don’t want to see, – evidence of your lack of religious belief”\n\n","date":"December 4, 2014 at 7:59 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174607","author":"Mike M","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"What we see from Hawking (note his name is Hawking – not Hawkins) is the application of the scientific method. Disembodied minds (deities, ghosts, demons) can not be part of that until there is evidence that such disembodied minds exist and they are having a measurable effect on reality. I’m sure there are many cosmologists and physicists who have supernatural beliefs (at least in America) but they keep it separate from their work in science. It’s irrelevant.\nShroud “science” is in a different category. It’s akin to creationism. The shroud “scientists” come to the case 100% convinced that a supernatural event happened 2000 years ago – and they are now investigating a relic from that event. My brief readings of their background suggests that if a religio meter was pressed to their foreheads it would quiver at maximum. \nThere is a problem. The one piece of hard science dates it to medieval times at the same time as it appears in the historic record. Never mind. The shroud *scientists”  can think up 101 reasons for that being wrong. This is enough for the shroudies. Invisible repairs, thermoplastic coating, carbon monoxide contamination, divine radiation. They can now chatter to themselves about the dating being “debunked”. It should be noted that the STURP team did not want C14 testing. They felt it unnecessary since the relic was obviously what they wanted it to be.\nThis isn’t science. A lot of it is beyond crazy (event horizons, collimated radiation, earthquake induced neutron bursts, anti matter and 101 newly invented dating techniques) or just plain deceitful\nLets say an islamic relic was being examined. Maybe a tail hair from Buraq. Saudi Arabian have put their most devoted islamic scientists on the case. They’ve done all the tests. There is no doubt. They’ve even found some DNA and it’s not like the DNA of an earthly horse. They’ve done electron micrographs. If you examine them closely you can just make out parts of verses from the Koran. It’s indisputable proof that Islam is the one true religion. How convinced would you be that they were evaluating the evidence in an unbiased manner?\n\n","date":"December 4, 2014 at 7:04 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174671","author":"aljones909","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Aljone, I have to do a little correction: it is not true that STURP team did not want C14 testing. They asked it. Look at this communicate of the STURP (october 8, 1981):\nhttps://www.shroud.com/78conclu.htm \nAll shroudie websites with this text have suppressed from it a sentence: \n“No carbon 14 measurements have been done. Unless and until permission is given to use part of one thread of the Shroud, such an essay must wait”. \nThey tried to do it. Now, they prefere forget it, and cancel the sentence.\n\n","date":"December 4, 2014 at 7:19 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174675","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Aljones,\n“What we see from Hawking is the application of the scientific method.”\nLike How? Are his theories testable/repeatable?\nIn fact Barbet and Zugibe did apply the scientific method. Barbet actually experimented with Cadavers and he repeated the tests multiple times. Same with Zugibe he built a cross in his office and he fabricated gloves to allow the pull from the nails to be testable/repeatable. Aljones you need to do your homework and put your bias on the shelf. How about reading their books with an open mind?\n\n","date":"December 5, 2014 at 12:01 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174699","author":"Mike M","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Mike M – If you don’t think Stephen Hawking is a scientist (specifically a theoretical physicist/cosmologist) then we have reached an impasse in the discussion.\n\n","date":"December 6, 2014 at 5:50 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174893","author":"aljones909","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Andrea, this is from an article at http://www.badarchaeology.com/?page_id=322\n“The methods used by STURP did not include radiocarbon dating. When initially set up, it had a radiocarbon subcommittee (composed of Robert Dinegar, Ray Rogers and David Sox), but was not included on the list of authorised tests released on 24 April 1978 by Don Piero Coero-Borga of the Centro Internazionale di Sindonologia. A furious David Sox released the list of tests to The Times, which published it on the front page. Coero-Borga’s reasoning was that “the Pollen Test has given very positive results with regard to the age and history of the Shroud” and should be extended across a wider area. This is, of course, completely wrong: the pollen can only be used to date the shroud if one assumes that it was in Palestine at the time of the crucifixion of Jesus, a completely circular argument.”\nThe carbon dating is hard evidence. The laboratories were the best in the world.\nThey dated 3 other pieces of cloth as well. These samples had known dates derived from historical and archeological evidence.\nSample 2 was from a Nubian tomb and was known to have a date around 1100.  The labs dated it within 20 years of it’s known date.\nSample 3 was a sample from a mummy around 2,000 years old. The labs dated it within 60 years of it’s known date.\nSample 4 was a sample from the cope of St. Louis d’Anjou. The ‘known’ date was around 1273. The labs dated it within 30 years of it’s known date.\nSample 1 was a sample from the Shroud of Turin. First certain historical date 1390 (but disputed dates going back to 1350). The mean date from the 3 labs was 1325.\nNote. For clarity I’ve omitted details of the uncertainties quoted for each date. This is usually given as plus or minus n years.\n\n","date":"December 6, 2014 at 7:06 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174903","author":"aljones909","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"aljones909, the methods used by STURP did not include radiocarbon dating because many people observed that the piece of cloth necessary for the test, before the invention of the AMS method, was too big. Sox and McCrone personally tried to persuade Turin to give them a piece, but they failed. The decision in Turin was responsability, first of all, of the archbishop and of the chapelan of the past king Umberto, mons. Pietro Caramello. He consulted a professor of our university, and he gave negative answer. Don Piero Coero-Borga of the Centro Internazionale di Sindonologia had the power to suggest, but not to decide.\nThe STURP participated in the preparatory meetings for the radiocarbon dating of 1988 and he also wanted to participate materially to the test. What I meant is that it is not true that the STURP was against the radiocarbon dating. The suppression of that phrase about the radiocarbon from the STURP communicate (see my other post) only means that before the results they were friends of the carbon, after the result became enemies\n\n","date":"December 6, 2014 at 7:52 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174908","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"The STURP 1981 Summary was admirably neutral, if uninformative on the nature of the image. The drip-feed of thinking and research that emerged later from its leading lights was of an entirely different character. Jackson’s collapsing cloth idea presumed authenticity. Rogers’ Pliny-era theorizing re starch and saponins presumed authenticity. Adler’s “trauma bilirubin” to account for unnaturally-red looking blood presumed authenticity. Do I need to continue? No wonder the Turin custodians were not keen to involve STURP in the radiocarbon dating. The post- 1981 STURP team’s neutrality and indeed objectivity could no longer be taken for granted. It was basically down to poor management.Somebody should have kept a whip hand to ‘preserve the brand’.\n\n","date":"December 6, 2014 at 8:09 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174910","author":"Colin Berry","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"“We can conclude for now that the Shroud image is that of a real human form of a scourged, crucified man. It is not the product of an artist”.\nThis is not too neutral\n\n","date":"December 6, 2014 at 8:12 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174911","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Doesn’t look too good at first sight does it? But not wishing to appear uncharitable, there being only 19 be-nice-to-everybody days to Christmas, I’m willing to give the benefit of the doubt, due to use of that term “form”…   Rest assured it will be back to business as usual in the New Year, with STURP’s slide into authenticity-promotion still in the cross-hairs. Had the rot maybe prior to 1981, being a factor in the negativity’ of the Summary, a strategic form of mock defeatism, one that left everyone free to go AWOL, launching their own pet theories?\n\n","date":"December 6, 2014 at 8:52 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174914","author":"Colin Berry","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"STURP team – admirably neutral report? I think they might have brought a little bias to the proceedings. Rolling Stone reporter Michael Thomas visited them as they were ready to go about there work in Turin. He described them as “mad Faustian defenders of the faith dreaming up hardware that makes Hiroshima look like a love bite…. the reason they’re here is to raise Jesus Christ from the dead.”\n\n","date":"December 6, 2014 at 7:49 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-175014","author":"aljones909","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Andrea, I accept that the article at badarcheology may have got it wrong when it implies the STURP team opposed C14 testing. The book by Harry Gove details the efforts they made to take control of the tests but does not suggest they were opposed to them.\n\n","date":"December 7, 2014 at 6:10 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-175077","author":"aljones909","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Aljones — you don’t find it odd that the only piece of evidence that points to a medieval provenance (your words not mine) is the C14 dating? Surely a medieval man-made artifact should have more scientific evidence that exposes its provenance, no? You have no doubt the sampling (if not the method and result) may have been flawed — when a host of testing protocols were oddly not followed?\nYou have a rather narrow definition of science.\n\n","date":"December 4, 2014 at 8:28 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174686","author":"David Goulet","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"“You have a rather narrow definition of science.”\nThis is the hallmark of all crude skeptics.\n\n","date":"December 5, 2014 at 1:40 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174717","author":"anoxie","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Can anybody put me on to the scientific evidence that the Shroud dates to before AD 33?\n\n","date":"December 5, 2014 at 4:15 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174726","author":"Charles Freeman","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"David, Hugh Farey answers your question about evidence below. There is really nothing of substance that suggests it’s from the 1st century.\n\n","date":"December 6, 2014 at 7:21 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-175008","author":"aljones909","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"“ …it is not true that STURP team did not want C14 testing.”\nThanks for the quotation, Andrea. It is confirmed by William Meacham: “Radiocarbon Measurement and the Age of the Turin Shroud: Possibilities and Uncertainties”, Proceedings of the Symposium “Turin Shroud – Image of Christ?”, Hong Kong, March 1986: http://www.shroud.com/meacham.htm .\nBut it is also true that some sindonists made disproportionate exigencies when became clear that the process was turning out to not be leaded by them. Meacham himself demanded five samples from different places of the Shroud, with a total of 12 cm2 Anyone could think that the Church wouldn’t accept this unnecessary “attack” against an alleged True Shroud of Christ. (Meacham included in this paper a series of exaggerated cautions in order to have some justification to criticise a possible unfavourable outcome. These cautions were an a priori and overall invalidation of the radiocarbon method).\n\n","date":"December 5, 2014 at 3:05 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174723","author":"David Mo","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Full text by Baillet :\n“ Le Suaire qui porte aussi une empreinte du corps de Jesus-Christ est celui qu’on appelle le saint Suaire de Besançon. La peinture n’y est pas si forte ni les traits si distinguez que le Suaire de Turin. C’est ce qui a fait dire à ceux qui ont donné l’histoire de l’un & de l’autre, que celui de Turin avoit servi à envelopper le corps tout ensanglanté à la descente de la croix, & que celui de Besançon avoit servi à l’ensevelir après qu’il eut été lavé & embaumé. Ce qu’il y a d’incommode pour cette opinion, c’est que l’on a observé la même fixation des membres dans l’une et l’autre peinture, jusqu’à lui croiser les mains et lui couvrir les reins de la même manière”.\nThis is my translation of  Baillet’s text:\n“The other Shroud that also has an imprint of the body of Jesus Christ on is the one called the Shroud of Besancon. The painting is not so strong nor the features as definite as the Shroud of Turin. This is why those who made the history of the one and the other, have said that the Turin Shroud had been used to wrap the bloody body at the descent from the cross, and that of Besançon had been used to bury him after he was washed and embalmed. This opinion has an inconvenient because one can see the same fixing of the members in one and another painting, until crossing his hands and cover his kidneys in the same way”.\n(It can be absolutely improved. Sure!)\nI found interesting this paragraph because is another testimony that says that the image was clearly visible in the beginning of the 18th century. It is obvious that Baillet collects an opinion in his epoch: the Shroud was painted. And no more.\nBaillet has reason in that two different objects with different functions cannot support the same image. \nThe bag theory is impossible. If you wrap a bloody corpse in a sheet or similar and then carry it for a long or a short distance a rubbing would be produced and the stains would be blurred. The net imprinting of blood as in the Shroud would be impossible. This is one of the Zugibe’s critics to Barbet and one of the bases of his theory of the post-washed imprinting. If I remember correctly.\n\n","date":"November 28, 2014 at 4:09 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173421","author":"David Mo","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"“The Shroud of Turin was never a body bag. There was no need for one. The tomb was quite near the crucifixion site.” \nEr,  how do you reconcile that with these verses from Mark, Chapter 15, daveB, which imply that the body was wrapped in Joseph’s linen before placement in the sepulchre, and it would seem immediately after taking down from the cross?\n43  Joseph of Arimathea, an honorable counsellor, which also waited for the kingdom of God, came, and went in boldly unto Pilate, and craved the body of Jesus.\n44. And Pilate marvelled if he were already dead: and calling unto him, the centurion, he asked him whether he had been any while dead.\n45. And when he knew it of the centurion, he gave the body to Joseph.\n46.And he bought fine linen, and took him down, and wrapped him in the linen, and laid him in a sepulchre which was hewn out of a rock, and rolled a stone unto the door of the sepulchre.\n47. And Mary Magdalene and Mary the mother of Joses beheld where he was laid.\nDistance is not the only factor. There are two other Ds to consider: dignity and decorum. Thus the purchase of “fine” linen to conceal the corpse from the eyes of ghoulish spectators ASAP.\n\n","date":"November 28, 2014 at 4:11 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173422","author":"Colin Berry","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"“The bag theory is impossible. If you wrap a bloody corpse in a sheet or similar and then carry it for a long or a short distance a rubbing would be produced and the stains would be blurred. ”\nImpossible in a pro-authenticity narrative, maybe, DavidM. Please note the narrative that accompanied the “bag theory” (which is not a theory, btw, but a recitation of the biblical account – see my reply to daveB) was not pro-authenticity. It was an attempt to read the minds of medieval forgers, setting out to provide a bigger and better version of the Veil of Veronica – that also being a sweat/blood imprint in the first instance, albeit with miraculous add-ons that kept generations of artists occupied adding more and more improbable details (crown of thorns etc).\nIncidentally, I’m surprised that Charles Freeman should set so much store by the Tempesta engraving (1613). Sure it shows a crown of thorns, but it also shows intact shoulders, despite displaying the distinctive pattern of 1532 burn holes. It also shows separated feet, it shows hands crossed at wrists, it shows a bulky loin cloth. Some folk do not appear to recognize a ‘stylized, indeed idealized image when they see one, or “tarted up” as we say in modern vernacular. To claim there must have been a crown of thorns on the TS initially that has somehow selectively worn off is credulity-stretching to say the least.\n\n","date":"November 28, 2014 at 4:52 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173424","author":"Colin Berry","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Colin, I have repeatedly said that we need a  full data base of all the depictions of expositions. The Crown of Thorns is shown on several different ones, not just the Tempesta, over 150 years. It is also mentioned by Antonio de Beatis  as early as 1517 when he saw the Shroud close-up in the chapel at Chambery.. How much more evidence do you need?\nWhen I show my lecture, there are  basic seven depictions from 1578 to 1703 I show. I warn the audience that some of these ( not the Tempesta who was resident at the court and must have seen several exposition), were quick drawings and I show the difference between the different depictions. I then go on to suggest features that they share in common. The Crown of Thorns is one of them and is typical of the iconography of the fourteenth century when they began to show the Crown in place after Christ had been removed from the Cross. The thumbs are another- it is interesting that you can see how the angle of the thumbs is the same in 1578 as it was in 1690 and 1703.\nSo this is good evidence but I always go back to the crucial point. We need ALL these depictions, observers’ descriptions, copies, etc, on a single data base open to all.  I can convince an intelligent audience who is actually looking at them but  I want them to be seen by the world at large so that proper scholarly debate can take place. i am sure you support me on this- you might be able to move on yet again with more theories!\n\n","date":"November 28, 2014 at 7:45 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173442","author":"Charles Freeman","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Charles: viewers from past centuries often do what modern ones do (some of whom should know better) which is to look at blood trails and claim to be able to see the actual wounds. They can’t, for the reason I told you earlier, namely that the sepia body image does not show wounds. The latter can only be inferred from the presence of blood at a particular site.\nWhenever one reads accounts that refer to wounds one has to examine the text closely. One invariably finds that it is blood that is being referred to, not wounds.\nYour quoted passage from de Beatis is a case in point:\nA more explicit description comes from the Travel Journal of Antonio de Beatis, who visited Chambéry as secretary to Cardinal Louis of Aragon in October 1517. The Shroud was displayed for the visitors. ‘The images’, de Beatis tells us, ‘were impressed and shaded in the most precious blood of Jesus Christ and show most distinctly the marks of the scourging, of the cords about the hands, of the crown on the head, of the wounds to the hands and feet and especially of the wound in the side, as well as various drops of blood spilled outside the image, all in a manner that would strike terror and reverence into the Turks, let alone Christians’.\nThe same is true of the passage you quote from the Clare nuns 20 years later who repaired the Shroud after the 1532 fire. If you read it carefully, you will see, once again, that there is no certainty that they were describing actual thorns or their images. Instead it seems more than probable they were letting their imaginations run riot.\nYou conclude by saying “Little of this vivid imagery survives today”. That because it was never there in the first place, having been inferred imaging of wounds in the above accounts, based on the blood trails – NOT wounds, which I repeat are NOT imaged on the Shroud.\nRemember: we’re constantly told that blood was imprinted before body image. How can there be imaging of wounds, i.e. lacerated or punctured skin per se if the blood from those  wounds was imprinted first?\n\n","date":"November 28, 2014 at 8:11 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173448","author":"Colin Berry","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"God for give me, but I find that this grudge match between Colin and Charles brightens my day.\n\n","date":"November 28, 2014 at 8:19 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173450","author":"John Klotz","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"No grudges here- simply lack of evidence to back up Colin. But I do admire the way that Colin is so sure that it was purely imagination and that there was never any vivid imagery. Two separate accounts say that the blood was so vivid that  ait was as if had been shed today/ recently.  Why should they be imagining this? We have accounts from 1449 and 1703 both talking of painting=-imagination again?\nOnto the data base one day, I hope!\n\n","date":"November 28, 2014 at 8:34 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173453","author":"Charles Freeman","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Time and again I offer an observation re the BODY IMAGE Charles, and you totally ignore it, substituting your references to BLOOD. There can be no useful engagement, far less debate, while you continue to conflate BODY IMAGE and BLOOD.\n\n","date":"November 29, 2014 at 1:32 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173549","author":"Colin Berry","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Not true,Colin,as if you read  the full accounts you find they include references to the Crown of Thorns in place as well ( and this is backed by many representations of the Shroud with the Crown in place)  as one would expect from post1300 iconography ( as I show in my article, the Shroud is spot on for the iconography of tHis date and it is interesting to see the head measurements below that give further confirmation of this.) \nThe last sentence I gave in my posting above shows accounts of 1449 and 1703 using  the word painting. \nI can’t see why you NEED to replace the mass of evidence that this is a painting with an esoteric version of your own that, unlike medieval painting on linens on which there is an increasing amount of material, would make it totally unique and unknown to any other professional art historians. The evidence that the Shroud is a one off in this sense  is simply not there.\nWhere the Shroud is a one-off is that it ( whatever else it has been imagined as being since) appears to be the only survivor of the Quem Queritis ceremony  and\ntherefore of importance for that reason alone. That is why I was asked to speak to a group trying to raise money to restore a MEDIEVAL church.\nI think your problem is that  because the Shroud is a line survivor, you think that it was unique in its time when we have references to thousands of other cloths with images on Christ on them. See the article I posted .Extracts from that show that despite accounts of painted linens in England , not a single one still survives. As the author noted, if folded, these linens lose their painted surface very  quickly and again the Shroud seems remarkable in hanging on to its own for so long.\n\n","date":"November 30, 2014 at 3:08 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173741","author":"Charles Freeman","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Again, you simply repeat your case, a highly flawed and myopic one I might add, Charles, and fail to address the specific points I raise, notably the distinction between blood, which IS a pigment whether real or simulated, and body image, for which there is no convincing evidence it is an applied pigment (notwithstanding your brief reference to McCrone’s iron oxide claim for which he failed to make a persuasive case, and which studiously ignores the much better documented evidence that the superficial body image is chemically-dehydrated carbohydrate).\nThere’s no point engaging with someone who simply ignores the points one raises.\nIf I thought your “painting” claim had anything going for it, I would do a post on my own site. But it doesn’t, given it’s mistaken on every important detail re the Shroud’s BODY IMAGE.\nI invite folk here to log onto Charles’s “History Today” article, and search first for “image” and/or”body image” and then do the same for “blood”. Almost every conclusion he makes is based on his multiple references to blood, and scarcely any to the largely ignored body image. He then makes the classic error of assuming there are “wounds” visible on the TS, as if they were visible in the body image. They are not. All wounds, scourge wounds included,  are mere impressions, aka figments of imagination, due to pigment (blood or blood substitute) appearing in particular locations in particular patterns. So too is that “crown of thorns” – mere artistic licence from the Savoy era of painted “copies” or engravings one suspects that is now made historical dogma. One cannot treat the unique TS as simply a work of art by focusing almost entirely on blood or blood-substitute, while demonstrating a major blind spot for the peculiar body image which many, myself included, still regard as an enigma.\n\n","date":"November 30, 2014 at 4:00 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173750","author":"Colin Berry","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Colin,\nThis is another one of your [inadvertent?] arguments for authenticity\n\n","date":"November 28, 2014 at 9:01 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173457","author":"John Klotz","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"There are two issues here. When was the body wrapped in the Shroud and were there two shrouds or burial cloths. \nAs to issue one, I am not sure we can ever have a definitive answer. Colin’s metaphor “body bag” to indicate that he was wrapped when taken down from the cross may seem a bit cheeky but that’s Colin. However, I did not detect, and maybe I read it too quickly an argument for a second Shroud. There’s is no evidence of that.\nIt is absolutely clear that the body was not fully prepared in the time that it was removed from the cross and first placed in the tomb. And before final preparations the body “disappeared.”\n“39 And Nicodemus also came, bringing a mixture of myrrh and aloes , about an hundred pound weight. 40 They took therefore the body of Jesus, and bound it in linen cloths, with the spices, as the manner of the Jews is to bury. 41 Now there was in the place where he was crucified, a garden; and in the garden a new sepulchre, wherein no man yet had been laid. 42 There, therefore, because of the parasceve of the Jews, they laid Jesus, because the sepulchre was nigh at hand.” (John 19: 39-42 (Rheims Duoay Kindle Edition)\nBecause the body  was not fully prepared it is ridiculous to claim that scripture, or anything else,  supports a second authentic shroud. Also, the concept that Nicodemus brought spices and stuff on a donkey that were twigs and leaves is if you pardon the pun, is made-up of “whole cloth.” [I am not sure if that’s an Americanism or Shakespeare but it means “not true.”]\nBy the way, I got an education on Wikipedia from a History professor yesterday who was intrigued by the failed attempt by Charles Freedman to post a pseudo-third party Wiki  entry as to his History Today theory. She had given her class an assignment to either make or edit a Wiki entry as demonstrations of how to use or not use it. \nShe explained the proper method that might pass muster. I owe Charles a debt of gratitude for engendering my private seminar. We shall see what we shall see.\nGiven Colins most recent post, he continues to make valuable contributions. However neither he nor Charles Freeman speaks or writes “ex Cathedra.” As a matter of fact, neither do I.\n. \n.\n\n","date":"November 28, 2014 at 7:54 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173443","author":"John Klotz","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"The Gospels are a very confusing and contradictory source. Only John implies that  the washing and the anointing were made. (“…as the manner of the Jews is to bury”. John 19 42).\nThe synoptic Gospels spoke on a linen cloth that was used to descend and wrapping the body and to put the body in the tomb. This sequence, without ulterior explanations, implies the linen used to wrap the body was used as a shroud (perhaps not a final one).\nOnly Luke speaks about a linen (singular) used to wrap the body first, and some funerary clothes (in plural) that Peter found in the empty tomb, after.\nWe can draw any conclusion from this series of incoherent descriptions. One, two clothes, bandages, one sheet and a sudarium… \nBut in the imaginary of painters that reproduced the story of the Shroud (Della Rovere and Clovio, over all of them), the stuff was clear. Some people are wrapping the body at the foot of the cross and it is a unavoidable conclusion that this was the cloth which was used also to bury the body because it has the same and inimitable form of the Shroud. Therefore, one sheet.  \nMy previous objection was against this interpretation (“the bag”, in Collin’s words). This is the usual interpretation of the sindonists, except Zugibe and his supporters. In my opinion, Zugibe’s supporters are a minority and also are in a mistake.\n\n","date":"November 29, 2014 at 3:47 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173562","author":"David Mo","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"There is really no evidence for an additional shroud. Max has written about the two he has detected in his archaeocryptology, one on top of the other, and this is a matter for discussion.\nIn the same way, there can be no two tombs, Church of the Holy Sepulchre and (Gordon’s) Garden Tomb. It is one or the other. Dan Bahat, who was for a number of years Jerusalem District Archaeologist wrote a paper in favour of the former:\n  https://www.academia.edu/7556467/Jesus_was_not_buried_in_Talpiot_-_Parts_I_and_II\nOne big mistake some people in the realm of Shroud studies make is to show the two tombs that can be seen beneath the church.They were told to add a note saying that the area was “honeycombed” with tombs, to quote Bahat, and prevent readers from thinking that the two tombs they have shown was the exact location where Jesus was buried. My advice seems to have fallen on deaf ears.\nJoseph of Arimathea made arrangements for Jesus to be buried in an unused tomb to avoid burial in one of the tombs reserved for criminals by the Sanhedrin. Some scholars have now claimed that these tombs had never been used because the Romans did not allow the Jewish court to execute criminals. This is absolute rubbish, the truth has been distorted to pave the way for Jacobovici’s “Jesus family tomb”. Jonathan, the High Priest at the Temple, was murdered by the Sicarii, James, the “brother of the Lord” was thrown from the Temple parapet and then clubbed to death with a fuller’s club, Stephen was stoned to death (in front of the apostle Paul, who was then the Pharisee known as Saul):\n     https://www.academia.edu/7471223/Jesus_was_not_buried_in_Talpiot_-_Part_III\nAlthough the Talpiot tomb had not gained support from the top Bibical scholars and archaeologists, both in and out of Israel, the mischief making has continued to now involve Mary Magdalene. An easily understandable article by the well-known British Catholic journalist Damian Thompson, has laid the claim to rest:\nhttp://www.spectator.co.uk/arts/arts-feature/9375532/no-one-in-the-bible-has-been-as-elaborately-misrepresented-as-mary-magdalene/\n\n","date":"November 28, 2014 at 12:53 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173485","author":"Louis","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"To David Mo:  Query re 1520 copy of Besancon Shroud on window of Swiss chapel.\nReference on web-site headed: “Besançon (préfecture du département du Doubs), région Franche-Comté” and includes the Besancon coat of arms:\nhttp://larocheusa.org/Besancon.htm  \nExtract from section on “More history” :\n“It is thought, but not proved, that the LaRoche family had possession of the Saint-Suaire for 150 years (probably at Saint-Etienne in Besançon or at the homeplace LaRoche (Rigney), and someone had the painted copy crafted at some time during the family’s possession. In any event, a shroud of some type was on display at the Chapel of the Holy Shroud in Saint-Etienne (Besançon), which building also possessed one of St. Stephen’s arms (before the fire of 1349). In due course, the painted shroud was placed in the newly upgraded Cathedral of Saint John (1669). It had become an important object of veneration in the seventeenth century, a period of conflict (Thirty Years War, annexations and withdrawals of France from this region) and yet another round of the plague. Indeed, the surrender of the city in front of the French armed forces, in 1674, was conditioned only upon a requirement to keep this relic at the Cathédrale Saint-Jean de Besançon. The Shroud of Besançon was sent to Paris on 27 Floréal, an II (May 16, 1794) of the Revolution. It is then thrown into a fire, from which it did not escape.” \n“One may find a representation of it on a window in the chapel of Pérolles in Fribourg, Switzerland, dating back to 1520. On the glass appears the canons of Besançon, an episcopal mitre, and the linen facing the crowd. The cloth bears the double image, quite similar to the Shroud of Turin. translated from http://fr.wikipedia.org and other French sites used as reference links. Reports in early April 2009, have Vatican documents now supporting a link between the Shroud known in 1204 and that seen in 1357. The known history of the Shroud of 1204 appears to go back hundreds of years to Edessa; so, therefore, scientific reports that the Shroud was only a medieval fake are themselves in question.” \nThe paragraphs are clearly written from a subjective point of view, but demonstrate the perspective on the issue.  The reference to the 1520 copy on the chapel window is in the first three sentences of the second paragraph.  I have yet to check if the window is featured on the web.\n\n","date":"November 28, 2014 at 1:27 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173489","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"http://larocheusa.org/Besancon.htm\nThis page contains a lot of mistakes and inventions. Bad work\n\n","date":"November 28, 2014 at 1:33 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173491","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"I did concede that some of the text seemed written from a subjective point of view.  However it is not a singular point of view because there are several other similar examples asserting much the same.  So I would not call it bad work, and it suggests to me that it may have a substratum of truth.  Merely because you disagree with it is not sufficient to dismiss it;  you must demonstrate how and why any errors occur, and it needs more than mere assertion. \nIt may be intriguing that a claim is made for a 1520 chapel window seeming to show the Besancon Shroud recognisable as the Piedmont Shroud, when most other examples of the Besancon item is only a ventral image.  Either the artist confused the two items, or it may be possible that it reflects an underlying memory of the Piedmont Shroud in Besancon. \nI will search for the chapel window reported and see whether it matches the article.\n\n","date":"November 28, 2014 at 11:07 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173537","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"It is not “subjective point of view”, it is “a lot of mistakes”. If there are several other similar examples asserting much the same, is because people love copy from other and repeat, without studying. And it is troubling that ALWAYS people who study is asked to demonstrate, whereas people who copy and invent not.\nHowever, only FEW things:\n1) Othon de la Roche was not “a prince of Morea”.\n2) he did not “sent some type of shroud in 1208 to his father”, because his father on 1208 was dead.\n3) “history first records a shroud (most think it was a painted copy) on display at Besançon before 1349”. But is not said that it was not a “shroud”, but a white neckerchief without image.\n4) “Then it was out of public view for about 3 years, because the former Cathedral at Besançon was struck by lightning”. False.\n5) “When the fabric returned to public view, the shroud shown at Besançon was clearly a painted copy”. We have no ONE reliable source saying that after the fire a painted shroud was shown.\n6) “Jeanne de Vergy, a direct descendent of Otto”. No, Jeanne de Vergy was not a direct descendent of Otto.\n7) “[…] was the first to publicly display the Shroud of Turin in the 14th Century”. No sources saying that.\n8) “In 1389, the Shroud went to another family member (Margaret)”. False.\n9) “Interestingly, the burn marks on the original Saint-Suaire come from a cathedral fire”. Invented.\n10) “It is thought, but not proved, that”….,  funny.\n11) “a shroud of some type was on display at the Chapel of the Holy Shroud in Saint-Etienne”. Yes, but after 1523 (in reality, there was not any “Chapel of the Holy Shroud” in Besançon before 1748).\n12) “It is then thrown into a fire, from which it did not escape”. Invented.\n13) “One may find a representation of it on a window in the chapel of Pérolles in Fribourg”. The chapelle of Perolles has a painting of the Chambéry Shroud, and shows both sides of Christ. It is obvious, as the Shroud of Besançon with image was displayed first time on 1523. Because, I have said many times, the Shroud of Besançon did not exixt on middle age.\nIt is enough?\n\n","date":"November 29, 2014 at 6:08 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173579","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"To me?\n\n","date":"November 29, 2014 at 2:30 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173555","author":"David Mo","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"There is one striking similarity between the Pray Codex and the Shroud.  Jesus has the same extremely shortened forehead in both. This same shortened forehead can be seen in other (Jesus and ‘non Jesus’) early gothic art. The conclusion is obvious. The ‘impossible’ dimensions of the shroud head were fairly typical of early medieval art.\n\n","date":"November 28, 2014 at 5:56 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173507","author":"aljones909","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Yes indeed.\n\n","date":"November 29, 2014 at 2:44 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173557","author":"PHPL","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Here’s a quantitative measure: calculate this ratio – the distance from the the top of the head to the mid-point of the eye: total head length.\nFor a normal human this should be around .49.\nA figure below .47, for a real human male,  is very, very unusual.\n(1) The shroud figures ratio is .42.\n(2) The pray codex image ratio is .41\n(3) A sculpted Jesus from Chartres Cathedral (1200/1210) has a ratio of .41\n\n","date":"November 29, 2014 at 6:15 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173660","author":"aljones909","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"\n\n","date":"November 29, 2014 at 6:18 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173661","author":"O.K.","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"I’ve shown actual images where there is a striking similarity in the distorted facial distortions. I’ve no idea what your trying to demonstrate (and why would hair  make a contact image at some places and not at others).\n\n","date":"November 30, 2014 at 5:30 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173901","author":"aljones909","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"The Chapelle de Pérolles (http://goo.gl/UTOiDx) built in 1520 in Fribourg, Switzerland, has a stained glass window representing the Shroud of Christ. According to a photograph of this small guide of the city, the representation of the Shroud has a front-body image only (not a double image). Two bishops are holding the Shroud. I do not see how we could, without any doubt, connect this representation to the Shroud of Besançon and not to the Shroud kept at the time in Chambéry (Shroud of Turin) unless we assume that with a front-body image only it should be the Shroud of Besançon. Yet, it has to be verified if this photograph is not truncating part of the representation of the stained glass window.\nAlain Hourseau in his book “Autour du Saint Suaire et de la collégiale de Lirey (Aube)”, p. 240, wrote that this stained glass of the Shroud at the Chapelle de Pérolles commemorates the ostentation of October 28, 1518, at the Castle of Chambéry, not the one in Besançon. But he also wrote that three bishops are holding the Shroud, although only two can be seen (again, assuming that the photograph above did not truncate the representation on the stained glass window). It is not clear how Hourseau came up with the date of October 28, 1518. My guess is that this date is based on the chronicle of Antonio de Beatis (http://goo.gl/pTSvnd), which relates the trip made by the Cardinal of d’Aragon in Germany and France, among other countries. The Cardinal arrives in Chambéry on October 28, 1518 (p. 208) and the Shroud his shown to them in the evening of that day. Beatis writes that they are being told that the Shroud is publicly shown only twice a year, on May 3 and on Good Friday, from an outside wall of the castle. It is therefore doubtful that this private showing of the Shroud, on October 28, at Chambéry, is related to that stained glass window representation. It could be based on the regular public showing at Chambéry.\nAs for the copies of the Shroud of Besançon, many copies were made according to Jules Gauthier (http://goo.gl/8qJb1i), some by Pierre d’Argent (p.9, first copy made in 1573, second in 1580, third in 1593). But d’Argent started to make unauthorized copies, and recognized in 1608 that they should not have been made. Some of these unauthorized copies were destroyed although many were not as they were sent to different countries. Only smaller copies, not real-size, were allowed to be made without the authorization from the religious authorities of Besançon (the same policy applied today by the Turin authorities!).  Jean de Loisy made his first copy in 1634. His younger brother Pierre took over after the death of Jean and got the exclusive right to reproduce the Shroud of Besançon in 1658. Pierre died around 1668, and his son Claude-Joseph took over as copyist although he no longer had the exclusive right on producing copies, which greatly increased the reproduction of the Shroud of Besançon in various forms (e.g., medals). Therefore, from then on, copies could have been made by any artist of the time.\n\n","date":"November 29, 2014 at 3:56 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173564","author":"Mario Latendresse","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Andrea Jicolotti:\nIt is obvious, as the Shroud of Besançon with image was displayed first time on 1523. Because, I have said many times, the Shroud of Besançon did not exixt on middle age.\nOh really?\n\n","date":"November 29, 2014 at 7:31 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173585","author":"O.K.","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Thank you Mario for your extensive discussion on this issue.\nThe window(s) appear as Plate 30a in Wilson 2010.  It seems there may be two windows: on the left one are two bishops, looking to the right holding the ventral section;  on the right are two bishops (one looking to the left, the other face on) holding a cloth with only a vague suggestion of an image (possibly the dorsal).  Wilson’s caption places the scene as parapet walls of Chambery Castle, c. 1523-3.  His picture credit is: ‘Marcel Strub “Les monuments d’art et d’histoire du Canton de Fribourg”, Basle(?): ed. Birkhauser, 1959.’  I surmise a copy would be archived in a relevant library.  \nThis would have to be the representation referred to in my extract at Nov 29, 1:27pm, where it is claimed: “On the glass appears the canons of Besançon, an episcopal mitre, and the linen facing the crowd. The cloth bears the double image, quite similar to the Shroud of Turin. …”  Clearly whoever wrote the Besancon text interpreted the scene quite differently from Strub’s work.  It would seem to be an attempt to claim that the Shroud was originally in Besancon, but other references can also be found for this claim.  One wonders at what feature in the window identifies the claim for the Bishops being canons of Besancon?\n\n","date":"November 29, 2014 at 2:51 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173640","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Thanks Daveb for the pointer to Wilson’s book for this stained-glass window. Indeed, a double-image of the Shroud is depicted with four bishops. I think it is safe to presume that this depiction is from a public showing in Chambéry. I would base it solely on the double-image. I do not know any copy of the Shroud of Besançon with a double-image.\nIf someone could get a wider photograph of the context of that stained-glass window it would be nice.\n\n","date":"November 29, 2014 at 4:53 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173651","author":"Mario Latendresse","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"\n\n","date":"November 29, 2014 at 5:00 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173652","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Thanks for the photo. I see that this photo may come from http://goo.gl/q90MgF, which also has other photos that give an idea of the size of the chapel.\n\n","date":"November 30, 2014 at 5:08 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173897","author":"Mario Latendresse","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Scavone’s 2008 Ohio paper sets out the Besancon case very clearly.  The principal authorites he cites seem to be:\n8 See Chifflet (1624); Vignon (1902, 64-76); Fr. Paul de Gai (1973); and\nDorothy Crispino (1985).\n9 M. Buttigieg (1990); Bro. Hilary de Crémiers (1991); Michel Bergeret\nin CIELT (1993); and now Alessandro Piana in BSTS Newsletter\n(2007). See also Piana, Sindone: gli anni perduti (2007).\nThe specifics are in his bibliography. \nThe essential outline of the scenario he gives is:\n–  Around 1206 or 1219, Othon de la Roche arranged to ship the Shroud from Athens to his Burgundian Chateau de Ray-sur-Saône near Besançon, as in 1219 Othon sends his confrere Pons de Chaponay to Besancon on an unidentified but important mission.  Bergeret and Piana have provided photos of a wooden chest labeled in recent times as that in which the Shroud was “brought back by Othon de Ray in 1206.”  Scavone opts for the 1219 date. \n– At some time before 1349, Jeanne de Vergy, concerned that at Besancon the Shroud was under threat from various causes, decides to rescue the Shroud for France, and brought to her marriage to Geoffray I de Charnay 1351-54.  Malijay argued further that she presented it first to the French king, Philip VI de Valois (d. 1351), who in turn awarded it to Geoffroy de\nCharny. \n– Besançon’s historians wrote that on March 6, 1349, a fire in St. Stephen Cathedral resulted in the apparent destruction–certainly, the disappearance– of their Shroud and the loss of all church documents attesting to the circumstances of its arrival in that city.  It would have been unwise to announce that Lirey now possessed Besançon’s lost precious relic.\n– In 1624 J. J. Chifflet, Besançon’s first historian, convinced that the original Shroud was consumed in the St. Stephen fire, wrote that in 1377 it was miraculously discovered in a niche in the new cathedral. In 1902, based on the illustrations of the Lirey and Besançon shrouds from Chifflet’s book,  Vignon wrote that the Shroud of Besançon was clearly a replica of that of Lirey, made between the years 1349 (the fire) and 1375. Besançon’s own historian Dom François Chamard (1902) agreed–though he was not forthcoming about how Lirey had obtained the original.  \n– Towards the conclusion of his paper, Scavone makes the case that the copy was commissioned by Jeanne de Vergy to replace the Shroud she had taken from Besancon, that the succession of four bishops meant that no-one really knew what the original Besancon Shroud looked like, that the copy was attested by a bishop who was a family connection, and that this was the actual copy referred to in Pierre D’Arcis’ notes, and that D’Arci’s was confused as to which was the genuine Shroud.  \nIt all hangs together very neatly, and my summary notes barely do full justice to Scavone’s detailed case.\n\n","date":"November 29, 2014 at 6:19 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173663","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"<<<<<<<principal authorites he cites seem to be:\n8 See Chifflet (1624); Vignon (1902, 64-76); Fr. Paul de Gai (1973); and\nDorothy Crispino (1985).\n9 M. Buttigieg (1990); Bro. Hilary de Crémiers (1991); Michel Bergeret\nin CIELT (1993); and now Alessandro Piana in BSTS Newsletter\n(2007). See also Piana, Sindone: gli anni perduti (2007).<<>>Around 1206 or 1219, Othon de la Roche arranged to ship the Shroud…\nWe have proofs and documents?\n>>>>Jeanne de Vergy, concerned that at Besancon the Shroud was under threat….\nWe have proofs and documents?\n>>>> wrote that in 1377 it was miraculously discovered in a niche in the new cathedral…\nWe have proofs and documents?\n>>>>Besançon’s own historian Dom François Chamard (1902) agreed–though…\nWe have proofs and documents?\n>>>>>the copy was commissioned by Jeanne de Vergy to replace the Shroud …..\nWe have proofs and documents?\n—————\nThe romance invented by Chamard and reproposed by Scavone and Piana is very funny, but remains a romance. They have not a shred of document saying what they believe.\nI am still waiting for a document before 16th century saying that in Besançon there was a shroud with an image of Christ. I am still waiting to pass the first floor, and other people believe to be at the top of the building.\nAlways the same problem: they WANT to put a Shroud in some place, so they invent where.\nFirst lesson of history: do not invent.\n\n","date":"November 29, 2014 at 6:50 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173665","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Andrea is free to believe what he will.  He may prefer the  alleged explanation of Pierre D’Arcis that it was so cunningly painted that it succeeded in deceiving a succession of medical forensic pathologists from Yves Delage to Fredererik Zugibe.  That will not satisfy others more rationally minded.  Scavone makes the point as early as his page 3 that the Shroud remains relatively free of historical documentation.  I should imagine that the 1349 fire at St Stephen’s would leave little in the way of any documentation of any real event there whatsoever.  What little might have remained in the region was dispatched by the French Revolution.  In those circumstances it is fatuous to demand documentation to make a case for anything, and one must be satisfied with what little can be discovered, some even from family traditions.  Geoffray de Charnay’s descendants could only say that his acquiring  the Shroud was as “a reward freely given” which assists very little.  If the Shroud was not “cunningly painted” then its emergence in Lirey by some means demands an explanation.  We can hardly suppose that Othon de la Roche had any motive for sending it to either of the De Charnay or de Vergy families in Troyes, when his own castle was at Besancon in Burgundy. \nThe “historical critical” method which Andrea seems to consider is the touchstone of historic discipline puts me much in mind of Bertrand Russell’s approach to mathematics with his logical positivism.  Russell devoted some 300 pages of his Mathematica to prove his conjecture that if one object was added to yet one other object of the same class, that the result was in fact two such objects.  I exaggerate not!  Russell’s Mathematica is now merely of antiquarian interest, and it discovered little that was new.  I fear that the “historical critical” method is of the same genre, and it is hardly likely to discover anything that is not already known.  That will not satisfy the exploratory genius of the human brain which seeks to know the unknown.\n\n","date":"November 29, 2014 at 9:40 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173694","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"You can imagine as you like. But History is built with documents.\nAndrea is “still waiting for a document before 16th century saying that in Besançon there was a shroud with an image of Christ”. I too. \nI am very surprised to see how Russell is invoked here. I don’t know if Sir Bertrand has devoted some pages to the historical method- except to say the obvious assert that the History is not predictable-, but he was a defender of rationality and experimental method in sciences and Philosophy. He was a hard critic of  beliefs in God, miracles and superstition. He thought also that Religion is damaging and the Humanity will be happier without it. So, the first question he would have put here is: “Have you any document about the existence of the Shroud in the first fourteen centuries?” “There is not a scientific experience with radiocarbon that dates the Shroud in the 14th century?”  I think he wouldn’t be very happy with the stories of complots made by Bonnet-Eymard and invisible mending made by Marino and al.\nI’m sorry but when a I see some people invoking here Bertrand Russell I think they ingnore that are invoking the devil in person or are provoking.\n\n","date":"November 30, 2014 at 3:23 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173743","author":"David Mo","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"The demand for documentation I attribute to a singularly Eurocentric view of the literate society.  If Andrea Nicolotti or David Mo had lived in the Pacific or in Africa they might have a rather different view of the worth and value and authenticity of oral tradition of non-literate peoples, the prevailing milieu of 14th century Europe.  Setting aside the plagiarism controversy, I would recommend as a first lesson the reading of Alex Haley’s “Roots The Saga of an American Family”.   It seems that Haley borrowed extensively from Harold Courlander’s “The African”.  Nevertheless “Roots” had great influence on awareness in the United States of African-American history and inspired a broad interest in genealogy and family history.  \nMuch of its success derived from the oral traditions in Africa which were found to match the Afro-American traditions that Haley had come to know through his own family in the USA.   Likewise the Polynesians navigated the Pacific by means of the oral traditions handed down to them.  In NZ today the Maori folk recall their genealogies with great reliability, together with the various historic events significant to them.  The scriptures themselves are derived from oral traditions, the alleged contradictions between the four gospels for instance are generally of insignificant import, and their consistency is remarkable.     \nTo demand a non-existent documentation of a 14th century non-literate society, in the wake of massive destructions of such evidence from a persistent war-torn environment, is I think to rob Europe of much of the tradition of its own significant historical events.   \nYes, Russell’s “Principia Mathematica” was a massive and significant work.  However few mathematicians today have even bothered to read it.  It seems that the Russell-Whitehead vision of building a mathematical edifice solely on principles of logic was dealt its death blow by Godel’s 1931 theorem of undecideability.  “Moreover, Kurt Gödel’s first incompleteness theorem (1931) proves that there cannot be a single logical theory from which the whole of mathematics is derivable: all consistent theories of arithmetic are necessarily incomplete.”  Nevertheless, scientists, engineers and even mathematicians continue to do mathematics and see it as a worthwhile and valuable activity!  \nI suspect that the much vaunted “Historical Critical” approach to the discipline of History is in similar vein to Russell’s essentially Platonic view of mathematics, and no less likely in its inability to discover anything new of great moment!\n\n","date":"November 30, 2014 at 5:42 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173761","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Daveb, I do not understand why we need to change the historical method and write useless words about Africa and bla bla….. to make a gift to sindonologists. I ask very very simple questions: 1) documents before 16th century saying that in Besançon there was a shroud with an image of Christ”; 2) documents before 18th century saying that Othon de la Roche had a shroud.\nAnswers: 0.\nIf you believe that, without this, you can INVENT…. I do not know what I can do. You are wrong. The game is over. But is over with this “conclusion”:\n“Sindonologist believe that it is correct and possible to invent a medieval history of the Shroud of Besançon without proofs, because they want this”. It is enough for me. Clear. \nYves Delage and Frederik Zugibe (the first one was not a medical forensic pathologists) have nothing to do with this.\nYou want to believe that the 1349 fire (1350, indeed) at St Stephen’s destroyed documents? If it is true, if the fire destroyed them, and if you have not seen them, you cannot INVENT them. But, I inform you, fires are the customary pretext for forgers.\nAnd I am not so exigent with you: I ask not only medieval documents before the fire, but also documents AFTER the fire. We have a lot of historical and liturgical documents in Besançon AFTER the fire (and also BEFORE). We have liturgical books with the fests celebrated in Besançon. We have the books with the deliberations of the chapitre. We have many books and documents. Where they mention a shroud?\nYour argument “what little might have remained in the region was dispatched by the French Revolution” is weak, because all historians in Besançon that tried to write the history of their Shroud BEFORE the French Revolution did not find documents (obviously, they did not exixt) and choosed to INVENT like you do. But they invented other things: that Shroud was brought there by Aelia Eudocia or Licinia Eudoxia or Galla Placidia. No crusades, no Othon.\nWho invented better? Scavone and Chamard in XX century or D’orival and Gollut in XVII century? \nWhy Scavone is right and D’Orival not? Because the last one is right? So, if I invent something about this I’ll become right? \nI inform you that on XVI century the history invented by D’Orival was considered “opposite to the truth and history” by Chifflet, but “consistent  to the tradition” by the chapter of the cathedral of Besançon.\nWho is right? And why we do not see here any De la Roche or Vergy? You think that Scavone is better informed than Chifflet?\nNow I want to know why your invention is better than other inventions, in the past or the future, about the shroud of Lirey. We have a lot of possibilities. You propose a new history “believe what you want”? Better if in universities professors of history leave the place: we can engage novelists and  comic-strip artists.\n\n","date":"November 30, 2014 at 5:58 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173765","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Andrea:\n2) documents before 18th century saying that Othon de la Roche had a shroud.\nAnswers: 0.\nThe 1205 letter of Theodore Angelus to the Pope Innocent III, Plus 18th century MS 826 manuscript saying about Otto. That’s enough.\n\n","date":"November 30, 2014 at 7:48 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173782","author":"O.K.","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Oskar, I do not want to start discussions with you, but the letter of Theodore Angelus is a forgery, and does not make the name of Otto nor tell something about shrouds with images or shrouds in Besançon, and the 18th century MS 826, as we know, was written 500 years after, and it is a falsification of medieval sources, as Vignon, Zaccone and other know and explained many years ago.\n\n","date":"November 30, 2014 at 8:08 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173789","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Are Andrea and daveb arguing at cross-purposes? Daniel Scavone himself writes, as the opening sentence of his “Documenting the Shroud’s Missing Years” that “History proceeds from documents, not arguments from silence. Besançon alone, of all the major theories of the Turin Shroud’s whereabouts during the missing 150 years, has documents to support its possession of the Shroud after the Fourth Crusade until about 1350, after which the Shroud’s history from Lirey to Turin is well established.” He then reviews various letters and documents from about 1200. Assuming that these were not subsequent forgeries, which is not necessarily wise, the question then becomes; do these documents support the hypothesis that Otho de la Roche owned a shroud? Scavone refers to a letter written from the Emperor Alexius V Mourtzouphlus to Pope Innocent III in 1204, specifically complaining that the Holy Shroud had been stolen by Otho de la Roche, which is evidence, if not conclusive. The letter may be a forgery, or the shroud may have been a different one from Turin’s, or the Emperor was mistaken, but there is a document, and that’s what it says.\nNow for the image. Scavone gives no evidence that the Besancon shroud bore an image, but only assumes that it must have done by conjecturing that it became the Turin Shroud in about 1350. As the conjecture is only circumstantially evidenced, so must the suggestion that the Besancon shroud bore an image be similarly only a conjecture.\n\n","date":"November 30, 2014 at 8:05 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173786","author":"Hugh Farey","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Hugh, can you show the letter of the Emperor Alexius V Mourtzouphlus to Pope Innocent III, specifically complaining that the Holy Shroud had been stolen by Otho de la Roche?\n\n","date":"November 30, 2014 at 8:11 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173790","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Hugh:\nFirst, read my discussion with Andrea in this thread:\nhttps://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/#comments\nSecond: As to the letter written from the Emperor Alexius V Mourtzouphlus to Pope Innocent III in 1204, see http://www.shroud.com/pdfs/n76part4.pdf\nThird: The Besancon Shroud (the one that existed since at least 1523) had an image, see Vignon http://www.holyshroudguild.org/weuenshel-collection-provided-by-google.html\nThe problem is its relation with the Shroud of Turin. It is supposed that Otto de la Roche possesed the Shroud of Turin circa 1205, and the Shroud of Beesancon is simply its copy, made either on behalf of Otto, or several centuries later.\n\n","date":"November 30, 2014 at 8:14 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173791","author":"O.K.","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Oskar, I do not want to start discussions with you, but the letter of Theodore Angelus is a forgery, and does not make the name of Otto nor tell something about shrouds with images or shrouds in Besançon, and the 18th century MS 826, as we know, was written 500 years after, and it is a falsification of medieval sources, as Vignon, Zaccone and other know and explained many years ago.\nWhy don’t you want to discuss with me? Are you afraid of that? Indeed the pace, when you were running away from discussion with me in this thread  https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/#comments was really impressive!\nI asked you when the letter of Theodore Angelus was forged (century)? You answered on November 1, 2014 at 3:09 pm: \nprobably from xvi to xix\nLater you claimed on November 1, 2014 at 3:57 pm: \nAll fake-Chartulariums are falsificated to give importance to a family or institution that has no importance and wants to have it. So the forger of the cartulary created a fake diploma of Constantine XI, with a false genealogy of his family; and then, to make believe that his family had in the past important relics, made a false dowry which contained the stones of the home of Our Lady of Loreto, a false report of translation of the relics of the martyrs of Otranto to naples and our false letter to the pope where is said that they possessed the Shroud. When the letter was forged, the forger was inspired by the histories of the Shroud of Turin written in his times, after Pingone [1581] that for the first time said that Marguerite de Charny was a GREEK noble woman; that, we know, was false, but repeated for a long time). The forger was not very able, and did not know the Greek; it is easy to see that the document is not authentic. When I showed the letter to the most important experts on this field, Luca Pieralli and Otto Kresten, in five minutes they confirmed my opinion.\nThen I asked on November 1, 2014 at 4:07 pm\nAnyway, next round. What about 18th century “sources” (fake according to you), that is one source, that is presumably one part of MS 826 manuscript which originated the story about Otto de la Roche, and the Shroud of Besancon?\nDid the forger from De Angelis Family also put his fingers in it?\nThen you ran away. You seemingly understood. But you cannot run away from that question. It will catch you no materr how far you will be trying to escape.\n\n","date":"November 30, 2014 at 8:23 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173792","author":"O.K.","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"<<<<<Why don’t you want to discuss with me? \nBecause I know that our ways of thinking are too much different, so in our discussion it is impossible to find a common point of starting. And normally you do not have informations that I do not know, so I do not learn from you. Therefore, our discussion is useless.\nAnd, as I have just said, I do not consider a blog a place for deep discussions, but only a place to share informations. I give some informations, and people can use them as they want. And sometimes I learn something form other people.\n\n","date":"November 30, 2014 at 8:31 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173793","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Because I know that our ways of thinking are too much different, \nYes, but that’s in plus. Had our discussions not been so confrontational, this combination of different thinking styles would be a big bonus. But because it is as it is…\nso in our discussion it is impossible to find a common point of starting.\nOr rather common conclusion. Normally people discuss to find some final consensus.\n And normally you do not have informations that I do not know, so I do not learn from you. \nBad thing -for you of course. \nTherefore, our discussion is useless.\nOh really? Or maybe simply… inconvenient for one side.\nAnd, as I have just said, I do not consider a blog a place for deep discussions, but only a place to share informations.\nWhy not? Here you have some of the greatest specialist on the Shroud of Turin on Earth.\n\n","date":"November 30, 2014 at 8:37 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173794","author":"O.K.","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Andrea, I asked you a simple question: “did the forger from De Angelis Family also put his fingers in it (MS 826)?” The one on which you can answer either ‘yes’ or ‘no’.\n\n","date":"November 30, 2014 at 8:40 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173795","author":"O.K.","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"I have just answered to this.\n“When the letter [from De Angelis Family] was forged, the forger was inspired by the histories of the Shroud of Turin written in his times, after Pingone [1581] that for the first time said that Marguerite de Charny was a GREEK noble woman; that, we know, was false, but repeated for a long time” in all the books about the Turin Shroud. So, it was natural for the forger put the shroud in Athens.\nThis is the first possibility.\nThe other one, less probable, is that the forger read the book of Dunod de Charnage (1750) and his followers, where was written that a shroud was translated to Athens on 1204. So, he did’nt know the manuscript 826, but its printed summaries. But, I repeat, this is less probable.\n\n","date":"November 30, 2014 at 8:56 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173798","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"I have just answered to this.\n“When the letter [from De Angelis Family] was forged, the forger was inspired by the histories of the Shroud of Turin written in his times, after Pingone [1581] that for the first time said that Marguerite de Charny was a GREEK noble woman; that, we know, was false, but repeated for a long time” in all the books about the Turin Shroud. So, it was natural for the forger put the shroud in Athens.\nThis is the first possibility.\nNot only in Athens but 1205 AD Athens! Ruled by Otto de la Roche! Nice -and extremely improbable concordance of forgeries!\nThe other one, less probable, is that the forger read the book of Dunod de Charnage (1750) and his followers, where was written that a shroud was translated to Athens on 1204. So, he did’nt know the manuscript 826, but its printed summaries. But, I repeat, this is less probable.\nEven less probable! But here comes the third factor here. The coffer from the Ray-sur-Saône castle: http://www.acheiropoietos.info/proceedings/PianaMYHSWeb.pdf\nDid the conspirators installed it there?\n\n","date":"November 30, 2014 at 9:05 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173800","author":"O.K.","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Concordances in modern forgeries are not strange nor extremely improbable. That Otho had a shroud, I remember, was invented on the first half of 18th century, AGAINST the tradition known in Besançon until that moment, and FALSIFICATING medieval sources. But you believe on it.\nThe coffer. It remembers to me the history of Napoleon and his bed in a town near my house. In north of Italy many villages share the tradition that Napoleon slept one night in a house of the village. All villages wnat this privilege, but If they are all righy, it means that Napoleon slept all his life, day and night, changing everyday a bed.\nOne day I was in a little “castle” in Piedmont where the owner, showing us a room with a 18th century bed, said that “Napoleon slept there”. And I said to him: “But we do not have any document saying that Napoleon went in this village, nor that slept here!” And he answered: “Oh yes, he did it. The bed is the proof”.\nThis is like your coffer and the shroud.\n\n","date":"November 30, 2014 at 9:22 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173804","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Concordances in modern forgeries are not strange nor extremely improbable. \nYeah, yeah, dependent what concordances.\nYou are creating a nice – I must say this – conspiracy theory –  a faked document in Besancon archives (as far as I remmebr MS 826 has two parts FOR and AGAINST the Shroud of Besancon), a faked coffer installed in some old castle of some old chevalier house, and a forger from some Sicilian clan, a thousand miles away, creating a faked document basing on some old and forgotten books on both Shrouds (of Besancon and of Turin) and then placing it in some forgotten by everyone Chartularium, a copy of which will be rediscovered opnly in 1981!\nMakes it any sense?\nOne day I was in a little “castle” in Piedmont where the owner, showing us a room with a 18th century bed, said that “Napoleon slept there”. And I said to him: “But we do not have any document saying that Napoleon went in this village, nor that slept here!” And he answered: “Oh yes, he did it. The bed is the proof”.\nPerhaps he indeed slept there!\n\n","date":"November 30, 2014 at 9:37 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173810","author":"O.K.","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"If your historical methods (only yours) are right, ALL medieval shroud (by dozens) are authentic, because all have modern documents forges stating their authenticity . And Napoleon slept everywhere.\nDo you see why is useless our discussion?\n\n","date":"November 30, 2014 at 9:47 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173811","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"If your historical methods (only yours) are right, ALL medieval shroud (by dozens) are authentic, because all have modern documents forges stating their authenticity . And Napoleon slept everywhere.\nDo you see why is useless our discussion?\nYeah, yeah, Andrea, you try to throw mud on me, as I have shown the absurdity of your conclusions.\nAs Emanuella Marinelli pointed: (http://www.shroud.com/pdfs/n74part8.pdf pg. 13)\nHere, Nicolotti’s method is thus: if a document is controversial, then it is false. If a document is authentic, then what it is written in it is false. If what is written is true, it cannot refer to the Shroud that is now in Turin\nThat’s why convincing you is futile. But exposing your intellectual dishonesty is is not.\nBTW: have you ever tried to count the number of alleged burial cloths through centuries?\n\n","date":"November 30, 2014 at 9:58 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173815","author":"O.K.","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"“exposing your intellectual dishonesty “.\nMr. Anonymous, and courageous, for me the discussion with you is over, not only because I loose my time, but also because I do not accept this kind of judgment, and from someone that has not idea about what he says. You can continue your apologetic without me. You will seem also more informated. It is a gift for you.\n———————\nIf someone has an answer to my questions, I remain here waiting.\n1) documents before 16th century saying that in Besançon there was a shroud with an image of Christ;\n2) documents before 16th century saying that in Besançon there was a shroud;\n3) documents before 18th century (i.e. before the forgery of the 826 manuscript of Besançon) saying that Othon de la Roche had a shroud.\n\n","date":"November 30, 2014 at 10:11 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173818","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"If someone has an answer to my questions, I remain here waiting.\n1) documents before 16th century saying that in Besançon there was a shroud with an image of Christ;\n2) documents before 16th century saying that in Besançon there was a shroud;\n3) documents before 18th century (i.e. before the forgery of the 826 manuscript of Besançon) saying that Othon de la Roche had a shroud.\nWaiting for what? It is well known that even if such documents were found, you will label them ‘forgeries’.\nBut if the documents we have already, are not enough for you, and you don’t know (nor want to know) how to extract important information out of them, and make valid conclusions, your loss. That’s a difference between a good historian, and primitive negationism.\nThat’s why I have low respect for historians and other ‘humanists’ (not all of course). The inability to think outside schematic methods. It seems they don’t teach them at studies. The better for their old ‘authorities’ and masters -have their a^&&# secure.\n\n","date":"November 30, 2014 at 10:23 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-173820","author":"O.K.","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"You could read Nicolotti’s article about the false Ordine Costantiniano Angelico Di Santa Sofia here: http://www.giornaledistoria.net/index.php?Mestiere=557D0301220202755772070305732771 (In Academia.edu also)\nHere you would find some convincing arguments against the authenticity of those documents in which you believe as the Holy Word. Then you could make some kind of rational objection instead of insults and generic lamentationi.\n\n","date":"December 1, 2014 at 2:16 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174050","author":"David Mo","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"About the alleged letter from Teodoro Comneno Ducas to Inocenzo III:\n “Si tratta di una falsificazione tarda e di basso livello sicuramente posta al centro della discussione scientifica sulla Sindone dall’entusiasmo in buona fede di qualche ecclesiastico. Il fatto che finora sia stata acriticamente citata va solo imputato alle scarse conoscenze di diplomatica (bizantina e non solo) con cui lavorano molti storici”. (Lucca Pieralli and Otto Kresten, quoted by A. Nicolotti: I Templari e la sindone, Roma, Salerno Ed., 2011, p. 111.\nMy translation:\n“This is a late forgery and low-level certainly at the center of the scientific discussion on the Shroud in good faith by the enthusiasm of some ecclesiastical. The fact that so far has been uncritically cited only is due to the limited knowledge of diplomatic (Byzantine and more) they work with many historians.”\nLucca Pieralli is professor of Paleografia e Codicologia Greca presso la Scuola Vaticana di Paleografia, Diplomatica e Archivistica and was dishonestly quoted by Barbara Frale as a support to the authenticity of the letter.\nOtto Kresten is professor at the Institut für Byzantinistik und Neogräzistik,Universität Wien. More here: http://de.wikipedia.org/wiki/Otto_Kresten (In German)\n\n","date":"December 1, 2014 at 3:21 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174071","author":"David Mo","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"The alleged letter from Theodore Comnenus to Pope Innocent III is discussed on pp 6-7 of the Scavone paper.  He includes the following footnotes 11, 12: \n11 Pasquale Rinaldi (1983); Scavone “Documents” (1989). The letter was rediscovered in the archive of the Abbey of St. Caterina a Formiello, Naples; it is folio CXXVI of the Chartularium Culisanense, originating in 1290, a copy of which came to Naples presumably as a result of close political ties with the imperial Angelus-Comnenus family from 1481 on. See also Longnon (1949, 118).\n12 Karlheinz Dietz (personal letter), citing Polemis (89f.), is essentially correct about the nomenclature of Theodore of Epirus. But other scholars are not so insistent. Theodore himself could use Doukas, Angelos, and Comnenus sometimes together and sometimes\ninterchangeably. Polemis concedes, with Stiernon, only that after Theodore’s fall from power did his contemporaries call him by Angelos. See Wolfe (240). The use of the name Angelos and the credibility of Theodore’s letter in 1205 are supported by the following. In 1202, when the Western princes launched the Fourth Crusade from Venice, Alexius IV, the son of the deposed Isaac II, appealed to the crusaders, promising to end the schism of East and West, to pay for their transport, and to provide military support to the crusaders against their original target, Egypt, if they helped him to depose his uncle and to sit on his father’s\nthrone. Moreover, Alexius V Doukas Mourtzouphlus, had initially led the resistance to the crusading forces. The name Angelos was decidedly more popular in the West than Doukas.\n\n","date":"December 1, 2014 at 4:57 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174089","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"My comment above, “Assuming that these were not subsequent forgeries, which is not necessarily wise….” I wish I’d stopped there now! So is there any other contemporary evidence that Otho possessed the Shroud?\n\n","date":"December 1, 2014 at 5:17 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174095","author":"Hugh Farey","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Hugh, I repeat again: the history of Othon de la Roche was invented in the fist half of 18th century by a priest in Besançon, manipulating and inventing sources, for the shroud of Besançon that was a copy of the shroud of Turin made in 1523 circa. Sindonologists are able to: 1) believe to the forger; 2) tell that the Shroud of Beançon was present in Besançon in the middle age, that is an invention made without documents; 3) conjecture that in the middle age the shroud of Besançon was the Shroud of Turin. They love mix histories of different relics (e.g. mandylion/shroud)\n\n","date":"December 1, 2014 at 5:26 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174099","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"And sceptics, like Andrea Nicolotti, Ph. D. in medieval history, are able to believe a conspiracy theory that two separate faked obscure document were fabricated in perfect concordance, for actually no purpose in the 18th century (200 years before the interest arose around them) a thousand miles away! What’s more pseudoscientific? They have no evidence for forgery, yet they shout FAKE, FAKE, FAKE, it MUST BE A FAKE! Of course it must be fake -as it is inconvenient for them it must be fake.\n\n","date":"December 1, 2014 at 5:41 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174105","author":"O.K.","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Andrea, are your theory of forgery of these documents been published in an English journal? If not we cannot really thoroughly follow your claims. After all, what you are saying is not backed up by clear documents (e.g., as you keep claiming for proving that the Shroud was in Besançon), but is built on a subjective analysis of yours. I would very much like to read your account in a thorough manner, but can’t really do that from the short texts posted on this blog.\n\n","date":"December 1, 2014 at 11:42 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174181","author":"Mario Latendresse","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"No, no English journals. A deep analiysis of the “Othon forgery” will be published soon, in French:\nhttp://www.franche-bourgogne.fr/pages/les-publications.html\nI understand that if people knows only English, most of the literature about the shroud remains unknown to them (and the best things are published in Italian and French). But I am not sure that the language is the very problem….. I have written an entire book in English about the Mandylion and the Shroud, that is the most deep and complete ever written on the subject… and remains ignored among sindonologists.The best they did was to publish on the BSTN a distorted review written by a sindonologist without any competence on the matter ….\n——-\nAs for Besançon.  I do not understand how can you say that what I think “is not backed up by clear documents”. Is the contrary. Is what some say (i.e. the shroud was taken by Othon on 1204, arrived in Besançon, remained there until 1350, was copied ans stolen by Geoffro de Charny or his wife) that is not backed up by clear documents. In reality, is not backed by ANY document. It was invented, the first part on 18th century (by someone that believed that the Besançon shroud was authentic, and the Turin shroud… also!), the second part on 1902.\nI cannot make out, really, how it is so difficult to understand this.\nPaul Vignon, the father of sindonologists, a century ago explained why the “Othon theory” is based on a UNIQUE source, late, incoherent and manipulated. Zaccone, director of the museum of the Shroud in Turin, did the same 30 years ago.\nEven without my book – that will explain HOW the forger invented the history on the beginning of 18th century, and WHO is the forger – it is obvious that the “Othon history” is false.\nBut… as Piana and Scavone still continue to believe in this, people continue to follow them. I am sure that Scavone and Piana never read and studied the “sources” they follow.\nWhat we are talking about? It seems that here all is considered true, all legends, forgeries, inventions, conjectures, fantasies, fires, disappaerances, substitutions (only when they support authenticity, obviously). The critical attitude never arrived?\n\n","date":"December 1, 2014 at 1:53 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174196","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Andrea, thanks for the answer.\nI can fluently read French, so I am looking forward for the French translation announced for Feb-Mar of next year at http://www.franche-bourgogne.fr/pages/les-publications.html. It will also be at a reasonable price. I hope they can ship outside Europe. But from that web page, it is not clear which Italian book is being translated. The French title is « Le Saint Suaire de Besançon et le chevalier Othon de la Roche » but that does not correspond to any of the Italian text listed on that page.\nIn the summary on that web page, there is a mention of the manuscript 826 from « Bibliothèque d’étude et de conservation de Besançon ». I just found it on the web at\nhttp://memoirevive.besancon.fr/ark:/48565/a011324049269Vm9gTM/1/1\nI will read it, although it appears quite time consuming to do so given the cursive handwriting, but feasible.\nYour English book of the Mandylion: the problem is the price. I can’t see why it is priced so high. Stanford University has your Italian version, but not the English one. \nYou wrote « I cannot make out, really, how it is so difficult to understand this.». As you wrote, some documents say that Othon de la Roche sent the Shroud to Besançon, so, we cannot strictly say that no document state that. But your interpretation is that these documents are either forgeries or have made up these stories. So, there is an interpretation of these documents. This is what I mean: there is no historical documents that says that these were forgeries. Right?\nYou wrote, «  It is obvious that the “Othon history” is false. ». If it is obvious, it could be summarized in English on a couple of pages. Is it the case? I am afraid this is not the case as it involves many old documents and in some cases some subtle interpretation and analysis. You can probe me wrong by summarizing the obvious arguments that you have in mind.\nBut I think that this is not obvious, and a carefully written explanation is needed. I would love to summarize in English, if you like.\n\n","date":"December 1, 2014 at 4:28 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174209","author":"Mario Latendresse","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"“I hope they can ship outside Europe”\nIf not, I’ll send it to you.\n“it is not clear which Italian book is being translated”\nThere is not an Italian book. As the manuscript is in French, and the Shroud is French, it seemed to me useless to do an Italian book. So, I have transcripted the manuscript, and I have written an introduction and commentary in Italian (or in “my” French) that was translated in French or corrected to make the book.\n“I will read it, although it appears quite time consuming to do so”\nYou can do it, but maybe is better if you wait for my transcripion, that is complete and easy to read. Only a very little part contains what concerns Othon and the Shroud. All the rest is…. very boring.\n“Your English book of the Mandylion: the problem is the price. I can’t see why it is priced so high”. \nBecause is published by Brill. And Brill is expensive, I know. But they asked me to translate my book, and I said yes. I am not happy of the high price. \n“As you wrote, some documents say that Othon de la Roche sent the Shroud to Besançon”\nNot SOME documents, but ONE document: this manuscript 826, of the 18th century.\nYou are right, is not so easy to explain all, and here, and in English. But the question, as I said, was just explained many years ago: the author of this treatise, in 18th century, said for the first time that Othon had a shroud (500 years later the 1204), when until that moment ALL historians in Besançon said that the Shroud arrived in Besançon some centuries before and by another way (all ignorant?). He quoted some sources, declaring that these sources attribute to Othon the translation of the Shroud. But it is not true, they did not. He manipulated them in a evident and also shameful. He is very ignorant, and for example says that a certain historian was at Constantinople on 1204, when the historian was born AFTER 1204. And so on.\nFor that, Vignon and Zaccone (they are not “Skeptics”) understood that the manuscript 826 was written by someone who INVENTED the link between Othon and the Shroud, to defend his shroud (a normal painting).\nNow I have identified the author and the sources he manuipulated and falsificated, but, I repeat, it was enough what Vignon and Zaccone wrote to have a correct idea about the problem.\nMy questions remain not answered:\n1) documents before 16th century saying that in Besançon there was a shroud with an image of Christ; THEY DO NOT EXIST\n2) documents before 16th century saying that in Besançon there was a shroud; THEY DO NOT EXIST\n3) documents before 18th century (i.e. before the forgery of the 826 manuscript of Besançon) saying that Othon de la Roche had a shroud. THEY DO NOT EXIST\nI add: documents between 1204 and 18th century describing the liturgy in Besançon, the relics in Besançon, the decisions of the chapter in Besançon: YES, THERE ARE MANY, but without any shroud. Because the shroud in Besançon was painted on 1520 circa.\nThis is not question of subtle interpretation and analysis, is only normal exegesis of the sources.\n\n","date":"December 1, 2014 at 5:39 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174216","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Andrea, thanks for the offer to ship your book to me if I have trouble getting from Europe. Actually, I will be in Turin next spring and could possibly pick it up right in Turin!\nOf course, the Ms 826 has been mentioned by many before. Riedmatten, for example, is also critical of the information contained in it.\nI have went through the first 50 pages of the first dissertation. I think I will reproduce the pages 39-41 and write a transcript of it on my website. They contain what I have seen so far to be the most relevant part for the Shroud. \nFor questions 1-3 that you asked, I cannot answer them.\nThe possibility that Othon de la Roche was in possession of the Shroud of Turin is a working hypothesis. I take that as it is: an hypothesis.\nWe are still in a stage of gathering all documents and made these clear for everybody. I think this is still lacking.\n\n","date":"December 2, 2014 at 12:10 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174318","author":"Mario Latendresse","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Mario, when you will come in Turin let me know. My house is 30 seconds walking from the chapel of the Shroud\n\n","date":"December 2, 2014 at 7:06 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174350","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Andrea, that close to the Shroud! I will be staying close by too. Let’s meet in April (19-24) in Turin to talk about the Shroud, old manuscripts, the history of the Shroud and Turin.\n\n","date":"December 4, 2014 at 1:12 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174571","author":"Mario Latendresse","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"When we are discussing all these ‘shrouds’ it is is important to realise just how many there were once were . Karl Young, the great authority on the Quem Queritis ceremonies, claimed that there were no less than 400 documented examples but the grave cloths actually shown to the congregation on Easter morning varied from church to church. Young noted that, while in the descriptions of the grave clothes the sudarium (‘facecloth’) and the linteamina (the wrappings of the body) are usually shown separately, ‘the dramatic ceremonies at the sepulchre followed the Gospel traditions with considerable freedom, using sometimes a single cloth called sindo or linteum, sometimes a cloth called sudarium, sometimes several pieces called linteamina, and again both a sudarium and linteamina.’ (Karl Young, the Drama of the Medieval Church, Oxford , 1933, pp.134-5.)\nSome of them had images. So when I read of all these controversies about which ‘Shroud’ is which my first response is that we are probably talking of independently produced grave cloths of all shapes and sizes. As I said in an earlier posting, because painted linens had the image only on the outer fibrils of the cloth (thanks STURP), they were very vulnerable to disintegration which is why we have so few painted linens left today.it was the folding and unfolding that did for them and the survivors today are mostly ones that were pasted onto a backing board.\nWe must distinguish between linen ( it had to be linen to fit in with the gospel accounts) cloths produced specifically for the Quem Queritis ceremonies and those cloths/wrappings/facecloths  believed to be authentic shrouds. In medieval Europe the top earner was probably the Shroud at Cadouin as this had been brought back from the Holy Land and assumed to be the real thing- we now know that it was produced in the workshop of the caliphate.\n\n","date":"December 2, 2014 at 5:54 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174285","author":"Charles Freeman","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"So is there any other contemporary evidence that Otho possessed the Shroud?\nContemporary -no, except maybe for this chest from Ray-sur-Saône castle , which has not been dated yet. Yet we should be happy with what we have -those are maybe the last crumbs of the true story, that somehow managed to survive in some controversial documents.\nThis situation is not the only one. Actually, except for a few inscriptions, we have no contemporary accounts for Alexander the Great conquests (and many other ancient historical events) -the surviving relations were written 300-500 years later.\n\n","date":"December 1, 2014 at 5:46 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174106","author":"O.K.","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"O.K. I’ll give you a better and more important example than Alexander: Buddha.\n\n","date":"December 1, 2014 at 4:34 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174210","author":"Louis","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"David Mo:\nYou could read Nicolotti’s article about the false Ordine Costantiniano Angelico Di Santa Sofia here: http://www.giornaledistoria.net/index.php?Mestiere=557D0301220202755772070305732771 (In Academia.edu also)\nI have read this long ago, and in fact there are no convining arguments that the letter of Theodore Angelus is a fake one. Actually it is mentioned there only in one or two sentences. In his paper, Andrea claims that because there are some historical and genealogical errors in some documents in the Chartularium, so the entire set of documents must be thrown away as forgery. This allows him to throw inconvenient documents about the Shroud and Santa Casa in Loreto as well.\n\n","date":"December 1, 2014 at 6:06 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174110","author":"O.K.","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"“Actually it is mentioned there only in one or two sentences.”\nThis is not true. Two paragraphs are specifically devoted to Teodoro’s 1205 letter in  Nicolotti’s article. Seven reasons for inauthenticity are summarised. Nicolotti  refers us to his book about the Templars. His reasons are widely explained there and some additional arguments by the two experts I mentioned above are added. This is not “one or two sentences”.\nPerhaps your Italian is too bad or you have not a good memory.\n\n","date":"December 2, 2014 at 3:20 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174270","author":"David Mo","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Even without my book – that will explain HOW the forger invented the history on the beginning of 18th century, and WHO is the forger – it is obvious that the “Othon history” is false.\nSo who is this forger?\n\n","date":"December 1, 2014 at 2:02 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174199","author":"O.K.","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Andrea\nNow I have identified the author and the sources he manuipulated and falsificated\nSo did he bring this coffer in the Ray-sur-Saône castle? You cannot disregard it!\nSorry, but your reasoning is not conclusive. More when I return home.\n\n","date":"December 2, 2014 at 5:43 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174284","author":"O.K.","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Besançon Shroud, painting on linen (50 x 30cm) pasted onto a backing board (photo Alessandro Piana) at:\nhttps://encrypted-tbn2.gstatic.com/images?q=tbn:ANd9GcT3f3D0mMyFHYarCIsI2A_GyxGLOCuObzsBrRbQ-02ojuVMzdFP\n\n","date":"December 2, 2014 at 9:11 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174303","author":"Max patrick Hamon","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"and http://www.sindone.info/PIANA.PDF\n\n","date":"December 2, 2014 at 9:13 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174304","author":"Max patrick Hamon","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"The Besançon shroud copies appear to have the following characteristics:\n1) Both hands and wrists are completely visible with both wounds in the palms of the hands.\n2) The feet are separated.\n3) The wounds in the hands are clear circles.\nNaturally, the simple explanation is that the copy kept at the cathedral of Besançon had these characteristics.\n\n","date":"December 2, 2014 at 12:00 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174317","author":"Mario Latendresse","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Andrea:\nThis is not question of subtle interpretation and analysis, is only normal exegesis of the sources.\nThis is what you don’t understand, there are more subtleties here, and “normal analysis” fails.\nBut first of all I must explain something. I don’t buy the whole Scavone’s story about fire, stealing the Shroud from Besancon cathedral, re-appereance in Lirey, Jeanne de Vergy commisioning painter to make a copy, replacing one Shroud for another, etc. It makes no sense to me for various reasons. I am not even specially interested whethere there was some Shroud in Besancon before 1523. The only thing that interests me is whethere Othon de la Roche possesed for some time the Shroud sacked from Constantinople in 1204. \nNot SOME documents, but ONE document: this manuscript 826, of the 18th century.\n[…] But the question, as I said, was just explained many years ago: the author of this treatise, in 18th century, said for the first time that Othon had a shroud (500 years later the 1204), when until that moment ALL historians in Besançon said that the Shroud arrived in Besançon some centuries before and by another way (all ignorant?). He quoted some sources, declaring that these sources attribute to Othon the translation of the Shroud. But it is not true, they did not. He manipulated them in a evident and also shameful. He is very ignorant, and for example says that a certain historian was at Constantinople on 1204, when the historian was born AFTER 1204. And so on.\nFor that, Vignon and Zaccone (they are not “Skeptics”) understood that the manuscript 826 was written by someone who INVENTED the link between Othon and the Shroud, to defend his shroud (a normal painting).\nNow I have identified the author and the sources he manuipulated and falsificated, but, I repeat, it was enough what Vignon and Zaccone wrote to have a correct idea about the problem. \nYou don’t get it. You missed basic thing, even if you identify author (by name), even if you identify sources he used (the question arises here: have you identified ALL sources he used?), it is still not enough. \nThe author of MS826 confused historical facts, perhaps even manipulated sources -I can agree with that. But it is irrelevant as it DOESN’T PROVE that he INVENTED the whole story about Othon. He perhaps luckily found good track, yet he was unable to present it in a convincing way, so he made mistakes or perhaps even tampered with the sources. Nevertheless this doesn’t mean that the information about Othon is INVALID. True informations may be present even in the most unreliable documents: forgeries, legends, apocrypha, romances, poems -yet one must be skillful enough to extract them. \nLet me put it this way: The Theodore Angelus letter, the MS 826, the tradition of Ray-sur-Saône castle are very weak sources each on its own. Yet together -although seemingly independent from each other -they provide complementary informations, they back each other and make coherent whole. So either they reflect the true story that Othon once possesed some Shroud looted from Constantinople, or are parts of some really BIG conspiracy for some obscure and meaningless purpose in 18th -19th century.\n\n","date":"December 2, 2014 at 1:59 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174327","author":"O.K.","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"This thread of comment leads me to a conclusion I reached awhile ago: That much of the debate about the Shroud is analogous to the blind men attempting to define an elephant. Is it a snake, a tree, or a wall?\nMy approach, which may seem limited, is to concentrate on two appetites of the Shroud: the body image and the blood. To paraphrase Rabbi Hillel, everything else is commentary.\nThere seems to be a repetitive error that OK addresses: when criticizing the proportions of the Shroud image as being distorted or apart from presumed norm they elide a fundamental aspect of the image. Using a film analogy, the film was not flat and the image was projected askew. \nCan any one imagine taking a picture with film that is not flat but rumpled and curled? I think OK demonstrated that there had to be distortion. I once posted a picture of my dog, Bogart AKA Bogie taken digitally. There was an immense distortion with his head appearing larger than his body. That doesn’t prove anything except that if the image was created on the Shroud by whatever process and the Shroud was not perfectly taut or the image created at an angle then the image would be distorted. \nAny photographic expert care to argue with that?\nSecond, a painted copy by an artist is a painted copy by an artist. What one may ask: what was he copying? It appears reasonable that copies of copies of an original object would degrade from the reality of the object. Even photographs when copied degrade with anomalies. That’s one reason why the arguments about what the Shroud shows degrade with the generation of the copy.\nIn the end we are left with an existing physical object in Turin Italy that is traceable to circa 1350.\nThe art historians among us continue to ignore a scientific fact that is actually proven beyond “reasonable doubt.” The Shroud image is not painting. They also ignore another scientific fact: the blood on the Shroud is ancient blood. The D’Arcis memorandum is a hoax and there is evidence that it was elaborated on by Chevalier and Thurston. Thurston adopted Chevalier’s arguments so he is not intellectually culpable.\nSo these are facts about the Shroud that I submit have been proven: the Shroud is not a painting and the blood is real.\nA final note: one of the egregious errors is the manner in which Shroud skeptics label any scientist whose work they disagree with as a person blinded by religious belief. Alan Adler, who did his work after 1978, was Jewish so was Barrie Schwortz and other members of the Shroud team who were in Turin. According to Schwortz, before the 120 hours of Turin examination in 1978, most of the participants were skeptics of authenticity and expected to find that the image was painted and they could go home. They were surprised. It’s been 36 years, many have passed away. Most that still survive have yet to go home.\n\n","date":"December 4, 2014 at 8:16 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174608","author":"John Klotz","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"“In the end we are left with an existing physical object in Turin Italy that is traceable to circa 1350.”\nI agree with this sentence. Thumbs up.\n\n","date":"December 4, 2014 at 9:07 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174615","author":"PHPL","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"PHPL:\nI don’t know if you would thumbs-up the following but that’s OK (no pun intended).\nI think the evidence of what preceded the Lirey exposition is circumstantial. Unlike those who dismiss the Pray Codex as “over-hyped, ” I think it is circumstantial evidence that is nearly, if not actually, decisive of the Shroud’s existence prior to Lirey.  The evidence I find decisive  is the representation of of burn holes as black rings. Others find other similarities.\nThe Shroud, alone, in contrast to the copies of the Shroud, has actual burn holes with charred edges in the “knights move” configuration. Many of the later copies of the Shroud represent them but they are not actual burn holes but paintings (or drawings) of the burn holes – sometimes as red circles. See the Lier Shroud. That the monk who drew the Pray Codex had  artistically challenged ability can not be disputed.  As to those who think the burn holes are overly hyped, show me a representation of the Shroud that has real, instead of painted burn holes.\nThe burn holes are the Shroud’s fingerprints. Painted or drawn representations of the burn holes are copies of the Shroud or copies of copies.\n\\\n\n","date":"December 4, 2014 at 11:56 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174632","author":"John Klotz","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"‘So these are facts about the Shroud that I submit have been proven: the Shroud is not a painting and the blood is real.’\nThe Shroud is not a painting. I agree but it WAS a painting until the pigments fell off under repeated folding. The Zittau Veil is a good comparison because large parts of the original painted surface survives and one can see the ares where the pigments have fallen off leaving images ( of Mary and Elizabeth at the Visitation in one example) that have the same ghostlike quality of the Shroud images. A good match but further research need to confirm that they have the same qualities.\nThe presence of blood is hotly disputed. Mike Spyer, professor emeritius of physiology at London University, read through all the STURP reports on blood that I was able to send him and he said he was totally unconvinced. I cannot remember whether it was him or another expert I consulted who noted specifically the absence of potassium and suggested that it was probably the protein from the glue made from animal products that had been misinterpreted as blood.. No one other than Adler or Heller has ever found that blood dries as red as that on the Shroud.\nWe also have the failure of the Forensic Department in Modena in 1976 to find any sign of blood in their samples .\nThen you have the problem that there is evidence  that blood type AB only appears in the second half of the first millennium (or rather that there is lack of evidence that it occurs earlier) but I suppose that the Son of God does not have to conform to such constraints.\nSo shall we just say that the presence of blood is not proven.I shall leave it at that as I am not as expert as those I have consulted on the matter.They certainly don’t think STURP found human blood.\n\n","date":"December 4, 2014 at 11:38 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174630","author":"Charles Freeman","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Type AB glue?\n\n","date":"December 4, 2014 at 11:50 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174631","author":"Paulette","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"No Charles, we shall say it has been proved and you are not a forensic pathologists or blood expert. Adler and Heller were both qualified scientists. You are not such and neither am I. But i will accept their  analysis of what the blood stains on the shroud are because they actually examined portions of the Shroud scientifically.\nYou can NOT carry your case by simply dismissing evidence from expert scientists that refutes your latest theory. And that goes for painting to. Show us an existing medieval piece of linen with an image that has the characteristics of the Shroud.\nNot a hypothetical  but an existing surviving linen image.\nYou haven’t done it and you can’t. So spare us your opinion as art expert about a scientific issue. It’s a question of deep science, deep into, believe it or not, analysis based upon the quantum properties of both the image and the blood.\nAnd by the way, perhaps you can do this. Show us ANY surviving medieval painting where the artist used blood as a medium.  Maybe some did. You are the art expert. Name them?  Did their work survive?\n\n","date":"December 4, 2014 at 12:14 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174634","author":"John Klotz","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"The linen Zittau Veil (1472) is perfect as it has painted panels and faded panels on the same cloth. It also has evidence of the images on the outer fibrils only- the conservationists note that no pigments except for some red madder penetrate into the cloth. They found signs of the protein that made up the size that sealed the outer fibrils so that the paint could be added.They also note that it was made up of sections of a width between 108 cms and 116 cms  that,they say, reflect the loom it was made on. So it fits very well with what we know of the Shroud. – in fact, it is brilliant evidence for anyone who asks the question of why the images on the Shroud are as they are. In my lectures I use theEnglish Visitation panel to make the point and everyone can see similar faded images.\nThey conservationists go on to show how the artist used black and white shading  to create a three-dimensional impression.\nAs you can see faded and painted  images  side by side you can see how the Shroud deteriorated. Note my comment on the pigtail above.\nThe article that describes all this is in Caroline Villers’. edited series of essays on medieval textile painting, the Fabric of Images, Archetype Books,London ,2000. I keep trying to get Colin to read this book but. obviously without success.\nIf Heller and Adler were all that they are cracked up to be they would have been able to write a survey of the blood evidence that would have convinced a professor off physiology . They clearly were not able to do so and the idea that the redness of  the ‘blood’ reflects the stresses of a tortured man has never been found by anyone else.\nBut your mind is made up so however much evidence I give you will never be enough. I am better off working with people with open minds who can assess the evidence for themselves.\n\n","date":"December 5, 2014 at 7:58 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174749","author":"Charles Freeman","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"P.S and articles by Kelly Kearse were included among those I had read through by professor Mike Spyer  who is happy to be quoted as ‘totally unconvinced’..\n\n","date":"December 5, 2014 at 8:00 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174751","author":"Charles Freeman","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"It is a distressing to read such a comment knowing the large amount of material given by Kelly Kearse to patiently explain the blood issue…\nCharles, give us a break, do your homework.\n\n","date":"December 4, 2014 at 12:21 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174636","author":"anoxie","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Charles, you wrote:\n“I cannot remember whether it was him or another expert I consulted who noted specifically the absence of potassium ”\nThis assertion is only based on the X-Ray fluorescence Morris and al. study.\nYou should have quoted their conclusion: ”  “Although no potassium was observed in any of the Shroud data, poor signal-to-noise ratios may preclude definite conclusions on this point”.\nAnd read:\nhttps://shroudofturin.files.wordpress.com/2013/12/bbk-7.pdf\nin which you can read that potassium HAS  been found by Bollone, Adler and Heller and that the amount of potassium is that expected for actual blood.\nThe same is true when you write: ” We also have the failure of the Forensic Department in Modena in 1976 to find any sign of blood in their samples .”\nPlease, quote their conclusion:” “the negative answer to the investigations conducted does not permit an absolute judgment of the hematic nature of the material under\nexamination.”\nAnd read Kelly’s beautiful presentation at the Saint-Louis conference:\nhttp://www.shroud.com/pdfs/stlkearsepaper.pdf\nThis is THE critical (re)evaluation of the TS blood data by an expert who has ALL of the data regarding blood.\nThis presentation (including the Powerpoint) is so clear that anybody can understand it.\nYou wrote: “So shall we just say that the presence of blood is not proven.I shall leave it at that as I am not as expert as those I have consulted on the matter.They certainly don’t think STURP found human blood.”\nIf you want to consult some experts on this matter, please give them ALL of the data.\n\n","date":"December 4, 2014 at 2:55 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174650","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Thibault. It is quite clear that it is not proven that there is blood. This backs up my claim that the existence of human blood on the Shroud is not a fact. It is a belief  held by some people that has not yet  been presented in a form that convinces experts in these fields.\nI am happy with ‘not proven; as Caroline Walker Bynum’s book Wonderful Blood shows just how many blood cults involving Christ’s blood were about in the thirteenth and fourteenth centuries. Some were the dried blood of Christ, they were beaten to it by a German monastery which had some liquid blood of Christ. Then there were the consecrated hosts that bled, as in the case of miracle at Bolsena where the blood was still to be seen on the church floor. Then there were stolen hosts which bled – all this was accepted as the true blood of Christ, of course as a result of transubstantiation. Then there were the figures of Christ on the Cross that bled when some infidel struck them.\nSome of this blood was probably human and why not add it to the Shroud, although I trust my expert opinion as he could not find anything that hinted of human blood and felt that that Modena tests should be treated as pretty conclusive if they had not had a single one of the standard tests showing blood.\n\n","date":"December 5, 2014 at 9:09 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174755","author":"Charles Freeman","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Charles, \nSorry, but I’m afraid that a fruitful discussion regarding the blood is very difficult.\nFor example you wrote:\n““I cannot remember whether it was him or another expert I consulted who noted specifically the absence of potassium ”\nI have shown you that there IS potassium in TS blood.\nNo answer.\nYou also wrote: “although I trust my expert opinion as he could not find anything that hinted of human blood and felt that that Modena tests should be treated as pretty conclusive if they had not had a single one of the standard tests showing blood…”\nIf it is true, this suggests that your “expert” does not know the limitations of those test particularly for centuries-old blood.\nSee my paper:\nhttp://www.shroud.com/pdfs/thibault%20final%2001.pdf\nparticularly p.24-25 with the references.\nAnd even with these limitations, Bollone  obtained Teichmann crystals or hematine\nchlorohydrate with the usual procedures.\nYour answer:”   It is quite clear that it is not proven that there is blood.”\nThat’s all ??\nPlease ask your expert to write a precise scientific rebuttal based on all of the current available data regarding the blood on the Shroud, particularly if, as you wrote:\n“articles by Kelly Kearse were included among those I had read through by professor Mike Spyer who is happy to be quoted as ‘totally unconvinced’..\nParticularly if Prof. Mike Spyer is this expert:\nhttps://iris.ucl.ac.uk/iris/browse/profile?upi=KMSPY35\nHe is truly an expert in physiology of the nervous system and cardiopulmonary systems, but probably not in the problems of very old blood or immunology. \nThen you wrote some sentences about the “blood cults involving Christ’s blood” and “Some of this blood was probably human and why not add it to the Shroud ..”\nDo you have any kind of proof that human blood has been used in those “blood cults”?\nDoes it exist any kind of painting in which human blood has been used to paint blood?\n\n","date":"December 5, 2014 at 4:18 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174789","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"“Although no potassium was observed in any of the Shroud data, poor signal-to-noise ratios may preclude definite conclusions on this point”.”\nWhy? It’s hardly surprising that if something is at tiny concentrations, virtually indistinguishable from  background levels, then there will be a poor signal-to-noise ratio. That should not prevent one from concluding that there is little or nor potassium in the bloodstain if potassium levels are scarcely greater than background levels in unstained linen, and thus hard to distinguish from background with certainty.\nA poor signal-to-noise ratio might prevent one from determining if its level is 1% greater than background, as distinct from 2%, but that’s largely irrelevant if the expected ballpark concentrations of potassium are not detected.\nThere’s a serious problem in identifying a red stain as real whole blood, ancient or otherwise, if there’s no strong signal for potassium (or sodium) relative to background. That anomalous porphyrin spectrum didn’t help either. The bilirubin fudge should never have passed peer review (did it?)\n\n","date":"December 5, 2014 at 5:48 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174795","author":"Colin Berry","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"I stick to non proven. It is quite clear that there  are experts out there who are not convinced by the evidence as it at present presented. In fact they regard it as totally inadequate. I hardly need to get a top professor to write out a long report on this when he has considered a wide range of evidence from STURP and does not feel that  it even starts to show human blood – rather some evidence of animal protein. However, as some evidence of protein was also found on the Zittau Veil that is considered to be related to the animal products used in the gesso or tempera then this is what one would expect.\nThe real problem with the Shroudies evidence is it he total failure to convince anyone outside their own narrow circles. It is your responsibility if you wish to promulgate the view that the Shroud is authentic to get some evidence that the academic world finds acceptable. If not you risk confusing people who are ,for obvious reasons, interested in the origins of the Shroud, but deserve to have a balanced approach to the evidence that we have until further testing is allowed by the Vatican.\n\n","date":"December 6, 2014 at 5:43 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174891","author":"Charles Freeman","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Colin: this is an interesting precision. The problem with sindonist science is the vagueness and uniqueness that surround some  crucial experiences and assessments. How many, where exactly and who again…? often are non-answered questions.\nI quote myself: \n“Neither Frache/Modena (negative), nor McCrone (negative), nor Adler&Heller (positive), nor Baima Bollone (positive) were scientific archaeologists. No one of them used specific tests for ancient blood that had been warranted by scientific archaeology.” \n“Is there an archeological study (independent) that had used the Adler&Heller’s methods for detecting ancient blood? Answer: No. A study made by non-experts and not replicated by true experts can be conclusive? Answer. No.”\n\n","date":"December 6, 2014 at 3:44 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174878","author":"David Mo","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Yes, DavidM. I see science as essentially about model building via hypothesis testing. It’s vital therefore to ask the right questions, to set up hypotheses that properly discriminate between opposing viewpoints. That’s where the STURP investigation re the blood fell somewhat short of expectations from so ‘high-powered’ a team (and not just because Adler and Heller were for some reason unable or unwilling to accompany the rest of the team to Turin, being content to work with sticky-tape samples supplied to them by Ray Rogers).\nIt was not enough to ask: “Do these stains contain the known markers for blood, modern or ancient?” If the possibility was considered that the TS was a forgery, the hypothesis should have been “Are these stains real blood, or what remains after centuries, or might they be simulated blood that may have contained real blood, or a fraction thereof, that has had one or more additives or treatments to keep it looking more blood-like?”.\nIt’s the near impossibility of answering the second of those with 100% confidence that places a question mark over whether any testing on TS blood can ever be truly and/or fully scientific. That may sound defeatist, but it’s not. The imperative is to think like a medieval forger, to ask what he might have employed as a blood substitute, and then go looking for markers, not just for blood, but for the suspected additives. Oh, and there’s still scope for conventional analysis of TS “blood” if any samples still exist, namely to isolate the porphyrins by chromatography and characterize them on mass spectrometry. Typical protoporphyrin IX, or chemically modified? Why didn’t Ray Rogers involve himself in the blood work, given he supplied the samples AND had the relevant mass spec’ know-how?\n\n","date":"December 6, 2014 at 4:10 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174882","author":"Colin Berry","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"“APPETITES =  aspects\n\n","date":"December 4, 2014 at 8:17 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174609","author":"John Klotz","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Aljone, I have to do a little correction: it is not true that STURP team did not want C14 testing. They asked it. Look at this communicate of the STURP (october 8, 1981):\nhttps://www.shroud.com/78conclu.htm\nAll shroudie websites with this text have suppressed from it a sentence:\n“No carbon 14 measurements have been done. Unless and until permission is given to use part of one thread of the Shroud, such an essay must wait”.\nThey tried to do it. Now, they prefere forget it, and cancel the sentence.\nAndrea, so do you claim that the original summary of STURP conclusions contained this sentence, and it was deleted on Barrie’s site?\n\n","date":"December 5, 2014 at 4:32 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174728","author":"O.K.","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Charles,\ncan you give us a link to an image of this linen Zittau Veil (1472).\nThanks.\n\n","date":"December 5, 2014 at 4:30 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174790","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Thibault:\n\nhttp://www.luther2017.de/en/25923/now-hunger-cloth-torn-lent-tradition-survives-reformation\nObviously nothing in common with the Shroud…\n\n","date":"December 5, 2014 at 4:37 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174791","author":"O.K.","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Yes I struggle to see any similarity whatsoever.\nNon event and unworthy of any time or effort to discuss.\nMove along please\n\n","date":"December 5, 2014 at 7:38 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174802","author":"Thomas","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"What you have here is a painted linen cloth dated to 1472. The paint remained fairly extant until the Second World war when the veil was looted and used by some Russian soldiers as a steam bath which led to the pigments on large areas of the centre coming off. It was restored so far as it could be in the 1990s.\nSo what you have still existing,e.g. In the top left hand corner, .is an original painted linen and what you have in the centre is what happens to these paintings when the pigments come off. It leaves a shadowy image with large parts of the original missing completely. in the Shroud we just have the shadowy images of what was once a a painted linen.\nThe Veil is similar to the Shroud in many ways. It is made up of sections of 108to 116 cms wide- as the conservators say this is what one expects from a medieval loom. ( No need to get into Assyrian cubits.) The paint does not penetrate the fibres and they show from the remains of animal proteins that there was a size or sealing Gesso applied to the outside fibrils only as it also was for the Shroud ( thanks STURP). The only paint that got through the gesso was red madder – not sure why this got through while other pigments did not but presumably the liquid was more fluid and less made up of pigments than the rest of the paint.\nAnd it is also noted how the artist used shadings to give the impression of three dimensions.\nSo what we have it evidence of how a linen was painted and how it looked ( the Visitation panel is the one I use in lectures) when the pigments come off leaving a, dare I say it, Shroud like image behind.\nSo a quick glance and immediate rejection of the relevance of the Zittau Veil is a totally inadequate response. Please raise your game.\n\n","date":"December 6, 2014 at 5:56 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174895","author":"Charles Freeman","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Hi Charles, interesting about the section widths of Veil and Shroud corresponding to medieval loom.\nAt a quick glance you might be taken in by the sepia tints to think its similar to the shroud, but one immediate difference is the shroud is negative (normally light tones are shown dark, and vice versa). The veil just looks like typical first layer of “blocking in” areas in thinned tones (normally umber but I’ll take your word for it red madder) as the first stage \nThere’s an unfinished Leonardo, the Adoration of the Magi, that shows some of this blocking in but at a more developed stage. If you look at the less developed figures you see this tonal blocking. Normally the blocking in is done in relatively flat tones within a well define outline, with very little modelling and thats what I seem to see on the Veil Is there a close up of the Veil anywhere to see if you can see the gesso itself as distinct from the linen? From the close ups I’ve seen of the shroud there doesn’t appear to be any such gesso on the fabric, the image making darkening is directly onto the outer facing surface of the fibrils themselves. \nThe other aspect that is different is that the veil image is linear – i.e. there is a distinct outline  whereas the shroud shows no such outline whatsoever http://www.sachsen-tourismus.de/en/service/points-of-interest/poi/poi/kulturhistorisches-museum-franziskanerkloster-small-zittau-lenten-veil-zittau/\nIn fact this one aspect of the shroud makes it distinctly different from all medieval painting that I know of and I’m surprised more hasn’t been made of this point in the shroud literature.\nMost painting techniques until the modern age, starts with the line, defining an outline, which is then filled in, first with thin layers and increasing fatter layers of paint. The shroud image shows very little evidence of a linear boundary between forms e.g. between the body and the background, or even the fingers where they should be most evident. Instead the shroud has a blurred boundary between forms indicating that it is not created by a conventional medieval painting technique.","date":"December 6, 2014 at 8:02 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174909","author":"ArtScience","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"ArtScience. The first indication about the Shroud having been gessoed is that the image is just on the outer fibrils, as is the image on the Zittau veil. This is because they first sealed the cloth with gesso so that the pigments would not seep through, although it is clear from the Zittau Veil that red madder did penetrate in small quantities. So an image on the outer fibrils only is an indication of gesso having  been applied – if there had not been a gesso barrier the image would have gone through into the cloth.\nThe next indication of gesso was the ‘large’ quantities of calcium carbonate found by STURP that appear to have covered the whole surface of the Shroud. Calcium carbonate or sulphate was used in the gesso and is still used today if you look up modern gesso products.\nAnother  indication of gesso is animal proteins as the calcium was usually mixed with a glue – often of rabbit skin boiled up – again you can find instructions even today of how to make your own ( first skin your rabbit!). While Mike Spyer who advised me on this could find no evidence at all of human blood in the accounts, he did suggest that the STURP findings were compatible with animal proteins.\nSo I am working on the assumption that, together with the evidence from the Zittau Veil, we have good evidence that the Shroud originally had a gessoed surface. I completely agree that we need to move on from there to look at the specific way that the images were then created and  see how far these are different from what might have been expected. Unfortunately the full report on the Zittau Veil is in German and I only have the summary . It is interesting that the width of the sections that make up the  Shroud, that the article says is related to the width of a medieval loom, is very similar to the width of the Shroud.\nSo as I have said many times before ,there is still a lot to research of the Shroud but as there is no scientific evidence of a first century date and the preservation of a linen from that period, other than in the very specific conditions of closed Egyptian tombs, is unknown, for me everything comes together to show a medieval context within which we must find the meaning of the Shroud.\nI think that is a perfectly reasonable stance to take and there is a lot of evidence that I provide in my article that offers further support to this.\n\n","date":"December 7, 2014 at 4:07 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-175062","author":"Charles Freeman","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"That’s intriguing, Charles. If the positive ‘blood’ tests could derive from other proteins, then presumably they would have given positive ‘blood’ responses from ‘non-blood’ areas. I do not know if any threads which were not visibly ‘blood’-stained were in fact tested to see if they were ‘blood’. (Fair enough – why test something obviously not blood to see if it is blood?) Does anybody?\n\n","date":"December 7, 2014 at 4:24 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-175067","author":"Hugh Farey","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Baima-Bollone used clear threads as controls.\n\n","date":"December 7, 2014 at 4:59 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-175071","author":"O.K.","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Hugh, don’t you have the major paper from Adler and Heller “A chemical investigation of the Shroud of Turin”, published in the peer-reviewed Canadian Society of Forensic Sciences Journal in 1981?\nIf not, I would be glad to send it to you (or anybody else).\nOf course, H and A did not test for blood the fibers coming from non-blood areas.\nBut they tested ALL of the fibers for proteins.\nAfter many researches, they found that most of the usual basic tests for proteins were not specific enough. This is particularly true for the amido black test used by McCrone who even “strongly stained pure cellulose (viscose rayon), and even more strongly stained the heated and scorched Spanish linen controls” (one of the  control they used). \nThey found that the most sensitive and specific test was the fluorescamine test: “The best suited protein reagent tested was fluorescamine. While specific for primary amino groups, it has been reported to detect one ng of protein by the generation of a characteristic green fluorescence under long wave UV. Control tests confirmed that it would do so under our test conditions”.\nI have verified in the scientific literature the quoted sensitivity of this test and its high specificity for the primary amino groups.\nThe conclusion: ” Positive fluorescamine tests were obtained on both the red and golden yellow coated fibrils, on the shards, and on both the orange and brown globs. The fluorescamine tests were definitely negative on ALL fibrils away from blood areas. This includes specifically yellow (body image) fibrils .. Thus, protein is only found associated with ‘blood’ areas and is definitely not present as a ‘pigment binder’ in the body image above the nanogram level”.\nIt is clear that H and A tested fibrils from blood areas, image area and background for primary amino groups which are the basic chemical structure of proteins.\nThere is no protein residue in the background and no protein residue in the image-only areas.\nThis alone is sufficient to rule out the “gesso” hypothesis.\nA “new” paint hypothesis must take into account all the known scientific data.\nMore generally, I see more and more attacks against STURP’ s work by people who obviously did not read their fundamental peer-reviewed papers.\n\n","date":"December 7, 2014 at 3:03 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-175124","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Hugh. I think that there were not what could be called positive human blood results- just results that were interpreted- or misinterpreted according to my sources- as human blood.\nLet’s stick with non proven. Remember that this debate was started with the claim that the human blood was an established FACT but like all scientific claims it has to be supported or replicated  and the STURP claims have not been by any test independent of ST URP. The Modena ones suggested that this was not blood.\nOf course, the tapes can be released for new testing In an independent and respected forensic lab.\nY\nOne of my audience was a judge who has presided over many criminal trials, although now retired, and I met up with him today.. Having seen endless photographs in his long career of criminal cases, he said that having seen the photos of the Shroud blood stains- and I put in some close -up ones- he said that there was absolutely no way that this was dried blood.\nI am sticking to non proven.\n\n","date":"December 7, 2014 at 3:23 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-175128","author":"Charles Freeman","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Charles, Dr. Alan Adler was a serious scientist who published hundreds of articles. He was an expert in poryphrins and did certainly know if he had identified blood or not. He was working together with Dr. John Heller, who taught internal medicine at Yale, from where he had graduated. Serum rings were also identified.\nI don’t know how judges work in England. Normally judges submit images etc to experts, sometimes more than one, in order to make a decision.\n\n","date":"December 7, 2014 at 4:48 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-175134","author":"Louis","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Charles. how many 2000 year old criminal cases had this Judge sat on?\n\n","date":"December 7, 2014 at 5:16 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-175137","author":"John Green","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"So are you saying at two thousand year old blood turns back to red?\nWithout replication of Heller and Adler’s tests I am sticking with ‘ non proven’ . It is clear as can be that what STURP produced has not convinced anyone outside STURP and its supporters and a ‘scientific’ test result that cannot even be presented in a form experts in this field find convincing is not really much of a test result. So however many hundreds of papers these STURP members produced they had clearly not learned how to present their findings in a way that could be assessed by experts in this field.\nReplication of the tests in an independent forensic laboratory is needed.\n\n","date":"December 8, 2014 at 7:15 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-175211","author":"Charles Freeman","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Charles\nWhat I was trying to point out is the Judge most likely has not sat on a criminal case where the evidence was 2000 years old. So he didn’t hear the direct and cross of the experts on each side and also looked at the total evidence from each side.\nThis is like people thinking all they have to do is watch court cases on TV and sudden they are a lawyer. \nNow don’t get me wrong I don’t believe you always need formal education to have a valid opinion, I’ve seen many pro-se’s kick the butts of long time laywers and Judges in court, but without knowing his reasoning and his work in the medical field I don’t consider his opinion valid.\n\n","date":"December 8, 2014 at 8:28 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-175216","author":"John Green","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"I think everyone is agreed that the colour of the ‘blood” is too red for the usual dried blood. I have not yet found anyone who has seen a close-up who does not agree and it was Barrie Schwortz’s  concern as well.\nHeller or Alder came up with the idea that the blood of a human being under stress was likely to dry red. This has never been replicated and so cannot as yet be counted as scientifically valid.\nWe had better sort it out- if true it would revolutionise criminal trials that involve bloodstains.\n\n","date":"December 8, 2014 at 11:16 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-175230","author":"Charles Freeman","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Charles\nI agree that’s one of my problems also(the red blood) and I have a lot other problems, but I see no evidence of it being a painting. In fact the problems with it being a painting have already been pointed out to you.\n\n","date":"December 8, 2014 at 11:37 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-175233","author":"John Green","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Indeed I do have the Heller and Adler paper and should have remembered the fluorescamine tests. Thank you.\n\n","date":"December 7, 2014 at 3:13 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-175126","author":"Hugh Farey","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"I will stick to the best fit hypothesis that this is a typical medieval painted linen, similar to others that exist, where the pigments have fragmented and fallen off. The panels on the Zittau Veil show the same phenomenon.\nI would not hold this view so strongly if a coherent alternative way of creating the image had been put forward. The fact that there are about ten alternatives, none of which has general support, says it all to me.\n\n","date":"December 8, 2014 at 1:29 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-175247","author":"Charles Freeman","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"The STURP 1981 Summary was admirably neutral, if uninformative on the nature of the image. The drip-feed of thinking and research that emerged later from its leading lights was of an entirely different character. Jackson’s collapsing cloth idea presumed authenticity. Rogers’ Pliny-era theorizing re starch and saponins presumed authenticity. Adler’s “trauma bilirubin” to account for unnaturally-red looking blood presumed authenticity. Do I need to continue?\n“We can conclude for now that the Shroud image is that of a real human form of a scourged, crucified man. It is not the product of an artist”.\nThis is not too neutral\nColin, Andrea.\nWhat would you consider ‘neutral’?\n\n","date":"December 6, 2014 at 8:36 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174912","author":"O.K.","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Neutral? Being guided entirely by the facts regarding the artefact and its recorded history, placing into quarantine – at least temporarily –  all previous hand-me-down narratives etc that are more a matter of faith than established fact.\n\n","date":"December 6, 2014 at 9:07 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174919","author":"Colin Berry","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"placing into quarantine – at least temporarily – all previous hand-me-down narratives etc that are more a matter of faith than established fact.\nFor example?\n\n","date":"December 6, 2014 at 9:16 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174922","author":"O.K.","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"I suspect you are trying to divert the discussion from science to theology (or maybe philosophy, metaphysics, cosmology, fill in as appropriate). There’s really no need for me to go there, having I hope made clear that I regard STURP’s brief as one of operating on a strictly scientific basis.  As such, there was a clear obligation on the part of STURP and its scientists (if wishing to be regarded as such) to avoid straying into those other areas, which sadly and spectacularly they failed to do, at least once the 1981 Summary was out of the way.   \nCollapsing cloth anyone? Collimated radiation? “Extraordinary” amounts of bilirubin due to crucifixion trauma? Roman-era linen? \nSpot the insertion/imposition of a non-scientific narrative. Yup, non-scientific.  For all we know, it might be true, but if it ain’t testable, in principle or practice, then it ain’t scientific.\n\n","date":"December 6, 2014 at 10:26 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174937","author":"Colin Berry","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"“Can anybody put me on to the scientific evidence that the Shroud dates to before AD 33?”\nAs far as I know there are two pieces of direct evidence pointing to an early date. The first is Ray Rogers’s finding that fibres from the Shroud lack a vanillin component that some medieval fibres retain, and the second is Giulio Fanti’s explorations into the deterioration of linen fibres with age. Sadly neither of these has sufficient calibratory accuracy to pin the date to the first century (leaving aside Fanti’s rather fortuitous concocting of an average from a number of wildly different dates from vastly different techniques), and neither has any kind of scientfic consensus as a dating method which could be applied to other textiles, which would give them an objective credibility.\nEverything else is circumstantial, and some of it not evidence for a date at all. Pollen and limestone speak of the place, not the time, and the fact that the Shroud image coheres with Gospel narratives tells us nothing of the date at all. Miraculous hypotheses tell us even less, and generally tend to constrain, rather than display, the omnipotence of the Almighty.\nAuthenticists have to rely on documentation and art. I do not deny that this is evidence, and some of it quite powerful, but the smoking gun is still sadly lacking. John Klotz and daveb often remind us that circumstantial evidence with sufficient power can sometimes be enough to sway a jury, but this blog is witness to the fact that it has not swayed enough of us to be considered conclusive yet.\nBUT\n“Can anybody put me on to the scientific evidence that the Shroud dates to after AD 1300?”\nAs far as I know there is a single piece of direct evidence pointing to a medieval date. Radiocarbon dating has massive scientific consensus as a dating technique, and is widely used in all kinds of circumstances. Barring deliberate fraud, there is little reason to suppose that the sample dated to 1300 was inaccurately dated. There have been numerous attempts to demonstrate that the sample tested was not representative, but they have not achieved consensus.\nOther evidence is circumstantial. The lack of clear documentation before 1350, the coherence of the Shroud to the religious rituals and theological trends in art of the 14th/15th century, and the claim that it was known who painted it are all evidence, some more powerful than others, but the smoking gun is still sadly lacking. John Klotz and daveb often remind us that circumstantial evidence with sufficient power can sometimes be enough to sway a jury, but this blog is witness to the fact that it has not swayed enough of us to be considered conclusive yet.\n\n","date":"December 6, 2014 at 9:30 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174925","author":"Hugh Farey","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Nicely summarized, Hugh.\n\n","date":"December 6, 2014 at 10:06 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174933","author":"David Goulet","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"I agree Hugh.\nBut there are several evidence that the shroud is truly a burial sheet.\nThis is the problem.\n\n","date":"December 7, 2014 at 3:12 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-175125","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Some comments:\nColin: “There’s a serious problem in identifying a red stain as real whole blood, ancient or otherwise, if there’s no strong signal for potassium (or sodium) relative to background.”\nI’am not sure that you have the Morris and Al. original paper.\nOn the Shroud they only found Calcium, Iron and Strontium.\nThey found “the excess iron concentration in the foot ‘blood’ region ..above background..”\nIn order to know if this iron concentration is consistent with that of blood, they measured whole blood iron concentrations in a Whatman 42 paper saturated with whole blood.\nThen they wrote: ” In these measurements [measurements made on the Whatman paper]  we also observed potassium in addition to Iron. The K peak intensity was typically at least an order of magnitude smaller than the K-alpha . Although no potassium was observed in any of the shroud data, poor signal to noise ratios may preclude definite conclusions on the point”.\nThey did not find potassium in blood shroud areas but with the SAME laboratory apparatus they used in Turin they found a potassium signal “at least an order of magnitude” smaller than that of Fe on a paper saturated with whole blood. This explains their conclusion.\nThe question of potassium in bloodstains versus background on the shroud has nothing to do with the paper in question.\nDavid:\n““Neither Frache/Modena (negative), nor McCrone (negative), nor Adler&Heller (positive), nor Baima Bollone (positive) were scientific archaeologists. No one of them used specific tests for ancient blood that had been warranted by scientific archaeology.”\n“Is there an archeological study (independent) that had used the Adler&Heller’s methods for detecting ancient blood? Answer: No. A study made by non-experts and not replicated by true experts can be conclusive? Answer. No.”\nYour comment do show that you obviously do not know anything about the problem of “ancient blood”.\nSeven years ago, I have purchased almost all of the scientific papers regarding “ancient blood”.\nSorry, but you simply do not know what you are speaking about.\n\n","date":"December 6, 2014 at 4:53 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-174988","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Mon cher Thibault:\nThis is the conventional answer from  whoever have nothing to say.\nI think you are not qualified to give lessons about Archaeometry and dating of ancient blood.\n\n","date":"December 8, 2014 at 2:37 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-175181","author":"David Mo","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"David Mo, recentely, your ignoration has been shown on several issues. Nevertheless you still pretend to be the smartest on every topic.\n I would like to ask you one thing: stop your insinuations, please.\n\n","date":"December 8, 2014 at 4:06 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-175192","author":"O.K.","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"After some three years on this site, I think I may be getting a little tired of debating with the blind men of India as to what an elephant looks like.  For me, the Shroud of Turin is the burial cloth of Jesus Christ.  I think that is far more important and has much greater implications than arguing about this or that piece of evidence, which is after all for the most part quite trivial.  You may put your faith in your own intelligence and scientific rationality if you will.  I shall put my own faith elsewhere.  I do not expect to be taking out a subrscription for the BSTS newsletter any time soon.  \nTo paraphrase Captain Oates the companion of Robert Falcon Scott on his abortive journey to the South Pole.  “I am going outside for a little while, and may be gone sometime!”\n\n","date":"December 8, 2014 at 4:51 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-175194","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Please do not go gentle into that good night, daveb. Try this instead (it works for me):","date":"December 8, 2014 at 4:59 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-175195","author":"Colin Berry","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Daveb “After some three years on this site, I think I may be getting a little tired of debating with the blind men of India as to what an elephant looks like. For me, the Shroud of Turin is the burial cloth of Jesus Christ.” That surely settles it. Can we also rely on this method for every other scientific finding that displeases you?\n\n","date":"December 8, 2014 at 4:57 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-175267","author":"aljones909","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"ajones909:\nThe problem is that there is no scientific finding that the Shroud is not the burial cloth of Jesus Christ. All there is for the skeptics are the findings of the radio carbon labs that have been thoroughly rebutted. Blindly accepting the findings of the carbon labs is not science but blind, unreasoning faith. You have more in common with the young earthers than y0uo probably understand.\nAtheists can not accept the reality of Jesus Christ and so they can not accept the reality of the Shroud. Too bad!. \nYou might not agree with that, but it is a fact. De Wesselow had very strong reasons to label the carbon dating a fiasco. \nIt’s time to move-on.\n\n","date":"December 8, 2014 at 5:20 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-175269","author":"John Klotz","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"John “You might not agree with that, but it is a fact. De Wesselow had very strong reasons to label the carbon dating a fiasco.” He had a book to sell. Wesselow was/is an agnostic and his theses was that the “resurrection” was some kind of conjuring trick. The 3 labs dated 4 different samples. The “C14 date” for each of the samples was within a few decades of the ‘actual’ date. Hardly a fiasco.\n“flat earther”?. No. If future C14 dating, or any other verified and dependable method, shows a 1st, 5th or 6th century date then that will be accepted by the scientifically honest as the most probable date.  If dating is authorised in the future (unlikely) I expect the authenticists will  be very, very nervous. The shroudosphere will be filled with warnings about the impossibility of carbon testing a resurrection relic.\nYou also said: “The problem is that there is no scientific finding that the Shroud is not the burial cloth of Jesus Christ.”. There is. The C14 testing is solid.  The historical evidence ties in precisely with the C14 testing. There is no evidence that the shroud matches burial wrappings of the jews of the time. Jesus probably had short hair. The image proportions are unrealistic (head and arms). The image was vivid when first displayed.\nThere are only 2 aspects of the shroud I find puzzling: 1) Why is it negative? 2) Does it really depict a nail wound in the wrist? (but we are not certain that crucifiction victims were nailed through the wrist).\nThe image formation may be a mystery that will never be solved –  but there are similar mysteries to which we do not grant supernatural status (Girolamo Segato and his petrification of human remains springs to mind).\n\n","date":"December 8, 2014 at 7:05 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-175282","author":"aljones909","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Why is it that all the skeptics can do to counter arguments is to attack the indiviodual and not the facts. The issue is the carbon dating fiasco and the facts reported on why it is a fiasco. In St. Louis, Pam Moon of GB gave a presentation that indicated just how bad the Oxford sample was. It was based upon an article published on the web site she mainatins. http://www.shroudofturinexhibition.com/Shroud_of_Turin_exhibition/Home_files/Updated_report_on_the_Consideration_to_the_Uniformity_and_Effects_of_the_Fabric_in_the_Shroud_of_Turin-5-1.pdf\nNow, do you want to attack her?\n\n","date":"December 8, 2014 at 9:39 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-175300","author":"John Klotz","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"“Blindly accepting the findings of the carbon labs”. Oh, dear me, we can’t let that go, can we? Calumny, my dear Sir, calumny!\n\n","date":"December 8, 2014 at 7:07 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-175283","author":"Hugh Farey","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"John: “In St. Louis, Pam Moon of GB gave a presentation that indicated just how bad the Oxford sample was”.  And the other samples? Is she qualified in any relevant subject? Or is it yet another theory dreamt up by an amateur with an exceedingly strong religious motivation? Maybe you can summarise her views. Is it the magical and impossible “invisible mend”?  I suggest you read the article by Hugh Farey http://www.shroud.com/pdfs/n78part9.pdf  It deals decisively with the exceedingly improbable “invisible mend” hypotheses. Then follow that up with Mechthild Flury-Lemberg here: http://www.shroud.com/pdfs/n65part5.pdf\n“The theory that repairs had been done to the corner areas in the Middle Ages, unfortunately is based on a false presupposition. The necessity of repairs to the corners has been postulated without ever examining the need for it. The real reason for the theory has been the desire to find a plausible explanation for the unsatisfying result of the carbon-14 analysis. Similar wishes, although understandable, have lead all too often in\nthe history of the shroud to untenable theories.”\n“In any case, neither on the front nor on the back of the whole cloth is the slightest hint of a mending operation, a patch or some kind of reinforcing darning, to be found,”\n\n","date":"December 9, 2014 at 5:40 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-175422","author":"aljones909","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"To aljones909: The funniest thing is that the person who went to great lengths to elaborate the invisible mending theory now says that another C14 test would be unwise as the shroud is simply not, and  never has been, a suitable item to carbon date …\n\n","date":"December 9, 2014 at 9:58 pm","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-175449","author":"PHPL","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Hi daveb; there is no need to subscribe to the BSTS newsletter, especially as it costs more to send it to New Zealand than the subscription! However, do look up the June 2014 edition on Barrie’s site. You will find that there are some theological speculations as well as scientific ones. I particularly recommend Peter Lietch’s article “Why a Shroud?” The newsletter is not now, nor was in the past, a platform for the editor, but attempts to keep all its subscribers up to date with all matters relating to the Shroud.\n\n","date":"December 8, 2014 at 5:46 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-175201","author":"Hugh Farey","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"I understand Daveb’s frustrations. There are few on this site who seem willing to move whatsoever in their entrenched positions despite strong arguments that challenge positions.\nI think in any debate one wishes to see some flexibility, movement and evolution.\nif none occurs then there seems little point in dialogue. Some will say they haven’t shifted in their views because they have not been convinced. I think many times that has not been due to a weakness in an argument but rather the obstinance of certain.personalities.\n\n","date":"December 9, 2014 at 4:05 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-175325","author":"Thomas","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Simply some sceptics are frustrated now, because they have been recently shown wrong and ignorant. So in their rage, they rampage with insinuations,and try to show that everyone else, (STURP in particular) must be wrong, and they are the wisest on this planet.\nI suggest everyone simply ignoring their screams for a moment, until everything calms down.\n\n","date":"December 9, 2014 at 6:37 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-175349","author":"O.K.","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"How right you are, Thomas. A quick browse through Colin’s blog shows how his thinking has changed over the course of his investigations, and I have learnt much from Thibault and Max, among others. Flexibility in the face of evidence is the mark of a good scientist, and we non-authenticists have demonstrated it generously. Our magnanimity has as usual, been rewarded by being called blind (John Kotz) and now frustrated, wrong, ignorant, raging, rampaging with insinuations and screaming. (in July, you will remember, I was an ignorant, irrelevant, uncomprehending, illogical, obsessive, absurd, desperate, poisonous, dishonest, deceitful, envious, fearful, fanatical, sychophantic moron.)\nOn the whole, I have the impression that if anybody reading this blog were to attempt to identify the blind, the ranting, or intrangigent, they would not choose non-authenticists as good examples of the genre.\nBut do not worry, Thomas. It is another mark of a good scientist that he enjoys having his views challenged. Where the challenge seems valid, we’ll admit it and change our views, and where is does not, we’ll explain why. We’re a lovely bunch, us skeptics…\n\n","date":"December 9, 2014 at 10:20 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-175376","author":"Hugh Farey","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Scepticism and rage don’t really go together. A sceptic withholds judgement on the grounds that the evidence is not really good enough or presented in a way that is not convincing and so (s)he does not need to get worked up. So I have used the words ‘ non proven’ recently as that leaves me in the clear if something IS then proven.\nIn contrast, someone who is committed to a point  of view that is then challenged often does get worked up.\n\n","date":"December 9, 2014 at 11:05 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-175379","author":"Charles Freeman","site":"shroudstory"},{"title":"The Makeshift Body Bag of Turin","post":"Months ago Hugh Farey made a list of the insults he had got for his moderate and polite scepticism. The rage is sindonist, in this forum at least.\nIt seems that not believing in what they believe is an insult for some sindonist and to argue against is pure rage. Vaya por Dios.\n\n","date":"December 10, 2014 at 3:00 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","id":"comment-175491","author":"David Mo","site":"shroudstory"}]
