[{"title":"The Making of a Meme:  Pope Francis, Scientist. Not! Or . . .","post":"A quick search in the historical records of the Argentinian newspaper “La Nacion” (in Spanish), pushes back the first mentions of the new Pope’s chemical profile to 1997.\nIn the following links, of 1997 (1), 1998 (2) and 1999 (3), at that time his CV gathered the following :\n(1) se diplomó de químico industrial\n(2) se graduó de técnico químico\n(3) se graduó de técnico químico\nI am not familiar with the University system in Argentina at that time, but I would say, that taken into account that he obtained his degree with 21 years and that he might have started his studies with 18 years, he holds a degree in Chemistry but at an intermediate level.\nIn most countries a full degree in Chemistry tipically takes something like 5 years, but in many cases you get a degree at an intermediate level if you stop half way and pass a set of subjects corresponding to let’s say the first three years. Most probably, this is the case although out of his official biography, it seems quite clear that after this period, he has not had any further contact with Chemistry.\nLinks\n(1) http://www.lanacion.com.ar/70205-bergoglio-sera-el-sucesor-de-quarracino\n(2) http://www.lanacion.com.ar/89230-su-sucesor-con-diferencias-de-estilo\n(3) http://www.lanacion.com.ar/148959-un-arzobispo-antimediatico\n\n","date":"March 16, 2013 at 7:08 am","url":"https://shroudstory.com/2013/03/16/the-making-of-a-meme-pope-francis-scientist-not-or/","cat":"news_&_views","id":"comment-27428","author":"Gabriel","site":"shroudstory"},{"title":"The Making of a Meme:  Pope Francis, Scientist. Not! Or . . .","post":"If Pope Francis really is a graduate chemist, maybe he’ll be able to explain why potassium gives only a weak signal in Shroud bloodstains, while there’s a strong signal for hydroxyproline (a marker for collagen – usually regarded as a major constituent of connective tissue – NOT blood). Maybe he’ll be able to explain the atypical porphyrin spectrum, without needing to invoke highly tendentious hypotheses involving bilirubin.\nMaybe he’ll be able to explain why it’s wrong to describe the linen as “scorched”, despite the sepia-coloured image giving a typical reflectance spectrum for dehydrated carbohydrates with increased conjugated diene content, bleachable by diimide, and devoid of the extra nitrogen needed to sustain the almost certainly mythical Maillard hypothesis. \nMaybe he’ll let this retired (bio)chemist have a flake of two from one of those permanently-red (!) bloodstains, which he’ll then willingly pay to have analysed for specific leech antigens. That’s the medicinal leech (Hirudo medicinalis) you know, a handy source of concentrated semi-digested haemoglobin, clot-free thanks to hirudin (leech anticoagulant) and probably depleted of potassium etc, thanks to the ability of the leech to extrude unwanted blood plasma after feeding, thus making room for more gooey energy-dense haemoglobin when available. Yup, leech digesta really does the business if one is a medieval artisan wishing to apply gooey paint-like blood to a basal image, giving the impression of wounds strategically-situated in all the right places.\nWithout those bloodstains, all one has is a faint image of a naked (presumed) corpse, with no clue as to how he met his end, certainly no specific signs of crucifixion, but with hints – at least from the delightfully ambiguous Lirey badge –  that he may have been slow-roasted, as per Jacques de Molay  and his fellow Knights Templar on the Isle des Juifs, Paris, in 1314 (just 40 or so years prior to the first fully-documented sighting of the TS in Europe, subject of the Lirey badge).\nChemistry beats Shroudie pseudoscientific chemystery any day… Over to you, Pope Francis, MSc? (Chemistry?) Or maybe you have an Argentine (silver medal?)  technician qualification only (never mind – chemical research needs/needed its technicians too).\nColin Berry, also MSc (Biochemistry), sandwiched chronologically between a first degree and a doctorate, also in Biochemistry.\n\n","date":"March 16, 2013 at 8:58 am","url":"https://shroudstory.com/2013/03/16/the-making-of-a-meme-pope-francis-scientist-not-or/","cat":"news_&_views","id":"comment-27433","author":"colinsberry","site":"shroudstory"},{"title":"The Making of a Meme:  Pope Francis, Scientist. Not! Or . . .","post":"Colin Berry probably doesn’t have the the scientific dispassion to recognize this, but his theory’s on scorch does not rebut the authenticity of he Shroud. The issue would be is  the scorch an intentional process to create deception, or the result of a “natural process” that still can’t be duplicated accurately complete with the encoded distance information – as first discerned by Vignon over a century ago.\nAnd then there is this description of an incident when the carbon dating samples were withdrawn:\n“When the four floodlights were switched on, pointing toward the ceiling, the sudden\nincrease of light caused an immediate reaction from the Superintendent of Cultural Heritage of Turin, who asked to reduce lighting power to avoid damage to the Shroud.”\nhttp://www.shroud.com/pdfs/marinelliv.pdf\nIn 1992, Bill Clinton was elected U.S. President with a slogan “It’s the economy, stupid!”\nIt’s only a hypothesis, but just maybe: “it’s the light stupid.” The problem is if the degradation of the linen was caused “light,” we are a very long way from determining the origin of the light and why it would produce such a perfect image. Or are we?\nOf course, the claim is some clever medieval forger-artist-scientific genius did this.\nI hate to sound like a lawyer, but I am one. Let me use an analogy from law. If someone causes an auto accident and there is a great deal of gasoline spilled that accidentally erupts in fire a few minutes later, he is responsible for the fire. However, if a pyromaniac happens by and throws a match causing the fire, the driver who caused the accident is not liable because you can not legally foresee an act of arson.resulting from the accident. \nThe pseudo-skeptics claim the shroud is a fraud because they must intellectually rule out authenticity, whatever the facts are. But forgery is a very complicated, independent process, which has been rebutted and the method of transmitting the image is still not proven.\nGiven what we know, a “natural cause” such as light is much more probable than a forger using unknowable science and anatomical information. \nBy applying Occam’s razor, I reach the conclusion that the simplest explanation for the light scorch is: the Resurrection.\n\n","date":"March 16, 2013 at 11:16 am","url":"https://shroudstory.com/2013/03/16/the-making-of-a-meme-pope-francis-scientist-not-or/","cat":"news_&_views","id":"comment-27437","author":"John Klotz","site":"shroudstory"},{"title":"The Making of a Meme:  Pope Francis, Scientist. Not! Or . . .","post":"If Pope Francis really is a chemist, then he might be able to explain the two main ways in which visible light can interact with linen to produce a colour change. the first, the more familiar of the two, is yellowing that occurs over lengthy time periods, years, decades, centuries. That involves the slow oxidation of the aromatic lignin components to form yellow compounds, and light can and does play a role in that process. \nBut it is also possible to get a photo-bleaching of yellowed lignin using intense short-term exposure to light (bleaching, note, not yellowing). How can that be, one might ask? Surely that contradicts the role of light in yellowing? \nThe answer, as is so often the case in chemistry, is that an entirely different kind of chemistry is operating. In this instance, it is bleaching that is mediated by a special form of molecular oxygen that is produced when light interacts with compounds in the presence of photosensitizers. Regardless  of whether the reaction is self-sensitized, or the result of a foreign compound being present, the result is the production of so-called singlet oxygen  (the subject of this blogger’s very first published paper on the self-sensitized photo-oxidation of bilirubin). Singlet oxygen has the ability to add across C=C double bonds, and given that it is those double bonds, usually in conjugation, i.e.\n– C = C – C = C – that confer yellow colour, the result of converting double bonds back to single bonds, as in vicinal diols etc results invariably in bleaching.\nSo intense flashes of light, far from producing a yellow colour and an image, are likely to do just the opposite, namely to bleach any pre-existing yellow colour. So much for those miraculous flashes of light – and that’s without addressing the physics, that says a lens or collimator or other specialized hardware would  needed to form a recognizable image, in the absence of which one has John Jackson’s alternative hardware-free physics, what I now term ‘fizics’.\nIf Pope Francis really is a chemist, maybe he could find a minute or two to check out what I’ve written for any silly errors.  But I’m fairly confident that the above account, all standard textbook stuff, would stand up in a court of law were I ever to have the misfortune be summoned as an expert witness on what light exposure can or cannot do to linen…  My first words would have to be “Well that depends, yer Honour, on what you mean by light exposure”.\n\n","date":"March 16, 2013 at 11:44 am","url":"https://shroudstory.com/2013/03/16/the-making-of-a-meme-pope-francis-scientist-not-or/","cat":"news_&_views","id":"comment-27440","author":"colinsberry","site":"shroudstory"},{"title":"The Making of a Meme:  Pope Francis, Scientist. Not! Or . . .","post":"CB wrote: “If Pope Francis really is a graduate chemist, maybe he’ll be able to explain why potassium gives only a weak signal in Shroud bloodstains, while there’s a strong signal for hydroxyproline (a marker for collagen – usually regarded as a major constituent of connective tissue – NOT blood). Maybe he’ll be able to explain the atypical porphyrin spectrum, without needing to invoke highly tendentious hypotheses involving bilirubin (etc.)”\nThere is no need to have a PhD or even master’s degree in chemistry to deduce the TS blood degradation is due to natural mordancing of blood remoistened with aqueous alkaline solution.as   natural mordanting could account for:\n– The aged bloodstains still looking fresh today on the long inner burial cloth as if the blood had just been shed the day before as mordant is known to be used for intensifying stains e.g. in cell or tissue preparations\n– Potassium giving only a weak signal in Shroud bloodstains\n– Low temperature alkali gelatinisation of starch residuals present in the ancient linen cloth could be a possible factor as printing paste to be taken into account in the Shroud image formation process. Now it is well known gelatine is a breakdown product of collagen. \nReminder 1 for CB: Aged human blood no matter how degraded through natural mordanting on the cloth is still human blood. \nMost likely the bloodied body was wrapped up ‘as is’ i.e. all covered with its dry blood mixed with (Judean desert?) dust. Hence not only the flaking off (apparent ‘instances of hang-up in the interstices and crevices of the weave’) but ALSO the body-to-cloth gradual unsticking/sticking process along with the presence of ‘original dust(s)’ mixed with blood can ALTOGETHER account for the fuzzy imprint and slightly disturbed/nearly undisturbed haematic decals.\nReminder 2 for CB:  Mere flaking off through time just cannot account for all ‘what is or is not now there’ in the bloodstains. The haematic anatomic map is palaeopathologically and archaeologically accurate in terms of Judean burial and wrapping of a crucifixion victim. 1973 Side wound macrophotograph by Judica-Cordiglia yields image of torn flesh.\n\n","date":"March 16, 2013 at 11:40 am","url":"https://shroudstory.com/2013/03/16/the-making-of-a-meme-pope-francis-scientist-not-or/","cat":"news_&_views","id":"comment-27439","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Making of a Meme:  Pope Francis, Scientist. Not! Or . . .","post":"Typo: mordanting\n\n","date":"March 16, 2013 at 1:34 pm","url":"https://shroudstory.com/2013/03/16/the-making-of-a-meme-pope-francis-scientist-not-or/","cat":"news_&_views","id":"comment-27447","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Making of a Meme:  Pope Francis, Scientist. Not! Or . . .","post":"Typo: 1969 Side wound close-up photograph by Judica-Cordiglia yields image of torn flesh.\n\n","date":"March 16, 2013 at 5:50 pm","url":"https://shroudstory.com/2013/03/16/the-making-of-a-meme-pope-francis-scientist-not-or/","cat":"news_&_views","id":"comment-27463","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Making of a Meme:  Pope Francis, Scientist. Not! Or . . .","post":"Re CB’s comment “Without those bloodstains, all one has is a faint image of a naked (presumed) corpse, with no clue as to how he met his end, certainly no specific signs of crucifixion, but with hints – at least from the delightfully ambiguous Lirey badge – that he may have been slow-roasted, as per Jacques de Molay and his fellow Knights Templar on the Isle des Juifs, Paris, in 1314 (just 40 or so years prior to the first fully-documented sighting of the TS in Europe, subject of the Lirey badge).”\nAs a professional Cryptologist and Knights Templar glyptographic specialist, my comment is: “Just Cr*p & Bullsh*t”\n\n","date":"March 16, 2013 at 12:12 pm","url":"https://shroudstory.com/2013/03/16/the-making-of-a-meme-pope-francis-scientist-not-or/","cat":"news_&_views","id":"comment-27442","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Making of a Meme:  Pope Francis, Scientist. Not! Or . . .","post":"Typo: as a professional Cryptologist and specialist of Knights Templar glyptography\n\n","date":"March 16, 2013 at 12:20 pm","url":"https://shroudstory.com/2013/03/16/the-making-of-a-meme-pope-francis-scientist-not-or/","cat":"news_&_views","id":"comment-27443","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Making of a Meme:  Pope Francis, Scientist. Not! Or . . .","post":"Reminder for CB: Basic chemistry in conjunction with paleopathology and archaeological bloodstain pattern analysis  beat Archshroudsceptic pseudoarchaeological pseudohistorical misused chemistry any day.\n\n","date":"March 16, 2013 at 1:45 pm","url":"https://shroudstory.com/2013/03/16/the-making-of-a-meme-pope-francis-scientist-not-or/","cat":"news_&_views","id":"comment-27448","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Making of a Meme:  Pope Francis, Scientist. Not! Or . . .","post":"Bravo  Max Patrick\n\n","date":"March 16, 2013 at 2:36 pm","url":"https://shroudstory.com/2013/03/16/the-making-of-a-meme-pope-francis-scientist-not-or/","cat":"news_&_views","id":"comment-27451","author":"John Klotz","site":"shroudstory"},{"title":"The Making of a Meme:  Pope Francis, Scientist. Not! Or . . .","post":"I am unaware that the doctrine of Papal Infallibility necesarily extends to any graduate qualifications in chemistry held by the present incumbent.\n\n","date":"March 16, 2013 at 2:56 pm","url":"https://shroudstory.com/2013/03/16/the-making-of-a-meme-pope-francis-scientist-not-or/","cat":"news_&_views","id":"comment-27453","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Making of a Meme:  Pope Francis, Scientist. Not! Or . . .","post":"One doesn’t need to be infallible, daveb, not if you are the new incumbent of the Holy See. All you need for your Holy See (At Close Quarters) is a private viewing at the Turin Cathedral, armed with a spatula, forceps, sticky tape, a few specimen vials and a deep pocket.  Let outside laboratories do the rest. Just make sure you have the correct must-do list of analyses that reaches the parts of the Shroud that STURP investigators  failed abysmally to reach (like a meticulous and properly documented determination of what arrived first – blood or body image – instead of messing around with ‘serum-coated’ fibres – a misnomer if ever there was – and non-specific Sigma enzymes, essentially no different from whiter-than-white biological detergents),\nBetter still, hand the task over to a learned scientific society (Royal Society, National Academy of Sciences etc) instead of a bunch of largely self-selected individuals, with far too many over-the-hill, lack-lustre last-chance saloon nonentities, with scarcely a significant scientific discovery between them, far less a single Nobel Prize. \nYes, I know the US astounded the world with its Moon landing just 9 years previously, but STURP was not NASA, and in any case there’s a world of difference between science and goal-directed engineering. Too many STURP so-called scientists were fixated with the wrong goal – like (one suspects) the hoped-for kudos of proving authenticity.\n\n","date":"March 16, 2013 at 3:33 pm","url":"https://shroudstory.com/2013/03/16/the-making-of-a-meme-pope-francis-scientist-not-or/","cat":"news_&_views","id":"comment-27455","author":"colinsberry","site":"shroudstory"},{"title":"The Making of a Meme:  Pope Francis, Scientist. Not! Or . . .","post":"Colinsberry:\n¿Por qué se mantiene ROJA la sangre humana procedente de tus sanguijuelas (“Hirudo medicinalis”?  \nCarlos Otal\n\n","date":"March 16, 2013 at 3:56 pm","url":"https://shroudstory.com/2013/03/16/the-making-of-a-meme-pope-francis-scientist-not-or/","cat":"news_&_views","id":"comment-27457","author":"escipion","site":"shroudstory"},{"title":"The Making of a Meme:  Pope Francis, Scientist. Not! Or . . .","post":"@Carlos: I think it was John Jackson who proposed that iron-containing haem on the Shroud might owe its seemingly permanent anomalous red colour to irreversible binding of carbon monoxide (CO) with a very high association constant (over 20,000 from memory). If CO can attach to that Fe+3 centre so efficiently, then so might any number of other ligands with lone pairs of electrons. That beats Adler’s bilirubin any day – a molecule that prefers its own company (intramolecular hydogen bonding).\n\n","date":"March 16, 2013 at 4:11 pm","url":"https://shroudstory.com/2013/03/16/the-making-of-a-meme-pope-francis-scientist-not-or/","cat":"news_&_views","id":"comment-27458","author":"colinsberry","site":"shroudstory"},{"title":"The Making of a Meme:  Pope Francis, Scientist. Not! Or . . .","post":"Anyone who can fail to be impressed by what the STURP team managed to accomplish in the 120 hours allocated to them in 1978, despite all the logisitic and political obstructions they had to face, has an irremovable chip on their shoulder.  Never in the history of science was so much accomplished in such a short time as they had. As for their being driven by a pro-authenticity agenda, that is simply not the case. Questionable agendas are much more evident among the pseudo-skeptics with their pseudo-science than it ever has been among members of the STURP team.  \nThe various scientific institutions have had their opportunities, and they invariably fluffed it, driven as they were by their own pseudo-skepticism.  Agnostic Professor of Anatomy Yves Delage presented his own and Paul Vignon’s studies to the Paris Academy of Sciences in 1902 and the Academy fluffed it – Why? Because they were dominated by so-called free-thinkers and so-called rationalists. The British have seldom shown an interest in Shroud investigations, apart from their involvement in the notorious Carbon-14 dating tests, and they fluffed it.  They were even talked out of a rigorous sampling protocol.  Dr Berry’s assertions that there is no evidence of crucifixion in the subject of the image, pretends an ignorance in the 1930s work of forensic pathologist Dr Pierre Barbet, and so Dr Berry has fluffed it.  McCrone’s otherwise highly reputable laboratory came to false conclusions and so he has fluffed it. Madame Flury-Lemburg a most highly recognised textile specialist, claimed that the material of the cloth was uniform, and so she fluffed it.  The Royal Society has never shown an interest in Shroud studies, but if they ever do, they will surely fluff it! \nAmong all these errors and mistakes, the work of the STURP team in 1978 stands as a land-mark mile-stone of scientific achievement!\n\n","date":"March 16, 2013 at 6:05 pm","url":"https://shroudstory.com/2013/03/16/the-making-of-a-meme-pope-francis-scientist-not-or/","cat":"news_&_views","id":"comment-27467","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Making of a Meme:  Pope Francis, Scientist. Not! Or . . .","post":"Tell me I am wrong on matters of detail.  Please don’t tell me what to think…\n\n","date":"March 16, 2013 at 6:20 pm","url":"https://shroudstory.com/2013/03/16/the-making-of-a-meme-pope-francis-scientist-not-or/","cat":"news_&_views","id":"comment-27468","author":"colinsberry","site":"shroudstory"},{"title":"The Making of a Meme:  Pope Francis, Scientist. Not! Or . . .","post":"I’d hope it would be a cold day in hell before anyone even contemplated handing the Shroud to the likes of the Royal Academy, National academy of nonsense…What could possibly make colinferry believe they would or could do any better then the fluffers in 1988?\nThey are definately not to be trusted at all with such a relic if at all, for honest study….IMHO. \nR\n\n","date":"March 16, 2013 at 6:37 pm","url":"https://shroudstory.com/2013/03/16/the-making-of-a-meme-pope-francis-scientist-not-or/","cat":"news_&_views","id":"comment-27469","author":"Ron","site":"shroudstory"},{"title":"The Making of a Meme:  Pope Francis, Scientist. Not! Or . . .","post":"In his “Orphaned Manuscript,” which although impossible to get hold of is quite substantially available on Google Books, Adler explains the red blood colour in fascinating complexity, all of which sounds quite good except for: “You now mix bilirubin which is yellow-orange with methemoglobin in its para-hemic form which is an orangey-brown and you get blood which has a red colour.” Although I do not have access to these materials, I can mix colours in a paint palette, and I cannot make the shrouds pinky red ‘carmine’ colour from brown and orange, however hard I try.\nMore curious still, Adler goes on to say: “In fact, we have been able to simulate this spectrum in the laboratory by the process described above.” Well I’d love to know how. You can buy a jar of (bright orangey-red) bilirubin from the Xuchang Bilirubin Factory, and I dare say Adler could get hold of a syringe or two of para-hemic methemoglobin, but did he really make carmine from that? If Thibault reads this he may be able to explain…\n\n","date":"March 16, 2013 at 6:47 pm","url":"https://shroudstory.com/2013/03/16/the-making-of-a-meme-pope-francis-scientist-not-or/","cat":"news_&_views","id":"comment-27470","author":"Hugh Farey","site":"shroudstory"},{"title":"The Making of a Meme:  Pope Francis, Scientist. Not! Or . . .","post":"You know full well that is a grotesque account of how those three dating labs came to be fobbed off with  fabric from a single sampling location, possibly non-representative (but probably not).  Yet you quite shamelessly articulate it here, casually dishing conjured-up dirt, attempting to add further credence to the Big Lie that those labs were in some way culpable for a result that is hedged with a degree of uncertainty. (Although I personally see no grounds for thinking the linen is anything other than of medieval provenance).\nWhy sling mud at those 3 labs ? Do you have no respect for the facts, or plain common decency? Shame on you. What if it had been your son or daughter whose professional reputation was compromised by control freaks like that Professor Gonella –  messing with agreed protocols at the 11th hour -and furtively helping himself to threads, later to be donated to a home-alone one-man band like Raymond N. Rogers armed with little more than a microscope, working with an even less representative sample, possibly contaminated or even tampered with?  And where was Mr. Rogers’  knocking copy published? In a ‘peer-reviewed’ journal, which just happened to have him on its Editorial board, with no worries about conflict of interest.  And you have the gall to imply that the 3 labs behaved improperly when gross liberties and impropriety was happening all around them! \nWhat if it had been your son or daughter who had been made a patsy and scapegoat – to hide others’  interference and disgraceful conduct – and then found themselves the target for the despicable attacks on his or her personal integrity?  There’s even aa snide rabble-rousing  Italian TV documentary suggesting a conspiracy by the 3 labs to collude and give a “false” medieval date. It’s hard to find words to express one’s total outrage and disgust at this unwarranted slur. It’s not just anti-scientist, is it? Admit it. It’s anti-science – for coming up with the wrong answer.\n  I repeat – shame on you. It’s the Rons of this site who have steadily and systematically have been destroying my faith in human nature this last year or so, a faith that took the best part of a  lifetime to acquire, with many setbacks along the way.\n Now why don’t you sidle off, and conjure up some more calumny and claptrap, this time  at my expense, seeing as how that is your blogging persona  and how you get your kicks –  through mud-slinging. You certainly won’t lack for support on this site, as some of the other comments on this thread alone will attest.\n\n","date":"March 16, 2013 at 7:27 pm","url":"https://shroudstory.com/2013/03/16/the-making-of-a-meme-pope-francis-scientist-not-or/","cat":"news_&_views","id":"comment-27472","author":"colinsberry","site":"shroudstory"},{"title":"The Making of a Meme:  Pope Francis, Scientist. Not! Or . . .","post":"I said it once I say it twice for Hugh et al as far as the archaeological bloodstain pattern analysis is concerned: \n  Natural mordanting of dry blood remoistened with aqueous alkaline solution along with drying through myrrhic-aloetic (wood aloe) fumigation could account for:\n– The aged bloodstains still looking fresh today on the long inner burial cloth as if the blood had just been shed the day before. Mordant is known to be used for INTENSIFYING STAINS e.g. in cell or tissue preparations\n– Potassium giving only a weak signal in Shroud bloodstains while hydroxyproline (a marker for collagen) giving strong signal. Now it is well known gelatine is a breakdown product of collagen. The true fact is low temperature (55°-85° C) alkali gelatinisation of starch residuals present in the ancient linen cloth could be a possible factor as bubbling printing paste to be taken into account in the Shroud image formation process.\n– Bilirubin is neither the problem nor the solution, just probably one part of the whole equation.\n\n","date":"March 16, 2013 at 7:35 pm","url":"https://shroudstory.com/2013/03/16/the-making-of-a-meme-pope-francis-scientist-not-or/","cat":"news_&_views","id":"comment-27473","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Making of a Meme:  Pope Francis, Scientist. Not! Or . . .","post":"Yes, thanks, Max, for your alternative suggestion about how to keep blood red, which may. for all I know be the answer; it’s just that I’ve yet to read the results of anybody who’s tried it out. Adler, on the other hand, is fairly specific, but I cannot replicate his findings, and would like to know if anybody else has, or can explain what I have misunderstood.\n\n","date":"March 17, 2013 at 5:09 am","url":"https://shroudstory.com/2013/03/16/the-making-of-a-meme-pope-francis-scientist-not-or/","cat":"news_&_views","id":"comment-27522","author":"Hugh Farey","site":"shroudstory"},{"title":"The Making of a Meme:  Pope Francis, Scientist. Not! Or . . .","post":"Reminder: As a ‘funeral’ herb, myrrh is said to ease grief and heal emotional wounds, bringing peace and calm.  A resin such as that of the fragrant myrrh has always been associated with fumigation and purification rituals. Besides it has anti-microbial properties. When burned with moistening rotten aloe wood chips (moistening helps produce more smoke), some carbon monoxide is liberated along with smoke. CB does need some myrrhic-aloetic fumigation to recover his peace and calm ;-)\n\n","date":"March 16, 2013 at 7:46 pm","url":"https://shroudstory.com/2013/03/16/the-making-of-a-meme-pope-francis-scientist-not-or/","cat":"news_&_views","id":"comment-27477","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Making of a Meme:  Pope Francis, Scientist. Not! Or . . .","post":"Dr Berry attacks the members of STURP, and asserts that the matter would be better handled by an institution.  When I give a rebuttal he says not to tell him what to think, and to respond to his irrelevant details instead.  He makes an assertion that the C14 sample was probably representative, and that there’s no reason for thinking that the cloth is other than medieval without the slightest support for this argument.  I can’t be bothered with this kind of arrogance masquerading as science.\n\n","date":"March 17, 2013 at 1:02 am","url":"https://shroudstory.com/2013/03/16/the-making-of-a-meme-pope-francis-scientist-not-or/","cat":"news_&_views","id":"comment-27512","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Making of a Meme:  Pope Francis, Scientist. Not! Or . . .","post":"Attacking the members of science? It’s the selection process I criticized, and will continue to do so. Why was an explosives thermochemist put in charge of chemical studies when he had little or no acquaintance with flax or linen fibres – demonstrated with a blind spot for the primary cell wall, and immediately invoking an impurity layer that was a figment of his imagination and then proceeding to build his house of chemical cards? \nWhen he finds a strong signal for hydroxyproline in Shroud blood,what does he do (instead of consulting with haematologists)?  He immediately assumed it to be a constituent of normal blood (which it is not)  and before you know what is attempting to deploy that marker for collagen and connective tissue (possibly/probably non-human)  as an argument against contact scorching. \nWhen radiocarbon dating gives the wrong answer, what does he do, apart from spouting nonsense about invisible weaving via end-to-end splicing, crude attempts to disguise forgery etc – with distinct symptoms of  personal pique if not paranoia on full display? He attempts to substitute some quirky home-spun chemistry, having the world believe that the decay of a chemical marker – volatile, chemically unstable vanillin- is as good if not better than physics-based radiochemical decay. And all of that self-serving twaddle is accepted for publication in, guess what, his own Thermochimica Acta, a journal he helped to establish, sitting on its editorial board year after year deciding which thermochemical  papers to accept and reject, with Shroudies then crowing for ever after that Rogers’ finding were “peer-reviewed”.\n A thermochemist goes out of his way to reject a thermochemical explanation for the Shroud image – i.e. contact scorching – which is obviously anti-authenticity, in agreement with the radiocarbon-dating-  but then uses a thermochemical journal to publish his quirky and often misinterpreted results. \nYou couldn’t make it up – but so much of what came from STURP was just that – made-up special pleading, deployed in the subsequent defence of “mystery”, of entirely fictional model building. Nothing distinguishes the real from the faux science than the model building. There are many who think “I too can have hunches” and imagine that science is a game that anyone can play. What they forget is the self-discipline, the self-doubt, the self-criticism that goes into the patient construction of models that are based on a modicum of existing hard fact, especially fact that fits poorly with existing models. They know nothing about the models that are strangled at birth,  through recognition that they are not  testable in principle, at least on a realistic timescale.\nI could give a similarly unflattering account about some otherprima donnas on the seemingly xenophobic STURP (or did it simply have a blind spot for the rest of the world’s scientists, even its own Nobel laureates, many of whom were equally interested in the Shroud, and in many cases MUCH BETTER QUALIFIED in several instances, e.g. haematology, pyrolytic chemistry, botanical microstructure to make an input ) .  Instead we got STURP- characterized by self-indulgence,swaggering  over-confidence, preening vanity.  It was also a byword for non-transparency.  But I shan’t press the issue further than I have done already, because some of us are more concerned with trying to undo the damage that so many of STURP’s scientists–turned late-career pseudo-scientists- did to science. That’s why I am now keen and determined to involve my nearest centre of scientific excellence – the UK’s Royal Society. heirs to Newton, Faraday etc.  I want its considered opinion on what has been placed into the public domain  as if solid, reliable science, which I consider to be anything but on so many crucial issues,  I want its collective brain power and scientific flair and know how to be placed at the service of ‘Shroudology” proposing perhaps overlooked or state-of-the-art new approaches for resolving key questions like “What arrived first – blood or image?”\n. I don’t expect to win any popularity contests – least of all on this site – but hope one day, hopefully in  my lifetime- to be shown to have been substantially correct on the numerous matters I have addressed in well over 150 postings.\n Leech antigens in blood substitute, anyone,complete with natural anticoagulants, ideal for adding authentic touches to a ‘holy relic’  one that will really, ‘ow you zay it, pack zem in?  Because that’s what gives science its unique buzz – despite the months and years of patient slog,  and the oh so smug, superior putdowns – knowing that one was first to have made the right connections. It’s really no different from getting the ball into the net, past a wall of defenders, not all of them sportsmen, some indifferent or ignorant of the rules, securing the winning goal.\n\n","date":"March 17, 2013 at 4:59 am","url":"https://shroudstory.com/2013/03/16/the-making-of-a-meme-pope-francis-scientist-not-or/","cat":"news_&_views","id":"comment-27519","author":"colinsberry","site":"shroudstory"},{"title":"The Making of a Meme:  Pope Francis, Scientist. Not! Or . . .","post":"Correction (first sentence): attacking the members of STURP..\n\n","date":"March 17, 2013 at 5:00 am","url":"https://shroudstory.com/2013/03/16/the-making-of-a-meme-pope-francis-scientist-not-or/","cat":"news_&_views","id":"comment-27520","author":"colinsberry","site":"shroudstory"},{"title":"The Making of a Meme:  Pope Francis, Scientist. Not! Or . . .","post":"Yes, Colin Berry, the labs “were in some way culpable for a result that is hedged with a degree of uncertainty.” They knew that they were getting snippets from a single, dirty corner of the cloth. They were adult scientists and not as you complain, a “son or daughter . . . made a patsy and scapegoat.” They acted most unscientifically. The burden of being unscientific belongs to the labs. Yes, Colin Berry, you know it and you are being ridiculous.\n\n","date":"March 17, 2013 at 7:21 am","url":"https://shroudstory.com/2013/03/16/the-making-of-a-meme-pope-francis-scientist-not-or/","cat":"news_&_views","id":"comment-27533","author":"Paulette","site":"shroudstory"},{"title":"The Making of a Meme:  Pope Francis, Scientist. Not! Or . . .","post":"Hello. I’m from Argentina and I understand what the problem is.\nHere in my country there’re high schools that specialize in different areas (technical, industrial, sciences, economics), and they grant degrees like Technicians, Bachelor, and others.\nUniversities usually give the technician degree (intermediate level) at 3 years and the Engineer degree (full degree) at five years.\nBetween the High School degree and the College Degree there is another title called “terciary”, which does not depend on a University. We can choose if we want to go College or a Terciary High School.\nPope Francis has a Chemistry Technician degree, and probably has the same knowledge as intermediate level from College. He didn’t went to the UBA. I don’t know if I would call him a Scientist but he has good knowledge in chemistry.\n(Sorry my english)\n\n","date":"March 18, 2013 at 12:55 am","url":"https://shroudstory.com/2013/03/16/the-making-of-a-meme-pope-francis-scientist-not-or/","cat":"news_&_views","id":"comment-27589","author":"Esteban","site":"shroudstory"}]
