[{"title":"The Masters of Comedy in Piedmont","post":"We have seen many methods of how the Shroud was not produced and the one method that explains it is not accepted by the unbelievers. You either believe in what God did or you don’t.\n\n","date":"June 17, 2015 at 5:38 am","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","id":"comment-202480","author":"Emmett McMahon","site":"shroudstory"},{"title":"The Masters of Comedy in Piedmont","post":"One method that explains it?  That is not the way I see it. But just to be sure, what method do you mean?\nI think we have yet to find the method by which the image came to be on the shroud. It might be artistic for art’s sake or for hoaxing, completely natural, natural from a byproduct of a supernatural event or completely supernatural.  Whatever it is it may be related to the Resurrection or not. I’m inclined to believe it is indirectly, and only indirectly, related to the Resurrection. Oh, and I don’t believe in dematerializing bodies. I don’t even believe the Resurrection is a process, not because it is not, but because there is no reason to think that it is. Oh,yes, I do recite the Nicene creed and mean it from my heart and as a matter of faith.\n\n","date":"June 17, 2015 at 6:02 am","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","id":"comment-202484","author":"Dan","site":"shroudstory"},{"title":"The Masters of Comedy in Piedmont","post":"So if you do’t believe in dematerializing bodies how do you explain the resurrection, empty tomb etc.\nPresumably, that Christ’s body was ‘transformed’ rather than dematerialized. I’m sure that is the conventional way of thinking of the resurrection.\nOf course the transformation of the body could quite conceivably have exerted an image-making effect.\nI still personally see the resurrection in terms of a dematerialization of the physical body and simultaneous creation into a spiritual body – like a ghost but not like a ghost (more 3d or realistic if you like)\nI believe in the resurrection so I think that it a very real possibility.that it was behind the image. But I can’t prove it and acknowledge there could still be a naturalistic explanation.\n\n","date":"June 17, 2015 at 4:40 pm","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","id":"comment-202547","author":"Thomas","site":"shroudstory"},{"title":"The Masters of Comedy in Piedmont","post":"Based on the evidence available it quite possible that image was formed due to some sort of radiation.\nLooking at the image we know that it is a photographic negative. We also can see X-Ray (film) properties. Can see the hair, beard and eye brows in the image and can see hair was blown out due to some sort of radiation.\nAny chemical, biological or natural reaction of a dead or living body cannot make an image like that.  I am quite sure that none of the biological or chemical processes can create an image like on the TS with the hair, beard and eyebrows. \nDr. Accetta’s experiment confirmed that image was created by some sort of radiation.\nAs confirmed by many scientists blood stains are real and blood soaked to the linen before the creation of the body.\nMost probably body dematerialized and some sort of radiation activity emerged within the body to create dorsal and frontal images and linen acted like a (photographic or X-ray film). Also image spread uniformly only on the very top of the burial linen.\nGospel accounts also confirmed that after the resurrection Jesus body was different to a normal human body.\n\n","date":"June 17, 2015 at 7:31 pm","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","id":"comment-202563","author":"Sampath Fernando","site":"shroudstory"},{"title":"The Masters of Comedy in Piedmont","post":"Emmett, there’s a lot more to it than merely the various speculations of how the image might have been formed.  STURP accomplished quite a lot in 1978, but much of their research is now questioned, much of it was not peer reviewed, questions have been raised about the pollens, which many claim to have been poorly done with many false identifications, the questions of the identity of the aragonite limestone needs to be settled, the age of the cloth, various properties of the textile, questions concerning the blood stains, presence or absence of carbohydrate coatings, and many other proper scientific questions.  Techniques in scientific research have made huge leaps since 1978.  Meantime there are silly politics going on as to who might or might not be given access, and everything is clouded in secrecy, the Turin guardians imagining that they have sole proprietary rights over what they see as their relic.  \nThe Europeans seem capable of investigating a lump of icy rock from the outer limits of the solar system, but so far have been unable to make much progress with what is here on earth directly under their collective noses!\n\n","date":"June 17, 2015 at 6:06 am","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","id":"comment-202485","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Masters of Comedy in Piedmont","post":"daveb of wellington nz\nwrote:\n>The Europeans seem capable of investigating a lump of icy rock from the outer limits of the solar system, but so far have been unable to make much progress with what is here on earth directly under their collective noses!\nYes.\nThe Europeans seem to be able to investigate a piece of icy rock coming from the outer limits of the solar system. But prior to be able to do this study/observation were needed projects, money, etc. …\nThat is, to go from saying to doing up (= really working, turning the rough ideas in a successful history!) perhaps is longer than it seems …\n— —\nDo you know where is located a decent AFM (Lab. of Materials) apparel?\nHere (for example) some questions to answer :\nAre we allowed to use the Atomic Force Microscope (= AFM) (on treated linen samples …and the linen fibrils can be also irradiated multiple times…) in their laboratory and they advised us how to operate it efficiently?\nHow an AFM instrument will succeed probing  the secrets of Shroud?\nFinally, by the way, I want to ask if you can get to exactly know the speed of propagation of elastic arrow in\ntreated lignocellulosic materials …\n——————–\nIrradiation can include irradiating with VUV (and/or X-rays and gamma radiation if you want to greatly extend the work of comparison. These irradiations perhaps can be useful for the space studies, but I have some doubt on that choice) and/or with electron beam radiation or corona discharge.\nIrradiation can also be carried out before or after Maillard reaction and this can be another great extension for the work (thus: with a  source of a sort of a possible “bottleneck’s production” [or constraint], before to compare the results).\nI believe that bending fracture of textiles treated with irradiations is greater than the other cases. … and you?\n— — —\nI believe you should improve the AFM observations comparing the results obtained on linen fabrics treated with fungi with the other treated with saponin and then (after the saponin’s treatment) submitted to the same fungal attack…\nIn any case, a preliminary inspection performed with the use of light microscopy can exclude any such affected areas.\n— — —\nAnd, until now, there is not an European Shroud Agency…\n\n","date":"June 17, 2015 at 10:19 am","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","id":"comment-202512","author":"piero","site":"shroudstory"},{"title":"The Masters of Comedy in Piedmont","post":"Perhaps here in Biella might be more interested in the Aubusson tapestries (= wool tapestries. By the way I was told to make that kind of tapestries you should use the wool from New Zealand …) that the linen … or the linen of the Holy Shroud.\nLink:\nhttp://www.travelfranceonline.com/aubusson-tapestry-\nfacts-limousin/\n>… Aubusson is world famous for the wonderful tapestries that have been produced in its workshops from 14th century onwards. … …\n— —\nOther links:\nhttp://www.videoguidelimousin.fr/en/pages/visiter-les-musees-2\nhttp://www.unesco.org/culture/ich/RL/00250\n—  — —\nI wonder if traveling around the world there is some ancient tapestry that reproduces the Shroud.\nReally… nothing?\nZero ?\nAncient Egyptians and the Incas used woven tapestries as shrouds in which to bury their dead.\nMedieval tapestries were woven on linen warps to insure their ability to last through the ages.\nMaybe an ancient tapestry could make the happiness of our friend Charles, who seems very adept buttoning up strange stories …\nHere what I have found (= Bayeux):\n>Hic portatur corpus Edwardi regis ad Ecclesiam Sancti Petri apostoli.\n>Wrapped in a rich Shroud, Edward’s body is carried on a stretcher by eight men of the royal family, the altar boys all blew their tintinnaboli, clerics and prelates sing their funeral orations.\nLink:\nhttp://www.medievale.it/articoli/gli-arazzi-di-bayeux/\n— —\n>The Bayeux Tapestry is one of the most extraordinary artefacts to survive from the eleventh century. A fragile web of woollen thread on linen, its brilliant colours undimmed after nearly a thousand years, this masterpiece is unique as a complete example of an art form beloved of the aristocracy in the Romanesque era – the `historiated’ or narrative embroidery. … …\n“The Bayeux Tapestry”\nby Lucien Musset\nBoydell Press, 2005 – 272 pages\n— —-\nLinen velvets are ancient in origin, but I never saw a devotional velvet (with the Holy Shroud depicted upon that textile substrate).\n\n","date":"June 17, 2015 at 11:07 am","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","id":"comment-202520","author":"piero","site":"shroudstory"},{"title":"The Masters of Comedy in Piedmont","post":"Umberto II di Savoia donated the Shroud “to the Pope and his successors”, not to the Vatican or the archdiocese of Turin. The relic is kept in Turin because that was one of the conditions imposed by Umberto. The “silly politics” is the result of the minefield that the realm of Shroud studies has become. It was not so during the time of Cardinal Michele Pellegrino.\n\n","date":"June 17, 2015 at 8:17 am","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","id":"comment-202498","author":"Louis","site":"shroudstory"},{"title":"The Masters of Comedy in Piedmont","post":"In 2009 a parliamentary question was asked of the Italian Minister of Culture that he formally affirm that the Shroud was the property of the State of Italy, and had been since 2 June 1946. It was thus not King Umberto’s to bequeath to anybody. (http://www.senato.it/japp/bgt/showdoc/showText?tipodoc=Sindisp&leg=16&id=424189)\nTactfully, or because of other pressures on his time, the Minister did not reply, but if he were ever constrained to, there is no doubt that Umberto’s gift to the Pope would be rejected out of hand. It could then be that the State of Italy itself decided to present the Shroud to the Holy See, but they haven’t yet.\nWe are sometimes told that the Shroud was willed to the Holy See ‘on condition that it remain in Turin’ or some similar wording. I don’t think this it true. I think it is a tactful acceptance that the Holy See has no authority to move it anywhere.\n\n","date":"June 17, 2015 at 12:19 pm","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","id":"comment-202523","author":"Hugh Farey","site":"shroudstory"},{"title":"The Masters of Comedy in Piedmont","post":"Wasn’t there the document about King’s Umberto last will regarding the Shroud? I think I have seen it somewhere (and there was no mention about Shroud staying in Turin), but I don’t bet anything on that.\n\n","date":"June 17, 2015 at 1:17 pm","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","id":"comment-202528","author":"O.K.","site":"shroudstory"},{"title":"The Masters of Comedy in Piedmont","post":"Hugh, that was the information provided in Ian Wilson’s book. It seems that Umberto wanted the relic to remain there because of the royal chapel. Whatever, when the members of the royal family, Prince Emanuele Filiberto and the rest, were allowed to return to Italy, the first thing they was to see the Pope, then John Paul II. They were also allowed to see the Shroud in private and if I’m not mistaken the prince is a member of the Confraternity of the Holy Shroud.\n\n","date":"June 17, 2015 at 3:22 pm","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","id":"comment-202541","author":"Louis","site":"shroudstory"},{"title":"The Masters of Comedy in Piedmont","post":"There’s this: http://www.shroud.it/UMBER-1.PDF, or in English http://www.shroud.it/UMBER-2.PDF. There is no indication that the Shroud had to be kept in Turin in it though.\n\n","date":"June 17, 2015 at 4:17 pm","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","id":"comment-202545","author":"Hugh Farey","site":"shroudstory"},{"title":"The Masters of Comedy in Piedmont","post":"Daveb, please remember that the Catholic Church is not a scientific institution but a religious one. For this reason, her objectives are not to build scientific evidences for the relics she owns, but to use them to spread her spiritual teachings. That is exactly what we are seeing in Turin, although it is quite clear that the Church believes the Shroud is authentic. Otherwise , we would not have an exhibition like the one we are seeing in Turin. A final thought about your comment is that if the Church devoted half the resources invested in this asteroid to do state-of-the-art research on the Shroud, taking into account the huge poverty all over the world, she would be criticized for that.\n\n","date":"June 17, 2015 at 1:41 pm","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","id":"comment-202531","author":"gabriel","site":"shroudstory"},{"title":"The Masters of Comedy in Piedmont","post":"The problem is that there are many Shroudies who base their faith on the authenticity of the relic.\n\n","date":"June 17, 2015 at 3:32 pm","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","id":"comment-202543","author":"Louis","site":"shroudstory"},{"title":"The Masters of Comedy in Piedmont","post":"I don’t believe this silly false generalisation at all.  True faith is based on what a person can accept as adequately rational evidence, and should never be granted lightly, otherwise it’s fanatacism.  A principle value of the Shroud I see is in its potential for the evangelisation of peoples in today’s world of scientific scepticism, as I’ve stated below.\n\n","date":"June 17, 2015 at 5:09 pm","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","id":"comment-202549","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Masters of Comedy in Piedmont","post":"It is not a false generalisation. I said “many”, not ” all” and, given what you posted on this blog last year and the sources you cite in biblical archaeology, you include yourself in the “many”. The people you called ” Turin guardians” were the object of your unjust attack. They are not interested in proving the authenticity of the Shroud because the relic is not part of the Deposit of Faith. What if something wrong with a new test tomorrow? Atheists will make the Church the object of ridicule and those who base their faith on the relic will join them.\n\n","date":"June 17, 2015 at 5:30 pm","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","id":"comment-202551","author":"Louis","site":"shroudstory"},{"title":"The Masters of Comedy in Piedmont","post":"I consider it a false generalisation, because I doubt very much that many people do base their faith solely on the Shroud.  Granted, it is an object of devotion to many, but it is only one piece of circumstantial evidence that tends to corroborate the evidence of the gospels, the witness of St Paul, the witness of the martyrs, and the teaching of the church fathers.  \nIf it were convincingly shown that the Shroud was in fact 14th century, I doubt that many people’s faith in Jesus Christ as Lord and Saviour would be much affected at all.  That certainly didn’t happen in 1988 with the radiocarbon testing.  \nAtheists will always make the Church and believers objects of their ridicule.  They don’t need the Shroud to do so.  If the Shroud happens to be the authentic burial cloth of Christ, then I think that is extremely important, certainly in the realm of evangelisation, and it ought to be known.  Otherwise I think it is lackadaisical not to make adequate efforts to look into the matter.  \nDismissing it as being not part of the “Deposit of Faith” is to trivialise it, and is a weak excuse for doing nothing.   \nI’m happy to leave to others to make their own particular judgments on whether or not those who have custody are prepared to admit legitimate investigation by those they consider outsiders.\n\n","date":"June 17, 2015 at 7:06 pm","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","id":"comment-202558","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Masters of Comedy in Piedmont","post":"Those who havê been part of the Shroud crowd for a long time know what was the reaction of some in this group after the CD test.\nNo one hás dismissed the Shroud as not being part of the Depósit of Faith in order to trivialise it. Those who claim to be faithful members of the Church should respect its decisions. The Church is 2000 years old, it hás resisted the 1988 results. Só much insistence on fresh testing can only demonstrate lack of faith.\n\n","date":"June 17, 2015 at 7:56 pm","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","id":"comment-202567","author":"Louis","site":"shroudstory"},{"title":"The Masters of Comedy in Piedmont","post":"Cost of Rosetta Project 2015:\nhttp://scienceogram.org/blog/2014/11/rosetta-comet-esa-lander-cost/  \nAnswer:  1.4 billion euro;  Equal to 4.2 Airbus A380 aircraft;  3.5 Euro per European citizen, from 1996 to 2015 = 0.20 euro per person per year.  \nIn 1978, American philanthropists raised about $US 2.0 million to fund STURP project, comprising about 30 scientists, most of whom donated their time freely, and at no cost whatsoever to Catholic Church.  Even after 37 years, inflation has not grown 1000-fold by any means! \nIt is not the case that the Catholic Church is indifferent to scientific interests.  It has its own Pontifical Science Academy, led by outstanding world leaders in science with a range of different beliefs.  Pope Pius XII himself was well-known for his interests in cutting edge astronomy, having written significantly on the then new topic of qasars.  The original Vatican Radio station was designed and installed by broadcasting pioneer Marconi.  \nPopes from at least the time of Pius XI have all expressed a personal belief in the authenticity of the Shroud, but have stated that they leave it to the scientists to establish true authenticity or otherwise.  \nThere is no need for the Church to be the source of funds for any Shroud research, and this is best the role of those with sufficient influence and motivation to do so, as was the case with the 1978 STURP project in the USA.  However the Church surely has a leadership role in creating the proper climate for quality research to occur.  \nIf authentic, the Shroud has a wonderful potential for the evangelisation of peoples in the 21st century.  Catholicism in particular and Christianity in general, is a religion based on actual historical events, the passion and resurrection of Jesus Christ, and the Shroud has the potential to be an authentic witness to that historicity.  It is a sign proper for our own times.  Not to pursue this potential is I consider a grave sin of collective omission.\n\n","date":"June 17, 2015 at 3:52 pm","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","id":"comment-202544","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Masters of Comedy in Piedmont","post":"After the St. Louis conference, I had a one on one talk with Prof. Barberis.  2 of the points I made were:  A)  New testing on the Shroud is important because of its evangelisation potential and B)  2 of the most knowledgeable people on the planet on the Shroud, John Jackson and Barrie Schwortz will not be around forever and it would be wise to do any new testing while they are still alive.\n\n","date":"June 17, 2015 at 8:34 pm","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","id":"comment-202573","author":"Joe Marino","site":"shroudstory"},{"title":"The Masters of Comedy in Piedmont","post":"How did this turn into a religious discussion, I thought it was about comets.\n Anyway it turns out this comet is not a dirty snowball more like a lump of rock.\nhttps://problemswiththebigbang.wordpress.com/2015/06/18/comets-are-they-really-snowballs-the-evidence-says-no/\n\n","date":"June 17, 2015 at 9:56 pm","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","id":"comment-202580","author":"Derek Syms","site":"shroudstory"},{"title":"The Masters of Comedy in Piedmont","post":"Thanks for the commentary and amazing pix of comet 67P, Derek.  How did it turn into a religious discussion?  On another thread, Louis had commented that Rome and Turin ought to be allowing another examination of the Turin Shroud, but had expressed doubts that it would ever happen, partly because of silly politics.  That morning, my daily newspaper had published a fascinating item on the latest news about Rosetta / Philae / CP7.  The contrast between the scientific approach taken on these two disparate topics seemed so comedic to me, that it prompted my comments in reply to Louis which Dan promoted in the lead posting above.  \nScientific interest in the Shroud commenced in 1898, with the first photographs taken, and probably the greatest achievement occurred with the mainly American STURP investigations of 1978.  Their success and advanced technology seemed to have left the locals somewhat mortified and humiliated, and STURP was shut out of the 1988 radiocarbon investigations.  There seem to be other signs of reluctance to involve the wider scientific community, such as the non-release of a series of detailed micrographs taken which could reveal further information.  Meantime there seems to be a series of peculiar experiments in the north of Italy promoting some strange ideas concerning radiation as a possible cause of the image.  All this seems to some professionals to be a little bizarre. \nThe disciplined approach with generous funding taken by the wider European scientific community to investigate a lump of rock 308 million km from Earth, is in sharp contrast to the lack of any systematic investigation of a holy relic which is of considerable public interest, but which languishes for want of a similarly coordinated approach, and at an insignificant small fraction of the cost of Rosetta.\n\n","date":"June 18, 2015 at 6:28 am","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","id":"comment-202614","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Masters of Comedy in Piedmont","post":"I, for one, agree with your Rosetta comparison. We could very likely solve the authenticity question of the Shroud with a new STURP 2.0 investigation – using non-destructive methods. What are we afraid of? That we will be guilty of putting God to the test? Here’s a newsflash: God wants us to put Him to the test – because it means we are searching for Him – the Truth. \nYes, I know Jesus – in the desert – answers the Devil with:  “thou shall not put they Lord and God to the test.” But he speaks here of a test of God’s Will and of his own identity as Son of God. That is a very different type of test. \nTo test the Shroud is not to test God Himself – it is to test a relic. It is a test, for some, of our own faith – to see what is it exactly we do believe in: Jesus or an icon. That’s a necessary distinction to know for our spiritual health.\nIf we go into a new set of tests, with a sincere desire simply to know the truth, and not to prove our personal position on the matter, we will be fulfilling our God-given desire to turn a question mark into a period. Let’s avoid the exclamation marks this time around.\n\n","date":"June 18, 2015 at 7:48 am","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","id":"comment-202625","author":"David Goulet","site":"shroudstory"},{"title":"The Masters of Comedy in Piedmont","post":"David,\nYou wrote:\n>…We could very likely solve the authenticity question of the Shroud with a new STURP 2.0 investigation – using non-destructive methods. What are we afraid of? …\nWell.\nI think this is the same idea that I already indicated in 1998 because the SPMs techniques are non-destructive methods.\nSo…\nThere is another problem to solve:\nIn my opinion, the basic conflict between established religion and modern science can turn drifted when you blindly believe in some unclear statements without having seen the inherent proofs…\nAnd then I want to add that I would be still curious to observe in a better manner what happened with the story on fengite and biotite and presumed piezonuclear neutrons, using the HIM (= Helium Ion Microscope) instead of the Energy Dispersive X-ray Spectroscopy (EDS) tests conducted on the specimens. But these analyses can be useless… the main opinion is that they failed to obtain a significative amount of piezonuclear fissions, in any case this controversial story seems to be far from the analyses on linen samples.\nWe have not yet seen the advanced analyses on TS-like impressions obtained by De Liso\n(link: http://www.shs-conferences.org/articles/shsconf/pdf/2015/02/shsconf_atsi2014_00002.pdf).\nInstead what we have to deepen are the AFM controls and the possible tests about the (speed of the) arrow of elasticity (see also : the elastic modulus = Young’s modulus) for ancient linen fibrils.\nThese are the things where we have to be focused, the other stories are less important.\n— —\nWe have to choose a technique to visualise how different linen samples behave under stress.\nPerhaps some vague suggestions can be derived from the reading of the “Nanostrain project”.\nThe reasoning is the following :\nif you can use the characterisation of nano-strain using piezoelectric materials, then you can claim to be able to control what happens on your linen fibrils submitted to a load of certain amount, using the proper devices (based on piezoelectric tools or directly, with the AFM tip) …\n— — — —\nIt seems that Einstein had the hobby of sailing…\nHere what I have read:\n>Einstein loved sailing, even though he wasn’t very good at it — his neighbors on Long Island frequently had to help him right his capsized boat Tinef (Yiddish for “worthless”). And even though Einstein never learned to swim, he kept sailing as a hobby throughout his life.\nand also:\n>the renowned physicist spent the summer of 1935 in Old Lyme, CT, often sailing on the Connecticut coast.\n>Despite sailing for over half a century, Einstein was not a very accomplished sailor. According to his biographers, he would lose his direction, his mast would often fall down, and he frequently ran aground and had near collisions with other vessels. …\nLink:\nhttp://www.sailingscuttlebutt.com/2013/03/21/albert-einstein-not-much-of-a-sailor/\n— —\nScience and religion.\nIn fall 1980, Pope John Paul II ordered a new look at evidence in Galileo’s trial. In 1992 came acquittal…\n\n","date":"June 18, 2015 at 10:51 am","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","id":"comment-202646","author":"piero","site":"shroudstory"},{"title":"The Masters of Comedy in Piedmont","post":"David:  “It is a test, for some, of our own faith – to see what is it exactly we do believe in: Jesus or an icon.”  False choice/analogy by you.  There is clearly another outcome:  we believe in Jesus AND in the icon/relic.  “OR” is a false choice.  But thanks for the poke in the eye made in the guise of reasonable-ness.\n\n","date":"June 18, 2015 at 11:34 am","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","id":"comment-202653","author":"Nabber","site":"shroudstory"},{"title":"The Masters of Comedy in Piedmont","post":"A fair point Nabber. I wasn’t trying to poke anyone’s eye.\n\n","date":"June 18, 2015 at 12:32 pm","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","id":"comment-202660","author":"David Goulet","site":"shroudstory"},{"title":"The Masters of Comedy in Piedmont","post":"It is strange that what I commented on one thread received a response on this thread, with nothing to do with my comments. The only thing I discovered was that Dan (see post above) has bought the assertion in paragraph 4 in the link below:\nhttps://www.academia.edu/11355553/Dr._Paolo_Di_Lazzaro_explains_his_research_on_image_formation_on_the_Shroud_of_Turin\nregarding the Resurrection and its possible relation to the Shroud image.\nIf there was just “silly politics” in the realm of Shroud studies it would not deter the authorities from allowing another examination. However, the problem is much more serious, prompting the message by Benedict XVI read out at the last Dallas conference. That was quite some time ago and the authorities must have seen — surely they do not access the Internet blindfolded — that the pontiff’s words have fallen on deaf ears. As if this was not enough, there was a lot of character assassination and muckraking online, which had stopped for a while, but has apparently raised its ugly head again. I have said it once and I say it again: quite often the left hand and does not know what the right hand is doing in the realm of Shroudies. Why be surprised if petitions sent to the Pope by Shroudies are ignored?\nIt is important to remember that what matters most to Rome is the quest for candidates for canonisation, not relics, and the mystery of incorruption, demonstrating what Jesuit Father Herbert Thurston called the “odour of sanctity”, is still being investigated. The canonisation process leads to thousands of pages and involves non-Catholic scientists, in fact RD was once summoned to play the role of devil’s advocate.\n\n","date":"June 18, 2015 at 11:29 am","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","id":"comment-202651","author":"Louis","site":"shroudstory"},{"title":"The Masters of Comedy in Piedmont","post":"Amazing pictures from the NavCam camera on Rosetta BUT there is a lunatic video about the “Electric Universe” and C 67-P at the end of the post…\n\n","date":"June 19, 2015 at 2:04 am","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","id":"comment-202742","author":"anoxie","site":"shroudstory"},{"title":"The Masters of Comedy in Piedmont","post":"Granted that the quest for candidates for canonisation is a significant agenda item for Rome, as seemed particularly the case for JP II, the demands of papacy as CEO require that no single issue become an isolated focus to the exclusion of other significant priorities.  The writings of all recent popes demonstrate their commitment to an extremely comprehensive range of issues concerning the universal church, of peoples, of matters affecting the real interests of humanity such as the environment, global warming, of justice, not to say theology, morality and biblical studies, as well as many more. \nLouis refers to the message of Benedict XVI to the Dallas Shroud conference.  There is much that Benedict and other Popes have written concerning the Shroud.  Stephen Jones has a fascinating compilation of sample comments on his web-site which should be read by those wanting to know more:\nhttp://theshroudofturin.blogspot.co.nz/2007/08/pope-benedict-xvi-on-shroud-of-turin.html \nBenedict’s message to the Dallas conference reads as follows:\n” ‘His Holiness trusts that the Dallas conference will advance cooperation and dialogue among the various groups engaged in scientific research on the Shroud and in promoting awareness of its outstanding religious significance. He is convinced that the growth of such collaboration, in complete respect for the autonomy of distinct areas of competence, will contribute to the important pastoral aim of making the mystery of the Shroud better known and enabling its message to touch the hearts of men and women everywhere.’ [Letter from the Vatican, 16 July, 2005, to the Most Reverend Charles Grahmann, Bishop of Dallas].” \nSeveral other such papal comments can be found on the link reference.\n\n","date":"June 18, 2015 at 3:42 pm","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","id":"comment-202675","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Masters of Comedy in Piedmont","post":"Benedict was more bold in his approach and in his message, read out by Bishop Kevin Vann of Fort Worth, Texas. John Paul II looked at the relic more from the philosophical point of view, saying that it drew our attention to the “mystery of life and death”.\nHowever, my focus was not on each and every issue on the papal agenda, it was limited to devotion, therefore canonisation and relics.\nIt is interesting to note that Rome does not look for “living saints”, those who are known to have healed and cured in life, like John Paul II, as recorded by the German journalist and author Andreas Englisch, a Vatican correspondent for twenty years, in one of his books:\n http://andreasenglisch.de/journalist.php\n\n","date":"June 18, 2015 at 4:10 pm","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","id":"comment-202679","author":"Louis","site":"shroudstory"},{"title":"The Masters of Comedy in Piedmont","post":"“Would it make any difference if we sent the Shroud into a 308 million km orbit?”\nNo, what would make the difference is a dedicated team of scientists and engineers.\n\n","date":"June 19, 2015 at 1:44 am","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","id":"comment-202739","author":"anoxie","site":"shroudstory"}]
