[{"title":"A Committee Far Removed from Padua","post":"His friends in SSG could have saved him from this. It is now up to GF to propose a transparent study of his methods and samples.\n\n","date":"April 5, 2013 at 7:13 am","url":"https://shroudstory.com/2013/04/05/a-committee-far-removed-from-padua/","cat":"news_&_views","id":"comment-29474","author":"Paulette","site":"shroudstory"},{"title":"A Committee Far Removed from Padua","post":"I am convinced Guilo’s paper will be reviewed and accepted. But why do we place such importance on peer review papers. Here in Dr. Gove’s hometown, Rochester NY, The University of Rochester and Strong hospital relies on peer review papers for grants. Without such economic distribution of funds to our largest employer, where do you think Rochester NY would be today if we still relied on Kodak, Xerox and Bausch and Lomb?\n\n","date":"April 5, 2013 at 8:31 am","url":"https://shroudstory.com/2013/04/05/a-committee-far-removed-from-padua/","cat":"news_&_views","id":"comment-29479","author":"Giorgio","site":"shroudstory"},{"title":"A Committee Far Removed from Padua","post":"Yes peer review is needed but MIT and Oxford specifically?  We also have to be careful that we are not casting a sheep into a pack of wolves.  There are many who would love to discredit the Shroud, who have an anti-God world view.  Science–yes.  Agenda driven science–No.  Fanti is accused of this very thing.  Yet, most of the scientific community is still hanging on to C-14 as the final arbiter of truth.  The review posted yesterday did a good job of questioning Fanti’s samples and methodology–all the reasons why it may be flawed.  I also want to hear all the reasons why he may be onto something significant.  Is it possible to get that balance?  So far all I have heard in this forum is why it is unreliable.\n\n","date":"April 5, 2013 at 10:54 am","url":"https://shroudstory.com/2013/04/05/a-committee-far-removed-from-padua/","cat":"news_&_views","id":"comment-29492","author":"Russ Breault","site":"shroudstory"},{"title":"A Committee Far Removed from Padua","post":"Read this comment of mine Russ : https://shroudstory.com/2013/04/04/a-critical-review-of-giulio-fantis-new-book-unreliable-results-because-of-inadequacy-of-methods/#comment-29491\nI think I have exposed all the pertinent reasons why Fanti’s claims must be considered as highly suspicious !\n\n","date":"April 5, 2013 at 10:58 am","url":"https://shroudstory.com/2013/04/05/a-committee-far-removed-from-padua/","cat":"news_&_views","id":"comment-29494","author":"Yannick Clément","site":"shroudstory"},{"title":"A Committee Far Removed from Padua","post":"\nGiorgio :\nI am convinced Guilo’s paper will be reviewed and accepted. But why do we place such importance on peer review papers. Here in Dr. Gove’s hometown, Rochester NY, The University of Rochester and Strong hospital relies on peer review papers for grants. Without such economic distribution of funds to our largest employer, where do you think Rochester NY would be today if we still relied on Kodak, Xerox and Bausch and Lomb?\n\nThe issue of peer review politics and all the rat race behind the publications in established journals is the same as all politics – dirty, unreliable and full of lies and personal vendettas.\nOne should not place too much importance on them, just take into account in a big picture.\nThis is pertinent to ALL research and research publications.\n\n","date":"April 5, 2013 at 11:26 am","url":"https://shroudstory.com/2013/04/05/a-committee-far-removed-from-padua/","cat":"news_&_views","id":"comment-29500","author":"jesterof","site":"shroudstory"},{"title":"A Committee Far Removed from Padua","post":"Well said “Jesterof”.\n\n","date":"April 5, 2013 at 11:38 am","url":"https://shroudstory.com/2013/04/05/a-committee-far-removed-from-padua/","cat":"news_&_views","id":"comment-29501","author":"Giorgio","site":"shroudstory"},{"title":"A Committee Far Removed from Padua","post":"The most important thing to judge the validity of any scientific conclusions made by any scientist on the planet is this:  Was that conclusion INDEPENDENTLY CONFIRMED by a credible and unbiased scientist or not (one who is a true expert in the field and who is totally independent of the scientist who first publish the conclusion)?\nThat’s the most important factor to consider when it’s time to judge the validity of someone’s claim.  And in the case of Fanti, no doubt that the only way this could happen is to wait for a new direct set of testing done on the Shroud and see if the results that will came out of this will be able to confirm or not the claims he made in his commercial book.\n\n","date":"April 5, 2013 at 11:46 am","url":"https://shroudstory.com/2013/04/05/a-committee-far-removed-from-padua/","cat":"news_&_views","id":"comment-29504","author":"Yannick Clément","site":"shroudstory"},{"title":"A Committee Far Removed from Padua","post":"Peer review just means that the paper can be taken into consideration, not that what is stated in gospel truth, but, of course, it is always helpful to get a paper published in a good peer-reviewed journal. So we will have to wait, not forgetting that sometimes some Shroud research would never published in a peer-reviewed journal and found its way to SSI.\nThis situation was foreseen around two months ago, before the book was published, and prompted by Professor Barberis’ statements as published by Vatican Insider – La Stampa, and attempts to remedy the situation were met with silence.\n\n","date":"April 5, 2013 at 12:01 pm","url":"https://shroudstory.com/2013/04/05/a-committee-far-removed-from-padua/","cat":"news_&_views","id":"comment-29506","author":"Louis","site":"shroudstory"},{"title":"A Committee Far Removed from Padua","post":"The “Jesterof” comment on peer review politics that they are “dirty, unreliable and full of lies and personal vendettas” may well be true. I suspect that the reasons for this may be that much of research has to do with the underlying agenda of promoting new products for profit. In the case of scientific research on a religious relic such as the Shroud, the only product to sell is a philosophical stand-point, either the religious agenda that the object is authentic (Fanti’s position), or the agnostic viewpoint that all such relics are necssarily bogus. There are few with the integrity who can put their personal viewpoint in their back-pocket as Yannick might express it. It seems to be an unfortunate fact of the human condition and will continue to be the bane of those seeking the truth about this remarkable object. \nThe Rinaldi review of Fanti’s book is an excellent piece of work. The hypothesis that cellulose will degrade over time has much appeal and would in principle seem to be a rational proposition.  It may be significant that the original unmodified date placed an age on the TS fibre of 752 BC (+/-400 years). This must raise a serious doubt on the allegation that it is medieval, irrespective of the actual site source  of the fibre. The fact that anything on the Shroud can be attributed with such an age has to be significant. However it is also clear that there are many unsatisfactory or at least unknown aspects to the work, questions on the provenance of the fibre, the agenda-driven nature of the research, and some of the wilder assumptions made. I would add the inclusion of the Peruvian sample in deriving the calibration curve when it is known that South American flax is unrelated to Old World species. The variations in the individual histories of the fabrics would seem to have resulted in a wide scatter in deriving the calibration curve. \nDespite all these reservations, Fanti may well have hit on something worthwhile pursuing further. If ever there is further scientific work to be carried out on the TS at sometime in the future then this set of experiments should be included in the programme. At least it may give better results than the C14 tests that Gabriel has often queried as worthwhile on this type of object.\n\n","date":"April 5, 2013 at 4:30 pm","url":"https://shroudstory.com/2013/04/05/a-committee-far-removed-from-padua/","cat":"news_&_views","id":"comment-29535","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Committee Far Removed from Padua","post":"I don’t think Rinaldi’s review is quite clear on this point. The three dates quoted refer to the three basic methods of investigation; thus 300BC for the FT-IR, 200BC for Raman, and 400AD for the mechanical. Rinaldi’s whole critique is based on the fact that shroud fragments sucked out with a vacuum cleaner are likely to be more degraded, and thus give an apparently older age for the shroud than it really is. However he does not say what Fanti’s mechanical tests were (and the press released mentioned “a set of mechanical parameters”) or how they were calibrated to achieve the single date; and he (Rinaldi) does not discuss the spectrographic results at all, which presumably postulate chemical rather than physical degradation.\nGiven the almost universal derision which Fanti’s book has received, I fear the chances of it being published in English are getting remoter by the minute, which I think is a pity. I have had to order an Italian copy, and my Italian is primitive in the extreme. No doubt it will improve…\n\n","date":"April 5, 2013 at 5:18 pm","url":"https://shroudstory.com/2013/04/05/a-committee-far-removed-from-padua/","cat":"news_&_views","id":"comment-29540","author":"Hugh Farey","site":"shroudstory"},{"title":"A Committee Far Removed from Padua","post":"\nGiorgio :\nWell said “Jesterof”.\n\nThank you. You clearly “been there, done that “:)\n\n","date":"April 5, 2013 at 5:25 pm","url":"https://shroudstory.com/2013/04/05/a-committee-far-removed-from-padua/","cat":"news_&_views","id":"comment-29545","author":"jesterof","site":"shroudstory"},{"title":"A Committee Far Removed from Padua","post":"Hugh, the mechanical tests have been done with fibers under tension. The parameters were: breaking load, an elastic modulus (two methods), a loss factor (two methods). The five results are not given in the book as numerical figures but are only represented in a graphic diagram. Approximately, from the diagram one can guess that the five intervals are: 190AD-810AD, 340BC-360AD, 90BC-990AD, 760BC-300BC, 220AD-940AD. Supposedly the intervals are at the 95% confidence level but this is not explicitly stated. The respective means would be: 500AD, 10AD, 450AD, 530BC, 580AD. Thus the means are widely scattered. Averaging these results, Fanti finds a final result at 400AD +/-400. He does not describe his method for calculating the average.\nThe spectroscopic tests measure chemical (or chemico-physical) alterations in the structure of the fiber but for full details we have to await the publication of a technical report.\nPS: Hugh, thank you for the translation!\n\n","date":"April 5, 2013 at 11:20 pm","url":"https://shroudstory.com/2013/04/05/a-committee-far-removed-from-padua/","cat":"news_&_views","id":"comment-29585","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"A Committee Far Removed from Padua","post":"Curiouser and curiouser. The average of the five means gives a date of 200AD. Maybe he discarded the BC outlier…\n\n","date":"April 6, 2013 at 5:14 am","url":"https://shroudstory.com/2013/04/05/a-committee-far-removed-from-padua/","cat":"news_&_views","id":"comment-29604","author":"Hugh Farey","site":"shroudstory"},{"title":"A Committee Far Removed from Padua","post":"I recall two brilliant professors of mechanical engineering during my early training in Auckland NZ around 1960. One had trained in Birmingham UK, the other at MIT. Fanti may be a competent experimentalist, but neither of those of my acquaintance would have been so lax in their presentation of results, nor would they have been so assertive in supporting any theory with such a wide scatter. Despite the pre-1000 AD ages obtained, I fear that the results when closely examined will persuade no competent reviewer.\n\n","date":"April 6, 2013 at 12:20 am","url":"https://shroudstory.com/2013/04/05/a-committee-far-removed-from-padua/","cat":"news_&_views","id":"comment-29587","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Committee Far Removed from Padua","post":"Dave,  are we throwing out the baby with the bathwater?  Perhaps Fanti’s 95% confidence may be overstated but on the face of it, he has provided yet another basis to question the carbon date.  The Hungarian Pray Manuscript proves conclusively that the Shroud was in Constantinople prior to 1204 and thereby proves the carbon date is wrong….couldn’t possibly be from 1260 to 1390.  In fact the artist who crafted the HPM was an eye witness to the cloth in Constantinople somewhere between 1160-1170…one hundred years older than the oldest carbon date.  So we know the carbon date is wrong.  How wrong?  No one knows.  Fanti adds physical evidence to the argument.  Rogers decay of vanillin also supports on older date.  Is it first century?  We will need another carbon date to know that.\n\n","date":"April 6, 2013 at 8:06 am","url":"https://shroudstory.com/2013/04/05/a-committee-far-removed-from-padua/","cat":"news_&_views","id":"comment-29622","author":"Russ Breault","site":"shroudstory"},{"title":"A Committee Far Removed from Padua","post":"Russ, I am afraid I don’ t agree with you. I think a new C14 test can be the end of any  serious attempt to  analyze the Shroud. It just won’t work.\nSomeone mentioned here that he Archbishop is considering a new radiocarbon test. I hope they don’t do so, because in this last year, new evidences -after many previous ones- have arisen on the unappropiateness of C14, in general and more particularly in the case of the Shroud.\nAmong the last ones, in my view, the identification of a trend with solid statistical techniques and published in a serious JCR peer-reviewed journal is by far the most relevant. By the way, to be fair, coauthored by Fanti. The connection with the C14 test comes when we see the UV images of the sample area after a PCA analysis, as described in the paper by Morgan of last summer.\nThe PC’s in a PCA usually describe a mechanism that is not detectable at first sight. If in this paper we have a look at the first PC image  (UV) of the area, we can easily distinguish a gradient due to an unknown mechanism operating. This mechanism could simply be associated to the different degrees of handling, rubbing, and touching by millions of hands throughout the centuries. But the point is that this photo was taken (by Barrrie, I think) before the C14 test of 1988 and in it a gradient can be easily detected. Now, almost 30 years after the photo was taken, the same gradient is detected in the form of a trend in the C14 counts of the sample!!\nThis implies that whatever the mechanism responsible of the gradient was (most probably some sort of biocontamination) it could not be removed from the sample, and reappeared again in the form of a trend when C14 atoms were counted. Please note, that this would  be compatible with a medieval reweaving and also that in the most recent general literature on C14 we have largely commented here, the major problems in all cases are associated to similar problems: low effective methods of removing contamination of  any type prior the test. I do not know if this limitation will ever be overcome, but currently it is not, so highly contaminated objects like the Shroud cannot be appropiately dated with this technique.\nGiven this fact, I think it is time to move towards other approaches in Shroud research but always following truly scientific protocols and methodologies like peer-review and traceable chain of custody.\n\n","date":"April 6, 2013 at 9:36 am","url":"https://shroudstory.com/2013/04/05/a-committee-far-removed-from-padua/","cat":"news_&_views","id":"comment-29637","author":"Gabriel","site":"shroudstory"},{"title":"A Committee Far Removed from Padua","post":"Russ, we are not throwing out the baby with the bathwater. We are throwing out cold bathwater to save the baby. Bad science and bad history are distractions. Worse, by association, they tarnish the overall picture of shroud research – – coins on the eyes, sponges, nails, dice, all those flower images, you name it – – lettering in three languages – – Kouznetsov, Frale – – you know what I mean. Who has the courage to ask Fanti to answer some of our comments here? If he just sits back and only publishes a paper in a dubious journal after all the splash he made we’ll pay.\n\n","date":"April 6, 2013 at 9:32 am","url":"https://shroudstory.com/2013/04/05/a-committee-far-removed-from-padua/","cat":"news_&_views","id":"comment-29634","author":"Paulette","site":"shroudstory"},{"title":"A Committee Far Removed from Padua","post":"Paulette, see the last sentence in #8, which means I did try. You are absolutely right in pointing out that the overall picture of Shroud research will be tarnished. Perhaps this is the result of the lack of ego bashing in the realm of Shroud studies, which has led to little cooperation, and prompted Benedict XVI to say that he was aware about what has gone on, in his statement as read out by Bishop Kevin Vann, of Forth Worth, Texas during the last Shroud conference in Dallas. Why, then, should we be surprised that it is the papal custodian who decides — obviously with the pontiff’s approval — about what is right and what is wrong in what was once correctly described by one prominent Shroudie as a minefield.\n\n","date":"April 6, 2013 at 10:51 am","url":"https://shroudstory.com/2013/04/05/a-committee-far-removed-from-padua/","cat":"news_&_views","id":"comment-29655","author":"Louis","site":"shroudstory"},{"title":"A Committee Far Removed from Padua","post":"Daveb: “mechanical engineering”; Russ B: “Dave, are we throwing out the baby with the bathwater?”; Paulette: “We are throwing out cold bathwater to save the baby.” \n‘Materials Science’ is a standard discipline within most engineering departments, particularly in ‘mechanical engineering’. I recall a contemporary who obtained his doctorate in an aspect of the subject in Auckland.  Prof Fanti has attempted to apply the methods of ‘Materials Science’ to a single minuscule fibre of the TS. However linen is a particularly variable material, see the article on Linen even in Wiki. Not only will its properties vary between different cloths obtained from different processing methods, but also between fibres within the same cloth, more so I would expect in ancient cloths because of hand processing, spinning etc. Fibres are extremely brittle, inelastic, will not stretch, and with frequent folding be inclined to break. Its softness increases with frequent washing. The different histories of individual cloths even from the same batch will increase the variability of their properties, so that these cloths from the same batch end up with different properties. \nWith this inherent variability, it is hardly surprising that Prof Fanti finds that there are large variabilities and scatter in his calibration curves.  To then make an assertion about the age of the TS based on one single solitary fibre is going beyond what I think is good science.  It is compounding the errors made in the lack of proper sampling protocols in the C14 fiasco. \nProviding that adequate sampling protocols have been followed in deriving the calibration curves, it may be possible to obtain a credible range for the age of the TS, but only if an adequate number of proper samples are tested from the TS.  However because of the inherent variability of linen cloths, their history and so on, a large error in any confidence interval would seem unavoidable in any age assessment.  In my view the present case has to fail to persuade because sampling of an extremely variable material was inadequate.\n\n","date":"April 6, 2013 at 5:01 pm","url":"https://shroudstory.com/2013/04/05/a-committee-far-removed-from-padua/","cat":"news_&_views","id":"comment-29679","author":"daveb of wellington nz","site":"shroudstory"}]
