[{"title":"Another Jesus Survived the Cross Legend: Another Tomb, of Course","post":"This is pretty funny to see on which day Dan post this news !  Here’s what the Catholic Church propose us to read for today :\nFirst letter of St Paul to the Corinthians 1:17-25 \n17 After all, Christ sent me not to baptise, but to preach the gospel; and not by means of wisdom of language, wise words which would make the cross of Christ pointless.\n18 The message of the cross is folly for those who are on the way to ruin, but for those of us who are on the road to salvation it is the power of God.\n19 As scripture says: I am going to destroy the wisdom of the wise and bring to nothing the understanding of any who understand.\n20 Where are the philosophers? Where are the experts? And where are the debaters of this age? Do you not see how God has shown up human wisdom as folly?\n21 Since in the wisdom of God the world was unable to recognise God through wisdom, it was God’s own pleasure to save believers through the folly of the gospel.\n22 While the Jews demand miracles and the Greeks look for wisdom,\n23 we are preaching a crucified Christ: to the Jews an obstacle they cannot get over, to the gentiles foolishness,\n24 but to those who have been called, whether they are Jews or Greeks, a Christ who is both the power of God and the wisdom of God.\n25 God’s folly is wiser than human wisdom, and God’s weakness is stronger than human strength. \nFrom all time (even in the first century), there were tons of people to reject the idea that a Messiah (and the Son of God) could be killed on the cross like the worst criminal that ever lived…\nI don’t have anything more to add about that !!!\n\n","date":"August 31, 2012 at 4:14 pm","url":"https://shroudstory.com/2012/08/31/another-jesus-survived-the-cross-legend-another-tomb-of-course/","cat":"news_&_views","id":"comment-15661","author":"Yannick Clément","site":"shroudstory"},{"title":"Another Jesus Survived the Cross Legend: Another Tomb, of Course","post":"The Japanese have always been great imitators of western culture and products, ever since Frank Gilbreth, the founder of work study methods, tutored Japanese entrepreneurs in these in the 1920s – 1930s, even more so since WWII.  First ball-point pens, cigarette lighters, then the automobile industry, latterly in electronics, and now religion!  \nFrancis Xavier first entered Kagoshima port in 1549, and found the people there hospitable to Christianity, but later 17th century persecutions extinguished this candle.\n\n","date":"August 31, 2012 at 5:25 pm","url":"https://shroudstory.com/2012/08/31/another-jesus-survived-the-cross-legend-another-tomb-of-course/","cat":"news_&_views","id":"comment-15664","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Another Jesus Survived the Cross Legend: Another Tomb, of Course","post":"One thing’s for sure :  Asiatic culture is a complete different world than our Western civilisation and for some reason, the message of Christ don’t seem to reach the heart of most people there.  I’m not sure why.  After all, they are humans no ?\n\n","date":"August 31, 2012 at 5:47 pm","url":"https://shroudstory.com/2012/08/31/another-jesus-survived-the-cross-legend-another-tomb-of-course/","cat":"news_&_views","id":"comment-15665","author":"Yannick Clément","site":"shroudstory"},{"title":"Another Jesus Survived the Cross Legend: Another Tomb, of Course","post":"Francis Xavier had considerable success in India, particularly in the south.  We have several Immigrants from India and Malaysia in our local parish in Wellington and elsewhere.  Some of them trace their Christianity back to the missionary efforts of St Thomas the apostle.  Xavier was particularly enlightened in his missionary efforts. He is justly credited for his idea that the missionary must adapt to the customs and language of the people he evangelizes, and for his advocation of an educated native clergy—initiatives not always followed by his successors.  His poverty that had so won the Paravas and Malays often repelled the Japanese, so he abandoned it for studied display when this was called for.  \nThere are now lively Christian communities in Japan and South Korea.  We have had Korean seminarians staying in some of our NZ parishes.  The church in China is a vexed question, essentially two Catholic churches, the state-sponsored one, excommunicated from Rome, and an underground church which is in communion.  Relations between the Chinese government and the Vatican remain somewhat strained.  There are tensions between Hindus and Christians in India.  A major obstacle to Christian missionary work in eastern countries is Islam.  A Moslem who converts to Christianity is likely to be persecuted and even martyred, even in Pakistan.  The state of the church in North Korea, is completely unknown, because of its oppressive government.\n\n","date":"August 31, 2012 at 7:00 pm","url":"https://shroudstory.com/2012/08/31/another-jesus-survived-the-cross-legend-another-tomb-of-course/","cat":"news_&_views","id":"comment-15669","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Another Jesus Survived the Cross Legend: Another Tomb, of Course","post":"Hatred of Christianity is spreading and was the topic of a recent statement by Benedict XVI, in fact one Shroud enthusiast also mentioned this trend in a fairly recent post on this blog. To know the extent of the damage,the best source is www. persecution.org\n\n","date":"September 1, 2012 at 8:27 am","url":"https://shroudstory.com/2012/08/31/another-jesus-survived-the-cross-legend-another-tomb-of-course/","cat":"news_&_views","id":"comment-15685","author":"Louis","site":"shroudstory"},{"title":"Another Jesus Survived the Cross Legend: Another Tomb, of Course","post":"Great story except there’s no evidence supporting it and a plethora of evidence supporting the Christian story.\n\n","date":"September 1, 2012 at 9:56 am","url":"https://shroudstory.com/2012/08/31/another-jesus-survived-the-cross-legend-another-tomb-of-course/","cat":"news_&_views","id":"comment-15687","author":"Andy Weiss","site":"shroudstory"},{"title":"Another Jesus Survived the Cross Legend: Another Tomb, of Course","post":"With imagination my friend, anyone can come up with anything regarding Jesus Christ !!!  This Japanese story is just one among many other craps regarding the story of Jesus.\n\n","date":"September 1, 2012 at 6:06 pm","url":"https://shroudstory.com/2012/08/31/another-jesus-survived-the-cross-legend-another-tomb-of-course/","cat":"news_&_views","id":"comment-15700","author":"Yannick Clément","site":"shroudstory"},{"title":"Another Jesus Survived the Cross Legend: Another Tomb, of Course","post":"I think it is wrong to call such stories crap!  It is a modern western trait to see stories as literally true or patently false,  I’ll blame the Protestant Reformation and the biblical literalists.  There is a reason for stories, and they all contain a truth which our western culture often hides from us.  Thus there are truths to be found in the stories of the Grimm Brothers and in Hans Christiaan Andersen.  Would YC condemn the book of Genesis because the story of Creation does not conform to what we now know through palaeontology?  It is called the making of myths, all cultures practice it.  It helps to explain their understanding of the world about them and their relationships with others.  The making of modern American myths is every bit as prevalent as it ever has been elsewhere.  For example they have myths about their financial systems, freedom and democracy, and like others elsewhere are extremely hurt and indignant if outsiders dare to question these myths.\nWhen I was a child, I believed in Santa Claus;  By the time I reached my teens I of course no longer believed in Santa Claus;  In my 30s, I found I had to play the part of Santa Claus.  In my 60s, I looked like Santa Claus.  Now in my 70s, I realise I actually am Santa Claus.  It will come to all of you one day!\n\n","date":"September 2, 2012 at 2:14 am","url":"https://shroudstory.com/2012/08/31/another-jesus-survived-the-cross-legend-another-tomb-of-course/","cat":"news_&_views","id":"comment-15712","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Another Jesus Survived the Cross Legend: Another Tomb, of Course","post":"If you want to believe there one bit of truth in this Japanese story of Jesus, that’s your freedom Dave.  Personally, I will still call this “crap” on the historical level.  That’s what I ment by using the word “crap”.  I didn’t pretend that there could not be some good message hidden behind this story, but on the historical level, this is pure fantasy.\nAnd for the Genesis, this is clearly a legendary kind of text (influenced by the exil of the Jews in Babylon).  I seriously doubt that there could be many historical truths in it, but that doesn’t mean the profound spiritual messages that lies under the stories and characters we found in that book are no good…  That’s the role of legends to deliever a profound message hidden behind the words.\n\n","date":"September 2, 2012 at 6:40 pm","url":"https://shroudstory.com/2012/08/31/another-jesus-survived-the-cross-legend-another-tomb-of-course/","cat":"news_&_views","id":"comment-15748","author":"Yannick Clément","site":"shroudstory"}]
