[{"title":"The most intelligent thing anyone can say with regards to the shroud is, \"I don’t know.\"","post":"I rather regret now that I did not challenge folk on this and other “open-minded” sites to explain how I produced a sepia image on cotton spelling the word TURIN and, until getting the correct one, maintaining it was done in my own living room by supernatural means…\nTURIN\nI suspect I would have had a long wait before anyone suggested the use of a temporary, removable ‘thermo-sensitizing’ substance…  yet it was simple technology that was available to medieval hoaxsters (no ultraviolet radiation needed – or any other mysterious flashes of high-energy radiation, ENSA Italians please note!)\n\n","date":"January 28, 2012 at 7:15 am","url":"https://shroudstory.com/2012/01/28/the-most-intelligent-thing-anyone-can-say-with-regards-to-the-shroud-is-i-dont-know/","cat":"news_&_views","id":"comment-7624","author":"sciencebod","site":"shroudstory"},{"title":"The most intelligent thing anyone can say with regards to the shroud is, \"I don’t know.\"","post":"Correction: ENEA:\nItaly’s National Agency for New Technologies, Energy and Sustainable Development \naka: Entertaining New Experimental Applications  ;-)\n\n","date":"January 28, 2012 at 8:51 am","url":"https://shroudstory.com/2012/01/28/the-most-intelligent-thing-anyone-can-say-with-regards-to-the-shroud-is-i-dont-know/","cat":"news_&_views","id":"comment-7625","author":"sciencebod","site":"shroudstory"},{"title":"The most intelligent thing anyone can say with regards to the shroud is, \"I don’t know.\"","post":"Hey Bod, maybe you should send your sepia image in for ‘peer-review’…Let’s find out if it’s just another school-boy experiment, or the real thing. Meaning, lets see if it passes all the ‘intricacies’ of the actual Shroud image before you go putting down real scientists, okay?\nOh and better redu the experiment on linen this time not cotton and preferably a linen made to the same methods as the Shroud linen ;-)\nR\n\n","date":"January 28, 2012 at 12:58 pm","url":"https://shroudstory.com/2012/01/28/the-most-intelligent-thing-anyone-can-say-with-regards-to-the-shroud-is-i-dont-know/","cat":"news_&_views","id":"comment-7632","author":"Ron","site":"shroudstory"},{"title":"The most intelligent thing anyone can say with regards to the shroud is, \"I don’t know.\"","post":"So how long did it take you to compose your latest putdown, Ron? Maybe your time would be better spent in learning the difference between science – with its underpinning principles –  and the arts&crafts with their empirical techniques. There is a difference you know…\nI may get back later with a checklist of essential features that would need to be reproduced, at least where the image is concerned (the ancillary details – blood etc are probably best dealt with separately).\nI know nothing of the previous work of those Italian scientists. Their comic book approach to the Shroud gives me little incentive to explore further.\n\n","date":"January 28, 2012 at 1:23 pm","url":"https://shroudstory.com/2012/01/28/the-most-intelligent-thing-anyone-can-say-with-regards-to-the-shroud-is-i-dont-know/","cat":"news_&_views","id":"comment-7634","author":"sciencebod","site":"shroudstory"},{"title":"The most intelligent thing anyone can say with regards to the shroud is, \"I don’t know.\"","post":"It didn’t take me but a moment actually bod. What’s wrong, Did I hit a nerve? Actually you have allot of nerve complaining when all you do is put down anything and everything you can about the Shroud or what real scientists have found through proper scientific studies. I also think you are the one who needs a lesson in the difference between science and arts&crafts. You’ve shown so much in your ‘experiments’ anyways…..I’m expecting to see a stick man version of the shroud from you soon, please don’t  disappoint  ;-)\nR\n\n","date":"January 28, 2012 at 1:41 pm","url":"https://shroudstory.com/2012/01/28/the-most-intelligent-thing-anyone-can-say-with-regards-to-the-shroud-is-i-dont-know/","cat":"news_&_views","id":"comment-7635","author":"Ron","site":"shroudstory"},{"title":"The most intelligent thing anyone can say with regards to the shroud is, \"I don’t know.\"","post":"Science rarely gets going until one has framed a working hypothesis that one can then put to the test, systematically with rigorous control of varibales.That’s why scientists prefer simplified model systems to start with – ones that others can repeat – the details can come.\nMy working hypothesis is that the Shroud was produced in the 14th century or thereabouts by non-supernatural means. So what you may see as “putting down anything and everything you can about the Shroud” is merely an attempt on my part to remain rational and objective about the nature of the imaging process etc, and not be seduced into thinking, for instance, that “encoded 3D information” is anything mysterious (recalling that the 1532 burn marks also show the same “encoded 3D information”).\nYour suggestion that my scorch experiment with the thermo-sensitizer and radiant heat (which incidentally I don’t think was employed to produce the Shroud, but still makes a point – that an image can be painted on without leaving brushmarks, indeed leaving nothing except a scorch) needs peer review is redundant. I have shownstep-by-step photographs showing how it was done which anyone can reproduce in their homes. As for your “schoolboy experiment” dig, you may be interested to know that I predicted the outcome before designing the experiment – based on the scientific premise that a painted-on black pigment would selectively absorb heat and light rays to produce scorching of the cloth restricted to the painted area. How many schoolboys do you know who could have designed that experiment and achieved a positive result that confirmed the prediction?\nNo, you don’t touch nerves, Ron, raw or otherwise, but your blogging modus operandi with its corrosive drip drip of derisive putdowns leaves me as usual somehat despairing of the internet and the responses it elicits… But I never the allow the Rons of the internet to get me down…\nGrandaughter is on the phone. Time to sign off. Apols for any types (not proofread).\n\n","date":"January 28, 2012 at 2:01 pm","url":"https://shroudstory.com/2012/01/28/the-most-intelligent-thing-anyone-can-say-with-regards-to-the-shroud-is-i-dont-know/","cat":"news_&_views","id":"comment-7638","author":"sciencebod","site":"shroudstory"},{"title":"The most intelligent thing anyone can say with regards to the shroud is, \"I don’t know.\"","post":"I was flabbergasted to see Sciencebod write that, “At the end of the day, it’s just a blog – not a submission to Nature journal…” In a blog, certainly, mistakes in grammar, spelling and citation formatting are excusable. But does he imagine that a medium of lower stature justifies intellectual sloppiness? Sciencebod criticizes newspapers for the poor quality of science reporting, then does it himself. In trying to justify his behavior he shows us that he knows better. He did say, after all, “If some find it provocative, OK, but then I find a lot of what i read in the papers on the matter of the Shroud provocative, like those publicity-seeking Italians with their high-energy lasers speculating on supernatural processes…” \nIn the two or three weeks that Sciencebod has been writing about the shroud he has demonstrated only one thing: It is possible for a careless scientist to speak out both sides of his mouth at the same time.\n\n","date":"January 28, 2012 at 1:56 pm","url":"https://shroudstory.com/2012/01/28/the-most-intelligent-thing-anyone-can-say-with-regards-to-the-shroud-is-i-dont-know/","cat":"news_&_views","id":"comment-7636","author":"Paulette","site":"shroudstory"},{"title":"The most intelligent thing anyone can say with regards to the shroud is, \"I don’t know.\"","post":"that would be “speak out of both sides of his mouth…”\n\n","date":"January 28, 2012 at 1:58 pm","url":"https://shroudstory.com/2012/01/28/the-most-intelligent-thing-anyone-can-say-with-regards-to-the-shroud-is-i-dont-know/","cat":"news_&_views","id":"comment-7637","author":"Paulette","site":"shroudstory"},{"title":"The most intelligent thing anyone can say with regards to the shroud is, \"I don’t know.\"","post":"Yet more ad hom from Paulette that on this occasion will be ignored…\n\n","date":"January 28, 2012 at 2:13 pm","url":"https://shroudstory.com/2012/01/28/the-most-intelligent-thing-anyone-can-say-with-regards-to-the-shroud-is-i-dont-know/","cat":"news_&_views","id":"comment-7639","author":"sciencebod","site":"shroudstory"},{"title":"The most intelligent thing anyone can say with regards to the shroud is, \"I don’t know.\"","post":"Excellent post, Dan. I like Buck’s last line about not knowing and admitting it. It’s OK to not know and to be curious and even to wonder. I think one day we will reach the end of what can be known about the shroud scientifically and beyond that each person, for themselves, has to assign meaning to it.\n\n","date":"January 28, 2012 at 2:54 pm","url":"https://shroudstory.com/2012/01/28/the-most-intelligent-thing-anyone-can-say-with-regards-to-the-shroud-is-i-dont-know/","cat":"news_&_views","id":"comment-7641","author":"Chris","site":"shroudstory"},{"title":"The most intelligent thing anyone can say with regards to the shroud is, \"I don’t know.\"","post":"\nsciencebod :Science rarely gets going until one has framed a working hypothesis that one can then put to the test, systematically with rigorous control of varibales.That’s why scientists prefer simplified model systems to start with – ones that others can repeat – the details can come.\nMy working hypothesis is that the Shroud was produced in the 14th century or thereabouts by non-supernatural means. So what you may see as “putting down anything and everything you can about the Shroud” is merely an attempt on my part to remain rational and objective about the nature of the imaging process etc, and not be seduced into thinking, for instance, that “encoded 3D information” is anything mysterious (recalling that the 1532 burn marks also show the same “encoded 3D information”).\nYour suggestion that my scorch experiment with the thermo-sensitizer and radiant heat (which incidentally I don’t think was employed to produce the Shroud, but still makes a point – that an image can be painted on without leaving brushmarks, indeed leaving nothing except a scorch) needs peer review is redundant. I have shownstep-by-step photographs showing how it was done which anyone can reproduce in their homes. As for your “schoolboy experiment” dig, you may be interested to know that I predicted the outcome before designing the experiment – based on the scientific premise that a painted-on black pigment would selectively absorb heat and light rays to produce scorching of the cloth restricted to the painted area. How many schoolboys do you know who could have designed that experiment and achieved a positive result that confirmed the prediction?\nNo, you don’t touch nerves, Ron, raw or otherwise, but your blogging modus operandi with its corrosive drip drip of derisive putdowns leaves me as usual somehat despairing of the internet and the responses it elicits… But I never the allow the Rons of the internet to get me down…\nGrandaughter is on the phone. Time to sign off. Apols for any types (not proofread).\nWell I’m glad I didn’t affect you in anyway, but for your insistence on carrying on this conversation, I must respond…You put ME down as being somewhat of a “corrosive addition” to the internet, yet I am doing no different then you in a sense! Actually I don’t think I’m being corrosive, just defending the facts, if you want to call that corrosive, so be it. Have you not put down several (teams) of scientists over the past so many days?  From my ‘laymans’ understanding, a scientist would not dare to put down another’s work (hypothesis) without fully studying all the facts or experimenting with all the ‘variables’ of each hypothesis or details of, before doing so. You unfortunitely have done neither!! Yet you accuse others of a “comic book approach”\n Your problem with understanding the ‘difference’ between the fire marks and the Shroud image issuing a 3d encoding is an example. You haven’t looked at all the pertinent evidence. There is a difference in ‘properties’ between the image markings and the scourge markings left by the fire! You know that don’t you? Remember what you said about being rational and objective?…Well I think you should adopt your own words.\nR\n\n","date":"January 28, 2012 at 3:39 pm","url":"https://shroudstory.com/2012/01/28/the-most-intelligent-thing-anyone-can-say-with-regards-to-the-shroud-is-i-dont-know/","cat":"news_&_views","id":"comment-7644","author":"Ron","site":"shroudstory"},{"title":"The most intelligent thing anyone can say with regards to the shroud is, \"I don’t know.\"","post":"Oh and good luck with your working hypothesis….and let us know when you’ve concluded it.\nR\n\n","date":"January 28, 2012 at 3:49 pm","url":"https://shroudstory.com/2012/01/28/the-most-intelligent-thing-anyone-can-say-with-regards-to-the-shroud-is-i-dont-know/","cat":"news_&_views","id":"comment-7645","author":"Ron","site":"shroudstory"},{"title":"The most intelligent thing anyone can say with regards to the shroud is, \"I don’t know.\"","post":"Ron – you don’t seem able to separate essential from non-essential detail. If you can’t bring yourself to do that, then you are not cut out for research (but then few people are said he immodestly ;-) – you would get hopelessly bogged down.\nGoodnight\n\n","date":"January 28, 2012 at 3:57 pm","url":"https://shroudstory.com/2012/01/28/the-most-intelligent-thing-anyone-can-say-with-regards-to-the-shroud-is-i-dont-know/","cat":"news_&_views","id":"comment-7646","author":"sciencebod","site":"shroudstory"},{"title":"The most intelligent thing anyone can say with regards to the shroud is, \"I don’t know.\"","post":"On the contrary; I believe, there are no “non-essential” details to the Shroud. Unfortunately you have not considered this, that is your error in judgement. Also it just makes sense, that in the process of ANY investigation; to simply apply the notion that ‘one’ attribute may be essential and another is not, (especially early in the game), is a detriment to the proper course of study!….This could and will, in many cases lead to erroneous conclusions….imho\nR\n\n","date":"January 29, 2012 at 9:52 am","url":"https://shroudstory.com/2012/01/28/the-most-intelligent-thing-anyone-can-say-with-regards-to-the-shroud-is-i-dont-know/","cat":"news_&_views","id":"comment-7658","author":"Ron","site":"shroudstory"},{"title":"The most intelligent thing anyone can say with regards to the shroud is, \"I don’t know.\"","post":"I don’t understand what most of you are talking about.. or should I say: griping about. Seems to be mostly a conflict between “regulars.”  \nI do like the post from Buck in Florida though. Seems like a nice sensible intelligent guy with solid faith and even a dose of wisdom in his perspective.\n\n","date":"January 28, 2012 at 4:31 pm","url":"https://shroudstory.com/2012/01/28/the-most-intelligent-thing-anyone-can-say-with-regards-to-the-shroud-is-i-dont-know/","cat":"news_&_views","id":"comment-7647","author":"AnnieCee","site":"shroudstory"},{"title":"The most intelligent thing anyone can say with regards to the shroud is, \"I don’t know.\"","post":"Guess you haven’t been around for a while Annie! You’ll have to go back about a week or more and do alot of reading to understand what all the talking/griping is about.\nAgree wit you on the Buck from Florida statement.\nR.\n\n","date":"January 28, 2012 at 6:13 pm","url":"https://shroudstory.com/2012/01/28/the-most-intelligent-thing-anyone-can-say-with-regards-to-the-shroud-is-i-dont-know/","cat":"news_&_views","id":"comment-7648","author":"Ron","site":"shroudstory"},{"title":"The most intelligent thing anyone can say with regards to the shroud is, \"I don’t know.\"","post":"The problem with skeptics is that they don’t really understand the distinction between their approach and “critical thinking”.  The process involves making a hypothesis, designing and carrying out a test, and only after that making your judgment call.  The skeptic instead makes his judgment call first, rejects any tests that confound him, and only accepts those that match his first call.  \nIt’s painfully obvious that sciencebod (and others of his ilk), either knows very little about the Shroud, and the work that has been done on it, or else if he does know, he just simply rejects whatever evidence does not match his own pre-judgment of skepticism.  This should not be confused with the scientific approach, which is rather more disclipined than he can seem to imagine.  \nHowever it is consistent with the subjective Post-modernism of Jaques Derrida and Michel Foucault, two French clowns whose influence on 20th century Western philosophy, social thinking, and the liberal arts, has been unduly influential and generally disastrous to any kind of rational thought in the present age.\n\n","date":"January 29, 2012 at 6:42 am","url":"https://shroudstory.com/2012/01/28/the-most-intelligent-thing-anyone-can-say-with-regards-to-the-shroud-is-i-dont-know/","cat":"news_&_views","id":"comment-7654","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"The most intelligent thing anyone can say with regards to the shroud is, \"I don’t know.\"","post":"Sciencebod, you have very active friends in Spain. They are putting under very heavy fire the next International Conference on the Shroud in Valencia. Here is one example but there are more in Spanish journals\nhttp://www.elmundo.es/blogs/elmundo/desde_el_mas_alla/2012/01/29/pseudociencia-universitaria.html\nOne of their statements is that one of the speakers (Ian Wilson) has for a long time, falsely claimed that he was a professor at Oxford University and since this conference is going to be held at the faculty of medicine and as everybody knows, the Shroud is a forger, it all is a shame for the university and the advance of science.\nFurthermore, since students are granted a couple of credits for attending the conference, they claim that it is even worse.\n\n","date":"January 29, 2012 at 6:57 am","url":"https://shroudstory.com/2012/01/28/the-most-intelligent-thing-anyone-can-say-with-regards-to-the-shroud-is-i-dont-know/","cat":"news_&_views","id":"comment-7655","author":"Gabriel","site":"shroudstory"}]
