[{"title":"The Neutron Conference","post":"It’s usually considered a privilege to have one’s paper accepted onto a conference program(me), and a right for the attendees to address questions to speakers immediately after each presentation. Everything got turned on its head at St.Louis: it was a privilege for attendees to listen to the speakers, and the speakers’ right not to be asked questions. I’m glad I stayed at home (which also helped reduce exposure to those neutrons).\n\n","date":"December 2, 2014 at 3:47 am","url":"https://shroudstory.com/2014/12/02/the-neutron-conference/","cat":"news_&_views","id":"comment-174272","author":"Colin Berry","site":"shroudstory"},{"title":"The Neutron Conference","post":"Barrie…….As usual, we in the Shroud crowd owe you a debt of gratitude for all the time you put in managing shroud.com, as well as the enormous contributions you continually make in the world of sindonology.  A Personal Report on the 2014 St. Louis Conference being just one of them.  Thanks!\n\n","date":"December 2, 2014 at 3:04 pm","url":"https://shroudstory.com/2014/12/02/the-neutron-conference/","cat":"news_&_views","id":"comment-174333","author":"David O.","site":"shroudstory"},{"title":"The Neutron Conference","post":"The congruence reported in the location of calcium deposits found in the sudarium of Oviedo and the shroud seems, to me, more interesting than the neutron madness. Particularly when noting the gap between the reported C14 dates (8th vs. 14th centuries).\n\n","date":"December 2, 2014 at 5:43 pm","url":"https://shroudstory.com/2014/12/02/the-neutron-conference/","cat":"news_&_views","id":"comment-174346","author":"Eric","site":"shroudstory"},{"title":"The Neutron Conference","post":"Barry Schwortz’s report on the 2014 Shroud conference in St. Louise was quoted above as saying “[There was] a presentation on another radiation theory of image formation from Robert Rucker, in this case, claiming neutron radiation released from Jesus’ body during the Resurrection created the image. Naturally, this was well received by some in the audience, but not by everyone.”  Unfortunately, this statement in Barrie’s report was in error.  I used the MCNP nuclear analysis computer code to determine the effect of neutrons released from Jesus’ body on the C-14 dating of the Shroud of Turin and the Sudarium of Oviedo, but I said nothing about the neutrons creating the image.  In fact, I strongly believe that neutrons had nothing to do with formation of the image.  I have discussed this with Barrie, and he has now corrected his statement.  My presentation was titled “MCNP Analysis of Neutrons Released from Jesus’ Body in the Resurrection.”  Both my PowerPoint slides and my narration to them area available at shroud.com or can be located by doing a Google search on the title.\n\n","date":"July 17, 2015 at 3:06 am","url":"https://shroudstory.com/2014/12/02/the-neutron-conference/","cat":"news_&_views","id":"comment-206001","author":"Robert A. Rucker","site":"shroudstory"},{"title":"The Neutron Conference","post":"And I have just posted an email from Robert with the links. See Another Reaction to Ray Rogers’ Paper on Radiation.\nThanks, Bob, you can now post without having to wait for moderation.\n\n","date":"July 17, 2015 at 5:01 am","url":"https://shroudstory.com/2014/12/02/the-neutron-conference/","cat":"news_&_views","id":"comment-206011","author":"Dan","site":"shroudstory"}]
