[{"title":"The Pope and the Tramps","post":"Likely the Times is caught in a time warp, has yet to catch up with the loss of the colonies, the inevitable devolution of Scotland, with Wales to follow, England to be renamed New Asia, a minor appendage to the EEC.  Old Rome had a similar problem with the Goth invasions.  Plus ca change, plus la meme chose!\n\n","date":"June 8, 2015 at 5:15 am","url":"https://shroudstory.com/2015/06/08/the-pope-and-the-tramps/","cat":"2015","id":"comment-201305","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Pope and the Tramps","post":"I was in Turin last week, providentially, and was able to view the Shroud (my first time to do so). It was nice to finally see in person what is our topic of passionate discussion here. I was struck by the rather meager tourist industry presence. Yes, I did see school trips and many other bus loads of pilgrims coming to see the Shroud, but apart from a few souvenir stalls and the official Shroud library presence, the overall environment was one of quiet reflection. Some commenters here have implied that the Church has no interest in retesting the Shroud as it is a relic/cash cow. I’m sure the Shroud when displayed does pump the tourism industry in Turin but this is not Lourdes, Fatima or Medjegorie — the vibe is very much different. As a pilgrimage site it is, like the icon itself, enigmatic.\n\n","date":"June 8, 2015 at 9:36 am","url":"https://shroudstory.com/2015/06/08/the-pope-and-the-tramps/","cat":"2015","id":"comment-201330","author":"David Goulet","site":"shroudstory"},{"title":"The Pope and the Tramps","post":"I have arrived in Turin today (Monday), see the Shroud on Wednesday, and leave on Saturday. Is anyone else who reads this blog here?\n\n","date":"June 8, 2015 at 1:20 pm","url":"https://shroudstory.com/2015/06/08/the-pope-and-the-tramps/","cat":"2015","id":"comment-201343","author":"Hugh Farey","site":"shroudstory"},{"title":"The Pope and the Tramps","post":"We read.\nSimply no one wants to do anything this season.\n(except the own duties we have to  do…)\n\n","date":"June 8, 2015 at 3:32 pm","url":"https://shroudstory.com/2015/06/08/the-pope-and-the-tramps/","cat":"2015","id":"comment-201350","author":"O.K.","site":"shroudstory"},{"title":"The Pope and the Tramps","post":"Off-track, but food for thought for those who want to go deeper into existential topics because quite often there are cases where things are easier said than done:\n http://www.catholicherald.co.uk/commentandblogs/2015/06/15/books-blog-this-is-the-book-which-professor-stephen-hawking-needs-to-read/\n\n","date":"June 15, 2015 at 10:00 am","url":"https://shroudstory.com/2015/06/08/the-pope-and-the-tramps/","cat":"2015","id":"comment-202241","author":"Louis","site":"shroudstory"},{"title":"The Pope and the Tramps","post":"Thank you Louis for the article. I really enjoy reading articles on Parapsycology.\n\n","date":"June 15, 2015 at 5:34 pm","url":"https://shroudstory.com/2015/06/08/the-pope-and-the-tramps/","cat":"2015","id":"comment-202268","author":"Sampath Fernando","site":"shroudstory"},{"title":"The Pope and the Tramps","post":"Hi Sampath\nIt is not really about Parapsychology and has more to do with existential issues. The following link will take you to a paper on Parapsychology:\nhttps://www.academia.edu/4691379/Can_the_Jospice_Mattress_imprint_be_compared_to_the_Image_on_the_Shroud\nI was happy that both Ian Wilson and myself agreed during an interview that the Shroud image formation process had nothing to do with the imprinting process on the mattress.\nTrue Parapsychology is neutral, nothing to do with Spiritualism or magic. That was the reason it did not come under attack from Abraham Thomas Kovoor, who edited the “Ceylon Rationalist Ambassador” and attacked “god-men” in Sri Lanka and India.\n\n","date":"June 15, 2015 at 6:09 pm","url":"https://shroudstory.com/2015/06/08/the-pope-and-the-tramps/","cat":"2015","id":"comment-202273","author":"Louis","site":"shroudstory"},{"title":"The Pope and the Tramps","post":"I think Kovoor’s Father is a Methodist Priest and I was told that at the time of Kovoor’s death he changed his views (I may be wrong).\nHi Louis – image on the shroud is a negative one whereas the image on the Jospice Mattress is a positive one.\n\n","date":"June 15, 2015 at 7:19 pm","url":"https://shroudstory.com/2015/06/08/the-pope-and-the-tramps/","cat":"2015","id":"comment-202277","author":"Sampath Fernando","site":"shroudstory"},{"title":"The Pope and the Tramps","post":"It could be, but he did not reach the level of C.T. K. Chari, who taught at Madras Christian College, and challenged Ian Stevenson, at the University of Virginia, when it came to the reincarnation theories, which he did not approve. Kovoor was more suited to tackle people like Sai Baba.\nAs for the mattress, yes, that is just one difference. It shows something like the Kirlian effect.\n\n","date":"June 15, 2015 at 7:33 pm","url":"https://shroudstory.com/2015/06/08/the-pope-and-the-tramps/","cat":"2015","id":"comment-202281","author":"Louis","site":"shroudstory"}]
