[{"title":"The Questionable Restoration of the Shroud of Turin","post":"It is an interesting video however the laughable part is how he describes the backing cloth, patches and particulate matter removed in 2002 are now available for additional study. Really?  It has been 12 years since the “restoration” and I am not aware of anyone having access or doing any research on these items.\n\n","date":"January 14, 2014 at 9:45 am","url":"https://shroudstory.com/2014/01/14/the-questionable-restoration-of-the-shroud-of-turin/","cat":"news_&_views","id":"comment-73308","author":"Russ Breault","site":"shroudstory"},{"title":"The Questionable Restoration of the Shroud of Turin","post":"Actually, the two recommendations quoted from the commission are 1/ the removal of the holland cloth and the patches and 2/ the change for an argon atmosphere.\nConcerning the pollution of the holland cloth i don’t see what he means, is it a pollution from [inert] “carbonized cellulose” from the original cloth ?!? At least it is the feeling I have listening to his presentation, and since the holland cloth was directly stitched to the back of the shroud, i can’t see what other pollution he would refer to.\n\n","date":"January 14, 2014 at 1:31 pm","url":"https://shroudstory.com/2014/01/14/the-questionable-restoration-of-the-shroud-of-turin/","cat":"news_&_views","id":"comment-73318","author":"anoxie","site":"shroudstory"},{"title":"The Questionable Restoration of the Shroud of Turin","post":"In his last Shroud book Ian Wilson says that the backing cloth was removed because “abrasion from repeated rolling and unrolling of the Shroud over the last four centuries had loosened thousands of sooty particles from the edges of the charred areas beneath the patches.” A “bomb” of soot had formed and had the relic been doused with water during the 1997 fire it would have been disfigured with soot stains.\nHope this helps.\nIW also says that some vestiges of the face were visible on the back side when the Holland cloth was removed. Does this mean that Professors Fanti and Maggiolo were right in their peer-reviewed paper that gained world headlines and why was their contention denied by both Monsignor Giuseppe Ghiberti and Professor Bruno Barberis? Professor Fanti challenged Prof Barberis — see the introduction to the interview-article “Science and religion meet in Shroud research” on the Holy Shroud Guild website — but was met with silence.\n\n","date":"January 14, 2014 at 4:02 pm","url":"https://shroudstory.com/2014/01/14/the-questionable-restoration-of-the-shroud-of-turin/","cat":"news_&_views","id":"comment-73324","author":"Louis","site":"shroudstory"},{"title":"The Questionable Restoration of the Shroud of Turin","post":"Please read “disfigured the Shroud” above\n\n","date":"January 14, 2014 at 4:04 pm","url":"https://shroudstory.com/2014/01/14/the-questionable-restoration-of-the-shroud-of-turin/","cat":"news_&_views","id":"comment-73325","author":"Louis","site":"shroudstory"},{"title":"The Questionable Restoration of the Shroud of Turin","post":"Louis, do you get the sense that some insiders (art curators, researchers) trusted by the Turin authorities have had priviledged access to the Shroud? For example, who identified this soot bomb? It’s not mentioned anywhere else, so it was not obvious to other researchers. It would have to have been identified by someone with both expertise and access to the Shroud. When was that access granted, and to whom?\n\n","date":"January 14, 2014 at 4:33 pm","url":"https://shroudstory.com/2014/01/14/the-questionable-restoration-of-the-shroud-of-turin/","cat":"news_&_views","id":"comment-73329","author":"David Goulet","site":"shroudstory"},{"title":"The Questionable Restoration of the Shroud of Turin","post":"David, who had access was Mme. Mechthild Flury-Lemberg, and I think it was she who advised Turin to remove the cloth. I think it was a good decision as it would have to be done sooner or later, you see? Flury-Lemberg’s decisions had the approval of Pope John Paul II.\n\n","date":"January 14, 2014 at 4:40 pm","url":"https://shroudstory.com/2014/01/14/the-questionable-restoration-of-the-shroud-of-turin/","cat":"news_&_views","id":"comment-73333","author":"Louis","site":"shroudstory"},{"title":"The Questionable Restoration of the Shroud of Turin","post":"Wait a minute, the commission recommended to remove the patches but they didn’t think of the charred material still surrounding the burn holes ? They’ve waited for Dr Flury Lemberg to discover this “bomb” or “pollution” ? They didn’t think of the scientific value of these areas ?\nThis is a farce.\n\n","date":"January 14, 2014 at 5:25 pm","url":"https://shroudstory.com/2014/01/14/the-questionable-restoration-of-the-shroud-of-turin/","cat":"news_&_views","id":"comment-73338","author":"anoxie","site":"shroudstory"},{"title":"The Questionable Restoration of the Shroud of Turin","post":"There is a photo of the back side of the Shroud at http://shroud.wikispaces.com/PROPERTIES. Some aspects of the face of the shroud are visible, mostly the bloodstains, of course, and the photo is not clear enough to show much more. Whether this side of the Shroud has been examined in sufficient detail to establish that some aspects of the image appear on both surfaces of the cloth, but not anywhere on the part of the threads that are not on the surfaces, I cannot say.\n\n","date":"January 14, 2014 at 4:28 pm","url":"https://shroudstory.com/2014/01/14/the-questionable-restoration-of-the-shroud-of-turin/","cat":"news_&_views","id":"comment-73328","author":"Hugh Farey","site":"shroudstory"},{"title":"The Questionable Restoration of the Shroud of Turin","post":"Thanks Hugh, this is the first time I see this image !\n\n","date":"January 14, 2014 at 4:42 pm","url":"https://shroudstory.com/2014/01/14/the-questionable-restoration-of-the-shroud-of-turin/","cat":"news_&_views","id":"comment-73334","author":"Mike M","site":"shroudstory"},{"title":"The Questionable Restoration of the Shroud of Turin","post":"me too.\nIs that the head image on the back of the cloth, or merely the blood?\nThere is some darker shading around the face area but hard to make out without zooming in whether there is image there versus just a darker coloration band. \nI always assumed that the blood was quite superficial but this image implies it soaked the whole way through the cloth. Does this not imply prolonged contact (and soaking through) rather than a quick superficial painting application? I guess the latter might do the same thing if there was enough blood applied via brush or whatever instrument?\n\n","date":"January 14, 2014 at 11:44 pm","url":"https://shroudstory.com/2014/01/14/the-questionable-restoration-of-the-shroud-of-turin/","cat":"news_&_views","id":"comment-73348","author":"Matthias","site":"shroudstory"},{"title":"The Questionable Restoration of the Shroud of Turin","post":"A comparison should be made between the illustrations in the paper by Professors Fanti and Maggiolo and what appears in the link above.\n\n","date":"January 14, 2014 at 4:35 pm","url":"https://shroudstory.com/2014/01/14/the-questionable-restoration-of-the-shroud-of-turin/","cat":"news_&_views","id":"comment-73332","author":"Louis","site":"shroudstory"},{"title":"The Questionable Restoration of the Shroud of Turin","post":"Further to the above, Professor Fanti’s paper was read many years ago and I remember that he said that there was nothing on the part of the threads that are not on the surface, confirming his corona discharge hypothesis.\n\n","date":"January 14, 2014 at 4:54 pm","url":"https://shroudstory.com/2014/01/14/the-questionable-restoration-of-the-shroud-of-turin/","cat":"news_&_views","id":"comment-73335","author":"Louis","site":"shroudstory"},{"title":"The Questionable Restoration of the Shroud of Turin","post":"Professor Giulio Fanti defended his corona discharge hypothesis when queried about in the interview and who is better than those in the field of science to weight the evidence? There are some good illustrations, with texts in Italian and English in another document at the end of the interview and these may also help:\nhttp://holyshroudguild.org/science-and-religion-meet-in-shroud-research.html\n\n","date":"January 14, 2014 at 5:12 pm","url":"https://shroudstory.com/2014/01/14/the-questionable-restoration-of-the-shroud-of-turin/","cat":"news_&_views","id":"comment-73336","author":"Louis","site":"shroudstory"},{"title":"The Questionable Restoration of the Shroud of Turin","post":"\nLouis :David, who had access was Mme. Mechthild Flury-Lemberg, and I think it was she who advised Turin to remove the cloth. I think it was a good decision as it would have to be done sooner or later, you see? Flury-Lemberg’s decisions had the approval of Pope John Paul II.\nIs it the practise of the Turin authorities to act on the recommendation of one researcher? I do hope someone else corroborated Mme flury_Lemberg’s advisement.\n\n","date":"January 14, 2014 at 5:32 pm","url":"https://shroudstory.com/2014/01/14/the-questionable-restoration-of-the-shroud-of-turin/","cat":"news_&_views","id":"comment-73340","author":"David Goulet","site":"shroudstory"},{"title":"The Questionable Restoration of the Shroud of Turin","post":"David, Mme. Mecthild Flury-Lemberg is more than a researcher and if she was chosen by Turin and Rome it is because of her qualifications. She is not even Catholic, she is Lutheran. This does not mean to say that she is infallible, Turin must have consulted other experts, and I think the number of experts present was reduced because of the reasons stated below, in # 14. It is very easy to hurl insults at Turin without looking for the reasons for why they may have adopted this attitude. I think you will get it now.\nhttp://www.shroud.com/pdfs/n65part4.pdf\n\n","date":"January 14, 2014 at 6:22 pm","url":"https://shroudstory.com/2014/01/14/the-questionable-restoration-of-the-shroud-of-turin/","cat":"news_&_views","id":"comment-73342","author":"Louis","site":"shroudstory"},{"title":"The Questionable Restoration of the Shroud of Turin","post":"Anoxie, re #7. Around 1700 photographs were taken during the restoration work, however these are still not available. As far as I know everything that was removed from the Shroud, including the charred material, was stored for scientific study. The big problem is that experts in various fields were not present and mistakes were inevitably made. I think that Turin took the decision to reduce the number of people present because the realm of Shroud studies is a minefield. Did you read the message sent by Pope Benedict XVI and read out by Bishop Kevin Vann of Fort Worth, Texas during the last Dallas Congress? Cooperation is needed and I think shroudstory can contribute to this with comments demonstrating constructive criticism, tips to help Shroud researchers, whether scholars or scientists and even enthusiasts. A new direction is needed.\n\n","date":"January 14, 2014 at 5:46 pm","url":"https://shroudstory.com/2014/01/14/the-questionable-restoration-of-the-shroud-of-turin/","cat":"news_&_views","id":"comment-73341","author":"Louis","site":"shroudstory"},{"title":"The Questionable Restoration of the Shroud of Turin","post":"Meacham’s paper is quite interesting.  We have it in PDF here: http://shroudnm.com/docs/2010-02-24-Shroud-Restoration-Eval.pdf\n\n","date":"January 14, 2014 at 8:26 pm","url":"https://shroudstory.com/2014/01/14/the-questionable-restoration-of-the-shroud-of-turin/","cat":"news_&_views","id":"comment-73345","author":"Andy Weiss","site":"shroudstory"},{"title":"The Questionable Restoration of the Shroud of Turin","post":"If the Shroud is in good condition today it is because of the restoration work. Minor errors were made, which did not justify people hurling insults at Mme.Mechthild Flury-Lemberg – who did not react since she obviously knows about the minefield.\nhttp://www.sindone.org/the_holy_shroud__english_/the_shroud/00024357_The_restoration.html\nThere is another thing worth pondering about: we are all products of different cultures, and there comes a time when we have to think about when we stop being religious and become more cultural.\n\n","date":"January 14, 2014 at 9:02 pm","url":"https://shroudstory.com/2014/01/14/the-questionable-restoration-of-the-shroud-of-turin/","cat":"news_&_views","id":"comment-73346","author":"Louis","site":"shroudstory"},{"title":"The Questionable Restoration of the Shroud of Turin","post":"\nLouis :\nIf the Shroud is in good condition today it is because of the restoration work.\n\nThis is questionable. But what’s done is done.\n\n","date":"January 16, 2014 at 5:07 am","url":"https://shroudstory.com/2014/01/14/the-questionable-restoration-of-the-shroud-of-turin/","cat":"news_&_views","id":"comment-73425","author":"anoxie","site":"shroudstory"},{"title":"The Questionable Restoration of the Shroud of Turin","post":"Anoxie, it doesn’t seem that you would have liked to see the soot being loosened each time the Shroud was rolled and unrolled together with the Holland cloth, slowly spreading over the image. Dr. Alan Adler was on the Conservation Committee and I’m sure that what he told Cardinal Poletto had some influence on the prelate, with the relic now stored in a special case that cost 1 billion lire, financed by Italgas.\nThere were errors in the restoration work, things like creases that may no longer be visible and so on, but on the whole there can be no doubt that the Shroud is now in a much better condition.\n\n","date":"January 16, 2014 at 10:07 am","url":"https://shroudstory.com/2014/01/14/the-questionable-restoration-of-the-shroud-of-turin/","cat":"news_&_views","id":"comment-73448","author":"Louis","site":"shroudstory"},{"title":"The Questionable Restoration of the Shroud of Turin","post":"I don’t doubt for a minute that Mme Flury-Lemberg and the Turin authorities had the best intentions, and that restoration work was necessary. But it would have been ideal had they been more open about the process from the beginning – for the very reason that other experts might have offered input on that process. We might have much more subsequent materials from the restoration to study. Fewer errors. I feel the way it was handled did not provide very helpful optics on the whole endeavour. But as Anoxie has said, ‘what’s done is done’ — we take the lessons learned and move forward.\n\n","date":"January 16, 2014 at 12:16 pm","url":"https://shroudstory.com/2014/01/14/the-questionable-restoration-of-the-shroud-of-turin/","cat":"news_&_views","id":"comment-73461","author":"David Goulet","site":"shroudstory"},{"title":"The Questionable Restoration of the Shroud of Turin","post":"David, if you read #16 you would understand what I am trying to say. Given what has gone on in the realm of Shroud studies Turin appeared to have had no choice. The materials have been stored for study.\n\n","date":"January 16, 2014 at 12:21 pm","url":"https://shroudstory.com/2014/01/14/the-questionable-restoration-of-the-shroud-of-turin/","cat":"news_&_views","id":"comment-73462","author":"Louis","site":"shroudstory"},{"title":"The Questionable Restoration of the Shroud of Turin","post":"If “the materials have been stored for study”, then we can hope that we are able (today or in future) to try the right way to control in a non-destructive manner these very little objects …\nDo you agree ?\n… and …\nWhich are the best systems to control the material (coming from the Holy Shroud) ? …\n\n","date":"January 17, 2014 at 2:02 pm","url":"https://shroudstory.com/2014/01/14/the-questionable-restoration-of-the-shroud-of-turin/","cat":"news_&_views","id":"comment-73553","author":"Piero","site":"shroudstory"},{"title":"The Questionable Restoration of the Shroud of Turin","post":"Agreed Piero. I only cannot say anything about the systems you refer to and presume Turin must have consulted scientists regarding this.\n\n","date":"January 17, 2014 at 7:02 pm","url":"https://shroudstory.com/2014/01/14/the-questionable-restoration-of-the-shroud-of-turin/","cat":"news_&_views","id":"comment-73566","author":"Louis","site":"shroudstory"}]
