[{"title":"The Rush Limbaugh of Shroud Science","post":"I clicked on “here” and it looks as if Colin’s taken his own posting down, Dan.  I guess the exercise of his own free speech on his own web-site might have been too much for him!  I’ve generally found it a good policy to monitor one’s own comments before posting them.  It mightn’t keep one entirely out of trouble, but it can help to minimise self-generated problems!\n\n","date":"May 4, 2012 at 8:11 am","url":"https://shroudstory.com/2012/05/04/the-rush-limbaugh-of-shroud-science/","cat":"news_&_views","id":"comment-11112","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Rush Limbaugh of Shroud Science","post":"Dan,\nI really find Colin Berry not only fanatical but offensive. His attack on STURP and you prior to Valencia evoked memories of the worst of the McCarthy era abuses. That is why I posted so sarcastically, I think he should adopt a new handle: Rumpelstilskin. He  is a classical blogosphere troll.\nI will no longer attempt to engage with commenting on his posts (except when the idiocy devolves to more personal attacks that can not be ignored.\n\n","date":"May 4, 2012 at 8:24 am","url":"https://shroudstory.com/2012/05/04/the-rush-limbaugh-of-shroud-science/","cat":"news_&_views","id":"comment-11113","author":"John Klotz","site":"shroudstory"},{"title":"The Rush Limbaugh of Shroud Science","post":"It’s funny, you always have a picture in the back of your mind what people look like, and I must say the one posted above was pretty darn close to how I imaged Colin  ;-) …\n…Sorry couldn’t help myself.\nAnyways Colin shouldn’t feel so bad, or singled out as David hasn’t posted several of my posts either, and has actually pulled some off lol…no big deal.\nR\n\n","date":"May 4, 2012 at 8:28 am","url":"https://shroudstory.com/2012/05/04/the-rush-limbaugh-of-shroud-science/","cat":"news_&_views","id":"comment-11114","author":"Ron","site":"shroudstory"},{"title":"The Rush Limbaugh of Shroud Science","post":"Does anyone has ever think that if this guy is so agressive against the Shroud and the Shroud world, it is probably because inside of him, he intuits very strong that the shroud is authentic and it scares him !  On the contrary to his agressive reaction, the vast majority of the agnostics and atheist I know react that way when I talk to them about the Shroud :  It’s an interesting subject but…  so what ?  Authentic or not, the vast majority of those people, unlike Colin, don’t seem to give a dawm about the Shroud !  That’s why I always had the impression that the Shroud is here for us, the believer, in order to strengthen our faith, well before being there for the unbelievers, in order to make them believe in Christ.  In other word, I don’t think the Shroud is a great tool for proselytism…  Maybe (just maybe) for a minority of atheists and agnostics, but surely not for the majority of this group !\n\n","date":"May 4, 2012 at 10:40 am","url":"https://shroudstory.com/2012/05/04/the-rush-limbaugh-of-shroud-science/","cat":"news_&_views","id":"comment-11119","author":"Yannick Clément","site":"shroudstory"},{"title":"The Rush Limbaugh of Shroud Science","post":"Paolo Di Lazzaro\nCollapse\nDear David,thank you very much for taking the lead for this challenge.\nI am convinced it is be a milestone to be faced by everybody may claim he/she knows how a forger did the body image on the Shroud.\nI completely agree with CES that the challenge should be addressed to everybody, and not to a specific person/organization. Obviously, next time Dr Dawkins or other scholars repeat the statement that Shroud is an hoax, they have to face with your challenge.\nFirst step was done, the next should be  spreading this challenge everywhere, blogosphere, websites, papers, conferences, and so on.\nAt the same time, I am happy you don’t consider the text proposed at Valencia as cast in stone. As you know, in Valencia I suggested to add some “numbers” to avoid a vague definition of, e.g. the superficiality  of body image.\nThis is because in the case of superficiality we have a number of experimental evidences. On the one hand we have the very important results of Rogers who was unable to measure the thickness of the many colored ghosts pellicle because of the diffraction limitation of the optical microscope he used. This means the colored thickness was smaller than the shortest visible wavelength, 410 nm.  On the other hand, we have the result of the superficiality paper published in Journal of Imaging Science and Technology (2010) that estimates experimentally the colored thickness as 200 nm +- 200 nm.\nSo, in this case we may agree on a range of coloration between 200 and 400 nm (i.e. 0,2-0,4 micrometers) approximately.\nIt isn’t an academic cavil. Making a numerical statement on superficiality allows to avoid the possibility that a scholar trying a “Nickell like” experiment comes to say: – I achieved a ten-micrometer color thickness, so it does not penetrate below the fiber (which is 20 micrometer thick) and I matched your characteristic no. 2 –\nA characteristic more that maybe considered for insertion is connected with the forensic details unknown in the Middle Age, for example the presence of exudates and high levels of bilirubin mixed with blood, which would be consistent with a haemolytic process caused by torture. The bilirubin is only visible by using UV lamps, such as those used by policemen to detect organic traces. These were obviously unavailable in the MiddleAges.\nDiscussion is open!\n.In any case, apart from minor adjustement, the most important fact is that a challenge started having a general agreement. Unanimity is not possible for humans, but a general agreement is.  Thank you David for this effort and remarkable result.\nAll the best\nPaolo Di Lazzaro\nhttp://www.shroud-enigma.com/Valencia/image-characteristics-%20consensus-shroud-of-turin.html#\n:)\n\n","date":"May 4, 2012 at 12:40 pm","url":"https://shroudstory.com/2012/05/04/the-rush-limbaugh-of-shroud-science/","cat":"news_&_views","id":"comment-11122","author":"Tornike Chiboshvili","site":"shroudstory"},{"title":"The Rush Limbaugh of Shroud Science","post":"I’m sorry, but I do not know English, I’m from Georgia, but I’m working on this issue in Georgia successfully, thank you very much! *\n\n","date":"May 4, 2012 at 12:52 pm","url":"https://shroudstory.com/2012/05/04/the-rush-limbaugh-of-shroud-science/","cat":"news_&_views","id":"comment-11124","author":"Tornike Chiboshvili","site":"shroudstory"},{"title":"The Rush Limbaugh of Shroud Science","post":"georgia Tbilisi  :)\n\n","date":"May 4, 2012 at 12:53 pm","url":"https://shroudstory.com/2012/05/04/the-rush-limbaugh-of-shroud-science/","cat":"news_&_views","id":"comment-11125","author":"Tornike Chiboshvili","site":"shroudstory"},{"title":"The Rush Limbaugh of Shroud Science","post":"Hey what happen to the Bull dog picture? My joke is ruined now  ;-(\nR\n\n","date":"May 4, 2012 at 1:19 pm","url":"https://shroudstory.com/2012/05/04/the-rush-limbaugh-of-shroud-science/","cat":"news_&_views","id":"comment-11126","author":"Ron","site":"shroudstory"},{"title":"The Rush Limbaugh of Shroud Science","post":"If the so-called “Concensus” and the so-called “pollen evidence that Jesus was buried with the Royal honors” is the only “important” things that have come out of the Conference of Valencia, I think the participants of this event should have stayed relax at home !!! ;-)\nI think those conferences are more and more redundant and less and less relevant since it’s been almost 35 years now since the last in-deep and direct scientific research was done on this cloth.  Unless the Vatican agree on a new protocol of direct scientific researches done by a team of experts, I think those kind of conferences will be more and more useless in the future.\n\n","date":"May 4, 2012 at 3:41 pm","url":"https://shroudstory.com/2012/05/04/the-rush-limbaugh-of-shroud-science/","cat":"news_&_views","id":"comment-11130","author":"Yannick Clément","site":"shroudstory"}]
