[{"title":"The Shroud Connection: Shape-Shifting Jesus Described in Ancient Egyptian Text","post":"Quote : “Jesus. It also explains why Judas used a kiss, specifically, to betray Jesus — because Jesus had the ability to change shape, according to the text.”  \nJust by this transformation of the story, it is clearly a gnostic based Gospel and we know for a fact that no Gnostic text (that have all been written during the second century or after) should never be consider as being historically accurate in any way…\n\n","date":"March 13, 2013 at 8:32 am","url":"https://shroudstory.com/2013/03/13/the-shroud-connection-shape-shifting-jesus-described-in-ancient-egyptian-text/","cat":"news_&_views","id":"comment-27191","author":"Yannick Clément","site":"shroudstory"},{"title":"The Shroud Connection: Shape-Shifting Jesus Described in Ancient Egyptian Text","post":"Another of those apocryphal texts that cannot be taken seriously.\n\n","date":"March 13, 2013 at 10:47 pm","url":"https://shroudstory.com/2013/03/13/the-shroud-connection-shape-shifting-jesus-described-in-ancient-egyptian-text/","cat":"news_&_views","id":"comment-27252","author":"Louis","site":"shroudstory"},{"title":"The Shroud Connection: Shape-Shifting Jesus Described in Ancient Egyptian Text","post":"Could somebody with more experience of magic than I explain how a kiss defends against shape-shifting?\n\n","date":"March 14, 2013 at 5:46 am","url":"https://shroudstory.com/2013/03/13/the-shroud-connection-shape-shifting-jesus-described-in-ancient-egyptian-text/","cat":"news_&_views","id":"comment-27276","author":"Hugh Farey","site":"shroudstory"},{"title":"The Shroud Connection: Shape-Shifting Jesus Described in Ancient Egyptian Text","post":"As I understand it, there are fundamentally two characteristic types of magic (i) contagious magic involving contact (ii) imitative magic e.g. like this, ergo is this.  Both originate from primal religious rituals but are seen to survive even in mature religious rituals and even every day social rituals.  A topical example of a contagious ritual would be the pressing of a copy of the Shroud to the original with the intention that the mystique or power of the original would be imparted onto the copy.  An example of imitative magic would be the creation of a doll, with recognisable features, perhaps using the hair of the intended victim, to do harm to an enemy.  Imitative magic survives in some forms of emblems. It was widely used in medieval medicine by prescribing foods that had the appearance of the affected organ, e.g. walnuts for brain fever.  The sign of the cross for instance might be technically classified as such by imitating the form of the cross. \nA kiss might by a principle of contagious magic provide adequate defence against the power of the magician, or conversely inhibit the power of the magician.  This explanation has been grossly simplified, merely to explain the basic principles involved.  However once explained, several examples can come readily to mind, e.g. the finger of God reaching out to the finger of Adam in the Sistine Chapel Creation scene. \nTouch is a fundamental principle in the Polynesian and Maori concepts of “tapu”.  The head is particularly tapu.  In the old days, Maori chiefs had sometimes to be fed by their womenfolk, as food is “noa” or common, and the chief might be in a state of tapu, and could not touch the food himself. Attendance at a Maori funeral makes one tapu, and so requires the eating of food at its conclusion to return everyone to a state of “noa”.\n\n","date":"March 14, 2013 at 8:03 pm","url":"https://shroudstory.com/2013/03/13/the-shroud-connection-shape-shifting-jesus-described-in-ancient-egyptian-text/","cat":"news_&_views","id":"comment-27323","author":"daveb of wellington nz","site":"shroudstory"}]
