[{"title":"The Shroud of Barrys Bay","post":"David Goulet wrote: “This leads to passionate exchanges that often turn into schoolyard shouting matches. Fun stuff.” (It does seem Dan enjoys FAR TOO MUCH at times to the extend somebody has to remind he is ‘the moderator’)\nAs I said on another thread: “If ONLY Doctor Colin Berry could stick to his element aka chemical/comical matter”…\n\n","date":"June 27, 2013 at 8:09 am","url":"https://shroudstory.com/2013/06/27/the-shroud-of-barrys-bay/","cat":"news_&_views","id":"comment-38210","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Barrys Bay","post":"Urgent message to site “moderator”, i.e. Dan Porter. This attempt by MPH and others to pillory me on your site must cease, and cease immediately. Yes, I know you have blocked some of MPH’s comments, but that is not good enough, given the background of systematic harassment that I have  been receiving from MPH and several others too.\nFor the record, it is I who operated at professorial level in the late 1980s, as the link below (just one of several I could cite) will demonstrate, when I was employed  as a departmental head at an industrial research association, outwith a University, but could still find myself being invited  – professor-like – to act as public examiner for a Swedish doctoral thesis, i.e. at the prestigious Lund University.\nhttp://dreams-and-daemons.blogspot.co.uk/2006/11/examining-doctoral-dissertations-seen.html\nYet you have allowed MPH to belittle my academic credentials on an almost daily basis, while an academic nonentity, with no visible track record on the internet, bar some attendances at Shroudie congresses, claims to have been a University professor some 35 years ago when that clearly was not the case.  There is no evidence that he ever operated at that level. You have also allowed a  Florida-based medic of Ukrainian origin, Soviet-era,  to question my mental health (clear abuse of pseudo-psychiatry against a perceived dissident) and you have allowed daveb to attack my personal integrity, claiming without a shred of evidence that I engage in pseudoscience. Too cap it all, you yourself have now attempted in this posting to make a vaguely worded personal attack, and blocked at least one of my replies, possibly two, denying me the right of reply, allowing further comments to appear that attempt to blacken my credentials as a scientist and as a sane and responsible commentator.\nAs I say, this has to stop, and it has to stop now. I shall not make idle threats now, but rest assured there will be a corrective action taken if you continue to allow your site to be used systematically in this fashion for character assassination and/or to undermine and damage my professional credentials.\n\n","date":"June 27, 2013 at 10:50 am","url":"https://shroudstory.com/2013/06/27/the-shroud-of-barrys-bay/","cat":"news_&_views","id":"comment-38223","author":"colinsberry","site":"shroudstory"},{"title":"The Shroud of Barrys Bay","post":"Typo: It does seem Dan enjoys them FAR TOO MUCH at times\n\n","date":"June 27, 2013 at 8:10 am","url":"https://shroudstory.com/2013/06/27/the-shroud-of-barrys-bay/","cat":"news_&_views","id":"comment-38211","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Barrys Bay","post":"Sorry for the typos…\n\n","date":"June 27, 2013 at 8:12 am","url":"https://shroudstory.com/2013/06/27/the-shroud-of-barrys-bay/","cat":"news_&_views","id":"comment-38212","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Barrys Bay","post":"Dan, I was wondering if your search engine might pick up the article. I actually wrote this before the latest dust up by some of the lads here. I really need to update that headshot.\n\n","date":"June 27, 2013 at 9:56 am","url":"https://shroudstory.com/2013/06/27/the-shroud-of-barrys-bay/","cat":"news_&_views","id":"comment-38218","author":"David Goulet","site":"shroudstory"}]
