[{"title":"The Shroud of Turin and the horns of the Devil.","post":"Jokes aside, O.K., at the time Saint John the Baptist Cathedral in Turin caught fire it was stated that the city had a big share of satanic sects. What the situation is like now I don’t know, perhaps the number of Vatican exorcists has been increasing due to this. We must hope they are not “Milingos”, like the former archbishop Milingo. Your famous countryman is himself said to have performed two exorcisms there. Yet, there is a lot more that theologians need to study, given the case of Anneliese Michel in Germany.\n\n","date":"May 3, 2014 at 7:03 pm","url":"https://shroudstory.com/2014/05/03/the-shroud-of-turin-and-the-horns-of-the-devil/","cat":"uncategorized","id":"comment-110184","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin and the horns of the Devil.","post":"It is not a joke, Louis.\nSome interrogated Templars claimed that their purported idol was demon-like. For example Raoul de Gizy mentioned that it “seemed to him that it was the figure of a certain demon, called in French un maufé, and that whenever he saw it such a great fear overcame him that he could scarcely look at it except with the greatest fear and trembling.”\nAs we can see, if you fold a Shroud at least in the half, (or even better, leaving just the face) you can see figure that may look quite devilish, with those horns (created by watermarks) atop of the head.\n\n","date":"May 4, 2014 at 6:56 am","url":"https://shroudstory.com/2014/05/03/the-shroud-of-turin-and-the-horns-of-the-devil/","cat":"uncategorized","id":"comment-110644","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Turin and the horns of the Devil.","post":"Hi O.K.\nThe fierce knights never gave up in battle, they gave their lives when needed, and that was the reason Grand Master Jacques de Molay went from Athens to France to discuss plans for a new crusade with (Avignon Pope) Clement VI. He was unable to accept the Fall of Acre.\nThe initiation ritual seemed to have been an (instantaneous) glimpse of the Shroud face, the knights did not have “college degrees”, they were simple warrior-monks, they were seeing something that was unexpected. The face was not an exact copy, it must have been something like the one found in Templecombe, where the crusader order had a preceptory.   \nThe Christ icon in the dome of Monreale cathedral in Sicily is said to have left many with fear.\n\n","date":"May 4, 2014 at 11:37 am","url":"https://shroudstory.com/2014/05/03/the-shroud-of-turin-and-the-horns-of-the-devil/","cat":"uncategorized","id":"comment-110826","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin and the horns of the Devil.","post":"It might not be a joke, but it is ridiculous, in my opinion, O.K..  It is an obvious water stain.\n\n","date":"May 4, 2014 at 11:14 am","url":"https://shroudstory.com/2014/05/03/the-shroud-of-turin-and-the-horns-of-the-devil/","cat":"uncategorized","id":"comment-110811","author":"Andy","site":"shroudstory"},{"title":"The Shroud of Turin and the horns of the Devil.","post":"You don’t catch it, Andy. It is obviously a water stain, but in the eyes of frightened Templar who has not seen the image before, but he has heard some rumors about some secret (and possibly heretical) cult in the order? This is not ridiculous.\n\n","date":"May 4, 2014 at 11:28 am","url":"https://shroudstory.com/2014/05/03/the-shroud-of-turin-and-the-horns-of-the-devil/","cat":"uncategorized","id":"comment-110824","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Turin and the horns of the Devil.","post":"OK you wrote: “Some interrogated Templars claimed that their purported idol was demon-like. For example Raoul de Gizy mentioned that it “seemed to him that it was the figure of a certain demon, called in French un maufé, and that whenever he saw it such a great fear overcame him that he could scarcely look at it except with the greatest fear and trembling.”\nAs we can see, if you fold a Shroud at least in the half, (or even better, leaving just the face) you can see figure that may look quite devilish, with those horns (created by watermarks) atop of the head.”\nActually, the two (archaeoparadoliac) Devil’s horn-like are not so much created by watermaks as by the two inverted “V” blood rivulets (as if in the hair on the left) and markings (on the right) at TS Face brow level.\n\n","date":"May 4, 2014 at 12:24 pm","url":"https://shroudstory.com/2014/05/03/the-shroud-of-turin-and-the-horns-of-the-devil/","cat":"uncategorized","id":"comment-110849","author":"Max patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin and the horns of the Devil.","post":"Typo: the two Devil’s horn-like archaeoparadolia\n\n","date":"May 4, 2014 at 12:26 pm","url":"https://shroudstory.com/2014/05/03/the-shroud-of-turin-and-the-horns-of-the-devil/","cat":"uncategorized","id":"comment-110852","author":"Max patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin and the horns of the Devil.","post":"Typo (sorry): The Devil’s two horns-like archaeoparedolia.\n\n","date":"May 4, 2014 at 1:29 pm","url":"https://shroudstory.com/2014/05/03/the-shroud-of-turin-and-the-horns-of-the-devil/","cat":"uncategorized","id":"comment-110889","author":"Max patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin and the horns of the Devil.","post":"Re the head being cryptically said to be in figuram baffometi \n  The very word “baphomet” does wordplay with the Old French phrase “Ba Mauffé”, “Down with the Devil” (referring to Yeshua’s awe inspiring death mask  (= the Holy Face of his Holy Shroud with his sole head appearing through the “MONSTRance”, i.e. the crystal rock of a vast oculus as central circular opening in front side of a reliquary). Actually via a pareidolia, his death mask could appear AS IF having “two horns” at brow level.\n\n","date":"May 4, 2014 at 1:16 pm","url":"https://shroudstory.com/2014/05/03/the-shroud-of-turin-and-the-horns-of-the-devil/","cat":"uncategorized","id":"comment-110879","author":"Max patrick Hamon","site":"shroudstory"}]
