[{"title":"The Shroud of Turin in the Wall Street Journal","post":"Actually, a better and more accurate quote by John Paul II was, “The Holy Shroud is the most splendid relic of the Passion and Resurrection.”\n\n","date":"April 18, 2015 at 7:37 am","url":"https://shroudstory.com/2015/04/18/the-shroud-of-turin-in-the-wall-street-journal/","cat":"2015","id":"comment-196689","author":"Nabber","site":"shroudstory"},{"title":"The Shroud of Turin in the Wall Street Journal","post":"“Since it is not a matter of faith, the Church has no specific competence to pronounce on these questions.” (From the Vatican.va translation of “Pastoral Visit of His Holiness John Paul II to Vercelli and Turin (Italy) May 23-24, 1998). You can’t get more accurate than that.\n\n","date":"April 18, 2015 at 10:02 am","url":"https://shroudstory.com/2015/04/18/the-shroud-of-turin-in-the-wall-street-journal/","cat":"2015","id":"comment-196707","author":"Hugh Farey","site":"shroudstory"},{"title":"The Shroud of Turin in the Wall Street Journal","post":"JP2 did say that the “Church” (i.e., Vatican so-called scientists) has no specific competence to pronounce.  \nBut JP2’s comment re: “The Holy Shroud is the most splendid relic of the Passion and Resurrection” stands as an Absolute on the matter.  He can pronounce the Truth as he sees it, while a bunch of Vatican bureaucrats are indeed incapable.  \nThe Cardinal’s Scientific Advisor in the matter of the C-14 testing did such a “great job” of advising on the science, didn’t he?  Ha.\n\n","date":"April 19, 2015 at 4:27 pm","url":"https://shroudstory.com/2015/04/18/the-shroud-of-turin-in-the-wall-street-journal/","cat":"2015","id":"comment-196857","author":"Nabber","site":"shroudstory"},{"title":"The Shroud of Turin in the Wall Street Journal","post":"Does anyone look @ the “photo” of Jesus”  & not see him as a European? This doesn’t  tell all that It isn’t the face of a Middle Eastern man, whom Jesus was.  How is it that Christians still want him to look European?\n\n","date":"April 18, 2015 at 5:04 pm","url":"https://shroudstory.com/2015/04/18/the-shroud-of-turin-in-the-wall-street-journal/","cat":"2015","id":"comment-196752","author":"Edith Smith","site":"shroudstory"},{"title":"The Shroud of Turin in the Wall Street Journal","post":"Have you seen Roman first-century depictions of Israelites, such as Josephus?  Have you seen Agemian’s portrait of Jesus from the Shroud of Turin?  What the heck do you think 1st Century Israelites looked like?\n\n","date":"April 19, 2015 at 4:30 pm","url":"https://shroudstory.com/2015/04/18/the-shroud-of-turin-in-the-wall-street-journal/","cat":"2015","id":"comment-196858","author":"Nabber","site":"shroudstory"},{"title":"The Shroud of Turin in the Wall Street Journal","post":"Edith, go to google images and type in Bashar al-Ja’afari.  He is the Syrian ambassador to the UN.  Notice his features.\nNow imagine a photographic negative of Bashar.  He too  would look European.\nThe Shroud is a negative image and is not representative of Jesus’ complexion, more than likely olive, just as is the case with most middle-easterners.  \nBest,\n\n","date":"April 19, 2015 at 9:36 pm","url":"https://shroudstory.com/2015/04/18/the-shroud-of-turin-in-the-wall-street-journal/","cat":"2015","id":"comment-196868","author":"Angel","site":"shroudstory"},{"title":"The Shroud of Turin in the Wall Street Journal","post":"Angel, I’d like to know your basis for saying Christ’s complexion was “more than likely olive”. I haven’t seen  depictions of First Century Jews that would back that up.  Attempts to equate today’s Middle-Easterners with First Century Jews is misguided at best.\nIt doesn’t appear to me that Roman depictions of Flavius Josephus (a.k.a. Joseph ben Matityahu in Hebrew) could be  considered olive-complected.  Thomas Heaphy’s book, (1880), The Likeness of Christ, shows early drawings / paintings from the catacombs of Rome, dated First or Second Century which show Christ and the Apostles with normal whitish faces, and certainly not olive.\n\n","date":"April 20, 2015 at 2:56 pm","url":"https://shroudstory.com/2015/04/18/the-shroud-of-turin-in-the-wall-street-journal/","cat":"2015","id":"comment-196953","author":"Nabber","site":"shroudstory"}]
