[{"title":"The Shroud of Sforza","post":"A few days a go I quoted from Bob Dylan, without attribution: “You don’t have to be a weatherman to know which way the wind is blowing.” I might add a second Dylan quote now by way of Peter, Paul and Mary: “The answer, my friends, is blowing in the wind.” Barrie Schwortz noted in Shroud.com that his hits in March were 160,000, triple what is normal. \nBurt Bacharach began  a song I have always liked but which never became a hit, and except for its first line has no relevance but I think that first line is most appropriate for our time, and place: “Sail, when the wind start to blow.”\nI believe the Shroud is a Revelation reserved for our scientific times. (note the capitalization) Perhaps, as a caution we should look to Yeats:\n“The darkness drops again but now I know\n    That twenty centuries of stony sleep\n    Were vexed to nightmare by a rocking cradle,\n    And what rough beast, its hour come round at last,\n    Slouches towards Bethlehem to be born?”\n\n","date":"June 4, 2013 at 4:27 am","url":"https://shroudstory.com/2013/06/04/the-shroud-of-sforza/","cat":"news_&_views","id":"comment-36016","author":"John Klotz","site":"shroudstory"},{"title":"The Shroud of Sforza","post":"There was one glaring technical error with the “Tears of Blood” episode….and it concerns the Shroud.\nCatherina Sforza decided to create a fake Shroud, complete with tears of blood, to distract the faithful from attending a Festival in Rome where the Spear of Longinus was on display.\nOne problem with this fake Shroud is that the producers of the show decided to model it after the modern Shroud we see today…complete with the 4 triangular patches the Poor Clare nuns sewed in to repair the burn holes from the 1532 fire that damaged the Shroud.\nThe problem is…this Festival scene in The Borgias episode took place in the year 1500! They even put the year up on the screen as the scene unfolded.\nSomeone didn’t do their homework.\nThey get an “F” for Shroud of Turin 101.\n\n","date":"June 5, 2013 at 11:08 am","url":"https://shroudstory.com/2013/06/04/the-shroud-of-sforza/","cat":"news_&_views","id":"comment-36184","author":"Brad","site":"shroudstory"}]
