[{"title":"The Shroud that Defies Scientific Explanation (Part 2)","post":"April Fools Day Award for “So that absence of proof by modern science that the Shroud is a fake, after 35 plus years of intensive scientific study of the Shroud, is positive proof that the Shroud is not a fake!”\n\n","date":"April 1, 2014 at 6:57 am","url":"https://shroudstory.com/2014/04/01/the-shroud-that-defies-scientific-explanation-part-2/","cat":"news_&_views","id":"comment-95459","author":"Paulette","site":"shroudstory"},{"title":"The Shroud that Defies Scientific Explanation (Part 2)","post":"Paulette,\nWhile I understand that absence of positive proof does prove the opposite, I would suggest that we might have to apply a little advanced Occam’s Razor via Sherlock Holmes. “When you have eliminated the impossible whatever remains, however improbable, must be the truth”\nIn the case of the Shroud we have two mysteries: image formation and the Resurrection. All explanations for the image have failed, and must be eliminated. What remains is the Resurrection. \nNo fooling.\n\n","date":"April 1, 2014 at 7:51 am","url":"https://shroudstory.com/2014/04/01/the-shroud-that-defies-scientific-explanation-part-2/","cat":"news_&_views","id":"comment-95471","author":"John Klotz","site":"shroudstory"},{"title":"The Shroud that Defies Scientific Explanation (Part 2)","post":"typo does NOT prove the opposite\n\n","date":"April 1, 2014 at 9:14 am","url":"https://shroudstory.com/2014/04/01/the-shroud-that-defies-scientific-explanation-part-2/","cat":"news_&_views","id":"comment-95490","author":"John Klotz","site":"shroudstory"},{"title":"The Shroud that Defies Scientific Explanation (Part 2)","post":"An explanation has not yet been reached – this does not mean one will not be!\n\n","date":"April 2, 2014 at 3:56 am","url":"https://shroudstory.com/2014/04/01/the-shroud-that-defies-scientific-explanation-part-2/","cat":"news_&_views","id":"comment-95765","author":"Thomas","site":"shroudstory"},{"title":"The Shroud that Defies Scientific Explanation (Part 2)","post":"modern man can not duplicate the  1 percent (?) negative image that we can see. the real positive hidden image was only revealed when photographed. This is a miracle in itself.\n\n","date":"April 1, 2014 at 8:37 am","url":"https://shroudstory.com/2014/04/01/the-shroud-that-defies-scientific-explanation-part-2/","cat":"news_&_views","id":"comment-95481","author":"paul","site":"shroudstory"},{"title":"The Shroud that Defies Scientific Explanation (Part 2)","post":"Absence of evidence or understanding is not a guarantee of scientific proof by any means.  It is like looking for lost keys that you believe are in your pants pocket, because you’ve searched you’ve for them:\n1. on your desk\n2. on the countertop\n3: under the sofa\n4. etc.\n5. etc.  \nIf you found them in one of the above locations, then you could know for sure (assuming no bilocution).  Or you could look directly in the pocket, but perhaps it’s sewn shut, or currently out of reach.  This is how science operates.  Anything else is considered inconclusive.  It’s valuable to look under the sofa, sure, but you have to be careful not to fool yourself into extending the data past what they really show.\nScience functions by empirical evidence-it is capable of proving that the Shroud isn’t genuine, but what is the scientific test for authenticity?  Is there an experiment that can be named, previously done or yet to be performed?  An authenticity smoking gun?  One that would truly nail it?  Unlike on the side of authenticity, trying to prove what the Shroud must be, because it cannot currently be explained, a process of elimination approach, there are single experiments that would be major blows to authenticity:\nIf C-14 dating showed the Shroud was 2,000 years old, is this scientific proof?\nNo-one can only conclude that it is an old cloth; consistent with authenticity yes, proof: no.\nIf C-14 dating (redo) established a younger date, this could be a smoker\nIf the blood were conclusively established to be human, is this scientific proof?\nNo, it only shows there is human blood on the cloth, consistent with authenticity, yes; proof: no.\nIf the blood were found to be bovine, this could be a smoker\nIt may provide a certain security thinking of certain things as “proof”, but challenge yourself to step out of the cocoon of what’s safe-if you want to talk about science, then be willing to accept another viewpoint, from the lab bench how do you think this might operate-is it really proof when you don’t understand something?  Or the right experiment just hasn’t been done yet?  What would that experiment be-that directly nailed the authentiticy question?\n\n","date":"April 1, 2014 at 10:05 am","url":"https://shroudstory.com/2014/04/01/the-shroud-that-defies-scientific-explanation-part-2/","cat":"news_&_views","id":"comment-95504","author":"Kelly Kearse","site":"shroudstory"},{"title":"The Shroud that Defies Scientific Explanation (Part 2)","post":"About this subject, here’s a great quote from Russ Breault: “The shroud is either authentic or it’s not. From the point of science it can never be proven, but – there is a different view of evidence and that is the courtroom definition as to whether it’s authentic or not.  I believe if the shroud of Turin was put on trial to determine if it was authentic, the jury would find it authentic.” (Jesus -The Lost 40 Days. 15 April. 2011.).”\nI agree with Russ about that and I really believe the jury would find it even more authentic once a new series of direct tests will be performed on that cloth…\n\n","date":"April 1, 2014 at 10:47 am","url":"https://shroudstory.com/2014/04/01/the-shroud-that-defies-scientific-explanation-part-2/","cat":"news_&_views","id":"comment-95511","author":"Yannick Clément","site":"shroudstory"},{"title":"The Shroud that Defies Scientific Explanation (Part 2)","post":"You may be right, but I bet I’d give the jury something to think about as the Attorney for the Medieval!\n\n","date":"April 1, 2014 at 11:04 am","url":"https://shroudstory.com/2014/04/01/the-shroud-that-defies-scientific-explanation-part-2/","cat":"news_&_views","id":"comment-95514","author":"Hugh Farey","site":"shroudstory"},{"title":"The Shroud that Defies Scientific Explanation (Part 2)","post":"Would be interesting to do a “pseudo-trial” of the Shroud with you on one side and someone like Barrie Schwortz or Thibault Heimburger on the other…  Would be very interesting to see what kind of verdict a non-bias jury would give!  I would love to see this.\n\n","date":"April 1, 2014 at 11:18 am","url":"https://shroudstory.com/2014/04/01/the-shroud-that-defies-scientific-explanation-part-2/","cat":"news_&_views","id":"comment-95520","author":"Yannick Clément","site":"shroudstory"},{"title":"The Shroud that Defies Scientific Explanation (Part 2)","post":"If you’re looking for lost keys, eventually you will find them.\nScientifically there is no loss of information, at worst keys are scrambled up.\nThat you didn’t find them under the sofa doesn’t mean they’ve magically deasappeared out of space time.\n\n","date":"April 1, 2014 at 6:11 pm","url":"https://shroudstory.com/2014/04/01/the-shroud-that-defies-scientific-explanation-part-2/","cat":"news_&_views","id":"comment-95608","author":"anoxie","site":"shroudstory"},{"title":"The Shroud that Defies Scientific Explanation (Part 2)","post":"If carbon dating showed it to be 2000 years old this would not be categorical proof however it would be highly suggestive of authenticity\n\n","date":"April 2, 2014 at 3:58 am","url":"https://shroudstory.com/2014/04/01/the-shroud-that-defies-scientific-explanation-part-2/","cat":"news_&_views","id":"comment-95766","author":"Thomas","site":"shroudstory"},{"title":"The Shroud that Defies Scientific Explanation (Part 2)","post":"Gosh. Complicated stuff. It is possible to dispute the indisputable? Or is the term indisputable entirely subjective, so that although A considers something indisputable, B is entirely at liberty to dispute it without there being a logical contradiction?\n“The Shroud of Turin already has proved, beyond reasonable doubt, Christ’s physical resurrection and therefore that Christianity is true.” For Stephen, this is indisputable, and therefore, for him, any attempt to dispute it is the mark of those who “don’t like the implications of there being scientific proof that Christianity is true.” Trouble is, however solid his axiom is for him, it is an airy nothing for others, both Christians (like myself) and Non-Christians. Even if I were convinced (“beyond reasonable doubt”) that the Shroud image was derived directly from the crucified Christ, I would not consider that it proves, or even suggests, the veracity of the Resurrection, nor that “Christianity is true” (whatever that really means). The scientific truth of Christianity does not depend on, nor is supported by, an authenticist interpretaton of the Shroud.\nJason has interesting things to say about miracles, and I think his comments very sensible, for a given definition of the word miracles. My objection to the scientific investigation of miracles in a supernatural sense is that there are no parameters within which such an investigation can be made. If the yellowing of the cloth was caused by a miracle, then it is fatuous to bother with the precise direction or intensity of the radiation which might have caused it, as any or all values are equally valid. There was a thernonuclear explosion which only affected the Shroud? Well, why not? There was a faint exhalation of postmortem vapour? Well, why not? With a miracle, all things are possible. However I do enjoy his request that, although believers in miracles have nothing to investigate, the non-believers continue their work, on the grounds that the less successful they are, the more the supernatural hypothesis is strengthened.\nThis is also the reasoning behind John Klotz’s quoting Sherock Holmes: “When you have eliminated the impossible whatever remains, however improbable, must be the truth.” Needless to say, I don’t think natural causes for the image of the shroud have been eliminated as impossible. I don’t even think a 13th or 14th century origin for the Shroud has been eliminated as impossible. I certainly don’t agree that “All explanations for the image have failed, and must be eliminated.”\nFinally, there is a grain of truth in Stephen’s insistence that if something ought to have been discovered but hasn’t been, then that is evidence that it wasn’t there in the first place. I just don’t think it applies to the Shroud. In spite of many years of interest, there has been very little systematic effort to duplicate the Shroud image-making mechanism. Such attempts as have been made, Vignon’s (pro-authenticity) and Garlaschelli’s (anti-authenticity) being perhaps the most promising so far , have all been little more than first steps along a possible path of investigation rather than thorough explorations of the underlying hypotheses.\n\n","date":"April 1, 2014 at 10:17 am","url":"https://shroudstory.com/2014/04/01/the-shroud-that-defies-scientific-explanation-part-2/","cat":"news_&_views","id":"comment-95505","author":"Hugh Farey","site":"shroudstory"},{"title":"The Shroud that Defies Scientific Explanation (Part 2)","post":"Hugh, I don’t think that “believers in miracles have nothing to investigate”. The Shroud image has characteristics that can be investigated. And God may have used some natural means to bring about the miracle, as in my rainfall example mentioned above. The natural means could be investigated. Or the means might be partially supernatural and partially natural. Even the supernatural element could be investigated, such as how the supernatural activity in question interacted with the natural world. If we can’t fully explore the supernatural element, it doesn’t follow that there’s nothing to investigate. Furthermore, since belief in a miraculous Shroud image is a probabilistic belief, not a certainty, we’d have to consider the possibility that the belief is wrong. We should examine the alternatives. Just as proponents of the miraculous view of the image would have an interest in seeing their opponents explore naturalistic alternatives (as I mentioned earlier with regard to Nickell and Garlaschelli), those who hold the miraculous view would have an interest in exploring those alternatives themselves. I don’t think those who don’t hold the miraculous view are the only ones who should be investigating naturalistic alternatives. I think both sides should do it.\n\n","date":"April 1, 2014 at 8:43 pm","url":"https://shroudstory.com/2014/04/01/the-shroud-that-defies-scientific-explanation-part-2/","cat":"news_&_views","id":"comment-95647","author":"Jason Engwer","site":"shroudstory"},{"title":"The Shroud that Defies Scientific Explanation (Part 2)","post":"Great idea Yannick could it be organised?\n\n","date":"April 2, 2014 at 4:04 am","url":"https://shroudstory.com/2014/04/01/the-shroud-that-defies-scientific-explanation-part-2/","cat":"news_&_views","id":"comment-95767","author":"Thomas","site":"shroudstory"},{"title":"The Shroud that Defies Scientific Explanation (Part 2)","post":"Congratulations on an excellent and well thought-through posting, Dan.  There’s plenty to think about there. \nThere would seem to be definite limits to how far the rigour of the scientific method can take us.  As John Klotz correctly asserts we cannot order our lives by this method.  Decisions must be made, and we do so in normal life by a collection of probabilities.  Sometimes we are right in our assessment, and we therefore succeed. But sometimes we are wrong. That’s just a fact of ordinary life. Yet most of the time, we can still pick ourselves up, dust ourselves off, and start all over again. \nAn obvious limit to the scientific method is that there are no certain agreed proofs for authenticity, but plenty available for testing non-authenticity. But when most of the available proofs for non-authenticity have been exhausted and have failed, this only notches up an increased likelihood for authenticity, but can never make it certain. \nAnother apparent limit of the scientific method, is conflicting interpretation of evidence. We see this in court rooms everyday, where opposite sides are quite capable of calling expert witnesses to the stand to bolster their case. Where they conflict, both cannot possibly be right. At this stage it is the jury’s prerogative to call the verdict, again based on probability.  \nIn the case of the Shroud, the scientists have been hamstrung by lack of access.  And so science has been so far unable to have its last word on the matter, even though it may well already have the methods to carry out definitive tests, one way or the other.  \nThere still remains plenty of scope for experimentation without the need for direct access. There have been attempts to replicate the image, but so far these have only been rudimentary. The search for a naturalistic explanation of how a dead body might form an image on a piece of ancient linen has hardly been explored at all.  It is far too soon to call “Game over!” as Stephen Jones might have it.\n\n","date":"April 1, 2014 at 3:42 pm","url":"https://shroudstory.com/2014/04/01/the-shroud-that-defies-scientific-explanation-part-2/","cat":"news_&_views","id":"comment-95574","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Shroud that Defies Scientific Explanation (Part 2)","post":"The Catholic Church is more interested in canonising saints than in opening the doors again for a fresh hands-on examination of the Shroud, so from this we are able to judge where it thinks the scientific proofs lie.\n\n","date":"April 1, 2014 at 6:37 pm","url":"https://shroudstory.com/2014/04/01/the-shroud-that-defies-scientific-explanation-part-2/","cat":"news_&_views","id":"comment-95615","author":"Louis","site":"shroudstory"},{"title":"The Shroud that Defies Scientific Explanation (Part 2)","post":"\nanoxie :\nIf you’re looking for lost keys, eventually you will find them.\nScientifically there is no loss of information, at worst keys are scrambled up.\nThat you didn’t find them under the sofa doesn’t mean they’ve magically deasappeared out of space time.\n\nNo guarantee you’ll always find lost keys-there may be places you don’t know of or places you don’t think to look.  Scientifically you can’t claim something is true, just because if it wasn’t, it would have been shown to be false by now.  That’s not science.  These types of arguments lean toward an authentic at all costs approach, not an objective search for the truth. \nDaveb is correct, there is a lot that remains to be systematically evaluated, grey area on either side of the authenticity arguments, grey area on mechanisms of image formation, and so forth.\nToo often in cases such as these, arguments based on absence of any “proof” otherwise, the data are overextended to what they really show.  For example, you will read widely that the blood is human blood, that it’s been definitively established-but list the data that definitively shows this.  Adler, to his credit, was appropriately cautious in his conclusions.  Also consider that if any non-human blood components, yes, even non-primate, were (also) present, they would be undetected in the previous experimental designs.  Scientifically, you have to be careful about what they data truly show and where there are potential blind spots.\nRelatedly, it is commonly stated that portions of 3 genes were found in the bloodstains on the Shroud (betaglobin, X, Y), but the rest of the DNA is really too degraded to be useful.  This is a general misunderstanding of the method that was used-those particular 3 genes were selectively targeted & amplified, like pulling selected letters out of a bowl of alphabet soup-it’s not as though that was all that was found after sifting through all of the dregs that remained.\nShroud research is still in the early rounds, the first reel.  It’s way, way too early to call it a day and say that it’s all been done, or should have been by now.  If one is comfortable with thinking that, fine, but basing that on the science isn’t there is not valid.\n\n","date":"April 1, 2014 at 7:19 pm","url":"https://shroudstory.com/2014/04/01/the-shroud-that-defies-scientific-explanation-part-2/","cat":"news_&_views","id":"comment-95631","author":"Kelly Kearse","site":"shroudstory"},{"title":"The Shroud that Defies Scientific Explanation (Part 2)","post":"Actually, this was my point. Your keys are “lost” when you decide to stop the search, it is subjective, not scientific.\n\n","date":"April 2, 2014 at 1:27 am","url":"https://shroudstory.com/2014/04/01/the-shroud-that-defies-scientific-explanation-part-2/","cat":"news_&_views","id":"comment-95726","author":"anoxie","site":"shroudstory"},{"title":"The Shroud that Defies Scientific Explanation (Part 2)","post":"De wesselow in his excellent book drew some neat parallels between the mystery of the shroud and the mystery of the resurrection\n\n","date":"April 2, 2014 at 4:10 am","url":"https://shroudstory.com/2014/04/01/the-shroud-that-defies-scientific-explanation-part-2/","cat":"news_&_views","id":"comment-95772","author":"Thomas","site":"shroudstory"},{"title":"The Shroud that Defies Scientific Explanation (Part 2)","post":"The Shroud has been poked and prodded scientifically, logically, photographically and in other ways since 1898.  That’s a bit more than 35 years.\n\n","date":"May 26, 2014 at 12:08 pm","url":"https://shroudstory.com/2014/04/01/the-shroud-that-defies-scientific-explanation-part-2/","cat":"news_&_views","id":"comment-124802","author":"Andy","site":"shroudstory"}]
