[{"title":"Gas Diffusion and the Banding Effect","post":"i have a simple rule of thumb where scientific hypotheses are concerned. Each  additional qualifying assumption halves the value of the hypothesis. A hypothesis that requires 2 qualifying assumption is worth a quarter of one that does not. One that requires 4 qualifying assumptions is worth a sixteenth of one that does not.\nRogers’ diffusion hypothesis has so many qualifying assumptions (into double figures at least) that it is for all intents and purposes worthless as scientific hypotheses go.\nRaymond Rogers had a certain flair as an experimentalist, but he lacked a crucial attribute – the ability to submit his own ideas to intense critical scrutiny before going to press…\n\n","date":"June 14, 2012 at 10:35 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12461","author":"colinsberry","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"The most important thing that I would like people to note this long paper of mine is this :  Don’t underestimate the retting process !  I truly believe that it’s one major key to understand the Shroud and his body image.  Since the day I noticed that Adler was able to prove that there really are some deposits of pectin on the fibers of the Shroud, I thought that it was an important finding that was really underestimate by the sindonologists.  In fact, bizarrely, I never read about that finding anywhere but in Adler’s book (even not in Rogers writings) !  And then, recently, I found in Rogers writings that he too, thought that part of the impurities (he talk about possible deposits of hemicellulose and flax wax) that would be present on the fibers could have come from this retting process.  And what is the most interesting thing is that pectin and hemicellulose are 2 major components of the primary cell wall !  So, when Fanti, Di Lazarro, Heimburger and Al. wrote their paper in 2010, pretending that this primary cell wall was the real image chromophore, I think they were off-track a bit, but not that much !  Effectively, I now think that the hemicellulose and the pectin from the primary cell wall were really involved in the image formation but not directly.  Instead, I think that the retting process did extract some hemicellulose and pectin from this primary cell wall and left these “impurities” on the fibers.  And if Rogers is right, we have to think that some of these deposits were not completely “washed out” during the bleaching process (in a variable amounts, depending of the batch of thread that was bleached).  This would explain, in good part, the banding effect on the Shroud and after that, other impurities were added to these “impurities” coming from the primary cell wall, during the fabrication and the washing of the cloth.  Then, all these impurities were taken to the top-surface of the cloth (on both sides) during his final drying, because of the evaporation-concentration process.  As Rogers said it well, IF this scenario is correct, then I really think we can forget any image formation process involving some kind of radiation or heat…  And the FACT that some pectin and starch deposits have already been found on the fibers from the Shroud is a VERY GOOD INDICATOR that Rogers hypothesis concerning the banding effect and the image chromophore is probably correct…  Of course, you’re free to believe something else, but the facts are the facts and I don’t invent them !  Ask you the question :  Is it possible that you reject Rogers conclusions simply because they doesn’t “fit” with your preconceive notion about the Shroud ???  Good question, don’t you think ???  I think some people from the Valencia conference should ask themselves this question…  And not just them !\n\n","date":"June 14, 2012 at 1:01 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12466","author":"Yannick Clément","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"Yannick, in the first place thanks for putting all this together. I don´t have important difficulties with  the nature of the chemical reactions involved under the hypothesis by Rogers. I could say the same if vapors were also sweat or any other product of decomposition.\nHowever, in my opinion,  major difficulties arise regarding the motion of gases.\nThe hypothesis of Rogers can only be understood in the frame of a very low emission rate of gases from the body, with a density smaller than air and slowly flowing in laminar regime. That applies to the frontal image. (The back image perhaps was formed with other mechanisms involved?). According to this model, from each point of the body a strictly vertical motion of reactive gases from the body impact the cloth (impurity layer?, outermost part of the fibers?). Then a (Maillard?) chemical reaction takes place, and the surface of the cloth gets colorized.\nIn my view, this is the only model which according to the basic laws of Fluid Mechanics clould explain the vertical correspondence between each point of the body and the image. For this reason, I find extremely interesting the recent post regarding Ray Schneider’s statement on the vertical directionality of the image. This fact could really make sense for\ni)the chemical part of Rogers hypothesis (or sweats/differente gases)\nii) and the –in my view- only possible description according to the laws of fluid mechanics.\nHowever, after reading your post, I noticed that Rogers also had a model for the motion of gases, that in some aspects I am afraid cannot fit in what we know about fluids.\n1.“Gaseous reactive amines can be lost by diffusion through the porous cloth, reducing concentrations and reaction rates inside the cloth. However, it has long been recognized that the images of the hair, moustache and beard are anomalous. The density of the image is greatest in those areas. That can easily be explained by the inhibition of vapor diffusion through a porous mat of hair. Ammonia is first evolved from the lungs. Therefore, its concentration would have been highest in the vicinity of the nose and mouth, and its diffusion would have been retarded by the moustache and beard. By the time heavy decomposition amines appear, the body will have cooled. The surface area of cloth is large and higher-molecular-weight decomposition amines absorb strongly. All of these phenomena would cause a RAPID REDUCTION IN AMINES CONCENTRIATION AWAY FROM THE CONTACT POINTS AND THE NOSE-MOUTH AREA.”\nRogers is thinking of a diffusion mechanism inside the cloth or through a porous mat of hair or from the lungs into the moustache and beard. This is in conflict with a laminar flow from the body and impacting and reacting on the cloth. The result of a difussion would be a  blurred image and a clear point by point vertical correspondence between body and cloth could not be expected.\n2.“Most of the very volatile ammonia diffuses out through the nose and mouth soon after death. This fact may explain the darker image color between the nose and the mouth AND THE PENETRATION OF IMAGE COLOR IN THE VICINITY OF THE HAIR.” (Note : Here, Rogers made reference to a possible image of the hair visible on the back side of the cloth).\nAt this point, I think that Rogers is proposing a horizontal motion of volatile ammonia (with lower molecular weight than air)  towards the hair. Being lighter than sourrounding air a vertical (and not horizontal) motion should be expected.\n3.“The lower density of the hair makes it UNLIKELY that large amounts of either HEAT OR RADIATION WOULD HAVE BEEN PRODUCED IN THE HAIR. This suggests that vapor diffusion was involved in image formation, because any fibrous mat, INCLUDING HAIR, reduces the rate of diffusion of gases. Fiber mats are used for insulation, because they reduce gas diffusion and heat transfer by convection.” (Note : This is a very strong argument from Rogers against any kind of hypothesis involving a burst of energy during the resurrection of Christ. For Rogers, because of it’s very different structure versus a human body, the high quality of the image of the hair would be IMPOSSIBLE to explain if they would have been caused by some kind of heat or radiation. And remember folks that it’s an authentic expert in radiation who said that !).\nThe same that above\n4.“When a heavier-than-air foreign gas is diffusing into air in a fibrous mat, the concentration of the gas WILL INCREASE IN THE HAIR. More gas will diffuse through the pores of the cloth in the area of the hair. Such a mechanism would explain why the hair is clearly visible in the image and why it is visible on the back of the cloth. The observation of image color at the location of the hair on the back side of the cloth, strongly suggest that a gas heavier than air was involved in image formation.” (Note : This last observation has not been confirmed yet. There is probably something on the back side of the cloth corresponding to the hair on the front side, but the exact nature of this image still wait to be confirmed. Rogers mentioned this possible image of the hair on the back side of the cloth on the base of a testimony from monsignor Giuseppe Ghiberti that was taken from the report of the 2002 restoration, where he mentioned that the only part of the image that his visible on the back surface of the cloth is the hair (ref. : Rogers book). Fanti and Maggiolo have confirmed this claim in a 2004 paper (along with the image of the moustache and beard and maybe also the hands), but this work has been criticize by many researchers and this question is still left open (especially for the exact nature of those images). Anyway, Rogers estimated that if those images are really there (and at first sight, it seem so, especially for the images of the hair, the beard and the moustache), his personal hypothesis involving a gaseous diffusion through the cloth would be the most likely way to explain them and that’s why he talk about a possible image of the hair on the back side of the cloth).\nAgain, a diffusion mechanism would  yield a blurred image.\n5.“The early appearance and rapid diffusion of low-molecular-weight ammonia from the nose and mouth might help explain the greater amount of image color between the nose and mouth, in the beard, AND INTO THE NEIRBY HAIR. It will also diffuse through the cloth more quickly and reach the back side of the cloth in greater concentration. Ammonia will diffuse about 20 cm through air while cadaverine is diffusing only 6 cm.”\nAgain, the problem of horizontal motion towards the hair and diffusion/blurred image.\nIn my view, all this represents important limitations which perhaps further research may contribute to solve.\n\n","date":"June 14, 2012 at 2:29 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12475","author":"Gabriel","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"The hypothesis of Rogers concerning image formation is a VERY COMPLEX hypothesis.  And what we have to understand is this :  In normal conditions, we have to expect a blurred image from that kind of process.  But the question is this : How do we know if there was not “special” conditions inside the Shroud and inside the tomb at the moment of image formation ?  We can’t be sure of anything…  But one thing seem to be very probable in my mind :  there was a thin layer of carbohydrates impurities on the top-surface of the cloth and it is that layer that was colored.  And there’s also one other thing that seem to be very probable in my mind :  there was some reactive gas (ammoniac , water vapors and maybe some other heavy amines) coming from the crucified corpse.  When you put these 2 things together, what is the outcome ?  A superficial coloration on the fibers !  And what we have on the Shroud ?  A superficial coloration of the fibers !  Because there is a very good probability that these 2 things were really present in the tomb, I have a very hard time to believe that absolutely no portion of the body image was caused by these probable reactive gas (whether they came from the lungs, the pores of the skin or from urea on the skin that was left after the drying of the sweat) !!!  Of course, we can ask ourselves the question :  Was it another process going on to complete the image and make it more precise ?  Maybe !  Who knows !  Here, I think of a possible molecular transfer from the lactic acid that could have been left on the skin after the drying of the sweat (along with other possible product like urea) and that could have react with the surface of the cloth at some distance from the body because of some diffusion of water vapors.  That’s another possibility.  And I’m sure there are some other natural possibilities too…  But again, since we don’t know the exact conditions that prevailed inside the tomb, I think we must be extremely prudent before throwing this hypothesis of Rogers into the garbage !  As Rogers said very well in his book : “When amines and reducing sugars come together, THEY WILL REACT.  THEY WILL PRODUCE A COLOR.”   LET’S NEVER FORGET THAT because, as Rogers said :  THIS IS NOT AN HYPOTHESIS : THIS IS A FACT !!!  So, for his hypothesis to be COMPLETELY WRONG, we must assume that there was not enough impurities on the fibers to be colored by a reactive gas and/or there was not enough amines that was coming from the dead body.  Personally, I have a hard time to believe that…  But in the end, I agree with you :  More researches need to be done to fully test Rogers hypothesis in every possible condition we can think of.  Remember folks that Rogers, before he died, had not enough time to fully test his hypothesis.  He just did some preliminary experiments that gave him some interesting results…  I really wonder if, one day, there will be another chemist (a biochemist would be great) who will take Rogers work on the Shroud and push it forward by testing it more deeply ?!?  It would be nice to see.\n\n","date":"June 14, 2012 at 3:29 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12477","author":"Yannick Clément","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"I did a little spelling mistake.  You should read : “More researches need to be done to fully test Rogers hypothesis in every possible conditions (plural) we can think of.  Instead of “in every possible condition (singular).\n\n","date":"June 14, 2012 at 3:34 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12478","author":"Yannick Clément","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"““When amines and reducing sugars come together, THEY WILL REACT. THEY WILL PRODUCE A COLOR.” LET’S NEVER FORGET THAT because, as Rogers said : THIS IS NOT AN HYPOTHESIS : THIS IS A FACT !!!”\nThat’s an incredibly simplistic statement, especially for someone described as a thermochemist. Maillard reactions work best at elevated temperatures, usually above 150 degrees C. That’s not to say they won’t take place at typical environmental temperatures, but the Arrhenius energy of activation (“energy hump”) means there is a negligible rate of reaction. How can a slow reaction rate give even a gradual image development if one of the reactants is a gaseous (volatile amine) able to diffuse and leak away long before it can be fixed by reaction with reducing sugars? And if it’s a slow reaction, the ammonia or amine would diffuse, preventing one from getting a sharp image.\nThere is a single word that sums up the “vaporograph” theory, but Dan will put me back on watch if I use it here.\nRogers’ attempts to rule out thermal imprinting in a few throwaway sentences, invoking cellulose crystallinity, the Arrhenius equation and a bizarre test for heated blood (hydroxyproline) were frankly unbelievable for someone held up to be a top-notch chemist.\n\n","date":"June 14, 2012 at 3:53 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12480","author":"colinsberry","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"I thought Roger himself said it explained most of the chemical properties, but not the high resolution of the image. That’s the problem : chemical reaction – high resolution – no contact\n\n","date":"June 14, 2012 at 4:07 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12483","author":"anoxie","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"Rogers talk about the question of the high resolution in his book.  I’m not so sure he thought that an image would necessarily be blurred in every possible conditions…  That’s the big thing to understand versus the Shroud :  We don’t know the exact conditions !  How can we be so sure about the high resolution of the image versus a diffusion process ?  Normally, diffusion create low resolution images, but was it really a normal condition inside the tomb and inside the Shroud ?  Who can be so sure about that ?\n\n","date":"June 14, 2012 at 4:36 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12484","author":"Yannick Clément","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"In order to talk intelligently about image resolution versus the hypothesis of diffusion defended by Rogers (because it’s a popular subject here and many people talk from their strict personal and not necessarily scientific point of view), let’s go in the chapter 12 of his book entitled “Kinetic theory of gases and image resolution and let’s read some important quotes from Rogers :\n“Graham’s LAW of diffusion follows directly from the fundamental theory (note : the Kinetic theory of gases).  NO VALID CLAIM can be made about diffusion and image resolution without reference to the fundamental FACTS.”\n“Diffusion DOES NOT MEAN the same thing as “diffuse”.  The mean free path of a molecule will determine his its diffusion properties.  The mean free path is the distance the molecule will go between collisions with other molecules.  Such calculations show that molecules can not go very far unimpeded at NORMAL temperatures and pressures.  The potential for IMAGE RESOLUTION IS QUITE GOOD.”\n“The greater the mean free path, the more “diffuse” will be gas dispersion.  But each gas have its own mean free path under the same conditions of temperature and pressure.  It is NOT VALID TO “ASSUME” a large dispersion for a gas.  Depending on its chemical and physical properties, IT MAY NOT DISPERSE VERY FAR.”\n“Also, if there can be a large change in concentration in a small distance, RESOLUTION CAN BE GOOD.  It is NOT VALID TO ASSUME a diffuse image when gaseous diffusion is involved in the image-formation mechanism.”\n“Heavy decomposition amines will have very steep concentration gradient as they diffuse into air.  Their concentration in air will be greatly reduce as distance from the body increases.  The DIFFUSION-LIMITED CONCENTRATION GRADIENT will be a MAJOR FACTOR, but NOT THE ONLY ONE, in calculating the maximum resolution of an image-formation mechanism that involves diffusion.”\n“Fibrous or particulate barriers can inhibit diffusion rates.  POROUS BARRIERS INCREASE THE CONCENTRATION of heavy reactive gas on the up-stream side of the barrier.  This is the principle used in uranium-isotope separation by gaseous diffusion, and it would affect concentration gradients during diffusion through hair.”  (Note :  Here, we have a good sign that Rogers, even if he wasn’t an expert in ancient tissues, knew very well what he was talking about when it comes to gaseous diffusion !  Pretending the contrary would be completely dishonest).  \n“The important point to recognize is that blanket, qualitative statements about diffusion and resolution CAN NOT BE SUPPORTED BY SIMPLE ASSUMPTIONS.”\nThat’s the most important quotes I’ve found in this chapter concerning the theoretical aspect of gas diffusion.  We can easily see that what was reported here by Anoxie is not true at all.  Rogers never thought that a gaseous diffusion in the Shroud would NECESSARILY produce a low-resolution image on the cloth.  This kind of assumptions, as Rogers said, must be rejected…  And as I said myself, since we don’t know the real conditions that were presents in the tomb and in the Shroud at the time of image formation, how can we be so sure that any gas diffusion through the cloth would necessarily produced a blurred image ???  WE JUST CAN’T !!!  As Rogers showed in the chapter 12 of his book, theoretically, it is possible to think that an high-resolution image can be produced by a gas diffusion, depending on MANY FACTORS.\nBut in the end, as I said previously in my long comment, even if Rogers scenario is not exactly what happened in the Shroud during the image formation process, it’s not the only possible hypothesis involving some kind of natural process (or processes) that could account for the image on the Shroud.  Other scenarios are possible, like the one proposed by Thibault Heimburger in one of his paper (involving a diffusion of ammoniac from the skin) and/or a molecular transfer involving water vapors and/or something else…  Also, please, let’s not forget this important aspect of the question :  For Rogers, who knew one or two things about gaseous diffusion, it WAS NOT impossible, in theory, to obtain such a high-resolution image with the hypothesis he proposed.  Here, let’s not forget that, in science, we don’t have the right to completely reject a proposed hypothesis before it has been fully and properly tested in laboratory.  For Rogers hypothesis, as well as the other natural hypotheses I just mentioned, I think it’s fair to say that they have not been fully tested yet.   So, before completely rejecting Rogers scenario, I think much more experiments to test his ideas should be done in laboratory…  I’m sure Gabriel will agree with me about that !!! ;-)\nOn that subject, it’s interesting to note the result obtained by Rogers about 2 experiments he made before his death that we can read the report in the chapters 11 and 12 of his book.  First of all, the most important thing to note is that his tests didn’t involve a real crucified corpse.  Also, they didn’t involve the same sorts of amines coming from a corpse (he used DETA instead of cadaverine), nor the same kind of linen than the Shroud of Turin (he used a recent linen cloth and saturate it with dextrin solution and then, wash it in Saponaria Officinalis, in order to “simulate” the Shroud’s ancient style).  Because of that, we can say that these experiments were just preliminary tests and nothing complete versus the reality of the Shroud.  In fact, these tests made by Rogers were just done in order to verify some general principles versus his hypothesis.  It’s so important to note this because, as expected, the detractors of Rogers have used his results to completely discredit Rogers hypothesis, even if, on that single base, it is scientifically impossible and completely dishonest to do so !  That tells a lot about the honesty of the anti-Rogers clan who wants so much to buried Rogers hypothesis with him that they don’t respect the scientific method at all !  \nBut, never mind the fact that those were just preliminary experiments, there was some interesting results that were reported by Rogers in his books and I thought it was interesting to report them here :\n1-“When the temperature of the source (in the case of the Shroud, it would be the corpse) is too high, convection cells are too active, diffusing too widely for good resolution.  Resolution IMPROVES AT LOWER TEMPERATURES.”  (Note :  Remember that one of Rogers conclusion versus the Shroud is that the body image was most probably formed at normal temperature).  Let’s continue the report :  “A body that had cooled for several hours but has not yet produced high concentrations of amines would give BETTER RESOLUTION than a hot body.”  (Note :  If we trust the conclusion of the Spanish team of sindonologists versus the sudarium of Oviedo, the corpse would have been put in the Shroud only 2 hours or so after death, leaving well enough time for the body to cool down and also, for the skin the get dry).\n2-“The amines MUST BE RELEASED SLOWLY.  Too much amine badly REDUCED RESOLUTION.  A decaying body would give MUCH BETTER RESOLUTION than any object that had been painted with pure amines.”  (Note : Rogers said that because, for his experiments, he painted some objects with amines, so that’s normal that the resolution he obtain was not as high as the Shroud’s image).  Let’s keep on the report : “Too much amine would color the ENTIRE CLOTH, OBLITERATING THE IMAGE.  A successful image that involved a real body would REQUIRE REMOVAL OF THE CLOTH before extensive decomposition.”  (Note :  That’s exactly what happen for the Shroud).\n3-“The experimental assembly must be kept in a space that is cool and still.”  (Note :  This is exactly what is expect for a sealed tomb).\n4-“An increase in the concentration of reducing saccharides (impurities) on the cloth IMPROVES RESOLUTION.  (Note :  Because of the evaporation-concentration phenomenon that was going on during the drying of the final cloth, a concentration of reducing saccharides (possibly made partially of elements coming from the primary cell wall, like hemicellulose and pectin) would have been present on the top-surface of the cloth, on both sides, exactly where the body images have been found).\n5-“Modern linen that does not contain suitable impurities WILL NOT PRODUCE AN IMAGE.”  (Note :  When Rogers talk like that, he mean an image produced with some chemical process).\n6-“The higher the cloth above the amine source, the more diffuse the shading.  This illustrates the effect of diffusion.  (Note :  This phenomenon is, theoretically, compatible with the nature of the body image that is on the Shroud).\n7-“…much of the background color on the Shroud could be a result of coloration in the SAME SURFACE IMPURITY that enabled image formation.  The Shroud shows “ghosts” in NON-IMAGE AREAS.  The lighter color of the back of the Shroud is probably a result of impurity separation, front to back, during the drying of the new piece of linen (see Pliny the Elder).”  (Note :  These observations made by Rogers concerning the non-image area and the back side of the cloth are totally consistent with his hypothesis regarding the image chromophore.  And we have to take good note of the FACT that there were ghosts found in the sticky tapes coming from NON-IMAGE FIBERS !  If this is not a clear indication that there are some impurities on-top of the fibers and that they constitute not only the chromophore of the image, but also the chromophore for the color of the non-image areas of the cloth, then I don’t know what it is !  Like Marcel Alonso said in one of his paper : “Probably this film (he talk about the impurities that are located on-top of the non-image fibers) could also be removed, revealing also the true original fiber color (white).”).\n8-“Color density was HIGHER ON THE SURFACE where evaporation was most rapid, i.e., where the saccharides CONCENTRATED.  All of the fibers have a VERY SIMILAR COLOR DENSITY, SIMILAR TO THE “HALF-TONE EFFECT” OF THE SHROUD.  (Note :  This kind of result is quite consistent with what we know about the Shroud.  Remember that the linen cloths and the reactive gas used by Rogers for his experiments were not made exactly the same as what he postulate for the Shroud. in the same way than what is most probable for the Shroud.  In this context, it’s quite normal that he didn’t found color ONLY on the top-fibers of the cloth like we see on the Shroud.  But nevertheless, he was able to show that the general principle he proposed was correct.   Effectively, the fact that he found more color were the saccharides concentrated is a good indicator that this is what happened for the Shroud during the image formation process).\n9-“Color density VARIES WITH SOURCE-CLOTH CLEARANCE.  Diffusion of reactive gas into air produced a CONCENTRATION GRADIENT that affected the color density.  Diffusion COULD EXPLAIN THE VARIATIONS IN COLOR DENSITY OF THE IMAGE.\nIn conclusion, these preliminary results are very consistent with the data that were gathered for the Shroud.  Remember that the purpose of Rogers experiments was NOT to reproduce exactly an image like the body image of the Shroud, but to test some general principles that are present in his global hypothesis for image formation.  There’s a very big difference here and it’s sad that his detractors have not been honest enough to recognize this FACT and admit that these 2 experiments could NOT be taken as any proofs that Rogers hypothesis is incorrect versus the Shroud !!!  The only important thing to note from those experiments, and it’s a big one, is the FACT that the most important aspects of Rogers hypothesis, especially the superficial coloration of a thin layer of impurities by a diffusion of reactive gas SEEMS, at first sight, to be consistent with the body image present on the Shroud.  For Rogers, this was already true on a theoretical level, and the preliminary experiments he made were able to corroborate his thoughts quite successfully (on a preliminary base only).  Of course, more researches need to be done to complete the experimental process that Rogers had started before his death, but nevertheless, those preliminary experiments done by Rogers cannot at all be used to reject his hypothesis.  In fact, it’s precisely the opposite:  They should encourage some other researchers to pursue Rogers work and push it forward.\n\n","date":"June 15, 2012 at 8:28 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12512","author":"Yannick Clément","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"\nYannick Clément :\n I’m sure Gabriel will agree with me about that !!! ;-)\n\nCertainly I do, Yannick. If something seems clear to me is exactly that: more serious research is needed in many fields including alternative datation techniques (I have already put forward my ideas on this blog about this and I also have some new ones) and Rogers hypothesis.\nHowever, after carefully reading your posts I still serious difficulties regarding the motion of emitted gases.\nFortunately, computational techniques are now widely available and the simulation of a great number of varying conditions of amonia types, their emission rates, temperature, humidity is possible without physically reproducing a 1st century tomb in Israel with a crucified corpse inside. They may not be perfect but a computational simulation using some CFD codes like Fluent or STAR CCM woud certainly made it possible the evaluation of the major aspecst regarding Rogers theory. Is there not a SSG ready to do some science on the Shroud? Here they have an interesting chellenge…..:-)\n\n","date":"June 15, 2012 at 9:43 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12516","author":"Gabriel","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"The problem with any imaging model that involves gaseous diffusion is that gas molecules behave like snooker balls. They travel in a straight line until they strike another ball, then come off at an angle, travel some more in a straight line, collide, come off at another angle. After a relatively few collisions we can safely say that the direction of movement of molecules is random, but we can safely predict they gradually get mixed up with all the other molecules, and “spread out in all directions”.\nIt’s all very well talking about mean free path, but at atmospheric pressure the mean free path before a particular molecule strikes another one is very small, and if the molecule is a minor constituent it will tend to collide with an “air molecule”, i.e. nitrogen, oxygen etc, rather than its own type,\nIn other words, gaseous diffusion is essentially a non-starter where imprinting of an image at a distance is concerned. It’s all very well to say we “don’t know all the factors” but we know the crucial ones to do with the laws of diffusion, and the kinetic molecular theory of gases that underlie those laws.\nIf the truth be told, Ray Rogers was desperately looking  for an alternative explanation for the most obvious one – namely thermal imprinting by direct contact. One has only to look at his shoddy arguments for rejecting “scorching” to see how desperate he was. As I’ve said before, he was a gifted experimentalist, but hopeless, indeed downright perverse, as a theoretician. Yes, I know one should not speak ill of the dead, but I’m relaxed at the prospects of my own scientific claims being mercifully ripped apart after I am gone. That’s science biz for you.\n\n","date":"June 15, 2012 at 10:01 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12519","author":"colinsberry","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"\ncolinsberry :The problem with any imaging model that involves gaseous diffusion is that gas molecules behave like snooker balls. They travel in a straight line until they strike another ball, then come off at an angle, travel some more in a straight line, collide, come off at another angle. After a relatively few collisions we can safely say that the direction of movement of molecules is random, but we can safely predict they gradually get mixed up with all the other molecules, and “spread out in all directions”.\nIt’s all very well talking about mean free path, but at atmospheric pressure the mean free path before a particular molecule strikes another one is very small, and if the molecule is a minor constituent it will tend to collide with an “air molecule”, i.e. nitrogen, oxygen etc, rather than its own type,\n\nThis is basically true unless a laminar regime with a very low Reynolds number (I would say below 10) can be established. And I also agree that it is in contradiction with the gas diffusion model as described by Rogers\n\n","date":"June 15, 2012 at 1:08 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12530","author":"Gabriel","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"Guys, you should read again my post concerning the results obtained by Rogers with his 2 preliminary experiments.  He was able to demonstrate that a pretty high-resolution image (he talk about a resolution of 1cm !!!) was truly possible with his hypothesis.  As Rogers said, the main factor for a good image is the temperature inside the tomb versus the temperature of the dead body.  Of course, other factors are important, but this one is the most important.  The difference must be close to none and, in the case of the Shroud, it is truly possible that this kind of good condition was present in the tomb…\nAgain, as I said, I don’t think there’s anybody who have fully tested the hypothesis of Rogers.  On that base, no one has the right to reject it.  Let’s hope some more researches and experiments will be done in the future about that.  \nOne thing’s I can say right now :  the 2 preliminary experiments of Rogers were sufficiently encouraging that more testing should be done to fully test his hypothesis !  If his 2 experiments would have give very bad results in comparison of the Shroud’s image, I would agree with you that Rogers hypothesis seem to be very problematic.  But it was not the case at all !!!  They were good enough to comfort him some more in his conviction that a gas diffusion reacting with a thin layer of impurities is probably responsible for a good part of the Shroud’s image.  I think we must take good note of that !  Rogers, being the good scientist he was, would have been the first one to drop his hypothesis and start searching for another explanation if he would have judged that the results of his 2 preliminary experiments would have been too much different versus the reality of the Shroud’s image.  Meditate on that !!!\n\n","date":"June 15, 2012 at 1:21 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12535","author":"Yannick Clément","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"What would be the best is an expert in biochemistry to push forward Rogers work and make more experiments while testing, as you say, many different conditions.  But one thing should be important for these kind of experiments :  to do it on a linen sample that have been made exactly with the ancient method described by Pliny the Elder !  I think that can make a real difference in the results.  Finally, you said that you still have serious difficulties regarding the motion of emitted gases.  It’s understandable.  Me too, I must admit that I have some doubts, especially concerning the formation of the back image with a gaseous diffusion process.  But, since me and you, we are not expert in this field, I think we should avoid to make too much free assertions about that and let a real expert in chemistry do more testing on the base of Rogers work…  And as I said :  We must also remember that very special conditions could well have been present inside the tomb and/or inside the Shroud when the image formation process occurred.  Remember that we’re not dealing with a normal corpse but a crucified body who was tortured for a long period of time prior to death.  It’s my feeling that this very particular factor can well be critical for the image formation.  Also, it’s truly possible that other chemical processes (like some molecular transfer done with the help of water vapors) could have been active, along with some amines diffusion…  But again, that’s just my personal feeling !  Let’s hope that a real expert could do more testing in the future and then (and only  then), we’ll be able to see more clearly regarding Rogers ideas…\n\n","date":"June 15, 2012 at 1:10 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12531","author":"Yannick Clément","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"Precision : This last comment of mine (just above) was done in response to Gabriel (comment #10)…\n\n","date":"June 15, 2012 at 1:22 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12536","author":"Yannick Clément","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"Yannick: there are no “experts” at the cutting edge of scientific research – just good, bad and indifferent researchers. Telling which is which is judged on approach and results – and where chemical imaging mechanisms are concerned, this retired biochemist with a lifetime in teaching and research  considers himself as qualified as the next man  to distinguish between feasible and non-feasible mechanisms.\nHave you seen  my latest post – which went up less than an hour ago? \nUnless there is some totally mysterious mechanism that still waits to be discovered, then I consider  thermochemical imprinting by direct contact to be the only feasible one that fits the available data. Radiation models or Rogers’ gaseous diffusion are simply not feasible.\nThe answer lies (among other things) in the scorched-on crease marks on the linen.\n\n","date":"June 15, 2012 at 1:34 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12541","author":"colinsberry","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"Marcel Alonso think pretty much the same as you, but, in my mind, any process acting only by direct contact would have provoke bad distorsions on the Shroud, especially in rounded areas like the face.  I am open to the possibility that part of the Shroud’s image had been caused by a direct contact process that was natural (chemical), but not completely.  Have you seen the result of an experiment made by Lavoie and Adler in the 80s about the blood in the hair on each sides of the face ?  They found out that the most probable area where this blood was originally located is the sides of the face, not the hair.  If Lavoie and Adler are right about that (and I think they are), that means that the blood transfer and the image formation process was not acting in the same way.  If they’re right, blood transfer was only a direct contact process (I don’t think there’s too much doubt about this), but not the image (at least, not completely)…  The image was more like a vertical projection from the body to the cloth and only the direct contact point between the body and the cloth would have been created by direct contact.  All the rest would have come from a vertical projection, acting at a close distance.  The absence of big distorsions is a very good indicator for that.  So, maybe you’re partially right.  But I think your hypothesis cannot be possible for all the image.\n\n","date":"June 15, 2012 at 2:36 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12550","author":"Yannick Clément","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"Has it not occurred to you Yannick  that blood was applied first by a forger, but that he misjudged the location, on account of failure to allow for distortion factors in imaging? All it would take is for some tenting of linen, such that bloodstains that were intended be on the cheeks ended up on the hair. Tenting would explain why the lateral extremities of the face are poorly imaged, if at all, creating those symmetrical light areas in the pseudo-negative (dark in the positive) that you attribute to “banding”. Maybe the “hair” was a separate framing border for the face on the template that was placed too far forward. Certainly it does not look anything like real hair in the Shroud Scope enlargements. In fact it doesn’t look much like real hair on the Shroud either (hangs too vertical for a recumbent subject,and no ears are visible as might be expected).\nI find it curious to hear imaging off bas relief templates dismissed on the grounds that it would produce severe distortion and displacement, when in fact the evidence for distortion and displacement is plain for all to see, that blood on the lank vertical head hair being a case in point..\n\n","date":"June 15, 2012 at 3:02 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12553","author":"colinsberry","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"Read that again CAREFULLY : https://shroudofturin.wordpress.com/2012/04/21/please-dont-forget-the-evidence-of-the-bloodstains/\nBecause the bloodstains on the cloth are a real solid and scientific proof that the Shroud is a real burial shroud of someone, the only way the Shroud could be a forgery would be to think that a forger did it with a real crucified corpse and that is HIGHLY UNLIKELY because of many things.  The most obvious one is the fact that the image on the Shroud does not correspond completely (in many aspects) with the medieval depictions of the Passion of the Christ (and even less with the antique depiction of the Passion of the Christ).\nThis allow me to insist on something very important :  Even if the Rogers was correct with his diffusion hypothesis and the body image on the Shroud was not related (at least directly) with the resurrection of Christ, that wouldn’t mean at all that the Shroud is not the one of Jesus of Nazareth and that his resurrection never occured.  I think it’s important to emphasize that point.\n\n","date":"June 15, 2012 at 3:54 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12556","author":"Yannick Clément","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"I usually ignore folk who tell me to read their own work again CAREFULLY, Yannick, but I’ll make an exception in your case.  ;-)\nHere’s a passage from one of your other appreciations of Rogers’ work, which you wrote last month under a post re Richard Dawkins:\n“So, you see ? I think those are very good clues that prove that Rogers knew perfectly well the complete chemical structure of a linen fiber, including the primary cell wall. And nevertheless, he NEVER consider this part of the linen fiber as a valid option to explain the coloration we see on the Shroud !!! Of course, that doesn’t prove that Rogers is right about his thin layer of impurities, but that clearly show the erroneous aspect of Fanti and al. argument that Rogers knew nothing about the primary cell wall and that his ignorance about it caused him to make an error of interpretation regarding the sum of evidences and observations concerning the Shroud.”\nThere you have the problem in a nutshell. Yes, while Rogers never made reference to the PCW,  which is a pity, he did as you say mention hemicelluloses and briefly the fact that they were chemically more reactive than cellulose. \nBut here’s the problem. He then began referring to hemicellulose as an “impurity” in linen, one that could be removed with variable efficiency by bleaching etc, contributing to his banding and image intensity. But here’s the curious thing. He left it there, and at that point his impurity theory centred almost exclusively on starch and its degradation products and on those saponins. Once he had brought in his amines and the Maillard theory, all further references to hemicelluloses were dropped. Any chance that he might have regarded the PCW of linen as a reasonably constant feature of linen fibres, with less variability than chance impurities, and identified the PCW as the probable main site of image imprinting was lost when he tried to dismiss heating/scorching as an alternative to his vaporograph theory. He claimed that heating would have disrupted cellulose crystallinity – a highly simplistic view – completely failing to mention that hemicelluloses would constitute a far better marker for pyrolysis at less extreme temperatures.\nIn short, Rogers got carried away with his pet theory re the starch, soap and amines, and failed to give proper consideration to the theory that hemicelluloses intrinsic to linen fibres were the main susceptible component. It’s hard to avoid the suspicion that he simply did not like the idea of scorching of the PCW layer, perhaps because that flagged up the possibility of a medieval origin for the Shroud (via the kind of scenario that Jackson briefly investigated with his bas relief models) and went hook line and sinker for his vapour theory that could be accommodated into the Biblical account, even if requiring no miracles.\nI hope you won’t mind if I leave it there. These issues are all very interestiing,  but I have to give some thought to my own investigations with the splendid Shroud Scope. So much to do, simply not enough hours in one day…\n\n","date":"June 15, 2012 at 5:04 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12558","author":"colinsberry","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"Hi again!  I’ve been out of Shroud circulation over the last week or two because of current commitments on a few time consuming projects, but have followed this fascinating discussion.  Thanks to Yannink for initiating.this blog, and detailed exposition of Roger’s work.  Several commentators including Colin and Gabriel make I think some valid points. \nLike Colin I have some problems with the gas diffusion model, mainly because of the high resolution of the image, its lack of directionality, and the 3D encoding.  I feel there has to be some other process involved, more instantaneous than any diffusion process would allow, although diffusion of the gases may have been some kind of preliminary necessary for the action of image formation. \nI’ve previously mentioned Giovanna’s de Liso’s work on seismic image formation, “Shroud-like image formation during seismic activitiy”; Giavanna de Liso; ENEA Frascati Conference May 2010″ at http://www.acheiropoietos.info/proceedings/DeLisoWeb.pdf .  I thought her paper showed some fairly persuasive looking images\nHowever so far I’ve been unable to find any enlightening commentary on her work.  I did not obtain a reply after sending an Email to her, asking her for any current comment. \nThe sharpness of the image seems to me to require some kind of light or other radiation, or a contact process. \nI feel I may be coming to the point where I may have to concede that the image formation has to be some kind of supernatural event.  I consider that so far the explanations that have been attempted fail to explain the unique qualities of the Shroud image, and we are all like the blind men of Gotham floundering around trying to describe a phenomenon we can’t begin to conceive. \nThe situation is not helped by the inertia of failing to pursue various assorted experimental programmes to look into the matter in a more systematic and enlightening way.\n\n","date":"June 15, 2012 at 5:10 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12559","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"Quote : “The sharpness of the image seems to me to require some kind of light or other radiation, or a contact process.”\nMany people think like that but if Rogers hypothesis concerning the image chromophore and the bands is true (and I think presently, it’s the most valid hypothesis we have), then you should forget any image formation process involving those kind of things…  The “if” is of course, important in my last statement.\n\n","date":"June 16, 2012 at 6:09 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12611","author":"Yannick Clément","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"Record… needle… groove…\n\n","date":"June 16, 2012 at 6:30 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12613","author":"colinsberry","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"Forgive my saying, Yannick, but you seem to treat “hypothesis” as one and the same as “theory”.  But that is not the case.\nOne can believe in a theory, e.g. evolutionary theory, because it can be supported by so much evidence as to make alternative explanations virtually impossible. One cannot (or should not) believe in a hypothesis, While a hypothesis is a necessary starting point for scientific investigation, it is not in itself “scientific” inasmuch as anyone can have a hypothesis (“hunch”).\nWhat makes Rogers vaporograph hypothesis scarcely scientific is not just that it  has virtually no experimental evidence to suppor it. It is hedged about with so many qualifying assumptions as to deter anyone from even attempting to test it. Oh,  and let’s not forget Occam’s Razor either.\nThere are rival hypotheses out there however, as you well know, ones that can be more easily elevated to the level of theory. Rogers was too quick to dismiss at least one of those, deploying arguments that frankly were second-rate. Why invoke Arrhenius activation energy, when every chemical reaction has an energy hump, no matter how small, reflecting the fact that existing chemical bonds have to be broken before new ones can be created? Why say that the absence of disturbance in cellulose crystallinity precludes thermal modification of carbohydrates, overlooking the fact that there are carbohydrates in linen, notably the PCW hemicelluloses,  that can be chemically modifiied at temperatures much lower than those that modify cellulose, or indeed (probably) even disturb its immense physical order and crystallinity? Why say he can find no evidence for heated blood, when many question whether there is any real, or at any rate, intact blood on the Shroud, and in any case employ a highly dubious, some might say quirky  test for “heated blood” using hydroxyproline (a test for heated meat, with collagen connective tissue, NOT blood that has virtually no hydroxyproline).\nWhy do you persist in trying  to make a hypothesis, and a scarcely-tested one at that,  into a burning issue of faith? Science is not about faith. It is more about scepticism than faith. Methinks there is perhaps an element of hero worship. Do I not recall you saying you had actually met Ray Rogers?\n\n","date":"June 16, 2012 at 7:03 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12616","author":"colinsberry","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"Rogers hypothesis is not a theory.  I know very well the difference, don’t worry…  But it’s the very best hypothesis we have right now concerning the Shroud. I truly believe that.\n\n","date":"June 16, 2012 at 7:51 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12618","author":"Yannick Clément","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"This is an hydrothermochemical impression resulting form collimation of alkali water solution vapours trapped between body/cloth of which pressure gradually released (through a process of direct contact-gradual loss of contact process).\n\n","date":"June 15, 2012 at 5:48 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12563","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"The ammonniac present on the body may have also account  in the collimated mordancing process of  alkali water solution vapour. Ammoniac can be replaced by saponaria if latter present (to form a very thin impurity layer).\n\n","date":"June 15, 2012 at 5:54 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12564","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"Typo error; “might well have to be taken into account to explain the very suferfiical mordancing process of alkali water solution vapours”\n\n","date":"June 15, 2012 at 6:05 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12566","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"More typo error: “to explain the very suferfiical mordancing process of the crowning flax fibres by alkali water solution vapours”\n\n","date":"June 15, 2012 at 6:11 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12567","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"Max, your hypothesis is interesting but it would need some experimental confirmation before we can think of it as being serious.  Did you contact a chemist about that ?  Maybe you should !  Who knows if he couldn’t make some tests around your idea…\n\n","date":"June 16, 2012 at 6:11 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12612","author":"Yannick Clément","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"Do hope there are some serious and objective chemists and biochemists around who can take up the idea to test it….\n\n","date":"June 25, 2012 at 11:49 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-13019","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"…a phycist would be also very mucjh needed… since my opinion (Gedenken Experiment + 2 experimental reconstructions of the Man of the Shroud’s wrapping up) implies a specific hydrothermoPHYSICALchemical process…\n\n","date":"June 25, 2012 at 11:53 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-13020","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"Saponarai AND starch to have a bubble thin caoting on the flax  fibres.\n\n","date":"June 15, 2012 at 5:56 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12565","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"Yup, It’s really getting late. Better turn in. Exhausted.\n\n","date":"June 15, 2012 at 6:13 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12568","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"MPH: “This is an hydrothermochemical impression resulting form collimation of alkali water solution vapours trapped between body/cloth of which pressure gradually released (through a process of direct contact-gradual loss of contact process).”\nSAYING SO, DOESN’T MAKE IT SO! \nMore likely it’s a miracle!\n\n","date":"June 15, 2012 at 8:11 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12572","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"DWNZ (such a charitable soul!) shall have plenty of time to waste on this blog…\nThe fact is I was totally exhausted when I wrote my last comments (#23-27).\nBTW, on this blog I am NOT writing a research paper that I know of. I am just passing  my personal opinions and comments in snatches while working on professional files… Do hope hope a few at least of my comments and opinions are uselful. and contribute to a better understanding of the Shroud problematic\nI should have written:\n1/ The Shroud image is most likely an HYDROthermoPHYSICOchemical impression .\n2/The inner shroud (Turin Shroud) was first SOAKED WITH an alkaline WATER solution.\n3:Solid objects were laid almost all around on the shroud  (insect repellent and medical flower heads, plants plus other items)\n4/Then the inner shroud was TAUTLY wrapped lengthwise all around the wooden boardlike stiff rigid body resting IN EXTRA HEIGHT (on two lime stones at the head and feet?) and maintainded all the way and from both side by at least 4-5 buriers.\n5Thus wound, the 4-5 buriers wrapped the stiff rigid widthwise with DRY linens (at least 2 LONG LINEN STRIPS cut off from the main shroud (the inner shroud) + a VEIL and possibly a prayer shawl) thus compressing the solid object laterraly against the corpse as hard as wood.\netc etc etc\n\n","date":"June 16, 2012 at 7:46 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12584","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"the most important fact ,is there was no air in-between the body surface and cloth surface, back and font (on about 80% of the body surface) and laterally some small air bridges still remaining amid solid objects).\n\n","date":"June 16, 2012 at 7:54 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12585","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"Small air bridges at cheek level due to solid objects and some air bridge (due to a lause?) at lower buttock level might well explain an absence or quasi absence of body image.\n\n","date":"June 16, 2012 at 7:58 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12586","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"This is like reading War & Peace . . .\n\n","date":"June 15, 2012 at 10:40 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12574","author":"Chris","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"1/ steep gradient, ok, remains to be quantified. why vertical ?\n2/ is it consistent with the symetrical properties of frontal and dorsal image ?\n3/ intensity results from the number of threads carrying the image, (a blank thread can be surrounded by colored threads even in the highest intensity zones) why a gas would not interact homogenously with the threads ?\n\n","date":"June 16, 2012 at 4:06 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12578","author":"anoxie","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"Anoxie, very good questions:\n1st. Only if the gases emitted from the body were lighter than air AND flowing in a very low laminar regime.\n2nd. Only partially\n3rd. I think nobody has got a reasonable answer to that.\nIn my view, the major difficulty or if you want to put it like that, the part in Rogers theory that needs further intensive research and reformulation is not in the chemistry of the process but in the very specific conditions that would be needed regarding the motion of gases between body and cloth and as Anoxie points out why a thread reacts chemically and the next one doesn,t.\n\n","date":"June 16, 2012 at 4:46 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12580","author":"Gabriel","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"Quote : “why a thread reacts chemically and the next one doesn’t ?”\nMy answer :  Simply because the evaporation-concentation and the bleaching process would not have leave the same amount of impurities on each threads !  In the light of Roger hypothesis, this is not a great mystery in my mind.  Some anti-Rogers person in the Shroud world have make believe that this was inconsistent with Rogers hypothesis, but I really don’t think it is the case.  THIS IS A FACT THAT THERE WOULD NOT BE THE SAME AMOUNT OF IMPURITIES ON EACH THREAD.  So, if there was not enough impurities on a thread to react with some reactive gas, but there was enough on the next one, I don’t see any mystery in the fact that some threads were colored while the next one was not !!!   In the light of the impurities hypothesis, where is the mystery ???  And, to me, this is the same thing that can explain the fact that there is color on one fiber and not on the next one.  Same principle…  To me, the fact that there is a thread that was colored next to another one that was not (it’s the same thing at fiber level) can well be explain by the image chromophore, if this chromophore is the one postulate by Rogers, i.e. a unequal and non-homogeneous layer of impurities on-top of the fibers located on the top surface of the cloth (on each sides).  There’s a very well-known microphotograph of the Shroud that was taken by Mark Evans and where we can see that the coloration is found almost uniquely on the top-crown of the thread, and disappear when this thread start to drop in order to pass under the next one in the weave of the cloth.  To me, this is pretty consistent with the evaporation-concentration process that, in all logic, would have concentrate more impurities on this portion of the thread (the top-crown) than on the portion that is located more deeply into the weave…  Remember that this evaporation-concentration process was most probably active during the final drying of the cloth (after it was washed), at the very end of the fabrication process, while the weaving of the cloth was finish.  So, I think this non-homogeneous coloration fact first reported by Anoxie and mentioned again by Gabriel is not a mystery at all in the light of Rogers hypothesis and can well be another good indicator that his conclusion about the Shroud concerning the banding effect and the chromophore of the image is CORRECT.  I really think the explanation for this fact can well be found first in the ancient bleaching process that would have leave a non-homogeneous amount of impurities on the fibers and also (and maybe more) in the evaporation-concentration process that was going on at the end of the fabrication of the cloth.  Some experiments done with a linen cloth that would contain some carbohydrates impurities on-top of the fibers should be done in order to verify if my estimation is correct concerning the effect of the bleaching and the effect of the evaporation-concentration process at thread level and also at fiber level…\nAnd Gabriel, when you answer “only partially” to the second question concerning the symetrical properties of the frontal and dorsal image, can you explain to me on what do you base your answer ?  Since we don’t know the exact conditions that prevailed inside the tomb and inside the Shroud, I think it’s hard to answer properly to a question like that.  Who knows if some very particular conditions could have caused the formation of these 2 images with the gas diffusion proposed by Rogers ?  I agree that, at first sight, the dorsal image seem to be much more difficult to explain with the gas diffusion hypothesis of Rogers, but again, who knows if some very particular conditions could have played a facilitating role for the image formation of the back part of the body ?  I think we should be extremely prudent here and leave the door open.  I think Gabriel was able to do so, but I would like some precision about is used of the word “partially”…  Thanks !\n\n","date":"June 16, 2012 at 6:44 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12614","author":"Yannick Clément","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"Yannick, I answered “partially” because there seems to be a certain consensus that in the back image a contact mechanism played a partial role. This doesn’t seem the case for the frontal image. However, despite the difficulties I see at this moment, honestly, I admit that you might be right because, I don’t have a direct access either to the Shroud (as Rogers had) or to any other material…. My intention with my comments was only to raise some difficulties I see from my own expertise……but I find myself unable to reach a comprehensive model for the Shroud. In this sense I am open to any explanation and currently, in the ranking of theories, Rogers’ is in a rather good position.\n\n","date":"June 16, 2012 at 7:44 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12617","author":"Gabriel","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"Thanks for this clarification Gabriel.  I understand your point of view and agree also with you regarding the high ranking we must give to Rogers hypothesis (not theory !).  Aldo Guerreschi’s imagery experiment have proved that there’s also some real 3D information in the back image, of the same nature than we see in the frontal image, but more minor because there was a closer proximity between the body and the cloth there, I don’t think we must start to look for a different process of image formation for the back image.  And I don’t think it is completely excluded that some diffusion of amines gas from the pores of the body, as proposed by Rogers, or from the surface of the skin, as proposed by Heimburger, could not have been the principal cause for the image of the back on the Shroud.  Serious experiments should be done in order to test that hypothesis, especially for the image of the back…\n\n","date":"June 16, 2012 at 8:01 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12619","author":"Yannick Clément","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"One question for Gabriel :  What is your expertise ?  What do you do for a living ?\n\n","date":"June 16, 2012 at 8:37 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12621","author":"Yannick Clément","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"Which gases emitted from the body are lighter than air ?\nLaminar regime applies to fluid dynamics. Can the molecules emitted from the body be modelled by a fluid (i.e. so dense to be a continuum) ?\n\n","date":"June 16, 2012 at 9:14 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12598","author":"anoxie","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"1st question: I don`t know\n2nd question. Definitively yes.\n\n","date":"June 16, 2012 at 9:34 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12599","author":"Gabriel","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"1/ I hardly see a gas emitted from the body lighter than air.\n2/ I thought laminar regime concerns air, few amines released guided by air laminar flow, question is air flow modelling between body and shroud\n\n","date":"June 16, 2012 at 10:34 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12603","author":"anoxie","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"Note :  This present comment is dedicated to Daveb and every other person in the Shroud world who would be tempted to say, like him, that since no one has ever been able to reproduce the image on the Shroud, it’s more likely due to a miracle (a by-product of the resurrection of Christ is the most popular of these kind of hypothesis).  A now there is a trend right now to think that way but I completely disagree with this kind of thinking.  And please, take a VERY GOOD NOTE of what Ray Rogers said about this kind of thinking (you’ll find his quote near the middle of this comment).\nEveryone’s ready ???  OK, here we go :\nIn many interviews he made, my friend Barrie Schwortz said that any hypothesis that is based on a supernatural event like the resurrection of Christ will forever be impossible to confirmed scientifically, for the unique reason that we can’t go into a laboratory and resurrect people to see what kind of images we can obtain on a linen cloth !!!\nStarting with this very true comment made by Barrie, I want to push the reflection one bit further…  I would say this :  It’s also true that no scientist on this planet right now can have access to a fresh crucified body that was beaten, tortured, scourged and crowned with thorns, prior to his death, go into a laboratory with that corpse, put it in a linen shroud made exactly with the ancient method described by Pliny the Elder and remove it after 36 hours to see what kind of images we can obtain !!!  \nIn the Shroud world, it’s like almost everybody have forgot this basic fact when it comes to talk about the formation of the body image on the cloth !  And I think it’s THE major reason why science cannot give us a real solid conclusion about the formation of the body image that we see on the Shroud of Turin.  That’s also why nobody has ever been able to reproduce the Shroud of Turin !  Effectively, the only way to do this would be to make the kind of realistic experiment I just described and, of course, it’s totally impossible here and now !  Nevertheless, if one day someone can do the kind of realistic experiment I just described with the same “material” that was most probably present in a tomb of Jerusalem almost 2000 years ago, I really think that this person would obtain an image on the cloth.  I don’t know if this image would be as good and precise as the Shroud of Turin, but I’m almost certain that we would obtain something and that this “something” could well be close to the Shroud image, physically and chemically.  That’s my deep feeling.  Of course, because of the non-ethical and truly disgusting aspect of it, let’s pray that no doctor Frankeinstein will ever try this kind of realistic experiment !  But anyway, I truly believe it’s the only way someone could reproduce a complete frontal and dorsal body image, like we see on the Shroud, with any kind of success…  And because of that, it’s very probable that this body image will never ever be reproduced successfully one day.  Also, noticed that this kind of experiment was not done, obviously, by Jackson or any other member of the STURP team when they were testing a lot of different image formation hypothesis !  And I think that’s precisely why they come up empty !!! \nI often hear this argument :  If the body image on the Shroud would have been caused by a natural phenomenon, we would have other examples of body images present on a burial cloth.  But this argument is very weak in fact, for 2 major reasons : 1- The vast majority of the burial shroud that were used in ancient time have been corrupt along the dead body they covered.  And 2- Even in the few cases were ancient burial garments (or just parts of burial cloths) have been excavated by archaeologists, absolutely none of these cloths can pretend to have been used to buried a crucified body that was beaten, tortured, scourged, crowned with thorns prior to his death.  As I said in my last comment, it’s very important to understand that the corpse that was present in the Shroud for less than 36 hours or so was NOT a normal corpse !  It was a type of dead body that we don’t find since the time of the Roman emperor Constantin (first half of the 4th century) !!!  Now, as I know, there is absolutely no other burial shroud that was used to buried a crucified man that have been found anywhere !  Because of all these facts, I think we can totally discard the weak (and almost fallacious) argument mentioned above.  \nIf, as I think, the type of body image that is on the Shroud can only occurred if there are very special factors present (the most important ones are, of course, the fresh body of a crucified man along with a linen shroud made the ancient way), then isn’t it normal that the Shroud of Turin is the only artefact of that kind in the world ?  I really think so !  And that’s precisely why I’m not surprised at all that this burial cloth is the only one of his kind in the world…  The only thing that surprise me is the high quality of the body image that is on the cloth, but even that should not lead us to automatically conclude that a miracle (in this case, a by-product of the resurrection of Christ is the most popular claim) should have been involved during the image formation process in order to get the result we see on the Shroud !  Rogers talk about that kind of bad thinking in his book and it is important to read what he said about that : “In seeking an understanding of the Shroud, you will often see the statement “Science can not explain the image; therefore, it was produced by a miracle.  The Greek recognized the fallacy of an “argumentative leap” (non seguitur) millenia ago.  The fact that science has not YET found an explanation PROVES NOTHING.  Science continually collects observations and information, and conclusions OFTEN CHANGE with time.  Persons who believe in absolute will be unhappy with science.  Scientists will be unhappy with persons who demand that they “make up your minds”.  I have been called “frivolous” for modifying earlier ideas.  It is just part of the job.”  And then, Rogers quote Carl Sagan’s famous phrase that fits perfectly well with the situation of the Shroud of Turin : “Absence of evidence is not the same thing as evidence of absence.”\nWhat Rogers said is so true !  Personally, I call this thing “the God of the breach” and I think this kind of bad postulate has completely pollute sindonology since his early days at the beginning of the 20th century, but even more, it seem to me, since the STURP team said that they were not able to find a solid conclusion to explain the body image.  As Rogers said, the fact that science has not YET found an explanation PROVES NOTHING at all folks !  But despite that reality, we have seen a great number of people, sometimes authentic scientists (who happen to be all Christians by the way), fall in this unscientific trap !!!  That’s really sad, but that’s true and that’s the major reason why sindonology has lost a lot of his credibility today…\nEven if I know some people don’t like to hear this, I’ll say it again :  In some cases, nature can really be surprising !!!  And I really think that this could be the main reason why the body image on the Shroud looks so “perfect”, even if it’s not completely true (the fact that there’s some part of the body that are missing, like the back of the knees, confirm this).  That’s my profound feeling, based on the data we know about the Shroud (that doesn’t necessarily contradict the idea that this image was produced naturally) and, also, based on Ray Rogers work (who offered a complete natural hypothesis that can really account, at least partially, for the image we see on the Shroud).  \nTo conclude this comment, I want to say this :  Like I said before, it’s evident that the kind of realistic experiment (made with a real crucified corpse) that I mentioned above is impossible to do.  But beside that, there’s one realistic experiment that could be done and that could help greatly to confirm or discard Rogers conclusion about the Shroud.  The experiment I have in mind is this :  It would be a very good thing is someone can recreate another shroud like the Shroud of Turin using the same exact method described by Pliny the Elder, in order to see if some banding effect would be present or not on the cloth !!!  I’m sure there are some textile experts specialised in ancient textile that would be skilled enough to do this kind of experiment and I really think that a realistic reproduction like that could help a lot to shed light on the Shroud of Turin.  I really wonder why no one has ever done this until this day…  Personally, I don’t see any good reason that can prevent someone to do this !  Let’s hope some textile expert could do it one day.  In my mind, the sooner, the better !!!  While we all wait for the Vatican to allow a new series of direct researches on the relic (this can take a long time), I think this kind of textile experiment would be one of the best experiment to do right now, because it don’t need some sample from the actual Shroud and also, because, technically, I’m sure it would not be so hard to do for some expert in that matter…  What do you think of my suggestion of textile experiment ?  I have other interesting experiments in mind (most of them to test some biological products and the way they could react with ancient linen), but I think this one really should be done fast.  Too bad I’m not a scientist…\n\n","date":"June 16, 2012 at 6:59 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12615","author":"Yannick Clément","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"One more thing about my experiment proposition :  I think this kind of textile experiment should really focus to verify closely the kind of impurities that would be present on the fibers, where those impurities would be concentrate in the cloth (at thread level and also at fiber level), if there would be a concentration of those impurities on each sides of the cloth’s surface, if there would really be a banding effect similar to what is seen on the Shroud, if it would be possible to find ghosts of impurities stuck in the sticky tapes that would be applied to the surface with the same amount of pressure than what was done on the Shroud in 1978, etc., etc., in order to see if this ancient method could produce a linen cloth very similar or not versus what we know about the Shroud.  I think this kind of textile experiment would give us a very good view about one of Rogers most important aspect of his hypothesis (not theory !).  This kind of experiment would be much more “productive” in my opinion than some doubtful imagery experiments that are done these days in order to confirm the presence of writings and images of objects (like flowers, coins, etc.) on the Shroud…  That’s what I think !\n\n","date":"June 16, 2012 at 8:12 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12620","author":"Yannick Clément","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"My quick response to Yannick’s comments is one I gave earlier in the year when a similar topic was discussed. \nThe way to set up an experiment of this type is to start small scale with a range of variables.  It might mean include traumatising lab rats to simulate some of the chemistry features of human trauma, not for the squeamish, or the antivivisectionists.  You don’t need expensive full scale 4m cloths, but you probably need small linen cloths manufactured along what is know of ancient linen methods.  You can try the tautly bound cloths favoured by MPH, and you can try the simple fold-overs on a flat slab.  You can try induction coils to simulate electric and magnetic impulses.  There’s all sorts of things that can be tried on a small scale. \nBut until someone is willing to invest time, money and experimental skills, everything else is idle speculation, hot air and whstling in the dark!\n\n","date":"June 16, 2012 at 9:10 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12623","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"I agree mostly with what you say but if an experiment is not done with a real burial Shroud like the one in Turin and not with a real traumatized body, I really think there will be a high risk of false negative or false positive results versus the reality of the Shroud, depending of the lecture that would be made of the results. In the end, like the results that were obtained by Rogers with his 2 preliminary experiments, the important thing would be the interpretation that would be made of the results and this is where there is often problems in science.  The problem is not so much in the results, it is often in the interpretation of these results !  In the case of Rogers experiments, if someone read his result while thinking this was a real attempt to obtain an image exactly like the Shroud, of course he will conclude that his hypothesis cannot be applied to the Shroud, but that would be a very bad lecture of the results.  I think small scale experiments like you proposed would be cool but only if the scientists involved in it would not pretend to reproduce the Shroud’s image with these kind of tests…  The best thing would be to make some textile tests to verify some particular aspects of Rogers hypothesis, especially those concerning the banding effect and the image chromophore.  That is surely feasible.\n\n","date":"June 16, 2012 at 9:49 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12624","author":"Yannick Clément","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"Aren’t we forgetting something? The Shroud image is a pseudo-negative, one that photography converts to something that is indeed almost photograph-like – but for the luminous ghostly quality. \nNowhere is this crankish ‘vaporograph’ hypothesis do I recall there being any proper attempt to explain how it might produce a negative image. \nLet’s see now. How might that work? Oh yes, the closer the cloth to the skin, the smaller the distance the amines have to travel (by unexplained laminar flow, rather than random walk diffusion) and hence  the more intense the imaging of bony prominences etc. But if that were the case, then why are the eyelids so well imaged, despite being set low in bony sockets? \nWhy is the subject’s back not better imaged than the front, given it has the benefit of body weight to give better contact with cloth, reducing distances of separation?\n Where’s the heat coming from to initiate Maillard reactions between amines and reducing sugars? Let’s not forget that Maillard reactions are more commonly known as “browning” reactions – the ones that give toast a golden-brown colour. Ever tried producing toast by not bothering to switch on the toaster, because one is not in a hurry?\nThere is so much that is wrong with the vaporograph hypothesis that one hardly knows where to start… But then, as I said earlier, it is a crankish hypothesis, and one I confidently predict will never reach the status of theory… But it keeps Dan’s hit meter total racking up nicely. I think Dan should make a present to Yannick when it shortly reaches a million. An electric toaster without a plug or heating element might be appropriate…\n\n","date":"June 17, 2012 at 1:38 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12626","author":"colinsberry","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"I can’t see how a gas diffusion model (which would be random walk as Colin says, even under laminar flow conditions) could ever produce a sharp image; there has to be something else as well.  Maybe the eyelids are well-imaged because there are coins on them making contact with the cloth (I can’t see eyelashes, but you can see other hair!).  Maybe the back’s not so well-imaged because he was on his side because his legs were bent in rigor mortis, but then there’s no lateral image either!  \nSomething else?  earthquake with release of radon gas? – storm and lightning strikes with electric and magnetic induction?  Maybe complemented by iron bearing rock?  It’s all speculation. \nAll we have is an image we can’t explain, theories, untested hypotheses, no meaningful, certainly not conclusive experiments.  We know nothing! A lot of hard work, a lot of hot air, nothing to show for it! Only the image!\n\n","date":"June 17, 2012 at 6:20 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12630","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"“vaporograph hypothesis” :\n– macroscopic gas flows convey amines : there must be a gradient of temperature between body and air, amines must have been released and reacted before the end of convection flows.\n– thermally driven convection flows are modelled according temperature gradient around the body and boundaries conditions (shroud – skin).\n– convection cells size have to be inferior to image resolution.\nFirst point is to describe the temperature field around the body, and  I can’t see why this gradient should be vertical. Cold air is ambient air surrounding the body and the shroud. Temperature field should be complex and boundaries roughtly orthogonal to skin and shroud.\n\n","date":"June 17, 2012 at 7:16 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12631","author":"anoxie","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"Guys…  Guys…  You talk with your preconceive notion of what a diffusion of gas could produce on linen !!!  You seem to completely neglect all the quotes I gave you from Rogers book !  I’m starting to think that I’ve done all this research for nothing !!!\nAgain, I have to recommend you to look closely at the report I made concerning the 2 preliminary hypothesis done by Rogers before he died in 2005.  You’ll find this report here : https://shroudofturin.wordpress.com/2012/06/14/gas-diffusion-and-the-banding-effect/#comment-12512\nCan you read that again carefully please ?  The results were well enough encouraging for him (in comparison with the physical and chemical properties of the Shroud’s image) that he never consider dropping this hypothesis to start searching elsewhere for a better explanation.  Like I said, that says a lot to me, because if those experiments would have gave him results very different versus the known properties of the image on the Shroud, you can bet your house that he would have been the very first one to start looking for something else.  On the contrary to many researchers in the Shroud world today, Rogers had absolutely no religious agenda to defend and promote.  He was completely free to change his mind and history has showed us that he did change his mind about the Shroud on more than one occasion !  This fact talk very loud to me.  Since it’s a reality that Rogers never feared to change his mind, why do you think he never changed his mind after he first come up with his gas diffusion hypothesis ?  Because he considered that theoretically, this hypothesis could fit realistically with the vast majority of the properties of the Shroud and, more than that, his preliminary experiments gave him results that were good enough for him to continue his researches in that direction.  \nRemember this because I’m convinced that it’s true :  Rogers had absolutely no valid reason to defend his hypothesis if, in his mind, the probability that it could fit with the Shroud was low.  In that case, he would have search for a better explanation.  He did not.  That doesn’t tell you something ?  Rogers followed the scientific method and that’s where the facts and observations regarding the Shroud have led him…  Meditate on that.\nI think we should wait for another chemist to do more testing concerning Rogers conclusions before even thinking about throwing it to the garbage.  It would be a great mistake to do this.  I know very well that this is what the members of the supernatural fringe really wants, but sorry for them, Rogers hypothesis rank among the very best hypothesis of image formation we have right now, so it’s not today or even tomorrow that Sindonology will have the right to forget it completely…  More researches need to be done before anyone will have the right to do so.\nAnd for those of you who still think that the Shroud was produced by the resurrection of Christ, I recommend you to read again my other comment here :  https://shroudofturin.wordpress.com/2012/06/14/gas-diffusion-and-the-banding-effect/#comment-12615\nI have nothing more to say…\n\n","date":"June 17, 2012 at 5:12 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12647","author":"Yannick Clément","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"I have just discovered a fascinating comment on image formation in Jack Markwardt’s 1998 paper “Antioch and the Shroud” at note 91: It suggests that the image may have taken up to 100 years to form, even longer, possibly as a result of bacteria. \n“91. The cloth’s early historical anonymity could be simply explained if, during that period, it was not known to exhibit an image. Although Wilson noted that botany specimens could develop, in seventyplus years, into “strikingly precise images in a sepia color closely akin to that of the Shroud”, he discounted all image formation processes that could not have been completed within the thirty-six hour entombment of Christ’s body. Wilson, The Shroud of Turin, p. 247. In 1981, S. F. Pellicori produced an image on linen sensitized by contact with a body covered in myrrh, olive oil, and skin secretions and theorized that the sindonic image had developed over a period of decades or centuries. See Drews, p. 19, citing S. F. Pellicori and M. S. Evans, The Shroud of Turin Through the Microscope, 34 Archaeology, pp. 34-43 (1981). In 1993, Dr. Leoncia Garza-Valdes suggested that bacteria had not only invalidated the results of the Shroud’s carbon dating, but had also formed the sindonic image over the course of a century. Garza-Valdes, pp. 56-57. Were an image not readily observable after the Resurrection, the Shroud’s earliest custodians may well have believed it to be only a blood-stained burial cloth, folded it, and hidden it away with other Passion relics, the image\nthereby being permitted to develop unperceived until the cloth was extracted from  concealment.”\nMore speculation – We don’t know!\n\n","date":"June 17, 2012 at 8:40 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12648","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"If there had been enough bacterial growth to have slowly produced am image under somewhat less than ideal conditions (lack of liquid water being the most obvious) then surely the blood stains would have been the first body fluids to have been utilized. \nAfter all, but for absence of liquid water, dried blood represents a nicely balanced nutritional broth for the growth of bugs – with proteins, sugars, mineral salts, vitamins etc. So where there was once blood we would now expect to see either the remains of bacterial cell walls, easily identifiable by their markers, e.g. diaminopimelic acid, or, if totally degraded, nothing except a pale or maybe rust-coloured patch with a high concentration of iron and other mineral salts. But we are assured that the bloodstains are real blood, not just iron oxide etc and blood moreover that has retained its red colour over two millennia thanks to a fortuitous association between relatively-intact haemoglobin and bilirubin. \nOne cannot have it both ways. Either one has blood that is amazingly resilient to microorganisms over centuries of exposure to air, not always bone dry, OR blood (and other bodily fluids) that served as a growth medium, allowing an image to develop slowly.\n\n","date":"June 18, 2012 at 2:22 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12659","author":"colinsberry","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"That seems like a fair comment, Colin.  It’s Valdes who postulated that it might be bacterial.  But are there other non-bacterial processes that could form the image slowly?  It was Pellicori who Markwardt says formed an image on linen sensitised from a body with some concoction, and yet says it may have taken years.  May need to go looking for Pellicori’s paper.  I wonder what process is involved for obtaining images of pressed botanical specimens – we used to do it in primary (grade) school?\n\n","date":"June 18, 2012 at 4:57 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12666","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"Yes, daveb, and the first to consider in your ‘non-bacterial’ processes are of course those that rely on fungi. The latter can reproduce without needing a liquid medium, like bread mould, through creating  a mat aka trophic mycelium. In fact anyone who has stored cloth in a garage will know that mould (“mildew”) can attack fabric without it becoming obviously wet. What’s more, there are fungi that secrete cellulase enzymes that can break down cellulose – so folk are right to wonder how the Shroud can have survived so long, given that it spent much of its pre-radiocarbon existence ;-) under unknown but probably less than ideal storage conditions.\nIn fact, I am presently planning some experiments to explore the interface between thermal and chemical imprinting. A recent paper has shown that writing in invisible ink using lemon juice does not depend on the presence of cellulose or other carbohydrates, including presumably the more reactive hemicelluloses – as shown by a brown coloration on heating in glass-only containers. \n But that does not preclude additional chemical modification, e,g, dehydration, cross-linking and caramelisation occurring too. I shall be looking to see whether linen can be thermally imprinted at lower temperatures if plant-derived substances, acidic ones especially – are included, perhaps giving a softer more Shroud-like image. Any resulting image may be dependent on chemicals that are non-intrinsic to linen as well as to heat (with faint echoes of Rogers&Yannick and their “impurities” – but relying on direct physical contact rather than gaseous diffusion).\n   It may be the latter, ie non-intrinsic chemicals, combined with occasional high ambient temperatures, that explain the slow formation of leaf prints etc. and maybe the Shroud too. We shall see. Doing experiments beats endless wrangles over the Pray Codex any day (though I see my single contribution to the latter debate is now on page 1 of Google returns, yaboo sucks to my detractors on that appalling Jones site :-).\n\n","date":"June 18, 2012 at 6:27 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12667","author":"colinsberry","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"The process for image of plants on paper is called “Volckringer Pattern” and it’s one true possibility for the image formation process.  I higly recommand you to check out the website of John De Salvo because it’s an hypothesis he defend and explain pretty well : http://www.gizapyramid.com/lecture-shroud1.htm\n\n","date":"June 18, 2012 at 8:31 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12669","author":"Yannick Clément","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"Concerning this Volckringer pattern hypothesis, I don’t think it’s necessarily in contradiction with Rogers hypothesis.  On the contrary, a think there’s a real possibility that these 2 processes could have acted together inside the Shroud.  When Rogers was telling that there could have been some other chemical processes at work, I think this hypothesis defended by De Salvo can really be one of them…  The most interesting thing about this Volckringer pattern process is that it can create images of recently dead biologic things (plants, flowers, etc.) that contain a real 3D information encoded in them.  To my knowledge, that’s the only known natural images that contain such a real 3D information, pretty much like the Shroud’s image.\n\n","date":"June 18, 2012 at 10:42 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12673","author":"Yannick Clément","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"\nYannick Clément :\nI really think the explanation for this fact can well be found first in the ancient bleaching process that would have leave a non-homogeneous amount of impurities on the fibers and also (and maybe more) in the evaporation-concentration process that was going on at the end of the fabrication of the cloth.\n\nOk, but it’s binary. One thread is colored the next one not, all lenght long, that’s not a simple non-homogeneous bleaching.\n\nYannick Clément :\nWe can easily see that what was reported here by Anoxie is not true at all.\n\nI said he didn’t explain the high resolution, not that gas diffusion could not explain high resolution.\nThat said :\n\nYannick Clément :\nDiffusion DOES NOT MEAN the same thing as “diffuse”. The mean free path of a molecule will determine his its diffusion properties. The mean free path is the distance the molecule will go between collisions with other molecules. Such calculations show that molecules can not go very far unimpeded at NORMAL temperatures and pressures. The potential for IMAGE RESOLUTION IS QUITE GOOD.\n\ne.g. NH3 diffusion speed : 645 m/s at 25 °C, even a molecule 10000 th times heavier would go 6.5 m/s. And diffusion is isotropic.\nBut maybe did Rogers write few equation to describe his idea. So far I can’t see how Graham’s Law is consistent with high resolution.\n\n","date":"June 18, 2012 at 12:32 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12676","author":"anoxie","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"You said : “One thread is colored the next one not, all lenght long, that’s not a simple non-homogeneous bleaching.”  That’s not true.  The color on a thread is concentrate mainly on the top-crown of the weave and start to disappear when the thread go more deep into the cloth in order to pass under another thread.  Threads and fibers on the Shroud are NOT colored homogeneously at all, which is a fact that is consistent with the evaporation-concentration of impurities that were left on the fibers during the fabrication of the cloth…  All this is totally consistent with Rogers global hypothesis concerning the Shroud.  If it was not, he would have simply drop his hypothesis and start to look elsewhere for a better answer.\n\n","date":"June 19, 2012 at 10:41 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12706","author":"Yannick Clément","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"Erratum :\nI gave molecule speed not gas diffusion speed. Actually there can be a steep gradient as Rogers said.\n\n","date":"June 19, 2012 at 10:55 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12709","author":"anoxie","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"“… he would have simply drop his hypothesis and start to look elsewhere for a better answer.”\nOh dear, Yannick. Entire textbooks could be written on scientists who have become wedded to a particular pie-in-the-sky hypothesis, one which their contemporaries recognized as palpable nonsense from the word go. Because of their fixation with remote possibilities, their entire life’s work, including the creditable bits, tend to be ignored or written off …   Don’t ask me how, but science somehow manages to muddle through – despite scientists… Science is a balancing act between the world of ideas and cold hard reality. One could suggest that the successful scientist has to be a touch schizoid to live in both those worlds simultaneously, having to shuttle back and forth on a daily basis… No wonder people say that scientists are mad…\n\n","date":"June 19, 2012 at 11:05 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12710","author":"colinsberry","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"I understand your point of view, but, in Rogers case, never forget that he did change his mind about the Shroud more than once.  That’s a proof that he wasn’t an integrist like some others sindonologists…\n\n","date":"June 19, 2012 at 1:01 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12713","author":"Yannick Clément","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"Yes, Ray Rogers was a one-off, and it is mavericks who occasionally make the quantum leaps in science. \n But in the final analysis, towards the end of his life, Rogers disappointed with some highly tendentious views on image imprinting mechanism and on carbon-dating –  ones that just happened to play into the hands of the authenticists…\nThere is a major flaw in the ‘authenticist’ view of the Shroud that I am exposing right now on my own site. It’s to do with the so-called scourge marks (shame that the punishment end of the Roman flagrum with its flesh-mushing lead spheres was not connected to the handle or even its linking strap).\nhttp://shroudofturinwithoutallthehype.wordpress.com/2012/06/19/shroud-scope-8-372-impossible-scourge-marks-surely-on-the-shroud-of-turin/\n\n","date":"June 19, 2012 at 1:22 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12714","author":"colinsberry","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"\nYannick Clément :\nWhether Rogers is correct or not about heavy amines gas (personally, I think it’s very probable that there was at least some ammoniac gas coming out of the nose and mouth from the lungs), we must understand that the parallel (or complementary) hypothesis proposed by Thibault Heimburger in one of his paper could also have taken some part in the image formation process of the body and of the hair.\n\nCan you give the reference/link of Thibault Heimburger’s paper on this issue ?\nThank you.\n\ncolinsberry :\nBut in the final analysis, towards the end of his life, Rogers disappointed with some highly tendentious views on image imprinting mechanism and on carbon-dating –  ones that just happened to play into the hands of the authenticists…\n\nDo you mean Rogers was an authenticist ?\n\n","date":"June 20, 2012 at 4:02 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12751","author":"anoxie","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"I have made a quick research and the paper written by Thibault Heimburger where he made a fine analysis of Rogers hypothesis and where he proposed a complementary hypothesis was only published for the Shroud Science Group in 2007.  Thibault was nice enough to give me a copy of his paper some years ago.  Unfortunately, this paper was not published in a scientific paper and it is not avalaible on the internet…  Really, it’s too bad !  It would be nice if one day, this paper can be avalaible on the website of Barrie Schwortz !!!  Barrie, I hope you’ll try to get it for your website !!!\n\n","date":"June 21, 2012 at 1:01 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12863","author":"Yannick Clément","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"That would be great !\nIn the meantime, could you summerize his conclusions or major contributions to Rogers hypothesis (gases, resolution, 3D properties, distortion) ?\nThank you,\n\n","date":"June 21, 2012 at 3:33 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12870","author":"anoxie","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"Give me some days and I’ll get back to you about that (probably over the week-end)…\n\n","date":"June 21, 2012 at 3:35 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12871","author":"Yannick Clément","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"First, I want to reprint a comment made by Dan Porter himself on this blog at the beginning of the year, where we were able to read a personal email from Ray Rogers to Dan about the high-resolution and the the tridimensionality aspect of the body image on the Shroud.  That email from Rogers is like a complementary comment from him versus all the other quotes I’ve already wrote down recently in the long comment you can read at the top of this page and in other recent comments I’ve made on this blog.\nHere’s what Dan wrote :  As most of you know, if you read the many threads of discussion in this forum, Yannick Clément is the strongest and most articulate proponent of Rogers imaging work. I won’t even try to summarize his views. Just go browsing. Rather, I still have a copy of an email I received from Rogers on January 4, 2004. It read, in part, in this version as posted to the Shroud Science Group :\n“Dear Dan and Researchers:\nJust to clear up a few items. . . .\nFairly thin stagnant zones of gas form near fixed surfaces. Other gases that approach such zones must diffuse through the stagnant gas to reach the surface. Diffusion of gases through other gases is modeled with Graham’s Law of Diffusion. The rates of diffusion are inversely proportional to the square roots of the densities of the gases. Diffusion parallel to the surface of a cloth that covers a body can not be instantaneous, and it will be much slower for heavier molecules. The main products of body decomposition after a few hours are quite heavy molecules.\nIn the context of image-formation hypotheses that involve reactive gases, remember that cloth is porous. Gases diffusing to the surface can pass through the pores and be lost. [This fact is probably responsible for the image color on the back of the cloth in the area of the hair. Matted fibers inhibit the diffusion of gases.] This phenomenon will restrict vapor concentrations as a function of the distance from contact points where a body touches a cloth.\nCloth surfaces are active and adsorb gases rapidly, a fact that further limits concentrations as a function of distance.\nJohn Jackson’s mathematical analysis of image resolution suggested that no single, simple molecular-diffusion or radiation mechanism could produce the image observed. However, a combination of systems could offer an explanation, e.g., anisotropic heat flow by radiation from the body to the cloth, attenuated heat-flow in the cloth, gaseous diffusion, convection, surface properties of cloth, and the dependence of chemical rates on temperature.”\nNow, it’s up to you to believe Rogers ideas or not !!!\n\n","date":"June 22, 2012 at 6:39 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12936","author":"Yannick Clément","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"Note :  this is a little complementary comment for the one I’ve posted just above…  I just realized that I forgot completely to add one important paragraph writen by Dan, just before he wrote « As most of you know… », like you can read above.  Here it is :\n“Ray Rogers was acutely aware of the resolution issue when he proposed a chemistry-only solution, a Maillard reaction, as the cause of the image.  His work (not in my mind yet a fully formed hypothesis) has since been improperly and unfairly characterized as merely a diffusion hypothesis (e.g. totally and inappropriately misrepresented in Giulio Fanti’s most recent paper, “Hypotheses Regarding the Formation of the Body Image on the Turin Shroud.  A Critical Compendium,” in The Journal of Imaging Science and Technology, (Vol. 55, No. 6 060507-1-060507-14, 2011)).”\nI have to say that I agree completely with Dan’s point of view, especially concerning the fact that Rogers hypothesis was just in his preliminary form when he published it, as he was still working on it, just before he died in 2005.  As I said before, it would be so good to see another chemist expert taking over Rogers work and push it forward !!!  A biochemist would be the best person in my mind to take over Rogers work and do more experiment to analyse this hypothesis further.  Who knows, maybe this person could come up with an extended version of the hypothesis proposed by Rogers while adding some other chemical processes in it, like the one proposed by Thibault Heimburger involving urea on skin or the one proposed by John De Salvo involving a process pretty much like the Volckringer pattern, involving lactic acid.  At the very least, this chemist should consider seriously these complementary hypotheses and look if they could not have acted simultaneously, along with the chemical process proposed by Rogers…\nAnd for the Anti-Rogers crusade lead by Fanti, I don’t have much to say.  It’s so evident that this guy was pissed off when Rogers crushed down his personal hypothesis involving a Corona discharge, that any person interested in the Shroud of Turin should never take what he write against Rogers seriously…  One thing’s for sure, I don’t expect Fanti to change his mind soon !!!  On the contrary to Ray Rogers, it seem an impossible mission for him to do so, even if all the evidences we now know about the Shroud go against his idea concerning the image formation process !!!\n\n","date":"June 23, 2012 at 4:25 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12974","author":"Yannick Clément","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"His work (not in my mind yet a fully formed hypothesis) has since been improperly and unfairly characterized as merely a diffusion hypothesis (e.g. totally and inappropriately misrepresented in Giulio Fanti’s most recent paper, “Hypotheses Regarding the Formation of the Body Image on the Turin Shroud. A Critical Compendium,” in The Journal of Imaging Science and Technology, (Vol. 55, No. 6 060507-1-060507-14, 2011))\nIs the article freely available ?\n\n","date":"June 25, 2012 at 2:21 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-13031","author":"anoxie","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"I found the article on the net :\n“Hypotheses Regarding the Formation of the Body Image on the Turin Shroud. A Critical Compendium” G. Fanti.\nThe paper didn’t explore properly Rogers’ hypothesis.\n\n","date":"June 25, 2012 at 4:11 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-13032","author":"anoxie","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"This present comment of mine was initiated from a recent request made by Anoxie that you can read here : https://shroudofturin.wordpress.com/2012/06/14/gas-diffusion-and-the-banding-effect/#comment-12870\nInstead of making a proper summary of Thibault Heimburger’s 2007 paper entitled “The Image on the Turin Shroud : Analysis of the Maillard reaction hypothesis”, I will just summarise, in my own words, the conclusions we can find in this interesting paper.  A complete summary of this paper, along with the comment I would make, would produce a much too long comment ! ;-)   \nBefore doing so, I want to make a short summary of the main purpose of this paper :  In fact, Thibault made a good documentary research in specialised papers, in order to learn if the heavy amines postulates by Rogers in his hypothesis could be produced by a fresh corpse in sufficient quantity and fast enough (before the apparition of the first liquids of putrefaction some 36 to 72 hours after death) to account for the body image we see on the Shroud.\nHis research leads him to conclude that no amines (particularly the heavy amines named “putrescine” and “cadaverine” proposed by Rogers) could be produced IN a fresh corpse in sufficient quantity before the first liquids of putrefaction, in order to satisfy the time/space/amount necessary conditions for the formation of the body image.  In other words, NORMALLY (this word is important), a fresh corpse is not supposed to emit a great quantity of these heavy amines from every pores of the skin during the first 36 to 72 hours after death.  And, more than that, Thibault found that these amine gases should NORMALLY come out of the body almost exclusively by the natural orifices of the body (the nose, the mouth, the rectum, etc.) and should come mainly from the intestine and the lungs.  That should produce a concentration of these gases in some specific places of the body.  That lead Thibault to conclude that this normal production of amines from within the corpse is not compatible to what we see on the Shroud. \nIn a second time, his research lead him to conclude that there was a second option concerning the Maillard reaction hypothesis of Rogers, that can account much better for what we see on the Shroud.  He said that it is PROBABLE, but not demonstrate yet, that if the sweat of the man of the Shroud had contained a large quantity of concentrated urea (note :  when we consider the high traumatic state of the body, this possibility is quite real), the drying of this sweat could have produce an important evaporation of ammonia from every part of the body (and the hair) that can theoretically satisfy the time/space/amount necessary conditions for the formation of the body image via a Maillard reaction.  Thibault also state that if a chemical reaction like that had occurred at the surface of the cloth with a thin layer of impurities, the body image could have taken days, months or maybe even years before it reached his final form (i.e. that the color on the fibers would have developed progressively). \nThibault wrote also a second paper for the SSG, in which he made another documentary research with one main goal :  Learning if the laws of diffusion can account for the body image on the Shroud.  Unfortunately, I never had the chance to read this second part and don’t know what was the conclusion reached by Thibault…  Anyway, I don’t think Thibault”s research about that aspect of the question can really be enough to reject this Maillard reaction hypothesis.  Here, we have to remember the preliminary results obtained by Rogers with his experiments that were good enough for him to pursue his researches about the gas diffusion and prevent him to start to look elsewhere for a better explanation. \nPersonal notes :  Thibault rejected the Maillard reaction hypothesis, in the form proposed by Rogers, mainly on the base of 2 assumptions :  1- That the production of heavy amines from a fresh corpse would have been too much concentrate in some place (where it would come out) and not enough in other places, in order to produced a full-length body image of the front and back like we see on the Shroud.  And 2- That the production of these heavy amines would not have been done in sufficient quantity to start a Maillard reaction at the surface of the cloth.   \nTaking the first assumption, I think Thibault made one possible interpretation mistake when he conclude that, because these amine gases were mainly released by the natural orifices of the body, they would have been too much concentrate around these places and not enough in other places, in order to be able to produce a complete image of the back and front of the corpse on the cloth.  But I’m not so sure about that !!!  If we go back to what Rogers said about the release of amines from a corpse, we can read this : “Gaseous reactive amines can be lost by diffusion through the porous cloth, reducing concentrations and reaction rates inside the cloth.   However, it has long been recognized that the images of the hair, moustache and beard are anomalous.  The density of the image is greatest in those areas.  That can easily be explained by the inhibition of vapor diffusion through a porous mat of hair.  Ammonia is first evolved from the lungs.  Therefore, its concentration would have been highest in the vicinity of the nose and mouth, and its diffusion would have been retarded by the moustache and beard.  By the time heavy decomposition amines appear, the body will have cooled.  The surface area of cloth is large and higher-molecular-weight decomposition amines absorb strongly.  All of these phenomena would cause a RAPID REDUCTION IN AMINES CONCENTRATION AWAY FROM THE CONTACT POINTS AND THE NOSE-MOUTH AREA”.  \nIf Rogers is correct, that means that the gases, even if they would have mainly come from the natural orifices of the body, instead of all the pores of the skin, could have been rapidly transferred laterally to other places over (and under) the body (with a possible global coverage of the entire body).  They would not have been only concentrate around the natural orifices, where they would have first come out, expect maybe, as Rogers said, in the hair, the beard and moustache, where we can expect a more important concentration of these gases, because of the very particular nature of these body parts.  If Rogers is correct, this can theoretically account for the kind of body image that is on the Shroud… And since we don’t know the exact conditions concerning the body and the Shroud and their interaction together, I don’t think we can reject Rogers hypothesis on the single base that heavy amines would only come out of the few natural orifices of the body before the apparition of the first liquids of putrefaction…  Note about this :  Who knows if a part of the amines produced by the dead body could not have come out by the ears ?  This body part too is a natural orifice of the body !  And if it’s true, who knows if that’s not one of the main reasons why so much amines could have been trapped in the hair !  Of course, it’s only a thought of mine and I know the research of Thibault lead him to conclude that amines would principally come out from the nose, mouth and rectum, but I don’t see why some gases could not come out of the ears also…  Who can be certain about that ?  And if there really was some gases coming out of the ears, I think it’s fair to assume that most of it would have been trapped by the long hair and could have contribute (to what extent, I don’t know) for a more dense image of this body part versus the rest of the body image (and maybe also for the second body image of the hair we can see on the backside of the cloth).\nAnd concerning the second assumption made by Thibault, I really don’t think the documentary research he made concerning the production of amines by a dead body has covered all the possibilities that exist, especially when you consider that the dead body inside the Shroud WAS NOT a normal corpse, but was a crucified body that suffered a great deal (and for a long period of time) prior to his death.  In this very odd condition, I’m not so sure that someone has the right to completely reject the possibility that heavy amines could have been produced by this very particular corpse in more quantity and in a faster time than a normal dead body…  That’s why, personally, I’m not ready yet to reject this possibility, even if I have a tendency to believe that Thibault’s complementary (or parallel) hypotheses can well be close to the truth.  In fact, I think it’s truly possible to think that these 2 hypotheses could have acted simultaneously inside the Shroud, i.e. that some reactive gas could have come from inside the body, along with some more gas that could have come from the skin.  WHY NOT ?  Again, we MUST remember the very particular nature of the corpse that was enveloped in the Shroud !!!  \nThat’s a crucial factor in order to evaluate properly the hypothesis proposed by Rogers !  And I think that’s precisely where there was a little “mistake” made by Thibault in his conclusion versus the documentary researches he made on the subject !!!  Effectively, I think he has underestimated the particularity of this tortured and crucified corpse versus the known production of amines from a normal corpse…  I really think it’s fair to assume that the few scientific studies he found on the subject never intended to characterise the production of amines (especially the amount and the speed of this production) coming from a beaten, scourged, crowned with thorns and crucified dead body that had suffered a very high rising of the bilirubin that was in his blood !  In this context, the fact that he based his conclusion on a “normal” production rate can really be irrelevant versus the reality of the Shroud…  That’s really what I think.  In that regard, I think we have to consider both hypotheses is “possible” regarding the formation of the Shroud’s image.\nAnd to conclude this message, let me share with you a little reflection that can help you understand that, in the present state of our medical knowledge, I don’t think we have the right to conclude that a tortured and crucified body would react in the same exact way than a normal corpse :  We know for a fact that rigor mortis would come much faster in the case of a tortured body like the man of the Shroud.  This is a fact and we can even see some clear signs of this in the Shroud’s image, i.e. the bending of the knees (one more than the other), the expended chest, the bending of the elbows, the bending of the head forward, etc.).  In this particular context, let me leave you with this very good question :  If the very particular nature of the corpse that was enveloped in the Shroud was responsible for the fast coming of a state of rigor mortis (that can have been also stronger, as much as faster), than who can really be certain if the production of amine gases from the body could not also have been accelerated (regarding not only the rapidity and the quantity of the gases released but also for the places of the body where those gases were released) ???  WHO CAN REALLY BE CERTAIN ABOUT THAT ???  If you do, please show me a published scientific paper that proves that being tortured for a long period of time and to die of crucifixion has really no effect on the production of heavy amine gases coming from the body after death !!!  Even if I consider it to be very good, I’ve not found anything concerning this crucial aspect of the question in the paper written by Thibault…  I think it’s fair to presume that, concerning this aspect of the question, MORE RESEARCHES ALSO NEED TO BE DONE in order to really know the truth !!!  And I also think it’s fair to say that, in the Shroud world, a vast majority of people (whether it be authentic sindonologists or just interested people like we see here on the blog) have really paid attention to the very particular aspect of the body image on the cloth, but at the same time, those people have greatly neglect the simple FACT that the corpse that was most probably at the heart of this body image formation had a very particular nature too !  I think that’s a big mistake to underestimate, neglect or simply forget that important FACT when it comes to reflect upon the body image on the Shroud, because I really believe that one cannot go without the other !  In other words, I personally think that one (the nature of the corpse) can really help to explain the other (the body image on the cloth)…  Reflect upon this folks !\nFinal note :  If you want to read the sources of Thibault’s documentary research, here they are :\n–Raymond N. Rogers and Anna Arnoldi : “The Shroud of Turin : An amino-carbonyl reaction (Maillard reaction) may explain the image formation”, Melanoidins vol. 4, Ames J.M. ed., Office for Official Publications of the European Communities, Luxembourg, 2003, pp. 106-113.\n–Arpad A. Vass and Al. : “Decomposition Chemistry of Human Remains: A New Methodology for Determining the Postmortem Interval”, J Forensic Sci, 2002, 47 (3): 542-553.\n–W. Bonte and J. Bleifuss : “Postmortem Dating of Putrefied Material Through Ptomaine Estimation, J Forensic Sci, 1977, 22 (3): 558-572.\n–G.A. Talbert, R. Finkle and D. Katsuki, Physiological Laboratory of the University of North Dakota : “Simultaneous study of the constituents of the sweat, urine and blood; also gastric acidity and others manifestations resulting from sweating”, Part III : Urea and Part IV : Amonia Nitrogen (1927).  Note from Thibault :  These published papers were found on the internet, but I could not found the name of the journal.\n–De Lemon PW.R. and Nagel F. :  “Effect of exercise on protein and amino acid metabolism”, Med. Sci. Sport Exerc., 13: 141, 1981.\n\n","date":"June 22, 2012 at 6:45 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12937","author":"Yannick Clément","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"Thank you for these explanations. Ok for considering an extraordinary situation but based on a natural process.\nAs said by Thibault, heavy amines gases may be ruled out.\nMay ammonia diffusion play a central role in image formation ? that was the second part of Thibault’s work. I’ll try to have a serious look on this hypothesis.\nBy the way, wasn’t the body washed before being placed in the shroud ?\n\n","date":"June 23, 2012 at 7:30 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12953","author":"anoxie","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"Yes, a body all covered with ammonia (via heavy sweating) is a very good candidate to be impressed onto a linen cloth….\n\n","date":"June 23, 2012 at 10:29 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12961","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"Thank you Yannick for this excellent summary of my old paper.\nI can furnish it to everybody. Or alternatively to publish it here (how?)\nRegarding the second part of the paper (is the TS image consistent with the laws of diffusion ?), I never finished it. I am not at all a physicist. I only used a beautiful software to try to obtain a mathematical model of what happens in non contact areas. I got some interesting results in the most simple cases but the subject is very complex.\nIs there here a physicist ?\n\n","date":"June 23, 2012 at 12:52 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12972","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"My pleasure Thibault !  This is, in my opinion, the best paper you ever wrote, along with the one where you analyzed the chemical researches that were done on the Shroud by Heller and Adler and also by McCrone.  By the way folks, you can read this one here : http://shroud.com/pdfs/thibault%20final%2001.pdf\nAnd for a publication of your paper here on the blog, why don’t you send it directly to Dan Porter ?  I’m sure he will be happy to post a link on the blog, so that we can download the PDF version directly !!!  Ask Dan about it and I’m sure he will do the job for you.  Also, you really should submit it to Barrie Schwortz for a proper publication on his website.  WHY NOT ?  I’ve already send Barrie a PDF copy of your paper and still wait for him to send me a reply…\nAnd for the image formation process in non-contact zones, I think the 2 preliminary experiments done by Rogers were interesting enough that another chemist should take his work and push it forward !!!  Other natural possibilities also exist and should be verified as well.  But I ask you the question :  Who the hell will want to do that ?  This would really need a proper research program funded by a University (like the funding Fanti received from his own University to do Shroud research) or something like that, because alone, I don’t see any chemist having the time and money to do so…  One thing’s for sure :  Rogers work and hypotheses cannot be at all throw to the garbage right now, in the present state of our knowledge.\n\n","date":"June 23, 2012 at 4:34 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12975","author":"Yannick Clément","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"Yannick, THIS seems quite a bulky change from my bombarding comments in zillion tiny snatches! I’ll read it when I have more time… promised!\n\n","date":"June 23, 2012 at 5:46 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12946","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"You really should…  There’s some interesting stuff in there !!!\n\n","date":"June 23, 2012 at 4:35 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12976","author":"Yannick Clément","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"Quote from Anoxie : “Thank you for these explanations. Ok for considering an extraordinary situation but based on a natural process.  As said by Thibault, heavy amines gases may be ruled out.”\nComment from me :  “May” is the most important word in your statement !  As I said, who knows if a tortured and crucified body would not released more heavy amines and do it faster than in a “normal” case ???  As I also said in my comment, Thibault based his work on scientific study that, I believe, gave us what happen “normally” after death.  I really don’t think these authors will claim that it is proven that a tortured and crucified body would act the same way.  That’s VERY IMPORTANT to remember !  Who can be certain about that ?\nQuote from Anoxie :  “May ammonia diffusion play a central role in image formation ? that was the second part of Thibault’s work. I’ll try to have a serious look on this hypothesis.”\nComment from me :  Here, I agree with Max.  I think that’s truly possible, especially in the case of someone who had sweat a great deal prior to death and also who was severely scourged.  Effectively, the scourging could have caused severe injuries to the kidneys and/or the liver and provoke a high rising of the urea in the blood.  This kind of high rising of the urea (and also the lactic acid) in the blood is a proven thing in the case of severe internal injuries to these organs.\nLast quote from Anoxie :  “By the way, wasn’t the body washed before being placed in the shroud ?”\nComment from me :  I don’t want to start this old debate over again, but I have very good reasons (mainly linked with the nature and the aspect of the bloodstains on the Shroud) to state that the body was not washed before being put in the Shroud.  If I’m right, and believe me I have great confidence that I am, then the complementary hypothesis proposed by Thibault got much more chances to be relevant to the Shroud’s image…  That’s why I truly found his hypothesis very interesting regarding the Shroud and I don’t see why his hypothesis and the one proposed by Rogers could not have acted together (simultaneously) in the Shroud to form the body image we see on the cloth.  I really don’t see any good reason to reject this very interesting possibility.\n\n","date":"June 23, 2012 at 4:43 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-12977","author":"Yannick Clément","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"The Man of the Shroud was INDIRECTLY washed. For collimation, an anaerobic (oxygene free) environement (body/cloth) is most needed… Any slight air gap will cause no or next to no ID image as we can see on the Shroud….\n\n","date":"June 25, 2012 at 11:40 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-13017","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"I’ve just read Rogers’ 2003 article dealing with Maillard reaction.\nActually, Rogers already said gas diffusion is just one (minor ?) parameter of image formation.\n\nRogers :\nPostmortem body temperatures can reach 41ºC (Irvine, 2001), and steep temperature\ngradients would exist across the cloth as a result of the low thermal diffusivity of linen and the angular dependence of radiant heat flow from a nonmetallic surface (Gubareff et al, 1960). The temperature gradients will have a large effect on Maillard reaction rates.\n\nTemperature gradients may be a major parameter.\n\n","date":"June 25, 2012 at 10:12 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-13010","author":"anoxie","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"The Shroud image most likely results from a collimated natural mordanting at 90°-120° Celsius.\n\n","date":"June 25, 2012 at 11:42 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-13018","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"\nMax Patrick Hamon :\nThe Man of the Shroud was INDIRECTLY washed. For collimation, an anaerobic (oxygene free) environement (body/cloth) is most needed… Any slight air gap will cause no or next to no ID image as we can see on the Shroud….\n\nHow would the environement be oxygen or air free ?\n\n","date":"June 25, 2012 at 12:32 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-13025","author":"anoxie","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"“Environement” here is to be understood in a very limited acception in terms of “space between body and cloth”….\n\n","date":"June 25, 2012 at 6:18 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-13038","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Gas Diffusion and the Banding Effect","post":"Ok, still, how do you explain an oxygen free space between cloth and body ?\n\n","date":"June 26, 2012 at 1:08 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","id":"comment-13042","author":"anoxie","site":"shroudstory"}]
