[{"title":"The Turin Shroud of Turin may be authentic, get over it.","post":"Nicely written article!. I didn’t think the “whole picture” could have been described so simply and eloquently…Did archaeologists really find Soddom and Gomorrah? I must be falling behind in my reading ;-)…Dan you may want to fix your Title/header ;-)\nIt is true though; All evidence points this relic to being authentic and almost certainly to the historical Jesus of Nazareth, but these skeptics can still make comments like; “with loads of evidence for this being a medieval forgery” …What are these people smoking? What loads of evidence? Are people so STUPID that they will accept a single carbon dating test and forego all other evidence? I’ll bet my last buck, if science were to confirm that this Shroud is what it appears to be and unequivocally authentic, these skeptics would still blindly oppose it. Oh well they can go on not believing, it’ll be their loss in the end and I’ll show no remorse for them personally.\nR\n\n","date":"December 21, 2011 at 7:10 am","url":"https://shroudstory.com/2011/12/21/the-turin-shroud-of-turin-may-be-authentic-get-over-it/","cat":"news_&_views","id":"comment-5818","author":"Ron","site":"shroudstory"},{"title":"The Turin Shroud of Turin may be authentic, get over it.","post":"it is so sad that people will do anything to hold their beliefs so true to them. Radio carbon tests prove that it isn’t that old, even the carbon monoxide penetrating the fabric doesn’t hold up anymore. \nthere is not one piece of evidence suggesting this was a) that old to begin with b) that the person in the shroud was this infamous Jesus c) that how it was made was a miraculous divine process. Religious folks love to jump to conclusions to protect their beliefs? why are they all so scared?\n@ Ron – you mention evidence? what evidence?? an unknown explanation is not evidence.  the correct thing too say is “at the moment we can’t quite replicate exactly what made this, however there a several possibilities, this does not imply that it is miraculous” – so in essence you say “we don’t know yet”.  not jump to conclusions – because that is Gullible. \nI imagine you consider the Catholic church holding it as evidence that is true right?? ;-) the catholic church wouldn’t mislead anyone would they now?? LOL\nThe only, yes only piece of substantial evidence was the dating which all three science laboratories confirmed. All hypothesis about it being incorrect (increase carbon affecting age) have been tested and non till date are showing any effect on the dating processes. \nUnfortunately some people have a very weak burden of proof to accept claims.\n\n","date":"December 21, 2011 at 3:19 pm","url":"https://shroudstory.com/2011/12/21/the-turin-shroud-of-turin-may-be-authentic-get-over-it/","cat":"news_&_views","id":"comment-5844","author":"The Devil.","site":"shroudstory"},{"title":"The Turin Shroud of Turin may be authentic, get over it.","post":"If you believe the carbon dating was correct, then you are the one that is gullible. You want evidence to what I claim? There is plenty of material to read out there. Dan has a pretty good website where you can start, that of course takes some effort on your part and I am definitely not going to educate you. By the way, since ‘scientifically’ with peer-reviewed evidence, the carbon dating HAS BEEN proven INVALID and the original results put in serious question now, what will you skeptics possibly use in your opposition to the Shroud? It is now your burden to prove.\nRon\n\n","date":"December 21, 2011 at 7:02 pm","url":"https://shroudstory.com/2011/12/21/the-turin-shroud-of-turin-may-be-authentic-get-over-it/","cat":"news_&_views","id":"comment-5860","author":"Ron","site":"shroudstory"}]
