[{"title":"The vagaries of human visual perception and individual judgment","post":"Most obviously your ‘reader’ is not trained to detecting latent or half latent images. Most obviously he is neither aware of falsely negative perception nor of his  breathtaking arrogant ignorance in terms of numismatics, palaeography, criminology, glyptology and bloodstain pattern analysis. Most obviously is not even aware of his blind spot in his sight-and-brain coordination system. Let him talk…\n\n","date":"May 28, 2013 at 3:09 pm","url":"https://shroudstory.com/2013/05/28/the-vagaries-of-human-visual-perception-and-individual-judgment/","cat":"news_&_views","id":"comment-35129","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The vagaries of human visual perception and individual judgment","post":"BTW a HD 2002 Durante Shroud face colour photograph (not that of Mario’s Shroud Scope) is used as double check. Can your ‘reader’ really read posting and comments on this blog? I very much doubt it.\n\n","date":"May 28, 2013 at 3:19 pm","url":"https://shroudstory.com/2013/05/28/the-vagaries-of-human-visual-perception-and-individual-judgment/","cat":"news_&_views","id":"comment-35130","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The vagaries of human visual perception and individual judgment","post":"One person can see objects, another cannot. The famous Find The Cat exercise demonstrates that some people are more visually attuned for certain patterns/objects. It took me  awhile to find those cats, but once I did – or was shown where they were – I recognized them as cats and can now find them again without delay. So why can’t I see these coins even when I have been shown where and what to look for?\nI once went ghost hunting with friends of our family. We sat in a car looking for the ghost light that is said to appear at the base of a hill. Our driver said she could see lights and got spooked. She drove down the hill claiming she could see the lights. She then slammed the brakes on because she was certain the lights were now right ahead of her on the road. When the light passed she tore out of there like a bat out of hell. I never, at any time, saw the ghost light she was adamant was there. And I can assure you that this woman was not acting or pranking us – she was sincerely terrified.\nShe saw something, I did not. Whose reality should others accept when we tell the same story? I don’t mean that rhetorically. I’m not sure of the answer myself.\n\n","date":"May 28, 2013 at 4:59 pm","url":"https://shroudstory.com/2013/05/28/the-vagaries-of-human-visual-perception-and-individual-judgment/","cat":"news_&_views","id":"comment-35136","author":"David Goulet","site":"shroudstory"},{"title":"The vagaries of human visual perception and individual judgment","post":"David G wrote: “It took me awhile to find those cats, but once I did – or was shown where they were – I recognized them as cats and can now find them again without delay. So why can’t I see these coins”?  \n  The first true fact is when it comes to very tiny partial/fragmented ancient coin imprints as very unfamiliar shapes (0,5mm to 3,5mm via 1,5 mm high), it is even more difficult to recognize the latter as such in shape and distribution (and even colour if viewed from a B&W reversed negative photo).\n  The second true fact is neither Filas nor Wangher or Haralick or Moroni & Rodante or Balossino & Baima-Bollone or Fontanille etc  correctly detected, extracted and identified them so far. They could sensed them but never were able to correctly identify them.\n  Once I’ll show you, it will (almost) stare you in the eyes as it did for cats. Numismatically speaking, once you’ll be able to recognize them as palaeographic features (with both typical and accidental characteristics as crucial crossed pieces of evidence), you shall figure them out almost without delay from an authentic B&W or colour authentic 1931 Enrie, 1978 MIller,2002 Durante Shroud face photograph at scale either one or two or three or four or five.\n\n","date":"May 28, 2013 at 5:40 pm","url":"https://shroudstory.com/2013/05/28/the-vagaries-of-human-visual-perception-and-individual-judgment/","cat":"news_&_views","id":"comment-35137","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The vagaries of human visual perception and individual judgment","post":"Unbiased B& W and colour photographic material in different photographic procedures and a series of ad hoc digital enhancements are most needed. Appropriate raking lights is also a must as long as most likely the in-soaked cloth was compressed onto the partially bloodstained small coin sides and the latter were recorded as ‘im-prints’ not just as blood decals.\n\n","date":"May 28, 2013 at 5:53 pm","url":"https://shroudstory.com/2013/05/28/the-vagaries-of-human-visual-perception-and-individual-judgment/","cat":"news_&_views","id":"comment-35138","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The vagaries of human visual perception and individual judgment","post":"Typo: “in-prints”\n\n","date":"May 28, 2013 at 6:08 pm","url":"https://shroudstory.com/2013/05/28/the-vagaries-of-human-visual-perception-and-individual-judgment/","cat":"news_&_views","id":"comment-35143","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The vagaries of human visual perception and individual judgment","post":"I am most reluctant to re-enter this fray yet again, thinking I had exhausted myself on the matter previously. Neurology tells us that our brains are wired to perceive patterns. Clearly the professional artist will perceive different patterns to that of the professional microscopist, striving for his rational objectivity. Philosophers have wrtten extensively on perception and reality all the way down through the ages, but all with ambiguous results. I merely wish that our NZ cricketers, were much more perceptive in seeing those balls approaching their wickets, before being bowled all out for a mere 68 runs!\n\n","date":"May 28, 2013 at 6:12 pm","url":"https://shroudstory.com/2013/05/28/the-vagaries-of-human-visual-perception-and-individual-judgment/","cat":"news_&_views","id":"comment-35144","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The vagaries of human visual perception and individual judgment","post":"Is a blinding storm dust blowing on through Wellington city or is it pitch-dark polar night at the moment?\n\n","date":"May 28, 2013 at 6:27 pm","url":"https://shroudstory.com/2013/05/28/the-vagaries-of-human-visual-perception-and-individual-judgment/","cat":"news_&_views","id":"comment-35146","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The vagaries of human visual perception and individual judgment","post":"If it’s of interest, we’ve just had our first real taste of winter, with strong cold southerly gales 120kph from the Antarctic, with snowfalls dowwn to sea level in the south, snow down to 200m ASL in Wellington, several road closures in the mountain passes and central North Island plateau, and a maximum temperature of 8 deg C in the capital. Lightning strikes, thunder-storms, floods in the north, with several power-cuts. Thank you for your enquiry!\n\n","date":"May 28, 2013 at 7:16 pm","url":"https://shroudstory.com/2013/05/28/the-vagaries-of-human-visual-perception-and-individual-judgment/","cat":"news_&_views","id":"comment-35149","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The vagaries of human visual perception and individual judgment","post":"Oh I see!\n\n","date":"May 29, 2013 at 5:41 am","url":"https://shroudstory.com/2013/05/28/the-vagaries-of-human-visual-perception-and-individual-judgment/","cat":"news_&_views","id":"comment-35181","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The vagaries of human visual perception and individual judgment","post":"Earlywinter daydream settling in NZ.\n\n","date":"May 29, 2013 at 6:29 am","url":"https://shroudstory.com/2013/05/28/the-vagaries-of-human-visual-perception-and-individual-judgment/","cat":"news_&_views","id":"comment-35188","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The vagaries of human visual perception and individual judgment","post":"I’m not a big fan of “I think I see.”  Some sort of objective measurement would go a long way, but I have yet to read anything that includes this kind of study.  Max?\n\n","date":"May 28, 2013 at 9:26 pm","url":"https://shroudstory.com/2013/05/28/the-vagaries-of-human-visual-perception-and-individual-judgment/","cat":"news_&_views","id":"comment-35158","author":"Andy Weiss","site":"shroudstory"},{"title":"The vagaries of human visual perception and individual judgment","post":"Andy, there are also big fans of “I think I see NOTHING but” around and you are definitely one of them. Actually much like Dan et al you are a big fan of “I think I see” without even being aware of it! \nCoin-over-eyes arch-advocates (Filas et al) were the victims of BOTH falsely positive and falsely negative perceptions while coin-over-eye arch-sceptics are still the victims of falsely NEGATIVE perceptions. \nMost if not all of them cannot even correctly detect at first sight or even within a reasonable time (15 seconds) a cat hidden in full view in a picture (for a while “they think they see nothing but” a crap heap, an overcrowded beach or a muddy field). If you really think you need objective measurement to be able to detect even cats… a computer science expert could provide it alright.\n\n","date":"May 29, 2013 at 5:54 am","url":"https://shroudstory.com/2013/05/28/the-vagaries-of-human-visual-perception-and-individual-judgment/","cat":"news_&_views","id":"comment-35182","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The vagaries of human visual perception and individual judgment","post":"That’s where arch-sceptics’ “half blindness” comes in…\n\n","date":"May 29, 2013 at 6:19 am","url":"https://shroudstory.com/2013/05/28/the-vagaries-of-human-visual-perception-and-individual-judgment/","cat":"news_&_views","id":"comment-35185","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The vagaries of human visual perception and individual judgment","post":"At times, consensus reality can be quite different from the real thing.\n\n","date":"May 29, 2013 at 6:08 am","url":"https://shroudstory.com/2013/05/28/the-vagaries-of-human-visual-perception-and-individual-judgment/","cat":"news_&_views","id":"comment-35183","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The vagaries of human visual perception and individual judgment","post":"To DaveB wellington NZ: How long did it take to CORRECTLY detect and identify each camouflaged cat?\nCan you tell me how you would scientifically detect and identify camouflaged animals/objects partial/fragmented patterns?\n\n","date":"May 29, 2013 at 6:25 am","url":"https://shroudstory.com/2013/05/28/the-vagaries-of-human-visual-perception-and-individual-judgment/","cat":"news_&_views","id":"comment-35186","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The vagaries of human visual perception and individual judgment","post":"Typo: How long did it take YOU to CORRECTLY detect and identify each camouflaged cat?\n\n","date":"May 29, 2013 at 6:25 am","url":"https://shroudstory.com/2013/05/28/the-vagaries-of-human-visual-perception-and-individual-judgment/","cat":"news_&_views","id":"comment-35187","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The vagaries of human visual perception and individual judgment","post":"Things are very busy here. I’ll email another illustrated comment (Act II for Dave) with two tables extracted from my 2011 Torun paper intermediary version as soon as I reasonably could. Keep tune. For the full final version, that is Act III, I still need at least to double and triple check the presence of the same tiny intriguing features on authentic (NOT ONLY second generation) 1978 Miller and 2002 Durante Shroud face HD photographic paper/slides copies/digital files.\n\n","date":"May 29, 2013 at 6:57 am","url":"https://shroudstory.com/2013/05/28/the-vagaries-of-human-visual-perception-and-individual-judgment/","cat":"news_&_views","id":"comment-35189","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The vagaries of human visual perception and individual judgment","post":"Dave wrote: “Neurology tells us that our brains are wired to perceive patterns.” Neurology should also have told him that his non-initiated eye-and-brain coordination system is wired NOT to perceive most unfamiliar or very well camouflaged patterns.\n\n","date":"May 29, 2013 at 7:21 am","url":"https://shroudstory.com/2013/05/28/the-vagaries-of-human-visual-perception-and-individual-judgment/","cat":"news_&_views","id":"comment-35191","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The vagaries of human visual perception and individual judgment","post":"I’m not at all sure about that.  Some are clearly more perceptive than others, it may be an inherited gene matter, or else some spontaneous gene variation. It can be a matter of training, or an active imagination. I earlier mentioned the childhood nightmares derived from overly-imaginative perceptions of patterns of light – The “bush perceived as a bear” syndrome. As a side-issue on perception:- The rural aborigines in outback Australia are renown for their remarkable tracking abilities. In an otherwise barren landscape they are capable of perceiving the minutest traces of the path of an animal or fugitive over the course of several days. A number of them are active in official police work, tracking lost travellers or fugitives merely from the signs or indications on the occasional lay of a bush or movement in the dust. I suspect that some of it may be psycho-perceptive. They always seem capable of producing positive results, from signs apparently invisible to others. Whether it’s a matter of training or natural instinct I cannot say. Clearly there are realities, invisible to some but visible to only a few, while others will make something of a perceived pattern which has no real significance. The trick is in understanding the difference. I have no idea what a “black-tracker” might make of his perceptions of patterns on the TS.\n\n","date":"May 29, 2013 at 4:47 pm","url":"https://shroudstory.com/2013/05/28/the-vagaries-of-human-visual-perception-and-individual-judgment/","cat":"news_&_views","id":"comment-35294","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The vagaries of human visual perception and individual judgment","post":"Check out the detective fiction novels by Arthur Upfield 1890-64, for an indication of the tracking abilities of aborigines; His hero is a half-caste aboriginal Detective Inspector ‘Napoleon Bonaparte’ of the Queensland Police Force. There are several references to his works on the internet. Choose novels with an ‘Australian outback’ setting, there are several. Fiction yes, but the settings and culture are authentic.\n\n","date":"May 29, 2013 at 6:01 pm","url":"https://shroudstory.com/2013/05/28/the-vagaries-of-human-visual-perception-and-individual-judgment/","cat":"news_&_views","id":"comment-35297","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The vagaries of human visual perception and individual judgment","post":"Dave, allow me to remind you I also apply cryptology to criminology and first heard of the tracking abilities of aborigines… more than 15 years ago (tracking the path of a fugitive or a missing child).\n\n","date":"May 30, 2013 at 7:05 am","url":"https://shroudstory.com/2013/05/28/the-vagaries-of-human-visual-perception-and-individual-judgment/","cat":"news_&_views","id":"comment-35328","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The vagaries of human visual perception and individual judgment","post":"And more than 30 years ago, I aslo heard  of the  variability of eidetic memory among Australian Aboriginal children and their most acute sense of observation…\n\n","date":"May 30, 2013 at 7:14 am","url":"https://shroudstory.com/2013/05/28/the-vagaries-of-human-visual-perception-and-individual-judgment/","cat":"news_&_views","id":"comment-35329","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The vagaries of human visual perception and individual judgment","post":"Dave, I am glad anyway you keep an open mind AGAIN as far as the coin-over-eye issue is concerned…\n\n","date":"May 30, 2013 at 7:17 am","url":"https://shroudstory.com/2013/05/28/the-vagaries-of-human-visual-perception-and-individual-judgment/","cat":"news_&_views","id":"comment-35330","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The vagaries of human visual perception and individual judgment","post":"Both coin-over-eye arch-sceptics and arch-advocates have been making NOTHING of non-perceived bloodstain(-like) patterns that have REAL paleographic significance.\n\n","date":"May 30, 2013 at 7:32 am","url":"https://shroudstory.com/2013/05/28/the-vagaries-of-human-visual-perception-and-individual-judgment/","cat":"news_&_views","id":"comment-35332","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The vagaries of human visual perception and individual judgment","post":"…for too long.\n\n","date":"May 30, 2013 at 7:34 am","url":"https://shroudstory.com/2013/05/28/the-vagaries-of-human-visual-perception-and-individual-judgment/","cat":"news_&_views","id":"comment-35333","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The vagaries of human visual perception and individual judgment","post":"hi daveb\nI wrote you a comment in the Struggling-with-naturalist-explanations thread-\nsee #61 awhile-thought maybe you might not have seen it-that it got lost in the shuffle\nWould like to hear more detail about the radon idea, particularly in relation to collimation, or just in general\nThanks,\nKelly\nPosting here because I thought you might see this\n\n","date":"May 29, 2013 at 4:56 pm","url":"https://shroudstory.com/2013/05/28/the-vagaries-of-human-visual-perception-and-individual-judgment/","cat":"news_&_views","id":"comment-35296","author":"Kelly Kearse","site":"shroudstory"},{"title":"The vagaries of human visual perception and individual judgment","post":"Kelly,\nI have just picked up your query ok.\nGiovanna De Liso worked for some 12 years in the seismically active area of Piedmont, experimenting with producing images using all sorts of different cloths treated in various ways, and under different conditions. She seems to have successfully produced 3-D image of a key and a snake. Some have commented that they are the most successful images produced to date; others have commented that they are only of relatively thin objects. Her paper “Shroud-like image formation during seismic activity” by Giovanna de Liso; ENEA Frascati Conference May 2010, may be found at http://www.acheiropoietos.info/proceedings/DeLisoWeb.pdf and is well worth reading. Note that the PDF is ‘secured’ so I’m unable to copy and paste extracts here.\nThe most successful images were produced in connection with the seismic release of radon gas in the neighbourhood of iron-bearing gneiss rock formations, with electrostatic discharges and infra-sound emission and with variations in the local geomagnetic field. It seems that the lack of any one of these variables resulted in no image. \nI have been unable to find out very much about this author, and she has not responded to my enquiries in English. I am given to understand that she may work with Prof Giulio Fanti, and has supported his “corona discharge” hypothesis, so some consider she may be suspect. My own view is that the paper should stand on its own merits. Twelve years of dedicated work resulting in the successful production of 3-D images is not to be ignored.\nRadon-222 is the longest-lived isotope of radon with a half-life of 3.28 days, emitting alpha particles, and is a decay product of radium. It is prepared synthetically for treatment of cancer, as the daughter product is Bismuth-214 which produces penetrating gamma radiation. In an earthquake the quantities would be very small. However Radon-222 has been implicated as the most significant non-tobacco cause of lung cancer in apartment dwellings in USA. \nI recall that there have been subsequent papers citing De Liso’s work which you may find on the shroud.com site. The collimation hypothesis is something that requires further investigation, and we shall have to wait for any further information which may possibly come to light in due course. I am unable to comment further on this aspect at present.\n\n","date":"May 29, 2013 at 7:30 pm","url":"https://shroudstory.com/2013/05/28/the-vagaries-of-human-visual-perception-and-individual-judgment/","cat":"news_&_views","id":"comment-35306","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The vagaries of human visual perception and individual judgment","post":"\ndaveb of wellington nz :\nKelly,\nI have just picked up your query ok.\nGiovanna De Liso worked for some 12 years in the seismically active area of Piedmont, experimenting with producing images using all sorts of different cloths treated in various ways, and under different conditions. She seems to have successfully produced 3-D image of a key and a snake. Some have commented that they are the most successful images produced to date; others have commented that they are only of relatively thin objects. Her paper “Shroud-like image formation during seismic activity” by Giovanna de Liso; ENEA Frascati Conference May 2010, may be found at http://www.acheiropoietos.info/proceedings/DeLisoWeb.pdf and is well worth reading. Note that the PDF is ‘secured’ so I’m unable to copy and paste extracts here.\nThe most successful images were produced in connection with the seismic release of radon gas in the neighbourhood of iron-bearing gneiss rock formations, with electrostatic discharges and infra-sound emission and with variations in the local geomagnetic field. It seems that the lack of any one of these variables resulted in no image.\nI have been unable to find out very much about this author, and she has not responded to my enquiries in English. I am given to understand that she may work with Prof Giulio Fanti, and has supported his “corona discharge” hypothesis, so some consider she may be suspect. My own view is that the paper should stand on its own merits. Twelve years of dedicated work resulting in the successful production of 3-D images is not to be ignored.\nRadon-222 is the longest-lived isotope of radon with a half-life of 3.28 days, emitting alpha particles, and is a decay product of radium. It is prepared synthetically for treatment of cancer, as the daughter product is Bismuth-214 which produces penetrating gamma radiation. In an earthquake the quantities would be very small. However Radon-222 has been implicated as the most significant non-tobacco cause of lung cancer in apartment dwellings in USA.\nI recall that there have been subsequent papers citing De Liso’s work which you may find on the shroud.com site. The collimation hypothesis is something that requires further investigation, and we shall have to wait for any further information which may possibly come to light in due course. I am unable to comment further on this aspect at present.\n\nOK-got it-appreciate the reply-Thanks for the link\nBest,\nKelly\n\n","date":"May 29, 2013 at 7:33 pm","url":"https://shroudstory.com/2013/05/28/the-vagaries-of-human-visual-perception-and-individual-judgment/","cat":"news_&_views","id":"comment-35307","author":"Kelly Kearse","site":"shroudstory"}]
