[{"title":"The Veil of Manoppello to Visit the Philippines This Month","post":"From this article in the Filipino media, it would seem that the Veil itself will travel there. Far from it. Not the Veil but father Carmine Cucinelli, prior of the Manoppello sanctuary, is going to Manila and other places in the Philippines. In the meantime he is visiting the States (Seattle, San Francisco, Las Vegas).\n\n","date":"September 7, 2014 at 6:17 am","url":"https://shroudstory.com/2014/09/07/the-veil-of-manoppello-to-visit-the-philippines-this-month/","cat":"news_&_views","id":"comment-149216","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"The Veil of Manoppello to Visit the Philippines This Month","post":"Here were the dates of fr. Cucinelli visit to the USA, from 2 to 7 September:\nhttp://holyfaceofmanoppello.blogspot.it/2014/08/west-coast-of-usa-and-also.html\n\n","date":"September 7, 2014 at 6:25 am","url":"https://shroudstory.com/2014/09/07/the-veil-of-manoppello-to-visit-the-philippines-this-month/","cat":"news_&_views","id":"comment-149217","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"The Veil of Manoppello to Visit the Philippines This Month","post":"And not a single press release in English, the most popular language in the U.S.. I found two stories, after the fact, in Italian.  Putting an announcement on a blog page doesn’t work all that well in getting it into the news stream. A simple press release distribution does.\n\n","date":"September 7, 2014 at 6:51 am","url":"https://shroudstory.com/2014/09/07/the-veil-of-manoppello-to-visit-the-philippines-this-month/","cat":"news_&_views","id":"comment-149224","author":"Dan","site":"shroudstory"},{"title":"The Veil of Manoppello to Visit the Philippines This Month","post":"Can anyone tell me how this artifact was dated, and what evidence exists that it is indeed ‘not made by human hands?’  I see some very, very real reasons to refute this claim\n1) I see no similarity whatsoever between the features of the Man of the Shroud and this image.  None.  The eyes of the artifact under discussion are very much in harmony with the Siennese school of painting, the hooded, almond shaped eyes in vogue in religious paintings in the 1200s.  The nose is poorly done, and is in fact out of the alignment with the mouth.  This image’s face reflects no injuries nor bloodstains associated with the Crucifixion and in fact does NOT represent a Semitic man!   Any claims made to be ‘not made of human hands’ the Shroud of Turin has supported with scientific evidence, the most modern equipment being unable to refute this just and supported claim.  What does science say of this artifact, and who says it?\n\n","date":"September 7, 2014 at 11:29 am","url":"https://shroudstory.com/2014/09/07/the-veil-of-manoppello-to-visit-the-philippines-this-month/","cat":"news_&_views","id":"comment-149264","author":"Josie L Tyner","site":"shroudstory"},{"title":"The Veil of Manoppello to Visit the Philippines This Month","post":"Josie, see those links: \nOfficial site of the Holy Face Sanctuary\nhttp://www.voltosanto.it/Inglese/index.php\nSudarium Christi Website\nhttp://www.sudariumchristi.com/uk/start/index.php\nHoly Face of Manoppello Blog\nhttp://holyfaceofmanoppello.blogspot.com/\nVolto Santo di Manoppello, the Holy Face by Juliusz Maszloch\nhttp://manoppello.eu/eng/\nSeveral articles from 2010 ENEA Frascati Conference\nhttp://www.acheiropoietos.info/\nJohn Iannone, The Veil of Veronica: Fact or Fiction?\nhttp://www.shroud.com/pdfs/iannone2.pdf\nFor more sceptical view, see Roberto Falcinelli’s “The Veil of Manoppello: Work of Art or Authentic Relic?” from the 3rd International Dallas Conference on the Shroud of Turin (2005).\nhttp://www.shroud.com/pdfs/roberto.pdf\nBesides, see my papers on that:\nhttps://shroudofturin.files.wordpress.com/2014/06/manopello-shroud-comparison3d.pdf\nhttps://shroudofturin.files.wordpress.com/2014/06/addendum-manopello-shroud-comparison3d.pdf\n\n","date":"September 7, 2014 at 11:54 am","url":"https://shroudstory.com/2014/09/07/the-veil-of-manoppello-to-visit-the-philippines-this-month/","cat":"news_&_views","id":"comment-149271","author":"O.K.","site":"shroudstory"},{"title":"The Veil of Manoppello to Visit the Philippines This Month","post":"Thank you, and I did check out your most scholarly work.\nAnd I know what I write will probably not make sense, but I have to say that when confronted by both images, there is just not the same feeling. The quiet holiness of the Man of the Shroud fills one with peace, in spite of the obvious violence inflicted upon the body. The face of Manopello seem to me to be disquieting, emotionless, well-done to the point of absolute virtuosity, and very inhuman.\nI can, and have, looked at the face on the SOT, for hours, and feel the closeness of God, and there is something in the Manopello face that makes my skin crawl.  Those hooded, emotionless eyes, a face supposedly battered beyond recognition, is somehow there in perfect composure, hardly a hair out of place, no beard pulled out as the Scriptures say, no blow on the face from “Prophecy! Who struck thee!” nothing evidenced on the SOT, where every single blow and bloodstain finds perfect Scriptural confirmation.  The Man of the Shroud is a bloody, battered mess, what one would expect a victim of Crucifixion to look like.  And where, exactly, does a poor Hebrew woman get byssus? Not impossible, but I never got the impression the better classes of Judea attended the crucifixion processions of criminals.\nThere are miracles and miracles.  An opinion based on an emotion is not going to sway anyone either way, but for me, personally, my gut is telling me this is not a picture I want in my home.  No reflection on your masterful work of course, I speak of a very subjective feeling of something being ‘not right’ on a level I cannot understand.  But for now, I am listening to my gut.\n\n","date":"September 9, 2014 at 1:14 am","url":"https://shroudstory.com/2014/09/07/the-veil-of-manoppello-to-visit-the-philippines-this-month/","cat":"news_&_views","id":"comment-149568","author":"Josie Tyner","site":"shroudstory"},{"title":"The Veil of Manoppello to Visit the Philippines This Month","post":"We have been looking at similarities (or supposed similarities) between the Manoppello veil and the Shroud quite recently, and a quick search through this blog will show you both sides of the argument quite well. O.K.’s overlays are interesting, but, in common with many others, have failed to convince generally, and such Science as has been carried out has not been sufficiently well reported to sway either side in favour of the other.\n\n","date":"September 7, 2014 at 1:15 pm","url":"https://shroudstory.com/2014/09/07/the-veil-of-manoppello-to-visit-the-philippines-this-month/","cat":"news_&_views","id":"comment-149278","author":"Hugh Farey","site":"shroudstory"},{"title":"The Veil of Manoppello to Visit the Philippines This Month","post":"Around three years ago I told people who were studying the Manoppello veil from close that one of my doubts was precisely that the veil seems to be in vogue with paintings during the period. Another big doubt is the cloth: is it linen or byssus? If it is byssus then both sides should be exact, there should be no differences, however we are told there are slight differences. Then, brush strokes are said to have been identified in some places, where paint and not dye were used. So, is it linen?\n\n","date":"September 7, 2014 at 2:48 pm","url":"https://shroudstory.com/2014/09/07/the-veil-of-manoppello-to-visit-the-philippines-this-month/","cat":"news_&_views","id":"comment-149291","author":"Louis","site":"shroudstory"},{"title":"The Veil of Manoppello to Visit the Philippines This Month","post":"Now I send the message that I prepared I wanted to send for a\nprevious intervention about the Veil of Manoppello:\n— — — — — — — — — —\nAlways I prefer the straightforward solutions ! …\nand I avoid to read inconsistent studies or who has mainly academic knowledges …\nThe transmission spectroscopy is the solution.\nWhy I.N.O.A. (Italian National Institute of Optics =  http://www.ino.it/en/ ) and others had not followed that simple way ?\nThis is another (little) enigma…\nJaworski indicated the presence of melanin (= “Properties of byssal threads, the chemical nature of their colors and the Veil of Manoppello”. IWSAI 2010), but (if I am right) he doesn’t indicated the spectral answer of melanin because the scientific tools used (in that study) were HPLC and PLM.\nSo … If he wanted to solve an enigma IMO this solution was a nonsensical approach. Instead if he mainly wanted to show us great academic knowledges, then we can understand the behaviour by prof. Jaworski …\nThen, we have to find the exact proofs for melanin into the spectra taken from the Manoppello’s Veil…\nUnfortunately we don’t know how are the spectral lines because there is a lack of data that we must try to fill with the inherent control.\n …\nSee also what wrote Jaworski :\n>The microscopic and spectroscopic studies (performed through the glass of the reliquary)\ndid not lead to clear conclusions as to the nature of the image.  …\nWhat kind of spectroscopic studies ?\nReading the text by Jaworski we don’t know what were these controls !\nHave you found the inherent reference ?\n— — — —\nI admit : I was too harsh in my words against prof. Jaworski.\nSorry: unfortunately I am sick and often I see my time lost in vain …\nand so… I became too rigorous against Jaworski!\n— — — —\nTransmission Spectra :\nHave you tried to see what are the transmission curves for linen and silkmarine?\nSee also the presence of a glass, a question to solve with adequate calibrations.\n— — —\nWhat are your comments ?\n\n","date":"September 8, 2014 at 9:38 am","url":"https://shroudstory.com/2014/09/07/the-veil-of-manoppello-to-visit-the-philippines-this-month/","cat":"news_&_views","id":"comment-149442","author":"Piero","site":"shroudstory"},{"title":"The Veil of Manoppello to Visit the Philippines This Month","post":"Errata corrige:\nNow I send the message that I prepared (previously) and I wanted to send …\nInstead of :\nNow I send the message that I prepared I wanted to send (for a\nprevious intervention … etc … etc. …)\n\n","date":"September 8, 2014 at 9:42 am","url":"https://shroudstory.com/2014/09/07/the-veil-of-manoppello-to-visit-the-philippines-this-month/","cat":"news_&_views","id":"comment-149444","author":"Piero","site":"shroudstory"},{"title":"The Veil of Manoppello to Visit the Philippines This Month","post":"Excuse me but I was a bit bored by the issue of checks in transparency\n(= transmission spectroscopy )…  and there are near the same words\nthat I have sent in the past message (dated November 23, 2012 at 11:27 am) :\n> – the Manoppello image is on byssus (= silkmarine byssus).\nUnfortunately we were not able to obtain the inherent spectral data !\n>No spectrophotometric (transmittance) controls about the\nManoppello’s Face ! Why ?\n>I believe as important thing (to add in the archive) the analysis, using\nthe spectral controls (B.T.W. : Do you know the Labert-Beer’s law ?),\nin order to study these data (see also : the adequate comparisons with the\nspectrophotometric controls on experiments obtained with byssal\nthreads and other similar materials : treated or not with the\ndifferent kind of painting or colouring systems !).\n— — —\nPerhaps at the National Institute of Physics, University of the Philippines,\nthey have some young researcher…\n\n","date":"September 8, 2014 at 9:51 am","url":"https://shroudstory.com/2014/09/07/the-veil-of-manoppello-to-visit-the-philippines-this-month/","cat":"news_&_views","id":"comment-149445","author":"Piero","site":"shroudstory"},{"title":"The Veil of Manoppello to Visit the Philippines This Month","post":"Josie, I do understand your emotional reaction upon looking at the Holy Face of Manpello. When I first downloaded it and looked at it I was quite discomfitted. The eyes seemed to be staring right through me, but I couldn’t tear myself away. I figured if I were truly gazing upon the face of Christ, who sees into my very soul, it should make me a bit uncomfortable. Still–how many different photos of the Face have you seen? The face looks quite different in various lights and angles. Aparently this is even more so when viewing the image itself, but even photos show striking differences in expression. There are scores of photos of the image available on the internet. In some he looks stern, in others peaceful. Even if you gaze at the Face for a significant time the expression changes subtly.\n\n","date":"August 12, 2015 at 3:44 pm","url":"https://shroudstory.com/2014/09/07/the-veil-of-manoppello-to-visit-the-philippines-this-month/","cat":"news_&_views","id":"comment-208087","author":"WayFairer","site":"shroudstory"}]
