[{"title":"Three Millions Page Views","post":"FANTASTIC DAN! Kudos to you and all your work to keep this blog going.  You are making an important contribution to the work of the Shroud and all of us who read and contribute greatly appreciate it.  May you be blessed for your efforts.\n\n","date":"May 3, 2015 at 1:48 pm","url":"https://shroudstory.com/2015/05/03/three-millions-page-views/","cat":"uncategorized","id":"comment-198215","author":"Russ Breault","site":"shroudstory"},{"title":"Three Millions Page Views","post":"Congratulations, Dan. May I suggest a slight change in policy? Begin deleting the irreverent comments that appear from time to time. I’m sure many “Shroudies” would appreciate that.\n\n","date":"May 3, 2015 at 2:06 pm","url":"https://shroudstory.com/2015/05/03/three-millions-page-views/","cat":"uncategorized","id":"comment-198216","author":"Louis","site":"shroudstory"},{"title":"Three Millions Page Views","post":"unfortunately for me, that would be most of my posts would be deleted…congrats Dan…glad I found this site….\n\n","date":"May 3, 2015 at 7:30 pm","url":"https://shroudstory.com/2015/05/03/three-millions-page-views/","cat":"uncategorized","id":"comment-198233","author":"rick","site":"shroudstory"},{"title":"Three Millions Page Views","post":"Thanks Dan; I have learnt many things about the Shroud of Turin from your blog.\n\n","date":"May 3, 2015 at 9:15 pm","url":"https://shroudstory.com/2015/05/03/three-millions-page-views/","cat":"uncategorized","id":"comment-198236","author":"Sampath Fernando","site":"shroudstory"},{"title":"Three Millions Page Views","post":"Congratulations, Dan!\n— —\nNow I have a little gift for your blog.\nTwenty-one years ago I read an article by Dr. Sebastiano Rodante\nregarding the “immunizing crying” of the Madonna\nover her son (Jesus Christ) …\nHere the latin words:\nStabat Mater dolorosa iuxta crucem lacrimosa\n(= the tearful Mother stood beside the cross)\nThe Weeping Madonna of Syracuse\n>… One of the many visitors who examined the plaque at close range\nwas Mario Messina, who was highly regarded in the neighborhood.\n>After observing the slow formation of the tears, he removed\nthe image from the wall. looked at it thoroughly and was satisfied\nthat the tears was not the result of an internal reservoir.\n>After the plaque was dried, two tears immediately reappeared.  …\nThe Weeping Madonna of Syracuse (Italy)  is one of the most unusual\nof the approved miraculous images of the Blessed Virgin Mary…\nand\nDr. Rodante worked in Syracuse… \nHe indicated the possibility that Mary’s tears were abundant\nspotted on the front of the chest of the dead body of Jesus.\n(we also know another question: in 1975, Sebastiano Rodante\nthe medical doctor, started some important experiments strongly\nhighlighting an element never considered before in the history of\nthe experimentations on the Shroud: the bloody sweat…)\n— —\nWe know that:\n>Lysozyme is abundant in a number of secretions, such as tears,\nsaliva, human milk, and mucus. \nLink:\nhttp://en.wikipedia.org/wiki/Lysozyme\n— —\nSee also the study\nby Gorr, Heather Meloy (2013):\nLysozyme Pattern Formation in Evaporating Droplets.\nIt was a Doctoral Dissertation, University of Pittsburgh…\n>… Lysozyme is a globular protein found in high concentration, for example, in human tears and saliva. The drop diameters, D, studied range from the micro- to the macro- scale (1 µm – 2 mm). In this work, the effect of evaporation conditions, solution chemistry, and heat transfer within the droplet on pattern formation is examined. …\nLink:\nhttp://d-scholarship.pitt.edu/17637/\n— —\nInstead here you can read some information about the use of AFM in particular investigations on contact lens. …\nImaging Protein Deposits on Contact Lens Materials\nLink:\nhttp://journals.lww.com/optvissci/Abstract/2008/12000/Imaging_Protein_Deposits_on_Contact_Lens_Materials.8.aspx\n>Purpose. The majority of studies investigating protein deposition on contact lens materials require that the deposit of interest be removed, potentially resulting in erroneous results if some proteins are not removed adequately. The purpose of this study was to investigate the use of in situ imaging methods to examine protein deposition on conventional poly(2-hydroxyethyl methacrylate) (polyHEMA)-based and silicone hydrogel contact lens materials…\n>… AFM data indicated that balafilcon A, lotrafilcon A and polymacon deposited lysozyme in a similar manner, with very little lysozyme being deposited in discrete areas. Galyfilcon A behaved very differently, with the lysozyme exhibiting both aggregates as well as string-like formations over the lens surface. …\n>…  Results. AFM studies demonstrated that the lens materials had markedly differing surface topographies …\n— —\nIf you want to do some useful preliminar tests on linens, then you have to consider the range of values for tears’ surface tension …\nComponents responsible for the surface tension of human tears\n1999, Vol. 19, No. 1 , Pages 4-11\nB. Nagyová, and J.M. Tiffany\nLink:  http://informahealthcare.com/doi/abs/10.1076/ceyr.19.1.4.5341\nAbstract\n>Purpose. It was previously thought that the surface tension of tears was due to dissolved mucin, but it has recently been shown that very little mucin is present. The surface tensions of solutions of commercial mucin, lysozyme, lactoferrin or secretory IgA are all higher than that of tears. The influence of tear lipocalin and lipids remained to be tested. Methods. Surface tension was determined by a micro-method on pooled. intact stimulated human tears, and following extraction with lipid solvents. The extracted material was also added back, as was a variety of lipid standards (phospholipids, glycolipids, sterols, etc.). TLC and GLC were used in partial identification of the extract. Another lipocalin, bovine ß-lactoglobulin, was also tested alone and mixed with tear lipids, model lipids, or model tear proteins. Results. Intact tears had a surface tension of 42-46 mN/m, but after lipid extraction this rose to 53-55.5 mN/m. Addition of lipids to the delipidised tear fluid gave a range of tensions from 42 to 49 mN/m, with the greatest effects shown by phospholipids (phosphatidylcholine, sphingomyelin), but full recovery was only achieved by using the extracted lipid material. … … etc. … …\nLink: http://informahealthcare.com/doi/abs/10.1076/ceyr.19.1.4.5341\n— —\nSo…\nI hope to read no irreverent comments on these easy\nsuggestions of “AFM research on linens sprayed on by tears”.\nI personally, I have doubts about the level of absorption of tears\nby the linen (it’s a question of the surface tension for both:\nlinen and  tears)…\nWhat is your opinion ?\n\n","date":"May 4, 2015 at 8:38 am","url":"https://shroudstory.com/2015/05/03/three-millions-page-views/","cat":"uncategorized","id":"comment-198285","author":"piero","site":"shroudstory"},{"title":"Three Millions Page Views","post":"Here another very “very particular” question connected to the tears\nand to the Purkinje images, that are reflections of objects\nfrom the structure of the eye…\n>…They are also known as Purkinje reflexes and\nas Purkinje-Sanson images…\nLink:\nhttp://en.wikipedia.org/wiki/Purkinje_images\nHere the question:\nWhat is the effect of tears on Purkinje images?\nI refer to the presumed “Purkinje images” present\non the famous tilma of Guadalupe…\nLink:","date":"May 4, 2015 at 8:59 am","url":"https://shroudstory.com/2015/05/03/three-millions-page-views/","cat":"uncategorized","id":"comment-198288","author":"piero","site":"shroudstory"},{"title":"Three Millions Page Views","post":"The “Moro affair” and the analyses on tears…\nAn old article (= published January 12, 2012) appeared in an Italian newspaper and said:\n > A study by a group of Italian researchers reveals a new secret tied to the kidnapping of the secretary of the Christian Democrats.\n > In 1978 Moro wept about 11 letters he wrote during his stay in the hideout of Fani. The tests, conducted with the scanning electron microscope, have revealed the fact that the paper was wet letters. … \nNow I am still curious about what happened to the well-known italian\npolitician Aldo Moro …\nMore rigorous examination (performed with the use of the use of\nthe AFM techniques …) could confirm whether he actually wept over\nthe 11 letters he wrote during his stay in the den of Fani street.\nPerhaps the new tests, conducted with the atomic force microscope\n(instead of the scanning electron microscope) may reveal\nwhether the paper of the letters had been really watered by human tears.\nThis would not be a great step forward but it is another advancement in the field of knowledges … and when it comes to investigations everything is useful.\nThat said, of course I do not exclude that some laboratory\nhas already performed such analysis.\nSo … The issue of advanced analysis on the tears is still interesting!\n— —\nNow I beg your pardon about the question of Purkinje reflexes\nbecause this was a problem apparently very far from the Shroud.\nI have read:\n>The eyes in this acheiropoíetos (“not made by human hands”), which appear to be almost closed from a distance, are of particular significance. Various phenomena discovered in the human eye in the 19th century with regard to light reflexes (Helmholtz) and reflections (Purkinje-Samson) have been documented in the eyes of the image of Our Lady of Guadalupe. Furthermore, the scene of the image development is reflected in her pupils as in the eye of a living person, with corresponding distortions due to astigmatism and a shift in the second eye. Numerous people present were identifiable.\nLink:\nhttp://www.sudariumchristi.com/uk/guadalupe/compare.htm\nBut not everyone accepts the idea of the presence of images in the eye of that particular image of the Mexican Madonna …\nThis speech reminds a little about the history of coins on the eyelids of the Man of the Shroud, that is, we need to understand if the resolution of the Image (…and what is the exact  resolution for that “mexican Imprint”?) is compatible with the interesting issues related to the effects of Purkinje.\nFor example: I remember that, in the case of the Shroud, Professor Gonella denied the validity of the finding of the “footprints of the coins” because the resolution of the image of the body on the Shroud (not to mention the question of “nuclear shadow of the coins” in the case of those who believe that the image on the linen cloth was caused by nuclear\nemissions or radioactivity [!?!?!]) is near 5 mm, if I am right…\nSo the discussion is open to your useful contributions …\n\n","date":"May 5, 2015 at 7:54 am","url":"https://shroudstory.com/2015/05/03/three-millions-page-views/","cat":"uncategorized","id":"comment-198363","author":"piero","site":"shroudstory"},{"title":"Three Millions Page Views","post":"I beg your pardon for eventual translation error that occurred,\nin any case the old italian article wrote:\n>With SEM, the scanning electron microscope which identified the image by mapping the chemical paper fibers were examined points of slobber/blur/smudge: “We realized that there are salts of potassium and chlorine of their tears, but at the same time that the paper was processed with chlorine” did say the biologist.\n>For more information, you should, however, take the material and analyze the DNA, but this goes against the principles of restoration: “For ethical choice, we can not do destructive analysis. We tend to full compliance with the original” warned the director of the restoration workshop.\n— — —\nWhy only SEM controls and not also AFM analyses?\n\n","date":"May 5, 2015 at 8:13 am","url":"https://shroudstory.com/2015/05/03/three-millions-page-views/","cat":"uncategorized","id":"comment-198366","author":"piero","site":"shroudstory"}]
