[{"title":"Tilt: Tom Chivers Sneaks in a Correction","post":"Maybe not trying to be sneaky… it appears to me to be an honest effort to tweak the article for accuracy. \nI don’t think it’s fair to assign motive to Mr. Chivers because we don’t really know WHY he did it. There may have been noble intentions in revising the article, and at least he DOES mention that he has revised it. \nI think it’s amusing that some news agencies have announced there is proof that the Shroud was produced by supernatural means. That oughta drive the skeptics out of their minds. And for all we know, it may be the truth. Maybe God is in this more than you know. Especially if it’s His Shroud. :D   \nBesides, it’s very typical of UK news media to exaggerate things for sensationalism. Even worse than the USA news media, apparently. This was quite predictable. \nPerhaps there is Divine method behind this madness. At least people are talking about the Shroud and that’s probably a good thing.\n\n","date":"December 23, 2011 at 4:49 am","url":"https://shroudstory.com/2011/12/23/tilt-tom-chivers-sneaks-in-a-correction/","cat":"news_&_views","id":"comment-6007","author":"AnnieCee","site":"shroudstory"},{"title":"Tilt: Tom Chivers Sneaks in a Correction","post":"Annie I think your too nice! This Journalist has just lost all credibility! Sure most all journalists are probably quilty of the same thing but to totally misquote someone to meet your own means? I’d fire the guy, if he worked for me….and not give him a reference lol.\nMisinformation is a plague on society, just ask Yannick he understands, and is quite upset about this whole story, I empathize with him.\nIt’s disgusting; journanlism today. It’s a sign of how screwed up this world has become, sadly.\nR\n\n","date":"December 23, 2011 at 10:32 am","url":"https://shroudstory.com/2011/12/23/tilt-tom-chivers-sneaks-in-a-correction/","cat":"news_&_views","id":"comment-6025","author":"Ron","site":"shroudstory"},{"title":"Tilt: Tom Chivers Sneaks in a Correction","post":"It’s funny Dan because I had a serious problem with Ramsey actually making that last comment which was removed.(i.e; “Just because you can create similar results…”) and which many here agreed on. My problem is; I don’t think that comment is exactly correct. Atleast from everything and anything I understand of archaeological science. Although there may be some truth to the statement, it is actually not that clear-cut. It is a science of probabilities. Hense IF something can be reproduced to simulate the artifact’s original condition, it is most probably the correct method. If people were to accept the above comment’s reasoning, then they must question any and every conclusion that has ever been made of anyother artifact found to date. Or in our little world here of the Shroud, the probable method of the “material” manufacturer of the Shroud itself as hypothesized by some.\nR\n\n","date":"December 23, 2011 at 10:17 am","url":"https://shroudstory.com/2011/12/23/tilt-tom-chivers-sneaks-in-a-correction/","cat":"news_&_views","id":"comment-6024","author":"Ron","site":"shroudstory"}]
