[{"title":"Today is the End of the World: Watch the Today Show Tomorrow for Details","post":"Oh, that would be nice. I have plans for the day but if they get interrupted by heavenly trumpets and the second coming of Jesus, I really will not complain. That would definitely make my day!! :) \nActually, the people who study prophecy say that Jesus could return during the Feast of Tabernacles, which is going on now (Jewish holiday.)  And there are a lot of people who think this year is a significant year. Harold Camping is not the only one who pointed to this week as a possibility for the return of Christ, or the Rapture, or both. \nBut Camping is the only one who keeps setting dates and announcing them as if he knows something. We’re not supposed to do that, the Bible is clear about it.\n\n","date":"October 21, 2011 at 9:28 am","url":"https://shroudstory.com/2011/10/21/today-is-the-end-of-the-world-watch-the-today-show-tomorrow-for-details/","cat":"off_topic","id":"comment-4232","author":"AnnieCee","site":"shroudstory"},{"title":"Today is the End of the World: Watch the Today Show Tomorrow for Details","post":"Hahaha,  this guy kills me. So when do you think his next proposed date will be? I personally didn’t see any ‘sign’ in the sky last night, so I guess we still have to wait. It would be nice though as it would save me from having to rake 40 bags of leafs off my mother’s lawn this weekend ;- )\nRon\n\n","date":"October 21, 2011 at 10:53 am","url":"https://shroudstory.com/2011/10/21/today-is-the-end-of-the-world-watch-the-today-show-tomorrow-for-details/","cat":"off_topic","id":"comment-4235","author":"Ron","site":"shroudstory"},{"title":"Today is the End of the World: Watch the Today Show Tomorrow for Details","post":"Update; He’s decided to hang the gloves, and make no more predictions.lol.Isn’t that another prediction?\nR\n\n","date":"November 5, 2011 at 5:21 am","url":"https://shroudstory.com/2011/10/21/today-is-the-end-of-the-world-watch-the-today-show-tomorrow-for-details/","cat":"off_topic","id":"comment-4594","author":"Ron","site":"shroudstory"}]
