[{"title":"Vatican Insider: Another Big Bang","post":"Giucchini or when antimatter matters…\n\n","date":"July 5, 2012 at 11:56 am","url":"https://shroudstory.com/2012/07/05/vatican-insider-another-big-bang/","cat":"uncategorized","id":"comment-13503","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Vatican Insider: Another Big Bang","post":"…or when matter antimatters. More Shroud Big Bang Boom fiction .\n\n","date":"July 5, 2012 at 11:59 am","url":"https://shroudstory.com/2012/07/05/vatican-insider-another-big-bang/","cat":"uncategorized","id":"comment-13504","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Vatican Insider: Another Big Bang","post":"Now that they have finally found the bosson of Higgs someone will rapidly develop a new theory for the Shroud\n\n","date":"July 5, 2012 at 1:45 pm","url":"https://shroudstory.com/2012/07/05/vatican-insider-another-big-bang/","cat":"uncategorized","id":"comment-13508","author":"Gabriel","site":"shroudstory"},{"title":"Vatican Insider: Another Big Bang","post":"I see that after just two years research, Italian art historians have just confirned that over 100 previously unidentified works were painted by the medieval artist Caravaggio, all found in his master’s workshop.  Surprising that after over 100 years no-one has yet been able to identify the mysterious “forger” who produced one Holy Shroud!  We know it wasn’t Leonardo – he didn’t get born yet!  And again it’s not really Caravaggio’s style! Or anyone else’s style for that matter??!!\n\n","date":"July 6, 2012 at 8:30 pm","url":"https://shroudstory.com/2012/07/05/vatican-insider-another-big-bang/","cat":"uncategorized","id":"comment-13553","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Vatican Insider: Another Big Bang","post":"To every skeptics who still think the Shroud is a very brilliant artistic forgery, I recommend you to read my recent open letter that was published on this blog : https://shroudofturin.wordpress.com/2012/04/21/please-dont-forget-the-evidence-of-the-bloodstains/\nI know I’ve done this before and I know it can sound a bit pretentious to plog his own text, but I really believe this letter make a very strong and honest case against any artistic forgery hypothesis that can exist…  Oh and by the way, I’m currently writting a more complete article on the base of that letter and expect the work to be complete in the next few weeks.  Seriously, I don’t think I’ve ever written anything better about the Shroud…  Stay tune ! \nFinally, concerning the matter-antimatter annihilation thing, it sound to me a bit like Dan Brown’s Angels and Demons book !  In front of all these science-fiction hypotheses concerning the Shroud, I never know if I have to smile or to cry…  These days, I’m more incline to smile because I know that most of these people are Christian believers who are blinded by their faith.  So, it’s understable to some degree and I think, in some cases, we can forgive them.  But in other cases (like here), when it is obviously done to make a buck using the name of Jesus, I say enough is enough !\n\n","date":"July 6, 2012 at 9:00 pm","url":"https://shroudstory.com/2012/07/05/vatican-insider-another-big-bang/","cat":"uncategorized","id":"comment-13555","author":"Yannick Clément","site":"shroudstory"},{"title":"Vatican Insider: Another Big Bang","post":"Yannick, in this new forthcoming paper, do you intend to address the issue of the directionality in image formation?\n\n","date":"July 7, 2012 at 4:41 am","url":"https://shroudstory.com/2012/07/05/vatican-insider-another-big-bang/","cat":"uncategorized","id":"comment-13561","author":"Gabriel","site":"shroudstory"},{"title":"Vatican Insider: Another Big Bang","post":"Hello Gabriel !  No.  As I said, it will be pretty much the same message than my open letter about the evidence of the bloodstains but it will be a much precise and complete paper.  For those who don’t know, the main goal of my open letter and of my upcoming paper will be to show with enough conviction (I hope !) that any hypotheses of image formation involving any kind of artistic technique have been set aside long ago by science and the authenticity debate concerning the Shroud would greatly gain if we could focus only on the 4 scenarios I’ve describe in my open letter (well, at first, there was 3 scenarios but, to be more precise, I’ve split one of them into 2 different scenarios).  I really hope this upcoming paper could be used by any defender of the authenticity of the Shroud against any skeptic who still think (wrongly, like science have already proved) that the Shroud is some kind of artwork…  I hope a paper like that will help to elevate the debate while pushing it in the right direction.\nFor the directionality of the image formation, I’m surely not enough skilled in this field !!!  For the moment, I trust Rogers judgement about that and say to myself : if this expert (who was one, if not THE person who best knew the Shroud) thought that the hypothesis he developed has some chances to be correct regarding all we know about the Shroud’s image (including the fact that the image seem to come from a vertical projection from the body), it surely the best hypothesis that exist out there !  It doesn’t mean he was surely right, but it means that theoretically (and even from an experimental perspective), his hypothesis can’t be set aside for the moment and deserve that some other expert take the lead and test it even more…\n\n","date":"July 8, 2012 at 4:34 pm","url":"https://shroudstory.com/2012/07/05/vatican-insider-another-big-bang/","cat":"uncategorized","id":"comment-13611","author":"Yannick Clément","site":"shroudstory"},{"title":"Vatican Insider: Another Big Bang","post":"Just a thought on the matter/anti-matter thing. The destruction of about 70kg of mass by an equal amount of antimatter would give an energy release equivalent to ten thousand 1 megaton nuclear explosions (rough figures – but you get the idea). This would not only have destroyed any cloth but a fair part of the middle east.\n\n","date":"July 10, 2012 at 6:58 am","url":"https://shroudstory.com/2012/07/05/vatican-insider-another-big-bang/","cat":"uncategorized","id":"comment-13684","author":"aljones909","site":"shroudstory"},{"title":"Vatican Insider: Another Big Bang","post":"To aljones909; This is all fine and dandy, but, it assumes something was ‘destroyed’.\nR\n\n","date":"July 10, 2012 at 1:32 pm","url":"https://shroudstory.com/2012/07/05/vatican-insider-another-big-bang/","cat":"uncategorized","id":"comment-13693","author":"Ron","site":"shroudstory"},{"title":"Vatican Insider: Another Big Bang","post":"Spelling it out clearly:  Baldacchini is saying that the only known physical process leading to the disappearance of mass (where’s the body gone?) is a matter-antimatter annihilation.  Every matter atomic particle, is supposed to be paired with an anti-matter particle, so we have positrons (anti-electrons), anti-protons, anti-neutrons etc.  The wonder is that there was any matter left over after the “Big Bang” which created the universe.  If a matter particle encounters an anti-matter particle, they are both annihilated, releasing energy according to Einstein’s equation: E = Mc^2.  AJ is saying, “Suppose your average 1st century Jew is about 70 kg, then destruction of the total body mass would result in a 10 GT nuclear explosion.”  However, clearly Baldacchini must be on the wrong track, as this didn’t happen.  The body disappeared, but several people claimed to have seen Jesus afterwards, unless they’re de Wesselow animists.  If we’re going to confine our thinking to purely physical processes, then a parallel universe becomes a much more credible alternative explanation.  Parallel universes are to me a stepping stone in scientific terms towards a modern conceptual idea of the “supernatural” world.  I wonder what Teilhard might have thought of that idea?\n\n","date":"July 11, 2012 at 4:45 am","url":"https://shroudstory.com/2012/07/05/vatican-insider-another-big-bang/","cat":"uncategorized","id":"comment-13718","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Vatican Insider: Another Big Bang","post":"I really don’t think Teilhard of Chardin was a good advocate for any kind of “physical traces” of the resurrection that would have caused an image on the Shroud !  Forget it !!!  At least, please, don’t make him say things that he didn’t say.  I don’t think you did that but someone else can be tempted to extrapolate while using Teillard point of view on the Universe.  The fact is that his point of view had nothing to do with the image we see on the Shroud.\n\n","date":"July 11, 2012 at 6:37 pm","url":"https://shroudstory.com/2012/07/05/vatican-insider-another-big-bang/","cat":"uncategorized","id":"comment-13750","author":"Yannick Clément","site":"shroudstory"}]
