[{"title":"Warning About Likely Email Scam In Shroud Community","post":"Mark Antonacci confirms:\n“Unfortunately, my email was hacked today and a spam email was sent out to my contacts around 12:14 p.m. CST today.\n“Please immediately delete this message.  Do not open or click on any links contained in the email.  If you do, your email could also become infected.\n“I am sorry if this has caused anyone any trouble.\n“Mark Antonacci”\n\n","date":"February 7, 2014 at 8:37 pm","url":"https://shroudstory.com/2014/02/07/warning-about-likely-email-scam-in-shroud-community/","cat":"uncategorized","id":"comment-77367","author":"Dan","site":"shroudstory"},{"title":"Warning About Likely Email Scam In Shroud Community","post":"There are several bugs like this circulating at present. Over the last few months, I’ve had several messages from known contacts which I call the “Green Coffee Bean” bug, sometimes twice from the same sender. The purported sender will not know of the message unless told by a recipient. Typically the subject matter will be terse, such as “hello” or may even be blank. The message content will usually only be a URL with purported sender’s name at the foot. Clicking the URL opens a silly video on the benefits of the “Green Coffee Bean”. Upon the recipient attempting to cancel the video, there is a pop-up, asking if you’re sure you don’t want to order. I suspect that this is the trap, and on clicking the pop-up, your PC then becomes infected, your address list is stolen and you risk becoming another sender. Possibly you risk other information also being stolen.  Just cancel the video, delete the message, and also delete it from your Deleted Items mail-box as well. It is better not even to open the video. Don’t do it! \nIf you have been infected, the best thing to do is to run a FULL System scan with your AV software to remove every vestige of it. Don’t be content with just a Quick Scan. \nMy IT consultant tells me that the Malware Pirates are becoming more aggressive now, and will change their Malware signature several times a day, makng it difficult for the AV houses to keep up with them. You need good AV and good Firewalls to stay safe!\n\n","date":"February 8, 2014 at 1:13 am","url":"https://shroudstory.com/2014/02/07/warning-about-likely-email-scam-in-shroud-community/","cat":"uncategorized","id":"comment-77403","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Warning About Likely Email Scam In Shroud Community","post":"This also happened to a Shroud enthusiast in England last year, and clicking on the attachment which came with his e-mail opened the door for a virus, which was blocked by the anti-virus. He knew nothing about what was going on until I alerted him.\n\n","date":"February 8, 2014 at 8:39 am","url":"https://shroudstory.com/2014/02/07/warning-about-likely-email-scam-in-shroud-community/","cat":"uncategorized","id":"comment-77466","author":"Louis","site":"shroudstory"}]
