[{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Pope Francis issued an encyclical that demonstrates intelligence and is timely. However, I think he would not refer to Apocalypse as that would create panic and the Book of Revelation is a document that is still very controversial. As I told Max on another thread today, it was only included in the Peshita (the Syriac New Testament) at a later date. It is not used in Orthodox Church masses, exception made to the Coptic Church. It has been dated to the second century and demonstrates some gnostic influence.\nI had occasion to discuss this topic briefly with Fr. J.A. Fitzmyer, in the context of the Essenes and their “eschatological army”, with the “sons of light” fighting the “sons of darkness”. He did not place much importance on the document and our discussion even included bits of humour because of present-day interpretations.\nAstrophysicist Adam Frank gave a slightly different touch to the question of conscious life, mass extinctions and the destruction of the universe. The problem is that if God is perfect why will he allow his own creation to be destroyed? There is both moral and physical evil. We are very much a part of the physical world that gave birth to us. It is a topic that also involves Hawking and Darwin.\nOn other occasion, while discussing Jesus and the Essenes with Prof. G. Vermes, I noted that, while he had a wonderful sense of humour, he was pessimistic when it came to what we can exactly derive from the Bible. He was accused of being “obsessed with Jesus” in Israel, but he had his own interpretation, wrote a number of books on him, one of which was reviewed by Dr. Rowan Williams, former Archbishop of Canterbury.\nNaturally, as a prelate Dr.Williams wrote also from the point of view of faith. Prof. Vermes seemed to have viewed Jesus as providing us with a sort of existential spiritual legacy.\nIs that enough for us? What is the meaning of it all?\nFather Hans Küng raised some important doubts about what tradition has brought us, but he has also not brought forth any convincing systematic theology. He has really missed the mark. There have been some better developments lately and these will appear in a different paper shortly.\nhttps://www.academia.edu/12851672/The_Historical_Jesus_The_view_of_Professor_Geza_Vermes\n\n","date":"June 23, 2015 at 1:18 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203370","author":"Louis","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Well…as usual I go back to Fatima….clearly there were ‘sons of darkness” when the children viewed the vision of hell….sure are a lot of intelligent people out there….doesn’t mean they’re smart.\n\n","date":"June 23, 2015 at 5:40 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203389","author":"rick","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Louis, you wrote: “It (The Book of Revelation) has been dated to the second century and demonstrates some gnostic influence”. \nMethinks you should read “Enquête sur l’Apocalypse : auteur, datation, signification”, éd. O.E.I.L., 1994. by French philosopher, Hellenist, Hebraist and theologian, Claude Tresmontant (1925 – 1997).  According to him The Book of Revelation can be dated to 52-54 CE and prophesied about the destruction of Jerusalem in the year 70 CE and does not refer to Parousia (or Second Coming of Yeshu’a/Christ’s Return).\n\n","date":"June 24, 2015 at 4:19 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203432","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Hi Max\nI have always considered C. Tresmontant as a scholar who hás to be respected because he was very serious. But, there is a controversy about whether the author of Revelation was Jewish or Greek and there is little doubt in general that it dates to the second century. As you know it is difficult to interpret it and interpretations vary because of the imagery and what is said to be gnóstic influence. I think that this was one of the reasons why it was not initially incuded in the Peshitta. The Syrians were wary because of the number of sects in their midst.\nThere is one church, not Protestant in a sense,  whose followers still believe that Babylon refers to Rome and 666 to the Pope.\n\n","date":"June 24, 2015 at 6:37 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203442","author":"Louis","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"If I remember correctly the “Worldwide Church of God” believed Babylon referred to Rome. I see not evidence it was before the second century.\n\n","date":"June 24, 2015 at 8:22 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203452","author":"John Green","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Louis, you wrote: “there is little doubt in general that it dates to the second century” and John Gree chimes in: “I see not evidence it was before the second century.”\nActually it is quite the contrary.\nMethinks neither you nor John Green have ever read Tresmontant’s “Enquête sur l’Apocalypse : auteur, datation, signification”. Had you, both of you just could not push as nearly a fact what is just a scholarly speculation.\n\n","date":"June 24, 2015 at 9:21 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203458","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Why don’t you give us the evidence\n\n","date":"June 24, 2015 at 9:29 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203460","author":"John Green","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Max,  I am busy now with a text for publication. Will get back to you at the end of the day.\n\n","date":"June 24, 2015 at 11:07 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203468","author":"Louis","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Methinks John ingested one too many magic mushrooms.\n\n","date":"June 24, 2015 at 4:56 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203503","author":"John Green","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Hi Max and John\nJohn, I can see that you feel that Max reminds us of Allegro! Well, the subject matter does lead to what some judge to be esoteric literature and, as you know, interpretations can vary.\nIn yesterday’s comment I was not referring to WCG or its founder, Herbert Armstrong, whom I listened to once. He was a soft-spoken and well-intentioned man, but I could not agree with much he was saying. The church I was referring to still has its faithful judging that the Book of Revelation refers to Rome. I have had to tell them that, then, it means they got their NT from 666 and also know their date of birth because of him.\nMax, I have been guided by the discussion I had with J. A. Fitzmyer. It was in connection with Essene beliefs. Although some aspects of the milieu in the first century may have crept into the Book of Revelation that does not make it a first-century document. I commented a few days ago that, at the rates things are going, Biblical Studies will become Near Eastern studies and nothing more if we are not careful and do not  make distinctions between the various cultures and detect where there could be syncretism:     https://www.academia.edu/12813935/Does_the_Shroud_show_a_Mandaean_burial\nThe former Presbyterian minister and now Catholic apologist Scott Hahn has published a book on the Book of Revelation, which is roughly in keeping with why Fr. Fitzmyer did not consider the topic important in the context of our discussion:\nhttp://www.scotthahn.com/about-dr-hahn.html\n\n","date":"June 25, 2015 at 10:37 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203590","author":"Louis","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"I did have occasion to listen to a talk by Herbert Armstrong, the founder. They sent me their magazine for many years when I was in school. Well, the purpose of all this was just to see what other churches were saying and I had no obligations. I had begun to write on religion quite early in life.\n\n","date":"June 24, 2015 at 8:34 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203453","author":"Louis","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"John Green,\nSince you stick to the original  topic when commenting you might like to read “In defense of the historical-critical method”, which is reviewed below. It is a small book, which also helps in understanding why both allegory and esoteric interpretations (which you noted above) have to be ruled out:\n https://www.academia.edu/12850351/Book_Review_The_Interpretation_of_Scripture_In_Defence_of_the_Historical-Critical_Method\nThe historical-method is essential and can be used together with other methods in exegesis. What we see in second-century literature demonstrates what was circulating during the period, just as we see that the ideas in the fourth century BC led to conflict:  https://www.academia.edu/12734802/Book_Review_Beyond_the_Essene_Hypothesis_The_Parting_of_the_Ways_between_Qumran_and_Enochic_Judaism\n\n","date":"June 25, 2015 at 5:12 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203636","author":"Louis","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Here’s what you can say (and this speech only remaining\nin the realm of [alone] Science!):\nWhen you want to talk about climate change,\nyou must also remember that we receive a lot of energy from the Sun…\n>…Solar variation, together with volcanic activity are hypothesized to have contributed to climate change, for example during the Maunder Minimum.\n>Changes in solar brightness are considered to be too weak to explain recent climate change. …\nLinks:\nhttps://en.wikipedia.org/wiki/Solar_variation\nhttp://ossfoundation.us/projects/environment/global-warming/natural-cycle\nhttps://en.wikipedia.org/wiki/Paleocene%E2%80%93Eocene_Thermal_Maximum\nhttps://en.wikipedia.org/wiki/Maunder_Minimum\nThe term Maunder minimum was introduced after John A. Eddy published a landmark 1976 paper in Science.\n>Astronomers before Eddy had also named the period after the solar astronomers Annie Maunder (1868-1947) and E. Walter Maunder (1851–1928) who studied how sunspot latitudes changed with time.\n>The period the husband and wife team examined included the second half of the 17th century.\n>Two papers were published in Edward Maunder’s name in 1890 and 1894, and he cited earlier papers written by Gustav Spörer.\nIn any case I find interesting to think at the vision\nwitnessed by so many people for what they saw in Fatima.\nSee also: the pulsations and / or changes in the sun …\nLinks:\nhttps://en.wikipedia.org/wiki/Miracle_of_the_Sun\nhttp://www.zenit.org/en/articles/pius-xii-saw-miracle-of-the-sun\n\n","date":"June 24, 2015 at 8:42 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203455","author":"piero","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"I have read:\n>The Roundtable on Sustainable Palm Oil (RSPO) has prohibited Singapore-based Golden Agri Resources (GAR) from developing new areas for oil palm plantations in Indonesia, where it is the largest producer of the tropical commodity, for alleged violations of several RSPO norms such as community land rights. … …\n>The non-profit RSPO was founded in 2004 to promote the growth and use of sustainable palm oil through global standards and engagement of stakeholders. According to the World Resources Institute’s (WRI) Global Forest Watch platform, about 12 per cent of global oil palm farming is currently RSPO certified. …\nLinks:\nhttp://palmoilaction.org.au/\nhttp://palmoilaction.org.au/2015/06/international-body-freezes-expansion-of-palm-oil-giant/\nhttp://www.rspo.org/about/how-we-work\nhttp://www.rspo.org/members/all\nhttp://www.rspo.org/consumers/about-sustainable-palm-oil\n…And You,\nWhat do you think about the rough actions against palm oil?\nPerhaps Colin Berry has the best informations.\nI believe that he could be an excellent chemist for us (in this specific field).\n-*-*-*-*-*-*-*-*-*-\nInstead, with regard to the idea of using of oils on the Shroud,\nI believe they were not used.\nIn fact, we can see that blood stains have not been deburred/smeared\nfor the presence of oil.\nHowever try yourself to do the inherent experiments,\nwith blood and olive oil (or with an aromatic oil), so we’ll see the truth…\nThen we require a sort of “Akademie Olympia & oils” (see also: Einstein and the “Akademie Olympia”, for model… Link: https://en.wikipedia.org/wiki/Olympia_Academy\nBut… Where is our Grossmann ?).\n\n","date":"June 24, 2015 at 10:53 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203467","author":"piero","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"On the Book of the Revelation to John: \nThe Revelation (i.e., Apocalypse) to John is an answer in apocalyptic terms to the needs of the church in time of persecution, as it awaits the end-time expected in the near future. The purpose of the book is to encourage and admonish the church to be steadfast and endure.\nThe form of an apocalypse shows affinities with contemporary Jewish, Oriental, and Hellenistic writings in which problems of the end of the world and of history are linked both with prophecy of an eschatological nature and with “sealed” secret mysteries. Such revelations are traditionally received in trances, characterized by strange symbols, numbers, images, and parables or allegories that represent people and historical situations.\nApocalypticism is essentially dualistic, presenting the present eon as evil and the future as good, with an ultimate battle between the divine and the demonic to be won only after one or more cosmic catastrophes. The aim of apocalyptic literature is to depict in the age of present tribulation a knowledge of a future glorious victory and vindication, thus giving hope and assurance. \nIn Revelation, it is God who gives the revelation to Jesus Christ to be shown by Christ through an angel to his servant John, in exile on the island of Patmos, in order that John become his seer and prophet to the church. John is to write down what he has seen, what is, and what is to come. In contradistinction to most Jewish apocalyptic works, Revelation is not pseudonymous and John is to give finally unsealed, clear prophecy related to the present and to the end-time.\nAs in the rest of the New Testament, the starting point of eschatological hope is the saving act of God in Jesus, a historical centre pointing toward historical developments that will bring about the establishment of God’s kingdom and vindication of his people, ransomed by the blood of Christ, the Lamb who was slain. It provides certainty and encouragement with the example of the faithfulness of those who have already witnessed unto death (martyrs) and their reward-special inheritance in the eternal kingdom.\n… …\nThe letters sent from the heavenly Christ through John (chapters 2 and 3) exhort, comfort, or censure the churches according to their condition under persecution or danger of heresy. From chapters 4-22 there are series of visions in three main cycles, each recapitulating but expanding the former in greater and clearer detail with groups of seven symbols predominating in each (seals, chapters 6-7; trumpets, chapters 8-10; and bowls, chapters 15-16). \nThis material is interspersed with visions of God in his heavenly council, various visions of catastrophe and of Satan, the destroyer, the appearance of two witnesses and other martyr examples to spur the church to endurance, the victory of the archangel Michael over the dragon (Satan) by the blood of the Lamb (Christ), and the representation of the powers of emperor cult and false prophecy as beasts who bring destruction to the unfaithful in God’s judgment. \nIn summary, the seer reminds the reader that the words, because they are of God, are trustworthy and true. The motif that the Lord is coming soon is again repeated. This reflection of the early Christian watchword suggests a sacred liturgical style. The last verse is the closing benediction-perhaps not only of the letters in the beginning of Revelation but of the whole of Revelation, which was to be read aloud in a worship setting. \nApocalypticism was introduced into Asia Minor after AD 70 (the fall of Jerusalem), and c. 80-90 a prophetic circle was formed near Ephesus. Its leader was John, a prophet, who might well have been the author of Revelation, which is deeply steeped in apocalyptic traditions. \nThe “Johannine circle” bearing the tradition of John, the Apostle of the Lord, and from which emerged the Gospel and letters bearing his name, might have been a continuation of the prophetic conventicle of Ephesus in which John was prominent. The various writings do not have to be consistent except in their basic faith in Jesus Christ; and, as the situations to which they addressed themselves were different, different styles and content were required.\nThe seer was probably involved in an actual historical situation in the late 80s under Domitian, a time when there was open conflict between the church and the Roman state. \nThere is a tradition supported by Irenaeus, a 2nd-century bishop of Lyons, that in this persecution punishment was death or banishment. John’s prominence might have led to banishment to Patmos, an isle off the coast of Asia Minor, from his homeland in or around Ephesus. From Patmos he wrote a circular letter to the churches in Asia.  \n… … Revelation is written in fantastic imagery, blending Jewish apocalypticism, Babylonian mythology, and astrological speculation. It is pictorial, dramatic, and poetic. \nRevelation contains long sections characterized by Greek that is grammatically and stylistically crude, strangely Hebraized to give a unique, almost Oriental, colour. This may have been deliberate. Although Revelation is replete with Old Testament allusions, there are no direct quotations, and this may reflect the seer’s conviction that the work is a direct revelation from God. \nIn other sections the poetry of Revelation might stem from the seer’s experience in the heavenly throne room of God, from hearing the hymns of the angelic host, or from his recollection on Patmos of the liturgical practice of the church. The image of the Bride and wedding feast together with the “Come, Lord Jesus!” have associations with the eucharistic liturgy of the early church.\n… …\nThe mysterious name of the first beast, 666, in 13:18, can be calculated by “gematria,” assigning their numerical values to letters of the word and summing them up. The most adequate solution is Nero (the numerical value of the Hebrew letters for Caesar Neron equals 666), a demonic Nero redivivus (revived), who returns from the dead as Antichrist.\n… …\nThe cosmic battle in heaven is fought by those willing to give their lives, who mix their blood with the blood of the Lamb, whose blood “ransomed men for God.” The writer of Revelation based his hope for the church on perseverance, on endurance even to death, and on what the future will bring when the church will live with the glorified Christ, slain as a lamb. The harlot of Babylon will be destroyed and the church will endure; Babylon falls and the new Jerusalem, the city of God that is to come, is depicted in all its glory. These are the hopes to strengthen the persecuted church, assurance that God will soon triumph. With trumpet call and heavenly voices there is the joyful promise that “The kingdom of the world has become the kingdom of our Lord and of his Christ, and he shall reign for ever and ever.”  \nThese selected extracts originally by Rev. Krister Stendahl & Emilie T. Sander\n\n","date":"June 24, 2015 at 4:29 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203499","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Dave, Actually we can understand “maranatha” written in Greek script as two words in Aramaic, מרן אתא, “Maran atha”, “our Lord has come” (not “Come Lord!”) and 666 (actually six six six) most likely refers to Hôrôdôs (a seven-lettered word = the Herodian dynasty = the seven Herods with the last Herod, Herod Agrippa II included = the Seven-headed beast) that is spelled with three waws or vavs(the waw or vav = 6). Herod Agrippa II, as the last Herodian king saw the destruction of Jerusalem in 70 CE.\n\n","date":"June 24, 2015 at 6:41 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203514","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"This is a prophecy of the destruction of Jerusalem to come (in the time of the last “Horodos” of the Herodian dynasty).\n\n","date":"June 24, 2015 at 6:45 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203516","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Max, I don’t think I can accept this explanation, but I would have to say that any attempts at interpreting the number are fraught with speculation.  \nIt requires an anti-Herodian bias on the part of the author which I don’t see elsewhere in the text.  Such bias as there was, seems merely to have originated with the anti-Idumean heredity of the Herods, which is extraneous to Revelations.  Nor do I see the vaw-vaw-vaw replication of 6-6-6 in the text. \nThe Greek texts – both 1550 & 1894 Textus Receptus & the Byzantine Majority – use the Greek numerals khi-xi-sigma.  The sigma appears to be a possible typo for the obsolete letter digamma, as otherwise sigma had the value 200, but being placed at the right suggests here a units value.  [khi = 600, xi = 60, digamma = 6]  The texts, Alexandrian and Hort & Westcott, both give the number in words “exakosioi exikonta ex”, and which Jerome transcribes in words as “sescenti sexaginta sex”.  Clearly the number is six hundred and sixty-six, and not six-six-six.  \nIfrah’s text on the history of numbers [From One to Zero] has a comprehensive chapter on gematria giving several Hebrew, Greek and Arabic examples.  \nThe transliteration he gives for applying the number to Nero is QSAR NERON, which he transcribes into their Hebrew equivalent, but reading from right-to-left as:\n“nun-vaw-resh-nun,  resh-samekh-qoth” thus “50-6-200-50, 200-60-100” which adds up to the number 666.  \nThe Book of Revelations makes the greatest sense to me when I see it in terms of the imperial persecution of the early Christians along the lines as interpreted by Stendahl & Sander as I’ve summarised above.\n\n","date":"June 24, 2015 at 8:42 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203524","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"A thought….the shroud is a metaphor….for the mystery of God….the mystery of life and the universe… the Shroud exists but cannot be explained…we try to fathom it but we can’t\n\n","date":"June 25, 2015 at 5:44 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203563","author":"Thomas","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Dave,\n.6.6.6. as the number of the SEVEN-headed beast can refer to the Herodian dynasty that counts SEVEN kings.  Could you as accurately account for Nero being described as a SEVEN-headed beast? \nThen if 666 refers to Nero (actually NRWN KSR, “NERON CAESAR”, transliterated into Hebrew, renders the number in conjunction with seven letters), it does not make much sense and is not the sole encryption possibility since the very name “Horodos” was indifferently used in Greek, Aramaic and Hebrew by both Hellenistic and non Hellenistic Judeans. Now when transliterated in Hebrew, it is spelled with SEVEN letters and three vavs = .6.6.6.. \nIn light of “the Acts” of the Seven Herodian Kings and the events related by Joseph Flavius and Philo of Alexandria (you should read or re-read them), the reference to “Horodos” as .6.6.6. does make sense, which it does not if 666 should refer to Nero. According to Tresmonant, the Book of Revelation was written at a time of Herodian persecutions of the early Christian community in the 50s C.E.. Actually the Herodian tyranny started with Herod the Great (Yeshua’s parents had to flee to Egypt because Herod wanted to kill the newly born MessiaH) and ended with Herod Agrippa II (born in 37 C.E., he committed suicide in 68 C.E. when the empire revolted) whereas Nero’s persecution of the early Christian community started not until 64 C.E..\nIf you think .6.6.6. refers to Nero not to “Horodos” (= standing for the Herodian dynasty of seven kings), it means you totally missed the fact, as early as the 50s C.E., John  prophesied/predicted the destruction of Jerusalem to “those who have ears to hear and can hear”. The fact is the early Christian community around the time  the war between Rome and Judea broke out in Caesarea (66 C.E.), the Christian community in Jerusalem evacuated to Pella in Jordan because of a prophecy: the one in the Book of Revelation.\nAccording to Tresmontant, neither .6.6.6. refers to Nero but to Horodos (the Herodian dynasty of Seven kings) nor Babylon to Rome but to Jerusalem.\n\n","date":"June 25, 2015 at 10:45 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203591","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"And just guess what the early Christian community took to Pella: most likely, the Sindon/Himation of John’s Revelation.\n\n","date":"June 25, 2015 at 11:08 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203599","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Error: NERO (not Herod Agrippa II) was born in 37 C.E.and committed suicide in 68 C.E. when the empire revolted.Herod Agrippa II was born in 27/28 C.E.and died ca. 92 or 100 CE. He was the seventh and last king of the family of Herod the Great, the Herodians.\n\n","date":"June 25, 2015 at 11:45 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203602","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"In 66 C.E. the Judeans expelled him and his sister Berenice from Jerusalem.\n\n","date":"June 25, 2015 at 11:49 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203603","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Max, you are deviating from the topic raised by the post. What has Herod to do with any apocalypse in the future? Did you read the message directed to you and John Green above?\n\n","date":"June 25, 2015 at 12:13 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203607","author":"Louis","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Louis, actually I was repliyng to Dave and methinks the true future of the Book of Revalation. was 1945 years AGO (the destruction of Jerusalem)! Besides  you were the first to mention the Book of Revelation on this thread and most misleadingly wrote as if it were a Gospel truth: “It (The Book of Revelation) has been dated to the second century and demonstrates some gnostic influence”. Don’t you remember?\n\n","date":"June 25, 2015 at 12:29 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203608","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Max, I simply mentioned the Book of Revelation in this thread because there is a reference to the Four Horsemen of the Apocalpyse. It seems therefore that you have not read Dan’s post with the link above, which was my starting point. I also wonder if you have read the other links I gave you as the first one rougly describes the milieu in the first and second centuries AD.\nI did not write anything claiming that it is gospel truth, what was written was based on my discussion with Fr. Fitzmyer, one of the twentieth century’s greatest New Testament scholars, far superior to other scholars cited on this thread. Part of the discussion, not online, was published in a leading daily, and I can shortly go through the rest — on the milieu that also influenced the Essenes — and post it for you to read later on.\nScott Hahn, who is a theologian, also seems to have provided a convincing study, mentioned in my comment above.\n\n","date":"June 25, 2015 at 1:15 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203611","author":"Louis","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Here a speculation:\nWere the Four Horsemen of the Apocalpyse a christian answer\n(= four fearsome horsemen) for the strange facts around\nthe favored horse of Caligula?\n>Incitatus (Latin) was the favored horse of Roman emperor Caligula\n(who reigned in 37–41 AD).\nHis name is a Latin adjective meaning “swift” or “at full gallop”…\n>According to Suetonius’ Lives of the Twelve Caesars (121 AD), Incitatus had a stable of marble, with an ivory manger, purple blankets, and a collar of precious stones. Dio Cassius has indicated that the horse was attended to by servants, and was fed oats mixed with gold flake. … etc. …\nLink:\nhttps://en.wikipedia.org/wiki/Incitatus\n— *** —\nOther words (= poetry) about Caligula’s folly\nby Oriana Ivy\n(a Translation about Zbigniew Herbert):\n“Caligula Speaks”\nAmong all the citizens of Rome\nI loved only one\nIncitatus–a horse\nwhen he entered the Senate\nthe unstainable toga of his coat\ngleamed in the midst\nof purple-lined assassins\nIncitatus possessed many merits\nhe never made speeches\nhad a stoic temperament\nI think at night in the stable he read the philosophers\nI loved him so much that one day I decided to crucify him but his noble anatomy made it impossible. … etc. … etc. … etc. …\nLink:\nhttp://www.thescreamonline.com/poetry/poetry7-2/herbert/oriana_ivy.html\n\n","date":"June 26, 2015 at 9:56 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203707","author":"piero","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"The choice to depict the Four Horsemen of the Apocalpyse in that Book was to humiliate the Roman Empire’s hate against the Christianity…\nBut (perhaps) we have also to take into account other opinions about the madness of Caligula:\n>… “His aim,” Winterling writes, “was to destroy the aristocratic hierarchy as such and expose it to ridicule.” Seen in this light, some of Caligula’s pranks become more understandable. Notoriously, for instance, he wanted to make his favorite horse, Incitatus, a consul—on the face of it, an insane thing to do. But Winterling suggests that this was never a serious plan, merely a way to mock the aristocrats, for whom the consulship was the crown of a career in politics: “To equip the emperor’s horse with a sumptuous household and destine it for the consulship satirized the main aim of aristocrats’ lives and laid it open to ridicule.”\n>Caligula’s madness, in other words, was a deliberate exercise in political showmanship. This principle allows Winterling to explain another baffling episode in Caligula’s biography, when he supposedly declared war on the\nEnglish Channel… … …etc. … \nLink:\nhttp://www.newyorker.com/magazine/2012/01/09/the-empire-strikes-back-adam-kirsch\n\n","date":"June 26, 2015 at 10:15 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203710","author":"piero","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Others, not only Max, have commented on the number of the beast in this thread.  There could only be merit in the argument that it refers to the Herodian dynasty, if there is evidence in any primal text that the original author intended the number correspond to the Hebrew number vaw-vaw-vaw, which in Greek I would presume to be translated as ‘ex-‘ex-‘ex.  The examples I have given all show the number was interpreted as six hundred and sixty six.\nhttp://www.greeknewtestament.com/B66C013.htm , see verse 18. \nIs Max able to demonstrate an original text supporting the argument that the number was meant to be six-six-six?  \nMost of the several gematria examples given by Ifrah, tend to commence with a given text or phrase from which a number such as a date or a year can be derived.  Going in reverse from a number to a presumed text, as in Rev 13:18, seems more unusual a practice and is obviously fraught with ambiguities in interpretation.   \nThe only evidence for Herod the Great’s purported massacre of infants is given in Matthew’s infancy narrative, and seems to be a literary ruse so he can bring Jesus out of Egypt as the new Moses.  There is no other historic evidence for this crime, although there were several crucifixions and executions of Jews about this time resulting from a few rebellions and riots.  \nI am of the opinion that the Herodian dynasty did a lot more good for the Jewish people than evil which was overstated by the Jewish writers including the evangelists, but this went unappreciated because of their Idumean ancestry.  Herod the Great himself sold much of his own silver to purchase bread during a Jewish famine, and he frequently intervened with Rome on their behalf to forestall imperial offending of Jewish religious sensibilities.  \nHowever I do see merit in Max’s occasional mention of the verses in Rev 19:11-16 where the cloak worn by the rider of the white horse, “Faithful and True” may be a hidden reference to the Shroud.\n\n","date":"June 25, 2015 at 4:26 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203630","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Louis & Dave, \nMethinks you totally overlook (as usual) the Hebrew substratum of the Book of Revelation and conservatively stick/parrot to the old paradigm/mantra (“A second century book originally written in Greek”) when Tresmontant rather convincingly did demonstrate it was a translation from an Hebrew original and proved to be much more insightful than all “your” allegedly “twentieth century’s greatest New Testament scholars” put together: scholars you most uncritically rely on. Most obviously neither Louis nor Dave have ever read Tresmonant’s Enquête sur L’Apocalypse : L’auteur- La date- Le Sens”! “For Christ’s sake”, when are you to read it before passing comments on the BOR theme?\nRe. “your” ominous 666 coding Nero, lately a team of expert classicists, using new photographic techniques, “finally” thinks they deciphered the Book of Revelation original writing. According to the newly revisited fragment of THE OLDEST SURVIVING COPY of the New Testament, written in ancient Greek and dating FROM THE LATE THIRD CENTURY (as part of a hoard of previously unintelligible manuscripts discovered in historic dumps outside Oxyrhynchus in Egypt), instead of 666, the Antichrist’s name should be 616! \nWhence, according to Professor David Parker, Professor of New Testament Textual Criticism and Paleography at the University of Birmingham, “(616) is an example of gematria, where numbers are based on the numerical values of letters in people’s names. Early Christians would use numbers to hide the identity of people who they were attacking: 616 refers to the Emperor Caligula.” Ring some bell?\nIn sum THE OLDEST SURVIVING COPY of the New Testament (late third of the 3rd c. CE) has 616 (and neither  666 nor “Six Hundred And Sixty Six”)! \nWhat now do you make of that?\nAs long as you’ll blindingly and adamantly stick to your dear old paradigm and deliberatedly refuse to hear about Tresmontant’s most insightful inquiry into the textual/Hebrew substratum of the Book of Revelation, there is no way to seriously debate here.\n– How long shall you ignore HORODOS is Hebrew for Herod (and the Seven-kinged Herodian dynasty) and can code .6.6.6.?\n– How long will you elude my question: how can you account for Nero being described as the Seven-headed beast and why not Caligula or any other Roman Emperor you can think of?\n– How long shall you totally overlook the early Christian community in Jerusalem evacuated to Pella in Jordan because of a prophecy and STILL be unable to tell me exactly which prophecy it was? (Tresmontant rather convincingly demonstrated the prophecy was in the Hebrew original version ot he Book of Revelation).\nThe number 616 or 666 (if ever it was written as “six hundred and sixty six”  in the Hebrew original, whic I very much doubt), is a cryptographic red herring at best and more simply refers to HORODOS as .6.6.6.\n\n","date":"June 26, 2015 at 4:24 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203680","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Louis & Dave, BTW Could you account for the fact Early Christians would use numbers to hide the identity of Nero or Caligula they were attacking or refferring to when, in the second c. CE both Nero and Caligula died respectively in 68 C.E. and 41 C.E.? Why the use of coding their name more than two century after their death? This does not make sense at all!\n\n","date":"June 26, 2015 at 4:32 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203682","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Typo: when, both Nero and Caligula, who died respectively in 68 C.E. and 41 C.E. were no longer in the world of the living?\n\n","date":"June 26, 2015 at 4:36 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203685","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Dave, you wrote: “I am of the opinion that the Herodian dynasty did a lot more good for the Jewish people than evil which was overstated by the Jewish writers including the evangelists, but this went unappreciated because of their Idumean ancestry. Herod the Great himself sold much of his own silver to purchase bread during a Jewish famine, and he frequently intervened with Rome on their behalf to forestall imperial offending of Jewish religious sensibilities.”\nRe the historical and political context in the time of the Herodian dinasty, have you ever read Joseph Flavius’ War and Antiquities of the Judeans and Philo of Alexandria’s Legatio ad Caium and Legum allegoriae etc? Have you ever read Tresmontant demonstrating how the Herodian dinasty was a dinasty of pro-Roman collaborators and IduMEAN (pun intended) tyrans (very “nasty” indeed, pun intended too)? If the Herodian dynasty “did a lot more good for the Jewish people than evil” so then did the Romans as long as you were not a Jewish rebel to their power and privileges.\n\n","date":"June 26, 2015 at 5:14 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203690","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Max, I’m quite prepared to have a cool rational discussion about any topic under the sun.  I have no wish to participate in any heated discussion, where emotion runs high, and my contender accuses me of being ignorant and overlooking matters which are solely privy to his own highly selective sources.  \nI can find serious fault and inconsistencies in the thread of your argument above.  I’m not even going to discuss them or say what they are.  I have given you my arguments why the number is six hundred and sixty six.  I have quoted received texts and an historian of numbers.  You have produced no evidence nor proof to support your alternative assertions that the number is either six-six-six or six-one-six.  You have referred to texts found in rubbish dumps. \nYou will have to continue this discussion alone.\n\n","date":"June 26, 2015 at 5:34 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203691","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Daveb, the TRUE FACTS ARE:\n – I can account for 666 = .6.6.6. = H6R6D6S = HORODOS (aka Herod Aggrippa the  seventh and last Herodian king) reying on the Hebrew subtratum of the Book of Revelation.\n – You just cannot account for Nero being described as the Seven-headed beast.\n– I can account for the early Christian community in Jerusalem evacuated to Pella in Jordan because of a prophecy that is to be found in the Book of Revelation (see Tresmontant’s rather convincing demonstration)\n– You are totally unable to tell exactly which prophecy it was.\n– I can account for the fact the author of the BOR used a number to hide the identity of Herod Agrippa II as seventh Herodian King because the BOR was written in the 50s C.E. that is under Herod Agrippa II’s persecution of the early community of Jerusalem (see Tresmontant’s Enquête)\n– You are totally unable to account for Nero (or Caligula) being attacked or referred to when, both Nero and Caligula, who died respectively in 68 C.E. and 41 C.E. were no longer in the world of the living and thus just cannot account for the use of coding Nero’s (or Caligula’s) name more than two century after his death. \nIndeed serious fault and inconsistencies in the thread of your NO-ARGUMENT-TO-OPPOSE- ABOVE is definitetly to be found with you!\nMethinks YOU most selectively read or consider only what only confirms your view as far as the Book of Revelation is concerned and DO turn a deaf ear to any scholarly argument that contradict it as you keep not answering my simple questions. Is it what you call  a rational discussion? How can it be just cool with you? \nReminder re “texts found in rubbish dumps in Egypt”: Oxyrhynchus rubbish dump is located in Egypt and Oxyrhynchus is well known among TRUE scholars (see the  Oxyrhynchus papyri).\nBTW the very shroud (now kept in Turin) was considered too by some as a mere old “rakkos” or rag in one point in time. Could you not juge on mere appearances and answer my questions…IF YOU CAN, please.\n\n","date":"June 26, 2015 at 6:39 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203697","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"I think that has not been taken into account also the death of James in the year 62, the rivalry between Judeo-Christians and followers of St. Paul and the mediation efforts tried by St. Peter …\nAnother thing:\nIs it possible to think that in Antioch Saint Paul had the Shroud available for his catechesis? … and … that this was the source of a further division between the two movements of early Christianity?\nWe have to take care until the historical embroidery is removed from its wooden support …\nThe Acts of the Apostles records three missionary journeys of St Paul and his companions. The fourth missionary journey was done by St. Paul alone, as a prisoner in chains, from Jerusalem to Rome, and eventually to his death. \n>…Pope Benedict said a tiny hole had been drilled in the sarcophaguus, revealing “traces of a precious linen cloth, purple in colour, laminated with pure gold, and a blue coloured textile with filaments of linen. It also revealed the presence of grains of red incense and traces of protein and limestone. There were also tiny fragments of bone, which, when subjected to Carbon 14 tests by experts, turned out to belong to someone who lived in the first or second century.\nLink:\nhttps://lukechandler.wordpress.com/2009/06/30/the-apostle-pauls-bones-identified/\n… et voilà ! …\n… And now the strange historical embroidery is placed on its wooden backing!\nWhat instead happens if that was a fake of the Constantine epoch ?\nWhere are the careful analyses (= careful works in our Nano-analytical epoch) ?\n\n","date":"June 26, 2015 at 11:51 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203721","author":"piero","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Louis, could you first read Tresmonant’s Inquiry, please?\nDo you really think YOURSELF, The Book of Revelation “has been dated to the second century and demonstrates some gnostic influence”\n\n","date":"June 28, 2015 at 5:11 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203945","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Louis, could you first read Tresmontant’s Inquiry, please before passing your own comments?\nYou wrote the Book of Revelation”has been dated to the second century and demonstrates some gnostic influence”. Second century, oh really? \nCould you account for 666 coding Nero and Babylon Rome and tell me when exactly Rome was destroyed?\nCould you account for the prophecy in Rev. 18:4 and the Christian community of Rome’s flight fromthe city?\nCould you account for Eusebius of Caesarea writing that the early Christian community of Jerusalem had been commanded by AN ORACLE/PROPHECY given “before the war” to depart from the city of Jerusalem (Eusebius Eccl. Hist. 3.5 and Panarion 30:2)?\n\n","date":"June 28, 2015 at 10:01 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203962","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Max, I said I would stop taking part in the discussion because there was topic drift and you were encouraging it. Why should I buy the book by Tremontant if there is a shortcut? All you have to do is to check the links I gave you and that is free of charge. Once you read what I asked you to read then we can discuss Tresmontant. There is no point in putting the cart before the horse.\n\n","date":"June 28, 2015 at 11:08 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203968","author":"Louis","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Louis, I read your links. Now could you answer my questions, please?\n\n","date":"June 28, 2015 at 3:33 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203989","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Good, Max. Now you are on the right path.  You should now proceed by citing the lines by C. Tresmontant that are relevant to our discussion. I can comment after that is done.\nTake your time because suddenly there appeared some work on biblical archaelogy involving a meeting, which will take my time till tomorrow morning. I can get back to you after this.\n\n","date":"June 28, 2015 at 4:02 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203993","author":"Louis","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Hi Max\nNo offence is intended when I have to tell you that it will not be possible to continue this discussion because there is topic drift. Dan’s post referred to a document, with link, where there is reference to the Four Horsemen of the Apolcalypse. Can you demonstrate what relevance it can have to Shroud studies and what can happen to the universe today, thus making your own contribution? That is what I think those who are reading this thread would like to see. There is no point in talking about Herod, Nero and Caligula.\nI did not read the book by Claude Tresmontant you cited, only some papers about him that gave me an idea about his approach. He was a very serious and highly qualified metaphysician and theologian, but not a heavyweight in exegesis. As I commented earlier, I prefer the historical-critical method, used with other methods if needed, when making a critical study of the Bible. There is no room here for allegory and esoteric interpretations, much less fundamentalism. \nBiblical studies today have taken a very different direction, the previous quests for Jesus are being questioned and there is even more scepticism. We have to find continuity between Jesus’ teaching and the Gospels in an understanding of human existence. Otherwise biblical studies will be absorbed by Near Eastern studies, the Bible being dismissed as literature of a particular culture during a particular period with no relevance to us today. We see that going on everyday.\nYou will perhaps need the help of a friend to help you read the links below, without which no discussion is possible:\nhttps://www.academia.edu/4700001/What_do_we_know_about_the_Bible_An_interview_with_Joseph_A._Fitzmyer_SJ\nThe above link will show you how theologians can be conditioned by past mistakes, which have no relevance to us today. Benedict XVI was conditioned by Reimarus, F.C.Baur and others to a certain extent. Biblical interpretation is highly complicated.\nIf you think that the historical-critical method is not valid read the book reviewed below:\nhttps://www.academia.edu/12850351/Book_Review_The_Interpretation_of_Scripture_In_Defence_of_the_Historical-Critical_Method\nEach generation in ancient Palestine came up with interpretations of the worldviews that were in vogue and reached no consensus\nhttps://www.academia.edu/12734802/Book_Review_Beyond_the_Essene_Hypothesis_The_Parting_of_the_Ways_between_Qumran_and_Enochic_Judaism\nThe Book of Revelation should also be evaluated from this point of view.\n\n","date":"June 26, 2015 at 10:31 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203711","author":"Louis","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"What have to do with the Apocalypse (= the Book of Revelation),\nLugdunum Convenarum (now Saint-Bertrand de Comminges,\nthe exile’s village for Antipas with Herodias), the recent words\nby Pope Francis and Al Gore ?\nI think we can always speculate on History, etc., but what is important is\nto demonstrate (in a serious manner) that what is claimed to be the truth\nis really the truth…\nA land of exile …\nIs it in this world, of exile, that we are transforming our old planet Earth?\nYet we had already destroyed many animal species in the past …\nIn short, where we can find another lowest common denominator?\nFor example:\n>John’s denouncement was that Antipas had married his brother Philip’s Wife.\nThe Mosaic law forbad the marriage of a brother’s wife (Lev 18:16; 20:21) with the exception of raising children … …\n>Herodias was not satisfied to leave John in prison and so at a suitable time she arranged for a banquet, probably for Antipas’ birthday, at Machaerus in Perea in order to get rid of John. Her daughter Salome danced before Antipas’ dignitaries and he promised her with an oath that he would give her anything up to half of his kingdom. Being advised by her mother, she requested John the Baptist’s head on a platter. Antipas was sorry that he had made the promise under oath but due to the presence of his guests he had to follow through with the request. Consequently John the Baptist’s ministry had come to an end in around 31-32 A.D. …\n> …in A.D. 39 Antipas with Herodias went to Rome but meanwhile Agrippa dispatched one of his freedmen to Rome to bring accusations against Antipas which resulted in Antipas’ banishment to exile at Lugdunum Convenarum, now SaintBertrand de Comminges of France. Although Herodias did not have to go into exile she chose to follow her husband. Antipas’ territories were given to Agrippa (Jos. Antiq. 7. 1-2 ; 240-255; War ii. 9. 6 ; 181-183) . \nLinks:\nhttp://www.bible-history.com/links.php?cat=44&sub=1379&cat_name=Bible+Names+H-M&subcat_name=Herod+Antipas\nhttp://www.bible-history.com/Herod_Antipas/ANTIPASCoin_of_Herod_Antipas.htm\nhttp://www.numismalink.com/fontanille3.html\nOn the other hand, here what I have read\n(= these words are critical remarks about what wrote the Holy Father!):\n>… …We have been listening to political environmentalists like Al Gore for years now, partly discounting what he says ever since his alarmist film An Inconvenient Truth was shown to be so full of wild claims, such as that Hurricane Katrina was caused by global warming (there is no evidence at all for this), and that polar bears as a species were under threat from drowning because of melting polar icecaps (on the contrary, the polar bear population has been growing so much it has to be regularly culled): and, anyway, polar ice, if we include the Antarctic, is growing rather than shrinking.\n>We need, to say the least, to treat the “science” of global warming with extreme care. Any such hesitations, however, form no part of the Pope’s thinking.\n>Laudato Si’ appears closely to reflect the influence of the environmentalist Hans Joachim Schellnhuber, a pillar of the UN’s tendentiously political Intergovernmental Panel on Climate Change (IPPC), who has been described in the New York Times as “a scientist known for his aggressive stance on climate policy” and who the Pope recently appointed to the Pontifical Academy of Sciences, despite his other beliefs (he is hardly a Catholic thinker).\n>As the Vatican correspondent Edward Pentin comments: “Critics have warned that by falling in with proponents of climate change science, the Pope risks getting too close to other key supporters of the theory who support population control and abortion.”\n>Schellnhuber, perhaps not surprisingly given his current prominence as a papal adviser, claims not to be in favour of population control, but that is of course ridiculous, and even in the recent interview with Pentin in which he is taken to be repudiating the idea of limiting the world’s population, he can’t hide his real underlying assumptions. \n>Here he is: “If you want to reduce human population, there are wonderful means: Improve the education of girls and young women. Then the demographic transition will be a little bit faster… So I subscribe to a good education, and that’s the only way of population strategy I would support.”\nIn other words, teach the girls about artificial birth control. “If you want to reduce human population”, he says. Well, there’s no if about it: the fact is that he clearly does want to reduce the human population. That’s population control. It is nonsense for him to deny he’s not in favour of it. Does he think we are all fools? \n>Parts of the encyclical are crude in the extreme. “A number of scientific studies indicate,” says Pope Francis, though without specifying which, “that most [that’s right, he says ‘most’] global warming in recent decades is due to the great concentration of greenhouse gases (carbon dioxide, methane, nitrogen oxides and others) released mainly [I repeat “mainly”] as a result of human activity.”\nActually, only about five per cent of present atmospheric carbon dioxide is derived from the use of fossil fuels; that is, just 19 parts of CO2 per million parts of atmosphere. Most CO2 is a natural part of the atmosphere. It is not pollution: indeed, human life is largely dependent on it since without CO2 there could be no growth of any kind of vegetable matter: no CO2, no trees. No trees, no oxygen. And yet Francis writes that “Carbon dioxide pollution increases the acidification of the oceans and compromises the marine food chain”: It’s a dubious theory put forward by some: but it is far from having been proved.\n>The danger of getting too closely involved in the politics of climate change is that they destructively divert our attention, (and that “our” includes the Pope himself), from a political imperative one would have thought much closer to the heart of what Francis, and with him the Church, really cares about. He has always claimed, with evident sincerity, to be on the side of the poor. And yet he attacks fossil fuels, their chief energy source, which he does admit are “at the heart of the worldwide energy system”.\n… … etc. … … etc. …\nLink:\nhttp://www.catholicherald.co.uk/commentandblogs/2015/06/24/following-st-francis-the-pope-teaches-concern-for-nature-but-laudato-si-will-bring-no-justice-for-the-poor/\nSo…\nWhat is your own opinion ?\n— — — —\nSo, after a while we will find ourselves discussing\nabout ecology and maybe also around the “misteries” about Rennes-le-Chateau!\nThen I believe that it is necessary to know\nhow to properly separate the arguments and\nthen treat them one by one, with great patience! …\nNow I apologize for my vehemence.\n\n","date":"June 26, 2015 at 11:13 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203715","author":"piero","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"William Oddie, writing in the “Catholic Herald”, England has a different point of view about Pope Francis’ encyclical. It must be ignored, he says:\nhttp://www.catholicherald.co.uk/commentandblogs/2015/06/24/following-st-francis-the-pope-teaches-concern-for-nature-but-laudato-si-will-bring-no-justice-for-the-poor/\n\n","date":"June 26, 2015 at 5:03 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203760","author":"Louis","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Louis,\nI think the fact of simply repeating a title and\nthen not to try to comment the entire article\n(… something that, unfortunately, I have not even\nmanaged to do myself) I do not think solves the problem…\nOr not?\nIn any case I would be curious to read the opinion of\nthe Holy Father about the 2006 documentary film\ndirected by Davis Guggenheim about former United States\nVice President Al Gore’s campaign to educate citizens\nabout global warming …\nLink:\nhttps://en.wikipedia.org/wiki/An_Inconvenient_Truth\n>Gore became interested in global warming when he took a course at Harvard University with Professor Roger Revelle, one of the first scientists to measure carbon dioxide in the atmosphere.\n>Later, when Gore was in Congress, he initiated the first congressional hearing on the subject in 1981.\n>Gore’s 1992 book, Earth in the Balance, dealing with a number of environmental topics, reached the New York Times bestseller list …\nUseful links:\nhttps://en.wikipedia.org/wiki/Keeling_curve\nhttps://en.wikipedia.org/wiki/Carbon_dioxide_in_Earth%27s_atmosphere\nhttps://en.wikipedia.org/wiki/Global_warming\nhttps://en.wikipedia.org/wiki/Representative_Concentration_Pathways\nhttps://en.wikipedia.org/wiki/Greenhouse_gases\nhttps://en.wikipedia.org/wiki/Climate_engineering\n\n","date":"June 27, 2015 at 9:52 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203863","author":"piero","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Piero, I just drew attention to what a Catholic weekly was saying so that readers may draw their own conclusions. I agree with Pope Francis, although I think that not much will change.\n\n","date":"June 27, 2015 at 1:58 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203878","author":"Louis","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Louis you wrote: “There is no point in talking about Herod, Nero and Caligula.”\nShall I remind you Daveb FIRST mentioned the number 666 applied to a Seven-headed beast  in Rev 13:18 and, taking up  Ifrah’s text on the history of numbers, claimed it referred to Nero (“a demonic Nero redivivus (revived), who returns from the dead as Antichrist”) as “The most adequate solution” (sic!?) since “The transliteration (Ifrah) gives for applying the number to Nero is QSAR NERON (Caesar Neron), which he transcribes into their HEBREW EQUIVALENT, BUT READING FROM RIGHT TO LEFT (upper cases mine) as:\n“nun-vaw-resh-nun, resh-samekh-qoth” thus “50-6-200-50, 200-60-100″ equal 666.”\nSorry but I had to remind Daveb the word “beast” can here refer to any Roman or Idumean tyrant (and they were many from Herod the Great to Nero via Caligula!) but the SEVEN-headed beast can only refer to Herod Agrippa II as the seventh of the Herodian kings. Besides HORODOS (right Hebrew form for Herod) is spelled with three vavs that can be read as three six as well embedded in his name  while the Greek form  NERON KAISAR and the Latin form NERO CAESAR translate  the right Hebrew  form  NRON QSAR NOT the alleged ‘QSAR NERON’!\nBTW the alternative reading 616 (already known to Irenaeus, Adv. haer. 5.28.2) neatly fits  two Latin forms namely ‘Nero Caesar’ and ‘Caligula Caesar’ while neither NERO CAESAR nor CALIGULA CAESAR or  Heb. “NRON QSAR” are names per se since both refer to a name AND a title. while Heb. HORODOS is a name per se.\nMost obviously Daveb uncritically and blindlingly relies too much on Ifrah’s totally biased gematric calculation. A shame.\n\n","date":"June 26, 2015 at 9:08 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203791","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Hi Max\nSorry, I can’t carry on, the discussion is showing topic drift and you have not consulted the sources I asked you to see. It is a means to show you how the cultural miileu during a period influences what is written.\nI am working on three topics now, one related to the Shroud and another one will encompass what you are talking about now but I can’t say anything in advance.\n\n","date":"June 27, 2015 at 2:05 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203879","author":"Louis","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"I am not the one being dogmatic here, Max.  I have made it clear that the interpretation of a name from a number is fraught with ambiguity.  I stated above: \n“Most of the several gematria examples given by Ifrah, tend to commence with a given text or phrase from which a number such as a date or a year can be derived. Going in reverse from a number to a presumed text, as in Rev 13:18, seems more unusual a practice and is obviously fraught with ambiguities in interpretation.” \nYou have provided no evidence that the number intended is “six-six-six” to support a reference to the Herods.  I would have thought that if Tresmontant had a sound argument that it was, then you might have mentioned it.  The Greek texts I’m aware of make it six hundred and sixty six, and that was the interpretation of Jerome in the fourth century. \nAll of the Herods were highly skilled in diplomacy, political realists.  If it had not been for them, then there might well have been an end to any vestige of Judaism well before 70 CE at the hands of the Romans.\n\n","date":"June 27, 2015 at 12:11 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203806","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Back to main thread of topic! \nNZ Greenpeace activists are doing their part, promoting the message of forestalling Climate Change Apocalypse! \nAs at Thursday, 25 June, 2015:\nGreenpeace protesters scale the roof of Parliament House\n• Banner aimed at the PM reads: “Cut pollution, create jobs? Yeah, nah”\n• Solar panels have been positioned on the ledge\n• Protesters will reportedly charge their phones throughout the day using the solar panels\nSpeaking to NZ Herald reporter from the ledge about showing what “real climate action looks like”:\n“We have come to offer the Government a gift of solar panels, which are working – we are just about to start hooking up now, to charge our phones and stuff like that. We also want to show that this is what real climate action looks like, and we hope that the Government takes action like us,” said Greenpeace protester Johno Smith.\nThe group were communicating with security and were on good terms, and had been told a coffee might be possible later in the day (It could only happen in NZ). \nNZ Herald full report including video at:\nhttp://m.nzherald.co.nz/nz/news/article.cfm?c_id=1&objectid=11470832\n\n","date":"June 27, 2015 at 4:20 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203824","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Dave you wrote: “The Greek texts I’m aware of make it six hundred and sixty six, and that was the interpretation of Jerome in the fourth century”. \nHow come you’re only aware of “six hundred and sixty six” whent there is the alternative reading six hundred sixten?\nIf 666 codes Neron Caesar, how come then you cannot even account for Nero being referred to as the SEVEN-headed beast?\nBesides if 666 codes Nero Caesar, Babylon codes Rome, how can you account for the prophecy in Rev 18:4 and it reads: “And I heard another voice from heaven, saying, Come out of her (= “Babylon”), MY PEOPLE (= early Christian community), that you be not partakers of her sins, and that you receive not of her plagues (= war, famine, plague and persecution)” and\nEusebius of Caesarea writing that the early Christian community of Jerusalem had been commanded by AN ORACLE/PROPHECY given “before the war” to depart from the city of Jerusalem (Eusebius Eccl. Hist. 3.5 and Panarion 30:2)?\nReminder: Around the year 66 C.E., the early Christian community in Jerusalem evacuated to Pella in Jordan because of an oracle/ prophecy.\nDo still really think “Babylon” originally had coded Rome? PLAIN COMMON SENSE tells us “IT JUST COULD NOT HAVE”. Here is Tresmontant’s argumentum ad absurdum reasoning (see L’Enquête):\n“Babylone, dans ce texte chiffré, ne peut désigner la ville de Rome pour une raison simple. Supposons un instant avec la majorité des critiques que l’Apocalypse ait été composée et diffusée vers la fin du règne de Domintien, autour de l’année 96 (Now Louis most erroneously wrote: “It –i.e.The Book of Revelation– has been dated to the second century and demonstrates some gnostic influence”?!).”\n“Les chrétiens de cette époque-là n’étaient pas plus sots que ceux d’auhourd’hui. Jean sans l’Apocalyspe, annonce depuis le début que LE TEMPS EST PROCHE (upper cases mine), QUE C’ESR IMMINENT (upper cases mine), QU’IL N’Y AURA PLUS DE DELAI (upper cases mine). Or la ville de Rome n’a pas été détruite au IIème siècle ni plus tard. La communauté chrétienne de Rome ne s’est pas enfuie comme un seul homme, ou plutôt comme une seule femme, comme lui commande Apocalypse 18,4.”\n“Par conséquent, très vite les chrétiens de ce temps-là auraient constaté que les prophéties de l’Apocalypse cntre la ville de Rome ne se réalisent pas. C’est donc une fausse prophétie. Si c’est une fausse prophétie, on n’en tient plus compte. On ne recopie pas l’Apocalypse dans les communautés chrétiennes. Et donc nus n’aurions plus à cette heure le manuscrit de l’Apocalypse dans les communautés chrétiennes. Nous ne saurions même pas qu’elle a esxité. Lorsque, aux IIème et IIIème siicles, l’Apocalypse a été attaquée pour des raisons diverses, PERSONNE N’A JAMAIS MIS EN AVANT CET ARGUMENT (upper cases mine) qui aurait été décisif : L’APOCALYPSE ANNONCE LA DESTRUCTION INTEGRALE, SUBITE, TOTALE ET IMMINENTE DE LA VILLE DE ROME. OR ROME N’A PAS ETE DETRUITE (upper cases mine). Donc l’Apocalypse est une fausse prophétie !”\n“LA VILLE DE JERUSALEM A ETE DETRUITE TOTALEMENT AUX MOIS D’AOÛT ET SEPTEMBRE DE L’ANNEE 70 ET QUELQUES ANNEES AUPARAVANT LA PETITE COMMUNAUTE CHRETIENNE DE JERUSALEM S’EST ENFUIE (upper cases mine), comme lui avait commandé Apocalypse 18,4.”\nJohn took up Jeremy’s and Isaiah’s oracles/prophecies (see Jer 50:8 ; 51:6 and Isaiah 48:20) and applied them to Jerusalem. Most likely he wrote it in the 50s (see Tresmontant’s rather convincing demonstration, ibidem, p. 351-375).\nTo Louis re the Four Apocalyptic Horses (war, famine, plague and persecution),  they are a quadruple “cryptic pareidoliac allegory/vision” of the TS man’s/Yeshua’s then undamaged ventral bloodied body imprint recorded on his burial Sindon/Himation i.e. to be deciphered as an oversized Rorschach inkblot test. Archaeoperceptively speaking and most likely, the apocalyptic visions implies the burial Sindon/Himation image was seen in turn in bright daylight and at least at two different observation distances (red and white pareidoliac horses), on oncoming dusk (dark pareidolac horse) and at full or new moon night (greenish yellow/yellowish green horse pareidoliac image).\n\n","date":"June 27, 2015 at 4:39 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203826","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Typo: six hundred and sixteen\n\n","date":"June 27, 2015 at 4:40 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203827","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"More typo: Jean dans l’Apocalyspe\n\n","date":"June 27, 2015 at 4:42 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203828","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"They are more typos yet I have no time to correct them all. Sorry.\n\n","date":"June 27, 2015 at 4:44 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203829","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Reminder: the word pareidolia is derived from the Greek words para, meaning something faulty, wrong, instead of, and the noun eidōlon, meaning image, form or shape. Pareidolia is a type of apophenia, which is a more generalized term for seeing patterns in random data.\nMethinks the prime example of dormant archaeopareidolia and its connection to Apocalyptic and Graalic images is the Turin Shroud.\n\n","date":"June 27, 2015 at 5:03 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203831","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"There are too TS dormant archaeoparadolias to be rediscovered in light of secret Syriac liturgy visions and both Late Antique and Medieval Hagiographic legend reported visions and scenic key images.\n\n","date":"June 27, 2015 at 5:12 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-203834","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"I don’t know if both are related but “Laudato si” illustrates the complementary relationship between science and faith.\nDan, you asked : https://shroudstory.com/2013/03/14/is-pope-francis-a-chemist/ and commented “he is the first pope to have been a scientist, I want to believe it is so”\nHere he brings an answer :\n” …the heavy layering of science extends far beyond the climate issue. As the Post has described, the encyclical is full of scientific content on a diversity of environmental issues — sometimes even throwing around highly technical concepts like ocean acidification, “bioaccumulation” and “synthetic agrotoxins.”\nSo if you’re one of those who insists that science and religion are in conflict — or one of those who stokes that conflict — Francis presents a major challenge.”\nhttp://www.washingtonpost.com/news/energy-environment/wp/2015/06/18/why-pope-franciss-climate-message-may-be-hard-for-some-americans-to-swallow/\n\n","date":"June 30, 2015 at 10:52 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204146","author":"anoxie","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"http://www.drroyspencer.com/research-articles/\nBetter read this first about “global warming”.\nThen we all can talk…..\n\n","date":"June 30, 2015 at 11:01 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204148","author":"Nabber","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"http://thinkprogress.org/climate/2011/07/29/282584/climate-scienists-debunk-latest-bunk-by-denier-roy-spencer/\nI am not a climate skeptic. I don’t have to read Roy Spencer’s misinformation to make up my mind.\n\n","date":"June 30, 2015 at 11:14 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204151","author":"anoxie","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Wow, you are so open-minded.  And quoting a super-liberal website.  Nice.  I happen to know Roy Spencer,  and know that the piece “debunking” Spencer is itself bunk.\n\n","date":"June 30, 2015 at 11:32 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204155","author":"Nabber","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Another super-liberal website: http://climate.nasa.gov/\n\n","date":"June 30, 2015 at 11:41 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204157","author":"anoxie","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Truth in advertising:  the figure of 97% consensus has been thoroughly debunked, and yet there it is on the NASA website.  NASA has been compromised by liberal fascism.\n49 former NASA scientists and astronauts sent a letter to NASA Administrator Charles Bolden in 2012 admonishing the agency for its role in advocating a high degree of certainty that man-made CO2 is a major cause of climate change while neglecting empirical evidence that calls the theory into question.\nThe group, which includes seven Apollo astronauts and two former directors of NASA’s Johnson Space Center in Houston, are dismayed over the failure of NASA, and specifically the Goddard Institute For Space Studies (GISS), to make an objective assessment of all available scientific data on climate change. They charge that NASA is relying too heavily on complex climate models that have proven scientifically inadequate in predicting climate only one or two decades in advance.\nSelect excerpts from the letter: \n•“The unbridled advocacy of CO2 being the major cause of climate change is unbecoming of NASA’s history of making an objective assessment of all available scientific data prior to making decisions or public statements.”\n •“We believe the claims by NASA and GISS, that man-made carbon dioxide is having a catastrophic impact on global climate change are not substantiated.”\n •“We request that NASA refrain from including unproven and unsupported remarks in its future releases and websites on this subject.”\n\n","date":"June 30, 2015 at 12:20 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204159","author":"Nabber","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"p.s., anoxie:  It is unwise of you to latch onto a weblink using the term “denier” for Dr Roy Spencer and his colleagues.  They are honest skeptics.  “Denier” was coined by the super-liberal columnist Ellen Goodman, specifically to liken them to the term “Holocaust Denier”, which she readily admitted.  Subsequently adopted by the whole Global Warming crowd.  This propaganda technique is so typical of liberal fascism.  In response, Dr Spencer coined or perhaps popularized the term “Green Nazis”, which is ironic in the extreme.  The type of ad hominem attack on Dr Spencer is not what we expect of scientists responding to skeptics who have data that they disagree with.\n\n","date":"June 30, 2015 at 12:33 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204162","author":"Nabber","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"“the figure of 97% consensus has been thoroughly debunked”\nA letter, is that all you’ve got?\nhttp://climate.nasa.gov/scientific-consensus/\nhttp://iopscience.iop.org/1748-9326/8/2/024024/article\n\n","date":"June 30, 2015 at 12:38 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204163","author":"anoxie","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Try to follow along.  \nThe letter is just one example to show how NASA has drifted away from Science.\nOTOH, it is easy in the extreme to debunk the 97% horse-puckey…\n\n","date":"June 30, 2015 at 12:52 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204164","author":"Nabber","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"NASA has drifted away from science? Are you serious?\n\n","date":"June 30, 2015 at 1:05 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204167","author":"anoxie","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Oh, I don’t know anoxie, why don’t you read the following, and then you decide:  \nhttp://wattsupwiththat.com/2014/12/19/97-articles-refuting-the-97-consensus-on-global-warming/\nAnd, there’s not a person on this blog who can’t see the humor in this little piece of NASA front-page data:\nGlobal temperature Up +1.4 degrees F since 1880.\nRight.  Data coming from what?  And if it were accurate, coming from human activity?  Data?\n…and I haven’t considered your being serious even once….\n\n","date":"June 30, 2015 at 1:15 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204168","author":"Nabber","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"data coming from here:\nhttp://data.giss.nasa.gov/gistemp/tabledata_v3/GLB.Ts+dSST.txt\nI don’t think NASA scientists are compromised at all by any kind of liberal fascism, they are among the best scientists working on climate change.\nI’m getting what the journalist of the Wahsington Post meant by “hard to swallow for americans”…\n\n","date":"June 30, 2015 at 1:35 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204175","author":"anoxie","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Again, you don’t get it.  \nThere is no way to know whether global temperatures are rising now, because natural year-to-year variability in global temperature is so large, with warming and cooling occurring all the time.  The magnitude of recent warming is somewhat uncertain due to problems in making long-term temperature measurements WITH THERMOMETERS without those MEASUREMENTS BEING CORRUPTED by a variety of non-climate effects. There is no way to know if temperatures are continuing to rise now. \nIf we look at a more recent period of time,  since the record warm year of 1998, one could say that it has cooled in the last 17 years. We still don’t know  whether warming is happening now or will happen in the future.\nIn the longer term, hundreds to thousands of years, there is considerable indirect, proxy evidence (not from thermometers) of both warming and cooling. Since humankind can’t be responsible for these early events, it is evidence that Nature can cause warming and cooling. If that is the case, it then opens up the possibility that some or most of the warming in the last 50 years has been natural, too.\n\n","date":"June 30, 2015 at 3:05 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204187","author":"Nabber","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"“If we look at a more recent period of time, since the record warm year of 1998, one could say that it has cooled in the last 17 years. We still don’t know whether warming is happening now or will happen in the future.”\nThis is a well known hiatus:\nhttp://www.scientificamerican.com/article/oceans-hid-the-heat-and-slowed-pace-of-global-warming/\nAir temperature is only one of many proxies to monitor climate change.\n\n","date":"June 30, 2015 at 3:30 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204191","author":"anoxie","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Even if we were to leave the man-affected climate change argument aside, one doesn’t need to be a scientist to agree with the horse sense of the rest of the encyclical. How we’ve turned the planet into a giant rubbish bin, how practises like fracking are dangerous, how the consumerism of our age is using up resources for trivialities, etc. We either take our responsibility as stewards for creation seriously, or we will reap the consequences.\n\n","date":"June 30, 2015 at 1:15 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204169","author":"David Goulet","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Fracking dangerous?  Data?  \nhttp://www.spiked-online.com/newsite/article/ten_big_fat_lies_about_fracking/13944\nI like consumerism.  Good luck without your T.P., David….\n\n","date":"June 30, 2015 at 1:27 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204170","author":"Nabber","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"David:  we need to stop having so many children, or else we will run out of global resources.  Malthus proved it, right?  Maybe a good policy like they have in China would help.  \nBTW, about 15% of recycling in the U.S. comes from residential areas, 85% from corporations.  Our residential effort is trivial.  Meanwhile we are throwing into the garbage the new Eco-light bulbs full of mercury — wow, that made sense…..\n\n","date":"June 30, 2015 at 1:33 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204173","author":"Nabber","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Easiest position in the world is be a contrarian. Good luck with that.\n\n","date":"June 30, 2015 at 1:32 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204172","author":"David Goulet","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"No, the easiest position in the world is to be a sycophantic liberal blindly following bad science.\n\n","date":"June 30, 2015 at 1:35 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204174","author":"Nabber","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"I wish Colin was still following this blog. You of all people talking about ‘real science’. Irony.\n\n","date":"June 30, 2015 at 1:50 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204177","author":"David Goulet","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Gee, whiz, Dave, I wish my big brother was here to help me beat up on you…..\np.s.  You using the term “you of all people” — you don’t know me nor do you know “squat all” about me.  And you wouldn’t know “Irony” if it ran over you.\n\n","date":"June 30, 2015 at 2:32 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204181","author":"Nabber","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"I know you never met a question mark that you didn’t want to turn into an exclamation point. Beyond that, no, you are correct, I do not know squat about you. My loss.\n\n","date":"June 30, 2015 at 2:37 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204183","author":"David Goulet","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"That was indeed a nice turn of a phrase.\n\n","date":"June 30, 2015 at 3:17 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204190","author":"Nabber","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Remember Benedict XIV.\n\n","date":"June 30, 2015 at 10:59 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204147","author":"Louis","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"John, you wrote: “Listen! Can you hear the hoof beats? The Four Horsemen of the Apocalypse are riding. They are just over the horizon”. \nThe Four Horsemen/Riders of the Apocalypse have intrigued generations of Bible scholars and students. I cannot tell you if can hear them. However the archaeoperceptive fact is “I think I see” each of them as sindonographic pareidolias or Knights of a Holy Bloodied Body Fog since first and foremost they are « Turin Shroud image-in-clouded » Riders. I can even see Perceval in the Red Knight’s armour and many an Apocalyptic and Graalic visions and semblances too ;-).\n\n","date":"July 1, 2015 at 1:25 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204216","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"BTW Perceval is an Old French pun on “voil perce”, ‘pierced veil” and Graal wordplays with the Hebrew Gar El, “G-od dwells (in it) (and) G-od shines (out-it)” = Deus in manufactis et non manufactis habitat. Ring some bell?\n\n","date":"July 1, 2015 at 1:42 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204217","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Second Old French-Hebrew wordplay and imageplay on the name Perceval: \n“Par ce voil perce”, “through this pierced veil” (the Holy Grail) “G-od shines forth” (Gar El).\n\n","date":"July 1, 2015 at 1:48 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204219","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Actually methinks I just can “hear” the Shroud Late Antique and Medieval visions and semblances.\n\n","date":"July 1, 2015 at 1:51 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204220","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Reminder: The unfolded long shroud displays four sets of four burn holes symetrically on both its dorsal and frontal halves. Most likely they date back to well before the alleged “1325 ± 65 radiocarbon datation”\n\n","date":"July 1, 2015 at 2:10 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204221","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Max\nCan’t you sit down and think of what you want to post and do it all in one or two post? You just wiped out all the comments on the list so it makes it very hard to follow the post by others.\n\n","date":"July 1, 2015 at 5:28 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204241","author":"John Green","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Sorry John but I just can post in snatches at the moment (too busy).\nBoth the use of Yeshua’s blood in-soaked Sindon/Himation dormant pareidolias and a time of persecution of the early Christian community could account for the author’s literally shrouding his “prophecy” with codes, cryptic symbols and allegories. \nReminder: when it was written away Christian Judeans were enduring persecutions and even death for their faith under the seventh and last Herodian king namely Herod Agrippa II (49-66/49-100 CE) (Herod in Hebrew = HORODOS = H6R6D6S =.6.6.6.= 666). Actually the Herodian persecution of the Messiah and indirectly his followers to come dated back from old. It all started as early as 6-4 BCE with Herod the Great. \nAccording to Matthew 2:16 recording Roman collaborator par excellence namely Herod the Great’s reaction when he learned the wise men (Magi), who had come to the Roman Province of Judaea looking for the one born King of the Judeans (Yeshu’a Ha-Mashiach/Jesus The Messiah), left BethleHem without reporting him the whereabouts of the Judean king:\n“… [Herod] was furious, and he gave orders to kill all the boys in BethleHem and its vicinity who were two years old and under, in accordance with the time he had learned from the Magi.’”\nIt is not just because the event (often referred to as the “Massacre of the Innocents” in BethleHem, then a very small town of Judaea) isn’t referenced in any historical text outside of Matthew 2, that the account has to be rejected ipso facto as mere fiction, far from it.\n\n","date":"July 1, 2015 at 9:28 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204248","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Note: It all started as early as 6-4 BCE OR (most likely) 3-1 BCE with Herod the Great (scholars actually disagree on his date of death).\n\n","date":"July 1, 2015 at 11:46 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204254","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Indeed and irrespective of Coptic, Syriac and Byzantine secret liturgies, you could gain much deeper insight into the Book of Revelation (and 1st-3rd century CE Apocalyptic Literature in general), Late Antique and Medieval Hagiographic and Grail legends,  if only by Turin Shroud re-projected dormant archaeopareidolias.\n\n","date":"July 1, 2015 at 2:34 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204223","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Indee there’s a fine line betwen TS apophenias and TS epiphanies.\n\n","date":"July 1, 2015 at 2:57 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204226","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Reminder: the Book of Revelation visions and semblances refer to YoHanan/Yonathan/John the Priest’s projective prophetic experience. What he saw was from his psycho mystical perspective. He could have been right or wrong as a prophet or paranormal witness.\n\n","date":"July 1, 2015 at 3:16 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204228","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"John the Priest was right as far as the destruction of the city of Jerusalem (Rev. 11:2) was concerned and so was Yeshu’a (see Matt 24:34).\nReminder:  \n“But the court that is without the Temple leave out, and measure it not; for it is given unto the goyim: and the Holy City (= Jerusalem NOT Rome!) SHALL (prophetic future) they (the goyim) tread under foot forty [and] two months.” (Rev11:2)\n“Very truly I tell you, this generation will certainly not pass away until all these things have happened.” (Matt 24:34)\n\n","date":"July 1, 2015 at 3:37 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204230","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Now alleged “Biblical scholar heavyweights” want us to believe the Book of Revelation was written in the 90s CE or even in the Second century CE! They are wrong. Most likely, it was written in 52 and/or 54-55 CE (see Tresmontant’s “L’Enquête”, 1994 CE)\n\n","date":"July 1, 2015 at 3:43 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204231","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Max, let me tell you the following:\nDon’t think that if the Book of Revelation contains material about first-century AD events that makes it a first-century document. You keep on talking about figures who have absolutely no relevance to the discussion, which is about Pope Francis’ encylical and the future.\nApolcalypses came into fashion among post-exilic Jews and gained acceptance among some Christians in the first century AD, but no scholar takes the images literally. The same problem people were facing then we also face now:it is the problem of evil\nPlease respect who I referred to as the twentieth-century’s top biblical scholars. They edited top biblical commentaries, and although they are Catholic, their works are consulted by Protestants, Jews and Agnostics, in colleges, universities and seminaries. You will be laughed out of court if you try to challenge them with your interpretations, which will be dismissed as the result of feverish imagination.\nHave you noticed that biblical scholars deal with the New Testament, minus the Book of Revelation? Although you are not Christian, much less Catholic, why don’t you go to the nearest Catholic church and ask the priest to include “The Four Horsemen of the Apocalypse” as part of the reading during the mass and hear what he will tell you?\n\n","date":"July 1, 2015 at 11:57 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204255","author":"Louis","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Louis, you wrote: “You will be laughed out of court if you try to challenge them with your interpretations, which will be dismissed as the result of feverish imagination.”\nOh really? So would be John of Patmos then since actually The Book of Revelation visions and allegories are first and foremost the result of his feverish psycho mystical projections/imagination NOT mine! \nMethinks you (and Fitzmeyer) have eyes but you cannot see John’s visions and allegories in terms of dormant archaeopareidolias that are in full view on the TS inner side! Have you ever heard of archaeperception (the art of seeing what people from the past saw, whether pareidolias, apopheinias, hierophanies or the real thing)?\nBTW can you tell me what Babylon stands for exactly?  (or according to “your heavyweight”)\nCan you tell me for whom the number 666 stands exactly? (or according to” your heavyweight”?)\nDo you (or “your heavyweight”) believe in prophecies that SOON will be fulfilled i.e. “before a generation passses away”? If you do and in light of your deciphering Babylon and 666:\nHow can you (or “your heavy weight”) account for the prophecy in Rev 18:4 that reads: “And I heard another voice from heaven, saying, Come out of her (= “Babylon”), MY PEOPLE (= early Christian community), that you be not partakers of her sins, and that you receive not of her plagues (= war, famine, plague and persecution)” in light of:\n–  Rev 11:2: “But the court that is without the Temple leave out, and measure it not; for it is given unto the goyim: and the Holy City (= Jerusalem NOT Rome!) SHALL (upper cases mine; prophetic future tense) they (the goyim) tread under foot forty [and] two months.” (Rev11:2)\n– (Matt 24:34): “Very truly I tell you, THIS GENERATION (upper cases mine) will not pass away until all these things have happened.” \n– Eusebius of Caesarea writing that the early Christian community of Jerusalem had been commanded by AN ORACLE/PROPHECY given “BEFORE THE WAR” to depart from the city of Jerusalem (Eusebius Eccl. Hist. 3.5 and Panarion 30:2)?\nReminder for you: Around the year 66 C.E., the early Christian community in Jerusalem evacuated to Pella in Jordan because of an oracle/ prophecy. Which was it according to you (and ‘-“your heavyweight”)?\n(to be continued)\n\n","date":"July 1, 2015 at 5:45 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204274","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Reminder for Louis: I may hold a minority view. Actually it is compelling one all the more so as I can re-project/map most if not all John’s visions from the blood in-soaked Turin Sindon/Himation bearing the translucent dorsal and frontal imprint of a crucifixion victim many identify as Yeshu’a.\nBTW Is not the Book of Revelation the Revelation from/of Yeshu’a appearing in a sindon/himation or “linen cloth/garment” stained in blood?\n\n","date":"July 1, 2015 at 6:12 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204276","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Max, I will not read what you comment since you are taking advantage that Dan cannot keep an eye on the blog all the time. Remember: he kept an eye on you last year. Haven’t you learnt from mistakes?\nYou can insult me if you want but you will get a response immediately.\nBut do not insult Joseph A.Fitzmyer, SJ, please.\nAnd, remember, you are a one-man show.\n\n","date":"July 1, 2015 at 6:26 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204277","author":"Louis","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"I thought you and “your heavyweight” would “laugh me out of court if I would try to challenge them with my interpretations, which would be dismissed as the result of feverish imagination.” (if I quote your right). I challenge you. Aren’t you laughing at me any more?\n\n","date":"July 1, 2015 at 6:32 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204279","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"YOU told me he was a “heavyweight”.\n\n","date":"July 1, 2015 at 6:35 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204280","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Sorry to tell you, seriously methinks your view ( i.e. Fitzmyer ‘s) are totally flawed.\n\n","date":"July 1, 2015 at 6:41 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204283","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Please behave yourself, Max.\n\n","date":"July 1, 2015 at 6:36 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204281","author":"Louis","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Answer my questions, please and just try to laugh me out of court if you and Fitzmyer can?\n\n","date":"July 1, 2015 at 6:46 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204284","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Directed to Dan;\nI am waiting for your position on the above exchange.\n\n","date":"July 1, 2015 at 6:49 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204285","author":"Louis","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"I’m on it.\n\n","date":"July 1, 2015 at 7:33 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204291","author":"Dan","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Thanks, Dan.\n\n","date":"July 1, 2015 at 7:45 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204295","author":"Louis","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Reminder for Dan: No double standard, please!\nReminder for Louis: you keep asking others to behave and learn from their mistakes. What about you? Methinks carity begins at home! \nThe fact is on July 1, 2015 at 3:43 am, I wrote (taking up the word “heavyweight” you applied to Fitzmyer and flung at me to underrate my own personnal opinion and Tresmontant’s):\n“Now alleged “Biblical scholar heavyweights” want us to believe the Book of Revelation was written in the 90s CE or even in the Second century CE! They are wrong. Most likely, it was written in 52 and/or 54-55 CE (see Tresmontant’s “L’Enquête”, 1994 CE)”\nHere the reply I got from you (a purple patch of most unkind and ungentlemanly ad hom indeed). \n“You will be laughed out of court if you try to challenge them (Biblcal scholars among whom Fitzmyer you look up as “a heavyweight”) with your interpretations, which will be dismissed as the result of feverish imagination”\nLouis, your “do as I say, not do as I do” stand is just beyond me (whence my highly unappreciated prompt answer)!\nThis said, how can you tell for sure there is no apocalyptic dormant archaeoparadolias to be ‘woken up’ in light of the the Turin Sindon/Himation bearing the translucent imprint of a crucifixion victim bloodied body (most likely Yeshua’s)? \nHow can you tell for sure it is just the result of my feverish imagination and not John’s psycho mystical feverish state at the time of his vision from/of Yeshu’a appearing to him in a garment (Gr himation = sindon) soaked/stained in blood? \nMethinks neither you (nor Fitzmyer) know what archaeperception or perceptive archaeology (the art of seeing what people from the past saw, whether pareidolias, apophenias, hierophanies or the real thing) is all about!\nAre you (and “your” Fitzmeyer) in complete denial of the fact Yeshu’a appeared to John in a garment (Gr himation = sindon) soaked/stained in blood and the TS translucent bloodied body double imprint can behave like an oversized Rorschach inkblot test and re-project visions and semblances from the Book of  Revelation through the eyes of an astute archaeoperceptive observer?\nReminder: according to the Gospels of the Hebrews Yeshua’s gave his sindon to “the servant/auxiliary of the (high) priest”. Now at the time of the event, most likely John Mark was a young assistant scribe (= servant/assistant/auxiliary) of the High Priest (Hanan? and a son of  the latter? see Tresmontant’s “Enquête sur l’Apocalypse”, 1994). Because of his secretarial role in the High Priest’s proximtiy, most likely too the young John Mark  is the one who faithfully recorded Hanan’s exchange with Yeshu’a on that night at the Hanan Palace (unless you and Fitzmeyer can convincingly account for it otherwise, which I very much doubt).\nCould you tell me exactly what was the time of John’s vision from/of Yeshu’a appearing to him in a garment (Gr himation = sindon) soaked/stained in blood: 50 and/or 54-55 CE? 69-70 CE or 90-110 CE? Was is under Nero’s or Domitian regnal years?\n(According to you (and Fitzmyer and some other Biblical scholar “heavyweights” the Book of Revelation”has been dated to the second century and demonstrates some gnostic influence”. Methinks they make a confusion between esoteric coding of an image for the sake of prophecy and gnoticism stricto sensu. Besides John took up, among other oracles/prophecies, Jeremaiah’s and Isaiah’s oracles/prophecies (see Jer 50:8 ; 51:6 and Isaiah 48:20) and applied them to Jerusalem. Most likely he wrote it in the 50s (see Tresmontant’s rather convincing demonstration, ibidem, p. 351-375).\nStill waiting for yours answers to the following questions I asked you more than a day ago:\nDo you (and Fitzmyer) believe in prophecies that are SOON to be fulfilled i.e. “before a generation passses away”? If you do and in light of your deciphering Babylon and 666, then\ncould you account for your decoding the seven-headed beast (666) as Domitian) implying ipso facto Babylon codes the cty of Rome and tell me when exactly Rome was destroyed?\nAnd in the light of your alleged “deciphering”, could you (and Fitzmeyer) account for:\n– the prophecy in Rev 18:4 that reads: “And I heard another voice from heaven, saying, Come out of her (= “Babylon”), MY PEOPLE (= early Christian community), that you be not partakers of her sins, and that you receive not of her plagues (= war, famine, plague and persecution)” \n– Rev 11:2: “But the court that is without the Temple leave out, and measure it not; for it is given unto the goyim: and the Holy City (= Jerusalem NOT Rome!) SHALL (upper cases mine; prophetic future tense) they (the goyim) tread under foot forty [and] two months.” (Rev11:2) Reminder: it took the Romans forty two months (september 7th, 70 CE-earlymay 73 CE) to dismantle the Temple of Jerusalem\n– (Matt 24:34): “Very truly I tell you, THIS GENERATION (upper cases mine) will not pass away until all these things have happened.”\n– Eusebius of Caesarea writing that the early Christian community of Jerusalem had been commanded by AN ORACLE/PROPHECY given “BEFORE THE WAR” to depart from the city of Jerusalem (Eusebius Eccl. Hist. 3.5 and Panarion 30:2)?\nReminder for you: Around the year 66 C.E., the early Christian community in Jerusalem evacuated to Pella in Jordan because of an oracle/ prophecy. Which was it according to you (and ‘-“your heavyweight”)?\nIn sum, could you (and Fitzmyer) convincingly account for the prophecy in Rev. 18:4 and the Christian community of Rome’s flight from the city in the 1st or second c. CE after the city was burned and destroyed since the prophecy is to be fulfilled SOON (i.e. before the present generation to which it is adressed passes away)? Could you account on historical grounds for Domitian’s persecution of the Christian community of Rome?\n(to be continued)\n\n","date":"July 2, 2015 at 4:34 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204326","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Typo: Reminder: it took the Romans forty two LUNI-SOLAR months (or about between 70-73 CE) to dismantle the Temple of Jerusalem\n\n","date":"July 2, 2015 at 6:53 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204340","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Max, I wrote to you only about your style of arguing. Worry about that. You need not concern yourself with any double standards on my part. If there is one, and there might be, it’s my problem, not yours.\n\n","date":"July 2, 2015 at 7:40 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204347","author":"Dan","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Typo: Methinks they (Louis’s alleged Biblical scholar “heavyweights”) make a confusion between esoteric coding of an image for the sake of BOTH prophecy and SECRECY (in time of persecution) and gnosticism per se.\n\n","date":"July 2, 2015 at 9:22 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204360","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Roman persecutions of the Christians extending from Nero (64 CE) to Antonius (161 CE) Pius\nI.No persecution under Emperors :\n          A.     Vespasion (69-79)\n          B.     Titus (79-81)\n          C.     Nerva (96-98 A.D.)\nII.Persecutions as a Result of the Emperor’s Whim.:\n           A.  Persecution under Nero (54-68 CE), 64 CE\n                Nero persecuted Christians to escape suspicion for burning Rome.\n           B.  Persecution under Domitian (81-96 A.D.).\n                Domitian persecuted Christians out of fear of possible rivals and fear\n                of growing Christian influence. \nIII.     Persecutions Initiated by mobs of people, but restrained by the Emperors:\n   A.  Trajan (98-117 A.D.).\n   B.  Hadrian (117-138 A.D.) in Asia, 124 A.D.\n   C.  Antonius Pius (138-161 A.D.).\n                 i. At Smyrna (Polycarp, etc.), 155 A.D.\n                ii. At Rome (Ptolemy and Lucius).\nLouis, you claim (with Fitzmeyer), the Book of Revelation was written in Greek under the Emperor Trajan in the 110s CE (second c. CE). Now John was sent/went to exile because of his faith in Yeshu’a The Messiah. When actually the persecutions of Christians were restrained by the very Emperor, could you account on which historical ground you and Fitzmeyer make such a claim, please?\n\n","date":"July 2, 2015 at 11:13 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204369","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Reminder: In 69-70 CE, Domitian reigned in the stead of his father Vespasian, as a 6 months’ interim emperor.\nThe historical fact is Vespasian –who was the one who originally laid siege to Jerusalem as general under Nero in 66 CE– was elected Emperor in December of 69 while his eldest son Titus took charge of the Jerusalem seige and his younger son Domitian resided in Rome. However it took Vespasian nearly six months to make his way from Jerusalem and Egypt  to Rome. During his six months’ interim, Domitian was brutal, exiling many people, establishing harsh persecutions, and generally causing chaos. When his father arrived, he reversed many of Domitian’s orders and restored many exiles to freedom.\n\n","date":"July 2, 2015 at 11:43 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204371","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Could you or Fitzmyer account for John’s need to encode Nero’s name as 666 during the reign of Domitian, an emperor a generation later and from a different dynasty?\n\n","date":"July 2, 2015 at 5:08 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204328","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Since there isn’t any recorded persecution of Christians during Domitian’s reign, could you or F. tell the reason why John should have been  ‘in exile’ then?\n\n","date":"July 2, 2015 at 5:12 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204330","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"What do youmake of the title page of the book of the Apocalypse (in a second century Syriac translation of the New Testament) that reads: “The Revelation which was made by G-od to John the Evangelist in the island Patmos, into which he was thrown by Nero Caesar”?\n\n","date":"July 2, 2015 at 5:18 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204331","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Why don’t you allow Yeshu’a translucent bloodied body double imprint to ‘exegete’ the Four Horsemen topic for us since indeed his himation/sindon soaked/stained in blood and observed under different light sources (full daylight, oncoming dusk light, full or new moonlit night, oil lamp light or resin torch light) can look redder, whiter, darker, more yelllowish green and/or greenish yellow and the bloodied body frontal translucent imprint seen right up conjured up in turn the pareidolias of four different riders?\n\n","date":"July 2, 2015 at 5:33 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204333","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Louis, again, thank you vey much for how you have offered such a kind and gentlemanly reply when I told you your alleged “Biblical scholar heavyweights” were wrong to date the BOR  90-110 CE since, actually it could have been written (in Hebrew not in translation Greek) as early as 52 or 54-55 CE under the regnal years of both Nero and Herod Agrippa II and at one point in time in which the high-priestly caste and Herodians persecuted the Jerusalem early Christian community!\nActually there are two beasts described in Revelation 13, one from “the land” and one from “the sea.” Hence there are two adversaries whose numbers could be 666: the beast from the “Promised Land” = SEVEN-headed Herodian king dinasty incarnated in its seventh and last representative namely Herod Agrippa II = in Hebrew HORODOS (simply visual deciphering for a Judean = H6R6D6S= .6.6.6.=666) and the beast from over the Sea = Nero = in Hebrew NRWN QSR = 666 (Judaic gematria NOT Greek gematria) incarnated in his TEN(laurel)CROWNED prefects and procurators, from Coponius (6-9 CE to Ventidus Cumanus 48-52 CE).\n\n","date":"July 2, 2015 at 6:17 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204337","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Addendum: Both of these beasts emerged from a “red dragon” that has 7 heads (there were 7 Herods) and ten horns –or crowns– (there were ten Prefects or Procurators who interacted with the Herodian dynasty by the time the Book of Revelation was written, that  is in in 52 CE NOT 90-110 CE!).\n\n","date":"July 2, 2015 at 6:59 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204342","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Typo: there were ten Prefects or Procurators who HAD interacted with the Herodian dynasty by the time the Book of Revelation was written\n\n","date":"July 2, 2015 at 7:15 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204344","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Re John’s exile to the Island of Patmos (a small Greek island in the Aegean Sea, off the west-coast of Asia Minor –now Turkish Anatolia– and the continent of Asia –Asia Major was the heartland of the Persian Empire, the world’s largest in the 1st c. CE–, most likely it was a self-exile.\n\n","date":"July 2, 2015 at 7:21 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204345","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"BTW 616 can render a mispelling of Nero Caesar NRW QSR in Hebrew while 666 renders the current/most popular Hebrew  form NRWN QSR (instead of the right form NRWN KSR). Whichever the case, the number 666 refers to name writen i Herbrew not in transliteration Greek implying the Book of Revelation was originally thought and written in Hebrew not in Greek.\n\n","date":"July 2, 2015 at 6:41 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204339","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Re the use of the word “soon” throughout the Book of Revelation. Why not take it more at face value (i.e. within the present generation to which it is adressed) and apply it to the time of the Second Temple period? See e.g. the six following verses:\n1.(Rev 1:1 ) The revelation of Yeshu’a Ha-MeschiaH, which G-od gave him to show to his servants what must soon take place; and he made it known by sending his angel to his servant YoHanan/Yohnathan,\n2.(Rev 1:3 ) Blessed is he who reads aloud the words of the prophecy, and blessed are those who hear, and who keep what is written therein; for the time is near.\n3.(Rev 2:16 ) Repent then. If not, I will come to you soon and war against them with the sword of my mouth.\n4.(Rev 3:11 ) I am coming soon; hold fast what you have, so that no one may seize your crown. He who conquers, I will make him a pillar in the temple of my G-od; never shall he go out of it, and I will write on him the name of my G-od, and the name of the city of my G-od, the new Jerusalem which comes down from my G-od out of heaven, and my own new name.\n5.(Rev 22:12 ) Behold, I am coming soon, bringing my recompense, to repay every one for what he has done.\n6.(Rev 22:20 ) He who testifies to these things says, “Surely I am coming soon.” Amen. The Lord Yeshu’a has come!\nReminder re Jerusalem destruction and the great tribulation to come, Yeshu’a prophesied:\n“Very truly I tell you, THIS GENERATION (upper cases mine) will not pass away until all these things have happened.”and “There are some standing here TODAY, who will not taste death until they see all these things take place”.\nIndeed for the early Christians “soon” as a temporal expectation may well have meant the late 60s CE or the year 70 CE at most, rather than the 110s CE that you and Fitzmeyer most-arbitrarily presume.\n\n","date":"July 2, 2015 at 7:47 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204348","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Max. You don’t want me trashing entire messages because you say something ridiculous like “that you and Fitzmeyer most arbitrarily presume.”\nI’m getting around to promoting one of your comments that I think is important and maybe correct. It would be too bad if you are not around to participate in the discussion. So please stop insulting people.\nI’m turning into a crotchety old man very fast so you’re probably going to have to watch what you say.\n\n","date":"July 2, 2015 at 8:33 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204352","author":"Dan","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Hi Dan\nThis is what I have to say about Max’s comments:\nI have indeed hit back when anyone has begun to hit below the belly, in fact I have gone beyond and defended prominent “Shroudies” when they were the object of insinuations and  unjust accusations.\nIt was Max who began posting his nasty attacks on this thread. As you know, it is not the first time he does it and he continues to do so continuously. He even posted nasty comments on the blog of the highly-qualified Oxford scholar, who left us in disgust, demanding that his name not even be mentioned on this blog. Just a few days ago Max also made some disrespectful comments about Barrie Schwortz, which I regret to say, I would have deleted if I were you, followed by a warning.\nMax is not a biblical scholar, he is a one-man show who has even directed his attacks against highly respected biblical scholars, as you must have read above. He is writing about the Book of Revelation, which for sure did not even cross Pope Francis’ mind when he issued his encylical. To insist on this kind of material today, ignored by the best biblical scholars, who concentrate on the Gospels and the letters of Paul, the apostle, is an absurdity. The way the book is being interpreted here reminds one of the people who produced the Waco tragedy. A serious interpretation of the book was written by the American scholar Scott Hahn.\nMy bet is that the comments will continue till you put an end to it once and for all by making a stern warning. What we need here are the prominent “Shroudies” who stopped commenting and perhaps even some biblical scholars. All of us will benefit from this.\n\n","date":"July 2, 2015 at 11:04 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204367","author":"Louis","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Reminder: The temple was totally dismantled and destroyed. No one stone was left on another in fulfillment of Yeshu’a prophecy. The temple wall or Wail Wall in Jerusalem was not a part of the temple per se. It was just part of a retaining wall that buttressed the ground around the temple. Theses are the only vestige left in terms of stone on stone. In order to have the the whole temple be demolished, the Roman soldiers were told that the Judeans had hidden gold in between the stones of the temple and they hacked them apart to get at the alleged gold. When was is exactly last time Rome was burned and no one stone of he city was left on another?\n\n","date":"July 2, 2015 at 8:13 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204350","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Deleted\n\n","date":"July 2, 2015 at 8:47 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204353","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"Deleted\n\n","date":"July 2, 2015 at 8:50 am","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204355","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"I’m a little confused here. Is that a blog to exchange knowledge or to exchange insults?\n\n","date":"July 2, 2015 at 12:07 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204375","author":"John Green","site":"shroudstory"},{"title":"Was Laudato Si and the Pope’s Visit to the Shroud Related?","post":"I am closing comments on this thread ONLY for awhile.\n\n","date":"July 2, 2015 at 12:54 pm","url":"https://shroudstory.com/2015/06/23/was-laudato-si-and-the-popes-visit-to-the-shroud-related/","cat":"2015","id":"comment-204378","author":"Dan","site":"shroudstory"}]
