[{"title":"We received a high resolution scan from one of the priests . . .","post":"The high resolution photos that I have seen are marked “Copyright (c) 2011 Archdiocese of Turin/[omitted]”\nThat is not the same as the high resolution photos which are now available on I-Phone (but not Android?). I wonder how the Pope wold feel about the “icon” now being peddaled by an internation company avoiding taxes in its home country?\nThis is much worse that Benedict copyrighting is encyclicals – or is it?\n\n","date":"June 1, 2013 at 6:39 am","url":"https://shroudstory.com/2013/06/01/we-received-a-high-resolution-scan-from-one-of-the-priests/","cat":"news_&_views","id":"comment-35595","author":"John Klotz","site":"shroudstory"},{"title":"We received a high resolution scan from one of the priests . . .","post":"People making money from the Holy face of Jesus Christ are a disgrace\n\n","date":"June 1, 2013 at 7:18 am","url":"https://shroudstory.com/2013/06/01/we-received-a-high-resolution-scan-from-one-of-the-priests/","cat":"news_&_views","id":"comment-35597","author":"vincenzogiovanni","site":"shroudstory"},{"title":"We received a high resolution scan from one of the priests . . .","post":"Where do you draw the line? Books, crucifixes, paintings, speaking fees, votive candle jars?  Shroud of Turin beach towels, T-shirts, Jesus Pez dispensers?\n\n","date":"June 1, 2013 at 7:29 am","url":"https://shroudstory.com/2013/06/01/we-received-a-high-resolution-scan-from-one-of-the-priests/","cat":"news_&_views","id":"comment-35598","author":"Dan","site":"shroudstory"},{"title":"We received a high resolution scan from one of the priests . . .","post":"vincenzogio, I couldn’t agree more; however, looking at it from an alternate angle, there are those who write books, with profit in mind, merely to subsidize Shroud research (chemical testing, etc.) and there are others who write, as a result of media non-coverage of the Shroud.  Public Broadcast Stations, (PBS) here in the U.S., at one point in time, aired Shroud documentaries, but haven’t in years.\nYet, as of late and to your statement, it appears the dark force of greed and corruption has replaced the light of the Holy Spirit within us.\nWe should be directed to reflect on Matthew 6:24, where Jesus clearly stated, with regard to worshipping two masters, “No man can serve God and Mammon.”\nUltimately, we alone must make the choice between God and money, and which of the two we choose, according to scripture, will become our eternal fate.\nBest,\n\n","date":"June 5, 2013 at 6:39 pm","url":"https://shroudstory.com/2013/06/01/we-received-a-high-resolution-scan-from-one-of-the-priests/","cat":"news_&_views","id":"comment-36240","author":"Angel","site":"shroudstory"},{"title":"We received a high resolution scan from one of the priests . . .","post":"Turin should issue a statement and name the priest who is said to have been on the restoration team.\n\n","date":"June 1, 2013 at 9:34 am","url":"https://shroudstory.com/2013/06/01/we-received-a-high-resolution-scan-from-one-of-the-priests/","cat":"news_&_views","id":"comment-35609","author":"Louis","site":"shroudstory"},{"title":"We received a high resolution scan from one of the priests . . .","post":"I was contacted by this company about a month ago and they sent me their printed literature. I also spoke to the owner on one occasion. They wanted STERA, Inc. to include their product on shroud.com. I asked them to furnish the name of the priest who provided the image and was told he was from Spain and named “Fr. Laisney.”  They claimed he was part of the “restoration” team so I contacted Turin today and was told that they never heard of Fr. Laisney and he had nothing to do with the 2002 restoration. Also, the material on their website and printed literature is inaccurate when it talks about the Shroud. We will not be working with them.\n\n","date":"June 1, 2013 at 6:24 pm","url":"https://shroudstory.com/2013/06/01/we-received-a-high-resolution-scan-from-one-of-the-priests/","cat":"news_&_views","id":"comment-35650","author":"Barrie Schwortz","site":"shroudstory"},{"title":"We received a high resolution scan from one of the priests . . .","post":"Barrie has cut the story short so there is no need to waste time on this. The query (#4) was raised precisely because no priest was known to have been in the restoration team and this fact alone made the announcement of the enterprise suspicious.\n\n","date":"June 1, 2013 at 6:33 pm","url":"https://shroudstory.com/2013/06/01/we-received-a-high-resolution-scan-from-one-of-the-priests/","cat":"news_&_views","id":"comment-35651","author":"Louis","site":"shroudstory"},{"title":"We received a high resolution scan from one of the priests . . .","post":"‘ “…one of the priests that worked on the restoration team at the Vatican,” Dymszo added.’ The restoration work was done in Turin. What do these guys know,  anyway?\n\n","date":"June 1, 2013 at 8:10 pm","url":"https://shroudstory.com/2013/06/01/we-received-a-high-resolution-scan-from-one-of-the-priests/","cat":"news_&_views","id":"comment-35655","author":"daveb of wellington nz","site":"shroudstory"},{"title":"We received a high resolution scan from one of the priests . . .","post":"There is a Fr Francois Laisney, of the Society of St Paul X, who lectures on the shroud, using what appears to be a full size version of the Durante photo (http://www.sspx.org/rcr_pdfs/2005_rcrs/june_2005_rcr.pdf). Sillybeliefs.com discusses his lecture in some detail. Could it be he?\n\n","date":"June 2, 2013 at 4:48 am","url":"https://shroudstory.com/2013/06/01/we-received-a-high-resolution-scan-from-one-of-the-priests/","cat":"news_&_views","id":"comment-35693","author":"Hugh Farey","site":"shroudstory"},{"title":"We received a high resolution scan from one of the priests . . .","post":"Hugh et al: wrong saint – Fr Francois Laisney is a member of the St Pius X Society, an ultra-conservative reactionary group of Catholics founded by Archbishop Marcel Levebre in 1970,protesting at the reforms of Vatican II and who exclusively observe the Latin Tridentine Mass along with other pre-Vatican II practices of piety; a search on “St Pius X society wiki” will tell you all you want to know about the society. Relations with the Holy See have been strained, particularly when Lefebvre consecrated four bishops over the objections of Rome, which resulted in excommunications. The group has been associated with supporting extreme right-wing regimes, including fascist dictatorships. Pope Benedict XVI attempted a reconciliation with the group, but relations continue to be uneasy. I note that their newsletter records that traditional mourning practices for Pope John-Paul II were observed. \nI found it intriguing that Fr Lainsey is apparently appointed to Wanganui NZ, a city I know well having spent 5 years there 1965-70. Even at that time, there were signs of ultra-conservatism and reactions against Vatican II here, although there is also a healthy main-stream Catholicism present. Fr Laisney apparently travels overseas quite frequently,and has evidently contacted the Artifactory group.\nWanganui is at the mouth of one our principal North Island rivers which drain the central plateau. Susan Aubert of Lyons came to NZ in 1861, founded a mission station upstream on the river at Hiruharama (=Jerusalem) and eventually established an order of nuns, “Daughters of Our Lady of Compassion” which continues to be a significant charity order in NZ, with Homes of Compassion. Her cause for canonisation is a work in progress. Around the 1960s, James K Baxter a major NZ poet, an alcoholic who converted to Catholicism, set up a refuge for waifs and strays in Hiruharama. As you can see, an interesting background and history. The P.C. brigade who insist on standardising Maori place names regardless of local dialects, now require that the city and river be spelt with an ‘h’, thus ‘Whanganui’, despite some local derision.\n\n","date":"June 2, 2013 at 7:32 am","url":"https://shroudstory.com/2013/06/01/we-received-a-high-resolution-scan-from-one-of-the-priests/","cat":"news_&_views","id":"comment-35712","author":"daveb of wellington nz","site":"shroudstory"},{"title":"We received a high resolution scan from one of the priests . . .","post":"David, you seem to have located the right priest and since only Monsignor Giuseppe Ghiberti was associated with the restoration, as spokesman for the Turin Archdiocese, and not as a team member, Fr. Laisney may not even be knowing what is going on. From what can be judged at present, the group was trying to make use of STERA, Inc using his name, in order to gain confidence for commercial purposes. The St.Pius X Society is now headed by Bishop Bernard Fellay and Father Franz Schmidberger and it is always possible that a member acts independently, as was demonstrated not long ago by the former Anglican and now St. Pius X Society bishop Richard Williamson.\n\n","date":"June 2, 2013 at 10:28 am","url":"https://shroudstory.com/2013/06/01/we-received-a-high-resolution-scan-from-one-of-the-priests/","cat":"news_&_views","id":"comment-35723","author":"Louis","site":"shroudstory"}]
