[{"title":"What if Jesus Defies Expectations Again","post":"The analysis presented is quite thoughtful and I find myself concurring in much of it. However, there is one point where I part company and that is it seems to distinguish science from religion. Teilhard de Chardin foretold a convergence of science and religion. Science has often explained what religious thought inexplicable. The Resurrection is in a sense the last barrier that seems to separate science and religion.\nHowever, science is knocking on the door of the ultimate mystery. – consciousness. \nThere will be scientists who will believe they can solve that mystery and viola, no God. On the other hand, I believe that ultimately the more we learn about consciousness and the quantum and beyond the quantum, the cosmic, the closer we will get to the primordial consciousness entity from which our existence sprang, , that is God,\n\n","date":"June 30, 2014 at 5:43 am","url":"https://shroudstory.com/2014/06/30/what-if-jesus-defies-expectations-again/","cat":"news_&_views","id":"comment-134443","author":"John Klotz","site":"shroudstory"},{"title":"What if Jesus Defies Expectations Again","post":"Viola? correction I think. There is a French word that expresses enthused satisfaction when a problem is solved or an answer discovered. I am not sure I got it right.\n\n","date":"June 30, 2014 at 5:51 am","url":"https://shroudstory.com/2014/06/30/what-if-jesus-defies-expectations-again/","cat":"news_&_views","id":"comment-134445","author":"John Klotz","site":"shroudstory"},{"title":"What if Jesus Defies Expectations Again","post":"John, it looks like “Voila”, only there’s an acute sign over the ‘a’ which I haven’t yet learnt how to do in wordpress on an English keyboard. etymology “See, there!”  Max et al would have no trouble. \nI don’t know that I can share your conclusion.  For I strongly suspect that God has decided that he will not compel belief.  Why? Because the consequences of man’s denial would then be too terrible to contemplate.  He prefers I think to be a forgiving God!\n\n","date":"June 30, 2014 at 6:50 am","url":"https://shroudstory.com/2014/06/30/what-if-jesus-defies-expectations-again/","cat":"news_&_views","id":"comment-134454","author":"daveb of wellington nz","site":"shroudstory"},{"title":"What if Jesus Defies Expectations Again","post":"Dave,\nI have long ago given up deciding what God is up to. Most often when we apply human logic, it falls short. \nI do have a feeling that there is something at work with the Shroud. Its survival given the chaos of the eras it passed through is a “miracle.” If the Moslems didn’t get it there are a whole bunch of reformers (Calvin for example) and revolutionists who would have enjoyed assigning it not to the dust bin of history but to a bonfire.\nThe is nothing “miraculous” in Pia’s pictures or in the STURP examinations. Do I detect divine providence in the shroud’s survival until we had the science that would enable us to analyze in depth? You betcha.\nThe final act  may very well be science finding and/or admitting that the image could only have been created by a process related to an extraordinary transformation of the body. Intellectually, that’s where I am.\n\n","date":"June 30, 2014 at 8:48 am","url":"https://shroudstory.com/2014/06/30/what-if-jesus-defies-expectations-again/","cat":"news_&_views","id":"comment-134471","author":"John Klotz","site":"shroudstory"},{"title":"What if Jesus Defies Expectations Again","post":"“voilà” with a grave accent.\n\n","date":"June 30, 2014 at 6:56 am","url":"https://shroudstory.com/2014/06/30/what-if-jesus-defies-expectations-again/","cat":"news_&_views","id":"comment-134456","author":"anoxie","site":"shroudstory"},{"title":"What if Jesus Defies Expectations Again","post":"I think the lever of erudition and education as well as intelligence of the subscribers to this blog is demonstrated by the quickness with which my inquiry was answered and both match..\n\n","date":"June 30, 2014 at 8:38 am","url":"https://shroudstory.com/2014/06/30/what-if-jesus-defies-expectations-again/","cat":"news_&_views","id":"comment-134469","author":"John Klotz","site":"shroudstory"},{"title":"What if Jesus Defies Expectations Again","post":"“The only thing it cannot be is evidence against the Resurrection”\nNot everyone will agree with that and the author has not read enough. The relic has been used to “prove” that Jesus survived the crucifixion and the went to India, where he lies buried in a tomb in Kashmir. A pdf book with this rubbish is available on a Shroud website. This is just one attempt, the other one, by a German author, is well known. All I can say is that hardly anyone in India believes the story of the Kashmir tomb, which received more attention with what the Kersten/Gruber duo wrote. I am making a challenge: why not excavate the tomb? The Sufi mystic Yuz Asaf is buried there\n“Naturalistic Explanation”\nIt is not that easy to dismiss naturalistic explanations, that is why RD has received awards. However, there is a lot more in the box, and he knows that, the reason why he refused to sign a letter criticising British Prime Minister David Cameron for calling England a Christian country.   \n“Resurrection as merely a metaphor”.\nThat is what many Christian theologians think, as well as some Shroudies, although they pretend that it is not so.\n\n","date":"June 30, 2014 at 12:25 pm","url":"https://shroudstory.com/2014/06/30/what-if-jesus-defies-expectations-again/","cat":"news_&_views","id":"comment-134504","author":"Louis","site":"shroudstory"},{"title":"What if Jesus Defies Expectations Again","post":"Stephen also made a mistake when he wrote, “Hardly fit the job description of the messiah now, did it?”\nThe belief in a messiah began in 200 BC and had different meanings, an anointed one, a king, two messiahs mentioned in the Dead Sea Scrolls, and so forth. The development was much more complicated than many people think, it is the topic of a book that should be read by Catholic, Protestant and Jewish scholars and interested readers, written by Father Joseph A. Fitzmyer, SJ, cited in the interview:\n https://www.academia.edu/4700001/What_do_we_know_about_the_Bible_An_interview_with_Joseph_A._Fitzmyer_SJ\nThe people were so confused that even Bar Kokhba was proclaimed messiah after Jesus’ time. The concept was even adopted in Islam, where the title was “mahdi”.\nThe liberal Protestant scholar Harnack was the one who really understood why Jesus “defies expectations.”\n\n","date":"July 4, 2014 at 5:58 pm","url":"https://shroudstory.com/2014/06/30/what-if-jesus-defies-expectations-again/","cat":"news_&_views","id":"comment-135376","author":"Louis","site":"shroudstory"},{"title":"What if Jesus Defies Expectations Again","post":"I feel that there is something at work with the Shroud. Its survival given the chaos of the eras it passed through is a “miracle.”\n\n","date":"August 22, 2014 at 9:16 am","url":"https://shroudstory.com/2014/06/30/what-if-jesus-defies-expectations-again/","cat":"news_&_views","id":"comment-145440","author":"Philosophy Essay","site":"shroudstory"}]
