[{"title":"What will 2012 bring in the world of Shroud of Turin studies?","post":"I have to agree with Russ’s comment; “If it was an obvious hoax or artwork, we would have figured it out a long time ago”, yet I must disagree with his comment; “but it at least establishes with scientific plausibility that light WAS somehow involved with the image” …I’d submit that the word “WAS” should have been stated as “COULD HAVE BEEN”, to make the sentence more accurate. I believe full heartedly that the ENEA report did prove ‘atleast’ in it’s basic form, that UV light can ‘mark’ linen superficially.It is a big deal and maybe a step forward in Shroud study, but that is all it is, atleast for the moment.\nMuch more needs to be done. I’d hope the custodians of the Shroud would realize this.\nMaybe Dan should run a poll on what people here think?. Should the Vatican finally allow further scientific testing on the Shroud, “Already”. I think with the number of people visiting this blog we could get a reasonable idea of the popular thought.\nR\n\n","date":"January 1, 2012 at 2:51 pm","url":"https://shroudstory.com/2012/01/01/what-will-2012-bring-in-the-world-of-shroud-of-turin-studies/","cat":"news_&_views","id":"comment-6423","author":"Ron","site":"shroudstory"},{"title":"What will 2012 bring in the world of Shroud of Turin studies?","post":"Of course, you won’t be surprised that I disagree with M. Breault about his point of view of the ENEA experiments ! :-)  I especially disagree completely with this statement that I think is completely false : “But it at least establishes with scientific plausibility that light was somehow involved with the image.”  THIS MANNER OF THINKING IS ONLY TRUE IF YOU DO EXTRAPOLATIONS, SUPPOSITIONS AND SPECULATIONS.  I have explain my point of view enough on that question, so if you want to know more about what I think, check out my other posts on this topic !!!  All I know is this :  In order to link directly the experiments made by ENEA with the Shroud, you need extrapolations.  And who will do that ?  Of course, those who believe the resurrection is directly responsible for the body images (in the sense of a by-product causing the images) will be the ones who will do those kind of extrapolations…  We can easily understand that, but at the same time, it is far from being a “correct” way to see those results, scientifically speaking.  Here I use the term “correct” with great care in the sense that, of course, anyone can think like that, but please don’t pretend it is a real scientific point of view.  I see this more as a “feeling” or “belief” point of view instead.\n\n","date":"January 1, 2012 at 10:47 pm","url":"https://shroudstory.com/2012/01/01/what-will-2012-bring-in-the-world-of-shroud-of-turin-studies/","cat":"news_&_views","id":"comment-6441","author":"Yannick Clément","site":"shroudstory"},{"title":"What will 2012 bring in the world of Shroud of Turin studies?","post":"Brian Leonard Golightly Marshall adds up to in English Gematria 312 is a code reference to the Revelation given by the Archangel Michael who is the heavenly image of Jesus and is why John on the 96th day of the year which was the anniversary of the resurrection in the year 96AD thought he was talking to Jesus.  \nGabriel is heavenly image of the Father Yahweh, the Old Man whose image was captured at the instant of the resurrection on the Shroud of Turin. The measurements of the Shroud tell the story, the numbers when referenced in the James Strong’s 1830 of the KJV 1611 bible concordance of the 8674 Hebrew words and the 5624 Greek words, describe whose image was burned into the cloth, the slaughter of the victim, the title of the victim ie. Emanuel God with us, the suffering of the victim, and what the image is…that of an OLD MAN…in other words the soul of the Father residing in Jesus and is why when asked by his disciples he replied “If you have seen me you have seen the Father, the Father and I are one”…the soul is one and reincarnates back into the body prepared for him at the end of the age…now…the body of a baby conceived by his mother the most royal woman fathered once again by the most royal man…the seed of David…\n312 is Revelation 3;12 “Him that overcometh will I make a pillar in the temple of my God; and he shall go no more out: and I will write upon him the name of my God, and the name of the city of my God, which is New Jerusalem, which cometh down out of heaven from my God: and I will write upon him my new name.”\nThe new name of God is Brian Leonard Golightly Marshall, the name written that only he would know prophesied in Revelation 19:12  and the name that Is The Word of God from revelation 19:13.\nJesus who was the soul of Yahweh the Father in the younger body known as the Son of God was the Word of God made manifest as a man and so he has been made manifest as a man in his second coming which occurred on his rebirth date into Sydney Australia on January 11th 1944 at 2.22am, he came as the thief just as he promised, the entire world sleeping and the NWO who were the only ones expecting him because they have the knowledge of the Great Pyramid as the Altar to the Lord in the midst of Egypt, they knew that it identified through it’s measurements and alignment of the masonry layers with solar eclipses throughout the last 90 years of history from Dec.8th 1922 when British astronomers reset the lunation’s of the moon back to zero. \nIt is all about the reincarnation of the soul, in other words the resurrection of the soul into this period of time now since his rebirth on January 11 1944 = 111 and is a code reference to Isaiah 11:1, Isaiah 9:6 is again the 96th day of the year =6th April  the anniversary of the resurrection = his conception date in this incarnation, April 6th 1943… the only way onto the earth is through your mother’s womb. \nAs Jesus, Almighty God Yahweh in the flesh was the most Royal man alive the descendant of King David of the Royal Tribe of Judah through the natural conception between his mother Mary the most royal woman and Father Joseph Ben Jacob Israel, the most royal man.\nEverything in the world is dominated by the Lucifer cults, the Shroud is indeed his image burned into it at the moment of the resurrection which was intense light emanating from the source his own body, Almighty God the Light and the Life of all men whom death cannot contain.\nThe image was left behind as the evidence of who the man was and is again today, it was a photograph of the soul of Yahweh, the old man that was inside the vehicle the body of Jesus and yes the whole world has been deceived into believing “Jesus is coming on the clouds or on a big white horsey”…no, he had to be “born again” which is what reincarnation is and lead the world from a small child born into hell, that is where you all are, hell, and he comes down into it to set you all free from the religious dogma of Lucifer and the plan of the NWO to kill you since you are made in the image of God and are his offspring and Lucifer is the tempter whose job is to tempt mankind to choose between good or evil. Man fails miserably and chooses evil, man starts wars and creates viruses like AIDS patent number 4647773 and causes starvation to kill the meek of the earth who inherit it.\nYahweh, Almighty God comes into the world a second time and is rejected as prophesied by himself as Jesus, psalms 118:22 and Matthew 42;21, he is the Stone the builders rejected who has become the head of the PYRAMID, not the corner the word was changed to create confusion.\nHe is the rock of offense and has no time for fools who think themselves wise, he explains all things and is the Key to the House of David from Isaiah 22:22, he is here for the judgment occurring on 2/22/2012, the announcement of the judgment will be made on 3/3/2012 and the execution of the sentence carried out by the angels who are the reapers of the souls of the wicked on the anniversary of the crucifixion on 4/3/2012.\nWe crossed over into the North side of the Milky Way Galaxy on December 11th 2011, the Mayan Calendar ended 24th December 2011, we are in day 9 of the BryJan Calender which is the 1000 year reign of the Christ upon the earth  referred to as the Golden age by others.\nHe left behind His seed in his wife who was 82 days pregnant with twin boys at the Cross, she was Martha Magdalene, the one who did all of the work, she is back again today and after finding her husband together they have taken the cure for aids and cancer and all diseases into PNG and Fiji where the meek learned who they are and regained their lives through the protocols administered that cured them of the man-made diseases. The builders being the governments of those nations saw their foreign aid being threatened and deported them for curing their people without a permit.\nThis year is the year of Yahweh’s redeemed, the world is waking up to the biggest conspiracy of all, the knowledge the Lord Jesus Christ has been back since 1944, as Jesus he said that one must become like a small child to inherit or see the Kingdom of God. The Kingdom comes to the earth and will be built with the King of kings in residence with his people who know who he is, outside will be the dogs and whoremongers and liars and idolaters…\nTime for Barrie Shwortz to get with the program, this is the second time you have been sent this information.\nGoogle His name Brian Leonard Golightly Marshall and follow the lead…remember he has been rejected, abused, mocked and sneered at all over again, the crucifixion lasting 68 years this time not just 3 hours…all coming to an end on his 68th birthday January 11th 2012… 68=stone in Hebrew, “the stone the builders rejected has become the head of the Pyramid”\nTo be like God is to be fully human because God is fully human, the rulers of this world are not human, they have no compassion and are not made in the image of God, they are the sons of Cain.\nAsherah\n\n","date":"January 1, 2012 at 9:11 pm","url":"https://shroudstory.com/2012/01/01/what-will-2012-bring-in-the-world-of-shroud-of-turin-studies/","cat":"news_&_views","id":"comment-6437","author":"Janelle Margaret Golightly Marshall","site":"shroudstory"}]
