[{"title":"When Asses Flew","post":"It seems significant that portraits of Pope Pius XII pervade the Mundabor blog.  A saintly and perceptive man himself, who had the woeful task of presiding over the Church during the dark days of World War II, he is considered by an ultra-conservative faction to have been the last true pope of the Catholic Church as Bishop of Rome.  The Mundabor blog itself illustrates only too well what was was wrong with the Pre-Vatican II church with its narrow uncompromising outlook on any who dared disagreed with it, its pseudo-piety, its triumphalist attitude, its blindness and its anathemas.  \nProfessor Karen King occupying one of the most prestigous chairs of Divinity in a USA University, has done exactly what she was asked to do – To give an opinion on an alleged Coptic fragment of papyrus,  She has not as far as is known claimed that the fragment is authentic.  That has yet to be tested.  She has arranged for a translation and written a careful and cautious paper on her findings to date.  She correctly points out that IF the fragment turns out to be authentic, it is the only fourth century writing which asserts that Christ was married.  There’s not much more to it than that.  Extensive comment on the fragmet has already appeared on this site.  \nThe ill will evident on the Mundabor site is merely a remnant of an old tired form of Catholicism, that the vast majority of Catholics have now thankfully put behind them.\n\n","date":"September 24, 2012 at 4:38 pm","url":"https://shroudstory.com/2012/09/24/when-asses-flew/","cat":"news_&_views","id":"comment-16877","author":"daveb of wellington nz","site":"shroudstory"},{"title":"When Asses Flew","post":"This is a typical highly conservative approach to tackle what is being said about the “Jesus of history”. But Christians have nothing to worry about because gnostic distortions have been known for decades and Harvard has never been taken seriously by the best American Catholic and Protestant scholars when it comes to teaching Christianity.\nProfessor Luke Timothy Johnson (Emory University), for instance, gave a very convincing explanation about why the “Gospel of Thomas” only has Sayings and no Narratives. So, if there were secret agendas then, there are many more around today, perhaps with not that much secrecy, but the important thing to note is that the agendas are there.\n\n","date":"September 24, 2012 at 8:41 pm","url":"https://shroudstory.com/2012/09/24/when-asses-flew/","cat":"news_&_views","id":"comment-16882","author":"Louis","site":"shroudstory"},{"title":"When Asses Flew","post":"The point, I believe, is the piece of cloth doesn’t even come close to anything authentic in the Christian tradition of any stripe.  Before this was written, we have a clear Christian canon from the 360s through the early 400s, everything else being regarded as good pious writings (but not Scripture) through heresy.  Even if it were proven authentic writing, it would an authentically heretical writing, at best, from a Catholics vantage point.  It would prove what we already know without doubt.  Why is that so amazing?\n\n","date":"September 25, 2012 at 12:26 am","url":"https://shroudstory.com/2012/09/24/when-asses-flew/","cat":"news_&_views","id":"comment-16886","author":"Andy Weiss","site":"shroudstory"},{"title":"When Asses Flew","post":"Now British scholar pours water on ‘fake’ papyrus text that claimed Jesus had a wife\nhttp://www.dailymail.co.uk/news/article-2207038/British-scholar-says-papyrus-claiming-Jesus-married-fake.html\n\n","date":"September 25, 2012 at 12:32 am","url":"https://shroudstory.com/2012/09/24/when-asses-flew/","cat":"news_&_views","id":"comment-16887","author":"Tornike Chiboshvili","site":"shroudstory"},{"title":"When Asses Flew","post":"The full Daily Mail article referenced by Tornike above belies its sensationalist headline.\nProfessor Francis Watson of Durham University believes that the fragment is a fraud made up of a collage of a Coptic translation of extracts from the Gnostic ‘Gospel of Thomas’.  He may be correct in this view.  However the full article goes on to give a reasonably balanced full account of the fragment.  The point is made that tests are proceeding to test the ink which should give a definitive answer one way or the other.  Karen King has not asserted that the fragment is authentic at all, but in her position she has to remain open to the possibility until proven otherwise. \nThe fragment has nothing to do with Dan Brown theories despite the titillation aroused.\nThere is a general misunderstanding abroad, particularly among Christians, about the role of a University Religious Studies department or faculty, a discipline in which I happen to hold a NZ Bachelor’s major.  It is the function of such a faculty to study ALL aspects of ALL religions, not just one’s own favourite brand of Christianity.  In my studies we covered Biblical Studies, Judaism, Islam, Hinduism, various Oriental Religions, Zorastrianism, Ancient Mesopotamian Religions, Polynesian, Maori, Melanesian and Aboriginal Religions, as well as Modern Critical Issues in Religion to name a few.  I have presented at Stage III seminars papers on Baal Hadad, Epic of Gilgamesh, Pope Leo XIII’s social encyclicals, Hans Kung and Teilhard de Chardin.  I have read up on Gnostic Writings, studied the Bhagavad Gita, the Koran, Confessions of Augustine, countless Catholic and Protestant writers and so on.  None of this has compromised my own Catholic Faith, but in fact I feel it has broadened and deepened it.  Critics of such studies migh reflect that the great Jesuit missionary St Francis Xavier considered it important in missionary work that there should be a full understanding of a peoples’ culture if such work was to succeed and bear fruit. \nGnostic scripture is a valid research topic for any University Religious Studies department.  Much of the Nag Hamadi scriptures go towards confirming what Iraeneus and other Church Fathers had to say about gnosticism which up until recently was all that was known about it, from these naturally hostile sources.  \nI quote a recent news report: “The text is not evidence Jesus was married, said the professor, Karen L. King, a historian of early Christianity at Harvard Divinity School, who is scheduled to discuss her discovery at an international gathering of Coptic scholars in Rome on Tuesday. But she said it may cast new light on the history of early Christianity, including the formation of Christian views of celibacy and whether women were members of Jesus’s inner circle (etc)”  \nNevertheless, the sensation mongers will continue to make more of this ALLEGED finding than can at present be justified.  That cannot be helped, but is just part of the tiresome modern business of people making a living from news gathering and its presentation.\n\n","date":"September 25, 2012 at 7:39 am","url":"https://shroudstory.com/2012/09/24/when-asses-flew/","cat":"news_&_views","id":"comment-16889","author":"daveb of wellington nz","site":"shroudstory"},{"title":"When Asses Flew","post":"Andy makes and excellent point and Mundabor’s point is well taken. The whole hoopla surrounding this papyrus fragment is just like when someone claims to create a replica of the shroud and it’s touted in the press before it’s even been fully vetted by someone else. It’s science by press release and it’s only point is to foster a negative attitude towards Christianity, the Church and it’s Sacred Traditions. \nLike in cases where someone has supposedly created a Shroud replica and you rarely see anything like the attention given to the announcement of it lavished on the follow up conclusion that, no, it’s really not like the shroud at all. All the audience remembers is that someone created a shroud replica and therefore the shroud is probably a fake. And really that’s the point of science by press release. It’s gets us all talking and arguing about nothing of any substance before we even know its not substantive. It’s an exercise in whipping up hysteria and casting aspersions. \nHad Ms. King done all the academic leg work ahead of time to evaluate the value and authenticity of this piece and then presented it to the press with proper context, i.e. it’s a fragment of Gnostic writings with no real bearing on Christian traditions because this was addressed back in the third and fourth centuries but it’s nice as a piece of history about the Gnostics, I would have had respect for her. But instead we get science by press release with no context and the complete conjecture that it has any bearing whatsoever on the Christ story and therefore the role of women in the Church. As Andy has alluded to, I think correctly, there is an agenda we should be aware of and that’s really the point of this, not science.\n\n","date":"September 25, 2012 at 3:49 pm","url":"https://shroudstory.com/2012/09/24/when-asses-flew/","cat":"news_&_views","id":"comment-16904","author":"Chris","site":"shroudstory"},{"title":"When Asses Flew","post":"It makes little difference if the papyrus is genuine or a forgery, but as stated previously Karen King should have looked before she leaped and Harvard realised the mistake and had second thoughts. Once again, there is an agenda and anyone who is really familiar with what has been going on knows this and that is the reason why scholars from other universities, who are much more qualified and even more erudite than King, have warned about the agenda in whatever they published. They and their students know a lot about other subjects too, whether these be religion in general, philosophy, science-theology dialogue and so forth, do not hide the fact that they are involved in apologetics, in fact make it clear that it is what they are involved in, and, above all, have no “secret” agenda like the one held by Karen King and those associated with her.\nAs for non-gnostic Gospels according to…., we have the Gospel according to Allan Kardec (Spiritualism), the Gospel “according to Jesus” by José Saramago (Marxist), which are more known. Even Thomas Jefferson compiled his own Gospel according to…. by cuttting and pasting what was suitable to him.\n\n","date":"September 25, 2012 at 10:23 pm","url":"https://shroudstory.com/2012/09/24/when-asses-flew/","cat":"news_&_views","id":"comment-16919","author":"Louis","site":"shroudstory"}]
