[{"title":"Ash Wednesday 2015","post":"This evening, as we have done for several years past, our congregation from Our Lady of Fatima church joined with our Anglican brethren across the road at St Christopher’s to observe the annual Ash Wednesday rite of being marked with the ashes.  The liturgy was presided by the lady vicar, a popular minister who is often also called to preside at the various civic memorial observances.  \nOur Parish Priest delivered the homily.  He is an Assumptionist priest of the Augustinian order.  On this occasion he read a recent letter from his provincial headquarters in France.  It was particularly apt for Ash Wednesday and gave the congregation some rare insights into the community life of a religious order. \nI was asked to deliver the OT reading, Isaiah ch 58: 1-12.  It is a powerful reading and conveys a strong message on a proper and correct penitential approach, with an emphasis on social justice.  I commend it to other correspondents. \nDespite my 70+ years as a NZ born citizen, I continue to be perplexed by the mismatch of the liturgical calendar with the natural seasons of our southern location.  It is now late summer here, the Canterbury lambs have been subject to a long drought, their usual pastoral fodder has turned to straw, and the last of the season’s kill has already been sent to the abattoirs.  It is harvest time, and we should be observing the biblical injunction to celebrate as men do at harvest time.  The best of the summer fruit is in the supermarkets, and we are instructed to fast.  We shall observe Easter, the celebration of new life, in late autumn.  Perplexing!\n\n","date":"February 18, 2015 at 5:21 am","url":"https://shroudstory.com/2015/02/18/ash-wednesday-2015/","cat":"uncategorized","id":"comment-191322","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Ash Wednesday 2015","post":"David has shown the traditional way in which Ash Wednesday is observed in NZ, bringing Catholics and Anglicans together, as in many services in England.\nMeanwhile, some rubbish is being posted elsewhere:\nhttp://www.eyeofthetiber.com/2015/02/17/catholic-dimwit-didnt-even-know-wednesday-ashes-come-from-cremated-pets/\n\n","date":"February 18, 2015 at 8:54 am","url":"https://shroudstory.com/2015/02/18/ash-wednesday-2015/","cat":"uncategorized","id":"comment-191330","author":"Louis","site":"shroudstory"},{"title":"Ash Wednesday 2015","post":"Louis, I had previously assumed you understood what sarcasm is….\nThat was hilarious, although here in the Southern U.S., much of this goes as truth about “those Papists”.\n\n","date":"February 18, 2015 at 9:44 am","url":"https://shroudstory.com/2015/02/18/ash-wednesday-2015/","cat":"uncategorized","id":"comment-191332","author":"Nabber","site":"shroudstory"},{"title":"Ash Wednesday 2015","post":"Hi Nabber\nI think there was no need to post that material on the website, and in fact I first spotted the news”  at  your end, the Southern U.S., where one particularly ferocious “anti-papist” loved it for the reason you mentioned. He thinks it should be passed off as the truth.\n\n","date":"February 18, 2015 at 5:49 pm","url":"https://shroudstory.com/2015/02/18/ash-wednesday-2015/","cat":"uncategorized","id":"comment-191350","author":"Louis","site":"shroudstory"},{"title":"Ash Wednesday 2015","post":"There is a new book:\n“Luce dal Sepolcro. Indagine sull’autenticità della Sindone e dei Vangeli”\ndi\nEmanuela Marinelli, Marco Fasol\n———————-\n“Light from the Sepulchre. Survey on the authenticity of the Shroud and Vangeli”\nby Emanuela Marinelli, Marco Fasol…\nhttp://www.libreriauniversitaria.it/luce-sepolcro-indagine-sull-autenticita/libro/9788864093567\nShort description:\n>The Shroud is indeed the burial cloth of Jesus, or it is a medieval fake? The Gospels tell real events or are simply legends? The answer to these questions is not secondary, because it deeply affects our lives. Certainly the Shroud is the most studied archaeological find in the world and the Gospels constitute the only key to the interpretation. This link between the Gospels and the Shroud has therefore suggested to the authors to combine the latest scientific research on the Shroud to an investigation as scientific and documented the reliability of the Gospels, to sum up in a single text the results of the natural sciences and the historical ones, short form and accessible language, in order to provide a summary for the modern man who does not want to remain illiterate about the deepest questions.\n\n","date":"February 19, 2015 at 5:33 am","url":"https://shroudstory.com/2015/02/18/ash-wednesday-2015/","cat":"uncategorized","id":"comment-191370","author":"piero","site":"shroudstory"},{"title":"Ash Wednesday 2015","post":"Here’s another reference (and this is for a presentation of the Italian book that took place in Verona…):\n>Pubblicato il 15 feb 2015\n>Presentazione del libro “Luce dal Sepolcro” scritto da Emanuela Marinelli e Marco Fasol e pubblicato da Fede & Cultura sulla veridicità della Sindone e la storicità dei Vangeli. L’incontro si è tenuto presso la libreria L’Isola del Tesoro di Verona il 12 febbraio 2015.\nLink:\n\nRough translation:\nPosted February 15, 2015\n Presentation of the book “Light from the Sepulchre” written by Emanuela Marinelli and Marco Fasol and published by Faith & Culture on the veracity of the Shroud and the historicity of the Gospels. The meeting was held at the library Treasure Island Verona February 12, 2015.\nTitle: “Luce dal sepolcro”\n“Indagine sull’autenticità della Sindone e dei Vangeli”\nEditore: Fede & Cultura\nPrefazione: Card. Agostino Vallini\nPagine: 224\nCollana Storica n. 44\nData di pubblicazione: Febbraio 2015\nlinks:\nhttp://www.fedecultura.com/libro/luce-dal-sepolcro/\nhttp://www.amazon.co.uk/Luce-dal-sepolcro-Indagine-sullautenticit%C3%A0-ebook/dp/images/B00TCKIV0U\n— — —\nDuring the night I heard an interview with the authors.\n Marinelli took care of the first part (= scientific themes) instead Fasol speaks on the topic of the Gospels.\n In the interview the Marinelli cited both the Ing. Fanti and his three alternative methods to C14 that the expert botanical Boi (Marzia Boi, a university researcher at the University of the Balearic Islands) … this researcher has found three types of balms “very expensive”.\nSo …\nI have found a link:\nhttp://www.catholicforum.com/forums/showthread.php?44634-The-Turin-Shroud-and-Vatican-Insider-com\n>Marzia Boi …\n>… Her examination with the electron microscope yielded a different result: the main pollen residue comes neither from Ridolfia, nor Gundelia, but from Helichrysum (29.1%). Cistaceae pollen (8.2%), Apiaceae pollen (4.2%) and Pistacia pollen (0.6%) are also present on the shroud in smaller quantities. “All the plants mentioned here are entomophilous, that is, their pollen is carried by insects rather than air. This shows that there must have been direct contact with either the plants or the materials used for the funeral.\n>The list of pollens reveals traces of the most common plants used in ancient funerals.\n>The pollens identified clarify that the holy shroud was rubbed with oils and ointments, just as the body contained within it did.”\n>There used to be a balm made from Pistacia leaves, fruits and bark that was also used as an ointment. However, a high quality oil was once produced from the Helichrysum and this oil was used to protect both body and shroud. \nSee also:\nhttps://www.shroud.com/pdfs/boiveng.pdf\nNow I ask …\nWhat was the price (a rough estimation) for the ancient balms\nused during the entombment of Jesus?\nI am curious to know your answer.\nThank you in advance.\n\n","date":"February 19, 2015 at 5:59 am","url":"https://shroudstory.com/2015/02/18/ash-wednesday-2015/","cat":"uncategorized","id":"comment-191372","author":"piero","site":"shroudstory"},{"title":"Ash Wednesday 2015","post":"What matters is not our poor body but what we did with our bodies…\nThus what we used to make fruitful the talents, the natural gifts of God.\n— —\nWe know that before we talk about a book we should at least have read it …\nSo I apologize for my remarks about the new interesting book. But the theme of the Ashes is linked at the beginning of Lent, a time when it should stop for a moment, read and meditate on something of the Passion of Jesus … and the image of the Shroud is very appropriate for us to start meditation on the Passion of Christ.\n— — —\nPerfume today is, as it always has been, a symbol of status and wealth; however, if you were to associate only one thing with perfume, it probably wouldn’t the mummification process – yet there can be no more apt association. Perfumes, oils, and other fragrances played a key role in the process of mummifying a body for burial, as well as denoting what status the person held in life. Scientists have learned so much about the people of the past from studying mummified human remains, and much of the credit goes directly to the oils and perfumes that still reside within the bodies.\nScented oils were used as early as 10,000 BCE to help combat body odor and to soften the skin. Some of the most common scents used by the Egyptians were thyme, lavender, peppermint, cedar, rose, almond oil, and aloe. While providing a definitive use in life, these scents also had a purpose in death – namely, the process of Egyptian mummification. The famous method of embalming was developed around 2600 BCE (it does not appear that embalming was practiced by the Hebrews).\nThe Jews did not have that kind of embalming and there was a different kind of treatment for the deceased…\n— — —\nHere a title :\nMedicinal and Aromatic Plants of the Middle-EastSeries: Medicinal and Aromatic Plants of the World, Vol. 2 \nYaniv, Zohara, Dudai, Nativ (Eds.)\n2014, X, 337 p. 81 illus., 39 illus. in color\nPlants have been known and cultivated for their therapeutic properties in the Middle-East throughout recorded history and most likely – beyond that. With the progress of science, they continue to be cultivated and collected for both traditional and innovative purposes.\nThis volume: “Medicinal and Aromatic Plants of the Middle-East” offers the most comprehensive and up-to-date information on medicinal plants and their increasing importance as cultivated crops, or as plants with significant potential to become crops in this important region.\nIn 17 chapters of meticulous research, this unique volume explores history, taxonomy, ecology and biodiversity, cultivation and breeding, agronomy and medicinal properties.\nLink:    http://www.springer.com/978-94-017-9275-2\nDownload the Table of contents (pdf, 1.4 MB) …\n\n","date":"February 19, 2015 at 6:35 am","url":"https://shroudstory.com/2015/02/18/ash-wednesday-2015/","cat":"uncategorized","id":"comment-191374","author":"piero","site":"shroudstory"}]
