[{"title":"When is a relic not a relic?","post":"As a Catholic,I personally feel the very concept of relics is itself a relic. The Church can say what it wants but there is no real rhyme or reason to relics – as your questions demonstrate. They are simply mementos that we have imbued with holy significance. Relics cannot produce miracles. It is our faith that creates miracles — Jesus told us this. If an object triggers that faith that’s well and good but the minute we believe it was the object that caused the miracle then we have left the realm of faith and entered superstition. I would make just one caveat for relics linked to Christ – such as the Sudarium and the Shroud. These are unique and the Shroud goes beyond being a relic and is indeed a sign (to the authentist)\n\n","date":"January 13, 2014 at 8:22 am","url":"https://shroudstory.com/2014/01/13/when-is-a-relic-not-a-relic/","cat":"news_&_views","id":"comment-73220","author":"David Goulet","site":"shroudstory"},{"title":"When is a relic not a relic?","post":"This is a very good question and it leads to other queries like What is idolatry and what is superstition? Does idolatry refer only to idols or can it apply to other objects? I have seen Jews kissing the mezuzah, Muslims incensing a photograph of the mosque in Mecca. Ultimately it demonstrates that many of us humans are always looking for something palpable, to touch, kiss, handle some object that is linked to the divine.\nCatholics fill bottles with water coming from the Pau in Lourdes, the story of the canonisation of John Preca, Malta’s first saint, began when the parents of the child who was waiting to die in London’s King’s Hospital placed a glove that had touched the body of the priest on him, World War II hero Group Captain Leonard Cheshire, VC, a convert to Catholicism, first honorary President and Patron of BSTS, took a child from England to Turin to touch the Shroud and try to obtain a cure:\nhttp://archive.catholicherald.co.uk/article/21st-april-1978/5/was-shown-to-the-child\nPope Innocent III sent a letter to the crusaders, who were really mercenaries, telling them that they had been excommunicated because word had reached Rome about relics being stolen in Constantinople and the royal Savoia family bought the Shroud. Pope John Paul II returned some relics that had been stolen to the Ecumenical Patriarch Bartholomew I of Istanbul. If it proved that the Image of Edessa/Turin Shroud are one and the same object some agreement would have to be made with the Orthodox Church, but there is no doubt that the Shroud will be much more safer in Turin. There are also legal problems. It was donated to “the Pope and his successors” by ex-King Humberto of Italy, living in exile in Cascais, Portugal, and one of the conditions was that it would have to remain in Turin.\n\n","date":"January 13, 2014 at 10:38 am","url":"https://shroudstory.com/2014/01/13/when-is-a-relic-not-a-relic/","cat":"news_&_views","id":"comment-73227","author":"Louis","site":"shroudstory"},{"title":"When is a relic not a relic?","post":"Relics have a sound Biblical basis. Courtesy of the EWTN Library and Fr. William Saunders:\n“In 2 Kings 2:9-14, the prophet Elisha picked up the mantle of Elijah after Elijah had been taken up to heaven in a whirlwind. With is, Elisha struck the water of the Jordan, which then parted so that he could cross. In another passage (13:20-21), some people hurriedly bury a dead man in the grave of Elisha, “but when the man came in contact with the bones of Elisha, he came back to life and rose to his feet.” In the Acts of the Apostles we read, “Meanwhile, God worked extraordinary miracles at the hands of Paul. When handkerchiefs or cloths which had touched his skin were applied to the sick, their diseases were cured and evil spirits departed from them” (19:11-12). In these three passages, a reverence was given to the actual body or clothing of these very holy people who were indeed God’s chosen instruments—Elijah, Elisha and St. Paul. Indeed, miracles were connected with these “relics”—not that some magical power existed in them, but just as God’s work was done through the lives of these holy men, so did His work continue after their deaths. Likewise, just as people were drawn closer to God through the lives of these holy men, so did they (even if through their remains) inspire others to draw closer even after their deaths. This perspective provides the Church’s understanding of relics.”\nAs far as the ownership of the relics in the Angilcan Churches of England, I’ll be blunt: those Churches were stolen from the Catholics who built them for Catholic worship, so technically the relics still belong to the Catholic Church. Since it was such a long time ago, and modern day Anglicans can be no way held responsible for the sins of their ancestors(anymore than modern day Catholics can be responsible for the regrettable acts of other Catholics, past or present), the relics should stay where they are as long as the custodians of those relics treats them with the respect and reverence they are due.\nAs far as the ownership of the Turin Shroud: my personal opinion is that it was stolen from the Eastern Church, and still belongs to them. However, many members of the Orthodox Church seem to regard the Shroud as a fraud because they don’t recognize it’s provenance with either the Edessa cloth or the full figured Shroud Robert De Clari described, so they might not want it. And Eastern Christians who are in communion with the See of Rome probably don’t care whether the custodians of the cloth are Western or Eastern Christians, so long as it treated with respect.\n\n","date":"January 13, 2014 at 12:22 pm","url":"https://shroudstory.com/2014/01/13/when-is-a-relic-not-a-relic/","cat":"news_&_views","id":"comment-73231","author":"Chesterbelloc","site":"shroudstory"},{"title":"When is a relic not a relic?","post":"The current ownes are the heirs of Joseph of Arimathaea (Mark 15:43). They live probably not in Turkey.\n\n","date":"January 13, 2014 at 3:03 pm","url":"https://shroudstory.com/2014/01/13/when-is-a-relic-not-a-relic/","cat":"news_&_views","id":"comment-73238","author":"Kees Noorlander","site":"shroudstory"},{"title":"When is a relic not a relic?","post":"We live in a corporeal world and all our expressions of religion, worship, and even aspirations of spirituality must be expressed in a corporeal way, essentially material. Among themselves, angels have no need for even the power of speech, but only when communicating with this world. The Book of Revelations and the angelic worship although at times expressed in material terms does so only by way of metaphor and analogy. But we are also told that there will come a day of a new creation. What its nature might be, we may only speculate. \nAnthropologically, such cults as relics, and even the cloak of Elisha, probably owe their first origins to expressions of primitive magic, particularlly of “contagious magic”, where certain specific objects were believed endowed with magical properties, communicated by touch, such as is still practised in the use of relics for healings. There are several instances of the use of objects in the gospels and in Acts, Jesus’ garments and Paul’s apparel.\nI think that David Goulet’s remarks, that it is faith that creates the miracles, not the relics by their own power, is close to the mark. However the origins of the healing power must be perceived in a material way.  That is why I think it is probably necessary that such cults as relics probably need to persist, so that the action of God can be actually perceived in a way that we as humans can understand.\n\n","date":"January 13, 2014 at 3:12 pm","url":"https://shroudstory.com/2014/01/13/when-is-a-relic-not-a-relic/","cat":"news_&_views","id":"comment-73239","author":"daveb of wellington nz","site":"shroudstory"},{"title":"When is a relic not a relic?","post":"Are you saying, Dave, that the use of relics in Christianity does not come from itself but from practices of other religions?\n\n","date":"January 13, 2014 at 11:32 pm","url":"https://shroudstory.com/2014/01/13/when-is-a-relic-not-a-relic/","cat":"news_&_views","id":"comment-73267","author":"Andy Weiss","site":"shroudstory"},{"title":"When is a relic not a relic?","post":"The human quest for the spiritual and the divine are extremely ancient, and certainly predate Abraham’s departure from the ancient city of Ur. Their vestiges can be seen in cave paintings displaying the shaman in his dance for success in the hunt of bison and the mammoth to ensure the survival of the tribe.  They are connected with the ancient barrows for ceremonial burial. These vestiges survive in the primal religions of today. I see it not only as part of the human quest for God, but also as part of God’s plan to bring man to God. It is evolutionary, and only occasionally revolutionary. \nWe are human, not angels, and our outward expression of religion can only be through the agency of the material world we live in, through material objects, whether relics, prayer beads, images, temples, shrines, cathedrals or statues. It has always been so.  The Catholic Church did not invent the cult of relics. It merely transformed ancient human practices, and gave them a Christian significance.\n\n","date":"January 14, 2014 at 5:00 am","url":"https://shroudstory.com/2014/01/13/when-is-a-relic-not-a-relic/","cat":"news_&_views","id":"comment-73284","author":"daveb of wellington nz","site":"shroudstory"},{"title":"When is a relic not a relic?","post":"Thanks for the credit, Dan.  Unsure I deserve it, though.  Your questions are interesting inasmuch as Christian relics have been treated the same since the first century, I would assert, so all Christians ought to respect, honor and imitate that treatment.\n\n","date":"January 13, 2014 at 11:35 pm","url":"https://shroudstory.com/2014/01/13/when-is-a-relic-not-a-relic/","cat":"news_&_views","id":"comment-73268","author":"Andy Weiss","site":"shroudstory"},{"title":"When is a relic not a relic?","post":"I am given to understand that the deposition of relics in church altar-stones is a canonical requirement, that originates with the early Christian practices of eucharistic worship in the catacombs, where the tombs of martyrs may have served as altar tables. This is still consistent with what I have written above.\n\n","date":"January 14, 2014 at 5:12 am","url":"https://shroudstory.com/2014/01/13/when-is-a-relic-not-a-relic/","cat":"news_&_views","id":"comment-73285","author":"daveb of wellington nz","site":"shroudstory"},{"title":"When is a relic not a relic?","post":"> Does the Greek Orthodox Church have a legitimate claim?\nDefinitely. Although I think it is not the greek orthodox, but the russian orthodox, as the Russian Tsardom became the heir of the Byzantine Empire, which fell in 1453. After all, Tsar is the cyrillic transliteration of Caesar.\nAnyhow, I think the Shroud will return to the orthodox one day. Otherwise, there will never be peace between the catholics and the orthodox. I do think the solution to the marriage ban crisis, which now threatens the sustainment of coelibate catholic priesthood, cannot be solved in any other way, but by a re-unification of the estern and western apostolic churches and learning to accept priestly marriage. Both sides need to make concessions (active contraception and divorce, which the orthodox practice, are completely unacceptable, for example). I do think return of the Shroud will be the final sign of east-west reconciliation. Therefore its extended western stay does serve a purpose in the redemption’s grand plan.\nIt won’t happen tomorrow, however, not with the kind of person Vladimir Putin is. The east needs to get its acts together, with regards to the several hundred years of backwardness they accumulated in the development of political systems.\n\n","date":"January 15, 2014 at 5:39 am","url":"https://shroudstory.com/2014/01/13/when-is-a-relic-not-a-relic/","cat":"news_&_views","id":"comment-73360","author":"Tamas Feher from Hungary","site":"shroudstory"},{"title":"When is a relic not a relic?","post":"Great, a Hungarian! Tamas: can you shed any light on whether there is any text in the Hungarian Pray Codex that sheds any light on the (in) famous images of Christ’s anointing and the empty tomb? I’ve often wondered if the text does provide some explanation, as opposed to the images being totally independent of the text\n\n","date":"January 15, 2014 at 7:43 am","url":"https://shroudstory.com/2014/01/13/when-is-a-relic-not-a-relic/","cat":"news_&_views","id":"comment-73369","author":"Matthias","site":"shroudstory"},{"title":"When is a relic not a relic?","post":"How about for this for an argument? The Shroud is a Christian relic, not Orthodox, Uniate, Protestant nor Catholic! It was originally discovered and kept by Simon Peter!  The successor of Simon Peter, the Bishop of Rome has it now, which is the way it should be! If the Orthodox claim it is theirs, how could they ever demonstrate its provenance and their entitlement to it? They may have owned it in a moment of history, perhaps by conquest, perhaps by taking it from Edessa after negotiation with its Muslim masters to whom it never belonged. Can the Orthodox find a reputable Byzantine historian to demonstrate their entitlement to it? There appear to be none in the West who can agree as to where it was nor what it was. As for the Russian Orthodox havng a claim to it, they have yet to demonstrate the same ecumenical spirit as prevails among Christian leaders elsewhere. Or does the correspondent consider that the most Holy Shroud of Christ the rightful property of emperor, tsar, czar, Russian president, or other secular authority, rather than to God’s own holy people?\n\n","date":"January 17, 2014 at 6:10 am","url":"https://shroudstory.com/2014/01/13/when-is-a-relic-not-a-relic/","cat":"news_&_views","id":"comment-73519","author":"daveb of wellington nz","site":"shroudstory"},{"title":"When is a relic not a relic?","post":"May the first church that makes a claim of ownership of this Sign be anathema. As you have stated this relic belongs to all…and to none.\n\n","date":"January 17, 2014 at 10:05 am","url":"https://shroudstory.com/2014/01/13/when-is-a-relic-not-a-relic/","cat":"news_&_views","id":"comment-73534","author":"David Goulet","site":"shroudstory"}]
