[{"title":"When you don’t know the answer, the imagination can run rife.","post":"The mystery has been solved years ago by radiocarbon testing. If the Vatican really thinks that it’s real, they just have to ask scientists to perform  another test, and they haven’t done so far  for a very obvious reason.\n\n","date":"April 10, 2014 at 5:30 am","url":"https://shroudstory.com/2014/04/09/when-you-dont-know-the-answer-the-imagination-can-run-rife/","cat":"news_&_views","id":"comment-98058","author":"PHPL","site":"shroudstory"},{"title":"When you don’t know the answer, the imagination can run rife.","post":"PHPL is misinformed.  Did the radiocarbon testing solve the mystery of how the image was formed?  No!  Did the radiocarbon dating explain the mystery of how pollens exclusive to the Dead Sea, Jerusalem and Anatolia areas were present on the Shroud? Did it explain the mystery of the presence of travertine arogonite limestone from Jerusalem on the feet, knees and nose images occurred? Did it explain the negative photographic or 3D imaging; did it explain the accuracy of blood-stains, blood flows, or why there was no image under the blood-stains, or why the imaging process did not affect the appearance of the blood-stains? Answers to all questions – NO!!! \nFinally were the radiocarbon samples ever shown to be representative of the whole cloth, and were proper scientific sampling protocols followed in the choice of sample site? No prizes for a correct answer! \nThe “very obvious reason” why the Vatican hasn’t so far asked for retesting, is that with such a stuff-up first time round, what would encourage them to do so?\n\n","date":"April 10, 2014 at 6:56 am","url":"https://shroudstory.com/2014/04/09/when-you-dont-know-the-answer-the-imagination-can-run-rife/","cat":"news_&_views","id":"comment-98073","author":"daveb of wellington nz","site":"shroudstory"},{"title":"When you don’t know the answer, the imagination can run rife.","post":"The reason Bishop Sánchez Sorondo gave me when I emailed him was: “since the institutions that carry out these tests are rather anticlerical, the PAS currently thinks that it would not be prudent to reopen the matter until other scientific identification systems are devised.”\nPAS being the Pontifical Academy of Sciences, and Bishop Sánchez its current Chancellor.\n\n","date":"April 10, 2014 at 8:34 am","url":"https://shroudstory.com/2014/04/09/when-you-dont-know-the-answer-the-imagination-can-run-rife/","cat":"news_&_views","id":"comment-98084","author":"Hugh Farey","site":"shroudstory"},{"title":"When you don’t know the answer, the imagination can run rife.","post":"Bishop Marcelo Sánchez Sorondo is highly qualified and won a number of decorations and honours from several countries, including the Legion d’Honneur. He has learnt from Cardinal Anastasio Ballestrero’s mistakes, and so we have two very intelligent Argentinians in the Vatican.\n\n","date":"April 10, 2014 at 6:16 pm","url":"https://shroudstory.com/2014/04/09/when-you-dont-know-the-answer-the-imagination-can-run-rife/","cat":"news_&_views","id":"comment-98179","author":"Louis","site":"shroudstory"},{"title":"When you don’t know the answer, the imagination can run rife.","post":"More is to come, it is not the end of the story, but we must remember that Professor François Bovon told Jacobovici that his Jesus-Mary Magdalene connection in the “Jesus family tomb” story was science fiction.\nBovon was actually referring to literary devices in antiquity, his interest was in the literary, not historical, Magdalene but some gnostic groups had ritual orgies,they simply could not accept a celibate Jesus. In our own days we have had the ex-nun Jane Schaberg wishing that Jesus and Mary Magdalene had a good time in bed! It is the plain truth.\n\n","date":"April 10, 2014 at 6:55 pm","url":"https://shroudstory.com/2014/04/09/when-you-dont-know-the-answer-the-imagination-can-run-rife/","cat":"news_&_views","id":"comment-98184","author":"Louis","site":"shroudstory"}]
