[{"title":"Where to begin?  First pour two cups of coffee or a full pint or . . .","post":"Margherita Guarducci was a genius. In my view, her main achievement remains the recovery of the exact date of St Peter’s death  (13 October, 64).\n\n","date":"November 21, 2013 at 5:08 am","url":"https://shroudstory.com/2013/11/21/where-to-begin-first-pour-two-cups-of-coffee-or-a-full-pint-or/","cat":"uncategorized","id":"comment-52243","author":"Jos Verhulst","site":"shroudstory"},{"title":"Where to begin?  First pour two cups of coffee or a full pint or . . .","post":"Contrary to what is often said, the mass, almost industrial production of fake relics in the Middle Ages is only anothe popular anti-catholic myth, dating back at least to the times of Reformation and later Enlightment. Just like myths that medieval Church maintained the Earth was flat or “bloody Inquisition” (yes, it committed some crimes, but total number of its victims through 500 years is estimated to be 10,000-15,000, that is on average one heretic was burned every two weeks) those, delliberately distorted stories began circulated, and became facts.  Only today, the truth is being revealed.\nRemember Pars pro toto. The large widespread of relics was due to the fact, they were usually split into more and more tiny fragmenst and distributed around the monarch and churches of the whole Christian world. Because the rule saying “even the tiniest fragment of the relic is equivalent to the whole”, there were often considered in documents as the whole relic, not just part. Thus the large wood of true crosses. Thus about 36 Holy Nails, while actually there were only 3-4 nails that pierced the body, and 6-7 nails used to join the beams of the cross and Titulus (that one is in Colle van d’Elsa in Tuscany). Most of those 36 nails are actually tiny fragments separated from the original Holy nails (which are, according to Hesemann, most likely in Rome’s Santa Croce in Gerusalemme, and in Siena, and I suspect the third one is in Trier). Thus many original Crowns of Thorns, which were actually single thorns from it. And so on.\nForgeries of course sometimes happened -it would be strange if there had been none. But while studying catalogues of relics, I came to believe that actually most of the relics are authentic, at least in some sense -sometimes they are original relics, sometimes tiny portions of them, sometimes simply copies that came in contact with original, and later, with the loss of documents, their true identity was simply forgotten. Deliberate fakes are in my opinion,rather very small minority. Because I believe that most people are actually true, Because I believe that most of the people were actually honest, and only small number of them were fraudsters.\n\n","date":"November 21, 2013 at 5:33 am","url":"https://shroudstory.com/2013/11/21/where-to-begin-first-pour-two-cups-of-coffee-or-a-full-pint-or/","cat":"uncategorized","id":"comment-52244","author":"O.K.","site":"shroudstory"},{"title":"Where to begin?  First pour two cups of coffee or a full pint or . . .","post":"But what in the end is the point of relics?\nThe point is they are simply our historical heritage -like any other museum artefacts. No matter if they are relics of Jesus, Saint Peter, Mother Teresa, Muhammad or Buddha. They need to be preserved. \nThe hateful attempts to destroy the relic undertaken during the Reformation and the Enlightenment, and in the 20th century by sinister ideologies, are nothing but horrible barbarity. The relics don’t have to be venerated -but nevertheless should be treated with respect, because of history they tell us.\n\n","date":"November 21, 2013 at 5:43 am","url":"https://shroudstory.com/2013/11/21/where-to-begin-first-pour-two-cups-of-coffee-or-a-full-pint-or/","cat":"uncategorized","id":"comment-52246","author":"O.K.","site":"shroudstory"},{"title":"Where to begin?  First pour two cups of coffee or a full pint or . . .","post":"Well, as usual, yes and no. On the whole I side with Charles Freeman and think that it is vastly improbable that any single artefact currently residing in the various churches and archives of Europe was ever in contact with any member of the holy family. However, that does not necessarily speak of mass dishonesty, or even of mass gullibility. Some, I’ve no doubt began as deliberate cynical ploys to extract money from the gullible, but others began as illustrations, some, as OK says above, were honest copies, and some were certified on the basis of possibility rather than certainly. A wooden beam in Jerusalem: a piece of the cross; it’s not impossible.\nHaving gained acceptance, however, there is no reason to suppose that the vast majority of ecclesiastical relic traders were dishonest or insincere, and the more ecclesiastical hands through which a relic passed the more certification it acquired, until its original provenance was wholly irrelevant.\nI do think OK makes a good point about respecting the heritage of these things. When all Europe had one faith, sanctity was a good guarantee of preservation; now that there are so many extreme views it has become a distinct disadvantage, and it would be better to treat them as fascinating, even venerable, aspects of our developing culture than as sacred.\n\n","date":"November 21, 2013 at 7:21 am","url":"https://shroudstory.com/2013/11/21/where-to-begin-first-pour-two-cups-of-coffee-or-a-full-pint-or/","cat":"uncategorized","id":"comment-52254","author":"Hugh Farey","site":"shroudstory"},{"title":"Where to begin?  First pour two cups of coffee or a full pint or . . .","post":"On the whole I side with Charles Freeman and think that it is vastly improbable that any single artefact currently residing in the various churches and archives of Europe was ever in contact with any member of the holy family.\nThose are the doubts most people have at the begining, but if one looks at it deeper, then he discovers that this was only his initial misconceptions. \nWhy vastly improbable? Becuase we are used to the fact that most of the items belonging to us will not survive the trial of time? But actually this notion is flawed. In today’s modern world, few care about preserving their own items, they are considered worthless, and eventually end in a trash. And we think the same rule applies to the ancient relics of the Holy Men & Women who once walked on this Earth. But this is not true.\nThe precious items which belonged to them, or their reamins, were considered the most precious treasures of their followers, and they were carefully maintained and handed through generations, with tradition (often only by word of mouth) what, and whose actually they were. Documents got burned, details became mixed and confused, legends originated -but the most important information, whose this relic was, was still preserved, up to this day. Some relics (like the Shroud or Holy Tunic of Argenteuil) were buried and hidden with only some message, some letters describing their origin nad history, only later to be rediscovered.\nHugh you greatly underestimate the power of human tradition. Valuable items can really be preserved through centuries or even millenia -if there are only people devoted to store and guard them (instead of destroying them due to fanatical zeal), even risking their life. The sceptics approach, in fact, can be even treated as a some kind of insult to their notable sacrifices. While deserving the greatest honor, the guardians of the relics are instead treated as fraudsters or gullible people. It is easy to say: “I don’t know where this thing came from, so it must be false”, much harder to give it a trust and spend some effort trying not only to preserve it, but also find its real history.\nSome were certified on the basis of possibility rather than certainly. A wooden beam in Jerusalem: a piece of the cross; it’s not impossible.\nBut what about a wooden beam excavated at the ruins of the ancient pagan temple (built delliberately to desecrate the place which Christian tradition maintained the execution and burial of Jesus was performed there) with attached Titulus describing who and for what crime died on this cross? Not only it is possible, it is actually very likely! Our ancestors were not so stupid and naive, as we think, actually, I am more more and convinced of that, they were much smarter, reasonable, down-to-earth than we are. What about other relics, preserved by judeo-christian community of Jerusalem? Crown of Thorns, first mentioned in 409 AD, Holy Nails, Holy Tunics and so on?\nThe researches of the Shroud of Turin, Sudarium of Oviedo, Tunic of Argenteuil, suggest, if not prove, that they are very likely to authentic. So if those were preserved, why should I assume others were not.\nRead preface of Górny’s Witnesses to Mystery. And have more faith -not religious, but in humans.\nhttp://en.rosikonpress.com/dzial_51/towar_karta_150/Swiadkowie_Tajemnicy.html\n\n","date":"November 21, 2013 at 7:40 pm","url":"https://shroudstory.com/2013/11/21/where-to-begin-first-pour-two-cups-of-coffee-or-a-full-pint-or/","cat":"uncategorized","id":"comment-52318","author":"O.K.","site":"shroudstory"},{"title":"Where to begin?  First pour two cups of coffee or a full pint or . . .","post":"Many medieval relics were indeed genuine -such as the bones of St. Thomas Becket that had never left the cathedral where he had been martyred. It is the older, especially first century, ones that are problematic as there is no record of Christians venerating relics before the fourth century and by  then many would have disappeared.\nEveryone knew there were fakes around – see Guibert of Nogent’s Treatise on Relics from the early twelfth century when he complained that authentic relics were being driven out by fakes and miracles were being deliberately set up. The problem got much worse after the Fourth Crusade when unscrupulous operators took advantage of the flood of relics coming in from Constantinople to create their own. Pope Innocent III had to insist, in 1215, that bones be given proper reliquaries and it was often said you should not trust a relic as coming from Constantinople unless it had a reliquary with Greek writing on it. Pope Innocent also set up commissions to test whether a miracle was genuine or not – and these commission accounts can be fascinating reading with many miracles thrown out as unsupported by any evidence!\nMy wife is a horse dealer of the rare honest variety and she constantly comes across people who have been mis-sold horses by dealers who are less scrupulous than she is. The world of relics was the same and everyone in the medieval world knew this especially when travel became more easy and people began noticing that this was the third head of John the Baptist (or,dare I say it, the fourth burial shroud of Jesus) they had come across. By the fourteenth century, people are becoming much more sceptical about accepting any relic as necessarily genuine and the debates between popes, bishops, the de Charnys and the Savoys over the Shroud show exactly this!!\n\n","date":"November 25, 2013 at 7:48 am","url":"https://shroudstory.com/2013/11/21/where-to-begin-first-pour-two-cups-of-coffee-or-a-full-pint-or/","cat":"uncategorized","id":"comment-52749","author":"Charles Freeman","site":"shroudstory"},{"title":"Where to begin?  First pour two cups of coffee or a full pint or . . .","post":"And the swaddling clothes? Wood from the manger? Mary’s breastmilk?\n\n","date":"November 21, 2013 at 8:03 pm","url":"https://shroudstory.com/2013/11/21/where-to-begin-first-pour-two-cups-of-coffee-or-a-full-pint-or/","cat":"uncategorized","id":"comment-52323","author":"Hugh Farey","site":"shroudstory"},{"title":"Where to begin?  First pour two cups of coffee or a full pint or . . .","post":"And the swaddling clothes? Wood from the manger? Mary’s breastmilk?\n* Mary’s breastmilk -this is indeed a really hard case to defend. \n* Swaddling clothes -they were part of Byzantine clooection sold to Louis IX and stored in Paris Sainte Chapelle. Another swaddling cloth are stored in Aachen since Charlemagne, they are in my opinion most likely the copies of their Byzantine equivalents.\nReminder, disposable diapers are mass produced only since 1948 (see http://en.wikipedia.org/wiki/Diaper#Disposable ). In the past, swaddling clothes were washed and re-used, no one thrown them away so easily as today. So it is not impossible that they were stored in Jesus’ family as a reminder of His infant days.\n* Wood from the manger? Hugh, have you ever been in the countryside? The wooden mangers are often used there for decades, if not longer. The same manger were Jesus was born, was probably still used to feed animals 40 years later, when Jesus was crucified and later raised from the dead. After his ascencion, his mother Mary could still remeber the place and the manger where she gave birth to Her Child, and the manger could be preserved.\nHugh, except maybe such extreme examples like Mary’s milk, the ‘absurdity’ of most relics is only an illusion of sceptical mind, lacking any imagination, and tied to a seemingly reasonable (but actually completely irrational) beliefs.\n\n","date":"November 22, 2013 at 5:41 am","url":"https://shroudstory.com/2013/11/21/where-to-begin-first-pour-two-cups-of-coffee-or-a-full-pint-or/","cat":"uncategorized","id":"comment-52365","author":"O.K.","site":"shroudstory"},{"title":"Where to begin?  First pour two cups of coffee or a full pint or . . .","post":"On a different matter Hugh, might I ask your assistance? You are the one with the uv lamp. Could you try out faint scorching in my new geometry- linen and damp overlay on top of heated template. Is there still that taboo fluorescence?  (Hunch – the geometry allows easier escape of low-boiling fluorescent species via steam distillation).\n\n","date":"November 21, 2013 at 7:44 am","url":"https://shroudstory.com/2013/11/21/where-to-begin-first-pour-two-cups-of-coffee-or-a-full-pint-or/","cat":"uncategorized","id":"comment-52256","author":"colinsberry","site":"shroudstory"},{"title":"Where to begin?  First pour two cups of coffee or a full pint or . . .","post":"Seems to me the Shroud was and is explored just when we have enough matured science, etc. to really dig into this subject as, ironically, the matured world is also extremely skeptical and has difficulty with the concept of faith, which, in fact, is not antithetical to science.\n\n","date":"November 21, 2013 at 9:19 am","url":"https://shroudstory.com/2013/11/21/where-to-begin-first-pour-two-cups-of-coffee-or-a-full-pint-or/","cat":"uncategorized","id":"comment-52265","author":"Andy Weiss","site":"shroudstory"},{"title":"Where to begin?  First pour two cups of coffee or a full pint or . . .","post":"\nCharles Freeman :\n there is no record of Christians venerating relics before the fourth century .\n\nPure nonsense!\nActs 19:11-12 (NIV) (http://www.biblegateway.com/passage/?search=Acts%2019&version=NIV;KJV ):\nGod did extraordinary miracles through Paul, 12 so that even handkerchiefs and aprons that had touched him were taken to the sick, and their illnesses were cured and the evil spirits left them.\nThe Martyrdom of Polycarp (died between 155-169 AD), Chapter 18 (http://www.newadvent.org/fathers/0102.htm):\nThe centurion then, seeing the strife excited by the Jews, placed the body in the midst of the fire, and consumed it. Accordingly, we afterwards took up his bones, as being more precious than the most exquisite jewels, and more purified than gold, and deposited them in a fitting place, whither, being gathered together, as opportunity is allowed us, with joy and rejoicing, the Lord shall grant us to celebrate the anniversary of his martyrdom, both in memory of those who have already finished their course, and for the exercising and preparation of those yet to walk in their steps.\nOrigen, Contra Celsum 1:51 (http://www.newadvent.org/fathers/04161.htm):\nWith respect to the birth of Jesus in Bethlehem, if any one desires, after the prophecy of Micah and after the history recorded in the Gospels by the disciples of Jesus, to have additional evidence from other sources, let him know that, in conformity with the narrative in the Gospel regarding His birth, there is shown at Bethlehem the cave where He was born, and the manger in the cave where He was wrapped in swaddling-clothes. And this sight is greatly talked of in surrounding places, even among the enemies of the faith, it being said that in this cave was born that Jesus who is worshipped and reverenced by the Christians.\nSo here we have the manger, that Hugh was interested in.\nAnd so on. The relics were venerated since the very begining of Christainity. Actually, they were venerated by judaism before Christ was even born:\n2 Kings 18:4 (NIV) http://www.biblegateway.com/passage/?search=2Kings%2018&version=NIV;KJV#fen-NIV-10029b\nHe [Hezekiah] broke into pieces the bronze snake Moses had made, for up to that time the Israelites had been burning incense to it. (It was called Nehushtan.)\nThe point here is not that he destoyed a relic (it is nowhere stated that God ordered him to do so), but that the relic was preserved.\nAnd now the passage about the power of relics: \n2 Kings 13:20-21 (NIV) http://www.biblegateway.com/passage/?search=2Kings%2013&version=NIV;KJV\nElisha died and was buried.\nNow Moabite raiders used to enter the country every spring. 21 Once while some Israelites were burying a man, suddenly they saw a band of raiders; so they threw the man’s body into Elisha’s tomb. When the body touched Elisha’s bones, the man came to life and stood up on his feet.\nCharles, can you stop spreading old worn-out anti-catholic lies from the times of Reformaton and Enlightment?\n\n","date":"November 25, 2013 at 2:38 pm","url":"https://shroudstory.com/2013/11/21/where-to-begin-first-pour-two-cups-of-coffee-or-a-full-pint-or/","cat":"uncategorized","id":"comment-52763","author":"O.K.","site":"shroudstory"},{"title":"Where to begin?  First pour two cups of coffee or a full pint or . . .","post":"\nCharles Freeman :\nEveryone knew there were fakes around – see Guibert of Nogent’s Treatise on Relics from the early twelfth century when he complained that authentic relics were being driven out by fakes and miracles were being deliberately set up. The problem got much worse after the Fourth Crusade when unscrupulous operators took advantage of the flood of relics coming in from Constantinople to create their own. Pope Innocent III had to insist, in 1215, that bones be given proper reliquaries and it was often said you should not trust a relic as coming from Constantinople unless it had a reliquary with Greek writing on it. Pope Innocent also set up commissions to test whether a miracle was genuine or not – and these commission accounts can be fascinating reading with many miracles thrown out as unsupported by any evidence!\nThat’s actually why we can trust that the relics venerated across Europe up to this day are duly certified -contrary to what was illegally sold at some markets in medieval Europe, and is still today:\nRead this (with a little help of Google Translator): http://www.dziennikpolski24.pl/pl.php/aktualnosci/malopolska/1270170-kup-sobie-relikwie-sw-piotra-apostola.html\n-still it is very likely that those frahments on sale were actually genuine.\n\nCharles Freeman :\n people began noticing that this was the third head of John the Baptist\n\nOr the third fragment of the very same head, see http://www.dailymail.co.uk/news/article-2159578/John-Baptist-bones-theory-Scientists-claim-positive-tests-1st-century-relics.html\n\n<a href=\"#comment-52749\"\n(or,dare I say it, the fourth burial shroud of Jesus) they had come across.\n\nShould I give you a full list from my still yet unpublished (44 pages and growing) article? Should I explain that more than a single Shroud could have been used?\n\n","date":"November 25, 2013 at 3:54 pm","url":"https://shroudstory.com/2013/11/21/where-to-begin-first-pour-two-cups-of-coffee-or-a-full-pint-or/","cat":"uncategorized","id":"comment-52764","author":"O.K.","site":"shroudstory"},{"title":"Where to begin?  First pour two cups of coffee or a full pint or . . .","post":"O.K. There is no evidence that relics from the passion of Christ were venerated before the discovery of the ‘True Cross’ by Helena in the 320s.\nYou show no idea of just how many thousands of relics there were around. It used to be thought that the medieval mind was backward and credulous but I deliberately highlighted cases where within the medieval period itself there was concern about the number of fakes- see the ridicule that the Canterbury pilgrims gave the Pardoner ( the seller of relics) in Chaucer. Medieval people were not fools – from the popes down they could see quite clearly what was going on- this is why pope Innocent III and other popes tried to bring some order into the market!\nWhat do you mean by ‘duly certified’? There was no coherent system of certification – as you will know from your studies of the Shroud there was no way then of sorting out whether it was authentic or not in the medieval period or not, especially when no pope was prepared to back it as authentic ( as they still do not). I believe that nowadays the Vatican does try and sort out the fakes from the authentic. I am told that if you ring them up to ask which of the seven heads of John the Baptist is the right one, they will tell you the one in Damascus. Don’t ask me how they know this but they certainly accept that the others are not the real thing.\nI am sure that all of us, not only myself, will benefit from your as yet unpublished work on the Shroud- I am sure that Dan will be happy to provide a link to it once you have finished it. Good luck with it, Charles.\n\n","date":"November 26, 2013 at 4:57 am","url":"https://shroudstory.com/2013/11/21/where-to-begin-first-pour-two-cups-of-coffee-or-a-full-pint-or/","cat":"uncategorized","id":"comment-52800","author":"Charles Freeman","site":"shroudstory"},{"title":"Where to begin?  First pour two cups of coffee or a full pint or . . .","post":"O.K. There is no evidence that relics from the passion of Christ were venerated before the discovery of the ‘True Cross’ by Helena in the 320s.\nThere is no evidence of many things, as the written records before the 4th century are relatively scarce, and relics were usually hidden. But if there is a record by Origen that early Christians venerated the so-often ridiculed relics of the manger where Jesus was born, so why should we assume that some relics (like the Crown of Thorns) of the Passion, preserved by judeo-christian community of Jerusalem were not venerated? \nActually the whole discovery of the True Cross by Helena was possible only due to the unbroken tradition among Jerusalem community about the location of Golgotha and the Tomb, and memory that the Cross was buried somewhere there. The relics and sacred places were definetly venerated, even at distance. There are no serious reasons to assume otherwise, despite some regrettable attempts undertaken by some Protestants and rationalists to undermine the Catholic and Orthodox tradition.\nWhat do you mean by ‘duly certified’? There was no coherent system of certification\nI mean that in most cases (most but unfortunately not all), the relics stored in today’s churches and palaces were checked about their provenance, those crappy fakes sold to the ordinary people by some suspicious dealers were usually not accepted, although various abuses happened sometimes. If relic came from Rome, Jerusalem, Constantinople etc., that’s fine. If came from a local craftsman, the church or monastery’s reputation was at risk, especially if church investigation was undertaken. On the other hand, the emperors, kings and duches also wanted to have guarantees of relics authenticity, even though some forgeries were made to increase political prestige. The topic is very complex, but definetly not black & white, but most people were actually honest.\nNowadays, similarly, there are also some archaeological forgeries, but overwhelming majority are genuine findings.\n\n","date":"November 26, 2013 at 9:44 am","url":"https://shroudstory.com/2013/11/21/where-to-begin-first-pour-two-cups-of-coffee-or-a-full-pint-or/","cat":"uncategorized","id":"comment-52813","author":"O.K.","site":"shroudstory"},{"title":"Where to begin?  First pour two cups of coffee or a full pint or . . .","post":"I am told that if you ring them up to ask which of the seven heads of John the Baptist is the right one, they will tell you the one in Damascus. Don’t ask me how they know this but they certainly accept that the others are not the real thing.\nSo let’s check those seven heads. Let’s list them according to this CNN article:\nhttp://edition.cnn.com/2010/WORLD/europe/08/12/bulgaria.john.baptist.relics/index.html\n1. John the San Silvestro in Capite, Italy: The Rome church claims to have John’s head; parts of a reliquary on display date from the 13th century\nComment: see http://www.atlasobscura.com/places/the-head-of-st-john-the-baptist-at-san-silvestro-in-capite The most of the skull, especially the front seems to be a reconstruction, as the eye-sockets are filled.\n2. Notre-Dame d’Amiens, France: John’s head is said to have been brought back from Constantinople in 1206 after Crusaders sacked the city\nComment: see http://www.atlasobscura.com/places/the-head-of-st-john-the-baptist-at-amiens-cathedral This is the front fragment of the head, sold to Louis IX by Baldwin II of Constantinople.\n3. Umayyad Mosque, Syria: Damascus’ great mosque is built over the site of a church dedicated to John, whose head is said to be contained in a shrine in the prayer hall\nComment: No details available. Probably some fragments of the skull, before most of it was transferred to Constantinople via Antioch.\n4. Residenz Museum, Germany: The Munich museum claims to have John’s head; one of a number of relics collected by Bavaria’s Duke Wilhelm V in the 16th century\nComment: See http://jltraveling.wordpress.com/2013/04/19/residenz-museum-reliquary-collection/ Just like a San Silvestro, possibly some fragments and reconstruction of the rest.\n5. Topkapi Museum, Istanbul: Chronicles suggest John’s right arm was transferred from Antioch to Constantinople in 956 by Byzantine emperor Constantine VII\nComment: The reamining fragment of Constantinople. No details available so far.\n6. St. Macarius Monastery, Egypt: A crypt and relics said to be John’s, mentioned in 11th century manuscripts, were discovered during restoration work in 1969\nComment: No info about the head, as far as I know.\n7. Cetinje Monastery, Montenegro: The Orthodox monastery, which dates from the 15th century, claims to have John’s mummified right hand \nComment:No info about the head, as far as I know.\nSeven different heads? Or maybe seven different fragments of the very same head?\n\n","date":"November 26, 2013 at 10:23 am","url":"https://shroudstory.com/2013/11/21/where-to-begin-first-pour-two-cups-of-coffee-or-a-full-pint-or/","cat":"uncategorized","id":"comment-52816","author":"O.K.","site":"shroudstory"},{"title":"Where to begin?  First pour two cups of coffee or a full pint or . . .","post":"O.K . Since when has the CNN been a source that scholars use for listing relics? Are you really suggesting that whenever anyone claims to have part of John the Baptist it is genuine?\nI think we must agree to differ. I spent three years researching medieval relic cults and noted how they rose and fell, new relics turned up from nowhere, often without any provenance, there were battles between rival monasteries over who had the true body of so and so or the better phial of Christ’s blood and, with a thousand year gap between the time of Christ and the Middle Ages, virtually no relic had any evidence of its provenance anyway.  \nYou do not seem to be aware of the serious theological objections to relics on the grounds that they encouraged the worship of objects at the expense of God. One of the greatest of the fourth century theologians , Basil of Caesarea, put it as follows: ‘ As the sun does not need the lamplight, so also the church of the congregation can do without the remains of the martyrs. It is sufficient to venerate the name of Christ, for the Church is his bride, redeemed by his blood.’\nI assume that you don’t live in Europe but if you are over here, do wander around the sacristies of some medieval Catholic churches – you will hardly believe that there were quite that many saints in existence as you will find parts of in the reliquaries and that is after the church cleaned out so many in the late nineteenth century.\n\n","date":"November 26, 2013 at 12:13 pm","url":"https://shroudstory.com/2013/11/21/where-to-begin-first-pour-two-cups-of-coffee-or-a-full-pint-or/","cat":"uncategorized","id":"comment-52823","author":"Charles Freeman","site":"shroudstory"},{"title":"Where to begin?  First pour two cups of coffee or a full pint or . . .","post":"O.K . Since when has the CNN been a source that scholars use for listing relics? Are you really suggesting that whenever anyone claims to have part of John the Baptist it is genuine?\nCharles, if you have better source, than present it to us. Actually, I used more sources, and I know about more relics of Saint John the Baptist, but the CNN’s list was the most convenient to use.\nI think we must agree to differ. I spent three years researching medieval relic cults and noted how they rose and fell, new relics turned up from nowhere, often without any provenance, there were battles between rival monasteries over who had the true body of so and so or the better phial of Christ’s blood and, with a thousand year gap between the time of Christ and the Middle Ages, virtually no relic had any evidence of its provenance anyway. \nYeah, yeah, yeah, we all know this. If you don’t want to believe in authenticity of any of them, you have a right to do so -but please, stop spreading old Elizabethan era myths about Catholics and their relics. The exact provenance might have been lost in most cases, but not the most important info -its ID, that this piece is a relic of this or that Saint.\nYou do not seem to be aware of the serious theological objections to relics on the grounds that they encouraged the worship of objects at the expense of God. One of the greatest of the fourth century theologians , Basil of Caesarea, put it as follows: ‘ As the sun does not need the lamplight, so also the church of the congregation can do without the remains of the martyrs. It is sufficient to venerate the name of Christ, for the Church is his bride, redeemed by his blood.’\nI am Catholic, and those Protestant objections are not of interest to me. I have nothing against Protestants, except that if someone has no tradition of its own, let he not try to destroy the traditions of others.\nI assume that you don’t live in Europe but if you are over here, do wander around the sacristies of some medieval Catholic churches – you will hardly believe that there were quite that many saints in existence as you will find parts of in the reliquaries and that is after the church cleaned out so many in the late nineteenth century.\nI live in Europe, and I know that relics were divided into almost infinite fragments. Remember pars pro toto, part for the whole. This was the reason of the great widespread of relics. But not as great, as the widespread of anti-catholic lies.\n\n","date":"November 26, 2013 at 12:32 pm","url":"https://shroudstory.com/2013/11/21/where-to-begin-first-pour-two-cups-of-coffee-or-a-full-pint-or/","cat":"uncategorized","id":"comment-52825","author":"O.K.","site":"shroudstory"},{"title":"Where to begin?  First pour two cups of coffee or a full pint or . . .","post":"OK\n1) Sources. If you make a modest investment in my book Holy Bones, Holy Dust, Yale 2011 you will find nine pages of sources so you should be able to pick and choose that you want for your own work. Incidentally as you will see from the Yale US website reviews, it was warmly received by the Catholic press.\n2) ‘Belief in the authenticity of any of them’.  Some  relics are /were clearly authentic such as the bones of Thomas Becket. As the characters and events in the New Testament have some historical reality behind them,there would have been at one point some authentic relics from the first century. The difficulty lies in tracking those few that have survived the long centuries into the medieval period and beyond. i have nothing against authenticity but I do expect some reasonable proof in specific cases.\n3) Basil of Caesarea was not a Protestant. It is a perfectly appropriate Christian response to fear that material objects become a subject of worship in themselves although i would not go so far as to destroy relics because of this.\n4) Many Catholics that I have discussed these issues with do not see relics and their authenticity a major issue in their faith and so they don’t get hung up about this (which is why, perhaps, the Catholic press was quite relaxed about my book). \nObviously relics as material remains of the Christian past play an enormous part in your approach to Christianity but I do think you have a much greater acceptance of authenticity than the historical context in which these cults have emerged justifies.  I wish you wouldn’t accuse the rest of us of lying -it does not take the debate in any helpful direction.No doubt we will hear more about your findings when you have finished and published your own research.\n\n","date":"November 26, 2013 at 2:14 pm","url":"https://shroudstory.com/2013/11/21/where-to-begin-first-pour-two-cups-of-coffee-or-a-full-pint-or/","cat":"uncategorized","id":"comment-52833","author":"Charles Freeman","site":"shroudstory"},{"title":"Where to begin?  First pour two cups of coffee or a full pint or . . .","post":"Charles:\n1) Sources. If you make a modest investment in my book Holy Bones, Holy Dust, Yale 2011 you will find nine pages of sources so you should be able to pick and choose that you want for your own work. Incidentally as you will see from the Yale US website reviews, it was warmly received by the Catholic press.\nCharles, I am not interested to push  my money into  your pocket. If you have something against my own conclusions, than present it here. Because in the case of St. John the Baptist head(s), it seems that I did more research, and presented more facts in one hour (and for FREE!), than you in three years.\nBasil of Caesarea was not a Protestant. It is a perfectly appropriate Christian response to fear that material objects become a subject of worship in themselves although i would not go so far as to destroy relics because of this. \nAnd what does this have to do with the authenticity of the relics. You don’t want to venerate relics -fine. But preserving historical memory, and objects which might have been contact with real people (no matter whether St. John the Baptist or Michael Jackson) -that’s the thing.\n\n","date":"November 26, 2013 at 4:02 pm","url":"https://shroudstory.com/2013/11/21/where-to-begin-first-pour-two-cups-of-coffee-or-a-full-pint-or/","cat":"uncategorized","id":"comment-52841","author":"O.K.","site":"shroudstory"},{"title":"Where to begin?  First pour two cups of coffee or a full pint or . . .","post":"“The relics stored in today’s churches and palaces were checked about their provenance.” Really, how? The older the relic is purported to be, the less likely there is to be any provenance at all. A 19th century bishop’s seal is not, in any sense of the word, ‘provenance.’\n“If a relic came from Rome, Jerusalem, Constantinople etc., that’s fine.” No, it’s not. There was, by the 19th century, absolutely no way of knowing where most Middle Eastern relics had come from except by tradition, and usually no evidence of the tradition more than a few centuries further, if that.\n“Most people were actually honest.” I agree with that. But I’m afraid they were honestly mistaken.\nBut, don’t take my word for it. Find your way to my favourite relic shop (Virgin Mary’s Hair: $49500, True Cross: $9600, Manger fragment: $3750, Bones of St Peter and St Paul: $4750) and browse through their offerings. Which ones would you say were genuine?\n\n","date":"November 26, 2013 at 2:48 pm","url":"https://shroudstory.com/2013/11/21/where-to-begin-first-pour-two-cups-of-coffee-or-a-full-pint-or/","cat":"uncategorized","id":"comment-52834","author":"Hugh Farey","site":"shroudstory"},{"title":"Where to begin?  First pour two cups of coffee or a full pint or . . .","post":"Hugh, Charles:\nAs the characters and events in the New Testament have some historical reality behind them,there would have been at one point some authentic relics from the first century. The difficulty lies in tracking those few that have survived the long centuries into the medieval period and beyond.\n“The relics stored in today’s churches and palaces were checked about their provenance.” Really, how? The older the relic is purported to be, the less likely there is to be any provenance at all. A 19th century bishop’s seal is not, in any sense of the word, ‘provenance.’\n“If a relic came from Rome, Jerusalem, Constantinople etc., that’s fine.” No, it’s not. There was, by the 19th century, absolutely no way of knowing where most Middle Eastern relics had come from except by tradition, and usually no evidence of the tradition more than a few centuries further, if that.\nYou still don’t understand the rule? But this is so simple, and reminds well known model in statistical physics, known as Markov chain with a short memory.\nSuppose there is a relic X of a saint Y (from the very 1st century) in a town known as Godforgotwhere.\nThe exact provenance of the relic X is unknown, except the citizens of Godforgotwhere remeber that they obtained the relic (with all certificates) from Paris. Those certificates from Paris however say nothing where the relic was obtained.\nHowever a few hundreds years before, they knew that the relic X from Paris came from Rome, based on further, now lost documents.\nNext, they in Rome knew that the relic X came from Constantinople, because they had appropriate documents.\nIn Constantinople, they knew the relic X came from Antioch.\nIn Antioch they knew the relic X came from Jerusalem.\nIn Jerusalem they knew the origin of relic X, that it originated from saint Y.\nSo:\nThe trace of relic X\nGodforgotwhere <—- Paris\nParis <—- Rome\nRome <—- Constantinople\nConstantinople <—- Antioch\nAntioch <—- Jerusalem\nJerusalem <—- Saint Y.\nGodforgotwhere <—- Paris<—- Rome<—- Constantinople<—- Antioch<—- Jerusalem<—- Saint Y.\nNow all the intermediate steps can be forgotten! The only important info:\nRelic X of Saint Y in a town of Godforgotwhere <—- Saint Y.\nThat's how it works in practice. Unless one link cheats the ID of the relic is well saved.\nAnd the results -see Shroud of Turin, Sudarium of Oviedo, Tunic of Argenteuil. The scientific examinations revealed that they are almost for sure genuine, there is no way to fake them.\n\n","date":"November 26, 2013 at 4:17 pm","url":"https://shroudstory.com/2013/11/21/where-to-begin-first-pour-two-cups-of-coffee-or-a-full-pint-or/","cat":"uncategorized","id":"comment-52844","author":"O.K.","site":"shroudstory"},{"title":"Where to begin?  First pour two cups of coffee or a full pint or . . .","post":"O.K . ‘But this is so simple, and reminds well known model in statistical physics, known as Markov chain with a short memory.’\n You have lost me but I am a mere professional historian brought up in the standard way of analysing sources and their reliability. My, and that of most professional historians,default position  is scepticism not just about relic cults but most other\nmedieval texts/legends.\nI note in Yannick’s new posting the customary Shroudie belief that somehow sceptics are biassed. No, they are often professionals who have not seen sufficient evidence to support the authenticity of the Shroud. After all the exhaustive texts of STURP failed to come up with anything that suggested a first century origin for the Shroud- at least I have not seen anything in their report that suggests this. It is a pity that they did not have any professional historian, art historian or expert in ancient textiles in their team as the opportunity was missed to provide a properly comprehensive report.\n\n","date":"November 27, 2013 at 4:23 am","url":"https://shroudstory.com/2013/11/21/where-to-begin-first-pour-two-cups-of-coffee-or-a-full-pint-or/","cat":"uncategorized","id":"comment-52902","author":"Charles Freeman","site":"shroudstory"}]
