[{"title":"Whether it is genuine or not, it’s miraculous","post":"Yes, that is excellent. I love the “faith” viewpoint, how refreshing! \nFaith is what the skeptics despise and ridicule, but it is the cornerstone of those who are spiritual. How tragic that skeptics ONLY have THIS, the damaged, defective world that they can see with their own eyes. Whereas those of faith have hope of so much more: \nSkeptics see an ancient Shroud: we see a risen Lord.\nSkeptics see a painful death: we see a miraculous resurrection.\nSkeptics see an unsolved mystery: we see confirmation of all we believe and hope for.\n\n","date":"December 26, 2011 at 1:36 pm","url":"https://shroudstory.com/2011/12/26/whether-it-is-genuine-or-not-its-miraculous/","cat":"news_&_views","id":"comment-6146","author":"AnnieCee","site":"shroudstory"},{"title":"Whether it is genuine or not, it’s miraculous","post":"Again, a triple AMEN to this article !  He express the point of view that I defend here from the very moment I started to write on this blog.  People must understand one important thing about faith :  science cannot enter in this field.  It just can’t.  Why ?  Simply because science is restricted to the MATERIAL world and faith goes beyond that into the SPIRITUAL world !  It’s pretty amazing to see the high number of people who can’t make the difference.  The spiritual world is not something that can be analyzed and proved with a microscope.  It’s more of a heart thing than a brain thing…  That’s it.  But I love the way M. Stanford put it when he say : “But nevertheless, it is (the Shroud) a powerful focus for our thoughts on the subject.”  EXACTLY !  And would add this :  For some other people, a beautiful icon of Christ or of the virgin Mary or some crucifix or other religious object like that can do the same job.  And I also know that one other object do even a greatest job for most christian and this book is the new testament !  As a catholic, everyday, I read the readings of the day proposed by the Church and today, it is special because it’s the feast of St-John.  And just before the reading of the gospel part where St-John talk about the finding of the empty tomb (with St-Peter), here’s what the Church said : “Alleluia. Alleluia. John, the beloved disciple, has borne witness to the Word of life, and we know that his testimony is true. Alleluia.”  Once you REALLY BELIEVE in this, you don’t NEED the Shroud for your faith…\n\n","date":"December 27, 2011 at 5:58 pm","url":"https://shroudstory.com/2011/12/26/whether-it-is-genuine-or-not-its-miraculous/","cat":"news_&_views","id":"comment-6189","author":"Yannick Clément","site":"shroudstory"}]
