[{"title":"While Contemplating the Ridiculous","post":"It would be interesting to see a complete list of relics, wouldn’t it?  I think the Scots have St. Andrews’ fingers somewhere. And, there’s the “Stone of Destiny”, believed to be the stone that Jacob slept on when he had the vision of a ladder to heaven. The Stone is or was in Westminster Abbey, but I believe it was returned to the Scots and will be borrowed for future coronations. There’s a lot of doubts about the Stone but it’s still an important part of English culture. \nAll these relics have a fascinating history, some of it entirely fabricated – but others might be based on truth. And people don’t really care anymore if the relic is real or not, the legend itself has become part of their culture and identity, so why mess with it. \nThe Seventh Day Adventists have a story that one of their own found the Ark of the Covenant. The stories and legends surrounding the Ark are incredible: I think every continent claims to have it hidden somewhere. I’ve come across some legends that are quite extensive and elaborate, and yet they turn out to be fake. British Israel had a very elaborate (fake) story about Tea Tephi, and some people are still completely convinced the Ark is in Ireland. \nBut the most amazing story of all is by a Seventh Day Adventist explorer, a very devout man,  who claims to have found it and brought back a fuzzy picture of it. The story is compelling, I haven’t decided yet what to make of it, but I’ve corresponded some with the guy who ran the Explorer’s museum and Pinkowski is so convinced of what his friend found, that I’ve bounced it around my head quite a bit lately.  \nThe Explorer, Ron Wyatt, is not without credibility: he did find the authentic for-real Mount Sinai in Saudi Arabia and there’s a documentary or movie about it that will be out soon. Ron Wyatt, died in 1999. But he claimed to have found Sodom and Gomorroh (fascinating story) and the place where the Israelites crossed the Red Sea: a movie documentary has been made about this as well, and is supposed to be released soon. \nI’m not saying I believe it, about the Ark: this is the most astonishing story of all. I do find it to be very interesting, especially since people who knew Mr. Wyatt are staunch defenders of his character. There are a number of websites that mention Ron Wyatt: \nhttp://www.wyattarchaeology.com/\nhttp://pinkoski.com/\nhttp://www.wyattmuseum.com/\nhttp://jonah135588.wordpress.com/2008/10/22/deathbed-confession-of-ron-wyatt-discoverer-of-the-ark-of-the-covenant/\nBTW, I think that toy from Raiders of the Lost Ark is disgusting. It shows they know nothing of the enormous significance of the Ark of the Covenant.\n\n","date":"November 11, 2011 at 9:24 am","url":"https://shroudstory.com/2011/11/11/while-contemplating-the-ridiculous/","cat":"news_&_views","id":"comment-4710","author":"AnnieCee","site":"shroudstory"},{"title":"While Contemplating the Ridiculous","post":"I want to add… Ron Wyatt said he found the Ark of the Covenant INSIDE Golgotha Hill, directly underneath the crucfixion site (they also found archaeological evidence of the site for the three crosses, and the earthquake) AND, in the same vicinity as a tomb with a groove for the enormous rock. Ron Wyatt found the huge rock nearby, too.  So all of this is directly connected with the Shroud of Turin, and equally as mysterious. If Ron Wyatt’s discoveries are authentic, the Shroud is part of the story.\n\n","date":"November 11, 2011 at 9:44 am","url":"https://shroudstory.com/2011/11/11/while-contemplating-the-ridiculous/","cat":"news_&_views","id":"comment-4711","author":"AnnieCee","site":"shroudstory"},{"title":"While Contemplating the Ridiculous","post":"Fun stories, but absolutely ridiculous. It blows me away that people actually believe this stuff.\n\n","date":"March 30, 2013 at 4:28 pm","url":"https://shroudstory.com/2011/11/11/while-contemplating-the-ridiculous/","cat":"news_&_views","id":"comment-28883","author":"Eric olander","site":"shroudstory"}]
