[{"title":"Who is right (if you can see through the bickering)?","post":"In his replies to ‘Weaving fan’, Jones missed out using the argument that cotton contamination in the Raes sample shows that the cloth cannot be of European manufacture, but had to be from the MIddle East.  He also missed using Rogers’ observation that no vanillin can be found in the Shroud fibres compared to European medieval cloth, a persuasive argument that the cloth is older than medieval.  \nJones also falls into the trap of responding to bloggers directly, instead of leaving them to debate issues themselves.  I much prefer Dan’s poiicy of posting interesting and controversial items he discovers, and then allowing bloggers, both sceptics and authenticists alike, to get on with it.  It is what makes this site such an attractive one to blog.\nColin’s snide comment is predictable, but every ad hom comment he ever makes applies equally to himself, but he just doesn’t see it.  \nOne of the most fascinating papers I’ve found on examples of early textiles is that by Professor Diana Fulbright: “Akeldama repudiation of Turin Shroud omits evidence from the Judean desert” Diana Fulbright, Frascati Conference May 2010:\nhttp://www.acheiropoietos.info/proceedings/FulbrightAkeldamaWeb.pdf .\n\n","date":"November 6, 2012 at 3:49 pm","url":"https://shroudstory.com/2012/11/06/who-is-right-if-you-can-see-through-the-bickering/","cat":"uncategorized","id":"comment-18841","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Who is right (if you can see through the bickering)?","post":"This thing about “similar herringbone cloths” is not new and just to make sure that the truth was being told by those in the anti-authenticity camp I queried V&A around four years ago. Initially they wanted to know what the inquiry was about, then kept silent when asked about the object.\n\n","date":"November 6, 2012 at 4:32 pm","url":"https://shroudstory.com/2012/11/06/who-is-right-if-you-can-see-through-the-bickering/","cat":"uncategorized","id":"comment-18846","author":"Louis","site":"shroudstory"},{"title":"Who is right (if you can see through the bickering)?","post":"“In his replies to ‘Weaving fan’, Jones missed out using the argument that cotton contamination in the Raes sample shows that the cloth cannot be of European manufacture”;\nSorry, this is not true. This is a misunderstanding of what Rogers found and wrote.\nRaes found “traces” of cotton (Gossypium herbaceum) in one part of his sample. \nRogers found the same cotton species in his Raes threads but almost no cotton in his sticky-tape samples coming from the main part of the Shroud. He also found many cotton fibers in the 2 small samples coming from the C14 area (“full of cotton”). He found that some Raes threads as well as the C14 pieces of threads he had were “full of cotton fibers” while the main part of the Shroud was (almost) “pure linen”.\nI found in Raes thread # 7 about 10-20% of cotton fibers mixed with flax fibers (see my paper in shroud.com). The main part of the Shroud seems to have no more than 2% of cotton fibers. Raes # 7 was likely a mixture of cotton/flax fibers. \nCotton (G. herbaceum), although coming from the Midde-East was used in Europa in the Middle-Ages.\nThe question is not the origin of the cotton but the fact that the Raes/c14 corner is full of cotton while the main part of the Shroud is almost pure linen.\nThis is very important  if you want to understand why Rogers thought that the Raes/C14 corner was not representative of the Shroud (the vanillin question being the other argument).\n\n","date":"November 6, 2012 at 4:37 pm","url":"https://shroudstory.com/2012/11/06/who-is-right-if-you-can-see-through-the-bickering/","cat":"uncategorized","id":"comment-18847","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Who is right (if you can see through the bickering)?","post":"Thank you Thiebault.  But nevertheless, I would have surmised that any traces of cotton at all even if only confined to the Raes and C14 samples would necessarily imply a Middle East provenance.  I would be surprised to learn that any cotton thread was used at all in Europe whether on looms or on mending linen before say the 17th century after there was active trade in raw cotton from the American cotton fields.  I would concede that there may have been a prior trade in finished cotton goods from the Middle East.  I would be happy to be corrected on any of these points.\n\n","date":"November 7, 2012 at 1:05 am","url":"https://shroudstory.com/2012/11/06/who-is-right-if-you-can-see-through-the-bickering/","cat":"uncategorized","id":"comment-18854","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Who is right (if you can see through the bickering)?","post":"You should find the answer here:\nhttp://costumedabbler.ca/cotton\nFor a complete study see my paper here:\nhttp://www.shroud.com/pdfs/thibaultr7part1.pdf\n\n","date":"November 7, 2012 at 3:56 pm","url":"https://shroudstory.com/2012/11/06/who-is-right-if-you-can-see-through-the-bickering/","cat":"uncategorized","id":"comment-18875","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Who is right (if you can see through the bickering)?","post":"Thiebault:  These were both excellent references, particularly your own very comprehensive paper in three parts.  It seems quite clear that the C14 and Raes samples were not truly representative of the Shroud, and that this was even missed by Flury-Lemburg, who had maintained that there was no variation in the cloth.  (It highlights the need to adhere to strict scientific protocols for any kind of truly representative sampling, notwithstanding cursory appearances, or even as in this case “expert” examination.)\nFrom your first reference, it seems that cotton was not well-known in Europe until well after the First Crusade in the 11th century – and it was even common to mistake it for some kind of “tree-wool”.\nThe question now in my mind is when was this repair carried out?  I am wondering if the dye found suggests that it was a medieval repair, rather than an ancient repair, as also might be suggested by the C14 tests.  In that case it takes us back to the absence of vanillin as possibly the only remaining argument that the main cloth is of ancient provenance, but that it does not locate the origin as either Europe or the Middle East.  Some other argument must seem to be sought if a Middle East provenance is to be asserted.\n\n","date":"November 8, 2012 at 6:45 am","url":"https://shroudstory.com/2012/11/06/who-is-right-if-you-can-see-through-the-bickering/","cat":"uncategorized","id":"comment-18889","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Who is right (if you can see through the bickering)?","post":"Oh, gosh.\nI’m not sure the “my-expert-is-bigger-than-your-expert” argument is very helpful, and it maybe that both experts (as opposed to both bloggers) would agree with each other. It is surely true that perhaps 90% of all weaving is simple over and under 1-1 weave. This requires only a single heddle, which either raises or depresses alternate warp threads. 3-1 twill requires four heddles, alternately raising every fourth warp thread, and is indisputably more complicated. Whether it has a herringbone pattern or not is a feature of how the threads are set up on the heddles and, once set up, is no more complicated to make than ‘ordinary’ twill. The exact proportion of twill to 1-1 is not particularly relevant – there is a lot of cloth made, and even 1% would not, I think be considered terribly rare, although it would certainly be less than common. It may be that it was more expensive than ordinary cloth and has been disproportionately preserved. \nI’m afraid that I find the idea that there is no 3-1 herringbone twill from the 13th century anywhere in Europe difficult to credit. However it may be very rare, and I can well understand nobody wanting to lose any of it, even a (large) postage stamp size, just to act as a control. After all, the shroud would only be the most valuable cloth in creation if it was the genuine article, and there would be no guarantee of that before the control was destroyed. Another reason may be that by 13th century samples of fabric are complete articles rather than fragmentary, and chopping any sample off would damage them beyond tolerance.\nI note the complaint that Wilson’s word “unusual” is graced with a [sic] by Weaving Fan. However it is an odd word. What, I wonder, is ‘usual’ about the shroud? How many similar shrouds are there to compare it to before anything about it can be considered either usual or unusual? I think I would need half a dozen or so before I could class one of them as “unusual.”\nHaving said that, Weaving Fan is being slightly disingenuous in his quote from Raes: “The type of weave is not particularly distinctive…” The paragraph from which it is taken begins: “At the beginning of our age both cotton and linen were known in the Middle East.” It is clear that here Raes is speaking of antiquity rather than the Middle Ages.\nFinally, and on a slightly different tack, and I don’t even know if it’s important, but on one side of a twill the warp threads dominate the visible area, and on the other side the weft. Does anyone know which side holds the (main) image on the shroud?\n\n","date":"November 6, 2012 at 4:48 pm","url":"https://shroudstory.com/2012/11/06/who-is-right-if-you-can-see-through-the-bickering/","cat":"uncategorized","id":"comment-18848","author":"Hugh Farey","site":"shroudstory"},{"title":"Who is right (if you can see through the bickering)?","post":"“Does anyone know which side holds the (main) image on the shroud?”\nThe so-called “warp side” (because about 75% of the “image side” surface is made up of warp threads).\n\n","date":"November 6, 2012 at 5:42 pm","url":"https://shroudstory.com/2012/11/06/who-is-right-if-you-can-see-through-the-bickering/","cat":"uncategorized","id":"comment-18849","author":"Thibault HEIMBURGER","site":"shroudstory"}]
