[{"title":"Who Proposed Ultraviolet?","post":"Why is it that most of these writers feel that they have to shy away from allowing the image to have been produced by the action of a miracle ?  Is it that if they find a very likely cause of the image by some use of the natural world then it can be said that it was not produced by the action of Christ’s resurrection which would have been a miracle – would it not have been ??\n\n","date":"July 9, 2015 at 3:45 am","url":"https://shroudstory.com/2015/07/09/who-proposed-ultraviolet/","cat":"news_&_views","id":"comment-204978","author":"ekmcmahon","site":"shroudstory"},{"title":"Who Proposed Ultraviolet?","post":"Scientists have no tests for miracles.  The closest they can ever come to it is to say that such-and-such an event is inexplicable by any known natural means!  That would not exclude any unknown natural means.  As they have no tests for miracles they are unable to give a scientific opinion that a miracle has occurred.  Miracles are beyond their competence to comment on as scientists!\n\n","date":"July 9, 2015 at 5:45 am","url":"https://shroudstory.com/2015/07/09/who-proposed-ultraviolet/","cat":"news_&_views","id":"comment-204983","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Who Proposed Ultraviolet?","post":"It is a problem when it comes to radiation because there are no side images and we simply do not know how the body was wrapped. Were the sides filled with spices, or with plants and flowers (A. Danin)? That is why I asked “radiation-like” in one of my questions:\nhttps://www.academia.edu/11355553/Dr._Paolo_Di_Lazzaro_explains_his_research_on_image_formation_on_the_Shroud_of_Turin\n\n","date":"July 9, 2015 at 8:01 am","url":"https://shroudstory.com/2015/07/09/who-proposed-ultraviolet/","cat":"news_&_views","id":"comment-204989","author":"Louis","site":"shroudstory"},{"title":"Who Proposed Ultraviolet?","post":"I don’t know if it’s a sheer coincidence , but since his Turin trip Hugh Farey has posted practically no comments on this blog . Seeing the object in real life didn’t ignite any  enthusiasm apparently.\n\n","date":"July 9, 2015 at 10:25 am","url":"https://shroudstory.com/2015/07/09/who-proposed-ultraviolet/","cat":"news_&_views","id":"comment-205000","author":"PHPL","site":"shroudstory"},{"title":"Who Proposed Ultraviolet?","post":"Dilazzaro is someone who has published in peer reviewed journals belonging to the JCR more than 100 papers on laser research, out of which only a few have anything to do with the Shroud. I think this is important because he came to the Shroud world after already being a laser expert. Little by little he has been fine tuning his experiments with linens and finally has identified the very narrow laser operation conditions that lead to obtaining very similar coloration as we see in the Shroud. He has published his works in peer reviewed journals, just like Marion with his image processing and the letters he found. Although both Dlazzaro and Marion have decided to publish their results according to the standard scientific procedures in JCR journals, it is to me difficult to understand how little credibility is given to their work in shroud circles.\n\n","date":"July 9, 2015 at 3:48 pm","url":"https://shroudstory.com/2015/07/09/who-proposed-ultraviolet/","cat":"news_&_views","id":"comment-205014","author":"gabriel","site":"shroudstory"},{"title":"Who Proposed Ultraviolet?","post":"Concerning Marion, or Castex, or Frale, it’s no more than “i think i see” with a scientific vernish.\nConcerning Di Lazzaro, he’s a laser expert and tries reproduce the shroud tanks to lasers, naively. Carpentieri, lost in unconventional neutronish radiation, is trying to reproduce the shroud thanks to neutron radiation, and Colin Berry, our food expert, is trying to reproduce the image, with flour.\n\n","date":"July 9, 2015 at 5:05 pm","url":"https://shroudstory.com/2015/07/09/who-proposed-ultraviolet/","cat":"news_&_views","id":"comment-205019","author":"anoxie","site":"shroudstory"},{"title":"Who Proposed Ultraviolet?","post":"It is not that di Lazzaro has no credibility in Shroud circles. What we need is another hands-on examination.\n\n","date":"July 9, 2015 at 5:57 pm","url":"https://shroudstory.com/2015/07/09/who-proposed-ultraviolet/","cat":"news_&_views","id":"comment-205027","author":"Louis","site":"shroudstory"},{"title":"Who Proposed Ultraviolet?","post":"Thank you, PHPL, it’s kind of you to be concerned. I have kept a watching brief since I returned from Turin, but the last few weeks of term are always an extremely busy time of year, what with reports and general end-of-year activities, especially for the organiser of Sports Day! I did find the ostentation extraordinary, mostly because of the complete lack of context in which the shroud was displayed, scientific, religious or otherwise, but my enthusiasm for the subject was nor affected, for better or worse, by the visit. Recent topics on shroudstory have been rather general, and not specific to the science of the Shroud, which is, if anything is, my forte.\nFor what it’s worth, none of the action-at-a-distance hypotheses have satisfactorily explained why the image appears only on the crowns of each thread, and not close to the places where any thread dips under another. This is characteristic of an imprint, but not of any kind of radiation or vaporograph.\nDaveb is entirely correct about scientists and miracles. The best ones do not ‘shy away’ from the idea that the Shroud may be miraculous; it’s just that if it is, then there is nothing for them to investigate!\n\n","date":"July 9, 2015 at 5:47 pm","url":"https://shroudstory.com/2015/07/09/who-proposed-ultraviolet/","cat":"news_&_views","id":"comment-205024","author":"Hugh Farey","site":"shroudstory"},{"title":"Who Proposed Ultraviolet?","post":"” …  the image appears only on the crowns of each thread, and not close to the places where any thread dips under another. This is characteristic of an imprint, but not of any kind of radiation or vaporograph.”  \nThis would seem to be an extremely significant observation!  But perhaps might not necessarily exclude radiation nor vapours as providing some kind of catalytic action essential to the process of image formation.\n\n","date":"July 9, 2015 at 8:19 pm","url":"https://shroudstory.com/2015/07/09/who-proposed-ultraviolet/","cat":"news_&_views","id":"comment-205033","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Who Proposed Ultraviolet?","post":"Yes. If there was a pre-existing reactive layer only on the crowns of the threads, itself produced by some kind of imprinting (I don’t think Rogers’s evaporation layer is particularly convincing at this scale), then radiation or gas emission might trigger it. This layer could not have been produced as part of the spinning or weaving process. It the shroud had been laid lightly on a layer of something and then removed, that might have done it.\n\n","date":"July 10, 2015 at 1:57 am","url":"https://shroudstory.com/2015/07/09/who-proposed-ultraviolet/","cat":"news_&_views","id":"comment-205061","author":"Hugh Farey","site":"shroudstory"},{"title":"Who Proposed Ultraviolet?","post":"Are you still producing BSTS newsletters at 6 monthly intervals, Hugh (hint, hint)?  Any chance the flour paste/hot iron model might get a mention, hint, hint?\n\n","date":"July 10, 2015 at 4:21 am","url":"https://shroudstory.com/2015/07/09/who-proposed-ultraviolet/","cat":"news_&_views","id":"comment-205104","author":"Colin Berry","site":"shroudstory"},{"title":"Who Proposed Ultraviolet?","post":"How can they ever investigate? The Church will not let them never it.\n\n","date":"July 10, 2015 at 11:32 am","url":"https://shroudstory.com/2015/07/09/who-proposed-ultraviolet/","cat":"news_&_views","id":"comment-205145","author":"John Green","site":"shroudstory"},{"title":"Who Proposed Ultraviolet?","post":"Why do you say Di Lazzaro is trying to reproduce the image naïvely? Have you read the interview?\n\n","date":"July 9, 2015 at 5:51 pm","url":"https://shroudstory.com/2015/07/09/who-proposed-ultraviolet/","cat":"news_&_views","id":"comment-205025","author":"Louis","site":"shroudstory"},{"title":"Who Proposed Ultraviolet?","post":"I agree with daveb on scientists when it come to miracles.\n\n","date":"July 9, 2015 at 5:53 pm","url":"https://shroudstory.com/2015/07/09/who-proposed-ultraviolet/","cat":"news_&_views","id":"comment-205026","author":"Louis","site":"shroudstory"},{"title":"Who Proposed Ultraviolet?","post":"The point I want to make is that advances obtained and made public by scientific standards accepted in any other field of science, are widely rejected by the shroud community -usually not on scientific grounds- how can we ever expect to reach one day solid conclusions on its origin and nature?If it is not through standard procedures valid for any other scientific area, how then?\n\n","date":"July 10, 2015 at 12:55 am","url":"https://shroudstory.com/2015/07/09/who-proposed-ultraviolet/","cat":"news_&_views","id":"comment-205044","author":"gabriel","site":"shroudstory"},{"title":"Who Proposed Ultraviolet?","post":"“Advances obtained and made public by scientific standards accepted in any other field of science, are widely rejected by the shroud community – usually not on scientific grounds.” Which ones, specifically? The radiocarbon date?\n\n","date":"July 10, 2015 at 1:58 am","url":"https://shroudstory.com/2015/07/09/who-proposed-ultraviolet/","cat":"news_&_views","id":"comment-205063","author":"Hugh Farey","site":"shroudstory"},{"title":"Who Proposed Ultraviolet?","post":"Sorry, off topic but…\nI’ve been re-reading ‘The Sign’, and de Wesselow mentions 2-3 historic references with regard to the Mandylion as a ‘himation’ or ‘mantle’. Clearly references that imply something much bigger than a small cloth.\nDoes anyone have any independent thoughts on this?\nAlso, every time I read his analysis of the de Clari and Mesarites descriptions of a shroud in Constantinople around 1200 I always come away thinking there is a very compelling case that this object in Constantinople was the shroud!\nSkeptical views very welcome\n\n","date":"July 10, 2015 at 2:33 am","url":"https://shroudstory.com/2015/07/09/who-proposed-ultraviolet/","cat":"news_&_views","id":"comment-205074","author":"Thomas","site":"shroudstory"},{"title":"Who Proposed Ultraviolet?","post":"Thomas, probably the most comprehensive collection to early references of Jesus images in Constantinople is by Daniel Scavone, “Acheiropoietos Jesus Images in Constantinople: the Documentary Evidence”  Daniel C. Scavone, University of Southern Indiana, now found at:  http://www.sindonology.org/scavone-acheiropoietos.pdf   It’s a solid read but authoritative and comprehensive.  \nWord of warning:  Scavone still seems to accept the Ian Wilson Mandylion theory, and there are good reasons why this seems no longer tenable.  Most history scholars reject it, as do a number of Shroud scholars.  Markwardt believes it was something else, the Image of Camuliana, sometimes referred to as the Image of God Incarnate.  Others believe it was neither of these objects.  But if you want more information on early references to what might have been references to the Shroud in Constantinople, Scavone’s paper is a good place to start.  Heavy going, but worth it.\n\n","date":"July 10, 2015 at 3:08 am","url":"https://shroudstory.com/2015/07/09/who-proposed-ultraviolet/","cat":"news_&_views","id":"comment-205081","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Who Proposed Ultraviolet?","post":"Thank you Dave. What are the primary concerns with the mandylion theory? In my opinon de wesselow presents quite a compelling case for mandylion and shroud being one and the same.\n\n","date":"July 10, 2015 at 3:15 am","url":"https://shroudstory.com/2015/07/09/who-proposed-ultraviolet/","cat":"news_&_views","id":"comment-205084","author":"Thomas","site":"shroudstory"},{"title":"Who Proposed Ultraviolet?","post":"Succinctly there seem to be two primary issues: 1) Many scholars claim that all the references to the mandylion suggest that it was no bigger than a towel, and reject Wilson’s interpretation of tetradiplon implying that it was shroud size; 2) Both the mandylion and burial cloths appear in various Constantinople relic inventories, and hence it is claimed cannot be the same object.  It is conceivable that the true mandylion may have been either the original Veronica, or something very like it.  It is also conceivable that the mandylion may have been copied from the Shroud image.  \nFor a comprehensive criticism of Wilson’s mandylion theory, see paper by Jack Markwardt presented at St Louis conference last year:  “Modern Scholarship And The History Of The Turin Shroud”  presented by Jack Markwardt at Saint Louis Shroud Conference on 12 October 1214.  Text can be found at: http://www.shroud.com/pdfs/stlmarkwardtpaper.pdf  \nTwo earlier papers by Markwardt give his theory that the Shroud was taken to Antioch.  He believes that Bishop Avercius was given temporary custody of it ~200 AD to convert the court of Abgar the Great in Edessa, thus giving rise to the Abgar legend whose true meaning is deliberately concealed by an allegory (by citing a predecessor), and also to the Hymn of the Pearl, and then it was returned to Antioch.  When Persian king Chosroes attacked Antioch in the 6th century, he believes that Bishop Ephraemius took it to Anatolia and hid it there for safe-keeping, but died before he could retrieve it.  It was later discovered as the Image of Camuliana and taken to Constantinople.  However some have found objections to the Shroud and Camuliana being the same object.  \nFirst off, you need to get your head around Scavone’s paper.\n\n","date":"July 10, 2015 at 5:14 am","url":"https://shroudstory.com/2015/07/09/who-proposed-ultraviolet/","cat":"news_&_views","id":"comment-205112","author":"daveb of wellington nz","site":"shroudstory"}]
