[{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"Where is Colin Berry when you need him?\n\n","date":"February 17, 2014 at 7:45 am","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-80003","author":"Paulette","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"“Ambraseys N (2005) Historical earthquakes in Jerusalem: a methodological discussion. J Seismol 9:329–340\nI don’t have access to this myself”\nWell I do, and quoted from it previously: “The fact that these earthquakes in Jerusalem are not mentioned by contemporary pagan writers, or by three out of the four evangelists, suggests that they may have been inspired by the topos of natures reflecting events of great importance, and they must not be considered as referring to historical earthquakes.”\nAmbraseys does mention three other authors who credit the 33AD ML=8.2 Jerusalem earthquake, but it seems likely that they derived their information from the gospel of Matthew as well. They are:\n— Ben-Menahem, Earthquake Catalogue for the Middle East, 92 BC – 980 AD, 1979\n— Sieberg, Untersuchungen ueber Erdbeben und Bruchschollenbau in oestlichen Mittelmeergebiet, 1932\n— Amiran and Arieh, Earthquakes in Israel and Adjacent Areas. Macroseismic observations since 100 BCE, 1994.\n\n","date":"February 17, 2014 at 7:54 am","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-80008","author":"Hugh Farey","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"In the paper by Carpinteri et al there is confusion between Nisaea (Isthmus of Corinth, Greece) and Nicaea (Bosphorus, Turkey). They write: “The ‘‘Old Jerusalem’’ earthquake is classified as an average devastating seismic event, that it has also destroyed the City of Nisaea, the port of Megara, located at west of the Isthmus of Corinth.” There is no ancient source for an earthquake in Nisaea. For the source for an earthquake in Nicaea, see:\nhttp://www.textexcavation.com/phlegontestimonium.html\nThe source for Nicaea does not speak of Jesus. Both Nicaea and Nisaea are over 1000 km far from Jerusalem.\n\n","date":"February 17, 2014 at 8:25 am","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-80016","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"When Stephen uses the term “Bible-believing theologians,” which groups is he referring to, evangelicals only?  I would agree one cannot only use the Scriptural referent to imply an earthquake.  We need empirical data.\n\n","date":"February 17, 2014 at 8:53 am","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-80025","author":"Andy","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"I’m glad to read this from you my friend!\n\n","date":"February 17, 2014 at 5:35 pm","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-80125","author":"Anonymous","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"Who are you, Anonymous? You are obviously not the hacker collective… :o)\n\n","date":"February 24, 2014 at 10:55 pm","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-82195","author":"Andy","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"\nAndy :\n  We need empirical data.\n\nYes, yes, and yes.\n\n","date":"February 17, 2014 at 9:58 am","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-80038","author":"Kelly Kearse","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"You will not find much empirical data from ancient sources about the type of moderate earthquake indicated in Matthew’s gospel to obtain the effects he reports. He describes the temple veil being torn and rocks splitting, and a tomb entrance being tossed aside. He doesn’t mention buildings collapsing, (even though they weren’t designed by the latest Californian or NZ codes of structural design), nor does he mention major loss of life. The effects could have resulted from a moderate event within say 30 miles of Jerusalem, or a more devastating event perhaps 100 miles distant. Talk of cataclysmic events is otherwise unsupported by evidence, and the paper’s authors probably have the date wrong anyway. Biblical exegesis involving earthquakes should be confined to those with some experience of the phenomenon.\n\n","date":"February 18, 2014 at 6:08 am","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-80290","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"Agreed, Dave.\n\n","date":"February 24, 2014 at 10:56 pm","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-82196","author":"Andy","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"There are seldom if ever any earthquakes in Australia, Quebec, South Carolina, or the United Kingdom.  I would therefore not look there for any biblical exegesis on the matter of earthquakes as they are beyond their ken, no matter whether the exegetes are evangelical pastors or even editors of newsletters of the BSTS. \nTo those of us living on the “ring of fire”, such as Japan, California, Chile or New Zealand, earthquakes are an everyday occurrence, and we design our buildings and structures to take account of them. Most of them are scarcely felt and of no great significance. In NZ perhaps we get at least one earthquake of around M*6 about once per year. In the last 24 hours as I write this, there have been three in NZ of around M*3, and one of M*5.\nhttp://www.geonet.org.nz/quakes/felt \nCompared to the more active “ring of fire” localities, Israel is an area of moderate seismic activity. In 2013 there were several shocks of around 3.5, In 1927 there was a 6.2 which killed 500, injured 700; and in 1837 an earthquake left 7000 dead. The effects of an earthquake event will depend a lot on how well buildings and structures have been engineered against earthquake. Countries of only moderate seismicity may in fact be more vulnerable as there is not the same awareness in the more active zones, and they are less prepared for them. \nStephen Jones exegesis only refers to Matt 28:2 the “resurrection” earthquake (possibly an after-shock) and seems to ignore the “crucifixion” earthquake of Matt 27:51; “At that, the veil of the temple was torn in two from top to bottom; the earth quaked; the rocks were split; the tombs opened …” all of which seems plain enough. Mk 15:38, and Lk 21:45 only refer to the temple veil being torn in two, which may be considered at least suggestive. All three synoptics also refer to the darkness. John’s account passes over these events. A resurrection after-shock provides a naturalistic explanation of a sealed rock being hurled from the tomb entrance. Boulders  are commonly hurled from rock faces because of the emerging P wave, and they may be tossed some tens of metres or more. That Matthew ascribes it to an angel suits his purpose of indicating some divine intervention. Some might ascribe the “angels” to the early perception of the Shroud body images, as does De Wesselow for instance. \nThe paper’s authors, as does Jones, become fixed on significant earthquakes said to have occurred in 33AD. They do not look further afield into the possibly more accurate dates of earthquakes occuring around April 7, 30AD.  Nevertheless, it is quite likely that such an earthquake might have gone quite unnoticed elsewhere, as it probably does not require such a major earthquake to produce the events reported in the gospel accounts.  Even a moderate earthquake could release sufficient radon to be an issue in producing the Shroud image, as De Liso has indicated from her moderate seismic region of Piedmont. \nNo recorded earthquake has ever been credited with modifying C14 dating of any known artifact or other object.\n\n","date":"February 17, 2014 at 3:59 pm","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-80107","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"Ooh! How very dare you! Only this afternoon Tideswell in Derbyshire was rocked to its foundations by a 1km deep Magnitude 1.0 shudder that sent pencils balanced on their points tumbling to the tabletop…\n\n","date":"February 17, 2014 at 4:18 pm","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-80108","author":"Hugh Farey","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"Hugh: It was a passing truck!\n\n","date":"February 17, 2014 at 4:50 pm","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-80118","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"So the evangelical exegete says:\n“It seems likely that all the evidence for an earthquake at the time of the Crucifixion is probably derived from a single source, the Gospel of Matthew.”\nSo why not discard John because he is the only one who gives details about the burial cloths, cited thousands of times by Shroudies? That way we are left to concentrate on “shaking” angels who were probably Quakers, causing the shaking.\nWhat a big fuss about a paper that places so much importance on an earthquake,deviating from the main thrust of the gospels: the resurrected body.\n\n","date":"February 17, 2014 at 9:13 pm","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-80169","author":"Louis","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"Louis: The subject of this web-site is the Shroud of Turin. The resurrection may be germane to this subject, but not necessarily so, but that depends on particular points of view as to the cause of the image, and how the image may relate to the resurrection.  The authors of the paper have come up with highly contentious and speculative assertions concerning the Shroud, and in my view there has also been much ensuing uninformed comment, including that by Stephen Jones, Joel Achenbach, and by correspondents. There has been considerable publicity about the paper, tending to bring serious Shroud research into some disrepute. I for one shall not allow uninformed comment or highly publicised contentious viewpoints to pass by me without attempting some correction to the course of discussions, particularly when I have some knowledge of the particular topic.\n\n","date":"February 17, 2014 at 10:10 pm","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-80184","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"Daveb, your summary is well expressed, it is something very easy to agree with and you have also correctly pointed out that the paper can bring serious Shroud research into some disrepute. If you add this to the uninformed comment to which you have also drawn attention, then it is obvious that the matter becomes worse.\nOne does not need to be an exegete, amateur or professional, to grasp the fact that there is convergence in the four gospels and it is precisely this that gave impetus to the Jesus movement, so there is no point in reading one gospel or the other in isolation if a complete picture of what exactly happened is to be obtained. \nThe Jesus movement that was to become the Church as we understand it now did not have any written tradition initially, it was probably a strong oral tradition maintained by conviction, healing and curing activity (admitted even by the Talmud). It was an unique community, open to Jew and Gentile, able to impress those who were not members. Is is too much to say that if it were not for this there would be no catacombs, no pagan Constantine to convert, no Council of Nicaea, no Christianity?\n\n","date":"February 18, 2014 at 10:40 am","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-80342","author":"Louis","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"Louis may have a point. Mark has a very ordinary description of the events surrounding the resurrection. Slight surprise that the stone had been rolled back, but just a man in a white robe sitting inside. Nothing about grave cloths as if there was nothing special about them . Matthew has an earthquake to move the stone, and the man is as brilliant as lightning, but nothing special about the cloths. Luke omits the earthquake, but doubles the man, and does mention the grave cloths. John’s account, of course, comes from quite a different tradition and is both more detailed and slightly contradictory. Which of these details to accept as an (as least as it was known to the authors) account of what was actually seen, and which as theological or literary embellishments, or whether they all have to be accepted as Gospel (oops!) is a matter of some debate, I believe. Whether the man/men in white were actually there at all, were ordinary humans in white clothes, or were supernaturally glowing spirits is a matter of controversy, as is how and why the blocking stone was rolled away, who went where at what time and saw what, and whether the grave clothes are important.\nNo doubt Stephen Jones would be able to pronounce with his impeturbable authority that “Christians believe….” such and such, but I think current theology is much more nuanced and variously interpretative.\n\n","date":"February 18, 2014 at 5:50 am","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-80287","author":"Hugh Farey","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"Hugh, you dont have to “oops” anything. This is what you expect from an eyewitness account. If the gospels were perfectly matching skeptics would probably be attacking them because they were too perfect, too polished. Imagine if you rush to the hospital because someone told you that your best friend who died 2 days ago was miraculously breathing today. You rush to the ICU and there he was, standing next to his bed, now do you remember what the man who opened the door looked like or who else was in the room or what was written on the sign outside the door. And if you do remember all these things will your wife who came rushing with you remember the same details. What you see in the Gospels is just that, but they do concur on the basic foundations (the Gospel):\n1- Jesus was dead and buried.\n2- 3days later the stone was not blocking access to the tomb anymore.\n3–the tomb was empty.\n4- Jesus was alive.\n5- there was men/angels in/near the tomb.\nMark’s Gospel is always fast paced..not much attention to details, full of actions and miracles. That’s how he wrote, doesnt mean those details didn’t happen. On the contrast, John always had a thing for details, remember he was the only direct eyewitness to those events.\nJesus multiplied five BARLEY loaves (John 6:9)\nDistance rowed….TWENTY FIVE OR THIRTY STADIA,” John 6:19)\nthe ODOUR FILLED the house (John 12:3).\nThe weight of spices brought to Jesus’ tomb as about a HUNDRED pounds (John 19:39).\nSIX stone jars….filled TO THE BRIM (John 2:9).\nthe number of fish caught ONE HUNDRED AND FIFTY THREE….etc.\nRemember also John wrote much later than the Synoptics, probably motivated by the information he had and felt he has more than what people were circulating to tell.. So that’s why it looks at the Gospels from a totally different angle, complementary rather than contradictory.\n\n","date":"February 18, 2014 at 8:58 pm","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-80466","author":"Mike M","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"Hugh has correctly drawn our attention to the old controversy about differences in the gospel narratives and one must add that there are differing Christologies as well. So if it comes to what “Christians believe” perhaps it could be stated in a few words:\na) Christians are taught about the pre-existence of the Word and the Incarnation, kerygma that is said to have begun shorty after the Resurrection\nb) That is in harmony with the fact that not only did Jesus present himself as someone other than the rest of contemporary teachers and prophets of old, he also spoke of himself as someone other than the rest of mankind\nc)The NT data leads us to understand that Jesus was aware that he was related in a unique way to to Yahveh, whom he even addressed as “abba” (something like “‘daddy” in Aramaic).\nd) There is high Christology in John, but the other gospels do not fail to be implicit about Jesus’ uniqueness\ne) Therefore Christians must reckon with what C.S.Lewis wrote : Either Jesus was Mad or he was God.   \nAs for the current theology Hugh writes about, one has the feeling that many theologians  need to pray for inspiration, just like those artists before they begin to paint icons. Having read the Belgian Jesuit Jacques Dupuis many years ago ( in fact, went for Benediction where he appeared carrying a chalice, not a monstrance) and seen developments such as those proposed by the Swiss priest Hans Küng or by laymen such as the Goan Professor Gavin D’Costa (Department of Theology,University of Bristol, advisor to both Catholic and Anglican Churches in England) the only conclusion that can be reached is that the future lies in the science-theology dialogue.\n\n","date":"February 18, 2014 at 11:42 am","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-80358","author":"Louis","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"I agree about the obvious fact :\n“The subject of this web-site is the Shroud of Turin” !\n… and perhaps the geological activities and the Body Image Formation\nare not well connected…\nSee also : the lack of discussion in this blog about the SSNDT\nand the advanced controls (SPM analyses, AFM bending tests, etc.)\nabout linen fibrils, etc. … \nThere are a lot of other intersting things when we want\nto open a discussion about the Shroud …\nFor example :\n… In my opinion, you have to read an italian book in order to improve\nyour knowledges.\nHere the title : “Bit Bang. La nascita della filosofia digitale”\nby\nGiuseppe O. Longo e Andrea Vaccaro.\n— —\nHere few italian words (with english translation).\nQual è la vera essenza della realtà? …\nWhat is the true essence of reality ? …\nQuesta domanda, che ha inquietato la filosofia sin dal suo primo apparire, ha ricevuto molte risposte …\nThis question, which has disturbed the philosophy since its first appearance, has received many responses …\n… il “bit”, l’unità elementare dell’informazione, diventa il costituente ultimo della realtà, ancora più fondamentale della materia e dell’energia.\n… the “bit”, the basic unit of information, it becomes the ultimate constituent of reality, even the most basic of matter and energy. \nL’universo è un immenso computer che senza sosta calcola se stesso e tutte le proprie componenti: alla sua origine si colloca dunque un vero e proprio “Bit Bang”.\nThe universe is a huge computer that calculates non-stop itself and all its components: its origin is somewhere a real “Bit Bang”. \nA sostegno di questa concezione, gli autori forniscono un’articolata serie di argomenti storici e concettuali e costruiscono un quadro che si configura come una vera e propria filosofia, la “filosofia digitale”. …\nIn support of this view, the authors provide a comprehensive range of historical topics and concepts, and build a framework that is configured as a real philosophy, the “digital philosophy.” …\n— —\nLink :\nhttp://estropico.blogspot.com/2013/09/bit-bang-la-nascita-della-filosofia.html#ixzz2tgxcKnyX\nIn other words :\nI am curious about the strange speculations around\nthe quantity of Information encoded in that Ancient Linen Sheet …\nand the idea of Resurrection as connected with the concept of  “Bit Bang” (!!??!!)…\nPerhaps going in this direction there is the hope to improve\nthe science-theology dialogue.\nDo you agree or not ?\n— —  — —\nLook at one of Rembrandt’s most puzzling prints,\nas its exact subject is a mystery …\n>It shows an elderly scholar in his study,\ntransfixed by the apparition of a blazing disc of light\nenclosing a series of letters. The scene may represent\nan alchemist, but does not correspond with traditional\nrepresentations of the subject. Although nicknamed\n‘Faust’, it does not accord with any passage in\nMarlowe’s ‘Dr Faustus’. The shining disc also\nremains unexplained, although the letters ‘INRI’\nmatch the inscription placed over Christ’s head\nduring the crucifixion.\nThe scene possibly shows an allegory of faith …\nLink :\nhttp://www.nationalgalleries.org/collection/artists-a-z/R/4413/artist_name/Rembrandt (Rembrandt van Rijn)/record_id/18546\nThe letters surrounding the disc are intended to be indecipherable,\nreminding the learned scholar that human knowledge is limited\nand ambiguous, in contrast with the clarity of divine wisdom … \nWhat is your comment ?\n\n","date":"February 18, 2014 at 1:31 pm","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-80388","author":"piero","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"Thank you Piero: “The letters surrounding the disc are intended to be indecipherable,reminding the learned  scholar that human knowledge is limited and ambiguous, in contrast with the clarity of divine wisdom …\nWhat is your comment ?” \nMy comment is to attend Mass next Sunday, 7th Sun in OT, where you will hear the reading I Cor 3:16-23.  An extract: \n“18Let no one deceive himself. If any one among you considers himself wise in this age, let him become a fool so as to become wise. 19For the wisdom of this world is foolishness in the eyes of God, for it is written:\n“He catches the wise in their own ruses,”\n20 and again:\n“The Lord knows the thoughts of the wise, that they are vain.” ”\nCuriously, our rostered Reader asked me to stand in for him for this reading. The Lord works in mysterious ways his wonders to perform!\n\n","date":"February 18, 2014 at 2:51 pm","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-80406","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"“In that same hour He rejoiced in the Holy Spirit and said, “I thank you, Father, Lord of heaven and earth, that you have hidden these things from the wise and understanding and revealed them to little children; yes, Father, for such was your gracious will.” (Luke 10:21)\n\n","date":"February 18, 2014 at 9:45 pm","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-80474","author":"Mike M","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"I have now had a close look at Rembrandt’s “Faust”. Several of the letters in the disc of light are certainly decipherable, but not all. They appear to be in a type of Roman script, and I made out the word ‘ALGAR’ which seems Arabic. I wonder what Max would make of it.\n\n","date":"February 18, 2014 at 10:01 pm","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-80477","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"I beg your pardon about Rembrandt and\nthe strange (or ambiguous) scene (… an allusion ?).\nI was a bit tired because\nI have followed some ideas (by Aldo Gritti & others)\nabout another mysterious question :\nthe Voynich manuscript (VMS was radiocarbon dated ) !\nNow : no fanciful speculations on forgery by Wilfried Voynich\nor Rosicrucians & Nostradamus, etc. …\nSorry …\n— —\nI have found a reference about\nthe 14C test for Voynich manuscript (= VMS).\nLink :\nhttp://www.edithsherwood.com/radiocarbon_dating_statistics_part2/index.php\n>The non linearity of the tree calibration curve,\nwhether exascerbated by SCD or not, influences\nthe magnitude of the 1 and 2 SD estimates of\nthe calendar year errors. \n>Table 1 below, gives additional examples of the problems\nthat result when the 1 and 2 SD ranges about an\nestimated mean 14C BP age are used to determine\ncalendar age ranges from the tree ring calibration curve.\n>All the parchment samples are from the Beinecke Library\nand were analyzed by the U. of Arizona. The ages of\nsamples (1-4) are known, the Vinland map has been\ndated to ~1434. The data from which this table was\nconstructed came from Table 2 in\nhttp://www.webexhibits.org/vinland/paper-donahue02.html\n(= Determination of the Radiocarbon Age of Parchment of the Vinland Map\nD J Donahue, J S Olin, G Harbottle)\n—- —-\nNow …\nI hope to receive an interesting answer\nabout the exact meaning of :\ncalibration, one sigma and two sigma … !\n— —\n\n","date":"February 19, 2014 at 1:45 pm","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-80641","author":"piero","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"I forgot to write (into the previous text) an “interesting keyword” :\n“computed laminography” …\nDo you know that particular technique ?\n\n","date":"February 19, 2014 at 1:48 pm","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-80642","author":"piero","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"I have tried to read somenthing abou\nthe laminography… and …\nI have found the study :\nLaminographic imaging using synchrotron radiation –\nchallenges and opportunities\nby\nLukas Helfen, Feng Xu, Heikki Suhonen, Peter Cloetens, TiloBaumbach\nunder the address ;\nhttp://iopscience.iop.org/1742-6596/425/19/192025/pdf/1742-6596_425_19_192025.pdf\nHere an excerpt from the Abstract :\n>Synchrotron-radiation computed laminography (SRCL) was developed\nas a nondestructive three-dimensional (3D) imaging technique\nfor flat and laterally extended objects.\n>Complementing the established method of computed tomography,\nSRCL is based on the inclination of the tomographic axis\nwith respect to the incident x-ray beam by a defined angle.\n>Its ability for 3D imaging of regions of interest in flat specimens\nwas demonstrated in various fields of investigation, e.g. in\nnondestructive testing, material science and life sciences. … …\nHere another version of the study :\nNano-laminography for three-dimensional\nhigh-resolution imaging of flat specimens\nby\nL. Helfen, F. Xu, H. Suhonen,  L. Urbanelli, P. Cloetens and T. Baumbach\nLink :\nhttp://iopscience.iop.org/1748-0221/8/05/C05006/pdf/1748-0221_8_05_C05006.pdf?origin=publication_detail\nSee also :\nNano-laminography inspection (X-ray) and parchments\n— —\nThere is another study :\nPhase contrast laminography based on Talbot interferometry\nby Venera Altapova, Lukas Helfen, Anton Myagotin,\nDaniel Hänschke, Julian Moosmann, Jan Gunneweg, and Tilo Baumbach\nAbstract\nSynchrotron laminography is combined with Talbot grating interferometry to address weakly absorbing specimens. Integrating both methods into one set-up provides a powerful x-ray diagnostical technique for multiple contrast screening of macroscopically large flat specimen and a subsequent non-destructive three-dimensional (3-D) inspection of regions of interest. The technique simultaneously yields the reconstruction of the 3-D absorption, phase, and the so-called dark-field contrast maps. We report on the theoretical and instrumental implementation of of this novel technique. Its broad application potential is exemplarily demonstrated for the field of cultural heritage, namely study of the historical Dead Sea parchment.\nUnder :\nhttp://www.opticsinfobase.org/view_article.cfm?gotourl=http%3A%2F%2Fwww%2Eopticsinfobase%2Eorg%2FDirectPDFAccess%2F1C13568C%2DE0A8%2D14E0%2DFA1122812ECC863D%5F229750%2Foe%2D20%2D6%2D6496%2Epdf%3Fda%3D1%26id%3D229750%26seq%3D0%26mobile%3Dno&org=\nYou can read the same study  :\nPhase contrast laminography based on Talbot interferometry\nCopyright 2012 Optical Society of America\nSee also :\nB.M. Murphy, M. Cotte, M. Mueller, M. Balla and J. Gunneweg,\n“Degradation of parchment and ink of the Dead Sea scrolls investigated using synchrotron-based X-ray and infrared microscopy, in Holistic Qumran,”\nin Holistic Qumran,\nJ. Gunneweg, A. Adriaens and J. Dik, eds. (Brill Leiden, 2010), pp. 77–98.\n\n","date":"February 20, 2014 at 10:12 am","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-80877","author":"piero","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"First of all :\n“About” and not “abou” !!!\nI beg pardon …\nHere another reference :\nDevelopment and trends in synchrotron studies of ancient and historical materials\nLoïc Bertrand, Marine Cotte, Marco Stampanoni,  Mathieu Thoury  Federica Marone  Sebastian Schöder\nAbstract :\n>Synchrotron photon-based methods are increasingly being used for the physico-chemical study of ancient and historical materials (archaeology, palaeontology, conservation sciences, palaeo-environments). In particular, parameters such as the high photon flux, the small source size and the low divergence attained at the synchrotron make it a very efficient source for a range of advanced spectroscopy and imaging techniques, adapted to the heterogeneity and great complexity of the materials under study. The continuous tunability of the source — its very extended energy distribution over wide energy domains (meV to keV) with a high intensity — is an essential parameter for techniques based on a very fine tuning of the probing energy to reach high chemical sensitivity such as XANES, EXAFS, STXM, UV/VIS spectrometry, etc. The small source size attained (a few micrometres) at least in the vertical plane leads to spatial coherence of the photon beams, giving rise in turn to a series of imaging methods already crucial to the field. This review of the existing literature shows that microfocused hard X-ray spectroscopy (absorption, fluorescence, diffraction), full-field X-ray tomography and infrared spectroscopy are the leading synchrotron techniques in the field, and presents illustrative examples of the study of ancient and historical materials for the various methods. Fast developing analytical modalities in scanning spectroscopy (STXM, macro-XRF scanning) and novel analytical strategies regarding optics, detectors and other instrumental developments are expected to provide major contributions in the years to come. Other energy domains are increasingly being used or considered such as far-infrared and ultraviolet/visible for spectroscopy and imaging. We discuss the main instrumental developments and perspectives, and their impact for the science being made on ancient materials using synchrotron techniques.\n\n","date":"February 20, 2014 at 10:19 am","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-80879","author":"piero","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"Piero: I have read briefly the Donahue radio-carbon dating of the Vinland parchment, it seems to be a well-written professional paper. McCrone seems to have made serious errors in his testing, when declaring the Vinland map a forgery. However despite the dating of the parchment there are still serious questions about the map’s authenticity. Yale remains neutral on the subject and merely consider themselves the guardians of a valuable and controversial manuscript. I have a personal view on it, that there may well be an underlying authenticity of some kind of artifact, but there are still serious questions, that make me wonder if it has been “doctored” to give the impression to make it more impressive than the original might have been. \nConcerning the”sigma”, this is a short-hand for “standard deviation” a measure of the scatter of statistical data. Any stats handbook or elementary text will explain its significance and how it is calculated. A very large number of measurements of the same property of an object will have a scatter which can be expressed as a ‘sigma’. If there more than about 10 measurements then the distribution will approximate to the “normal distribution” and it can be expected that some 95% of the measurements will be within 2 sigma of the mean. If there are fewer than 10 measurements, then the “Students’ t” distribution should be used. If the measurements don’t show this, then we get into the area of Type I and Type II errors, which is explained in the text-books. \nI know little about the techniques of carbon dating, but I believe that “calibration” refers to the modification of the theoretical dating curve (an inverse exponential) because of historic variations of C14 in the atmosphere. One method of calibration is by counting ancient tree rings, and testing the wood for its C14 age, and making the necessary date corrections to obtain a standard curve. Hugh Farey could no doubt explain it better. I don’t know if any of that helps you or not.\n\n","date":"February 19, 2014 at 6:46 pm","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-80708","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"On the contrary, Hugh Farey would find it very difficult to be as clear and succint as the explanation above. However, it is worth looking at a calibration line in some detail. It is quite a jagged, or zig-zag line, so that, for example, a BP date (Before Present, based mathematically on the proportion of C14 remaining) of 620 can mean a calendar date of 1310 AD, 1360 AD or 1385 AD, but not dates in between such as 1335 AD or 1370 AD. This confuses statistical analysis considerably. Four of the twelve radiocarbon dates of the Shroud are of this type.\n\n","date":"February 19, 2014 at 7:42 pm","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-80717","author":"Hugh Farey","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"Thank you for your answers !\nIn the past I have read something on odd-ratio and bookmaker rule …\nSorry…\nAs you have seen I get lost writing something (… of superabundant ?) on laminographic controls (this kind of analyses can be useful in parchement study. See for example  : Dead Sea Scrolls, Voynich manuscript, etc.).\nMy approach is a bit different because I pointed your attention toward the SPM analyses and the SSNDT as reference materials (during the tests).\n— —\nB.T.W. : Last week I I followed a conference centered on a copy (this old parchment was controlled in Italy, by Baraldi …) of Voynich manuscript and the relator didn’t agreed with Aldo Gritti (who pointed the finger on forgery by Voynich) …\n\n","date":"February 21, 2014 at 10:59 am","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-81168","author":"piero","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"I beg your pardon about my errors :\ndouble “I”, parchement instead of parchment …\nIn any case Voynich was an interesting personage …\n\n","date":"February 21, 2014 at 12:22 pm","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-81183","author":"piero","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"To Dave re the enigmatic wording in “the disc of light”:\n  I just happen to read your comment # 22: “I have now had a close look at Rembrandt’s “Faustus”. Several of the letters in the disc of light are certainly decipherable, but not all. They appear to be in a type of Roman script, and I made out the word ‘ALGAR’ which seems Arabic. I wonder what Max would make of it.”\n  Actually and as far as I can see, the Rembrandt etching features a catoptromancic session (from Ancient Greek katoptris, “looking mirror” + manteia, “divination”) with Dr Faust receiving (hand sign pointing to the magic mirror) the vision of a luminous pentacle as a reply to his questioning. \n  In his Dr Faustus scene, the Pentacle magical wording runs on 3 circular lines. It can read either: \nARMTET+ALGAR+ALGASTNA+++\nADAM+TE+DAGERAM+\nor: \nAMRTET+ALGAR+AGLAS+TINAH\nADAM+TE+DAGERAM \n(With each time the letters I N R I and a large X at the very centre).\nIn each case, I can recognize a phonetically gross rendering in Roman script of a magic/cabbalistic formula in Hebrew to be read in conjunction with current Latin tetragram + Greek letter Khi (X):\nAROMA ÆT AL GAR Æ[T] G[ADDOL] L[EOLAM] A[DONAI] HENAH\nADAM ÆT DAG HA-RAM\nIesus Nazarenus Rex Iudaeorium\nX (=Amen in the name of Christ)\n  A distorted magic formula in Hebrew of which basis, according to Butler, is the wording Grillot de Givry chalks round the Pentacle he builds in ‘Strange Conflict’ (Chapter 4 of his ‘Witchcraft, Magic and Alchemy’ translated into English in 1931). De Givry uses different wording in Chapter 25 of his ‘Devil Rides Out’.\n\n","date":"February 25, 2014 at 3:14 pm","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-82422","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"Correction: Chapter 5 of de Givry’s ‘Witchcraft, Magic and Alchemy’\n\n","date":"February 25, 2014 at 3:37 pm","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-82430","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"+ Typo: AMORA in\nAMORA ÆT AL GAR Æ[T] G[ADDOL] L[EOLAM] A[DONAI] HENAH\nADAM ÆT DAG HA-RAM\nIesus Nazarenus Rex Iudaeorium\nX (=Amen in the name of Christ)\n\n","date":"February 25, 2014 at 4:10 pm","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-82437","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"This above in reply to Piero’s comment about what just can and cannot be deciphered: \n“Look at one of Rembrandt’s most puzzling prints,\nas its exact subject is a mystery …\n>It shows an elderly scholar in his study,\ntransfixed by the apparition of a blazing disc of light\nenclosing a series of letters. The scene may represent\nan alchemist, but does not correspond with traditional\nrepresentations of the subject. Although nicknamed\n‘Faust’, it does not accord with any passage in\nMarlowe’s ‘Dr Faustus’. The shining disc also\nremains unexplained, although the letters ‘INRI’\nmatch the inscription placed over Christ’s head\nduring the crucifixion.\nThe scene possibly shows an allegory of faith …\nLink :\nhttp://www.nationalgalleries.org/collection/artists-a-z/R/4413/artist_name/Rembrandt (Rembrandt van Rijn)/record_id/18546\nThe letters surrounding the disc are intended to be indecipherable,\nreminding the learned scholar that human knowledge is limited\nand ambiguous, in contrast with the clarity of divine wisdom …\nWhat is your comment ?”\n\n","date":"February 25, 2014 at 4:18 pm","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-82439","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"The man who transcripted the magic formula in square Hebrew into Roman script had next to no knowledge of written Hebrew.\n\n","date":"February 25, 2014 at 4:30 pm","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-82444","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"End note: the word AL GAR can read as the anagram of GRAAL, “Grail” and wordplays with the Hebrew phrase GAR ÆL, “G.OD DWELLS [IN IT=Chrisit’s body as Temple]/SHINES [FORTH]” (see the Shroud body image luminescent effect). To the spiritual alchemist, Christ is the philosophical stone.\n\n","date":"February 25, 2014 at 4:46 pm","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-82449","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"Thanks Max, I thought you might be able to make something of it. Rembrandt being of the Dutch school, the word GRAAL is an interesting anagram of ALGAR, but a phonetic rendering of the cabalistic formula you mention, would make a lot of sense, and may well have been Rembrandt’s intent.\n\n","date":"February 25, 2014 at 4:55 pm","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-82451","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"Now, (according to me), the very word Alchemy comes from the Arabic Al-Qimyyah, “The Resurrection”.\n\n","date":"February 25, 2014 at 5:08 pm","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-82457","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"Hi Max, Arabic is my mother tongue and I have to disagree with that one.\n alqimyyah means chemistry, alqiamah means the resurrection\n\n","date":"February 27, 2014 at 10:28 pm","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-83239","author":"Mike M","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"Mike, sorry I have to disagree with you, see Surah Al- Qimyyah in  Al Qur’an). It DOES mean “The Resurrection”. Methinks you have to brush up your Arabic.\n\n","date":"February 28, 2014 at 6:55 am","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-83353","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"Mike, sorry again (typing too fast). I made a typo and you made a mistranscription and BOTH confused me.\nThe right word is Al-QiYamah. The fact remains though (in my opinion), the word alchemy derives from the Arabic word.\n\n","date":"February 28, 2014 at 7:22 am","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-83361","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"…Or from both Al-Qimyyah AND Al-Qiyamah (two words with one root)\n\n","date":"February 28, 2014 at 7:33 am","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-83364","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"Hi Max, you are right, I did mistranscribe, you see Arabic letters are very different from English and it goes from right to left. and I probably missed a Y after the i. the right word for resurrection is Al-QiYamah (القيامة). But that proves my point even more. The iY is before the m (م)and when pronounced its very obvious, where Qimyyah (or more likely pronounce Al-Kemiyah)( الكيمياء), the heavy iY or double Y as you wrote it is after the m(م). I lived in Egypt till I was 27 years old. Believe me, I don’t need to brush up on my Arabic. Please try to communicate with somone else who speaks Arabic and they will tell you the same thing.\n\n","date":"February 28, 2014 at 7:37 am","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-83365","author":"Mike M","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"The two Arabic words shall be read in the light of the Chinese “Qi word”.\n\n","date":"February 28, 2014 at 7:41 am","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-83367","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"M-W entrance for alchemy:\nMiddle English alkamie, alquemie, from Middle French or Medieval Latin; Middle French alkimie, from Medieval Latin alchymia, from Arabic al-kīmiyā’, from al the + kīmiyā’ alchemy, from Late Greek chēmeia\nIts pronounced differently. You see it’s a k not a Q. They are not the same root.\n\n","date":"February 28, 2014 at 7:42 am","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-83369","author":"Mike M","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"The very word khem or country of Chem (see the Holy Bible) can also be understood as a wordplay on Shem, “[the] Name” ie G.od.\nHence to the mystical quester, the very word alchemy could refer to G.od’s Resurrection = Christ’s as Opera Magna = OM (see Sanskrit OM)\n\n","date":"February 28, 2014 at 9:26 am","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-83400","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"Resurrection root in Arabic is from (قام) which is a verb meaning to stand up. The root of alchemy is the (كيمياء) which means chemistry\n\n","date":"February 28, 2014 at 7:48 am","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-83371","author":"Mike M","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"Etymologically speaking, it comes from the Aramaic Qam.\n\n","date":"February 28, 2014 at 8:03 am","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-83375","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"Mike, don’t you make too much of it. Initially, it was just a typo of mine and a mistranscription of yours. Nothing else.\n\n","date":"February 28, 2014 at 8:07 am","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-83376","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"Max, I am not making too much of it. I really admire what you do in this blog, especially with ancient text. But I thought I need to point this out because I know it’s wrong.\n\n","date":"February 28, 2014 at 8:18 am","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-83377","author":"Mike M","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"Stricto sensu (كيمياء) is not the root but the three letters kaf-mim-alef are. BTW, the word kimya (كيمياء) is Egyptian for “black earth”.\n\n","date":"February 28, 2014 at 8:29 am","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-83380","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"Yeah, I am sorry. I know that كيمياء in Arabic means chemistry. I didn’t know the ancient Egyptian root for it. But it is still not resurrection which stems from “standing up” in Arabic\n\n","date":"February 28, 2014 at 9:05 am","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-83390","author":"Mike M","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"Mike you first wrote # 39: “alqimyyah means chemistry” (with a “q”  not a “k”) and then you wrote #46: “The root of alchemy is the (كيمياء) which means chemistry (with a “k”). This is rather confusing.\nDon’t you misunderstand me. Methinks (كيمياء) ‘kimyâ’ just means “woman from The Black Country”. It derives from ‘khem,’ “the black country” to designate Egypt. The Egyptian woman is just an allegory for Alchemy. Another etymology traces the word back to the Greek ‘chyma,’ “to fuse or cast metal.\nMy personal opinion is  the word alchemy was coined from merging BOTH the Arabic word Al-Qiyamah, “The Resurrection” AND the Egyptian word kimyâ, “Woman from the Black Country” (to be understood in the light of the cult of Black Virgins). Hence the neologism [Al-Qimyyah] (written with a “Q” not a “K”) as the most likely etymology for the word Alchemy.\n\n","date":"February 28, 2014 at 9:16 am","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-83394","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"Max, the first time I wrote with a Q because I just copied the word from your post. I thought it would end there, but you went deeper and that’s when I had to invoke the difference between K (ك) and Q (ق) in Arabic. I think the Etymology of Alchemy is based, as you mentioned, the Arabic word (الکیمیاء) Kimya meaning chemistry, without the need to merg it with (القيامة) arabic for resurrection (from the root of standing up) which I find to be very different in pronunciation. But really this is just my opinion based on my knowledge of Arabic ( being my mother tongue) I am not an expert in this.\n\n","date":"February 28, 2014 at 8:32 pm","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-83595","author":"Mike M","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"When Jim Caviezel was playing Jesus during the Sermon of the Mount scene in the “Passion of the Christ” there was no earthquake, but lightning struck him. See No.6 in today’s news:\nhttp://movies.yahoo.com/blogs/movie-news/10-things-might-not-known-passion-christ-011942797.html\n\n","date":"February 25, 2014 at 6:06 pm","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-82476","author":"Louis","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"Addendum re Faustus in his Study’s (deliberately?) faulty transcription in Roman script of the cabalistic formula in Hebrew of the Pentacle of Axis Mundi (as epitome of Mystical Knowledge):\nHere is the best alternative to its reconstruction: \nAMORA ÆT GAR ÆL ÆT G[ADOL] L[EOLAM] A[DONAI] HINNEH\nADAM Æ[LEF]T[AV] DAG HA-RAM\nIesus Nazarenus Rex Iudaeorium\nX (=Amen in the name of Christ) \nAnd its translation: \n“Here is the Grail/Tabernacle/Holy of Holies’ Speaker of G.od The Great to Eternity\n[Here is the] AlphaOmega/Accomplished Man, [the] Exalted Ichthus/Yeshua the Messiah Son of G.od Saviour\nYeshua the Hidden [Prince] King of the Judeans\nAmen”\n\n","date":"February 26, 2014 at 3:34 pm","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-82793","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"Typo (translation, 1st sentence):\nHere is G.od-The-Great-To-Eternity’s speaker of the Grail/Tabernacle/Holy of Holies\n\n","date":"February 27, 2014 at 3:04 pm","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-83133","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"Alchemically speaking, INRI can also read Igne Natura Renovatur Integra (Latin) By Fire Nature is Restored in Purity, or Pure Matter is Restored by Spirit\n\n","date":"February 27, 2014 at 3:13 pm","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-83136","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"Fire is seen as an important purifying element in classical Zorastrianism. I suspect Alchemy was  diverse and eclectic in drawing on its resources. I wonder how much Rembrandt knew about it for his inspiration of the picture.\n\n","date":"February 27, 2014 at 4:50 pm","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-83167","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Whole Lot of Shaking Going On in Jerusalem in 33AD?","post":"Basically in his etching, Rembrandt translates material alchemy VS spiritual alchemy in terms of darkness and lig\n\n","date":"February 28, 2014 at 7:00 am","url":"https://shroudstory.com/2014/02/17/whole-lot-of-shaking-going-on-in-jerusalem-in-33ad/","cat":"news_&_views","id":"comment-83355","author":"Max Patrick Hamon","site":"shroudstory"}]
