[{"title":"William of Ockham probably thought of this too.","post":"She is right. Belief structures can become uncomfortable when challenged, so generally people prefer to leave things as they are, it is more convenient and also practical perhaps. After all, a lot of what goes on in the world is make believe.\n\n","date":"September 8, 2014 at 12:04 pm","url":"https://shroudstory.com/2014/09/08/william-of-ockham-probably-thought-of-this-too/","cat":"news_&_views","id":"comment-149463","author":"Louis","site":"shroudstory"},{"title":"William of Ockham probably thought of this too.","post":"As philosopher Peter Kreeft, who moved from Calvinism to Catholicism, wrote, the problem of evil is the most serious problem in the world. One could add that this is precisely why it does not “snap easily into our belief structures”, it is simply swept under the rug because the “sense of comfort, familiarity, trust” has to prevail.\nThe problem is also precisely what led to the break between C. G. Jung and the American Dominican, Father Victor White, at Blackfriars, Oxford. Jung’s hope that White would be his successor disappeared, but the spiritual bond between them was not broken. Needless to say, both had faith. Kreeft’s writings also lead to the understanding of how faith is important and even Jung was glad when he received spiritual help. He was very fond of Father White, who was his closest friend, but the priest had died from injuries after a motorcycle accident. An English nun helped him.\nhttps://www.academia.edu/7344691/C._G._Jung_Father_Victor_White_and_privatio_boni\n\n","date":"September 8, 2014 at 2:47 pm","url":"https://shroudstory.com/2014/09/08/william-of-ockham-probably-thought-of-this-too/","cat":"news_&_views","id":"comment-149479","author":"Louis","site":"shroudstory"},{"title":"William of Ockham probably thought of this too.","post":"Good things happen from time to time. Here we have another effort to patch up differences, with Anglicans and Catholics together at the reburial of King Richard III:\nhttp://www.catholicherald.co.uk/news/2014/09/08/cardinal-to-preach-at-anglican-cathedral-before-remains-of-richard-iii/\n\n","date":"September 9, 2014 at 8:44 am","url":"https://shroudstory.com/2014/09/08/william-of-ockham-probably-thought-of-this-too/","cat":"news_&_views","id":"comment-149644","author":"Louis","site":"shroudstory"},{"title":"William of Ockham probably thought of this too.","post":"Jackie Kennedy had a big problem with existing belief structure after John F. Kennedy’s assassination but she ultimately regained her faith:\nhttp://www.catholicherald.co.uk/news/2014/09/08/jackie-kennedys-letters-to-priests-handed-over-to-kennedy-family/\n\n","date":"September 9, 2014 at 7:19 pm","url":"https://shroudstory.com/2014/09/08/william-of-ockham-probably-thought-of-this-too/","cat":"news_&_views","id":"comment-149744","author":"Louis","site":"shroudstory"}]
