[{"title":"Ye shall know them by their photographs","post":"Anyone can see clearly by the Church’s statements they have no stated an official position in verbiage.  Yet this reader clearly sees that this is not the only way to express the Church’s beliefs.  Hence this observation is consistent with all Catholic teaching.  Belief and prayer go hand-in-hand.  Yet the Shroud is unnecessary for the faith of the Church, but it is a supplement.  In the Shroud we see the gospels in the image itself, a kind of visual gospel.\n\n","date":"April 22, 2015 at 7:11 am","url":"https://shroudstory.com/2015/04/22/ye-shall-know-them-by-their-photographs/","cat":"2015","id":"comment-197166","author":"Andy","site":"shroudstory"},{"title":"Ye shall know them by their photographs","post":"Not exactly true, Andy, about an official position. Who cares that some Vatican bureaucrats have not stated a position, when the Popes have in fact been clear:\nPope Pius XI (1922-1939):  “… certainly not the work of any human hand.”\nPope Pius XII (1939-1958):  “The linen in which Joseph of Arimathea enveloped the sacred remains of our Lord Jesus Christ.”\nPope John XXIII (1958-63):  “This can only be the Lord’s own doing.”\nPope Paul VI (1963-78):  “…The image from the Holy Shroud reveals to us the human and divine personality of Christ.”\nPope John Paul II (1978-2005): “The Holy Shroud is the most splendid relic of the Passion and Resurrection.”\nPope Benedict XVI (2005-2013):  “… a photographic document of the darkest mystery of faith — that of Christ’s Crucifixion and Resurrection.”\nPope Francis I (2013- ):  “By means of the Holy Shroud, the unique and supreme Word of God comes to us”\n\n","date":"April 22, 2015 at 7:53 am","url":"https://shroudstory.com/2015/04/22/ye-shall-know-them-by-their-photographs/","cat":"2015","id":"comment-197172","author":"Nabber","site":"shroudstory"},{"title":"Ye shall know them by their photographs","post":"I don’t think that if you don’t know whether the Shroud is authentic or not, it is duplicitous or two-faced to say so. Even if the Catholic church were convinced that the Shroud was a fake, she would surely still recognise it as a remarkable artefact, and well worth the respect shown to it. It might not be quite so surrounded by candles and incense, but, as it stands, not knowing one way or the other, it is best to be on the more respectful side. If I had a painting I thought might be a Picasso but might not, I wouldn’t relegate it to a dusty corner, I’d look after it carefully, just in case. Stephen Jones’s “the Vatican clearly does believe that the Shroud is authentic, so it should say so” is a personal opinion, not a fact. Many people have the opposite opinion. I think the church says what it means.\n\n","date":"April 22, 2015 at 2:09 pm","url":"https://shroudstory.com/2015/04/22/ye-shall-know-them-by-their-photographs/","cat":"2015","id":"comment-197222","author":"Hugh Farey","site":"shroudstory"},{"title":"Ye shall know them by their photographs","post":"I think the Popes say what they mean.  “The Vatican” says all kinds of things, some of which it retracts a few weeks later….\n\n","date":"April 23, 2015 at 7:36 am","url":"https://shroudstory.com/2015/04/22/ye-shall-know-them-by-their-photographs/","cat":"2015","id":"comment-197295","author":"Nabber","site":"shroudstory"}]
