[{"title":"Yeah, right!","post":"My guess is that Fanti is making the same mistake as Tristan Casablanca about the Resurrection of Jesus. It is both an historical event and an object of faith. The followers of Jesus swore up and down that He appeared to them after he died. They went on to found the Catholic Church, which gave us Western civilization. Atheists Marcos Borg and John Dominic Crossan trace the tradition of the Easter experience to within a few years of the crucifixion, but they don’t believe Jesus is alive in a new life with God. \nOne of the reasons I do believe is that the likes of Borg and Crossan don’t understand the cosmological argument for God’s existence. They fail in this area on the level of intelligence, not reflective judgment. Instead of giving them the gift of faith, God gave them a situational neurosis.\n\n","date":"April 13, 2013 at 9:46 am","url":"https://shroudstory.com/2013/04/13/yeah-right/","cat":"news_&_views","id":"comment-30603","author":"David Roemer","site":"shroudstory"},{"title":"Yeah, right!","post":"Borg and Crossan are not atheists. For both of them it is a matter of faith only. They don’t find sufficient objective, historical evidence. They are honest historians. Borg is Lutheran and married to an Episcopal priest. Crossan is a former Catholic priest, now married and very much still a Christian. After leaving the priesthood he taught at DePaul, the largest Catholic University in America for nearly 25 years\n\n","date":"April 13, 2013 at 4:01 pm","url":"https://shroudstory.com/2013/04/13/yeah-right/","cat":"news_&_views","id":"comment-30636","author":"Frank Ly","site":"shroudstory"},{"title":"Yeah, right!","post":"Borg and Crossan think that believing in life after death is irrational, which is my definition of an atheist. They are liberal Christians who feel that saying God doesn’t exist is too negative and does not express their compassion for their fellow human beings. The following quote is from Borg:\n“I was experiencing a collision between the modern worldview and my childhood beliefs. The modern worldview, with its image of what is real as the world of matter and energy and its vision of the universe as a closed system of cause and effect, made belief in God—a nonmaterial reality—increasingly problematic. I had entered the stage of critical thinking, and there was no way back.” (Borg, Marcus J., Meeting Jesus Again for the First Time: The Historical Jesus & the Heart of Contemporary Faith, 1994, p. 7)\n\n","date":"April 13, 2013 at 9:50 pm","url":"https://shroudstory.com/2013/04/13/yeah-right/","cat":"news_&_views","id":"comment-30692","author":"David Roemer","site":"shroudstory"},{"title":"Yeah, right!","post":"Crossan has identified himself as an atheist in the past. See Paul Copan, ed., Will The Real Jesus Please Stand Up? (Grand Rapids, Michigan: Baker Books, 1998), 49-51. In a debate on Jesus’ resurrection with William Lane Craig, Crossan was asked by Craig whether God existed before humans came into existence. Crossan eventually answered, “Well, I would probably prefer to say no” (51). He seems to view God as some sort of figment of the human imagination. Thus, God didn’t exist before humans did. He can claim to believe in God only by defining God differently than the term is usually defined.\nI recently heard that Borg has identified himself as an atheist in some manner. I don’t know whether that’s true, and I haven’t come across any confirmation yet.\nRegardless, both men are radically liberal and wrong on a lot of significant issues.\n\n","date":"April 14, 2013 at 4:42 pm","url":"https://shroudstory.com/2013/04/13/yeah-right/","cat":"news_&_views","id":"comment-30799","author":"Jason Engwer","site":"shroudstory"},{"title":"Yeah, right!","post":"I don’t believe God deals out situational neuroses.  Crossan continues to be highly respected among a wide range of theological authorities. Borg is another matter, an extreme liberal, and a fellow of the so-called “Jesus Seminar”.\n\n","date":"April 13, 2013 at 4:35 pm","url":"https://shroudstory.com/2013/04/13/yeah-right/","cat":"news_&_views","id":"comment-30655","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Yeah, right!","post":"Borg and Marcus co-authored a book about Christmas saying that there is no life after death. Liberal Christians that they are, all they care about is the “good of humanity,” not getting into Heaven. There is no difference between them and Richard Dawkins. This quote summarizes the point of their book: \n“It is not accurate to distinguish the imperial kingdom of Rome from the eschatological kingdom of God by claiming one is earthly the other heavenly, one is evil the other holy, or one is demonic the other sublime. That is simply name-calling. Both come to us with divine credentials for the good of humanity. They are two alternative transcendental visions. Empire promises peace through violent force. Eschaton promises peace through nonviolent justice.…That clash of visionary programs for our earth is the context and matrix for those Christmas stories, and they proclaim God’s peace through justice over against Rome’s peace through victory.” (The Frist Christmas: What the Gospels Really Teach About Jesus’s Birth, p.75)\n\n","date":"April 13, 2013 at 10:35 pm","url":"https://shroudstory.com/2013/04/13/yeah-right/","cat":"news_&_views","id":"comment-30697","author":"David Roemer","site":"shroudstory"},{"title":"Yeah, right!","post":"In the end, you know what I think about Jesus?  Even if the Resurrection story would have been made up by the disciples (I don’t believe it, but let’s assume that it’s true and let’s assume we would find solid proofs of this), for me, that wouldn’t change much for my faith…  You know why?  Simply because I would still believe in the God revealed by Jesus, which is the Merciful and Loving Father who desperately wants that all his children – not just the Christians – end up in his Eternal Kingdom of Love and Peace!!!\nAnd consequently, even if Jesus Resurrection story would have been made up (again, I don’t believe it), I would still believe that he, like anyone else, his now resurrected and fully happy in the Father’s Kingdom!\n\n","date":"April 14, 2013 at 6:15 pm","url":"https://shroudstory.com/2013/04/13/yeah-right/","cat":"news_&_views","id":"comment-30809","author":"Yannick Clément","site":"shroudstory"},{"title":"Yeah, right!","post":"If you don’t believe in life after death, you should keep it to yourself. People who think life ends in the grave are prone to believe in irrational things (socialism, racism, imperialism, eugenics)  and to behave immorally. The idea that you can substitute believing in “peace on Earth and goodwill towards men” for fear of God is nonsense.\n\n","date":"April 14, 2013 at 8:33 pm","url":"https://shroudstory.com/2013/04/13/yeah-right/","cat":"news_&_views","id":"comment-30818","author":"David Roemer","site":"shroudstory"},{"title":"Yeah, right!","post":"You didn’t understand one damn word of what I said.  I said that even if the account of Jesus Resurrection would be an invention, I would still believe in the Father and his Kingdom that he preached in the Gospels.  In other words, Resurrected Christ or not, the God of Jesus is real!\nOh, by the way, look at all the pedophilia scandals done by Clergymen in the Church and you’ll see that anyone, believers in Christ or not, can act very immorally!  Look also at all the bad things done during the crusades by Christians, during the witch hunt in the Middle ages, etc., etc.\nDon’t you understand that we’re all sinners and we must all be saved and forgiven by God?  Christians are no better or have no more value in the eyes of the God of Jesus than any other person, whether it be a Muslim, a Jew, a Buddhist or an atheist, because, as Jesus told us :  We all have the same Father in Heaven and we’re ALL brothers and sisters, spiritually.\nIn the end, what I say is this:  The loving and merciful Father revealed by Jesus is real and that’s good enough for me!  I know he will never let me down (in this life and also in the next one, no matter the good and the bad things I will have done here on Earth).  That’s my belief.\n\n","date":"April 14, 2013 at 8:50 pm","url":"https://shroudstory.com/2013/04/13/yeah-right/","cat":"news_&_views","id":"comment-30820","author":"Yannick Clément","site":"shroudstory"},{"title":"Yeah, right!","post":"David, regarding Borg and Crossan, read Professor Luke Timothy Johnson’s wonderful book “The Real Jesus”, written for a popular audience but with great arguments. You will enjoy it.\n\n","date":"April 14, 2013 at 6:35 pm","url":"https://shroudstory.com/2013/04/13/yeah-right/","cat":"news_&_views","id":"comment-30811","author":"Louis","site":"shroudstory"},{"title":"Yeah, right!","post":"Dear Yannick,\nI’m glad to see you believe in life after death. Your previous post spoke only of “love and peace.” I have no criticisms of other religions and even people who don’t believe. My criticism is directed against those who think belief in life after death is irrational. They tend to be unintelligent about the mind-body problem, ignorant of the proof of God’s existence, and irrational about the meaning of life.\n\n","date":"April 14, 2013 at 9:22 pm","url":"https://shroudstory.com/2013/04/13/yeah-right/","cat":"news_&_views","id":"comment-30822","author":"David Roemer","site":"shroudstory"},{"title":"Yeah, right!","post":"David, I even believe in the Resurrection of Jesus (as I even said in my first post!).  And for those who are stuck to our material world and who are not able or do not want (for various reasons) to believe in a life after death, my advice to you is simple :  let them think what they think !  It’s not important.  What matters is what you believe personally.  And be sure of one thing:  God love even those who don’t believe in an eternal life and he will freely gave them this life after death because he love them as much as you and me…  Concentrate on the truth that is in you my friend!\n\n","date":"April 15, 2013 at 8:33 am","url":"https://shroudstory.com/2013/04/13/yeah-right/","cat":"news_&_views","id":"comment-30860","author":"Yannick Clément","site":"shroudstory"},{"title":"Yeah, right!","post":"In the Catholic faith, to be saved you have to believe AND profess your faith. Believing is not enough.\n\n","date":"April 15, 2013 at 8:40 am","url":"https://shroudstory.com/2013/04/13/yeah-right/","cat":"news_&_views","id":"comment-30862","author":"David Roemer","site":"shroudstory"},{"title":"Yeah, right!","post":"The Father don’t care one bit if you believe in him or not.  All he care is what you are :  his beloved children.\nThe God of Jesus don’t make any category like we always do!  It is the disciples of Jesus (including the ones who wrote the Gospels) who wanted to make believe that, to be saved, you had to believe in Jesus.  This can be understood easily if you replace things in the proper historical context of the communities to which these texts were written.  The first purpose of the Gospels was not to convert people but to encourage the new convert to keep their faith in Christ, no matter the difficulties they add to endure.  In that context, it is understandable that the Gospel writers put words in Jesus mouth (like in the chapter 3 of St John) and made him say things like :  to be saved, you must believe in the Son of Man and things like that.  The purpose of this was to encourage the Christians to keep their faith at all cost because the first disciples of Jesus knew that this was the best way for hapiness! \nBut if the God of Jesus would really act like that and only wanted to save those who believe in him or in his son, he would not be Love at all and, in truth, he would just be like anyone of us, i.e. a poor human being.  Not great!  I believe in a God who is a God of love and who don’t think and act like us (i.e. who don’t make any category of humans and who only care about the fact that we all are his beloved children).  To me, that’s the real God of Jesus.  And to be saved, the only thing you must have is the will to be happy, because God is hapiness in person and love everyone of us.  Don’t you believe that we all have the same father in heaven whos is love and we’re all brothers and sisters?  If that’s true, then that mean that God will never accept to lose one single of his beloved children and will do anything he can to save us all.  Read carefully the parable of the lost sheep in St Luke and you’ll understand what I mean.  Peace to you!\n\n","date":"April 15, 2013 at 9:28 am","url":"https://shroudstory.com/2013/04/13/yeah-right/","cat":"news_&_views","id":"comment-30867","author":"Yannick Clément","site":"shroudstory"},{"title":"Yeah, right!","post":"We are not guaranteed salvation when we die. It is something to hope for with “fear and trembling.” We have to reckon with the possibility that someone can totally reject God.\n\n","date":"April 15, 2013 at 9:56 am","url":"https://shroudstory.com/2013/04/13/yeah-right/","cat":"news_&_views","id":"comment-30869","author":"David Roemer","site":"shroudstory"},{"title":"Yeah, right!","post":"Question about that:  Is there one single person in all the universe who, freely, don’t want to be happy and who, freely, would choose to go into darkness?\nThat’s precisely the great finding of God to make sure everyone of his children will live forever with him in his Kingdom:  he planted the seed of happiness in every human heart, so that when we’ll meet him face to face after death, no one will dare to reject what he will have desperately seek all his life (often by taking wrong paths, which hurted God even more than ourselves because he is love).  At that moment, be certain that all our liberty will shoot : YES!!!\nDon’t worry my friend…  Those who reject God here on Earth are only doing this because they don’t know him.  In fact, most of them only reject the God of fear that you describe and they are right to do so!  Seriously, you really want to live an eternal life with a monster?  Not me!  You can be sure that if God is anything else than pure love and mercy, I will go into darkness with a big smile on my face because I would not be able to live happy in his Kingdom while knowing that, at the same time, some of my brothers and sisters would suffer eternal pains or would be in total darkness!\nAnd the bottom line is this: Because he is Love, God would never had dared to create this world if he wasn’t sure that everyone of his beloved children would end up in his Kingdom of love and happiness at the end of time.  Hell is no place else than here on Earth my friend.  Don’t have fear to hope for all and to have great expectation.  Jesus didn’t died for nothing!  Don’t put breaks to the cross of Jesus!  This act of love has absolutely no limit.\n\n","date":"April 15, 2013 at 10:29 am","url":"https://shroudstory.com/2013/04/13/yeah-right/","cat":"news_&_views","id":"comment-30875","author":"Yannick Clément","site":"shroudstory"},{"title":"Yeah, right!","post":"The only thing we need to know about Hell is that it is possible to totally reject God. The rejection of God by non-believers in this world is not a total rejection. If everyone is guaranteed to get to Heaven, why bother to be good and kind?\n\n","date":"April 15, 2013 at 11:55 am","url":"https://shroudstory.com/2013/04/13/yeah-right/","cat":"news_&_views","id":"comment-30876","author":"David Roemer","site":"shroudstory"},{"title":"Yeah, right!","post":"First, concerning hell, I urge you to meditate on how Jesus called Satan in the Gospels :  The prince of THIS WORLD !  That speak loud in my ears.\nAnd concerning your question, I would answer this:  Why bother to be good?  Because it is the only way to be totally happy and free here on Earth and that’s why Jesus urge us to do so (I should say to try so because, as sinners, it’s evident that we cannot do that all the time).  If we love God who is love, I think the best way to show this is by trying (at least trying) to be good the best we can.  And if we failed, be sure that God will still love us because he’s love and not human.\nWe can’t merit heaven by our good deeds.  It is a pure and free gift of our merciful Father in Heaven.  Just by understading that, it is enough, I think, to at least try hard to act like him in our life.  No need for fear to do so.  I really think the best path to get to Heaven is to try to love one another the best we can and the best way to do so is to count on the grace of God.\n\n","date":"April 15, 2013 at 1:08 pm","url":"https://shroudstory.com/2013/04/13/yeah-right/","cat":"news_&_views","id":"comment-30885","author":"Yannick Clément","site":"shroudstory"},{"title":"Yeah, right!","post":"Just to complete my comment: the best way to get to heaven is to try hard to love one another but it is important to believe that, even if we failed a lot of times to do so, our Father will never let us down or punish us, simply because he is love and we all are his beloved children.  There’s no other reason why God act like this with every one of us.  And it is a chance that he’s like that!  If not, we would all be good for eternal darkness because we are all sinners.\n\n","date":"April 15, 2013 at 1:13 pm","url":"https://shroudstory.com/2013/04/13/yeah-right/","cat":"news_&_views","id":"comment-30886","author":"Yannick Clément","site":"shroudstory"},{"title":"Yeah, right!","post":"Ho…  I forget one last thing :  If someone is doing good deeds in order to avoid God’s judgement or to merit heaven, I hope you understand that such a person is not acting with love at all.  This is call a « TRADE » and, by definition, this is the contrary of love.  Why do you think Jesus chased the moneychangers out of the temple?  The profound meaning of this prophetic deed of Christ is exactly that :  We cannot do trade with God because he is love and not human !  We cannot buy his love.  We cannot merit his love.  IT IS A FREE GIFT.  And here on Earth, I think the best example of that is the pure love of a mother or a father for his child.  The parent who act with love versus his child is not doing this to merit something or to get something out of a trade.  He only do this because he love his child.  That’s exactly the same thing with God versus all of us.  And he’s asking us kindly to do the same with him and with our brothers and sisters (i.e. all humanity), while knowing very well that we cannot do that all the time since we’re sinners.\n\n","date":"April 15, 2013 at 1:30 pm","url":"https://shroudstory.com/2013/04/13/yeah-right/","cat":"news_&_views","id":"comment-30887","author":"Yannick Clément","site":"shroudstory"},{"title":"Yeah, right!","post":"Yannick, are you trying to convert a Catholic to Protestantism?\nYou’ll fail ;-)\n\n","date":"April 15, 2013 at 2:05 pm","url":"https://shroudstory.com/2013/04/13/yeah-right/","cat":"news_&_views","id":"comment-30892","author":"jesterof","site":"shroudstory"},{"title":"Yeah, right!","post":"I thought protestant are thinking that we must believe in Jesus to be saved!  That’s not my faith at all.  They took that notion in St John and St Paul’s writings but, as I explained, these writings must be placed in their right historical context, which was writings first and foremost done to encourage their Christian communities to keep their faith in Christ in a period where it was not easy to be a Christian.  That’s why they put so much the focus on the need for faith to get save but if God would really be like that (i.e. someone who would save only those who have faith in him), then he would be just like anyone of us who often love only those who love us in return.  If the Father would be like that, then he would not be love no more because when you only love those who love you in return, this is call “trade” and not “love”.\n\n","date":"April 15, 2013 at 2:24 pm","url":"https://shroudstory.com/2013/04/13/yeah-right/","cat":"news_&_views","id":"comment-30893","author":"Yannick Clément","site":"shroudstory"},{"title":"Yeah, right!","post":"Last thing:  I don’t wrote all this to “convert” anyone.  I just testify of my personal faith, which is based on some spiritual experiences I had and also on the acts of mercy and love of Christ that we find everywhere in the Gospels.\nIt’s been a while since I have understand that once someone has made up his mind on something (religion is a very good example of this), there’s nothing you can do to change his mind…\n\n","date":"April 15, 2013 at 2:31 pm","url":"https://shroudstory.com/2013/04/13/yeah-right/","cat":"news_&_views","id":"comment-30895","author":"Yannick Clément","site":"shroudstory"},{"title":"Yeah, right!","post":"It does not matter what protestants think – to the Catholic. And vice verse.\nYour postulates are a clear case of what is the difference between Catholics and Protestants. It is Protestantism in it’s concise version. You might not be Protestant by birth, but you are clearly influenced by it.\nThis is just a remark, with no charge – I simply do not think you are reaching the goal exactly because of what I’ve stated – the basics of your beliefs ( just love, without deeds) is meaningless to a Catholic.\n\n","date":"April 15, 2013 at 2:34 pm","url":"https://shroudstory.com/2013/04/13/yeah-right/","cat":"news_&_views","id":"comment-30896","author":"jesterof","site":"shroudstory"},{"title":"Yeah, right!","post":"I think you’re a very old fashion catholic if you still think that we can be saved by our good deeds and our merits!  If God was thinking like that, he would not be love and a bunch of my brothers and sisters would be in hell.  And sure I would end up there too with joy because I would not want to live eternaly with that kind of monster.  If God is something else than love, then it’s sure I will reject it.  And if he’s love, then he’s not taking any count of our good or bad deeds.  Look at the “good thief” on the cross in St Luke and you’ll understand that I’m right about that.  This is not “protestant” to believe this.  I know a lot of catholics here in Quebec who share the same belief as me.\n\n","date":"April 15, 2013 at 2:45 pm","url":"https://shroudstory.com/2013/04/13/yeah-right/","cat":"news_&_views","id":"comment-30898","author":"Yannick Clément","site":"shroudstory"},{"title":"Yeah, right!","post":"\nYannick Clément :\n I just testify of my personal faith,\n\nI can see that.\nMy point was that your zeal, though understandable, is not reaching it’s point, because your point of view is deemed absolutely wrong in a different set of parameters ( another Faith).\nIt’s not a critique. Just a remark.\n\n","date":"April 15, 2013 at 2:37 pm","url":"https://shroudstory.com/2013/04/13/yeah-right/","cat":"news_&_views","id":"comment-30897","author":"jesterof","site":"shroudstory"},{"title":"Yeah, right!","post":"I understand that my belief is not the “mainstreem” belief of the Catholic official teaching but I also know that, through history, this “official teaching” has evolved and will keep on evolving.  Who knows if someday, the belief I have will not be shared by a majority of Catholics?  After all, it’s not like if I was rejecting Christ’s teaching about loving our Father in Heaven and loving one another like us or preaching that Jesus Resurrection is a fantasy…\n\n","date":"April 15, 2013 at 2:49 pm","url":"https://shroudstory.com/2013/04/13/yeah-right/","cat":"news_&_views","id":"comment-30899","author":"Yannick Clément","site":"shroudstory"},{"title":"Yeah, right!","post":"\nYannick Clément :\nI think you’re a very old fashion catholic if you still think that we can be saved by our good deeds and our merits!  If God was thinking like that, he would not be love and a bunch\nof my brothers and sisters would be in hell.  And sure I would end up there too with joy because I would not want to live eternaly with that kind of monster.  If God is something else than love, then it’s sure I will reject it.  And if he’s love, then he’s not taking any count of our good or bad deeds.  Look at the “good thief” on the cross in St Luke and you’ll understand that I’m right about that.  This is not “protestant” to believe this.  I know a lot of catholics here in Quebec who share the same belief as me.\n\nIt does not matter who I am ( and I am not going to engage in the discussion about merits/deeds vs faith/love).\nDavid Roemer clearly stated HE is a Catholic. And your lengthy and emotional posts were directed at him and his points.\nI just thought you might save your effort for a different audience :-)\n\n","date":"April 15, 2013 at 2:52 pm","url":"https://shroudstory.com/2013/04/13/yeah-right/","cat":"news_&_views","id":"comment-30900","author":"jesterof","site":"shroudstory"},{"title":"Yeah, right!","post":"He is a Catholic.  He is a Protestant.  He is an unbeliever.  Always the need to make categories.  God don’t act like that and it’s a chance…\nBefore being a Catholic or a Protestant or whatever else, you are a beloved child of you Father in Heaven and, in the end, what will save you is only the reality of this relationship between you and God, no matter what you’re doing right or wrong and no matter what you believe or not.  Or else, that would mean God is not Love but he’s the God of Talion who split the world in two :  the good ones and the bad ones !  I don’t see that in Jesus acts of mercy and love…  We see some of this in some of his teaching, but I ask you this:  who wrote these books?  Not Jesus!  It’s a big mistake to take these as “verbatim” of what the historical Jesus really said.  I think we should concentrate on what he did on the cross because at that moment, there was no split of the world in Jesus mind.  He died for all of us.  Period.\n\n","date":"April 15, 2013 at 3:00 pm","url":"https://shroudstory.com/2013/04/13/yeah-right/","cat":"news_&_views","id":"comment-30902","author":"Yannick Clément","site":"shroudstory"},{"title":"Yeah, right!","post":"Have a good day, I have to run.\n\n","date":"April 15, 2013 at 2:52 pm","url":"https://shroudstory.com/2013/04/13/yeah-right/","cat":"news_&_views","id":"comment-30901","author":"jesterof","site":"shroudstory"}]
