[{"title":"You Are Reminded. Dr. Karl and the Shroud of Turin in 2009","post":"I’ll read that carefully.  Thanks Dan !\n\n","date":"July 28, 2011 at 10:22 am","url":"https://shroudstory.com/2011/07/28/you-are-reminded-dr-karl-and-the-shroud-of-turin-in-2009/","cat":"news_&_views","id":"comment-3457","author":"Yannick Clément","site":"shroudstory"},{"title":"You Are Reminded. Dr. Karl and the Shroud of Turin in 2009","post":"Skeptical like that always make me laugh !  During my luch time, I’ve read rapidly the 3 articles from this Dr. Karl and I had the impression to read Joe Nickell !  They all sound the same…\nBut if those skeptical would agree to be HONEST for a time, they would admit that, beside the radiocarbon dating of 1988, they got NO hard scientific fact that can really challenge the authenticity of the Shroud.  And, since 1988, they would admit that the work of Rogers and Adler (particularly) seriously put the dating in question !  One thing is scientifically proven now (and if you don’t trust this it’s because you don’t trust the honesty of Rogers and Adler) : The only sample they took to date the Shroud was not representative of the main cloth.  Now, for the question of how can that be, there’s many hypothesis.  The one I favored the most is the invisible reweaving but there can be some other possibilities.  The important thing is that the C14 sample was chemically different, period.\nAnd, as I said, if they don’t believe this fact, it’s only because they don’t trust the honesty of Rogers and Adler, who were real scientists.  And I don’t think we can accuse them of being Jesus freaks !!!  In fact, Adler was a Jew !  \nSo, the only thing I would tell to Dr. Karl is to get all the STURP papers (published in peer-reviewed journals) and read them carefully.  I recommand him also to read carefully the books of Rogers and Adler.  After all this reading, if he’s honest, he would have to admit that there’s NOTHING in all the data reported that can contradict the authenticity of the Shroud and there’s NOTHING to suggest a forgery.  But, can he be honest enough to admit that ???\nThis last comment about the data of STURP didn’t mean necessarily that the Shroud is authentic but that prove (with 99% confidence) that it can’t be a forgery…  PERIOD !\n\n","date":"July 28, 2011 at 1:06 pm","url":"https://shroudstory.com/2011/07/28/you-are-reminded-dr-karl-and-the-shroud-of-turin-in-2009/","cat":"news_&_views","id":"comment-3460","author":"Yannick Clément","site":"shroudstory"},{"title":"You Are Reminded. Dr. Karl and the Shroud of Turin in 2009","post":"You know it really baffles me and I’ve said this before on here, that alot of people will take what people like Dr.Karl has to say and just believe it’s true with no question.Reading the comments after the three articles really opened my mind to how STUPID alot of people are, or maybe gullible is the right word.Some of these commenters praise the guy (Dr.Karl). Why? because he has a DR. before his name or a couple of letter afterwards? I don’t know, but it is a total bafflement that all these people will not take the time to do real ‘research’ themselfs.If only they did, they would see how ‘Untruthful’ and ‘mis-leading’ most of Dr Karl’s message is.IMO, he is a fraud and a liar (pretending to have actual knowledge on the subject) and I place him in the same catagory as that other guy, whats his name again?, …oh, Mr.Nickells\nps. I can’t believe these guys get paid for these lectures either, what a scam.\nRon.\n\n","date":"July 29, 2011 at 5:26 am","url":"https://shroudstory.com/2011/07/28/you-are-reminded-dr-karl-and-the-shroud-of-turin-in-2009/","cat":"news_&_views","id":"comment-3464","author":"Ron","site":"shroudstory"}]
