[{"title":"You need to read both lines of the headline","post":"Give not that which is holy unto the dogs, neither cast your pearls before swine, lest they trample them under their feet, and turn again and tear you. Matt 7;6. \nMaybe we need to think a lot more about that verse than we have in the past.  The early Christians took it to heart, and had their ‘disciplina arcana’. They kept them secret. These days anything holy is anybody’s free target. Muslims don’t tolerate it; they declare a fatwah! Where are the guardians of Christianity’s holy objects? Or are the legal eagles of free speech correct and we have no right “not to be insulted”??!!\n\n","date":"December 5, 2013 at 5:54 am","url":"https://shroudstory.com/2013/12/05/you-need-to-read-both-lines-of-the-headline/","cat":"humor","id":"comment-56618","author":"daveb of wellington nz","site":"shroudstory"},{"title":"You need to read both lines of the headline","post":"What would you have us do, Dave? Burn robots at the stake? Or were you thinking of the blogger/messenger?\n\n","date":"December 5, 2013 at 6:55 am","url":"https://shroudstory.com/2013/12/05/you-need-to-read-both-lines-of-the-headline/","cat":"humor","id":"comment-56633","author":"Dan","site":"shroudstory"},{"title":"You need to read both lines of the headline","post":"the Catholic Church had it for some time – it was called the Inquisition.\n\n","date":"December 5, 2013 at 7:11 am","url":"https://shroudstory.com/2013/12/05/you-need-to-read-both-lines-of-the-headline/","cat":"humor","id":"comment-56635","author":"Charles Freeman","site":"shroudstory"},{"title":"You need to read both lines of the headline","post":"The most progressive and humanitarian judicial system of its times.\n\n","date":"December 5, 2013 at 7:27 am","url":"https://shroudstory.com/2013/12/05/you-need-to-read-both-lines-of-the-headline/","cat":"humor","id":"comment-56644","author":"O.K.","site":"shroudstory"},{"title":"You need to read both lines of the headline","post":"O/K/ In that case perhaps we ought to reintroduce it with its priority being monitoring blogs about the Shroud- do you think it should still keep burning as a last option for those who remain sceptics?\n\n","date":"December 5, 2013 at 8:36 am","url":"https://shroudstory.com/2013/12/05/you-need-to-read-both-lines-of-the-headline/","cat":"humor","id":"comment-56669","author":"Charles Freeman","site":"shroudstory"},{"title":"You need to read both lines of the headline","post":"I agree with the sentiment but what does one expect when some Christians use their beliefs to mock the unbelief of others. I’ve seen the ‘alleged’ authenticity of the Shroud  proclaimed triumphantly to be a proof of Christ’s divinity and woe to those who choose not to believe now in Him. Any wonder then that skeptics trample the Shroud under foot?\nThe minute we start using the Shroud as a proof we are the ones trampling it underfoot. It is a sign — not a propoganda poster.\n\n","date":"December 5, 2013 at 11:13 am","url":"https://shroudstory.com/2013/12/05/you-need-to-read-both-lines-of-the-headline/","cat":"humor","id":"comment-56715","author":"David Goulet","site":"shroudstory"},{"title":"You need to read both lines of the headline","post":"\nCharles Freeman :\nO/K/ In that case perhaps we ought to reintroduce it with its priority being monitoring blogs about the Shroud- do you think it should still keep burning as a last option for those who remain sceptics?\n\nTell you what: let’s make a rule. No one shall ever be subjected to any punishment than that endured by the man on the Shroud.\nYeah. Perspective.\n\n","date":"December 5, 2013 at 2:41 pm","url":"https://shroudstory.com/2013/12/05/you-need-to-read-both-lines-of-the-headline/","cat":"humor","id":"comment-56772","author":"Jeffrey Liss","site":"shroudstory"},{"title":"You need to read both lines of the headline","post":"The media bias seems to be highly selective in targeting Christianity in particular.  Despite the extremes of Islamic fundamentalists, some lessons in caution have been taken on board when it comes to criticising aspects of Islam.  Fatwah are invoked against those who burn copies of the Koran for instance. Bible burning goes unnoticed. In N Korea, several Christians were recently executed for merely owning a Bible. \nI should like to know what happens in USA, when First Nation sensitivies are offended.  An expressway is being constructed north of Wellington on the Kapiti coast.  A headline in this morning’s newspaper proclaims that “Workers eating at ‘sacred’ site offend Maori”.  There is an archaeological dig in the area, which has revealed an ancient burial site, and there is also a ‘sacred’ tree, a macrocarpa (an exotic, not native). A few local Maori have stated that “They understood the site was tapu until the archaeologists had finished their work, yet we found workers having lunch on-site which was extremely offensive to local Maori.” Curiously another comment states: “… people should treat it like you’d treat a church, the sacredness of the church. The land is sacred in the same way to us.” Such comments are not at all uncommon in NZ media, when it comes to offending (usually unintentional) the sensibilities of local Maori. \nHowever it seems to be an open season, when it comes to offending the sensibilities of Christians, usually deliberate and not unintentional. It is condoned on the specious grounds that we live in a secular society. Yet when it comes to offending recently imported cultures, a certain precious coyness is suddenly found, and respect for ethnic sensitivities is discovered. \nThere is a holiness about certain objects, practices and beliefs, which demand as much respect, but which is totally diregarded throughout the western world.\n\n","date":"December 5, 2013 at 3:23 pm","url":"https://shroudstory.com/2013/12/05/you-need-to-read-both-lines-of-the-headline/","cat":"humor","id":"comment-56782","author":"daveb of wellington nz","site":"shroudstory"},{"title":"You need to read both lines of the headline","post":"One man’s holy treasure is another man’s knick knack.Even the Shroud, as precious an ‘icon’ that it is, and seen as holy by believers — is still but a sign pointing at that which is truly holy. Jesus urges us to see the holiness within ourselves and each other, first and foremost. I often ask myself, when confronted by the latest brazen anti-Christian offence, “would Jesus be offended by this or am I projecting my self-righteous indignation onto it?”\nFor example, if someone vandalized my church would that be an offense against Christ? It is certainly a slap in the face to those that worship there (reason enough to decry it) but even the darkest acts cannot overcome the light — for in the end the light will dispel every patch of darkness. In the end God gets the last laugh, so who am I to appropriate His anger?\n\n","date":"December 5, 2013 at 4:26 pm","url":"https://shroudstory.com/2013/12/05/you-need-to-read-both-lines-of-the-headline/","cat":"humor","id":"comment-56799","author":"David Goulet","site":"shroudstory"}]
