[{"title":"Atchity isn’t exactly a fan of Benedict XVI or the Shroud of Turin","post":"Mr. Atchity is not a scholar but a novelist.\n\n","date":"February 21, 2013 at 9:27 am","url":"https://shroudstory.com/2013/02/21/atchity-isnt-exactly-a-fan-of-benedict-xvi-or-the-shroud-of-turin/","cat":"news_&_views","id":"comment-25150","author":"Louis","site":"shroudstory"},{"title":"Atchity isn’t exactly a fan of Benedict XVI or the Shroud of Turin","post":"Pray his heart is opened.\n\n","date":"February 21, 2013 at 11:54 am","url":"https://shroudstory.com/2013/02/21/atchity-isnt-exactly-a-fan-of-benedict-xvi-or-the-shroud-of-turin/","cat":"news_&_views","id":"comment-25165","author":"Chris","site":"shroudstory"},{"title":"Atchity isn’t exactly a fan of Benedict XVI or the Shroud of Turin","post":"Atchity clearly has little knowledge of Bendict’s writings – Benny’s “Jesus of Nazareth” is scholarly and historical, and is now becoming recognised as a classic study.  Hardly consistent with Atchity’s allegation “Benedict XVI resigned because he could no longer pretend he believes in the historicity of the founding myth”.  Another Huffington Post screw-up of the facts!\n\n","date":"February 21, 2013 at 4:23 pm","url":"https://shroudstory.com/2013/02/21/atchity-isnt-exactly-a-fan-of-benedict-xvi-or-the-shroud-of-turin/","cat":"news_&_views","id":"comment-25195","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Atchity isn’t exactly a fan of Benedict XVI or the Shroud of Turin","post":"The Pope would have had access to every artifact, written extracts, etc kept for nearly 2 millenia from the Vatican Library.  Imagine what is contained in there.  Did he access something which had always been kept a secret from the faithful, I wonder?  Powerful organisations like to remain in power.\n\n","date":"February 21, 2013 at 10:52 pm","url":"https://shroudstory.com/2013/02/21/atchity-isnt-exactly-a-fan-of-benedict-xvi-or-the-shroud-of-turin/","cat":"news_&_views","id":"comment-25222","author":"Ysanne Griffiths","site":"shroudstory"},{"title":"Atchity isn’t exactly a fan of Benedict XVI or the Shroud of Turin","post":"The Church is not an organisation and if it has some power that is because it is 2000 years old. What the Pope has in mind can be found in his three-volume “Jesus of Nazareth”, appreciated even by top Protestant scholars.\n\n","date":"February 22, 2013 at 7:24 am","url":"https://shroudstory.com/2013/02/21/atchity-isnt-exactly-a-fan-of-benedict-xvi-or-the-shroud-of-turin/","cat":"news_&_views","id":"comment-25273","author":"Louis","site":"shroudstory"},{"title":"Atchity isn’t exactly a fan of Benedict XVI or the Shroud of Turin","post":"Louis: “The Church is not an organisation …”  That is not correct of the Church on earth, but only of the broader concept of the Church in a spiritual sense as including the Communion of Saints, etc.  Amitai Etzioni includes the Catholic Church in his many studies of the Sociology of Organisations, as a certain type of organisation with a very broad command structure.  In a comprehensive standard text by Koontz & O’Donnell “Principles of Management”, as early as p.19, the authors include a section on the Roman Catholic Church when reviewing Early Contributions to Management Principles.  “If one is to judge by age, the most efficient formal organisation in the history of Western Civilization has been the Roman Catholic Church.”  They continue with comments on appeal of its objectives, effectiveness of its organization, and management techniques, hierarchy of authority, scalar territorial organization, specialization on functional lines, early use of the “staff device” etc, all imitated by  by other organizations, but only in latter years.  Other scholarly writers on the topic of organizations (e.g. Mooney) have also commented on the Catholic Church as an organization.  \nMeanwhile media speculations on the resignation of Pope Benedict continue to proliferate. This morning’s Wellington Dominion-Post Sat Feb 23, reports second-hand Italian media reports in La Republica (centre-left paper) and Panorama (conservative weekly) concerning the VatiLeaks affair.  They allege that Benedict made his decision on Dec 17 when three senior cardinals handed him their two leather-bound reports of 300 pages containing “an exact map of the mischief and bad fish” inside the Holy See.  The cardinals have said to have uncovered an underground gay network whose members left them prone to blackmail, delves into suspect dealings at the Institute of Religious Works (FOR) and etc. Newspapers say Benedict would personally hand over the confidential files to his successor, with the hope that he would be “strong, young and holy” enough to take the necessary action. \nPredictably, Vatican spokesman Fr Federico Lombardi refused to “run after fantasies and opinions” and warned reporters “Don’t expect comments or rebuttals on what is being said on this issue.” La Republica, (citing the usual source), quoted a man described as “very close” to the authors as saying the information was “all about the breach of the sixth and seventh commandments”.  \nLooks like the Atchity report is way off the mark, and he clearly knows nothing!\n\n","date":"February 22, 2013 at 4:20 pm","url":"https://shroudstory.com/2013/02/21/atchity-isnt-exactly-a-fan-of-benedict-xvi-or-the-shroud-of-turin/","cat":"news_&_views","id":"comment-25319","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Atchity isn’t exactly a fan of Benedict XVI or the Shroud of Turin","post":"David, the Church is normally referred to as an instituition, not as an organisation, which is a loose term, that obviously being the reason why it was used in the first place. There was intention behind the choice of this term.  \nBenedict XVI is first and foremost a professor and a scholar and was reported to have requested Pope John Paul II to leave as Prefect of the Congregation for the Doctrine of the Faith to look after the Vatican library. His request was turned down because John Paul needed him where he was. The right environment for him was the apartment where he lived as a cardinal, with 20000 books, his two cats and his piano. He did not expect to be the pope and there can be no doubt that the legacy he will leave are the scholarly books he wrote. This being so, he did not know what was going on right under his nose, through no fault of his. Communications between Vatican departments have not been good. And, above all, if there was a traitor among Jesus’ twelve disciples, how many are there in the midst of 1.2 billion Catholics? The reference to religious hypocrisy makes a lot of sense.\n\n","date":"February 22, 2013 at 7:37 pm","url":"https://shroudstory.com/2013/02/21/atchity-isnt-exactly-a-fan-of-benedict-xvi-or-the-shroud-of-turin/","cat":"news_&_views","id":"comment-25338","author":"Louis","site":"shroudstory"},{"title":"Atchity isn’t exactly a fan of Benedict XVI or the Shroud of Turin","post":"Institution vs Organization.  I think we both acknowledge that the Church is more than either of these concepts.  Collins: “institution – 2. an organization or establishment founded for a specific purpose, such as a hospital, church, company or college; 3. etc …”  \nI think both institutional and organizational aspects of the Church are legitimate topics for discussion and study.  Probably the institutional character implies a more enduring property than its organizational character which may only be temporaneous or confined to a specific era.  “Organization” may more properly refer to its management aspects, or the way it is structured at a specific time.  Both institutional and organizational aspects of the Church have been extenively discussed by Etzioni in his studies in organizational sociology.  “Management” has possibly not received the attention it deserved in Benedict’s preoccupation with scholarly pursuits.  You may well be correct in your assessment of 20,000 books, two cats and a piano!\n\n","date":"February 22, 2013 at 8:51 pm","url":"https://shroudstory.com/2013/02/21/atchity-isnt-exactly-a-fan-of-benedict-xvi-or-the-shroud-of-turin/","cat":"news_&_views","id":"comment-25343","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Atchity isn’t exactly a fan of Benedict XVI or the Shroud of Turin","post":"Yes, that’s right, but it looks like it took you some time to understand why the term ‘organisation’  was employed. Pope Benedict has been a victim of the organisational aspects of the Church, not least by what had gone on at the IOR, where improvements are needed despite the test being passed. It had to be the treasurer, just like in the case of Jesus and his 12 disciples, with Judas in charge of the purse.\n\n","date":"February 22, 2013 at 9:30 pm","url":"https://shroudstory.com/2013/02/21/atchity-isnt-exactly-a-fan-of-benedict-xvi-or-the-shroud-of-turin/","cat":"news_&_views","id":"comment-25348","author":"Louis","site":"shroudstory"}]
