[{"title":"Is Pope Francis Walking On the Mystical Side?","post":"The critics obviously have no comprehension of Catholicism, so their opinion is moot.\n\n","date":"August 28, 2015 at 7:10 am","url":"https://shroudstory.com/2015/08/28/is-pope-francis-walking-on-the-mystical-side/","cat":"news_&_views","id":"comment-209199","author":"Dcn Andy","site":"shroudstory"},{"title":"Is Pope Francis Walking On the Mystical Side?","post":"exactly andy\n\n","date":"August 28, 2015 at 10:15 am","url":"https://shroudstory.com/2015/08/28/is-pope-francis-walking-on-the-mystical-side/","cat":"news_&_views","id":"comment-209217","author":"rick","site":"shroudstory"},{"title":"Is Pope Francis Walking On the Mystical Side?","post":"It is evident that the journalist is not a Religion Writer and he even quotes the wrong person.\nThere are two issues to be tackled, so here we go:\nPope Francis has indeed spoken about the devil once in a while and there are reports about\nPope John Paul II performing exorcisms twice in the Vatican, about which no details are available. The Catechism of the Catholic Church (see no.1637) says that care must be taken to distinguish between demoniacal possession and psychiatric problems. We have the famous case of Anneliese Michel in Germany, who died during exorcisms, and the clergymen involved had problems with the law. It led to a book on the topic of evil, one of whose authors was Cardinal Walter Kasper, then archbishop of Stuttgart-Rottenburg.\nSome years ago I read a full-page newspaper report on the topic of the devil and exorcism, where Orthodox Jews, a reform rabbi and a Catholic priest gave their opinions. The orthodox Jews said they performed the exorcism by placing a pigeon’s anus on the navel of the person who was possessed so that the evil entity could leave. They then said that they burnt their fingernails when they were cut. When it came to this part I judged that this belief was derived from the Zoroastrian demonology of ancient Iran, probably during the Babylonian Captivity.\n(The narrative about the Gerasene demoniac in the Gospel according to Mark ends by saying that the man was sitting in his “right mind” after Jesus cured him. Did the “legion of demons” go into the pigs, or was that the interpretation of the bystanders, influenced by the Graeco-Roman pagan mythology that was in vogue in Palestine after the Romans took over?).\nThe reform rabbi dismissed the belief of the Orthodox Jews, saying that it was not a part of his Reform Synagogue’s theology. The most a rabbi could do, he said, was to pray for the person with the problem to find his “I”. That would take us to Heidegger’s “dasein”.\nThe Catholic priest just said that the Church only believed in one divine being, and that was God, he rejected demonology and exorcisms.\nUltimately the topic leads us to the “mysterium iniquitatis”, the mystery of evil, which is an ongoing problem, one that has led fundamentalist pastors to abandon their churches. It appears to have been very controversial in the Old Testament period. The great Jewish scholars Ben Zion Wacholder and Shemaryahu Talmon tried to trace where the problem originated:       https://www.academia.edu/12734802/Book_Review_Beyond_the_Essene_Hypothesis_The_Parting_of_the_Ways_between_Qumran_and_Enochic_Judaism\nC. G. Jung dwelt on the problem of evil, studying and discussing it with his closest friend, the American dominican friar Father Victor White, who lived in Oxford. They parted ways because of this, the strong Christian spiritual bond being the only link between them:\nhttps://www.academia.edu/7344691/C._G._Jung_Father_Victor_White_and_privatio_boni\nHe was also a “Shroudie” in a way, with a copy of the Turin Shroud face hanging behind a small curtain in his study:\nhttps://www.academia.edu/6823292/What_did_Jung_see_in_the_Shroud\n(Click on http://www.sindone.info on the left)\nThere is also mention of “idolatry” in the report. It does seem that we humans always look for something “palpable” when it comes to the divine. I have seen Muslims incensing photographs of Mecca and Jews kissing the Mezuzah and a photograph on the internet where an orthodox Jew is seen holding a cellphone close to the Wailing Wall so that his friend in Europe who was on the line could recite a prayer. This is also idolatry in a broad sense.\nSo much for “superstition” and “idolatry”…\n\n","date":"August 28, 2015 at 11:45 am","url":"https://shroudstory.com/2015/08/28/is-pope-francis-walking-on-the-mystical-side/","cat":"news_&_views","id":"comment-209220","author":"Louis","site":"shroudstory"},{"title":"Is Pope Francis Walking On the Mystical Side?","post":"I’m not sure who that catholic priest was…but think i’ll believe both jean paul and padre pio on the subject\n\n","date":"August 28, 2015 at 8:17 pm","url":"https://shroudstory.com/2015/08/28/is-pope-francis-walking-on-the-mystical-side/","cat":"news_&_views","id":"comment-209238","author":"rick","site":"shroudstory"},{"title":"Is Pope Francis Walking On the Mystical Side?","post":"After reading all this, there is no alternative but to change my mind.\nPope Francis certainly believes the Shroud is real otherwise he would not have attitudes of reverence with other relics, after all the Shroud is the most important christian relic.\nIt does not surprise me at all that he had spoken about the Devil because he himself performed a kind of exorcism on a disabled boy allegedly with a demonic possession.\nAre exorcists fanatic priests or are they priest with a special training skill to fight with the dark forces?\nI don’t buy theories of «modern» so called theologians that deny the Devil’s existence and state that Christ’s ressurrection was a spiritual event ( I really don’t know what they mean with that).\nIf Christian religions did not have a mystic side namely miracles and the fight with evil, christian doctrine would be just a kind of empty philosophy.\nThe Shroud is the living testimony that something happened with Jesus body in that dark tomb, and no matter what the physics and chemistry of that event were they left the imprint of His body on the cloth.\n                                                                             regards\n                                                                Antero de Frias Moreira\n                                                  ( Centro Português de Sindonologia)\n\n","date":"August 29, 2015 at 3:52 am","url":"https://shroudstory.com/2015/08/28/is-pope-francis-walking-on-the-mystical-side/","cat":"news_&_views","id":"comment-209247","author":"Antero de Frias Moreira","site":"shroudstory"},{"title":"Is Pope Francis Walking On the Mystical Side?","post":"Antero,\nThe answers to the skeptic may very well reside in the Quantum. We call mystical what we can not now explain.\nI strongly recommend the following YouTube about a 2016 conference scheduled for Arizona. https://www.youtube.com/watch?v=xJMYzeSwSGU&feature=youtu.be\n\n","date":"August 29, 2015 at 6:22 am","url":"https://shroudstory.com/2015/08/28/is-pope-francis-walking-on-the-mystical-side/","cat":"news_&_views","id":"comment-209253","author":"John Klotz","site":"shroudstory"},{"title":"Is Pope Francis Walking On the Mystical Side?","post":"In classical mythology, Lucifer, the Light bearer, became identified with the morning star as a herald of the dawn, more so in poetry rather than any specific legend.  In Isaiah 14:12 he is used as an allegoric subject of a taunt-song against the King of Babylon: “How you have fallen from the heavens, O Morning Star,* son of the dawn!  How you have been cut down to the earth, you who conquered nations! 13 In your heart you said: “I will scale the heavens; Above the stars of God* I will set up my throne; I will take my seat on the Mount of Assembly, on the heights of Zaphon.”  \nSo that he then becomes identified with the sin of pride, setting himself above the stars of God.  This theme of pride then seems to be taken up in the NT.  When the 72 return from their mission into Israel, they comment on how even the demons obey them and Luke has Jesus give the reply: ‘Jesus said, “I have observed Satan fall like lightning* from the sky.” [Luke 10: 18] which seems to echo the Isaiah passage.  He continues: “19 Behold, I have given you the power ‘to tread upon serpents’ and scorpions and upon the full force of the enemy and nothing will harm you. 20 Nevertheless, do not rejoice because the spirits are subject to you, but rejoice because your names are written in heaven.”  I suggest that Jesus is implying that the forces of evil have an existent spiritual reality.  \nThis idea of Satan falling from the sky, finds an echo in Revelations 9:1:  “1 Then the fifth angel blew his trumpet, and I saw a star* that had fallen from the sky to the earth. It was given the key for the passage to the abyss. 2 It opened the passage to the abyss, and smoke came up out of the passage like smoke from a huge furnace. The sun and the air were darkened by the smoke from the passage. (etc) ”  \nThus, in Christian times Lucifer came to be regarded as the name of Satan before his fall. It was thus used by John Milton (1608–74) in Paradise Lost, and the idea underlies the proverbial phrase “as proud as Lucifer.” \nHowever, it is also apparent that those who suffered from various forms of mental illness were thought to be possessed by a devil or an evil spirit.  The two should not be confused by a modern mind, and I think it reasonable to believe that there are in fact evil spirits who desire the downfall of mankind.  How much of this is spiritual reality, and how much of it is merely a projected personification of the forces of evil is difficult to say.  \nAs a footnote, it is curious that in some primal societies, even today, those who suffer from certain types of mania, are sometimes seen as having access to a form of spiritual power, and are consequently granted an excess of temporal power or leadership, sometimes to the detriment of the tribe.  In history, to what extent have the several tyrants been driven by a type of megalomania, because they were perceived as having access to a type of divine power?\n\n","date":"August 29, 2015 at 6:55 am","url":"https://shroudstory.com/2015/08/28/is-pope-francis-walking-on-the-mystical-side/","cat":"news_&_views","id":"comment-209254","author":"daveb of wellington nz","site":"shroudstory"}]
