[{"title":"A Decline,  an Uptick and a Rise","post":"Earlier this evening on the 50th anniversary of the D-day Landing in Normandy, I listened to a recording of General Eisenhower’s message, ‘D-day statement to soldiers, sailors, and airmen of the Allied Expeditionary Force’.  At the end of his message of encouragement, it concluded:\n“And let us all beseech the blessing of Almighty God upon this great and noble undertaking.”  \nI wonder how many western generals nowadays would invoke God’s blessing on such perilous undertakings as the Allied forces were about to face in 1944.  I shall not weep for the decline of belief in biblical literalism.  I would rejoice if it were to be replaced by a more meaningful religious ethos.  The old gods die, it was always ever thus.  But their transition can be a painful and diverse process.  Do we care for one another more than we once did?  That is a key question.  Narcissism and the cult of the self is presently rampant.  \nWhat message of hope can the Shroud communicate to present and future humanity?\n\n","date":"June 7, 2014 at 7:45 am","url":"https://shroudstory.com/2014/06/07/a-decline-an-uptick-and-a-rise/","cat":"news_&_views","id":"comment-127510","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Decline,  an Uptick and a Rise","post":"The bible talks about wide rebellion/apostacy that has to come first before the second coming “let no one in any way deceive you, for it will not come unless the apostasy comes first, and the man of lawlessness is revealed, the son of destruction, who opposes and exalts himself above every so-called god or object of worship, so that he takes his seat in the temple of God, displaying himself as being God”\nAlso 2 Timothy 4:3-4 Paul says, “For the time will come when men will not put up with sound doctrine. Instead, to suit their own desires, they will gather around them a great number of teachers to say what their itching ears want to hear. They will turn their ears away from the truth and turn aside to myths.” (NIV)\nThis is the normal development of things not an aberration.\n\n","date":"June 7, 2014 at 8:30 am","url":"https://shroudstory.com/2014/06/07/a-decline-an-uptick-and-a-rise/","cat":"news_&_views","id":"comment-127515","author":"Mike M","site":"shroudstory"},{"title":"A Decline,  an Uptick and a Rise","post":"The quote from Mike M would seem to come from the Book of Revelations and would apply directly to Nero, the great persecutor.  Possibly Paul had in mind the diverse cults of gnosticism already then prevalent.  However it is true that it is a more prevalent and recurring tendency.   Later developments were Arianism, Monophysitism and Nestorianism, among many others. \n“The old gods die.”  The case of Ancient Britain is particularly interesting “The Sacred History of Britain” by Martin Palmer.  Agriculture reached Britain about 5000 BC, and the Neolithic peoples developed ceremonial burial rites and communal centres around ‘long barrows’, a particular example being at Waylands Smithy.  Overuse of farmlands led to crop failures, consequent famines and the barrows were closed off about 3200 BC.  It was succeeded in turn by the ‘Stone Circle’ culture, initially by wood-henges and eventually by stone circles which spread right across Europe.  With the building of the Great Stonehenge on Salisbury Plain in 3100 BC, the other stonehenges fell into disuse.  There were three distinct phases at Stonehenge, each being a falling into disuse, and then a remodelling.  In 1150 BC an Icelandic volcano erupted, blotting out the sun with widespread crop failures and famine, and the last attempt at remodelling Stonehenge remained unfinished and the circle culture with its ceremonial burials was abandoned.  From 500 BC Celtic ideas emerged focusing on springs and wells, originating from a Mesopotamian Ainu cult.  In turn it gave way to early forms of Christianity.   Palmer traces the religious development of Britain right up to modern times.  Community crises, famines, plagues, often resulted in changes in religious thinking. \nWe are seeing at present mass extinctions of species, the forerunner of yet another global crisis brought about by climate change.  It seems likely that antibiotics will also fail, and there will be a mass succumbing to incurable diseases with major impact on populations.  How humanity might eventually react to these crises can only be guessed at.    \nWhat will the Christianity of the future look like?  A remnant only, or a reawakening.  What will be the place of Islam?  Will it become dominant, or will it fail?  These things are for the present hidden from us!\n\n","date":"June 7, 2014 at 5:33 pm","url":"https://shroudstory.com/2014/06/07/a-decline-an-uptick-and-a-rise/","cat":"news_&_views","id":"comment-127621","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Decline,  an Uptick and a Rise","post":"“Would apply directly to Nero”\n.. I totally disagree with your confidence here. This is only one view of the events described here. There are others who view the book to describe future events, or even as completely symbolic.\n“Possibly Paul”\nI like that because again This is an estimation of what Paul was talking about and like the first quote it can be used to describe future events.\nThe point I am trying to make is that this is not taking God by surprise, Jesus, talking about the end times in a parable says “For many are called, but few are chosen.” (Matthew 22:14).\n\n","date":"June 8, 2014 at 9:51 am","url":"https://shroudstory.com/2014/06/07/a-decline-an-uptick-and-a-rise/","cat":"news_&_views","id":"comment-127758","author":"Mike M","site":"shroudstory"},{"title":"A Decline,  an Uptick and a Rise","post":"Mike, I should be very cautious in attempting to read Revelations as an oracle foretelling specific events of the distant future, as a few extreme sects do.  Did you know that most of the Eastern Orthodox do not even accept this book as canonical.  I spent the best part of a year discussing this specific book with my Bible Study group under a well-informed scholarly priest.  \nEssentially Revelations is an Apocalypse, as is the book of Daniel, both using similar imagery, and both written under threat of intense persecution.  Both have the specific purpose of encouragement to those threatened.  An apocalypse can work on a number of levels.  There is the immediate threat at the time of writing, and the style will be in the form of a simple code easily recognised by those for whom it is written, but so as to be hidden from the enemy.  Much of what is said of the beast applies specifically to Nero, including the number 666.  [Greek uses an alphabetic numerary system,]  \nHaving said that, an apocalypse may also contain certain cosmic truths which are forever perennial, and can apply to various extreme circumstances in history whenever God’s people are persecuted.  It is hardly a difficult matter to identify the beast with the likes of Adolf Hitler or Josef Stalin for example.  It can equally apply to certain extreme forms of philosophy, involving exploitation of the weak and vulnerable, or in the consequences of selfishness.  I see the beast at work in the extinction of species, and in climate change, much of which is being brought about by human greed.  Indeed, sometimes we are our own worst enemy, and the enemy of our posterity.  \nI should not attempt to divine specific future events from it in any kind of literal way.  I think that is to misunderstand the function of prophecy and of the prophet.  The prophet is not an augur or an Oracle of Delphi but proclaims his message to the people of his time, although his message may also contain perennial truth.  The specific future remains hidden from our eyes, and we must be satisfied with the consolation of hope and the promise.  It is not for us to know the times that the Father has appointed.\n\n","date":"June 9, 2014 at 7:11 am","url":"https://shroudstory.com/2014/06/07/a-decline-an-uptick-and-a-rise/","cat":"news_&_views","id":"comment-127941","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Decline,  an Uptick and a Rise","post":"Dave, thanks for the thoughtful insights. Our Coptic Orthdoox church believe that the book of Revelation is canonical. I agree with you that even if relating to immediate events, the perennial truth from it, and from other multiple references in the bible, is that the majority will be non-believers. The statistics above doesn’t take God by surprise, it will even get worse.\n\n","date":"June 9, 2014 at 9:35 pm","url":"https://shroudstory.com/2014/06/07/a-decline-an-uptick-and-a-rise/","cat":"news_&_views","id":"comment-128074","author":"Mike M","site":"shroudstory"},{"title":"A Decline,  an Uptick and a Rise","post":"Mike, the Peshitta of the “Siriani”, the Syrian Orthodox Church, did not originally contain the Book of Revelation. It is  a highly complex book and therefore subject to scholarly discussion. Unfortunately some Protestant fanatics have used it to hurl accusations, particularly directed to Rome.\n\n","date":"June 10, 2014 at 6:40 pm","url":"https://shroudstory.com/2014/06/07/a-decline-an-uptick-and-a-rise/","cat":"news_&_views","id":"comment-128303","author":"Louis","site":"shroudstory"},{"title":"A Decline,  an Uptick and a Rise","post":"“unfortunately some Protestant fanatics have used it to hurl accusations, particularly directed to Rome”\nLouis, I know about that and I don’t subscribe to those commentaries. I do think, personally, that the book talks about future events. Particularly regarding Arab nations overtaken by fundamental Islamic ideology surrounding the nation of Israel followed by the second coming of Christ.\n\n","date":"June 10, 2014 at 7:06 pm","url":"https://shroudstory.com/2014/06/07/a-decline-an-uptick-and-a-rise/","cat":"news_&_views","id":"comment-128311","author":"Mike M","site":"shroudstory"},{"title":"A Decline,  an Uptick and a Rise","post":"Catechism 675 would suggest some of the events in Revelation are yet to happen.\n\n","date":"June 10, 2014 at 6:23 pm","url":"https://shroudstory.com/2014/06/07/a-decline-an-uptick-and-a-rise/","cat":"news_&_views","id":"comment-128299","author":"ChrisB","site":"shroudstory"},{"title":"A Decline,  an Uptick and a Rise","post":"Mike, yes, the right approach to the book is to keep the mind open. It might interest you to know that there is a mosque in the city of Fatehpur Sikri, in North India, built by the  emperor Akbar (the great) with a curious inscription at the entrance:\n“Jesus, Son of Mary, (on whom be peace) said:  The World is a Bridge, pass over it, but build no houses upon it. He who hopes for a day, may hope for eternity; but the world endures but an hour. Spend it in prayer, for the rest is unseen.'”\nThe Muslim Akbar had three wives, one was a Christian, of Armenian origin. He also received Jesuits in his court.\n\n","date":"June 10, 2014 at 7:35 pm","url":"https://shroudstory.com/2014/06/07/a-decline-an-uptick-and-a-rise/","cat":"news_&_views","id":"comment-128317","author":"Louis","site":"shroudstory"},{"title":"A Decline,  an Uptick and a Rise","post":"Louis, I keep an open mind too. My speculation was based on the recent changes in the Middle East and the rise of renegade ultra extreme Islamic ideology around Jerusalem with their public televised beheadings and so forth. I don’t believe we can tell for sure what John was talking about or calculate the end of the world, like some people do. As Daveb said, it is not for us to know the times appointed by the father. I believe the function of prophecy is to increase the faith when things actully get fulfilled (e.g. The reformation of the nation of Israel after being scattered in front of our own eyes, or our grandparents eyes to be precise) but not to try to claim knowledge of the future or how things will turn out to be. I do like the saying from Akber, some of my best friends are Muslims and I have great respect for them. The more the Christian influence on them the better and more moderate they become. It is their radical ideology I have a problem with. Orthodox Islam is very dangerous.\n\n","date":"June 10, 2014 at 10:27 pm","url":"https://shroudstory.com/2014/06/07/a-decline-an-uptick-and-a-rise/","cat":"news_&_views","id":"comment-128352","author":"Mike M","site":"shroudstory"},{"title":"A Decline,  an Uptick and a Rise","post":"Hi Mike, you can bet that many of the saying of Jesus were not put down in writing, he spoke a lot more in three years of ministry. Some of it was only conveyed privately to his disciples and this is what prompted the great Hindu sage Swami Vivekananda to take him very seriously and start the Vedanta branch of Hinduism, where he is honoured as avatar, incarnation of God. Actually Vivekananda, who was very learned, did not find the impersonal God of Hindu philosophy satisfying, he was looking for something concrete and found it in Jesus.\nHe began to translate the “Imitation of Christ” into Bengali, the language spoken in the Indian state of West Bengal and Bangladesh, but was unable to finish it. He took Jesus so seriously that his only possessions were a staff and a small pot to carry water, that is how he travelled all over India, that is how he arrived to lecture in the US – penniless. He remained single throughout his life like a true brahmachari. It is for reasons like these that scholarly Hindus say that Jesus would have been understood if he had been born in India.\nAs for your other points, the most dangerous places when it comes to fundamentalism is not the Middle East, it is Pakistan.\n\n","date":"June 12, 2014 at 7:38 pm","url":"https://shroudstory.com/2014/06/07/a-decline-an-uptick-and-a-rise/","cat":"news_&_views","id":"comment-128911","author":"Louis","site":"shroudstory"},{"title":"A Decline,  an Uptick and a Rise","post":"Hi Louis, it’s funny you say that. This just came in,\nhttp://www.liveleak.com/view?i=6d1_1402598110\n\n","date":"June 12, 2014 at 8:49 pm","url":"https://shroudstory.com/2014/06/07/a-decline-an-uptick-and-a-rise/","cat":"news_&_views","id":"comment-128930","author":"Mike M","site":"shroudstory"},{"title":"A Decline,  an Uptick and a Rise","post":"You should suggest they do a survey about they Shroud, Dan.\n\n","date":"June 12, 2014 at 7:11 pm","url":"https://shroudstory.com/2014/06/07/a-decline-an-uptick-and-a-rise/","cat":"news_&_views","id":"comment-128903","author":"Andy","site":"shroudstory"},{"title":"A Decline,  an Uptick and a Rise","post":"Hi Mike, can’t disagree with you, but don’t forget where B/L was found hiding.\n\n","date":"June 12, 2014 at 9:36 pm","url":"https://shroudstory.com/2014/06/07/a-decline-an-uptick-and-a-rise/","cat":"news_&_views","id":"comment-128945","author":"Louis","site":"shroudstory"},{"title":"A Decline,  an Uptick and a Rise","post":"I know, Pakistan is more subtle. ISIS are not hiding their evil. Public beheading, slaughtering humans like animals, crucifixions, abductions, rapes (they call it marriage, but really the girls have no option) looting (just looted >400million dollars from a bank in Iraq). The same ideology that B/L was going by, but he was even more civilized than them.\n\n","date":"June 12, 2014 at 9:55 pm","url":"https://shroudstory.com/2014/06/07/a-decline-an-uptick-and-a-rise/","cat":"news_&_views","id":"comment-128950","author":"Mike M","site":"shroudstory"},{"title":"A Decline,  an Uptick and a Rise","post":"Looted 400m from bank in Iraq and didn’t have their hands cut?\n\n","date":"June 12, 2014 at 10:31 pm","url":"https://shroudstory.com/2014/06/07/a-decline-an-uptick-and-a-rise/","cat":"news_&_views","id":"comment-128960","author":"Louis","site":"shroudstory"},{"title":"A Decline,  an Uptick and a Rise","post":"Lol, very funny. Louis you know, this is Jihad. Killing, theft, rape & lying will brings them closer to Allah.\n\n","date":"June 12, 2014 at 10:35 pm","url":"https://shroudstory.com/2014/06/07/a-decline-an-uptick-and-a-rise/","cat":"news_&_views","id":"comment-128961","author":"Mike M","site":"shroudstory"},{"title":"A Decline,  an Uptick and a Rise","post":"It seems that the ideology is Wahhabi, from Saudi Arabia and although B/L was born in Yemen his parents were Saudi. The Saudi royal family is financing most of this violence, all over the world and they have close ties with Pakistan. It is mostly Hindu India, with close ties to the US — it goes much beyond Microsoft, Zubin Mehta, Deepak Chopra, Dinesh d’Souza and Ravi Zacharias — which keeps the threat under control.\n\n","date":"June 12, 2014 at 10:53 pm","url":"https://shroudstory.com/2014/06/07/a-decline-an-uptick-and-a-rise/","cat":"news_&_views","id":"comment-128964","author":"Louis","site":"shroudstory"},{"title":"A Decline,  an Uptick and a Rise","post":"Hi Mike, Salaam valay kum. Something for you to read:\nhttp://www.thetablet.co.uk/news/889/0/mosul-s-ancient-christian-population-may-never-return-laments-archbishop-of-city-seized-by-insurgents\n\n","date":"June 14, 2014 at 11:15 am","url":"https://shroudstory.com/2014/06/07/a-decline-an-uptick-and-a-rise/","cat":"news_&_views","id":"comment-129453","author":"Louis","site":"shroudstory"},{"title":"A Decline,  an Uptick and a Rise","post":"This is how life is for Christians in Iraq and Syria now. Actual News not stories or fables, the sad thing is most of these things don’t even make it to the media in North America. They’re more concerned about removing prayers from schools and public gatherings.\n\n","date":"June 14, 2014 at 12:49 pm","url":"https://shroudstory.com/2014/06/07/a-decline-an-uptick-and-a-rise/","cat":"news_&_views","id":"comment-129477","author":"Mike M","site":"shroudstory"},{"title":"A Decline,  an Uptick and a Rise","post":"Some years ago I was invited to attend a mass said by Mor Severios Jamil Hawa, Syrian Orthodox Church metropolitan of Baghdad and spoke to him briefly during a coffee break after that. Sadly there were some internal problems affecting the clergy and more information about what was going on in Iraq was not available. From what one can see now, Mosul is finished for Christians and soon other cities will fall to extremists.\nSyria is somewhat under control with Assad and Sisi has done more in Egypt, but it is difficult for them because Saudi Arabia is behind most of the extermism.\nReligion is in decline in the West, it began in Europe and is slowly spreading in the USA, the country is becoming more secular.\n\n","date":"June 14, 2014 at 2:06 pm","url":"https://shroudstory.com/2014/06/07/a-decline-an-uptick-and-a-rise/","cat":"news_&_views","id":"comment-129510","author":"Louis","site":"shroudstory"},{"title":"A Decline,  an Uptick and a Rise","post":"Libya’s army is also trying to control the situation there. The more Secular the west becomes the more vulnerable they become to the threat in the east. Since they will lose discernment and will underestimate the dangers of radical Islam. They will simply overpopulate and then takeover.\n\n","date":"June 14, 2014 at 3:02 pm","url":"https://shroudstory.com/2014/06/07/a-decline-an-uptick-and-a-rise/","cat":"news_&_views","id":"comment-129527","author":"Mike M","site":"shroudstory"},{"title":"A Decline,  an Uptick and a Rise","post":"There is one problem there, and it is a hindrance. If the governments do something they will be labelled as “crusaders” and they do not want that because most of them have little or no Christian conviction and economic interests are involved.\n\n","date":"June 14, 2014 at 3:12 pm","url":"https://shroudstory.com/2014/06/07/a-decline-an-uptick-and-a-rise/","cat":"news_&_views","id":"comment-129530","author":"Louis","site":"shroudstory"},{"title":"A Decline,  an Uptick and a Rise","post":"I think they are better off to stay out of it. The problem is that they even support the terrorists, Obama was helping the Muslim brotherhood while they were in power and wanted to arm the Syrian rebels. They only wake up when something like 9/11 hits home.\n\n","date":"June 14, 2014 at 3:19 pm","url":"https://shroudstory.com/2014/06/07/a-decline-an-uptick-and-a-rise/","cat":"news_&_views","id":"comment-129532","author":"Mike M","site":"shroudstory"},{"title":"A Decline,  an Uptick and a Rise","post":"They were warned about this by Bashar Assad, however the warning was ignored. Last week he said that they had opened their eyes, so is that because things are sort of quiet on the front? The most dangerous extremists are not Arabs, they are foreigners, they are from Chechenia. They are the ones who kidnapped the two Orthodox bishops, who may not be alive. Look what they did in Boston, and why was Putin’s warning ignored?\n\n","date":"June 14, 2014 at 3:56 pm","url":"https://shroudstory.com/2014/06/07/a-decline-an-uptick-and-a-rise/","cat":"news_&_views","id":"comment-129549","author":"Louis","site":"shroudstory"},{"title":"A Decline,  an Uptick and a Rise","post":"Louis, I can’t really say who is more dangerous. In a televised interview a survivor from Syria said that the man responsible for the “infidels slaughterhouse”( a place were beheadings take place and human body parts were hanging like cattle.) was Egyptian. There was an American suicide bomber a month ago in Syria. One of the two who stabbed the Uk soldier in the street in England last year was a christian convert to Islam. Once someone subscribes to Jihad ideology everything changes no matter the background. That’s why they are dangerous, with the internet they can easily recruit from Europe and North America, and plan the same chaos over there. They are just too busy with Syria and Iraq now, but eventually it will happen because the west is turning a blind eye.\n\n","date":"June 14, 2014 at 4:26 pm","url":"https://shroudstory.com/2014/06/07/a-decline-an-uptick-and-a-rise/","cat":"news_&_views","id":"comment-129562","author":"Mike M","site":"shroudstory"},{"title":"A Decline,  an Uptick and a Rise","post":"Well,Mike, the leaders have been warned. The problem has even reached Shroud studies with some Albanians destroying priceless icons and wall paintings in Orthodox churches.\n\n","date":"June 14, 2014 at 5:39 pm","url":"https://shroudstory.com/2014/06/07/a-decline-an-uptick-and-a-rise/","cat":"news_&_views","id":"comment-129586","author":"Louis","site":"shroudstory"},{"title":"A Decline,  an Uptick and a Rise","post":"Mike, further to the above, I must say you are well informed by keeping track of what is going on. The link below will be very useful to you as there is much to read, even about Copts:\n http://www.pakistanchristianpost.com/communityarticlesv.php?editorialid=76\n\n","date":"June 14, 2014 at 5:46 pm","url":"https://shroudstory.com/2014/06/07/a-decline-an-uptick-and-a-rise/","cat":"news_&_views","id":"comment-129589","author":"Louis","site":"shroudstory"},{"title":"A Decline,  an Uptick and a Rise","post":"Thanks Louis, I actually attended that meeting in Mississauga\n\n","date":"June 14, 2014 at 5:55 pm","url":"https://shroudstory.com/2014/06/07/a-decline-an-uptick-and-a-rise/","cat":"news_&_views","id":"comment-129590","author":"Mike M","site":"shroudstory"},{"title":"A Decline,  an Uptick and a Rise","post":"Good for you, Mike. Keep up the good work, there will be more to do ahead.\n\n","date":"June 14, 2014 at 6:02 pm","url":"https://shroudstory.com/2014/06/07/a-decline-an-uptick-and-a-rise/","cat":"news_&_views","id":"comment-129595","author":"Louis","site":"shroudstory"}]
