[{"title":"A Reason to NOT DO More Scientific Testing on the Shroud","post":"For information, this communication is dated 28 January 2014.\n\n","date":"September 11, 2014 at 10:53 am","url":"https://shroudstory.com/2014/09/11/a-reason-to-not-do-more-scientific-testing-on-the-shroud/","cat":"science","id":"comment-150225","author":"Hugh Farey","site":"shroudstory"},{"title":"A Reason to NOT DO More Scientific Testing on the Shroud","post":"Rather?  How about arrogantly anti-clerical? The blackboard picture forever ends the myth of scientist always being unbiased.\n\n","date":"September 11, 2014 at 10:55 am","url":"https://shroudstory.com/2014/09/11/a-reason-to-not-do-more-scientific-testing-on-the-shroud/","cat":"science","id":"comment-150227","author":"Paulette","site":"shroudstory"},{"title":"A Reason to NOT DO More Scientific Testing on the Shroud","post":"C14, 1988, i think the booster shot is not really necessary.\n\n","date":"September 11, 2014 at 11:12 am","url":"https://shroudstory.com/2014/09/11/a-reason-to-not-do-more-scientific-testing-on-the-shroud/","cat":"science","id":"comment-150229","author":"anoxie","site":"shroudstory"},{"title":"A Reason to NOT DO More Scientific Testing on the Shroud","post":"There are several non-intrusive procedures that could be enormously useful. Multispectral Digital imaging (MDI) is one. MDI photographs can in fact allow chemical analysis. It is an advance of the Quad Graphics mode employed by STURP in that it allows identification of the various constituents and the distinctions among them. Think Quad Photographs on steroids. In fact, once the photography is accomplished, the digital image of the Shroud could be available world wide. It might ne several gigabytes, but even if it were several terabytes, handling such files has become almost child’s play.\nAnother example of “primitive” digital microscopy was the blood analysis work done by Heller and Adler. The began by working on minute thread with almost invisible particles of ancient blood. Of necessity the process was highly intrusive.In the past 36 years the science as advanced to the point where properly conducted the microscopy would be totally non-trusive.\n\n","date":"September 11, 2014 at 11:28 am","url":"https://shroudstory.com/2014/09/11/a-reason-to-not-do-more-scientific-testing-on-the-shroud/","cat":"science","id":"comment-150232","author":"John Klotz","site":"shroudstory"},{"title":"A Reason to NOT DO More Scientific Testing on the Shroud","post":"Multispectral analysis is great, and there would be a lot more interesting tests needed. Bishop Sanchez Sorondo has just said why it is still not the right timing, keeping in mind the blackboard picture.\nIt’s up to scientists to build a team and a thorough protocol, clearing out vain controverses-the hard part.\n\n","date":"September 12, 2014 at 1:12 am","url":"https://shroudstory.com/2014/09/11/a-reason-to-not-do-more-scientific-testing-on-the-shroud/","cat":"science","id":"comment-150370","author":"anoxie","site":"shroudstory"},{"title":"A Reason to NOT DO More Scientific Testing on the Shroud","post":"It is not merely the question of new techniques, nor the scientific competence of those engaged to apply them, The mainly American STURP team of 1978, not only had the latest techniques then available and the necessary competence, but they were drawn from a wide range of backgrounds, Catholic, Protestant and Agnostic.  Most of them approached their tasks with an open mind, with only one notable exception, and yes there were Shroudie enthusiasts such as John Jackson and a few others.  However this enthusiasm had developed from their own previous research on the Shroud, such as their VP-8 work.  Nevertheless most of the team approached their work in an objective and professional manner, and put their personal agendas aside.  The seeming arrogance adopted in presenting the 1988 C-14 results stands in marked contrast.\n\n","date":"September 11, 2014 at 4:28 pm","url":"https://shroudstory.com/2014/09/11/a-reason-to-not-do-more-scientific-testing-on-the-shroud/","cat":"science","id":"comment-150271","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Reason to NOT DO More Scientific Testing on the Shroud","post":"The Pontifical Academy of Sciences consists of 80 academicians, including such highly respected scientists as Maxine Singer, Gunter Blobel, Stephen Hawkins, Paul Berg, and Francis Collins (the current director of the NIH) to name a few.  The academicians are “chosen by the Academy on the basis of their eminent original scientific studies and of their acknowledged moral personality, without any ethnical or religious discrimination, and are appointed for life by sovereign act of the Holy Father.” [taken from the PAS website] Numerous scientific notables are present within the PNAS itself that could oversee the development or delegation of “something scientific”.  Science is neither anti-clerical or pro-clerical.  It’s about objectively trying to find out the truth.\n\n","date":"September 11, 2014 at 6:26 pm","url":"https://shroudstory.com/2014/09/11/a-reason-to-not-do-more-scientific-testing-on-the-shroud/","cat":"science","id":"comment-150295","author":"Kelly Kearse","site":"shroudstory"},{"title":"A Reason to NOT DO More Scientific Testing on the Shroud","post":"Notwithstanding the eminent standing of the Pontifical Academy of Sciences, nor the Papal representative Professor Chagas (reportedly a Shroud skeptic) and his clearly defined protocols, it was the Turinese on site who determined the proceedings in the actual practice in 1988!  What price the Academy then?  Would anything be different now?\n\n","date":"September 11, 2014 at 7:47 pm","url":"https://shroudstory.com/2014/09/11/a-reason-to-not-do-more-scientific-testing-on-the-shroud/","cat":"science","id":"comment-150310","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Reason to NOT DO More Scientific Testing on the Shroud","post":"Sorry-typo-PNAS is a major scientific journal (Proceedings of the National Academy of Sciences-should read within the PAS itself\n\n","date":"September 11, 2014 at 6:31 pm","url":"https://shroudstory.com/2014/09/11/a-reason-to-not-do-more-scientific-testing-on-the-shroud/","cat":"science","id":"comment-150297","author":"Kelly Kearse","site":"shroudstory"},{"title":"A Reason to NOT DO More Scientific Testing on the Shroud","post":"Read between the lines: an emphatic no!\n\n","date":"September 11, 2014 at 6:52 pm","url":"https://shroudstory.com/2014/09/11/a-reason-to-not-do-more-scientific-testing-on-the-shroud/","cat":"science","id":"comment-150298","author":"Andy","site":"shroudstory"},{"title":"A Reason to NOT DO More Scientific Testing on the Shroud","post":"Archbishop Marcelo Sánchez Sorondo is highly qualified and the Church learns from mistakes. It is 2000 years old. Public relations will always be there, but no Shroud website, publication,newsletter, conference, congress, lecture, book, petitions to the Pope, will make Rome budge. Rome moves slowly and carefully and we must not forget that the TS is not an Article of Faith, it is not essential for faith, although some Shroudies may use it as a prop for faith. What if there was no TS? We have discovered many things about existence, and continue to make more discoveries every, single day and it is not the TS that will remove all doubts. There is a lot more in the box.\nShroudies who are believing Christians will have to cling to Paul, “If Christ be not risen, your faith is in vain.” God does turn down the blinds.\n\n","date":"September 11, 2014 at 9:39 pm","url":"https://shroudstory.com/2014/09/11/a-reason-to-not-do-more-scientific-testing-on-the-shroud/","cat":"science","id":"comment-150329","author":"Louis","site":"shroudstory"},{"title":"A Reason to NOT DO More Scientific Testing on the Shroud","post":"It is not only the TS, there is also Noah’s ark:\nFor those who are in England:\n“The Real Noah’s Ark”, Sunday, 14th September, 8.00 PM, on Channel 4.\nWho knows, next will come Moses’ wand and then a feather from Saint Michael.\n\n","date":"September 11, 2014 at 10:22 pm","url":"https://shroudstory.com/2014/09/11/a-reason-to-not-do-more-scientific-testing-on-the-shroud/","cat":"science","id":"comment-150336","author":"Louis","site":"shroudstory"},{"title":"A Reason to NOT DO More Scientific Testing on the Shroud","post":"I’m just probably a slow to learn folks. U have a question, When our Lord comes for his final visit – how many many years do we think he will wait for these folks to run their tests on Him ?? I see all the retesting as some sort of denial syndrome.  I don’t want to be in ine when they are foing through their past life look at.\n.\n\n","date":"September 11, 2014 at 10:49 pm","url":"https://shroudstory.com/2014/09/11/a-reason-to-not-do-more-scientific-testing-on-the-shroud/","cat":"science","id":"comment-150344","author":"Emmett McMahon","site":"shroudstory"},{"title":"A Reason to NOT DO More Scientific Testing on the Shroud","post":"After re-reading the post & comments, I see more clearly that the Bishop’s statement appears to be in the specific context of C14 testing, and not scientific testing in general.  I also see the e-mail was written in January 2014, and not a type of summary statement in reference to the recent conference.  My previous comment was directed towards more investigation, in general, i.e. If formal scientific studies on the Shroud were ever to be considered in the future\n\n","date":"September 12, 2014 at 5:17 am","url":"https://shroudstory.com/2014/09/11/a-reason-to-not-do-more-scientific-testing-on-the-shroud/","cat":"science","id":"comment-150410","author":"Kelly Kearse","site":"shroudstory"},{"title":"A Reason to NOT DO More Scientific Testing on the Shroud","post":"Has there been any specific recent response from the Turin authorities on the C14 tests? The latest I have  found was a robust defence of the testing procedures and the dates from Luigi Gonella himself published in Turin in 2000 – it is reproduced in Silvano Scannerini and Piero Savarino (eds.), The Turin Shroud: Past, Present and Future, Turin, 2000, pp. 507-13 and Gonella gives the impression he is deeply offended by the attacks made on the procedures.\n\n","date":"September 12, 2014 at 6:06 am","url":"https://shroudstory.com/2014/09/11/a-reason-to-not-do-more-scientific-testing-on-the-shroud/","cat":"science","id":"comment-150420","author":"Charles Freeman","site":"shroudstory"},{"title":"A Reason to NOT DO More Scientific Testing on the Shroud","post":"One wonders why Professor Luigi Gonella was offended by the attacks made on the procedures. He tossed aside the protocols carefully prepared by Professor Carlos Chagas, president of the PAS. Then he spent a good amount of time arguing with Professor Giovanni Riggi about the site from where the sample had to be taken in 1988, keeping the other scientists waiting patiently.Professor Chagas did not believe in the authenticity of the relic, and it is unlikely that Professor Gonella did. Later, shortly before he died, the papal custodian Cardinal Anastasio Ballestrero gave an interview saying that he was manipulated. Given what I heard from an authority close to the Vatican, there had been a lot of pressure on the Church.\nIt is important to ask,Why all this pressure? Is it to clear the doubts of Christians with weak faith? Or is it to satisfy the desires of anti-Christians? If Rome placed that much importance on a relic that is not an article of Faith Pope John Paul II would have requested Umberto II di Savoia to allow him to place the relic on the High Altar at Saint Peter’s and not preserved at the Royal Chapel in Turin. \nArchbishop Marcelo Sánchez Sorondo is no fool, he is a highly-qualified prelate who is also well-informed. It is clear that it is pointless to continue to exert pressure on the Church.\n\n","date":"September 12, 2014 at 8:48 am","url":"https://shroudstory.com/2014/09/11/a-reason-to-not-do-more-scientific-testing-on-the-shroud/","cat":"science","id":"comment-150454","author":"Louis","site":"shroudstory"},{"title":"A Reason to NOT DO More Scientific Testing on the Shroud","post":"Gonella was defending himself against those who had criticised his role and the testing procedures as they were finally carried out. He was publicly defending a 1260-1390 date: so presumably he did not believe the Shroud was authentic.So was he representing just his personal view or was he the frontman for others? Obviously others know more about the politics of all this than I do.\n\n","date":"September 12, 2014 at 9:21 am","url":"https://shroudstory.com/2014/09/11/a-reason-to-not-do-more-scientific-testing-on-the-shroud/","cat":"science","id":"comment-150457","author":"Charles Freeman","site":"shroudstory"},{"title":"A Reason to NOT DO More Scientific Testing on the Shroud","post":"I think the clergy needed no frontman, it was Professor Gonella’s point of view and Cardinal Ballestrero’ s interview was the last word. That seems obvious because the expositions continue.\n\n","date":"September 12, 2014 at 11:35 am","url":"https://shroudstory.com/2014/09/11/a-reason-to-not-do-more-scientific-testing-on-the-shroud/","cat":"science","id":"comment-150480","author":"Louis","site":"shroudstory"},{"title":"A Reason to NOT DO More Scientific Testing on the Shroud","post":"You’re kidding, Charles.  Gonella’s penultimate sin was to go along with not videoing the placement of the samples into the metal cylinders.  This was reportedly the only part of the process that was not video’d. If Ballestro was manipulated, as he said, then it was Tite plus Gonella in that back room against Ballestro.\n\n","date":"September 13, 2014 at 10:07 am","url":"https://shroudstory.com/2014/09/11/a-reason-to-not-do-more-scientific-testing-on-the-shroud/","cat":"science","id":"comment-150709","author":"Nabber","site":"shroudstory"},{"title":"A Reason to NOT DO More Scientific Testing on the Shroud","post":"I thought that Nabber’s conspiracy theory was dead, killed by ridicule  – how wrong I was.\n\n","date":"September 13, 2014 at 1:02 pm","url":"https://shroudstory.com/2014/09/11/a-reason-to-not-do-more-scientific-testing-on-the-shroud/","cat":"science","id":"comment-150751","author":"Charles Freeman","site":"shroudstory"},{"title":"A Reason to NOT DO More Scientific Testing on the Shroud","post":"One also wonders what Stephen Hawking, as a member of the PAS, thinks about the Turin Shroud. Last week he said that it is likely that the universe will be destroyed. Fine, many scientists think so, he is not alone.\nOnly, by saying this he continues to not find an answer to an important question he himself raised some time ago. He is a highly intelligent and truth-seeking scientist and knows that there is a lot more in the box, there are mind-boggling questions demanding answers. \nEven if he thinks that “spontaneous creation” — his words—  is involved in the creation of the universe and now the possibility of spontaneous destruction —- I believe he thinks so — is strong he would still need to fill the existential vacuum. He is humble, he is now sticking to science and leaving the rest to theologians and philosophers. \nThe unanswered questions raised by him can be found in the second and third paragraphs:\nhttps://www.academia.edu/4700001/What_do_we_know_about_the_Bible_An_interview_with_Joseph_A._Fitzmyer_SJ\n\n","date":"September 12, 2014 at 9:26 am","url":"https://shroudstory.com/2014/09/11/a-reason-to-not-do-more-scientific-testing-on-the-shroud/","cat":"science","id":"comment-150458","author":"Louis","site":"shroudstory"}]
