[{"title":"Jesus’ Wife Papyrus Update","post":"This is a waste of space, Dan.  The myth that keeps on popping up without meaning or substance.\n\n","date":"January 9, 2013 at 9:14 am","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-21777","author":"Andy Weiss","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"Isn’t this fragment from the 4th century?  For the life of me, I don’t know why any credence is given to a single document, a small fragment thereof, with a cryptic reference to Jesus and “wife” in the same sentence without knowing the larger context….and written 300 years after the events in question.  It just goes to show that there is an element in the world and unfortunately in the church too, that want to humanize Jesus as much as possible.  It reminds me of the pop song by Joan Osborne, “What if God was one of us?  Just a slob like one of us, just a stranger on the bus trying to make his way home.”\n\n","date":"January 9, 2013 at 10:36 am","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-21784","author":"Russ Breault","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"Andy and Russ are spot on. \nI read a great phrase one time which I think was on Barry’s site which I’ll paraphrase: ‘Science by press release’, which is to say, meritless hype created for sake of doubt. The same thing applies here in my mind: this is research by press release with the sole purpose of creating doubt via hysteria. \nThe devil has many tricks up his sleeve to extract his pain on man but he shall never prevail.\n\n","date":"January 9, 2013 at 1:08 pm","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-21787","author":"Chris","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"I think the comments above are missing the point and are off the mark.  It is almost certain that Jesus was not married – the gospels and most NT apocrypha silence about a wife are persuasive evidence that Jesus was not in fact married and there can be litle argument about that.  The responses above suggest a reaction against some unspecified assertion that he was.  I doubt if any serious scholars would now make such an assertion. \nHowever in early Christianity, both orthodox and gnostic, there was an active debate about the competing merits of celibacy and married life, because of an early unfulfilled expectation of the Parousia – evidence for this debate can be found in Paul’s writings for instance.  The fragment, if indeed it is authentic, should only be seen in that light.  It may be evidence of some sect’s attempts to justify marriage as a way of life, as opposed to celibacy.  An alternative explanation may be that “the wife” is intended to refer to the church.  \nThe prolonged duration of the testing period to establish authenticity, suggests that there may well have been some kind of problem with establishing authenticity.  However, as I’ve observed above, it is curious that the Harvard journal has announced its intention still to publish King’s paper, implying that the question of authenticity still remains open.\n\n","date":"January 9, 2013 at 3:33 pm","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-21797","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"Well perhaps “serious scholars” wouldn’t put forth a theory that Jesus was married but popular media…you know the ones that influence culture, movies, junk novels, Discovery Channel “documentaries” and our children…is replete with it.  The the DaVinci Code sold over 60 million copies worldwide.  The Harvard Journal may yet print the paper and it may be read by a couple thousand people at best.  Meanwhile our junk media will cover the story as though it was a breaking news headline and Hollywood won’t be far behind.  That is the problem, no one pays attention to the serious scholars.  If they did, this paper would never get published.\n\n","date":"January 9, 2013 at 5:03 pm","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-21802","author":"Shroud Encounter","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"Where is the update here? One can only see stale news, as anyone who remembers the comments posted on this very blog around two months ago will recognise. No gnostic — in the real sense of the word — document can be traced before AD 150 and there is a lot of feminism behind the interest in “Jesus’ wife,” providing cause for suspicion. It makes no difference if Harvard eventually publishes the paper. Why? Because there is a tell-tale sign. A tiny piece of papyrus says nothing. It is the context that one must read, whether the fragment is a fake or not. Of course, that is convenient to Karen King, who seems to have fallen in love with the fragment. It suits her worldview.\n\n","date":"January 9, 2013 at 5:56 pm","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-21804","author":"Louis","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"I wouldn’t be surprised if this papyrus turns out to be a fake. The thing that bothers me is the fact that the media sensationalize something like this solely (it seems), because it places scourn or adds controversy to the Gospel truth and Jesus’s life. Funny no mention is ever heard of the studies done by now deceased archaeologist, papyrologist Carlsten Thiede’s findings of the Jesus Papyrus; Three fragments hidden away in a Oxford library for a century, only to be studied by Thiede, an expert, and found to date most convincingly to 60AD!, -Making it the oldest new testiment writing ever found, and in which also adds a surprising new light to the last supper narrative. I recently viewed an excellent documentary on this and if anyone is interested they can find it on Youtube., Just key in on Youtube; Eyewitness to Jesus-TLC Documentary to find the full version of the video….I’m curious to hear people’s thoughts on this.\nThanks,\nR\n\n","date":"January 9, 2013 at 7:06 pm","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-21810","author":"Ron","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"What Carsten Peter Thiede found in Oxford was easy to identify because the text was known, however his support for Father José O’Callaghan’s identification of Qumran fragment 7Q5 as a part of a Greek New Testament text is controversial. Of the two world renowned biblical scholars interviewed by me for a major newspaper some years ago, one rejected his view while the other pointed to the controversy. Thiede did not appreciate the article’s mention of the computer he used to check the compatibility of the letters in the fragment with “hundreds” of ancient Greek texts. \nWhat can be said today is this: The controversy is not over. From my point of view Israeli archaeologist Yigael Yadin’s view that Jesus referred to the Essenes as “Herodians” is roughly correct. They were not obliged to make an oath of loyalty to Herod and their War Manual has some details that show dependence on a Roman military manual. So, if they could use texts coming from the pagan “minim”, Romans, they could also house in their scriptorium texts written by a rival group, the Jewish-Christians, not part of “normative” Judaism like them. Someone in Qumran may have not liked the idea and tore the scroll and only a tiny fragment survived. \nThe problem is that the fragment is in Greek. When was it written? Would the Jewish-Christians write in Greek, before AD 70,the year the Tenth Roman Legion under the command of Vespasian destroyed Qumran on the way to besiege Jerusalem? The interesting study made by Father Jean Carmignac shows the Aramaic/Hebrew background of the New Testament. A little more is learnt from an interview given by Italy’s first Messianic (Jewish-Christian) rabbi Carlo Caruso who dwells on this background and can be found at http://www.bhb.it/edipi/infoisrael/info.html where the pdf (in Italian) can be downloaded by clicking on 03/2007-01 novembro 2007.\n\n","date":"January 9, 2013 at 9:22 pm","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-21811","author":"Louis","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"Your missing my point, which was that not much of a fuss was or has been made by the media with the fact these three fragments ‘may’ be the oldest and best evidence for the writing of the NT prior to the fall of Jerusalem in 70ad and putting their writing well within the eye-witness period. Considering this probability, no big deal is made of the find, and solely because some biblical scholars, not papyrologists or specialists in such, oppose the findings. Same goes for the controversy on the 7Q5 fragment, the only opposition comes from non-specialist scholars.\nAs to your question and problem mentioned in your last paragraph above, that the fragment is written in Greek..Whats the problem? Greek was the universal language in the first century. In what language something was written, would depend on what audience it was written for. I would not doubt atleast one or two of the Gosples and maybe Acts, were originally written in Greek.\nR\n\n","date":"January 12, 2013 at 3:56 pm","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-21940","author":"Ron","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"A minority view holds that there were Aramaic texts which formed some part of the basis of the synoptics.  However it is not a common view, and this view might well only stem from the evidence of the more naturally Aramaic style of the authors.  It would seem most likely that Jesus would preach in Aramaic, and also speak Aramaic among his intimates.  It needs to be remembered that in these early cultures there was a strong tradition of accurate oral recall (It is still evident in the recital of traditional NZ Maori genealogies and their other customary recitals) – there was not the same requirement to rely on written material as there is in a modern culture.  So whether there was the need for Aramaic written sources or not can be argued.  No Aramaic original sources have ever been found.  Furthermore, both Mark and Matthew were writing for predominantly gentile churches, essentially Hellenic.  Luke’s polished Greek is certainly the original language, and likewise there can be no question about John’s Greek.  If the fragments mentioned above are authentic, it is hardly surprising that they would be primitive or koine Greek. \nWe should note that even in Mark, Aramaic phrases occur which are then deliberately transliterated into Greek.  This would hardly be the case if the original language of Mark was Aramaic.  Encyc Brit comments: “In Mark, some Aramaic is retained, transliterated into Greek, and then translated-e.g., in the raising of Jairus’ daughter (5:41) and in the healing of the deaf mute (7:34). The well-known abba, Father, is retained in Mark’s account of Jesus’ prayer in Gethsemane. In the two miracle stories, the Aramaic may have been retained to enhance the miracle by the technique of preserving Jesus’ actual words. And a cry of Jesus on the Cross is given in Aramaized Hebrew.”  All this would seem to argue that the original language here was Mark’s rough Greek.\n\n","date":"January 13, 2013 at 6:20 am","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-21945","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"When I read Dave, I cannot help wondering which side the blindfold speculation really strives… He’d better read all the Biblical scholars (nearly two dozens) who advocate for the 4 gospels an Aramaic/Hebrew substratum (notes written by disciples on wax tablets + their jot down oral translation into koine Greek after that of the  Septuagint i.e. the Greek version of the Hebrew Bible. Methinks Dave just very superficially read the other side of the issue and discarded a bit too hastily the Gospels’ Hebrew/Aramaic substratum thesis.\n\n","date":"January 13, 2013 at 9:10 am","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-21949","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"Typo: jotted down oral translation into koine Greek\n\n","date":"January 13, 2013 at 9:17 am","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-21950","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"My posting was prompted by the Louis comment: “The problem is that the fragment is in Greek. When was it written? Would the Jewish-Christians write in Greek, before AD 70 …”\nMax’s comment: “… advocate for the 4 gospels an Aramaic/Hebrew substratum (notes written by disciples on wax tablets + then jot down oral translation into koine Greek …” I could probably accept with some reservation, in that I think it unlikely that Luke and John had recourse to Aramaic sources.  The preachng was very likely in Aramaic, fishermen’s competence in literacy was probably limited to their commercial requirements, although a few of the disciples, e.g. Levi (or Matthew), probably had scribal literacy, wax tablets would hardly create any kind of permanent record, more likely an initial aid to prompt oral recall, transcription into koine Greek – yes;  the Greek Septuagint was the version of the OT commonly used, its use by the early Christians prompted a Jewish reversion to a Hebrew text only late in the first century but without the Septuagint, apocrypha (deutero-canonical) texts,   However the gospel authors went much further than merely transcribing Aramaic preaching – they were writing for a gentile church, where the common language was essentially koine Greek.\n\n","date":"January 13, 2013 at 3:07 pm","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-21965","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"Firstly, most likely YoHanan/John’s gospel  was written up from Y/J’s own notes mostly in Hebrew  and the same Y/J translated them into koine Greek. \nSecondly, of Mark’s 11,025 words, only 132 have no parallel in either Matthew or Luke. Percentage-wise, the fact is 97% of Mark’s Gospel is duplicated in Matthew; and 88% is found in Luke. On the other hand, less than 60% of Matthew is duplicated in Mark, and only 47% of the Luke’s same words (and often in the exact same order) is found in Mark, which is in total contradiction with your “I think it unlikely that Luke (…) had recourse to Aramaic sources since most likely Matthew and Mark were written up (with Hebrew letters) from notes in Aramaic.  \nThirdly notes first jotted down in Aramaic onto wax tablets were then transcribed into sections onto a scroll that was made out of  pieces of goatskin vellum, which was later stitched. \nFourthly,  “. . . careful writers of Greek avoided foreign words, which might explain why such better writers of Greek as Matthew and Luke would tend to omit the Aramaisms found in their source.” (see Stein’s observation in Synoptic Problem, 58).\nFifthly a 1st c. CE  Ebionite/Hebrew that was lost was not written in koine Greek but in Aramaic (with Hebrew letters) as a copy of Aramaic/Hebrew Matthew.\n\n","date":"January 13, 2013 at 5:15 pm","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-21966","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"Typo: …a 1st c. CE Ebionite/Hebrew GOSPEL that was lost…\n\n","date":"January 13, 2013 at 5:17 pm","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-21967","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"Anyone who read #8 carefully would notice that an open mind has been kept. It was stated that it is possible that there were Greek gospels before AD 70. The problem with many Christians is that they have developed a complex about the dating of the gospels and try to find “hard evidence” of eye-witness accounts, other texts and so on. Unfortunately Thiede was one of them and 7Q5 remains controversial and cannot be construed as hard evidence of a Greek NT text in the possession of the Essenes. As maintained by some scholars, many Essenes may have become Christians years after the crucifixion, in fact reports say that DNA studies of the Nasrani Christian (originally Jewish-Christians) community in India have demonstrated a link with the “kohanim’, Cohen, or priests, perhaps leading to some link with the Essenes. The Essenes believed that they, and not the Sadducees, the “saduchim”, were the true priests.  \nAs Schweitzer noted, Jesus is “alive” when you read the gospels, the impact is very strong. That is why Jesus is “avatar” in Hinduism, having been recognised as such a divinity by the country’s towering figures like Swami Vivekananda and Mahatma Gandhi. He is now inextricable in Hinduism and the more daring scholars say he would have been understood if he had been born there. If the search for eye-witness texts, fragments is unnecessary for non-Christians there, why should it be so important for Christian scholars?\n\n","date":"January 13, 2013 at 6:32 pm","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-21969","author":"Louis","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"The final versions we now have of both Matthew’s and John’s gospels appear to have gone through a series of complex redactions.  \nIn the case of John, there is a detailed knowledge of Jewish geography and religious practices and it claims to have been written by an eye witness, a disciple, the one whom Jesus loved.  However the closing verses of the gospel indicates its final form was compiled by a Johannine school, probably at Ephesus.  The source for the several detailed discourses, particularly those at the Last Supper are a serious problem.  The discourses are several, long and involved.  They purport to have been said by Jesus. John’s gospel was known by about 100 AD, but its acceptance as canonical did not come about until 180 AD.  There are few indications that it was originally Aramaic, and there is an absence of the usual signs of translation into Greek.  The assertion that the words were first written onto wax tablets and later transcribed onto goat-skin, would seem to owe more to a ‘post hoc’ creative imagination to justify a position, rather than on any kind of hard evidence. \nThe percentages of Mark’s gospel found in Matthew and Luke, as quoted by Max, are inaccurate.  Encyc Brit states that of Mark’s 661 verses, some 600 appear in Matthew (i.e. 90.8%), and 350 in Luke (53.0%).  Only 31 verses of Mark (5.7%) appear in neither.  Where any two of the synoptics agree against the third, it is always Mark and Matthew that agree against Luke, or Mark and Luke that agree against Matthew.  Matthew and Luke never agree against Mark.  This points to Mark’s gospel being used as a source by Matthew and Luke.  Furthermore there is a distinct “telling it like it is” in Mark, whereas Matthew and Luke are more circumspect.  A simple example from Jesus’ preaching in his home-town: In Mark we have “Is this not Jesus the woodworker?”  becomes in Matthew “Is this not the son of the woodworker?” and in Luke “Is this not the son of Joseph?” (no mention of a manual trade!)  Mark’s writing of Jesus’ anger or the disciples’ shortcomings is more restrained in the more respectful later gospels of Matthew and Luke.  \nThe common material found in Matthew and Luke, but not in Mark, generally the logia or sayings, have been postulated as coming from a separate source, sometimes referred to as ‘Q’.  However the placing of this material varies in both gospels after chapter 4.  The commentaries in the Jerusalem Bible translation, under general editorship of Alexander Jones, are not entirely satisfied with this theory.  They fall back on Papias 125 AD assertion that Matthew wrote the sayings in the Hebrew tongue, and identify it as “Matthew Aramaic”.  They see a certain roughness in some of Matthew which justifies this position, and claim that even Mark used some of this material.  I am uncertain to what extent these commentaries may be concerned to respect the patristic sources, which for all we know may only be faulty best guesses on their part to provide an adequate explanation as to the origin of the gospels,  Other patristic sources which say much the same thing are merely echoing Papias.  Yet it was Papias who said that he preferred the oral traditions to anything written, thus testifying to a “teaching church” rather than a “writing church”.  Not all the fathers had a great respect for Papias’ opinions (e.g. “a man of little brain”).  \nAs to the congregation for which Matthew’s gospel was written – the general consensus seems to be that it was written for Judaic converts to Christianity, somewhere in Syria, possibly Antioch.  There is frequent reference to Christ fulfilling the prophecies of the OT, Matthew is concerned to portray Jesus as the new Moses – he brings him out of Egypt, he has him preaching from a mountain (c.f. Luke has him on an open field), and so on.  However Matthew is also concerned to demonstrate Jesus as the Messiah to the gentiles – gentiles in his ancestry, the wise men from the east, frequent cures involving gentiles.  \nThe conclusions we may draw from either internal or external evidence, can never be final, and I think it ill behoves any of us to make dogmatic assertions about whatever opinions we may conceivably reach.  Like the Shroud, the origins of the gospels in their final form are hidden in the mists of time, but they exist for the present, to enhance our lives, and to give witness, as we may allow them to do so.\n\n","date":"January 15, 2013 at 12:15 am","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-22025","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"Dave you wrote: \n  “There are few indications that it was originally Aramaic”. Cannot you read me? Actually I wrote: “most likely YoHanan/John’s gospel was written up from Y/J’s own notes MOSTLY IN HEBREW.” \n  “There are few indications” ONLY for those like you who totally or almost totally\n IGNORE all the biblical scholars advocating notes in Hebrew as a substratum to YoHanan/John’s gospel. And if “the closing verses of the gospel MAY (mine) indicate its final form was compiled by a Johannine school, probably at Ephesus”, this accounts for my\n“MOSTLY (that is “not totally”) IN HEBREW (besides a few Aramaisms). Actually, there are nearly two dozens of Biblcal Scholars who DO AGREE on a much earlier date than late 1st c. CE for YoHanan/John’s gospel. A fact you TOTALLY overlook. BTW where are EXACTLY your alleged ‘hard’  (beyond the shadow of a rational doubt) evidence that Y/J’s gospel was FIRST written in koine Greek late in the 1st c. CE? \n  Then you wrote: “The percentages of Mark’s gospel found in Matthew and Luke, as quoted by Max, are inaccurate. Encyc Brit states that of Mark’s 661 VERSES (my bolds), some 600 appear in Matthew (i.e. 90.8%), and 350 in Luke (53.0%). Only 31 verses of Mark (5.7%) appear in neither.”\n  Cannot you read me again? Actually I wrote:  “of Mark’s 11,025 WORDS (my bolds), only 132 have no parallel in either Matthew or Luke. Percentage-wise, the fact is 97% of Mark’s Gospel is duplicated in Matthew; and 88% is found in Luke. On the other hand, less than 60% of Matthew is duplicated in Mark, and only 47% of the Luke’s same WORDS (and often in the exact same order) is found in Mark.” It does seem you totally ignore how statistics are applied to the 3 synoptic gospels since you mistook WORDS for VERSES… BTW the figures I gave are NT scholar’s, Robert Stein (see his Synoptic Problem, 48). \n  How can you mistake WORDS for VERSES? This is beyond me! Methinks also you are just putting words in my mouth and biase the whole debate here. Methinks both ignorance and inaccuracy are definitely on you side as far as the NT is concerned!\n  Sole point of semi-agreement between us: I also hold to Markan priority BUT YET just in terms of Synoptic Gospels. Y/J’s Gospel might well be earlier to Mark’s (actually Peter’s testimony in Aramaic transcribed & literally translated into koine Greek by YoHanan/John Maqqaba/Mark).\n\n","date":"January 15, 2013 at 10:07 am","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-22056","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"Typo: Y/J’s Gospel might well have been written earlier than Mark’s\n\n","date":"January 15, 2013 at 10:20 am","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-22057","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"…in terms of notes used as a textual core by Y/J to write up his gospel.\n\n","date":"January 15, 2013 at 10:27 am","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-22058","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"Dave, BTW why don’t you tell eminent NT scholar’s, Robert H. Stein, statistics are inaccurate?\n\n","date":"January 15, 2013 at 11:27 am","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-22060","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"Dave you wrote: “The percentages of Mark’s gospel found in Matthew and Luke, as quoted by Max, are inaccurate.” Really?\n\n","date":"January 15, 2013 at 11:30 am","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-22062","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"Dave, stop mistaking my words each time, PLEASE!\n\n","date":"January 15, 2013 at 12:22 pm","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-22065","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"Because of the varying views among biblical scholars, the ultimate authority I prefer to have recourse to is the very long and comprehensive article on Biblical Literature contained in the Encyclical Britannica, which is at least a reasonably universally recognised authority.  This is not to say that Encyc Brit is necessarily infallible, as several of its various articles have been completely revised over the decades as new information comes to light through research and scholarship.  However I consider that for the most part, it is as reliable an authority as is available at any given time.  From the article’s introduction I surmise that the principal contributors on the gospel sections include: The Rev. Krister Stendahl: Bishop of Stockholm, 1984-88. Andrew W. Mellon Professor of Divinity, Harvard University, 1981-84; Dean, Divinity School, 1968-79.  Others have also contributed.  \nA few Encyc Brit extracts on authorship and dating of John’s gospel follow: \n“Irenaeus calls John the beloved disciple who wrote the Gospel in Ephesus. Papias mentions John the son of Zebedee, the disciple, as well as another John, the presbyter, who might have been at Ephesus. From internal evidence the Gospel was written by a beloved disciple whose name is unknown. ”\n“Because both external and internal evidence are doubtful, a working hypothesis is that John and the Johannine letters were written and edited somewhere in the East (perhaps Ephesus) as the product of a “school,” or Johannine circle, at the end of the 1st century. The addressees were Gentile Christians, but there is accurate knowledge and much reference to Palestine, which might be a reflection of early Gospel tradition. ”\n“The Jews are equated with the opponents of Jesus, and the separation of church and synagogue is complete, also pointing to a late-1st-century dating. The author of John knows part of the tradition behind the Synoptic Gospels, but it is unlikely that he knew them as literary sources. His use of common tradition is molded to his own style and theology, differing markedly with the Synoptics in many ways. ”\n“Yet, John is a significant source of Jesus’ life and ministry, and it does not stand as a “foreign body” among the Gospels. Confidence in some apostolic traditions behind John is an organic link with the apostolic witness, and, from beginning to end, the confidence is anchored in Jesus’ words and the disciples’ experience-although much has been changed in redaction. Traces of eyewitness accounts occur in John’s unified Gospel narrative, but they are interpreted, as is also the case with the other Gospels. ” \nIt notes that John’s Greek is relatively simple, and that various background influences have been suggested including: Greek philosophy; Works of Philo of Alexandria, Hermetic writings, Gnosticism, Mandaeism, Palestinian Judaism; Wisdom components from Qumran.  \nAll of the above is consistent with my previous assertions that John’s gospel is a product of complex redactions, that its final form was written in Greek and compiled by a Johannine school, probably in Ephesus towards the end of the end of the 1st century, that its detailed knowledge of geography and Judaic religious practices support an apostolic origin but not necessarily final authorship.  Clearly there had to be some process from when the original Aramaic or Hebrew sources became embedded into the gospel’s final Greek form.  Evidently the contributors are not prepared to speculate on what that process might have been, nor to such components as oral recall or written notes.  Neither shall I.  The observation that some two dozen biblical scholars consider a much earlier dating viable is interesting, but here it depends on what they mean by that.  The gospel itself is extremely complex, As its origin clearly has links to apostolic times, there had to be some material, either written or oral, available quite early.  However the complex treatment of that material evidently took some duration, and we only know the gospel in its final form.  There would seem to be little point in compiling such a complex gospel until such time as a need for it came to be recognised.  The highly developed theology in chapter 1, as to the Word existing from the beginning, contrasts with the synoptics’ origins of Jesus, Mark’s opening section on his baptism in the Jordan, and the Mattean and Lucan infancy narratives, which I think are strong arguments against John’s predating the synoptics. \nMy response on the synoptic statistics, to follow.\n\n","date":"January 15, 2013 at 4:31 pm","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-22073","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"Dave, do you seriously think IT IS MOST LIKELY the extant final koine Greek form of both Y/J’s Gospel and  the Synoptic Gospels JUST CANNOT HAVE ANY Hebrew/Aramaic and/or Aramaic substrata/um (written and oral)?\n\n","date":"January 15, 2013 at 5:00 pm","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-22076","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"Response: No, I do not!  From mine above re John: “Confidence in some apostolic traditions behind John is an organic link with the apostolic witness, and, from beginning to end, the confidence is anchored in Jesus’ words and the disciples’ experience-although much has been changed in redaction. Traces of eyewitness accounts occur in John’s unified Gospel narrative, but they are interpreted, as is also the case with the other Gospels.” (Encyc Brit);  Also: “its detailed knowledge of geography and Judaic religious practices support an apostolic origin but not necessarily final authorship.”  And: “As its origin clearly has links to apostolic times, there had to be some material, either written or oral, available quite early.”  BUT – All within the context written above!  I previously noted Papias’ comment that Matthew had written the sayings in Hebrew and everyone translated them as best they could.  I could speculate that this might be the so-called ‘Q’ source, and it might be the reason that Matthew’s name came to be associated with the so-named gospel to give it apostolic authority – in that gospel, the disciple named Levi is changed to Matthew.  But how reliable is Papias?  We can’t be sure.\n\n","date":"January 15, 2013 at 5:43 pm","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-22079","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"Reminder: Carmignac just dates Greek Mark as before 70 CE so Matthew also before that date. In Tresmontant’s eye, Matthew in both Hebrew and Greek could be dated as having been written soon after the resurrection event, Luke between 40-60 CE, with Mark 50-60 AD. Robinson placed Matthew at 40 to after 60 CE, Mark at about 45 to 60 CE.\n  How long will you keep ignoring Robinson’s, Tresmontant’s, Carmignac’s, Genot-Bismuth’, Loth’s and Wenham’s works etc JUST because they go against the consensus?\n\n","date":"January 15, 2013 at 5:36 pm","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-22078","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"I have no problems with Mark being written before 70 AD and think it most probable.  You earlier agreed on Marcan priority, so it does not follow that Matthew was also written before 70 AD, I think quite the reverse, that it was more likely written after 70 AD.  The variety of assertions made by the other scholars you mention is the reason why I prefer something more authoritative, until there is adequate evidence to the contrary.  I no longer have the advantage of the availability of youthful time on my hands to make novel adventures into unconventional research, and at my stage of life prefer to study the scriptures as we now have them, rather than unnecessary speculations as to their origins, intriguing though such an adventure might be.\n\n","date":"January 15, 2013 at 6:06 pm","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-22081","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"OK Dave, just KEEP IGNORING half of a century of NT exegesis (1970s-2010s). Were you ALREADY that old in the 1970s, 1980s or 1990s or was your mind ALREADY set then?\n  Do you seriously believe the written and oral sources of the 4 Gospels were in koine Greek that is non ‘natural’ but  ‘TRANSLATION’ Greek language? If Yeshu’a spoke Aramaic (and Hebrew), could you account for ALL the gospels having been written FROM THE START in ‘TRANSLATION’ Greek (i.e. non natural Greek or word for word hellenised Aramaic or/and Hebrew)?\n\n","date":"January 16, 2013 at 6:04 am","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-22106","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"Thank you to answer my questions.\n\n","date":"January 16, 2013 at 6:14 am","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-22108","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"Typo: If Yeshu’a spoke Aramaic (and Hebrew), could you account for ALL the gospels having been written FROM THE START in ‘TRANSLATION’ Greek (i.e. non natural Greek or word for word aramaicised or/and “hebrewcised” Greek)?\n\n","date":"January 16, 2013 at 6:33 am","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-22111","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"Concerning the synoptic statistics discussed earlier: \nI might assume your reference to WORDS statistics refer to vocabulary, and this would say something about the relative language competence within the three synoptics.  But then you refer to “words often in the same order” and this could imply something about phraseology.  The most meaningful statistic when comparing who depended on whom, seems to me, to be the measure of number of verses.  On that basis, it is a false assertion that 88% of Mark is in Luke, although I could concede that Luke may have used 88% of Mark’s vocabulary, but that would seem to me irrelevant when discussing use of material.    \n“In approximate figures, Mark’s text has 661 verses, more than 600 of which appear in Matthew and 350 in Luke. Only c. 31 verses of Mark are found nowhere in Matthew or Luke. In the material common to all three Synoptics, there is very seldom verbatim agreement of Matthew and Luke against Mark, though such agreement is common between Matthew and Mark or Luke and Mark or where all three concur.”\n“The postulated common saying source of Matthew and Luke, Q, would account for much verbatim agreement of Matthew and Luke when they include sayings absent from Mark. The fact that the sayings are used in different ways or different contexts in Matthew and Luke is an indication of a somewhat free way in which the editors could take material and mold it to their given situations and needs.” (Source – Encyc Brit) \nEncyc Brit’s assertion “there is very seldom verbatim agreement of Matthew and Luke against Mark” would seem to be a gross understatement, and I have read elsewhere that such alleged agreement never occurs, On that basis, I would hope that we can continue to concur that Mark predated final Matthew and final Luke, and that both Matthew and Luke drew on Mark to the extent indicated.  If you know of any evidence of agreement between Matthew and Luke against Mark, I should like to have the specific references.\n\n","date":"January 15, 2013 at 6:42 pm","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-22082","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"Dave, once again you don’t understand at all the purport of Stein’s statistics on verses AND words in terms of Synoptic Gospels’ genetics. Nope. Just KEEP IGNORING half of a century of NT exegesis (1970s-2010s)…\n\n","date":"January 16, 2013 at 6:10 am","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-22107","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"BTW, which year was your ‘Biblical’ Encyc Brit published? Was it before World War II?\n\n","date":"January 16, 2013 at 6:17 am","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-22109","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"If I don’t follow your Stein statistics, it’s because you haven’t explained them clearly as to what they’re about.  The only other recourse I have is to go searching for them on the web which I can do when I have a moment to spare.  However pure logic tells me that it is the percentage of verses that matter for the purpose of this debate (who was copying whom).  \nConcerning the question of Hebrew/Aramaic vs Greek, I suspect there’s a lack of appreciation of the multi-lingual capabilities of other societies by those writers who are constrained to live in a mono-lingual culture.  Hence they see a difficulty where none exists.  \nKoine Greek was the common language in the eastern part of the empire, various Aramaic dialects a close second, (Peter’s style of speech revealed him to be a Galilean to the maid-servant), with local pockets of other indigenous languages.  I believe pure Hebrew very likely had tended to become confined among the Jews for religious purposes only, and therefore unlikely to be a suitable means of transmitting the gospels to a wider congregation.  I have already conceded that there had to be some unknown process for transmitting the Aramaic preaching and sayings of Jesus, into their final Greek form.  [Papias’ comment that Matthew wrote the sayings in the Hebrew language, may or may not be the case – they might well have been the original Aramaic collection.]  However the general consensus seems to be that there are only tenuous signs of translation in the Greek gospels.   \nFor the record, the version of Encyclopaedia Britannica I use is the “2006 Ultimate Reference Suite” which unsurprisingly post-dates 1939, and has yet to pass its “use-by-date”.  Notwithstanding minority dissenting research since 1970, such research hardly seems to have affected the generally held consensus of the majority of exegetes since published elsewhere.  That is not to say that it may one day do so.  Whether that will be a good thing or no, there is now some evidence of an unfortunate ill-informed trend among some powerful conservative religious lobbyists even to abandon Marcan priority.  Such an unfortunate trend can hardly create confidence in the worth of “recent research”, and one might suspect kudos-seeking from those pursuing the alleged discovery of novelties, rather than an honest distilling the truth of such matters..\n\n","date":"January 16, 2013 at 4:06 pm","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-22141","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"Hebrew was currently used by Levys/priests in Second Temple period Jerusalem. Most if not all the members of the Sanhedrin could speak and read not only  Hebrew and Greek but also many varieties of Aramaic.\n\n","date":"January 16, 2013 at 5:02 pm","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-22146","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"…+ additional vernacular languages.\n\n","date":"January 16, 2013 at 5:05 pm","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-22148","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"BTW Matthew was a Levy and YoHanan/John a priest…\n\n","date":"January 16, 2013 at 5:07 pm","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-22149","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"Yair/Luke might well have been a chief ruler of a synagogue…\n\n","date":"January 16, 2013 at 5:10 pm","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-22150","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"…and Peter as a fisherman from Galilee spoke Galilean Aramaic….\n\n","date":"January 16, 2013 at 5:12 pm","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-22151","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"\nMax Patrick Hamon :OK Dave, just KEEP IGNORING half of a century of NT exegesis (1970s-2010s). Were you ALREADY that old in the 1970s, 1980s or 1990s or was your mind ALREADY set then?Do you seriously believe the written and oral sources of the 4 Gospels were in koine Greek that is non ‘natural’ but ‘TRANSLATION’ Greek language? If Yeshu’a spoke Aramaic (and Hebrew), could you account for ALL the gospels having been written FROM THE START in ‘TRANSLATION’ Greek (i.e. non natural Greek or word for word hellenised Aramaic or/and Hebrew)?\nI could surmise that the Gospels may have been written in Koine Greek originally and translated in cases from either Aramaic or Hebrew very early on. Aramaic was the spoken language in Judea along with Koine Greek and we could also surmise that oral tradition would follow in Aramaic, not Hebrew….I think that reasonable but obviuosly conjecture.Problem is we cannot know for sure as there are no writings found, as yet, from that early on. By the way Max, Koine Greek is not a ‘translation’ or ‘non-natural’ Greek, you know this, it is simply a more basic form of Greek and one spread about during Alexander’s conquests and spoken widely about the Roman world at the time and until approx 300ad. More like a peasant Greek, from what I have been told.\nR\n\n","date":"January 16, 2013 at 7:11 am","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-22114","author":"Ron","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"Ron,  the koine Greek of the Gospels does smell ‘translation’ both from Aramaic (Synoptic Gospels) and Hebrew (YoHanan/John’s Gospel). Read first Robinson, Carmignac, Tresmontant, Genot-Bismuth, Loth, Wenham etc etc, PLEASE.\n\n","date":"January 16, 2013 at 10:46 am","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-22120","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"Yes. I agree with you Max. I guess I misunderstood what you meant by ‘tranlsation’ or ‘non-natural’ when you spoke of Koine Greek. Anyways, yes some believe the Gospels ‘smell’ of translation but they certainly do not ‘smack’ of it ;-)\nJesus spoke many things, it would be ludicrous to believe all was simply maintained by oral tradition, hense one would surmise dictation of much of what he spoke was done on the spot. Whether this dictation was done in Aramaic, Greek or Hebrew or all of the above will probably always be inconclusive, even if by a miracle very early writings are found.\nR\n\n","date":"January 16, 2013 at 4:09 pm","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-22142","author":"Ron","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"It does smell and smack of ( both notes taken down in) Aramaic and Hebrew (and  Aramaic and Hebrew accurate oral tradition). I wish Dave had asked in the 90s a Jewish NT scholar such as e.g. late Genot-Bismuth or Rabbi Josh Caruso before having his mind set on the YoHanan/John &  Synoptic Gospels’ genetics issue.\n\n","date":"January 16, 2013 at 4:47 pm","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-22144","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"Would the adult literacy rate in first century Palestine have a relevance to this question. Presumably whoever wrote the first gospels wanted them to be read.\n\n","date":"January 16, 2013 at 9:07 am","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-22116","author":"Hugh Farey","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"Reminder for Hugh:\nHebrew was currently used by Levys/priests in Second Temple period Jerusalem. Most if not all the members of the Sanhedrin could speak and read not only Hebrew and Greek but also many varieties of Aramaic + additional vernacular languages.\nMattityahu/Matthew was a levy and YoHanan Maqqaba/John Mark a kohen…\nYair/Luke might well have been a chief ruler of a synagogue.\nOnly Kêpha/Peter as both a nationalist and a fisherman  from Galilee who spoke Galilean Aramaic was seen as an illiterate by the Judeans.\n\n","date":"January 17, 2013 at 5:29 am","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-22164","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"Typo: by Judeans\n\n","date":"January 17, 2013 at 5:35 am","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-22166","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"Dave,\nin a previous comment, you most misleadingly asserted as if it were a proven fact: “Luke’s polished Greek is certainly the original language, and likewise there can be no question about John’s Greek.” No question, really? No less than nearly two dozens of NT scholars advocate YoHanan/John’s Gospel was FIRST mostly written in Hebrew language (to the sole possible exception of the closing verses).\n\n","date":"January 16, 2013 at 10:38 am","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-22119","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"I think that was probably an over-statement on my part.  I would stand by the comment I made on Luke, but the Greek found in John’s gospel is said to be fairly simple (Encyc Brit).  I have already commented that there was clearly some process whereby the original Aramaic preaching came by some unknown process to be finalised into its ultimate Greek form.  What that process was, I think, is lost in the mists of antiquity, notwithstanding the assertions of some two dozen NT scholars.  It seems that Clement as early as 150 AD considered the gospel to be apostolic.  \nJB notes that the absence of reference to “the sons of Zebedee” in John’s gospel, may point to John the Apostle being the initial author, and early fathers (e.g. Iraeneus) claim that John wrote the gospel in Ephesus and Revelations on Patmos.  However JB also mentions one tradition that John was in fact martyred during the 1st century.  In the 6th century, the church of Ephesus claimed to possess the autograph of the Fourth Gospel.  At the end of the 2nd century, Polycrates, bishop of Ephesus, claims that John’s tomb is at Ephesus, identifies him with the beloved disciple, and adds that he “was a priest, wearing the sacerdotal plate, both martyr and teacher.” There were in fact two rival sites in Ephesus claiming to be his tomb.  Legend was also active in the West, being especially stimulated by the passage in Mark 10:39, with its hints of John’s martyrdom. Tertullian, the 2nd-century North African theologian, reports that John was plunged into boiling oil from which he miraculously escaped unscathed.   \nOne resource I have, mentions that the education of young Jewish boys in 1st century Palestine apparently included instruction in the “Hebrew scriptures”, but I would be uncertain whether that would refer to the Septuagint (it was in general use at this time), or the actual Hebrew scrolls.  So there may have been some more general acquaintance of pure Hebrew than I had granted, but of this I’m not certain.  \nThe complexity of thought in John’s gospel, and the evidence of several external influences, including the dualistic thought of Qumran, and traces of gnosticism, and so on, would seem to argue against a single author of the gospel in its final form as we now have it.  It may be that a single religious genius might have had the ability to write it, but I think it does strain the bounds of plausibility that one fisherman wrote the entire bulk of it,  A series of redactions by a Johannine school, probably at Ephesus, working on an original autograph has I think got more going for it.  Against this argument, might be the unity of the whole.    \nConcerning an earlier comment I made about the lack of appreciation in monolingual cultures about the multi-lingual capabilities in other societies:  In NZ we have several well-known Maori and Polynesian writers who are quite comfortable in writing in either English or their native tongue, and who reguarly win national awards for their work, perhaps one advantage of living in a smaller country.  At Victoria University in Wellington, the senior lecturer in professional writing for many years was in fact a highly thought-of Maori professional writer.  My own nephew, whose mother was Ngati-Porou, a professional polytech teacher, has won prestigious national awards as a playwright for instance, and is comfortable in writing in either language.  My point in mentioning this, is to demonstrate that there may be less difficulty for Judean evangelists writing in the Greek language than has been imagined.\n\n","date":"January 17, 2013 at 4:09 pm","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-22189","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"(YoHanan) Maqqaba/(John) Mark wrote the eponymous Gospel after Kêpha/Peter’s testimony.\n\n","date":"January 17, 2013 at 7:30 pm","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-22191","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Jesus’ Wife Papyrus Update","post":"I presume you are referring to the gospel usually appearing as second in the NT. The way you have written his name, presumably a transliteration from some Hebrew source, suggests to me the possibility of a family connection with the Maccabees, I wonder.  There is a strong tradition that Peter in Rome was the authority behind Mark’s gospel, see closing verses of I Peter (epistle) for instance.  Whether he was the same John Mark that disappointed Paul in Acts, or whose mother’s home was a regular meeting place, we might guess.  As we have discussed previously (e.g. ossuary stats etc) the reservoir of Jewish names was much more limited than modern names, but it seems quite likely it could have been the same person,  \nJB has an interesting complicated take on the origin of the synoptics, which I think may owe something to your French RC exegetists.  Following Papias, (I imagine), it postulates a primary Matthew Aramaic with sayings and some narrative, but originating from an oral tradition.  It then claims that Mark, as well as Matthew Greek used this primary Matthean Aramaic, but that Mark omitted the sayings.  Nevertheless it claims that Mark’s gospel is a gospel in its own right that can stand on its own.  It claims to detect more primitive forms in parts of Matthew, more so even than Mark.  If Mark had Peter as a source, it puzzles me why he should feel the need to have recourse to another external source, and why he should then  omit the sayings.  The final Matthew Greek, and Luke even more so, is more circumspect concerning “unfavourable” reporting compared to Mark.  \nAs I have repeatedly attempted to express in our exchange, the production of the gospels into their final form was not I believe a simple matter, but was rather more complex, and a fertile ground for speculation as to how it all came about.  I’m drawn towards a conclusion of extensive, possibly ongoing, redaction by a teaching church responding to current needs as it saw them, but conserving apostolic tradition as well as it could.\n\n","date":"January 17, 2013 at 8:25 pm","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","id":"comment-22194","author":"daveb of wellington nz","site":"shroudstory"}]
