[{"title":"Let’s Agree to Agree?","post":"Fanti is signaling that he now agrees with Benford and Marino that the carbon dating was wrong because of a patch. Sorry Stephen and Colin. This will be the talk of Saint Louis.\n\n","date":"September 17, 2014 at 6:36 am","url":"https://shroudstory.com/2014/09/17/lets-agree-to-agree/","cat":"news_&_views","id":"comment-151778","author":"Paulette","site":"shroudstory"},{"title":"Let’s Agree to Agree?","post":"You say TOM-AH-TOES, I say TOM-AY-TOES; let’s agree they sound exactly the same…\nIn a recent conversation at Shroud Science, Giulio Fanti expressed his belief that the entire radiocarbon sample was from the date determined by the laboratories (1300 or so), without any contamination, but was part of a larger patch, the borders of which have yet to be determined. The are dangerous waters. I think that after very careful examination of the whole Shroud, he will find that the medieval patch measures about 440cm x 110cm…\n\n","date":"September 17, 2014 at 9:16 am","url":"https://shroudstory.com/2014/09/17/lets-agree-to-agree/","cat":"news_&_views","id":"comment-151879","author":"Hugh Farey","site":"shroudstory"},{"title":"Let’s Agree to Agree?","post":"It was already the talk of the 2008 Ohio conference, lines are shifting, slowly.\nThat said, patch is misleading, reweaving seems more specific.\n\n","date":"September 17, 2014 at 12:38 pm","url":"https://shroudstory.com/2014/09/17/lets-agree-to-agree/","cat":"news_&_views","id":"comment-151961","author":"anoxie","site":"shroudstory"},{"title":"Let’s Agree to Agree?","post":"I agree that there is bit too much backbiting, even nastiness among the Shroud community. However, when someone is just wrong, or attacks another unjustifiably, silence connotes assent.\nSomeone can make great contributions and then go off the  beam. The Shroud community as a whole suffers when someone, even one who has made great contributions proposes theories, sometimes out of whole cloth, that are so patently false as to expose the entire community to ridicule.\nWe are seeking the truth that makes us free. In that journey we can not paper over obvious error.\n\n","date":"September 17, 2014 at 6:37 am","url":"https://shroudstory.com/2014/09/17/lets-agree-to-agree/","cat":"news_&_views","id":"comment-151779","author":"John Klotz","site":"shroudstory"},{"title":"Let’s Agree to Agree?","post":"It seems likely to me that a lot of the problem results from protagonists peddling their latest favourite theory, even sometimes with supporting experimental and interpretive argument, as if it were proven fact, when it clearly is not.  The Shroud image has not been proven to be a scorch, a Maillard reaction, nor the result of any kind of radiation, nor the emission of any kind of atomic particles.  Its age has not even been proven, but continues to be argued, and it cannot be proven that it is the burial cloth of Jesus.  Nor let it be said, that it has not been proved to be none of these things (note the double negative).  \nThe assertion of proven facts, which are clearly not proven, is provocative to all thinking persons.  And those who assert them set themselves up as fair targets.  It would be a far better approach if protagonists demonstrated their honesty, by admitting their hypotheses and theories, together with any arguments they may have, by conceding the limitations of their case.  We can exercise some tolerance, patience and courtesy towards them, and it would be a far better thing if arguments were based on the issue, rather than the person.  However for most of us, human endurance of the intolerable can sometimes be too much of a test altogether.\n\n","date":"September 17, 2014 at 7:19 am","url":"https://shroudstory.com/2014/09/17/lets-agree-to-agree/","cat":"news_&_views","id":"comment-151804","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Let’s Agree to Agree?","post":"You know when I use to debate Christains on the internet I would love people like Mr. Jones. I remember one debate where the other party argued first that dinosaur didn’t ever exist and that Stan when around planting dinosaurs bones to fool us. When he could no longer believed that himself then he claimed that dinosaur lived along side of us at the same time(Must have gotten that from, “The Flintstones”). \nNo wild unsupported claims does not help your cause any.\n\n","date":"September 17, 2014 at 9:30 am","url":"https://shroudstory.com/2014/09/17/lets-agree-to-agree/","cat":"news_&_views","id":"comment-151885","author":"John Green","site":"shroudstory"},{"title":"Let’s Agree to Agree?","post":"Are you referring to Stan Lee? He is old enough and has the creativity to pull such a stunt. \n(I know you meant Satan, just having some fun).\n\n","date":"September 17, 2014 at 11:50 am","url":"https://shroudstory.com/2014/09/17/lets-agree-to-agree/","cat":"news_&_views","id":"comment-151938","author":"David Goulet","site":"shroudstory"},{"title":"Let’s Agree to Agree?","post":"“What will you say when he is proven right? Will you have the [courage] to admit you were stupid?”\nI would certainly have the courage to admit I was wrong. I would not accept that I had been stupid, as currently Antonacci’s ideas are not supported by adequate evidence, and it is not stupid to reject as fact unsubstantiated hypotheses.\n\n","date":"September 17, 2014 at 9:40 am","url":"https://shroudstory.com/2014/09/17/lets-agree-to-agree/","cat":"news_&_views","id":"comment-151892","author":"Hugh Farey","site":"shroudstory"},{"title":"Let’s Agree to Agree?","post":"Dan you seem to get it pretty good from both sides, each claiming you’re squarely in the opposition’s camp. You must be doing something right.\n\n","date":"September 17, 2014 at 11:51 am","url":"https://shroudstory.com/2014/09/17/lets-agree-to-agree/","cat":"news_&_views","id":"comment-151940","author":"David Goulet","site":"shroudstory"},{"title":"Let’s Agree to Agree?","post":"Why would anyone try to convince another the Shroud (or anything else) is real?  I would much prefer for people to review the best information of the experts in their own fields and make that determination for themselves.  It’s not really anyone’s business what one believes about a certain subject.  I believe the truth will speak for itself for those daring enough to consider the evidence.  I cannot convince anyone what they refuse to believe so that is ultimately a waste of time.  If people ask my opinion, I’ll give it to them.\n\n","date":"September 17, 2014 at 11:36 pm","url":"https://shroudstory.com/2014/09/17/lets-agree-to-agree/","cat":"news_&_views","id":"comment-152101","author":"Andy","site":"shroudstory"},{"title":"Let’s Agree to Agree?","post":"Hugh wrote:\n> … … I think that after very careful examination of the whole Shroud,\nhe will find that the medieval patch measures about 440cm x 110cm…\nSo …\nWe have to know the epoch for that ancient linen\nusing a non-destructive method and\nAFM measurements of elastic modulus\nare an interesting way …\n— —\nSee, for example, the study :\nProbing delicate samples: stiff AFM mechanics at soft forces\nLink:\nhttp://iopscience.iop.org/0957-4484/labtalk-article/48521\n>Atomic force microscopy (AFM) measurements of nanoscale mechanical properties can require relatively large forces to probe elastically stiff materials such as metals or ceramics. Such forces are potentially damaging, particularly to thin or delicate samples. Recently, researchers have demonstrated a solution to this dilemma. The new method enables AFM measurements of elastic modulus with forces less than 20 nN, roughly 10 times the force needed to break a single atomic bond.\n— —\nJason P Killgore and Donna C Hurley 2012 Nanotechnology 23 055702 doi:10.1088/0957-4484/23/5/055702\nLow-force AFM nanomechanics with higher-eigenmode contact resonance spectroscopy \nlink :\nhttp://iopscience.iop.org/0957-4484/23/5/055702/\n>Atomic force microscopy (AFM) methods for quantitative measurements of elastic modulus on stiff (>10 GPa) materials typically require tip–sample contact forces in the range from hundreds of nanonewtons to a few micronewtons. Such large forces can cause sample damage and preclude direct measurement of ultrathin films or nanofeatures. Here, we present a contact resonance spectroscopy AFM technique that utilizes a cantilever’s higher flexural eigenmodes to enable modulus measurements with contact forces as low as 10 nN, even on stiff materials. Analysis with a simple analytical beam model of spectra for a compliant cantilever’s fourth and fifth flexural eigenmodes in contact yielded good agreement with bulk measurements of modulus on glass samples in the 50–75 GPa range. In contrast, corresponding analysis of the conventionally used first and second eigenmode spectra gave poor agreement under the experimental conditions. We used finite element analysis to understand the dynamic contact response of a cantilever with a physically realistic geometry. Compared to lower eigenmodes, the results from higher modes are less affected by model parameters such as lateral stiffness that are either unknown or not considered in the analytical model. Overall, the technique enables local mechanical characterization of materials previously inaccessible to AFM-based nanomechanics methods.\n—————————————————-\nThere are two systems :\nflexural tests and indentation tests…\nFor this second system, see the nanoindentation :\n>Nanoindentation is a variety of indentation hardness tests applied to small volumes. Indentation is perhaps the most commonly applied means of testing the mechanical properties of materials. The nanoindentation technique was developed in the mid-1970s to measure the hardness of small volumes of material…\nhttp://en.wikipedia.org/wiki/Nanoindentation\n— —\nHere a vague reference (not in the field of textiles) :\nCalculation of Young’s modulus value by means of AFM.\nRoa JJ, Oncins G, Diaz J, Sanz F, Segarra M.\nRecent Pat Nanotechnol. 2011 Jan;5(1):27-36.\nAbstract\n>In the last years, Atomic Force Microscopy (AFM) has become a powerful tool not only to study the surface morphology but also the nanomechanics of all kind of samples. In this paper, the applicability of this technique is reviewed and its basic aspects of operation, advantages and drawbacks of using the AFM probe as a picoindenter (Force Spectroscopy mode, FS-AFM) are discussed. The patents concerning picoindentation measurements are discussed in the text and special attention is paid to measurements performed on hard materials as ceramics, as they have not been as thoroughly reviewed in the literature as in the case of soft matter. The possibilities of AFM in the nanomechanics field include the quantitative determination of the Young’s modulus (E) and the transition force from elastic to plastic deformation regimes, the measurement of adhesion forces and deformation mechanisms while applying vertical forces in the range from tens of pN to μN.\n\n","date":"September 18, 2014 at 7:59 am","url":"https://shroudstory.com/2014/09/17/lets-agree-to-agree/","cat":"news_&_views","id":"comment-152200","author":"Piero","site":"shroudstory"},{"title":"Let’s Agree to Agree?","post":"I hope I was understood when I indicated dating tests\nbased on AFM three-point bending tests, etc., etc. …\nAfter mentioning the possibility of using AFM microscopy (in order to find the elastic modulus),\nI would not want my vague guidelines and considerations are misrepresented as the words of Hawkings (and Hawking’s bitter attitude towards the Higgs Boson is understandable).\nHere I refer to the recent interpretations of the thought of Hawkings (= Higgs Boson could spell the end of the universe – Stephen Hawking).\nHiggs’ elementary particle underpins existence in our universe might become unstable, warns renowned physicist Stephen Hawking.\nThe energy potential of the ‘God particle’ is so vital for the entire universe it could make the cosmos collide, he concluded.\nLink:\nhttp://rt.com/news/185876-universe-elimination-higgs-boson/\nWith a sarcastic note in fact Hawking adds that “a particle accelerator capable of reaching 100 billion GeV would be bigger than the Earth, and it is unlikely that we can get the funding to make it happen in the current economic climate.” \nAccording to the physicist, however, in the event that it be built, the Higgs boson “could become metastable at energies exceeding 100 billion giga-electron volts (GeV).” Basically, if scientists were to undertake a similar experiment, the universe could suffer a catastrophic decay of the vacuum, ie, the bubble of the true vacuum would expand at the speed of light. The disaster according to Hawking “could happen at any time” …\n— —\nPerhaps the matter of the body of Jesus became metastable in a strange manner.\nWho knows … ??? …\nIn any case I hope that both heresies and false Teachings,\nthey stay far from me !\nI was just talking about the applications of advanced microscopy…\n— —\nWhat are your comments ?\n\n","date":"September 18, 2014 at 8:55 am","url":"https://shroudstory.com/2014/09/17/lets-agree-to-agree/","cat":"news_&_views","id":"comment-152212","author":"Piero","site":"shroudstory"},{"title":"Let’s Agree to Agree?","post":"I apologize about the stories on the Higgs boson and the end of the universe.\n— —\nI was curious about the following idea :\nthe matter of the body of Jesus became metastable …\nand\nyou can speculate on the void left by the body of Jesus …\n— —\nIf Higgs Boson Calculations Are Right, A Catastrophic ‘Bubble’ Could End Universe\nLink:\nhttp://www.npr.org/blogs/thetwo-way/2013/02/19/172422921/if-higgs-boson-calculations-are-right-a-catastrophic-bubble-could-end-universe\n— — —\nIn any case, under the address:\nhttp://en.wikipedia.org/wiki/False_vacuum\nthere is the following explanation:\n>In quantum field theory, a false vacuum is a metastable sector of space that appears to be a perturbative vacuum, but is unstable due to instanton effects that may tunnel to a lower energy state. This tunneling can be caused by quantum fluctuations or the creation of high-energy particles. Simply put, the false vacuum is a local minimum, but not the lowest energy state, even though it may remain stable for some time. This is analogous to metastability for first-order phase transitions. …\nand also:\n>… For decades, scientific models of our universe have included the possibility that it exists as a long-lived, but not completely stable, sector of space, which could potentially at some time be destroyed upon ‘toppling’ into a more stable vacuum state.\n>The Standard Model of particle physics opens the possibility of calculating from the masses of the Higgs boson and the top quark, whether the universe’s present electroweak vacuum state is likely to be stable or merely long-lived. …\n>… … catastrophic bubble of “true vacuum” (per quantum models) could theoretically occur at any time or place in the universe, which means (because the bubble of “true vacuum” will expand at the speed of light) the end of such a false vacuum could occur at any time. …\n— —\nSpeculations …\n\n","date":"September 19, 2014 at 11:19 am","url":"https://shroudstory.com/2014/09/17/lets-agree-to-agree/","cat":"news_&_views","id":"comment-152507","author":"Piero","site":"shroudstory"}]
