[{"title":"A Different Perspective on the Shroud","post":"“the reality of reincarnation, a notion popular in Jesus’ day, accepted by Him and by some early Church fathers, comes into focus. ”\nPure poppycock….\nProve it.\n\n","date":"October 6, 2014 at 10:53 am","url":"https://shroudstory.com/2014/10/06/a-different-perspective-on-the-shroud/","cat":"news_&_views","id":"comment-159829","author":"Nabber","site":"shroudstory"},{"title":"A Different Perspective on the Shroud","post":"I don’t know if Jesus believed it, but the people of the day appeared to believe it \nMat 16:14\nAnd they said, Some say that thou art John the Baptist: some, Elias; and others, Jeremias, or one of the prophets.\nElias and other were dead so some believed that they came back as Jesus.\n\n","date":"October 6, 2014 at 11:48 am","url":"https://shroudstory.com/2014/10/06/a-different-perspective-on-the-shroud/","cat":"news_&_views","id":"comment-159846","author":"John Green","site":"shroudstory"},{"title":"A Different Perspective on the Shroud","post":"“Elias and other were dead so some believed that they came back as Jesus.”  \nNot a big fan of the OT, huh, John?\nElias = Elijah, who did not die, but was “taken up”.  And, p.s., they were not talking about reincarnation, but the return of a prophet(s).\n\n","date":"October 6, 2014 at 1:04 pm","url":"https://shroudstory.com/2014/10/06/a-different-perspective-on-the-shroud/","cat":"news_&_views","id":"comment-159871","author":"Nabber","site":"shroudstory"},{"title":"A Different Perspective on the Shroud","post":"Jeremias too? \nLet’s look at the question\nMat 16:13\n¶\nWhen Jesus came into the coasts of Caesarea Philippi, he asked his disciples, saying, Whom do men say that I the Son of man am?\nJesus was asking who do people think HE is.\n\n","date":"October 6, 2014 at 1:23 pm","url":"https://shroudstory.com/2014/10/06/a-different-perspective-on-the-shroud/","cat":"news_&_views","id":"comment-159876","author":"John Green","site":"shroudstory"},{"title":"A Different Perspective on the Shroud","post":"Their response: “Some say John the Baptist; others say Elijah; and still others, Jeremiah or one of the prophets.”\nSuggests that at least the common folk believed in the possibility of reincarnation to some degree. Elijah was taken and John the Baptist was a case of mistaken identities… But what about Jeremiah? Some sources have him dying at Tahpanhes, others elsewhere, but none have him being taken away by a flaming chariot.\n\n","date":"October 6, 2014 at 5:03 pm","url":"https://shroudstory.com/2014/10/06/a-different-perspective-on-the-shroud/","cat":"news_&_views","id":"comment-159921","author":"Eric","site":"shroudstory"},{"title":"A Different Perspective on the Shroud","post":"Also, the flaming chariot was a rare occurrence, excluding Enoch and Elijah, any other prophet would be considered “dead” by the layperson.\n\n","date":"October 6, 2014 at 5:26 pm","url":"https://shroudstory.com/2014/10/06/a-different-perspective-on-the-shroud/","cat":"news_&_views","id":"comment-159927","author":"Eric","site":"shroudstory"},{"title":"A Different Perspective on the Shroud","post":"Nabber writes  “Jesus, aware of “undoctrinal” talk about who he might be, was setting up a straw man in order to knock such arguments down (and later, the evangelists wrote it).”\nThere is no strawman here. Jesus wasn’t misrepresenting or exaggerating anyone’s arguement here and then arguing his possition based on that. There was no debate going on. He asked a very simple question,  “Whom do men say that I the Son of man am?” not,  Whom do men say I’m like?, Not Whom do I remind them of?.The answer was just as clear.\nWhile I accept many of Eastern philosophy ideas  reincarnation is not one of them.\n\n","date":"October 10, 2014 at 7:32 am","url":"https://shroudstory.com/2014/10/06/a-different-perspective-on-the-shroud/","cat":"news_&_views","id":"comment-160982","author":"John Green","site":"shroudstory"},{"title":"A Different Perspective on the Shroud","post":"TYPO’s\nNabber writes  “Jesus, aware of “undoctrinal” talk about who he might be, was setting up a straw man in order to knock such arguments down (and later, the evangelists wrote it).”\nThere is no straw man here. Jesus wasn’t misrepresenting or exaggerating anyone’s argument here and then arguing his position based on that. There was no debate going on. He asked a very simple question, “Whom do men say that I the Son of man am?” not, Whom do men say I’m like?, Not Whom do I remind them of?. The answer was just as clear.\n\n","date":"October 10, 2014 at 7:33 am","url":"https://shroudstory.com/2014/10/06/a-different-perspective-on-the-shroud/","cat":"news_&_views","id":"comment-160983","author":"John Green","site":"shroudstory"},{"title":"A Different Perspective on the Shroud","post":"In Shakespeare’s ‘Merchant of Venice’ trial scene, plaintiff Shylock proclaims the ‘young lawyer from Padua’ (Portia in disguise) “another Daniel” for her legal analysis.  The talk around Jesus concerning who he was, may have been just as metaphorical, with no real allusions as to his actual identity.\n\n","date":"October 6, 2014 at 7:26 pm","url":"https://shroudstory.com/2014/10/06/a-different-perspective-on-the-shroud/","cat":"news_&_views","id":"comment-159949","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Different Perspective on the Shroud","post":"John Green quotes: ” He asked his disciples, saying, Whom do men say that I the Son of man am?”\nI agree with DaveB.  Jesus, aware of “undoctrinal” talk about who he might be, was setting up a straw man in order to knock such arguments down (and later, the evangelists wrote it).  And He did.There may have been illiterates who believed in reincarnation, but no one steeped in the teachings of the mainline rabbis….\n\n","date":"October 9, 2014 at 1:16 pm","url":"https://shroudstory.com/2014/10/06/a-different-perspective-on-the-shroud/","cat":"news_&_views","id":"comment-160723","author":"Nabber","site":"shroudstory"},{"title":"A Different Perspective on the Shroud","post":"Christian tradition, to my knowledge, only teaches that a resurrected body is a glorified body — and leaves it at that. The resurrection stories of Jesus note how Jesus’ body was not exactly as it was before death (they did not recognize him) and yet it was still his body (the wounds). The tomb is empty which further points to the fact that something happened to Jesus’ actual body.\nThe concept of reincarnation involves a soul continually going through a cycle of rebirth, from infant to adult. This is so completely different than Jesus’ resurrection that to connect the two, other than in the broadest strokes, is nonsensical.\n\n","date":"October 6, 2014 at 12:42 pm","url":"https://shroudstory.com/2014/10/06/a-different-perspective-on-the-shroud/","cat":"news_&_views","id":"comment-159866","author":"David Goulet","site":"shroudstory"}]
