[{"title":"Browser Issues:  This Blog and More","post":"I strongly urge anyone using Internet Explorer to switch over to Mozilla Firefox immediately. It is free and far more robust than IE.  Once installed, find and download the following two add-ons (also free):  \nNoScript, which blocks web pages from running scripts on your computer. This can affect the functionality of certain web pages but you can permanently allow the pages you trust. Otherwise, you can temporarily allow pages that don’t properly function when you visit them. The default is to block all scripts and give you the options (which can be a hassle sometimes – but it keeps you safe).\nThe second add-on is KeyScrambler, which encrypts all of your keystrokes while on the web, making your passwords and the other information you enter much safer. It used to be an add on to Firefox but is now a standalone program. The personal version is free and you can find it via Google.\n\n","date":"April 30, 2014 at 6:20 pm","url":"https://shroudstory.com/2014/04/30/browser-issues-this-blog-and-more/","cat":"news_&_views","id":"comment-107227","author":"Barrie Schwortz","site":"shroudstory"},{"title":"Browser Issues:  This Blog and More","post":"Dan, I gave up using Internet Explorer years ago, Firefox is very safe, but Google Chrome wins in speed.\n\n","date":"April 30, 2014 at 6:24 pm","url":"https://shroudstory.com/2014/04/30/browser-issues-this-blog-and-more/","cat":"news_&_views","id":"comment-107232","author":"Louis","site":"shroudstory"},{"title":"Browser Issues:  This Blog and More","post":"For just about everything I do, I use Chrome. But I proof every posting in IE because more people still use it. I had not encountered the comment problem until it was reported to me. WordProof support is recommending clearing cookies and cache to eliminated the truncated comments.\n\n","date":"May 1, 2014 at 5:45 am","url":"https://shroudstory.com/2014/04/30/browser-issues-this-blog-and-more/","cat":"news_&_views","id":"comment-107741","author":"Dan","site":"shroudstory"},{"title":"Browser Issues:  This Blog and More","post":"Yes, cookies can be a problem, it is always better to clear them.\n\n","date":"May 1, 2014 at 10:07 am","url":"https://shroudstory.com/2014/04/30/browser-issues-this-blog-and-more/","cat":"news_&_views","id":"comment-107928","author":"Louis","site":"shroudstory"}]
