[{"title":"Bruised, Hurting and Dirty","post":"Does + Duncan, SJ know why the predecessor wore red shoes? Did it have anything to do with fancy? He should get his facts correct before posting rubbish on the Internet. The last time it was about the 2015 Shroud Exposition.\n\n","date":"December 11, 2013 at 12:53 pm","url":"https://shroudstory.com/2013/12/11/bruised-hurting-and-dirty/","cat":"news_&_views","id":"comment-58043","author":"Louis","site":"shroudstory"},{"title":"Bruised, Hurting and Dirty","post":"Good choice, I am not a catholic but this pope is my favourite\n\n","date":"December 11, 2013 at 1:11 pm","url":"https://shroudstory.com/2013/12/11/bruised-hurting-and-dirty/","cat":"news_&_views","id":"comment-58049","author":"Mike Morcous","site":"shroudstory"},{"title":"Bruised, Hurting and Dirty","post":"Hi Louis.  Do you mean do I know why red shoes or why fancy shoes crafted by hand from Moroccan leather by a personal cobbler, Adriano Stefanelli of Novara, who also makes price is no object shoes for some of the worlds richest people like Ferrari chairman Luca Cordero di Montezemolo? And I am talking about 2015.\n\n","date":"December 11, 2013 at 1:35 pm","url":"https://shroudstory.com/2013/12/11/bruised-hurting-and-dirty/","cat":"news_&_views","id":"comment-58057","author":"+Dunk","site":"shroudstory"},{"title":"Bruised, Hurting and Dirty","post":"Hi + Dunk, how do you know that he didn’t receive the pair as a present and did it have anything to do with fancy? Or was it something that was very symbolic? One is reminded about the nard used to anoint Jesus’ feet. Judas said, “Why was this ointment not sold for three hundred denarii and given to the poor?”\n\n","date":"December 11, 2013 at 2:33 pm","url":"https://shroudstory.com/2013/12/11/bruised-hurting-and-dirty/","cat":"news_&_views","id":"comment-58073","author":"Louis","site":"shroudstory"},{"title":"Bruised, Hurting and Dirty","post":"A nail through the feet might create the impression of wearing red slippers! Red, the symbol of martyrdom.\n\n","date":"December 11, 2013 at 3:01 pm","url":"https://shroudstory.com/2013/12/11/bruised-hurting-and-dirty/","cat":"news_&_views","id":"comment-58078","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Bruised, Hurting and Dirty","post":"You got it, David, whether after some Internet consultation doesn’t matter.\n\n","date":"December 11, 2013 at 3:31 pm","url":"https://shroudstory.com/2013/12/11/bruised-hurting-and-dirty/","cat":"news_&_views","id":"comment-58086","author":"Louis","site":"shroudstory"},{"title":"Bruised, Hurting and Dirty","post":"I didn’t need to search the Internet. I can do it by instinct!\n\n","date":"December 11, 2013 at 4:11 pm","url":"https://shroudstory.com/2013/12/11/bruised-hurting-and-dirty/","cat":"news_&_views","id":"comment-58097","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Bruised, Hurting and Dirty","post":"I actually hear something echo in my memory that Colin posted once: if a person has something revelatory to share about the Shroud then, if they truly believe it is the image of Jesus, should they not offer that revelation freely? To expect a person to purchase your book, your article, your documentary is not so far removed from what the moneylenders were doing, is it?\nIt’s a hard question because there are many good people out there who are selling books, docs and whatnot about the Shroud. I do not think greed is their motivation. They need to eat too. But did Jesus charge people a speaker’s fee when he shared the Good News? Did the apostles? If we believe the Shroud is a precious gift, then what right do we have to put a price tag on its being shared.\nI think, crazy at it may sound, that Colin and Francis are on the same page here.\n\n","date":"December 11, 2013 at 1:56 pm","url":"https://shroudstory.com/2013/12/11/bruised-hurting-and-dirty/","cat":"news_&_views","id":"comment-58062","author":"David Goulet","site":"shroudstory"},{"title":"Bruised, Hurting and Dirty","post":"Fanciness or decorum, who cares.\nVery perceptive parallel between how we should look at the shroud and a “bruised, hurting and dirty Church”.\nDon’t be afraid to claim it is not a forgery. At least it is reachable by a serene and deep scientific examination.\n\n","date":"December 11, 2013 at 2:09 pm","url":"https://shroudstory.com/2013/12/11/bruised-hurting-and-dirty/","cat":"news_&_views","id":"comment-58070","author":"anoxie","site":"shroudstory"},{"title":"Bruised, Hurting and Dirty","post":"Tuesday, after a harrowing half-hour at the Medical Centre, I seek solace in the local library, I pick up a new acquisition, “Pope Francis” by Matthew E Bunson, Our Sunday Visitor 2013. Thursday morning here, there’s a news item: “Time magazine has named Pope Francis as Man of the Year.” Serendipitous! The first 60 pages are a reprise of Pope Benedict. I’ve discovered a new perspective and respect for our Pope Emeritus.\nDespite Louis’ comments, Fr Duncan brings to light several entirely valid points. The Matthew 21:12 quote is surely relevant.\n\n","date":"December 11, 2013 at 3:13 pm","url":"https://shroudstory.com/2013/12/11/bruised-hurting-and-dirty/","cat":"news_&_views","id":"comment-58082","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Bruised, Hurting and Dirty","post":"One doesn’t have to make little of Benedict to praise Francis. The Bavarian pontiff was also known for his kindness before he retired, in fact even Rabbi Jacob Neusner mentioned it. His only material possessions when he shifted from his apartment to the papal apartments were his books, a piano and two cats, a true German intellectual and professor. Where did he eat? He often ate at cheap, common restaurants in Rome. Pope Francis is doing a very good job, but the time will come when he will have to tackle the serious issues that are being kept in the background, those which took a lot of Benedict’s time. It is the predicament faced by Cardinal Timothy Dolan of New York, by other American Catholic bishops and will soon be on the desk of European bishops too.\n\n","date":"December 11, 2013 at 3:51 pm","url":"https://shroudstory.com/2013/12/11/bruised-hurting-and-dirty/","cat":"news_&_views","id":"comment-58092","author":"Louis","site":"shroudstory"},{"title":"Bruised, Hurting and Dirty","post":"David, # 7. Did you mean intuition, or instinct? Come on….\n\n","date":"December 11, 2013 at 4:54 pm","url":"https://shroudstory.com/2013/12/11/bruised-hurting-and-dirty/","cat":"news_&_views","id":"comment-58105","author":"Louis","site":"shroudstory"},{"title":"Bruised, Hurting and Dirty","post":"With all this talk against Benedict XVI, the Vatican has awarded the Ratzinger Prize to the Rev. Prof. Richard Burridge, an Anglican priest and professor at King’s College.\nBurridge was not worried about the red shoes, he interacted with Ratzinger’s works:\nhttp://www.livingchurch.org/vatican-honors-prof-burridge\n\n","date":"December 16, 2013 at 6:13 pm","url":"https://shroudstory.com/2013/12/11/bruised-hurting-and-dirty/","cat":"news_&_views","id":"comment-60533","author":"Louis","site":"shroudstory"}]
