[{"title":"Burgh Island in Devon: Key to World Peace and the Mystery of the Shroud","post":"I read goldsworthy’s blog regarding the turin shroud and if he is right about the bodies on the Island, then why not about the Shroud. No one has come up with a reasonable explanation for the caramel varnish found on the threads exterior. Why not consider the image was formed in a liquid over an extended period and the residue encrustation is from cedar or other oils.\nGoldsworthy does over extend his thesis into the irrelevant but I find his explanation of the melkin prophecy very convincing. All previous attempts to explain certain details seem perplexing. The prophecy contains directions and each detail is too accurate to ignore. The few instructions act as an indicator that locates an island upon which the uncle of Jesus may have previously visited. The shroud is never very far from Joseph of Arimathea in any account.\nIf Joseph is on the Island and Goldsworthy’s theory of a coffin containing cedar oil is correct, then it is possible that the shroud image was formed in this way and is until disproved a hypothetically good explanation. I personally always thought it a coincidence that the shroud surfaced straight after the demise of the Templars. A test should be conducted to see if the Cedar oil theory is correct because as you have stated the carbon dating of the Shroud was suspect. I think the shroud is the burial cloth of Jesus, I just need to understand how the figure was made. If the solution was easy someone would have an answer.\n\n","date":"October 18, 2012 at 9:41 am","url":"https://shroudstory.com/2012/10/18/burgh-island-in-devon-key-to-world-piece-and-the-mystery-of-the-shroud/","cat":"news_&_views","id":"comment-17801","author":"Ken Plant","site":"shroudstory"},{"title":"Burgh Island in Devon: Key to World Peace and the Mystery of the Shroud","post":"You know, it is very curious about ley linens. In the last years my research activities also involve the intensive use of GPS and at this moment, I tend to put virtually any information on a map.\nI came across the paper by Scavone in the 1988 Ohio Canference titled BESANÇON AND OTHER HYPOTHESES FOR THE MISSING YEARS: THE SHROUD FROM 1200 TO 1400. He suggests that before coming to France, the Shroud was in Athens so I made in R a quick map connecting Jerusalem (were for sure the SHroud once was), Athens and the final destination (Lirey). WIth an error of about 5% the three places are aligned and the proportion of their distances follows the golden ratio.\nI mean you can find anything you want when you start drawing lines on a map!. If Dan agrees I can provide a figure .\n\n","date":"October 18, 2012 at 11:19 am","url":"https://shroudstory.com/2012/10/18/burgh-island-in-devon-key-to-world-piece-and-the-mystery-of-the-shroud/","cat":"news_&_views","id":"comment-17805","author":"Gabriel","site":"shroudstory"},{"title":"Burgh Island in Devon: Key to World Peace and the Mystery of the Shroud","post":"Ley lines are an ancient geographic reality.  Check “Sacred Geometry”, Stephen Skinner, Gaia Books, 2006, pp 106-111.  Old Sarum for example is the convergence point of 10 ley lines, the most notable of these connects: Stonehenge, Old Sarum, Salisbury Cathedral, Harnnum Bridge (Avon River), a major crossroad, Clearbury Ring, Breamore Priory, Frankenbury Camp.  The practical limits of a ley line is the visible horizon, about 35 miles.  As mentioned there are nine other ley lines focussed on Old Sarum. \nThe legend of Joseph of Aramathea being associated with Glastonbury Cathedral, together with other myths about the Holy Grail etc, I’ve found are sometimes favoured by some High Church Anglicans.  They may be related to a misreading of some ancient medieval texts, mentioned by Jack Markwardt, ‘A sixth-century entry in the Liber Pontificalis records that Pope Eleutherius, whose papacy extended from approximately 174 to 189, “received a letter from British King Lucius [Britannio rege Lucio] asking that he might be made a Christian through his agency.” ‘ Venerable Bede in 731 AD repeats this.  Markwardt quotes Adolph Harnack 1904 that the misreading should be: “… that the Liber Pontificalis entry had been intended to reference not Britain, but, rather the Britio Edessenorum, Edessa’s citadel, and not King Lucius, but King Lucius Ælius Septimius Megas Abgarus VIII of Edessa, otherwise known as Abgar the Great” \nThe Burgh Island posting above includes the comment: “Indiana Jones meets Dan Brown”, which is probably not far off the mark!\n\n","date":"October 18, 2012 at 6:44 pm","url":"https://shroudstory.com/2012/10/18/burgh-island-in-devon-key-to-world-piece-and-the-mystery-of-the-shroud/","cat":"news_&_views","id":"comment-17834","author":"daveb of wellington nz","site":"shroudstory"}]
