[{"title":"But they didn’t ask about the Shroud of Turin","post":"The quinnipiac poll, like all other polls, failed to ask THE question.  Do you believe in karma and reincarnation?  Well over 1/2 the world does.  The answer makes a huge difference in one’s life.  Its one thing to commit a little indiscretion in the hear and now with the understanding that eventually an all loving merciful God will hold you responsible in the here after.  It is another to realize that you will need to correct it the next time around in a worldly setting,  hopefully in a human body-suit.  Belief in reincarnation would shut down the travel industry; the notion of a “bucket list”, so prevalent in the thoughts of the seniors who believe you only get one shot at this world, would disappear.\nKarma and reincarnation are trump cards in the game of human behavior.  It is the only question that really needs to be asked.\n\n","date":"March 9, 2013 at 10:25 am","url":"https://shroudstory.com/2013/03/09/but-they-didnt-ask-about-the-shroud-of-turin/","cat":"news_&_views","id":"comment-26894","author":"Tom Devins","site":"shroudstory"},{"title":"But they didn’t ask about the Shroud of Turin","post":"I would love to see a real poll on the Shroud.  You would get varied answers, I suppose, if asked of 1. dedicated, regularly attending Christians, 2. all Christians & 3. all people.  \nAs to the Catholic poll, if one does not know, the Catholic Church is not a democratic institution so polls only show personal opinions and might indicate practices.  It could reveal a small window into the lack of catechesis & evangelization of many American Catholics.  A well catechized Catholic, if they are truly dedicated to the Church submit to the Church regardless of their opinion, so in that sense, an opinion poll really does not reveal the state of American Catholicism.  A poll to reveal that would have to contrast opinions with obedience questions, such as: A. Are you in favor of women priests? & B. Do you submit to the Church in their teaching there have never been nor can there ever be women priests?.\n\n","date":"March 9, 2013 at 1:25 pm","url":"https://shroudstory.com/2013/03/09/but-they-didnt-ask-about-the-shroud-of-turin/","cat":"news_&_views","id":"comment-26908","author":"Andy Weiss","site":"shroudstory"},{"title":"But they didn’t ask about the Shroud of Turin","post":"That would indeed be a very good poll, an ecumenical one.\nAs for reincarnation, to go deeper necessarily involves Parapsychology and www,ctkchari.org is the ideal place that can help cut the story short. The late Dr. C.T.K.Chari (Madras Christian College,India) was a highly respected scholar, challenged Ian Stevenson (USA) as well as contested material published by SPR, London.\n\n","date":"March 9, 2013 at 7:44 pm","url":"https://shroudstory.com/2013/03/09/but-they-didnt-ask-about-the-shroud-of-turin/","cat":"news_&_views","id":"comment-26931","author":"Louis","site":"shroudstory"},{"title":"But they didn’t ask about the Shroud of Turin","post":"As a liberal Catholic who prefer to listen to his heart and conscience well-before than listening to the pope, I am very pleased to note that, even in a very conservative country like the USA, there is a majority of Catholics who desperately wants the Church to makes important moves that will make it really enter in the 21st century!!!\nYou can be sure of one thing:  American Catholics are far from being alone to seek important changes!  You should come here in Quebec and you would noticed how liberal it is.  The same is also true in France and in many other places in Europe and I’m sure that one day (the sooner the better), this great “wind of change” (that I consider to be a wind blows by the Holy Spirit) will end up producing the changes the Church reallyneeds to be closer to Jesus Christ message of freedom, equality of sex, tolerance over every minority (including gays and lesbians), love and mercy!!!\nAndy is saying that because I’m a liberal, I’m not well-catechized Catholic guy!  I just wants him to know that I’m currently reading a very nice book written by a Quebecer Franciscan named Father Roger Poudrier (http://www.rogerpoudrier.ca/) in which he clearly defend the same liberal point of view as mine, never mind the fact that he always rely on the Catechism of the Catholic Church!  And be sure that he’s not alone in his case here in Quebec, as well as in other parts of the world.  He’s representing a very good example to understand that there are many ways to interpret the same document…\nAlso, I think sometime, people (among them are many “good” Catholics) tend to forget the real meaning of “Catholic” which means “Universal”, which is not what we can see in many aspects of today’s Roman Church!!!\n\n","date":"March 9, 2013 at 8:15 pm","url":"https://shroudstory.com/2013/03/09/but-they-didnt-ask-about-the-shroud-of-turin/","cat":"news_&_views","id":"comment-26934","author":"Yannick Clément","site":"shroudstory"},{"title":"But they didn’t ask about the Shroud of Turin","post":"Yannick, I consider myself fairly liberal too – I don’t have a problem with homosexuality, I am not against abortion, I don’t like abortion but acknowledge and accept its legality etc.\nBut I am firmly against same sex marriage\n\n","date":"March 9, 2013 at 10:20 pm","url":"https://shroudstory.com/2013/03/09/but-they-didnt-ask-about-the-shroud-of-turin/","cat":"news_&_views","id":"comment-26943","author":"Matthias","site":"shroudstory"},{"title":"But they didn’t ask about the Shroud of Turin","post":"That’s your opinion Matthias and I respect it.  I just think that it’s time for the Church to really move into the 21st century.  I think we are due for a Vatican III council and I hope it will come soon.\n\n","date":"March 9, 2013 at 10:35 pm","url":"https://shroudstory.com/2013/03/09/but-they-didnt-ask-about-the-shroud-of-turin/","cat":"news_&_views","id":"comment-26945","author":"Yannick Clément","site":"shroudstory"},{"title":"But they didn’t ask about the Shroud of Turin","post":"Oh, I forgot to say that I’m in favor of same sex marriage because I believe that marriage is mainly a commitment taken by 2 persons who love one another and who wants to live the rest of their life together.  In such a context, since I believe that love is not exclusively the reality of heterosexuals, I don’t see any problem at all with the idea of a religious marriage between two men or two women.  And concerning abortion, I’m against it, even if I don’t that criminalizing the women who take such a drastic decision is the solution to the problem…\n\n","date":"March 9, 2013 at 10:44 pm","url":"https://shroudstory.com/2013/03/09/but-they-didnt-ask-about-the-shroud-of-turin/","cat":"news_&_views","id":"comment-26949","author":"Yannick Clément","site":"shroudstory"},{"title":"But they didn’t ask about the Shroud of Turin","post":"I’ll write again the last phrase of my previous comment because there was a missing word : And concerning abortion, I’m against it, even if I don’t think that criminalizing the women who take such a drastic decision is the solution to the problem…\n\n","date":"March 9, 2013 at 10:45 pm","url":"https://shroudstory.com/2013/03/09/but-they-didnt-ask-about-the-shroud-of-turin/","cat":"news_&_views","id":"comment-26950","author":"Yannick Clément","site":"shroudstory"},{"title":"But they didn’t ask about the Shroud of Turin","post":"Actually Yannick, you have misquoted me from our personal correspondence.  I didn’t say you needed to be catechized because you were liberal.  I said you needed to be catechized because you are not knowledgeable about the Catholic faith and I did so as charitably as possible in private.  Since you placed that here, it’s no longer private.\nThere’s nothing 21st century or modern about homosexuality.  It is ancient and disordered.  I guess you just call St. Paul ignorant for writing that those who practice such things cannot enter the kingdom of God.  Please note it is the practice that is the sin, not the self-identification.  And the sin is no different than any other sin in that it offends God.  \nIt is a fact that homosexuals generally do not have monogamous relationships with the same person for life, which is precisely it’s definition between one man and woman. But redefining marriage to please those who so demand is absurd. It’s the complementarity of the sexes that produces life.  In other words, only when you have a man and a woman is a child produced.  All children deserve a Mother and Father.  There is no such thing as women or men fulfilling both roles naturally.  Neither of the same sex can produce a child except by taking the missing ingredient from someone else, hence the child needs to know and be raised by both his or her Mother and Father.\nThe change you seek has nothing to do with the Holy Spirit.  The change you seek breaks with the 2000 year Catholic tradition.  The very reason for the name Catholic (universal) is because all believed and practiced the same things.  These beliefs did not include homosexuality or abortion.  Your beliefs inasmuch as they vary with the church’s teachings are not Catholic in any sense of the word as applied to the Catholic Church.\n\n","date":"March 10, 2013 at 10:34 am","url":"https://shroudstory.com/2013/03/09/but-they-didnt-ask-about-the-shroud-of-turin/","cat":"news_&_views","id":"comment-26989","author":"Andy Weiss","site":"shroudstory"},{"title":"But they didn’t ask about the Shroud of Turin","post":"Andy, you talk like a pharisee !  You should read again your posts…  Forget the law for a time and please, listen to your conscience and your heart !  The only thing Jesus denounciated strongly while he was on Earth was the pharisee’s way to stick to the law and forget their heart…  Be prudent not to fall in the same pit because, in the eyes of Christ, that’s a much greater sin than abortion or homosexuality (which is not a sin at all by the way) !\nDo you realize that St Paul is writting 2000 years ago and that knowledge about sexuality have grown a lot since that tim???  If we believe all that St Paul has written about the way to live, then we would still live like in ancient times!  And if you (or the official Church or anyone else) is denying the fact that 2 men or 2 women can really love one another, then good for you, but it’s completely off-track versus the REALITY…  It is a fact that a true loving relationship can be real between 2 men or 2 women and that an heterosexual marriage don’t necessarily produce a child !  Are you aware that 2 persons (whatever their gender) can love one another while they don’t want to have children ?  And that surely doesn’t make them more sinner or bad than you and me !  The important thing to judge a relationship is love and only love.  If there is true love in one place, why not accepting it ?  \nAnd concerning your idea that I needed to be catechized, I think you should look at yourself in a mirror my friend because, as I clearly said to you, there are a lot of clergymen that rely on the Catechism of the Catholic Church and who are seeking the same changes inside the Church than me!  Father Roger Poudrier in Quebec is a good example, but he’s surely not alone.  And I can ensure you that me and Roger Poudrier are as Catholic as you…  \nAll along the history of the Church, there were Saints who lead it to some great changes.  THAT WILL NOT STOP MY FRIEND !  The heart of Jesus message is the same than it was 2000 years ago, but the understanding of this revelation has never stop growing since…  It did not stop at St Paul or St John, who were first century Jews that understood Jesus message with all their religious and cultural background, which is a way of understanding that is very old now and which cannot be seen no more as immutable truth, since they were just limited human beings like you and me. Their very Jewish and unfortunatelly wrong theology related to the so-call “sacrificial aspect” of Jesus Passion (which give a portrait of the Father that is far from Love) is just one example that their understanding of Jesus’ revelation about his Father (which was greatly influenced by the sacrifices in the temple) his more and more put aside by many clergymen and faithful in the Church.  Why ?  Simply because the wind of the Holy Spirit has never stoped since 2000 years ago and the profound understanding of Jesus’ revelation continue to get more and more closer to the truth which can be describe in 3 words :  GOD IS LOVE.  I always add this :  AND NOTHING ELSE !  \nFrom a liberal Catholic to a conservative Catholic, I salute you!  You got your way of understanding and I got mine, and we will not change a thing about that.  I can’t change your mind and you can’t change mine.  I just hope you will be open-minded enough to acknowledge that there can be different ways to understand Jesus’ message among Catholics…\n\n","date":"March 10, 2013 at 6:25 pm","url":"https://shroudstory.com/2013/03/09/but-they-didnt-ask-about-the-shroud-of-turin/","cat":"news_&_views","id":"comment-27018","author":"Yannick Clément","site":"shroudstory"},{"title":"But they didn’t ask about the Shroud of Turin","post":"I want to re-write better one part of my previous comment:  \nTheir very Jewish and unfortunatelly wrong theology related to the so-call “sacrificial aspect” of Jesus Passion (which give a portrait of the Father that is far from Love) is just one example that show that their understanding of Jesus’ revelation about his Father (which was greatly influenced by the sacrifices in the temple) is less and less followed these days by many clergymen and faithful in the Church.\n\n","date":"March 10, 2013 at 6:29 pm","url":"https://shroudstory.com/2013/03/09/but-they-didnt-ask-about-the-shroud-of-turin/","cat":"news_&_views","id":"comment-27019","author":"Yannick Clément","site":"shroudstory"},{"title":"But they didn’t ask about the Shroud of Turin","post":"Louis, Thank you for the reference to Dr Chari, who I haven’t really studied.  The link is: http://www.ctkchari.org/ .  It seems to be a web-site compiled by surviving members of his family.  On the site, there are lists of his compprehensive works, but sadly no links to them.  So I’m still unaware of what he has to say in his writings or the main thrust of his thought. \nAs part of the eastern component of my Religious Studies supplementary major I read the Vedas, the Upanishads, and the Bhagasvad Gita, and prepared and presented papers on them, along with various Buddhist scriptures. There is much I feel to be learned from eastern aspects of spirituality, but there is also much that I would reject, and I’ve concluded that reincarnation is just too alien to any kind of Christian perspective, for me to bother pursuing it in any depth.  \nI’m not at all impressed with any arguments against the ordination of women, and I know we have hotly debated this topic before.  Recently NZ was cited as the most enlightened country for the employment of women, even ahead of the Nordic countries.  I’m only too well aware of the historical hostility towards women in every profession, mathematics being a prime example.  Sophie Germaine was a particularly brilliant\nmathematician, making major contributions to the theory of elasticity and Fermat’s Last Theorem as examples.  She corresponded with Karl Friedrich Gauss whom she delighted with her various proofs.  The lack of her name being inscribed on the Eiffel Tower is a sriking omission, Why? Simply because she was the wrong gender!  The arguments against women priests, are no more forceful in my opinion than any other barriers raised by an entrenched male establishment to their captive profession.  We are going to continue to disagree about this topic.\n\n","date":"March 9, 2013 at 8:40 pm","url":"https://shroudstory.com/2013/03/09/but-they-didnt-ask-about-the-shroud-of-turin/","cat":"news_&_views","id":"comment-26938","author":"daveb of wellington nz","site":"shroudstory"},{"title":"But they didn’t ask about the Shroud of Turin","post":"Your equality/capability argument in regard to permitting women to become priests is not impressive nor convincing in any respect Dave.  We already had that conversation, but you have introduced it anew nonetheless, so I felt obliged to respond.  God bless.\n\n","date":"March 10, 2013 at 10:41 am","url":"https://shroudstory.com/2013/03/09/but-they-didnt-ask-about-the-shroud-of-turin/","cat":"news_&_views","id":"comment-26990","author":"Andy Weiss","site":"shroudstory"},{"title":"But they didn’t ask about the Shroud of Turin","post":"Andy, don’t you forget that Mary Magdalen was the very first person to have received a missionary task from the Resurrected Christ when he said to her : “Go and tell my brothers that I am resurrected!!!”.\nSo, if Jesus himself wanted that some women became missionaries, who are we to close the door to some Catholic women who says that they have clearly received a call for priesthood from the Holy Spirit???\nIf Jesus judged that women were good enough to become missionaries, why not priests???\n\n","date":"March 10, 2013 at 7:09 pm","url":"https://shroudstory.com/2013/03/09/but-they-didnt-ask-about-the-shroud-of-turin/","cat":"news_&_views","id":"comment-27025","author":"Yannick Clément","site":"shroudstory"},{"title":"But they didn’t ask about the Shroud of Turin","post":"I didn’t reintroduce it anew Andy.  You did at #2, and it is as valid a polling question as any of the others in the original posting.  I felt constrained to respond to it.  I submit that the arguments in favour of women priests are no less “impressive nor convincing” than the tenuous arguments promoted by the present solely male hierarchy denying it.  Some 50% of the church’s following will have no gender representation at the forthcoming papal election!\n\n","date":"March 10, 2013 at 4:35 pm","url":"https://shroudstory.com/2013/03/09/but-they-didnt-ask-about-the-shroud-of-turin/","cat":"news_&_views","id":"comment-27012","author":"daveb of wellington nz","site":"shroudstory"},{"title":"But they didn’t ask about the Shroud of Turin","post":"David, I typed a comma instead of a dot and that is why the link did not appear correctly, so thanks for the correction. Some years ago I delved into the debate involving Dr. Chari — an empiricist —  in some issues of the Journal of the SPR to which I had access in an institution. Unfortunately the journals are not available now because they are packed in boxes together with other material in the same institution but in a place where there is now no room for a library. The lack of funds gave them no choice and one source of income, although small, but which could help, was blocked. You might wonder what this source of income was. Here is the answer: debunking of things like “spiritual surgery” (I prefer to use the term “psychic surgery”), communicating with the dead and so on on TV was brought to an end when the “reincarnationists” exerted pressure on the channel, then headed by a Spiritualist. Perhaps you can find these journals and other material in some library in NZ?\nYes, there are many things to learn from Eastern spirituality,but there is no doubt that belief in karma and reincarnation leads to a lot of suffering. Look at those 500 million hungry mouths in India. Why the surprise when Mother Teresa was given a Head of State funeral? Why do ‘reincarnationists” get annoyed when told that belief in reincarnation implies that God is cruel? Where is the fullness of life in places like these? \nYou are also right that there will always be disagreement when it comes to women priests. Remember: Pope John Paul II cited the twelve male disciples. This is not like saying that women are inferior, only that they have a different role to play.\n\n","date":"March 9, 2013 at 10:13 pm","url":"https://shroudstory.com/2013/03/09/but-they-didnt-ask-about-the-shroud-of-turin/","cat":"news_&_views","id":"comment-26942","author":"Louis","site":"shroudstory"},{"title":"But they didn’t ask about the Shroud of Turin","post":"I agree re: abortion Yannick.\nI understand the logic in supporting same sex marriage,  I really do, but the traditionalist in me really struggles with it.\n\n","date":"March 10, 2013 at 5:59 am","url":"https://shroudstory.com/2013/03/09/but-they-didnt-ask-about-the-shroud-of-turin/","cat":"news_&_views","id":"comment-26967","author":"Matthias","site":"shroudstory"},{"title":"But they didn’t ask about the Shroud of Turin","post":"The best way for you to overcome your pre-judgement about that (which is surely link with your socio-cultural background) is to look at this issue (as well as any other moral issue) with the gauge of love !!!  The only relevant question is this :  Is there is true love in there or not?  And I firmly believe that it is truly possible for 2 men or 2 women to live a true relationship based on love and not lust, just like it is truly possible for a men and a women to live a bad relationship based on lust or even just on money or some other material issue…  In that regard, I don’t see ANY GOOD REASON for the Church to not blessed a true loving relationship between 2 men or 2 women who are Catholic as much as Andy or me or you (and who will not end up in hell more than Andy, me or you) !!!\nThat leads to one crucial question :  As Catholic, are we believing in a God who is a loving Father and nothing else (as it was shown by Jesus during all his ministry, especially during his Passion) and consequently, who think and act VERY DIFFERENTLY than us (which truly makes him God !) or did we just see God as some kind of old guy with a long white beard (like Zeus) who have a baseball bat in his hand and who is making the count of our sins and finally, who will judge us on these bad actions instead of strickly on the fact that we’re all his childrens ???  One day or another, we must, as Catholic, make a choice.  Therese of Lisieux said one day :  If you want judgement, YOU WILL GOT JUDGEMENT, but if you want love, YOU WILL GOT LOVE.  It’s been a while now since I have made my decision :  I choose love!  Personally, I’m too weak to really love everyone but I know in my heart that there’s a being who is able to do so and it is the God of Jesus precisely !  It’s not important that I can’t love perfectly in this life, as long as I recognize that and count on the Father to save me.\n\n","date":"March 10, 2013 at 7:00 pm","url":"https://shroudstory.com/2013/03/09/but-they-didnt-ask-about-the-shroud-of-turin/","cat":"news_&_views","id":"comment-27021","author":"Yannick Clément","site":"shroudstory"},{"title":"But they didn’t ask about the Shroud of Turin","post":"A news story Dan & Yannick might overlook…\nHamden, Conn., Mar 9, 2013 / 04:03 pm (CNA).- A majority of Catholics who attend services weekly oppose same-sex “marriage,” according to a poll by Quinnipiac University, even though it’s release suggested that Catholics largely support the practice.\nAmong Catholics who are registered to vote and who attend services weekly, 36 percent support “gay marriage,” while 55 percent oppose it, according to figures provided to CNA by April Radocchio, Quinnipiac University Polling Institute’s associate poll director.\nThe release announcing the poll, by contrast, said that among all registered voters who identify as Catholic – 11 percent of whom never attend religious services – 54 percent support same-sex “marriage,” while only 47 percent of all registered voters are supportive of it.\nBased on this finding, Peter Brown, Quinnipiac’s assistant director, said that “Catholic voters are leading American voters toward support for same-sex marriage.”\nBrown’s assertion drew criticism from some Catholic circles, with many suggesting that the poll was flawed in some way.\nPia de Solenni, an ethicist who holds a doctorate in sacred theology from the Pontifical University of the Holy Cross, emphasized that the poll, with a sample of less than 500 Catholics, was “hardly representative” of Catholics in America.\n“When you ask someone if they’re Catholic, you have to further specify, do they attend church regularly or not,” she noted. Survey results are often vastly different between Catholics who do and do not regularly attend Mass.\nThe poll surveyed 497 Catholics from Feb. 27 to March 4, and had a margin of error of plus or minus 4.4 percent for questions asked of Catholics.\nIn the release announcing the poll’s results, Quinnipiac provided figures for several questions pertinent to Catholics in America. Most of these were issues particular to Catholics, and the answers were broken down so that readers could compare the differences between those Catholics who attend religious services weekly and less than weekly.\nHowever the question asking about support or opposition to same-sex marriage did not have this distinction, merely showing Catholics as a whole.\nRadocchio explained the discrepancy, telling CNA that the question about same-sex marriage was asked in the “general issues section” of the poll, and the question was posed to all registered voters.\n“We reported them with the breakdowns we generally used with registered voter releases,” she explained.\nShe said that the remaining questions were all “Catholic issues” which were asked only of Catholic respondents, regardless of their voter registration.\nAmong Catholics who are registered to vote and who attend services weekly, a mere 36 percent support “gay marriage,” while 55 percent oppose it, the poll found. Among those who attend services less than weekly, 63 percent support “gay marriage” and 29 percent oppose it.\nThe margin of error for those figures is plus or minus 4.7 percent. Fewer than 497 Catholics were asked the question, because not all of the Catholic respondents were registered voters, though Radocchio said the number of Catholic respondents about “gay marriage” was “not much less” than 497.\nBrown told CNA that the breakdown of the same-sex “marriage” results was not in the initial poll release because “we only have so much space, and can only do so many things up front.”\nIt was “certainly not malicious,” he said, and was a “completely benign decision.”\nThe poll also found that while 52 percent of respondents think the Church is “moving in the right direction,” 55 percent think the next Pope “should move the Church in new directions.” Sixty-four percent said the next Pope should “relax the church ban on contraception,” and 62 percent responded that he should support allowing women to become priests.\nThe responses to these questions consistently showed a stark contrast in the opinions of those who attend Mass weekly, and those who attend less than weekly. For example, of those who do not attend services weekly, 73 percent support the priestly ordination of women. Of those who do attend weekly, that figure is only 38 percent.\nDe Solenni said the poll “shows the importance of more effective teaching” in the Church.\nShe noted that “when you ask a question of those who attend Mass regularly, the ratios are almost inverse.”\n“So if they really want to do a survey that has some integrity, let us know what the standard is for identifying someone as Catholic.”\nDe Solenni added that these issues are not of interest solely to Americans, but to Catholics worldwide. “It’s really important that we take a global perspective on this, and look at what people are saying around the world.”\nShe said that polls such as the one conducted by Quinnipiac can be useful in terms of “knowing the audience you’re speaking to” and “how much teaching needs to be done.”\nSuch polls, however, are not helpful guides “in terms of telling us which policies we should pursue.”\nhttp://m.catholicnewsagency.com/new.php?n=26752\n\n","date":"March 10, 2013 at 10:05 am","url":"https://shroudstory.com/2013/03/09/but-they-didnt-ask-about-the-shroud-of-turin/","cat":"news_&_views","id":"comment-26986","author":"Andy Weiss","site":"shroudstory"},{"title":"But they didn’t ask about the Shroud of Turin","post":"Andy, I agree that the Church will never change because of some polls…  \nBut nevertheless, these polls clearly indicates that there are more and more modern Catholics who are waiting to see some important changes in the structure and in the moral teaching of the Church.  To me, this is a good indicator that these changes will come someday and if they come, be sure that the Holy Spirit will be behind them.\n\n","date":"March 10, 2013 at 7:03 pm","url":"https://shroudstory.com/2013/03/09/but-they-didnt-ask-about-the-shroud-of-turin/","cat":"news_&_views","id":"comment-27022","author":"Yannick Clément","site":"shroudstory"},{"title":"But they didn’t ask about the Shroud of Turin","post":"I have some reservations on how validly representative of American opinion the poll might be, as little information on the sampling method followed is given in the report.  The only information given in the web-site link is: \n“From February 27 – March 4, Quinnipiac University surveyed 497 adults Catholics with a margin of error of +/- 4.4 percent. The same-sex marriage question was asked of 1,944 registered voters nationwide with a margin of error of +/- 2.2 percentage points. Live interviewers call land lines and cell phones.”\n“The Quinnipiac University Poll, directed by Douglas Schwartz, Ph.D., conducts public opinion surveys in Pennsylvania, New York, New Jersey, Connecticut, Florida, Ohio, Virginia and the nation as a public service and for research.” \nWe might infer that only the same-sex marriage question involving 1,944 registered voters was canvassed nation-wide.  We might also infer that perhaps only 497 Catholics in the states specifically named were canvassed on the remainder, or not, as the case might be.  We might as easily infer that only Connecticut Catholics were asked, or possibly only those in the vicinity of Hamden, or was even weighted by those more easily contacted at Quinnipiac University.  The report is silent on this important aspect of representative sampling.  One would hope that valid sampling protocols were followed in asserting that the respective percentages are truly representative of Catholics nation-wide.  We might also ask “To what extent does the future of the Catholic Church vest in U.S.A. Catholics, compared to other jurisdictions in other parts of the globe?”\n\n","date":"March 10, 2013 at 5:08 pm","url":"https://shroudstory.com/2013/03/09/but-they-didnt-ask-about-the-shroud-of-turin/","cat":"news_&_views","id":"comment-27013","author":"daveb of wellington nz","site":"shroudstory"},{"title":"But they didn’t ask about the Shroud of Turin","post":"The post is about women becoming priests in the Catholic Church but has led to comments that are off-topic. One wonders how many of those Catholics in favour of ordaining women have read the NT carefully and understood that in his attitudes and actions Jesus was acting with divine sanction. That is, at least for those who do believe that he was “true God and true man”. \nJesus lodged in the house of Simon the leper, in a leper colony, on his way to Jerusalem, demonstrating that he rejected Essene belief. He cured on the sabbath, and inside a synagogue, defying both Pharisees and Sadducees. If he wanted a woman as a disciple he would have one.\nIs it that difficult to understand what Pope John Paul II meant?\n\n","date":"March 10, 2013 at 8:16 pm","url":"https://shroudstory.com/2013/03/09/but-they-didnt-ask-about-the-shroud-of-turin/","cat":"news_&_views","id":"comment-27029","author":"Louis","site":"shroudstory"},{"title":"But they didn’t ask about the Shroud of Turin","post":"Yannick\nWhat are your views on assisted suicide as a fellow Catholic?  I watched a very good BBC documentary on it last night, its a difficult, complex moral issue but I found myself walking away thinking there ARE Christian compassionate grounds for it, for some terminal conditions.\nI guess introducing it in some scenarios can become a slippery moral slope.\n\n","date":"March 10, 2013 at 9:47 pm","url":"https://shroudstory.com/2013/03/09/but-they-didnt-ask-about-the-shroud-of-turin/","cat":"news_&_views","id":"comment-27041","author":"Matthias","site":"shroudstory"},{"title":"But they didn’t ask about the Shroud of Turin","post":"What I think his this :  Who are we to remove the right for a person to end his suffering under a proper medical supervision if it’s really what she wants?  Again, the only good way to judge a moral issue like that is to ask ourselves what is the most loving way to do in such a dramatic situation?  And to me, the most loving way to do is to HELP this person to die in a good context if there is no hope, medically speaking, for a healing and if ending up that suffering is what’s that person really wants because she just can’t take it anymore.  Between the moral law of the Church and the free will of a suffering person, every time I will choose to respect the free will of that person…\n\n","date":"March 11, 2013 at 10:45 am","url":"https://shroudstory.com/2013/03/09/but-they-didnt-ask-about-the-shroud-of-turin/","cat":"news_&_views","id":"comment-27075","author":"Yannick Clément","site":"shroudstory"},{"title":"But they didn’t ask about the Shroud of Turin","post":"According to the Price-Waterhouse-Cooper OECD report (8 March, 2013), the Nordic countries and New Zealand occupy the first four places in the progress towards female opportunities in the labour market.  Poland (John Paul II) 14th, Germany (Benedict XVI) 15th, Israel (Jesus) 19th, just behind USA 17th and UK 18th. Early Christianity was effective in bringing compassion to lepers, amending the day of the sabbath, and faith healing in churches has early origins.  But it would take 2000 more years to recognise gender equality in employment, notwithstanding St Paul’s injunction that all are equal before God – no more Greek nor Jew, no more male nor female … A female disciple could not be effective in 1st century Palestine because of false cultural male pretensions.  It was a matter of priorities, Jesus knew about these stiff-necks, hence little point in his appointing a female disciple!  In India, there has been little change, women still work 90 minutes more a day than men!\n\n","date":"March 10, 2013 at 10:08 pm","url":"https://shroudstory.com/2013/03/09/but-they-didnt-ask-about-the-shroud-of-turin/","cat":"news_&_views","id":"comment-27042","author":"daveb of wellington nz","site":"shroudstory"},{"title":"But they didn’t ask about the Shroud of Turin","post":"Well, Jesus concentrated on the spiritual aspect, and so did St. Paul, that is why the apostle said “no more Greek nor Jew, no more male or female.” If he was referring to gender equality there would be no mention of Greek and Jew, just Male and Female. .\n\n","date":"March 11, 2013 at 8:31 pm","url":"https://shroudstory.com/2013/03/09/but-they-didnt-ask-about-the-shroud-of-turin/","cat":"news_&_views","id":"comment-27104","author":"Louis","site":"shroudstory"}]
