[{"title":"A Guest Posting by “Jabba” (Rich Savage)","post":"Good luck Jabba, you’ve got quite the task ahead of you. Through reading some of the posts and recognizing the type of posters your dealing with, you’re definately going to need some ‘devine’ help.\nI’m definately not your man, I could care less at this point of converting anyone, sorry.\nAgain good luck and appreciate your strength and conviction.\nRon\n\n","date":"March 26, 2012 at 2:18 am","url":"https://shroudstory.com/2012/03/25/a-guest-posting-by-jabba-rich-savage/","cat":"news_&_views","id":"comment-9650","author":"Ron","site":"shroudstory"},{"title":"A Guest Posting by “Jabba” (Rich Savage)","post":"Ron,\n– Thanks, anyway.  Check in on us again when you get a chance.\n— Jabba\n\n","date":"March 26, 2012 at 6:46 am","url":"https://shroudstory.com/2012/03/25/a-guest-posting-by-jabba-rich-savage/","cat":"news_&_views","id":"comment-9652","author":"Richard Savage","site":"shroudstory"},{"title":"A Guest Posting by “Jabba” (Rich Savage)","post":"They don’t know how blessed they are to HAVE you, it’s a very tough mission field and you’re brave to try it. Bless you. May some good come of it…\n\n","date":"March 26, 2012 at 7:39 am","url":"https://shroudstory.com/2012/03/25/a-guest-posting-by-jabba-rich-savage/","cat":"news_&_views","id":"comment-9655","author":"AnnieCee","site":"shroudstory"},{"title":"A Guest Posting by “Jabba” (Rich Savage)","post":"Thanks, Annie.  I can use all the encouragement I can get.\n— Jabba\n\n","date":"March 26, 2012 at 3:40 pm","url":"https://shroudstory.com/2012/03/25/a-guest-posting-by-jabba-rich-savage/","cat":"news_&_views","id":"comment-9664","author":"Richard Savage","site":"shroudstory"},{"title":"A Guest Posting by “Jabba” (Rich Savage)","post":"Richard, seeing as these athiests seem to attack you on all fronts, never really giving you a chance to direct yourself to one area (A typical strategy by the way). Here’s a tip; Attack them directly at their strongest points for inauthenticity and don’t waver from this strategy.They don’t have many points; C14, d’ Arcis, McCrone. But be specific and thorough. With the c14 you may want to explain to them first, it’s fallibility and it’s propensity to errors, from it’s basic assumptions, up to written documents showing very good ‘reviews’ of the supposed peer-reviewed Nature paper. Little unknown facts such as all labs using samples of too small or of too low weight to be properly sampled, for example.\nGood luck in your mission.\nRon.\n\n","date":"March 26, 2012 at 4:06 pm","url":"https://shroudstory.com/2012/03/25/a-guest-posting-by-jabba-rich-savage/","cat":"news_&_views","id":"comment-9666","author":"Ron","site":"shroudstory"},{"title":"A Guest Posting by “Jabba” (Rich Savage)","post":"Yes, I agree. They change topics constantly. They aren’t willing to actually DISCUSS anything. This shows their blatant dishonesty, in my opinion. You may learn some things by debating them, but it would be a miracle if they learned anything from you – because most of them aren’t interested in knowing the truth. Still, if this is what God wants you to do for now it may be worthwhile. It will certainly sharpen your own debate skills and increase your own understanding of the points involved. \nOne thing they can’t handle is anything supernatural. And yet the evidence collected so far about the Shroud indicates that something supernatural most likely DID happen in order to imprint the image on the cloth. \nMaybe you can’t exactly prove it, but they can’t disprove it either. However, they are not content to leave that alone, which is why the Shroud nags at them. And explains why people are able to sell ridiculous books that (attempt) to discredit the Shroud. \nThe Shroud is about Jesus Christ, first of all. If it is really the Shroud of Christ, then the real power in the Shroud is the story of Christ’s Passion. The whole story is THERE, a flannelgraph lesson of what Christ did for us.\n\n","date":"March 26, 2012 at 4:29 pm","url":"https://shroudstory.com/2012/03/25/a-guest-posting-by-jabba-rich-savage/","cat":"news_&_views","id":"comment-9668","author":"AnnieCee","site":"shroudstory"},{"title":"A Guest Posting by “Jabba” (Rich Savage)","post":"Ron and Annie,\n– I don’t have time to address your points tonight, but I’ll be back tomorrow.  So, don’t go away.\n— Rich\n\n","date":"March 26, 2012 at 8:53 pm","url":"https://shroudstory.com/2012/03/25/a-guest-posting-by-jabba-rich-savage/","cat":"news_&_views","id":"comment-9677","author":"Richard Savage","site":"shroudstory"},{"title":"A Guest Posting by “Jabba” (Rich Savage)","post":"Ron,\n– I’m responding experimentally — hopefully, the format I’ll be trying will be effective.\n\nRon :\nRichard, seeing as these athiests seem to attack you on all fronts, never really giving you a chance to direct yourself to one area (A typical strategy by the way). Here’s a tip; Attack them directly at their strongest points for inauthenticity and don’t waver from this strategy.They don’t have many points;…\n– I fully agree.  In fact, that’s exactly what I’m trying to do.  I’ve asked them to tell me which sub-sub-etc-issue to address first.  Without having a singular spokesperson, however, they’ve given me numerous sub…issues to address, and I’ve had to pare them down  to one.  At this point, it’s carbon dating/non-representative section/problematic selection…  Hopefully, that’s decipherable.\n– If it is, and if you have a favorite article (or two) regarding that sub-issue, please point me to it (them).\n— Rich\n\n","date":"March 27, 2012 at 6:17 am","url":"https://shroudstory.com/2012/03/25/a-guest-posting-by-jabba-rich-savage/","cat":"news_&_views","id":"comment-9684","author":"Richard Savage","site":"shroudstory"},{"title":"A Guest Posting by “Jabba” (Rich Savage)","post":"Your not listening; Don’t ask them anything, approach it on your level., Use the 3 points against them, Build your post comments, place them was accurate information and links to proper documents and leave it!! There is no use trying to discuss with them right away.Also there is so much evidence to be found on these 3 issues. But remember a couple of things, these folk (from what I deduce from their comments and I think your only dealing with like a half dozen) are already steadfastly biased that the Shroud is a hoax, and two, again from reading their comments; Are not very intelligent or open minded it’s obvious they have definately never read any peer-reviewed documents or anything actually in ‘defence’ of the Shroud. They have read absolutely nothing on the science of radiocarbon dating or vanillan loss as stated by R Rogers, most of them are talking out of their ‘other’ ends…It also seems they get all their answers from a couple of athiest sites and non scholarly writings. \nI personally wouldn’t waste my time on them to tell you the truth, but hey it’s your life.\nI’ll try to put together some papers or links to relevant documents and email them to you. That reminds me read up on C14 and it’s presuppositions and archaeologist’s expectations of it.\nYou may want to visit http://theshroudstory.blogspot.ca/   Steve has written plenty on these topics with lots of references.\nRon\n\n","date":"March 27, 2012 at 11:41 pm","url":"https://shroudstory.com/2012/03/25/a-guest-posting-by-jabba-rich-savage/","cat":"news_&_views","id":"comment-9709","author":"Ron","site":"shroudstory"},{"title":"A Guest Posting by “Jabba” (Rich Savage)","post":"Sorry first line should end with ON YOUR TERMS.\nRon\n\n","date":"March 27, 2012 at 11:44 pm","url":"https://shroudstory.com/2012/03/25/a-guest-posting-by-jabba-rich-savage/","cat":"news_&_views","id":"comment-9710","author":"Ron","site":"shroudstory"},{"title":"A Guest Posting by “Jabba” (Rich Savage)","post":"Oops, that link should read as; http://theshroudofturin.blogspot.ca/   \nsorry for the error.\n\n","date":"March 27, 2012 at 11:57 pm","url":"https://shroudstory.com/2012/03/25/a-guest-posting-by-jabba-rich-savage/","cat":"news_&_views","id":"comment-9712","author":"Ron","site":"shroudstory"},{"title":"A Guest Posting by “Jabba” (Rich Savage)","post":"\nRon :\n…But be specific and thorough. With the c14 you may want to explain to them first, it’s fallibility and it’s propensity to errors, from it’s basic assumptions, up to written documents showing very good ‘reviews’ of the supposed peer-reviewed Nature paper. Little unknown facts such as all labs using samples of too small or of too low weight to be properly sampled, for example.\n\nRon,\n– If possible, and not too time-consuming, please point me to your favorite, appropriate article.\n– Also, what do you mean by “supposed peer-reviewed”?\n– Also, if you feel like it’s inappropriate to be going back and forth like this on Dan’s blog, my email is rsavage@nycap.rr.com.\n– Thanks, again.\n— Rich\n\n","date":"March 27, 2012 at 6:29 am","url":"https://shroudstory.com/2012/03/25/a-guest-posting-by-jabba-rich-savage/","cat":"news_&_views","id":"comment-9685","author":"Richard Savage","site":"shroudstory"},{"title":"A Guest Posting by “Jabba” (Rich Savage)","post":"“Also what do you mean by the supposed peer-review?” Exactly what it says. If the RCD article released by Nature was peer-reviewed, it was a very shoddy job. Almost bad enough to the point that one wonders was it actually properly reviewed or just scanned over quickly. There have been many questions raised on details of the testing and paper; chi value, sample weights, pre-cleaning, etc, etc; for example…thats what I mean.\nRon\n\n","date":"March 27, 2012 at 11:53 pm","url":"https://shroudstory.com/2012/03/25/a-guest-posting-by-jabba-rich-savage/","cat":"news_&_views","id":"comment-9711","author":"Ron","site":"shroudstory"},{"title":"A Guest Posting by “Jabba” (Rich Savage)","post":"\nAnnieCee :\nYes, I agree. They change topics constantly. They aren’t willing to actually DISCUSS anything. This shows their blatant dishonesty, in my opinion. You may learn some things by debating them, but it would be a miracle if they learned anything from you – because most of them aren’t interested in knowing the truth. Still, if this is what God wants you to do for now it may be worthwhile. It will certainly sharpen your own debate skills and increase your own understanding of the points involved. \nAnnie,\n– I am learning a lot, and I do doubt that any of them will change their minds — but then,\n1) one of them does seem open-minded about the issue;\n2) I’m still hoping that I can keep narrowing the focus enough so that we (most of us) can finally agree upon exactly what it is that we disagree about; and,\n3) I’ll be able to attract someone to our website where we can reduce their spokesperson to one, and (with a little luck) drum up a somewhat neutral audience.\n\nOne thing they can’t handle is anything supernatural. And yet the evidence collected so far about the Shroud indicates that something supernatural most likely DID happen in order to imprint the image on the cloth.\nMaybe you can’t exactly prove it, but they can’t disprove it either. However, they are not content to leave that alone, which is why the Shroud nags at them. And explains why people are able to sell ridiculous books that (attempt) to discredit the Shroud.\nThe Shroud is about Jesus Christ, first of all. If it is really the Shroud of Christ, then the real power in the Shroud is the story of Christ’s Passion. The whole story is THERE, a flannelgraph lesson of what Christ did for us.\n\nYeah.  I also expect it to be “supernatural,” but it should give us great pause, whether or not it’s supernatural.  An authentic Shroud makes makes Jesus extremely personal.\n– Any advice will be greatly appreciated, and my email address is rsavage@nycap.rr.com.\n– Thanks, again.\n— Rich\n\n","date":"March 27, 2012 at 8:24 am","url":"https://shroudstory.com/2012/03/25/a-guest-posting-by-jabba-rich-savage/","cat":"news_&_views","id":"comment-9689","author":"Richard Savage","site":"shroudstory"},{"title":"A Guest Posting by “Jabba” (Rich Savage)","post":"Rich,\nFor plenty of documents, best place is http://www.shroud.com. For some excellent papers on the 14C situation and for what I said above about the Nature paper check out the ‘Scientific papers and articles section’.\nRon\n\n","date":"March 28, 2012 at 5:38 pm","url":"https://shroudstory.com/2012/03/25/a-guest-posting-by-jabba-rich-savage/","cat":"news_&_views","id":"comment-9734","author":"Ron","site":"shroudstory"},{"title":"A Guest Posting by “Jabba” (Rich Savage)","post":"Rich — Try the following site for a discussion of the reweaving:\nhttps://docs.google.com/viewer?a=v&q=cache:xHWenHbCBWMJ:ohioshroudconference.com/papers/p11.pdf+flury+lemburg+shroud&hl=en&gl=us&pid=bl&srcid=ADGEESgTkq3ZGSUqVZdmtnB8-Dt4aDZU-6y7A8PTS-mVIYLXRo1qU-Whnm-3LKkR9c5ZeDEihAS4QpZRkzM6jzw83QMBZaSvC6ZJr9b2OnnMgRkpotWN-gz2H_I2RGVpzV2TBO6A9rfK&sig=AHIEtbSTCCNZEjiQ0a9CpEu-qO_i_NiSXA\nAlso  — when confronting Randian Looney Tunes, it is important to hold them to their own standards.  They are ready to dismiss any work supportive of the Shroud if it is not peer-reviewed, or they can find some *ad hominem* against the author; but they dismiss out of hand even the possibility of anything against atheists attacking the Shroud, usually by demanding proof *ad infinitum*.  See post #69 on the Randian thread for examples.\n\n","date":"March 29, 2012 at 7:19 am","url":"https://shroudstory.com/2012/03/25/a-guest-posting-by-jabba-rich-savage/","cat":"news_&_views","id":"comment-9745","author":"grey","site":"shroudstory"},{"title":"A Guest Posting by “Jabba” (Rich Savage)","post":"Grey; Your direction to post #69, leads exactly to my statement made back in my post #9. These athiests are completely biased, blinded, unintelligent and more precisely talking thru their rear orifices. Notice their references to Joe Nickels for most of their evidence…that very telling of thier intelligence….they actually would accept the words of Nickels against the peer-reviewed words of a world reknowned chemist as R. Rogers….idiots.\nRich- you may want to read the various articles by Remi Van Haelst on the c14 dating, these documents ‘technology’ and otherwise, prove the incompency of the testing and the Nature report peer-review.\nRon\n\n","date":"March 29, 2012 at 4:49 pm","url":"https://shroudstory.com/2012/03/25/a-guest-posting-by-jabba-rich-savage/","cat":"news_&_views","id":"comment-9766","author":"Ron","site":"shroudstory"},{"title":"A Guest Posting by “Jabba” (Rich Savage)","post":"Excuse my grammer; ‘technology’ should read as tecnically and incompency should read as incompetency.\n\n","date":"March 29, 2012 at 5:37 pm","url":"https://shroudstory.com/2012/03/25/a-guest-posting-by-jabba-rich-savage/","cat":"news_&_views","id":"comment-9771","author":"Ron","site":"shroudstory"},{"title":"A Guest Posting by “Jabba” (Rich Savage)","post":"Yeah, that was my conclusion too. I spent some time in an Atheist forum, several months. I got something out of it but I don’t think they got a blame thing.  \nI do think the Lord gave me wisdom because there were times I really did have control of the conversation – not that my goal was “control”, that’s not it at all.  But I tried to stop their circular way of discussing things and sometimes I could do that but ONLY if I didn’t play the game THEIR WAY.  They like to force their “victims” to run in circles. They don’t EVER like to come to conclusions, they just like to throw questions at you rapid-fire to keep you spinning in circles. \nI learned that they tend to get crazy if you talk about Noah’s Ark. I wondered why that set them off because it really did. I figure it’s because Noah’s Ark is a story of God’s judgment on mankind, and the devil doesn’t like to be reminded of what’s in store for him. Judgment is inevitable. There’s plenty of evidence of the Flood, lots and lots of it. The flood is probably what throws off Carbon dating because they don’t factor that in. That’s my opinion on it anyway because I think their dates are screwy. It jumps from 10,000 years to millions and billions – with hardly anything in between. In other words, carbon dating gets really weird if they try to go back before the flood happened and so I think they left the flood out of their algorithms. \nThey refuse to talk about angels. Even though there’s an endless supply of stories from people who have met and talked with angels or had angels save their life. They won’t go there. An angel saved MY life one time, maybe more than that. I’ve seen a few genuine for-real documented miracles. But of course they mock all of it. Even the PROOF is not good enough for them, the idiots. \nJesus told the story of the Rich Man and Lazarus the beggar. They both died. The rich man in hell begged Abraham to send Lazarus to warn his brothers. Abraham said it was not possible, and besides, they already had the prophets to warn them and if that wasn’t enough then nothing else would work either.  WHAT THIS STORY IS SAYING IS THIS:  The TESTIMONY of the Saints is all the PROOF that the Living are going to get!  That, and creation itself are enough to convince anybody and if it isn’t, then that person is a lost cause.  \nSO the lesson to be learned is this: YOUR TESTIMONY is a priceless gift and should be respected when sharing it with others. Most of the time with these loud-mouth atheists it’s like throwing pearls before swine, but that doesn’t mean the pearls (your testimony) are worthless. It just says something about the swine who are supposedly intelligent but they actually know nothing. And like Ron says, they fart a lot. \nI’m very amused that the Shroud of Turin provokes them. Makes me happy to know they can’t find any peace as long as the Shroud exists. They don’t deserve peace, with all the blasphemies that come of them. I don’t wish damnation for them: I believe the best “revenge” is repentance.  There is very little that gives me true joy, but watching someone get serious about God is one thing that really makes me happy and glad for them.  This is what I wish for everyone.\n\n","date":"March 29, 2012 at 6:48 pm","url":"https://shroudstory.com/2012/03/25/a-guest-posting-by-jabba-rich-savage/","cat":"news_&_views","id":"comment-9773","author":"AnnieCee","site":"shroudstory"},{"title":"A Guest Posting by “Jabba” (Rich Savage)","post":"– Thanks, guys.  Looks like I’ve got my work cut out for me. \n– I would sure like to stay in touch — can we do that effectively on Dan’s blog?\n– If not, my email address is rsavage@nycap.rr.com; my Shroud blog is http://shrouddebates.com/; my attempt at a fair trial for Jesus is found at http://messiahornot.com/.\n– I’ve been involved in Internet debates since 1997, and began analyzing human debate back in 1970.  To see more about where I’m coming from, go to my Shroud blog, and especially to section #5.\n– Previously, I had been trying to recruit “team members,” for the Shroud debates I’m proposing, but it appears that actually knowledgeable “Shroudies” don’t have the time to really commit themselves to such an undertaking.  So now, I’m just looking for “advisers.”  And mostly, what I need from advisers is direction away from dead ends, and help in finding relevant information…\n– Whatever help you can provide would be greatly appreciated.\n— Rich\n\n","date":"March 30, 2012 at 10:46 am","url":"https://shroudstory.com/2012/03/25/a-guest-posting-by-jabba-rich-savage/","cat":"news_&_views","id":"comment-9793","author":"Richard Savage","site":"shroudstory"},{"title":"A Guest Posting by “Jabba” (Rich Savage)","post":"Annie,\n– Running in circles is probably my biggest problem, and I think that I know how to prevent such foolishness — it’s just hard to resist the temptation to try to answer all my opponents questions and objections as quickly as possible…\n– Instead, I should be constantly narrowing my focus — from one issue, to one “sub-issue,” to one sub-sub issue, to one sub-sub-sub-issue”, etc.  Hope that’s coherent…\n– Whatever, I’ll keep working on it.\n— Rich\n\n","date":"March 30, 2012 at 10:59 am","url":"https://shroudstory.com/2012/03/25/a-guest-posting-by-jabba-rich-savage/","cat":"news_&_views","id":"comment-9795","author":"Richard Savage","site":"shroudstory"},{"title":"A Guest Posting by “Jabba” (Rich Savage)","post":"Hi Rich, well you are willing to go where no man dares to go. God will bless you for your missionary heart, that’s for sure. May God give you all the wisdom you need! \nO’Reilly had a report on the recent Atheist convention last night – wow, that was hilarious. I don’t watch much tv, just happened to get that bit. I want to see it again, I wonder if that segment is available by itself. Not that it would be useful for your debates, I just enjoyed it. :)\n\n","date":"March 30, 2012 at 3:32 pm","url":"https://shroudstory.com/2012/03/25/a-guest-posting-by-jabba-rich-savage/","cat":"news_&_views","id":"comment-9799","author":"AnnieCee","site":"shroudstory"},{"title":"A Guest Posting by “Jabba” (Rich Savage)","post":"Annie,\n– Thanks for keeping in touch.\n– I would love to watch O’Reilly’s report — but, I don’t any have time for watching TV by myself, and Lauren (my wife) doesn’t like O’Reilly…\n– My debate opponents seem to be getting madder with each post.  That’s probably a good sign, but I still hope that I can eventually change their minds a little.\n– I doubt that any of them will accept my invitation, but I’ll probably start asking pretty soon that one of them join me on my website to continue the debate, and bring with them all their friends — as advisers and audience.  I’ll ask my friends to do the same, and we could end up with a pretty neutral audience — and with a little luck begin to attract undecided viewers…\n– I’d better get to my chores.\n— Rich\n\n","date":"March 31, 2012 at 1:42 pm","url":"https://shroudstory.com/2012/03/25/a-guest-posting-by-jabba-rich-savage/","cat":"news_&_views","id":"comment-9826","author":"Richard Savage","site":"shroudstory"}]
