[{"title":"A warning about what we perceive","post":"“I could change the color of illumination on that apple and make it look green or blue or something completely different,” he says. “The redness isn’t a property of the apple. It’s a property of the apple in combination with a particular lighting that’s on it and a particular observer looking at it.”\nOr if you don’t illuminate that apple, it still glows in the infrared…\n\n","date":"November 29, 2014 at 6:03 am","url":"https://shroudstory.com/2014/11/29/a-warning-about-what-we-perceive/","cat":"science","id":"comment-173578","author":"anoxie","site":"shroudstory"},{"title":"A warning about what we perceive","post":"I’d have swore those X’s were different shades. That’s amazing.\n\n","date":"November 29, 2014 at 9:02 am","url":"https://shroudstory.com/2014/11/29/a-warning-about-what-we-perceive/","cat":"science","id":"comment-173598","author":"David Goulet","site":"shroudstory"},{"title":"A warning about what we perceive","post":"Me too… we must be in the same light, Dave.\n\n","date":"November 29, 2014 at 11:31 am","url":"https://shroudstory.com/2014/11/29/a-warning-about-what-we-perceive/","cat":"science","id":"comment-173615","author":"clublu22014","site":"shroudstory"},{"title":"A warning about what we perceive","post":"There seem to be at least three elements involved:  The mix of light frequencies of illumination; the absorption spectrum of the illuminated object; the perception experience of the observer; possibly a fourth as here, absorption spectrum of object’s surrounds. \nIsaac Newton’s prism experiment was conducted in a dark room with only a narrow beam of incident sunlight focused on his prism and then projected onto a screen.  What would he have seen if he had decided he needed a candle to see what he was doing?  Would he have not seen the yellow band? Check Google Search on “Images prism light experiment” – there are several examples. \nNevertheless there are still those who deny the validity of the experiment because of the subjective perceptions and brain chemistry of the observer.  And one does not need to be colour blind to deny it.\n\n","date":"November 29, 2014 at 2:09 pm","url":"https://shroudstory.com/2014/11/29/a-warning-about-what-we-perceive/","cat":"science","id":"comment-173634","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A warning about what we perceive","post":"Isaac Newton knew he didn’t need a candle to see what he was doing. He knew what he was doing.\n\n","date":"November 29, 2014 at 2:15 pm","url":"https://shroudstory.com/2014/11/29/a-warning-about-what-we-perceive/","cat":"science","id":"comment-173635","author":"anoxie","site":"shroudstory"},{"title":"A warning about what we perceive","post":"Back to the Shroud, from the beginning, filters have been used to enhance details.\nIt has always been the basis for image analysis, since the beginning of space exploration, and keep in mind Don Lynn was an image analyst at JPL.\nThat’s why physicists and scientists speak of “natural” color, meaning under sunlight.\nSee Mars’ images from Olivier de Coursac or more recently, an image from Europa:\nhttp://www.pasadenanow.com/main/mapping-the-chemistry-needed-for-life-at-europa\n\n","date":"November 30, 2014 at 5:38 am","url":"https://shroudstory.com/2014/11/29/a-warning-about-what-we-perceive/","cat":"science","id":"comment-173760","author":"anoxie","site":"shroudstory"},{"title":"A warning about what we perceive","post":"On the bottom of the Xs, where they cross from yellow to gray, the color of the X appears to change.  How could it be measured by an instrument that would prove the assertion?\n\n","date":"November 30, 2014 at 9:08 am","url":"https://shroudstory.com/2014/11/29/a-warning-about-what-we-perceive/","cat":"science","id":"comment-173801","author":"Andy","site":"shroudstory"},{"title":"A warning about what we perceive","post":"Print the image out, then cut up the sections and compare them.\n\n","date":"November 30, 2014 at 2:10 pm","url":"https://shroudstory.com/2014/11/29/a-warning-about-what-we-perceive/","cat":"science","id":"comment-173862","author":"Hugh Farey","site":"shroudstory"},{"title":"A warning about what we perceive","post":"There’s a quicker way: upload to MS Paint, then frame with white surrounds:","date":"November 30, 2014 at 2:34 pm","url":"https://shroudstory.com/2014/11/29/a-warning-about-what-we-perceive/","cat":"science","id":"comment-173869","author":"Colin Berry","site":"shroudstory"},{"title":"A warning about what we perceive","post":"“On the bottom of the Xs, where they cross from yellow to gray, the color of the X appears to change. How could it be measured by an instrument that would prove the assertion?”\nAndy, the physical attributes of color doesn’t change.\nThe warning points precisely to this distinction between our perception of color (physiologically based- center-surround organization of the receptive fields in the retina) and the physical attributes of color (wavelength-brightness…).\nThen, what happens when you try to compare distant color? You’re doomed. It turns out our eyes are sensitive to local contrast variations but rather ineffective to compare distant points.\n\n","date":"December 4, 2014 at 4:50 am","url":"https://shroudstory.com/2014/11/29/a-warning-about-what-we-perceive/","cat":"science","id":"comment-174585","author":"anoxie","site":"shroudstory"}]
