[{"title":"Cherry Jam, the Metaphor","post":"We can only hope that CB is so offended that he won’t return…..\n\n","date":"July 31, 2015 at 8:31 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207033","author":"Nabber","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Personally, I DO prefer cherry jam to Colin Berry’s patented baked monk mummy jam, roasted Knight Templar jam and all his patentmumbo jumbo (or should I say mam-bo jam-bo?) very cheap reconstructive alchemistry.\n\n","date":"July 31, 2015 at 8:46 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207035","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"CB re aping, your fumigation/mordant theory is just very poorly aping mine.\n\n","date":"July 31, 2015 at 9:14 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207043","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Prove it. Or shut up. Your accusations are growing tedious.\n\n","date":"July 31, 2015 at 9:24 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207045","author":"David Goulet","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"DG, how long have you be reading this blog? Have you ever heard of my fumigation/pre- (or light) mordant theory? I have kept writing about for about 4 years it in this vey blog! \nWhen was it first time in this blog your ever heard of fumigation, alkali solution, gelatinised starch as possible printing paste, compression, mordanting etc as far as the TS image formation proces is concerned? \nCB (more or less unconsciously) just recycled and aped my pro-authenticity theroy I kept presented in this very blog to build up his pro-forgery theory. It just stares you in the eyes (if you have brain and eyes to really see)!\nSee CB blogs and my comments and CB’s on April 2012. I succintly exposed to him my fumigation/mordant theory, he most arrogantly discarded as an “eccentric view”.  Now guess what, he is advocating/developing a fumigation/mordant theory what a coincidence!\nRe-read first before passing insulting comments, please.\n\n","date":"July 31, 2015 at 9:53 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207054","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Max, I did find it rather ironic that in the end Colin’s theories have swung around to something similar to the angle you took, and Rogers and others. I do not believe for a second that he copied your theory, but rather he came around to it on his own after eliminating his previous theories. Yes, he did dismiss your theory originally (and Rogers) in the early going and so you and others, seeing now Colin exploring similar territory, can be forgiven for wanting to let him know “I told you so”. Fair is fair.\nBut you overstep when you accuse him of recycling your ideas.\n\n","date":"July 31, 2015 at 10:36 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207062","author":"David Goulet","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Thanks for the support DavidG (good book btw, one chapter in particular). To paraphrase: any resemblance to any theory, living or dead, is coincidental. The epiphany moment for me was to view the “Shroud” as a medieval project to recreate Joseph of Arimathea’s linen as a sweat/blood imprint. That new approach generated its own technology and dynamic, starting with a search for cryptic chemical etching agents that attacked the linen (dyes/mordants, sulphuric acid, nitric acid fumes, nitric acid solution, hot limewater, hot iron). Given it’s seen as a medieval-era exercise in imaginative relic-manufacture, it’s irritating to say the least to have it accused of being derivative of a pro-authenticity promoting narrative. Chalk and cheese and all that… I prefer the cheese to the chalk (or closely related limestone). At least cheese has the protein (and limestone is NOT an alkali, but don’t say I said so….)\n\n","date":"July 31, 2015 at 10:55 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207064","author":"Colin Berry","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Methinks , had I not intervene re his scorch theory and the Knight Templar connection, he would still adocate it. Methinks too as he kept reading my comments no the TS image formation process, he finally (and more or less unconsciouly I admit) apes my fumigation/mordant theory. My thought experiment is based on experimental archeological pre-reconstructions (wrapping in shrouds) in light of Christolispology, achaeoastronomy, the Gospels, Biblical and Talmudic Literatures, Second Temple period burial practices, custom and rites, Ancient Textiles physics and chemistry, Paleaoantomopathology, archaeological bloodstain analysis, cryptology etc when CB is entirely and solely based on chemistry (both medieval and 21st c. CE) and pseudo-history.\n\n","date":"July 31, 2015 at 11:09 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207066","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"+ philology (Hebrew, Aramaic, Greek)\n\n","date":"July 31, 2015 at 11:11 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207068","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Alkaline water solution is similar to Jerusalem limestone water solution (rain water). Do say CB (chemist with a PhD) I said so.\n\n","date":"July 31, 2015 at 11:32 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207072","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"I agree with Colin. Not because I’m trying to be his best buddy, but because he’s right on this point. Max is allowed to post his thought experiments and then defend them as gospel — despite any published evidence. I’d have less issue with this (I like thought experiments) if he would be more open to criticism. He also acts troll-ish with his pejorative comments about Colin.\nColin is correct when he points out that it’s bad form to pull content from his site to chum the waters on your own. As this very posting is evidence of.\n\n","date":"July 31, 2015 at 9:23 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207044","author":"David Goulet","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"“Le menteur à qui l’on retire son masque ressent la même indignation que si on le défigurait.”\nJean Rostand De Jean Rostand / De la vanité\n\n","date":"July 31, 2015 at 9:26 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207046","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Theories pass. The frog remains.\n Jean Rostand\n\n","date":"July 31, 2015 at 9:36 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207051","author":"David Goulet","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"David Goulet passes. The frog passes.\n\n","date":"July 31, 2015 at 9:57 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207055","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"IMHO methinks my theory will remain (no matter how long it will take).\n\n","date":"July 31, 2015 at 10:33 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207061","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Ummm…. either Colin’s ideas are just like Max’s, in which case he might be flattered but ask for acknowledgement, or they are nothing like Max’s, in which case he may consider them ludicrous mumbo-jumbo. However, in his recent comments, he appears to want to ridicule ideas which he thinks closely resemble his own. How very curious…\n\n","date":"July 31, 2015 at 9:36 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207052","author":"Hugh Farey","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"How very curious indeed for CB’s buddy!\n\n","date":"July 31, 2015 at 10:00 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207056","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"If Hugh feels flattered when he is named a troll, a browbeater, a WUM, attention seeeker and so forth good to him.\n\n","date":"July 31, 2015 at 10:03 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207057","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Max, I do understand how frustrated you must feel when your own version of the image formation of the Shroud has received little critical appraisal (when, in YOHO it far surpasses anyone else’s), while Colin’s version has received a lot of attention. However, you must understand that this is neither a reflection of either of your personal characters, nor of the validity of the methods themselves, but the evidence produced to back them up. Colin has experimented at length, documented and reported on everything he has done. He has made his observations our observations, and although we may not agree with his conclusions, at least we know how he reached them. You, on the other hand, have produced nothing. Absolutely nothing at all. Not a smidgin. Not even a vague outline of your experiments, your sources,  anything at all that might help us follow your reasoning. That being so, we cannot agree or disagree with you. Maybe everything you say is possible, and maybe it isn’t, but if your only authority is yourself, with your ‘most likely’ this and your ‘shall I endlessly repeat’ that, then you can hardly be surprised if we just read it and pass on.\nSo why not redress the balance, just a little? If you have carried out any experiments, tell us what you did and what you observed; if you have documentary sources, quote chapter and verse. It doesn’t have to be the whole  nine yards; just choose a detail – why do you think 1st century bodies were covered with ‘gelatinised starch,’ for instance, or what makes you think the burial was ‘fumigated’? Come on, Max, you know you’re worth it!\n\n","date":"July 31, 2015 at 11:31 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207071","author":"Hugh Farey","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"There was no time to make all the arrangements for Jesus’ burial, as we learn from the Gospel. They only tell us about the burial cloth brought by Joseph of Arimathea and the spices that Nicodemus bought.\nFurther, it is highly doubtful that Joseph, being a member of the Sanhedrin, would have Jesus buried as an innocent man. Although he knew that Jesus was innocent he could not go against the wishes of fellow members of the Sanhedrin, who had Jesus executed as a criminal. The least he could do,therefore, was to arrange a tomb and burial cloth.\n\n","date":"July 31, 2015 at 11:49 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207075","author":"Louis","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Hugh, are you kidding? \nMy thought experiment based on my shroud wrapping reconstructions (= pratical experiment) in light of Chistolipsology (pre-experimental archaeology) I have already described in detailed write-ups along with the image formation mechanism in this very blog (and even went as far as giving the Yesha’s burial time-frame according to the Hebrew time markers and my new exegesis of the Gospels!).\nThe very fact CB is now developing a fumigation/mordant theory does speak volumes on how chemically speaking for instance is reliable my own fumigation/mordant theory. \nActually my thought experiment is also based on several facts of experience.\n\n","date":"July 31, 2015 at 12:00 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207077","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Louis, sorry to tell you, but your exegeis  is just cheap exegesis.\n\n","date":"July 31, 2015 at 12:02 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207078","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"It is even conttradicted by the very contact relics of Yeshua that are still extant today (unless you consider they are all fakes but the TS)!\n\n","date":"July 31, 2015 at 12:05 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207079","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"You misunderstand, Max. You have indeed told us, at length and in detail, if not very coherently, your ideas about how the image was made, and we have largely ignored them. Why? Because they are wholly unsupported with any kind of evidence. Thought experiments are all very well, and bald announcements about this or that from the gospels, but what we need is some indication that this is not just guesswork.\n\n","date":"July 31, 2015 at 12:40 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207085","author":"Hugh Farey","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Christolipsology…. I googled this word and the only other times it shows up is in comments made on this blog by you, Max. What does this tell me? You are an expert with, and lover of, languages. I think even Colin would concede that. Like Tolkien (whose love of language led him to create a lingua Elvin which evolved into the entire LOTR narrative) you have built a narrative for the Shroud stemming from archeoetymology(!). You are more poet than scientist and that is well and good. But when poets mix with scientists their words may inspire, but they can never provide the proofs scientists demand. That is not a judgment, just an observation.\n\n","date":"July 31, 2015 at 12:45 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207087","author":"David Goulet","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Max, I am sorry to tell you that my exegesis is not “cheap exegesis”, it is based on the Gospel and what biblical scholars have said.\nTry and send your material to them and you will see that you will be laughed out of court. For a start, I have information from a reliable authority that it was common to use one, not two, shrouds.\n\n","date":"July 31, 2015 at 1:43 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207094","author":"Louis","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Hi Louis – According to Gospels ladies went to tomb on the early Sunday morning. Is this a cultural practice or they went to tomb to anoint the body with those spices which they could not do it on Friday evening as they did not have time to do it?\n\n","date":"July 31, 2015 at 6:30 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207106","author":"Sampath Fernando","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Louis, \nre preparation for Secodnd temple period burial\npreparation indeed you exegesis is cheap. \nReminder (not to be mistaken for serial browbeating):\nIn fact, since funeral expenses became common extravagances and an object of alarm to the relatives, Rabbi Gamiliel II (circa mid 1st c.-first third of the 2nd c. CE that is WELL AFTER Yeshua’s death on the Cross) set the example by the order he gave for his own funeral, and thus introduced the custom of burying the dead in simple linen garments (Ket. 8b; M. Ḳ. 27b)\nto reduce competition and symbolize that every Judean/Jew is equal before G-od. Thus was introduced a comely shroud (Heb.Takhrikhin / תכריכין or traditional white burial shroud) as an absolute requirement. It allowed the poorest of Judeans to bury their dead with equal dignity and honor. Whereas traditions in funeral and burial practices may vary somewhat in different parts of the world, the shroud always was universally accepted and all Jewish people have been buried in Takhrikhim (word in the plural form from the Hebrew verb “to wrap up”!) for over two thousand years. Takhrikhim are the traditional burial shroudS consisting of a set of clothing, a hat, shirt, pants, shoes, coat, and belt. For a man, a Tallith, preferably his own, is also worn. Besides there are local variants/customs as faras dressing in comely clothing or shrouds is concerned. Note: In Marocco, Jewish people used to keep their father’s shroud!\nRe  PRE-Gamaliel II Second Temple period burial preparation, Louis, what do you know exactly? Actually methinks you just cannot discriminate between PRE- and POST-Gamalielian introduction of the takhrikhin requirement for all Judeans/Jews!\nIn Ancient Judean burial practices,  the deceased was wrapped up in comely shrouds (takhrikhim).  A clothing could be used as a shroud, which you seem to totally ignore. E.g. the Turin Shroud is first and foremost a burial white sindon/himation that is a clothing/garment used as a shroud and not a shroud per se. Louis,  how long will you totally overlook or be in denial of the fact? \nBesides smaller shrouds (such as a pathil or “skull cap”) and an “all envelopping wrap” or sovev (Aramaic sudara) could be used too. Additional clothing such as a face veil could be used as a shroud too (e.g. to cover a disfigured head). The skull cap, face veil and sindon/himation are clothing used as shrouds (to keep the deceased’s mouth closed). The sovev or sudara is the tachrichin. A strip of linen as clothing can be used as both a belt and a shroud and vice versa. Most obviously, in light of Yeshua’s burial relics (or substitute relics if you prefer), Yeshu’a was dressed in shroudS (uppec case intended) and buried in a memorial cave-tomb in the Second Temple period prior to Gamalliel II who introduced the takhrikhin requirement for all Judeans/Jews WELLAFTER Yeshua’s death on the Cross. Period.\n\n","date":"August 1, 2015 at 8:45 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207146","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Louis, you keep telling me “Try and send your material to them and you will see that you will be laughed out of court”. Actually I won’t BUT you will.\n\n","date":"August 1, 2015 at 8:50 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207147","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Typo: Besides smaller shrouds (such as a pathil or “skull cap” to keep the deceased’s mouth closed)  and an “all envelopping wrap” or sovev (Aramaic sudara) could be used too. Additional clothing such as a face veil could be used as a shroud too (e.g. to cover a disfigured head). The skull cap, face veil and sindon/himation are clothing used as shrouds. The sovev or sudara is the takhrikhin.\n\n","date":"August 1, 2015 at 8:55 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207148","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Additional typo: The sovev or sudara is NOW known as  ha-takhrikhiN (which is an alteration of takhrikhiM) as “one” comely white shroud and is generally mistaken by non-Jews for the takhrikhiM or white garments.\n\n","date":"August 1, 2015 at 9:06 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207149","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Louis, methinks you’re not a Jew since you just cannot discriminate  between takhrikhin and takhrikhim.\n\n","date":"August 1, 2015 at 9:26 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207150","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"And you’re totally wrong.\n\n","date":"August 1, 2015 at 9:33 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207152","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Additional typo:\nIn Ancient Judean burial practices, the deceased COULD BE wrapped up in comely OR RICH shrouds (takhrikhim). A clothing could be used as a shroud, which you seem to totally ignore. E.g. the Turin Shroud is first and foremost a burial white sindon/himation that is a clothing/garment used as a shroud and not a shroud per se. Louis, how long will you totally overlook or be in denial of the fact?\n\n","date":"August 1, 2015 at 9:40 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207154","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Bevause the Turin Sindon/Himation is not a shroud per se, this accounts for the fact most likely Yeshu’a had draped it around his body (not to appear stark naked that is in flesh and in bones to Mary Magdalene unless you can account for the latter mistaking the former for  the gardener and not fr an angel/heavenly messenger. Do you really think Second temple period gardeners used to work stark naked inthe open air?\n\n","date":"August 1, 2015 at 10:00 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207156","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"DG wrote, “But when poets mix with scientists their words may inspire, but they can never provide the proofs scientists demand.”\nNot only I can inspire (see your chemist buddy’s evolution of his scorch theory: most curiously he suddenly resorted to sand and water in-soaked linen just after I mentioned (besides a heating source), linen in-soaked with an alkaline water solution  and  the presence of “opaques” from the Judean desert –to account for the image fuzziness– + my reference to Saint Lawrence iconography; see too the same chemist suddenly resorting to alkaline solution, starch gelatinisation, compression/pressure, mordanting, fumigation to build up his fumigation/mordant theory after he had read –for nearly four year– most if not all my posts on my fumigation/mordant theory to account for the TS image formation process) but, just to give you an example,  since the end of 2011, I can convincingly demonstrate  Pilate coins were really placed over the TS man’s eyes by means of an eidomatic reading grid based on archaeological bloodstain pattern analysis.\n\n","date":"August 1, 2015 at 10:52 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207157","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Typo: by means of an eidomatic numismatic reading grid based on blodstain pattern analysis I devised.\n\n","date":"August 1, 2015 at 10:55 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207159","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Hugh, you wrote:  “why do you think 1st century bodies were covered with ‘gelatinised starch,’ for instance, or what makes you think the burial was ‘fumigated’?”\nFirstly could you stop please misrepresenting my opinion (“Shall I have to repeat it endlessly” TO YOU?):\nI never said “1st century bodies were covered with ‘gelatinised starch”. “Gelatined starch” is just an option as natural printing paste (if starch was really detected or used on the TS). Actually was is mostly needed is an alkaline solution in terms of remoistened human lactic acid and/or Jerusalem limestone dust mixed with rainwater and/or Red Heifer ashes mixed with living waters + (myrrhic?) aloetic fumigation = pre- or light mordanting conditions on Second Temple period burial (basic archeological chemistry). The very fact it took 3.5 years to a chemist on pensioned to finally “more or less” get aware of that basic chemistry, chemically speaking it does tend to prove my thought experiment does hold water and is not mere words as you misleadingly (once again!) wants people to believe.\nBesides I never said “the burial was ‘fumigated’” either! I just said the tightly wrapped-up tetanized body/stiff rigid corpse was subjected to a (myrrhic?) aloetic (aloe wood) fumigation.\nTo someone familiar with the halakha (Judean religious law), in the NT it is clearly said the women because of the approaching shabbath had no time to (grind the spices –myrrh and aloe– in chunks or lump shapes and make spicy perfume oils in order to) perform the anointing procedure. The buriers had temporarily to make up for the latter and thus recurred to a (myrrhic?) aloetic fumigation of the body/corpse to prevent bad odors on subsequent visits to the deceased in the three or seven days that followed his death (Second Temple period custom).\nBesides in the OT (“shall I repeat it endlessly” indeed!), fumigation/burning aromatic woods/spices to prevent dead body bad odors or euphemistically put it “honour the deceased” are reported in ancient Jewish/Judean funerary rites see 2 Chronicles 16:14 – 21:19 Targum. How long will you and all  just pass on in spite of the strong literary evidence and chemical common sense –to say the least–  my theory does imply?\nYes in IMHO ;-) my fumigation/mordant theory far surpasses that of your chemist buddy.\n\n","date":"August 1, 2015 at 12:06 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207161","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Re-posted (corrected and more legible version)\nLouis,\nyou keep telling me “Try and send your material to them and you will see that you will be laughed out of court”. Actually I won’t BUT YOU will. Re preparation for Second Temple period burial preparation you exegesis is cheap INDEED.\nReminder (not to be mistaken for serial browbeating):\nIn fact, since funeral expenses became common extravagances and an object of alarm to the relatives, Rabbi Gamiliel II (circa mid 1st c.-first third of the 2nd c. CE that is WELL AFTER Yeshua’s death on the Cross) set the example by the order he gave for his own funeral, and thus introduced the custom of burying the dead in simple linen garments (Ket. 8b; M. Ḳ. 27b)\nto reduce competition and symbolize that every Judean/Jew is equal before G-od. \nThus was introduced a comely shroud (Heb.Takhrikhin / תכריכין or traditional white burial shroud) as an absolute requirement. It allowed the poorest of Judeans to bury their dead with equal dignity and honour. \nWhereas traditions in funeral and burial practices may vary somewhat in different parts of the world, the shroud always was universally accepted and all Jewish people have been buried in Takhrikhim (word in the plural form from the Hebrew verb “to wrap up”!) for over two thousand years. Takhrikhim are the traditional burial shroudS (upper cases intnded) consisting of a set of clothing, a hat, shirt, pants, shoes, coat, and belt. For a man, a Tallith, preferably his own, is also worn.\nNote: In Marocco, Jewish people used to keep their father’s shroud!\nRe PRE-Gamaliel II Second Temple period burial preparation, Louis, what do you know exactly? Actually methinks you just cannot discriminate between PRE- and POST-Gamalielian introduction of the takhrikhin requirement for all Judeans/Jews!\nIn Ancient Judean burial practices (prior to the use of takhrikhin, the deceased could be wrapped up in comely, coloured or rich shrouds (takhrikhim). A clothing could be used as a shroud, which you seem to totally ignore. E.g. the Turin Shroud is first and foremost a burial white sindon/himation that is a clothing/garment used as a shroud and not a shroud per se. Louis, how long will you totally overlook or be in denial of the fact?\nBesides smaller shrouds (such as a pathil or “skull cap” to keep the deceased’s mouth closed) and an “all envelopping wrap” or sovev (Aramaic sudara) could be used too. Additional clothing such as a face veil could be used as a shroud too (e.g. to cover a disfigured head). The skull cap, face veil and sindon/himation are clothing used as shrouds. The sovev or sudara is NOW also  known as ha-takhrikhiN (which is an alteration of takhrikhiM) as “one” comely white shroud and is generally mistaken by non-Jews for the takhrikhiM or white garments. A strip of linen as clothing can be used as both a belt and a shroud and vice versa. Most obviously, in light of Yeshua’s burial relics (or substitute relics if you prefer), Yeshu’a was dressed in shroudS (upper case intended) and buried in a memorial cave-tomb in the Second Temple period prior Gamalliel II introduced the takhrikhin requirement for all Judeans/Jews. This was WELL AFTER Yeshua’s death on the Cross! \nLouis, methinks you’re not a Jew since you just cannot discriminate between takhrikhin and takhrikhim. You’re totally wrong. Period.\nBecause the Turin Sindon/Himation is not a shroud per se, this could account for the fact most likely Yeshu’a had draped it around his body (not to appear stark naked that is in flesh and bones to Mary Magdalene (unless you can account for the latter mistaking the former for the gardener and not for an angel/heavenly messenger, which I very much doubt). Do you seriously\nthink Second temple period gardeners used to work stark naked inthe open air?\n\n","date":"August 1, 2015 at 1:16 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207163","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Max,\nI gave you a chance but you do not seem to learn from mistakes. It is evident that your are indulging in imaginary reconstruction, which only you can believe.\nNobody has laughed me out of court till today. On the contrary, I am often invited to give talks about religion but have refused to to do because I believe that if a person is really looking for God he will find him. Some of my articles are preserved for reference in university libraries and in the libraries of some institutions.\nI am interested in Shroud research because I believe that it is possible that it may be another, repeat, another, sign that Jesus left for humanity.\nThe way you describe Jesus’ burial arrangements a little more and it would be similar to what Herod got.\nRemember, the Shroud does not attract biblical scholars in general as they are involved in a heated controversy about where Jesus was buried:\nhttps://www.academia.edu/7471287/Book_Review_The_Tomb_of_Jesus_and_His_Family_Exploring_Ancient_Jewish_Tombs_Near_Jerusalems_Walls\nThey are also trying to make sense of some bad things that happen here on earth, looking for what you call “G-od”:\nhttps://www.academia.edu/12823419/Book_Review_Jesus_and_Yahveh_the_names_divine\n\n","date":"August 1, 2015 at 4:58 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207177","author":"Louis","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Louis, I gave you a second chance NOT to elude my question(s) and substantiate your claim. You just CANNOT nor substantially oppose any coherent argument against mine. Mind you own mistakes please.\n\n","date":"August 1, 2015 at 5:20 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207180","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"You also wrote: “It is evident that your are indulging in imaginary reconstruction, which only you can believe.\nNobody has laughed me out of court till today. ” \nShow me your OWN evidence against mine. I told you you were totallly wrong and subtantiated my opinion. Stop your soporific or provocative blabla re “being laughed out of court”, will you for a change please and subtanstiate your claim against mine if you can but methinks you cannot. Your are a free lance journalist not a Bibilical scholar. My claim is not imagiary, it is substantiated, your is NOT. Yours is imaginary indeed.\n\n","date":"August 1, 2015 at 5:29 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207181","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Be careful, Max. \n\n","date":"August 1, 2015 at 5:35 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207184","author":"Dan","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Max, from now on I will ignore you and continue to contest your imaginary reconstructions.\nI may be a free lance journalist, but so what? Did you read my previous comment? My expertise is recognised. Let us see one peer-reviewed paper you published.\n\n","date":"August 1, 2015 at 5:34 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207182","author":"Louis","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"A real expert would have substantiated his claim, which you haven’t s far yet asked me to substantiate mine, which I did. Show me your real expertise if you’re man enough.\n\n","date":"August 1, 2015 at 6:27 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207194","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"I will not waste time with imaginary reconstructions and please refrain from personal attacks and start behaving yourself.\nIf you want to see my expertise, look for it in Jerusalem and Rome.\n\n","date":"August 1, 2015 at 6:39 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207197","author":"Louis","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"You keep on eluding my question regarding your claim \n“There was no time to make all the arrangements for Jesus’ burial, as we learn from the Gospel. They only tell us about the burial cloth brought by Joseph of Arimathea and the spices that Nicodemus bought.\nFurther, it is highly doubtful that Joseph, being a member of the Sanhedrin, would have Jesus buried as an innocent man. Although he knew that Jesus was innocent he could not go against the wishes of fellow members of the Sanhedrin, who had Jesus executed as a criminal. The least he could do,therefore, was to arrange a tomb and burial cloth.”\n In 1998 in Turin  I presented a paper demonstrating via mostly Hebrew time-markers (translation entropy from Hebrew to koine Greek) + posts in this very blog, indeed there was time enough (two hours to two hours and a half) for 5-6 buriers (Yeshua’s Jerusalem secret disciples among whom Joseph  and Nicodemus) to perform all the core procedures (substituting myrrhic aloetic fumigation to anointing procedure for lack of spicy perfume oil) applied to Yeshua’s bloodied body. Reminder: The fact that only two of yeshua’s secret disciple are “nicknamed” in the Gospels do not mean ipso facto there were only two buriers.\n\n","date":"August 1, 2015 at 7:45 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207206","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Refrain from insulting comments under the belly yourself (see you despising under the belly atack: “Try and send your material to them (unamed authorities!) and you will see that you will be laughed out of court. For a start, I have information from a reliable authority that it was common to use one, not two, shrouds”).\nEnough with your trollish principle “Do as I say, don’t do as I do?”\n\n","date":"August 1, 2015 at 7:50 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207208","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Enough with your unsubstantiated claim and unquote unamed authority!\n\n","date":"August 1, 2015 at 7:52 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207209","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Shal I endlesly repeat clothing (skull cap, face veil, sindon, himation, strip + all wrapping wrap = sudara) can be used as shrouds (Heb.takhrikhim) though they are not shrouds per se. Besides the takhrikhin requirement is FAR POSTERIOR to Yeshua’s burial. You’re otally wrong.\n\n","date":"August 1, 2015 at 7:56 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207210","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"How can you acount for Yeshua’s burial relics named as  “shroudS” (in Kornelimünster besides Turin)? What is exactly your expertise of those shroudS?\n\n","date":"August 1, 2015 at 8:05 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207212","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Louis wrote:  “My expertise is recognised. Let us see one peer-reviewed paper you published.”\nWhich expertise? I can refer you to “one peer-reviewed paper I got pubished (if you can read modern French, Old French, Medieval Latin and Old Italian). See Loches, Graffiti anciens, “QUATRIEME RENCONTRE” 2006 (Proceedings of the 4th National Symposium of Glyptography, 2006 Loches). It was published in December 2010.\nYou can order the book to the Musée Serge Ramond “La mémoire des murs”, Place de Piegaro, 60550 Verneuil-en-Halatte France – Telephone :(00 33) 03 44 24 54 81.\n\n","date":"August 1, 2015 at 9:31 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207216","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Directed to Sampath Fernando:\nre:query 31st July\nHi Sampath\nSince Jesus’ disciples had abandoned him when he was arrested for fear of being imprisoned themselves and believed that the movement had come to a tragic end it was left to Mary Magdalene to look after the burial arrangements.\nAs time was very short on Friday they came to do the rest of the job on Sunday morning.\n\n","date":"August 3, 2015 at 8:34 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207341","author":"Louis","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"In the past (April 3, 2015) Hugh Farey wrote to me in this manner:\n>…If you could write a proposal as to how exactly you think AFM\nor other microscopes could add to the knowledge about the Shroud,\nI would be very happy to consider it. …\nSo…\nI think that this kind of dialogue has a tone quite different\nfrom what we can now see for the exchange of lightnings\nbetween MPH and Colin Berry …\nSo, before going back to “my usual obsession”,\nI want to remember that with regard to other techniques,\ndifferent from the AFM way (which I always consider\nas valid system to obtain useful informations)\nI have already mentioned a few things …\nRecently (July 30, 2015) I have indicated a new way (= SINS).\nA way that seems to be more powerful with respect\nan “old method” (= ATR-FTIR), because:\n>SINS combines two pre-existing infrared technologies:\na newer technique called infrared scattering-scanning near-field\noptical microscopy (IR s-SNOM) and an older tried-and-true\ntechnique called Fourier transform infrared spectroscopy (FTIR).\n>A melding of these two tools, combined with the intense\ninfrared light of the ALS, gives the researchers the ability\nto identify and study clusters of molecules sized as small\nas 20 to 40 nanometers. …\nLink:\nhttp://www-als.lbl.gov/index.php/holding/928-new-als-technique-gives-nanoscale-views-of-complex-systems-.html\nand in the past I wrote something around NanoMRI\n(that could image single biomolecules)\nHere a vague reference:\nNanowire-based magnetic resonance imaging\nby\nRaffi Budakian, Institute for Quantum Computing\nHere an excerpt from the abstract:\n>Magnetic resonance imaging (MRI) has had\na profound impact on biology and medicine.\n>Key to its success has been the unique ability\nto combine imaging with nuclear magnetic resonance\n(NMR) spectroscopy – a capability that has lead to\na host of powerful modalities for imaging spins.\n>Although it remains a significant challenge,\n there is considerable interest to extend these\npowerful spectroscopic and imaging capabilities\nto the nanometer scale. … …\nLinks:\nhttps://uwaterloo.ca/nanomri/schedule/nanowire-based-magnetic-resonance-imaging\nhttps://uwaterloo.ca/nanomri/schedule\n— —\nReturning to the AFM way,\nhere a paper (I think that using NEMS [=\nNanoElectroMechanical Systems] sensors\nwe can improve our level of knowledges):\nhttp://edoc.ub.uni-muenchen.de/15962/1/Rieger_Johannes.pdf\nSee also a previous paper by Rieger (and others):\n“Energy losses of nanomechanical resonators induced\nby atomic force microscopy-controlled mechanical impedance mismatching”\nJohannes Rieger, Andreas Isacsson,\nMaximilian J. Seitner, Jörg P. Kotthaus, and Eva M. Weigb\nNat Commun. 2014 Mar 4; 5: 3345\nPublished online 2014 Mar 4. \nhttp://www.ncbi.nlm.nih.gov/pmc/articles/PMC3959189/figure/f1/\nSo, the simple and very rough idea is the following:\ntry to put your (Maillard-treated or fumigated, or both, or\nVUV- or CD- treated, etc.) linen fibril over the resonator\n(or a certain distance from the resonator…) and\ntry to measure what happens with respect\n(what happens on) linen fibrils taken from the Shroud (or\ncoming from another experiment, etc.) and already measured\non the same “AFM-NEMS device” …\nI believe that you will detect something of useful if you\ncarefully measure (and compare) these linen fibrils\nsubmitted to vibrations (coming from the resonator).\n\n","date":"July 31, 2015 at 10:50 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207063","author":"piero","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"I apologize for that intervention “a bit too erudite”\n(= an intervention a bit rough…)…\nScience can progress if the authors sell books, papers, etc.\nand so the authors can eat bread, cheese and salads …\nor whatever way they choose!\nBut speakers (and/or writers) who deliberately flout the maxims\n(see: “Flouting the Maxims”, in “Cooperative principle” by Grice)\nusually intend for their listener (or readers) to understand their\nunderlying implication…\nPerhaps what has drifted myself out from the right way was\nhaving to see a spectroscopic technique (= SINS) which is\nthousands of times better than the FTIR …\n= >With a spatial resolution 100–1,000 times better\nthan conventional FTIR microscopy, …\nBut, see also a previous case:\nNano-FTIR – The Chemical Nanoscope\nChemical “Fingerprint” Infrared Spectra at Every 20 nm Pixel\nLink:\nhttp://www.imaging-git.com/science/light-microscopy/nano-ftir-chemical-nanoscope\n>We show identification of chemical compounds\nand chemical maps at 20 nm resolution, enabled\nby a novel combination of infrared spectroscopy\nand near-field microscopy.\n>Nano-FTIR returns the surface topography and\nsimultaneously the local mid-infrared spectrum of\nthe tiny volume (20 nm3) just below the probing\ntip thus allowing correlative topography/hyperspectral\ninfrared images.\n>In the case of molecular substances, comparison\nwith common infrared databases enables\nlocal chemical recognition. …\nIn any case we require a series of techniques that\nenable us to investigate samples without destructions…\n\n","date":"July 31, 2015 at 11:41 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207073","author":"piero","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":">…In social science generally and linguistics specifically,\nthe cooperative principle describes\nhow people interact with one another…\nLinks:\nhttps://en.wikipedia.org/wiki/Cooperative_principle\n>…Without cooperation, human interaction would be\nfar more difficult and counterproductive. …\n\n","date":"July 31, 2015 at 11:09 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207067","author":"piero","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Dare to dream, piero. Dare to dream.\n\n","date":"July 31, 2015 at 11:15 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207069","author":"David Goulet","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Dreaming on NEMS:\n>Graphene electrodes revolutionize\nthe scaling of piezoelectric NEMS resonators\nLink:\nhttp://www.nanowerk.com/spotlight/spotid=40427.php\nBut…\nattention to breakage of the fibrils!\n\n","date":"July 31, 2015 at 11:49 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207074","author":"piero","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"That burial cloth called the Shroud is quite amazing, isn’t it?  Theories not so much.\n\n","date":"July 31, 2015 at 5:59 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207105","author":"Dcn Andy","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"So, let’s see if I’ve got this straight. Under this New Age capitalism, I put up new material on my site.  Within hours, sometimes minutes, it can be moved lock, stock and barrel to this one without so much as a by-your-leave\n It’s then subjected to ferocious public criticism on this site by folk who for the most part operate under pseudonyms, who are free if they wish to trash my ideas. It’s even possible for some to write highly critical pdfs that sit permanently in the margin, with no mechanism for correcting errors. Indeed, those same pdfs can then be cited on wikipedia, being treated as authoritative research data, despite having undergone no peer review. In the same breath, wikipedia says that nothing that appears on an ordinary blog such as my own is sufficiently authoritative to be used in wiki, even to respond to the pdf and its phoney indictment.\nOne can lodge protests again and again, only to be told by this site’s proprietor  that’s the way the system works, and if this siite is getting the visitors and one’s own site is not, that’s one’s own fault for not understanding how the system works. \nTo cap it all, one is then charged repeatedly on this site by a particular individual that each time one adopts a new line in the course of research, it’s because one has been reading and “recycling” his ideas from the Comments here. That’s  because one is allegedly incapable of having one’s own original ideas. Nothing is permitted here that smacks of elitism, despite one having spent one’s entire career in experimental research with dozens of peer-reviewed publications to one’s name, some highly cited. In short, one has to like it or lump it, to acquiesce to a dictatoship of the proletariat, the latter having few if any peer-reviewed publications it would seem. \nNew Age capitalism?   From where I’m standing, it looks more like Chairman Mao’s brand of socialism…  What’s mine is mine, what’s yours is negotiable, or, as often as not, non-negotiable.\n\n","date":"August 1, 2015 at 2:03 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207164","author":"Colin Berry","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Sheer Vanity.\n\n","date":"August 1, 2015 at 4:48 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207174","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"When you are in South Carolina, let’s sit down with a couple of beers. I know a great bar (=pub) where you can sit on the edge of a marsh and watch the alligators.\n\n","date":"August 3, 2015 at 4:31 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207322","author":"Dan","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Just as long as you don’t escort me to the edge for a closer look…  ;-)\nI’ve just put up a new-style posting btw, responding to an earlier comment from Thomas re Lirey.\nhttps://shroudofturinwithoutallthehype.wordpress.com/2015/08/03/is-the-shroud-of-turin-really-just-18-years-short-of-its-2000th-birthday-see-this-blog-for-a-daily-acerbic-overview-of-current-wrangling-currently-2015-week-32/\n\n","date":"August 3, 2015 at 4:53 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207323","author":"Colin Berry","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Thank you Colin, good points – so I can accept Lirey wasn’t such a backwater, based on that. Still, requires a compelling explanation as to how the image might have been created…  And of course, the influence of those people may not explain an ingenious invention, but rather a means of obtaining a highly sort after holy relic! The argument could be run both ways.\n\n","date":"August 3, 2015 at 5:11 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207324","author":"Thomas","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Thanks Thomas. My money’s on the fabrication of the Not-a-Shroud (being intended  instead to ‘re-create’ Joseph of Arimathea’s body-retrieval linen) having been out-sourced, i.e. “farmed out” (Lirey being good, er, farming  country, with lots of screened outhouses, ideal for covert arts-and-crafts at the dead of night). Finance? Straight from the Crown (John II The Good), funds channeled through the Order of the Star, more specifically its founder member, Geoffroi de Charny, who is credited with getting his monarch to found that new albeit short-lived chivalric order, a throwback some say to the ousted Kinghts Templar. No great art (least of all proto-photography, sorry Leonardo) was needed to make the “Shroud”, once it’s recognized for what it almost certainly is – a notional sweat (and blood) IMPRINT, for which a real live volunteer would probably have served as 3D template.off which to capture a 2D contact imprint (with those fully-explicable iconic negative and 3D properties). \nI shall now do some more cut-and-pasting. Maybe not tit-for-tat predation as first described – think of it more as symbiosis with mutual synergism…\n\n","date":"August 3, 2015 at 5:35 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207328","author":"Colin Berry","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Max, in your last dozen comments, you have again made the mistake of pontificating without supporting your ideas with any evidence or sources. Take this farrago; “Actually what is mostly needed is an alkaline solution in terms of remoistened human lactic acid and/or Jerusalem limestone dust mixed with rainwater and/or Red Heifer ashes mixed with living waters + (myrrhic?) aloetic fumigation = pre- or light mordanting conditions on Second Temple period burial (basic archeological chemistry).” Now suppose I was brave enough to say that I think you’re completely wrong. Suppose I were to suggest that none of the conditions you describe were likely to have been present at the burial of Christ, and that even if they were, they would not have had the effect of producing an image. Suppose I did that, what would be your response? Would it be a list of sources showing that you are in fact correct, or would you simply call me an idiot for not believing you? Why should I?\nLater, you do give two references: 2 Chronicles 16:14.  “They buried him in the tomb that he had cut for himself in the city of David. They laid him on a bier that had been filled with various kinds of spices prepared by the perfumer’s art, and they made a very great fire in his honour.”\nThat’s it? That’s a source for all your detailed descriptions of the wrappings and smearings and fumigations? Well, it’s not good enough, Max. It is a basis for an imaginative reconstruction, not a source for a factual one.\nAnd then there’s: Ket. 8b; M. Ḳ. 27b. “At first the carrying out of the dead was harder for his relatives than his death, so that they left him and ran away, until Rabban Gamaliel came and adopted a simple style and they carried him out in garments of linen, and [then] all the people followed his example and carried out [the dead] in garments of linen. Said R. Papa: And now it is the general practice [to carry out the dead] even in rough cloth worth [only] a zuz.” What does this tell us about Jesus’s burial? That he must have been buried in elaborate wrappings? Surely not, because you also say that in ancient practice, either “comely” or “rich” shrouds were used.\nSo, no, Max, don’t go on and on about how badly you are misrepresented. Don’t “repeat endlessly,” don’t say “most probably” or tell us what you think Jewish burial practices were. If the halakha supports your ideas, then quote it. If the Talmud or the bible support your ideas, quote them. If physics or chemistry support your ideas, show us how.\nAnd finally: “since the end of 2011, I can convincingly demonstrate Pilate coins were really placed over the TS man’s eyes by means of an eidomatic reading grid based on archaeological bloodstain pattern analysis.” I bet you can’t.\n\n","date":"August 1, 2015 at 4:08 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207167","author":"Hugh Farey","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Hugh, methinks you can jus tkeep misrepresenting my opinion since youve notthe foggiest notion what halakha is all about.. Keep on misrepresenting my opinion and mislead gullibele peopele. Not me.\n You also wrote: “Now suppose I was brave enough to say that I think you’re completely wrong. Suppose I were to suggest that none of the conditions you describe were likely to have been present at the burial of Christ, and that even if they were, they would not have had the effect of producing an image. Suppose I did that, what would be your response? Would it be a list of sources showing that you are in fact correct, or would you simply call me an idiot for not believing you? Why should I?”\nCan you substantiate this? Actually the fumigation/mordant theory is his lastest theory. Mine dates back to 1988 CE! Indeed you chemist buddy is a late comer.\nBTW you should read the Targum too re preventing dead body bad odors. Besides most curioulsy you gave only one of my two biblical referenes re fumigation performed on ancient burial. Have you read their midrashim? Finally Is it so hard for a non-Jew to understand that a procedure that was could not be performed (the anointing procedure) could be made up (drying and preventing bad odor via fumagation) on burial? Is it so difficult to understand for a non-Jew that the Sindon/himation was used asa shroud but is not a shroud per se but a garment and takhrikhiM (shrouds) were used on Judean burials?\nWhat is your expertise as far as PRE-Galmaliel II takhrikhin requirement (prior the Jerusalem Temple destruction/late 1st c. CE that is WELL AFTER Yeshua’s death on the Cros? Can you really discriminate betwen takhririm and takhrikhin.? I very much doubt so. \nDon’t go on and on misrepresenting my ideas. I have enough to do with your chemist buddy recycling my ideas.\nQuoting me “since the end of 2011, I can convincingly demonstrate Pilate coins were really placed over the TS man’s eyes by means of an eidomatic reading grid based on archaeological bloodstain pattern analysis.” you commented “I bet you can’t”. \nOh Really? What do you really know about eidomatics and numismatics? What do you really know about bloodstain pattern analysis? What do you really about falsely negative optical illusions in temsof shapes and colours? Methinks next to nothing or you would not have bet I cannot convincingly demonstrate Pilate coins were really placed over the TS man’s eyes. If I show you “the cat” you think you don’t see though it is really there in full few, shall you admit it you do think badly in terms of sight-and-brain because you are just not familiar with Pilate coin very partial paleographic patterns embedded in the TS weave pattern? Methinks you won’t and will keep being in denial even of visual fact to the contrary.\n\n","date":"August 1, 2015 at 4:43 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207172","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Sorry for all the typos again: Can you really discriminate betwen takhrikhim and takhrikhin.? I very much doubt so.\n\n","date":"August 1, 2015 at 5:41 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207185","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"“Fumigation/mordant theory”? There is or was no such theory in my attempts to model the “Shroud”. Fumigation (exposure to vapour) was merely a temporary tactic when first testing nitric acid as a developing agent for yellowing flour paste imprints.It was quickly replaced by nitric acid solution, once satisfied that could be used too. Mordants, suggested by Joe Accetta in his woodblock printing model, caught my eye, knowing that one in particular – alum – coiuld hydrolyse to form sulphuric acid. But there was no ecthing of linen fibres with pure alum, nor any appeciable etching with high concentrations of sulphuric. Thus the switch to nitric acid, which straight away delivered highly promising resuts through implicating an overlooked component in my imprinting with white flour – the protein as distinct from carbohydrate.\nI trust i’ve said enough to make clear that my line of research is an original one, and indeed finding few expressions of support or encouragement so far, at least on this site. So it’s galling to say the least to be having to post this kind of defensive comment.\n\n","date":"August 1, 2015 at 5:13 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207179","author":"Colin Berry","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"How many temporary tactics to come (from your baked monk mummies to nitric acid/flour alchemistry via roasted knight templar and leeches’ blood digest). Much ado for NOTHING or  as the italiians would say MOLTO FUMO E NIENTE ARROSTO (a lot of smoke and no fire)!\n\n","date":"August 1, 2015 at 5:51 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207187","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Yes Hugh’s chemist buddy does have original ideas indeed reading others. Too bad his own personal ideas are ALL WRONG and dead ends. If  they prove anything, they prove definitely what the TS image is not though EACH TIME we have that chemist on pension trumpeting on his blog and wanting us to believe he finally has cracked the TS image code… This is an odd way indeed to be totally wrong and original indeed.\n\n","date":"August 1, 2015 at 6:19 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207191","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"i have proposed the outline of a 2-stage imprinting model. \nhttps://shroudofturinwithoutallthehype.wordpress.com/2015/07/17/heres-an-updated-version-of-my-iconoplastic-modelling-of-that-turin-so-called-shroud-probably-a-misnomer/\nThere’s a range of options for the 2nd stage colour development : chemical, e.g nitric acid or thermochemical (hot limewater, hot smoothing iron).\nI make no apology for the tortuous route that led to the model. That is the nature of science – it is not a magic wand, merely a means of ensuring there are always new experiments waiting to be done. Experimental science is not a pure intellectual exercise – it has to be hands on, with a readiness to explore new avenues.\n\n","date":"August 1, 2015 at 6:04 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207189","author":"Colin Berry","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Colin and Max, stop fighting! \nWow! You guys are too funny!  While your ideas, regarding fumigation are impressive, sadly you’re both incorrect.   :)\nYour hypotheses/theories (Max/Colin) can only explain an image formation, but neither of them represent the resurrection of the body (levitation), or the white spiritual garment Jesus wore as the gardner, after the resurrection..  Regarding antigravity, Jesus too would have been able to appear and disappear at will. \nThe only explanation for ALL phenomena  (image, magnetic levitation, antigravity and the spiritual garment) are the metal superconductors.\nYou should also be aware  Magnetic Resonance Imaging (MRI) and Nuclear Magnetic Resonance (NMR) utilize superconductors.\nLink:\nSuperconducting magnet\n“They are used in MRI machines in hospitals, and in scientific equipment such as NMR spectrometers, mass spectrometers and particle accelerators”.\nhttps://en.wikipedia.org/wiki/Superconducting_magnet\n——\nPresently, metal superconductors operate at cold temperatures approaching absolute zero on the Kelvin scale, high temperature superconductors have been found, and presently scientists are searching for a room temperature superconductor and one theory is metallic hydrogen at extremely high pressure.  \nhttps://en.wikipedia.org/wiki/Room-temperature_superconductor\nWe do not know what Jesus utilized; however, science is finding something new, referencing quantum physics, every day, including nanoparticles as superconductors (graphene).\nJesus’ feet contained dirt that would have included iron, and there may have been iron in the sepulchre or perhaps heme iron was used.  And there is the magnetic core necessary for superconducting properties.\nBest,\n\n","date":"August 1, 2015 at 6:27 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207193","author":"Angel","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Angel, this is just virtual fighting, rest assured. Re alleged “levitation on resurrection”, sorry you’re incorrect here but since your an angel I am ready not to fight with you.\n\n","date":"August 1, 2015 at 6:34 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207195","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"A spiritual garment that makes Yeshua looks like an evreryday man, a gardener in flesh ad bones, you dear Angel are funny too.\n\n","date":"August 1, 2015 at 6:38 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207196","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Howvere I am omen minded to Yeshua’s return to life whether miracuous or not. I can even accept bilocation (holy men can do it).\n\n","date":"August 1, 2015 at 6:41 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207198","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Max, the spiritual garment Jesus wore, after resurrection was composed of bright, white light, and not material.\nAlthough not included in the Canon, one of the Nag Hammadi Library texts included Jesus approaching Simon Peter and Simon was unable to look upon Him because the light was too bright.  Simon asked Jesus to withdraw some of His light and He did.\nWhen Mary Magdalene saw Jesus, as the gardner, His clothing was bright white, like an angelic being and this is comprehended completely when the properties of superconductors are understood.\nBest,\n\n","date":"August 1, 2015 at 7:37 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207203","author":"Angel","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Max patrick Hamon says:  Angel, this is just virtual fighting, rest assured. Re alleged “levitation on resurrection”, sorry you’re incorrect here but since your an angel I am ready not to fight with you.\n***Angel says:  Yes, I understand virtual fighting. Max.  I was attempting to break the ice.  :)\nReferencing ” metal superconductors,”  I don’t believe I am incorrect.\nIsabel Piczek’s “Event Horizon” clearly explains the levitation that would be evident with superconductors.\nSee the following links.\nhttp://www.materialsviews.com/doped-graphite-powder-room-temperature-superconductors-at-last-2/\nhttp://phys.org/news/2014-08-diamagnetic-levitation-pyrolitic-graphite-magnet.html\nhttps://en.wikipedia.org/wiki/Meissner_effect\nAnd now scientists have found a room temperature superconductor (graphene)\nScientists at Tel Aviv University, Superconductivity Group have a video showing Quantum Levitation.\nBest,\n\n","date":"August 1, 2015 at 7:30 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207202","author":"Angel","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Sorry Angel sorry so but…\nhad Mary Magdalene seen Yeshu’a in “a spiritual garment composed of bright, white light, and not material”, how could she have mistaken him for an everyday man (a gardener in flesh and bones!). It doesn’t make sense. Have gardeners “spiritual garments”?\nBesides how can Mary Magdalene identifies the angels and fails to identify Yeshua as a heavenly messenger in an alleged  “glorious body” and how then do you REALLY understand Yeshu’a telling her  not to hold on to him, for he has not yet ascended to the Father”(john 20:17)? \nWhat now if Yeshua’s bloodied body imprint had formed on burial when his stiff rigid body was tightly wrapped up and placed IN HEIGHT on two piles made of bags of spices or two limestones in order to  be subjected to a myrrhic aloetic fumigation and dry (the sindon/himation being used as an inner burial winding sheet in-soaked with a watery solution for purifying sake)? (the myrrhic aloetic fumigation being a substitute for the anointing procedure that could not be peformed on burial. No time\nto grind the spices in chunks and lump shapes and mahke spicy perfume oil)?\nMethinks Dame Isa mistook a placement in extra height of the TS man’s stiff rigid body (as stiff rigid as a wooden plank) on two piles made of bags of myrrh and aloe wood bags or two limestones; a body of which image was recorded in that very position.\n\n","date":"August 1, 2015 at 8:39 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207213","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Edit: Methinks Dame Isa mistook a placement in extra height of the TS man’s stiff rigid body (as stiff rigid as a wooden plank) –on two piles made of bags of myrrh and aloe wood bags or two limestones– for a mirculous levitation; a body of which image was recorded in that very position in extra height not in miraculous levitation.\n\n","date":"August 1, 2015 at 9:02 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207214","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Note: On bilocations, the person can look like in flesh and bones (see Sister Maryvonne case).\n\n","date":"August 1, 2015 at 6:49 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207199","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Sorry I meant sister Yvonne Beauvais\n\n","date":"August 1, 2015 at 6:57 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207200","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Max says:  Howvere I am omen minded to Yeshua’s return to life whether miracuous or not. I can even accept bilocation (holy men can do it).\nMax says:  Note: On bilocations, the person can look like in flesh and bones (see Sister Maryvonne case)\n***Angel says:  Biolocation is another property of superconductors and it is referred to as “antigravity.”  Like a UFO that can disappear from space and reappear in another area, antigravity is responsible for levitation and biolocation works on the same antigravity principle.\nBest,\n\n","date":"August 1, 2015 at 7:50 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207207","author":"Angel","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"edit:  bilocation\n\n","date":"August 1, 2015 at 7:58 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207211","author":"Angel","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Max says:\nhad Mary Magdalene seen Yeshu’a in “a spiritual garment composed of bright, white light, and not material”, how could she have mistaken him for an everyday man (a gardener in flesh and bones!). It doesn’t make sense. Have gardeners “spiritual garments”?\nBesides how can Mary Magdalene identifies the angels and fails to identify Yeshua as a heavenly messenger in an alleged “glorious body” and how then do you REALLY understand Yeshu’a telling her not to hold on to him, for he has not yet ascended to the Father”(john 20:17)? \n***Angel says:  Max, think of the transfiguration of Jesus.\nMatthew states “and his clothes became white as light,”\nLuke remarks, “and his clothing became dazzling white.” \nMark says:  “Jesus clothes became radiant, shining, intensely, exceedingly, dazzling white, as no one on earth could bleach them.” \nWhen Jesus directed Mary not to touch Him, as He had not yet ascended to the Father, might also mean He had not yet returned to heaven as God the Father, and touching Him would have introduced a contamination that would have prevented the transformation.  He may well have returned to heaven as the Almighty, prior to visiting the disciples, including the doubting Thomas.\nEverything, with God, occurs in the twinkling of an eye, so the transformation, like bilocation, would not be surprising.\n\n","date":"August 1, 2015 at 9:21 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207215","author":"Angel","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"PS  I meant to include, Jesus may have returned to heaven as either God the Father OR as the Holy Spirit.  In either case Mary’s touch may well have contaminated this transformation process.\n\n","date":"August 1, 2015 at 9:36 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207217","author":"Angel","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"ngel, you wrote: “When Jesus directed Mary not to touch Him, as He had not yet ascended to the Father, might also mean He had not yet returned to heaven as God the Father, and touching Him would have introduced a contamination that would have prevented the transformation.”\nWhich mean precisely what I said, Yeshua’s body was not transformed yet, his body was just of flesh and bones. Yeshua has not a “glorious body”. Hence your parallel witht “he transfiguration of Jesus” falls flat (if you allow me to say so). \nAn everyday man (here a Second Temple period gardener) do not wear clothes/a cloth that “become radiant, shining, intensely, exceedingly, dazzling white, as no one on earth could bleach them”, he just wear a stained and soiled sindon draped as a workwear!\n\n","date":"August 1, 2015 at 9:41 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207219","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"A free lance journalst wrote my reconstructions were imaginary. He’d better ask himself and mind his own reconstructions of the events re Yeshua’s burial and apparitions. Most likely, my reconstruction are more faithful to the events and less imaginary than his (which he is no man enough to expose to my critics.\n\n","date":"August 1, 2015 at 9:49 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207221","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Max says:  ” Methinks Dame Isa mistook a placement in extra height of the TS man’s stiff rigid body (as stiff rigid as a wooden plank) –on two piles made of bags of myrrh and aloe wood bags or two limestones– for a mirculous levitation; a body of which image was recorded in that very position in extra height not in miraculous levitation.”\n***Angel says:  Max, what do you mean by extra height?  I believed it was determined by the scientific team the height of Jesus was approximately 5′ 11.”\nWhere does the extra height enter the picture?\nBest,\n\n","date":"August 1, 2015 at 9:42 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207220","author":"Angel","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Angel, language barrier had it!\nSorrry so, I took for granted you had read about my reconstruction re Yeshua’s body/corpse dressing in shrouds and being subjected to a (myrrhic?) aloetic fumigation to make up for the anointing procedure and dry out the said body/corpse (moistened through an alkaline water solution in-soaked inner burial winding sheet aka TS). It has NOTHING to do with Yeshua’s alleged height!\nOn June 8, 2015 at 11:33 am I wrote: \n“The sindon/himation was in-soaked with an alkaline solution prior to be used as inner burial winding sheet. It was not loosely laid, but, most likely, first drawn quite taut from the feet up the back of the stiff rigid body (as stiff and rigid as a wooden board) and over the head and down the front to the feet and then compressed widthwise in smaller shrouds prior to being placed in extra height (either on two piles of myrrh bags or two stones) and subjected to a fumigation.” \nCan you view the scene better?\n\n","date":"August 2, 2015 at 4:52 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207246","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Max Patrick Hamon says:\n“It was not loosely laid, but, most likely, first drawn quite taut from the feet up the back of the stiff rigid body (as stiff and rigid as a wooden board).  Can you view the scene better?\n***Angel says:  You mean like a strait jacket that wraps vertically, instead of horizontally?   :)\n\n","date":"August 2, 2015 at 5:12 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207283","author":"Angel","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Methinks I see a gap in the market for a new internet site – wackypedia. Sadly my own ideas on medieval imprinting would fail the test of essential wackiness – but one or maybe two folk on this thread would likely fare better.\n\n","date":"August 2, 2015 at 1:53 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207226","author":"Colin Berry","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"I am a TS pro-authenticist and maybe soon I’ll be just kicked out of this website forum. \nMost sadly on one side we have blind arch-miraculist shroudies (such as one free lance journalist thinking he is an expert in Biblical scholarship just because of “his” authority (standing in the background); an authority he neither cannot quote nor name, which speaks volumes on how reliable the free lance journalist’s alleged “expertise” is!). \nMost sadly too on the other side we have arch-fraudulist anti-shroudies whose alleged “scientific objectivity” is just as delirious as arch-miraculists’ pseudo-science and archaeology (see the chemist on pension who keeps developing “temporary tactics” (from baked monk mummies to nitric acid/flour alchemistry via roasted knight templar spiced with leeches’ digesta). \nJust guess whose work (thought experiment, reconstructions) is currently  highlighted in Shroud literature and blog spheres? In the kingdom of the blind, the one-eyed is king.This is a real shame indeed.\n\n","date":"August 2, 2015 at 4:19 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207234","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Edit :an authority he neither can quote nor name,\n\n","date":"August 2, 2015 at 4:20 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207235","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Edit: arch-miraculists’ pseudo-science, pseudo-archaeology and pseudo-exegesis of Yeshia’s burual and apparitions\n\n","date":"August 2, 2015 at 4:23 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207238","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"More edidt: Most sadly too on the other side we have arch-fraudulist anti-shroudies whose alleged “scientific objectivity” is just as delirious as arch-miraculists’ pseudo-science and archaeology (see the chemist on pension who keeps developing “temporary tactics” (from baked monk mummies to nitric acid/flour alchemistry via roasted knight templar spiced with leeches’ digesta) while EACH TIME trumpeting he has cracked the TS image code!?\n\n","date":"August 2, 2015 at 4:32 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207240","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"\nClick to enlarge  ;-)\n\n","date":"August 2, 2015 at 4:42 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207243","author":"Colin Berry","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"When will you start that site?\n\n","date":"August 2, 2015 at 5:53 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207286","author":"Angel","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Colin Berry says:  “Methinks I see a gap in the market for a new internet site – wackypedia. Sadly my own ideas on medieval imprinting would fail the test of essential wackiness – but one or maybe two folk on this thread would likely fare better.”\n***Angel says:  You’re too funny, Colin.\nRemember the movie, “Back to the Future”?\nThink of me when you buy your new “Lexus Hoverboard.”\nBy the way, it runs on superconductors, and it levitates.\n\n","date":"August 5, 2015 at 6:56 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207512","author":"Angel","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Max, you’re doing it again! If you have any better notion than I have about the halakha, then please show us where it agrees with your views. If the Targum says anything about preventing dead body bad odours, tell us where it does so. Is it hard to understand your views? Not at all; I just don’t believe them. What is my expertise as far as PRE-Galmaliel II takhrikhin requirement? Who cares? I don’t use it as part of my argument. You do. If you have any authority in that area, what is it?\nWhat do I really know about eidomatics and numismatics? Who cares? It’s what you know about them that matters here, and you haven’t given us any reason to suppose your knowledge is any better than mine. You cannot demonstrate that something is true by claiming your auditors are ignorant. If you can ‘convincingly demonstrate’ anything at all, please do so. I bet you cant.\n\n","date":"August 2, 2015 at 4:22 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207236","author":"Hugh Farey","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Now a science of the earth expert and arch-fraudulist shroudieis he asking me to tell him what is  PRE-Galmaliel II takhrikhin requirement? Can He re-read my answer before passing comments? Just the very FACT Galmaliel II lived a generation after Yeshua’s means the takhrykhin requirement cannot be applied to Yeshu’a burial. Period.\nWhat is my  authority in that area? FACTS.\n\n","date":"August 2, 2015 at 4:29 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207239","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"“The very FACT Galmaliel II lived a generation after Yeshua’s means the takhrykhin requirement cannot be applied to Yeshu’a burial.” No, it doesn’t. The fact that Gamaliel tried to regularise burial cloths does not mean that any particular system was not in use before, as you yourself have pointed out above.\n“What is my authority in that area? FACTS.” You haven’t given us any facts, Max. You seem to be confusing your imagination with some kind of objective certitude. A baseless ‘fact’ is no more than a fancy.\nCan you ‘convincingly demonstrate’ anything? I bet you can’t.\n\n","date":"August 2, 2015 at 4:42 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207244","author":"Hugh Farey","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Once again, you’re totally misreprenting my opinion to have people think you’re right and I am wrong, which speaks volumes on the way you debate to mislead people. \nPrior to Gamaliel II there were many variants re the takhrikhiM in terms of colours, adornments, richness and the like. In the case of Yeshua’ dressing in shroudS (takhrikhiM NOT takhrikhiN), “shall I endlessly repeat” clothings (face veil, skull cap, linen garments, belt, all enveloping wrap) could be and were currently used as shroudS/takhrikhiM. To tell in the time of Yeshua it was common to use one, not two, shrouds is one thing, MOST LIKELY this was not the case on Yeshua ‘s burial (see the Kornelimünster GENUINE relics or SUBSTITUTE relics). The TS is not a shroud per se, it is a sindon/himation used as a shroud. “Shall I repeat it endlesssly”?\nA  free lance journalist commented my standpoint (do note his kind words –from a man who wants to teach me proper respect to others on the trollish principle “Do as I say, don’t do as I do): \n“Try and send your material to them (unamed authorities!? comment mine) and you will see that you will be laughed out of court. For a start, I have information (never given!? comment mine) from a reliable authority (never quoted nor named!? comment mine) that it was common to use one, not two, shrouds”.\nAlike that free lance journalist your opinion is based on Gamaliel II “takhrikhin requirement”. Such a requirement DID NOT exist as such prior to R. Gamaliel II. The very word takhikhiM (upper case intended) a word derived from the verb “to wrap up”  is currently TRANSLATED “SROUDS” (again the language barrier to communication!).\n\n","date":"August 2, 2015 at 5:28 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207248","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Too bad neither the science of the earth expert nor the free lance journalist know about basic Hebrew burial vocables yet keep on telling me they know better.\n\n","date":"August 2, 2015 at 5:44 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207251","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"No, Max, we don’t keep telling you we know better; we keep asking you to substantiate what you know, but you never do. I would not want anybody to think you are wrong based on anything I say, but I also wouldn’t want them to think you are right based on your wholly unsupported opinions.\nAs for misrepresenting you, well, I can only say I’m doing my best. What does this mean for example? “To tell in the time of Yeshua it was common to use one, not two, shrouds is one thing, MOST LIKELY this was not the case on Yeshua ‘s burial (see the Kornelimünster GENUINE relics or SUBSTITUTE relics). The TS is not a shroud per se, it is a sindon/himation used as a shroud. “Shall I repeat it endlesssly”?\n1) It was common to use a single shroud in Jesus’s time. How do you know?\n2) Jesus’s case was an exception. How do you know?\n3) The Shroud was a himation. How do you know?\nDon’t repeat the statements; justify them.\n\n","date":"August 2, 2015 at 6:33 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207257","author":"Hugh Farey","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Don’t be too hard on our “let’s pursue the Jewish angle” commentator Hugh. He’s only doing what scores of sindonologists have done before him: re-construct a scenario based on a preconception (which broadly speaking can be stated as “it’s the authenticity, stupid”), then package up the expanded narrative as ‘new compelling data’ that can then used to promote the initial preconception. It’s what I now call “cherry jam manufacture”, an end-stage of mere ‘cherry picking’.  Some of the most respected investigators have resorted to cherry jam manufacture, including high profile STURP team members (though the worst excesses mercifully appeared after the 1981 Summary – which I guess comes as a small consolation). \nPS: Were I to cough up £20 (minimum two year sub) would I now be in possession of  u-know-wot (hard copy version)?\n\n","date":"August 2, 2015 at 6:50 am","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207258","author":"Colin Berry","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"Max Patrick Hamon says:\n“Which mean precisely what I said, Yeshua’s body was not transformed yet, his body was just of flesh and bones. Yeshua has not a “glorious body”. Hence your parallel witht “he transfiguration of Jesus” falls flat (if you allow me to say so).”\n ***Angel says:   Yes, Max, it was transformed.\nThe body of Jesus, as the gardner, was like white light, translucent.  He told Mary not to touch Him, because He had not ascended to the Father.  This means He was transforming from a spiritual body to an Energy state (the Almighty).  \nEnergy has no form.\nIn short, Jesus returned to heaven as God the Father, prior to visiting the disciples as the Holy Ghost, where He was confronted by the doubting Thomas.\nWhen Jesus states, I am ascending to the Father means he is transforming to God.\n\n","date":"August 2, 2015 at 5:48 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207285","author":"Angel","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"PS  Max, I failed to mention Jesus’ glorius body was of flesh and bones; however, it was cloaked in a veil of bright, white light.\n\n","date":"August 2, 2015 at 6:00 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207288","author":"Angel","site":"shroudstory"},{"title":"Cherry Jam, the Metaphor","post":"***Angel says:  The answer to every phenomena pertaining to the Shroud is superconductors.\nAre the Shroud positive/negative mirror images?\nIf so, the Meisner effect of superconductors also produce mirror images.\nLinks\nMagnetic Levitation\n“If a small magnet is brought near a superconductor, it will be repelled becaused induced supercurrents will produce mirror images of each pole.”\nhttp://hyperphysics.phy-astr.gsu.edu/hbase/solids/maglev.html\nGraphene an allotrope of Carbon and a room temperature superconductor forms mirror images. http://www.naturalgeographicmagazine.com/q/Superconductors\nVideo: The Meissner effect\n“This has the effect of creating a mirror-image of the magnet within the superconductor and, through the expelled lines of force it is creating, causes itself to levitate.”\nhttp://www.howitworksdaily.com/the-meissner-effect/\n“In the researchers’ model, this superconducting ability depends on what’s called chirality. Many organic molecules exist in two forms, known as left- or right-handed in analogy with human hands: they contain the same number of atoms in nearly the same configuration, but are mirror-images of each other.”\nhttp://arstechnica.com/science/2012/01/graphene-may-exhibit-exotic-superconductivity/\n\n","date":"August 2, 2015 at 7:00 pm","url":"https://shroudstory.com/2015/07/31/cherry-jam-the-metaphor/","cat":"uncategorized","id":"comment-207291","author":"Angel","site":"shroudstory"}]
