[{"title":"Not Believing in the absence of evidence","post":"I’ve been thinking about Jesus’ story of the Rich Man and the beggar Lazarus. When the Rich Man found himself in a place of suffering, he begged Abraham to send Lazarus back and warn his brothers.  Abraham told him that, for one thing, it wasn’t even possible to do send Lazarus back. But even if it was possible to send Lazarus back, it wouldn’t make a difference. Abraham told the Rich Man that his brothers had plenty of evidence already and if they wouldn’t believe the witness of the prophets, then they wouldn’t be convinced by anybody even if they saw Lazarus raised from the dead. \nSo that’s the story Jesus told, and it directly addresses issues of faith, from the point of view of the afterlife. Apparently the witness of those who DO believe is considered very valuable in the eyes of Heaven. \nIf people on earth insist on rejecting the witness of believers, they will have no excuse when they stand before God. \nSo this should encourage Christian believers, at any rate. Your testimony is a powerful thing: what God has done for you is important. Don’t feel hurt when people belittle it.  That Rich Man in hell certainly regretted his callousness, but there was nothing he could do about it by then. \nOne thing I have always enjoyed is listening to others tell the story of how they got saved: the steps that lead them there to that point. I am always touched by the sincerity, the tenderness, the love of God that comes through. I think Atheists and Agnostics should spend less time scoffing and mocking, and more time listening. \nBlind faith is a very inaccurate term. Perhaps it appears to be “blind” for those who haven’t tried it but it’s anything but “blind” for true Christian believers. And if people think it’s cop-out to be a Christian, then I dare them to try it. Armchair Quarterbacks don’t actually know anything about the strain and pain of the game, and that’s the truth.\n\n","date":"August 19, 2011 at 7:20 pm","url":"https://shroudstory.com/2011/08/19/not-believing-in-the-absence-of-evidence/","cat":"news_&_views","id":"comment-3632","author":"AnnieCee","site":"shroudstory"}]
