[{"title":"Christian Piatt: Jesus told me that the Shroud of Turin was his photograph.","post":"Not a Christian.\n\n","date":"August 7, 2014 at 9:14 am","url":"https://shroudstory.com/2014/08/07/christian-piatt-jesus-told-me-that-the-shroud-of-turin-was-his-photograph/","cat":"news_&_views","id":"comment-142777","author":"Nabber","site":"shroudstory"},{"title":"Christian Piatt: Jesus told me that the Shroud of Turin was his photograph.","post":"Piatt: I wonder if Jesus had any idea what a great setup for nut jobs he was leaving behind when he said he’d come back some day.\nMatthew 24:   23 Then if anyone says to you, ‘Behold, here is the [l]Christ,’ or ‘[m]There He is,’ do not believe him. 24 For false Christs and false prophets will arise and will [n]show great [o]signs and wonders, so as to mislead, if possible, even the [p]elect. 25 Behold, I have told you in advance. 26 So if they say to you, ‘Behold, He is in the wilderness,’ do not go out, or, ‘Behold, He is in the inner rooms,’ do not believe them. 27 For just as the lightning comes from the east and flashes even to the west, so will the coming of the Son of Man be. \n\n","date":"August 8, 2014 at 11:00 am","url":"https://shroudstory.com/2014/08/07/christian-piatt-jesus-told-me-that-the-shroud-of-turin-was-his-photograph/","cat":"news_&_views","id":"comment-142979","author":"Julian","site":"shroudstory"},{"title":"Christian Piatt: Jesus told me that the Shroud of Turin was his photograph.","post":"All  those who hear the voice of Yahoshua are not necessarily nut jobs.\nWho man has targeted (in his own arrogance) to be a nut, God may have chosen in His wisdom to be His messenger.  A person who claims to hear God’s voice is not claiming to be the Messiah and should not be labeled a false prophet.\nWith reference to visitations and dreams, there are none among us (Christians or otherwise) who are able to deduce, with certainty, who Yahoshua has or has not chosen to visit.\nFor it is written, concerning the last days,\nActs 2:17\nAnd it shall come to pass in the last days, saith God, I will pour out of my Spirit upon all flesh: and your sons and your daughters shall prophesy, and your young men shall see visions, and your old men shall dream dreams\nJoel 2:28\nAnd it shall come to pass afterward, that I will pour out my spirit upon all flesh; and your sons and your daughters shall prophesy, your old men shall dream dreams, your young men shall see visions:\n\n","date":"August 9, 2014 at 6:13 pm","url":"https://shroudstory.com/2014/08/07/christian-piatt-jesus-told-me-that-the-shroud-of-turin-was-his-photograph/","cat":"news_&_views","id":"comment-143149","author":"Angel","site":"shroudstory"}]
