[{"title":"Oh no, a mean and nasty smokescreener and clever rationalizationer","post":"I’m sure Mr Nickell is a smart man – he has a PhD – but his list of work experiences is an oddball mash up of things, what can he claim his real expertise is in, in evaluating the Shroud?\n\n","date":"January 20, 2014 at 7:30 am","url":"https://shroudstory.com/2014/01/20/oh-no-a-mean-and-nasty-smokescreener-and-clever-rationalizationer/","cat":"news_&_views","id":"comment-73793","author":"Matthias","site":"shroudstory"},{"title":"Oh no, a mean and nasty smokescreener and clever rationalizationer","post":"Joe is smart. He’s a nice guy as well. I enjoyed talking with him in the past. He is a bit pompous when talking about the shroud. For instance, he insists that McCrone was proven right and there is nothing more to be said about it because it is just an argument between zealous Christians and everyone else. Back in 1999, Eric Krieg of the Philadelphia Association for Critical Thinking wrote about him: “Joe is not your “average Joe”, by nature of former occupations of: undercover detective, teacher, draft dodger, river boat manager, carnival promoter, magician, investigator, and spokesperson. . . . Joe impressed on me the difference between being a scientist and an investigator. Joe seems to have no significant credentials just as his mentor: James Randi. In both cases, the lack of single significant credentials is much more than offset by a more important broad area of knowledge. Joe remarks that a scientist tends to approach an investigation from the narrow view of his own specialty – where as a “jack of all trades” would come up with more avenues of investigation.”\n\n","date":"January 20, 2014 at 7:48 am","url":"https://shroudstory.com/2014/01/20/oh-no-a-mean-and-nasty-smokescreener-and-clever-rationalizationer/","cat":"news_&_views","id":"comment-73797","author":"Dan","site":"shroudstory"},{"title":"Oh no, a mean and nasty smokescreener and clever rationalizationer","post":"fair enough, sounds a bit “mickey mouse’ to me….then again, I’m necessarily a fan of so called “specialists” either, so maybe I should open my mind.\n\n","date":"January 20, 2014 at 7:59 am","url":"https://shroudstory.com/2014/01/20/oh-no-a-mean-and-nasty-smokescreener-and-clever-rationalizationer/","cat":"news_&_views","id":"comment-73799","author":"Matthias","site":"shroudstory"},{"title":"Oh no, a mean and nasty smokescreener and clever rationalizationer","post":"Joe Nickell has at least been frank about the shortcomings of a scientist but he should know that a parapsychologist is expected to be some sort of “jack of all trades”. Both Randi and him are not parapsychologists and tend to take it for granted that genuine phenomena is obtained by fraudulent means, which is not really the case. A good parapsychologist is able to distinguish between what is genuine and what is fraudulent, also knowing that the field is neutral in its approach.\n\n","date":"January 20, 2014 at 9:51 am","url":"https://shroudstory.com/2014/01/20/oh-no-a-mean-and-nasty-smokescreener-and-clever-rationalizationer/","cat":"news_&_views","id":"comment-73808","author":"Louis","site":"shroudstory"},{"title":"Oh no, a mean and nasty smokescreener and clever rationalizationer","post":"Here I want to ask …\nIf you know a parapsychologist able to investigate the field of precognitive dreaming in the realm of analyses … for the linen fibrils of the Holy Shroud (and see also the controls of the inherent “ghosts”) …\n\n","date":"January 20, 2014 at 11:56 am","url":"https://shroudstory.com/2014/01/20/oh-no-a-mean-and-nasty-smokescreener-and-clever-rationalizationer/","cat":"news_&_views","id":"comment-73822","author":"piero","site":"shroudstory"},{"title":"Oh no, a mean and nasty smokescreener and clever rationalizationer","post":"Piero, I presume you are serious about what you are saying, so let me tell you something:\ngenuine parapsychological phenomena are spontaneous, they cannot be stimulated. You cannot go to bed and begin dreaming about the Shroud to see if you arrive at some result, because the dream did not emerge from the unconscious. \nJust in case you are not aware about it, let me draw your attention to the case of Danish physician Dr. Niels Svensson. According him he saw the face of Jesus in a dream in 1962, when he was twelve years old, and he was astonished to see that it was the same face he saw on the Shroud in 1975.\nHaving felt and witnessed genuine parapsychological phenomena, I have no reason to doubt what Dr. Svensson wrote.\nhttp://www.shroud.com/pdfs/Svensson-refl.pdf\n\n","date":"January 20, 2014 at 1:06 pm","url":"https://shroudstory.com/2014/01/20/oh-no-a-mean-and-nasty-smokescreener-and-clever-rationalizationer/","cat":"news_&_views","id":"comment-73830","author":"Louis","site":"shroudstory"},{"title":"Oh no, a mean and nasty smokescreener and clever rationalizationer","post":"Joe starts every investigation with the assumption, as Randi did, that he can debunk the ‘paranormal’ claim. This is fine for 99 percent of the cases they’ve investigated. But as many have pointed out here, the Shroud is not, necessarily, a paranormal case. It could be authentic and be natural.\nIf Joe could accept that premise then the confirmation bias that obviously impedes his research on this topic would be lessened.\n\n","date":"January 20, 2014 at 11:59 am","url":"https://shroudstory.com/2014/01/20/oh-no-a-mean-and-nasty-smokescreener-and-clever-rationalizationer/","cat":"news_&_views","id":"comment-73823","author":"David Goulet","site":"shroudstory"}]
