[{"title":"Clarification: Quake DID NOT reveal day of Jesus’ crucifixion","post":"This article is interesting for New Testament studies because it can only increase our assessment of the historical reliability of the passion account in Matthew. \nIf there was no trace at all of an earthquake between 26-36 AD (that is to say, if we had only the trace of an eathquake in 31 AD), we would have a high level of certainty that Matthew used sometimes an allegory in his Passion account. Clearly, here we have a  scientific data that we could have expected to be found if the historical reliabilty of Matthew’s account was high. \nBut the last big news in NT Studies was given in February by Daniel Wallace. Wallace annouced that  a fragment of Mark’s Gospel, found in Egypt in 2011, may date to 1st century.\n http://www.forbes.com/sites/johnfarrell/2012/02/27/fragments-of-marks-gospel-may-date-to-1st-century/\n\n","date":"May 29, 2012 at 5:54 am","url":"https://shroudstory.com/2012/05/29/clarification-quake-did-not-reveal-day-of-jesus-crucifixion/","cat":"news_&_views","id":"comment-11679","author":"cazab","site":"shroudstory"},{"title":"Clarification: Quake DID NOT reveal day of Jesus’ crucifixion","post":"If I claim to be an agnostic I am saying simply that ‘I don’t know’–I neither disclaim nor affirm, which is an intelligent approach to this topic. Good statement!\n\n","date":"May 29, 2012 at 8:31 am","url":"https://shroudstory.com/2012/05/29/clarification-quake-did-not-reveal-day-of-jesus-crucifixion/","cat":"news_&_views","id":"comment-11684","author":"Darby Mitchell","site":"shroudstory"},{"title":"Clarification: Quake DID NOT reveal day of Jesus’ crucifixion","post":"I repeat it :  For me, the biggest and most important evidence of the historical reliability of the main message we found in the 4 Gospel accounts is the Shroud of Turin, which is a real artifact of the Passion, death and emtombment of Jesus of Nazareth (plus, for a believer, a great sign of his resurrection).  Along the Shroud, there’s also another complementary artifact named the Sudarium of Oviedo, which can also give us some important informations about the historic Jesus…  Those 2 material objects are, for me, great evidences concerning the reality of the historic Jesus and the reliability of the Gospels, even if I know very well that those 4 documents cannot be considered ONLY as 4 historical books.  There’s a mix in there between historical facts and theological teaching that is not easy to dissect…  But the Shroud show us that there really are historical facts nevertheless !!!  Christianity is not based on a philosophy but on a real man, Jesus of Nazareth who really live and die on this planet 2000 years ago.\n\n","date":"May 29, 2012 at 11:04 am","url":"https://shroudstory.com/2012/05/29/clarification-quake-did-not-reveal-day-of-jesus-crucifixion/","cat":"news_&_views","id":"comment-11690","author":"Yannick Clément","site":"shroudstory"}]
