[{"id":"comment-11802","author":"lyfe","post":"Everyone knows how cloth is woven, with long unbroken threads.(P.S. I have worked in a museum textile department.) So if you want to copy a weave you have to show the threads going through. The artist has decided not to do this because he wants to follow other patterns of decoration from medieval art that have nothing to do with the Shroud. WHY NOT JUST SHOW THE SHROUD IF IT IS THAT IMPORTANT? No image of a body anywhere, he does not even bother to copy the bearded face of Christ which is surely what everyone would notice. Can we not just start with a common sense approach on this? Who are all these medievalists/art historians who can see the Shroud? Is this the Courtauld view? Please provide the medieval art experts!.","date":"2012-06-02","mins":"11:49 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12132","author":"lyfe","post":"Colinsberry is right time to give this whole idea of the Pray Codex shows the Shroud a decent burial. Medieval art shows that if one wanted to show a relic one showed it in full there was no point in hiding it away. The defenders of the idea that the Pray Codex shows the Shroud have had to make the Shroud in the Codex more and more obscure (once they had realised that the tomb lid was not the Shroud!!) this is not a Dan Brown mystery where some people are trying to pass on a secret message which only a few people will be able to guess. And if you were trying to pass on a secret message why do it in this Hungarian manuscript? What is extraordinary is that anyone ever believed this idea in the first place: Christ is being shown buried according to the custom of the twelfth century, he has no beard, the Shroud is too small for the Turin Shroud, there is no image on the Shroud in the Two Marys picture, It seems that there is a separate face cloth as in other pictures of the time, the pattern on the tomb lid is not weaving and there is no reason why the way the cloth was woven should be venerated, any more than the holes in the Shroud. I suppose some people will go on thinking that they can still see the Shroud but i cannot believe anyone will believe them. There are still no medival art historians ready to come out in support! Let’s move on..","date":"2012-06-10","mins":"6:19 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12117","author":"lyfe","post":"When I first saw the reference to the Pray Codex showing the Shroud of Turin I could not think what they were talking about. As David Mo says, the second scene of the Marys is always shown, and in much better illustrations than the Pray Codex, with an empty tomb and a lid. I never imagined otherwise. I really was amazed that some people thought the tomb and its lid were the Shroud. It seems that the Pray Codex is the only picture of these scenes they have seen and that is why they are so mistaken. If you had seen the Shroud you would have shown the image which is the most important thing about it, so the Pray Codex tells us nothing. No one has answered the question of why anyone would want to venerate the kind of weaving of which the Shroud is made rather than the image and , one has to say it again, the pattern on the lid is not a picture of a woven cloth. Does anyone know who was the first person who had this crazy idea about the Shroud being seen on the Codex? Normally one wants to show relics in full, this is what the public expected to see, so why try and hide away that it is the Turin Shroud by making it ‘symbolic’, rather than showing it as it really is. The more one reads on this blog, the less one believes in the Shroud being shown. Well done, Colin Berry and David Mo for keeping up the pressure. The replies show there is no evidence to support the Shroud being shown here,.","date":"2012-06-09","mins":"1:40 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12158","author":"lyfe","post":"Final point. Can we please know who put forward the idea that the Turin Shroud can be seen on the Codex? Where is it argued? The idea must have come from somewhere because it is not at all obvious. Did they mistake the tomb for the Shroud? Did they really believe that the tomb lid showed weaving and why did they think the weaving was more important than the image?.","date":"2012-06-10","mins":"4:50 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12171","author":"lyfe","post":"So Ian Wilson has a lot to answer for. How does someone with no qualifications in this field have so much power? Is it because people will swallow anything? I expect most people will have seen Charles Freeman’s article on The Shroud of Turin and the Image of Edessa ( it is referred to in one of the earlier postings by Dan). It is interesting that Freeman suggests a whole new avenue of research on the Shroud ( tracing back the Blachernae Shroud) because Wilson’s own arguments collapse so completely for lack of evidence. Perhaps a new start here..","date":"2012-06-11","mins":"2:23 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12210","author":"lyfe","post":"In relic worship the relic was exposed once or twice a year for the faithful to see it. Look at the reports of the exposure of the Veil of Veronica in Rome. The faithful expected to see it in full. The more the relic looked like what it was supposed to be the better, that is what aroused the veneration. You did not need to hide the relic away. So why would a Hungarian illustrator try and show it as a symbolic, cryptic, object when he could have shown the Shroud as it was with an image on it? He would reach a much bigger audience if he showed it as it was. It reminds me of Dan Brown ,only a few initiates would have known about this secret relic and they would be given special clues (e.g. The four holes) no one else would know about. So did the llustrator of the Pray Codex belong to a secret cult, passing on a message about the Shroud that he did not dare show as it really was? We must look out for examples of art where there are four holes in a L shape, put them together in a story and then we will have a new Dan Brown bestseller! The Knights Templar and the Holy Grail will be fitted in there somehow as in any good medieval mystery! We must remember what has been established: that this was the idea of Ian Wilson who certainly knows nothing about medieval art and iconography. If Charles Freeman is right Ian Wilson does not even know when Byzantine art begins. It is not an idea which comes out of a reputable department of medieval art. So the same question repeated: why do people follow Ian Wilson?.","date":"2012-06-11","mins":"10:37 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12223","author":"lyfe","post":"Well, if you need a magnifying glass to see it, that rules out anyone seeing it before the age of magnifying glasses. You completely fail to answer the basic question, why could the Shroud not be shown as it really was if the illustrator of the Pray Codx was wanting people to know it existed. And why was it considered as, or more, important than the many thousands of other first centrury relics that were being displayed troughout Europe at this time? The Turin Shroud is a reality, the theories about where it was when and how we know this are largely fiction unless and until better supporting evidence is found I have no objections to accepting this evidence but some reputable scholar has to actually provide it!. I am waiting! This is a desperate and weak attempt to show that the Shroud existed before the carbon 14 dating – if it is the best anyone can do, it is hardly convincing..","date":"2012-06-11","mins":"1:00 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12220","author":"lyfe","post":"No, Max, I am not expectng anyone to follow me because I am not putting forward any theory. All I am saying is that as someone who knows a little about medieval art ( for instance, unlike some , I knew that the tomb and the tomb lid were being shown and that these patterns were not the weaving of the Shroud), I cannot see the Turn Shroud in this Codex. I have listened to those who say they can but they have not convinced me of anything. As I have said from the very first, I cannot understand why anyone sees the Shroud here. You have had lots of chances to prove your point but you have failed and your arguments seem to get weaker every time you try. Then I ask who first thought of this idea and all anyone can come up with is Ian Wilson who is not an art historian. So I am just left where I started, completely unconvinced that anyone has proved that one relic of many thousands known in the Middle Ages is to be seen here but only by those who can spot it. It seems to me that this is a desperate attempt to find the Turin Shroud somewhere. Have you ever thought that the Turin shroud was not seen to be important by anyone because there were so many other relics that had greater prestige, like the Cross, the Crown of Thorns, the Blood of Christ, the Veil of Veronica and hundreds of others? These are all well documented and the crowds followed them. No crowds are reported for any shroud. The most important Shroud was at Cadouin where the abbey grew rich from the pilgrims visiting it. ( Now, of course, we know it is a fake but ,like the Turin Shroud ,it was a large piece of cloth, made ,in this case, by workhops in the Muslim east.) The Turin Shroud is a relic cult of today ,not one of the medieval ages we would have known more about it if it had been and it would have een illustrated properly a large cloth with a double image of a dead man with a beard on it. Otherwise what is the point of playing Dan Brown games?.","date":"2012-06-11","mins":"12:00 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11827","author":"lyfe","post":"So we have one name of a medieval art historian, Thomas de Wesselow. Then we look up his book The Sign on Google and everyone thinks he is writing nonsense about the Shroud. He is not respected by anyone. So please can we have the real experts who can tell us that they can see the Shroud in the Pray Codex. I have googled Pray Codex too and I can find the art historian in Wikipedia who has argued against the Shroud being seen on the Codex but no art historian who can see it. I think the art historians are not even prepared to think about it as they can see no evidence of the Shroud and know that this shows Christ being buried as he is in other Christian paintings and the customs of the medieival times when the hands were crossed., Are you all experts, if not please give us some who know something different!.","date":"2012-06-03","mins":"12:52 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11849","author":"lyfe","post":"There is already the link on this blog to Charles Freeman’s article on the Shroud. It is important for anyone who says you have to be open minded to read it and it is very interesting. When he discusses the Pray Codex he says that they were burying people as Christ is shown on the Pray Codex all over Europe many centuries before the Pray Codex. So the Turin Shroud cannot have inspired all these burial pictures that daveb talks about...","date":"2012-06-03","mins":"1:17 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11872","author":"lyfe","post":"It seems to be even between those who cannot see anything like the Shroud of Turin in the Pray Codex and those who can ,even if they cannot explain why the artist cannot simply show the Shroud in clear detail. The ‘yes’we can spot the Shroud’ team have not been able to show why the Shroud was considered so important when there were so many thousands of much more prestigious relics. Please read Charles Freeman’s article the Crown of Thorns was so much more important as was the real blood of Jesus and pieces of the Cross and the Holy Lance. Why do you think the Shroud was more important than these? I know Freeman is a historian who is criticising another historian ,Ian Wilson , and I am sure that there will be good debates on this, but his ideas seem relevant here too. This debate has surely got nowhere. I still wait to hear of a respected art historian who can see the Shroud in the Pray Codex! P.S. From what I know about textiles, it would be very rare for linen to last two thousand years unless it was in a very dry climate such as Egypt. I don’t see much in this debate from anyone who has worked with textiles and knows this really big problem!.","date":"2012-06-04","mins":"2:30 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11954","author":"lyfe","post":"So you guys are still arguing! Who can see a large cloth with an image on it anywhere here? A tomb lid as seen in many other pictures with a pattern of steps on it is said to be a picture of weaving. But why is the way the weaving is done important it has nothing to do with the relic and is the last thing you would see. The image would come first. Then the Charles Freeman article shows that people were being buried like this in the sixth century. Had they seen the \\Turin Shroud all over Europe by then? You must have magic glasses the rest of us don’t have if you can see the Shroud. There is not even any evidence that anyone saw a shroud as important as a relic when compared to the relics of the Cross and the Crown of Thorns. Haven’t you got carried away with the Shroud?.","date":"2012-06-05","mins":"4:49 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11973","author":"lyfe","post":"Can those who can see the Shroud in the Codex ,please explain why it is the weave that is important? When you see the Shroud exposed can you see the weave at all? Why would the artist want to show it and not the image? By this time, it was not a special weave as this was a great age of European weaving. Anyway the markings on the tomb lid are not a weave , unless you have the special glasses you are given if you are a supporter of the Shroud. No sign yet of a respected art historan who can see the Shroud in the Codex!.","date":"2012-06-06","mins":"12:49 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11796","author":"lyfe","post":"I hadn’t even heard of the Pray Codex until recently. Whoever came up with the idea that the Turin Shroud could be seen in it? Where might the Shroud have been seen and why would it not have been copied directly in the pictures?. This just seems to be a poor piece of medieval art which is drawing on conventions from more sophisticated works. Christ is just being shown buried in a way that Christians were buried in the Middle Ages and the pattern on the tomb has nothing to do with the weave of the cloth and why would you want to venerate the weave and not the image which could have been put there if the artist had wanted to. It is amazing how some people see things the rest of us can’t!.","date":"2012-06-02","mins":"6:42 am","url":"https://shroudstory.com/2012/05/27/jones-on-the-hungarian-pray-manuscript-codex-as-discussed-in-wikipedia/","cat":"art","title":"Jones on the Hungarian Pray Manuscript Codex as discussed in Wikipedia"}]
