[{"id":"comment-73985","author":"lyfe","post":"Haven’t contributed anything to this website for ages and it seems that the same old debates are going on.. And on, with very little light on the issues. But it does seem that people like Hugh are working through some of the deadwood and making those who believe that the case for the authenticity of the Shroud is watertight tighten up their act. That can only be healthy! perhaps i ought to tune in more!.","date":"2014-01-21","mins":"4:38 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74729","author":"lyfe","post":"Am I right in following Charles’ logic as follows? In order to achieve a medieval date for a first century cloth, the reweave must have made up at least sixty per cent of the total sample. Cotton only made up at most twenty per cent of the reweave (Thibault Heimberger’s research) and so eighty per cent of the reweave must have been linen. But linen does not take dye so in principle the ‘new’ linen would have looked different unless the weavers used yarn that was indistinguishable from the original linen. But if they had found yarn that was indistinguishable then they would not have needed to add dyed cotton to it, especially as that would have made it more unlikely that the reweave would have remained invisible. So the cotton is likely to have drifted in as fibres as was the original claim of the textile expert Gilbert Raes and not been added by the invisible weavers. In addition Charles seems to argue that it would have been impossible to have dyed fibres of cotton or cotton that was bonded with linen as Thibault claims it was. So Rogers was wrong to call the added material he found a dye because it is impossible to imagine a scenario where cotton would have needed to have been dyed. But it could have been a sealant covering this whole area of the cloth to protect it. Have I got this right? I am looking forward to hearing some responses..","date":"2014-01-26","mins":"6:57 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74091","author":"lyfe","post":"And I see that Ian Wilson rejects reweaving as well according to pages 129 onwards of his 2010, The Shroud. So it seems that Hugh has some quite impressive support on his side..","date":"2014-01-22","mins":"11:11 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"}]
