[{"id":"comment-208190","author":"lyfe","post":"I am not sure how radiation ever got into it in the first place. The way that Di Lazzaro is heading, It could only have been some kind of supernatural event but that would not explain why the images are of a dead body rather than a transformed or transforming one radiating energy.The present Shroud does not offer any clue as to the fact of the Resurrection the body is still dead. I can’t find anything that Di Lazzaro has written that helps me here but you know his work better than I do..","date":"2015-08-13","mins":"4:47 pm","url":"https://shroudstory.com/2015/08/11/tantalizingly-close-enough/","cat":"article","title":"Tantalizingly Close Enough?"},{"id":"comment-208231","author":"lyfe","post":"Louis/ Thomas/Hugh thanks.. I can see why the Shroud is such a mystery when there is even controversy over some of these basic issues. Interesting though trying to sort it out..","date":"2015-08-14","mins":"4:47 am","url":"https://shroudstory.com/2015/08/11/tantalizingly-close-enough/","cat":"article","title":"Tantalizingly Close Enough?"},{"id":"comment-208148","author":"lyfe","post":"I have some problems,which I am sure that hose who have been working on the Shroud for many years can help answer. 1) From what I read, Di Lazzaro’s experiments have lasted over several years but he has not reproduced the images. He says that he now knows what would be required to do so and it seems beyond the bounds of possibility. So might it be that we can call it a day for radiation as a cause of the image? If so this would be scientifically important. 2) Some people talk as if the images were caused by the Resurrection but the images are not of Christ going through a Resurrection they are pre Resurrection images. 3) If there is human blood on the Shroud, where does this fit in with the images, radiated or otherwise? What is the best thinking of when the blood came onto the Shroud, before or after the images? obviously the blood cannot be the result of radiation so how can it be separated out from the rest? 4) Where does the funding for all this work come from? it seems to have taken up a lot of resources at a prestigious laboratory or perhaps it is after hours work..","date":"2015-08-13","mins":"8:16 am","url":"https://shroudstory.com/2015/08/11/tantalizingly-close-enough/","cat":"article","title":"Tantalizingly Close Enough?"},{"id":"comment-208182","author":"lyfe","post":"Thanks, Hugh and Louis. It will be interesting to follow up more on Dr.Lazzaro. Not sure I am up to church politics on this one though. What does Di Lazzaro want to do that the Church does not want him to do? Can’t he just get on with his experiments even if they haven’t created anything positive so far they don’t seem to need access to the Shroud itself. Will need to get on with the reading to find out. If the apostle Paul is right, that the Resurrection was the transformation of Christ’s physical body into a spiritual body, then the Shroud does not show that but something before that. So I presume the images could not have been from a source of energy created by the body as it was being changed into a spiritual form as they would not have come out in the static form we have now. They would have shown something of the life that the apostles saw. Will get reading. Thanks for the suggestions..","date":"2015-08-13","mins":"2:28 pm","url":"https://shroudstory.com/2015/08/11/tantalizingly-close-enough/","cat":"article","title":"Tantalizingly Close Enough?"}]
