[{"id":"comment-17873","author":"slowvehicle","post":"Ron : I won’t comment on Rich’s inabilities to answer your questions, but I will comment on the lack by anyone of the “rational scholars and enthusiasts” you mention to do their own ‘research’ on the matter… Why depend on poor Rich! These wnthusiasts cannot read for themselfs? For most on that site, i have noticed, have this type of understanding; quote; “The evidence for the shroud being a medieval fake is far too strong and homogeneous to be doubted by a few scraps of dubious pseudo science.” unquote. If that is not the most rediculously stupid comment I have ever heard, I don’t know what is, and goes to show the actual lack of intelligence offered by anyone there. It is useless even trying to discuss any logic with these Neanderthals, yet Richard cannot see this and is just wasting precious time on the effort, as I have just done here responding to just another Neanderthal. R Thank you for your “kind and rational” post. Truly, the forces of good are blessed to have you wielding the banner of .Truth™, and across such thin ice… What explanations do you offer for the homogeneity of the carbon dates? For the lack of witness to any “patch” by any researcher or expert who has actually, and demonstrably, handled the cloth? For the lack of any suggestion of a way in which the tested area might have been patched, not just in such a way as to fool a host of scholars, but in such a way that mixing of extraneous material would produce three concordant dates in three different labs? Do keep in mind that “I want it to be so” is not an explanation… I do not “depend on” Jabba for my research–but as with all such things, it is the burden of the claimant to support his claims. The cloth is a medieval artifact. To overcome that evidence, evidence is needed…not supposition, not remote chance, not third hand character assassination–evidence..","date":"2012-10-19","mins":"12:22 pm","url":"https://shroudstory.com/2012/07/27/savage-treatment-in-randi-land/","cat":"carbon_14_dating","title":"Savage Treatment in Randi Land"}]
