[{"id":"comment-213904","author":"ekmcmahon","post":"I believe that Jesus Christ arose from the dead. The Shroud is a proof of that..","date":"2015-10-30","mins":"4:54 am","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-214057","author":"ekmcmahon","post":"I am in no way a scientist as a matter of fact in reading , or should I say try to read, some of the comments that a lot of the science types have put here to others of the same science trained minds – I am totally off and end up skipping a lot of the comment as it is as reading a foreign language because it is. In my mind, the Jesus body that slid through the Shroud is the same Jesus that died but his body was totally reconfigured, that is one reason he asked or told St, Mary Magdalene not to touch him. I think it will take a miracle on our human part to fully explain just how every facet of the image was produced. We will have to know more about what God is composed of. Jesus changed from the Human body/God Soul to the God Physical Body/God Soul..","date":"2015-11-01","mins":"6:56 am","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-86130","author":"ekmcmahon","post":"My 2 cents worth, when Jesus was placed onto the Shroud, after he had been lightly cleaned, the Shroud was lightly over the top of his head and placed onto the front of his body. The shroud was not “wrapped tightly or snuggly around this head. When you look at front image of his head, you can see his hair above the forehead for a few inches then the front image stops and the back image starts and all you see his hair and the image of the skull impression through the hair. It all has to do with how much pressure was exerted while placing the Shroud on his head and the front of his body. They were very respectful while putting him “in” the Shroud (or puting the Shroud around him). I hope this made sense,.","date":"2014-03-08","mins":"4:36 am","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-212273","author":"ekmcmahon","post":"I don’t recall which article or how many years ago that I had read that the body of our Lord Jesus was lightly cleaned just before his burial. There was/is still some dirt from his feet on the bottom of the Shroud. Apparently the body was still oozing some blood a minor amount of bodily fluids water, oils etc..","date":"2015-10-11","mins":"4:25 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","title":"Was Jesus’ Body Washed?"},{"id":"comment-187163","author":"ekmcmahon","post":"As I have said before, I am not a scientist. I know what I see and have read on these Shroud sites. What I have read is that the DNA from the blood samples removed from the Shroud are all the same. I find it doubtful that a “helpful” Monk several hundreds of \\years ago did some touch up work and just happened to use the same DNA matching blood type. My insides tell me that it is just as Jesus Christ left for us as a reminder of who he is and what he did for us..","date":"2015-01-29","mins":"5:45 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"}]
