[{"id":"comment-173689","author":"ekmcmahon","post":"I am rather fond of the pollen trail. There has been found pollen from every geographical location that the Shroud has spent any significant length of time at, including its point of origination..","date":"2014-11-29","mins":"9:21 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"id":"comment-173697","author":"ekmcmahon","post":"A good reason for my last comment – http://www.shroud.com/danin2.htm.","date":"2014-11-29","mins":"9:57 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"id":"comment-98412","author":"ekmcmahon","post":"In “theory” he was supposed to be married to St. Mary of Magdala, Personally, I don’t believe it, why would the Son of God marry. There is no need to. As for priests marrying, Mother Church is their wife and the people are their children if you need to think in those terms. A priest’s life is to be dedicated to God, not a separate Earth family needing the moral and financial obligations being met..","date":"2014-04-11","mins":"2:44 pm","url":"https://shroudstory.com/2014/04/11/funny-that-when-it-comes-to-the-shroud-of-turin-the-carbon-testing-must-be-considered-watertight-scientific-proof/","cat":"carbon_14_dating","title":"Funny that when it comes to the Shroud of Turin the carbon testing must be considered watertight scientific proof."},{"id":"comment-98467","author":"ekmcmahon","post":"Which of the twelve male Apostles or 7 women Disciples who were alive and walked with Jesus wrote a fact about Jesus being \\married?? Just because someone 200 or 400 or 800 or 2000 years after the fact said a word about marriage or wife in the same sentence as the name of Jesus, is not factually stating that Jesus was married..","date":"2014-04-11","mins":"7:23 pm","url":"https://shroudstory.com/2014/04/11/funny-that-when-it-comes-to-the-shroud-of-turin-the-carbon-testing-must-be-considered-watertight-scientific-proof/","cat":"carbon_14_dating","title":"Funny that when it comes to the Shroud of Turin the carbon testing must be considered watertight scientific proof."},{"id":"comment-204831","author":"ekmcmahon","post":"I am one of those who don’t believe that any type of hacking was necessary as the small part used was from a small part of a stitched on repair job..","date":"2015-07-07","mins":"5:15 am","url":"https://shroudstory.com/2015/07/07/the-hacking-of-the-carbon-dating-wikipedia-and-the-media/","cat":"conspiracy_theory","title":"The Hacking of the Carbon Dating, Wikipedia and the Media"},{"id":"comment-206432","author":"ekmcmahon","post":"I totally disagree with the article especially the angle it is pointed to. All of the research to date has been pointing to one thing and that is that the Shroud is the cloth that our Lord Jesus Christ was ‘wrapped’ in grave in. The big question that science has, in my opinion, is how did God do it ?? Science wants to learn the in’s and out’s of the procedure so that they can become as gods. That is even covered in the Scriptures. The research pointed to the middle age repair work and the fact that the Carbon 14 dating was done on a repaired portion of the cloth. My main concern is the number of people who do not accept the ‘99%’ that proves what the Shroud is but are die hards in accepting the ‘1%’ of the what the Shroud isn’t. It seems to me that the Shroud points to the fact that Jesus Christ arose from the dead and that fact is just too hard for people to accept. There is a date and time for every living human on the Earth to face the facts..","date":"2015-07-23","mins":"7:11 pm","url":"https://shroudstory.com/2015/07/23/if-they-had-only-waited-until-2020-or-so/","cat":"carbon_14_dating","title":"If They Had Only Waited Until 2020 Or So"},{"id":"comment-174122","author":"ekmcmahon","post":"I fully agree..","date":"2014-12-01","mins":"7:04 am","url":"https://shroudstory.com/2014/12/01/paper-chase-the-origin-of-rogers-raes-and-c14-samples-by-thibault-heimburger/","cat":"paper_chase","title":"Paper Chase:   The origin of Rogers’ Raes and C14 samples by Thibault Heimburger"},{"id":"comment-94625","author":"ekmcmahon","post":"This is my comment for all of the Shroud’s blogs. What is it about the fact of the Shroud being the actual burial cloth of Jesus Christ that scares the hot poop out of people???.","date":"2014-03-29","mins":"3:49 pm","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","title":"Stephen Jones’ Revised Hacking Theory Part I is Available"},{"id":"comment-206848","author":"ekmcmahon","post":"Out of politeness, I won’t YAWN !.","date":"2015-07-29","mins":"6:55 am","url":"https://shroudstory.com/2015/07/29/the-hacking-of-the-carbon-dating-over-and-over-and-over/","cat":"carbon_14_dating","title":"The Hacking of the Carbon Dating Over and Over and Over"}]
