[{"id":"comment-210857","author":"ekmcmahon","post":"I have no knowledge of cloth/fabric etc. Except that I wear them, cotton tee shirt etc. (I guess I like the abbrev. Etc.) All in all what grabbed my attention are the wrist wounds and then when I was looking at the eyes in the photos trying to see the coins that folks are talking about and all I could see was the possibility of one of the eyes open so that one pupil was visible and then something seemed to grab me in the inside of my head and I heard the voice of my Guardian Angel tell me that I was seeing the image of the living Jesus Christ. I had heard my Guardian Angel before in my life, 1st time was When as a kid and drowning in a lake and I knew I was in trouble looking up in the water and seeing the surface above me but not able to do anything to pull myself up there. He told me to say my prayers because I was going to die. I was confused as I understood the words, didn’t know where they came from but I knew I was in serious trouble and I knew a couple of prayers but not sure which one to say and he started saying the ‘Lord’s Prayer’ or as some call it the ‘Our Father’ so I continued to say it in my mind then I saw something that looked like pinkish or reddish or ?? colored clouds and had what is now called an NDE. The I remember being told that this is all I will remember and I see what looked like a movie of me being mad at a friend and hitting him, then I saw the field next to our home that was in a different state but we were on vacation in Indiana. Next thing I know is I’m laying on a beach towel on my stomach, my head on my arm and the towel under my head and on my hand is wet with water and snot (mucus), I was alive. My older brother had swam out and pulled me out of the lake and did CPR on me. The next time was when I was nearing my tour in the Marines and I was considering re enlisting as I had been told a couple of times by Sergeants that I would be promoted to Sergeant when I shipped over (re enlisted), my Guardian Angel told me on 2 occasions a few days apart not to re enlist but I just kind of ignored him. Then one day when my enlistment was due to end, I was reminded by one of the senior Sergeants that I had better get upstairs to the personnel office and tell them I was ready to re enlist. The Sergeant walked away and I started to walk to the door out of the office I was in to go upstairs and in a loud voice inside my head I heard “DO NOT RE ENLIST” I did not re enlist, I got the message. This was in mid February 1964. Does Viet Nam ring a bell. I learned to pay attention to that seldom heard voice..","date":"2015-09-21","mins":"6:53 am","url":"https://shroudstory.com/2015/09/21/another-overwhelming-evidence-argument/","cat":"history","title":"Another Overwhelming Evidence Argument?"},{"id":"comment-189327","author":"ekmcmahon","post":"I can hardly wait, I am hoping that we get a reminder about a week or so before the 1st telecast..","date":"2015-02-05","mins":"7:24 am","url":"https://shroudstory.com/2014/04/15/cnns-jesus-code-six-objects-connected-to-the-biblical-jesus/","cat":"history","title":"CNN’s Jesus Code:  Six Objects Connected to the Biblical Jesus"},{"id":"comment-207021","author":"ekmcmahon","post":"I found this interesting, it is rather difficult for me to wrap my head around this. I’ll have to watch this and read the written version..","date":"2015-07-31","mins":"6:33 am","url":"https://shroudstory.com/2015/07/31/is-the-shroud-the-inspiration-for-the-holy-grail-legends/","cat":"history","title":"Is the Shroud the Inspiration for the Holy Grail Legends?"},{"id":"comment-143065","author":"ekmcmahon","post":"Https://search.yahoo.com/yhs/search; ylt=Ap Qci Swm Q Tx23j9q Ni7 KF Kh.l VM6?p=Roman+torture+scourging+%3 F&fr=ush mailn 02&hspart=att&hsimp=yhs att 001&type=yahoo pc mail.","date":"2014-08-09","mins":"2:36 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-214082","author":"ekmcmahon","post":"I have to write of my ignorance here. I have not heard of this before. Are we to think of this as being like a tee shirt that Jesus would have worn under his robe during the period of the Passion and all the related torture he went through until the actual Crucifixion ? I think I know of the Robe he wore as my older brother (God bless his soul) was in a high school play in a public school back late ’40s or early ’50s titled “The Robe”, I recall it had something to do with Jesus Christ is all I know..","date":"2015-11-02","mins":"3:55 am","url":"https://shroudstory.com/2015/11/02/the-confusing-holy-tunic-of-argenteuil/","cat":"history","title":"The Confusing Holy Tunic of Argenteuil"},{"id":"comment-214377","author":"ekmcmahon","post":"Who had a nightmare one night and dreamed this story up ? Is this in celebration of the Trump guy hosting SNL ? It makes as much sense..","date":"2015-11-08","mins":"3:02 am","url":"https://shroudstory.com/2015/11/08/what-am-i-missing/","cat":"history","title":"What am I missing?"}]
