[{"id":"comment-211652","author":"ekmcmahon","post":"This is fantastic but it is a lot for folks like me to digest at one sitting..","date":"2015-10-02","mins":"5:56 am","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"id":"comment-211248","author":"ekmcmahon","post":"I enjoyed the article, it was the 2 clickables and the Q & A that made the article great. I guess I should say that I greatly enjoyed the article. I have been a believer in the Shroud as being a Gift from God for quite some while now..","date":"2015-09-26","mins":"5:48 am","url":"https://shroudstory.com/2015/09/26/the-vp8-cinderella-question/","cat":"3d","title":"The VP8 Cinderella Question"},{"id":"comment-210510","author":"ekmcmahon","post":"For some reason, my system does not like the clickable article as presented in the beginning of the article. It tells me to reset some of my settings and retry it. ?? I won’t do that..","date":"2015-09-16","mins":"5:06 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","title":"Faint Images:  The Case of the Shroud of Arquata"},{"id":"comment-172491","author":"ekmcmahon","post":"Yes I agree, the image is made at the instant that the supernatural soul of Jesus Christ enters into hi physical body and that is what cause the color image that surrounds the body image of Christ, He then awakens in his newly empowered physical body and resurrects..","date":"2014-11-22","mins":"5:41 am","url":"https://shroudstory.com/2014/11/22/image-of-the-resurrection/","cat":"image_theory","title":"Image of the Resurrection?"},{"id":"comment-200768","author":"ekmcmahon","post":"Why do some folks just have to go out of their way in an attempt to destroy the Christian faith ? As I have said before, I am not a scientist but I do know how to read and think. I am more than happy accepting the proof that has been published that proves that the Shroud is the burial cloth of Jesus Christ and he resurrected on the 3rd day. Also as I have said before while I was reading one of the articles and was studying and comparing the online photos, I was told by my Guardian Angel that I was looking at images of the risen living Jesus Christ. The image was imprinted by the living Devine Soul as it re entered and re constituted the body of Jesus the Christ..","date":"2015-06-01","mins":"7:18 am","url":"https://shroudstory.com/2015/06/01/is-charles-freeman-emerging-as-the-worlds-leading-shroud-skeptic/","cat":"image_theory","title":"Is Charles Freeman Emerging as the World’s Leading Shroud Skeptic?"},{"id":"comment-94616","author":"ekmcmahon","post":"In the main of my mind, lf God is a fake then the Shroud is a fake, I’m not an Atheist..","date":"2014-03-29","mins":"2:58 pm","url":"https://shroudstory.com/2014/03/29/so-even-without-knowing-how-the-shroud-was-faked-its-obvious-that-someone-did-fake-it/","cat":"image_theory","title":"So, even without knowing how the shroud was faked, it’s obvious that someone did fake it?"},{"id":"comment-155001","author":"ekmcmahon","post":"A scientist nor artist am I. The image I see here does not does not have anything but same shape and resemblance of what I have seen on the internet of The Shroud..","date":"2014-09-24","mins":"9:13 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"}]
