[{"id":"comment-205468","author":"ekmcmahon","post":"What was the purpose of the Lirey/Turin body imprinted envelope then ?.","date":"2015-07-13","mins":"5:05 am","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","title":"Beg Your Pardon (Comment Promoted)"},{"id":"comment-205233","author":"ekmcmahon","post":"As a believer I think that the topic of the Shroud is serious as it is the Lords gift to us, A few parts of the article actually made me chuckle. In my poor worded opinion, haters of Jesus are a weird group of people, there is a day coming that they will learn their of their error. As a kid, I had an NDE when I almost drowned and as an adult I have researched them, read many experiences of others. All of us will have that true experience in our time. There are many people who doubt ND Es. Look up NDE research in any search engine. There are even ND Es reported by people of most of the religions documented..","date":"2015-07-11","mins":"6:52 am","url":"https://shroudstory.com/2015/07/11/ignorance-with-wings/","cat":"other_blogs","title":"Ignorance with Wings"},{"id":"comment-155700","author":"ekmcmahon","post":"I really enjoyed the article. I am one who likes to stay a top on some of the news especially local and world. It still scares me at my age of 73 to see the amount of peoples refusal to learn the truth of the world and daily living..","date":"2014-09-25","mins":"6:10 am","url":"https://shroudstory.com/2014/09/25/mars-weeping-mary-and-the-shroud/","cat":"other_blogs","title":"Mars, Weeping Mary and the Shroud"},{"id":"comment-205928","author":"ekmcmahon","post":"I have enough of a problem dealing with inches and centimeters then we have to add the cubit to my un math mind to quickly calculate..","date":"2015-07-16","mins":"5:07 am","url":"https://shroudstory.com/2015/07/16/maybe-a-not-so-startling-coincidence-of-something-that-is-approximate-and-presumably-averaged/","cat":"other_blogs","title":"Maybe a Not So Startling Coincidence of Something that is Approximate and Presumably Averaged"},{"id":"comment-191024","author":"ekmcmahon","post":"I have read some of the highlighted article above from the Science Buzz blog. The contents of the blog are reflective of the non believers who have make comments in the many Shroud blogs. It is apparent that there is one in the Universe who will do anything to dissuade people from believing that our Lord Jesus Christ was Resurrected from the dead after being physically murdered by non believers some 2,000 years ago. The Shroud is a scientifically provable solid piece of evidence of that Resurrection. It is a gift from our God to us. It is not just words written down on a parchment and recopied. It is a part of the original fact..","date":"2015-02-14","mins":"7:08 am","url":"https://shroudstory.com/2015/02/14/on-deaf-ears-here/","cat":"other_blogs","title":"On Deaf Ears Here?"},{"id":"comment-206450","author":"ekmcmahon","post":"Jesus Christ is not just in our Christian hearts, but think about the Muslims who have had dreams about Jesus talking to them and then they convert to Christianity, you know the risk they are taking to do that. How about the folks who have been in a hospital, have died in the bed or wherever, seen the nurses and doctors working on them and then during the NDE went through some type of tunnel? and ended up in Heaven and meet Jesus Christ and then being told they had to go back and finish their life here. Later explaining to those nurses and doctors what they observed and finding out that they had died and were brought back to life during that period of their ‘trip’. There are actual documented cases in NDERF files and some are most current. Look them up on the internet and you can make phone calls to verify the info in the data..","date":"2015-07-24","mins":"3:49 am","url":"https://shroudstory.com/2015/07/24/so-long-as-there-are-questions/","cat":"other_blogs","title":"So Long As There Are Questions"},{"id":"comment-213881","author":"ekmcmahon","post":"Gee, almost makes you want to think that the Shroud is the real Shroud of Jesus Christ, huh?.","date":"2015-10-29","mins":"10:34 pm","url":"https://shroudstory.com/2015/10/29/splish-splash/","cat":"comments_promoted","title":"Splish Splash"}]
