[{"id":"comment-195165","author":"ekmcmahon","post":"This should be a very interesting program..","date":"2015-04-02","mins":"5:05 am","url":"https://shroudstory.com/2015/04/02/barrie-schwortz-to-appear-on-coast-to-coastradio/","cat":"news_&_views","title":"Barrie Schwortz to Appear on Coast to CoastRadio"},{"id":"comment-96354","author":"ekmcmahon","post":"Don’t get me wrong as I am not insinuating anything here. It is possible to take a photo of an image or anything, “doctor up” the photo then reproduce the “doctored” photo and say it is an original photo. I have not seen or observed all of Barrie’s works but I highly doubt that he would resort to flim flaming this. Especially with him being Jewish and this being a Christian Miracle Relic..","date":"2014-04-04","mins":"12:02 am","url":"https://shroudstory.com/2014/04/03/barrie-schwortz-so-why-is-a-good-jewish-boy-like-me-doing-this/","cat":"news_&_views","title":"Barrie Schwortz:  So why is a good Jewish boy like me doing this?"},{"id":"comment-43203","author":"ekmcmahon","post":"I read the article and unless I missed it, I don’t really see much to tie it together with Christ’s Shroud..","date":"2013-09-07","mins":"7:02 pm","url":"https://shroudstory.com/2013/09/07/rest-in-peace-dr-frederick-zugibe-1928-2013/","cat":"news_&_views","title":"Rest in Peace  Dr. Frederick Zugibe (1928-2013)"},{"id":"comment-43242","author":"ekmcmahon","post":"I am not a scientist, I only know what happened to me when I looked at the photo as I have said before. That is a miraculous image of the dead Jesus Christ just as his Divine Spirit was entering his earthly body just before his Resurrection. The debate about how the image was made on the Shroud may go on forever if man wants to know Gods Divinity and how it works..","date":"2013-09-08","mins":"12:53 am","url":"https://shroudstory.com/2013/09/07/rest-in-peace-dr-frederick-zugibe-1928-2013/","cat":"news_&_views","title":"Rest in Peace  Dr. Frederick Zugibe (1928-2013)"},{"id":"comment-92745","author":"ekmcmahon","post":"Best of my recollection, all of the pictures of paintings of Jesus Christ on the Cross have him with the nails in the palms of the hands, the Shroud has the blood markers where the wrist would be. In my mind, this takes the human artist out of the picture..","date":"2014-03-24","mins":"2:15 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin"},{"id":"comment-210981","author":"ekmcmahon","post":"I – almost – find it amusing that a helper of Lucifer would be looking for Holy Objects or anything representative of The Father Almighty to give them help in attaining their ill wanted desires. It is a true “the devil made me do it”..","date":"2015-09-23","mins":"5:05 am","url":"https://shroudstory.com/2015/09/23/russ-breault-at-the-university-of-north-carolina-at-charlotte-next-week/","cat":"presentation","title":"Russ Breault at the University of North Carolina at Charlotte Next Week"},{"id":"comment-173264","author":"ekmcmahon","post":"Thank you for this article. It is, in my mind, very descriptive of what the image on the shroud is, I probably should not repeat what I had had said in a previous comment but I will in as few words as possible. Sometime back, I’ll say a couple of years I was reading an article on the 3 D Imaging work that was done and as I was looking at the cleared image – after the explanatory marking were removed from the 3 D image, the picture on my computer screen seemed to deeply focus my attention to the face. It was as if I was mesmerized. I heard a voice inside my head that I recognised as my Guardian Angel. I had heard that voice a couple of times earlier in my life, My first recall was when I was about 9 or 10 years old and was in the process of drowning at a small beach at a lake in Indiana. I recognised the fact that I was in trouble as I did not know how to swim and I was in deep water (10 or so feet deep) and I could not get to the top of the lake and breath or walk out. The voice told me “You are going to die, say your prayers”. I was confounded, because as a young Catholic boy I knew a few prayers but did not know which one to say to myself. The next thing I know is that I am saying the ‘Our Father’ ( also known as the The Lords Prayer”) to myself. I then recall seeing an image of the field that was nest to our home in Michigan where I used to play. I was then told by the voice “This is all you will remember”. I then consiously recall laying on my stomach on a beach towel and the towel under my face is wet with water and a large glob of snot or mucus from my nose and my older brother is pushing on my back. (performing CPR). I was alive. My brother was 10 years older than me and had swam out and pulled me in. I deduced many years later that the image of the field and the worlds of “That is all You will remember” was an NDE that I was to forget except for a little bit of it. The next memorable event of the voice was when my 4 years of active duty in the USMC was coming to a close and I had been reminded by senior Marines that I should re enlist and when I did I would be promoted to Sgt. E 5. I was a Cpl. E 4 at the time. A few minutes after I was told this and I was by myself in my corner of the office, I heard the voice again and it said”Do not re enlist”. I just ignored it and went about my business. A couple of days later the same thing happened, a senior Cgr reminded me of what they had said before. Again I heard the voice repeat the same words “Do not re enlist” and again I just went about doing my work. A couple of days later, the Sgt. Came to me again an\\d told me to go and get my re enlistment paperwork started. And he left me. I was thinking about and the advantages of being a Sgr but I heard the voice for the 3rd Time and it seemed louder and very firm “DO NOT RE ENLIST”. I decided that it meant business and I did not re enlist. This happened in Feb. 1964 and I pretty sure that you recall the Vietnam War and the roll that the Marine Corps played it. I was released from active duty on Feb. 18th 1964 and got married a few months later. Back to the Shroud. And the voice, it said to me words to the effect “This is the picture of the living Jesus Christ”.. So I am sure that the Shroud is the actual Burial Cloth of Jesus Christ..","date":"2014-11-27","mins":"4:53 am","url":"https://shroudstory.com/2014/11/26/fr-otterbein-discussing-the-sturp-examination/","cat":"science","title":"Fr. Otterbein Discussing the STURP Examination"}]
