[{"title":"Paper Chase: The Findings of Robert Bucklin","post":"I always say that the authenticity of the Shroud come mainly from those pathological aspects that are present on the cloth and that a forger (from any period of time) wouldn’t be able to reproduce with such a high degree of precision.  Bucklin, Barbet, Baima Bollone, Zugibe, etc. can disagree on some specific medical details but in the end, they ALL agreed that there was really a dead man in the Shroud and that this dead man shows all the wounds of Christ and also that this dead man didn’t stayed there for more than 36-40 hours because there’s no signs of putrefaction.  I think this is the main evidence that the Shroud is not the work of a forger.  And the question that we’re left with is this :  If it’s not the work of a forger and that the Shroud is really an authentic burial Shroud, if it’s not the Shroud of Jesus, then, who the hell was buried in this cloth ? \nAnd to me, the fact that many pathologist have analyzed the Sudarium of Oviedo and came up with the conclusion that it shows the signs of a pulmonary edema is a very good point in favor of the authenticity of this cloth.  How can a forger from the 7th or 8th century (the date given by the C14 test for the cloth) would know how to reproduce stains that came from a pulmonary edema ?  And how he could knew that a victim of crucifixion would normally suffer from this kind of lung problem because of a progressive state of suffocation ?  Remember that the crucifixion was banned in the 4th century…\nTo me, the very precise physiological details that we see on both the Shroud and the Sudarium are the biggest signs in favor of their authenticity as 2 genuine burial cloths.  And, if we stay scientifically honest, we can say that those 2 cloths are 2 burial cloths that were PROBABLY used on Jesus-Christ.\n\n","date":"November 11, 2011 at 11:50 am","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4712","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"I agree with most your your points Yannick, except crucifixion did not end in the 4th century, it carried on in alot of mid-eastern societies for centuries afterward. But I would add this is not a ‘qualified’  point against the Shroud’s authenticity, as we do not know if the exact Roman style of crucifixion was carried on by others. I would also like to add that this point is used often by opponents of the Shroud; them saying; “Someone could have just taken any crucifixion victim put him in a Shroud and presto”, but they never seem to have an answer to how this forger created the image or more importantly how they managed the ‘perfectly undisturbed’ blood images.\nAgreably, the Shroud and the Sudarium seem to be perfect pair matchings in many respects and thru pollen evidence, can be traced back to Jerusalem, as far back as the 6th century and beyond.\nR\n\n","date":"November 11, 2011 at 5:37 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4729","author":"Ron","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"I agree.  When I said the 4th century, I was talking about the Roman crucifixion.  I really doubt that some other societies who keep using this punishment did it exactly in the Roman way.  And I’m not sure this kind of punishment was done very often after the 4th century by those other societies…  And if we take the hypothesis that it was a forger who create the sudarium, there would be good chances that he create it in Spain.  And I have great doubts about the possibility that there was still crucifixions done in Spain during the 7th or 8th century.  So, I think my point is still relevant…  Thanks for you comment.\n\n","date":"November 11, 2011 at 7:24 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4736","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Even admitting the main aspects of this approach, the weak point of this theory is why the back image of this man does not show the effects of the body’s weight? I mean, very meaningful details can be explained by the theory of a dead crucified man laying……except the detail of not showing a flattened back. Why the back muscles are not flattened in some way?\nThis is also relevant for the hair which does not correspond to the way one would expect to fall in the case of a man laying on his back. Nevertheless, this could be explained by the fact that this man’s hair was soaked with his own blood/sweat and became rigid. Ok, I could go that far and admit it for the hair.\nBut what about the back muscles?. In my opinion, this poses a major challenge to all the image formation theories (from radiation to chemical reactions) which have not been able to give a convincing answer for this point.\n\n","date":"November 11, 2011 at 2:00 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4713","author":"Gabriel","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Read again point #4 of the list of Bucklin : The body had stiffened in Rigor Mortis.  That’s why the image of the back is so stiff.  If (as I think) Jesus suffered of an acidosis because of the violent scourging and the crucifixion, I think there’s evidence in scientific literature that the Rigor Mortis would have been very intense.  I think it’s also true in the case of someone who die of a progressive state of suffocation…  I think your questioning is very normal and prove that you’re intelligent but I also think there’s some logical and scientifical answer for the problem you mentioned.\n\n","date":"November 11, 2011 at 2:04 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4714","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"And for the image of the hair, I think you already got the answer !!! ;-)\n\n","date":"November 11, 2011 at 2:04 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4715","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"I am not an expert on this field but probably there must be some standard calculations for a body on how much weight it can stand without ANY deformation if rigor mortis is taking place.\nIt must not be very difficult to find these standard figures……. We are talking of a body of about 80-85 kgs. Rigor mortis effect could stand for the fact that the degree of flattening is 0 (not simply “small” or “very small”) and for this reason the back and front images at this point behave the same?.I just make the question because I don`t know the answer but 80-85 kg…..it is in my opinion far too much, so as not to leave at least a very (small) flattening effect. But honestly, I don`t know . I think a scientifically sound answer to this point could be most helpful for a further image formation theories evaluation stage.\n\n","date":"November 11, 2011 at 2:31 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4716","author":"Gabriel","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"It has been implied by most Forensic experts, that the ‘extreme’ stiffness of the body in the Shroud would be due directly to an extremely violent and sudden death. This type of rigor is immediate and very intense, and would undoubtably explain the non-flattening and also the forshortening seen with the image…Nevertheless your question is very interesting, and I would be interested in an expert opinion also.\n\n","date":"November 11, 2011 at 5:48 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4731","author":"Ron","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"I forgot to talk about the question about the back image versus the image formation.\nFirst, I want to say that Miller and Pellicori, in their paper about the UV photos, noted that the back image was slightly denser than the frontal image.  So, for me, it is a sign that the body weight had really an effect on the image formation but it is much more subtle than the scientists would have presumed.  Also, my friend Barrie Schwortz once told me that there is some subtle signs of flattening in the back image.  I don’t know if that observation can be found in scientific literature concerning the Shroud.  In my opinion, if the Rigor Mortis was really intense, I don’t think it is abnormal that the image of the back looks like that on the Shroud.\nAlso, in another paper he wrote for STURP, Sam Pellicori mentioned some experiments of coloration of linen he made with sweat, aloes, myrrh, olive oil, etc.  All those things could have been present on the skin of the man of the Shroud and Pellicori wanted to analyze what kind of result could be produced if these things would be in contact with a linen cloth.  His results were incredible !  He noted that almost all of those products could produce a coloration on linen after a long time (a good point for the latent image hypotheses) with a spectral property very similar to the Shroud body images.  He obtained those results after the baking of his linen samples to simulate aging (a scientific standard procedure).  Also, for some products (especially the sweat if I remember) he note, after simulated aging of his samples, that the spectral results tend to became the same, no matter if he pressed hard the sweat on the linen or just touch it very softly.  For Pellicori, all those results prove that products like sweat, myrrh, olive oil, etc. could, if they are made in contact with a linen cloth, produce a coloration, after a long time, very similar to the Shroud image and that they could account for the lack of notable difference in the color density between the dorsal and the frontal images we see on the Shroud.\nSo, you see ?  Before thinking that the Shroud image necessarily came from a miraculous event (or a by-product of this event), anyone have to read carefully all the results of the analyses of the Shroud made by STURP.  They don’t really point out to a miraculous process of image formation, even if they were not able to found one specific process that could account for the Shroud images.  But that don’t mean this process will never be found in the future !  We have to wait until new series of direct researches will be done because there’s so much that still needed to be done before anyone have the right to discard every single natural possibilities for image formation…  Why do you think the STURP team wanted to do a second series of direct tests on the Shroud in the middle of the 80s ?  Because they were fully aware that there was still a lot of researches that needed to be done on the Shroud.  We still wait for those researches and, personally, I have good hopes that some mysteries will be solved then…\nI know many people here will not be pleased to read my comment but that’s the truth !\n\n","date":"November 11, 2011 at 2:46 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4717","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Don’t get me wrong :  I don’t say that Pellicori found the correct image formation process.  But he proved that some natural process can account for the lack of a big difference in the density color between the frontal and dorsal image on the Shroud…  That’s all I say.\n\n","date":"November 11, 2011 at 3:12 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4720","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Just to understand this point, how did these results you mention account for the 3D effect and the low penetration of color in fibers?\n\n","date":"November 11, 2011 at 3:52 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4723","author":"Gabriel","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"If you look closely at the 3D images of the back image versus the frontal image, it’s pretty evident that there are less 3D informations on the dorsal image.  Go there to see : http://shroud.com/pdfs/aldo1.pdf (especially pages 4 and 5)\nIt is so evident that the 3D information is much more important in the frontal image that John Jackson even pretend that the dorsal image came from a direct-contact only !!!  I think he’s wrong, but that’s another story. \nThis difference in the 3D information between the frontal and the dorsal image is another pretty good evidence that the weight of the body really had a slight effect on the image formation…  For the low penetration in the cloth, for the moment, the best explanation is the one proposed by Ray Rogers in regard of the good probability that the body image came from some kind of a chemical reaction between the dead body and a very thin layer of impurities that reside almost only on the surface of the cloth (the 2 surfaces).  This kind of thin layer (mainly made of many sorts of sugars and carbohydrates) would be chemically more easy to color than the linen fibers themselves.  If the hypothesis of Rogers is correct (and I believe it is), then that would mean that whatever process have produced the body images, it was a VERY MILD process because it wasn’t able to react with the linen fibers but only with this thin layer of impurities…\n\n","date":"November 11, 2011 at 4:30 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4724","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Ok for the low penetration but what about the 3D effect? I mean, how can the intensity of this chemical reaction and subsequent color gradient change with the distance to the body?\n\n","date":"November 11, 2011 at 5:17 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4728","author":"Gabriel","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"I think you put too much faith in Pellicori’s theory, as it’s full of holes and literally proves nothing. 1~ having a ‘similar’ colouring is not the same as being exactly the same-ask anyone. 2~ His theory suggests they had time to cover the ‘complete’ body ‘evenly’ with all the ingredients-MOST IMPROBABLE, especiallly in light that the burier’s had no time for even flowers or coins, as YOU suggest so strongly. 3~ His theory explains nothing to the areas of the Shroud which did not touch the body whatsoever, and in some areas as much as 4cm…Many areas of the dorsal image were not in contact with the cloth, we must remember. If any of these ‘ingredients’ were placed on the corpse, Why was the blood not smeared or wiped off in any way? Or why has no one found any traces of such ingredients on the Shroud? …Like I said, full of holes, if you use common sense.\nOne other thing, I may be mistaken but in reading the STURP conclusions, I don’t remember anyone precisely stating the ‘Dorsal’ image was ‘denser’ in any way to the the frontal image, in fact I keep reading the intensity of the image is equal throughout?.\nR\n\n","date":"November 11, 2011 at 6:22 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4732","author":"Ron","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Read the paper published by Miller and Pellicori and you’ll see that they state this precisely.  So, when a person claim that both images are exactly the same, it’s not totally true.  There are close but there’s a slight sign that the body weight had an impact on the image formation (even if it is much more lightly than they expect).  So, for the pro-levitation, I say this :  READ THIS PAPER ABOUT THE UV PHOTOS !!!!\n\n","date":"November 11, 2011 at 7:29 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4737","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"I’ll try to find the exact reference for you…  Stay tune !  One more comment :  Read again my earlier comment :  Don’t get me wrong : I don’t say that Pellicori found the correct image formation process. But he proved that some natural process can account for the lack of a big difference in the density color between the frontal and dorsal image on the Shroud… That’s all I say.\n\n","date":"November 11, 2011 at 7:46 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4740","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"I also forget to mention that there are clear signs that the body weight played a role in the blood images transfer…  Just an example :  in the transmitted light photos of Barrie Schwortz, we can see more scourge marks on the dorsal image than on the frontal image.  A clear proof that the weight of the body had an impact on the blood transfer and make it easier and deeper on the dorsal part of the Shroud.  By the way, this is a proof that the blood transfer was really a direct contact process (just like any blood transfer between a body and a linen cloth would).\n\n","date":"November 11, 2011 at 3:05 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4718","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Geez Yannick, seriously, ‘clear signs’??? The victim was scourged from the rear! Of course the scourge wounds would be more prominant there, thus showing more ‘prominantly’ on the Shroud. The cloth was ‘draped’ at the front caused by the higher levels of the hands and face, thus very little to no contact on many areas of the frontal image, another reason very little scourge marks should appear on the frontal image!….I have also not read any STURP statements or peer reviewed papers that state the blood was anymore ‘pronounced’ or “denser”on the dorsal image…please point me to this information.\nThanks,\nR\n\n","date":"November 11, 2011 at 6:39 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4733","author":"Ron","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Ask Barrie Schwortz who his the one who took those transmitted light photos !  I ask him the question and it was he who confirm this fact to me :  generally, for the scourge marks, the blood did soak more deeply in the dorsal part of the Shroud.  By the way, I ask him the question after our debate about the scourge marks !!!  So, you see ?  The scourge marks were done NATURALLY by a direct contact between a corpse and a linen cloth.  Nothing strange there…\n\n","date":"November 11, 2011 at 7:32 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4738","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Thanks for your comment Yannick. I will try to read that paper by Miller and Pellicori, After your reply,I understand that -contrary to what has been largely stated by a great deal of persons. newspapers, TV shows and so on- there exists a difference in density between back and front image. This could be rationally attributed to a  small flattening due to gravity but not very intense due to rigor mortis.\nIn my opinion, this is really relevant. When I was thinking on implications for the discussion on image formation mechanisms I was thinking on the theory of an ancient (unknown) photographic method. In case some degree of flattening (or a solid explantion for it) did not exist, the rest of explanatory mechanisms (including chemical reactions) would have a major difficulty while the photographic method would be exhibiting a very important point.  Without this, it can be completely ruled out.\n\n","date":"November 11, 2011 at 3:29 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4722","author":"Gabriel","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"For the hypothesis of a medieval photography, this one was proposed by a guy named Nicholas Allen.  Barrie Schwortz, who is a professionnal photographer wrote a very good article about this where he exposed all the problems regarding this hypothesis.  You can read this article from Barrie here : http://shroud.com/pdfs/orvieto.pdf\nAnd if you want an advise from me, go to Shroud.com and try to read as many scientific articles as you can.  If someone is really interested in the science of the Shroud, he cannot just learn things from TV documentaries or some presentations.  He has to go deeper into the subject to really learn the truth about the science of the Shroud by reading scientific articles on the subject.  \nThere’s so much crap out there about the Shroud that it’s unbelievable !  Nobody should trust blindly what is reported on TV, radio, internet, etc. without having check out the scientific literature about the Shroud…  Many journalist for example report things as if they were accepted facts and theories (like the Mandylion for example) while it is not true at all.  Many times (like in the case of the Mandylion), it is just an hypothesis and there’s too much problems related to it to obtain a general concenssus from the scientific community and be called a theory and be accepted as a proven fact…\n\n","date":"November 11, 2011 at 4:42 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4726","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"I should have mentioned also Dan’s website which is another good website full of pertinent informations about the Shroud : http://www.shroudstory.com/\nSorry Dan !!! ;-)\n\n","date":"November 11, 2011 at 4:53 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4727","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Gabriel, for your comment #10, I recommand you greatly to buy the book of Ray Rogers.  He talk alot about this topic.  I don’t pretend his Maillard reaction is THE one that can explain the Shroud images, but Rogers talk about the question you ask.  You can find the book here : http://www.lulu.com/product/paperback/a-chemists-perspective-on-the-shroud-of-turin/3278016\nIf you want to buy it, you can purchase the PDF version.  It’s alot cheaper…\nI can tell you that theoritically, it is possible to achieve a real 3D image on a cloth with what STURP called “an hybrid process” that involved partially a direct contact process and partially a vertical projection process (that can be related maybe with a gaz diffusion or a molecular diffusion).  All right, it is theory.  I know.  But, there is also a great example of an image of a living thing that possess real 3D informations (related to the distance) and that is done completely naturally.  It is called a Volckringer pattern and you can go there to see 2 images of leaves that were transferred on paper and those images possesses real 3D information just like the Shroud : http://gizapyramid.com/LECTURE-SHROUD3.htm  (check out slides 19 and 20)  By the way, those images were done with a VP-8.  It’s pretty impressive and it’s the absolute proof that Mother Nature can be really surprising sometimes ! And what is interesting is the fact that modern science is not able to fully explain this chemical phenomenon, just like the Shroud !!!!\n\n","date":"November 11, 2011 at 5:44 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4730","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Thanks for your link, Yannick. However, the Volckringer pattern seems not to fulfil the condition of superficiality imprint only of the most external parts of the fiber. The author says that “Some problems are that the Shroud body image is a surface phenomena but the Volckringer patterns are not.  They penetrate into the paper”. This mechanism seems to fulfill one important condition (3D) but not others like superficiality.\nAlso, thank you for you suggestion. I will  read the book by Roger and try to understand how he links intensity of a chemical reaction and subsequent color gradient change with the distance to the body. At this moment,it seems to me impossible but I am open to analyze and even accept a plausible and logical sequence of mechanisms leading to a 3D image.\n\n","date":"November 11, 2011 at 6:47 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4734","author":"Gabriel","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Again,…Yannick I’m not trying to be vindictive here, seriously, but let’s try to use some common sense! The Volckringer pattern is basically a useless analogy, Why?, two reasons and may I say they are mentioned in the above article. These patterns require many years to form! The Shroud image formed in less then 36 hours! Most importantly ‘direct’ contact is required!! but not just direct contact; These plants and flower images have been ‘pressed’ or ‘sandwiched’ for long periods of time!…Enticing images yes, especially noting the 3D aspects, but not a good scientific analogy to the Shroud’s amazingly brilliant image.\n\n","date":"November 11, 2011 at 7:12 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4735","author":"Ron","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Many years to form ?  NO RON !  And I have the proof directly in front of my house these days !  Because it’s autumn here in Quebec, all the leaves are already on the ground and there’s a lot of pretty impressive imprints of those leaves on the sidewalk !  VERY IMPRESSIVE in fact because of the great details we can see !  I’ve even take some pictures of those imprints.  Too bad I cannot post them here for you to see.  Really, it’s VERY IMPRESSIVE !  You can see fresh leave just fallen on the ground (some are still green !) and still, they were able to leave an imprint on the concrete…\nDirect contact to form ? AGAIN, NO RON !  And again, I saw the proof in those imprint that are present on the concrete sidewalk near my home !  Some imprints are nearly complete and you can even see, in some cases, the ribs of the leave !  Those ribs (and also, many parts of the leave) were not pressed on the concrete and were not in direct contact with the ground.  You have to believe me on this !\nSo, I don’t say the Shroud images were create by the same exact chemical and natural process, but who knows ?  There’s no honest scientist who can, at the present time, completely discard this kind of phenomenon regarding the Shroud.  Remember that this kind of process was NEVER tested in laboratory by any STURP member or anyone else (as I know).  So, how can we be so sure that the body images of the Shroud were not created by some kind of complex chemical process that could be related (in some way) with this Volckringer pattern phenomenon ?  How can we be so sure that it wasn’t some kind of a similar (I’m not saying it was exactly the same) chemical process ???\nThe fact is that this chemical phenomenon exist, it is completely natural (unless someone pretend that those leave have resurrected !!! ;-) and it present many similarities (and some differences) with the Shroud body images.  So, please, before completely discarding this hypothesis, let’s stay open-minded here and wait until someone (a real honest scientist and if he’s a chemist that would be the best) will really make some experiment about this phenomenon in relation with a dead corpse…\n\n","date":"November 11, 2011 at 7:44 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4739","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Yannick maybe not years, but a very long time. I know this from experience and experiment. Again your using an analogy that does not make sense when relating to the Shroud. Yes I agree leaves will leave imprints on things such as sidewalks etc; but these leaves are ‘saturated’ with water (mildew), and have been pressed onto the surface by some means, either by foot, car or heavy rainfall, but by some means. You don’t need to explain anything about leaves to me, I’ve been raking leaves for three weeks now, lol, I’m in Ontario bro! I am not totally disregarding this proposal but just saying it doesn’t add up. ((Especially in the sense it does not explain images on non-contact areas)). This proposal also assumes other things like the body was wet or damp, which I would doubt since it was outside for atleast 2 hours after death and before entering the tomb and assumes possibly a high humidity level in the tomb, which we cannot know for sure, amongst other things. \nR\n\n","date":"November 12, 2011 at 2:02 am","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4749","author":"Ron","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Hello Ron !  Now I understand perfectly why we can’t agree on anything !  Ha ha ha !  You’re an ontarian and I’m a quebecer !   It’s all normal !!!!  Ha ha ha !!!!\nFor the imprints of leaves, I wish I could send you my photos because they are really impressive in their details !  And for the time factor, it’s totally in agreement with the Shroud because some leaves were still fresh when they left their imprint.  It seems like this chemical process start shortly after they felt to the ground.\nNow, for the contact thing, I seriously doubt that because of the quality of the imprint.   And since the leaves were still fresh when the process began, that meant that they were not totally pressed on the concrete by natural or artificial means.  Those images didn’t came necessarily after a rain…\nI really think someone should make some experiments about that.  Again, I don’t say that this chemical process was the same for Jesus body in the Shroud but those images prove to me one thing :  Nature can produce imprints of a fresh dead thing that don’t necessarily need a direct contact and those imprints can show very small details with a very good resolution.\n\n","date":"November 12, 2011 at 3:18 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4760","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Las manchas de sangre se han producido por contacto…..pero hay manchas de sangre que aparecen FUERA de la imagen corporal, como el largo reguero que sale del codo izquierdo.\nEl Dr.Gilbert Lavoie ha demostrado de una manera SENCILLA, al alcance de cualquiera que desee repetir la experiencia, que la Sábana estuvo en 2 posiciones distintas:\nLa primera posición envolviendo el cuerpo, responsable de las manchas de SANGRE por contacto y siendo su posición HORIZONTAL.\nLa segunda posición en la que se produce la IMAGEN CORPORAL, en que el cuerpo (y la Sábana por tanto) están en posición VERTICAL.\nhttp://www.acheiropoietos.info/proceedings/LavoieWeb.pdf \nhttp://lasabanaylosescepticos.blogspot.com/2010/07/una-simple-y-sencilla-demostracion.html\nNo existe NADA en la Ciencia que pueda justificarlo, y ello demuestra un evento SOBRENATURAL.\nCarlos Otal.\n\n","date":"November 11, 2011 at 10:23 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4744","author":"co","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"For the Rigos Mortis question, if you go to Wikipedia and read the definition of lactic acidosis (http://en.wikipedia.org/wiki/Lactic_acidosis), you will read this very interesting text : “Associated conditions : LACTIC ACIDOSIS is an underlying process of rigor mortis. Tissue in the muscles of the deceased resort to anaerobic metabolism in the ABSENCE OF OXYGEN and significant amounts of lactic acid are released into the muscle tissue. This along with the loss of ATP causes the muscles to grow stiff.”\nWith this in mind, I think there is very good chances that the body of Jesus would have become in a very intense and rapid state of Rigor Mortis right after death, because I really think there is a very good probability that Jesus body would have presented 2 very good conditions for that to happen :  Firstly, I really think there’s a very good probability that he died from a progressive asphyxia on the cross (as supported by Bucklin, Baima Bollone and Pierre Barbet), so even before the death, the level of oxygen in the body (lungs, blood, etc.) would have been dramatically low.  Secondly, the presence of a lactic acidosis in the body of someone who would have been tortured like Jesus (especially with a very violent scourging of more than 100 hits that causes bloody wounds) is very probable.\nSo, with a high probability that those 2 pathological conditions would have been present in the few hours before the death of Jesus, I think it is pretty logic to think that the Rigor Mortis would have been very rapid in his case and very intense.  Would be nice if a medical expert could confirm this but I think the chances for what I just describe have really happen to Jesus are very good :  Lactic acidosis + progressive state of ashyxia = very rapid and intense Rigor Mortis.  I think this equation is pretty good in the case of Jesus and seem totally in agreement with the body images found on the Shroud.\n\n","date":"November 11, 2011 at 11:19 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4745","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"\nYannick Clément :Ask Barrie Schwortz who his the one who took those transmitted light photos ! I ask him the question and it was he who confirm this fact to me : generally, for the scourge marks, the blood did soak more deeply in the dorsal part of the Shroud. By the way, I ask him the question after our debate about the scourge marks !!! So, you see ? The scourge marks were done NATURALLY by a direct contact between a corpse and a linen cloth. Nothing strange there…\nYannick I conversed with Barrie around the same time by email and thats not what I understood he said from our communications\nR..\n\n","date":"November 12, 2011 at 1:27 am","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4746","author":"Ron","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Ask him again Ron !  Barrie send me copies of his transmitted light photos in a resolution good enough for me to see what he meant.  It’s totally true.  You can see many blood images on the dorsal part of the Shroud that represent scourge wounds that have soak into the cloth.  And what more natural for wounds that were compressed by the weight of the body ?  Totally logic and NATURAL.  No need for a miracle there.  On the contrary, on the frontal part of the Shroud, when you look at the transmitted light photo, you see that fewer scourge marks are visible and that mean that the majority of the scourge marks were not able to soak deep into the cloth.  Again, what more natural for wounds that were on top of the body were there was no great weight that was applied to them ?  I found this observation that come from the transmitted light photos to be totally logical and natural, don’t you think ?  That’s exactly I would expect scourge wounds would transfer on a cloth from a dead body lying on his back in a Shroud…\n\n","date":"November 12, 2011 at 2:50 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4759","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Maybe if Dan can get permission, and Barrie is willing, these photos can be posted here!…I’m curious and I would also like to hear Barrie’s response to this current blog, that would ebinteresting. Nothing like getting it straight from the source. Right? And I know Barrie frequents this blog.\nBarrie you there?\nR.\n\n","date":"November 13, 2011 at 4:08 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4786","author":"Ron","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Escribí en anterior comentario:\n“La presencia del RIGOR MORTIS, patente en la imagen, indicando la persistencia de elevada cifras de ácido láctico NO es compatible con el inicio de la DESCOMPOSICIÓN de las proteinas y producción de las aminas CADAVERINA, PUTRESCINA y afines, necesarias en la reacción de Maillard que propuso Rogers.\nLa descomposición se inicia una vez ha CESADO el rigor mortis.\nRogers, al que tanto debemos en el estudio de la Sábana, se equivocó en este punto, el cuerpo de Jesús de Nazaret NO sufrió la corrupción, no pudo producir cadaverina, putrescina y afines, y por tanto no pudo haber ninguna reacción de Maillard que diera color a la Sábana.”\nhttps://shroudofturin.wordpress.com/2011/10/25/more-on-max-patrick-hamon-and-the-coin-on-eye-issue/#comments\nCarlos Otal\n\n","date":"November 12, 2011 at 1:31 am","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4747","author":"co","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Are you sure that some amount of heavy gas could not be produced earlier if abnormal conditions are present ?  Who can be so sure about that…  We have to remember that we don’t know many basic data about the man on the Shroud.  For example, we don’t know all the pathological problems he had before dying.  We don’t know the environmental data for the day he died and the subsequent days and nights.  We don’t know the temperature in the tomb and the level of humidity that was present.  There’s alot of things we’ll never know for sure about the man of the Shroud and who knows if some very particular and rare conditions were not reunite to permit some heavy gas release by the corpse in less than 36-40 hours ?  Also, we have to remember that Rogers hypothesis was about heavy gas yes, but also about the release of ammoniac gas that can be released pretty fast by a dead body (especially by the lungs through the nose and mouth).  This gas can also have been part of the image formation process.  As Rogers said in his book :  If a thin impurity layer made of sugars and carbohydrates was really present on the surface of the Shroud (and, by the way, the STURP team was able to detect traces of starch that tend to confirm the presence of this layer) and some gas were emit from the dead body, there WILL BE a chemical reaction of coloration.  As Rogers said (and this is goddamn important) :  THIS IS NOT AN HYPOTHESIS, THIS IS A FACT !!!!\nSo, when a new series of direct researches will be done, I hope they will closely verified if the impurity layer postulate by Rogers can be detect or not on the Shroud.  As I said, for the moment, starch impurities have been found by STURP (and confirm by McCrone !), and as Rogers said, those starch impurities can well have been one part of the composition of this impurity layer…  Again, more researches and analyses need to be done.\n\n","date":"November 12, 2011 at 5:30 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4764","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Las manchas de sangre se han producido por contacto…..pero hay manchas de sangre que aparecen FUERA de la imagen corporal, como el largo reguero que sale del codo izquierdo.\nEl Dr.Gilbert Lavoie ha demostrado de una manera SENCILLA, al alcance de cualquiera que desee repetir la experiencia, que la Sábana estuvo en 2 posiciones distintas:\nLa primera posición envolviendo el cuerpo, responsable de las manchas de SANGRE por contacto y siendo su posición HORIZONTAL.\nLa segunda posición en la que se produce la IMAGEN CORPORAL, en que el cuerpo (y la Sábana por tanto) están en posición VERTICAL.\nhttp://www.acheiropoietos.info/proceedings/LavoieWeb.pdf\nhttp://lasabanaylosescepticos.blogspot.com/2010/07/una-simple-y-sencilla-demostracion.html\nNo existe NADA en la Ciencia que pueda justificarlo, y ello demuestra un evento SOBRENATURAL.\nCarlos Otal.\n\n","date":"November 12, 2011 at 1:35 am","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4748","author":"co","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Yannick, I have read the paper you mentioned in another ocasion by Rogers on shroud.com about and still I find that the question of a 3D image based on chemical reactions is not properly and satisfactorily addresed:why the color originated by that chemical reaction and the intensity of that reaction changes with the distance to the body and only in the frame from 0 to a few centimetres? I cannot imagine such a mechanism.\nBy the way, one of Rogers’ major difficulties with the radiation or energy field theory is that in that case the inner core of the fibers would have been also modified and not only the outermost part of the fibers. That is a good point but (after reading his work following Dan’s previous post) Prof Di LAzzaro has been able to overcome this problem with radiation of a wavelength of 193 Aº so that only the outer parts of the fibers are coloured while the core remains intact.\n\n","date":"November 12, 2011 at 6:09 am","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4752","author":"Gabriel","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"The thing is :  All those hypothesis have problems regarding the Shroud images and nobody can claim today that one of them can totally account for all the chemical and physical aspects of the Shroud images.  More researches and experiments need to be done.  The Volckringer pattern hypothesis show many similarities very interesting with the Shroud images and I think a chemist should make experiment to really investigate the possibility that the chemical reaction that is at work for the leaves of the plants can be related in some ways with the Shroud images.  That work still wait to be done.  \nFor your specific question about Rogers, I not truely qualified to answer a very specific question like that but, in Rogers book, he talk a lot about this topic.  You should really buy this book…  I can say this to you : For Rogers, in theory, it is possible that a body image like the Shroud can be formed from a chemical reaction he called Maillard reaction.  He did some experiments that were not completely successful but he died before having time to fully explore his hypothesis.  So, I think that nobody can completely discard the Maillard reaction hypothesis for the moment and we also have to think that maybe there was more than one process at work to create the Shroud images.  So, who can be sure that this chemical reaction could not account partially for those images ?  Would be nice if another chemist could take the work of Rogers and keep investigate the question.\nNow, for the work done by Di Lazarro, I think it’s interesting but nobody can say that this UV experiment can really be applied in the context of a dead man enrolled in a Shroud and buried in a tomb.  Only in a context of resurrection that this thing can be view as “possible”…  And even then, how can we be sure that the resurrection event produce any kind of by-product whatsoever.  \nAs I said earlier, all those experiments prove only one thing : With those kind of lasers, you can make a coloration on linen that is pretty close to the Shroud coloration. That’s it.  The important thing to remember is this : coloring linen is easy. But that doesn’t mean the coloration process used is the same that the process responsible for the body images on the Shroud. I think more research and analyses needed to be done by M. Di Lazarro and his team.\nFor example, one thing they never experiment (to my knowledge) is to create real 3D images of a body, part of a body or another thing with those lasers… They never also said one word (to my knowledge) about what would be the effect of those lasers on real dried blood clots on a linen cloth (like we see on the Shroud and that were proven by STURP not to have been distrubed at all by the image formation process). They never also said one word on how easy or how tough it is to disolved the coloration. The STURP team were only able to disolved the coloration on the Shroud with very strong chemical reagents like diimide… If the color cannot be reduce with diimide, it’s not the same coloration process than the process that was active on the Shroud. On the contrary, if the color is much more easy to disolve with less stronger reagents, then, again, it’s not the same coloration process than the process that was active on the Shroud.\nAnother point of comparison that would be nice to analysed is the distance factor. We know from STURP that the darkest parts of the body images on the Shroud are those who were probably in direct contact with the body. We also know from STURP that beyond a distance of 4 cm, there is no body image at all. But also, the STURP team was able to determine that the color that reside on one single fiber possess the same degree of intensity (yellow straw color) no matter if the body was in direct contact with the Shroud or distant from it by less than 4 cm.\nSo, I would like that M. Di Lazarro and his team show the results of those lasers on linen when the lasers are in direct contact with the cloth and compare the result when the lasers are 1 cm away from the cloth, 2 cm away, 3 cm away, 4 cm away, 5 cm away, etc., etc. I am curious to know if the results will be the same each time regarding the color intensity and also regarding the degree of penetration into the fiber…\nAll those results would be nice to read in another scientific article. Then, we would have more data to judge if UV rays still can be considered as one potential candidate for the image formation process on the Shroud…\noud.\n\n","date":"November 12, 2011 at 4:21 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4761","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Hello again Ron and everybody else !\nYesterday, I wrote on this blog that I would find you the citation (citations actually) from the paper of Miller and Pellicori about the fact that the color density of the dorsal image is a bit darker than the frontal image on the Shroud.  Here it is :\nArticle :  Ultraviolet fluorescence photography of the Shroud of Turin\nAuthors :  Vern D. Miller and Samuel F. Pellicori\nCitations :\n1-Page 79 : “The body image (nonfluorescing) is VERY DENSE at the scapula and rib cage.”\n2-Page 80 : “The dorsal body image is MORE DISTINCT than the ventral image.”\nThose citations made it pretty clear that the body image on the dorsal region is very dense, which is totally in agreement with the FACT that the denser body images on the Shroud are present in regions where there was a probable DIRECT CONTACT between the body and the cloth.  The dorsal region being one of those very probable zones of direct contact, don’t you think it is very normal to observe a very dense color in this region (denser than most other parts of the cloth except maybe the face region) ?  I really think so !  And an observation like that is not in disagreement at all with the idea that the Shroud body images were formed by a NATURAL mechanism (probably of a chemical nature).  In fact, it’s one clue that lead me to think that the body images really came from a natural process not fully defined yet by science…\nOf course, Ron and anyone else can think otherwise, but I still think a natural process of image formation is still possible to explain the Shroud of Turin.  The future will (maybe) tell us if I’m right or wrong !\nJust for you to know that I’m not a liar, I also want to give you the exact reference about the fact that Jackson and Al., in their STURP paper about the possible image formation mechanisms, left the door open to the possibility of a hybrid mechanism that could well be natural.  Here it is :\nArticle :  Correlation of image intensity on the Turin Shroud with the 3-D structure of a human body shape\nAuthors :  John P. Jackson, Eric J. Jumper and William R. Ercoline\nCitation :\nPage 2265 : “Thus the hybrid mechanism appears capable, to some degree, of forming images with the simultaneous relief and resolution characteristics found in the Shroud image.”  After that, they talk about the fact that there is also important points of discrepancy in the experiment they’ve done.  It’s true.  But, what is also true, is the FACT that they didn’t tested EVERY possible hybrid mechanisms !  In fact, they tested one particular mechanism and that was a direct contact (by thermal contact) + a projection by diffusion mechanism (by a gaseous diffusion).  What would be the result if they would test others hybrid mechanisms ?  We don’t know !  So the fact that the authors state that a hybrid mechanism can theoretically account for both the relief and resolution characteristics found in the Shroud image, is not something we can take loosely !  \nConclusion :  MORE RESEARCHES ON HYBRID MECHANISMS NEED TO BE DONE !\n\n","date":"November 12, 2011 at 4:38 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4762","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"I also want to give another possible answer to Gabriel that can explain (at least in part) the fact that the position of the hair in the Shroud image don’t seem to be natural for a corpse who lie in a tomb on his back and, on the contrary, look more, at first sight, like someone being in a vertical position.  Gilbert Lavoie took this so-called “anomaly” for granted and build a very bad hypothesis (in my opinion) about the body that would have levitated between the 2 parts of the Shroud during what he IMAGINE as the resurrection event and, then, the body would have been raised up in a vertical position just before some kind of radiation were released and produced the body images !  In this Hollywood scenario, Lavoie try to explain why the hair of the man of the Shroud looked like the hair of someone in a vertical position.  And don’t get fool on this, he also try very hard to convinced people that the Shroud offer a scientific proof of the resurrection !!!  I just want to say :  ANOTHER ONE !!!  In fact, this is another perfect example of Shroud pseudo-science that is very bad for the credibility of sindonology in general.  Ray Rogers, among others, fought against those kind of things all his life and I’m very grateful to him and to every other person in the Shroud world who keep his feet on the ground and try to stay logical and scientific about this cloth !\nI really think there’s another explanation than the one given by Lavoie.  I think this explanation can well be a combination of 2 important factors we have to remember versus the Shroud :\n1-There was more blood on the body and in the hair than what appear on the Shroud, simply because a part of it was completely dry when the body was put into the Shroud, probably a pretty good time after death.  In this context, we have to assume that the hair would have become rigid and kept a position similar to what they appeared while Jesus was on the cross.  The coagulated blood and also the intense sweating of a man who was tortured intensely would account, at least partially, for the fact that the hair looks straight, just like a person in a vertical position.\n2-This last factor is VERY OFTEN forgotten when it comes to analysed the Shroud images of the head.  In fact, the head was not straight at all but bent forward and down to the chest.  Why ?  Simply because of the intense and rapid rigor mortis that would surely have been present in the case of a tortured man.  So, when Jesus died, his head dropped down in the direction of his chest and stayed in this position because of the rigor mortis.  Then, when the body was laid in the Shroud, the head was still in this position.  This fact was already describe by Pierre Barbet around 1950 after an intensive study of the Shroud photos taken by Enrie in 1931.  So, with this kind of bending of the head forward (toward the chest region), the hair (and their resulting images) would naturally look more like someone in a vertical position !  To me, this is THE most important factor (along with the rigid hair because of the sweat and the blood) that can explain the position of the hair in the Shroud images.  \nAgain, an example like that shows you that there’s no need for some kind of a supernatural explanation when you use you brain in a logical way and also, WHEN YOU KEEP YOUR FEET ON THE GROUND !!!\n\n","date":"November 12, 2011 at 5:01 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4763","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"I agree that Lavoie took a pretty weird road to explain his ‘misconception’ of the hair placement. As I personally never questioned the placement of the hair on the Shroud and always thought it had a pretty simple reasoning. Years ago, I was in a car accident and recieved several head wounds, I bled like crazy from these relatively small wounds, to the point I was blinded by blood flowing over my eyes. Well this blood, once it dried,  my hair was stiff as a board and in alot of spots had gone straight. I have curly hair by the way…Point being, with all the blood Jesus would have lost from the many head wounds, visibly present on the Shroud image, and also understanding that his head would be hanging forward, certainly once he passed, would explain quite easily the hair we see on the Shroud. I’ve always wondered actually why there isn’t much more blood in this area of the image.\nR.\n\n","date":"November 13, 2011 at 2:49 am","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4776","author":"Ron","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Nice remark my friend !\nFor your blood question, I ask myself the same question !  I’ve made a long reflection about the blood and here’s my hypothesis about why there’s not more blood traces in the head and face region on the Shroud (while we know that any injury to the head region can easily cause an important bleeding – just like the description you did) :\nIf we take notice of the study that was done about the Sudarium of Oviedo (http://www.shroud.com/heraseng.pdf), here’s the time estimation made by the authors (one of them was a pathologist by the way) :  Jesus stayed about one hour on the cross after death.  Then, he was dropped down from the cross and stayed on the ground another hour or so.  Then, the body was moved to the tomb and this displacement took about 10 minutes.  So, we have a total of about 2 hours and 10 minutes (maybe plus or minus 30 minutes) between the death of Jesus and the moment his body was laid in the Shroud.  It’s well enough time for many of the blood clots that were still humid at the moment of his death to dried out completely and, because of that, those dried blood clot were not able to leave any imprint on the cloth.  Only a small portion of the blood was able to stay enough humid during all this time to stained the cloth by the process called “decals of humid blood clots”.  And for the face, notice how few blood stains are present there.  I think there’s a good probability that the face was rapidly clean-up with another cloth (by respect for the dead).  If a rapid clean-up of the face was really done, then I have to think the hypothesis of Lavoie who pretend the blood that we see in the hair region on both sides of the face was originaly directly on the face…  But if the clean-up was done just to remove the blood and fluid that was mainly present in the beard and mustache (and was not done on the cheeks), then, maybe Lavoie hypothesis is correct after all.  This hypothesis of Lavoie is not easy to analyzed…  What do you think of this hypothesis Ron ? \nBut, for the blood present in the face and head region, if there’s not more decals present, I really think it is mainly due to the fact that the body was put in the Shroud only a long time after death, so that many blood clots that were humid at the time of death were not able to stay humid all this time and dried out completely.  Only a small portion was able to stay humid enough to stain the cloth.  \nThis hypothesis is in total agreement with both the study done on the Sudarium of Oviedo and the gospel accounts for a burial that wasn’t prepared at all and wasn’t even expected.\n\n","date":"November 13, 2011 at 8:54 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4794","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"At this point, I don’t have a final hypothesis on image formation but if we make a thorough list of pros and cons for each mechanism proposed we can give a step forward.  In this sense, I agree that the experiments Yannick suggests could be most helpful to test Dr D’ Lazzaro’s hypothesis. I mean, what happens with the distance factor, is it correlated with the color intensity? Generally speaking, one can expect from radiation and energy fields that intensity is related to distance (Bragg’s law for example) but more experiments are needed to reproduce the intensity/distance specific slope that the Shroud shows. In this list of pros and cons I think that chemical reaction hypothesis (Millard or any other) has a major difficulty in explaining why the intensity of that chemical reaction and associated colouring effect, should be related to the distance between body and linen. I am not saying that there is not an explanation: I am just saying that such an explanation is not obvious at the present moment. We could call this the 3D difficulty for the chemical hypothesis. The same difficulty is present in Dr D’Lazzaro’s (UV) or Dr. Fanti’s (corona discharge) hypothesis. Are these mechanisms able to reproduce the specific distance/intensity ratio of the Shroud? So far,  the answer is “no”.\n\n","date":"November 12, 2011 at 5:55 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4765","author":"Gabriel","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Except for the proven 3D properties of the Volckringer pattern !  Did you go to John De Salvo website and look at slides 19 and 20 as I told you ?  Those images speaks for themselves.  The Volckringer pattern images show clearly that a 3D information is incoded in them.  How ?  Mystery !  Science has not been able to fully explain this phenomenon (maybe because of lack of experiments)…  So how we can be sure that it is not a chemical process like that (maybe not exactly the same, but similar) that was at work to make the Shroud images ?  Nobody know this answer for the moment.  The 3D property of the Shroud image, you’re right is the most difficult aspect of the question and, until this day, nobody has been able to show an image of a human body (or a human body part) that contain this kind of 3D information.  The mystery is still there BUT we have to be prudent not to link automatically the words “mystery” and “supernatural” !!!!  That’s a problem that goes on in sindonology since STURP published their conclusion saying that they were not able to find one mechanism that can account for all the chemical and physical aspects of the Shroud images.  Since that day, many people have made an automatic link between this conclusion and the idea that it is surely a supernatural process that is responsible for the images…  That’s where I disagree.\n\n","date":"November 12, 2011 at 6:26 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4766","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Yannick, please read my answer #24 regarding the Volckringer pattern. At this point, the main difficulty is that it penetrates the material so deeply that this mechanism can be ruled out for the Shroud.\nThe “problem” with the Shoud is that 3D information is encoded while only outermost parts of the fibers are coloured. A chemical mechanism or a radiation/energy field both can account for only outer part colouring, I should add that only after DiLazzaro’s work a radiation mechanism has been proven to fulfill this condition. Previous works by Fazio and Rogers foresaw for any radiation/energy field mechanism a complete penetration and therefore colouring of the fibers cores. This was the main point for ruling out any energy or radiation-based explanation.\nDespite this, both chemical and radiative explanations, still lack of scientifically sound explanations for the 3D information, e.g. why and how the intensity of these mechanisms depend on the distance to the body. Generally speaking, a radiative/energy field mechanism can be expected to vary with distance but -I agree with you in this- specific and systematic experiments at different distances should be carried out and then evaluate if they can reproduce the intensity/distance ratio observed in the Shroud.\nRegarding your call for prudency I also agree 100%\n\n","date":"November 12, 2011 at 7:23 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4767","author":"Gabriel","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Anyway I would like to thank you for the quotes and links you have provided in this blog, mainly regarding the fact that weight is acting in a distinctable manner in the dorsal image formation.\n\n","date":"November 12, 2011 at 7:34 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4768","author":"Gabriel","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Thanks for your appreciation.\nThe image formation process was acting differently only in a very subtle way between the front and the back part of the Shroud.  The difference of the density seem to be very little and the penetration of the color is not deeper for the dorsal part of the Shroud that it is for the frontal part.  The only difference seem to come from the fact that the back region of the body was generally in a closer proximity with the cloth than the frontal region.  And, if we look closely at the frontal part of the Shroud, the face image is generally denser than the rest of the frontal image.  This is another important aspect of the Shroud images that is not easy to explain.  But, if we take the same logic than what I just told about for the back image, I think there’s some chances that this could be due mainly to the fact that the Shroud was in a closer proximity with the face than with the rest of the frontal part of the body.  The image of the hands are also darker than most of the other parts of the frontal image, so we can think that, for this body part too, the Shroud was in a closer proximity.  This probable closer proximity with the hands and the face regions can be explain by a little compression that could have been done by the people who participate in the burial rite (for whatever reason). \nAnd regarding the distance factor for the experiments made by Di Lazarro or for any hypothesis that pretend that the image is due to a burst of energy, what I never understand is the fact that beyond 4 cm, there’s no coloration.  What kind of energy would be so subtle to create a coloration only within the first 4 cm of distance ?  For me, it goes beyond the imagination…  I think that’s the main point that show that those hypothesis are unable to fully explain the Shroud images.  And in fact, this data of 4 cm can be reduce a bit, if we take notice of Mario Latendresse’s estimation.  In the paper he presented at the 3rd conference on the Shroud in Dallas (in 2005), he wrote that, in his opinion, after only 2 cm, the image formation process had lost more than 80% of his capacity to color the cloth !  Ok, it’s only an estimation but I think it’s a pretty logical one when we look closely at the images.  You can read this good article here : http://www.sindonology.org/papers/latendresse2005a.pdf  (and you can find the 80% estimation on page 3).  So, if this estimation is correct, WHAT KIND OF ENERGY WOULD LOSE 80% OF HIS CAPACITY TO COLOR A CLOTH WITHIN A SHORT DISTANCE LIKE THAT (2 CM) FROM THE SOURCE ???  Good question, don’t you think ?  Maybe I’m wrong but I don’t think a UV laser or a Corona Discharge can account for this data…  To me, the fact the the image formation seemed to have been workingno more than a very close proximity way is the Achilles heel of these supernatural (or unnatural as Ron would say) hypotheses…   Sorry, but I just can’t imagine one kind of energy that could act like that.\n\n","date":"November 12, 2011 at 8:23 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4769","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Alpha particles.\nR.\n\n","date":"November 13, 2011 at 12:01 am","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4773","author":"Ron","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"And what about Beta particles ? ;-)\n\n","date":"November 13, 2011 at 12:03 am","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4774","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"\nYannick Clément :And what about Beta particles ? ;-)\nWhat about them? I answered your question above, and one answer is Alpha particles.\nR.\n\n","date":"November 13, 2011 at 12:56 am","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4775","author":"Ron","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Hey Ron, I was hoping your remark was a joke.  Please show me a proof that Alpha particles can act like the data that STURP report about the coloration on the Shroud !\nWhat we have on the Shroud ?  A coloration of the fibers that is the same no matter where we take a sample on the body images.  Also, everywhere, it’s generally only the first fiber on the extreme surface that was colored.  Also, beyond a distance of 4 cm from the body (the  most probable source for the image formation process), no fibers were colored.  And as mentioned earlier, Mario Latendresse report in his study an estimation that goes like this :  Beyond 2 cm, the image formation process had already lost over 80% of his capacity to create a coloration.  All this put together lead me to conclude that image formation process was a VERY MILD process.  That’s important to remember when we have to evaluate the possibility for any kind of radiation (or burst of energy of any sort) as a possible image formation mechanism…\nThat mean that the image formation process was done by direct contact and also by a vertical projection that was very limited in distance.  That give us this data :  From a point of direct contact until a distance of about 4 cm, any fiber that was colored was always colored the same way, with the same color and no more deeper into the cloth for a point of direct contact than for a fiber distant of 4 cm.  Beyond 4 cm, no color at all !  So, I ask the questions :  What kind of radiation (or any burst of energy of some sort) would act like that ?  What kind of radiation (or any burst of energy of some sort) would color the fibers in the same exact way no matter those fibers are in direct contact with the source (the body) or distant of 4 cm from the source AND, at the same time, would not leave any color beyond this limit of 4 cm ?\nNormally, we would expect that the coloration would be more intense for the points of direct contact with the source (the body) than for the fibers distant from the source of about 4 cm.  Rogers talked about “hot spots” that we could expect to see for the points of direct contact with the body if the image was done by radiation.  But it’s not the way it goes with the Shroud.  No traces of “hot spots” anywhere.  That’s a very important aspect of the question…  It’s one of the biggest mystery of those images.  Very hard to explain. \nAnother thing I don’t understand if the images were done by radiation is why, while the distance increase from the source (the body), the number of colored fibers decrease ?  Again, what kind of radiation would act like that ?  \nAll this lead me to conclude that it would be easier for me to believe in a totally miraculous image than in a by-product of the resurrection made by some sort of radiation…  But, don’t worry, I don’t believe in either kind of process in regard of the Shroud images.\nOh, and by the way, in the paper published by Jackson and Al. for STURP, it is clearly reported that radiations has a possible image formation mechanism didn’t fit correcly with the data we know about the Shroud…  And many people seem also to forget that Ray Rogers was one of the top expert in radiation from Los Alamos National Lab.  When you read his papers, for him, it was evident that the Shroud image wasn’t produced by a radiation (and he knew full well your Alpha particles by the way).  It always amazes me that so many people seem to disregard Rogers opinion so easily, especially since he died and cannot defend himself no more.  For me, when I read an opinion from a radiation specialist like him, I don’t know for you, but for me, I listen !  I don’t pretend that he could not have made some mistakes.  But, when I see how much it was evident for him that radiations were not the solution for the Shroud images, I tend to believe him.  I always say to myself :  If an expert like him (who was there in Turin and did a close examination of the Shroud in person) didn’t see a clear sign of radiation in the body images of the Shroud, I have a big tendency to believe him.  Rogers, contrary to some others researchers, didn’t had an agenda.  So, why would he lied about that and hide the truth ?  If radiation would be the solution, don’t you think he would have noticed some signs of it on the Shroud while he was in Turin and after, while he studied extensively many samples ?\n\n","date":"November 13, 2011 at 8:17 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4791","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Yannick, firstly, I was mearly anwsering your question and Alpha particles meet the criteria as they are known to only travel approx 4cm through air and will be halted by any solid surface with only minute penetration into material such as linen.Secondly, I think you should review some of your own writings/ thoughts. Take for instance from your above comments and paragraphs 2 to 4. Now tell me any form of chemical reaction/hypothesis, that would pass the same criteria? I’m sure you will be at a loss. Thirdly, R.Rogers was not infallible he was human like everyone else. He didn’t notice alot during his primary investigations into the Shroud! The reweaving, gum everything that led him to his 2005 paper was due to someone else pointing him there. Don’t get me wrong I respect the man to the upmost and he did man up and admit he missed it. As for his Milliard hypothesis, he also stated it did not answer all the criteria of the image formation. Oh and I don’t think back in 1978 anyone was looking for signs of radiation in particular.\nR.\n\n","date":"November 14, 2011 at 12:26 am","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4797","author":"Ron","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Yannick, regarding your quote #26 I could suggest you a very simple test with the photos you have taken on the ground leaves. You can use a software like ImageJ, freely available from http://rsbweb.nih.gov/ij/download.html or any other and check whether those images have or not 3D information encoded. It would be nice if you could share the results of this experiment with us in this blog.\n\n","date":"November 13, 2011 at 7:57 am","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4783","author":"Gabriel","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Hello Gabriel !  Very nice remark my friend !  And don’t worry, I had already thought about that but didn’t know what software I could used.  I will try in the next days to check out your link.  If I can work properly with this software, I will tell you about the result…  I never used a software like that, so maybe it will be hard a bit for me.  I’ll see and keep you inform.  Thanks again for the link !\n\n","date":"November 13, 2011 at 8:24 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4793","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"\nYannick Clément :Nice remark my friend !\nFor your blood question, I ask myself the same question ! I’ve made a long reflection about the blood and here’s my hypothesis about why there’s not more blood traces in the head and face region on the Shroud (while we know that any injury to the head region can easily cause an important bleeding – just like the description you did) :\nIf we take notice of the study that was done about the Sudarium of Oviedo (http://www.shroud.com/heraseng.pdf), here’s the time estimation made by the authors (one of them was a pathologist by the way) : Jesus stayed about one hour on the cross after death. Then, he was dropped down from the cross and stayed on the ground another hour or so. Then, the body was moved to the tomb and this displacement took about 10 minutes. So, we have a total of about 2 hours and 10 minutes (maybe plus or minus 30 minutes) between the death of Jesus and the moment his body was laid in the Shroud. It’s well enough time for many of the blood clots that were still humid at the moment of his death to dried out completely and, because of that, those dried blood clot were not able to leave any imprint on the cloth. Only a small portion of the blood was able to stay enough humid during all this time to stained the cloth by the process called “decals of humid blood clots”. And for the face, notice how few blood stains are present there. I think there’s a good probability that the face was rapidly clean-up with another cloth (by respect for the dead). If a rapid clean-up of the face was really done, then I have to think the hypothesis of Lavoie who pretend the blood that we see in the hair region on both sides of the face was originaly directly on the face… But if the clean-up was done just to remove the blood and fluid that was mainly present in the beard and mustache (and was not done on the cheeks), then, maybe Lavoie hypothesis is correct after all. This hypothesis of Lavoie is not easy to analyzed… What do you think of this hypothesis Ron ?\nBut, for the blood present in the face and head region, if there’s not more decals present, I really think it is mainly due to the fact that the body was put in the Shroud only a long time after death, so that many blood clots that were humid at the time of death were not able to stay humid all this time and dried out completely. Only a small portion was able to stay humid enough to stain the cloth.\nThis hypothesis is in total agreement with both the study done on the Sudarium of Oviedo and the gospel accounts for a burial that wasn’t prepared at all and wasn’t even expected.\nWell I have contemplated alot of these things myself. I have read much on the Sudarium and I believe they concluded the sudarium was placed over the head/face of Christ after death, while still on the cross and approx an hour later he was removed. Seeing as scriptures mention a storm brewed up (and picturing high winds) I see no reason to refute that most all blood, sweat or any body fluids would have been almost completely dry by the time they even took him down from the cross! Let alone another hour passing before he is even placed in the Shroud. But then there is the question of dirt being blown around and covering the body, as it was still damp. Plus if we acept the times concluded with the sudarium, he was then laying in front of the cross (face down apparently) for another hour…So what happened to all the dirt??? This is one of the reasons I tend to appreciate Zugibe’s hypothesis that the body was ‘partially’ washed during the burial….it would explain alot, but raises questions of it’s own. Lavoie’s hypothesis makes sense if you accept the concept that the Shroud fell thru the body. As there would be no other explanation for the blood decals to have shifted.\nRon.\n\n","date":"November 14, 2011 at 1:14 am","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4801","author":"Ron","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"I am sure you will do it. If you use ImageJ, after importing the picture, in the menu you will find “plugins” and then “3D”  and “Interactive 3D surface plot”. That’s all! This or similar softwares are in year 2011 far more powerful than the VP-8 in the 70’s. Good luck!\n\n","date":"November 14, 2011 at 8:04 am","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4806","author":"Gabriel","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"\nRon :Yannick, firstly, I was mearly anwsering your question and Alpha particles meet the criteria as they are known to only travel approx 4cm through air and will be halted by any solid surface with only minute penetration into material such as linen.Secondly, I think you should review some of your own writings/ thoughts. Take for instance from your above comments and paragraphs 2 to 4. Now tell me any form of chemical reaction/hypothesis, that would pass the same criteria? I’m sure you will be at a loss. Thirdly, R.Rogers was not infallible he was human like everyone else. He didn’t notice alot during his primary investigations into the Shroud! The reweaving, gum everything that led him to his 2005 paper was due to someone else pointing him there. Don’t get me wrong I respect the man to the upmost and he did man up and admit he missed it. As for his Milliard hypothesis, he also stated it did not answer all the criteria of the image formation. Oh and I don’t think back in 1978 anyone was looking for signs of radiation in particular.\nR.\nBravo Ron !  You already find the answer to this mystery called the Shroud !  I’m impress !  Alpha particle ?  Sorry but until you show me proof of that, I don’t buy this.  If the answer would be so easy, don’t you think we would have already a copy of Shroud ?  Or at least, someone would have produce samples with the same exact chemical and physical characteristics of the Shroud image and publish this in a peer-review journal ?\n\n","date":"November 14, 2011 at 11:41 am","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4808","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Thanks. But I’m not saying I found the answer to the Shroud image, just to your question; “What kind of energy could loose 80% of it’s capacity to colour a cloth within a short distance like that?” Alpha particles like I said will not penetrate all solids but, they will penetrate some solids with the density of say linen or cloth, and only penetrate these materials very minutely; meaning only the top fibrels possibly. It then would not matter if the cloth, sheet or Shroud were actually a millimeter or 4cm away from the source, the penetration would be relatively the same and as Alpha waves will not travel much further then approx 4cm through air, it would not penetrate anything placed further…hense the drop-off in the image.This my friend is scientific facts about alpha particles and their properties!…Whether they are involved in the Shroud image formation? I could only speculate, but they fit YOUR criteria and answer YOUR question precisely, which was my main point.\nR.\n\n","date":"November 14, 2011 at 2:32 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4816","author":"Ron","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"By the way, I NEVER said I was considering the hypothesis of Rogers to be perfect to explain every aspects of the Shroud images…  But I don’t think we can totally discard the possibility that a Maillard reaction could have been PART of a more complex and combined chemical reaction…  Nobody can discard that if he’s honest.\n\n","date":"November 14, 2011 at 11:45 am","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4809","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"One more thing :  If an Alpha particle would be halted by any solid surface, then how can you explain the very subtle body image that seem to be on the external surface of the Shroud, around the face region (particularly the hair and maybe also the beard and mustache) ?\n\n","date":"November 14, 2011 at 11:50 am","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4810","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Last thing for Ron :  I think you greatly underestimate the talent and knowledge of a guy like Ray Rogers !  You should read this again : http://www.shroud.com/pdfs/rogers8.pdf\nThe guy knew full well what kind of effects and defects an alpha particle could do on linen.  If he didn’t notice those kind of effects and defects on the SHroud, then what ?  He’s a liar ?  He’s a twit who know nothing about radiation ?  Seriously, I don’t buy this hypothesis just because Rogers would surely had noticed some evident signs of those Alpha particles on his samples of the Shroud if these were responsible for the coloration we see.  Since it’s not the case, I think we have to look elsewhere for an explanation of this mysterious image.\n\n","date":"November 14, 2011 at 12:17 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4811","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Response to #61~Why would you say that? I have said; I respect his conclusions, many times and he as a scientist. I also agreed with his 2005 paper, wholeheartedly. If you read his paper you just linked us to, he mentions a very important point; THE SOURCE MUST BE KNOWN !!! His calculations were with sources of higher energy in most cases. He mentions the fibrels on the Shroud were degraded or more precisely the ‘signatures’ were. So basically he could not come to a ‘conclusive’ result.Atleast conclusive enough per peer-reviewed.\nRes to #60~ I responded in post no.#58\nRes to #59~ I tend to disagree, if the milliard reaction does not answer to all the attributes of the Shroud it must be disregarded. We can’t start ‘FISHING’ for other combinations of hypotheses to explain it’s faults…Mainly being it does not explain the 3D encoding made on cloth that was a distance of up to 4cm away!? Or how vapours could create such precise image details? ec cetera….this is being honest bro.\nR.\n\n","date":"November 14, 2011 at 3:19 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4817","author":"Ron","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"My point is not about the source of an hypothetic radiation bombardment.  It’s about WHAT IS SEEN ON THE SHROUD !  For Rogers, there’s no traces of radiation there, period.  If he had seen any signs of a coloration made by radiation, he will not have fight agaisnt those fancy all of his life.  And even if the STURP team wasn’t lookin for a particular sign of radiation, Rogers is an expert in this field.  I just cannot believe he would have been fooled like that.  \nI would like someone bring me the proof (a scientific confirmed proof by at least 2 or 3 independent researchers) that a particular kind of radiation would do the same exact coloration in direct contact to the source than at 4 cm of distance to the source and then no coloration at all at 5 cm to the source.  Then I’ll say :  Maybe you’re right.  Not before that. I’ll wait for someone to produce with any kind of radiation an image of a body with real 3D information incoded in it.  I still wait for that.\n\n","date":"November 14, 2011 at 4:27 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4818","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"By the way, Jackson and Al., in their 3D paper for STURP really check out the radiation hypothesis and came to the conclusion that it cannot work.  It’s not me who invent that.\nYou can believe that the experiment of Di Lazarro is some kind of proof that the image of the Shroud was made like that but me, all I see is someone who have been able to colored linen in a way that is not far from the coloration of the Shroud.  That’s it.  And he’s not even able to do that in one single shot !  You think Jesus projected UV light 3 or 4 times when he resurrected, just like a flash light ?  Come on !  And there’s no 3D in his experiments.  No explanation for the second face image on the external part of the Shroud too…  No check up if the coloration can be reduce only with a strong reagent like the diimide.  No check up if this kind of UV radiation will have any kind of effect on clotted blood.  I don’t think he tried his experiment with the laser beam being in direct contact with the linen and after with the laser beam being at 4 cm of the linen.  \nAND MOST IMPORTANT OF ALL :  He didn’t do his experiment on a piece of linen prepared the old fashion way, just like Pliny the Elder had described in Antiquity.\nWhat kind of result M. Di Lazarro would obtain with a piece of linen that would bears a thin coating with the same exact components that were on the Shroud ?  I’m not sure at all the coloration would be the same…\nThe point is : we’re still far from having a proof that one particular hypothesis is the correct one.  And if we stay grounded on earth, I just don’t see Jesus body being transformed suddently in a laser beam ! :-)  In your dream my friend !  In your dream…\n\n","date":"November 14, 2011 at 4:40 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4819","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Don’t get me wrong here Ron.  I’m not mad at you but I’m just tired to see how fast pro-supernatural-hypothesis people are to put Rogers reputation and knowledge in question.  It’s amazing to see this.  I’ve talk with many pro-supernatural guys over the years and they’re all the same :  for them, Rogers was off-track in every conclusions he made regarding the Shroud.  You know what I think ? Rogers is a pain in the a** for those guys because they know he’s probably right in his observations !!! ;-)\n\n","date":"November 14, 2011 at 12:45 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4812","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"\nYannick Clément :My point is not about the source of an hypothetic radiation bombardment. It’s about WHAT IS SEEN ON THE SHROUD ! For Rogers, there’s no traces of radiation there, period. If he had seen any signs of a coloration made by radiation, he will not have fight agaisnt those fancy all of his life. And even if the STURP team wasn’t lookin for a particular sign of radiation, Rogers is an expert in this field. I just cannot believe he would have been fooled like that.\nI would like someone bring me the proof (a scientific confirmed proof by at least 2 or 3 independent researchers) that a particular kind of radiation would do the same exact coloration in direct contact to the source than at 4 cm of distance to the source and then no coloration at all at 5 cm to the source. Then I’ll say : Maybe you’re right. Not before that. I’ll wait for someone to produce with any kind of radiation an image of a body with real 3D information incoded in it. I still wait for that.\nYannick, the source of whatever caused the image will directly effect what is seen on the image, so it is directly related!, this my friend is directly stated by R.Rogers himself!… Rogers found no radiation effect tracks on the fibrels? I think you should read his paper againAND be carefull what you ask for, as Rogers paper whom you are using here as proof against any radiation type image mechanism has not been peer reviewed either or proved correct by 2 or three independant researchers. As you, I await also, for someone to prove a natural chemical reaction can cause all the attributes we find of the Shroud image~highly unlikely!\nRon\n\n","date":"November 15, 2011 at 6:42 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4838","author":"Ron","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Hello Ron.  I hope you don’t think that Rogers was fool enough to pretend that his paper covered ALL possibility of radiation effects on linen !  It’s pretty evident that his goal with this paper was not to make believe that he tried every possibility but to show that any radiation would NORMALLY leave signature traces on a fiber.  Some signs that can be seen for trained eyes like him.  On this particular subject, I would love to see what a guy like Rogers would think of the experiments done by Di Lazarro and what would be his own conclusions if he had the opportunity to analysed closely those samples.  I’m not sure that he wouldn’t find some minor defects in the fiber structures of the fibers that are a bit different than the Shroud fibers structures, even if Di Lazarro pretend that both structures are the same…  At least, I would love to see a scientific confirmation of Di Lazarro’s work by AN INDEPENDENT researcher… A chemist expert in UV radiations would be the best to do this kind of second opinion.  Until an independent confirmation would be done, I’m still skeptic about the conclusions reached by Di Lazarro and his team.  And even if Di Lazarro is right, his experiment is far from being totally on the nose with all the chemical and physical characteristics of the Shroud images.  Just take the second face on the external part of the Shroud as an example of what I just say.  The 3D aspect of the image is another good example of things that Di Lazarro experiment is unable to replicate.  \nTo come back about Rogers, he show some example in his paper maybe with the use of high energy radiation, but that’s normal.  he surely did that because that would be easier for him to show the effects on a fiber.  I see his paper like a kind of teaching about radiation and their effects on linen, not as an extensive study of every kind of radiation and their effects on linen.  \nThe bottom line is this :  Normally (for Rogers anyway) every possible radiation that we know would leave some kind of traces on linen fibers.  Some kind of signature.  What Rogers said is that he didn’t found anything like that on his samples from the Shroud images.  And one major finding of Rogers is this one that goes against any radiation hypothesis :  Everywhere on the Shroud, no matter if it’s in a body image region or in a non-image region, the defects on the structure of the fibers ARE THE SAME.  And those defects have the clear signature of defects NATURALY done by the aging process.\nNow, maybe the Shroud images were done by some kind of unknown radiation or unknown power that don’t leave any specific traces on fiber…  But this is pure speculation.\nAnd I agree with you on one point :  Nobody ever found a correct natural process to explain the Shroud image.  But, at the same time, this conclusion is the same regarding unnatural hypothesis !  So, it’s not because nobody has found the correct process yet that this imply that it is surely an unnatural process.\n\n","date":"November 16, 2011 at 11:57 am","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-4845","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Where can one find a photograph of Dr. Bucklin conducting a forensic examination of the Shroud?\n\n","date":"November 14, 2013 at 12:39 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-51296","author":"Bill Crofut","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Can’t help you there, I’m afraid, Bill. But Dr. Bukllin’s “autopsy” must surely rank as the most comedic piece of writing of all time where the Shroud is concerned.\nhttp://www.shroud.com/bucklin.htm\nPlease tell me that it’s not one of those circuit-speaker’s after-dinner speech jokes, where the plausible-sounding raconteur maintains a straight face while making an increasingly absurd pitch, then slips away quietly until he’s well clear of the hospitality area. That’s  after having pocketed his standard alternative-dinner speech fee, having come “recommended”. Or do these mirth-making things not happen in America?\n\n","date":"November 14, 2013 at 4:03 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-51320","author":"colinsberry","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Colinsberry,\nRe: “…Dr. Bukllin’s “autopsy” must surely rank as the most comedic piece of writing of all time where the Shroud is concerned.”\nPlease be specific with one example from the url provided in your post.\n\n","date":"November 14, 2013 at 4:37 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-51322","author":"Bill Crofut","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"And you’d been doing so well. Sigh.\n\n","date":"November 14, 2013 at 5:12 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-51330","author":"David Goulet","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"\ncolinsberry :\nCan’t help you there, I’m afraid, Bill. But Dr. Bukllin’s “autopsy” must surely rank as the most comedic piece of writing of all time where the Shroud is concerned.\nhttp://www.shroud.com/bucklin.htm\nPlease tell me that it’s not one of those circuit-speaker’s after-dinner speech jokes, where the plausible-sounding raconteur maintains a straight face while making an increasingly absurd pitch, then slips away quietly until he’s well clear of the hospitality area. That’s  after having pocketed his standard alternative-dinner speech fee, having come “recommended”. Or do these mirth-making things not happen in America?\n\nYet another person we are asked to add to the list as an incompetent professional Professional forensic pathologist 25,000 autopsies versus…0.  Unless there’s something you’re not telling us (and that doesn’t show up on Google Scholar’s radar), that’s pretty easy math.  How does one manage to be so expert in all things medical & science?  It’s as though MacGyver has been reborn in a lab coat.\n\n","date":"November 14, 2013 at 5:25 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-51335","author":"Kelly Kearse","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"25,000? A year is 365 days. One a day, it would took 68.5 years.\n\n","date":"November 14, 2013 at 5:37 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-51336","author":"O.K.","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Why just one a day? My dad was a mortician and he emblamed three bodies in a day (and that was for a rural parlour). Also did this man serve during a time of war? While the 25,000 maybe a generous rounding up I don’t see it as an implausible number at all.\n\n","date":"November 14, 2013 at 5:43 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-51340","author":"David Goulet","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"How many of his other  24,999 autopsies were carried out with nothing more to go on than a faint image on centuries old linen?\n\n","date":"November 14, 2013 at 5:51 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-51342","author":"colinsberry","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"As mentioned in his article he went by more than just the one image. You can argue that confirmation bias prejudiced his findings, fair enough. But it’s also possible to point that out without the need to flippantly toss ridicule at the man. This tactic, a favourite of yours, tends to say more about you than the person your criticizing. If your provoked, fine, if not save the bullyboy antics for your next rugby match.\n\n","date":"November 14, 2013 at 6:02 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-51343","author":"David Goulet","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"\nO.K. :\n25,000? A year is 365 days. One a day, it would took 68.5 years.\n\nJust quoting from the top of the article, but I don’t believe most pathologists necessarily limit themselves to only one case per day-I believe the tv show Quincy was modeled after Dr. Bucklin (or he was involved as a consultant)\n\n","date":"November 14, 2013 at 5:43 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-51339","author":"Kelly Kearse","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Reminder for O.K.: Close to 180 people die every day in Los Angeles County. The Los Angeles County Morgue department performed 5.700 autopsies per year.On a very busy day, they sometimes do up to about 30 autopsies.\n\n","date":"November 14, 2013 at 6:08 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-51345","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"On a very busy day, they sometimes do up to about 30 autopsies.\n“They”, not a single person, I presume. 2500 (one zero less) would be more likely and still enough to gain a respectable experience, I think. One cannot examine one body for merely 30 minutes, 7 days a week, 365 days a year.\n\n","date":"November 14, 2013 at 7:04 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-51356","author":"O.K.","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"“They” here refers to pair working (the forensic pathologist and the forensic technician needed to perform an autopsy 24h a day and 7/7 days).\n\n","date":"November 14, 2013 at 7:44 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-51368","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"“The pathologist observes that there are blood flows which extend in a direction from wrists toward elbows on the right and left forearms. These flows can be readily accounted for my the position of the arms which he has just determined.” “A crucifixion type posture would be the most plausible explanation for these findings.”\nWell, yes, except that the wrists were supposedly nailed against a wooden plank, which would undoubtedly smudge any emerging blood, or if the blood did not emerge till the body was removed from the cross, then the blood would emerge from the palms of the hands and dribble down between the fingers emerging on the cloth below them. Seems the forger didn’t think of that…\n\n","date":"November 14, 2013 at 6:31 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-51350","author":"Hugh Farey","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"\nDavid Goulet :\nAs mentioned in his article he went by more than just the one image. You can argue that confirmation bias prejudiced his findings, fair enough. But it’s also possible to point that out without the need to flippantly toss ridicule at the man. This tactic, a favourite of yours, tends to say more about you than the person your criticizing. If your provoked, fine, if not save the bullyboy antics for your next rugby match.\n\nThe man’s formulaic autopsy report, a parody of the real thing – cast in stilted Victorian language – was the provocation. I’ve never made any secret of regarding it as high comedy. \nSTURP’s director should have told him that his hilarious input was not quite what they were looking for, but OK as a post-project, tongue-in-cheek, hold-a-straight-face, after-dinner speech.\n\n","date":"November 14, 2013 at 6:48 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-51353","author":"colinsberry","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Bill asked for a picture. Simple request. You used the opportunity to ridicule Bucklin — who isn’t here to defend his work. Bad form, amigo. You provide no real basis for that ridicule (some stilted language?) but pronounce it all a big joke anyway. You are not a forensic pathologist. Hey you’re entitled to your opinion, but didn’t we just see this scene – you know the one where you ripped a strip off a dogmatic Anonymous for punching above his academic weight? But take a mulligan on this one. It shouldn’t overshadow an otherwise productive day of science.\n\n","date":"November 14, 2013 at 7:46 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-51370","author":"David Goulet","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"\nHugh Farey :\n“The pathologist observes that there are blood flows which extend in a direction from wrists toward elbows on the right and left forearms. These flows can be readily accounted for\nmy the position of the arms which he has just determined.” “A crucifixion type posture would be the most plausible explanation for these findings.”\nWell, yes, except that the wrists were supposedly nailed against a wooden plank, which would undoubtedly smudge any emerging blood, or if the blood did not emerge till the body was removed from the cross, then the blood would emerge from the palms of the hands and dribble down between the fingers emerging on the cloth below them. Seems the forger didn’t think of that…\n\nConfused…couldn’t the body be removed from the cross with the arms upright b/c of rigor mortis-was Zugibe in general agreement with Bucklin?\n\n","date":"November 14, 2013 at 6:49 pm","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-51354","author":"Kelly Kearse","site":"shroudstory"},{"title":"Paper Chase: The Findings of Robert Bucklin","post":"Difficult to say. How much blood remains in a hand elevated above a dead body? And with what pressure will it be released when a nail is removed? My guess is that no blood will flow at all until there is sufficient in a “reservoir” above it, as when the arm is lowered into “shroud formation.”\n\n","date":"November 15, 2013 at 7:22 am","url":"https://shroudstory.com/2011/11/11/paper-chase-the-findings-of-robert-bucklin/","cat":"news_&_views","id":"comment-51417","author":"Hugh Farey","site":"shroudstory"}]
