[{"title":"A Bas Relief Match to the Shroud of Turin Image?","post":"Very funny. Another example of human fantasy\n\n","date":"February 21, 2015 at 9:41 am","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","id":"comment-191482","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"A Bas Relief Match to the Shroud of Turin Image?","post":"Hey Colin, you dismissed the painting theory as a “pigment of imagination.” What would you say about this?\n\n","date":"February 21, 2015 at 9:52 am","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","id":"comment-191483","author":"Louis","site":"shroudstory"},{"title":"A Bas Relief Match to the Shroud of Turin Image?","post":"I can’t believe how bad this was….This is a new level of bad. BBad  (Beyond bad)\n\n","date":"February 21, 2015 at 10:05 am","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","id":"comment-191485","author":"MikeM","site":"shroudstory"},{"title":"A Bas Relief Match to the Shroud of Turin Image?","post":"That’s more Mike, that’s simply Bull$%^&. And a clear violation of every rule of comparing the images. \nThe guy, I presume  tried to make a parody of all comparison schemes, especially Vignon marks, and Codex Pray. But his shots were far too short. Looking for accidental correspondences between completelty unimportant and unrelated (or even imaginative) details is easy- but finding correspondence between non-trivial, independent and clearly defined features -that’s significant. But the guy does not feel the difference.\n\n","date":"February 21, 2015 at 10:18 am","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","id":"comment-191488","author":"O.K.","site":"shroudstory"},{"title":"A Bas Relief Match to the Shroud of Turin Image?","post":"It is not a NEW level of bad, is the same level of Vignon, Filas, Whanger, Frale, etc. etc. with their coins, inscriptions, objects, similarities, from the iconography of Jesus to the Pray Codex. Exactly the same level.\n\n","date":"February 21, 2015 at 10:33 am","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","id":"comment-191491","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"A Bas Relief Match to the Shroud of Turin Image?","post":"But not my level, Andrea. And that’s the point.\n\n","date":"February 21, 2015 at 10:42 am","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","id":"comment-191492","author":"O.K.","site":"shroudstory"},{"title":"A Bas Relief Match to the Shroud of Turin Image?","post":"How is it possible to write that, Andrea?\nHow can you compare Vignon or the problem of the Pray codex with this absurd ‘parody’ ?\nYou are a serious man.\nSo, I can only understand your comment above as a joke.\n\n","date":"February 21, 2015 at 12:55 pm","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","id":"comment-191495","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"A Bas Relief Match to the Shroud of Turin Image?","post":"You are right, Thibault, Vignon is better. Wrong, but better. For the “problem” of Pray codex, no, I do not see differences. I am serious.\n(I do not know why you call it a parody, I have seen some minutes of the first video, and no more)\n\n","date":"February 21, 2015 at 1:12 pm","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","id":"comment-191498","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"A Bas Relief Match to the Shroud of Turin Image?","post":"Thibault, you know Andrea’s stance…\nYou are right, Thibault, Vignon is better. Wrong, but better. For the “problem” of Pray codex, no, I do not see differences.\nNothing else you have to say, Andrea.\n I am serious.\nThis statement hardly can be treated seriously.\n\n","date":"February 21, 2015 at 1:14 pm","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","id":"comment-191499","author":"O.K.","site":"shroudstory"},{"title":"A Bas Relief Match to the Shroud of Turin Image?","post":"Nicolotti wrote: “For the “problem” of Pray codex, no, I do not see differences. I am serious.”\nMost obviously the man has eyes but don’t see, brain but don’t think as far as the HP Ms bifolium benedictine monk artist iconography in light of the TS is concerned.\n\n","date":"February 23, 2015 at 8:21 am","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","id":"comment-191638","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Bas Relief Match to the Shroud of Turin Image?","post":"That the 1532 burn marks and water stains match a 1355 bas relief is proof that time runs backwards.\n\n","date":"February 21, 2015 at 10:20 am","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","id":"comment-191489","author":"Paulette","site":"shroudstory"},{"title":"A Bas Relief Match to the Shroud of Turin Image?","post":"The basic error is that the guy makes a multitude of manipulations of his images (folding, mirroring, translating, the Shroud) and compares things that completely cannot be related directly nor in any reasonable way (like stain above the head on the Shroud with relief’s head). Contrary in case of the Codex Pray for example, relations between each key elements of the drawing and corresponding features on the Shroud are pretty straightforward, and does not need such twists like Paul Gell does.\nThis only shows how desperate the sceptics are, so they try anything, just to discredit the Shroud -at all cost.\n\n","date":"February 21, 2015 at 10:27 am","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","id":"comment-191490","author":"O.K.","site":"shroudstory"},{"title":"A Bas Relief Match to the Shroud of Turin Image?","post":"If your mindset is to demonstrate a fraud, then it is necessary to stretch, fold and otherwise manipulate time and space to make the cloth fit your mindset.  Reverse your logic; the sculptor used the shroud as a model for his sarcophagus.  There is no need to manipulate time, space, or the cloth.  The artist simply copied the image to his sculpture.\n\n","date":"February 21, 2015 at 1:16 pm","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","id":"comment-191500","author":"Richard Orareo","site":"shroudstory"},{"title":"A Bas Relief Match to the Shroud of Turin Image?","post":"How very unkind. I have no evidence that Paul Gell is a desperate sceptic; have you? He comes across as someone who has discovered a coincidence, explored it further, but ended up drifting further and further from likelihood. There are indeed eerie similarities to some people’s interpretation of the Pray Codex. I hope he reads past your unhelpful comments and gets to mine!\nHi Paul, thanks for bringing the sarcophagus of Pierre de Corneillan to our attention. I have not seen it before, and wonder how it fits in with other contemporary sarcophagi. It does indeed have some resemblance to the Shroud, particularly, as you say, in terms of the slightly parted beard and the crossed hands.\nHowever, I’m sorry to say that I disagree with every single one of your alleged correspondences. In keeping with my practice of taking every posting on the blog with consideration, I set off to write a detailed explanation of why, but – and I do apologise if I’m wrong – I fairly soon came to the conclusion that this is indeed, as suggested, above, a joke. Am I right? \nJust in case you’re serious, here are a couple of things you need to check.\n1) Late 1355 is very much the extreme edge of a credible manufacture date for the Shroud. I don’t know when the bas relief was made, but it may not have been until the following year, which I think would pretty well rule out the possibility of the Shroud having been made in Rhodes and then hurriedly rushed to Lirey for its first display. Furthermore, Pierre de Corneillan was a Hospitaller, while Geoffroi de Charny was probably (if he was related to the earlier Geoffroi who was burnt at the stake), very much of Templar stock. If the Shroud was made by Hospitallers in Rhodes, it would more likely have been sent to a Hospitaller in France for display, no?\n2) Your claim that various bits of one image match various bits of the other depends on your knowing exactly how big the two images actually are. As you seem simply to have superimposed two pictures in photoshop, how do you know that the measurements match in actuality?\n3) The Shroud has a) its famous image, which appears to be made of mildly oxidised linen, b) the marks of a serious scorching from a fire in 1532, which produced the dark lines and patched holes on either side of the image, c) the marks of a serious wetting, not associated with the fire, which made the big diagonal patches up and down the cloth, and d) the marks of some other burn damage from another time. The shroud can be demonstrated to have been folded in different ways for each of the last three incidents. You seem to think that all these marks were of similar manufacture made at the same time. (This was where I decided you had to be kidding, and were writing a deliberate parody!).\n4) And finally – what about the back image? Was that modelled on the sarcophagus too? I look forward to your next video!\n\n","date":"February 21, 2015 at 1:44 pm","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","id":"comment-191502","author":"Hugh Farey","site":"shroudstory"},{"title":"A Bas Relief Match to the Shroud of Turin Image?","post":"There is much more complexity than also just reproducing the back image.\n\n","date":"February 21, 2015 at 5:23 pm","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","id":"comment-191514","author":"Louis","site":"shroudstory"},{"title":"A Bas Relief Match to the Shroud of Turin Image?","post":"It seems that the presenter may be suffering from a bit of pareidolia in many of his comparisons. Moreover, he brings up the point that a forger would not want to copy certain unwanted features of the sarcophagas and would avoid that by leaving the offending spaces blank;  but it doesn’t seem to bother the presenter that the “forger” massively dismissed this principle by incorporating myriad incongruent artifacts from the sarcophagus – e.g., its bumps, cracks, depressions, its cloak-ends, its edges revealed by fold marks, etc. … so sloppily rendered, in fact, that they would be discoverable by later critics, chief among them the presenter himself. A doubtful case.\n\n","date":"February 21, 2015 at 5:06 pm","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","id":"comment-191513","author":"rennyo01","site":"shroudstory"},{"title":"A Bas Relief Match to the Shroud of Turin Image?","post":"Good point, renny. Not only has Paul conflated all the various marks on the Shroud into a single event in time and space, but he has down the same with both the original effigy and the various damages it has sustained over the years, including chips, cracks and discolourations.\n\n","date":"February 21, 2015 at 5:54 pm","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","id":"comment-191515","author":"Hugh Farey","site":"shroudstory"},{"title":"A Bas Relief Match to the Shroud of Turin Image?","post":"Very interesting theories, Paul.  The questions of relative dimensions of shroud image and Cornellian’s relief first came to mind, given that you truthfully assert you have only made these discoveries via photographic evidence.  Your honesty is commendable but a hurdle that cannot be over come without further work on your part.  \nAdditionally, I have to wonder why cracks, chips, and broken fingers would be present on a brand new sarcophagus?  It seems your assertion is in fact that the Shroud we see today and was first displayed by canons of Lirey in 1357 was made through a bas relief technique of unknown description based off of the brand new sarcophagus of de Corneillan just a year earlier.   Unless the sarcophagus was heavily damaged in the first year of existence, some of your points (hands and 30 degree rotations) seem highly dubious.\n\n","date":"February 21, 2015 at 6:38 pm","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","id":"comment-191517","author":"Patrick Sheehan","site":"shroudstory"},{"title":"A Bas Relief Match to the Shroud of Turin Image?","post":"A similar sarchophagus, not in Cluny. It is at the Church of Santa Ana in the gothic quarter in Barcelona:\n\nThe church is said to have had links with the Knights of the Order of the Holy Sepuchre.\n\n","date":"February 21, 2015 at 7:17 pm","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","id":"comment-191519","author":"Louis","site":"shroudstory"},{"title":"A Bas Relief Match to the Shroud of Turin Image?","post":"I’ve seen several similar ones in person, including one in the lovely Oxford, England.\nIn every one that I have seen the artistry is slightly clumsy and not really close to a life like depiction\n\n","date":"February 21, 2015 at 10:58 pm","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","id":"comment-191527","author":"Thomas","site":"shroudstory"},{"title":"A Bas Relief Match to the Shroud of Turin Image?","post":"Gentleman, thank you for your comments. I am Paul Gell, the creator of those videos. I would like to have discussions with any of you that are willing. It is exciting for me to even find others that are interested in the shroud. I am not a scientist, and so just learning the terminology is new to me. I do have confidence in what I found, and I welcome all comments. I know that there where be many negative ones, skeptics, etc. I am not a scientist. I have fulltime commitments as a family man and graphic artist. So if I don’t get back to comments quickly, it is not because I am shying from them. I would like to speak with anyone willing to converse. Thanks again everyone… Paul Gell\n\n","date":"February 22, 2015 at 10:14 am","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","id":"comment-191559","author":"paul gell","site":"shroudstory"},{"title":"A Bas Relief Match to the Shroud of Turin Image?","post":"Welcome to the discussions.\n\n","date":"February 22, 2015 at 10:26 am","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","id":"comment-191562","author":"Dan","site":"shroudstory"},{"title":"A Bas Relief Match to the Shroud of Turin Image?","post":"Okay, where to start? I guess I did just say I was willing to jump into the fire. My presentation was not meant to be considered as official scientific proof. I merely saw correspondences and then took them as far as I could.  I was excited to find many elements that to my eye and mind, make sense, and correlate. It is true that I currently don’t have knowledge of what marks are considered to be from the fire, or separate water staining, etc. I offer up that with my open mind, I may be seeing past further levels of forgery. In other words, those that created the shroud may have also falsely created the other marks, or created false documents claiming when other marks happened. This is probably is not a scholarly assumption. And I am not dismissing the remarks above at all. I intend to look into it all further. I look at it this way: How many of us were around in the 1350s to confirm exactly when the shroud appeared? Or were we there in the 1500s when the fire was there, etc. These dates themselves, may all be further attempts to cover up the truth. Who is it that contends certain marks were made during the fire? The house of Savoy? The Vatican? I would like to know more about how scholars have concluded all of these assumptions. I have a bachelors degree in art, which does not compare to some of the Phd’s that are probably floating around here. But I am here because all of us DO have one thing in common, and that is an INTEREST in the shroud. I would much rather talk about this, or the Italian renaissance, then watch a football game, or the Oscars which are on right now. Hugh and Patrick, thank you for softening the blow for me on this page. Hugh, I will answer all four of your questions in another comment.\n\n","date":"February 22, 2015 at 9:56 pm","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","id":"comment-191608","author":"paul gell","site":"shroudstory"},{"title":"A Bas Relief Match to the Shroud of Turin Image?","post":"Hugh.. your point 1) 1355 may seem extremely late to you for a manufacture of the shroud, but it falls within the radiometric dating results of 1988. I find this significant (you may have dismissed those results. I have not). You say that because geoffroi de charney may have been “of Templar stock” and that the hospitallers were a separate order, that it seems unlikely that the shroud would be produced by one group, and then be rushed to another group. Unlikely, maybe, but not beyond the laws of physics by any means. Remember that all the knightly orders answered to the papacy. Pope Innocent VI was having disputes with pierre de corneillan at the time. He wanted to return the headquarters of their order back within hostile ottoman territory. Peter I of Cyprus (titular king of Jerusalem, also), was canvasing Europe, trying to drum up a new crusade. The byzantine emperor also was pleading for help. What better motivator to get potential knights to go on crusade, then THE burial shroud of Jesus? Picture the sales pitch..”look valiant knights, HERE we have THE HOLY SHROUD ITSELF! THIS IS THE MAN (GOD) YOU ARE FIGHTING FOR! NOW GO TAKE BACK OUR HOLY LAND!”.  This is how I imagine it. So the fact that the shroud was created over pierres sarcophagus, but ended up in france in the hands of a different French knight, doesn’t phase me.\n\n","date":"February 22, 2015 at 10:10 pm","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","id":"comment-191609","author":"paul gell","site":"shroudstory"},{"title":"A Bas Relief Match to the Shroud of Turin Image?","post":"for hugh again… your point 2..you are RIGHT,  I do NOT know if the shroud image and sarcophagus image are sized properly. But all I did was size it ONCE, to line up the beard. And many things (from my perspective) fell into place. I found that significant, and I feel it warrants further study. Your point 3, the burn marks and water marks. Again I do not have enough knowledge of these, and I just looked at them INDEED as being from a single event, or perhaps a second cover up event (the fire) to follow the first. After all, if we are asserting a forgery, there is no reason for the creators of the shroud to be “truthful” in other areas. Documents could have been forged, by the Vatican itself. See the Donation of Constantine if you don’t think that the Vatican has forged documents in the past. Again, I am not dismissing the burn marks, watermarks, etc. I would like to know HOW EXACTLY you and others have come to the conclusion that they themselves are legitimate. What other papers can I study? I am genuinely asking these questions. Finally, your question number 4. What about the back of the shroud? If you watched part 3 of my video, I DO cover the back of the shroud, albeit in only a few points. I also speed up and add a few points into one statement, because I was trying to fit my video into a total of 45 minutes, and I needed to save time. My understanding was that youtube only allows videos up to 15 minutes. I didn’t want to have more than three parts to my video. Most compelling on the back of the shroud, I think, is my POINT 44, which is the beard impression. To my eye, there is a very strong and obvious correlation between the beard of the sarcophagus, and the way that the stain near the head on the shroud back looks.  Okay, I need to get to get to bed for tonight. Thanks again to all of you for your comments.\n\n","date":"February 22, 2015 at 10:22 pm","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","id":"comment-191611","author":"paul gell","site":"shroudstory"},{"title":"A Bas Relief Match to the Shroud of Turin Image?","post":"oh, one more point..this one to answer renny’s comment. I do claim that space was left where the broken hand was. Instead, the shroud was rotated 90 degrees counter-clockwise to use the same sarcophagus hand again for an impression. I said this not because I thought they were trying to “hide every detail” of the sarcophagus from future detection, but simply because it would look ridiculous to show jesus with missing fingers. In addition, the sarcophagus hands taken together seem anatomically over-sized. They fudged the fingers as best as they could. That’s my guess.\n\n","date":"February 22, 2015 at 10:31 pm","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","id":"comment-191613","author":"paul gell","site":"shroudstory"},{"title":"A Bas Relief Match to the Shroud of Turin Image?","post":"Hi Paul. I think a good introduction to the Shroud, with sources, would be Ian Wilson’s most recent book (2010) entitled The Shroud; Fresh Light on a 2000 year old Mystery. However the best way of seeing that the various marks on the Shroud are not contemporaneous would be Aldo Guerreschi and Michele Salcito’s papers at shroud.com, “Photographic & Computer Studies Concerning the Burn & Water Stains Visible on the Shroud” and “Further Studies on the Scorches and the Watermarks.”\nIf after that you are still convinced that everything that disagrees with your hypothesis is the result of a Vatican conspiracy, then I’m not sure we can help you further. There is no evidence at all that “the Vatican” (whoever they are) is convinced of the authenticity of the Shroud anyway.\n\n","date":"February 23, 2015 at 5:49 am","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","id":"comment-191628","author":"Hugh Farey","site":"shroudstory"},{"title":"A Bas Relief Match to the Shroud of Turin Image?","post":"The Jesus’ wife is the Church.\n\n","date":"February 23, 2015 at 9:30 am","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","id":"comment-191642","author":"Fabrício","site":"shroudstory"},{"title":"A Bas Relief Match to the Shroud of Turin Image?","post":"Sorry, comment in wrong post. I can not delete.\n\n","date":"February 23, 2015 at 9:36 am","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","id":"comment-191644","author":"Fabrício","site":"shroudstory"},{"title":"A Bas Relief Match to the Shroud of Turin Image?","post":"Hugh, thank you for those references. I will check them out.\n\n","date":"February 24, 2015 at 11:59 pm","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","id":"comment-191772","author":"paul gell","site":"shroudstory"},{"title":"A Bas Relief Match to the Shroud of Turin Image?","post":"Hugh, I have read Guerreschi and Salcitos paper in regards to the burn marks and water stains. I will be reconstructing the folds myself, to see how it accords with my findings. The Paper has a two points which I find completely unscientific: \nThe first and most glaring of those, is the introduction of a proposed “ANCIENT earthenware vessel” to explain the water stains on the shroud. This is complete conjecture, and a deliberate attempt to give the shroud an ancient character. They then point out that the waterstained corner is where the c-14 dating sample was taken from. (YET this sample came back with a date range of 1260-1390 from all three testing labs. Not ancient at all).\n  The paper concludes that there were three separate incidents of damage to the shroud:\n1. the chambery fire\n2. the water stains (which they conclude happened before the fire)\n3. the poker holes (which they conclude happened before the fire)\nThe second point of contention I have is with the arbitrary date thrown out for the poker holes of 1190. The shroud is unknown before its appearance in Lirey in the late 1350s. While there may be mentions earlier in history of shroud-like objects, there is no proof that such objects are the shroud of Turin. The affixing of a date of 1190, therefore, cannot stand as an accepted date for the event.\nIt is therefore wholly possible that incident 2 (the water stains) and 3. the poker holes, occurred during the same time period.\n\n","date":"February 25, 2015 at 12:41 pm","url":"https://shroudstory.com/2015/02/21/a-bas-relief-match-to-the-shroud-of-turin-image/","cat":"art","id":"comment-191815","author":"paul gell","site":"shroudstory"}]
