[{"title":"A good question about Justinian II coins","post":"Then Justinian portrayed himself on the solidus obverse as the representaive of Christ on Earth.\n\n","date":"October 23, 2012 at 6:43 am","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18092","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"Justinian in new hair style, that is…\n\n","date":"October 23, 2012 at 6:47 am","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18095","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"..eternally young!\n\n","date":"October 23, 2012 at 6:48 am","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18096","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"Mistyping: “representative”\n\n","date":"October 23, 2012 at 6:44 am","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18093","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"I do hope it’s the good answer ;-)\n\n","date":"October 23, 2012 at 6:44 am","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18094","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"His very young son + himself getting old = Makes the two “an eternally young man” as representative of Christ on earth?\n\n","date":"October 23, 2012 at 6:55 am","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18097","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"Justinian (669 — 11 December 711), surnamed the Rhinotmetos “the slit-nosed”, was the last Byzantine Emperor of the Heraclian Dynasty, reigning from 685 to 695 and again from 705 to 711. He tried to raise  his son Tiberius to the throne as joint emperor.\n\n","date":"October 23, 2012 at 7:08 am","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18098","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"According to Timothy E. Gregory, the first coin with the broken nose was made between 692-695. A strange coincidence is that Justinian was mutilated by having is nose cut off in 695, and called “Rhinotmetos” (the slit-nosed). A wild guess would be that this coin was not made between 692-695 but just after, however on the reverse of the coin Justinian’s nose is not broken.\nUnfortunately Gregory mentions and shows the other coin from the second part of the reign but does not explain clearly the reasons of this change in iconography.\nTimothy E Gregory, A History of Byzantium, 2010, Wiley-Blackwell, 189-191\n\n","date":"October 23, 2012 at 7:16 am","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18100","author":"Cazab","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"Cazab you wrote: “A wild guess would be that this coin was not made between 692-695 but just after, however on the reverse of the coin Justinian’s nose is not broken.” Don’t you forget, in 705 CE he was wearing a golden nasal prosthesis…\n\n","date":"October 23, 2012 at 1:52 pm","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18125","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"Most likely, he did seem Justian II took avantage of his nose wound/mutilation to emphasize his likeness as representative of Christ on earth.\n\n","date":"October 23, 2012 at 7:24 am","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18101","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"…Or this is an ironically  ‘prophetical mint’ for a man who thought himself the representative of Christ… ;-)\n\n","date":"October 23, 2012 at 7:30 am","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18102","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"Hence the minting change….\n\n","date":"October 23, 2012 at 7:34 am","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18103","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"…He featured the Christ as a young man as he (his representative) was getting old…. to ward off ageing.\n\n","date":"October 23, 2012 at 7:37 am","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18104","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"…and any ironical/offensive comparison with his ‘slit-nose’….\n\n","date":"October 23, 2012 at 9:51 am","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18107","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"The simple fact that under the second reign of Justinian II a completely different depiction of Christ was made that doesn’t look at all like the Pantocrator or the image on the Shroud is the VERY BEST PROOF that Justinian II and the persons under him who minted these coins NEVER saw the body image on the Shroud !  In fact, I was aware of this very different depiction of Christ done AFTER the one that represent the Pantocrator image of Christ, but I completely forgot to mention it… The fact that after the Pantocrator Christ coins, there were another sort of depiction of Christ on coins minted under the reign of Justinian II is a confirmation that the comment of yesterday (https://shroudstory.com/2012/10/22/based-on-the-shroud-of-turin-justinian-ii-solidus-has-face-of-christ-with-skewed-nose-and-unbalanced-hair-length/#comment-18030) was totally correct, i.e. that the depictions of a bearded Christ with long hair that we found on some coins of Justinian II NEVER represented the facial image that we see on the Shroud but instead, they were representing the Pantocrator icon of Christ, which is an artistic tradition that appeared around 500 A.D. and that was most probably influenced (directly or not) by the facial image on the Shroud.  In other words, the Pantocrator Christ coins of Justinian II were influenced directly by the Pantocrator icons of Christ, which were most probably influenced (directly or not) by the facial image on the Shroud.  This is the most probable reality versus these coins of Justinian II that represented not the Shroud but the Pantocrator icons, which were very popular in the Byzantine world.  And this high level of popularity can easily explain why the emperor wanted to mint some coins with this particular depiction of Christ.  \nAnd the bottom line is this :  Making wild speculations (a la Wilson) here in order to make believe that the Shroud was the direct model for the creation of such coins (sadly, Fanti, Whanger and other pro-Shroudies seem to follow this wrong path) would be a TERRIBLE MISTAKE from an historical point of view.\n\n","date":"October 23, 2012 at 10:52 am","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18108","author":"Yannick Clément","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"So YC is saying that the coins that Justinian II first minted were based on the Pantocrator image.  Yet the coins are a closer likeness to the Shroud image than is the Pantocrator!  Looks like muddled thinking to me!\n\n","date":"October 23, 2012 at 3:04 pm","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18140","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"Dave…  Look at this complete image of the same kind of Solidus coin mint by Justinian II that was described by Fanti : http://www.google.ca/imgres?q=justinian+coin&um=1&hl=fr&rlz=1W1MERD_frCA505&biw=1680&bih=867&tbm=isch&tbnid=Jvwev_L8L43kMM:&imgrefurl=http://www.coinlink.com/News/author/princeton-university-numismatic-collection/&docid=pa9fkHGeCXmD2M&imgurl=http://www.coinlink.com/News/wp-content/uploads/2009/12/pinceton_jesus_coin.jpg&w=342&h=267&ei=I_-GUNjIL-vU0gHx8IHADw&zoom=1&iact=hc&vpx=597&vpy=494&dur=16&hovh=198&hovw=254&tx=106&ty=99&sig=117702770363850355599&page=1&tbnh=160&tbnw=221&start=0&ndsp=28&ved=1t:429,r:16,s:0,i:118\nDo you see the Holy Bible Jesus is holding with his left hand and the way he’s raising his right hand as a sign of teaching ?!?  THIS IS EXACTLY THE SAME SET-UP YOU’LL SEE IN EVERY DEPICTION KNOWN AS THE PANTOCRATOR (except for the fact that in some Pantocrator icon, the right hand is depicted more in a way that refers to benediction than to teaching) !!!!!  \nPretending that this particular coin was meant to depict directly the face on the Shroud is RIDICULOUS !!!  It is a copy of the Pantocrator icon that was super popular in Constantinople at that time (end of the 7th century).  Did you forget the FACT that AFTER he mint this coin, Justinian II mint another coin (at the beginning of the 8th century) with a completely different depiction of a closely shaven Christ with tightly curly hair that has no relation whatsoever with the face of the Shroud ???  THIS IS A SURE PROOF THAT THIS EMPEROR NEVER SAW THE IMAGE ON THE SHROUD because if it did, he would never have allowed such a depiction of a beardless Christ since he would have been aware that Christ was wearing a beard !  \nBy the way, to answer the question of M. Farey at the top of this page (Can anyone suggest why the changed their mind about Christ’s appearance?), I have read in a very interesting paper about the history of Byzantine coins that this change was influenced by a new style of icon of Christ that has become very popular during that era (beginning of the 8th century) and that come from Syria…  It’s important to note that this drastic change most probably had nothing to do with the Iconoclast period, which started in 726 B.C., well AFTER the reign of Justinian II who ends up in 711.\nTo finish, here’s another question for you Dave :  Why do you ALWAYS questioned what I say ?  It’s becoming so dull that I start thinking about not replying to your comments no more.\n\n","date":"October 23, 2012 at 4:51 pm","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18149","author":"Yannick Clément","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"Yannick ~ How do you know the coins were modeled from the Pantocrator and not the Shroud image?  Your statement is rather definitive, but I am wondering the evidence you are basing this statement upon.\n\n","date":"October 28, 2012 at 12:01 pm","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18454","author":"Andy Weiss","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"Very simple my friend Andy :  Because the coins of Justinian II, just like other coins minted by other Byzantine emperors from the same era, are representing all the main characteristics of the Pantocrator image, especially the fact that Jesus is holding the Holy Scriptures in his left hand and that he’s raising his right hand as a sign of teaching.  Look at any Pantocrator image on the net and you’ll see that these are the 2 main characteristics of the Pantocrator images, along with the fact they always show a bearded Christ with long hair !\n\n","date":"October 28, 2012 at 7:36 pm","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18468","author":"Yannick Clément","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"Note that the different depiction of Christ on the coins from the second reign of Justinian II is also showing the 2 main characteristic of the Pantocrator.  I have read that this depiction came from Syria and was very popular at the time but I don’t know if these 2 features (the Holy Scriptures and the teaching hand) were present on this Syrian icon…  It’s possible that it was the case or maybe the artist who made that coin just change the bearded Christ with long hair face for this more youth face of Christ that show him with a nice little beard and curly hair.\n\n","date":"October 28, 2012 at 7:44 pm","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18470","author":"Yannick Clément","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"It is not a teaching but a blessing hand!\n\n","date":"October 28, 2012 at 7:47 pm","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18471","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"Teaching or blessing hand, the difference is thin and anyway, one of these 2 features were ALWAYS part of the Pantocrator icon, just like it is also on these coins that don’t represent directly the face on the Shroud but the Pantocrator Christ.\n\n","date":"October 28, 2012 at 8:16 pm","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18474","author":"Yannick Clément","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"YC wrote: “I have read that this depiction [the Panocrator Christ] came from Syria and was very popular at the time but I don’t know if these 2 features [2 main characteristics of the Pantocrator] (the Holy Scriptures and the teaching hand) were present on this Syrian icon… ”\nI then correctted him on this: “It is not a teaching but a blessing hand!”\nYC just replied: “Teaching or blessing hand, the difference is thin and anyway, one of these 2 features were ALWAYS part of the Pantocrator icon, just like it is also on these coins that don’t represent directly the face on the Shroud but the Pantocrator Christ.”\n  To your unintiated/oversimplistic eye, between blessing and teaching the difference is thin indeed!  \n  Most obvioulsy, your  sense for subtle details is definitetly NOT your cup of tea when you come to archaeologically, theologically and/or sindonologically look at (See? Understand? Decipher?) Byzantine Artworks/icons/images, my youngman. To an archaeocryptological eye, It is a no-brainer that there must have been at least one (if not  two perfectly overlappable) original template(s) to wit the Turin Shroud face (+ the Manoppello Veil face).\n  E;g. could you tell me exactly when the double or triple wips of hair (centre of hair line or forehead left side) and the skrewed/crooked/bent/apparently broken nose, FIRST appeared in the Pantocrator type? Is the former feature really parts and parcels of the pre-Justinian II’s Pantocrator Christ naturalistic type as you seem to imply? Is it or isn’t it?\n  You’d better do some homework before commenting on any and every subject especially Pantocrator Christ type\niconology.\n\n","date":"October 29, 2012 at 6:35 am","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18488","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"…all the more so as Justinian on ascending the throne with a cut off nose, had broken the tradition preventing the mutilated from Imperial rule.\n\n","date":"October 23, 2012 at 10:57 am","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18109","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"It is essential to know that between the 8th and 10th century, byzantium went through a religious crisis called iconoclasm that has influenced the depiction of Christ on coins. See http://www.sindonology.org/byzantineCoins/coins.shtml\n\n","date":"October 23, 2012 at 11:48 am","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18113","author":"latendre","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"This theological fight between the Orthodox in favor of the veneration of sacred images and the Iconoclasts offer a very simple reason for why there is absolutely no reference to a Shroud of Christ that bears a body image, at least for that particular period.  No doubt that if the Shroud would have been publicly known during that era, his survival would have been in great danger.  For example, if the Image of Edessa did survived during that time, it’s only because of a lucky historical context: the city of Edessa was occupied by the Arabs and the Christian Iconoclasts could put their hand on it in order to destroy it.\nAnd where was the Shroud during that period ?  No idea but certainly well hidden from the public…\n\n","date":"October 23, 2012 at 1:02 pm","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18120","author":"Yannick Clément","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"YC;  “if the Image of Edessa did survived during that time, it’s only because of a lucky historical context: the city of Edessa was occupied by the Arabs and the Christian Iconoclasts could (NOT)put their hand(s) on it in order to destroy it.”…”And where was the Shroud during that period ? No idea but certainly well hidden from the public…”\nMaybe in the same place as the Image of Edessa, or one in the same?  ;-)\nR\n\n","date":"October 23, 2012 at 1:39 pm","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18124","author":"Ron","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"I think we have well enough evidences Ron to completely reject that possibility !  He he!\n\n","date":"October 23, 2012 at 2:17 pm","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18131","author":"Yannick Clément","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"YC does not have one scrap of evidence, nor will ever find any, that the Shroud was NEVER in Edessa!  More muddled thinking!\n\n","date":"October 23, 2012 at 2:56 pm","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18139","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"Dave, you should relax and accept the FACT that the Mandylion was nothing more than a false painted relic of the living Christ that was completely different than the Shroud.  All the Byzantine scholars agree with me about that.\n\n","date":"October 23, 2012 at 4:52 pm","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18150","author":"Yannick Clément","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"On the coin obverse, Christ does look like a rejuvenated portait of the Byzantine emperor Justinian II.\n\n","date":"October 23, 2012 at 12:36 pm","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18119","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"In view of the interest in Justinian’s coins I thought I’d try and answer my own question and came across “The Numismatic Iconography of Justinian II” by James Breckenridge on scribd.com. He, interestingly, suggests that the first Pantocrator image may have derived from a statue of Zeus (removed from Olympia in 394 and finally destroyed in 462), which was roundly condemned by various church fathers (particularly Theodores Anagnostes), not because of its pagan origins, of which they were ignorant, but because it looked nothing like Jesus, who had short “frizzy” or “woolly” hair, as shown in various acheiropoietai, such as the one in Jerusalem described by the 6th century Anthony of Placentia, or according to a description in a (later) letter by John of Damascus, saying that the emperor Constantine had had images made “as the old authorities had described, with eyebrows that joined, fine eyes, a long nose, frizzy hair, a black beard…”\nBreckenridge discusses why Justinian might have reverted from one tradition to the other, and, to a certain extent, why the long-bearded Christ eventually returned, during the reign of Michael III. It certainly appears that there were at least two early traditions as to the appearance of Jesus, both based on miraculous images (epitomised by the Mandylion of Edessa – long haired – and the Image of Kamuliana – short haired), which struggled for universal acceptance until after the great iconoclasm, when Edessa won.\n\n","date":"October 23, 2012 at 1:17 pm","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18122","author":"Hugh Farey","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"One could surmise that the earlier depictions of Christ as frizzy haired etc, represented some kind of (Byzantine?) ideal of manhood, rather than matching Christ’s real appearance as depicted on the Shroud.\n\n","date":"October 23, 2012 at 3:11 pm","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18141","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"Not in my mind.  Look carefully at the Pantocrator styled images and the image on the Shroud and IT IS EVIDENT that the Pantocrator was influenced by the Shroud in some way (probably indirectly via a model from the Shroud) !!!  Imagine the sum of luck it would take if these Shroud-like depictions would have absolutely no link with the Shroud !!!!  This is just ludicrous…\n\n","date":"October 23, 2012 at 3:45 pm","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18145","author":"Yannick Clément","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"Hugh, good point.\nThe fact remains though the short-haired appearance of the Image of Kamuliana was misleading. Part of the holy icon face’s LONG HAIR (and  the same goes for the Holy Tile face ancient copy kept in Armenia) was covered with an embossed golden silver making Christ face appeared SHORT-HAIRed.\n\n","date":"October 23, 2012 at 2:10 pm","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18127","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"Really? I’m afraid I’d never heard of Kamuliana till I read Breckenridge’s article. Is there a picture of it on the internet?\n\n","date":"October 23, 2012 at 2:16 pm","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18129","author":"Hugh Farey","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"There are just a few manuscripts that refers to that image and I don’t think there is one real description of it except that it was an image of Christ (probably just the face) on a linen cloth.  So, it’s most probable that it was pretty much the same kind of relic than the Image of Edessa but there is no way to be certain about that, since there is no artistic copy of it (as I know) and as I just said, there is no exhaustive description of it in any ancient manuscript…  As I remember, one of those few manuscripts refers to this image as a banner that was once exposed to the enemy from the gates of Constantinople because it was considered as the palladium of the city, just like the Image of Edessa was for that city too.  In my opinion, because the two images appeared around the same time (second half of the 6th century), this Image of Kamouliana was most probably a painted portrait of the face of the living Christ on linen, just like the Image of Edessa.  No doubt that this is the most likely scenario for the historical context of the time in the Middle East (with all the theological debates that were going on versus the supposed two natures of Christ, the Incarnation and possibly also versus the veneration or not of sacred images)…\n\n","date":"October 23, 2012 at 3:43 pm","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18144","author":"Yannick Clément","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"Typo: “appear”\n\n","date":"October 23, 2012 at 2:16 pm","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18130","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"Second known example showwing the same misleading feature, the Uronica or Acheropita kept in the Latran Palace, in Rome.\n\n","date":"October 23, 2012 at 2:14 pm","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18128","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"For some scholars, the Uronica is thought  to be the Kamuliana, for others it is the Veil of Mannopello….\n\n","date":"October 23, 2012 at 2:20 pm","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18132","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"Typo: The Uronica is thougt to be A COPY OF the Kamuliana.\n\n","date":"October 23, 2012 at 2:21 pm","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18133","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"+ Typo (sorry): For others The Veil of Manoppello is thought to be the ORIGINAL of the Kamuliana image…\n\n","date":"October 23, 2012 at 2:23 pm","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18134","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"The fact is the Manoppello Veil face does look much younger than the TS man’s.\n\n","date":"October 23, 2012 at 2:28 pm","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18135","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"\nYannick Clément :I think we have well enough evidences Ron to completely reject that possibility ! He he!\nI’m not sure about that Yannick. Infact I would say that is humorous.\nR\n\n","date":"October 23, 2012 at 2:36 pm","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18136","author":"Ron","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"…and the Image of Kamulia (or its copy?) is said to have been tanslated to Constantinople in 574 CE and disappeared in 705 CE.\n\n","date":"October 23, 2012 at 2:48 pm","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18137","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"705 CE, the vevy year Justinian II ascended for the second time on the throne…\n\n","date":"October 23, 2012 at 2:52 pm","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18138","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"Hugh, in an attempt to really answer your very good question, I would say Justinian II shifted from “a slightly neo-traditional shroud-like NATURALISTIC Pantocrator type to a totally neo-traditional non-shroud-like STYLIZED curly-haired beard-cropped Pantocrator type since he had been mutilated (both his nose and tongue had been cutt off  before he was sent to exile in 695 CE). On ascending to the throne for the second time in 705 CE, the Byzantine emperor was wearing a golden nose  prosthesis.  As Justinian “Rhinotmetos” (the slit-nosed), he then no longer could credibly feature himself on his coins as the NATURAL but ONLY as the “stylized-faced” representative of a STYLISED Christ on Earth.\n\n","date":"October 29, 2012 at 7:25 am","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18489","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"I just forget to tell you, in Greek the word ‘prosthesis’ plays with ‘antiprosoppos’ (representative) and could haveled/or did lead to the most unfortunate pun ‘antiprothesoppos’ to mock the emperor as both the representative (of Christ on Earth and wearer of a prosthesis.\n\n","date":"October 29, 2012 at 8:15 am","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18490","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"…or ‘antiprotheosoppos’ even worse…\n\n","date":"October 29, 2012 at 8:16 am","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18491","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"Typos: “antiprosthesoppos”\n\n","date":"October 29, 2012 at 8:19 am","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18492","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"+ typo (sorry): the two real Greek puns  here are “antiprosthesisoppos” and “antiprostheosoppos”\n\n","date":"October 29, 2012 at 9:59 am","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18508","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"Both Greek words playng with Latin suppositus, ‘beneath’\n\n","date":"October 29, 2012 at 8:26 am","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18493","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"Reminder: The Chrysotriklinos (Greek for “golden reception hall”), was the main reception and ceremonial hall of the Great Palace of Constantinople (built in the late 6th c. CE). Above the imperial throne was placed an image of Christ enthroned (the Image of Kamulia now in Rome Lateran palace or its copy?). Thus the Emperor was ‘beneath’.\n\n","date":"October 29, 2012 at 8:49 am","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18496","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"Second reminder: the Image of Kamulia (or its copy?) is said to have been tanslated to Constantinople in 574 CE and disappeared in 705 CE the vevy year Justinian II ascended for the second time on the throne…\n\n","date":"October 29, 2012 at 9:01 am","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18498","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"I think that’s a really good answer. Thank you. And while I’m here, I found some of the crooked noses you found, but am not really convinced they are intentional. I agree some look as if the crook might have been in the die, but given the fairly haphazard stamping technique, I guess at that scale the odd imperfection didn’t bother the minters much. No one could claim that crooked noses were characteristic of the Christ face as it appeared on coins in general.\n\n","date":"October 29, 2012 at 9:02 am","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18499","author":"Hugh Farey","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"Shall the changed on Justinian II’s solidus obverse to be (also) connected to the image of Kamulia’s disappearance?\n\n","date":"October 29, 2012 at 9:04 am","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18500","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"Typo: Is the change in representaion of Christ face  on Justinian II’s solidus obverse to be (also) connected with the image of Kamulia’s disapparition?\n\n","date":"October 29, 2012 at 4:32 pm","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18517","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"Error: disapparition (instead of disappearance)\n\n","date":"October 29, 2012 at 9:05 am","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18501","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"Hugh, the fact is they are several others. I do agree with you though, not all the crooked nosed Christ face solidius et al obverses I rapidly gave you the refernce are intentional. However this is quite a different thing with the Byzantine gold coin Giulio shown us. Methinks the “close up on the nose” is a Fleur de coin (FDC) detail from a Coin of exceptionally high quality.\n\n","date":"October 29, 2012 at 9:17 am","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18502","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"Typo: solidu obverses\n\n","date":"October 29, 2012 at 9:30 am","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18505","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"Typo (sory, writing in haste): solidus\n\n","date":"October 29, 2012 at 9:30 am","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18506","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"Typo error: “I do agree with you though, not all the crooked nosed Christ face solidius et al obverses I rapidly gave you the refernce MIGHT HAVE BEEN intentional (actually no one can say for sure for the four I gave you the references).\n\n","date":"October 29, 2012 at 9:19 am","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18503","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"A first  fact remains though: a comparative study  of e.g. the TS face-MV face perfect overlapping nose and one of the 4 Byzantine gold coins (I rapidly mentioned here), is quite a perfect match. The second fact is such an oddity appears to be not so sporadic in Byzantine gold coinage as one might have thought at first sight.\n\n","date":"October 29, 2012 at 9:28 am","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18504","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"Hugh and all, you have to compare (as I did) Giulio’s Justinian II’s solidus obverse Christ face and those on the 3-4 I rapididly gave you the reference WITHThierry Castex site banner (ST face 2D image after equalization). AND YOU’LL SEE WHAT I ARCHAEOCRYPTOLOGICALLY REALLY MEAN…\n\n","date":"October 29, 2012 at 10:35 am","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18509","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"First time I’ve seen Castex’s site. What a remarkable set of pictures. The nose on the banner makes me feel quite ill!\nSlightly off-topic, he also explains why the apparently straight back image is actually longer than the apparently convoluted front image, with his ‘bit folded over.’ Very clever indeed.\n\n","date":"October 29, 2012 at 10:58 am","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18511","author":"Hugh Farey","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"The TS back image ‘bit folded over’ is totally consistent with Christ burial sheet as depicted by the 1192-1195 CE Pray codex Benedictine monk artist…\n\n","date":"October 29, 2012 at 1:47 pm","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18513","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"Hugh & Louis et al,\nthis short comment to tell you, in addition to the first four Byzantine gold coins I referred you to internet, I found 4 “more visually convincing” Justinian gold soldii with skewed nosed Pantocrator Christ face (see NumidsBids, ancientcoins.com, lot numbers: 1729; 578; 579 and  580). They are to added to the 2 (or 4) Giulio already mentioned  \nThe  SECOND flash illustrative paper on the issue, I sent via email to Dan is entitled: PIECES OF NUMISMATIC SINDONOLOGICAL EVIDENCE AS PLAIN AS THE NOSE ON THE ARCH-SCEPTICS’ FACE? Will Dan publish it to oppose to YC et al’s spurrious contentions? Just for the sake of Intellectual honesty, he should…\n\n","date":"October 30, 2012 at 3:05 pm","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18610","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"..the fact is there are many documental similarites and congruences between the Justinian II’s solidus Christ face and Turin Sindon and Manoppello Veil faces.\n\n","date":"October 30, 2012 at 3:16 pm","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18614","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A good question about Justinian II coins","post":"Typo: ancientcoin archives.com\n\n","date":"October 30, 2012 at 3:06 pm","url":"https://shroudstory.com/2012/10/23/a-good-question-about-justinian-ii-coins/","cat":"art","id":"comment-18611","author":"Max Patrick Hamon","site":"shroudstory"}]
