[{"title":"Amazing Technology and Ecumenical Developments","post":"¡Impresionante fotografía!\n\n","date":"March 11, 2012 at 8:32 am","url":"https://shroudstory.com/2012/03/11/amazing-technology-and-ecumenical-developments/","cat":"art","id":"comment-9200","author":"co","site":"shroudstory"},{"title":"Amazing Technology and Ecumenical Developments","post":"How anyone can question as to who was the greatest artist that ever lived, and not put Michaelangelo in the forefront confounds me! He was by any word a magician, his sculptures bearing almost lifelike personas and his paintings to me anyways, far outmatching the likes Leonardo’s. I watched a documentary recently on the painting of the Sistene Chapel, it stressed a point basically unknown by most people; that the ceiling is not flat, that it has arches, yet the figures do not distort by this fact, and in fact some figures although the arch will bend the light one way the figure seems to defy physics and is leaning the other way!….What an incredibly amazing work of art this is….\nThis is an amazing piece of technology, thanks Dan for posting it.\nR\n\n","date":"March 11, 2012 at 10:06 am","url":"https://shroudstory.com/2012/03/11/amazing-technology-and-ecumenical-developments/","cat":"art","id":"comment-9203","author":"Ron","site":"shroudstory"},{"title":"Amazing Technology and Ecumenical Developments","post":"Dan: A friend sent me the URL at beginning of March which I sent onto several other acquaintances.  One knowledgable reply sent me the following important comment, just so that we keep Mick Angelo.in proper perspective:\n“It’s not all Michelangelo’s work, he painted the ceiling and the ‘Last Judgement’ (with the assistance of his pupils), the frescos on the side walls were done by a variety of artists including Pietro Perugino, Sandro Botticelli, Domenico Ghirlandaio, Cosimo Rosselli, Hendrik Van den Broeck, Matteo da Lecce.  For details see http://en.wikipedia.org/wiki/Sistine_Chapel \nIt’s truly an amazing piece of technology.  As several others have commented: “You can see it from your armchair; You don’t need to crick your neck; You don’t need a hand mirror; You get to see it close up. You don’t get hurried along by the security people; And no worries about the Italian stifling heat wave!”\n\n","date":"March 11, 2012 at 4:03 pm","url":"https://shroudstory.com/2012/03/11/amazing-technology-and-ecumenical-developments/","cat":"art","id":"comment-9214","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Amazing Technology and Ecumenical Developments","post":"Lets not downplay Michaelangelo’s (M’s) work here! Yes others painted the side frescos far before M’s work, as the ceiling was adorned only with ‘stars’ beforehand. M managed to paint 1,100 sq meters, which required basically (looking up) for four years! …It is not only a herculaneum accomplishment, physically and mentally, but an astounding work of art.\nR\n\n","date":"March 14, 2012 at 4:59 pm","url":"https://shroudstory.com/2012/03/11/amazing-technology-and-ecumenical-developments/","cat":"art","id":"comment-9324","author":"Ron","site":"shroudstory"}]
