[{"title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica.","post":"OK, but you can’t tell me the Manoppello cloth ‘matches’ the Shroud image or was miraculously created.  For starters, God is a better artist than that.\n\n","date":"December 17, 2013 at 9:16 am","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","id":"comment-60849","author":"Jeffrey Liss","site":"shroudstory"},{"title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica.","post":"O.K. Your attempts are appreciated, but there is still a long way to go.\n\n","date":"December 17, 2013 at 9:38 am","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","id":"comment-60860","author":"Louis","site":"shroudstory"},{"title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica.","post":"Hey guys, of course there is still a long way to go, but the point of my presentation was not to prove that Manoppello is ‘miraculous’, or matches the Shroud, but is the same cloth that was venerated as Veronica Veil in the medieval Rome, until the begining of 17th century, when it was replaced by the current version, and tradition of public exhibitions suddenly and unexpectedly vanished.\nThe conception that the Manoppello is actually the original Veronica has been first suggested by Pfeiffer around 1990, and quickly dismissed by several ‘authorities’ in the Shroud world, such as Ian Wilson (see article “Rome, Italy. Jesuit professor claims ‘discovery’ of the of the Veronica’ from BSTS #50 http://www.shroud.com/pdfs/n50part1.pdf ). Other resaerchers were also sceptical about this, for example Roberto Falcinelli (see http://www.shroud.com/pdfs/roberto.pdf and http://www.acheiropoietos.info/proceedings/FalcinelliManoppelloWeb.pdf )\nHere is, in my opinion rather conclusive proof that Falcinelli, Hesemann, Wilson are wrong -the Manoppello is Veronica. According to Pfeiffer, it is also Image of Camuliana, and he has several good arguments to support this thesis (see http://www.acheiropoietos.info/proceedings/PfeifferWeb.pdf ).\nWhy for example Wilson is opposing this? Because actually, the Manoppello is game-changer! It is another undesirable factor, that needs to be included in Shroud research, providing fascinating solutions to some problems, but also creating a multitude of others. The whole Wilson’s Mandylion theory has to be seriously revised for example -there is another candidate (besides the Shroud) for this role. That’s why Wilson is against Manoppello.\n\n","date":"December 17, 2013 at 11:12 am","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","id":"comment-60906","author":"O.K.","site":"shroudstory"},{"title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica.","post":"O.K. Sorry, your arguments should be presented in an article or paper, not in bits and pieces with links. It does not matter if you wish to not disclose your identity now, you can continue to sign as O.K. Hesemann is a sort of Vatican insider, possibly having had access to information that Wilson did not have.\nYou still have a long way to go to provide proof. Before I forget, why the big difference between what is seen in Manoppello and the face attributed to Campin? This second face is more like what we see on the Turin Shroud.\n\n","date":"December 17, 2013 at 11:50 am","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","id":"comment-60930","author":"Louis","site":"shroudstory"},{"title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica.","post":"Louis: Hesemann is a sort of Vatican insider, but his arguments against Manoppello, presented in his “Die stummen zeugen von Golgatha” edited in 2000,  are very poor, and have been refuted by Badde and others. Hesemann assumes that because Manoppello looks (on some photographs) like a painting, it must be a painting, which is wrong, becuase it is definetly not any classical painting. He also claims that Manoppello (measuring 24×17 cm) is too big for old 34×31 cm (Falcinelli claims 31.7×29.5, Badde 32×28 cm, virtually everyone claims different dimension) Vatican frame from 1350. But the outer edges of Manoppello were cut by father Clemente da Castelvecchio in 1608! So the dimensions are different! This also explains why Campin’s Veronica Veil is larger than Manoppello.\nSorry, your arguments should be presented in an article or paper, not in bits and pieces with links. \nActually what I presented is not my origianl idea. It was alredy presented in the books by Badde and Resch long ago! But, like many other information about Manoppello, have been virtually ignored by some wise guys knowing better!\nBefore I forget, why the big difference between what is seen in Manoppello and the face attributed to Campin? This second face is more like what we see on the Turin Shroud.\nI see no such big difference. Open eyes, serene face, long nose. brown hair… It may look like the Shroud, because  of dark skin, but this is due to the painting technique -it is hard (and missing the point of an artist) to paint a pale, hardly visible face on transparent cloth. \nBut if this is not Manoppello, then how do you explain transparent Veil painted by Campin?\n\n","date":"December 17, 2013 at 12:16 pm","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","id":"comment-60945","author":"O.K.","site":"shroudstory"},{"title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica.","post":"O.K. One has to be cockeyed to not notice the transparent veil in the image you reproduced, but let’s not forget that it is only attributed to Campin. But what about the teeth and beard, different from what we “see” on the Shroud face? There seems to be evidence that the Manoppello veil was re-touched with pigment, however that does not make it a painting. A similar thing is said to have happened with the Guadalupe Tilma and Callahan said that we would have to wait for the pigment to disappear.\n\n","date":"December 17, 2013 at 12:37 pm","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","id":"comment-60961","author":"Louis","site":"shroudstory"},{"title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica.","post":"but let’s not forget that it is only attributed to Campin\nThe author is the so-called “Master of Flémalle”, but scholars are quite convinced that he is actually Campin (see http://en.wikipedia.org/wiki/Robert_Campin )\nAnyway we can be certain that the painting dates back to the 15th century.\nBut what about the teeth and beard, different from what we “see” on the Shroud face? There seems to be evidence that the Manoppello veil was re-touched with pigment, however that does not make it a painting. A similar thing is said to have happened with the Guadalupe Tilma and Callahan said that we would have to wait for the pigment to disappear.\nHere I don’t know what you mean. Of course they are different, because the Shroud image has a different nature than Manoppello. But there are quite convincing studies that both images represent the face of the same man. See study of Resch http://www.acheiropoietos.info/proceedings/ReschWeb.pdf , although in my opinion there are some serious flaws in his methodology. Blandina Paschalis-Schloemer has also published large format (and large price) album with comparison between Shroud-Manoppello-Oviedo, suggesting they both show the same face. See also the work of Fanti & Jaworski, (http://www.shroud.com/pdfs/jaworski.pdf ) giving additional corroborate evidence that the face of Manoppello and the Shroud represent the same person (although, contrary what the paper’s title may suggest, the Manoppello has no 3D characteristics comparable to the Shroud, Jaworski nad Fanti simply use the 3D processing as additional tool for comparative analysis).\nAnd if they represent the face of the same man, thus they must have something in common -the question is, what is relation between the two?\n\n","date":"December 17, 2013 at 1:02 pm","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","id":"comment-60970","author":"O.K.","site":"shroudstory"},{"title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica.","post":"In an article I published some years ago, I gave this example of Campin and two more examples of transparent veil.\nFlemish School, 15th Cent., Bourg-en-Bresse (look below the hands to see how much it is transparent):\n\nMichael Wolgemut, 15th Cent., Lorenzkirche Nürnberg\n\nwhich is a detail from this painting\n\nWe can only conclude that among countless artists who painted a not transparent Veronica veil, there were just a few who painted a trasparent veil, among them the author of the Manoppello veil.\nA question for O.K.: How do you know that the Rome Veronica was transparent? Nobody knows what it looked like. The painters who painted a Veronica (at least those who painted before ca. 1600), as far as we know, had never seen the (supposed) original that was in Rome. They painted out of their fantasy and according to their own style. The one painter who might have had a chance to see the original was Ugo da Carpi who in 1525 painted this Veronica just for the altar (in old St. Peter) where the Veronica itself was kept.\nhttp://veronicaroute.com/1525/04/29/1525-ca/\nBut there is no proof that Ugo had really seen the original. Possibly he copied the face from a mandylion-like portrait that also was in Rome. At any rate his Veronica is not transparent.\nUgo was copying from a contemporary drawing by Parmigianino which is shown at the end of the same webpage. He reproduces the drawing faithfully but changes the face of Christ, and rightly so, whether he had seen the original or not, because the style of Parmigianino was not compatible with a Veronica that should have been in Rome since several centuries and therefore had an earlier style. Neither the Manoppello painting is compatible.\n\n","date":"December 17, 2013 at 2:15 pm","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","id":"comment-61007","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica.","post":"Gian Marco:\nFirst thank you for some addtional examples, besides Campin, illustrating the point.\nAnd next, let’s analyze your twisted logic and futile attempts to turn everything upside down:\nWe can only conclude that among countless artists who painted a not transparent Veronica veil, there were just a few who painted a trasparent veil, among them the author of the Manoppello veil.\nThose a few were enough to give us evidence that Veronica Veil and Manoppello are the same -and contrary to your fantasies, the alleged author of Manoppello is not among them.\nBecause:\n1.) Manoppello is not a conventional painting.\n2.) Had Manoppello been just another painting showing transparent Veronica, so where is the prototype?\nWHERE IS THE PROTOTYPE, Gian Marco? Can’t you distinguish between paintings of the transparent Veil (which is quite ambitious task for painters, so that’s why this feature is rarely shown on pictures), and the transparent Veil itself?\nThat’s how the sceptics loose their minds Gian Marco! Isn’t a dogmatic scepticism a sickness of the mind?\nAnd some other issues mentioned:\nA question for O.K.: How do you know that the Rome Veronica was transparent? Nobody knows what it looked like. The painters who painted a Veronica (at least those who painted before ca. 1600), as far as we know, had never seen the (supposed) original that was in Rome.\nReally Gian Marco? Back to any book about Veronica Veil! There were regular public exhibitions since 1208, to 1606, as far as I know.\n\n","date":"December 17, 2013 at 2:53 pm","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","id":"comment-61032","author":"O.K.","site":"shroudstory"},{"title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica.","post":"O.K. and Gian Marco: In my interview with Father Pfeiffer posted on the Holy Shroud Guild he is asked about the origin of the tradition that the Veronica was transparent. His reply is that it can only be said that the fourteenth century reliquary had glass on both sides. As pointed out more than once, a lot more work needs to be done.\n\n","date":"December 17, 2013 at 2:55 pm","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","id":"comment-61034","author":"Louis","site":"shroudstory"},{"title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica.","post":"Yes, Louis, it is raised by Badde, questioned by Falcinelli, and so the fun goes on. You can see the reliquary here http://manoppello.eu/eng/gfx/rama.jpg\n\n","date":"December 17, 2013 at 3:00 pm","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","id":"comment-61039","author":"O.K.","site":"shroudstory"},{"title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica.","post":"Badde also claims that Martin Luther, when one day came to see Veronica, saw only transparent Veil, with no face image upon it, and went out disgusted that the Pope deceives believers! And later of course came out with 95 theses, and so on. Interesting, but I must find original source of that.\n\n","date":"December 17, 2013 at 3:10 pm","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","id":"comment-61046","author":"O.K.","site":"shroudstory"},{"title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica.","post":"Here is the source for Luther: “Wider das Papsttum zu Rom vom Teufel gestiftet” (1545). The sentence is:\n“… gleich wie sie mit der Veroniken auch thun, geben für, es sei unsers Herrn Angesicht in ein Schweistüchlin gedruckt, Und ist nichts, denn ein schwarz bretlin viereckt, da henget ein klaretlin für, darüber ein anders klaretlin, welches sie auffzihen, wenn sie die Veronica weisen, Da kan der arm Hans von Jene nicht mehr sehen, denn ein klaretlin für eim schwarzen bretlin, Das heisst denn die Veronica geweiset und gesehen, und hie ist grosse andacht, und viel Ablas bey solchen ungeschwungenen Lügen.”\nO.K. may indicate the words where Luther speaks of a transparent veil. I cannot find them. At any rate, Luther’s passage cannot be ranked as a first-hand testimony.\n\n","date":"December 17, 2013 at 10:32 pm","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","id":"comment-61247","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica.","post":"Thank you Gian Marco. Google translates it this way, but it doesn’t help much:\nthe same as they do with the Veroniken also provide for, be it printed our Lord’s face in a Schweistüchlin, And nothing, because a black bretlin four hatched since henget a klaretlin for, about klaretlin a different, which they auffzihen when the Veronica have, kan Since the poor Hans von those no longer see, because a klaretlin for eim black bretlin, that is because the Veronica geweiset and seen, and God is with great devotion, and much Ablas bey such ungeschwungenen lies.\nHe says something that ‘poor Hans no longer see’, that there is ‘nothing’, but truly I don’t know. What is it ‘klaretlin’?\nIn his book The Face of God, Badde provides an interview  with Pfeiffer, who claims that this anti-papal pamphlet of Luther was one of the indications that convinced him that Veronica and Manoppello are the same. That Luther saw nothing, except for a linen on black board -under strong light the face on Manoppello disappears, as it is presented on the figure above. Similar quotation is provided also by Gaeta, citing from G. Alberigo, Decisioni dei Concili ecumenici, Utet, Torino 1978 pg. 713. But there is nowhere a key word “transparent” -one needs rather to guess this, than than to have a clear statement already on a platter.\n\n","date":"December 18, 2013 at 4:41 pm","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","id":"comment-61794","author":"O.K.","site":"shroudstory"},{"title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica.","post":"O.K., you can find English translations on the web, for example here (search for the word Luther):\nhttp://www.mutualart.com/OpenArticle/A-Point–Ceaselessly-Pushed-Back—The-O/36D330CF8CEF6AB6\nor in the book “Life of Luther” by Sears, p. 144, available on Google Books.\nThe word “Klaretlin” is practically unheard of in German, apart from that sentence by Luther. In very few examples I have found, German authors who refer to that passage, may intend it as a piece of cloth without specifying that it should be transparent.\nAdd to it that Luther was writing in 1545 and had been in Rome many years before in 1510. He was not so much interested in giving a precise description as to discredit the cult of the Veronica. As far as I know, in the course of centuries there have been no statements by first-hand witnesses who testify a transparent veil and the words of Luther, whatever they mean, taken alone have little weight.\nIf you like transparent Veronicas, you find several examples in this page from a rich website:\nhttp://veronicaroute.com/tag/velo-trasparente/\nI do not worry about the words of Pfeiffer or Badde or Gaeta. They believe that the Manoppello veil was produced by a miracle 2000 years ago in a sepulchre in Jerusalem. May I think that the portrait is not beautiful enough for being a miracle?\n\n","date":"December 18, 2013 at 8:23 pm","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","id":"comment-61941","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica.","post":"O.K. The clue lies with Chiara Vigo, the world’s lone expert in this field, who also thought it was byssus. You can’t paint on byssus. Go to the link:\nhttp://www.catholicculture.org/culture/library/view.cfm?recnum=6346\n\n","date":"December 17, 2013 at 3:26 pm","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","id":"comment-61052","author":"Louis","site":"shroudstory"},{"title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica.","post":"Louis, thanks for the link. Actually I have Badde’s first book, and plan to buy a second one. I have also books by Gaeta, and Resch, Centini and Wilson. Maybe there will be more soon.\nI doubt the claim that Chiara Vigo is the world’s lone expert in this field, but nevertheless I respect her opinion. However it is still uncertain whether the material of the Shroud is fine linen (byssus) or sea silk (which is also called byssus). The fact of touch-ups contradicts the claim that painting on byssus is impossible.\nSee article by Jaworski (http://www.acheiropoietos.info/proceedings/JaworskiWeb.pdf and earlier presentation http://old.enea.it/eventi/eventi2010/ArcheiropoietosImage040510/Jaworski.pdf )\n\n","date":"December 17, 2013 at 3:37 pm","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","id":"comment-61060","author":"O.K.","site":"shroudstory"},{"title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica.","post":"Guys, here is alleged quotation from Luther. Source: http://milujciesie.org.pl/nr/the_main_topic/the_greatest_miracle_in.html \n“They claim Veronica’s veil bears the imprint of the true face of Our Lord, when in fact it is a piece of transparent linen, which they hold up for people to see. The poor simpletons see nothing but a clear linen stretched on a black board.” \nI will further try to find the original source of the quote.\n\n","date":"December 17, 2013 at 3:46 pm","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","id":"comment-61064","author":"O.K.","site":"shroudstory"},{"title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica.","post":"O.K. I would leave Luther out, he was better with texts… and beer (like a good German).\nWhat I said regarding Chiara Vigo is that she is the lone expert working in the field, which you will see in the link:\nhttp://www.mediahaka.com/weaving-sea-silk-chiara-vigo-is-the-only-woman-in-the-world-who-still-works-the-byssus/\nIt is known that there was touching up with pigment on the veil,and how that was done no one knows. The big impediment in further research is that the glass cannot be removed.\nAs I said earlier, the Vatican Veronica is still exhibited there during Lent, with a priest holding it up for the faithful to see. And Benedict XVI did not seem impressed when he went to Manoppello.\n\n","date":"December 17, 2013 at 4:01 pm","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","id":"comment-61074","author":"Louis","site":"shroudstory"},{"title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica.","post":"And we also have the story that the Veil was looted by Lutheran soldiers in the sack of Rome in 1527 and was seen being hawked round the taverns for sale but then miraculously  re-appeared in St Peter’s some decades later.  (Hans Belting, Likeness and Presence, p. 220, who gives as his  reference  A. Chastel, The Sack of Rome, Princeton 1983, p.104.- Belting thinks that it actually perished in 1527.)\nJust a story maybe but that is the problem with all relics, contradictory legends about them abound!\n\n","date":"December 18, 2013 at 5:34 am","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","id":"comment-61426","author":"Charles Freeman","site":"shroudstory"},{"title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica.","post":"Charles, that’s right, I’ve read about that, but as I was telling O.K. more data is needed in order to not jump to hasty conclusions and then have to face surprises.\n\n","date":"December 18, 2013 at 8:20 pm","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","id":"comment-61939","author":"Louis","site":"shroudstory"},{"title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica.","post":"I think that O.K. has strong arguments in favor of the Veil of Veronica to be the Veil of Manoppello strictly based on the transparency depicted by several painters of the Veil of Veronica.\nThe argument that many painters depicted the Veil of Veronica as not transparent is weak because 1) it is indeed a difficult technique to render, 2) the Veil of Veronica was probably shown from time to time with an opaque background (which obviously make the Veil appears as non transparent), 3) it was not the intention of the painter to show the material reality of the Veil of Veronica. Moreover, Campin was a master at reproducing elaborate (near photographic) details of reality not done by most painters of his time: he took care of reproducing the material reality of the Veil of Veronica which he perceived as transparent or knew to be transparent. Such a detail would not have been reproduced by Campin if he did not have strong evidence that it was transparent. \nAnd most importantly, if no painting of the period ever shown a transparent veil (or cloth) for a different subject, then the probability that the Veil of Veronica was indeed known to be transparent is quite reinforced: an artistic perception that was only applied to the Veil of Veronica.\n\n","date":"December 18, 2013 at 4:17 pm","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","id":"comment-61776","author":"Mario Latendresse","site":"shroudstory"},{"title":"Guest Posting by O.K. – A very short proof that Manoppello Cloth =Veil of Veronica.","post":"My reflections about Vernicle there:\nhttp://manoppello.eu/eng/index.php?go=weronika\nJuliusz\n\n","date":"January 11, 2014 at 5:03 pm","url":"https://shroudstory.com/2013/12/17/guest-posting-by-o-k-a-very-short-proof-that-manoppello-cloth-veil-of-veronica/","cat":"guest_posting","id":"comment-73080","author":"Juliusz","site":"shroudstory"}]
