[{"title":"Quote for Today: Did Leonardo Paint This","post":"It’s a strange comment, isn’t it.  Although I agree the image does remind me of the Shroud, I imagine a different scenario: perhaps Leonardo was asked to examine the Shroud and attempt a likeness. That’s more plausible than the outrageous theory that Leonardo created the Shroud somehow. \nI like this painting of the Salvador Mundi. It’s gentle and majestic, both. Christ is regal and yet approachable. \nThis person seems to think that DaVinci had a certain style in everything he did, but I don’t think that’s true of any artist I’ve known so why should it be true of the Old Masters?  Artists are creative people who do enjoy experimenting, changing, creating, growing as artists. If DaVinci wanted to create an icon, well… why not?\n\n","date":"November 10, 2011 at 12:38 pm","url":"https://shroudstory.com/2011/11/10/quote-for-today-did-leonardo-paint-this/","cat":"art","id":"comment-4701","author":"AnnieCee","site":"shroudstory"},{"title":"Quote for Today: Did Leonardo Paint This","post":"What’s sad is that, even today, this non sense about the Shroud being an artwork take a lot of precious time on many Shroud researchers that should use it on other topics that would be more relevant !!!  McCrone spirit is alive and well !!!\n\n","date":"November 10, 2011 at 2:03 pm","url":"https://shroudstory.com/2011/11/10/quote-for-today-did-leonardo-paint-this/","cat":"art","id":"comment-4702","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for Today: Did Leonardo Paint This","post":"I have never seen Christ holding an orb in any rendition of him. Interesting… Maybe this isn’t Christ at all. Maybe it is someone Leonardo met that he feels looked like Christ? I am not really sure since I don’t follow his work that closely.\n– Eric\n\n","date":"November 10, 2011 at 3:21 pm","url":"https://shroudstory.com/2011/11/10/quote-for-today-did-leonardo-paint-this/","cat":"art","id":"comment-4703","author":"Eric","site":"shroudstory"},{"title":"Quote for Today: Did Leonardo Paint This","post":"Firstly, I think someone should educate Mr.Dorment on a couple of things. One being the Sudarium has no facial image, Two; the Shroud image has definitively been proven not to be a painting.\n As for the painting being an LDV work, I am no expert, but I would question it being so from some of my personal observations; One, the ‘facial’ proportions are off from typical LDV paintings, especially the eyes. Two, it is unlike LDV to have a portrait facing directly toward the observer in any of his paintings (in saying this, if it was a work of LDV, I would surmise it is his rendition from possibly viewing the Shroud)…dispelling the above mentioned issues. But the hands do have a striking comparitiveness to LDV’s style.\nI might suggest though that Mr.Dormant just lost his Fiver. He can just deposit it into my Paypal account. ;-)\nR\n\n","date":"November 10, 2011 at 4:18 pm","url":"https://shroudstory.com/2011/11/10/quote-for-today-did-leonardo-paint-this/","cat":"art","id":"comment-4705","author":"Ron","site":"shroudstory"},{"title":"Quote for Today: Did Leonardo Paint This","post":"Hey Ron, finally we agree on something !!!  FABULOUS ! ;-)\n\n","date":"November 10, 2011 at 5:00 pm","url":"https://shroudstory.com/2011/11/10/quote-for-today-did-leonardo-paint-this/","cat":"art","id":"comment-4706","author":"Yannick Clément","site":"shroudstory"},{"title":"Quote for Today: Did Leonardo Paint This","post":"Eric, I agree that the plain glass Orb is unusual. Most of the time, the iconic image of Salvador Mundi (Savior of the World) is holding a globe or some other “ball” with bands and a cross on it: which apparently has meaning for Catholics, I just don’t know what that is. \nThe plain glass orb is unusual, and beautiful. It looks as if there are stars in the orb… To ME, it looks as if DaVinci is saying that Christ is more than the Savior of the World: He is the Savior and Creator of the entire Universe. If that is what the artist intended, I think it’s absolutely fabulous!!\n\n","date":"November 12, 2011 at 10:19 am","url":"https://shroudstory.com/2011/11/10/quote-for-today-did-leonardo-paint-this/","cat":"art","id":"comment-4756","author":"AnnieCee","site":"shroudstory"},{"title":"Quote for Today: Did Leonardo Paint This","post":"The globe with a cross usually held in Christ’s left hand, symbolizes Jesus’s reign over the whole earth…if i remember correctly.\nR.\n\n","date":"November 13, 2011 at 3:15 am","url":"https://shroudstory.com/2011/11/10/quote-for-today-did-leonardo-paint-this/","cat":"art","id":"comment-4778","author":"Ron","site":"shroudstory"},{"title":"Quote for Today: Did Leonardo Paint This","post":"Yes, the Savior of the World, Ruler, King. I don’t understand why it’s drawn the way it is sometimes, with the gold bands across the top and around the middle. This is a common thing, seen in these images:\n And I noticed that DaVinci’s orb didn’t have the extra accessories. I like it that way, free of manmade additions, less bound and restricted… and so pure.  Although we tend to think of crystal balls and witchcraft, this pure sparkling orb wouldn’t represent anything satanic  – so I do wonder what DaVinci had in mind as he depicted it this way, and whether his image preceded the others which it apparently did, because I looked up dates of some of those, above.  Seems as if the “orb” has evolved down through the centuries. \nThis is another, similar image also done by Leonardo DaVinci:\n\nWhich shows that the Salvator Mundi shown at the top of the page isn’t the only one that DaVinci did. The orb is a little different in that second one.\n\n","date":"November 13, 2011 at 6:59 am","url":"https://shroudstory.com/2011/11/10/quote-for-today-did-leonardo-paint-this/","cat":"art","id":"comment-4782","author":"AnnieCee","site":"shroudstory"},{"title":"Quote for Today: Did Leonardo Paint This","post":"For some tantilizing thought, the painting shown in your last link, painted by LDV. Actually, there was a cross at the top of the orb, originally, but apparently he tried to paint it out…Look close you can still see remnants of it.\nR.\n\n","date":"November 13, 2011 at 5:14 pm","url":"https://shroudstory.com/2011/11/10/quote-for-today-did-leonardo-paint-this/","cat":"art","id":"comment-4789","author":"Ron","site":"shroudstory"},{"title":"Quote for Today: Did Leonardo Paint This","post":"I found another painting by Fra Angelico and the child Christ is holding a glass orb with the cross bands on it. So this symbolism is really ancient because Fra Angelico lived… 1395 to 1455 AD. DaVinci was born 1452 AD.  Well, it doesn’t really matter. \nI’ve been a little curious about the meaning of the globe-orb-cross icon but it goes so far back into ancient history that perhaps nobody knows. \nDaVinci’s plain glass orb is unusual, though. I believe I read somewhere that this recently discovered painting was unfinished?  So maybe he wasn’t done with the orb.\n\n","date":"November 13, 2011 at 8:24 pm","url":"https://shroudstory.com/2011/11/10/quote-for-today-did-leonardo-paint-this/","cat":"art","id":"comment-4792","author":"AnnieCee","site":"shroudstory"}]
