[{"title":"Quote for Today: Hans Belting and commentary","post":"And what if the distinguished art scholar Hans Belting is right in his view that the Image of Edessa was actually  created, like other ‘not made by human hands’ images, in the sixth century AD? (See Likeness and Presence passim.)\n A legend was then created to give it a credible status as a relic, as happened throughout medieval Europe.\nIf Belting is right ,then Wilson’s thesis cannot even begin to get going. So who is prepared to take on Belting?\n\n","date":"September 6, 2012 at 3:07 pm","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","id":"comment-15941","author":"Charles Freeman","site":"shroudstory"},{"title":"Quote for Today: Hans Belting and commentary","post":"Let’s start at the beginning: where is this quote from? Because it isn’t from page 9 of that book.\n\n","date":"September 6, 2012 at 4:35 pm","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","id":"comment-15948","author":"Davor Aslanovski","site":"shroudstory"},{"title":"Quote for Today: Hans Belting and commentary","post":"Davor, don’t make the same mistake made recently by Stephen. Jones. There can be several editions of the same book with alterations to page count and even subtitles.\nR\n\n","date":"September 6, 2012 at 5:29 pm","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","id":"comment-15954","author":"Ron","site":"shroudstory"},{"title":"Quote for Today: Hans Belting and commentary","post":"I note that the quote does not appear on p.9 in the on-line Amazon preview of the 1996 edition, which I checked on following up a citation of the quote given for the 1998 edition.  The comment remains true regardless.\n\n","date":"September 6, 2012 at 5:47 pm","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","id":"comment-15955","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Quote for Today: Hans Belting and commentary","post":"I certainly would not presume to challenge such a distinguished scholar as Hans Belting on matters of Byzantine art.  However there are phenomena (art works) and the interpretation of those phenomena is a separate issue,  Being human, we all have to live with the consequences of our mistakes in any such interpretations.    \nIt is interesting that Belting makes the point that many such images were made in the sixth century.  Various features are frequently repeated, slavishly, even when they seem to make little artistic sense.  It is a no-brainer that there must have been an original template which became standard.  And then others more geographically remote would use copies of the standard template (We are.not talking modern photography here). \nWhat was the template commonly used?  Was it the “Christ Pantocrator”, the “Image of Eddessa”, the “Mandylion” or something else?  From the Byzantine chronicle, to the extent it might be believed, we can infer that there were at least three such claiming to be the original, the Orthodox, the Monophysite, and the Nestorian.  Very likely there were others.  Perhaps one such copy became the “Veronica” or the “Holy Face of Manopello”.  Not only the multiplicity of images, but also different names for what may have been the same object, contribute to our modern confusion.  It is significant that the various copies made all radiate out from Edessa, as Belting asserts, all claiming to be copies or likenesses of the “Image of Edessa”, possibly subsequently modified by local artistic conventions. \nLet us now turn to the Turin Shroud.  I do not accept the following circular reasoning, which seems to be frequently promoted.  “Byzantine art was loth to represent a dead Christ and blood stains.  Icons show a live and triumphant Christ without blood stains.  The modern negative photo we have of the image of the Shroud show a very dead Christ with blood stains.  Therefore notwithstanding any common features between the Shroud image and the icons, the image on the Shroud could not have been used as the original template.” \nWe are aware that Paul Vignon identified some 15 oddities frequently appearing in Byzantine portraits of Christ, even when they seemed to make little artistic sense, and even when they dated from the 6th century as Belting asserts.  Some little time back Davor Aslanovski posted on his website a crude parody of the Vignon observations which utterly fails to do them any justice.  All of the 15 Vignon features appear on the Turin Shroud.  \nSo we are left with two possibilities.  Either a medieval forger anticipated Vignon and included the various features he had discovered from icons onto his work.  Or else the Shroud itself was the 6th century source for the original template.  Some of the Vignon markings only make sense in terms of folds or creases in the cloth.  How credible is it that a 6th century Edessan forger could make such an artifact with all the properties that only our modern era has discovered?  And remember, Belting himself has said that the icons emanated from Edessa!\n\n","date":"September 6, 2012 at 8:11 pm","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","id":"comment-15959","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Quote for Today: Hans Belting and commentary","post":"1.) I have noted myself that Belting has made some very interesting changes to the various editions of his book – especially between the German original and the French and English translations.\nI have pointed out one such peculiarity that ‘sindonologists’ might find particularly interesting here: http://deumvidere.blogspot.com/2011/05/i.html\nIt was a paper that I actually e-mailed and asked Dan Porter to promote in these circles, as I thought it had to a lot to offer on the matters discussed here. But, of course, since it says absolutely nothing about imaginary Vignon markings, doesn’t pick out one among tens of thousands of Byzantine neologisms (‘tetradiplon’) and then pretend it is the only one, and doesn’t even mention the Cherubim gates in Antioch – no one here read it.\nI do admit that it doesn’t read like a fairytale, doesn’t have any mythological creatures or cryptological puzzles in it, doesn’t even come with pretty pictures. But I once again suggest that you have a look at it. If for no other reason, then at least to give you an idea of what is really wrong with certain academic approaches to Christian art. And how a Christian art historian (with proper training and proper understanding of what the academic world really is) would begin to solve these issues. If he only wasn’t always so stranded for time. \n2.) It proves nothing that there is no mention of the burial cloth’s arrival to Constantinople. The first mention of a relic at the capital usually coincided with either the foundation or a restoration of a shrine in which it was/would be housed. We rarely find that the one is recorded without some mention of the other. Of course, you would only know and understand this if you had any training in Byzantine history. \n3.) The reason why Wilson only needed 3 months to do all the research for his books, while it takes us silly academic people so much more is that we worry too much when an ancient author makes claims that are not substantiated elsewhere. And we go and check. And we check ALL the relevant sources. And we compare. For instance, we don’t just read one ancient author and go: ‘AHA! So the heads of Cyril and John were buried in the Hagia Sophia – Anthony of Novgorod says so!’ No, we are read on and often find that the author himself contradicts this when he says: ‘there is no tomb in Hagia Sophia except for that of St Anthenogenes.’ So, in a word, reconstructing Byzantine history takes a little more time and a little more work than you people think it does.\nJust imagine if, for instance, medical diagnoses were established and medicines  administered the way that things are done here. You have some pain in your belly, you say? That must be appendicitis. We must operate immediately. Wait here while I call our surgeon. What is that? You have had tea while you were waiting and the pain is now gone? Oh great, so now we know a simple cure for appendicitis and surgeries will no longer be necessary.\nThank God that a little more thought and effort goes into that and thank God the first book that came into Mr Belz’s hands wasn’t something that said Jesus never existed. We would now have to be listening to his ‘editorializing’ about how the shroud cannot be authentic because there never was a crucifixion victim crowned with thorns. \n4.) When one has so very little understanding of the Byzantine world that he doesn’t even know that the Turks were not Arabs (see above), is he really equipped to wrestle with questions of the true motivation of the Byzantine military and diplomatic campaigns? It may seem like a small mistake to someone who doesn’t know much about this world, but to anyone who has ever read even the shortest introduction to Byzantine history – this is the same the same as if they were being asked to discuss whether George W. Bush was right to attack Egypt after 9/11. \n5.) About the Vignon markings. As Mr Belz has noted above, I have recently posted a likeness of Jesus Christ made with the help of these markings on my blog. The idea was to show that that is not how you achieve likeness in visual art. What you do (and I cannot believe that I have to say this!) is you measure the features and proportions of the face – e.g. length of nose, distance between the eyes, width of mouth, and how they relate to each other. Anyone who has any artistic ability and a sound mind knows this. If all the ancient icons of Christ showed the same facial proportions – you would have a case. But with Vignon markings you have nothing but a drawing made by someone who is either psychologically or neurologically unwell.\n\n","date":"September 7, 2012 at 3:38 am","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","id":"comment-15972","author":"Davor Aslanovski","site":"shroudstory"},{"title":"Quote for Today: Hans Belting and commentary","post":"1 Laying aside Davor’s unfortunate customary superciliousness, I did persist with reading through the paper he mentions. He himself admits to it trying the reader’s patience, but never mind. I can understand reasons why Dan may have chosen not to post it here, which I dare say had less to do with the omission of the Gates of the Cherubim, cryptology, or fancy pictures, than the fact that it deals with a particular abstract specialised issue in the theory of art and art interpretation.  The main message I took from it is that artistic works may have a life of their own in that each era will interpret them in accordance with its own prevailing culture, whether that is theological-patristic, medieval-miraculous, or whatever the prevailing modern culture might be.  The original intent of the artist is apparently less significant than what we might imagine(???)  I was somewhat reminded of the paradox “What sound does a tree make when it falls in a forest with no-one present to hear it?”  This is by no means intended to discourage him in pursuing the topic further, which might very well have some value in extending our understanding or meaning of art forms. \n2) My point in raising this issue was that I found it strained my credulity that the arrival of the Mandylion in Constantinople was greeted with such fanfare, yet the arrival of the burial cloths there, as a separate relic did not even raise a whisper.  All we have are hints and clues of its presence.  Some would maintain of course that the burial cloths were never in Constantinople, but that I fear only strains my credulity even more so.  It would seem that the arrival of the burial cloths was by some means concealed, unknown or only gradually came to light, \n3) I concur with Davor’s basic thesis that corroboration is required before arriving at academic conclusions, that might otherwise be too hasty.  However I can assure him that even in a NZ University, rather more is required for a major in Religious Studies than the reading of an excellent single work by some popular author.  The syllabus is extensive ranging from Ancient Religions to the modern Universal, Primal (polynesian, micronesian etc), critical issues of modern concern, phenomenology, oriental and all the rest.  I am not entirely ignorant of such matters. \n4) It is clear that Davor can only have glanced through this section and has misinterpreted it.  If he is not aware that John Curcuas was CIC of all the armies in Anatolia, was victorious against the Bulgars, with excursions into Armenia and Mesopotamia, and ventured against the Abbasid caliphate, then he is even more ignorant about this potential Alexander than I am. \n5) Davor may pooh-pooh the significance of the Vignon markings, and lament the lack of dimensional correlations if he so chooses.  I’ve noticed his lack of scientific appreciation previously, and 15 points of corroboration are too many to dismiss so lightly.  His tendency to question the sanity of those he degrees with is ad hominem and in the case of Paul Vignon, I find it offensive.\n\n","date":"September 7, 2012 at 7:35 am","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","id":"comment-15982","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Quote for Today: Hans Belting and commentary","post":"Dan did post that paper here.\nI have nothing to reply to the rest of your comment.\nYou are an adolescent in your sixties and I will from now on ignore you completely.\n\n","date":"September 7, 2012 at 11:48 am","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","id":"comment-15992","author":"Davor Aslanovski","site":"shroudstory"},{"title":"Quote for Today: Hans Belting and commentary","post":"Dave b. Your point 2. Many relics simply appear in the historical record- they do not need to have been brought from anywhere although,of course, legends that they have been brought from somewhere often develop.\nThere is a hierarchy of relics, which shifts with time e.g. the Cross is an early fourth century favourite, the bones of Stephen , the first martyr, make a big splash in the early fifth century (both Constantinople and Augustine had parts of him), the Blood of Christ becomes important in late medieval Germany. Burial Shrouds simply don’t get very far in the hierarchy perhaps because of the taboos in showing Christ dead which lasted until  c. 1000. They were simply not something you venerated when there was so much competition from more prestigious relics, and in the case of images, those showing Christ alive.\nOne of Wilson’s many errors is to assume that the Shroud would have been so important that it would have been given special veneration over and above the thousands of other relics of which we have documentary evidence. It only seems to have been since 1898 that it finds it own place in the sun.\n\n","date":"September 7, 2012 at 12:15 pm","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","id":"comment-15994","author":"Charles Freeman","site":"shroudstory"},{"title":"Quote for Today: Hans Belting and commentary","post":"Hi Davor, can you provide a link to your likeness of Jesus on your blog as I couldnt find it? \nI think you’d be amazed with how much much the brain can be tricked by putting into key markers in a portrait to achieve a resemblance. In fact those key markers can be as minimal as a hairstyle (eg see Dali’s Mao Marilynn portrait, where he makes Marilynn Monroe look like Mao with just a hairstyle!!), or a moustache type (eg Hilter and Freddie Mercury impersonators). So I wouldnt be so dismissive of the Vignon markers as they would be a lot easier to add into a portrait than getting the proportions right which really is a harder proposition (I say this as an occasional portrait painter). Getting the proportions right are only important when you are trying to match a known person, where people with automatically feel something is wrong, but whey you are going for a iconic Jesus, I guess you can just rely on beard, moustache, flowing hair and some perhaps a hardful of these markers. Also Vignon markers would be a lot easier  to transmit over the ages than a set of proportions. \n If I were to try to test out the validity of these markers, I’d try and see how many of these markers appear in other medieval portraits vs the Christ portraits. Though I am not entirely convinced by the Vignon markers myself, I still cant totally dismiss them either as there does seem to be some sort of purposeful attempt to work at least some of these into the Christ portraits. Thats why I’m interested to see what you achieved by following these markers only. Thanks\n\n","date":"September 9, 2012 at 7:22 am","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","id":"comment-16053","author":"ArtScience","site":"shroudstory"},{"title":"Quote for Today: Hans Belting and commentary","post":"It is most true, Davor A. is not very good at solving  Byzantine Art History cryptological puzzles such as e.g. the Edessa Image being described as a facial imprint on a himation/rakos tetradiplon  changing its appearance according to different ages (on Easter “it showed itself in infancy at the first hour of the day, childhood at the third hour, adolescence at the sixth hour, and the fullness of age at the ninth hour, when the Son of God came to His Passion and cross”).\n\n","date":"September 10, 2012 at 5:24 am","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","id":"comment-16086","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Hans Belting and commentary","post":"He propuesto SIN NINGÚN ÉXITO (¡ja, ja ja…!) la HIPÓTESIS de una imagen con un GRAN PERIODO DE LATENCIA, aunque pueda parecer una ficción.\n– La oxidación es un proceso DINÁMICO en el tiempo…… Y TODAVÍA CONTINÚA.\n– Hoy , 2000 años después (para los que creemos en la autenticidad), a 1 metro de distancia el ojo NO VE imagen, es preciso retirarse a 4 o 5 metros para que el ojo perciba la imagen con COHERENCIA ( el ojo organiza además bordes que son inexistentes en la imagen)\n– ¿Qué imagen podría verse a los 200, 400, 600 y 1000 años después de la sepultura de Jesús?\n-Las microfibrillas inicialmente MÁS LESIONADAS serían las primeras en poder ser advertidas por el OJO, evolucionando en el tiempo con más rapidez, mostrando más intensidad, que las menos lesionadas.\n-Las primeras manchas que serían COHERENTES, interpretables, a GRAN DISTANCIA, serían las que conforman el ROSTRO, y no podría advertirse si los OJOS estaban ABIERTOS o CERRADOS.\n-Las aparentes contradicciones y la evolución de la leyenda de Abgar TENDRÍA SENTIDO, ASÍ COMO MUCHOS DE LOS TESTIMONIOS.\n– Aunque sea como “divertimento”, espero que alguno recoja la HIPÓTESIS y observe que el “puzle” ENCAJA.\nCarlos Otal.\n\n","date":"September 7, 2012 at 3:39 am","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","id":"comment-15973","author":"Carlos Otal","site":"shroudstory"},{"title":"Quote for Today: Hans Belting and commentary","post":"The only reference Belting makes to the Turin Shroud in Likeness and Presence, p. 210 of the paperback edition , University Of Chicago Press, 1994, gives his view that it is a medieval copy of an earlier image ‘apparently venerated in Byzantium as Christ’s burial cloth’. in L and P he deals with a wide range of images attempting to find their source and it is impossible to represent the depth and knowledge he displays of early images here. There are fifty-one sub-headings alone in the subject index under ‘Christ, images of’. He takes one style of these images back to ‘eastern Syrian works of the third century ,as in a fresco in Dura- Europos’. \nOf course, we are severely limited by the mass destruction of eastern images of Christ in the iconoclastic period. So, for instance we have a reference ( p. 62, Belting) to the usurper emperor  Heraclius (AD  610) finding in Constantinople ‘the already existing cult of an unpainted image of Christ which he made his own; – he took it with him on campaign. This may have been the same image of Christ that had been discovered in a garden well in the village of Kamuliana in Asia Minor and brought to Constantinople in 574. It showed off its power by miracles in the village where it was found (including duplicating itself when pressed to the finder’s dress), before it was sent to Constantinople. Where did it go?\nOf course other historians have noted the importance of the representation of the emperors in Roman art as a model for  the seated fully frontal Christ ‘ Subsequent [in this case after 350] depictions of the all-powerful Christ in the apses and cupolas of Christian churches retain the iconographic elements of emperors of late antiquity’, as another authority on early Christian art, Johannes Deckers, puts it. Again the painted Roman coffin lids of Egypt , many of which have survived, are also seen as a source of painted icons- they too show living faces as do all the early images of Christ.\nBelting shows how complex and varied the sources of the iconography of images of Christ are. Many of them are secular ‘templates’ adopted in Christian art well before the sixth century. The idea that images of Christ are all taken from a single piece of cloth in the SIXTH century has never had anything going for it- the traditions are much older.\n\n","date":"September 7, 2012 at 4:04 am","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","id":"comment-15975","author":"Charles Freeman","site":"shroudstory"},{"title":"Quote for Today: Hans Belting and commentary","post":"P. S. It goes without saying that Belting, like all other art historians that I know of,  treats the Image of Edessa as an object in its own right and nothing to do with the Shroud.\n\n","date":"September 7, 2012 at 4:09 am","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","id":"comment-15976","author":"Charles Freeman","site":"shroudstory"},{"title":"Quote for Today: Hans Belting and commentary","post":"It wouldn’t be the first time experts could prove to be wrong!  As you mentioned earlier, much has been lost from the past, it only takes one find to ‘flip’ the experts concensus on it’s head!…With all of Belting’s learned knowledge, it seems to me (from what little I’ve managed to read), and I don’t claim to be an expert, but it seems that part of what he states could be described as ‘speculation’,…no one is immune to this.\nI’m not completely sold in Wilson’s hypothesis dealing with the Mandylion/Shroud, but I believe there are bits of circumstantial evidence in it’s favour. Furthermore, Wilson has never claimed all Jesus depictions derived from the Shroud/Edessa image, just that depictions/style suddenly changed in the mid 6th century and this can be attested to by the many Pantocrator icons, which should not or can not be overlooked, especially since they have numerous congruences. Sure there have been similar bearded depictions of Christ found deep in the catacombs of Rome, but who can say these were widespread? Early depictions found all over the byzantine empire, pre-6th century did not follow this depiction! So why the abrupt change and suspiciously around the same time a mysterious image “not made by man” turns up in Edessa? \nR\n\n","date":"September 7, 2012 at 5:53 pm","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","id":"comment-16004","author":"Ron","site":"shroudstory"},{"title":"Quote for Today: Hans Belting and commentary","post":"Creo que Belting se refiere a la imagen del sacerdote de la “Consagracion del Tabernáculo”, junto al que se lee en griego ARON, fresco de la sinagoga (???) de Dura Europos\nhttp://www.google.es/imgres?imgurl=http://classconnection.s3.amazonaws.com/801/flashcards/405801/png/tabernacle1305588413983.png&imgrefurl=http://www.studyblue.com/notes/note/n/art-history-final/deck/862725&usg=___T7UqxKqFuY87ZjGjb0FqXbiIZg=&h=416&w=664&sz=804&hl=en&start=0&sig2=n6ua6ZfxfWzcQbKuaTcApg&zoom=1&tbnid=QXvOXXfoda6MYM:&tbnh=93&tbnw=149&ei=t69JUNGjK8aAhQeXl4GYCQ&itbs=1&iact=hc&vpx=153&vpy=180&dur=643&hovh=178&hovw=284&tx=170&ty=104&sig=114298840646883834903&page=1&ndsp=2&ved=1t:429,r:0,s:0,i:52\nMuy difícil INTERPRETAR el fresco y de interpretar el PERSONAJE que se muestra como sacerdote.\n(\nMax podría contarnos algo)\nCarlos Otal\n\n","date":"September 7, 2012 at 4:38 am","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","id":"comment-15977","author":"Carlos Otal","site":"shroudstory"},{"title":"Quote for Today: Hans Belting and commentary","post":"\nDavor Aslanovski :Dan did post that paper here.I have nothing to reply to the rest of your comment.You are an adolescent in your sixties and I will from now on ignore you completely.\n“… and doesn’t even mention the Cherubim gates in Antioch – no one here read it.”  I read it.\nAs to my age, you flatter me.\nI might have replied in kind, but shall not!\n\n","date":"September 7, 2012 at 4:27 pm","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","id":"comment-16001","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Quote for Today: Hans Belting and commentary","post":"Charles: Thank you for your courteous, patient and detailed responses you have given above.  I find them intriguing.  I must admit that I prefer them to what seemed to be a somewhat hostile, and to me somewhat inconsistent approach of the article that gave rise to this discussion.\nI feel that Wilson was persuaded as to the authenticity of the Shroud by much of the forensic work that had been carried out on it during the 20th century.  He saw a yawning gap in its history prior to 1350 that needed to be accounted for, if ever the Shroud was to be taken more seriously.  I feel that with the very best of intentions he directed what efforts he was able to bring to that problem in constructing what seemed to him and to others a credible history.  His results are certainly arguable by those who claim to know a great deal  more about art history, such as yourself, than they are willing to credit Wilson with.\nThe history of academia in whatever field is replete with examples of faulty received wisdom, that persisted for a time, but later had to be discarded and rewritten.  I doubt that anyone can be dogmatic about the history of the Shroud, and perhaps one day we shall see more clearly than we can at present.  Meantime a more open-minded approach could be more fruitful in bringing that about. \nNow to some of the points you have made above.\nI was amazed that you were able to find in Belting a reference to a cloth with an earlier image ‘apparently venerated in Byzantium as Christ’s burial cloth’.  You say that Belting considers that the Shroud was a medieval copy of that cloth.  From what we now know of the Shroud, that won’t wash at all.  We know from its various properties that it was quite beyond the powers of any medieval forger to produce what we now have.  I don’t intend to dwell on those aspects here, as they are available to all who wish to pursue the topic with an open mind.  But caution is of course required, as there are claims which even pro-authenticists would hesitate to accept, but others that seem conclusive. \nHere are a few historic references, which you may or may not be well aware of concerning the cloth(s) held in Constantinople (Byzantium):\n(a) Guscin’s translation of 12th C.Latin manuscript Tarrogonensis 55: said to be originally written by a pilgrim who spent a long time in Constantinople in 1090.  The pilgrim refers to a linen cloth with the face of the Lord Jesus made by direct contact, held with greater reverence than other relics in the emperor’s palace, kept locked away in a golden case   Only the emperor is permitted to see it.  The case used to be open once, but the city was hit by great earthquakes. As a result of a heavenly vision, the relic was hidden away from human eyes and kept locked up, and the earthquakes stopped.\nNow it seems that Constantinople is not at all prone to such earthquakes, but we know that Edessa was.  So it seems very likely that this is the Image of Edessa, but no-one gets to see it around this time, except the emperor.\n(b) Around 1130, high ranking western visitors are shown the emperor’s collection of relics.  Normandy-based monk Orderic Vitalis reports that the Jesus-imprinted Edessa cloth, besides Jesus’ facial imprint displays ‘the form and size of the Lord’s body to all who look upon it’,  [Ord Vit, Historia Ecclesia, Pt II, Book IX, 8].  This might seem to be a second-hand report, but it seems that Gervase of Tilbury makes a similar observation [Gerv of Til, Otia Imperiala III] .\n(c) Dobschutz Christusbilder Beilage III, p. 134: Refers to Latin Abgar Legend,.where\n Christ spreads out his whole body on a linen cloth, … majestic form of his whole body  … divinely transferred … kept in Syria Mesopotamia at the city of Edessa in a great cathedral. \nI wonder about these references, and whether after all there may very well be more to some of the assertions made by Wilson, than others seem prepared to acknowledge.  It does seem that some time around 1130 at any rate, there came to be recognised in Constantinople, the realisation that they had come to be in possession of Christ’s burial cloths.  Why Belting seems unable to acknowledge that this is the present Shroud held in Turin, I would not know.  Unless he is relying on the 100 year old Chevalier & Thurston version of the D’Arcis memorandum now shown to be a deliberate fraud.  Or perhaps it is the missing years between 1204 and 1350 that trouble him.  \nPerhaps what matters now, is what the hard sciences can make of the Shroud, and what might be made of it in religious terms.  But it is a pity that Official Historians cannot seem to match a similar challenge as to its provenance.  Hence the so-called amateurs and enthusiasts can be expected to continue their efforts in coming to their own conclusions, as best they can.\n\n","date":"September 8, 2012 at 6:54 am","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","id":"comment-16012","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Quote for Today: Hans Belting and commentary","post":"Dave B . Thanks for yours. Having worked as a historian for all too many years, I am very cautious about sources. This is especially true of relics stories as it was the custom to create stories of where you particular relic came from and why it was genuine. By definition, most of these stories have to be false as not every burial shroud, piece of the cross, Girdle of the Virgin Mary, head of John the Baptist,etc, could be genuine!\nI can only quote Belting on the Shroud, with page reference,- perhaps he has expanded on his theory elsewhere. i was much more interested in his arguments for the appearance of the Image of Edessa as a newly emerging Image, probably made in the sixth century, as, if he is right, then Wilson’s theory collapses.\na) Guscin. No problem here as this is simply a standard account of the Image of Edessa that we know to have been in the emperors’ private chapel, the Pharos Chapel, from 944 to sometime after 1204. Such a precious relic would never have been moved- especially not to a very vulnerable chapel on the seashore.. So there is no link to what de Clari saw in the Blachernae Chapel.\nb) This is so late and not corroborated by any other account.\nc). Another late variance on the original Agbar legends ( all LEGENDS, of course, not historical accounts) which can hardly be used to supplant earlier accounts of the legends that say it is just the face.\nSo nothing very convincing here, certainly not enough to overthrow the traditional narrative which best accords with the sources that the Image of Edessa appears for the first time in the sixth century and is then given a legendary history in order to give it credibility. This is the best fit explanation unless we find some more specific documentary evidence. (In these cases where the evidence we would like is missing , we have to end up with a ‘best fit’, always provisional, of course.)\nAs I try and explain  in my original article, Wilson fails completely to find any evidence for the 500 years before  the sixth century and the only ‘evidence ‘ he provides for the Shroud being the same as the Image of Edessa is, as I attempt to point out in my article ‘Tetradiplon Revisited’, rests on the tetradiplon cloth, WITHOUT AN IMAGE, with which Jesus wiped his face, according to the legend,being REFOLDED ‘tetradiplon’, but not a single source says that it was and there is a separate reference to burial cloths in the same text anyway. Wilson simply ignores it but surely he should list every time there is a reference to a burial cloth or cloths in the tomb. I can see why people wonder what his motives are.  Does he really believe what he writes? Is he really satisfied that the evidence he provides  is conclusive? Did he read the full text (here and in other cases) or was he simply being lazy?\nThe distinction between cloths showing a living and a dead Christ is crucial in the context of the iconoclastic debates. The images of a living Christ, the Image of Edessa, the Veil of Veronica, and the image brought to Constantinople in 574, provided evidence that Christ wanted to have images of himself, something the iconoclasts denied. An image of a dead Christ would not help here but i completely fail to buy the view that the Shroud of Turin was somehow made to represent a living Christ. In fact, as I have said before, with reports of various images and shrouds around in both east and west, I know of no clear reference to what we know of the Shroud of Turin before the fourteenth century. As the distinctive element of the Shroud of Turin is a double image, I would expect a clear reference to that, then I WOULD be interested. Up to then caution, caution, caution – Wilson is far too speculative for me and seems completely unaware of the vast amount of material about other relics that we find from the fourth century, when relics appear to have been collected for the first time, that would make him realise that a burial shroud would have been unlikely to have been picked out for special veneration when there was so much else around to venerate. (See the early chapters of my Holy Bones, Holy Dust, How Relics Shaped the history of Medieval Europe- p/b edition out soon!)\n\n","date":"September 8, 2012 at 1:49 pm","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","id":"comment-16018","author":"Charles Freeman","site":"shroudstory"},{"title":"Quote for Today: Hans Belting and commentary","post":"One does not need to look for reasons to know why a burial shroud believed to have wrapped the body of Jesus would have been picked out for special veneration.\n\n","date":"September 8, 2012 at 8:52 pm","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","id":"comment-16026","author":"Louis","site":"shroudstory"},{"title":"Quote for Today: Hans Belting and commentary","post":"‘As the sun does not need the lamplight, so also the church of the congregation can do without the remains of the martyrs, It is sufficient to venerate the name of Christ, for the Church is his bride, redeemed by his blood’. Basil of Caesarea  was one of the great theologians of the late fourth century and he spelled out the reasons why relics were not be specially venerated. He is echoed a few years later in the Latin church by Augustine who says miracles are no longer needed now the Church is well established and decries the custom already in place of hawking around relics for sale. By the end of his life ,however, Augustine is as keen on relics and miracles as anyone else. So ,just as in the Protestant church today, early Christians did not venerate relics and it is a much later phenomenon, essentially only appearing 300 , yes 300, years after the events of the gospels.\n There are a few reports from the late third century of martyrs’ bodies being venerated and then in the 320s we have the finding of the True Cross by Helena in Jerusalem. By the 380s we have Jerome wandering around the Holy Land and finding many of the relics such as the manger in which Jesus lay. By 420 relics are everywhere in the Christian world and once it was accepted that any part of a relic had the power of the whole, bodies could be divided up and distributed. That is why one finds parts of the first martyr Stephen in both eastern and western parts of the empire by 420. We have lots of documentary evidence by now of what the major relics were and where they were venerated. Not a single mention of a burial shroud being venerated as a relic but several legendary accounts in the sixth and seventh centuries of the burial cloths being seen in the tomb e.g in the Acts of Thaddeus, the very same text that Wilson used for tetradiplon  the term which describes the cloth BEFORE Christ wiped his face on it, then the same text goes on to describe the burial cloths in the tomb- so the burial shroud,in this legend, could not be the same cloth as that described as tetradiplon. Then there is Arculf’s account, late seventh century, in which Arculf visits Jerusalem and sees the main burial cloth still in the tomb and recounts the story of the sudarium ,a face cloth, cf.as in the Oviedo example, as a separate cloth. Wilson tells us about the sudarium, assumes that it is the Shroud temporarily moved from Edessa to Jerusalem(!!!) and then,of course, says nothing about the burial cloth in the tomb, in a similar way to the way he omits telling us about the reference to the burial shroud in the Acts of Thaddeus which destroys his argument that the Shroud was tetradiplon.\nSo what are we to do? Does Wilson really believe what he is writing? He is expert at teasing out any text that might ,however many centuries it is after the event, refer to the Shroud but almost certainly doesn’t, but then misses the obvious references to the burial cloths as being in the tomb and being distinct from the Image of Edessa. \nSo, Louis, I do think, in the absence of any documentary evidence , we DO need to find special reasons why the burial shroud would have kept as a relic in an age when relics were not being collected and when , in the age that they were, the fourth/fifth century, there is no mention among all the other relics listed of the veneration of a burial shroud. It clearly was not high profile compared to other relics from the Passion, the life of Christ and the Virgin Mary that are recorded at this time. (One of my concerns about Wilson is that despite writing about the Shroud since 1978, he shows no sign of being aware of the immense documentation about other, much more prestigious, relic cults that still survive from this period.) And even if one argues that it only first appeared to the public as the Image of Edessa, there is no evidence from any of the early texts to suggest that this was anything other than an image that was believed to come from the living face of Christ.\n\n","date":"September 9, 2012 at 4:22 am","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","id":"comment-16041","author":"Charles Freeman","site":"shroudstory"},{"title":"Quote for Today: Hans Belting and commentary","post":"Charles, you are considered to be a good and well-known historian and I can see that you have been meticulous in your research. But, as you know, the tradition that Jesus left his image on cloth is ancient and what has been done is to connect that tradition with the Shroud, with small gaps here and there. Since the relic is unique, as demonstrated by all the studies conducted so far, many people do think that it was the cloth that wrapped Jesus as he lay in the sepulchre. What is certainly difficult to agree with is Wesselow’s theory that it led to the birth of Christianity.\nThen, there appear to have been early traditions that were not put down on paper, such as the veneration of the Virgin Mary, which even reached Islam, in fact she is mentioned more times than Jesus in the Koran.\nThe great frustration for Shroud scholars is that much was deliberately destroyed in Edessa, and a lot was stolen or even destroyed when Constantinople was sacked during the Fourth Crusade, so it is clear that there is no choice but to rely more on science to see how much more can be learned.\nYet, even if the Shroud is proved to be genuine, it would still not answer many existential issues that are constantly raised.From my point of view, and for Christians at least, it appears to be understanding what is meant by “mysterium Christi”.\n\n","date":"September 9, 2012 at 5:35 pm","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","id":"comment-16068","author":"Louis","site":"shroudstory"},{"title":"Quote for Today: Hans Belting and commentary","post":"Just in case some Historian or Art Historian could missed it, I wrote the following post as a comment on “A different approach to what some see as problems with the image on the Shroud of Turin”\nFOR A CRYPTOHISTORIOGRAPHY OF THE IMAGE OF EDESSA\nI wish both historians and art historians were more aware of CRYPTOhistoriography. E.g. I would be very much curious to know how the servants of the HIgh Priests of Byzantine History and Art History interpret the Edessa Easter rituals (before 944). I have my own lttle archaeocryptological idea about it….\nIn the chief description of this ritual we read e.g. the image was kept in a gold scrinium and on Easter it used to “change its appearance according to different ages: it showed itself in infancy at the first hour of the day, childhood at the third hour, adolescence at the sixth hour, and the fullness of age at the ninth hour, when the Son of God came to His Passion and cross”.\nCan any of those servants (Cameron, Nicoletti, Aslanovky etc) of the “High Priests” gives/offers us their own scholar explanation (if they have any)? Methinks we’re going to wait for eternity before they really can…\n\n","date":"September 9, 2012 at 5:37 am","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","id":"comment-16046","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Hans Belting and commentary","post":"I think thats a very good point Max! \nR\n\n","date":"September 9, 2012 at 2:18 pm","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","id":"comment-16060","author":"Ron","site":"shroudstory"},{"title":"Quote for Today: Hans Belting and commentary","post":"Mistyping: scholarly explanation\n\n","date":"September 9, 2012 at 5:39 am","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","id":"comment-16047","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Hans Belting and commentary","post":"I think Charles may have misunderstood my intention of the quotes at #17.  I concur that (a) Tarrogonensis 55 clearly refers to the Image of Edessa, but that few seemed to have examined it closely to determine its true nature.  However (b) and (c) suggest to me that by 1130 there had come a growing realisation among the Byzantines that somehow they had come in possession of the burial cloths   Wilson of course identifies this with the Image of Edessa, but I’m not pursung that issue in this comment.  There remains the question of how the burial cloths had come to be in Constantinople but were only recognised as such at that late date.  Barbet mentions a late 12th century comment by Nicocephorus Callistus that in the year 436 the Empress Pulcheria deposited the linen cloths in the Blachernae church, which is intriguing in view of Robert de Clari’s comment, but Nicocephorus being such a late commentator, this might probably be discounted. \nI am happy that Charles seems to have clarified his approach to relics in his first para at #18, by saying that most of these were not genune, as in his paper that stirred up Stephen Jones, he seems to damn them all.  He now seems to be prepared to concede that at least some may in fact have been genuine.   One explanation of why there may be little reference to relics in the early Church, was of course that during its persection under the Roman Empire, they were not going to give any secrets away and risk losing what they treasured.  Constantine & Helena very likely saw political advantage in emphasising a cult of relics as it provided a tangible means of connecting their dynasty with Christian origins.  As an aside, I would also mention the long-standing practice, still current, of consecrating altars with an altar stone containing alleged relics of saints.  The tradition is said to date from the early Roman era practice of celebrating eucharistic worship on the bones of the martyrs in the catacombs. \nThere are a number of indirect 4th century references to the Shroud or burial cloths:\nIn AD 325, Pope Sylvester established – “that Mass be celebrated on an altar covered with a cloth of linen consecrated by the Bishop, as if it were the clean Shroud of Christ.”\nTheodore of Mopsuestia (350-428) describes the role of deacons: “When they bring up (the oblation at the offertory) they place it on the altar for the completed representation of the passion so that we may think of Him on the altar as if He were placed in the sepulchre after having received the passion … the deacons who spread the linens on the altar represent the figure of the linen cloths at the burial….”\nSaint Nino of Georgia (4th C): “Now they did not find the sudurium, but it is said to have been found by Peter, who took it and kept it, but we know not if it has ever been discovered.”\nIshodad of Merv writes:” …the (sudura= sudarium) … remained with him [Peter] … head. And whenever he made an ordination, he arranged it on his *head … just as even … bishops of the Church arrange the turbans that are on their heads… in place of that sudarium”  [Shroud is obviously too large – it may refer to the head cloth]\nThe 6th C Mozarabic rite reveals that: “Peter ran with John to the tomb and saw the recent\nimprints of the dead and risen man on the linens.”\nI can provide the citations for these if Charles wishes to pursue them further. \nI think that it is evident that there was rather more interest in the burial cloths in the early church than many seem to have been prepared to concede.\n\n","date":"September 9, 2012 at 5:38 pm","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","id":"comment-16069","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Quote for Today: Hans Belting and commentary","post":"Daveb, If I may, I’d also like to add that the 6th C Mozarabic rite reveals much more then just interest in the burial cloths! The rite purportedly written by St. Leander sometime around 595 AD, actually may show that to ‘atleast’ a small circle of people, the Shroud was known, and known to have a full figure on the cloth. Or at the very least, a knowledge of such a clothes actual existence was proported. Seeing as St.Leander had ventured to Constantinople between 579 and 582, and had connections, very high in the hierarchy, it can be postulated that he was made aware of these details or he may have even ventured to Edessa himself. But as he would have to follow the Discipline of the Secret, he would be limited in the expression of such facts, hense the mysterious sentence showing up in his lithurgy.\n-‘The First Historical Reference to the Image on the Shroud-The old Spanish Lithurgy’-Mark Guscin. BSTS No.71, June 2010.\nR\n\n","date":"September 10, 2012 at 1:37 pm","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","id":"comment-16107","author":"Ron","site":"shroudstory"},{"title":"Quote for Today: Hans Belting and commentary","post":"Thanks for the comments and references, Ron.  I understand that the “Disciplina Arcani” tended to fall into disuse after the time of Constantine as there was then no further need for it, and it then seems to have been in part forgotten.  But Byzantines seemed to have a natural disposition to be obscure about sacred matters anyway, as evident even now in the eastern orthodox liturgical practices.  The Mozarabic rite seems be one of the very few early hints of an image on the Shroud, although of course there are several other ealy references to cases of imaging, which to me are at least suggestive of a prototype.\n\n","date":"September 10, 2012 at 4:46 pm","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","id":"comment-16116","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Quote for Today: Hans Belting and commentary","post":"Daveb wrote: \n“Ishodad of Merv writes:” …the (sudura= sudarium) … remained with him [Peter] … head. And whenever he made an ordination, he arranged it on his *head … just as even … bishops of the Church arrange the turbans that are on their heads… in place of that sudarium” [Shroud is obviously too large – IT MAY REFER TO THE HEAD CLOTH”\nIn all likelihood (my reconstruction), THREE head cloths (a pre-burial head-dress, a small face cloth and a skull-cap) were used on the TSM’s burial.\n\n","date":"September 10, 2012 at 5:38 am","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","id":"comment-16087","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Hans Belting and commentary","post":"Please, my credits for my oil portrait of Prof. Hans Belting. Thanks. Luca Del Baldo\nhttp://www.lucadelbaldo.com/art/work/THE+VISIONARY+ACADEMY+OF+OCULAR+MENTALITY/hans+belting.html\n\n","date":"January 9, 2013 at 6:26 am","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","id":"comment-21768","author":"Luca Del Baldo","site":"shroudstory"},{"title":"Quote for Today: Hans Belting and commentary","post":"Luca, just a great portrait (BW Belting’s face reminds me of the skewed nosed solidus portait of  Christ. Curiously enough, he just missed it though it appears on more than a dozen of extant Byzantine coin obverses).\n\n","date":"January 9, 2013 at 10:31 am","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","id":"comment-21783","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Hans Belting and commentary","post":"Belting-Christ is a interesting/strange suggestion…Thanks, Max.\n\n","date":"January 9, 2013 at 4:44 pm","url":"https://shroudstory.com/2012/09/06/quote-for-today-hans-belting-and-commentary/","cat":"art","id":"comment-21800","author":"Luca Del Baldo","site":"shroudstory"}]
