[{"title":"Rembrandt Understanding Christ","post":"I just want to add this little reflection to my previous comment about the Incarnation :\nMany ecclesiastics in the Church (and I know one personally) have a great difficulty to accept the idea that the Shroud could be the authentic burial shroud of Jesus-Christ.  I think those people should meditate a bit more on the Incarnation of God !  If Jesus was a REAL HUMAN BEING like everyone, I don’t see ANY good reason the completely reject the possibility that his burial shroud could have been kept and could still be with us until this day !\nI know that the main argument from those people is that the Jews were not aloud to touch a burial Shroud like this (even more if the shroud was stained by blood), but I think they forget one important thing :  the Shroud was found empty (just like the tomb) !  It’s only in the light of the resurrection event that we can consider as a good possibility the fact that the disciples could have kept the Shroud.  If this event was a fraud (the disciple would have stolen the body for example), you can bet your house that they wouldn’t have kept this cloth…\n\n","date":"August 9, 2011 at 1:14 pm","url":"https://shroudstory.com/2011/08/09/rembrandt-understanding-christ/","cat":"art","id":"comment-3547","author":"Yannick Clément","site":"shroudstory"},{"title":"Rembrandt Understanding Christ","post":"Yes, to think of the Shroud as proof of Jesus’ resurrection… it makes sense that it would have happened the way you describe it. \n“God has chosen foolish things to confound the wise, and the weak things, and things which do not even exist in order to bring to nothing the things that do exist, so that no flesh may glory in His Presence.”  …. \n I think it’s amazing and amusing that a piece of cloth is so controversial, so revealing, so enlightening about what happened during the time that Christ was entombed. It is a profound statement that He was really flesh and He was really dead. And yet, he is not dead anymore.  The Shroud says all these things. \nThe Shroud has a life of it’s own, a story to tell. If it was only a dirty piece of cloth that had been proclaimed a religious relic by the will of man, I don’t think these things would be happening. There is mystery in this cloth, a mystery that points directly to Christ.\n\n","date":"August 9, 2011 at 5:00 pm","url":"https://shroudstory.com/2011/08/09/rembrandt-understanding-christ/","cat":"art","id":"comment-3554","author":"AnnieCee","site":"shroudstory"},{"title":"Rembrandt Understanding Christ","post":"Hello AnnieCee !\nI agree with most of the things you said except for the idea that the Shroud is a “proof” of the resurrection.  I don’t think we can say that.  \nI think, with the eyes of faith, you can see a SIGN of the resurrection on the Shroud because there was once a real body in it but he left the cloth before decaying there !  That’s the SIGN we can see.  The Shroud, in a sense, is like the empty tomb.  It’s a SIGN.  But I don’t think we can use the term “proof of the resurrection” when it comes to the Shroud…  If there was really a proof of this on the Shroud, we won’t need faith no more ! ;-)\n\n","date":"August 10, 2011 at 10:37 am","url":"https://shroudstory.com/2011/08/09/rembrandt-understanding-christ/","cat":"art","id":"comment-3558","author":"Yannick Clément","site":"shroudstory"},{"title":"Rembrandt Understanding Christ","post":"I’m glad you elevated this to a blog post. I thought it was beautiful. Thanks.\n\n","date":"August 9, 2011 at 4:39 pm","url":"https://shroudstory.com/2011/08/09/rembrandt-understanding-christ/","cat":"art","id":"comment-3552","author":"AnnieCee","site":"shroudstory"},{"title":"Rembrandt Understanding Christ","post":"“…mystery of Christ and it is the Incarnation of God!” This was your first mistake because God did not die, He is a forever living God. So Jesus is the manifestation of God in the flesh. They are one. The Holy One.\nnew test. : John to the seven churches which are in Asia: Grace be unto you,\nand peace, from Him which Is, and Which Was, and Which Is To\nCome; (rev 1:4)\nold Testament: Ye are my witnesses, saith the LORD, and My servant whom I\nhave chosen: that ye may know and believe Me, and understand\nthat I Am He: before Me there was no God formed, neither shall\nthere be after Me. (ISA 43:10)\nNew test: I Am He that liveth, and Was dead; and, behold, I Am alive for\nevermore, Amen; and have the keys of hell and of death. (John 1:18)\n\n","date":"November 19, 2011 at 11:49 pm","url":"https://shroudstory.com/2011/08/09/rembrandt-understanding-christ/","cat":"art","id":"comment-4895","author":"The voice of one crying in the wilderness","site":"shroudstory"}]
