[{"title":"Roger Bassett’s Clarifying Art","post":"Didn’t I read on one of thee sites something that was worded similar to “I know what we have here is that I don’t know, it is incomprehensible” ??\n\n","date":"December 11, 2014 at 4:04 am","url":"https://shroudstory.com/2014/12/11/roger-bassetts-clarifying-art/","cat":"art","id":"comment-175663","author":"ekmcmahon","site":"shroudstory"},{"title":"Roger Bassett’s Clarifying Art","post":"Well what can I say? It’s an excellent article, and what’s more it supports my own observation. It clarifies many misconception and gives much food for thought. Moreover, it seems to provide some crucial information for one of my projects, but what exactly I will reveal when I make it.\n\n","date":"December 11, 2014 at 9:34 am","url":"https://shroudstory.com/2014/12/11/roger-bassetts-clarifying-art/","cat":"art","id":"comment-175711","author":"O.K.","site":"shroudstory"},{"title":"Roger Bassett’s Clarifying Art","post":"Yes it is a excellent article. Before the development of technology, most of the peoiple, like today – including Popes, thought TS is just a painting. Now technology is changing our perception.\n\n","date":"December 11, 2014 at 10:26 pm","url":"https://shroudstory.com/2014/12/11/roger-bassetts-clarifying-art/","cat":"art","id":"comment-175806","author":"Sampath Fernando","site":"shroudstory"},{"title":"Roger Bassett’s Clarifying Art","post":"I can’t say I’m keen, I’m afraid. I do not see an oriental eyed Jesus with curly Nubian hair. The finished image does not look good in ImagJ either, as the enhancement of the cheeks makes them appear higher than the nose – just as they do in ordinary photographs, in fact. And I disagree completely with the conclusion that the orginal image “immediately brings to mind a scene of horrific brutality … a reminder of suffering and brokenness … seemingly without expression”, while the enhanced image “reveals more specifically a definitive expression on the face … immediately pleasing, even divinely sweet.” It just doesn’t do it for me. There is some milage in attempting to identify places on the image where there “ought to be” some discolouration but there isn’t, and to try to correct the failure, but this must be a highly subjective task, and one man’s interpretation may not fit anothers. To call this a definitive likeness is pushing the value of this research too far.\n\n","date":"December 11, 2014 at 2:03 pm","url":"https://shroudstory.com/2014/12/11/roger-bassetts-clarifying-art/","cat":"art","id":"comment-175730","author":"Hugh Fareyn","site":"shroudstory"},{"title":"Roger Bassett’s Clarifying Art","post":"He looks much more like Gimli, son of Gloin now. The Shroud of Moria?\n\n","date":"December 11, 2014 at 9:57 pm","url":"https://shroudstory.com/2014/12/11/roger-bassetts-clarifying-art/","cat":"art","id":"comment-175801","author":"David Goulet","site":"shroudstory"}]
