[{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"This encapsulates the essence of the Shroud. Behind the debates about the few scraps of scientific evidence we have lies the Shroud’s subjective power.  It is a sublime work of art that indeed expresses everything this perceptive student has described.  As a delicate and subtle (reversed) monotone it defies comparison with anything produced by any known artist.\n\n","date":"August 24, 2013 at 6:19 am","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-41877","author":"David Rolfe","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"David, I’m curious…You have been lucky enough to be just feet from the actual Shroud during your making of one of your films, I believe. What ‘feelings’, if any, did you experience?…It must have been something awesome.\nR\n\n","date":"August 24, 2013 at 11:30 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-41930","author":"Ron","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"In short, yes.  It was also quite a shock to see how much more subtle the image is to the eye in natural light.  The nature of any image reproduction process tends to accentuate the inherent contrast of the image.  When copies of the Shroud are reproduced there is an even greater tendency to accentuate contrast to enable the viewer to perceive the image easily.  All ordinary computer screens vary in their contrast so I cannot predict what may actually be seen on any individual screen but I have tried to recreate an image that can be downloaded here: http://we.tl/YG9iVXHwyD that more faithfully shows the actual colours.  The background cloth is almost ivory and the image, even for someone as used to seeing its photographs as I am, is barely perceptible and –  close up – is almost impossible to decipher. \nHowever, as we well know, once “unlocked” by photography, so much more depth and contour becomes readily seen.\nMy other main thought about the image in line with its “perfection” is its nakedness.  As such it is devoid of any single thing that would betray an attribute that might identify the body with a specific culture or, indeed, faith. It is “Everyman”\n\n","date":"August 25, 2013 at 10:14 am","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-41946","author":"shroudenigma","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"I have never seen a picture of that statue before. It is indeed a work of art drawn from the Shroud and expresses the agony and suffering of the Man in the Shroud. A small forensic note: the statute demonstrates that the Man in the Shroud was in a state of rigor mortis (knees bent at time of death). That means that it is likely that the image was transferred to the Shroud within 48 hours of his death. \nLet’s see, under normal circumstances rigor mortis would have been released by 3:00 pm the Sunday after the Friday execution. That’s sometime after the accounts of Mary Magdalene’s discovery of the missing body at day break Sunday morning.\nYet, the impact of this work of art is so awesome, that I don’t want my technical note to distract from the total impact of the work. For now, let’s just savor it.\n\n","date":"August 24, 2013 at 7:13 am","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-41880","author":"John Klotz","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"In the hypothesis the TS crucifixion victim is Yeshua, MOST LIKELY the image of his stiff rigid bloody body in was NOT recorded on his resurrection or return to life but on his very burial that is just after his dressing in shrouds and more precisely while the body was drying out via fumigation and purified. \nThanatologically speaking, I would like very much Yannick et al explain to me HOW COME a body/corpse allegedly just (loosely) draped over with the said shroud could have been recorded tightly compressed AND a little less tightly compressed front and back and IN MAXIMUM STIFFNESS as we see it, 57-63/69-75/81-87 hours after rigor statuaris had set in or, in other words, 9-12/21-24/33-36 hours AFTER rigor statuaris should have normally disappeared… Will Yannick et al deduce here it was a ‘most specific case’ of rigor statuaris?\nReminder: to the sole exception of rigor statuaris that sets in at the very time of death,  rigor mortis normally develops during the first 12 to 24 hours, but then decreases again until 36 to 48 hours later it has completely disappeared.\n\n","date":"August 24, 2013 at 11:25 am","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-41889","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"Corrections:\n– 5th line, the right figures are:  “33-39 (or 57-63)  hours AFTER rigor statuaris had set in”\n– 2 paragraph, 6th line, the right figures are:  ” 3 hours BEFORE – 3 hours AFTER (or 21-27 hours AFTER)” rigor statuaris should have normally disappeared.\n\n","date":"August 24, 2013 at 7:12 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-41916","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"Just a remark – timings of the forensics ( as anything in medicine and biology) are not timings cut in stone. 48 hours  at some conditions might extend to, lets say, 51 hour or shorten to 43.\nTemperature, humidity and other factors do interfere with biological processes.\n\n","date":"August 25, 2013 at 2:30 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-41960","author":"jesterof","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"Jester of, \nof course nothing is cut in stone as far as time of occurrence in the forensics is concerned STILL… \n…please, do note the TS image does show a crucifixion victim’s body in maximum stiffness AND my first and second time of occurrence precisely refer to MAXIMUM STIFFNESS AS A STARTING POINT IN TIME. \nNow how can anybody want us to believe the image formation process occurred in the middle of the night (or just before sunset) upon resurrection or return to life on the third day after Yeshua’s death when the latter’s body was ALREADY in maximum stiffness upon his very death (on the 1st day) at 3h/3h30 p.m. on the day just before the Great Sabbath (Easter)? \nEducated Christians should know the peak of rigor mortis normally occurrs from the 12th/13th to the 24th/25th hours after death. In Yeshua’s specific case, his body’s rigor statuaris was at its peak as early as about 3h/3h30 a.m. – about 3h/3h30 p.m. on the following/second day (Judean daytime). \nThis forensic reality is a far cry from what most Christians most wrongly imagine. \nForensically speaking, the opinion the TS crucifixion victim’s body was STILL IN MAXIMUM STIFFNESS about 2h30 BEFORE-about 3h30 AFTER rigor statuaris should have normally DISAPPEARED, is TOTALLY inconsistent. Maximum stiffness just could NOT have occurred in the middle of the night or any time between the middle of the night and before sunset upon Yeshua’s resurrection or return to life on the third day. \nWhence, NOBODY should seriously contend the TS image formation process that recorded the crucifixion victim’s body in maximum stiffness occurred sometime on the third day. This is patently untrue.\nReminders: \nNormally maximum stiffnes occurrs about mid way before rigor mortisis sets in and disappears. \nIn Jerusalem and INSIDE a cave-tomb hewn in malky rock, the average maximum temperature is 17° C and humidity is very low in spring. \nIn my reconstruction of Yeshua’s burial, the body was dried out via fumigation (to account for a low-temperature image-colour-formation process) in the tomb ante-chamber and then  placed in supine position inside the sole funerary vaulted niche stone bench on a bed of granulized myrrh (blended myrrh and aloes?) to delay as far as possible the body from putrefying in the burial chamber.\n\n","date":"August 25, 2013 at 6:49 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-41988","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"Correction (sorry): Educated Christians should know the peak of rigor mortis normally occurrs from the 12th/13th to the 24th/25th hours after death. In Yeshua’s specific case, his body’s rigor statuaris had already disappeared or was ABOUT TO GRADUALLY DISAPPEAR as early as about 3h/3h30 a.m. –\nabout 3h/3h30 p.m. on the following/second day (Judean daytime).\n\n","date":"August 25, 2013 at 7:35 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42006","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"This is similar to my feelings, mine were not as intense, when I first saw the cleaned up 3-D version of the negative of the face photograph of the shroud.\n\n","date":"August 24, 2013 at 2:23 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-41904","author":"Emmett McMahon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"I know so very little of what happens to a body after it ceases life.  I know that they are buried as were my immediate family members after their death.\n\n","date":"August 24, 2013 at 7:38 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-41918","author":"ekmcmahon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"Max, why do you think it has to be the point of maximum stiffness when the image appears?\nBesides the stiffness does not change to the extend that the body will flatten by itself of become flexible as live one.\nYou definitely never had to do an autopsy or learn anatomy on the cadavers….\n\n","date":"August 25, 2013 at 10:46 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42028","author":"jesterof","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"Jester of, it does seem you just TOTALLY missed my point.\nWith all due respect, meguesses, you are neither a professional medical examiner nor a forensic archaeologist since (archeao)forensically/(archaeo)thanatologically, speaking, you STILL cannot quite discriminate between mere rigor mortis (that normally develops during the first 12/15 to 24/27 hours, but then decreases again until 36/39 to 48/51 hours later it has completely disappeared) and RIGOR STATUARIS/”rigidité statuaire” (that sets in immediately or almost immediately upon death).\nOr to put it in other words: Can YOU tell me of JUST ONE CASE of rigor statuaris (that is MAXIMUM STIFFNESS) still observed in burial condition 33-39 hours AFTER rigor statuaris/maximum stiffness has set in?\nYou wrote: “why do you think it has to be the point of maximum stiffness when the image appears?” \nJust ASK a medical examiner or a forensic archaeologist to take a good look and guess or re-read the forensics of the TS man… I had thought you had a much better descriptive knowledge of the crucifixion victim image on the Turin Shroud…\nYou most definitely are neither a medical examiner nor a forensic archaeologist as far as (paleao)thanatology is concerned.\nReminder: Most likely, it shall be here applied to a 1st c. CE crucifixion victim….\n\n","date":"August 26, 2013 at 11:16 am","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42069","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"Addendum I mean a medical examiner or a forensic archaeologist WORTH HIS SALT.\n\n","date":"August 26, 2013 at 11:23 am","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42071","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"Max, I am ASKING, not critiquing LOL\nand last time I’ve checked neither are you a forensic medical examiner.\nForensics are the part of medical school training and pathology as well. One has to perform an autopsy in order to graduate.\n\n","date":"August 26, 2013 at 6:05 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42091","author":"jesterof","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"\nMax Patrick Hamon :\nYou wrote: “why do you think it has to be the point of maximum stiffness when the image appears?”\nJust ASK a medical examiner or a forensic archaeologist to take a good look and guess or re-read the forensics of the TS man… I had thought you had a much better descriptive knowledge of the crucifixion victim image on the Turin Shroud…\nYou most definitely are neither a medical examiner nor a forensic archaeologist as far as (paleao)thanatology is concerned.\nReminder: Most likely, it shall be here applied to a 1st c. CE crucifixion victim….\n\nThat’s a question TO YOU.\nA medical examiner or a forensic specialist I can ask most likely won’t think any body at any stage will produce any image on any cloth :-)\nThat is why I asked YOU – why do you think it appeared at the moment of the maximal stiffness – it might have appeared at the half-released one.\n\n","date":"August 26, 2013 at 6:09 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42092","author":"jesterof","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"The fact is I ALSO ASK YOU to carefully RE-read the forensic literature on the Turin Shroud before passing comments re rigror statuaris, which you most obviously haven’t.  Were you informed about the way late-antique Judeans used to/should bury a body/corpse to abide by the Halakha (Judean religious law), which you most obviouly ignore too, you could have known the body SHOULD have been laid in suspine postion AS FLAT AS POSSIBLE and composed in dignity in a bier, niche or bench in the tomb chamber on burial. \nForensically speaking and MOST obviously, this is NOT what was and still can be observed on the TS: the TS man WAS NOT laid as flat as is possible in NORMAL CIRCUMSTANCES. Several signs are consitent with rigor statuary setting in immmediately or almost immediately upon death while vertically hanged head up on a cross. \nRe ‘QUESTIONS TO Jester of’, STILL waiting for YOU to give JUST ONE CASE of rigor statuaris (that is MAXIMUM STIFFNESS) observed in burial condition at least about 33-39 hours AFTER rigor statuaris/maximum stiffness has set in. Meguess most likely I should have to wait for ages (or Judgment Day) since, forensically speaking, NO SUCH A CASE is known in forensic records or has ever been observed.\nWhen you wrote: “A medical examiner or a forensic specialist, I can ask, most likely won’t think any body at any stage will produce any image on any cloth :-)”, you are just eluding THE QUESTION ABOVE I just wanted you and still you to reply to. Yes that was and still is A QUESTION TO YOU.\n\n","date":"August 27, 2013 at 9:11 am","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42126","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"Hence my conclusion:  In the MOST LIKELY hypothesis the TS is Yeshua, absent the fact the TS man’s STILL STIFF RIGID body was compressed front and back on image formation, the latter process JUST COULD NOT HAVE OCCURRED in the middle of the night (or just before sunRISE) upon resurrection or return to life on the third day after Yeshua’s death\n\n","date":"August 27, 2013 at 9:23 am","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42127","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"Corection: “was compressed and, on the whole, just slightly less compressed front and back on image formation”\n\n","date":"August 27, 2013 at 9:29 am","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42129","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"Correction (csorry): “was FIRST compressed and, THEN just slightly less compressed (to only a couple of exceptions) front and back on image formation\n\n","date":"August 27, 2013 at 9:31 am","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42130","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"Max, I think you do not hear what I am asking. I do not have to read any literature, because my question is not a dispute of timing – it is a QUESTION on a different matter – it is obvious that you think that the image appeared at the point of the maximum rigor mortis and I am asking you – why? why do you think so? how can you measure maximum vs medium vs minimal rigor mortis quantitatively?\nIn any instance, the Resurrection occurred at ~ 3 am in the morning, which makes it exactly 36 hours after death – by any means it is absolutely within the necessary time frame to still have very rigid body.\n(I do not even understand why are you arguing with me, I never disputed the time frame).\n\n","date":"August 27, 2013 at 8:13 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42167","author":"jesterof","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"just an addition – time onset and duration of the rigor mortis varies and is very dependable on the temperature and predeath conditions. The colder the temperature the longer rigor mortis lasts and at some situations it lasts as long as 3 days, \nBut in any case in 36 hours body is still going to be stiff in a cold cave at night. The reversal process just begins in 24-36 hours and it is never immideate and sets in in the same order it began ( so the ffacial muscles wull relax first, wit the legs relaxing last)\nhttp://books.google.com/books?hl=en&lr=&id=qxO3Z0um6WMC&oi=fnd&pg=PR3&dq=rigor+mortis+time+frame+in+humans&ots=MH2C8KChV_&sig=st2wEOOq9WrMW2sKTehb8K7IR-A#v=onepage&q=rigor%20mortis%20time%20frame%20in%20humans&f=false\n\n","date":"August 27, 2013 at 8:38 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42172","author":"jesterof","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"Jesterof you wrote: \n“The colder the temperature the longer rigor mortis lasts and at some situations it lasts as long as 3 days,”\nYeshua was NOT buried in Ukrania in winter BUT in Jerusalem in Spring!\nNever such extreme situations as you MOST MISLEADINGLY mentioned were ever met for Yeshua’s rigor statuaris to last more than 12/15 -24/27hours. You are TOTALLY off track.\n\n","date":"August 28, 2013 at 7:11 am","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42208","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"Jesterof, \nPLEASE, CAN YOU take a REALLY relevant case that REALLY makes sense as far as Yeshua’s burial and  rigor statuaris is concerned? Meguess you jusrt CAN’T.\n\n","date":"August 28, 2013 at 7:18 am","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42209","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"Reminder: STILL WAITING FOR YOU to refer me to a TRUE RIGOR STATUARIS (i.e. NON CURRENT RIGOR MORTIS) CASE of a man buried in Judea/the Near East/Middle East etc in spring and whose body remained in maximum stiffness for more than 33-39 hours after death.\n\n","date":"August 28, 2013 at 7:40 am","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42214","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"Reminder 2: The man shall have met a violent death with immediate or almost immediate rigor statuaris and been left some time in the open air (a couple of hours) in spring and then placed in a cave tomb at about 17° C with very low humidity rate.\nReminder 3: Jerusalem weather in April for this year:\nAverage Temperatures: 13-21 Centigrade =  55-71Fahrenheit\nAverage Humidity Level: 36-74%\n\n","date":"August 28, 2013 at 8:16 am","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42216","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"Reminder 4: There are two types of hospital morgue unit cold chambers:\n– positive temperature +2/+4°C (the most common type)\n– negative temperature -15°C/-25°C (used by forensic institutes for the storage of bodies\nthat have not yet been identified). None of these is appropriate as a reference case in the case under study.\n\n","date":"August 28, 2013 at 8:33 am","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42218","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"Most definitely you are neither a medical examiner nor a forensic archaeologist.\n\n","date":"August 28, 2013 at 8:38 am","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42220","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"Most definitely neither are you LOL\n\n","date":"August 30, 2013 at 4:32 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42422","author":"jesterof","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"Just in cas you are not convinced the TS man bloody body was recorded WHEN HE WAS STILL IN RIGOR STATUARIS here is the extract of a paper I wrote in French as early as 1990 (with two updates in 1996 and 2006): \nSYNTHÈSE DES LECTURES MÉDICO-LÉGALES\nDE L’EMPREINTE DE L’HOMME DU LINCEUL\n(copyright Max Patrick Hamon)\n(En concordance avec les témoignages des Évangiles de Matthieu, Marc, Luc et Jean)\nBibliographie très sommaire : Barbet R. La Passion de Notre Seigneur Jésus-Christ selon le chirurgien, éd. MédiasPaul, 1950 ; Buckling R., The Shroud of Turin : a Pathologist’s Viewpoint, Legal Medecine Annual, 1982 ; Zugibe F.T. The Crucifixion of Jesus : a  Forensic Enquiry, New York, éd. M. Evans, 2005\nUN VISAGE MÉCONNAISSABLE\nH\nomme supplicié 30-45 ans ; 1,78 m ± 3 cm – 71 – 79 kg environ avec indices céphalique et nasal méditerranéens (sémitiques marqués) ; visage encadré de deux longues mèches temporales de cheveux flottants ; longue chevelure en traîne dans le dos – jusqu’au milieu des omoplates – mais qui devait, à l’origine, être ramenée sur la nuque ; barbe que rejoint une petite moustache retombante toutes deux épaissies, à gauche, d’une conglutination de sang mêlé de liquide pleural d’origine traumatique écoulé des narines ; extrémité droite de la moustache manquante ; plaques de barbe arrachées sous la partie droite de la lèvre inférieure et à la pointe du menton conférant à ladite barbe un aspect bifide ;  piqûres profondes et multiples de 1 à 2 mm de diamètre sur toute la partie visible de la calotte crânienne : treize piqûres dans les régions frontales et temporo-frontales dont deux notamment (dans les régions temporo-frontales) ponctuées d’une double coulée latérale abondante de sang en forme de V renversé – l’une d’une piqûre du rameau de la veine superficielle gauche et l’autre d’une piqûre du rameau de l’artère superficielle droite – et une (dans la région frontale) ponctuée d’une abondante coulée médiane et « en forme de trois » de sang veineux dans les rides formées par les plissements spasmodiques des muscles peauciers des arcades sourcilières ; au moins vingt autres piqûres – huit ponctuées d’écoulements sanguins artériels interrompus et accumulés sur une ligne convexe vers le bas dans la région occipitale et douze ponctuées d’écoulements sanguins provenant du réseau de veines du plexus vertébral ; une cinquantaine (estimation) d’autres piqûres dans le scalp temporo-pariétal (non visible à l’examen)  ; visage déformé par les coups – surtout côté droit – avec de multiples excoriations et blessures lacéro-contuses ; arcades sourcilières tuméfiées ; petits renflements plus ou moins circulaires au niveau des yeux ; épanchement post-traumatique du liquide conjonctival au creux du coin de l’œil droit avec une déchirure à la paupière inférieure ; blessure triangulaire – de 2 cm de base – sur la pommette droite dans la région zygomatique sur le muscle élévateur naso-labial avec le sommet pointant vers le nez ; tuméfaction du nez avec excoriation et microtraces terreuses à son extrémité ; fracture possible du cartilage nasal avec déviation vers la droite comme sous la pression d’un linge ; gonflement de la pommette gauche avec l’œil en partie fermé; côté gauche du menton tuméfié ; lèvres gonflées, serrées et comme éclatées  (cf. Mt 26, 67-68 ; 27, 28-30 ; Mc 14, 65 ; 15, 17,19 ; Lc 22, 63-64 ; Jn 18, 22 ; 19, 2-3).\nUN CORPS DÉVASTÉ…\n                 Traces de violences, – entre 600 à 700 lésions –, sur l’ensemble du corps (partie latérale du corps invisible à l’examen) avec notamment 100 à 120  lésions cutanées à ecchymoses variant en intensité et en forme de petite haltère ronde d’une longueur d’un peu plus de 3,5cm chacune, chacune distribuées devant – haut de la poitrine, région stomacale, partie antérieure des cuisses , face antérieure des mollets – et derrière, – mais de façon plus abondante – en éventail à partir d’un axe horizontal à hauteur des reins, d’un côté et de l’autre, vers le haut jusqu’aux épaules et vers le bas sur les jambes ; centre d’assénement des coups à droite un peu plus haut que celui de gauche (Mt 27, 26 ; Mc 15, 15 ; Lc 23, 16 ; Jn 19, 1). Semis de marques lacéro-contuses étalé et en partie effacé dans la région scapulaire par deux larges zones d’abrasion – l’une oblique (en bas et en dedans) et rectangulaire de 10 x 7,5 cm sur l’épaule droite, l’autre circulaire de 12,5 cm de diamètre plus bas sous l’omoplate – causée par le port et les frottements répétés d’un objet lourd et rugueux (Jn 19, 17) ; genoux abrasés particulièrement le gauche avec, dans la région de la rotule, des excoriations aux bords déchiquetés ; microtraces terreuses aux genoux et à l’extrémité du nez, indicielles d’une chute (Mt 27, 32 ; Mc 15, 21 ; Lc 23, 26).\n                 Perforation soit de la base de chacune des mains par enclouage en plein carpe dans la gouttière entre le radius et le cubitus soit du sillon entre les deux éminences du haut de la paume, dans le passage entre le grand os du carpe, le trapèze et le scaphoïde, avec ressortie du clou au revers de chacun des poignets (pouces fléchis dans la paume invisibles à l’examen). Perforation des cous-de-pied par enclouage du pied gauche sur le pied droit entre le deuxième et le troisième os cunéiforme du tarse en avant du scaphoïde avec un clou unique de section carrée de 0,8 cm de côté (Mt 27, 32 ; Mc 15, 21 ; Lc 23, 26) ; ruissellement de la plaie du cou-de-pied gauche vers le bord externe du talon ; traces de terre sous les talons avec, au niveau du talon gauche, l’empreinte laissée par les trois doigts (auriculaire, annulaire et médium) d’une main gauche masculine en position contractée typique d’un geste de préhension du corps indiciel de sa manipulation (post mortem ?). Plaie béante de forme ovalaire selon un grand axe de 4,4 cm et un petit de 1,5 cm situé dans l’hémithorax droit sans aucun retour de chairs mais avec les lèvres précises et droites parallèles à la courbe des arcs costaux antérieurs ; coup porté post-mortem par une sorte de lame avec glissement ascendant contre la sixième côte et perforation du cinquième espace intercostal ; péricarde et oreillette droite transpercées avec abondante émission de liquide séreux clair d’origine traumatique et de sang coagulé (Jn 19, 33 ; 20, 20, 25, 27) débordé, d’abord à la verticale, sur la poitrine puis écoulé, à l’horizontale, en deux fins sillons serpentant et s’entrecroisant dans l’ensellure lombaire, du flanc droit jusqu’au flanc gauche, à hauteur de la taille. \n…ET EN RIGIDITÉ STATUAIRE\n                 Incurvation antérieure à 20° de la tête immobilisée par la rigidité cadavérique, le menton quasi appuyé sur la fourchette sternale (Jn 19, 30) ; contraction tétanique de l’ensemble des muscles : grands pectoraux saillant en contraction forcée, élargis et remontés vers les clavicules : déboîtement des articulations scapulo-humérales avec l’épaule droite légèrement plus basse par rapport à la gauche causant une légère asymétrie de l’axe général du corps ; forçage des bras tétanisés de l’abduction à l’adduction pour cause d’ensevelissement (Mt 27, 60 ; Mc 15, 46 ; Lc 23, 53 ; Jn 19, 40-42) ; à l’origine bras écartés du corps et en extension vers le haut selon deux angles différents : avant-bras droit quasi vertical coude fléchi et bras droit presque horizontal – bras gauche formant un angle vers le haut sans flexion du coude ; creux brachio-thoracique de droite plus accentué  que celui de gauche ; mains croisées in rigor mortis au-dessus du pubis, main gauche en avant du bras droit ; à partir de la plaie de(s) poignet(s) une double coulée de sang jusqu’au(x) coude(s) mesure, par rapport à l’axe de chacun des avant-bras, deux angulations de 44° et de 33° relatives aux basculements d’avant en arrière du centre de gravité du corps en suspension à un support vertical –  selon une position d’affaissement et une position de surrection par traction sur les bras et appui sur l’avant des pieds ; positions conservée alternativement par la victime ; cage thoracique surdistendue dans une inspiration maximale ; creux épigastrique enfoncé et déprimé par la surélévation extrême des rebords costaux et la distension en avant et en dehors du thorax ; lordose lombaire exagérée ; hypogastre saillant avec masse abdominale refoulée vers le bas par les viscères comprimées que le diaphragme contracte ; sphincters relâchés ; forte saillie musculaire des cuisses ; genoux semi-fléchis ; jambe gauche en avant de la jambe droite avec marque d’encordement dans les chairs de la région tibio-péronale ; pied gauche chevauchant le pied droit tous deux fléchis en extension maximale et en torsion vers l’intérieur (Mt 27, 33 ; Mc 15, 24 ; Lc 23, 33 ; Jn 18, 23 ; 16, 16) ; mort très probablement soit en début d’insuffisance respiratoire d’une hémorragie du péricarde post infarctus (douleur thoracique fulgurante) (Mt 27, 50 ; Mc 15, 37 ; Lc 23, 46) soit victime d’un phénomène de décompensation systémique aggravée par une double détresse respiratoire et cardiaque ; entrée post mortem immédiate du corps en rigidité statuaire (tétanisation paroxystique neuromusculaire) ; enseveli encore en état d’hyperthermie (entre 40 et 43° Celsius) ; absence de métabolites de décomposition indicielle du court séjour du cadavre dans le linceul (Lc 24, 3-4 ; Jn 20, 2, 5-7) ; à partir d’échantillons importants de sang prélevé dans la zone occipitale et celle de la plante du pied droit, identification du groupe sanguin AB rhésus positif ; teneur en biluribine supérieure à la norme du sang humain, indicielle ici d’un état d’épuisement extrême (Mc 15, 44) ; identification des gènes de la bêta globine du chromosome 11, de l’amélogénine X du chromosome X et de l’amélogénine Y du chromosome Y caractérisant l’ADN d’un être humain de sexe masculin.\n\n","date":"August 28, 2013 at 11:45 am","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42231","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"Jesterof as a MD (?), you should have heard of neuromuscular paroxystic tetanization aka rigor statuaris and its immediate post mortem setting in.\n\n","date":"August 28, 2013 at 12:01 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42234","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"\nMax Patrick Hamon :\nWhat’s your opinion Doc, was the TS man in maximum, medium or minimal rigor mortis?\n\ndon’t deflect the question – I asked YOU to answer this question and explain HOW are you able to find this out.\n\nMax Patrick Hamon :\nJesterof you wrote:\n“The colder the temperature the longer rigor mortis lasts and at some situations it lasts as long as 3 days,”\nYeshua was NOT buried in Ukrania in winter BUT in Jerusalem in Spring!\nNever such extreme situations as you MOST MISLEADINGLY mentioned were ever met for Yeshua’s rigor statuaris to last more than 12/15 -24/27hours. You are TOTALLY off track.\n\nwhich still gets pretty cold in a cave at night LOL\nor 4-5 degrees is not cold for you?\ndo you know that the body has the ambient temperature as well?\n\n","date":"August 30, 2013 at 4:26 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42419","author":"jesterof","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"Once Archaeologist Eugenia Nitowski got trapped in a Jerusalem 1st century CE cave tomb in spring and had to spend all the night in. It was not so cold as 4-5° C more like  8°C-12° C.\n\n","date":"August 31, 2013 at 5:15 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42526","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"Dont you forget too, in Jerusalem in spring, the day time temperature inside a Malky hewn cave tomb can raise up to a maximum average of 17°C.\n\n","date":"August 31, 2013 at 5:19 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42527","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"Absent the fact , in my burial scenario, the TS man had been tightly wrapped up in shrouds and subjected to a fumigation, which implies the temperature inside the cave tomb was higher than normal for several hours. Such a specific Judean ritual JUST CANNOT be ruled out. We mean here Archaeology TOO.\n\n","date":"August 31, 2013 at 5:25 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42528","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"A REMINDER DOR Jesterof:\n“As a Middle Eastern archaeologist, Nitowski  had previously excavated 17 tombs and knew “pretty well what the environment was like,” including the first one she’d ever worked on — a “rolling stone tomb dated to the time of Christ.”\nWhile she was working inside, a fellow worker rolled the stone closed, encasing her in stony darkness and silence, she said. She found a bench that lined the walls of the tomb’s central chamber and lay down on it, enjoying the cool stone wall’s feel against her face. As she did so, she thought about the temperature inside and later began digging into literature on the Shroud of Turin and whether anyone had tried to determine the temperature inside Christ’s tomb.\nA resulting article, “New Evidence May Explain Image on Shroud of Turin,” published in Biblical Archaeology Review, July/August 1986, was co-written with a researcher named\nJoseph Kohlbeck.”\n\n","date":"August 31, 2013 at 5:53 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42532","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"Jesterof,\nwhat do you make  of the fact most likely the Ts man was buried in hyperthermia (41°-43° C)? Nothing.\nWhat do yo make of Archaeologist Eugenia Nitowski re temperature inside Yeshua’s tomb? Nothing.\nWhat do you make of the possibilty for a specific Judean burial rite including fumigation and resulting in non normal temperature condition inside the cave tomb? Nothing.\nReminder:  The cave tomb Yeshua’s body was laid, was a stone’s throw from the cross ON the Golgotha mount.\n\n","date":"September 1, 2013 at 2:13 am","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42550","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"French Title in English: RATIONAL SYNTHESIS OF THE FORENSIC  READINGS OF THE TURIN SHROUD MAN IMPRINT by Max Patrick Hamon (copyright)\n\n","date":"August 28, 2013 at 12:16 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42235","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"What’s your opinion Doc, was the TS man in maximum, medium or minimal rigor mortis?\n\n","date":"August 28, 2013 at 12:35 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42237","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"Jesterof, was t the TS man first tightly wrapped up or just loosely draped over with the shroud? Was his body FIRST in NON rigor mortis laid flat on the stone bench in the burial chamber and THEN, most miraculouly, has rigor mortis developed so much so as to restaure his position on the cross to the sole exception of  his arms crossed over the pelvic region? Just guess?\n\n","date":"August 28, 2013 at 12:44 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42239","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"Doc, Is it a most extraordinary case of ‘inverted resurrection/return to life”?\n\n","date":"August 28, 2013 at 12:49 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42240","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"…Just ASKING LOL\n\n","date":"August 29, 2013 at 6:46 am","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42299","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"\nMax Patrick Hamon :\nJesterof, was t the TS man first tightly wrapped up or just loosely draped over with the\nshroud? Was his body FIRST in NON rigor mortis laid flat on the stone bench in the burial chamber and THEN, most miraculouly, has rigor mortis developed so much so as to restaure his position on the cross to the sole exception of  his arms crossed over the pelvic region? Just guess?\n\nI was not there to say how was it wrapped.\nRigor mortis develops very fast at some conditions – when there is a lot of lactate accumulated in muscles before death ( which is the case here) so the body taken from the cross could already been in the rigor mortis state ( not full, probably).\nSince the image and the stains on the Shroud point to the position as above statue is depicted, it is difficult to expect the body was flattened if the image does not depict the flattened body.\nOn the practical standpoint it is very difficult to flatten fully rigored body.\nSo what is your take – why there is a discrepancy between what one would expect for the burial ( flattened body) and the image on the Shroud which is not the flat body?\n\n","date":"August 30, 2013 at 4:20 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42417","author":"jesterof","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"\nMax Patrick Hamon :\nDoc, Is it a most extraordinary case of ‘inverted resurrection/return to life”?\n\ndon’t understand the question.\n\n","date":"August 30, 2013 at 4:22 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42418","author":"jesterof","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"\nMax Patrick Hamon :\nJesterof as a MD (?), you should have heard of neuromuscular paroxystic tetanization aka rigor statuaris and its immediate post mortem setting in.\n\nAND? I stated that already that upon certain conditions ( accumulation of lactate in the muscles which in the situation of undergoing rhabdomyolisis is almost certain) rigor mortis develops almost after death.\nyou want to play gotcha game?\nyou will loose, even if you are so damn superconfident LOL\n\n","date":"August 30, 2013 at 4:28 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42420","author":"jesterof","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"MDR\n\n","date":"August 30, 2013 at 6:44 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42434","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"oh, and I do not know French.\nThe rules of politeness require you to post something in English if you want your opponent to reply, especially if the text is Yannick-like by length ;)\n\n","date":"August 30, 2013 at 4:31 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42421","author":"jesterof","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"Your luck it was just an excerpt…\n\n","date":"August 30, 2013 at 6:33 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42431","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"Do you hope that our Lord Jesus is enjoying this banter between you folks about his burial Shroud?\n\n","date":"August 30, 2013 at 6:18 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42428","author":"Emmett McMahon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"The problem is Max has an extremely entangled way to present his theories plus for some unknown reason thinks in advance they are going to be attacked and builds the defense in initial presentation. Plus he jests himself and often in a vile way, but does not see it.\nThis causes the confusion of misunderstanding even from the people who are not hostile towards his ideas.\nThis particular instance is a classic example – as I understand, Max thinks that the body became rigid already on the cross and was covered in Shroud in not flattened position.\nWhich I never objected to, btw and actually confirmed by mentioning that buildup of lactate can cause almost immediate rigor mortis.\nWould he state this in those clear sentences – there won’t be any discussion.\nInstead Max started to question my knowledge of forensic pathology and the timings of establishment and resolution of rigor mortis ( which is variable).\nThis convoluted approach just to state one sentence – I think, Jesus Christ was buried in a flexed position since by the time He was taken from the cross His body already developed rigor mortis and therefore the image is as it is – resulted in lengthy and absolutely unnecessary discussion.\nBut instead he has chosen the path to go through collateral bushes in order to achieve – WHAT exactly?\n\n","date":"August 31, 2013 at 4:06 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42516","author":"jesterof","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"The problem is Jesterof thinks Yeshua was crucified in Ukrania in winter or spent sometime in one of the Jerusalem hospital morgue unit cold chambers either at positive temperature +2/+4°C or  negative temperature -15°C/-25°C, for Yeshua’s body to remain in rigor statuaris 33-36 hours after the said rigor had set in.\n\n","date":"August 31, 2013 at 4:40 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42521","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"Hope I am clear this time…\n\n","date":"August 31, 2013 at 4:44 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42522","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"Meguess Jesterof is just jesting. Is G.od(dess) a Jesterof? That is the question or I don’t understand Jesterof.\n\n","date":"August 30, 2013 at 6:24 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42429","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"\nMax Patrick Hamon :\nMeguess Jesterof is just jesting. Is G.od(dess) a Jesterof? That is the question or I don’t understand Jesterof.\n\nI am. \nHowever I have a hard time to get you sometimes. :-)\n\n","date":"August 31, 2013 at 4:16 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42518","author":"jesterof","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"No, really?\n\n","date":"August 31, 2013 at 4:32 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42520","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"My patched comments in reply to Jesterof ‘s non forensic and non archaeological approach re the temperature inside Yeshua’s tomb issue: \nThe problem is Jesterof thinks Yeshua was crucified in Ukrania in winter or spent 36 hours in one of the Jerusalem hospital morgue unit cold chambers either at positive temperature +2/+4°C or negative temperature -15°C/-25°C, for Yeshua’s body to remain in rigor statuaris 33-36 hours after the said rigor had set in.\n– What does Jester make of the fact most likely the TS man was buried in hyperthermia (41°-43° C)? Nothing.\n– What does s/he make of Archaeologist Eugenia Nitowski’s research re temperature inside Yeshua’s tomb? Nothing.\n– What does s/he make of cyclical daytime-to-nighttime temperature change? Nothing.\n– What does s/he make of the possibilty for a specific Judean burial rite including fumigation and resulting in non normal initial temperature condition inside the cave tomb? Nothing.\nFirst Reminder: \n“As a Middle Eastern archaeologist, Nitowski had previously excavated 17 tombs and knew “pretty well what the environment was like,” including the first one she’d ever worked on — a “rolling stone tomb dated to the time of Christ.”\nWhile she was working inside, a fellow worker rolled the stone closed, encasing her in stony darkness and silence, she said. She found a bench that lined the walls of the tomb’s central chamber and lay down on it, enjoying the cool stone wall’s feel against her face. As she did so, she thought about the temperature inside and later began digging into literature on the Shroud of Turin and whether anyone had tried to determine the temperature inside Christ’s tomb.\nA resulting article, “New Evidence May Explain Image on Shroud of Turin,” published in Biblical Archaeology Review, July/August 1986, was co-written with a researcher named\nJoseph Kohlbeck.”\nSecond reminder for Jesterof:\nThe cave tomb Yeshua’s body was laid in, was a stone’s throw from the cross ON the Golgotha mount. (S/he asserts it is ‘written in the Scriptures’ the Golgotha was not Yeshua’s burial place. Really?).\n\n","date":"September 1, 2013 at 11:40 am","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42582","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"Addendum: Joseph’s cave tomb (= Yeshua’s) had been hewn in the Golgotha mount quarry face side.\n\n","date":"September 1, 2013 at 11:47 am","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42584","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"Correction: hewn in the Golgotha mount  DISUSED OLD quarry face side.\n\n","date":"September 1, 2013 at 12:44 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42594","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"Have you got Nitowski’s paper, Max? Does it say whether she measured the temperature inside some tombs and what her measurements were?\n\n","date":"September 1, 2013 at 1:08 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42596","author":"Hugh Farey","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"\nMax Patrick Hamon :\nHope I am clear this time…\n\nYou are – you neither know correct spelling of the names of the countries, nor ability to listen what is being said.\nPlus you are illiterate on physical geography and climatology.\n\n","date":"September 3, 2013 at 5:07 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42801","author":"jesterof","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"and just FYI – there is not 40*C in Jerusalem in April.\nIt is a mild Mediterranian climate and although hot in summer, it is quite cold in winter and definitily not yet HOT as you’ve describbed in April.\nJanuary\nMAX 12°C / 54°F\nMIN 5°C / 41°F\nFebruary\n12°C / 54°F\n4°C / 39°F\nMarch\n16°C / 61°F\n6°C / 43°F\nApril\nMAX 21°C / 70°F\nMIN 9°C / 48°F\nMay\n26°C / 79°F\n14°C / 57°F\nJune\n28°C / 82°F\n16°C / 61°F\nJuly\n30°C / 86°F\n18°C / 64°F\nAugust\n30°C / 86°F\n18°C / 64°F\nSeptember\n28°C / 82°F\n17°C / 63°F\nOctober\n25°C / 77°F\n14°C / 57°F\nNovember\n19°C / 66°F\n11°C / 52°F\nDecember\n14°C / 57°F\n6°C / 43°F\n9*C as a minimal tempreature and 21*C as a maximum in April is NO WAY the heat wave you’ve so self-confidently described, Max.\nRefresh the basics of physical geography.\nThat’s what I’ve learned in 7th grade LOL\nJERUSALEM 31 78 N, 35 21 E, 2473 feet (754 meters) above sea level.\n  Jan Feb Mar Apr May Jun Jul Aug Sep Oct Nov Dec\nAvg. Temperature\n8 8 11 15 19 21 23 23 22 19 14 10\nAvg. Max Temperature\n12 12 16 21 26 28 30 30 28 25 19 14\nAvg. Min Temperature\n5 4 6 9 13 16 18 18 17 14 10 6\nAvg. Rain Days\n6 5 5 2 0 0 0 0 0 2 4 4\nAvg. Snow Days\n0 0 0 0 0 0 0 0 0 0 0 0 \nhttp://www.climate-zone.com/climate/israel/celsius/jerusalem.htm\n\n","date":"September 3, 2013 at 5:23 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42804","author":"jesterof","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"LOL!\n\n","date":"September 4, 2013 at 5:49 am","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42860","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"JESTEROF, by way of a MOST DELIRIOUS COMMENT wrote: \n“[…] you neither know correct spelling of the names of the countries, nor ability to listen what is being said. Plus you are illiterate on physical geography and climatology.”and just FYI – there is not 40*C in Jerusalem in April.”\nCAN YOU REALLY READ ENGLISH? \nOn August 28, 2013 at 8:16 am | #26\nI wrote:\n“Reminder 3: Jerusalem weather in April for this year:\nAverage Temperatures: 13-21 Centigrade = 55-71Fahrenheit\nAverage Humidity Level: 36-74%”.\nWhere do you get YOUR “40*C in Jerusalem in April”? The FIGURE is not coming from me but FROM YOU OWN MIND!\nBesides, it does seem you JUST cannot discriminate between temperature outside and inside a Jerusalem cave tomb in Spring and in Winter. You comment is just nonsensical.\n\n","date":"September 4, 2013 at 5:36 am","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42856","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"did you write about 40 or 41 degrees? can’t find it in those notes now.\nand the constant reference to winter in Ukraine – Ukraine is huge and has zones which are totally compatible with Israel by climate.\nApril the same temperatures in those zones as in Jerusalem. So is winter.\nUkraine is NOT Siberia, FYI ;-)\nyou also referenced somewhere as a huge revelation that the man of the Shroud died with hyperthermia – as if I have not been telling from the very beginning of my posting here, including THIS thread that the Man of the Shroud most likely had a case of severe rhabdomyolisis – what do you think this means?\nIn the conclusion – what the heck are you trying to convince me in?\ncan you just answer “yes” or “no” – are you trying to convince me that the Man of the Shroud most likely developed rigor mortis on the cross and therefore was buried with hips and knees flexed?\nJust YES or NO, please.\n\n","date":"September 4, 2013 at 6:25 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42958","author":"jesterof","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"BTW, I lived in Israel for 9 months.\n\n","date":"September 4, 2013 at 5:52 am","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42861","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"Re my spelling Ukrania (for Ukraine). It  was just A PUN on crania-Ukrania/Ucrania in conjunction with the word Golgotha, “Skull”). Too bad you totally missed it! ;-)\n\n","date":"September 4, 2013 at 6:05 am","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42862","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"I told you I sometimes don’t get you :-)\n\n","date":"September 4, 2013 at 6:26 pm","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42959","author":"jesterof","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"But have you got Nitowski’s paper, Max? Does it say whether she actually measured the temperature inside some tombs and what her measurements were?\n\n","date":"September 4, 2013 at 6:16 am","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-42863","author":"Hugh Farey","site":"shroudstory"},{"title":"An afterhours visit to the Pontifical Institute Notre Dame Center in Jerusalem","post":"Jesterof,\nYou wrote: “did you write about 40 or 41 degrees? can’t find it in those notes now.”\nI NEVER wrote “there is 40-41°C in Jerusalem in April” as you most dishonestly implied I did, just to discredit my opinion as illiterate. YOU CANNOT FIND IT, JUST BECAUSE I NEVER WROTE IT! \nYOU can be illiterate in French, Latin, Hebrew, Aramaic etc,\nYOU can be illiterate in Paleaopathology, Forensics, Archaeology etc\nBUT you cannot be wrong in your quoting others’ opinions or figures. \nIn normal conditions, the average temperature inside a sealed 1st c. CE era cave-tomb hewn in malky/melke stone is12 to13° C all through the year.\n\n","date":"September 12, 2013 at 10:13 am","url":"https://shroudstory.com/2013/08/24/an-afterhours-visit-to-the-pontifical-institute-notre-dame-center-in-jerusalem/","cat":"art","id":"comment-43928","author":"Max Patrick Hamon","site":"shroudstory"}]
