[{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"cool. The towering intellect endorses Wilson’s view on the image of Edessa / mandylion. I do too. Sorry Charles and Yannick (btw Thomas de Wesselow, atheist Cambridge Uni art historian, also endoreses Wilson’s view)\n\n","date":"August 31, 2013 at 6:04 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42474","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"I have enjoyed several of Rowan William’s books but he is a theologian and a poet with outside interests mainly in literature. I shall stick with the community of specialists who have rejected Wilson’s Edessa story until I have read Williams’ detailed support of it.\n\n","date":"September 1, 2013 at 5:07 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42557","author":"Charles Freeman","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"please advise who the community of specialists are who have rejected Wilson’s Edessa story\nCheers\n\n","date":"September 1, 2013 at 6:43 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42561","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Reply to Matthias. Those that I checked my article with before I published it as I have worked in this area previously and have some contacts in Byzantine studies as a result. Wilson is generally regarded as a joke figure. Perhaps you should find one specialist who does support him!!\n\n","date":"September 1, 2013 at 10:23 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42574","author":"Charles Freeman","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Simple explanation: RELIGIOUS BIAS…  So far, the only researchers (whether it be this Anglican Archbishop,   that have backed-up Wilson crazy ideas are ALL religious people.  Don’t you think this sound strange??? ;-)\nLook, I have done my homework about the Mandylion hypothesis and came out TOTALLY convinced that it is a ridiculous hypothesis with no solid basis.  Nevertheless, I’m more than aware that I will never succeed to convinced any pro-Wilson people, especially around here, so I have no plan to start another long and useless debate on this topic.\nLast thing:  in order for me to change my mind about this topic, I would need to see one authentic ancient manuscript that would CLEARLY refers to the Mandylion as a BURIAL CLOTH THAT WAS SHOWING THE COMPLETE BODY IMPRINT OF CHRIST (A MENTION ABOUT A DOUBLE IMAGE OF THE FRONT AND THE BACK WOULD BE A PLUS), ALONG WITH ALL HIS BLOODY STIGMATA.  \nSo, for those of you who think I have a set-up mind on the topic, just read again the above paragraph and you’ll see that I’m truly open to change my conclusion, but surely not on a purely speculative basis.\n\n","date":"September 1, 2013 at 7:12 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42619","author":"Yannick Clément","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"I need to write again my first sentence:  Simple explanation: RELIGIOUS BIAS… So far, the only PROFESIONAL HISTORIANS (whether it be DUBARLE, A DOMINICAN OR SOMEONE ELSE) that have backed-up Wilson crazy ideas are ALL religious people. Don’t you think this sound strange??? ;-)  I DON’T KNOW IF THIS ANGLICAN BISHOP IS ALSO AN HISTORIAN, BUT HE’S SURELY A RELIGIOUS GUY!\nNow, that’s better.\n\n","date":"September 1, 2013 at 7:18 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42620","author":"Yannick Clément","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"De Wesselow is an art historian, a PhD from Cambridge  I believe with good credentials. He agrees with the Mandylion hypothesis. He is not a religous person, but in fact an atheist.\n\n","date":"September 2, 2013 at 5:44 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42647","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"In my mind, De Wesselow is another Dan Brown kind of person who had a “sensational” book to sell, no matter how many Phd he might have on his walls…  What is important to understand is this:  it’s not just the academic background of a researcher that can make him a good one, but also the professionalism with which he is seeking the truth.  And for someone doing a serious historical research on one particular topic, this imply to never build up an hypothesis on wild spéculations. Because of this, I would never put my trust on anything coming from someone like this, sorry.  \nBut I agree that my term “religious” before “bias” was somewhat wrong.  I should have written “pro-Shroud” instead!  Effectively, unless someone desperately wants the authenticity of the Shroud to be proven at all cost (or at least reinforced) through the historical path, I seriously doubt that any person who would analyze with serious and honestly all the available historical and artistic data would end up putting his faith in Wilson’s “historical” hypotheses versus the Shroud (or De Wesselow’s conclusion or anyone like that who got a popular book to sell) for the simple and good reason that such hypotheses are mainly resting on wild and unproven speculations mixed up with some very partial (and sometimes distorted) pieces of evidence.\nOne thing’s for sure: that’s the main reason why all the professional experts in Byzantine and Syriac study that I know reject in block all these kind of highly speculative hypotheses.  I said it before and I’ll say it again here: in order to do a real serious, professional and honest historical research, someone must avoid to base any conclusion on wild spéculations and discordant facts (like the fact that there are two or three manuscripts that associate the Mandylion with a full length body image, while there are tons of other manuscripts that clearly speak of only a facial image, which is confirmed very well by all the known depictions of the relic), while, at the same time, always try to never “forget” or put aside all the most pertinent data.  That’s the only way someone can make an historical research that can be accepted by most scholars.  Unfortunatelly for Shroud science, this is not at all what have been done by most historical researchers over the last decades…\n\n","date":"September 3, 2013 at 5:43 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42805","author":"Yannick Clément","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"One day, no doubt, the so-called specialists will advance their game from mere ad hominem attacks, deconstruct Wilson’s hypothesis systematically, give us something more than mere speculations and subtle hints, and be able to tell us all what other credible theories they have been able to derive on the early history of the Shroud.  But it won’t be in my lifetime! Maybe most of them prefer to deny its authentic.  So, who then is biased?\n\n","date":"September 1, 2013 at 11:17 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42631","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"yes I wasn’t convinced by Charles’ answer that he consulted with specialists. I want to see convincing published rebuttals from these so-called specialists.\nPersonally, I don’t really care for specialists anyway. In my experience they are often “guns for hire”, who profess to be objective.\nYannick – have you read De Wesselow’s “The Sign”. I found his summary of the Madylion hypothesis quite compeling.\n\n","date":"September 2, 2013 at 3:09 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42640","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"One specialist I consulted said that as Wilson could not even read the original documents he could hardly be taken seriously, but the  consensus, fatal for Wilson, that I came across, is the impossibility of the living face of Edessa being the same as the dead face of the Shroud. It is up to Wilson to convince the experts, not the other way round.\nOften contributors to this site complain that academics don’t take the evidence for the Shroud seriously. Certainly from what I have heard Wilson is one of the main reasons. If, so they say,  he is the best academic historian that anyone can put up, one who cannot even read the documents in the original let alone show any specialist knowledge of Byzantine iconography (and this is a very crowded field- just go through the Dumbarton Oaks Papers),  then why bother with his hypothesis.\nIf one can ditch Wilson ,then one can begin to research\n1) The relics coming DIRECT from Jerusalem to Constantinople in the fourth and fifth century, including those procured by Pulcheria for the Blachernae Church.\n2) The relic collections at Sense and Chelles, near Lirey, that contain relics from the ‘Lord’s Tomb’ that arrived in the eighth and ninth century from Jerusalem. (See earlier posting.)\n3) The report of an image of the saviour on a linen cloth, in 570, at Memphis, Egypt. Important as it would have survived in the arid climate and so deals with the problem of preservation that would have been fatal for any linen cloth in a wall in the damp, in winter, climate in Edessa .(See my earlier posting.)\n\n","date":"September 2, 2013 at 6:18 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42649","author":"Charles Freeman","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Anyone can criticise! It takes effort and dedication to create and construct! Maybe it also takes just a little more imagination than any so-called historian is prepared to take a punt on! As I sad, not in my lifetime!\n\n","date":"September 1, 2013 at 11:22 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42632","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"What was the feed? It hasn’t shown up on any of the wires like Christian Newswire, CNS, ANS, RNS, PRNewswire, etc.\n\n","date":"August 31, 2013 at 6:56 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42477","author":"anonymous","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Dr. Rowan Williams is indeed a towering intellect and did a good number of things when he was the Primate of England, however there is one problem when it comes to what he endorses. Last year he took part in a Druid ceremony and a former member of his Church, Father Dwight Longenecker, now a Catholic priest, made some interesting comments on this on his blog.\n\n","date":"August 31, 2013 at 5:03 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42525","author":"Louis","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"There are gaps to be filled in the Edessa – Lirey connection and it must not be forgotten that Christian Edessa was destroyed during the Arab invasion, many things were lost during the vandalism that followed the French Revolution, Napoleon looted the Vatican Archives, shopkeepers in France are said to have used many of these documents to wrap their products and deliver them to their clients, carriages taking some of these documents back to Rome were lost. More recently, Muslim youth damaged many Orthodox Churches with precious paintings in Eastern Europe. But there is hope…\n\n","date":"September 1, 2013 at 10:29 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42576","author":"Louis","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Is the funding campaign floundering? Since Dr. Rowan Williams contributed $100 only six people have given a total of $260.00. Was the press release even sent out? How, if so? There hasn’t been a single story. Was this a major case of pennywise-poundfoolishness? For $65 on Christian Newswire you could have hit 1000 Christian News Outlets. For another $65 you could have delivered a press release into the hands of 400 Catholic journals. You think you might have gotten back your investment?\n\n","date":"September 2, 2013 at 6:23 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42650","author":"anonymous","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Thanks, Anon.  The advice from Christian Newswire was to delay sending until tomorrow because of the holiday.  And that’s the plan.  Fingers crossed.\nDavid\n\n","date":"September 2, 2013 at 7:32 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42658","author":"shroudenigma","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Charles, I don’t find your reference to anonymous ‘specialists’ convincing. Can you at least name them and their credentials? I’m very happy to keep an open mind and reconsider my view on Wilson’s mandylion hypothesis if I am convinced by an argument. I am far from convinced at present.\n”One specialist I consulted said that as Wilson could not even read the original documents he could hardly be taken seriously, but the consensus, fatal for Wilson, that I came across, is the impossibility of the living face of Edessa being the same as the dead face of the Shroud. It is up to Wilson to convince the experts, not the other way round.”\nBut the shroud face is so faint and undefined that it could easily be interpreted as a living face, or a resurrected face, or a dead face in the process of resurrecting. The ancients did not have the benefit of the photographs to see the clearly dead face.\n\n","date":"September 2, 2013 at 6:41 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42651","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Matthias. No, I can’t because I contacted people I worked with on previous occasions, privately, as I wanted some comments on my ‘Misguided Journey ‘article. It would  be inappropriate to name them. If you don’t want to trust me don’t, but concentrate instead on finding a single Byzantine specialist, someone who deals with the iconography of Byzantine art, who backs Wilson’s hypothesis. I certainly have never come across one but I have found much of the opposite.\nBut , PLEASE,  I am doing some general research on the links between East and West in Christian art at the moment and I have come across several leads that seem relevant to those working on the Shroud and I am passing them on to this website.  If you want the Shroud to become a  dead subject, don’t even try and follow them up!\n\n","date":"September 2, 2013 at 7:23 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42655","author":"Charles Freeman","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Charles\nwhat are your thoughts on my comment:\n“But the shroud face is so faint and undefined that it could easily be interpreted as a living face, or a resurrected face, or a dead face in the process of resurrecting. The ancients did not have the benefit of the photographs to see the clearly dead face.”\n\n","date":"September 2, 2013 at 7:31 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42657","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"This is the interesting question, that I am not qualified to answer, but others doubtless are, which is whether the images on the Shroud today have been exactly the same throughout its history,however long that may have been. \nI have pointed out cases where Wilson does provide misleading information – for instance, implying the ‘tetradiplon’ comes AFTER the passing of the Shroud to Jesus and so is a later wrapping up,  instead of BEFORE (with no indication that it was folded up again)- see my article on Tetradiplon. \nGenerally it is rather that some texts, for instance, the sermon of Gregarius Referendum, do not say what he and others claim that they says. From what the linguistic  specialists say, the references to the wounds in Gregarius never suggest that these are on the Shroud itself. More generally still, I would say that Wilson reads into texts things that are not there and that he relies too heavily on later texts at the expense of earlier ones.\nOn faces. Yes, the scholarly consensus is that faces were the main form in which these ‘not made by human hands’ cloths appeared in the late sixth century. Belting, Kitzinger and others discuss why it was at this time. As Kitzinger ( and other specialists) seem to agree, the bearded Christ appears in fourth century Rome and so seems to have been adapted from there. On the Memphis example, I would suggest that the Latin ‘effigies’ might well refer to more than just a face.\nObviously those who wish to can stay stuck with Wilson’s hypothesis, wonder why no academics take Should research seriously, and turn their backs on other possible ways in which an early relic might have reached Lirey. The trouble is that this will mean that Shroud research becomes a dead subject. No one with any knowledge of Byzantine iconography is likely to be drawn in and no one will start following up any other leads. However, I am clearly talking to a deaf audience which is disappointing as rejecting Wilson does not necessarily reject belief in the Shroud as authentic as Yannick has shown.\nI was sent the Sign by Penguin to review. Quite apart from De Wesselow’s bizarre explanation for the birth of Christianity, he had, after six years of research, added no material that I had not read elsewhere in secondary research, so I can hardly rate him very highly. I seem to have found more new (e.g. based on primary sources) leads to follow up in three months, see above, than he has in all those years and I am not even trying! Why  when so many people seem fixated by the Shroud is it impossible to find anyone qualified to take the research on?\nI am bowing out as I am having to prepare for an interview for a programme ‘Biblehunters’ on how how  Christian manuscripts shaped the early church. No need to say anything about de Wesselow there. Should be eventually out on BBC 2and the Smithsonian Channel.\n\n","date":"September 2, 2013 at 9:55 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42670","author":"Charles Freeman","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"well until I see a well constructed and comprehensive rebuttal of Wilson’s hypothesis from named and well qualified persons then I will continue to place some confidence in his theory.\nDo you not think a Cambridge trained Art historian (De Wesselow) is reasonably well qualified to comment on art history matters?\nYour comment at 6.18am states that your specialist advisors suggest that Wilson can’t read the orignal documents that he cites. What does that imply? That he fabricated the histories?\n\n","date":"September 2, 2013 at 7:30 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42656","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"One of the unexpected benefits of being a PhD student is the online access to numerous articles and books otherwise not easily accessed.\nI’ve downloaded Kitzinger’s ‘The Cult of Images in the Age Before Iconoclasm’.\nKitzinger refers to the image in Memphis, but it is in the sense of a facial image on a cloth.\nHe then goes on to refer to an image in Camuliana, and of course the Image of Edessa, and states that these images “all made their appearance at almost exactly the same time.”\n\n","date":"September 2, 2013 at 8:20 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42662","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"also interesting is Kitzinger’s reference (pp. 124) to ceremonial processions between 554-560AD in which the image of Camuliana was paraded through various cities.\n\n","date":"September 2, 2013 at 8:28 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42663","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"The question is: “Is there such a thing as History?” Winston Churchill’s noted aphorism is “History is Bunk!” It is a story written by the world’s victors and conquerors, who always destroy the records of the vanquished! There is certainly My-story, and Your-story, and even Her-story, which give us our identity and tell us who we are. There is much current PC rewriting of the NZ-story, with an all-inclusive indigenous bias, including the Treaty of Waitangi, alleged to be the founding document of my country. It is a story unrecognizable from what I and my contemporaries learned as college students. \nIf one has ever attempted to give a eulogy to a deceased loved one, you would know that there was never agreement among the deceased’s relatives about what was said. More often is heard “It wasn’t like that at all!” If there is no concensus about recent close events, what prospect is there ever knowing the real truth about remote events in the long distant past? \nOr is it the case, thet if all the world’s historians were laid end-to-end, then like economists, they would never be able to reach a useful agreed conclusion?\n\n","date":"September 2, 2013 at 5:05 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42699","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Oh shame on you! Winston Churchill adored history, and won the Nobel prize for literature largely for his History of the English Speaking Peoples. It was Henry Ford who said “History is bunk.”\nI take your point though.\n\n","date":"September 2, 2013 at 6:25 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42703","author":"Hugh Farey","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Thanks for the correction, Hugh! Yet another senior moment!\n\n","date":"September 2, 2013 at 9:23 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42719","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Charles\nI tried googling your article ‘Misguided Jouney’ but the potential links did not work.\nI’m still curious about your claim that a ‘specialist’ you consulted claimed Wilson could not be relied upon as he couldn’t read the original documents…\nHow relevant is this criticism when Wilson was presumably relying on existing translations (assuming he could not indeed read the original texts with regard to mandylion histories etc). Or are you implying complete fabrication?\nThis is an important question as it gets to the heart of the credibility of Wilson’s explanations.\nIf you or others could assist I would be appreciative.\n\n","date":"September 3, 2013 at 6:50 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42755","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Just read Guscin’s “the Image of Edessa” which is excellent. Contains several translations (by Guscin himself, a professional linguist) of texts on the Image of Edessa, a couple of which refer to a full body image not just the face.\nPretty convincing stuff, in my opinion\n\n","date":"September 3, 2013 at 8:57 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42769","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Yannick\nPlease, please , please!\nLike Charles you refer to all these Byzantine experts who reject Wilson’s theory. Who the heck are these ‘experts’??? Until you name them and their work then I think that is a baseless claim. You guys can’t just throw those claims out there.\nWhat say you of Guscin’s work that helps reinforce Wilson’s theory?\n\n","date":"September 3, 2013 at 6:09 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42807","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Matthias, you ask:  Who the heck are these ‘experts’??? \nSomeone else asked me the very same question recently and here’s the answer I gave him:\nHere’s a list of Byzantine experts that I have consulted to do my research concerning the Mandylion hypothesis:  Emmanuel Poulle, Antoine Legrand, Bernard Flusin, Anca Vasiliu, Irma Karaulashvili, Andrew Palmer, Sebastian Brock, Charles Freeman, Averil Cameron, Steven Runciman.  It’s important to note that every one of these experts (well-known for the majority of them) completely disagree with Wilson’s hypothesis.  In fact, the only researchers I know who agree with Wilson (partially in some cases) are all self-proclaimed pro-Shroud people (like Guscin, Scavone, Dubarle, Pfeiffer, Markwardt, etc.), which is very telling… \nWhat is also very interesting is the fact that at least two of the experts I consulted during my research (namely Poulle and Legrand) were in favor of the authenticity of the Shroud, while being, at the same time, in complete disagreement with Wilson’s hypothesis, which is exacly what I think.\n\n","date":"September 3, 2013 at 6:30 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42811","author":"Yannick Clément","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"I do not qualify as an expert in Byzantine iconography and texts. I only had my article checked by experts of whom at least one is on Yannick’s list. In fact,  I understood that the experts in this field are thoroughly fed up with being asked about Wilson’s pseudo-history. It seems impossible to get across to some just how thoroughly Wilson is rejected by anyone who is a specialist in this area. What more can one say?\nOne of Yannick’s experts, Averil Cameron,  wrote a review of Guscin’s book that can be easily found online.\n…. And when there are so many more plausible leads to follow up…..\n Incidentally for my coming interview, we are concentrating on the early church in Egypt and what the surviving papyri say- but nothing more has come up yet about the image on the linen cloth seen at Memphis in 570 but we are ending at AD 400 so perhaps that is not surprising.\n(Will see how I can get the links to my article restored- they were working until recently.)\n\n","date":"September 4, 2013 at 3:41 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42847","author":"Charles Freeman","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Thanks Yannick, good answer although I would hardly call ALL of those people ‘Byzantine experts’.\nAlso, to what extent had these experts seen the literary material that Wilson and Guscin refer to? To what extent was their advice to you based on an outline brief from yourself versus them having the chance to review all the material Wilson and Guscin have reviewed?\nWhat are your views on Guscin’s paper? His translations suggest a couple of accounts of the Image of Edessa refer to a full body image as well as a face image, as well as the image’s blurry undefined nature? Why is this not reasonable evidence that the image of Edessa may have been the Shroud?\n\n","date":"September 3, 2013 at 6:41 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42814","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"If those are not all byzantine experts, you can be sure that they are (or were) all Professional historians, which is a very good start, on the contrary to Guscin (who is not a professional historian at all, but a professional translator, which is very different) or Wilson (who is a professional book writer and journalist).\nAnd concerning Guscin references, I can only repeat what I wrote in my first comment of the day, which is that “in order to do a real serious, professional and honest historical research, someone must avoid to base any conclusion on wild speculations and discordant facts (like the fact that there are two or three manuscripts that associate the Mandylion with a full length body image, while there are tons of other manuscripts that clearly speak of only a facial image, which is confirmed very well by all the known depictions of the relic), while, at the same time, always try to never “forget” or put aside all the most pertinent data. \nThe few references found by Guscin NEVER associated the Mandylion with a burial shroud or with a cloth that was showing bloodstains or the boody stigmata of Christ, and they never state that there were 2 images on the cloth (one of the front, one of the back).  In fact, beside the reference to the presence of an image of the complete body, all these texts seem to place the miraculous image formation in the same “before the Passion” context than all the other manuscript describing the Abgar legend.  In fact, I don’t think any one of these few references are specifically saying that the miraculous imprint happened during the Passion or after, which would be the only logical times in which you can place the formation of the image we see on the Shroud…  That’s one major point to note, which makes me feel that these few discordant references (2 or 3 among surely more than 100 versions of the Abgar legend) are due to some erroneous mixing of the Mandylion story and the body image that was present on the real Shroud of Turin, which happened at a time when both relics (note that these were 2 different relics: many lists of relics from Constantinople confirm this historical fact) were kept in Constantinople (probably in the same Pharos chapel, most of the time).  In such a context of 2 relics of Christ that were showing his imprint and that were kept in the same location, it’s not very surprising to see a few ancient manuscripts telling the Abgar legend, while wrongly saying that the cloth given to the king was showing a full body imprint instead of just the face of Christ.\nThe bottom line is this :  We must judge such discordant pieces of evidence in the very same way than we do for the question of the authenticity of the Shroud.  On this subject, consider this: there are maybe 99 pieces of evidence that support the idea that the Shroud is authentic, while there is probably only one piece of evidence that can be considered as truly problematic (the C14 dating of 1988).  In such a context, any rational scientist would consider the discordant piece of evidence of the C14 dating as being probably erroneous.\nTHIS SHOULD ALSO BE THE SAME KIND OF REASONNING WE MUST DO IN THE CASE OF ALL THE HISTORICAL AND ARTISTICAL PIECES OF EVIDENCE THAT ARE RELATED TO WILSON’S HYPOTHESIS…  And if we act like this, no doubt that we will found out that 99% of the available evidences are in favor of the idea that the Mandylion was a relic showing only the face of the living Christ, while acknowledging the fact that there are absolutely no piece of evidence (whether historic or artistic) that describe the Mandylion as a burial cloth that was showing a full length body imprint of Jesus with his bloody stigmata on it.\n\n","date":"September 3, 2013 at 7:25 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42818","author":"Yannick Clément","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"By the way, I highly recommand anyone’s interested in the Mandylion hypothesis to read Cesar Barta’s paper that was recently published on Barrie Schwortz’s website (link: http://www.shroud.com/pdfs/bartaveng.pdf), which was originally presented at the Valencia conference last year.  You’ll find the section dedicated on Wilson’s hypothesis in pages 6 through 9.\nIn this section, Barta (who is not a professional historian but who is, in my mind, a very honest and intelligent researcher), after having analyzed some of the most pertinent facts (all contained in my own paper about the Mandylion hypothesis) came to the obvious conclusion that this hypothesis is most probably wrong and that the Shroud was probably a different cloth than the Mandylion. \nYou’ll see that, at the end of the section, Barta (probably to please the pro-Shroud clique) gave a personal hypothesis that could maybe (if you believe in miracle) explain the three most important objections he has found against Wilson’s hypothesis, thus giving some hope that his hypothesis could be true after all.  It’s very impressive to note the very high degree of speculation on which Barta’s personal hypothesis is resting!  The most incredible one (the word is correct!) is the ludicrous idea that Saint Louis, king of France, even though he took the precaution to send trusty men in Constantinople to make sure of the validity of each relic he wanted to buy, would have accepted to buy from the Latin emperor Baudouin II (a relative of the king) the reliquary in which the Mandylion would have been kept in Constantinople but without any relic inside!!!  Now, if this is not a highly speculative idea, which is not supported by any solid fact, then I don’t know what it is!  And in the case of the Mandylion hypothesis of Wilson, people must understand that it’s always like this, i.e. in order to have any chance to work, this hypothesis must always rely mostly on wild spéculations like that, which is why it is not accepted by the vast majority of the professional scholars.\n\n","date":"September 3, 2013 at 7:28 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42819","author":"Yannick Clément","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"I need to write again one sentence from my previous post:\nYou’ll see that, at the end of the section, Barta (probably to please the pro-Shroud clique) gave a personal hypothesis that could maybe (if you believe in miracle) explain the three most important objections he has found against Wilson’s hypothesis, thus giving some hope that THIS hypothesis (WILSON’S HYPOTHESIS) could be true after all.\nI just want people to understand clearly what I mean.\n\n","date":"September 3, 2013 at 7:33 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42820","author":"Yannick Clément","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Barta’s paper is good.\nAs he proposes, there are ways to work around the “problems” with the Mandylion theory.\nI still believe it compelling that a couple of accounts refer to / allude to a body image ,as well as a facial image. This does not necessarily contradict accounts that only refer to the facial image.\nYes, perhaps the jury is still out, and it is dificult to categorically conclude either way.\nQuestion re: the word “mandylion”. De Weeselow in his book suggests it has links with the word “mantle”, or a long sleeveless garment, which offers support for the Mandylion=Shroud hypothesis. Any thoughts on this?\n\n","date":"September 3, 2013 at 9:47 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42831","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Concerning the etymology of the word Mandylion, forget it Matthias.  The Greek word “Mandylion” come from the Arab word “Mandyl” that mean “Towel”. It was a term that probably came from how the Arabs were calling the image. We have to remember that the city of Edessa was at the hands of the Arabs at the time..  It’s true that the arab word Mandyl\ngave also birth to the latin word “mantile”, which normally meant “towel” also…  In French, this latin word “mantile” gave birth to the word “manteau”, which is a long coat, but we are far from the original meaning of the arab word “mandyl”, which meant “towel”.\nAnd concerning the hypothesis Barta has developed in a “desperate” try to “save” Wilson’s idea, I hope you can at the very least agree with me that it rest almost solely on extrapolations and speculations…\n\n","date":"September 3, 2013 at 10:04 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42833","author":"Yannick Clément","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"As always I keep an open mind. I want to know more about de Clari’s apparent reference to the Mandylion (sepaarte to the shroud). Through my university I have only been able to access de Clari’s account in French, which I can’t read.\nCan anyone help re: this text in English translation?\n\n","date":"September 4, 2013 at 5:41 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42859","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"The latin words ‘sindon’ alike the Byzantine Greek word ‘mandylion’, can refer to TWO different pieces of cloth:\nReminder: on July 3, 2012 at 12:02 pm | #33, I wrote:\n11/ writers (e.g., MARTIALIS Martial) used the Greek word sindon in Latin (sindon/is) as early as the 1st century CE in accounts of very fine linen, silk and sea Byssus veil. In 4th century CE Latin (e.g., Vulgata), the same word comes to also refer to the burial of Rabbi Yeshua of the synoptic gospels (Matthew, Mark and Luke). The (deliberate?) confusion between Mandylion (very fine Byssus veil) and Sindon (Yeshua’s burial cloth) would then find here its (philo)logical explanation.\nOn July 3, 2012 at 5:35 pm | #34:\n12/ In The Book of the Thousand Nights and a Night, the Edessa city palladium is referred to as the “Mandil (= head kerchief/face-veil/mantle/garment) [of Divine] Mercy [for the Salvation of Acting]; the “Mandil” [of Divine] Safety.\nOn July 3, 2012 at 5:58 pm | #36, I wrote:\n13/ Arabic منديل mandiil — tablecloth, handkerchief, mantle, from Late Latin mantellum ≠ early Latin mantile, mantele. Byzantine Greek mandylion, Old French mandil; see also Spanish and Portuguese mandil — all from Arabic mandiil/Syriac Mindiil, turban-cloth, haircloth, face-veil, towel, coase apron.\n\n","date":"September 4, 2013 at 6:29 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42865","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Matthias: I suggest you check out the William Meacham archive of papers: http://freepages.religions.rootsweb.ancestry.com/~wmeacham/\nYou need to retrieve papers marked wilson1 and wilson2.\nThey comprise Ian Wilson’s response to Professor Averil Cameron, and were presented at a conference in Hongkong in 1986.\nWilson also presented further arguments supporting his case at the Valencia Conference in 2012.\nAll in the interests of obtaining a balanced viewpoint of course! \nAs I’ve already mentioned above, I do not expect that the much acclaimed Byzantine historians will have anything better to offer in my lifetime.\n\n","date":"September 4, 2013 at 4:05 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42852","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"gee that is a pretty compelling rebuttal in my opinion Daveb. I still want to see de Clari’s supposed text on the mandylion as a separate object though. That seems a potentially valid objection to the mandylion=shroud theory.\n\n","date":"September 4, 2013 at 6:20 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42864","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"While the issue of authenticity is such a dead duck as far as the general public is concerned, with respect, the minutiae of this debate, is a side show. In referring to Ian Wilson’s theory, Dr. Williams was simply affirming that a case for one particular provenance can be made.  I am sure he does not do so at the exclusion of others.  They simply have not been made in any detail in his hearing and they are unlikely to be while the C14 shadow excludes illumination.  He finds the general arguments for the Shroud persuasive and the C14 less than perfect in its application. Therefore, a potential injustice may have been done.  That’s why he has come out on the subject the way he has. \nThe question of the Shroud does not hang on Edessa.  I personally find it persuasive but I am prepared to take into account the work of Max Frei. Having trekked round the Middle East and Anatolia with him on two trips totaling four weeks I got to know him well and give credence to his identification of Anatolian pollens. His methodology for removing such samples from the linen cloth was much too rough for STURP and that may explain why their own delicate application of the tape failed to pull out what would have been very deeply embedded.  \nDebates as this are likely to remain the equivalent of “Angel Dancing” until the Vatican allows a properly structured re-examination. That is what my own campaign of The Shroud Affair is hoping to bring about.  Despite the endorsement of the man who puts the case for the re-examination to the Vatican, Dr. Bruno Barberis in Turin, and now the former world-wide head of the Anglican Church, less than .05% of what one might call “shroudies” can be bothered to raise at least  a $10 finger of support. Thank you.\n\n","date":"September 4, 2013 at 5:37 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42858","author":"shroudenigma","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Quote: “The question of the Shroud does not hang on Edessa.”\nReply:  ABSOLUTELY!  But sadly, that’s not what most pro-Wilson people seem to believe!  There is absolutely no ancient manuscript that can prove the presence of a burial shroud of Christ in Edessa during Antiquity.  This simple historical FACT should be enough to at least be very careful when placing the Shroud in that city at one point in its history.  And for Frei’s work, it has been acknowledge by various researchers that it was impossible to determine the exact pollen genus because of the poor manner he collected his samples in Turin (with normal sticky tapes).  Because of this fact, any conclusion that would place the Shroud in one particular city like Edessa, Constantinople or Jerusalem (I’m not talking of a vast region, I’m talking about a city) based solely on the pollen “evidence” would have to be seen as highly doubtful.\n\n","date":"September 4, 2013 at 2:58 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42911","author":"Yannick Clément","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"New theory?\nI don’t if this has been proposed before, but here’s an idea…\nConstantinople is sacked in 1204AD, the Venetians form a significant contingent of the crusaders. Much looting occurs, with many Venetians gaining relics.\nFirst record of the ‘epitaphios’ is the ‘Venice’ from circa 1200AD.\nPut two and two together….the shroud was taken from Constantinople from the Venetians back to Venice, the epitaphios of circa 1200AD was modelled on the shroud some time after 1204AD\nThoughts?\nhttp://www.roman-empire.net/constant/1203-1204.html\n\n","date":"September 4, 2013 at 6:47 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42866","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"I’ve been away and am just getting caught up on the latest site news here. As much as it pains me to say it, The Shroud Affair is not likely to succeed. I’m a screenwriter who has likewise attempted to use crowd-funding to further a script and it’s a tough slog. Adding to the challenge is the fact that there are already dozens of Shroud-themed projects/scripts out there. I know because a major Hollywood producer told me this 12 years ago when I was pitching him one I’d found. The pitch behind the Shroud Affair feels, in my opinion, too soft — and no Hollywood producer is going to make a film with the goal of creating a scientific opportunity. It’s about making a profit, pure and simple.\nAs a Shroudie, I hate to rain on the parade here. But I’m only giving my opinion based on my own experience and knowledge of Hollywood — especially pitching.\nAll that being said, there is a very tantalizing high-concept premise in the Shroud pitch that I believe a Hollywood producer might be interested in: the one million dollars to whoever can replicate the Shroud! This reminds me of James Randi’s famous million-dollar offer to anyone who could reproduce a paranormal event (under scientific observation). He never had to pay out – though many tried.\nPitch the Shroud Challenge, a reality TV series. Get an insurance firm to cover the million (I don’t think anyone will get to claim it!). Then invite challengers to submit (online) their proposed method for replicating the Shroud. Select the best (and a few of the really goofball ones) and film their efforts for the series. TV channels like Discovery or FX would be obvious potential partners. It’s Mythbusters territory – edutainment.\nI happen to know a Hollywood reality TV producer, if it’s a direction anyone wants to explore I can connect the dots. Just trying to help.\n\n","date":"September 4, 2013 at 1:41 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42902","author":"David Goulet","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Reproduce it? I doubt we could even define suitable criteria that most people would agree on.\n\n","date":"September 4, 2013 at 3:07 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42916","author":"Dan","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Medieval technology only. Resulting product must replicate existing qualities of the Shroud (photo-negative, 3D information, etc). I expect Colin Berry will be first in-line.\n\n","date":"September 4, 2013 at 3:55 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42934","author":"David Goulet","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"David, your comments are accurate as far as a screenwriter is concerned. My hope is that as I am primarily a producer, once armed with some independent financial backing, I can navigate through to a successful conclusion. I did it with The Silent Witness all the way to a worldwide theatrical release.   It was made possible by some initial funding secured from the heir to the Millers beer empire and that was negotiated by the wonderful Salesian priest and Shroud scholar the late Fr. Peter Rinaldi of the Holy Shroud Guild of America.  Some of the films profits seeded STURP. \nApproximately 8% of those who view the campaign video become contributors. The average contribution is: $91. On that basis I need to get just under 2,500 more to watch the video to reach the initial target. (Assuming they come from a sympathetic audience segment.  Either active Christians or others interested in the Shroud for its own sake). \nI am about to move the debate into the Twittersphere. It’s not something I am fully up to speed with but theoretically it looks encouraging. My initial group of Shroud Affair followers (22)  have well over 100,000 potentially sympathetic  followers between them. If they retweet the message I send them only 2% need to respond. As I am recruiting followers daily these figures should improve.\nYou can tell that, as a producer, I am fundamentally an optimist.\n\n","date":"September 6, 2013 at 6:24 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43059","author":"shroudenigma","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Have you pitched the project to any Italian companies? They have been producing some very interesting religious films recently, with top notch casts. The films I saw about Francis of Assisi and Padre Pio were very well done. There is a domestic market there but they also have a pipeline to the international Catholic market. Just a thought.\nKnowing the mountain you are trying to climb, I appreciate your optimism and determination. I look forward to seeing you plant that flag at the top!\n\n","date":"September 6, 2013 at 9:27 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43067","author":"David Goulet","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"In his interview Fr. Pfeiffer (in pdf on Holy Shroud Guild) says that only the Byzantines in Constantinople and not the citizens of Edessa knew that the Shroud was a full-body cloth, and that was what prompted the Eastern Orthodox Church to modify the preaching.\nThere is an interesting link in the Orthodox forum http://www.orthodoxforum.com/topic.asp?TOPIC_ID=653 where a Greek Orthodox priest in Ohio makes some interesting remarks about the “Epitaphio” and the “Aer” (pronounced aa-eer), cloths used in the Church’s rituals. While these leads are not exactly new, they may help interested researchers obtain more information.\n\n","date":"September 4, 2013 at 2:59 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42912","author":"Louis","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"So far, the only real ancient references to the presence of a shroud of Christ in one particular city before the sack of Constantinople of 1204 have ONLY placed it in Jerusalem (last reference dating of the year 1000 A.D. or so) or in Constantinople (from the last quarter of the 11th century up until 1204).  Starting from those real references (which are nothing like the speculations and extrapolations done by many Shroud researchers), I am tempted to conclude that the Shroud of Turin went straight from Jerusalem to Constantinople some time during the 11th century without ever making a stage in Edessa…\n\n","date":"September 4, 2013 at 3:07 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42917","author":"Yannick Clément","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"You read at the end of my last comment : “without ever making a stay in Edessa.”  Thanks.\n\n","date":"September 4, 2013 at 3:09 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42918","author":"Yannick Clément","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"There are many cloths and references and no one knows what happened to the so-called Camulia veil. Shroudies can keep their fingers crossed while waiting to see what can be discovered in the excavations being conducted in Urfa (ancient Edessa).\n\n","date":"September 4, 2013 at 3:21 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42922","author":"Louis","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"All the main arguments for the authenticity of the Shroud that I can presently recall rely on a mass of uncorroborated circumstantial evidence.  Frei’s work is disputed, although Israeli botanists since have also made comparable claims. The arogonite limestone analysis by Nitowski et al remains unproven and has not been peer reviewed and there are gaps. The detailed forensic work by Barbet, Willis and others remains so far the best argument for authentictity, but even here, there is disagreement among the experts. Whatever process was involved resulting in an apparent negative with 3-D information is mysterious, yet may have been produced by some as yet unknown natural process. The appearance of Shroud-like faces in icongraphy dating from the 6th century is barely persuasive by itself.  Fanti’s work in dating the cloth through its physical properties is interesting, but is novel and yet to be accepted by the scientific community. The evidence of the blood-stains is also persuasive, but were they shed by the victim of a crucifixion, or were they added after the making of the image?  Despite the work of Rogers and others, no-one has yet discovered a means by which an image with the same properties might be formed in a convincing way.  There have been critics through the ages, from Bishop D’Arcis, Herbert Thurston, and more latterly the C-14 scientists. \nAlthough circumstantial, taken together, the weight of the evidence persuades many, including myself, that the Shroud is indeed the burial cloth of Christ.  But that does not make it a rigorous proof, and I believe it can be only accepted by an act of faith based on this circumstantial evidence. There remains the question of provenance which remains an important missing link. This was recognised by Maurus Green, and as it happens also by Ian Wilson.  Wilson attempted to fill that important gap, and more recent scholars have attempted to improve on it.  But still, the “experts” reject these claims as unprofessional and suspect. \nThe question of provenance is therefore important, and cannot be brushed aside as a “side-show”.  However until such time as the scientists can improve their game, by a more rigorous approach to their investigations, it is unlikely to be taken seriously by the majority of historians. But that of course does not mean to say that the Shroud is not indeed what it appears to be!\n\n","date":"September 4, 2013 at 4:43 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42941","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Quote: “Wilson attempted to fill that important gap, and more recent scholars have attempted to improve on it. But still, the “experts” reject these claims as unprofessional and suspect.”\nMy answer: In reality Dave, I think it’s much more true to say that all the scholars who have studied Wilson’s hypothesis without any pro-Shroud bias have all rejected his ideas mostly on the base that they mainly rely on SPECULATIONS, EXTRAPOLATIONS AND VERY PARTIAL INFORMATIONS, much more than rejecting his ideas on the base that his claims would be unprofessional and suspect.  Suspect yes, but not so much because of the unprofessionalism of Wilson and his supporters, but much more because of the corner on which his whole hypothesis is mainly resting, i.e. spéculations, extrapolations and very partial informations.\nI don’t think I can be more honest regarding Wilson’s hypothesis and the way it has been strongly rejected by most experts that came from the outside of the pro-Shroud world.\n\n","date":"September 4, 2013 at 5:01 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42946","author":"Yannick Clément","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"You are entitled to your opinion. It’s a pity you can’t grant the others the same courtesy, without long rambling diatribes. . As usual you only read what you want to read and miss my point entirely!\n\n","date":"September 4, 2013 at 5:45 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-42955","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"The links to my article on ‘The Shroud of Turin and the Image of Edessa -A Misguided Journey’ and ‘Tetradiplon-Mystery Solved?’ are back online although I would develop the first now with much more information about how the images do not match up. However, this is only a sideline to other work I am doing and I see no reason to keep in what is essentially a closed debate -in the sense that no one, other than Yannick, seems to want to listen to people who have been working in this very field for many years using and interpreting original sources, both icons and texts, and finding nothing whatever to support Wilson. So let’s  leave it at that. As someone who normally has my own work peer -reviewed (by university presses before publication) I know only too well how obscurantist some academics can be, but I see no reason to doubt the overwhelming consensus against Wilson in this instance.\n However, I will keep an eye open for other leads on the early history of linen cloths with images on them (as recorded in the arid linen-preserving climate at Memphis) and  early relic collections that have come directly to Constantinople and northern France from Jerusalem (even from’ the Lord’s Tomb’). These leads only come up incidentally when I am working on other things but if no one is prepared to ditch Wilson and follow them up, then, as I said before, this will become a dead subject.\n\n","date":"September 6, 2013 at 4:42 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43055","author":"Charles Freeman","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Charles I’ve read your paper ‘Tetradiplon-Mystery Solved?’. I think your conclusions are overly simplistic and hasty. For example you say:\n“The Image of Edessa is nowhere described as tetradiplon AFTER Christ has wiped his face on it, and it could not have been Jesus’ burial shroud as this is listed in the Acts as a separate cloth (see the second quotation from the Acts of Thaddeus, above).” \nIf one read the tale as a literal story then you may be right. However, I think it is highly likely that this is a fable. If we assume it is a fable, then it was probably created to explain the Mandylion / Shroud facial image. If that is the case, and if the Mandylion WAS the shroud but with the face only shown due to the folding, then Wilson’s theory does hold up because in the tale the shroud is viewed as the Mandylion ie. as a separate object to the burial shroud (even though the shroud is actually the burial shroud).     \nAlso, I don’t think the fact that the cloth is referred to separately as a tetradiplon then as a sindon (after Jesus’ face has been wiped) is necessarily that significant, or problematic. In life, we often describe one object in different ways within one body of text or conversation.  \nFurther, I think the variations in the tales over time, including at least one that refers to the full body image, merely hints at some secrecy, mystery and ambiguity behind it all.  \nThis is probably where symbolism, cryptology etc enters the fray, where meanings, histories etc get ambiguous and sometimes hidden / half hidden.\n\n","date":"September 7, 2013 at 3:12 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43146","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Matthias. Maybe you are not convinced. But I do think that if we are not accepting documents at face value we should say so. So Wilson should have said, perhaps. ‘ I know that tetradiplon is only used to describe the Shroud BEFORE it was unwrapped for Christ to wash his face with it but, as this is a fable, the writer clearly meant that he wrapped it up again in the same way afterwards. As for the mention of burial cloths later in the same text independently of the face cloth, well these are only symbolic burial cloths so let’s not bother about them. And to show how i think the Shroud might have been folded tetradiplon,let’s not bother with the possibility (following other Greek terms using tetra- as a prefix) that it might have meant doubled over to form four sections or, more probably, that it was doubled over four separate times.  I shall provide a picture of the Shroud folded double only three times and I hope you don’t notice because if you do you will realise that a cloth actually folded tetradiplon would go through the face.’\nI think that fits the way you believe the history of the Shroud should be recreated.\n\n","date":"September 9, 2013 at 1:47 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43494","author":"Charles Freeman","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Was in at uni today and found an interesting book by Bercovits ‘The Illuminated Manuscripts of Hungary”. Bercovits reckons the pray codex images are similar to some earlier Hungary manuscript images around 1100 AD which I thought was interesting.\n\n","date":"September 6, 2013 at 2:51 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43051","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Charles, I’m shocked! Please don’t think “no one, other than Yannick, seems to want to listen to people who have been working in this very field for many years using and interpreting original sources.” I’ve spent many happy hours this summer tracking down the earliest representations I can find of Byzantine iconography that seem to parallel the shroud. The Pray manuscript, and the Verdun Altar, and that wonderful little champlevé resurrection ring all seem relevant. I’m fascinated by the gradual introduction of the ‘suffering Christ’ and variations in the representation of the holy sepulchre, which must surely owe more to Constantine than to the Gospels. The hands crossed over the genitals, the nakedness, the shape of the shroud, all these images drift in and out of the iconography of the 10th-13th centuries in complex ways, and I very much enjoy reading the work of scholars which touches on this whole aspect. It’s not so much the chronological as the contextual associations of the shroud which specifically interest me, but all research in the approximate area is well worthwhile.\n\n","date":"September 6, 2013 at 8:45 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43065","author":"Hugh Farey","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Hugh, I share your enthusiasm for digging out these things although I am not as interested in relating them to the Shroud in the way you are. \nI suppose a sceptic would say how can we be sure that the Shroud images are not taken from the iconography of the day rather than the other way round but  I shall leave that to those working specifically in this field. \nThe Pray Codex is certainly not Byzantine and no one can persuade me that the stepped pyramid design on the coffin lid is a herringbone pattern – and I don’t see why anyone would want to copy the weave but not the images on the Shroud ( not shown on the Pray Codex). Count me as a sceptic on this specific issue.\nI was in touch with someone who has been looking at how images of the Ascent on the Cross were transferred and transformed when they were imported from Byzantium into the west. Not the same subject as the body, of course, but possibly of interest.\nI hope you can share your findings and convince me that the Edessa/ Shroud confusion has not killed the subject! Whatever conclusions one comes to as to the authenticity of the Shroud, I am convinced that they are two distinct iconographic traditions, each worthy of study in their own right but not to be confused with each other in the way Wilson does.\nI am sure you know of the 82nd Canon of the Quinisext Council of Constantinople of 692 that recognises the right to depict Christ in human form ‘so that we may perceive through [the image] the depth of the humiliation of God the Word and be led to the remembrance of His life in the flesh, the Passion and His death, and of the Redemption that this brought to the world’. Here is a clear reference to the image being not merely his face while alive but something more substantial, possibly his whole body, shown in death. I think it represents a different iconographic tradition from the Edessa Image. A pity that so much was destroyed by the iconoclasts so that we may never clarify this.\n\n","date":"September 6, 2013 at 11:23 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43078","author":"Charles Freeman","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"I agree that the zig-zag pattern on the lid of the Pray manuscript tomb, and the crosses all over the body of it, are nothing to do with the shroud. Did you see my discussion with Matthias about it? I think the illustration derives, second, third or fourth hand, from the marble surround of the holy sepulchre, and the apertures in it. The peculiar diagonal line of crosses might even be an attempt to depict a corner.\nMy arrival on the Byzantine scene was in connection was an attempt, supposing the shroud to be a 12th or 13th century creation, to find an artistic context for it. I was at one of Thomas de Wesselow’s lectures, and found his rejection of any such context compelling, but his alternative hypotheses unconvincing. Having now found several naked, crossed-wristed, long-fingered Jesuses from the period, I’m not so sure about the image as an image, although the method of representation is still a mystery.\n\n","date":"September 6, 2013 at 12:54 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43080","author":"Hugh Farey","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"RE: the zig zag pattern, I’ve raised a question in the past but don’t think I got a response.\nThe question is: surely the herringbone pattern is barely visible, if at all, to the naked eye, therefore it would hardly be something that an artist would portray?\nHaving said that, the Lirey badge seems to portray the pattern so maybe it IS visible to the naked eye? (maybe at close range?)\nAlso, the 4 holes in an L shaped pattern ARE still curious. Hugh, I find it a stretch to see them as apertures. De wesselow says that they don’t make any sense as artistic ornation, and I agree.\nAlso, how about the seldom discussed two red streaks? It’s only conjecture on my part, but surely one cannot discount the possiblity that they represent the blood on the shroud?\nBlood on a sarcophagus lid doesn’t really make sense.\nI think it is the collective evidence within that image which is compelling, rather than the evidence of each of the potential Shroud links in isolation.   \nCharles – De Wesselow provides a good explanation as to why an artist might not have depicted the shroud image on the cloth (if that is what it is)\n\n","date":"September 6, 2013 at 9:28 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43116","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"For what it’s worth I still think on balance the pray manuscript image was influenced by the shroud.\nHugh, you raise some questions re: the diagonal lines of crosses etc.\nHere’s my view, which includes some novel observations:\n– The object IS a representation (part symbolic / part literal) of the shroud\n– The pyramid patterns may or may not be an attempt to represent the herringbone weave: perhaps they are there just to represent a weaved cloth, rather than a specific style of weaving associated with the shroud\n– The 4 holes in a L shape DO reflect the pattern on the shroud, noting that these would have been a very prominent feature of the shroud at the time (prior to the burns from the 1500s or whenever). As de Wesselow states (and I offered this veiw before I ever read his book) the holes make no sense as an artistic pattern, being seemingly random and assymetrical\n– The diamond shaped area containing the diagonal lines of crosses represents symbolically the image on the shroud\n– The two red streaks adjacent to the diamond shaped area represent the blood on the body, possibly the two streaks of blood on the arms\n– The smallish cloth on top of the diamond area represents the Mandylion, and that is conveyed symbolically again by the Jesus face next to Mary’s arm, connected back to the cloth by the intermediary letter (Greek?)   \nThese arguments are then backed up by the top image which as we all know show Jesus in a very shroud like manner\n\n","date":"September 6, 2013 at 9:40 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43118","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Hugh- you probably know Gertrud Schiller on the iconography of Christian Art, Volume 2- it has the best selection of iconographic images of the passion , burial, etc.(including several of the crossed arms), that I know of. I am sure that you are the right lines to be looking at a much wider set of images than the Pray Codex – having seen similar resurrections scenes with open coffin lids  in other contexts it took me ages to realise that some people thought that the LID was the Shroud!\nI am sorry, Matthias and others, I am cautious by nature in this enormously difficult field of ‘Lamentation’ imagery and I simply have not got the right kind of glasses to single out the Pray Codex from among the other images of this burial scene and say that this is the Shroud. The two separate cloths shown in the lower register suggest that the inspiration is not the Shroud but the gospel of John.\n\n","date":"September 7, 2013 at 2:46 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43142","author":"Charles Freeman","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"‘The two separate cloths shown in the lower register suggest that the inspiration is not the Shroud but the gospel of John.’\nSo Charles you do think the object with the pyramid type pattern on is a cloth in addition to the small very obvious cloth lying over the crosses? (your reference to ‘two separate cloths’ suggests you do )\nWhat think you of my idea that the two objects are the shroud and the mandylion?\n\n","date":"September 7, 2013 at 3:24 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43147","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"P.S. The upper register of the Pray Codex echoes John 19: 38-42, (Joseph, spices,Nicodemus). I think one should start here, not with the Shroud. Also Mark 16/ Matthews 28( as well as John for the separate face cloth) for the lower register. This is what the illuminator is working from surely- adapting the gospel texts within the already existing iconography, ii/e the crossed arms already seen in the Champleve enamel of 1181 ( Schiller number 573)\nAs you will all know one of the objections to the Shroud’s authenticity made in the fourteenth century was that the gospels , esp. John, do not mention an image on the cloth. I shall only  be convinced that any artist has given the Shroud a greater status over the gospels when I see a pre- 1355 depiction of the burial scene with images on the cloth. Not before.\n\n","date":"September 7, 2013 at 3:00 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43144","author":"Charles Freeman","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Matthias. No- there is what is probably the face cloth lying on the coffin lid -as John says it was lying separately wrapped up. It is not clear whether the rest of the Shroud is being held by the angel. I have never said that the coffin lid is a cloth-it is a coffin lid as seen in other pictures of the period. There is a very good example by Duccio di Buoninsegna, of c. 1318, entitled The Three Marys. I think it is still in the cathedral museum in Siena but will come up under a search. I have seen other examples – there is one in the Museo Sartorio in Trieste for instance – but as showing the lid was quite common these are not always great works of art any more than the Pray Codex is.\nI stick to the simple rule. Until I see a Shroud with images of Christ’s body on it depicted in a painting from before 1355, then I would not consider it as a depiction of the Shroud whose distinguishing feature in every document referring to it is the images. The Pray Codex fails on this ground alone. You can’t have documents relating to the Shroud talking of images as a distinguishing feature and pictures relating to the Shroud NOT having images!\n\n","date":"September 7, 2013 at 10:54 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43179","author":"Charles Freeman","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Charles – I don’t understand. You refer to two separate cloths in the lower image. The small face cloth is obvious, if what you think is the coffin lid is not the shroud then what is the second separate cloth?\n\n","date":"September 7, 2013 at 9:42 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43222","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Charles,\nWhy the determination to be so literal, when so much historic text and imagery is only partly literal and often grounded in cryptic symbolism?\nDe Wesselow has convincingly explained why there is no literal image on the shroud on the lower image. I don;’t have the time to go through it. If you disagree with his explanation please explain why.\n\n","date":"September 7, 2013 at 10:36 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43230","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"I am just looking for any cloth that has any image on it. Don’t count me in until you have found one!\nI am with Hugh on the Pray Codex being part of a wider iconographic tradition and not a one-off that had to show a mystical view of the Shroud that no one can recognise without specially tinted glasses.\n\n","date":"September 8, 2013 at 3:38 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43246","author":"Charles Freeman","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"I suppose, Matthias, that on its own, the Pray illustrations could be interpreted in various ways, none of which could easily be contradicted. However, they are not on their own. They are part of a well represented illustrative tradition, and thus, like all the others of their genre, conform mostly to type. Where they differ, one may speculate as to why, but where they are similar, then I think the genre describes their features adequately.\nSo: let me draw your attention to three other pictures.\n1) The Psalter of Queen Ingeborg, and its page showing two illustrations, one of the anointing and one of the “Three Marys.” It dates from about 1195 and the chosen illustrations are exactly the scenes of the Pray page.\n2) The champlevé armlet currently in the Louvre, showing the resurrection. Date c.1175.\n3) The entombment and resurrection scenes on the altar of Klosterneuberg monastery by Nicholas of Verdun. Date 1181.\nThese three are particularly contemporary with the Pray pictures, but then Google variations on Byzantine, Romanesque, Entombment, Resurrection and Three Marys, and you begin to get a feel for what the Pray artist was trying to be part of. In particular, the box-like tomb, with holes or depressions in it, the absurd angle of the lid of the tomb, the perched angel, holding a very thin wand, the abandoned grave-cloths and so on. It then becomes impossible to suppose that the rectilinear features of the Pray pictures are anything other than the tomb, zig-zags, crosses, “poker holes” or whatever.\n\n","date":"September 7, 2013 at 2:26 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43189","author":"Hugh Farey","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Hugh\nOf course the pray codex images cannot be viewed in isolation from their historic artistic context.They are generally consistent with that context, but also depart from that context in subtle but very important ways.\nFor example, no images that I am aware of show what appears to be Jesus’s head adjoining Mary’s sleeve. No images that I am aware of show that letter located as an intermediary between Jesus’s face and what may be the Mandylion. No images that I am aware of show anything remotely like the L shaped pattern of 4 small holes, that make no sense as a decorative motive. No image that I am aware of shows red streaks on top of a coffin lid, which doesn’t make any sense.\nThere are several examples of entombment scenes around 1100-1300 where Christ is being laid out over a cloth with a pattern on it, sometimes with diagonal lines forming diamond-like shapes, sometimes comprising little black fleck-like lines and markings. And whilst these patterns are different from what can be seen on the Pay manuscript image, they reinforce the fact that there is within art history several examples of Jesus’s burial shroud shown with patterns. Call it artistic licence, call it an attempt to demonstrate weave, call it an attempt to distinguish the object from other objects. It could be any of the reasons and more.\n\n","date":"September 7, 2013 at 9:57 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43226","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Some of the entombment scenes from 11th century show crossed arms and missing thumbs. There has to be a source for this kind of depiction, which I think must be the Shroud. I doubt the Shroud was made as an icon to depict this scene.\n\n","date":"September 8, 2013 at 8:27 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43282","author":"ChrisB","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"final point – the very strong links between Hungary and Constantinople of the time also reinforce the theory. Hungary was not a distant European country with no formal ties to Constantinople!\n\n","date":"September 7, 2013 at 10:43 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43231","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"The zig zag/herringbone pattern on the Lirey medal indicates that this was a defining feature of the Shroud. Why, if it were only visible close up and relatively immaterial when compared with other features, might this be so? \nWhen the C14 test was proposed it was assumed the test was to be done blind and it was taken as a matter of course that a suitable piece of medieval linen herring bone weave would be found to make this possible and the British Museum, without hesitation, agreed to supply some. When the time came, somewhat to their embarrassment, the BM found that not only did they have no such material in their collection but when they scoured the world’s other museums for a piece for the purpose of the test – and we know how small an amount was required – they found that there was none available anywhere!  As a result one of the protocols of the test was duly and quietly abandoned without official comment at the time or since and this remarkable fact only slipped out many months after.  It is conspicuous by its absence in the interview with Michael Tite in the 6th video clip down on the page: http://tinyurl.com/o2w2z64 \nI think it might be safe to assume, therefore, that medieval viewers of the Shroud recognized this “unique” cloth was part of the story.  When combined with the L shaped hole pattern and other Shroud-like features on the Pray Manuscript I think it requires a particularly obstinate view to suggest that it does not point to a direct connection to the Shroud.\n\n","date":"September 9, 2013 at 5:05 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43424","author":"David Rolfe","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"There is a 3/1 herringbone linen weave in the Victorian and Albert Museum. It took me a lot of pinning down ( I had heard rumours of it but could could get no reply from the V and A) but the relevant museum numbers are 7027-1860 and 8615-1865 if anyone wants to follow that up. Not radiocarbon dated but suggestions from the print – superimposed on the cloth- of fourteenth century origin. Obviously the V and A were not going to cut off a piece of such a comparatively rare cloth but presumably anyone interested can ask to see it.\n\n","date":"September 9, 2013 at 8:44 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43461","author":"Charles Freeman","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"That may be. The fact remains that the British Museum put out a call world wide for one and answer came there none. At the very least, it is extremely rare and hence the significance.\n\n","date":"September 9, 2013 at 8:53 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43463","author":"shroudenigma","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Charles, I do not know if you remember that this lead was mentioned by me less than a year ago on this blog and was the result of some mention in an anti-authenticity blog a year or so before that. Attention was drawn to two top Shroudies but no interest was taken after some e-mail exchange. V&A did reply to my query but remained silent when details were provided. The doubt is whether it helps in Shroud research because the lead is not new and one can be sure that many in the anti-authenticty camp would pounce on it if there was something to be proclaimed.\n\n","date":"September 9, 2013 at 10:01 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43467","author":"Louis","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Louis- it may or may not add to research- although am I the first in these recent debates to actually have the right museum number?\n I can understand why no museum wanted to cut off a piece of medieval linen in a cause that most probably thought was a meaningless sideshow. I do think the V and A should have asked Tite to go round and have a look though!! It was not far for him to go.\n\n","date":"September 9, 2013 at 11:22 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43479","author":"Charles Freeman","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"“I think it requires a particularly obstinate view to suggest that it does not point to a direct connection to the Shroud.”\nAgreed!\n\n","date":"September 9, 2013 at 6:05 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43437","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"I should add, it’s fair enough to disagree with the Pray manuscript – Shroud connection, what is not fair enough is when skeptics dismiss the compelling arguments FOR the connection without any substance.\nAs I have alluded to before, I’m open to being proven wrong on the link, the problem is the skeptics of the link have failed to argue convincingly against each of the compelling lines of the argument. Remember the case for the link is based on multiple lines of evidence.\nCharlies Freeman, for example, provides very glib dismissals of the potential connection, without any effort to engage in a logical rebuttal to the case. Typcially this is along the lines of “the experts say…” Well, I know from working as a professional urban planning consultant for many years that the ‘experts’ very often disagree!!!\nI invite Charles or any other skeptic to refute my points made at 9.40pm on 6 September.\nUntil then, I stand by what I consider to be a very compelling case for the connection.\n\n","date":"September 9, 2013 at 6:18 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43438","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Matthias- whenever challenged you use words like ‘fable’, ‘symbolic’ etc because, as is obvious to anyone who looks at the Pray Codex it does not show a long cloth with images on it.\nThe Shroud comes into my general work on relic cults, etc as periphery. Among the vastly more interesting cults of medieval times, it hardly makes an appearance – simply a cult that sprang up in one small church, was condemned by a bishop, a so-called relic that was hawked around a bit and passed on to the Savoy family who DID make it into a post -medieval cult in the seventeenth century. Then it does come back into my attention as it was a major part of court rituals and I was lecturing on Baroque Turin earlier this year so I had to know about it in this context.\n So when I look at the Pray Codex, I note\n– a shroud which comes only up to the shoulders of Christ, as with most depictions of the period\n– crossed arms similar to the iconography of earlier depictions of Christ\n– no signs of blood on the actual body, a halo instead of a Crown of Thorns ,again typical of this period.\n– a coffin lid (compare Duccio) with a stepped pyramid design, not herringbone.\n– a separate cloth, possibly the face cloth mentioned in John, lying on the lid. No signs here again of any image on the cloth.\n– holes on the coffin lid which go up three , then one to the LEFT. The Shroud marks on the top layer go up three ,then one to the RIGHT.( I suppose this is part of your not being literal but it reminds me of the people who said that the pyramids represented a star pattern,until someone noted that that they had turned the stars  completely the wrong way round ( and that other than the three major pyramids none of the other pyramids fitted).\nRed stains -mean nothing unless they are on the Shroud.\nSo I see no reason whatever to see the Shroud here,however much you try and argue that the artist has distorted the actual Shroud in some symbolic way. I know of many accurate representations of relics in paintings- look at Carpaccio’s depictions in Venice of the reliquary of the True Cross, but I don’t know any where they are restricting an understanding of a relic to a few by not showing it literally.\nMy frustrations, repeated all too often, is that people go on following or even creating leads for which there is no evidence (and as a result will not win over anyone,especially in the world of academia) when there are so many other leads that no one seems prepared to follow up.\n\n","date":"September 9, 2013 at 11:13 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43477","author":"Charles Freeman","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Charles I respond to some of your points:\n“So when I look at the Pray Codex, I note\n– a shroud which comes only up to the shoulders of Christ, as with most depictions of the period”\nTwo of the persons in the upper scene appear to be holding a part of the shroud which would enshroud his whole body. Clearly below Jesus’s head the shroud extends up under the halo to the bearded bloke on the left.    \n“- crossed arms similar to the iconography of earlier depictions of Christ”\nYes but neither here nor there to the central question. \n“- no signs of blood on the actual body, a halo instead of a Crown of Thorns ,again typical of this period.”\nYes, but neither here nor there. There was simply an aversion in this historical period to depicting a heavily wounded Christ.\n“- a coffin lid (compare Duccio) with a stepped pyramid design, not herringbone.”\nI don’t necessarily buy the argument that the design depicts herringbone. But I think there is a reasonable chance it depicts cloth. Refer to sevreal other examples where the burial cloth or  mandylion is shown with various patterns REPRESENTING (rather than literally depicting it) linen.\nI’m yet to see any artistic image of a coffin lid that looks anything like this. But please do point me in that direction if you know of any. \n“- a separate cloth, possibly the face cloth mentioned in John, lying on the lid. No signs here again of any image on the cloth.”\nRefer my previous points that this could be the Mandylion, so no image is no problemo!\n“- holes on the coffin lid which go up three , then one to the LEFT. The Shroud marks on the top layer go up three ,then one to the RIGHT.( I suppose this is part of your not being literal but it reminds me of the people who said that the pyramids represented a star pattern,until someone noted that that they had turned the stars completely the wrong way round ( and that other than the three major pyramids none of the other pyramids fitted).”\nYes you hit the nail on the head. Being over literal is beside the point. \n“Red stains -mean nothing unless they are on the Shroud.”\nWell if what you and Hugh think is a coffin lid is actually the shroud – as I maintain – then it means a lot!\nAgain, what on earth would the lines symbolise if the object was a coffin lid????\nI guess I will just have to agree to disagree with Hugh and yourself!!!!!\n\n","date":"September 10, 2013 at 5:20 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43587","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"I think that’s fair enough. I have no good reason for the 5 dots around the crosses on the sepulchre, or for the 4 dots on the lid, nor for the wiggly red lines bordering the cloth. I don’t think they are representative of the shroud, but admit that’s probably no more than a gut feeling.\nHowever, in agreeing with your statement further above; that “There are several examples of entombment scenes around 1100-1300 where Christ is being laid out over a cloth with a pattern on it, sometimes with diagonal lines forming diamond-like shapes, sometimes comprising little black fleck-like lines and markings,” I have to point out that the Pray manuscript illustrates exactly that scene, but without any pattern at all on the cloth, flecks, diamonds or what have you. To me, it stretches credibility to suggest that the rectangular stone blocks below are an attempt to be more representative of the shroud than the obvious cloth with Jesus lying on it above. I don’t mind if you don’t agree, but you must surely see my point, no?\n\n","date":"September 9, 2013 at 8:15 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43459","author":"Hugh Farey","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"yep I see your point. But the fact that the lower object has a pattern and the shroud in the upper image does not have a pattern doesn’t mean much, if anything, to the central question here.\nDe Wesselow describes the difficulty for an artist – particularly one who is not highly skilled and working on a small medium such as the Pray Manuscript artist – in representing the blurry shroud image. The artist has shown the body, which mirrors the image, after all in the upper anointing scene. And given the faint, ephemeral-like image of the Shroud, is there not some logic in conveying it in a hazily symbolic artistic manner?    \nThen, conveying the shroud in the lower image with patterns, shapes, lines, ephemeral objects etc makes total sense.\nTo take this further – the upper image is a highly literal image, the lower image is filled with symbolism and mystique. Was the different treatment intentional, to highlight the worldly experience of Christ’s anointing versus the otherworldly experience of the empty tomb with the angel etc????  \nThe two images are entirely different in a stylistic sense, so it makes little sense to compare one with the other. They might have even been drawn by different artists!   \nI hear people consistently dismiss any significance to the two wiggly red lines. Now, if one accepts that it is highly unlikely that the artist would have just randomly drawn these (they make no sense from a decorative perspective), then I would argue that there is no logical explanation other than blood, in which case blood on a coffin lid doesn’t make sense, blood on a shroud does.    \nSimilarly, casual dismissal of the circles / dots is also all too easy.\n\n","date":"September 10, 2013 at 4:58 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43580","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Charles, re. #82. Your point is something everyone interested in Shroud research would agree with, so now the question who is willing to follow the lead and go to V&A and take a photograph?\n\n","date":"September 9, 2013 at 3:25 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43500","author":"Louis","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Louis – would you like to ask them what they charge?! It won’t be cheap and as said earlier it might not add anything anyway. Does anyone have a research grant to research the Shroud?\n\n","date":"September 10, 2013 at 3:20 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43562","author":"Charles Freeman","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"is the blood-like spot above the right eye in the Pray Manuscript and similar marks in the hair – reminiscent of the Shroud – just another strange coincidence?\n \n\n","date":"September 10, 2013 at 6:56 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43594","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Charles, you have raised a nice question, but I hesitate to take the matter further because V&A did not seem interested.\n\n","date":"September 10, 2013 at 9:16 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43606","author":"Louis","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"I feel the credibility gap increasing here.\nThere are a number of roughly contemporary depictions of the shroud showing large quantities of extra cloth held in the hands of an attendant at the head of the dead Christ. In every single such case that I have seen, similarly large quantities of extra cloth are also held in the hands of another attendant at his feet. As it happens, I don’t think the Pray codex shows this, but if it, as Matthias says “extends up under the halo to the bearded bloke on the left,” then he must agree that it also extends up under the halo of the bearded bloke on the right. In other words, these illustrations place the dead body right in the middle of the shroud.\nNext, I think the attempt to explain away the absence of pattern on the top shroud, and the concomitant attempt to identify the zig-zag pattern on the sharply cornered rectilinear coffin lid as the weave is becoming more and more desperate. “The two images are entirely different in a stylistic sense, so it makes little sense to compare one with the other,” says Matthias. This is patently untrue. Both images are entirely consistent with dozens of contemporary illustrations of the scenes they depict, and appear, together, in almost exactly the same format, in one of the illustrations I quoted above. Cloth, in both illustrations, looks like cloth, and rigid stuff, in both illustrations, looks like rigid stuff.\nThe two illustrations “might have even been drawn by different artists!” No. Absolutely no.\n“Is the blood-like spot above the right eye in the Pray Manuscript and similar marks in the hair – reminiscent of the Shroud – just another strange coincidence?” Yes. And not that strange. And it’s not a blood-like spot. If the wiggly lines bordering the cloth underneath are blood, then the spot above the eye should be red. What is strange is that the bushy moustache and prominent bifurcate beard are conspicuously absent.\nAnd, no thumb. It has been noticed before that the anointing father also has no thumb, but I ask you to look closely at the angel below. The pointing hand also has no thumb, but it does have five other fingers! And the hand holding the staff only has three fingers. Then there’s the man above with the curly hair, scratching his cheek. How many fingers has he got?\nHowever, I grant you, as I did before, the wiggly red lines, the ‘X’s on the wrinkled cloth, and the two groups of holes. They beat me completely.\n\n","date":"September 10, 2013 at 1:37 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43632","author":"Hugh Farey","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"“The two images are entirely different in a stylistic sense, so it makes little sense to compare one with the other,” says Matthias. This is patently untrue. Both images are entirely consistent with dozens of contemporary illustrations of the scenes they depict, and appear, together, in almost exactly the same format, in one of the illustrations I quoted above. Cloth, in both illustrations, looks like cloth, and rigid stuff, in both illustrations, looks like rigid stuff.\nIt was perhaps an exaggeration on my part to call the images “entirely different”. “Different” would have been better. The figures are in a similar illustrative artistic style. But my main point is still highly relevant and “True” (rather than patently untrue),  I believe. That is, the upper image is essentially literal, the lower image is largely symbolic, mystical and cryptic – so the images are different in “nature and meaning” if not “artistic style”  (it’s as if the artist ate some magic mushrooms between drawing the two images). I don’t know why this is, but can only speculate it might have something to do with trying to represent the mystical, mysterious experience of the resurrection, versus the worldly nature of Jesus’s burial preparation.\nYou argue that there is a great degree of continuity with artistic tradition. There certainly is some continuity! But there is also clearly evident discontinuity! This includes:\n– Jesus shown naked. Yes I know there are couple of examples elsewhere of Him naked but this is still very much an overwhelming minority of the artistic tradition (probably less than 1%)\n– Jesus with a small beard (more like scruff). Now this is very very odd, given the overwhelming tradition of the time of a reasonably fully bearded Jesus. Why? Again speculation, but in the  very faint image (not contrast enhanced) on the shroud it is difficult to view the facial hair as being much more than a relatively small ‘goatee’. I keep an open mind but struggle to come up with any alternative explanations given the tradition discontinuity\n– And the greatest discontinuity occurs in the lower image, where there seems to be no comparable tradition in terms of the style of decorative depiction of the rectangular objects, no comparison in terms of red blood-like streaks and L shaped hole configurations, no comparison in terms of a face (Jesus’s?) adjacent to Mary’s sleeve, with an intermediary letter / symbol ‘floating’ between Mary and the rectangular object !!!\nChrisB (comment 94) may have a point that the object is the Shroud lying across the coffin lid.  \nThe likelihood is we will never be able to fully understand these things, and it will always come down to interpretation and points of view. I agree that many of the points I and others make can be considered speculative, although I think there is some strength to the view that the number of possible congruences, even if cryptic, between these images and the Shroud are perhaps too many to claim ‘coincidence’.\n\n","date":"September 10, 2013 at 10:22 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43676","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Interesting paper by a Holger A Klein “Sacred Relics and Imperial Ceremonies at the Great Palace of Constantinople”\nhttp://www.columbia.edu/cu/arthistory/faculty/Klein/Sacred-Relics-and-Imperial-Ceremonies.pdf\nInteresting reference to an “acheiropoietos icon” of Christ, which, according to George Kedrenos, arrived in the capital (Constantinople) “from those of Kamouliana, a village in Cappadocia” in the reign of Justin II (565-578AD). \nI’d never heard of this before. Others?\n\n","date":"September 11, 2013 at 7:33 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43754","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"I am inclined to believe that the rectangular shape beside the tomb is the lid. It bears too much resemblance to other works with a similar scene, e.g the Champleve Armlet in the Louvre. The lid in this scene is the same shape as the one in the Pray Codex, and Christ is shown stepping out of the tomb holding what appears to be his shroud. However, there are other works which show Christ lying on his Shroud on top of the tomb lid pre-entombment, so perhaps the Shroud is somehow affixed to the tomb lid in the Pray Codex?\n\n","date":"September 10, 2013 at 1:42 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43633","author":"ChrisB","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Just to emphasise Klein’s credibility:\nColumbia University\nEarly Christian, Byzantine, and Western Medieval Art and Archaeology\n Ph.D., Rheinische Friedrich-Wilhelms-Universität, 2000\n M.A., Courtauld Institute of Art, 1994\n\n","date":"September 11, 2013 at 7:35 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43755","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"George of Pisidias, a Byzantine poet, wrote a poem “Bellum Avaricum” in 626 which refers to the icon being displayed and protecting Constantinople from siege. Unfortunately, the poem does not inform whether the image is of the face or the whole body.\n\n","date":"September 11, 2013 at 8:15 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43758","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"There was also an icon of the Virgin Mary that was used successfully to ward off the attack of 626.\nHugh and Mathias, and anyone else interested. \nFinally I have found out about the holes in the coffin lid- when looking for something completely different about medieval sculpture!\nIt is from William Forsyth: The Entombment of Christ: French Sculptures of the Fifteenth and Sixteenth Centuries, Harvard UP 1970, page 9.\n‘The three circular holes which occur on the front face of a number of representations of Christ’s sarcophagus in western art of the twelfth and thirteenth centuries are apparently copies of the three oculi in the tomb of the Holy Sepulchre in Jerusalem through which pilgrims could view the sacred rock or stone tomb in which Christ’s body lay.’\nHe quotes Daniel. a Russian pilgrim, from 1106- 07. “And now this holy bench is covered with marble plaques and one has cut in the side three little round windows and by these windows one sees the holy stones.”\nIn a footnote Forsyth gives a list of those representations he knows of including four 12th century examples – all, I think in stone carvings (none illustrated).\nThese are clearly the circular holes on the Pray Codex coffin lid so no need to read in the Shroud holes here. The Pray Codex really does not have anything going for it- please let’s move on!!!\n\n","date":"September 11, 2013 at 3:46 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43821","author":"Charles Freeman","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"The L shaped holes are windows in the side of the coffin? Not implausible but it’s a stretch.\n\n","date":"September 11, 2013 at 4:08 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43824","author":"David Goulet","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Pushing your luck, I think, Charles. Earlier on in this blog I mentioned these holes, inserted by Constantine VI after the sepulchre was covered in marble. My hypothesis was that the zig-zags on the lid represented opalesque swirls in the marble, and the red crosses were a variant on the holes in the sepulchre. Although we are told there were three round ones, they are often transmuted into more holes and different shapes in medieval illustrations. Some of them are quatrefoil shaped, which I thought could have been the inspiration for the red crosses on the Pray manuscript. It’s a very long shot, but I think a better hypothesis than the L-shaped holes being the apertures.\n\n","date":"September 11, 2013 at 6:18 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43834","author":"Hugh Farey","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Obviously we need to look at the other examples Forsyth gives- it is a pity that he does not illustrate them. It is the circular that clinches it for me but as I have never seen anything resembling the Shroud and its images in the Pray Codex anyway this is just putting a dot on the i. \nWhoever dreamt up the Pray Codex/Shroud connection anyway?  \nQuite happy to be fundamentalist and arrogant on this one, Matthias.  The onus is on those who can see the Shroud of Turin in the Pray Codex to prove their point, not the other way around.\n\n","date":"September 12, 2013 at 3:27 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43894","author":"Charles Freeman","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Charles, \nwith due respect, \niconologically speaking, it does seem you just cannot discriminate between the holy sepulchre portholes and small holes in a twill linen and are also not very familiar with medieval Benedictine monk art to say the least.\nBesides at magnifying level, the Turin Shroud herringbone pattern DOES/CAN look like a stepped pyramid design. \nMeguess Fundamentalism and Arrogance are father and mother of Ignorance.\n\n","date":"September 12, 2013 at 6:52 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43913","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Typo: twilled linen fabric\n\n","date":"September 12, 2013 at 7:01 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43915","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"“I have never seen anything resembling the Shroud and its images in the Pray Codex..”.  What about the naked Christ with crossed arms and thumbs missing? Was the Shroud just another piece of artwork depicting these features, or was it the source of them?\n\n","date":"September 12, 2013 at 9:12 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43919","author":"ChrisB","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Do the maths!\nThere are four very small holes in the pray codex image, not 3 larger apertures!\nFrankly, Charles, your easy dismissal of the pray codex / shroud link is really quite fundamentalist and dare I say it arrogant\n\n","date":"September 11, 2013 at 11:15 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43853","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"I have explored all of these scenarios and more with an open mind and dismissed them. I even considered that the 4 holes might be like the 3 holes on a tenpin bowling ball, that might represent a means of lifting the lid. But that doens’t make sense in light of the circles on the lower object, nor the fact that such “lifting holes” don’t seem to exist\n\n","date":"September 11, 2013 at 11:18 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43854","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"What about this then? The Holy Sepulchre in Jerusalem, from which all these medieval sarcophagi appear to have been derived, was lined with marble slabs. As was most of the masonrywork round about. These slabs were attached to the stone with dowels, and such meagre remains of the 11th century buildings as remain have numerous dowel-holes. If, as  I supposed earlier, the diagonal line of crosses was a primitive attempt to depict a corner of the sepulchre, then the little holes on either side might just possibly represent the pegs holding the marble slabs in place on the stone. Googling “marble” and “dowel” in connection with the holy sepulchre of Jerusalem brings up a variety of more or less interesting archaeological information.\n\n","date":"September 12, 2013 at 10:03 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43926","author":"Hugh Farey","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Hugh, and what about the Turin Sroud 3/1 twilled linen fabric herringbone pattern zooming into a stepped pyramid pattern when observed under a magnifying glass?\n\n","date":"September 12, 2013 at 10:32 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43931","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Besides have vou ever seen a marble slab/sarcophagus with regular stepped pyramid-shaped like veins all the way? Show me a photograph if you ever have, please. Methinks you’re not very familiar with stonecutting and marble.\n\n","date":"September 12, 2013 at 10:41 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43932","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Hugh, you wrote: \n“If, as I supposed earlier, the diagonal line of crosses was a primitive attempt to depict a corner of the sepulchre,”. \nOn this very blog, I emitted the hypothesis more than one year ago. On June 11, 2012, #159-160-157, I wrote:\n“In the Pray Ms Miniature of the Emty Tomb scene, at one and the same time, the image of the unction stone marble facing/sarcophagus, the burial bench marble slab and the Turin Shroud merged into one heavily laden cryptosymbolic image.”\n“The image is all the more cryptologically laden as the field of red crosses (inspired from Byzantine church liturgical garment known as polystaurion ‘many-crossed’) is here evocative of the hundreds of cross graffiti carved by pilgrim crusaders in the Entrance wall to the Holy Sepulchre Church in Jerusalem.”\n“Visual double/triple entendre may lead to “cryptic evocation” For example, in medieval times, a protective marble sarcophagus (with portholes) used to protect the unction stone. In the Entombment of Jesus, by Nicholas of Verdun (1130–1205) in Klosterneuburg Abbey, this is precisely this sarcophagus type that cryptically features Yeshua’s burial bench.”\nBesides as early as June 7, 2012 at 4:04 pm, #93 and June 12, 2012 ,  #181, I wrote:\n“The same characteristic square-topped stepped pyramid weave pattern is observable both on the Pray Ms lower register miniature and at macrolevel in the Turin Shroud (TS HD macrophotographs or macrographic pen & ink drawing by Tessiore). In addition to ten other tell-tale details, this spy-clue etablishes a compelling link with the TS and confirms the Pray Ms miniaturist did represent the relic as early as the 12th century CE…”\n“To get aware of the square-topped stepped pyramid weave pattern (as shown in the Pray Ms lower register miniature, fol 28; PLEASE see Pr. Giorgio TESSIORE’s 1996 macrographic pen and ink drawing ((front and back covers of his monography entilted “La Santa Sindone E Il Suo Mistero”, Torino, 1997) along with a good quality macrophograph at a regular 24:1 scale.of the Turin Shroud front side portion.”  \nOn June 10, 2012, #119, I also wrote:\n “In the Pray Ms miniature lower panel, the Résurrection angel (Saint Michael) stands with his right hand index pointing at the empty sarcophagus with his left foot resting on its displaced lid still covered with Christ’s shroud lying flat, hence the presence of a wrinkle line in addition to the shroud square-topped stepped pyramid weave pattern). In most medieval Empty Tomb scenes, the sarcophagus is featured in connection with the shroud. That is an iconographic FACT. The scene is here “cryptically evocative” of both the angel’s words (“He is not here”) and Christ’s victory over Death/Resurrection or anasthasia (“He is risen from the dead”). A tell-tale couple of bloodstains is featured on the Shroud: that of the side wound associated with two long blood rivulets respectively observable on the Turin Shroud front and back sides)”.\nON June 11, 2012 at 5:03 am | #139, I also wrote:\n“The face HIDDEN in (Holy Virgin) Mary’s right sleeve is Joseph’s (“The Carpenter”) (see Dormition of Mary, mosaic 12th century C.E., Sicily). It allows us to identify the very first Mary as “Mary of Joseph”. However, the visual double entendre here is a cryptic wink to the attentive observer meaning there is more in the miniature than meets the eye. That’s precisely where“ “CRYPTOperception” consistent with Benedectine cryptically evocative artwork comes in.”\n\n","date":"September 12, 2013 at 12:29 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43943","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"‘Was the Shroud just another piece of artwork depicting these features, or was it the source of them?’\nVery good question. Needs to be explored fully from both sides.\n\n","date":"September 12, 2013 at 10:06 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43927","author":"Charles Freeman","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Thank you, Max. Although your interpretation says nothing at all about the diagonal line of crosses illustrating a corner of the tomb. And, since you ask, marbling takes on all sorts of patterning, including interfering concentric circles that could be represented quite well by those zig-zags. There is an important quarry of exactly the stone I mean very close to Constantinople. Try http://www.nugastone.com.\n\n","date":"September 12, 2013 at 1:14 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-43952","author":"Hugh Farey","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Hugh, \nFirstly, diagonal lines of crosses can also  be seen amid panels of the cross graffiti cut in the walls on both sides of the stairs leading down to the church of St. Helen (Holy Sepulchre Entrance). You can also see a couple of bloody cross-like shaped scourge marks across the TS man’s back. When folded in a specific way across the body, the Byzantine church liturgical garment known as polystaurion ‘many-crossed’ can also show a diagonal line of crosses.\nSecondly, the quarry you are referring to is an onyx not a marble quarry. Still, I am STILL waiting for you to show me a marble or even an onyx slab that shows veins with a FLAT SQUARE-TOP STEPPED PYRAMID pattern. This is just in your dream. Besides, I was a stone cutter and sculptor myself for three years, one of my great grand father was a builder (stone cutting included) and one of my brest friend, Halit Berdiboz, is a Turkish sculptor and his father had an onyx quarry in Turkey.\n\n","date":"September 13, 2013 at 12:49 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44084","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"No professional stone cutter and/or sculptor worth his salt will endorse this idea of yours. OK marbling can take almost all sorts of patterning. Still, to the initiated eye, what you are showing me is a far cry from FLAT SQUARE-TOP STEPPED PYRAMID patterned slabs as shown in the Pray Codex lower register..\n\n","date":"September 13, 2013 at 1:08 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44087","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"HUugh, PLEASE SEE Pr. Giorgio TESSIORE’s 1996 macrographic pen and ink drawing of the Turin Shroud front side portion along with a good quality macrophograph at a regular 24:1 scale before indulging into a wild flight of imagination…\n\n","date":"September 13, 2013 at 1:14 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44088","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Firstly, I’m extremely interested that the “diagonal lines of crosses can also be seen amid panels of the cross graffiti cut in the walls on both sides of the stairs leading down to the church of St. Helen (Holy Sepulchre Entrance).” Can you link me to a picture that shows them? or reference a book with an illustration?\nSecondly, I’m not suggesting that the the patterning on the lid of the Pray shroud is photographically accurate – just that to me it is very suggestive of those irregular concentric loops that we see on the onyx slabs. I think a professional stone-cutter would recognise it immediately; do you have Mr Berdiboz’s email address?\nAnd finally, why should I see Giorgio Tessiore’s drawing? Is it because it shows the herring-bone pattern as stepped pyramids? Sorry to keep repeating myself, but have you got a reference? I should like to see it for myself.\n\n","date":"September 13, 2013 at 2:11 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44097","author":"Hugh Farey","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Hugh, \nIF much alike Charles Freeman, you JUST cannot discriminate between marble facing portholes (see the Entombment of Jesus, by Nicholas of Verdun in Klosterneuburg Abbey) and two series of small holes in a fabric (see Pray codex lower register miniature, fol 28), MOST LIKELY there is NO HOPE you can see the same flat square-top stepped pyramid pattern in the Pray codex (in the lower register miniature too) as an iconic reduction of the Turin Shroud inner side weave pattern seen at macrolevel (the side that bears the image). \nBTW re detection and recognition  of familiar and unfamiliar patterns or images, how long did it took you to see the cat in the two photographs I posted in this very blog?\nYou wrote: “And finally, why should I see Giorgio Tessiore’s drawing? Is it because it shows the herring-bone pattern as stepped pyramids? Sorry to keep repeating myself, but have you got a reference? I should like to see it for myself.”\nOn  September 12, 2013 at 12:29 pm | #111, I ALREADY gave you the reference (actually twice on this very blog!):\n “Pr. Giorgio TESSIORE’s 1996 macrographic pen and ink drawing (front and back covers of his monography entilted “La Santa Sindone E Il Suo Mistero”, Torino, 1997.” Cannot you read me? Just ask an Italian friend of yours to buy his monography and send it to you\nWhen seen IN ICONIC REDUCTION, Tessiore’s ink drawing DOES show the same FLAT square-top STEPPED pyramid weave anyone can see in the Pray codex design. The specific patterning on the lid of the Pray shroud is ICONOgraphically accurate as far as TS inner side weave pattern seen at macrolevel is concerned (side bearing the image)\nYou also wrote: “I think a professional stone-cutter would recognise it immediately”. WRONG\nAs both a former professional stone -cutter for three years, Turin Shroud scholar and researcher and a professional  image  cryptanalist  familiar with medieval imagery especially Benedictine monk cryptic artworks, I immediately recognized not so much marble onyx irregular concentric loops as the TS inner side weave pattern seen at macrolevel and in iconic reduction \nSorrry, Halit, the Turkish sculptor, has no computer and no email \nAnyway, I repeat, the TS weave pattern that bears the image when ink drawn at macrolevel and in iconic reduction  is  far more evocative of the Pray codex FLAT square top stepped pyramid design than any -ink drawn- predominantly white marble onyx irregular concentric looped patterned slab one could ever found on earth This is an iconographic fact whether you like it or not, you believe it or not,\nHow long will you keep me repeating about Pr Tessiore’s most accurate ink drawing of the Turin Shroud weave pattern that bears the image? If you still cannot find Tessiore’s monography (it is not that easy to find), I can email Dan a series of illutrations that CLEARLY PROVE my point.\n\n","date":"September 15, 2013 at 11:21 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44302","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Correction no email address that I know of\n\n","date":"September 15, 2013 at 12:30 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44313","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Addendum TESSIORE Giorgio – La Santa Sindone e il suo mistero – Arti Grafiche San Rocco\n\n","date":"September 15, 2013 at 12:46 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44315","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Grugliasco (TO) 1997\n\n","date":"September 15, 2013 at 12:55 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44318","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"No, sorry, Max, I still can’t agree. I’ve been looking at the zig-zags, and they are in the form of at least six (visible) concentric semi-circles. They look nothing at all like Giorgio Tessiore’s drawing (thank you for the reference), in which all the stepped pyramids are going in the same direction. Unlike Charles Freeman, I don’t think the small holes are the oculi of Constantine Monomarchus. I think the big red crosses represent those.\nTo me, the most interesting part of your first comment was the bit about the diagonal lines of crosses on the way down to the chapel of St Helena. Have you any pictures you can suggest for that?\n\n","date":"September 15, 2013 at 2:42 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44334","author":"Hugh Farey","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Pursuing this theme, I have entered “holy sepulchre” “crosses” and “pilgrims” on Google, and been rewarded with a number of photos which I hope show the wall Max was referring to, covered in small crosses. Unfortunately none of them show a diagonal line. However, considering them, and considering the arms of the Order of the Holy Sepulchre (five red crosses), formed in about 1100, I now wonder if the crosses on the Pray illustration refer to that.\n\n","date":"September 15, 2013 at 5:55 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44346","author":"Hugh Farey","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Hugh, you wrote: \n“No, sorry, Max, I still can’t agree. I’ve been looking at the ZIG-ZAGS, and they are IN THE FORM OF at least SIX (VISIBLE) concentric SEMI-CIRCLES (upper cases mine).” \n“SEMI-CIRCLES”, no, really? Are we looking at the same miniature (see Pray codex lower register, fol 28)?\nBesides you wrote: “No, sorry, Max, I still can’t agree. […] the zig-zags […] look NOTHING AT ALL (upper cases mine) like Giorgio Tessiore’s drawing”. \nCAN YOU REALLY READ ME? I NEVER wrote Tessiore’s very realistic pen and ink drawing looks EXACTLY like the Benedictine monk artist’s simplified iconic drawing of the same object namely the TS inner side weave pattern, I wrote: “the TS weave pattern that bears the image when (pen &) ink drawn at macrolevel AND IN ICONIC REDUCTION (upper cases mine) is far more evocative of the Pray codex FLAT square top stepped pyramid design than any -ink drawn- predominantly white marble onyx irregular concentric looped patterned slab one could ever found on earth This is an iconographic fact […].”\nMethinks you STILL either cannot correctly discriminate between the inner side weave pattern that bears the image and that of the outer side (actually they just DON’T look the same) OR you just don’t know what the phrase “IN ICONIC REDUCTION” really means OR BOTH.\nThe latter phrase refers to the graphic artist’s ability (here the Pray ms Benedictine monk’s) to have the viewer mentally relate a simplified iconic drawing to the object it represents. Here the Pray ms Benedictine monk’s pen & ink drawing DOES/CAN look a simplified version of Tessiore’s. This is an iconographic FACT whether you like it or not, whether you non-initiated eye can see it or not at first sight.\nHugh, you can be wrong in your opinion, you just cannot be wrong in your iconographic fact. You cannot either just disagree with me on the sole basis you just missed the meaning of the key phrase here: “in iconic reduction”. First get informed or ask me to clarify the meaning it really covers if you ignore it.\nI also very much like to know how you integrate the red blood like spot and two red blood-like streaks standing out on your zigzagged marble onyx sarcophagus slab. Do you seriously think they are just ‘RANDOM decorative patterns’ too? Are you kidding? Have you ever heard of Medieval Benedictine work? Methinks you are totally unaware of the Benedictine monk artist’s cryptic/symbolically laden way of drawing.\nIn a couple of days (it’s very busy around here at the moment) I’ll email Dan an illustrative reply for you et al to see what I really mean about the basic “sameness” of 1996 Tessiore’s and the 1180s Benedictine monk artist’s pen & ink drawings of the TS inner side weave pattern. Hope Dan will publish it to dispel any misrepresentation of my opinion or biased reading of the Pray codex lower register miniature. \nReminder One: in conjunction with the headdress, Yeshua’s folded-in-two long burial cloth is featured here as if both lying on and in the guise of a zigzagged marble/onyx displaced slab of a red cross-covered sarcophagus. The skeleton reading key (or 1st degree reading level to the uninitiated eye) just mask here a deeper reading level (or reading level to the initiated eye). It is triggered by the cryptic evocation of the Holy Sepulchre (through the famous cross graffiti covered  wall on the way down to the chapel of St Helena or up the HS) and a few spy clues (flat square-top stepped pyramid pattern, two series of small holes, red blood-like spot in conjunction with two red blood-like streaks). \nReminder Two: in the miniature, only three crosses (not dozens!) are shown as if displaced in diagonal line. Actually more than once, three crosses DO look slightly displaced and as if in diagonal line amid hundreds of horizontally well-lined crosses carved into the said wall by medieval pilgrims. \nHugh, methinks you should take a better look!\n\n","date":"September 16, 2013 at 10:12 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44418","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Ah, Max! Let me bow to your erudition. I tried looking up “in iconic reduction” on Google, but sadly, the only times it appears among the entire corpus of internet information is in another post of yours at the end of 2011, and your post above. So you’re correct, I had no idea what it meant. Now, I do, and I still disagree with your interpretation. I think it is an iconic reduction of the concentric irregular semicircles one frequently finds on onyx slabs.\nI’m sorry I can’t help you with my interpretation of the red wiggly lines at the hem of the cloth  lying on the coffin-lid. I certainly do not think they are random, but for the life of me nothing comes to mind. They look nothing like bloodstains and may simply represent a decorated hem. As for the “red blood-like spot,” I’m afraid I can’t see one at all; can you point it out? (There is a black spot above one eye of the figure in the upper picture – is that the one?)\nAs for the crosses in a diagonal line among the hundreds of horizontal ones; forgive me but could you find an appropriate picture among the few on the internet and give me its reference? I’m sure it could be very important.\nMany thanks!\n\n","date":"September 16, 2013 at 12:32 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44431","author":"Hugh Farey","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Hugh, \nDon’t you so much tongue-in-cheek bow at my erudition as seriously stay focus on the real issue, please.\nI may understand your sheer inability to mentally relate the folded-in-two long burial cloth (featured in simplified iconic pen & ink drawing in the Pray ms Three Mary scene) with the Turin Shroud characteristic inner side flat square-top stepped weave pattern it represents.\nHowever, I just can’t help wondering how can one casually refute what he cannot even understand? This is just beyond me!\nBesides, I wish you had more than just remotely heard of visual double-and even at times triple-entendre in reference to Benedictine monk (& nun) Art of cryptography and steganography before passing your comments.\nYou wrote: “I THINK (upper cases mine) it is an iconic reduction (glad you finally make the phrase yours) of the concentric irregular semicircles one frequently finds on onyx slabs”. \nYou may ONLY be right to a far stretched or very surrealistic extent since, at best, this is a “skeleton reading key” (do hope you can understand the phrase). STILL, I very much would like you to SHOW me HOW can a FLAT SQUARE-top stepped PYRAMID design can REALLY BE RECOGNIZABLE as a rather accurate iconic reduction of “concentric irregular SEMICIRCLES one FREQUENTLY finds on onyx slabs (upper cases mine)”. SURREALISTIC thinking is neither FACTually demonstrating nor FACTually proving anything. Hence I am waiting for an iconographic demonstration/proof in the state of the Art via a series of AD HOC illustrations. Could you email it to Dan for the latter to publish it on his blog or forward it to me, please? Thank you. \nTo the initiated eye, the TRUE iconographic FACT is, the Pray codex FLAT SQUARE-top stepped PYRAMID design is first and foremost an iconic reduction of the Shroud inner side weave pattern seen at macro- or “magnifying-scale”. I myself can and will demonstrate and prove it with a series of ad hoc illustrations. It will be a major iconographic confirmation the Pray codex Benedictine monk artist DID cryptically featured the famous relic (in close conjunction with a cross field evocative of both the Holy Sepulchre cross graffiti panels and Byzantine liturgy via a reference to the Byzantine church liturgical garment known as polystaurion ‘many-crossed’). \nRe visual double– and triple-entendre, the TWO RED BLOOD-like WIGGLY LINES are to read in close conjunction with the Resurrection angel (Saint Michael)’s inner RED BLOOD-like garment lower left hem SIDE that shows and stands out as a RED BLOOD-like SPOT/STAIN on the long burial cloth lying flat on the sarcophagus lid.  Iconographically speaking, the long burial shroud DOES make wrinkles and rumples as the heaven messenger tramples on it with his left foot. Saint Michael is here to be read as a Yeshua’s Victory-over-Death or “anasthasia” allegory ((“He is not here”, “He is risen from the dead”). while the RED BLOOD-like SPOT/STAIN and TWO RED BLOOD-like WIGGLY LINES read in conjunction with the characteristic weave pattern are “cryptically evocative” of the side wound associated with two long blood rivulets respectively observable on the Turin Shroud frontal and dorsal images.\nI never had published these iconographic findings of mine so far. They idate back as early as 1991 & 1997. Hope you’ll enjoy them.\n\n","date":"September 17, 2013 at 3:22 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44542","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Max, I’m sorry but do you have any objective evidence supported by other researchers that proves the theory of iconic reduction was a) used by the Benedictines and b) is in the Pray Codex. Sometimes I get the impression you could look at a 12 century smudge mark and interpret it as a Byzantine visual cryptic that actually represents a cloud and is thus an allusion to the Pillar of Fire of Exodus – which of course would be interpreted by the 12th century audience as the Shroud. How do you personally guard against subjective confirmation bias when you appear to be peerless in your field of archeocryptology?\n\n","date":"September 17, 2013 at 4:48 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44554","author":"David Goulet","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Perish the thought that anything I have suggested has refuted Max’s ideas, any more than he has refuted mine. I have followed what he says, I have understood it perfectly, and I think it’s wrong, and have produced an alternative hypothesis. Look at http://www.marmistone.com/wp-content/files_mf/cache/th_c1298f73aff7b37d937a44ba578d6921_1282318034onice_striato_MG_5653.jpg, which shows a piece of onyx characterised by irregular concentric bands around at least three different centres. Further searches for “onyx” on Google images will demonstrate dozens of similar illustrations. Two hypotheses, more or less supported by illustrative evidence. I wonder which the interested bystanders consider more credible, or if there are other hypotheses even more compelling of which we so far know nothing.\n\n","date":"September 17, 2013 at 5:47 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44556","author":"Hugh Farey","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Hugh, your allegedly ‘ad hoc’ ‘illustrative evidence’ is A FAR CRY from what we see in the Pray codex! Are you kidding? You may blindfold your eyes and keep being in denial re Pray codex Benedictine monk artist’s iconic reduction of the TS inner side weave pattern, by way of a Flash Illustrative REply, I will OBJECTIVELY prove HOW WRONG YOU ARE (if Dan allow me to).\nReminder for David: FACTS are more telling than any theory in the world you may think of. Beides Prehistoric rock art/Paleolithic art is by far the earliest body of evidence we have, of the development of systems of symbols in terms of iconic reduction. Present day writing systems and alphabets derive, at least in part, from simplification of drawings of objects. The process is not specific to Benedictine monks and nuns at all as it dates back to the Paleolithic!\n\n","date":"September 17, 2013 at 6:29 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44559","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Hugh, do you REALLY see flat square-top stepped pyramids in you piece of onyx?\n\n","date":"September 17, 2013 at 6:48 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44561","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Hugh, do you REALLY think your ‘illustrative evidence’ refutes my ideas? Are you kidding?\n\n","date":"September 17, 2013 at 6:51 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44562","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Yes, I really think my onyx idea beats your herringbone idea hands-down. No I don’t think my idea refutes yours; it merely provides a more reasonable alternative, supported by easy-to-access illustrations which other readers may find convincing or not, as they see fit.\n\n","date":"September 17, 2013 at 7:16 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44564","author":"Hugh Farey","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"David, sometimes I get the impression you…\n\n","date":"September 17, 2013 at 6:33 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44560","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Hugh, sometimes I get the impression you…\n\n","date":"September 17, 2013 at 7:01 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44563","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Oh gee Hugh, I really can’t see anything in that onyx idea.\nAs I said before, I can’t really accept the herringbone idea either.\nI think the most likely scenario is it is meant to depict a linen weave pattern (not specifically herringbone), or next most likely a sarcophagus lid pattern\n\n","date":"September 17, 2013 at 11:17 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44574","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Well, fair enough. 1-0 to Max, then, so far…\n\n","date":"September 18, 2013 at 1:10 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44625","author":"Hugh Farey","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Hugh, I wish you had been kidding. Most obviously you are not. \nFirstly “your onyx mindset” implies you are almost totally or totally UNfamiliar with:\n–10th-12th c. CE Empty Tomb Angel scene Byzantine and Medieval iconographic corpus including a head band or skull cap\n–Benedictine monks & nuns’ medieval cryptographic & steganographic Art\n–Factual reality of marble onyx patterning.\nSecondly you still cannot correctly discriminate between:\n       –    Turin Shroud “warp side” and “weft side” iconography /photographs\n       –    Herringbone pattern at scale one and flat square-top stepped pyramid pattern at macroscale of the same object aka Turin Shroud\nThirdly, re Benedictine iconic reduction, you most gratuitously dismissed the fact that, to the initiated eye for icono(crypto)graphic forms, the Pray codex can operates at no less than three reading levels (or visual triple-entendre):\n–1st degree or literal/traditional reading level (a displaced marble onyx slab and its cross-covered sarcophagus; a level you just cannot bypass as you most DESEPERATELY remain MENTALLY STUCK in it.\n–2nd degree or symbolical/allegorical reading level (Empty Tomb symbolic scene and Yeshua’s Victory-over-Death allegory in conjunction with the Holy Sepulchre and Byzantine church liturgy); a level you just most painstakingly only half reach.\n–3rd degree or crypto-figurative/evocative/non traditional reading level (Yeshua’s long burial cloth seen lying flat on the sarcophagus lid along with his head band)\nAs far as the Pray ms fol 28 lower panel pen & ink drawing is concerned, your alleged “illustrative evidence” to allegedly refute my idea is totally off the mark and ‘falls flat’ much in the manner of a very HEAVY slab on the sarcophagus of your alleged ‘refutation’ of my pre-cryptanalysis. \nYou wrote: “I really think my onyx idea beats your herringbone idea hands-down”. \nNO! Really? (Are you kidding AGAIN?)\nHugh, BTW AGAIN CANNOT YOU STILL CORRECTLY READ ME? I was NOT promoting any stricto sensu ‘herringbone idea’ but in your dream. I was ONLY referring to ‘flat square-top stepped pyramid pattern’ as characteristic pattern as far as the TS inner side weave pattern is concerned when viewed at macroscale. How long will you still distort my opinion and be wrong in your facts?  \nYou also wrote: “[My onyx idea] merely provides a more reasonable alternative, supported by easy-to-access illustrations.”\n Do you REALLY think just because your illustrations are easier to access and your idea only working at 1s degree level, you are right and I am wrong? These are the most specious arguments I ever heard from a Shroud Scholar to oppose to my ideas! \nHugh THUMPS DOWN!\n\n","date":"September 18, 2013 at 1:25 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44626","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Hugh, just keep blindfolding your eyes and keep being in denial if you like, as soon as I have half-an-hour spare, I’ll write away a Flash Illustrative Reply that – literally speaking –   will OBJECTIVELY prove how most short-sighted is ‘your onyx idea’. Need some iconographic glasses?\n\n","date":"September 18, 2013 at 1:34 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44627","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Thanks for your consideration, Max.\nI agree that I am totally unfamiliar with an “Empty Tomb Angel scene Byzantine and Medieval iconographic corpus including a head band or skull cap.” Would you be so kind as to give me a reference to an illustration I could learn from?\nOn the other hand I have demonstrated that I am familiar with “Factual reality of marble onyx patterning” by myself giving references to appropriate examples.\nI am also familial with the difference between the warp and weft sides of twill. Not only do i have my own sample, but the excellent photos of a piece of the shroud by Barrie Schwortz (at http://www.shroud.com/pdfs/arizona.pdf) illustrate the two sides perfectly.\nAnd. I do not think that an idea can be justified solely by the provision of illustrations, but it certainly makes it easier to understand. I look forward to yours.\n\n","date":"September 18, 2013 at 5:51 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44643","author":"Hugh Farey","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"You have the patience of Job.\n\n","date":"September 19, 2013 at 6:41 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44688","author":"David Goulet","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"David,  If  you can read me, I do think I have the patience of job too with many here on this blog. BTW anything to add about iconic reduction?.\n\n","date":"September 19, 2013 at 12:19 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44725","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Hugh, \nyou are not so much familiar with FACTual reality of marble onyx  patterning as you think. Shall I repeat (with a patience of Job), as a former professional stone cutter (and ornamental sculptor) myself for three years, you’ll NEVER come across any marble onyx slab showing the same FLAT SQUARE-TOP STEPPED PYRAMID PATTERN UNIT we can see in the Pray codex.  All your examples are INAPPROPTIATE. and INACCURATE. You can JUST DREAM they are not. NONE of your alleged illustrations is even a close match to the design under study. I say it again: you are wrong in your fact. \nA carved alabaster stone idea could be an even better than this surrealistic onyx idea of your.\nWhat do you make of the wrinkle and rumple lines about the Resurrection left foot? NOTHING.\nWhat do you make of the two red blood-like wiggly lines? NOTHING\nWhat do you make of the idea of square-top and pyramid as far as the sesign is concerned? NOTHING.\nYou wrote: “I am also familial with the difference between the warp and weft sides of twill.” \nHowever, nn November 7, 2012 at 10:35 am | #17, you also wrote:\n“I too had trouble (along with Dr.I. Colin Berry) discriminating between the warp and the weft side of the fabric. Until recently I supposed that the image side was the weft side, imagining that as one sat at a loom weaving, each of the four heddles in turn would lift every fourth thread, and the shuttle would therefore go over three warps and under one.”\nMethinks your knowledge is STILL TOO FRESH.\n\n","date":"September 19, 2013 at 12:58 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44728","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"You can keep IMAGINING you are right and I am wrong too. THUMPS DOWN!\n\n","date":"September 19, 2013 at 1:01 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44729","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Hugh, \nre your alleged ‘familiarity’ with the TS warp and weft sides, shall I remind you, you TOTALLY revisited  and corrected your view re which of the TS side was bearing the image because of me?  Shall I remind you I first corrected  Dr I. Colin Berry’s  inability to discriminate between the image bearing and the non-image bearing side and then yours?  \nLess than a year ago,  neither Dr. I. Colin Berry nor yourself were even able to  CORRECTLY tell which side it was on!\nSee “Dan’s Image is Scorched Lemonade?” post and .my comment  on November 7, 2012 at 7:27 am | #16; your comment #17 and my comments # 18-22. \nTHESE ARE ALSO FACTS! \nHugh, sometimes  I get the impression your SHORT-SIGHT and SHORT MEMORY…\n\n","date":"September 19, 2013 at 7:13 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44749","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Hugh et al\nIn addition to the tradition you have mentioned of entombment scenes with a sarcophagus lid to one side, there is also a very strong tradition in the art of Jesus’s entombment where Jesus is being laid into a lidless sarcophagus-like structure on a linen cloth, with no lid visible.\nThe sarcophagus-like structure is often red, perhaps corresponding to the stone of unction that was red and in Constantinople.\nSee these examples:\nhttp://www.terminartors.com/artworkprofile/Duccio_di_Buoninsegna-Maesta_back_central_panel_The_Entombment\nThe sarcophagus-like structure which is often red raises the question as to whether this is the same object as the red-dominant, cross covered object on the pray manuscript lower image.\n\n","date":"September 19, 2013 at 8:06 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44694","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"note too empty tomb scenes also often show no lid, just the sarcophagus and shroud + sometimes head cloth\neg:","date":"September 19, 2013 at 8:09 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44695","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Splendid, Matthias; the evidence for evolution of resurrection iconography is a bit like that for human evolution, a gradual accumulation of archaeological bits and pieces that slowly fits together into a coherent pattern. I was familiar with the Buoninsegna, which may show two separate aspects of the holy sepulchre, the annointing stone and the tomb itself (the next frame of the sequence) with tip-tilted lid and five large square inset panels. Your second illustration is new to me. One thing that immediately suggests itself is the transparency of the cloth. The Pray cloth also seems to show transparency, as you can see the edge of the coffin-lid through it, and some of the pattern of X’s also seem to be seen through other layers. The Cypriot church roof is fascinating. Look at the design on the tomb – just like lots of interlocking crosses, no? It’s a pity there is no resurrection or ‘three Marys’ scene. The Russian one shows a typical mummy-wrapped body, which comes from a different tradition, and the last one – well, what on earth is the angel sitting on?\nAnyway, it’s all grist to the mill, and well worth sharing every new example we come across. Thank you.\n\n","date":"September 19, 2013 at 9:10 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44703","author":"Hugh Farey","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Here’s a question….As far as I am aware, there are no historic examples of art that show Christ’s Shroud / burial cloth with blood. I’ve argued that the lower image on the Pray manuscript may depict blood via the two wavy red lines.\nEven with the bloody German depictions of the 1400s / 1500s, I can’t recall seeing a bloodied shroud.\nThoughts?\n\n","date":"September 20, 2013 at 7:41 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44828","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"I was surprised  when looking at Forsyth’s book on French sculptures of Entombments at how many- fifteenth and sixteenth century- have Christ in the burial pose with hands crossed.\n\n","date":"September 19, 2013 at 9:20 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44705","author":"Charles Freeman","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"\nMax Patrick Hamon :\nDavid,  If  you can read me, I do think I have the patience of job too with many here on this blog. BTW anything to add about iconic reduction?.\n\nMax, you are patient too. And I’m not sure what you are describing is true iconic reduction but more likely ocular mastication.\n\n","date":"September 19, 2013 at 1:42 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44731","author":"David Goulet","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"David, ocular mastication, really? David, need some iconographic GLASSES too?\n\n","date":"September 19, 2013 at 6:43 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44746","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"David, BTW,  what can you see  as far as the Pray codex lower pen & ink drawing panel is concerned? Can you describe it for us, please. Methinks It is always easier to criticize than to act as a medieval image analyst or cryptanalyst, which, most obviously you are not.\n\n","date":"September 19, 2013 at 7:27 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44750","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"I can see how some people connect the Pray codex to the Shroud. The L shape holes, the weave implication, red lines approximating blood. But I can also see Hugh’s argument that these are not conclusive evidence, that there could be other explanations. Confirmation bias is a legitimate problem here — seeing what we expect to see. If you deny this (I’m not saying you are) you would be deluding yourself.\nYou claim to have an expertise that leads you to certain conclusions. I certainly do not have this expertise so I am in no position to critique your conclusions on a peer-level. However it appears from your posts that in your field of expertise you are something of a pioneer and thus have no peers, thus I find it difficult to judge the veracity of your conclusions. You may be 100% right — or dead wrong — or anywhere in between. But without some form of peer review how is the non-expert to know?\nI never doubt your sincerity, or that you spend countless hours in your research. I also appreciate your ability to think outside the box. I just find it difficult to judge your conclusions when they appear subjective — and will remain that way until corroborated by your peers. No disrespect intended, just being honest.\n\n","date":"September 20, 2013 at 10:18 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44844","author":"David Goulet","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"You’re right, Matthias, in that I too cannot find a decorated or patterned shroud in contemporary images. And as I say, I can’t account for the wiggly red lines, nor the Xs that occupy the cloth immediately above them except by unfounded speculation. I’d like to find evidence of a patterned cloth or vestment, allegedly derived from the shroud, which had these markings, but haven’t done so far. (The sort of thing I had in mind was a ceremonial cope of the Order of the Holy Sepulchre, but there’s no evidence for any such thing!)\n\n","date":"September 20, 2013 at 10:45 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44850","author":"Hugh Farey","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Hugh, you wrote: “the Xs that occupy the cloth immediately above them (the two wiggly red lines)”\nYou got TOTALLY entangled here. Most obviously, you TOTALLY misundertood my point… You’re EVEN mistaking small black crosses for the 3 red blood-like Xs in diagonal line. Again this is not serious. Your comment has no rhyme nor reason.\n\n","date":"September 20, 2013 at 3:44 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44877","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"I do hope not. I wasn’t referring to your comment this time, but simply agreeing with Matthias that there are aspects of the illustration that I haven’t come up with any good explanation for. There are other aspects, of course, that I have provided good explanations for, even if they are yet to find universal acceptance…\n\n","date":"September 20, 2013 at 5:40 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44892","author":"Hugh Farey","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"This is the problem, I think….the majority of the artistic tradition shows Jesus, in his burial / entombment, squeaky clean and unblemished, save for the odd little holes in hands or a small neat and tidy cut in the abdomen.\nHence, the same artistic tradition shows Jesus’s shroud unblemished.\nThis, I think, is one of the key ways in which the Shroud departs from artistic tradition.\nSo keeping an open mind with no (or little) bias towards authenticity, this raises for me several possible explanations:\n1. The Shroud really is Christ’s shroud\n2. The creators of the shroud in 13th / 14th century Europe departed from the dominant artistic tradition, to create a more ‘authentic’ and believable relic. Something along the lines of “Hey, we all know, despite the artistic tradition, that Jesus was a bloodied and tortured mess, and this is the real thing because it provides evidence of that rather than being  a spotless cloth”. \n3. The Shroud was really Christ’s Shroud but the major blood markings were added to the body image in the 1300s. \nFurther to scenarios 2 and 3, there was the rise in the 1300s / 1400s of the German artistic movement that showed Christ much more tortured and wounded than even before, and in the mid 1300s the Black Death struck Europe, and there was the rise of flagellants who wounded themselves in the name of Christ.\nSo, certainly, by the time the Shroud was being displayed in Lirey, there was a tradition – unthinkable a century earlier – of Christ as heavily tortured, wounded and bloodied Saviour.\nRe: scenario 3. I’ve heard the argument against this sort of notion – “there is no image under the blood”. How definitive is this, how confident can we be in this assertion? Hugh, I think you may have questioned this assertion in the past? \nBy the way, I’ve been spending some time thinking about the so-called “wrist wounds”. You will all know that a common argument for authenticity is that the wound is on the wrist, not the palm of the hand as per the artistic tradition.\nWell, using Shroud Scope I have measured the length from the tip of the longest finger to the start of the wound, it came out at about 140mm, or 14cm, noting that it is somewhat difficult to precisely determine the end of the fingers – but I reckon I was close enough.\nI am 6 foot 2 inches tall, so not dissimilar in height to the supposed height of the man on the shroud. Measuring 14cm from the tip of my longest finger located the wound on my hand as per the shroud around mid palm. \nFor me, this commonly espoused pro-authenticity argument is wrong.\nNone of the above means I don’t believe the shroud is authentic (on balance, I do! mainly because of the inexplicability of a man-made image, and secondarily by some of the historic records of a seemingly shroud-like object in Constantinople). However, we may want to re-think the conventional wisdom that the shroud as mad made object departed heavily from the artistic / cultural traditions of the time vis a vis Christ as wounded and tortured saviour versus unblemished and glorified\n\n","date":"September 20, 2013 at 8:33 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44908","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Tying this back to the Pray Manuscript…\nThe red lines still ‘frustrate me’. I really can’t see them as anything other than depicting the blood of Christ on the Shroud, but am open to alternatives. Indeed, I wish to take analysis of this matter as far as possible, and exhaust all alternatives.   \nOn balance, I still maintain the view that this image is influenced by the Shroud.\nConsider the Shroud in the 1100’s. There were none of the dominant burn marks than came later in the 1500s. \nIf you imagine that, then you create the following picture:\nA shroud with a faint ghostly body image, plus noticeable marks of blood, and noticeable poker holes (indeed these 3 features are depicted in the earliest artistic depiction of the shroud. the poker holes are not depicted in later depictions, probably because the burn marks became the dominant non- body image feature to depict) .\nIn this context, does not a reasonable case present for the lower image depicting the shroud with the cross-like markings in the middle between the angel’s feet and the 4 holes representing the faint ephemeral body image, the 4 holes being the poker holes, and the two red lines representing the blood on the shroud?\nAnd if this representation is somewhat cryptic, is that not understandable given the limitations in the skill of the artist, coupled perhaps with a desire to “keep the shroud quiet”???   \n,\n\n","date":"September 20, 2013 at 8:45 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44909","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"further thought on the hands / wrist issue…\nlooking at the shroud scope negatives, there does seem to be evidence of visible detail of the metacarpal bones running down to the hand wound.\nNow, it has been proposed that this is a kind of “X Ray” effect.\nCould an alternative theory be that the driving of the nails through the hands (between two metacarpals?), and the subsequent removal of the nails, tore away flesh on the hand, hence exposing at least parts of the metacarpal bones, whose image was then transferred to the shroud (not necessarily via a radioactive mechanism).\nSurely the nail piercing and removal would have torn away flesh?\n\n","date":"September 20, 2013 at 9:23 pm","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44915","author":"Matthias","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"PS. Re: David Goulet’s comment above. Does that make it one-all?\n\n","date":"September 20, 2013 at 10:47 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44851","author":"Hugh Farey","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"David, \nI do appreciate your comment as it sounds honesty and sincere. However you wrote: “I just find it difficult to judge your conclusions when they APPEAR SUBJECTIVE (upper cases mine).” How can you make such an assertion when you haven’t seen anything yet as far as my icono(crypto)graphic demonstration/Flash Illustrative REply  is concerned? First SEE my iconographic/visual facts then criticize (only if need be). \nThe only true and reliable peer that I know of, is a demonstrated/proven fact or most likely fact.\nRe Hugh’s alleged ‘objectivity’, you can easily see how most subjective is interpretation is actually (e.g. ask Matthias’s feeling about Hugh’s ‘onyx idea’). It  just stares you in the face  his allegedly “onyx example/match’ of the FLAT SQUARE-TOP STEPPED PYRAMID pattern are no match at all and even a far cry from it. Hugh just  most casually indulges in interpreting ‘the Threee Marys ‘ scene on an iconographic ‘take-and-leave’ basis. This is not serious!\n\n","date":"September 20, 2013 at 10:58 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44853","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"Sorry for all the typos as I am typing in haste.\n\n","date":"September 20, 2013 at 11:02 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44854","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Significant Endorsement:  Former Anglican Archbishop of Canterbury backs The Shroud Affair","post":"To Matthias, Hugh, David, Charles etc.,\nHopefully, next week I’ll email Dan my Flash Illustrative REply  (F.I.RE) to any sceptics’ current refutations.\nActually it will take me 3-4 sesssions, half-an-hour each,  to write it away. It will be entitled; \n“Pray codex folio 28 sarcophagus flat lid & rectangular box: \nMORE THAT MEETS THE NON-INITIATED EYE” \nand subtitled:\n “An archaeoperceptive cryptanalyst’s opinion. \nSurprise surprise for Hugh et al. Hope Dan will accept to publish it. Keep tuned.\n\n","date":"September 21, 2013 at 11:51 am","url":"https://shroudstory.com/2013/08/31/significant-endorsement-former-anglican-archbishop-of-canterbury-backs-the-shroud-affair/","cat":"crowdfunding","id":"comment-44978","author":"Max Patrick Hamon","site":"shroudstory"}]
