[{"title":"Speaking of Matching Faces","post":"Leonardo was born in 1452. These people are weird, eccentric, not difficult to find in the region where they are.\n\n","date":"September 4, 2014 at 9:45 am","url":"https://shroudstory.com/2014/09/04/speaking-of-matching-faces/","cat":"art","id":"comment-148505","author":"Louis","site":"shroudstory"},{"title":"Speaking of Matching Faces","post":"there was no photograph at that time, and Ray Downing and his whole team found the tornplant that is only growing in Israel, als the blood is from a virgin birth.\nthose people want to get his right, but the true is Ray is right, who else clean my fish tank 250 gallon? Nobody can change my mind, since the painting is near the tank its pure clear water.\nAnd it proofs Yehoshua (Jesus) is still alive and around us and in us everywhere.\nAnd even my new baby Malawi’s eat out of my hand.\n\n","date":"September 4, 2014 at 10:39 am","url":"https://shroudstory.com/2014/09/04/speaking-of-matching-faces/","cat":"art","id":"comment-148519","author":"Angel Wynton","site":"shroudstory"},{"title":"Speaking of Matching Faces","post":"Dan, you wrote in your Shroud of Turin faq:\n“The similarities between the Pantocrator icon and the image on the Shroud of Turin are\nstartling. It is too significant to be coincidental.”\nIt’s an opinion, but i agree.\n\n","date":"September 4, 2014 at 11:32 am","url":"https://shroudstory.com/2014/09/04/speaking-of-matching-faces/","cat":"art","id":"comment-148525","author":"anoxie","site":"shroudstory"},{"title":"Speaking of Matching Faces","post":"Yes that is opinion. I agree. \n\n","date":"September 4, 2014 at 11:38 am","url":"https://shroudstory.com/2014/09/04/speaking-of-matching-faces/","cat":"art","id":"comment-148527","author":"Dan","site":"shroudstory"},{"title":"Speaking of Matching Faces","post":"Durer, da Vinci, Manoppello, Emperor Justinian, various catacombs, mosaics, the Pantocrator, even the Cistine Chapel and Prince William. All these have been hotly defended as uncontrovertibly, and sometimes exclusively, derived from the Shroud (or vice versa). The greater the cast of possibles, and the more vehement the defence of each one, the less objective the whole business seems to be. I still vote for Rasputin, with no fear of contradiction… (oops…)\n\n","date":"September 4, 2014 at 1:18 pm","url":"https://shroudstory.com/2014/09/04/speaking-of-matching-faces/","cat":"art","id":"comment-148546","author":"Hugh Farey","site":"shroudstory"},{"title":"Speaking of Matching Faces","post":"Hugh, just one should develop some clear and sensible rules not to get lost in all that mess with images. That work is in progress already.\nMy response for P&P claims is already being worked on.\n\n","date":"September 4, 2014 at 1:22 pm","url":"https://shroudstory.com/2014/09/04/speaking-of-matching-faces/","cat":"art","id":"comment-148548","author":"O.K.","site":"shroudstory"},{"title":"Speaking of Matching Faces","post":"This face matching stuff is a joke.\n\n","date":"September 5, 2014 at 1:53 am","url":"https://shroudstory.com/2014/09/04/speaking-of-matching-faces/","cat":"art","id":"comment-148705","author":"Thomas","site":"shroudstory"},{"title":"Speaking of Matching Faces","post":"Off the track, but breaking news:\nIt seems that epigrapher Ada Yardeni has found the inscription on the Ivory Pomegranate to be a fake. The pomegranate predates the Jerusalem Temple by centuries and the inscription is modern.\nIn my view, this is somewhat similar to what was done to the James ossuary, with only the first part of the inscription being authentic. My hunch is that the forger added “brother of Jesus” to “James son of Joseph”, taking it for granted that it would be interpreted as referring to James the Just, first of the twelve Jewish Christian bishops of Jerusalem. He did not know  — or ignored the fact — that according to Old Testament usage, also valid in the New Testament period, “Joseph” would be the “brother of “Jesus”.\nHope to have more on the pomegranate shortly, but here is an old link with a nice report:\n http://www.nbcnews.com/id/6753063/ns/technology_and_science-science/t/solomon-relic-fake-museum-concludes/#.VAo9fvldWj8\nIt looks like there are people who love to pick on Jesus. He sells and the work is of course agenda-driven.\n\n","date":"September 5, 2014 at 7:04 pm","url":"https://shroudstory.com/2014/09/04/speaking-of-matching-faces/","cat":"art","id":"comment-148905","author":"Louis","site":"shroudstory"},{"title":"Speaking of Matching Faces","post":"I must add that both the James ossuary and the Ivory Pomegranate were with Oded Golan. It is known that an Egyptian antiquarian living in Cairo was forging many inscriptions and was working for Golan, but he did not appear at the trial in Jerusalem. The court returned the ossuary to Golan, making it clear —like the Israel Antiquities Authority — that it did not endorse his claim, and stating that part of the inscription was forged. Much before all this, Professor Amos Kloner, former Jerusalem District Archaeologist, who dismissed the “Jesus family tomb”, had said the same thing to Dr. Gideon Avni in a written report.\n\n","date":"September 5, 2014 at 8:05 pm","url":"https://shroudstory.com/2014/09/04/speaking-of-matching-faces/","cat":"art","id":"comment-148913","author":"Louis","site":"shroudstory"}]
