[{"title":"Squiggles of Blood on the Head Almost Identical to Holkham Bible?","post":"Charles, what about these pictures from the Holkham Bible has ANY resemblance to the Shroud?  I don’t see any comparable details except the beard, long hair and that he is naked.  So what?  As far as the blood, there is no resemblance at all to what is seen on the Shroud.  You are simply trying to lead people–the uninitiated– to a conclusion that simply cannot be sustained by the facts.  It is time to give up.  Colin Berry destroyed your calcium carbonate theory as “proof” for you gesso hypothesis.\n\n","date":"January 17, 2015 at 7:55 am","url":"https://shroudstory.com/2015/01/17/squiggles-of-blood-on-the-head-almost-identical-to-holkham-bible/","cat":"art","id":"comment-184028","author":"Russ Breault","site":"shroudstory"},{"title":"Squiggles of Blood on the Head Almost Identical to Holkham Bible?","post":"You need to have a close-up of the sguiggles of blood on the head and compare them with the Shroud. You will also notice the blood running down the arms as the Shroud does and you also need to note the marks of the scourging covering the whole body, something rarely seen before 1300. So the link is very close. This is a London production but you can see the same blood on the Roettgen Pieta from Germany, a sculpture of roughly the same date, blood on arms and legs, blood running down from the Crown of Thorns. The patterns are very similar and are not known before 1300.\nI think the correlation is very close largely because we do not have earlier examples of these patterns of blood. I suppose you could argue that the Shroud was copied without the blood before 1300 and was then copied in London and Germany with the blood after z1300 but it is a long shot.\nI am not trying to lead people anywhere- I am just setting out evidence that has not been introduced into the argument yet so far as I know. How else do things move on?\n\n","date":"January 17, 2015 at 8:11 am","url":"https://shroudstory.com/2015/01/17/squiggles-of-blood-on-the-head-almost-identical-to-holkham-bible/","cat":"art","id":"comment-184031","author":"Charles Freeman","site":"shroudstory"},{"title":"Squiggles of Blood on the Head Almost Identical to Holkham Bible?","post":"Nothing on the blood-flows on the drawing resembles the Shroud blood-flows, neither the head wounds, nor along the arms.  Anatomy is distorted, body trunk too long, legs too short and skinny, probably merely resembling contemporary artistic conventions.  Not a cap of thorns, but merely some token head band.  \nWikipedia knows little of provenance, merely an unidentified Dominican preacher sometime before 1350.  \nTechnical note on contemporary versions ex Encyc Brit:\n[Anglo-Saxon versions: ” … The last significant figure associated with the vernacular Bible before the Norman Conquest was the so-called Aelfric the Grammarian (c. 955-1020). … “]\n“Anglo-Norman versions:  The displacement of the English upper class, with the consequent decline of the Anglo-Saxon tradition attendant upon the Norman invasion, arrested for a while the movement toward the production of the English Bible. Within about 50 years (c. 1120) of the Conquest, Eadwine’s Psalterium triplex, which contained the Latin version accompanied by Anglo-Norman and Anglo-Saxon renderings, appeared. The contemporary Oxford Psalter achieved such influence that it became the basis of all subsequent Anglo-Norman versions. By 1361 a prose translation of most of Scripture in this dialect had been executed.”  \n[Wycliffe versions:  By the middle of the 13th century the English component in the Anglo-Norman amalgam had begun to assert itself and the close of the century witnessed a Northumbrian version of the Psalter made directly from Latin, which, because it survived in several manuscripts, must have achieved relatively wide circulation. … ” ]\n\n","date":"January 17, 2015 at 2:28 pm","url":"https://shroudstory.com/2015/01/17/squiggles-of-blood-on-the-head-almost-identical-to-holkham-bible/","cat":"art","id":"comment-184087","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Squiggles of Blood on the Head Almost Identical to Holkham Bible?","post":"I suppose it depends on how exact a resemblance one is looking for: simply dribbles of blood (as shown in post-1300 works) versus no blood at all (as shown in pre-1300 works), or an exact copy of the epsilon, fork and other recognisable bloodstains of the shroud. I don’t think Charles means that if we count the drips they are exactly the same in number and shape on the Shroud and the Holkham bible, but simply that the abundance of liquid blood indicates a similar artistic development. However, I agree that Charles’s term “almost identical” is pehaps a little too enthusiastic…\n\n","date":"January 17, 2015 at 2:46 pm","url":"https://shroudstory.com/2015/01/17/squiggles-of-blood-on-the-head-almost-identical-to-holkham-bible/","cat":"art","id":"comment-184089","author":"Hugh Farey","site":"shroudstory"},{"title":"Squiggles of Blood on the Head Almost Identical to Holkham Bible?","post":"And of course this is a nude figure showing that such things were possible. I think the similarities between the Shroud and this Bible- as well as a lot of the iconography of the period.e.g. The Man of Sorrows – does suggest that one would place it within this period. I cannot imagine how de Wesselow missed this. One has to contrast the representation of the man on the Shroud with the iconography of the period just before, e.g. The complete lack of bloodstains, and scourge marks on the body of Christ on the Pray Codex – but we have been here before and I did not convince anyone then!\n But if we go back to the body and ( non- existent) bloods on the Pray Codex and compare it to the body and blood of the Holkham Bible, the. It is clear that tHe Man on the Shroud fits better with the latter than with the former. Or perhaps once again I am wearing the wrong spectacles!\n\n","date":"January 17, 2015 at 3:23 pm","url":"https://shroudstory.com/2015/01/17/squiggles-of-blood-on-the-head-almost-identical-to-holkham-bible/","cat":"art","id":"comment-184092","author":"Charles Freeman","site":"shroudstory"},{"title":"Squiggles of Blood on the Head Almost Identical to Holkham Bible?","post":"The Holkham Bible illustrations are crude drawings lacking any realism.  The only forensic interest they would ever attract would be by way of negative comment.  By contrast, the TS blood flows have been corroborated as realistic by several independent pathologists.  How then can the two be said to be similar?  No way!\n\n","date":"January 17, 2015 at 10:11 pm","url":"https://shroudstory.com/2015/01/17/squiggles-of-blood-on-the-head-almost-identical-to-holkham-bible/","cat":"art","id":"comment-184168","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Squiggles of Blood on the Head Almost Identical to Holkham Bible?","post":"Charles’ sentence “The COMPLETE LACK (my upper cases) of bloodstains, and scourge marks on the body of Christ on the Pray Codex”, is disinformative. \nBesides the HP Ms folio 28 Christ’s face and Turin Shroud man’s face do have strikingly similar accidental characteristics, the blood smudge on the HP Ms Christ’s forehead DOES match/IS the accurate depiction of the lower portion of the tailed-epsilon-shaped blood trickle on the TS man’s forehead with its clotted extension on his eyebrow ridge (See illustrations A & B in “The Hungarian Pray Ms-Turin Shroud connection: MORE THAN MEET THE NON-INITIATED EYE…”) (November 4, 2014).\n\n","date":"January 19, 2015 at 9:18 am","url":"https://shroudstory.com/2015/01/17/squiggles-of-blood-on-the-head-almost-identical-to-holkham-bible/","cat":"art","id":"comment-184526","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Squiggles of Blood on the Head Almost Identical to Holkham Bible?","post":"Charles, YOU still have to explain why the blood smudge on the HP Ms Christ’s forehead IS remarkably identical to the lower portion of the tailed-epsilon-shaped blood trickle on the TS man’s forehead with its clotted extension on his eyebrow ridge.\n\n","date":"January 19, 2015 at 10:08 am","url":"https://shroudstory.com/2015/01/17/squiggles-of-blood-on-the-head-almost-identical-to-holkham-bible/","cat":"art","id":"comment-184538","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Squiggles of Blood on the Head Almost Identical to Holkham Bible?","post":"This apparently falling on Charles’s deaf ears and/or staring in his blind eyes.\n\n","date":"January 20, 2015 at 7:33 am","url":"https://shroudstory.com/2015/01/17/squiggles-of-blood-on-the-head-almost-identical-to-holkham-bible/","cat":"art","id":"comment-184832","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Squiggles of Blood on the Head Almost Identical to Holkham Bible?","post":"The fact is this does fall on many deaf ears and stare in many blind eyes on this site.\n\n","date":"January 20, 2015 at 7:37 am","url":"https://shroudstory.com/2015/01/17/squiggles-of-blood-on-the-head-almost-identical-to-holkham-bible/","cat":"art","id":"comment-184834","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Squiggles of Blood on the Head Almost Identical to Holkham Bible?","post":"Addition: The San Damiano Cross (Basilica of Saint Clare in Assisi, Italy) –most likely an Umbrian Benedictine monk artist painted aroundin the mid-12th c. CE –, does show an off-ritght-elbow-tipped bloodstain and head-seen-in-profile-shaped like side-wound bloodstain much alike those we can see on the TS.\n\n","date":"January 19, 2015 at 9:53 am","url":"https://shroudstory.com/2015/01/17/squiggles-of-blood-on-the-head-almost-identical-to-holkham-bible/","cat":"art","id":"comment-184535","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Squiggles of Blood on the Head Almost Identical to Holkham Bible?","post":"Additrion Two:  re the epsilon-shaped like squiggle of blood on the forehead in light of Justinian II solidus, on October 24, 2012 at 5:18 pm and October 25, 2012 at 6:41 am, I wrote:\n“In terms of additional spy clue as far as the Justinian coin (aka “Fanti’s”) obverse Christ face is concerned, rotate the numismtic “three-four strands of hair” 90° clockwise then you’ll get the mirrored form of the Greek letter epsilon-shaped like TS man’s forehead clot as a BONUS!”\n“In all likelihood and obedience to a specific iconological canon, the TS man’s forehead clot DISlocation in centre hairline of the forehead and stylisation as a double stranded quiff of dropping hair, was deemed more suitable both within the general economy of the Justinian II’s Solidus obverse Christ face and… the engraver’s eye.”\n\n","date":"January 19, 2015 at 10:48 am","url":"https://shroudstory.com/2015/01/17/squiggles-of-blood-on-the-head-almost-identical-to-holkham-bible/","cat":"art","id":"comment-184549","author":"Max patrick Hamon","site":"shroudstory"}]
