[{"title":"Stephen Jones’ New Discovery","post":"I went to Stephen’s site, and zoomed the blow-up to 400% in IE.  I can agree that there is a definite mark on the forehead.  The picture was quite grainy which may have been the nature of the original painting medium (canvas-like?) or it may have been merely indistinct pixels from the blow-up.  The mark appears a reddish color, but in my view lacks a definite shape as a reversed ‘3’ or epsilon, more like just the artist’s careful deliberate brush-stroke.  The picture is of a boyish mid-teen Christ, the beard is barely perceptible, the eyes are not the classic owlish shape, and any Vignon marks if present, would require some searching for.  I think the forehead mark is probably significant, but Stephen I think may be indulging in wishful thinking if he wants to claim more than this, unless he can demonstrate it more conclusively.\n\n","date":"May 19, 2014 at 6:12 am","url":"https://shroudstory.com/2014/05/19/stephen-jones-new-discovery/","cat":"art","id":"comment-121403","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Stephen Jones’ New Discovery","post":"Here we go, then; a huge blow-up of the wiipedia image. http://imgur.com/mVlqEck\nAlthough the forehead mark looks to me like a ringlet of hair rather than blood, it is indeed in roughly the right place and of roughly the right design for a valid comparison to be made with the epsilon. I think it’s a coincidence, because it is surely very odd that no other portrait has a ringlet of hair (or an epsilon of blood) which could plausibly have come from the shroud, but I understand Stephen’s point of view.\nBut not the one about the neckline. Surely we’ve scotched that…\n\n","date":"May 19, 2014 at 6:33 am","url":"https://shroudstory.com/2014/05/19/stephen-jones-new-discovery/","cat":"art","id":"comment-121411","author":"Hugh Farey","site":"shroudstory"},{"title":"Stephen Jones’ New Discovery","post":"“But not the one about the neckline. Surely we’ve scotched that…” (??!!)  Clearly wishful thinking is not the sole prerogative of authenticists!\nAbgar painted with the features of Constantine Porphyrogenitus, 10th century.  There are much earlier icons.  This image is a painting within a painting, and how accurately was the artist wanting to depict its detail?  Was he modelling it directly from the newly arrived Mandylion from Edessa, or was he merely following an earlier artistic tradition of showing two strands of hair at the forehead?  Sure, it’s a reddish colour, but hardly different from the coloration of the rest of the hair.\n\n","date":"May 19, 2014 at 6:57 am","url":"https://shroudstory.com/2014/05/19/stephen-jones-new-discovery/","cat":"art","id":"comment-121418","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Stephen Jones’ New Discovery","post":"This is a relatively  small drawing but there is one convention that I think that is directly attributable to the Shroud,. Sometimes it is a little skewed in discussions because the viewers left is the image’s right. Sometimes the reproductions of the Shroud may be reversed and thus more confusion. But the difference between the right and left hair fall is unmistakable. Why would artist do that unless he was copying from something?\nThat is the length of the hair on either side. The right-hand side of the image (the viewer’s left) appears shorter than the right or falls differently. That’s present in the image. The first known representation of that is the Shroud of Turin and I think that one right-short, left-long as a convention had to start somewhere. The starting place was the Shroud.\n(It may be confusing to discuss this in terms of length, it is the appearance of the Shroud that gives that impression.)\n\n","date":"May 19, 2014 at 7:35 am","url":"https://shroudstory.com/2014/05/19/stephen-jones-new-discovery/","cat":"art","id":"comment-121425","author":"John Klotz","site":"shroudstory"},{"title":"Stephen Jones’ New Discovery","post":"John, I think this observation is very significant. You can see it prevalent also in most depictions of the pantocrator ( below ).\nhttps://www.google.ca/search?q=pantocrator&safe=active&client=safari&hl=en&source=lnms&tbm=isch&sa=X&ei=KgV6U-TbNs-QyATygYHQCg&ved=0CAgQ_AUoAQ&biw=1024&bih=672\nThis links the pantocrator to the Mandylion. However, i think the only challenge to this is that it is the opposite side that is longer on the shroud (i.e. the painter has to have realized the mirror image concept when he painted them). Which is difficult but not impossible.\n\n","date":"May 19, 2014 at 9:26 am","url":"https://shroudstory.com/2014/05/19/stephen-jones-new-discovery/","cat":"art","id":"comment-121456","author":"Mike M","site":"shroudstory"},{"title":"Stephen Jones’ New Discovery","post":"One additional point of personal privilege. I have never been completely convinced by Ian Wilson’s identification of Mandylion with the Shroud. I am probably convinced now. Interestingly, a Wiki page of Mandylion images, which does not include this one, NONE of them show the differential fall of the hair.\nGiven that the image at issue was painted in Constantinople, and its provenance is established, I believe the identity between the the Shroud and this copy is established. The fact that it’s the image of the mandylion that shows this and NONE of the WEiki icons do is remarkable.\nhttps://www.google.com/search?q=mandylion+icon&tbm=isch&tbo=u&source=univ&sa=X&ei=uO15U-mVNeaisQTR_4DQDQ&ved=0CCgQsAQ&biw=1256&bih=717\n\n","date":"May 19, 2014 at 7:48 am","url":"https://shroudstory.com/2014/05/19/stephen-jones-new-discovery/","cat":"art","id":"comment-121427","author":"John Klotz","site":"shroudstory"},{"title":"Stephen Jones’ New Discovery","post":"I sit corrected, at least four or five of the  Wiki images have the hair fall differential. That doesn’t change the argument for the earliest representation was undoubtedly the Shroud.\n\n","date":"May 19, 2014 at 7:52 am","url":"https://shroudstory.com/2014/05/19/stephen-jones-new-discovery/","cat":"art","id":"comment-121430","author":"John Klotz","site":"shroudstory"},{"title":"Stephen Jones’ New Discovery","post":"Reminder : The late 11th century CE fresco of the Mandylion in Sakli/Hidden church, Gôreme, Cappadocia does show the same two reddish strands of hair at the forehead (of the same reddish of the rest of the hair) + the same asymmetrical right-and-left hair fall.\n\n","date":"May 19, 2014 at 8:31 am","url":"https://shroudstory.com/2014/05/19/stephen-jones-new-discovery/","cat":"art","id":"comment-121438","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ New Discovery","post":"Max Patrick,\nThanks for the “asymetrical.” I knew there was a better, more precise word, but I couldn’t put my finger on it.\n\n","date":"May 19, 2014 at 8:58 am","url":"https://shroudstory.com/2014/05/19/stephen-jones-new-discovery/","cat":"art","id":"comment-121449","author":"John Klotz","site":"shroudstory"},{"title":"Stephen Jones’ New Discovery","post":"We can now imagine how important documents or icons relating to the Mandylion/Image of Edessa may have got lost:\nhttp://news.yahoo.com/muslims-pray-turn-turkeys-greatest-monument-back-mosque-190357690.html\n\n","date":"May 30, 2014 at 5:08 pm","url":"https://shroudstory.com/2014/05/19/stephen-jones-new-discovery/","cat":"art","id":"comment-125781","author":"Louis","site":"shroudstory"}]
