[{"title":"Another Enduring Belief Question: Jesus in the Nude","post":"This does not help in authentication. Even Ian Wilson understood that the hands modestly covering the genitals didn’t mean anything and in one of his writings he said he could see the tip of the penis.\n\n","date":"April 13, 2014 at 11:07 am","url":"https://shroudstory.com/2014/04/13/another-enduring-belief-question-jesus-in-the-nude/","cat":"art","id":"comment-98963","author":"Louis","site":"shroudstory"},{"title":"Another Enduring Belief Question: Jesus in the Nude","post":"Louis,\nYour statement is that this does not “help” in authentication and I beg to differ with you. It is a factual circumstance that supports authenticity. Any single item of circumstantial evidence rarely “proves” anything. The issue is whether it is consistent with one side of the matter at issue because if its inconsistent it start to point in the opposite direction. It is an accumulation of circumstances that point in the same direction that eventually proves the case..\nThe nudity of Christ in the Shroud image is consistent with the fact of his burial after a nude crucifixion. All that en-wrapped were the burial linens.\nNow how many images of a nude Christ on the cross are there? Is the answer one? or two or even ten?\nHow many original images of Christ with his genitals with a loin cloth. I would hazard a guess that there may be significantly more than 100,000. Now how many reproductions of loin cloth covered genital area are there? There are more than two billion Christians living to day.Counting Rosary reproductions, , sacred icons and even cheesy reproductions of the crucifixion,over the span of nearly two millennia I would suggest there are tens of million if bnot hundreds of millions.\nThe odds that the naked Christ of the Shroud is not unique and attributal to its authenticity claim probably run to at least 100,000 to 1 or .00001. . \nI sometimes find that “true believers” fight the use of reasonable inferences from the evidence because they insist that it be a matter of faith. (That’s not you Louis)\nThe merger of science and religion is proceeding apace. Some Catholic theologians are way ahead of the crowd in recognizing the Chardian confluence of Science and Religion. They have never really been separated.\nFascinating video:\n\nNot saying I buy all of it, but very enlightening on where modern Catholic theology is headed.\n\n","date":"April 13, 2014 at 11:54 am","url":"https://shroudstory.com/2014/04/13/another-enduring-belief-question-jesus-in-the-nude/","cat":"art","id":"comment-98976","author":"John Klotz","site":"shroudstory"},{"title":"Another Enduring Belief Question: Jesus in the Nude","post":"Good morning, John\nI am very busy right now with a big pdf article being written about Jesus in biblical archaeology, which should have been ready a month ago.  I will reply to your comments in about two hours time,OK?\n\n","date":"April 13, 2014 at 12:52 pm","url":"https://shroudstory.com/2014/04/13/another-enduring-belief-question-jesus-in-the-nude/","cat":"art","id":"comment-98987","author":"Louis","site":"shroudstory"},{"title":"Another Enduring Belief Question: Jesus in the Nude","post":"Take your time. Good luck on the article.\n\n","date":"April 13, 2014 at 1:53 pm","url":"https://shroudstory.com/2014/04/13/another-enduring-belief-question-jesus-in-the-nude/","cat":"art","id":"comment-98998","author":"John Klotz","site":"shroudstory"},{"title":"Another Enduring Belief Question: Jesus in the Nude","post":"The Holkham Bible of c1330 (images easily found on the web) has a naked Jesus on the cross.\n\n","date":"April 13, 2014 at 4:03 pm","url":"https://shroudstory.com/2014/04/13/another-enduring-belief-question-jesus-in-the-nude/","cat":"art","id":"comment-99029","author":"Charles Freeman","site":"shroudstory"},{"title":"Another Enduring Belief Question: Jesus in the Nude","post":"In the very rare circumstances where Jesus is depicted nude it is in a private ie. Non public setting eg. A bible or a manuscript. It is very unlikely if the shroud was a fraud for public showing and associated fame and fortune that the image would have been created nude.\n\n","date":"April 13, 2014 at 4:15 pm","url":"https://shroudstory.com/2014/04/13/another-enduring-belief-question-jesus-in-the-nude/","cat":"art","id":"comment-99033","author":"Thomas","site":"shroudstory"},{"title":"Another Enduring Belief Question: Jesus in the Nude","post":"Try http://www.gettyimages.com/detail/news-photo/the-crucifixion-christ-hangs-naked-on-the-cross-between-two-news-photo/155648099\n\n","date":"April 13, 2014 at 4:21 pm","url":"https://shroudstory.com/2014/04/13/another-enduring-belief-question-jesus-in-the-nude/","cat":"art","id":"comment-99035","author":"Dan","site":"shroudstory"},{"title":"Another Enduring Belief Question: Jesus in the Nude","post":"USCCB on Matthew 27 has a note that the clothing of the crucified person always went to the executioners. This clearly included the inner tunic which was seamless and for which the soldiers cast lots (dice??).  The posting above refers to removal of a loin cloth, but I don’t know if this was a regular part of Jewish clothing or not. Mary placing her veil over the loins is an interesting piety, but is there any at least apocryphal evidence for it?  This is the first I’ve heard of such a legend. At the normal height of a regular Roman cross, it would be quite possible to do so. Piercing of the chest with the lancea would have been done by a foot soldier and did not require a mounted cavalry-man. Possibly the earliest depiction of a fully naked Christ (rear view) is an illustration in the Carolingian Stuttgart Psalter of the scourging, 800-814AD, Dan posted here a few months ago.\n\n","date":"April 13, 2014 at 4:26 pm","url":"https://shroudstory.com/2014/04/13/another-enduring-belief-question-jesus-in-the-nude/","cat":"art","id":"comment-99036","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Another Enduring Belief Question: Jesus in the Nude","post":"John,\nHere we go:\nI understand what you are saying and agree with you, — you argue like a very good lawyer indeed! — however the comment was prompted  by IW’s insistence that no one has been able to prove that the C14 dating was skewed and  his attempts to demonstrate the authenticity of the Shroud through other means. While I personally do not find it difficult to accept what you call “accumulation of circumstances”, that surely will not be welcome by anti-authenticists. More will be needed to convince them, and it will have to be a lot more convincing than what has sometimes been published on the relic so far:\nhttps://www.academia.edu/6568383/Does_the_Shroud_show_a_Mandaean_burial\nLet me know if you were able to open the file.\nMore recently,it has been argued that the Jospice Mattress Imprint was painted and this, too, will be tackled shortly. Such arguments do not help to authenticate the TS and, in my view at least, they distort the truth, like the hypothesis in the link. The more you clutch at straws, the less will you be able to convince sceptics.\nThanks for the link to the video, which I will watch later today and comment on later. Teilhard had foresight, he mingled science with systematic theology because he knew what was to come, more than many other clergymen, but not all questions were answered. Remember that Pope John Paul II said the Shroud takes us to the “mystery of life and death”, but he also criticised what he judged to be Buddhism’s negative soteriology in his book “Crossing the Threshold of Hope”.\nWe cannot sweep the mysterium iniquitatis under the rug, and I am sure you know we are surrounded by it. One can see your efforts to get above it, others don’t even try. When Father Victor White lay dying after a motorcycle accident, Jung could not visit him because he was very old and the doctor’s advice was for him not to travel. But he did write to the priest to tell him that, suffering as he was after the accident, he was now wearing Job’s shoes.\n\n","date":"April 13, 2014 at 4:32 pm","url":"https://shroudstory.com/2014/04/13/another-enduring-belief-question-jesus-in-the-nude/","cat":"art","id":"comment-99039","author":"Louis","site":"shroudstory"},{"title":"Another Enduring Belief Question: Jesus in the Nude","post":"With the exception of the 2-3 depictions listed above I think it’s fair to say that depicting Jesus in the nude was indeed very rare. Even when they tried to copy the shroud they gave him a loin cloth.\n\n","date":"April 13, 2014 at 6:05 pm","url":"https://shroudstory.com/2014/04/13/another-enduring-belief-question-jesus-in-the-nude/","cat":"art","id":"comment-99051","author":"Mike M","site":"shroudstory"},{"title":"Another Enduring Belief Question: Jesus in the Nude","post":"It should be emphasised too that the Shroud displays BUTTOCKS. The nude images referred to above still provide some modesty protection through subtle body positions and perspectives, so that genitals / buttocks (ie. “offensive” body parts) are concealed.\n\n","date":"April 13, 2014 at 10:50 pm","url":"https://shroudstory.com/2014/04/13/another-enduring-belief-question-jesus-in-the-nude/","cat":"art","id":"comment-99087","author":"Thomas","site":"shroudstory"},{"title":"Another Enduring Belief Question: Jesus in the Nude","post":"Interesting that the Holkham Bible ~1330 illustration has a discreet stylised naked Christ, while the loins of the two thieves are draped. Style of crucifixion of the two thieves is also different from the conventional depiction of Christ.\n\n","date":"April 14, 2014 at 4:06 pm","url":"https://shroudstory.com/2014/04/13/another-enduring-belief-question-jesus-in-the-nude/","cat":"art","id":"comment-99283","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Another Enduring Belief Question: Jesus in the Nude","post":"It’s a most curious depiction, isn’t it? Christ appears almost to be suffering from the pox (perhaps this was on the artist’s mind given the time period of the work). The blood spurting from his arms – inspired by the arm stains on the Shroud? Why the nakedness of Christ but modesty cloths for the thieves. A very peculiar piece of art!\n\n","date":"April 14, 2014 at 4:15 pm","url":"https://shroudstory.com/2014/04/13/another-enduring-belief-question-jesus-in-the-nude/","cat":"art","id":"comment-99290","author":"David Goulet","site":"shroudstory"},{"title":"Another Enduring Belief Question: Jesus in the Nude","post":"Actually after looking at the earlier pic of the flagellation, the ‘pox’ are the marks left by the whip — but again it’s interesting that the artist chooses to show a whip with forked endings — which meshes well with the marks on the Shroud. Curiouser and curioser.\n\n","date":"April 14, 2014 at 4:21 pm","url":"https://shroudstory.com/2014/04/13/another-enduring-belief-question-jesus-in-the-nude/","cat":"art","id":"comment-99293","author":"David Goulet","site":"shroudstory"},{"title":"Another Enduring Belief Question: Jesus in the Nude","post":"It’s as if the artist is trying to underline Jesus’ suffering – that it was much greater than the thieves’ suffering – the scars, the wounds, the blood, the naked humiliation\n\n","date":"April 14, 2014 at 8:45 pm","url":"https://shroudstory.com/2014/04/13/another-enduring-belief-question-jesus-in-the-nude/","cat":"art","id":"comment-99362","author":"Thomas","site":"shroudstory"},{"title":"Another Enduring Belief Question: Jesus in the Nude","post":"A thought…I don’t know if this has been discussed before…\nFor the most part paintings of the crucifixion show the side wound on Christ’s right side.\nthe Shroud has got it right – the wound on the right hand side of Christ would correspond with it presenting as if it was on the left hand side of the Shroud (clumsy explanation I’m sorry!)\nA painter / forger would mostly likely have shown it on the other side?   \nCould a medieval forger have been that savvy to show it the way its shown?\n\n","date":"April 14, 2014 at 9:02 pm","url":"https://shroudstory.com/2014/04/13/another-enduring-belief-question-jesus-in-the-nude/","cat":"art","id":"comment-99376","author":"Thomas","site":"shroudstory"},{"title":"Another Enduring Belief Question: Jesus in the Nude","post":"I would think the Genius artisan would have no problem with that since he’s already demonstrated an extraordinary ability to think outside the box of ancient or even 21st century art by producing;\n1- blood flow in 2 different plains( on the cross & on the tomb) as in the side wound and the elbow stain.\n2- blood flowing under different pressures on the forehead (squirting vs seeping)\n3-blood flowing pre-mortem & postmortem.\n4- Chest muscles pulled up as if the hands were raised at death while the hands were depicted in the  lowered position ( to demonstrate how rigor Mortis was broken during burial).\n5- added serum retraction rings to impress his 21st century audience who would appreciate these feature with UV fluorescence photography.\n6- added Jerusalem dirt to impress Kohlbeck and Nitowski’s curiosity.\n7- blood painted first then the body image to impress those future alchemists who would use proteases to see how the fibres look under the blood stains.\nI would say the orientation of the side wound would be no problem whatsoever for such a time traveller artisan.\n\n","date":"April 14, 2014 at 9:43 pm","url":"https://shroudstory.com/2014/04/13/another-enduring-belief-question-jesus-in-the-nude/","cat":"art","id":"comment-99395","author":"Mike M","site":"shroudstory"}]
