[{"title":"Templecombe:  It is almost too exciting to think about.","post":"The Dioceses of Malaga (Spain) is hosting an exhibition on the Shroud in which the Bishop and the Catholic Church, perhaps as never before so clearly, supports the authenticity of the cloth. At the entry of the exhibition there is a sentence by John Paul II written in huge letters: “The truth is to be proposed and not imposed”. \nI think this exhibition is very interesting because due to the important support given by the Catholic Church at all levels, one can conclude that what you see in the exhibition represents at this moment something like a sort of “official position”. That was at least, my personal impression when I visited it in July.\nIn the exhibition, the hypothesis of the templars having the Shroud is clearly supported and the image of this post in England is used to that purpose. In this video of the Malaga exhibition, it can be seen from minute 4:30 onwards. Another argument they provide is that  Geoffroi de Charny , the first known owner of the Shroud of Turin, might be a relative of  Geoffroi de Charney, burned at the stake along with Jacques de Molay in 1314 after the trial against the Templars.\n\n","date":"September 28, 2012 at 5:49 am","url":"https://shroudstory.com/2012/09/28/templecombe-it-is-almost-too-exciting-to-think-about/","cat":"art","id":"comment-17007","author":"Gabriel","site":"shroudstory"},{"title":"Templecombe:  It is almost too exciting to think about.","post":"Or it may have been handed down by Burgundian Othon de la Roche, Seigneur of Athens from 1204, transferred to his home church of St Stephens in Besancon, and handed down his line to his descendant Jeanne de Vergy, widow of Geoffroi de Charny as part of her dowry.\nRefer: BESANÇON AND OTHER HYPOTHESES FOR THE MISSING YEARS: THE SHROUD FROM 1200 TO 1400, by Daniel Scavone, at Ohio shroud Conference 2008;\nhttp://ohioshroudconference.com/papers.htm\nThis theory has rather more going for it than the highly speculative Templar theory, notwithstanding certain questionable documentary claims made by Barbara Frale, Vatican archivist.  Scavone’s criticisms of the Templar theory show that any evidence said to support it is highly speculative.\n\n","date":"September 28, 2012 at 7:03 am","url":"https://shroudstory.com/2012/09/28/templecombe-it-is-almost-too-exciting-to-think-about/","cat":"art","id":"comment-17014","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Templecombe:  It is almost too exciting to think about.","post":"Unfortunately Barbara Frale lost an excellent opportunity raised with her research on the Chinon parchment by distorting other documents, however that does not invalidate the Templar hypothesis.\n\n","date":"September 28, 2012 at 8:40 am","url":"https://shroudstory.com/2012/09/28/templecombe-it-is-almost-too-exciting-to-think-about/","cat":"art","id":"comment-17016","author":"Louis","site":"shroudstory"},{"title":"Templecombe:  It is almost too exciting to think about.","post":"The only thing that Wilson’s Templar hypothesis has going for it are:  the hypothetical genealogy links between the two Geoffrey de Charnys; and the secrecy of the Templar order.  Scavone’s review of Templar confessions obtained under torture throw considerable doubt on the value of those confessions.  Most of the examinees were low down in the order and would not have been privy to any high level Templar secret, and the allegation of an idol head being worshipped was merely an uplift from a similar persecution of the Cathars.  Wilson had asked Frale to confirm her assertions with tokens of evidence, but this was not forthcoming, and raised serious questions of her credibility in the matter.\n\n","date":"September 28, 2012 at 4:14 pm","url":"https://shroudstory.com/2012/09/28/templecombe-it-is-almost-too-exciting-to-think-about/","cat":"art","id":"comment-17033","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Templecombe:  It is almost too exciting to think about.","post":"I tend to lean towards Scavone’s hypothesis on this matter. As you say Dave, Wilson’s hypothesis tends to rely on a ‘very’ hypothetical genealogy and not much else. \nThe only way I see the Templars involvement with the Shroud is that they ‘may have’ been given assignment in the safe delivery of the Shroud (amongst many other relics) back to France. Which is quite plausible considering their standing at the time and the confidence in their abilities in such matters. They were the Fedex or UPS of their time! So it stands quite plausible that they may have had the Shroud in their possession for a short period.\nR\n\n","date":"September 28, 2012 at 11:40 pm","url":"https://shroudstory.com/2012/09/28/templecombe-it-is-almost-too-exciting-to-think-about/","cat":"art","id":"comment-17043","author":"Ron","site":"shroudstory"},{"title":"Templecombe:  It is almost too exciting to think about.","post":"Interesting, daveb.  I’ll have to read that paper from the Ohio Conference.  Thanks.\n\n","date":"September 28, 2012 at 7:37 pm","url":"https://shroudstory.com/2012/09/28/templecombe-it-is-almost-too-exciting-to-think-about/","cat":"art","id":"comment-17038","author":"Andy Weiss","site":"shroudstory"},{"title":"Templecombe:  It is almost too exciting to think about.","post":"One deposition mentioned that Baphomet had two heads and four legs, so was that really the “demon” or the Turin Shroud? It is likely that the secrecy was maintained because such an important relic was stolen during the Fourth Crusade, in which the Knights Templar took no part, although they had spies in the area. If de Molay was worshipping Baphomet he wouldn’t go to discuss plans for a new crusade with the Pope (in Avignon), and he also wanted to raise morale among the knights after the fall of Acre. But Philip le Bel (who had been cruel to Boniface VIII), and whose treasury was empty, laid a nice trap for de Molay.\n\n","date":"September 29, 2012 at 12:38 pm","url":"https://shroudstory.com/2012/09/28/templecombe-it-is-almost-too-exciting-to-think-about/","cat":"art","id":"comment-17057","author":"Louis","site":"shroudstory"}]
