[{"title":"The Art of the Impossible?","post":"Ok, from a history of art perspective it is ludicrous, but is there any perspective from which it is not ? forensic pathology ? blood stains ? textile ? image ? pollens ? minerals ? …\n\n","date":"February 25, 2013 at 8:24 am","url":"https://shroudstory.com/2013/02/25/the-art-of-the-impossible/","cat":"art","id":"comment-25601","author":"anoxie","site":"shroudstory"},{"title":"The Art of the Impossible?","post":"That is an excellent concise statement and one DeWesselow, as an art historian would completely agree with.  Well said.\n\n","date":"February 25, 2013 at 9:15 am","url":"https://shroudstory.com/2013/02/25/the-art-of-the-impossible/","cat":"art","id":"comment-25605","author":"Russ Breault","site":"shroudstory"},{"title":"The Art of the Impossible?","post":"Indeed!!! And this is why we can be 99% certain that the shroud is not a scorch, photograph or painting.\n\n","date":"February 25, 2013 at 9:57 am","url":"https://shroudstory.com/2013/02/25/the-art-of-the-impossible/","cat":"art","id":"comment-25614","author":"Paulette","site":"shroudstory"},{"title":"The Art of the Impossible?","post":"I think a question we ought to ask of a knowledgeable art historian is “Can you think of any example of a piece of art that appears unrelated to any other work of its time and region?”\nIf every other masterpiece known to man fits at least somewhat into a context, then the exceptional quality of the shroud would be truly exceptional, but if there are other examples, from other times and places, of works without an artistic context, then the mere fact of exceptionality becomes… er… less exceptional, if you see what I mean!\n\n","date":"February 25, 2013 at 11:44 am","url":"https://shroudstory.com/2013/02/25/the-art-of-the-impossible/","cat":"art","id":"comment-25635","author":"Hugh Farey","site":"shroudstory"},{"title":"The Art of the Impossible?","post":"Reminder: the Turin Shroud as bloodied contact relic is first and foremost related not only to the Oviedo Sudarium but also to the Holy Headdress of Cahors, the Argenteuil Tunic and the Manoppello Veil face (in my opinion the latter is the Holy Face of the Holy Mandylion and  the Roman Veronica Sudarium II). \nThe fact is the latter does combine two types of object: a bloodied contact relic and (through clever enhancement) a dying (from the verb ‘to dye’) masterpiece.\n\n","date":"February 25, 2013 at 12:35 pm","url":"https://shroudstory.com/2013/02/25/the-art-of-the-impossible/","cat":"art","id":"comment-25645","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Art of the Impossible?","post":"Max: “Manoppello Veil face (in my opinion the latter is the Holy Face of the Holy Mandylion and the Roman Veronica Sudarium II)”  \nIf you’re not already aware of it I suggest you check out comprehensive article: “The Veil of Manoppello: work of art or authentic relic?”  by Roberto Falcinelli, 2005.\nhttp://www.shroud.com/pdfs/roberto.pdf   \nExtract from ‘Conclusion’:  “I believe we are not talking about an acheropite image, but rather a 16th century painting, that the Veil of Manoppello is the very portrait given by Dürer to Raphael, as it is known in the bibliography and believed missing. … … As Vasari wrote, the painter received Dürer’s portrait as a gift after Raphael’s death. He had met Raphael in Mantua while working at the court of the Gonzaga. We also know that after Giulio Romano’s death his children sold some of their father’s drawings to the antique dealer Jacopo Strada. Could the veil have been among those objects? The missing link is now to find out how this veil could have ended up in Manoppello from Mantua.” Body of the paper contains extensive review of various authoritative references.  \nAny comment?\n\n","date":"February 25, 2013 at 4:53 pm","url":"https://shroudstory.com/2013/02/25/the-art-of-the-impossible/","cat":"art","id":"comment-25670","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Art of the Impossible?","post":"Thomas de Wesselow, though a Medieval Art Historian, is wrong to presupposing/(nearly) thinking, the Manoppello Veil is only 16th c. CE (he wrote: “Manopello Veil 16th c.?). How can he ignores, for instance,the Master of Flémalle’s Saint Veronica (Städel Museum, Frankfurt am Main), is just beyond me…\n\n","date":"February 25, 2013 at 12:46 pm","url":"https://shroudstory.com/2013/02/25/the-art-of-the-impossible/","cat":"art","id":"comment-25648","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Art of the Impossible?","post":"Typo: how can he ignore\n\n","date":"February 25, 2013 at 12:49 pm","url":"https://shroudstory.com/2013/02/25/the-art-of-the-impossible/","cat":"art","id":"comment-25649","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Art of the Impossible?","post":"To Dave: Thank you for the link. Here are my comments:\nTo answer Falcinelli’s question (“The Veil of Manoppello: work of art or authentic relic?”), I would say it is BOTH. My opinion actually is it is a mussel silk veil that most probably was ingeniously  dyed with natural rust and grey lead very fine powder mixed with water + ammonia present in human sweat. It was meant to complete/enhance pre-existing blood stains and facial pressure imprint left on a genuine burial relic of Yeshua: the byssus sudarium that was placed and pressed on top of the Sindon enshrouding his head on burial. (This “sudarium” shall not be mistaken for two other famous sudarii namely the pre-burial Sudaruim of Oviedo and the skull cap/headdress of Cahors).\nI challenge Falcinelli (and anybody) to try and demonstrate/convince any Art Historian worth his salt that the present official Veronica is the same relic that became popular in 1208 when Innocent III chose to have the Veronica processed in a reliquary of gold, silver and gems through the streets of Rome. The Veronica Veil II disappeared/was stolen during Charles V’s “sack” of Rome in 1527 CE and unofficially resurfaced in Manoppello in 1608 CE.\nFalcinelli claimed it is ‘a 16th c. painting’a and, what is more, the self-portrait which Dürer then gave to Raphael and « painted in water-colours, on byssus, so fine that it was transparent, and finished without using white lead, the fabric itself serving for the whites and the fine threads being used to represent the hairs of the beard/to form the lights of the picture, and when held up to the light it was transparent all over ». If so, could Falcinelli answer the following questions :\n0/How can the written source (Vasari) he relies on tells it is a self-portait by Dürer and then, « on Falcinelli’s personal careful iconographic analysis », the painting turned out to be a self-portrait by Raphael ? This is rather confusing if not suspect to say the least.\n1/Can he forensically and conclusively demonstrate the Durer’s and Manopello Veil Man’s features perfectly match ?\n2/ How could Dürer have “painted” it when already ca 1430 CE (i.e. more than a century and half beforehand), the Master of Flémalle had already painted the same Manoppello Veil aka Veronica on oakwood?\n4/How could Dürer have “painted” the Face “in” the Manoppello Byssus Veil when marine Byssus/mussel silk definitely just cannot be painted but only dyed?\n5/Does he know of any other similar piece of art be still extant?\nRe conclusive material identification of ManoppelloVeil with pre-1527 Rome Veronica, true material facts are still to be fully cross-investigated namely\n– the very Veronica reliquary of the 1350 Jubilee, with its broken glass panes still preserved in St. Peter’s treasure as it was reported (by Dobschütz) to still retain in its very frame a piece of transparent cloth.\n– the  piece of glass (reported by Pfeiffer) to still stuck on the veil.\n\n","date":"February 25, 2013 at 8:40 pm","url":"https://shroudstory.com/2013/02/25/the-art-of-the-impossible/","cat":"art","id":"comment-25687","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Art of the Impossible?","post":"Typo: to be still stuck on the veil\n\n","date":"February 25, 2013 at 8:43 pm","url":"https://shroudstory.com/2013/02/25/the-art-of-the-impossible/","cat":"art","id":"comment-25688","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Art of the Impossible?","post":"Correction: I meant Gero von Wilpert (not Ernest von Dobschütz\nAddendum: In 1997, I was allowed by the Friar Capuchin curator, to examine and study “face to face” the Holy Face of the Veil of Manoppello for more than an hour (both in naturally transmitted light outside the church and at macrographic level through the glass panes).\nI then jotted down aso bservations: « the presence of a “preparatory mordanting” as outline to be dyed in grey lead is noteworthy and is how an artist would have worked. Most likely the Veil is authentic (as burial relic placed over TS enshrouding the head and pressed and fastened via a skull-cap on top) but most likely affected by a Late Antique or High/Central Medieval touch-up » (my translation from French).\n\n","date":"February 26, 2013 at 9:05 am","url":"https://shroudstory.com/2013/02/25/the-art-of-the-impossible/","cat":"art","id":"comment-25725","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Art of the Impossible?","post":"Additional correction (Oops) : read « German Jesuit art historian, Joseph Wilpert » (and not « Gero von Wilpert »)\n+ Addendum: the Veil having been trimmed in the early 1600’s by the Capuchin monk, Father Clemente, is there any hope to recover the cut hanging threads in order to analyse and C14 date them? Were they kept or trashed? And if ever kept by whom and where?\n\n","date":"February 26, 2013 at 11:01 am","url":"https://shroudstory.com/2013/02/25/the-art-of-the-impossible/","cat":"art","id":"comment-25740","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Art of the Impossible?","post":"++ Addendum: the risk would be to open the Manoppello Veil monstrance as the latter has not been opened since the vey day it was put between the two glass panes i.e. since the first mid-17th C.E.\n\n","date":"February 26, 2013 at 4:31 pm","url":"https://shroudstory.com/2013/02/25/the-art-of-the-impossible/","cat":"art","id":"comment-25760","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Art of the Impossible?","post":"The risk being the relic just turns into…dust.\n\n","date":"February 26, 2013 at 4:34 pm","url":"https://shroudstory.com/2013/02/25/the-art-of-the-impossible/","cat":"art","id":"comment-25761","author":"Max Patrick Hamon","site":"shroudstory"}]
