[{"title":"The Awesome Shroud-based Art of Juan Manuel Miñarro Lopez","post":"He is some kind of artist.\n\n","date":"December 30, 2014 at 8:32 pm","url":"https://shroudstory.com/2014/12/30/the-awesome-shroud-based-art-of-juan-manuel-miarro-lopez/","cat":"art","id":"comment-180149","author":"Andy","site":"shroudstory"},{"title":"The Awesome Shroud-based Art of Juan Manuel Miñarro Lopez","post":"Estimado Dan:\nIba a escribir en mi blog un post sobre el escultor Juan Manuel Miñarro….¡ y te me has adelantado!.\nEl Prof. Miñarro es un gran experto en la imagen del Hombre de la Sábana y en el Sudario de Oviedo.\nPosee un profundo conocimiento de la Anatomía y es asesorado por médicos especialistas en distintas disciplinas (medicina forense, dermatología, traumatología, etc), si bien tiene un criterio propio gracias al estudio durante varios años de todo lo que se ha escrito desde la patología forense sobre el Hombre de la Sábana .\nReune así dos condiciones que hacen su trabajo realmente excepcional, la de ser un gran artista y la tener un gran conocimiento científico.\nEn estas magníficas fotografias puede observarse su manera de trabajo:\nhttp://www.lahornacina.com/noticiasminarro39II.htm \nY en este artículo con extraordinarias fotografías:\n“Explicación médico-forense del Hombre de la Sábana”. Juan Manuel Miñarro López.\nhttp://www.lahornacina.com/articulosminarro.htm  \n¡No dejes de verlos!\nCarlos\n\n","date":"December 30, 2014 at 10:31 pm","url":"https://shroudstory.com/2014/12/30/the-awesome-shroud-based-art-of-juan-manuel-miarro-lopez/","cat":"art","id":"comment-180186","author":"Carlos","site":"shroudstory"},{"title":"The Awesome Shroud-based Art of Juan Manuel Miñarro Lopez","post":"Google Translation: I would write in my blog post about the sculptor Juan Manuel Miñarro … .¡ and you’ve passed me !.\nProf. Miñarro is an expert in the image of the Man of the Shroud and the Sudarium of Oviedo.\nHas a thorough knowledge of anatomy and is advised by medical specialists in different disciplines (forensic medicine, dermatology, orthopedics, etc), but has its own criteria by studying for several years all that has been written from the forensic pathology the Man of the Shroud.\nAnd meets two conditions that make her truly exceptional work, being a great artist and have a great scientific knowledge.\nIn these magnificent photographs can be seen how they work:\nhttp://www.lahornacina.com/noticiasminarro39II.htm\nAnd in this article with extraordinary photographs:\n“Medico-legal Explanation of Man of the Shroud”. Juan Manuel Lopez Miñarro.\nhttp://www.lahornacina.com/articulosminarro.htm\nDo not let them!\n\n","date":"December 31, 2014 at 4:35 am","url":"https://shroudstory.com/2014/12/30/the-awesome-shroud-based-art-of-juan-manuel-miarro-lopez/","cat":"art","id":"comment-180255","author":"Dan","site":"shroudstory"},{"title":"The Awesome Shroud-based Art of Juan Manuel Miñarro Lopez","post":"Google’s characteristic problems with negatives at its most misleading.\n“¡No dejes de verlos!” means “Do not fail to look at them!”\nBoth are well worth the study. For English speakers, do not click on the link, but type it into the Google search box and then click on ‘Translate this page,’ which gives you a reasonable translation (give or take a negative or two!).\n\n","date":"December 31, 2014 at 5:07 am","url":"https://shroudstory.com/2014/12/30/the-awesome-shroud-based-art-of-juan-manuel-miarro-lopez/","cat":"art","id":"comment-180264","author":"Hugh Farey","site":"shroudstory"},{"title":"The Awesome Shroud-based Art of Juan Manuel Miñarro Lopez","post":"I have found the following translation\n(for “¡No dejes de verlos!”):\n“Do not let see them!”.\n— —\nExcuse me, I think we can try to do something even playing with the kids …\nLook, for example, how to create a portrait of Jesus, starting from\nthe proper processing of a photo of the Shroud.\nCreate your portrait starting from the Man of the Shroud!\nYou just need a photo to start from and then follow the instructions step by step\nLink: http://www.quercettiart.it/en/\nI think that instead of using the supplied color could draw different shades more suitable, but from satisfactory basis (ie: appropriate shades of brown, gray and black, blood red, etc.).\n So we should ask (for 2015) that the publisher publishes a game specifically to coincide with the exhibition of the Shroud.\n I see that what seems too elaborate, then (before leaving with requests, perhaps strange …) it would be better to observe what results are achieved with what is already available now.\n I believe that any of our readers can develop a better idea, maybe doing the tests (crafts) with bits of charred linen soiled linens and a blood-red appropriate, indelible …\nExcuse me if once again I ended up quite off-topic …\n\n","date":"December 31, 2014 at 9:57 am","url":"https://shroudstory.com/2014/12/30/the-awesome-shroud-based-art-of-juan-manuel-miarro-lopez/","cat":"art","id":"comment-180304","author":"piero","site":"shroudstory"},{"title":"The Awesome Shroud-based Art of Juan Manuel Miñarro Lopez","post":"I would like if someone can give me contac number or email of mr. Juan Manuel Miñarro. His artistic feeling is remarkable and uniqe.\n\n","date":"August 2, 2015 at 9:34 am","url":"https://shroudstory.com/2014/12/30/the-awesome-shroud-based-art-of-juan-manuel-miarro-lopez/","cat":"art","id":"comment-207268","author":"Tome","site":"shroudstory"}]
