[{"title":"The Enthronement of Otto III","post":"I guess an alternative explanation might be that it is not a shroud but a banner, or maybe a very long scroll.\nThe image is much clearer when you see it in a plate in a book, and when seen in better resolution it looks more like a cloth with folds and undulations than a paper scroll\n\n","date":"August 3, 2013 at 9:08 am","url":"https://shroudstory.com/2013/08/03/the-enthronement-of-otto-iii/","cat":"art","id":"comment-40341","author":"Matthias","site":"shroudstory"},{"title":"The Enthronement of Otto III","post":"Matthias, 100% agreed all the more so as the Turin Shroud image SHOULD be read in the light of the Book/Scroll of Revelation archaeopareidoliac visions.\n\n","date":"August 3, 2013 at 11:34 am","url":"https://shroudstory.com/2013/08/03/the-enthronement-of-otto-iii/","cat":"art","id":"comment-40348","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Enthronement of Otto III","post":"While it could be the Shroud, it could be Scripture or the roll of those names in the ‘book of life’, etc.\n\n","date":"August 3, 2013 at 12:11 pm","url":"https://shroudstory.com/2013/08/03/the-enthronement-of-otto-iii/","cat":"art","id":"comment-40351","author":"Andy Weiss","site":"shroudstory"},{"title":"The Enthronement of Otto III","post":"On May 22, 2013 at 11:27 am | #32: I wrote:\nRe Revelation in conjunction with the four living creature and a herring-bone weave patterned cloth, here is a reminder of two artefacts either carved in alabaster or pen & ink drawn:\n1/ the (4th ?) 6th century CE Mark’s cathedra/throne (kept in Venice), a 3D alabaster replica at reduced scale of the Hetoimassia (or relic-throne of the “Preparation” to the Second Coming of Christ). Hetoimassia, literally “preparation”, meaning “that which has been prepared” or “that which is made ready”, specifically refers to the “sign of the Son of Man” and his return at the Last Judgement. On much older photographs, we clearly can see the eight, five and three beatitude eight-armed star constellations of Heaven/Paradise (also see the Templecombe panel) in conjunction with the ‘Tetramorph’ (the four living creatures) on the back, right and left sides of the throne and the four Evangelists two by two flanking a herring-bone weave patterned cross in the medallion on top. On its upper front the sacrificial Lamb appears central to both the Tree of Life and the four rivers of Paradise/Heaven.On the lower lateral and back sides can be seen a diamond-shaped trellis pattern evocative of that of the reliquaries of the Holy Face of the Holy Mandylion/Keramidion or Keramion/Sindon tetradiplon or Hemation.\n2/ The same herrring-bone pattern also appears in conjunction with a veil & a full length portrait of Christ and the ‘Tetramorph’ (the for living creatures) in a last quarter of the 8th century CE missal miniature from the Echternach Abbey (founded in 698 CE as a Benedictine monastery by St. Willibrord, an English monk).The pen & ink drawing/miniature was made by an 8th c. CE benedictine artist & scribe monk named Thomas.\nOn May 22, 2013 at 11:41 am | #33, I also wrote:\n“In the famous 12th c. CE Pray Codex benedictine ink & pen drawing, the “a” can refer BOTH to anastasia, “resurrection” and apocalipsis, “revelation” in conjunction with a herring-bone patterned cloth.”\n\n","date":"August 3, 2013 at 12:46 pm","url":"https://shroudstory.com/2013/08/03/the-enthronement-of-otto-iii/","cat":"art","id":"comment-40352","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Enthronement of Otto III","post":"Additional reminder: On July 23, 2012 at 6:14 am | #9, I also wrote:\n“Well before the Pray codex (1192-1195 CE), the liturgical embroidered silk cloth known as the Epitaphios (threnos) of Thessaloniki (ca 1300 CE), that of Venice (ca 1200 CE), or the Lirey Pilgrimage leaden badge (1370-1390 CE), I hold the cathedra of Saint Mark (4th ?- 6th century CE) with the herring bone pattern on the front and in the medallion on top to be the earliest iconographic testimonial of Yeshua’s zigzag weave patterned burial cloth.”\n\n","date":"August 3, 2013 at 12:58 pm","url":"https://shroudstory.com/2013/08/03/the-enthronement-of-otto-iii/","cat":"art","id":"comment-40353","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Enthronement of Otto III","post":"Someone with an extremely large ego.  Not a shroud only something to confuse you towards  Otto’s personality cult.\n\n","date":"August 3, 2013 at 3:09 pm","url":"https://shroudstory.com/2013/08/03/the-enthronement-of-otto-iii/","cat":"art","id":"comment-40355","author":"Emmett McMahon","site":"shroudstory"},{"title":"The Enthronement of Otto III","post":"I’m doubtful it’s meant to be the Shroud because if it was — why wouldn’t the artist have made some imprint on the cloth? There was no need for the artist to disguise the Shroud in the image – to the contrary an overt representation would have been applauded by its subject. \nThe fact that the cloth is unmarked is significant. Had there been any markings at all it would be more likely to be the Shroud. One could make the argument that the figure on the bottom is Atlas more convincingly than the cloth is the Shroud.\nThat’s my two cents anyway.\n\n","date":"August 3, 2013 at 4:26 pm","url":"https://shroudstory.com/2013/08/03/the-enthronement-of-otto-iii/","cat":"art","id":"comment-40364","author":"David Goulet","site":"shroudstory"},{"title":"The Enthronement of Otto III","post":"Despite its appearance, I’m inclined to doubt the object being a representation of the Shroud. Otto III was crowned Emperor in Rome in 996, when the Shroud would be virtually unknown as such in the West. He had planned to recreate the glory and power of the ancient Roman Empire in a universal Christian state governed from Rome, in which the pope would be subordinate to the Emperor in religious as well as secular affairs. Heeding an appeal from Pope John XV in suppressing a rebellion by the Roman noble Crescentius, Otto had crossed the Alps but by the time of his arrival in Rome, the pope had died. Otto then secured the election of his 23 year old cousin Bruno of Carinthia as Gregory V, the first German pope, who then crowned Otto as emperor. \nIn making Rome his official residence and administrative centre of the Empire, Otto instituted elaborate Byzantine court ceremonies, and revived ancient Roman customs, as well as assuming certain religious titles for himself. This may suggest some acquaintance with Byzantium, and hence the possibility of some knowledge of the Byzantine relics, but to link this with the Shroud would seem tenuous. \nGregory V died in 999, whereupon Otto installed his former tutor Gerbert of Aurillac pope, as Sylvester II. Sylvester a pre-eminent scholar, was every bit a match for Otto. He had been trained in Spain, and it was largely due to him whereby Arabic learning was transmitted to the West, including the first use of Hindu-Arabic numerals, an interesting enough subject in itself. Gerbert himself is a fascinating figure, being the foremost and dominating figure of the 10th century for modern scholars. Gerbert’s legacy includes his political roles; his teaching in logic, dialectics, mathematics and astronomy; his transmssion of Arabic learning; his relations with Otto III; his papacy; and his influence on later ages.\n\n","date":"August 3, 2013 at 5:15 pm","url":"https://shroudstory.com/2013/08/03/the-enthronement-of-otto-iii/","cat":"art","id":"comment-40374","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Enthronement of Otto III","post":"Even if this was really the Shroud of Jesus, that would not prove anything regarding the authenticity of the Shroud of Turin since this representation doesn’t show any bloodstains and/or body image.  So, even if this is truly meant to represent the Shroud that we find in the Gospel, this proves nothing about the authenticity of the one kept in Turin.  That would only prove that some ancient artists would have wanted to represent the Shroud in which Christ was buried according to the Gospel accounts…  No more.\n\n","date":"August 3, 2013 at 6:40 pm","url":"https://shroudstory.com/2013/08/03/the-enthronement-of-otto-iii/","cat":"art","id":"comment-40382","author":"Yannick Clément","site":"shroudstory"},{"title":"The Enthronement of Otto III","post":"some thoughts,noting I am not wedded to the idea it is the shroud: the object looks much more like a cloth than a scroll.AS I said earlier it’s a bit hard to make out on the poor resolution image.In the book ‘medieval art’ the author called it a long white cloth. Regarding the lack of image on it,I don’t see that as problematic,if the artist was juat wanting to depict the cloth.There are several possible explanations why the image might not have been shown. DaveB – Otto III was born in Constantinople,and his mother was from  there.He was born after the mandylion / shroud arrived there.Given his power and connections to Constantinople, and assuming the awe that the shroud might have held,why not have it brought to his\n enthronement in Rome. Look,maybe this is not a convincing argument,but if we assume it is a very long cloth ans nor a sceoll,then what is the cloth if not the\n\n","date":"August 3, 2013 at 8:15 pm","url":"https://shroudstory.com/2013/08/03/the-enthronement-of-otto-iii/","cat":"art","id":"comment-40393","author":"matthias","site":"shroudstory"},{"title":"The Enthronement of Otto III","post":"if we assume it is a very long cloth and not a scroll,what is it if not the shroud?\n\n","date":"August 3, 2013 at 8:33 pm","url":"https://shroudstory.com/2013/08/03/the-enthronement-of-otto-iii/","cat":"art","id":"comment-40394","author":"matthias","site":"shroudstory"},{"title":"The Enthronement of Otto III","post":"Yannick I disagree. I cannot see why the artist would want to show a shroud unless it had a relic status. Through the history of art no special status is ascribed to the cloths,they are usually just depicted lying around the empty tomb. As to this painting’s significance if it is the shroud…well it would be another piece of evidence debunking the carbon dating\n\n","date":"August 3, 2013 at 8:40 pm","url":"https://shroudstory.com/2013/08/03/the-enthronement-of-otto-iii/","cat":"art","id":"comment-40395","author":"matthias","site":"shroudstory"},{"title":"The Enthronement of Otto III","post":"The artist could have simply wanted to represent the Shroud of Christ that we found described in the Gospel or maybe he wanted to represent the relic known as the Shroud of Christ that was kept in Constantinople.  But since there is no bloodstain and no body image on his representation, how can we be certain that this represent the same shroud as the one in Turin?  And concerning my second hypothesis (the artist would have wanted to represent the Shroud of Christ that was kept in Constantinople), it should be noted that such an idea is somewhat problematic in the light of the historical facts.  Effectively, the first mention of a Shroud of Christ (here, I’m not talking about the Mandylion who arrived in that city in 944 and who was a small cloth showing only the face of the living Christ, which had nothing to do with a burial cloth of Christ) being kept as a relic of Jesus’ burial cloth in Constantinople only dates from the end of the 11th century and not from the very beginning of that century, like the painting you showed us.  And it is also problematic in the light of the testimony of a monk that dates from around the same time of this painting (around 1000 A.D.) and who claimed having seen the Shroud of Christ while visiting the city of Jerusalem!  But, nevertheless, even if around the year 1000 A.D., the Shroud was still kept in Jérusalem instead of Constantinople, it is still possible to think the artist who did the painting wanted to represent this great relic of Christ…  But again, because there’s no bloodstain and no body image on it, it is impossible to know if this cloth is the same as the one kept now in Turin.\nMy personal feeling about this white cloth represented in this painting:  It is probably another kind of cloth than a burial shroud and such a cloth seemed to have been associated with the kingship of Otto and not with Jesus Christ…\n\n","date":"August 4, 2013 at 8:00 pm","url":"https://shroudstory.com/2013/08/03/the-enthronement-of-otto-iii/","cat":"art","id":"comment-40454","author":"Yannick Clément","site":"shroudstory"},{"title":"The Enthronement of Otto III","post":"Matthias: “Otto III was born in Constantinople,and his mother was from there. He was born after the mandylion / shroud arrived there.”\nI now think this is quite a significant point, and after looking into the matter further, I think this may change the odds considerably towards the cloth quite possibly being a representation of the Shroud. \nThe whole Ottonian period is a fascinating time for Europe, beginning with Otto I the Great. After securing the German Reich against various rival aspirants, Otto I was summoned to Italy by the Burgundian princess Adelaide, the widowed queen of Italy, married her and assumed the title of king of the Lombards. Having dealt with a Magyar uprising, he was summoned to Italy a second time, by Pope John XII, and was crowned as Emperor in 962.  He had by then procured the election of his 6 year old son Otto II as king of Germany. He extended the temporal power of the pope, but having deposed John XII in 963. obtained a proviso that the emperor was to ratify papal elections. \nTurning now to the marriage of Otto II with the Byzantine princess Theophanu in 972: She is not to be confused with Theophano, the widow of the incapable ruler Romanos II, son of Constantine Porphyrogenitus who had minted coins showing Shroud-like facial images of Christ. The Mandylion had arrived in Constantinople from Edessa in 944. In order to promote her sons as the hereditary rulers of Constantinople, Theophano subsequently married Nikephoros II Phokas and served as regent during her sons minority. Theophanu has been suggested as the fourth child of Theophano and Romanos II, but current research holds that her mother was Sophia Phokaina, niece of Nikephoros II. \nBe all that as it may, it suggests that Theophanu, wife of Otto II, and mother of Otto III would have been suffiently connected with the Byzantine court to appreciate the true nature of the imperial relic collection, whatever that might have comprised. Otto II was declared emperor upon Otto I’s death in 1973, himself dying in 983 while attempting to bring Venice under imperial control.    \nWhether Otto III was in a position to learn of the Shroud’s existence, or of its true significance, from his mother Theophanu, can only be a matter of conjecture, whether or not he knew of the cloth’s image.  However the question of whether or not the cloth in his coronation picture is intended to represent the Shroud, becomes I think just a little more plausible and tantalising.\n\n","date":"August 4, 2013 at 2:17 am","url":"https://shroudstory.com/2013/08/03/the-enthronement-of-otto-iii/","cat":"art","id":"comment-40408","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Enthronement of Otto III","post":"Yannick, I take your point about it being hard to judge whether the long white line cloth in the image is meant to depict the Shroud.\nIn the absence of an image of Christ on it, it is perhaps impossible to corroborate, unless some written record was found that provided further evidence.\nHowever, it is difficult to think as to what the cloth might be if it is not the shroud. As stated earlier, Christ’s burial clothes do not have any status in art history in terms of iconic symbology, unless they are viewed as the shroud.As I said earlier it doesn’t look like a scroll at all – if it looked like a scroll then conceivably it could be a scroll pronouncing Otto III’s enthronement and status as ruler.\nI doubt it is a scroll that happens to look like a cloth.\nI also doubt that it could be a cloth that is not the shroud. What long, white cloth might have such symbolic status?  Any suggestions appreciated.\nOn balance I think the cloth probably IS the shroud, but I will admit it would seem – without further supporting evidence – hard or impossible to prove.\nBTW DaveB – it looks like a kiwi on his belly!\n\n","date":"August 5, 2013 at 4:10 am","url":"https://shroudstory.com/2013/08/03/the-enthronement-of-otto-iii/","cat":"art","id":"comment-40483","author":"Matthias","site":"shroudstory"},{"title":"The Enthronement of Otto III","post":"OK, I’ve done some further research and I now think that although it looks like a cloth rather than a scroll, it is probably a scroll. This good paper shows repreated evidence of the evangelists symbolised as animals holding scrolls representing the gospels, which at times look cloth-like in texture:\nhttp://www.google.com.au/url?sa=t&rct=j&q=evangelists%20symbol%20otto%20iii&source=web&cd=1&cad=rja&ved=0CCoQFjAA&url=http%3A%2F%2Fperegrinations.kenyon.edu%2Fvol3_1%2Fcurrent%2FGarrison_Otto_III_at_Aachen.pdf&ei=02L_UYnxMauYiAfhn4C4AQ&usg=AFQjCNF3lxu4S0QL4-P1p_EowwjbDxoN1w\n\n","date":"August 5, 2013 at 4:34 am","url":"https://shroudstory.com/2013/08/03/the-enthronement-of-otto-iii/","cat":"art","id":"comment-40484","author":"Matthias","site":"shroudstory"},{"title":"The Enthronement of Otto III","post":"I think your deduction is quite logical Matthias.  My best guess was that this “cloth” had something to do with the kingship of Otto, even though I had noticed the 2 animals as being probably symbolical figures of the Gospel writers…  But now that you talk about a scroll instead of a cloth (something I didn’t thought), I think it’s a very good conclusion on your part.  I agree with you.\n\n","date":"August 5, 2013 at 10:38 am","url":"https://shroudstory.com/2013/08/03/the-enthronement-of-otto-iii/","cat":"art","id":"comment-40498","author":"Yannick Clément","site":"shroudstory"},{"title":"The Enthronement of Otto III","post":"Note:  I truly don’t think that this scroll or cloth had anything to do with the Shroud of Turin…  I was already thinking this yesterday and now, it’s even more clear in my mind.\n\n","date":"August 5, 2013 at 10:39 am","url":"https://shroudstory.com/2013/08/03/the-enthronement-of-otto-iii/","cat":"art","id":"comment-40499","author":"Yannick Clément","site":"shroudstory"},{"title":"The Enthronement of Otto III","post":"Actually, this is BOTH a cryptic symbolic representation of Yeshua’s long Shroud unfolded and an unrolled scroll in conjunction with the four living creatures and Otto’s throne.\nThe latter is the image of Otto seated on a throne as Christ-like ruler of the world.\nThe M-like shape of the long shroud-like scroll or scroll-like long shroud stands for ‘Maiestas (Domini)’.\nIn the Santa Pudenziana apex mosaic, the Christ in Majesty is also featured surrounded above by the four living creatures and seated on a throne with a 110-111cm wide cloth (= Turin Shroud width before the 2002 restoration ) as backdrop for his torso. His face and TS face are exactly at scale one and almost perfectly overlapped. Both faces are equally slightly off-centered on the left.\n\n","date":"August 5, 2013 at 8:08 am","url":"https://shroudstory.com/2013/08/03/the-enthronement-of-otto-iii/","cat":"art","id":"comment-40491","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Enthronement of Otto III","post":"Max,you may be right.\n\n","date":"August 5, 2013 at 8:13 am","url":"https://shroudstory.com/2013/08/03/the-enthronement-of-otto-iii/","cat":"art","id":"comment-40492","author":"matthias","site":"shroudstory"},{"title":"The Enthronement of Otto III","post":"Cryptic? An artist encrypts something usually to hide it from an authority (i.e. Book of Revelation). What is the motivation here for encrypting anything? Who was the encryption intended for?\n\n","date":"August 5, 2013 at 10:49 am","url":"https://shroudstory.com/2013/08/03/the-enthronement-of-otto-iii/","cat":"art","id":"comment-40500","author":"David Goulet","site":"shroudstory"},{"title":"The Enthronement of Otto III","post":"David, \n‘Cryptic’ here just means it is no easy task to interpret a 10th century CE image for a 20th-21st century CE observer who is not trained in the Art of interpreting. Medieval Artists used to recurred  to images and symbolic ‘bypasses’ then that are neither  that readable at first sight nor even obvious in the eyes of educated people nowadays, some scholars included.\n\n","date":"August 5, 2013 at 12:50 pm","url":"https://shroudstory.com/2013/08/03/the-enthronement-of-otto-iii/","cat":"art","id":"comment-40511","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Enthronement of Otto III","post":"Reminder for Matthias et al: \nbesides the Turin Shroud and even longer ‘shroud’ was kept as early as the mid-9th century in a monastery that became an Imperial abbey that received three christic relics: the loincloth, ‘the shroud’ and the ‘sudarium’.\nShort history: In the year 875, half of ‘the shroud’ was exchanged for a relic of the head of the martyred Pope Cornelius, after which the abbey was known as Sancti Cornelii ad Indam, and later as Kornelimünster. \nThe true fact is the so-called Kornelimuenster ‘sudarium’/napkin , which is made of byssus (and thus do not absorb any liquid whatsoever) shows no blood stains and is a more than 8 meter long piece of cloth, folded in no less than 16 layers and reduced to the size of a ‘sudarium’.\nHence, the the long shroud could ALSO refer to the Kornelimuenster ‘sudarium’/’napkin’ once unfolded.\n\n","date":"August 5, 2013 at 9:00 am","url":"https://shroudstory.com/2013/08/03/the-enthronement-of-otto-iii/","cat":"art","id":"comment-40496","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Enthronement of Otto III","post":"Whatever the relic it refers to here, it could be seen as a christic attribute of Otto III as ruler of the world and the sign of his divine election in conjunction with the hand of G.od (not that  of man).\n\n","date":"August 5, 2013 at 9:07 am","url":"https://shroudstory.com/2013/08/03/the-enthronement-of-otto-iii/","cat":"art","id":"comment-40497","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Enthronement of Otto III","post":"Correction (see my post on August 5, 2013 at 8:08 am | #19\nReply | \nActually,  the Santa Pudenziana apex mosaic Christ face (in conjunction with the 110-112cm wide cloth at the back of the throne) and the Turin Shroud face (standing out on the 111-117cm wide linen fabric) are BOTH about 3cm off-centered on the RIGHT\n\n","date":"August 7, 2013 at 5:15 am","url":"https://shroudstory.com/2013/08/03/the-enthronement-of-otto-iii/","cat":"art","id":"comment-40626","author":"Max Patrick Hamon","site":"shroudstory"}]
