[{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Ah,but despite those authentic-lookiing sepia tones, Dan, your image that accompanies this posting is a negative -> positive modern-era enhancement, and not what would have been seen centuries ago, either on the full Shroud or a framing of the head alone (Mandylion).\nTry this one instead. (Not quite so photogenic, eh, if you will pardon the anachronistic expression?):\n original negative image \n\n","date":"February 15, 2012 at 10:02 am","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8288","author":"colinsberry","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Colin; Even in your link, remember that image is ALSO enhanced with more contrast. Some forget here that when seen ‘directly’ the image on the Shroud is NOT what we see in photos…I’m not saying anything new here I know, but it seems it needs mentioning.\nR\n\n","date":"February 15, 2012 at 6:48 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8328","author":"Ron","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"This Symeon Magister’s chronicle is full of theological reference !  This part of the text is like a parabol full of spiritual and theological reference and Magister did that in order to proved that the future emperor had great spiritual values and was better than Romanus’ two sons (who were his competitors for the throne).  NO WAY THIS KIND OF TEXT CAN BE VIEW AS AN AUTHENTIC PHYSICAL DESCRIPTION OF THE MANDYLION !  People get so fooled about those text simply because they don’t make any difference between a descriptive kind of text (like a list of relics) and a theological or legendary kind of text !!! And this lead to every speculations and extrapolations we see in the Pro-Shroud world about the Mandylion !  It’s pretty pathetic really…\nMaking no diffence between a list of relics and a legendary text is not the way to do great history. \nWhat is really important to keep always in mind when you analyse those kind of texts is the CONTEXT and the NATURE of the text.  If this is a text written to give a spritual or moral message and if this is a theological, poetic or legendary kind of text, no way you can take for granted the descriptions and informations contains in it…  In fact, you have to be VERY PRUDENT versus the real historical value of those kind of text.  It’s not at all like a list of relics written by an eye-witness.  Those 2 kinds of texts must be analysed on different levels…\n\n","date":"February 15, 2012 at 11:51 am","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8292","author":"Yannick Clément","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Little additon to my comment : Those 2 kinds of texts must be analysed on different levels…  BUT SADLY, IN THE SHROUD WORLD, MOST PEOPLE DON’T MAKE ANY DIFFERENCE AT ALL BETWEEN THOSE 2 KINDS OF TEXTS !!!  I’ll say it again :  this is really pathetic…\n\n","date":"February 15, 2012 at 11:54 am","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8294","author":"Yannick Clément","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Last comment about that :  The way people are taking for granted those kind of legendary or theological texts can be compared to someone who would believe he can find real solid historical facts in Jesus parabols !!!  Sadly, this is exactly the same thing that’s going on versus this Mandylion hypothesis of Wilson…  And, as I said, this lead to a big bunch of speculations and extrapolations based on those kinds of legendary text that are just like Jesus parabols.  \nPeople never seem to realize that important aspect of making history. On the contrary, they always seem to be willing to buy any crap out there, with the consequence that more “Mandylion” books are sold and more “Mandylion” conferences are given by the ones who propagate this wrong kind of making history and who are making money with it…\n\n","date":"February 15, 2012 at 12:12 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8299","author":"Yannick Clément","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"A very informative postinig, Dan, Thank you.  I guess maybe you were picking up Colin’s cue about showing what the former glory of the image might have been, with your “post-modern-era enhancement” as he puts it.. Perhaps he failed to see the iron-y.\nAnd you were right about detonating Yannick!\nI think the point is that regardless of any theological intent that Symeon Magister’s chronicle might have had (and that was the fashion of much formal descriptive literature in those times) it surely contains kernels of truth.  1. It clearly refers to the Mandylion; 2. The image was indistinct.  3.  The icons copied from the Mandylion .showed the Vignon markings as now present on the Shroud.\nOn the other hand, the inventories that Yannick deems more reliable, would hardly have the formal status of a modern audited stock-taking.\nI have already referred elsewhere to a more objective view of the matter, by referring to Daniel Scavone’s paper on the issue.  He can hardly be accused of having a “Shroudie” bias.  But, as far as I’m aware, Yannick has yet to offer a comment on Scavone’s paper.\n\n","date":"February 15, 2012 at 4:09 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8313","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Joe Marino writes regarding this posting: “I seem to remember several descriptions in relation to this:  in the version I heard of the son’s description, it was described as “blurred.”  Also, the image was described as a “moist secretion, without any artificial coloring or stains.”  Both sound like to me they could be an actual straightforward description rather than something with theological overtones.”\nAnd Dan Scavone writes regarding the above comments: “The line is directly from the translation of paragraph 1 of Constantine VII’s Narratio.  For me it is a strong proof that the cloth from Edessa just arrived in  Constantinople was (!) the Shroud.  Constantine even altered the original Abgar story and was the first to  mention blood on the face,  explaining the image as originating in the garden of Gethsemane when Jesus sweat bloody sweat.  Yes, this seems  to be an eyewitness description – and immensely important.  Changing a 900 year old legend must have had a strong reason.  The Jesus of the old Abgar legend had no blood on his face, as he was preaching in public.  It now had to be explained.”\n\n","date":"February 15, 2012 at 4:26 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8314","author":"episcopalian","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"If Constantine really wants to describe the relic that would have been the Shroud face, HOW IN THE WORLD HE PUT THE MIRACLE IN GETHSEMANI AND NOT AFTER JESUS DEATH (or at least, after he had his crown of thorns) ???  The blood on the face point to the crown of thorns, not Gethsemani !  It’s completely ridiculous to see this theological and spiritual development of the legend as a sign that the Mandylion was really the Shroud !  The Shroud face show evidence of a burial cloth, not a towel used at Gethsemani, while Christ was still alive !!!  \nBut, again, people sees only what they wants to see.\n\n","date":"February 15, 2012 at 4:50 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8316","author":"Yannick Clément","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"It’s sad Dan, but the Mandylion was in Paris from 1241 or 1242 until the French revolution…  No way it could have been the Shroud.  It was most probably, as Vignon thought, a false relic made from the Shroud image by the Orthodox church to fight the heresy of the Monophysism, and later, to fight against the Iconoclast…  That’s a much more probable hypothesis.  Sorry, but that’s the reality approved by the majority of the historians outside the pro-Shroud world.\n\n","date":"February 15, 2012 at 4:57 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8317","author":"Yannick Clément","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Talk about believe what you will!!! There is absolutely no proof the mandylion was in Paris in 1241 or 1242?, a cloth with an image was described in a list, nothing more… No precise description, no painted renditions, nothing!. Nothing to prove is was the Mandylion. You keep mentioning “majority of historians outside the pro-Shroud world”…can you please refer us to some of their writings?\nR\n\n","date":"February 15, 2012 at 7:10 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8330","author":"Ron","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Big +1 to both Daveb and Joe Marino’s comments!….Exactly my thoughts and actually directing to Joe’s first paragraph, was what I was alluding too in my last comment to the VIGNON MARKINGS post.\nR\n\n","date":"February 15, 2012 at 6:54 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8329","author":"Ron","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"All this is just your own speculations without any regard for the kind of text it is taken from…  Even Guscin don’t take this text of Constantine seriously…  It’s completely pathetic.  When people see just what they want to see, we get this result ! \nAll those references of a moist secretion and fade image are taken from legendary and theological stuff !  I don’t make this thing up !  This is the reality…\nBelieve what you want, but I tell you this :  Outside the pro-Shroud world, I’ve never seen one authentic historian who believe in the non sense of Ian Wilson and Al. about the Mandylion.\nWhen you take little things like that out of context, you can make them say anything to you !  It’s exactly like the Gospels !  People can make them say exactly what they want…\nThe purpose of this part of Symeon Magister’s text was to tell a story to show that Constantine had better spiritual force than the other 2 who wanted to take his throne !!!  It’s not the same kind of text as an authentic list of relic written by an eye-witness who don’t want to tell some kind of spiritual or theological message.\nAnd if you don’t agree with this view, then it’s normal you see in ancient sources “proofs” that the Mandylion was the Shroud !  It’s completely pathetic…\nHere’s again the hypothesis of Paul Vignon and this one is much more credible than this Mandylion non sense that everyone’s in the Shroud world who’s not so sure about the authenticity of the Shroud want so bad to belive in !  Here’s the hypothesis of Vignon that doesn’t rely on a bunch of speculations and extrapolations and that is not base on legendary or theological stuff :\nA special feature of this iconographic evidence is the evident likeness of the isolated head of the Shroud to the Mandytions. With long hair, staring eyes and absence of neck, it almost seems to be their negative. Could this similarity, coupled with the anomalies common to both, give us the moral certainty that the Shroud was the unique acheiropoietos, kept, as Vignon believed, in some monastery easily accessible to the theologians and artists of Edessa? For centuries it was a holy, but mysterious and embarrassing relic; suddenly, under pressure from the Monophysites, the Orthodox Clergy realise the role that could be played by a copy of the Face of the Shroud, if turned into a living portrait of Christ. The climate was right in the sixth century with the decline of relics in favour of icons. The Abgar legend with Ananias5 role as painter was to hand. All that had to be done was to have a copy made on cloth, “process” it by incubation, give it a plausible miraculous origin and the desired weapon was there to confound the Monophysites (Note : this was an heretic group that was present in the Middle East from the 5th to the 7th century, and that doesn’t believe in the humanity of Christ. In fact, they just believe in his devine nature), put the Persians to flight and become in course of time the most holy Mandylion. Have we here then the unique source of all “true likenesses”, Veronicas, Epitaphioi and the “figured shrouds” of the West?\nNow, it’s up to you to show proof that Vignon’s was wrong !  And in the end, you believe what you want.  But at least, understand that outside the Shroud world, the vast majority of real historians sees the Wilson hypothesis as a big joke.\n\n","date":"February 15, 2012 at 4:46 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8315","author":"Yannick Clément","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Quote: “You believe what you want!” I believe what the weight of evidence tells me.  I’m still waiting for some informed  comment on Scavone’s paper!  And I thought he was a “real historian”.\n\n","date":"February 15, 2012 at 5:19 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8318","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Scavone paper, sorry to say that, is the most full of bias paper on the subject that I’ve read in all my research.  He follow Wilson’s ideas completely with no critical sense at all…\nA proof of that ? in 958, the emperor Constantine wrote a letter to his troops and in this letter, he mention a bunch of relics of the Passion of Christ with the Shroud being one of them.  No mention of the Mandylion.  No mention of the Abgar legend.  And nevertheless, Scavone think that he was talking of the Mandylion unfolded !  \nHello ????  This letter, on the contrary, is a proof that, during those days, there was a shroud AND the Mandylion being kept at the same place, namely Constantinople !  There is nothing in this letter, I repeat folks, nothing in this letter to suggest he was referring to the Mandylion !  On the contrary, he was mentionning only the relics related to the Passion of Christ and, in this list, the Shroud was one of them, but not the Mandylion !!!  This FACT don’t say anything to you ???  That prove the Shroud being kept in Constantinople was related to the Passion and not the Mandylion, who arrived in that city 14 years before !!!\nBut, again, you believe what you want.\n\n","date":"February 15, 2012 at 5:43 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8321","author":"Yannick Clément","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Dan Scavone also writes: “It seems that  Yannick was  not aware of the unique impact of this Narratio text and that of Symeon Magister, since the two texts are mutually supportive.  And they, in turn, recreate the words of the Edessan “Acts of Thaddaeus,”  that Jesus wiped his moist face thus leaving His facial image.”\nAnd Yannick, I must for now, on this particular matter, patheticfully disagree with you. (don’t look up the word, I made it up) \nDan\n\n","date":"February 15, 2012 at 5:20 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8319","author":"episcopalian","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Ask Scavone (who is clearly a fan of Wilson) what he think about the FACT that the emperor Constantine, in this Symeon Magister’s text, was clearly seeing the ears of Jesus ????  \nWOW !  THIS A VERY GREAT PHYSICAL DESCRIPTION OF THE RELIC MY FRIENDS !!!  OH YES !  WE CAN BLINDLY TAKE THIS DESCRIPTION FOR GRANTED !!!  NOW THAT’S WHAT I CALL GREAT SCIENCE…  ;-)\nWhere do you see the ears on the Shroud ????  Can you see them Dan ?  Constantine, if we believe the text of Symeon Magister was able to see them easily !!!  All this part of Symeon Magister’s text is full of spiritual and theological references and you take this for granted ?  You must believe that Jesus parabols contains solid historical fact, then…\nReally Dan, I’m really sorry to see that you get fooled like that.  Where is your critical sense my friend ?  You don’t see that all the defenders of this Mandylion theory are part of the same clique ???\nI’ll say it again :  Any good historian knows that the context and the style of an ancient text is what’s matter the most and that you cannot take as seriously a legendary or theological text as you can take seriously a list of relics for example…  But, again, most people in the Shroud world, because of their own little agendas, don’t make this basic difference.  This whole Mandylion propaganda is the most pathetic thing I’ve ever seen related to the Shroud…\n\n","date":"February 15, 2012 at 5:53 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8322","author":"Yannick Clément","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Also, can you ask Scavone what he think of the FACT that the modification of the legend contained in the “Narratio” still place the action during the time Jesus was still alive and talk only about the fact that he wipe his face and not his full body with the cloth ?  If the author really wanted to let us know the Mandylion was a burial Shroud, he would have say it clearly !  The context of the “Narratio” completely forbids us to see any direct link between the Mandylion and the Shroud of Turin.  Those who make those kind of connexion are just full of bias in favor of Wilson’s hypothesis.  This is not that way that you do great science…  Sorry to say that but great historical science don’t rely on a bunch of speculations like that taken from theologic, poetic or legendary texts !  To work, Wilson and his followers don’t have any choice then to rely on those kind of pathetic speculations and extrapolations…\n\n","date":"February 15, 2012 at 6:09 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8323","author":"Yannick Clément","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Gethsemane was mentioned earlier. Last night I was comparing the four Gospel accounts of the Crucifixion, and what led up to it, and came across a curious passage in Mark only. It’s one I never recall from years at Sunday School, and consists of just this – two verses: \nChp 14 v 51 “And there followed him a certain young man, having a linen cloth cast about his naked body and the young man laid hold on him”\nv52:  “And he left the linen cloth, and fled from them naked.”\nAnd that’s it. Linen cloth? Naked?  Well you can guess the kind of thoughts that entered the mind of this shroud sceptic, ever alert to clues that all is not what it may seem.\nCue Google, and there are any number of entries on that bizarre episode that defy explanation. Here’s one that caught my eye, if only because it articulates (towards the end) the same hunch I formed about why there was a reference to a linen cloth and naked body so soon before the Crucifixion. I shall leave you with the passage in question, and see what reaction it elicits on this site with those who are much better at home than I with holy scripture:\nLink \n(My bold formatting of a particular key sentence):\nThe key to identifying this young man might be found in the “linen cloth” he had lightly draped about his body. The particular Greek word that is used for this “linen cloth” is used in only one other event in the New Testament – to depict the “linen cloth” in which the body of Jesus was wrapped for burial (see Matthew 27:59, Mark 15:46, and Luke 23:53). Thus, the only reference we have for this kind of cloth in the New Testament is that of a burial shroud used for covering a dead body in the grave. \nIf the answer to this naked young man’s identity lies in the cloth he had wrapped around his body then follow along with me because it leads us to only one other conclusion. You see, when a body was prepared for burial, it was washed, ceremonially cleaned, and buried naked in a linen cloth exactly like the one described here in the Gospel of Mark. Furthermore, the Garden of Gethsemane was situated on the side of the Mount of Olives. Toward the base of that mount is a heavily populated cemetery, with many of its graves going back to the time of Jesus. \nWhen Jesus said, “I AM,” the power that was released was so tremendous that it knocked the soldiers backward (go back and read the story again for that moment). But it may have also caused a rumbling in the local cemetery! When that blast of power was released, a young boy, draped in a linen burial cloth in accordance with the tradition of that time, crawled out from his tomb – raised from the dead! \nNow you may be thinking “oh really?” Stay with me here…\nThe reason he “followed” Jesus was to get a glimpse of the One who had resurrected him. The word “followed” means to continuously follow. This tells us that this resurrected young man trailed the soldiers as they took Jesus through the Garden on the way to His trial. When the soldiers discovered the young man who was following Jesus, they tried to apprehend him. But when they reached out to grab him, he broke free from their grip and fled, leaving the linen cloth in their possession.\nNow I don’t know this for certain but it is something that appears to be reasonable as you study Scripture. It doesn’t change the story instead it is just a little more detail that makes you wonder at the mystery and the depth of all that was happening that weekend.\nSo was it Mark? A resurrected dead guy? Or someone else wandering in the Garden wrapped in only a linen cloth?\nYou can review the information and decide for yourself. This is just another of the amazing events that happened around the time of the crucifixion and resurrection of Jesus.\n\n","date":"February 15, 2012 at 5:25 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8320","author":"colinsberry","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Colin, the reference is something Peter used to highlight the abject terror that was in the hearts of Jesus’ followers, nothing more. When they all fled the guards happened to grab this man’s cloak and tore it off him as he ran. He was so scared of getting caught up in Jesus’ arrest he didn’t care about losing his clothes. \nRemember Peter is reading from Matthew here and he omits the portion about the scriptures because his audience is a group of Romans and the reference would be lost on them so he mentions a small detail that highlights the fear instead. His audience could definitely relate to the fear that a group of guards would instill. You will catch Peter doing this here and there in Mark’s accounting because he is remembering details or filling in details as he preaches to the Romans while reading from Matthew and Luke.\n\n","date":"February 15, 2012 at 7:17 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8331","author":"Chris","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Interesting commentary, fanciful in parts.  Mark’s gospel was written first, about 90% of Mark is in Matthew, say 60% of Mark in Luke;  Both Matthew & Luke have another common source which commentators identify merely as ‘Q’ (for German Quelle).  As well, both have access to their own separate sources, say M1, L1.\nOnly Mark mentions the incident, and both Matthew & Luke decided to omit it.  Therefore some commentators believe it was probably the evangelist himself i.e. Mark.\nAuthors Jacobovici and Pellegrino have an interesting take on the incident, ref “The Jesus Family Tomb” Simcha Jacobovici & Charles Pellegrino – Harper Collins 2007.  It refers to the discovery of a family tomb in the suburb Talpiot where several ossuaries were found, all inscribed with names connected with Jesus family relations (Mk 6:3)\nThere are several references in various gospels, particularly John, referring to “the disciple whom Jesus loved”.  Most commentators believe this was the disciple John, some still identify as the evangelist of that name.  For example he leant on Jesus’ breast at the Last Supper.\nIn those days of high mortality, there were many orphans, adoption was very prevalent, and under both Roman and Jewish Law, adoption gave the same family rights as birth. (Even some of the emperors inherited the role through their adoption).\nPellegrino’s take on this is that the young man referred to in Mk 14:50, is Jesus’ adopted son (Jude?) and this was the “disciple whom Jesus loved”, leaning on his breast, and fleeing from the arrest in his pyjamas.  One ossuary has the name “Yehuda bar Yeshua”.  The adoption is never mentioned in the gospels because of the implied threat to the young man’s life as son of the “King of the Jews”.  It was then fashionable to dispose of an entire dynasty, not merely the reigning monarch, to avoid the rise of pretenders .\nSpeculative and fanciful, but possibly fascinatingly credible.\n\n","date":"February 15, 2012 at 8:21 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8333","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Dave, I am very familiar with Markan Priority Theory. It’s a dying theory as it does not agree with the historical record, tradition, nor it’s own literary analysis. It is riddled with inconsistencies and flaws which cannot be easily explained and rely on itself for explanation. Scholars are starting to discard it and return the the Clementine tradition which predates the Jerome Tradition. \nThe conclusion is that Matthew wrote first almost immediately after the Resurrection followed by Luke. Peter probably had both scrolls in front of him as he preached in Rome and Mark transcribed Peter’s words verbatim (as the historical record indicates) thus explaining the poor Greek of Mark (Peter does not speak Greek very well since it is not his first language). So Mark is third as the historical evidence alludes. Q doesn’t exist as it’s understood and is probably actually just Matthew in Aramaic. John wrote last to combat heresy. \nA lot of scholars don’t accept this yet but the numbers who do are growing because suffice it to say that the overwhelming bulk of the evidence comes down in favor of the Clementine Tradition and the Church Fathers.\n\n","date":"February 15, 2012 at 9:18 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8334","author":"Chris","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Well, Chris thinks the linen was a normal everyday item of clothing, and Dave B thinks it was pyjamas. What Chris in particular seems to be doing is ignoring the fact that word translated as “linen” is only used in one other context in the Bible, namely to refer to Christ’s burial cloth, i.e.shroud. He also seems not to find it remarkable that someone would be described as being “naked” under his robe before the thing had actually been tugged away. So of the two versions, I am more inclined to believe DaveB’s (pyjamas), suggestive of something that was skimpier than normal wear. \nBut I think both of you are trying to evade the real point – the writer Mark is describing an omen of some kind – one that involves death, or a premature assumption of death,with its live man in a burial cloth, and may even be flagging up the possibility of being able to escape a prematurely-invested shroud if one is willing to go naked. Those two verses could either be seen as representing a harbinger, or, alternatively, there might be a hint that the system of confinement in a tomb was not as irreversible as some might imagine, especially if the individual concerned had been wrongly assumed to be dead. Just a thought and a mischievous one at that some might think. But it’s a one-off thought, I can assure you, from someone out-of-area, prompted by those odd two verses that seem to lack any obvious context.\n\n","date":"February 16, 2012 at 3:59 am","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8346","author":"colinsberry","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Colin’s take on this is intriguing, and certainly has some dramatic appeal.  However Mark does not mention the presence of the burial linens left in the tomb, although the other evangelists do.  Now here comes the crunch!\nI’m going to go with the Markan Priority theory.  Mark was Peter’s amenuensis in Rome, and so Peter was the guarantor of Mark’s authenticity.  The theory states that Mark wrote his gospel after Peter’s death 65AD, but before the temple was destroyed in 70AD.  Peter and Mark must have had some fascinating discussions in Rome, as Peter recalled his time with Jesus.  Peter no doubt described his experience on that first Easter morning.  He may even have mentioned his shock (possibly horror) at seeing a shroud with a naked imprint of his Master on it.  What could Mark do with a story like that?  Think about the psychology of it.  Did he decide to insert the naked young man escaping the linen cloth at the time of the arrest, an omen or harbinger as Colin suggests?  Or was it Mark himself as a youth?  Or was it the young adopted son Yehuda bar Yeshua, the disciple whom Jesus loved, escaping in his pyjamas as suggested by Pellegrino?\nSome things are best left as mysteries this side of the grave, and perhaps that’s how it should be.  We don’t need to know everything!  We must have mystery, or we will die of boredom!\n\n","date":"February 16, 2012 at 5:50 am","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8348","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Chris, Thank you for your comments on the Markan Priority theory, as it sent me off on a search.  No way do I agree with you that it’s a dying theory, the great majority of exegetes still consider that Mark was first.  You say that you are very familiar with it, so I shan’t take time on this site to argue for it.  For other readers, Wiki has a reasonably informative outline about it.  Encyclopedia Britannica has an excellent comprehensive article, and there is also specialist material available.\nEssentially there are two approaches.  Those who follow the “form criticism” approach, almost universally adopt Markan Priority, and it makes a lot of rational sense.  Those who prefer the testimony of some of the early Church Fathers are those more inclined to adopt a Matthew, Luke priority, Mark as an abridgement, with John much later.  Having read some of the material on it, I don’t see how it stacks up.\nIt was with some dismay that I discovered that the translators of NASB without exception, were those who rejected the Markan Priority thesis.  While there might have been some need to allow a non-Markan priority viewpoint, it seems to have been a highly selective bias, considering what the majority exegete viewpoint is.  I detect an ultraconservative reactionary conspiracy at work!\n\n","date":"February 16, 2012 at 6:13 am","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8349","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Dave, thanks for the reply, I appreciate it. It’s a fascinating subject indeed. We’ll just agree to disagree. \nAs for Colin’s analysis, I think either way he’s making a mountain out of a mole hill. It’s just a detail that Peter remembers about someone running away. Peter spoke poor Greek and grasped at the word needed to describe the clothing, nothing more. Mark also was a Semitic and also spoke poor Greek so he just copied it down when Peter said it. The Gospels are chock full of miracles because these guys wanted you to believe Jesus was the real deal. If there was any hidden meaning via a foreshadowing of the supernatural behind the guy who ran away I think Peter would have said more. He inserts this detail memory and then goes back to reading Matthew’s account. Besides Jesus Himself does plenty of foreshadowing of His own death and Resurrection no need for a cryptic detail like a man dressed in a burial shroud to convey some hidden meaning. Being dressed in a burial shroud doesn’t make sense, even in this context. \nHis audience is foreign to him but he picks a universally understood emotion, especially in the ancient world – abject fear, to convey the context of the situation. The other thing it highlights is that if they were so terrified then but are boldly preaching now there must be some real truth to what these guys are saying about the Risen Lord walking out of the tomb if they’re not afraid of the prospect of death by execution to tell folks about this story. On the whole of Peter’s account he is showing that from fear to no fear the story they are preaching is real.\n\n","date":"February 16, 2012 at 11:12 am","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8355","author":"Chris","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Allow me to share part of my personal exegesis of the Greek word sindon and the Hebrew word sadin in conjunction with the Gospels.\nThe Greek word sindon is rendered by “linen cloth” in Mark 14:50-52. It usually refers to an undergarment i.e. a cloth worn under another or other cloths. In Mark, it more precisely refers to inner clothing worn next to the young man’s skin as outer clothing on that time of night as if he had known about Rabbi Yeshua’s extra-muros hideaway and hurried out of his house in Jerusalem on hearing of Yeshua’s oncoming arrest. \nIn the Second Temple period, gardeners used to work in undergarment (i.e. in sindon or sadin). That would account for one of the reasons why Mary of Magdalene seeing Rabbi Yeshua in soiled undergarment (actually draped in his lengthy shroud or sadin) mistook him for the gardener on her second return to the garden tomb.\n\n","date":"February 16, 2012 at 11:56 am","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8357","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Correction: “on seeing”\n\n","date":"February 16, 2012 at 12:00 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8358","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"More correction: “Mark 14:51-52”\n\n","date":"February 16, 2012 at 12:02 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8359","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"I personally identified “the young man” with “John-Lazarus” lately nicknamed “Mark”.\n\n","date":"February 16, 2012 at 12:12 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8360","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Correction: “later”\n\n","date":"February 16, 2012 at 6:15 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8370","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"OK Chris, we can agree to disagree.  One problem is that in Mark, it looks like the Temple has not yet been destroyed, whereas in Matthew & Luke it has.  Either way, Matthew & Luke certainly haven’t written before 70 AD.\nHere’s another theory, which takes on board both viewpoints!  One possibility is that Mark wrote his between 65 & 70, but maybe it was only circulated locally and didn’t receive wide circulation throughout the whole church.  Matthew & Luke had access to it together with other material, and compiled their gospels.  Matthew’s was theologically comprehensive, and envisaged Jesus as the new Moses.  Matthew’s was the gospel that was read in the churches, and is commonly called the ecclesiastical gospel.  So in that sense it had priority.  When Mark’s gospel became more widely known, it was seen as an abridgement of Matthew (90% of Mark is in Matthew), inferior, and so leading to the Clementine viewpoint.\nWhen does Jesus become Son of God?  In Mark, it is at his baptism by John B in the Jordan!  In Matthew and Luke, it is at his conception! In John, it is from the very beginning. “In the beginning was the Word, and the Word was with God, and the Word was God”.  so there’s a clear transition, from Mark, through Matthew & Luke, to John.\nIncidentally, looks like Max’s comments on “sindon” might support the pyjama theory, or maybe it was just somebody in bed at the time.  I doubt that gardeners would be at work in the middle of the night.  On reflection, I’m inclined to doubt that Mark would have the imagination to create dramatic omens and harbingers, compared to say the more intellectual Luke or John.\n\n","date":"February 16, 2012 at 3:45 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8363","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Dave, Mary of Magdalene did not see “the gardener” in the middle of the night but very early in the morning of the first day of the Judean week! Re-read it the Gospel passage, PLEASE before passing comments!\n\n","date":"February 16, 2012 at 6:04 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8367","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Dave, John and Mark are one and a same person!\n\n","date":"February 16, 2012 at 6:07 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8368","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Coorection: “one and the same”\n\n","date":"February 16, 2012 at 6:07 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8369","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Max, we are at cross-purposes;  you mentioned that gardeners worked in their under-gaments. My comment was intended to convey that no way was the young man who was fleeing from the arrest scene the gardening boy doing shiftwork overtime, although many of our iwi here in Aotearoa may consider full-moon a propitious time for planting their kumara (sweet potato). Your comment re Magdalene’s mistaking Jesus for the gardener is fully understood.\nTo say that John & Mark are one and the same person is a gross assumption, these names were exceedingly common in the Judaic community, and we can seldom know that when they’re repeated if they refer to the same person elsewhere in the Testament unless they can be placed in the same context.\nFor example: we don’t know if John the disciple is the same as the evangelist (he may be), he’s probably not the writer of the Johannine epistles, and almost certainly not the writer of Revelations.  A few years ago, following up hostile reactions on the web to the “Jesus Family Tomb” book which I mentioned above in my posting of Feb 15, I did a stats analysis of the names known to be on 1st c ossuaries.  Most of the names familiar to us through the NT were exceedingly common.  It takes some fairly rigorous analysis and context cross-referencing to show that two separate occurrences of a name refer to the same person, and you still may not come up with the correct answer.\nI am utterly dismayed at Chris’s news of a growing tendency to reject Marcan priority.  It is so retrograde.  It is decorated with the name of following the Clementine tradition, asserting that this was the understanding of the early Fathers.  It can be traced back to Papias, a 2nd century bishop of Hierapolos in Phrygia, who Irenaeus says knew the apostle John, and who Eusebius says was a man of exceedingly small intelligence.  Subsequent Fathers are merely echoing Papias.  What Papias actually said was that “So Matthew composed the Oracles in the Hebrew language and each one interpreted them as he could.”  Now the Oracles may have been the “logia”, the “sayings” now common to Matthew and Luke, and possibly some of the common narrative, he may even have compiled the document called “Q”.  They almost certainly were not Matthew’s gospel as we now know it, as it seems plain enough that the original language of this Gospel was Greek, not Hebrew.  It is seriously doubted that the “Oracle” Matthew is the same as the “Gospel” Matthew (my note above re prevalence of NT names).\nFurthermore, the Anti-Marcan priority lobby is not averse to using form-criticism when it suits them, such as asserting that Mark deleted all the apparent anti-Gentile references in Matthew.  Either they should use the full weight of this discipline, or not at all.  I recall that a few bloggers on this site seem to have been prone to a similar disease, selecting only that evidence which suits their case, and rejecting that which does not!  So the condition is fairly prevalent, and probably contagious!\n\n","date":"February 17, 2012 at 5:12 am","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8386","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Easy Dave, there’s enough room for Matthew and Luke Priority theory. There’s a boatload written about the subject as there is about Markan Priority. There’s good and there’s bad regarding both theories, one has to distinguish between them. We’re not going to change anyone’s mind here about that but it is refreshing to see folks like yourself here who are well read and using that knowledge to help our understanding of the shroud in history. For that I am grateful.\n\n","date":"February 17, 2012 at 11:11 am","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8405","author":"Chris","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Re prevalence of NT names in 1st c Judea, as recorded on inscribed ossuaries.\nAn authoritative paper can be found at: http://www.uhl.ac/JudeanTombsAndOssuaries.html\nNote that I do not necessarily agree with the fundamental conclusion of this paper, as I believe the author(s) have failed to calculate the true random probability of all the names occurring at Talpiot in the one tomb, which is very much smaller than they seem prepared to admit.\nFrom a population of 917 ossuaries, 686 were not inscribed; There were 286 names found on 231 inscribed ossuaries (e.g. X son of Y).\nHere’s a small sample of name frequencies (which includes their variants):\nSalome 26; Simon 26; Mary 20; Joseph 19; Judas 18; John 12; Martha 11; Jesus 10; Matthew 8 … …\nYou can check the paper for the full list.  Note that we are only looking at a total sample of 286 names, so the individual relative frequencies here are much higher than would be found in a modern population of names.\nPoint is that we can’t assume that two occurrences of the same name in the NT necessarily refer to the same person, without further careful analysis!\n\n","date":"February 17, 2012 at 6:30 am","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8388","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Dave you wrote: “Max, we are at cross-purposes; you mentioned that gardeners worked in their under-garments. My comment was intended to convey that no way was the young man who was fleeing from the arrest scene the gardening boy doing shiftwork overtime” ok, but please don’t you make it more difficult (when even professional exegetes have a real hard time to disentangle the Gospel “sindon/sadin” issue)!\n\n","date":"February 17, 2012 at 7:42 am","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8391","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"You also wrote: “Point is that we can’t assume that two occurrences of the same name in the NT necessarily refer to the same person, without further careful analysis!” I do agree with you. However, the true point I wanted you and other blog viewers to be aware is that here we have two DIFFERENT names (“John and Lazarus”) and one surname (“Mark”) which all them three might well refer to one and the same man.\n\n","date":"February 17, 2012 at 7:55 am","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8392","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Dave, I do agree with John A. T Robinson, Claude Tresmontant and Jean Carmignac: Matthew is anterior to Peter/Mark.\n\n","date":"February 17, 2012 at 8:05 am","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8393","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Correction: “may be anterior”\n\n","date":"February 17, 2012 at 8:29 am","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8396","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Still, Robinson/Tresmonant/Carmignac placed Matthew at 40 to after 60, Mark at about 45 to 60 which, all things consider, means they are pretty close from each other anyway.\n\n","date":"February 17, 2012 at 8:16 am","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8394","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Correction: “Robinson/Tresmontant/Carmignac placed Matthew at 40 to after 60, Mark at about 45 to 60. All things considered, that means they are still pretty close to each other anyway.\n\n","date":"February 17, 2012 at 8:24 am","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8395","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"To be more precise: Carmignac just dates Greek Mark as before 70 CE so Matthew also before that date. In Tresmontant’s eye,Matthew in both Hebrew and Greek could be dated as having been written soon after the Resurrection, Luke between 40-60 CE, with Mark 50-60 AD. Robinson placed Matthew at 40 to after 60 CE, Mark at about 45 to 60 CE.\n\n","date":"February 17, 2012 at 8:53 am","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8397","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Sorry, Max, I can’t buy into it.  In Matthew & Luke the temple has already been destroyed (70AD).  But to be objective and fair about it, I’ll do a search on the names you mention to see what they have to say.\n\n","date":"February 17, 2012 at 3:56 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8411","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"How on earth did this topic get from The Shroud of Turin: A pale shadow of it’s formal Glory to a naked guy and his discarded sheet? LOL.\nLets’ try to stay on topic folks…But interesting reading nonetheless ;-)\nR\n\n","date":"February 17, 2012 at 8:04 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8414","author":"Ron","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Blame Colin’s postings of Feb 15, 16; He interpreted the incident as an omen or harbinger of the Resurrection.  I see it as just the sort of uninventable(?) incident that lends authenticity to the arrest scene.  Another one relating to Peter’s release from prison is Rhoda’s reactions to his arrival at John Mark’s home, check Acts 12:13-15.\nI’ve followed up a little on Max’s references on Matthean priority, but so far remain unimpressed.  Pity we can’t continue the discussion, but as Ron indicates, this is not really the place to do it. Cheers all!\n\n","date":"February 17, 2012 at 9:09 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8417","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Sorry to follow up here on The Markan Priority issue, but can Dave substantiate his assertion that “In Matthew & Luke the temple has already been destroyed (70AD). Outstanding exegetes such as Robinson, Trestmontant and Carmignac DID demonstrate quite all the contrary!\n\n","date":"February 18, 2012 at 10:53 am","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8433","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"At Max’s behest, I have been doing some further research on the matter, and I am impressed by the comprehensive entries on the Catholic Encyclopaedia web-site for the gospels of Matthew and Mark. I urge both Max & Ron to examine these, as they cover the various arguments and issues in a way not possible in a short blog posting.\nGospel of Matthew: http://www.newadvent.org/cathen/10057a.htm\nGospel of Mark: http://www.newadvent.org/cathen/09674b.htm\nI do not subscribe to the views of Robinson, Trestmontant and Carmignac.  Theirs is not the majority viewpoint of exegetes, and I think it unfortunate that they seem to have gained traction within the establishment.\nOn the evidence of Papias, Mark did not use Matthew as a source, but reported what he had directly from Peter in Rome.  He has written it for Roman Christians, many of them gentiles, although some were Jews.  Matthew wrote his gospel for Syriac Christians, and it is evident that they are predominantly Jewish Christians, and likewise Jewish synagogues are also prevalent, probably as a result of the dispersion with the impending  threat of the Jewish War.\nThe source of Matthean priority seems to have been due to a misreading of Papias, who states that Matthew first wrote “logia” in the Hebrew language, (possibly the ‘Q’ document).  This is covered in the references above.  Only two of Mark’s miracle stories are not included in Matthew and Luke.\nThe view I am coming to about the origin of the priority debate is along the following lines:  Mark wrote his gospel, from the preaching of Peter, and it had limited circulation among Roman Christians.  At some time Matthew and Luke acquired copies of it, and along with other material they had, compiled their gospels.  Matthew’s gospel came to be read in the Syriac churches, was referred to as the ecclesiastical gospel, and in that sense had priority.  When Mark’s gospel became more widely known, it was seen as inferior to Matthew’s, and an abridgement of it (90% of Mark is in Matthew), and therefore secondary.\nI do not subscribe to the view that there were early apostle-scribes who wrote everything down.  There is no evidence for such scribes, although someone called Matthew appears to have written down the logia (Q?).  The parousia was believed to be imminent and so there would be little point in writing for posterity in the years before 70 AD. I suspect that the assumption arises from a modern Western lack of appreciation of the ability of non-literate peoples to recite verbatim what they had heard, and there were many others who would correct them if they made an error of recall.\nConcerning the dates of writing, I can certainly concede there is wide-spread lack of agreement among the authorities.  The arguments for a post-70 AD date for the composition of Matthew is an extract at the foot of this posting.\nExtract concerning the origins of Mark’s gospel is reproduced below:\nEusebius quoting Papias: “And the elder said this also: Mark, having become interpreter of Peter, wrote down accurately everything that he remembered, without, however, recording in order what was either said or done by Christ. For neither did he hear the Lord, nor did he follow Him, but afterwards, as I said, (he attended) Peter, who adapted his instructions to the needs (of his hearers), but had no design of giving a connected account of the Lord’s oracles [v. l. “words”]. So then Mark made no mistake [Schmiedel, “committed no fault”], while he thus wrote down some things (enia as he remembered them; for he made it his one care not to omit anything that he had heard, or set down any false statement therein” (Eusebius, Church History III.39).\nExtract of arguments concerning Matthew’s post-70 AD date of composition:\nThe following are some of the arguments advanced to prove that the First Gospel was written several years after the Fall of Jerusalem. When Jesus prophesies to His Apostles that they will be delivered up to the councils, scourged in the synagogues, brought before governors and kings for His sake; that they will give testimony of Him, will for Him be hated and driven from city to city (x, 17-23) and when He commissions them to teach all nations and make them His disciples, His words intimate, it is claimed, the lapse of many years, the establishment of the Christian Church in distant parts, and its cruel persecution by the Jews and even by Roman emperors and governors. Moreover, certain sayings of the Lord–such as: “Thou art Peter; and upon this rock I will build my church” (16:18), “If he [thy brother] will not hear them: tell the Church” (xviii, 10)–carry us to a time when the Christian Church was already constituted, a time that could not have been much earlier than the year 100. The fact is, that what was predicted by Our Lord, when He announced future events and established the charter and foundations of His Church, is converted into reality and made coexistent with the writing of the First Gospel. Hence, to give these arguments a probatory value it would be necessary either to deny Christ’s knowledge of the future or to maintain that the teachings embodied in the First Gospel were not authentic.\n\n","date":"February 18, 2012 at 6:54 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8447","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Dave, thanks for this. There is a website by a guy by the name of Dennis Barton that neatly sums up a different point of view. This is not the appropriate forum to discuss it here but it makes for good reading. Hope you enjoy and thanks again.\n\n","date":"February 19, 2012 at 12:59 am","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8451","author":"Chris","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Found Dennis’ site. It’s high level but presents the main arguments. Hope you enjoy.\nhttp://www.churchinhistory.org/pages/booklets/authors-gospels-1.htm\n\n","date":"February 21, 2012 at 3:40 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8594","author":"Chris","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Thanks for the links Daveb :-)\nR\n\n","date":"February 19, 2012 at 10:40 am","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8463","author":"Ron","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Dave you wrote: “I’ve followed up a little on Max’s references on Matthean priority, but so far remain unimpressed.” The fact is Robinson’s, Tresmontant’s & Carmignac’s exegese, IF CAREFULLY READ THROUGH are far more IMPRESSIVE than all the exegetical work ever done by the German rationalists and their followers. I wish you could read French to more fairly evaluate Tresmontant’s and Carmignac’s verse after verse, Gospel after Gospel demonstration. The substance on which is built the hypothesis that “In Matthew & Luke the temple has already been destroyed (70AD)” is far too weak compared to Robinson’s, Tresmontant & Carmignac’s historical, philosophical & philological very strong & detailed arguments.\n\n","date":"February 19, 2012 at 8:31 am","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8457","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Max, Thanks for your comments.  Very many years ago in the 1950’s, I regularly topped my classes in French (and Latin), but purely on the basis of my meccano set (a well-known model building set) my parents decided I should take up professional engineering instead.  I’m afraid I’ve lost most of my French now and have lacked the incentive to take it up again.  In later life I was able to take up my interests in literary studies and mathematics, which also happened to include a major in Religious Studies.  I made some attempt to pick up on the works you mentioned, but I’m afraid that Google automatic French-English translation of technical papers is only slightly better than pidgin.\nI regularly use my Encyclopaedia Britannica package as one of my reference sources.  It has an extremely comprehensive in-depth section on Biblical Literature, compiled by several authoritative authors.  I also of course use several other sources as well.\nI also mentioned the ability of non-literate peoples to recite long passages they had heard, purely from memory.  This is still manifest among both Maori and Pasifika peoples for instance in reciting their whakapapa (genealogies) karakia (chants) and so on, which they have had from ancient times.  You may recall a related passage from Alex Haley’s “Roots” which takes him to his ancestral tribe in Africa, and the tribal genealogist recites the genealogy enabling Haley to discover his ancestor who had been taken by slave traders.\nI think we see a glimpse of this practice of oral recitation in Papias:\n“Papias (died c. 130), a bishop of Hieropolis, in Asia Minor, was said by Irenaeus (died c. 200), a bishop of Lugdunum (now Lyon, France) to have been an eyewitness of the Apostle John. Papias had said, “For I did not suppose that the things from the books would aid me so much as the things from the living and continuing voice.”\nEusebius (c. 260-c. 340), a church historian, reported these comments in his Ecclesiastical History and pointed out inconsistencies in Papias’ recollections, doubted his understanding, and called him “a man of exceedingly small intelligence.” Large sections of oral tradition, however, which were probably translated in part from Aramaic before being written down in Greek-such as the Passion (suffering of Christ) narrative, many sayings of Jesus, and early liturgical material-benefited by the very conservatism implicit in such traditions.” (Encyc Brit)\nI think it suggests that oral recitation in the early churches may well have been a norm.  It is also reflected in the pericope style of the Synoptics, with their self-contained mini-episodic style of writing.\nCertainly in the time of Papias, both Matthew’s and Mark’s gospels were accepted as authentic witnesses.  And of course by the mid-2nd c. we have Justin in Rome reporting in his Apologia: “And on the day called Sunday there is a meeting in one place of those who live in the city or the country, and the memoirs of the apostles or writings of the prophets are read as long as time permits.”  “… the memoirs of the apostles which are called Gospels …”  It seems that Justin feels the need to take pains in explaining this practice of reading the memoirs.\nI’m therefore of the view that the written Word was something that evolved rather more slowly than is allowed by some exegetes who see it as a more immediate development.\n\n","date":"February 19, 2012 at 4:24 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8475","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Max, I discovered the following paper sympathetic to the Robinson / Tresmontant / Carmignac hypothesis which may interest you, if you’re not already aware of it (thankfully it’s in English):  CONTEMPORARY CATHOLIC BIBLICAL SCHOLARSHIP: CERTITUDES OR HYPOTHESES?   A Commentary: Msgr. Michael J. Wrenn: January 8, 1988.\nURL for this paper is: http://www.ewtn.com/library/scriptur/certhypo.txt\nWritten in 1988, it may well now be a little dated.  Doubtless other more recent material could be discovered as well.  Meantime, I think I shall still stay with the majority viewpoint.\n\n","date":"February 19, 2012 at 6:25 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8484","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Michael Wrenn wrote in his 1988 paper: “A profound   disregard   for  the  Judean  ethnic   milieu   orenvironment  explains  the   length of time that these errors (of the German rationalist exegesis) have  been  in vogue.    This disregard is due to an ingrained  attitude  of  despisal  and detestation  of Judaism,  which are constants in German   philosophy,    the\nmistress  of  German critical exegesis accepted by the majority of  exegetes\nsince  Renan and Loisy.”\nDave you wrote: “I think I shall still stay with the majority viewpoint.”\nMy personal opinion is, as long as Shroud researchers will stay with the majority viewpoint (German rationalism) and overlook the halakhic burilal ritual, the Hebrew-Aramaic substratum of the Gospels, they will endlessly err at the expense ot the archaeological truth.\n\n","date":"February 19, 2012 at 7:08 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8487","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Max, I don’t see that anti-Semitism is an essential ingredient to German rationalist exegesis.  We should not fall into the reactionary  trap of anti-Teutonism to compensate.  Surely the Judean / Semitic ingredient can be found in the authorship of at least three of the gospels, together with their milieu, although Matthew’s gospel, wrongly or rightly, has frequently been accused of being anti-Semitic, and even a driver of anti-Semitism. .\nI can agree with you on the possible importance of the halakhic burial rites, but I fail to see how that can relate to the Markan priority debate, or the date of committal to writing of the gospels.  You have given a persuasive argument for it in the Sanhedrin roles of Nicodemus and Joseph of Arimathea, providing that there was sufficient light still available for them to observe all the detail of these rituals.\nThere’s some interesting recent comments on this site about myrrhic and aloetic residues on the blog headed by Kelly Pearse’s fine article.  I would go as far as saying that any exegete who fails to take due account of Jewish ritual practices runs the risk of being incompetent.  I know of at least one paper that attempts to search for a photo-sensitive chemical reaction involving myrrhic-aloetic components. Perhaps such attempts should also be informed by allowing for the full detail of the halakhic burial rites, or at least possible variants of them.\n\n","date":"February 19, 2012 at 11:32 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8496","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Dave you wrote: “I don’t see that anti-Semitism is an essential ingredient to German rationalist exegesis”. Remember, I was just quoting Michael Wrenn. \nActually, it DOES SEEM the negative impact of “German rationalism” DOES SHOW in a previous post you wrote on February 9: “John says they took the body of Jesus and wrapped it with the spices, and adds the gloss “following the Jewish burial custom”. Maybe this gloss was added to satisfy his Jewish readers, and perhaps we should not read too much into it.” \nOn which objective/material basis should the reader think so??? Why precisely this very part of John’s testimony mentioning a “Jewish custom” should not be taken at face value?\n\n","date":"February 20, 2012 at 4:16 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8552","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Because I’m not a biblical ltieralist!\nI believe caution must be exercised in interpreting every line of scripture.\nA common enough error is to assume that every line of scripture is literally true, probably stemming from the traditional doctrine that all of scripture is divinely inspired.  A broader view is evident as early as the time of Augustine (De doctrina christiana): “Its emphasis on allegorical interpretation of scripture, carried out within very loose parameters, was especially significant, and it remains of interest to philosophers for its subtle and influential discussion of Augustine’s theory of “signs” and how language represents reality.” (Encyc Brit),\nThe evangelists were not concerned to write history, as we understand a historian might do today, or even in the style of Josephus say.  They were generally concerned to proclaim Jesus as divine, as Saviour, to proclaim his teaching, and, in John, as Son of God from the very beginning.  They did this according to their own understanding, and according to their perceived needs of their intended congregations.  Notwithstanding, the gospels certainly do have some historical content.\nJohn is certainly concerned with Jewish practices, his intended audience appears for the most part to be Jewish Christians, his gospel seems to be structured around Jewish festivals, and there is further doctrinal development from the content of the Synoptics.  But it is not possible for instance, as John P Meier has pointed out (A Marginal Jew) to obtain a time-frame consistent with the Synoptics, John’s time span is much longer,  Even so it is John’s account that Meier uses for dating the crucifixion.  There was some initial reluctance to accept John’s gospel as canonical, and a few even suspected it of some gnosticism.\nIt may well have been the intention of Nicodemus and Joseph Ar. to comply with all the detailed requirements of the prescribed burial rites, but there may well have been a few details they had to omit in the time available.  Do we suppose that John would make a point of mentioning any omission if such was the case?  It’s irrelevant to his preaching of the kerygma.\nI think there is scope for both points of view, but I can’t see that one can be dogmatic about either.\nAs my scholarly Augustinian Assumptionist Bible instructor is fond of saying about legitimate competing viewpoints: “Yer pays yer money, and yer makes yer choice!”\n\n","date":"February 20, 2012 at 11:18 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8557","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Typo in first line: “Because I’m not a biblical literalist!”\n\n","date":"February 20, 2012 at 11:21 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8558","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Dave you wrote: “A common enough error is to assume that every line of scripture is literally true “. If you think I am a literalist, you are wrong. When it comes to the Gospels as textual matter, I am first and foremost an archaeocryptologist. E.g., in a previous post (January 7, 2012 at 11:12 am | #12), I gave my own personal explanation to Matthew 27:53 to account for saints coming out of their tombs after Rabbi Yeshua’ resurrection:\n“In the Second Temple period, it was rather usual for both possessed and holy men to live an eremitic live in grottoes or DESUSED TOMBS. If we half rule out here the use of a literary device (dramatic emphasis) by Matthew, this is the best solution, in my eyes, we are left with to historically account for this long misunderstood passage”…\nNow please, do read the interpretation the German rationalists and their followers gave to Matthew 27:53.\nYou also wrote: “I believe caution must be exercised in interpreting every line of scripture.” All the more so with the Gospels as a Hebrew/Aramaic substratum is to be taken into account. Now, “German rational exegetes” and their followers tend to totally ignore the Greek, here, might well be a translation Greek from former notes taken down in Hebrew and Aramaic. Do you still think German rational exegetes and yourself (as their follower) so cautious “in interpreting every line of scripture”?\nThen you added: “John is certainly concerned with Jewish practices, his intended audience appears for the most part to be Jewish Christians”. Actually they are not so much Jewish as JUDEAN practices (as opposed to Galilean or Samaritan practices of the Second Temple period). What about the caution you just said must be exercised? The Gospel of John was written well BEFORE the Temple was destroyed (70CE) whereas “German rationalists” and their followers still interpret John’s Gospel as if it had been written at the end of the 1st century CE! Are “the Markans” so cautious to completely rule out the possibility? You should read Genot-Bismuth’s brilliant exegesis and archaeology of John’s Gospel! (Genot-Bismuth’s exegesis is in the line of Robinson, Tresmontant & Carmignac. A MUST READ)\n\n","date":"February 21, 2012 at 6:09 am","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8570","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Dave you wrote: “It may well have been the intention of Nicodemus and Joseph Ar. to comply with all the detailed requirements of the prescribed burial rites, but there may well have been a few details they had to omit in the time available. Do we suppose that John would make a point of mentioning any omission if such was the case? It’s irrelevant to his preaching of the kerygma.”\nHow then will you account for John only mentionning the “othonois/othonia” (plural form) and omitting the  “sindon” (singular form)? How can you be so sure Yeshua’s buriers had not enough time to complete his (primary) burial when John implies they had? Are you aware a shroud just could not be bought then in Jerusalem after noon on the eve of PessaH? Because the city was plunged into darkness (from midday to the middle of the afternoon) on that day, are you aware there were two days and two nights”  in the eye of a Judean of the Second Temple period? Etc.\n\n","date":"February 21, 2012 at 7:05 am","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8573","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Correction: “Because the city was plunged into darkness (from midday to the middle of the afternoon), are you aware there were “two days and two nights” on that very day, in the eye of a Judean of the Second Temple period?\n\n","date":"February 21, 2012 at 7:24 am","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8575","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"More correction: “Are you aware a shroud just could not be bought then in Jerusalem AFTER MID-AFTERNOON on the eve of PessaH?\n\n","date":"February 21, 2012 at 9:40 am","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8580","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"As Chris correctly implied in his posting of Feb 17, neither of us are going to convince the other of our opposing points of view.  I think you’re attempting to read too much into the texts; you may well think my approach superficial.  Robinson was not highly regarded by other English speaking exegetes, and I wonder to what extent the Tresmontant and Carmignac hostility to German exegesis may be a by-product of the occupation.\nI respectfully suggest it might be beneficial to your cause if you lighten up a little, but you will need to find someone else to debate the issues with, as I’ve decided that any further discussion between us on the topic is unlikely to be productive.\nNevertheless I found your comment on Mt 27:53 an interesting observation. Thank you for this and the other references you’ve supplied.\n\n","date":"February 21, 2012 at 6:02 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8607","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"I do think your approach superficial.\n\n","date":"February 21, 2012 at 7:26 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8620","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Farewell, Dave!\n\n","date":"February 21, 2012 at 7:13 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8617","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"PS Dave, just keep ignoring Tresmontant’s, Carmignac’s, Genot-Bismuth’, Loth’s and Winhem’s works. Underate Robinson’s just because he has the guts to go against the consensus. Enjoy your pro domo nihilistic illitralism.\n\n","date":"February 21, 2012 at 7:23 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8619","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Shroud of Turin: a pale shadow of its former glory?","post":"Correction: “Wenham”\n\n","date":"February 22, 2012 at 8:21 am","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","id":"comment-8635","author":"Max Patrick Hamon","site":"shroudstory"}]
