[{"title":"Three Examples of Artistic Likeness","post":"what’s the striking similarity between these images and the Shroud? All they simply share is a bearded Jesus.\nOn balance, I side with Wilson on the Pray manuscript, but to me these supposed associations are nonsense.\n\n","date":"October 15, 2013 at 8:10 am","url":"https://shroudstory.com/2013/10/15/three-examples-of-artistic-likeness/","cat":"art","id":"comment-47551","author":"Matthias","site":"shroudstory"},{"title":"Three Examples of Artistic Likeness","post":"See the Vignon markings, beginning at the encaustic icon preserved at the Greek Orthodox Saint Catherine’s Monastery in Sinai, Egypt.\n\n","date":"October 15, 2013 at 9:13 am","url":"https://shroudstory.com/2013/10/15/three-examples-of-artistic-likeness/","cat":"art","id":"comment-47555","author":"Louis","site":"shroudstory"},{"title":"Three Examples of Artistic Likeness","post":"Personally, I think most of the so called Vignon markings are nonsense. Hopefully I can go into a more complete rebuttal sometime.\n\n","date":"October 15, 2013 at 5:42 pm","url":"https://shroudstory.com/2013/10/15/three-examples-of-artistic-likeness/","cat":"art","id":"comment-47592","author":"Matthias","site":"shroudstory"},{"title":"Three Examples of Artistic Likeness","post":"Two out of three isn’t bad. \nI have trouble with the vase. However, there are two Vignon markings present in the paintings that are fairly convincing. Remembering that you are looking at the pictures and the at the what is on your right is actually the left side of the image here’s two:\n(one) the hair on the left shoulder (your right) is longer and drops  to the shoulder while on the right (your left) it seems to flow behind the head.:\n(two) There is a indication of hair (or what may have been blood or a combination of the same), streaming down the upper forehead in an inverted “V.” This is also found very pronounced on some Justinian coins. It is very faint but there is an inverted “V” on the Shroud’s forehead as well as as a more pronounced  “E” shape.\nWhatever you want to call it, the inverted “V” and the different lengths of hair appear to be an artistic convention.But something doesn’t get to be a convention until it’s done originally once by someone or something. All of the items expressing these conventions have clearly human origins whether painting or engraving. Only one doesn’t. It’s called the Shroud of Turin and the fact it’s image and the what became conventions are inexplicable identifies it as the origin of the conventions. \nIs  there any other image expressing these conventions that can not be shown to be the product of human artistry?\nI am serious. Answer please!\n\n","date":"October 15, 2013 at 10:20 am","url":"https://shroudstory.com/2013/10/15/three-examples-of-artistic-likeness/","cat":"art","id":"comment-47566","author":"John Klotz","site":"shroudstory"},{"title":"Three Examples of Artistic Likeness","post":"I think the most convincing are the two Justinian coins–first coins ever minted with an image of Jesus in 692.  The Tremesis is amazing and the Solidus also quite convincing but the clincher for me is a the double line across the neck on both coins which corresponds exactly with a fold mark seen on the Shroud.  One might dismiss face, hair or beard similarities but the fold mark is unique to the Shroud and very significant in my view.\n\n","date":"October 15, 2013 at 11:22 am","url":"https://shroudstory.com/2013/10/15/three-examples-of-artistic-likeness/","cat":"art","id":"comment-47570","author":"Russ Breault","site":"shroudstory"},{"title":"Three Examples of Artistic Likeness","post":"Off-topic: I’m working on a presentation for my local U3A group. Came across a note in Ian Wilson chronology: 1464 – Francesco della Rovere, (later Pope Sixtus IV) writes book mentioning ‘Shroud in which the body of Christ was wrapped when he was taken down from the cross … now preserved by Dukes of Savoy … coloured with the blood of Christ.’ I conclude blood was evident in 1464.\n\n","date":"October 15, 2013 at 10:53 pm","url":"https://shroudstory.com/2013/10/15/three-examples-of-artistic-likeness/","cat":"art","id":"comment-47602","author":"daveb of wellingon nz","site":"shroudstory"}]
