[{"title":"Troubled by the New Shroud of Turin 3D Web Site","post":"Good catch on the outline. These guys either found what no one else was able to find or they created it. What do they say?\n\n","date":"October 10, 2010 at 2:15 pm","url":"https://shroudstory.com/2010/10/10/troubled-by-the-new-shroud-of-turin-3d-web-site/","cat":"art","id":"comment-1513","author":"Lou G","site":"shroudstory"},{"title":"Troubled by the New Shroud of Turin 3D Web Site","post":"Got to admit that the 3d looks cool. I would be fooled without your blog entry. Thx.\n\n","date":"October 10, 2010 at 2:56 pm","url":"https://shroudstory.com/2010/10/10/troubled-by-the-new-shroud-of-turin-3d-web-site/","cat":"art","id":"comment-1515","author":"anon","site":"shroudstory"},{"title":"Troubled by the New Shroud of Turin 3D Web Site","post":"I would like to hear from Dr. Peter Soons. He is, after all, the expert. You are not. \nTheologian\n\n","date":"October 10, 2010 at 5:55 pm","url":"https://shroudstory.com/2010/10/10/troubled-by-the-new-shroud-of-turin-3d-web-site/","cat":"art","id":"comment-1516","author":"Theologian","site":"shroudstory"},{"title":"Troubled by the New Shroud of Turin 3D Web Site","post":"The Peter Soons movie (http://vimeo.com/14072737) clearly suggests that an outline was artificially created, perhaps accidentally. The 3D glasses borrowed from a Shrek DVD makes this obvious. Isabel Piczek, Barrie Schwortz and many others from STURP have made it clear that there are no outlines in the shroud’s image but gradual changes in tone instead. Moreover, John Jackson demonstrated that the image quenches at three to four centimeters depth. That is not so in the 3D image. \nIf you believe what you see with 3D glasses on, then Isabel, Barrie and John are wrong. I don’t think so. Thank you for alerting us to this problem.\n\n","date":"October 11, 2010 at 10:22 am","url":"https://shroudstory.com/2010/10/10/troubled-by-the-new-shroud-of-turin-3d-web-site/","cat":"art","id":"comment-1520","author":"Fr. Daniel","site":"shroudstory"},{"title":"Troubled by the New Shroud of Turin 3D Web Site","post":"Art? If I make a statue and tell you it is art, it is art, no matter what you think of it. If I tell you it is an ancient pagan god or a Leprechaun turned to stone by an evil spirit or anything other than a work of art, it is no longer art no matter the original intent or how artistic it may seem . It is a fake. The Soons 3D stuff is not art having been sold as science. It seems to not be science. That is regrettable.\n\n","date":"October 12, 2010 at 2:47 pm","url":"https://shroudstory.com/2010/10/10/troubled-by-the-new-shroud-of-turin-3d-web-site/","cat":"art","id":"comment-1526","author":"Lou G","site":"shroudstory"},{"title":"Troubled by the New Shroud of Turin 3D Web Site","post":"Dr.Petrus Soons has been kind enough to send me a lenticular and 3-D image of the Shroud. My discussions with him through e-mails convince me that the 3-Dimensional image made by him is a photographic creation. Still, I must make a point here. There have been theories that the Shroud image itself formed out a quantum hologram (analogous to what Dr.Johnson described as a Man transparent to the environment)! My ensuing book “The Shroud of Turin: An Imprint of the Soul, Apparition, or Quantum Bio-Hologram” (proposed to be released in a fortnight) proposes that the Shroud image is indeed an imprint of the Quantum Self. It is not a mere theory. A plethora of concrete evidences has been drawn from the ancient alchemical science of palingenesis (that is resuscitating 3-D spectral plants from their ashes) and natural magic (showing house full of snake images in 3-D). The theory is simple but sound: Bio-matters of all organisms, even if consumed to ashes, retain the selfsame form and figure of the parent organism. The science behind such extraordinary quality is quantum holography. Each part of the body molecule or cell may encode information for the whole body .This fact has been successfully proven by various experiments in cloning by reconstructing the whole body from a single cell. These subtle holographic energy fields or patterns are the templates or blueprints for the physical body to guide its growth and development.\nDr. Benford, (also a Shroud researcher who discovered the French weave patch which misrepresented the Shroud in the C-14 dating results) in her paper, “Empirical Evidence Supporting Macro-Scale Quantum Holography in Non-Local Effects”, attributes the reason to quantum hologram as follows: \n‘One theory is that the test object contains a complete quantum hologram that can affect optical systems and, under the right conditions produce a holographic-like image. To make a hologram, two optical waves are needed: a reference wave and an object wave.  These two waves make a 3D holographic image by creating an interference pattern frozen in space-time.  Both waves are spatially and temporally coherent at the moment of creation, then separated. The object wave is directed towards the object and it experiences intensity changes and phase-shifts.  Normal 2D photographs record only the intensity changes of the object wave and not the phase-shifts.  However, when a reference wave is directed back towards the emitted object wave, an interference pattern is created, that records the phase-shifts of the object wave relating to the reference wave. These phase-shifts are what produce the apparent freezing in space-time of the object’s 3D image.’\nThus the quantum science will explain the centuries-old mysteries wrapping the Turin Shroud soon.\n\n","date":"October 15, 2010 at 1:34 pm","url":"https://shroudstory.com/2010/10/10/troubled-by-the-new-shroud-of-turin-3d-web-site/","cat":"art","id":"comment-1538","author":"Chidambaram Ramesh","site":"shroudstory"}]
