[{"title":"Using the Shroud of Turin as a Rorschach Ink Blot","post":"The picture is funny no its not me firstly if you want me to stay and asnwer questions be nice and civil to me or I’ll leave. I have explained on the clip which is now spreading around the net like a virus about the ripped toes how I develope the images. The secret is filming between angles of light and then overlapping the results which incredibly reveal the most brilliant images ever seen. I want to go to a pshyisist to learn exactly why it works. The discovery was made in 2009 while I was experimenting on my music clips I then used it on the Mary Zeitoun Egypt apparition photo have you seen that one look at the baby Jesus with the labels He came from that ghostly white image. The system works and I expected may I call you my peers and friends to ask questions. If I can gain some trust and respect I will tell you all exactly how to do it because since revealing the severed toes I feel sad and a bit depressed and dont feel like developing the entire Shroud body\n\n","date":"February 15, 2011 at 7:28 am","url":"https://shroudstory.com/2011/02/14/using-the-shroud-of-turin-as-a-rorschach-ink-blot/","cat":"art","id":"comment-2466","author":"Vincent Ruello","site":"shroudstory"},{"title":"Using the Shroud of Turin as a Rorschach Ink Blot","post":"Where is the copy? I’ll wait for a major news source, thank you.\n\n","date":"March 25, 2011 at 9:48 am","url":"https://shroudstory.com/2011/02/14/using-the-shroud-of-turin-as-a-rorschach-ink-blot/","cat":"art","id":"comment-2740","author":"episcopalian","site":"shroudstory"},{"title":"Using the Shroud of Turin as a Rorschach Ink Blot","post":"Vinny, I have been nice and civil to you. I offered to read a paper if you would write one. A reader if this blog was not so gentle. But if you are going to put up a YouTube video and make bold claims, like you do, you must expect criticism. \nYou say,”If I can gain some trust and respect I will tell you all exactly how to do it.” Vinny, it doesn’t work that way. If you want trust and respect you will have to earn it. If you want to earn it, tell us exactly how you do it. \nI’ve looked at your shaky videos I don’t see stones over the eyes. I don’t see severed toes. \nYou say, “I have explained on the clip which is now spreading around the net like a virus about the ripped toes how I develope the images.”\nNo you have not explained anything with any satisfactory amount of detail. And your video is not going around like a virus. As of 12:15 GMT, your video has been viewed 40 times on YouTube. People aren’t even linking much from here. \nHere is what you wrote: “I take a close up of the Shroud image I am working on. I alter the frequency of the light angles and refilm. I repeat this process 2 or 3 times depending on how much clarity is required. On overlapping the new images which have had the light frequency altered the incredible and life like images are revealed. This is only made possible because the Shroud is a true photographic negative. To all Shroud scientists if you need more evidence arrange a place and time and you will then see exactly how I alter the light frequencies and over lay the images.”\nFilm or digital? Which image of the Shroud? What magnification? What focal length, aperture, exposure? What different light frequencies? Overlapping using what algorithmic method? How do you know that the image is a true photographic negative?\nTime and place? Not a chance until you write up a proper paper that we can look at.\n\n","date":"February 15, 2011 at 8:39 am","url":"https://shroudstory.com/2011/02/14/using-the-shroud-of-turin-as-a-rorschach-ink-blot/","cat":"art","id":"comment-2467","author":"episcopalian","site":"shroudstory"},{"title":"Using the Shroud of Turin as a Rorschach Ink Blot","post":"Wait a minute you say that you cannot see anything on the eyes well thats is incredible as there is something I revealed on the eyes and the feet you cant see anything there either. Even the Shroud negative blown up with no processing reveals images to the eyes that people see as toes. How can I now take you seriously when you see nothing at all its a total waste of time then, you see nothing so why tell you anything maybe we both need glasses\n\n","date":"February 15, 2011 at 9:09 am","url":"https://shroudstory.com/2011/02/14/using-the-shroud-of-turin-as-a-rorschach-ink-blot/","cat":"art","id":"comment-2468","author":"Vincent Ruello","site":"shroudstory"},{"title":"Using the Shroud of Turin as a Rorschach Ink Blot","post":"Secondly please asmswer this are you Barrie Swortz from Shroud.com if not what is your name and who are you associated with what qualified direct scientific colleagues do you know. Thanks Vinny\n\n","date":"February 15, 2011 at 9:17 am","url":"https://shroudstory.com/2011/02/14/using-the-shroud-of-turin-as-a-rorschach-ink-blot/","cat":"art","id":"comment-2469","author":"Vincent Ruello","site":"shroudstory"},{"title":"Using the Shroud of Turin as a Rorschach Ink Blot","post":"Vinny, I gave you a chance to promote your discoveries. I was critical of your approach. That’s true. I doubted your claims. That’s true. Your claims were, after all, extraordinary. You actually wrote: “I will answer any questions sincerely this is the biggest news in Shroud research in 113 years.” (sic)\nWell, you refused to answer. Instead you eventually wrote,”How can I now take you seriously when you see nothing at all its a total waste of time then, you see nothing so why tell you anything maybe we both need glasses.” (sic) \nWhat I said is I don’t see what you claim to see. I asked others to look and they don’t see stones over the eyes or severed toes. \nThen you went into YouTube and erased questions I had posed and comments that I made without any notification or explanation, as though they never existed. I will not erase existing comments you have made. It is poor netiquette to do so. \nOkay, let’s not waste any more time, Vinny. Until you can answer some very basic questions, as you so clearly said you would, this conversation is over. I expect nothing less than a two page paper with scientific details. At this point, I must ask you to have a scientist (or a high school science teacher) look it over before you send it to me.\nDan Porter, member, Shroud Science Group.\n\n","date":"February 15, 2011 at 10:08 am","url":"https://shroudstory.com/2011/02/14/using-the-shroud-of-turin-as-a-rorschach-ink-blot/","cat":"art","id":"comment-2470","author":"episcopalian","site":"shroudstory"},{"title":"Using the Shroud of Turin as a Rorschach Ink Blot","post":"Sorry I removed your post some words bothered me I am also a musician and very touchy with probably more feelings to hurt than most people. Thankyou for giving me your name. My next step is yes to find a scientist pysicist I believe to look at my work and then I will write or pay him to write the paper but you are not a scientist. Anyway I also have some issues about processing the entire body do you think its right to reveal in total photographic form a person who has died horrifically? I just concentrated on the feet and eyes. We may be in touch thankyou for your time if you do know any credited pyscists let me know. Sincerely Vince\nPS If I have made any mistakes in my findings and a qualified psycists shows me I will admit it but pictures Dan speak a thousand words.\n\n","date":"February 15, 2011 at 10:20 am","url":"https://shroudstory.com/2011/02/14/using-the-shroud-of-turin-as-a-rorschach-ink-blot/","cat":"art","id":"comment-2471","author":"Vincent Ruello","site":"shroudstory"},{"title":"Using the Shroud of Turin as a Rorschach Ink Blot","post":"Hello Dan I have contacted the Catholic Church and will be only dealing from this moment on with the Vatican, their scientists and public relations media. Thankyou for your time and goodbye and Godbless you and your colleagues. Sincerely Vince\n\n","date":"February 17, 2011 at 2:23 am","url":"https://shroudstory.com/2011/02/14/using-the-shroud-of-turin-as-a-rorschach-ink-blot/","cat":"art","id":"comment-2492","author":"Vincent Ruello","site":"shroudstory"},{"title":"Using the Shroud of Turin as a Rorschach Ink Blot","post":"Fine. But you have just posted another thing up on YouTube that is utterly ridiculous. It is not science. It is imagination. And you have proved nothing.\n\n","date":"February 17, 2011 at 4:43 am","url":"https://shroudstory.com/2011/02/14/using-the-shroud-of-turin-as-a-rorschach-ink-blot/","cat":"art","id":"comment-2494","author":"episcopalian","site":"shroudstory"},{"title":"Using the Shroud of Turin as a Rorschach Ink Blot","post":"Clip posted xray imagery.\nThe scientists who carried out 2 and 3d imagery tests were wrong. They made the biggest mistake of \nassumption when they noticed toe tips to the right of the right foot, then they assumed that the left foot \nmust be crossing over the right foot and blaming mysterious unrecorded encrypted data. My close xray \nfilming system has provan them wrong because you can now see 2 large toenails side by side. Forgive \nmy arrow labels not clear but the large toenail on the left is of the right foot and the square clearly \ndefined toenail next to it is from the left foot which is laying side by side to the right foot. There is no \ncross over, The Shroud is true and perfect in revealing all encrypted data if you have the means to see \nit.\n\n","date":"February 17, 2011 at 8:24 pm","url":"https://shroudstory.com/2011/02/14/using-the-shroud-of-turin-as-a-rorschach-ink-blot/","cat":"art","id":"comment-2504","author":"Vincent Ruello","site":"shroudstory"},{"title":"Using the Shroud of Turin as a Rorschach Ink Blot","post":"Dan this is my last message to you. You have treated me with disrespect and judging me before the jury is out and placing the picture of the priest that fellow next to me ridiculing me. How can any respected Shroud researcher scientist argue with my xray images of the 2 large toes side by side proving there is no crossover. Lastly why on God’s earth would I reveal my pioneering filming techniques to you or anyone to reproduce my findings and takel my hard work and credit. All true scientists protect their findings until respected scientists start seeing the truth. At this stage I will wait patiently for the Vatican officials or until I find someone I can work with. You know what I take extreme joy in Dan the xray images of the 2 large toenails side by side especially the clearly defined square left foot nail. But as you would say Dan its just video noise. Over and out\n\n","date":"February 17, 2011 at 9:41 pm","url":"https://shroudstory.com/2011/02/14/using-the-shroud-of-turin-as-a-rorschach-ink-blot/","cat":"art","id":"comment-2505","author":"Vincent Ruello","site":"shroudstory"},{"title":"Using the Shroud of Turin as a Rorschach Ink Blot","post":"Inner West Courier story published 1st March 2011, Sydney Australia 1.2 million readers a week, half page of the decoding of the Shroud by Vincenzo Ruello\n\n","date":"March 18, 2011 at 7:49 pm","url":"https://shroudstory.com/2011/02/14/using-the-shroud-of-turin-as-a-rorschach-ink-blot/","cat":"art","id":"comment-2699","author":"Vincent Ruello","site":"shroudstory"},{"title":"Using the Shroud of Turin as a Rorschach Ink Blot","post":"Dr Dan there needs to be a critical examination of Ruellos work. To dismiss him I think is wrong for the simple reason that he has discovered a face image in the Veronica Veil that has similarities to the Turin Shroud\n\n","date":"April 6, 2012 at 11:15 pm","url":"https://shroudstory.com/2011/02/14/using-the-shroud-of-turin-as-a-rorschach-ink-blot/","cat":"art","id":"comment-10037","author":"Peter Ford","site":"shroudstory"}]
