[{"title":"Waldemar Januszczak doesn’t think the Shroud of Turin is real, BUT . . . (Updated)","post":"En 1979 el doctor Gilbert R.Lavoie se puso en contacto con la Universidad de Harvard, solicitando que le indicaran el nombre de un profesor que fuera especialista en iconografía antigua.\nLe dieron el nombre del Dr. Ernst Kitzinger. ¿Quién era este especialista?\nErnst Kitzinger, judío-alemán nacido en Munich en 1912, uno de los grandes historiadores del arte , especializado en arte antiguo, medieval y bizantino, perteneció al pequeño grupo prodigiosamente dotado de Historiadores del Arte alemanes, que incluyó a Richard Krautheimer, Erwin Panofsky y Kurt Witzmann, y que desarrollaron la mayor parte de su actividad en los Estados Unidos.\nDurante su paso por la Universidad de Harvard dirigió los doctorados de varios de sus estudiantes que como Christine Kondoleon, Irving Lavin, Henry Maguire, Lawrence Nees y Willian Tronzo, serían a su vez muy importantes historiadores del arte.\nEl lector interesado puede encontrar la referencia bibliográfica de su importante obra y su biografía el el “Dictionary of Art Historians”, Diccionario de Historiadores del Arte asociado a la Universidad de Duke\nhttp://www.dictionaryofarthistorians.org/kitzingere.htm\nLavoie tuvo suerte, pues pudo encontrarse con Kitzinger justo antes de que éste partiera para Inglaterra, en la que planeaba vivir su retiro.\nLa consulta de Lavoie, que estaba trabajando sobre las marcas de sangre, fue:\n-¿Puede usted mostrarme trabajos de artistas que hayan pintado marcas de sangre como las que usted ve en la Sábana Santa de Turín?.\nY esta fue la contestación de Ernst Kitzinger:\n“La Sábana Santa de Turín es única en el arte. No entra en ninguna categoría artística.\nPara nosotros, un grupo muy pequeño de expertos en todo el mundo, creemos que la Sábana Santa de Turín es realmente la Sábana Santa de Constantinopla. Ustedes saben que los cruzados tomaron muchos tesoros de regreso a Europa durante el siglo XIII y creemos que la Sábana Santa es uno de ellos.\nEn cuanto a las marcas de sangre hechas por los artistas, no hay cuadros que tengan marcas de sangre como los de la Sábana Santa. Usted es libre de buscar…..pero no los encontrará”.\n\n","date":"December 27, 2011 at 8:28 am","url":"https://shroudstory.com/2011/12/27/waldemar-januszczak-doesnt-think-the-shroud-of-turin-is-real-but/","cat":"art","id":"comment-6169","author":"co","site":"shroudstory"},{"title":"Waldemar Januszczak doesn’t think the Shroud of Turin is real, BUT . . . (Updated)","post":"Google Translation:\nIn 1979 Dr. Gilbert R. Lavoie be contacted Harvard University, requesting that you indicate the name of a professor who was a specialist in ancient iconography.\nHe was given the name of Dr. Ernst Kitzinger. Who was this expert?\nErnst Kitzinger, Jewish-German born in Munich in 1912, one of the great art historian specializing in ancient art, medieval and Byzantine small group belonged to the prodigiously gifted German Art Historians, which included Richard Krautheimer, Erwin Panofsky and Kurt Witzmann, and developed most of its activity in the United States.\nDuring his tenure at Harvard University led the doctorates of several of his students like Christine Kondoleon, Irving Lavin, Henry Maguire, Lawrence Nees and William Tronzo, would in turn important art historians.\nThe interested reader can find the citation for his important work and his biography on the “Dictionary of Art Historians,” Dictionary of Art Historians associated with Duke University\nhttp://www.dictionaryofarthistorians.org/kitzingere.htm\nLavoie was lucky Kitzinger could meet just before he left for England, where he planned to live out their retirement.\nThe consultation Lavoie, who was working on the marks of blood, was:\n– Can you show work by artists who have painted as blood marks you see on the Shroud of Turin?.\nAnd this was the answer to Ernst Kitzinger:\n“The Shroud of Turin is unique in the art. Do not fall into any category of art.\nFor us, a very small group of experts around the world, we believe that the Shroud of Turin is actually the Shroud of Constantinople. You know that the Crusaders took many treasures back to Europe in the thirteenth century and believe that the Shroud is one of them.\nAs for the blood marks made by the artists, there are no pictures with marks of blood such as the Shroud. You are free to find ….. but do not find it. “\n\n","date":"December 27, 2011 at 8:55 am","url":"https://shroudstory.com/2011/12/27/waldemar-januszczak-doesnt-think-the-shroud-of-turin-is-real-but/","cat":"art","id":"comment-6174","author":"episcopalian","site":"shroudstory"},{"title":"Waldemar Januszczak doesn’t think the Shroud of Turin is real, BUT . . . (Updated)","post":"I don’t think it takes an expert in ‘Art History’ to note this was not a piece of art created by some medieval or anyother period artist. I think people like Januszczak, tend to errogantly believe other’s lack the abilities to critic such things. I for one, can instinctly recognize this is not a artist’s rendition, “Just on viewing alone”. I don’t even have to mention facts such as the 3D encoding, as I think anyone with eyes and even mediocre knowledge in art can recognize that this image on the Shroud is UNIQUE in it’s ‘qualities’, ‘realism’, and definately not ‘representative’ of any medieval paintings AT ALL….NOT EVEN CLOSE!  It is an incredibly ridiculous claim by one who is supposed to be knowledgeable in such matters. \nR\n\n","date":"December 27, 2011 at 6:02 pm","url":"https://shroudstory.com/2011/12/27/waldemar-januszczak-doesnt-think-the-shroud-of-turin-is-real-but/","cat":"art","id":"comment-6191","author":"Ron","site":"shroudstory"},{"title":"Waldemar Januszczak doesn’t think the Shroud of Turin is real, BUT . . . (Updated)","post":"Re; Update- I would also guess Mr. Januszczak is not aware of the Christ portrait found in the catacombs in Rome dating around 300AD. Which by the way also bears a striking resemblance to face seen on the Shroud. Although dated to 300AD some believe it may be of an earlier date, possibly even the 1st century and quite plausibly painted by someone whom actually had seen Jesus.\nR\n\n","date":"December 28, 2011 at 7:22 am","url":"https://shroudstory.com/2011/12/27/waldemar-januszczak-doesnt-think-the-shroud-of-turin-is-real-but/","cat":"art","id":"comment-6213","author":"Ron","site":"shroudstory"}]
