[{"title":"What Did Jesus Look Like Throughout History?","post":"“What did Jesus look like?” demonstrates that ignorance abounds, even when it comes to Fox News hosts. There are no white, black and yellow races, these are popular terms, and the scientific terms, used in Anthropology, are caucasoid, negroid, mongoloid and so on. Being a Jew Jesus was caucasoid and probably tanned, walking more in the countryside and avoiding cities.\nWith all this recent talk about Manoppello, Shroudies will have to choose between the “Veronica” (when he was alive) and the TS (when he was dead) to decide what he looked like.\n\n","date":"December 19, 2013 at 7:33 pm","url":"https://shroudstory.com/2013/12/19/what-did-jesus-look-like-throughout-history/","cat":"art","id":"comment-62722","author":"Louis","site":"shroudstory"},{"title":"What Did Jesus Look Like Throughout History?","post":"There is another possibility, Louis:","date":"December 19, 2013 at 7:40 pm","url":"https://shroudstory.com/2013/12/19/what-did-jesus-look-like-throughout-history/","cat":"art","id":"comment-62725","author":"O.K.","site":"shroudstory"},{"title":"What Did Jesus Look Like Throughout History?","post":"Hi O.K. It could be telepathy(!) but I was thinking about you as the first person who should be asked for an opinion. You gave it, and that means you have chosen the TS face not the “Veronica”!\n\n","date":"December 19, 2013 at 7:46 pm","url":"https://shroudstory.com/2013/12/19/what-did-jesus-look-like-throughout-history/","cat":"art","id":"comment-62730","author":"Louis","site":"shroudstory"},{"title":"What Did Jesus Look Like Throughout History?","post":"Interesting study in some historical art representing Jesus.  One thing the article has backwards is calling those who call into question the carbon dating as “skeptics.”  There is no doubt whatever that the carbon dating does not represent the date of the Shroud itself, but of a potential unknown repair.  It would be the skeptic who accepted the carbon dating.\n\n","date":"December 19, 2013 at 8:31 pm","url":"https://shroudstory.com/2013/12/19/what-did-jesus-look-like-throughout-history/","cat":"art","id":"comment-62748","author":"Andy Weiss","site":"shroudstory"},{"title":"What Did Jesus Look Like Throughout History?","post":"“There is no doubt whatever that the carbon dating does not represent the date of the Shroud itself, but of a potential unknown repair.” Really? I’m quite skeptical about that…\nSkeptics are people who don’t accept sentences that begin: “There is no doubt whatever that….” It doesn’t really matter whether the rest of the sentence is: “… the shroud is authentic” or “… the shroud is a forgery.”\nWhat is the opposite of “Skeptic,” I wonder? Dogmatist? Thesaurus.com gives Believer, Optimist, Devotee and Disciple.\nIt is true that those who describe themself as “Shroud Skeptics” are usually not merely skeptical of authenticity, but fanatically convinced of the “fake it and flog it” school of thought. That’s deeply offensive to us real skeptics…\n\n","date":"December 20, 2013 at 6:35 am","url":"https://shroudstory.com/2013/12/19/what-did-jesus-look-like-throughout-history/","cat":"art","id":"comment-63064","author":"Hugh Farey","site":"shroudstory"},{"title":"What Did Jesus Look Like Throughout History?","post":"\nLouis :\nHi O.K. It could be telepathy(!) but I was thinking about you as the first person who should be asked for an opinion. You gave it, and that means you have chosen the TS face not the “Veronica”!\n\n???\nI don’t know what do you mean. The TS and Manoppello faces are compatible, but each is represented in its own unique way. I do not see any contradiction that would force me to choose between the two. As to Divine Mercy Image painted by Kazimirowski based on Saint Faustina visions, here you have some comparisons with TS and Manoppello:http://www.sanctepater.com/2010/04/shroud-of-turinvilnius-divine-mercy.html \nThe similarities are fascinating, especially when compared with later and more popular version painted by Hyła after Faustina death. But of course this is hardly a scientific evidence.\n\n","date":"December 20, 2013 at 7:51 am","url":"https://shroudstory.com/2013/12/19/what-did-jesus-look-like-throughout-history/","cat":"art","id":"comment-63115","author":"O.K.","site":"shroudstory"},{"title":"What Did Jesus Look Like Throughout History?","post":"O.K. It is a clever superimposition, similar to what was done by the then Pfeiffer/Bulst duo years ago for their book. So how many times do you think that Jesus left his image on cloth?\nOnce on the veil, the second time on the Shroud? There is no mention of Veronica in the Gospel, just what can be reasonably be interpreted as a burial shroud. You must have noticed that there is conflicting data, and the problem becomes worse because of the Church’s refusal to permit examination of the “Veronica” shown to the faithful at St. Peter’s Basilica during Lent and the glass covering the image in Manoppello cannot be removed.\nWhat I want to say is that we have to move slowly, not jump to hasty conclusions. More data is needed,both in the case of the TS and the “Veronica”.  \nDid you see what Phil Dayvault found in Turkey? In your view is that mosaic similar to what we can extract from the face on the Shroud or does it comes closer to what is seen in Manoppello?\n\n","date":"December 20, 2013 at 9:40 am","url":"https://shroudstory.com/2013/12/19/what-did-jesus-look-like-throughout-history/","cat":"art","id":"comment-63204","author":"Louis","site":"shroudstory"},{"title":"What Did Jesus Look Like Throughout History?","post":"Louis: I fully agree one cannot jump to hasty conclusions, either that Manoppello is a divine miracle or just a simple painting, like most people do. The publications on Manoppello are usually exaggerated in either way, that’s why it is hard to get balanced and unbiased view on it. But what I want to stress, the Manoppello cannot be ignored, contrary to the temptation of many Shroud scholars.\nSo how many times do you think that Jesus left his image on cloth? Once on the veil, the second time on the Shroud?\nIt has been suggested that Manoppello had been laid on TS, see http://www.sudariumchristi.com/uk/tomb/byssus.htm  There are also claims by Fanti and Maggiolo about ‘double superficiality’ of the front TS image, and Jakcson’s ‘Collapse Theory’. So, speaking theoretically, there could be more clothes, shrouds, and napkins with the image of Jesus upon them. Perhaps some radiation created some changes in the byssus yarns… -but those are mostly wild speculations now.\nThere is no mention of Veronica in the Gospel, just what can be reasonably be interpreted as a burial shroud.\nOf course there is no mention of Veronica in the Gospels, and there is no evidence such legendary encounter, but the origin and evolution of the legend is a very complex matter. See Massimo Centini’s  Alla ricerca della Veronica for example. There are stories about some miraculous images of Christ (or faithul represantations of how He looked like) circulating since the very early  centuries of Christianity. And perhaps based not only on a single prototype.\nDid you see what Phil Dayvault found in Turkey? In your view is that mosaic similar to what we can extract from the face on the Shroud or does it comes closer to what is seen in Manoppello?\nI don’t know what you have on mind. For some cappadocian paintings , see http://manoppello.eu/eng/index.php?go=kapadocja \nIt is hard to tell whether those paintings were based more on the Shroud, or on the Manoppello (assuming they are both genuine). That’s  why many scholars, ranging from Wilson, would prefer that there is no Manoppello. It solves some problems, but complicates the situation enormously. For example the strand of hair, the most prominent feature, is present on both TS and Manoppello. There is not one, but two possible prototypes -and how to distinguish which is which in some cases? But in some others, it is possible.\nRemember, there were two allegedly miraculous Images -of Edessa, and of Camoulia (Camouliana). And there are TS and Manoppello.\n\n","date":"December 20, 2013 at 5:18 pm","url":"https://shroudstory.com/2013/12/19/what-did-jesus-look-like-throughout-history/","cat":"art","id":"comment-63547","author":"O.K.","site":"shroudstory"},{"title":"What Did Jesus Look Like Throughout History?","post":"O.K. That’s right, the Manoppello veil cannot be ignored, it is certainly not a simple painting, and there is more to it than what has been discovered so far. How the rest will be done only God knows.\nWell, for the time being we have to continue with research and the time,books and energy you have makes you the right person for the job.\n\n","date":"December 20, 2013 at 6:42 pm","url":"https://shroudstory.com/2013/12/19/what-did-jesus-look-like-throughout-history/","cat":"art","id":"comment-63621","author":"Louis","site":"shroudstory"},{"title":"What Did Jesus Look Like Throughout History?","post":"Christians should not be so bothered about what Jesus looked like but ponder about how he would act in the face of injustice. Father David Neuhaus, the Jewish-born Jesuit at the Latin Patriarchate in Jerusalem gave an interesting interview about racism and injustice.\nhttp://en.lpj.org/2013/12/20/in-south-africa-i-learned-to-rise-against-injustice-f-neuhaus/\n\n","date":"December 20, 2013 at 12:52 pm","url":"https://shroudstory.com/2013/12/19/what-did-jesus-look-like-throughout-history/","cat":"art","id":"comment-63354","author":"Louis","site":"shroudstory"},{"title":"What Did Jesus Look Like Throughout History?","post":"Just from the perspective of an ignorant layman, the first time I saw the Manopello cloth(in one of Ian Wilson’s books I think) I thought “fake!”. Some of the other so called holy faces, Mandylion copies and “Veronica” clothes that resemble the Shroud more closely look more authentic to me. The Manopello cloth just looks like a painting to me, and not even a particularly good one. Just my opinion.\n\n","date":"December 20, 2013 at 6:15 pm","url":"https://shroudstory.com/2013/12/19/what-did-jesus-look-like-throughout-history/","cat":"art","id":"comment-63596","author":"Chesterbelloc","site":"shroudstory"},{"title":"What Did Jesus Look Like Throughout History?","post":"Appearances can be deceptive, remeber. See this page http://manoppello.eu/eng/\n\n","date":"December 20, 2013 at 6:24 pm","url":"https://shroudstory.com/2013/12/19/what-did-jesus-look-like-throughout-history/","cat":"art","id":"comment-63606","author":"O.K.","site":"shroudstory"},{"title":"What Did Jesus Look Like Throughout History?","post":"Off topic…I was just looking at shroud scope, and something struck me which has never struck me before…the distance from where the elbows approximately sit to where the   shoulders would be expected seems too great. This is cause for concern in terms of authenticity…any views???\n\n","date":"December 21, 2013 at 6:16 am","url":"https://shroudstory.com/2013/12/19/what-did-jesus-look-like-throughout-history/","cat":"art","id":"comment-64019","author":"Matthias","site":"shroudstory"},{"title":"What Did Jesus Look Like Throughout History?","post":"Remember that this Man was hanging on the cross.\n\n","date":"December 21, 2013 at 7:06 am","url":"https://shroudstory.com/2013/12/19/what-did-jesus-look-like-throughout-history/","cat":"art","id":"comment-64059","author":"O.K.","site":"shroudstory"},{"title":"What Did Jesus Look Like Throughout History?","post":"Various people have commented on this. It is often attributed to a dislocation of the shoulders either during crucifixion or as the arms were forced down into their current position from the position they were in when rigor mortis set in. It is also quoted as evidence that the Shroud is a fake. It is occasionally mentioned as evidence that Jesus had one or other skeletal abnormality such as Marfan’s syndrome. Forensic pathologists tend to remark that the image is perfectly proportioned.\n\n","date":"December 21, 2013 at 8:14 am","url":"https://shroudstory.com/2013/12/19/what-did-jesus-look-like-throughout-history/","cat":"art","id":"comment-64106","author":"Hugh Farey","site":"shroudstory"},{"title":"What Did Jesus Look Like Throughout History?","post":"Would this observation not also be a concern for a forgery then too? Why would a forger go to such extremes to make such an otherwise anatomically correct body image but get the elbow shoulders wrong? I think it’s more likely a possible discrepancy caused by natural distortion from the image process – or as OK noted a byproduct of the crucifixion itself.\nGood observation though!\n\n","date":"December 21, 2013 at 8:08 am","url":"https://shroudstory.com/2013/12/19/what-did-jesus-look-like-throughout-history/","cat":"art","id":"comment-64100","author":"David Goulet","site":"shroudstory"},{"title":"What Did Jesus Look Like Throughout History?","post":"We do not know what the imaging process was. How was the cloth draped or wrapped around the body? Why is the image a near orthogonal projection with no lateral distortion? Why is there no image of the sides, nor of the crown of the head? At the crown, the image changes abruptly from ventral to dorsal.  It is as if the imaging action was fundamentally vertical, rather than an emanation from the body surface.  This might argue for a decisive influence from within the earth, such as radon gas. That it is not a perfect image might argue against it being miraculous. The pathologists saying that the body is perfectly proportioned, refers I think to a general observation of a trend, rather an exactitude in particular detail. That some claim to observe that there are paticular distortions, (such as elbows, long fingers etc) suggest random fluctuations in some kind of naturalistic process. Nobody knows. Nobody knows. Nobody knows.\n\n","date":"December 21, 2013 at 10:43 pm","url":"https://shroudstory.com/2013/12/19/what-did-jesus-look-like-throughout-history/","cat":"art","id":"comment-64724","author":"daveb of wellington nz","site":"shroudstory"},{"title":"What Did Jesus Look Like Throughout History?","post":"In one form or another it is the most used argument for the Holy Shroud’s authenticity: nobody knows how the image was formed therefore it is real.\n\n","date":"December 22, 2013 at 6:53 am","url":"https://shroudstory.com/2013/12/19/what-did-jesus-look-like-throughout-history/","cat":"art","id":"comment-64936","author":"+Dunk","site":"shroudstory"},{"title":"What Did Jesus Look Like Throughout History?","post":"Many precious icons and paintings in Orthodox Churches in Eastern  European countries like Albania were destroyed by anti-Christian vandals some years ago and the same may happen in Syria. Shroudies will probably require cooperation from Arab Orthodox Churches who also have such icons and paintings and literature in order to try to find clues to trace the history of the Shroud.\nThis week the Syrian Orthodox Archbishop Mor Cyril Aphrem Karim met with President Obama and has called his attention to the plight of Christians in Syria:\nhttp://www.syrianorthodoxchurch.org/news/2013/12/23/his-eminence-mor-cyril-aphrem-karim-delivers-a-letter-to-president-barak-obama\n\n","date":"December 23, 2013 at 7:24 pm","url":"https://shroudstory.com/2013/12/19/what-did-jesus-look-like-throughout-history/","cat":"art","id":"comment-66029","author":"Louis","site":"shroudstory"}]
