[{"title":"Why don’t I see the swollen nose in any of the art?","post":"Off topic but… was just reading about the fourth crusade, it was launched from       Venice, destination Constantinople. Treasures were plundered, and many found there way back to Venice. Is it merely coincidence that the earliest shroud-like epitaphios has its known origins in Venice circa 1200?\n\n","date":"August 8, 2013 at 10:15 am","url":"https://shroudstory.com/2013/08/08/why-dont-i-see-the-swollen-nose-in-any-of-the-art/","cat":"art","id":"comment-40737","author":"matthias","site":"shroudstory"},{"title":"Why don’t I see the swollen nose in any of the art?","post":"Why ask us, why not ask the artist?? \n>________________________________ > From: Shroud of Turin Blog  >To: ekmcmahon@att.net  >Sent: Thursday, August 8, 2013 5:11 AM >Subject: [New post] Why don’t I see the swollen nose in any of the art? >   > WordPress.com  >Dan posted: “Stephen Jones has added the next installment 3.4 (part 22) of The Bible and the Shroud with The man on the Shroud was beaten. It is a well organized treatment of how observed facial characteristics, presumably caused by beating, seem to be evident in some”   >\n\n","date":"August 8, 2013 at 5:22 pm","url":"https://shroudstory.com/2013/08/08/why-dont-i-see-the-swollen-nose-in-any-of-the-art/","cat":"art","id":"comment-40771","author":"ekmcmahon","site":"shroudstory"},{"title":"Why don’t I see the swollen nose in any of the art?","post":"Simple answer is that the 7th century artists did not have the advantage of a VP-8 Image Analyser to perceive the injuries so explicitly in 3 dimensions. Also the icons usually represent an idealised triumphant Christ. Nevertheless the injuries seem more explicit on the gold coins issued by Justinian II (~692) and by Constantine VII Porphyrogennetos, unless these are conjectured as roughness in the minting dies. Commentary in Stephen Jones’ examples asserts that cheek injuries are reflected in the art work.\n\n","date":"August 8, 2013 at 7:04 pm","url":"https://shroudstory.com/2013/08/08/why-dont-i-see-the-swollen-nose-in-any-of-the-art/","cat":"art","id":"comment-40777","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Why don’t I see the swollen nose in any of the art?","post":"I just can’t accept the arguments that the artworks reflect the shroud face in the manner Stephen suggests. As Daveb says, if the artists viewed the shroud they didn’t have the advantage of our modern images\n\n","date":"August 8, 2013 at 11:31 pm","url":"https://shroudstory.com/2013/08/08/why-dont-i-see-the-swollen-nose-in-any-of-the-art/","cat":"art","id":"comment-40786","author":"Matthias","site":"shroudstory"},{"title":"Why don’t I see the swollen nose in any of the art?","post":"just my thoughts. The shroud is obviously the last material object that was in contact with Jesus’s body at the instant of resurrection. The image is a result of a supernatural event that will never be duplicated again. Man will never duplicate the image and never explain the mechanism of its making; just as science can not say what happen the instant before the big bang. I sincerely believe 1000 years from now the same questions will still be asked with no answers.\n\n","date":"August 8, 2013 at 11:46 pm","url":"https://shroudstory.com/2013/08/08/why-dont-i-see-the-swollen-nose-in-any-of-the-art/","cat":"art","id":"comment-40787","author":"Paul","site":"shroudstory"},{"title":"Why don’t I see the swollen nose in any of the art?","post":"On June 9, 2013 at 6:52 am | #57\nReply |, I wrote: \n“The visual fact is, anyone observing the TS man’s face will (at first and maybe even second and third sight)‘thinks he sees’ an ‘almost’ normal nose.\nHowever a very close examination of the face in terms of geometrical projection made from a life-size photograph tells us ‘a quite different story’:\nTo the sole exception of the bony areas of the eye-sockets and nasal septum, all the rest of the face shows irregular features and displacements.”\nNow on the obverse of more than half a dozen of specimens of Justinian II’s solidi, Christ nose does look skewed, which is consistent with the TS face having been covered with a transparent (silk) veil bearing a Christ face in it too (a more or less marked skewing due both to slight displacement of two clothes + forensic reality as far as the TS man nose image is concerned).\nOn June 9, 2013 at 6:52 am | #57\nReply |, I added: \n“Once carefully overlaid (at scale 1:1), the two holy faces (Manoppello Veil and Turin Shroud) do reveal the face of a man with a ‘skewed nose’. This is confirmed by Byzantine numismatics in more than half a dozen of extant gold coin obverses featuring a ‘Shroud-Veil-like’ Christ Pantocrator.”\nA question then immediately arises: could not the two holy clothes/relics have been known at a moment in time as only one and the same image: the Image of Edessa and then as two separate clothes aka as the Holy Mandylion and Holy Shroud/Himation of Constantinople aka The Holy Veronica of Rome and The Holy Shroud of Lirey aka the Holy Veil of Manoppello and the Holy Shroud of Turin? \nBesides the skewed-nosed Christ on several Justinian II solidus obverse, the Christ face does show on a very few specimens of the same coin type, the very sign of a broken nose (an upside down v-shaped mark on the nasal septum that is morphologically and topologically consistent with Thierry Castex’s 3D dramatic rendering of the Shroud face.\nThus most likely, because a couple of Byzantine artists copied the Holy Shroud/Himation face covered with the Christ transparent face in the Holy Mandylion/Veronica/Veil, the nose looked more skewed and/or broken than swollen. \nChrist skewed and/or broken nose in Art are exceptions/variants that both tend to prove the canonical iconological rule (Christ with a straight non-swollen nose) and confirm the Christ face prototype that was used was a far more complex one than Art Historians and even most if not all Shroud scholars could think at first and second or even third sight.\n\n","date":"August 9, 2013 at 7:43 am","url":"https://shroudstory.com/2013/08/08/why-dont-i-see-the-swollen-nose-in-any-of-the-art/","cat":"art","id":"comment-40810","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why don’t I see the swollen nose in any of the art?","post":"So, Max. Stephen’s analysis is baloney, right?\n\n","date":"August 9, 2013 at 11:17 am","url":"https://shroudstory.com/2013/08/08/why-dont-i-see-the-swollen-nose-in-any-of-the-art/","cat":"art","id":"comment-40828","author":"Paulette","site":"shroudstory"},{"title":"Why don’t I see the swollen nose in any of the art?","post":"BOTH the TS face on one hand and the Christ face on te other hand as featured in Late Antique, Syriac, Byzantine and Medieval iconography DO show irregular features and displacements. Re the nose issue, the latter is an issue within the issue. Don’t you mistake me. Is the nose just swollen, just deviated, just swollen and deviated or swollen, deviated and really broken? \nOn October 24, 2012 at 3:04 pm (#3 Reply), I wrote as an Addendum:\n“(…) Forensically speaking, a slight deviation of the fleshy tip of the TS man’s nose was detected. This obsevation was done in the 1970s, that is WELL BEFORE the Manopello Veil face was scientifically examined.Now Iconographically speaking, the same feature happens to be ALSO detectable on the MV face. \nIn the mortuary/morgue, corpses with “skewed/deviated nose tip” are a well known fact. It is mainly due to excessive pressure exerted on the defuncted’s face as the corpse had remained tightly zipped up into a body bag. This is additional evidence the TS man was tightly wrapped up in his burial shrouds.\nAll the forensic pieces of evidence as far as the Ts face is concerned shall be REvisited both in se and in the light of artistic interpretations of the Christ face iconography.”\n\n","date":"August 10, 2013 at 5:03 am","url":"https://shroudstory.com/2013/08/08/why-dont-i-see-the-swollen-nose-in-any-of-the-art/","cat":"art","id":"comment-40873","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why don’t I see the swollen nose in any of the art?","post":"Addendum: on July 3, 2012 at 12:02 pm | #33\nReply |, I also wrote:\n“writers (e.g., MARTIALIS Martial) used the Greek word sindon in LATIN as early as the 1st century CE in accounts of very fine linen, silk and sea Byssus veil. In 4th century CE LATIN (e.g., Vulgata), THE SAME WORD comes to also refer to the burial of Rabbi Yeshua of the synoptic gospels (Matthew, Mark and Luke).” Thus it must be REMINDED that the LATIN sindon can refer to both Yeshua’s burial cloth AND his Byssus face veil (bearing the atropaic Christ image of his face with open eyes and mouth without a neck).\nBesides Syriac and Greek, Latin was one of the three main languages used in Edessa while Greek only took over Latin not until the seventh c CE in the Byzantine Empire.\nBoth the confusion between the Greek Mandylion (as a very fine Byssus veil) and Sindon (as Yeshua’s burial cloth) would then find here its philological explanation and also be consistent with the very fact, in a moment in time,  the apotropaic Image of Edessa could have referred to two clothes/contact relics kept within one and sole reliquary tablet with central oculus showing the face with open eyes and mouth in the transparent byssus ‘mindiil’ covering the bloody death mask on the long burial linen sheet.\n\n","date":"August 10, 2013 at 5:57 am","url":"https://shroudstory.com/2013/08/08/why-dont-i-see-the-swollen-nose-in-any-of-the-art/","cat":"art","id":"comment-40878","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why don’t I see the swollen nose in any of the art?","post":"Typo: apotropaic\n\n","date":"August 10, 2013 at 5:59 am","url":"https://shroudstory.com/2013/08/08/why-dont-i-see-the-swollen-nose-in-any-of-the-art/","cat":"art","id":"comment-40879","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why don’t I see the swollen nose in any of the art?","post":"Reminder: Iconographicaly speaking, the Holy Face of the Holy Mandylion is depicted BOTH in portrait AND landscape mode and  features NOT ONLY a couple of variants/characteristics typical of the Holy Face in the Manoppello Veil but also (and MOST CURIOUSLY) typical of the Holy Face of the Holy Shroud.\n\n","date":"August 10, 2013 at 7:12 am","url":"https://shroudstory.com/2013/08/08/why-dont-i-see-the-swollen-nose-in-any-of-the-art/","cat":"art","id":"comment-40884","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why don’t I see the swollen nose in any of the art?","post":"BTW the Christ Pantocrator, c. 1100 from dome of Church at Daphni, near Athens does show a large/swollen nose with enlarged left nostril.\n\n","date":"August 11, 2013 at 4:08 am","url":"https://shroudstory.com/2013/08/08/why-dont-i-see-the-swollen-nose-in-any-of-the-art/","cat":"art","id":"comment-40951","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why don’t I see the swollen nose in any of the art?","post":"On October 24, 2012 at 4:35 pm | #9\nReply |,  I wrote :\n“Shall I endlessly repeat: Ancient observers/copysts would in fact report as observations and/or copy BOTH what they did really see and/or what they believed they saw.\nThey may also have had specific agendas (e.g. “to clean up” the original swollen Christ face in blood).”\n\n","date":"August 11, 2013 at 6:02 am","url":"https://shroudstory.com/2013/08/08/why-dont-i-see-the-swollen-nose-in-any-of-the-art/","cat":"art","id":"comment-40956","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why don’t I see the swollen nose in any of the art?","post":"Note: ‘They’ above means MOST of the Artists who depicted the Christ faces then.\n\n","date":"August 11, 2013 at 6:05 am","url":"https://shroudstory.com/2013/08/08/why-dont-i-see-the-swollen-nose-in-any-of-the-art/","cat":"art","id":"comment-40957","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Why don’t I see the swollen nose in any of the art?","post":"See “Some remarks on the relationship between the Shroud of Turin and Michelangelo’s Last Judgement (Sistine Chapel)” on http://www.rubensdepot.webs.com/\nespecially fig.4-6\n\n","date":"August 11, 2013 at 10:39 am","url":"https://shroudstory.com/2013/08/08/why-dont-i-see-the-swollen-nose-in-any-of-the-art/","cat":"art","id":"comment-40968","author":"Jos Verhulst","site":"shroudstory"}]
