[{"title":"You cannot fold and unfold a painting (and more)","post":"It is a point worth making. However the Besançon Shroud, which no one disputes was a painting, was in use for at least 200 documented years before being destroyed. I wonder how that was stored?\n\n","date":"January 18, 2015 at 4:51 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-184238","author":"Hugh Farey","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"So true.\n\n","date":"January 18, 2015 at 8:04 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-184269","author":"Andy","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"The copy of Sanlúcar de Barrameda could have been folded in a rectangular way for centuries and it seems to be very well preserved without the slightest hint of damage along the fold lines:\nhttp://www.academicjournals.org/articl/article1380797649_Barta%20and%20Carrascosa.pdf \nPage 11: image\nPage 10: info\nPerhaps the gesso-based paintings behave differently?\n\n","date":"January 18, 2015 at 8:17 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-184272","author":"Henrik","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"The link doesn´t seem to work, try this instead:\nhttps://www.google.se/?gws_rd=ssl#q=http:%2F%2Fwww.academicjournals.org%2Farticle%2Farticle1380797649_Barta%2520and%2520Carrascosa.pdf\n\n","date":"January 18, 2015 at 8:23 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-184273","author":"Henrik","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Thanks Henrik for recalling me this interesting paper.\nThere are some points I wish to comment.\nLooking at the many reproductions of the face (Fig.1), we better understand how far were the medieval painters from the concept of negativity. They tried to simply reproduce what they saw. They made several mistakes . In most reproductions we understand that they tried to “reconcile” the “strange” figure they saw with the usual characteristics of a human shape, an albedo (see for example the rounded open eyes).\nIn the context of the Shroud, Negativity is linked to some kind of body/fabric distance.\nOn the basis of the reproductions, it is even not obvious that a medieval painter could think in such a way.\nSome of the reproductions do show an attempt to reproduce the faintness of the image.\nThis fact implies that about 150 years after Lirey, the Shroud image was more or less as faint as today.\nFig.23 and 24 show pigment flakes, not found on the Shroud.\nFor some of you, the pigments disappeared with time and/or (alleged) washing etc…living only the medium (Gesso, Gum Arabic ….).\nEven in this case, I think it is impossible for many reasons.\n\n","date":"January 19, 2015 at 3:56 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-184598","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"‘Some of the reproductions do show an attempt to reproduce the faintness of the image.’ A point I’ve made several times. Apparently falling on some peoples’ deaf ears.\n\n","date":"January 20, 2015 at 2:11 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-184774","author":"Thomas","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Thomas, as you know I rely heavily on the depictions and descriptions of the Shroud that put together give a very strong case for the more prominent nature of the images as they were originally. It is surely wrong to neglect these particularly when observers note the Crown of Thorns  in place and one can also see it in numerous  depictions.\nLet us take one small point. If you look at the Lier copy and  every depiction of the Shroud in the seventeenth century that I know of then you can see that the hair on the dorsal image reaches around the back of Christ’s head. Yet you cannot see that today and Ian Wilson always shows a pony tail.  So this is convincing evidence that the Shroud image today is not as it once was. ( the pint is made by comparing the way the hair is shown to confirm that different artists were seeing the same thing.)\nIn this it would be typical of almost every ancient artefact we know unless it has been kept in very special\nconditions or made of something more solid than linen and pigments. So it makes sense to take as the secondary aim of all Shroud research – what did the Shroud look like when it was ORIGINALLY made. This is the focus of my own research.\nThe primary aim is,of course, to establish what kind of loom the Shroud was woven on as the weave comes before the images and if you can date the weave then you have a basis to work from for the creation of the images. I have not yet found a weaver specialising in ancient textiles who thinks it is anything other than a typical weave of a medieval treadle loom so it is over to the authenticists to challenge this. It is the width, a standard medieval treadle loom width, and the length that gives it away.\nI have no problems with Hugh, in his recent editorial, and in the review of my article ,in saying my article is not definitive. We do need a database of all the copies and the depictions of the Shroud before we can fulfil the second aim of defining what the Shroud once looked like. This seems so basic!\nI have searched high and low for other liturgies that involve the display of a painted linen cloth with images of the buried Christ on it. The Quem Queritis ceremony certainly did but there may be others.\nAnd everyone ducks the sudden appearance in the fourteenth century of the all over flagellation marks that are seen in sculpture and painting. I have provided, courtesy of Professor Marrow, an explanation of this based on scriptural inspirations. You need to provide evidence that ancient scourging did in fact cover the whole body front and back.\nTo take up a point Hugh (?) made in his review of my article, once the pigments started to flake off or disintegrate ( as they do appear to be in the 1868 exposition when the Shroud had to be shown in a frame for the first time,) then they would gradually all come off- perhaps in one of the thirty year storage periods of the nineteenth century. Normally the linen would then be thrown away but the Savoys could hardly throw away the Shroud. And I suppose they could hardly repaint it although we do know that some painted linens were touched up when they began to fade.\nSo, as I said in an earlier posting, we are at the stage of research on the Shroud, with many false avenues taken so far, that the Egyptian pyramids were in the 1880s. The first task is to assemble the evidence of the Shroud in the past in a way that is open to scholars to examine and compare.\n\n","date":"January 21, 2015 at 4:16 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185039","author":"Charles Freeman","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"The depictions. The fullest set is from the catalogue of the Savoy collection, 1998 although some of these were apparently destroyed. I have checked through my 35 photocopies ( hard to find the catalogue but the Cambridge University Library has a copy) and every single one shows the long hair and the Crown of Thorns in place.\nThen there are the examples on display in Turin in the Shroud Museum- i assume they will have more in storage.\nThen Beldon Scott has made his own collection – many illustrated in his book on the Shroud.\nBut there must be many more- I tracked down one from 1608 in the British Museum and the Royal Library in Turin sent the HT picture researcher one we had not asked for that I had never seen before- so I assume they will have others in the Library.\nGathering these depictions together would not be difficult  for a Master’s /PhD thesis, the problem would be arranging and paying for the copyrights so that the whole lot, plus the copies, could be put on the web and made open to anyone interested as in Mario’s Shroudscope. Then we really would be able to get a move on!\n\n","date":"January 21, 2015 at 5:33 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185056","author":"Charles Freeman","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Article on Zittau Veil (in Villers)- a painted linen veil from 1472.  ‘In total, the cloth must have been suspended in the church, taken down and packed more than 200 times, before being stored for nearly 160 years, After its rediscovery (1840)it was rotated on wooden cylinders and then stored for another fifty years. . . .A photograph from the beginning of the twentieth century shows that the veil must have been in good condition until the Second World War , ..; from our point of view the cloth was in a nearly intact state.’ (Then the paintings on the central panels disintegrated when it was used to cover a stream bath leaving only shadowy images like those on the Shroud.)\nOf course, the pigments on the Shroud appear to have long since gone, suggesting that the rolling unfolding,etc, did eventually lead to them disintegrating.\nYes, we do have records of painted linens disintegrating after being folded but here is a good example of one that did not disintegrate despite being folded and unfolded over centuries. The trick ,so far as I can see from other examples, is to make sure that the sealing layer, however it is done, is very thin and does not penetrate the surface of the cloth ( ring any bells, anyone?)\nPam’s other point about the identity of the artist. No, these were seldom recorded we are lucky when they are in this period- not until the sixteenth century that artists, with a few exceptions such as Giotto,  had status greater than ordinary craftsmen. And if you read the articles in Villers ( and why not Pam if you want to comment on paintings on medieval linens) you will find examples of enormous sophistication which make the artist of the Shroud look like an amateur. Just look at the linen processional banner of the Intercession of Christ and the Virgin ,attr, to Lorenzo Monaco, c.1400, explored in the article by Charlotte Hale, p.31 onwards.\nFrom what STURP found the calcium was consistent across the whole surface. This fits,of course, with a medieval sealing, but means that the Shroud must have been laid out flat without anything on it to let calcium settle naturally from another source across the surface.\n\n","date":"January 18, 2015 at 9:57 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-184281","author":"Charles Freeman","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Charles:\n“….you will find examples of enormous sophistication which make the artist of the Shroud look like an amateur. Just look at the linen processional banner of the Intercession of Christ and the Virgin ,attr, to Lorenzo Monaco, c.1400, explored in the article by Charlotte Hale, p.31 onwards.”\n¿Es usted consciente de la “barbaridad” que expresa?.\n¿Tiene usted problemas visuales?.\nLa bellísima obra de Lorenzo Mónaco sería desde el punto de vista anatómico una CARICATURA, y usted jamás encontraría un médico que avalara en ella un carácter REALISTA.\nCarlos\n\n","date":"January 18, 2015 at 9:37 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-184379","author":"Carlos","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Charles,\nYou made some claims.\nFor example the article about the Zittau Veil. For example: “.A photograph from the beginning of the twentieth century shows that the veil must have been in good condition until the Second World War , ..; from our point of view the cloth was in a nearly intact state.’\nWhere is this photograph? In the article or elsewhere?\nGoogle does not provide any high resolution picture of this veil.\nPlease, show us the Villers article, the photographs etc.\nWithout any kind of concrete example, this discussion is meaningless.\n\n","date":"January 20, 2015 at 3:28 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-184910","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"The Villers book is available second hand on Abebooks at a very reasonable cost so perhaps you can get your own copy and learn a great deal about painted fabrics from the article and the others. It would make the debate a lot more relevant and sophisticated.\nYes, there is a photo in the article,of the Veil as it was before the war and then afterwards so that you can see the contrast between the central area where the pigments have come off and the surrounding panels where the paint is still largely intact. Then there is a photograph of one of the panels where the pigments have come off- it is of the Visitation- and you cannot help noticing how similar the shadowy images of Mary and Elizabeth are to the shadowy images of the Shroud. It is without doubt an avenue for further research. This is one of the many areas where research on the Shroud is in its infancy.\nYou will no doubt remember the quite extraordinary statement in the STURP paper on the Physics and Chemistry of the Shriud that they had not examined any paintings on linen! Never too late to start.\n\n","date":"January 20, 2015 at 4:23 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-184919","author":"Charles Freeman","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Pam also speculates that the limestone may have come from the dust of a newly hewn tomb. In that case one might suppose that the back of the dorsal image would have become quite dusty, but not, especially, anywhere else. The next densest accumulation would be the back of the ventral image, which was exposed to dust drifting from the ceiling for some hours, but I would not expect ‘relatively large’ concentrations on the image face of the cloth at all. Over the years much or all the dust would no doubt have been brushed/washed off, and maybe a little diffused, but surely any remaining would still be concentrated on the back of the dorsal image. There is no suggestion, among the various investigations into the hooverings from between the Shroud and the backing (applied after the fire of 1532), that this is so.\n\n","date":"January 18, 2015 at 11:19 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-184291","author":"Hugh Farey","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Beware folks. English gents who write history books are not one and the same thing as academic historians.\n\n","date":"January 18, 2015 at 1:34 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-184308","author":"Colin Berry","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"No one knows which group is worse…\n\n","date":"January 18, 2015 at 1:37 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-184309","author":"O.K.","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Charles is not qualified as a Medieval Historian but only as a Roman Historian.\n\n","date":"January 21, 2015 at 6:29 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185072","author":"Max patrick Hamon","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"The Quem quaeritis? (Latin for “Whom do you seek?”)  Easter trope dates from the early medieval period. It was (first?) sung as early as ca. 925 CE at the Benedictine Abbey of Fleury (now Saint-Benoit-sur-Loire) funded ca 630 CE. The Visitatio sepulchri liturgical drama is derived from the The Quem quaeritis? Easter trope.\nIn the Benedictine Hungarian Pray Ms bifolium illustrations (1163-1195 CE), the Visitatio sepulchri section (with the central “a” for Greek-Latin anesti, “He [is not here but] is risen”), the Benedictine monk (Joseph Almos?) cryptically “stages” (i.e. without the image on it) the Constantinople Sindon aka Lirey Shroud aka Turin Shroud that is Yeshua’s burial Sindon as the true relic (not a painted copy dating from 1325 CE± 65!).\nMoons ago, I wrote:\n Suffice it to syntactically piece together several corroborating 944-1207 CE testimonies and eyewitness descriptions, from Gregory Referendarius’ (Archdeacon of Hagia Sophia), to Nicholas Mesarites’ (overseer of the treasuries in the Pharos Chapel of the Boucoleon Palace of the emperors) via Robert de Clari’s (Fourth Crusade Picard knight), and a few others, to build a strong if not crucial evidence the Turin Shroud (TS hereafter) and Constantinople Sindon (CS hereafter) could be one and the same object. The literary synthesis reads:\n“[In the church of My Lady Saint Mary of the Pharos (“lighthouse”) in the Golden Imperial Palace of the Boucoleon in Constantinople and another church called My Lady Saint Mary of Blachernae], Christ ‘rise[d] again’ [then], and the sindon(1) with the burial linens [was] the clear proof. [This sindon] as white as snow from antiquity, [was] of linen, of easily obtainable material, remained uncorrupted and smell[ed] fragrant of myrrh. [It] def[ied] decay because, after the Passion, it [had] wrapped the ELUSIVE(2) dead naked body.\n[When] raised upright, not only the image of the glorious features of the Saviour’s face with dripping drops of blood shine[d] out but also the form and most noble stature of his entire body hanging down from the cross and embellished with drops of blood and water that make the liquid flow from his own side, could be plainly seen. THIS [WAS] NOT THE ART OF THE PAINTER and the various beautiful colours, which provide a door for the mind to consider the original and depict images [that could possibly have depicted] the reflection of his appearance and size imprinted on [his sindon]. [So much so] the ‘not-made-by-hand’ image of Christ and G-od, draped with a white/pure linen cloth he had worn, was sufficiently in lieu of the vision of the Lord coming into the flesh to those who had not corporally seen him.\nAfter the city was taken, the French partitioned the relics of the saints and the most sacred of all, the sindon in which our Lord Jesus Christ was wrapped after his death and before his resurrection. We know the sacred sindon in Athens. [In this city] we saw with our own eyes the burial linen cloths found in the sepulchre.”\nThis is strong historical evidence indeed and tends to prove the presence of the most famous contact-and-blood relic of Christianity at Constantinople prior to 1204.\nAs note (2), I also wrote: The Greek word, aperilepton (used to describe the image on the Constantinople Sindon), is consistent both on one hand with G-od’s “un-circumscribed”, non coercive and loving, divine nature that has NO SHAPES, is BEYOND DESCRIPTION and the binds of Death cannot contain and, on the other hand, Yeshua’s “UN-OUTLINED”, EVANESCENT NATURE of his own image on his sindon. This doesn’t refer to an originally painted copy as Charles wants us to believe.\n\n","date":"January 21, 2015 at 5:47 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185059","author":"Max patrick Hamon","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"I would be grateful if you can specify from where have you got the name of the artist (or copyist) and the date of the illuminations of the Pray codex. Thank you.\n\n","date":"January 21, 2015 at 7:21 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185082","author":"David Mo","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Re my dating the HP Ms 1163-1195 CE,\non June 21, 2014 at 6:02 pm I wrote:\n“Reminder: most likely the Benedictine monk artist followed the court of young prince Bela (future king of Hungary) at Constantinople and saw the Constantinople Theophoron (Christophoron) Sindonos, “the piece of linen worn by G-od (= here Christ) there. \nSince the young prince stayed 10 years (from the age of 15 to 25), most likely in the latter’s wake, the (then young?) Benedictine monk should have been one of the privileged visitors of the relic.”\nNow young Prince Bela and his court stayed in Constantinople from 1163 to 1173 CE. Here 1163 CE is the teminus ad quo i.e. the lower limit of dating, as of the earliest plausible date at which the pen & ink bifolium illustrations could have been drawn.\nRe the terminus ante quem or date before which the bifolium illusrations must have been drawn, 1195 CE, the bifolium musical notation just gives it away.\n(to be coninued)\n\n","date":"January 21, 2015 at 11:03 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185126","author":"Max patrick Hamon","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"“Now young Prince Bela and his court stayed in Constantinople from 1163 to 1173 CE. Here 1163 CE is the teminus ad quo i.e. the lower limit of dating, as of the earliest plausible date at which the pen & ink bifolium illustrations could have been drawn”.\nExcuse me, Max, but this is a simple speculation. You must get any indication to connect the Prince’s visit to Constantinople to the Pray codex. I am asking you for specific evidences (History) not imaginative speculations (novels). Do you have any evidence?\n(I await for this continuation).\n\n","date":"January 22, 2015 at 2:56 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185299","author":"David Mo","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"David Mo: \nFirstly you misleadingly present Prince Bela’s TEN YEAR’S STAY (along with his court) at Constantinople as if it were ‘(a mere) visit’ to the Byzantine capital! Are you kidding? Could you stop shamelessly distorting the fact? \nSecondly, you seem to totally ignore Medieval Christian princes (and 12th c. CE Hungarian princes are no exceptions) used to have a confessor and spiritual director at their court. Now most of the time, their confessor and spiritual director was a monk.\nThirdly, a Benedictine monk drew the bifolium’s pen & ink illustrations. Though predominantly Roman in style, remarkably, a clear Byzantine influence can be felt in all of them (elongated figures, dressing etc).\n(to be continued)\n\n","date":"January 23, 2015 at 8:10 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185674","author":"Max patrick Hamon","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Typo: In the Benedictine Hungarian Pray Ms bifolium illustrations (1163-1195 CE), the Visitatio sepulchri section (with the central “a” for Greek-Latin anesti, “He [is not here but] is risen”), the Benedictine monk (Joseph Almos?) cryptically “stages” (i.e. without the image on it = “He is not here”)\n\n","date":"January 21, 2015 at 6:01 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185061","author":"Max patrick Hamon","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Reminder re the elusive nature of the image on Yeshua’s burial cloth Mesarites referred to: on June 23, 2014, I wrote:\n“Seen close up (within three paces) the body image disappears. The disappeance effect is due to lateral neural inhibition of the optical nerves.”\nAnd:\n“The Benedictine monk artist through artistic steganographic license incorporated the herringbone weave pattern seen close up to solve the new testamental artistic steganoraphic triple bind: to hide in plain view Yeshua’s burial while composing an ink & pen tale-telling version of the Empty tomb event along with textual reference (‘HE IS NOT HERE but is risen’).”\n\n","date":"January 21, 2015 at 6:12 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185066","author":"Max patrick Hamon","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"To picture Yeshua’s elusive DEAD naked body on his burial cloth would have confused the Visitatio spulchri message (“HE IS NOT HERE but is risen”).\n\n","date":"January 21, 2015 at 10:25 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185116","author":"Max patrick Hamon","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"The elsive nature of the TS image makes all the difference with Charles historiosophism.\n\n","date":"January 21, 2015 at 6:18 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185069","author":"Max patrick Hamon","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Typo: Charles’ “historiosophism”\n\n","date":"January 21, 2015 at 6:20 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185070","author":"Max patrick Hamon","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Yes, the TS image is elusive, or at any rate the one that people see with their own eyes on rare showings in Turin. That much we know because of the many statements that one has to stand well back (metres) to discern the form of a man, and that the image ceases to become visible if one gets too close. (I have to take the word of others for that, but see no reason to take issue).\nBut that creates a conundrum, does it not? If the human eye cannot make out the image close up, then how can the camera do so? What is a camera, but a primitive eye? \nOne has to assume there has been some playing around with lighting and exposure settings etc to give the photographic images upon which we amateur image analysts are so utterly dependent. There’s an upside to that too. If the original photographs have been doctored in some way to make them more understandable, then who’s to say we have been given the optimal settings (sorry Mario  ;-). If for one shamelessly put Shroud Scope and Halta Definizione images into my MS Office Picture Manager, and often find there are effects that are interesting and possibly even scientifically significant (who knows?).\nSo when a historian comes along and says that this or that part of the TS image is missing, be it hair on back of head or crown of thorns or loin cloth, the first thought that enters my head is “How can you know what’s there and not there, given you are restricted to the same images as the rest of us?\nBack in November of thereabouts I reported some interesting differentiation to be seen between hair and at least some skin body image that was best seen with the Halta image. I described a “two-tone effect”, that may or may not have implications re mechanism of imaging (that need not  concern us right now).\nI’ve just this minute put the Halta images from the BBC’s site back into MS Office to look again at the question of hair length in the dorsal image.\n\nIs anyone thinking what I’m thinking? Methinks there are no grounds for saying that the dorsal side image shows lack of hair, or short hair, least of all for claiming that long hair is absent.\nOh, and while we’re discussing the head, there’s something worth noting re that “missing” crown of thorns. There was a posting on this site a while back  about someone who thought there were horns coming out of the head, which was clearly based on a misinterpretation of the edges of a water stain. One wonders if some medieval artists made a similar error, but interpreted the water stain edges as thorns, or the remains thereof. \nAs a general observation, if one’s to sustain the case for crucial parts of the image being missing through wear and tear, one has to demonstrate that the effect is seen elsewhere on the TS, and not just at one or two other ‘controversial’ sites like loin cloth (where artistic sensibilities play a role). Personally I see no evidence whatsoever for any major, generalized dropping off of image. To claim that a crown of thorns and/or loin cloth is missing through wear and tear is simply casual guess work. It’s not scholarship. Nor is it scholarship to claim that others will prove one right in the fullness of time, once there’s been a proper stocktaking and evaluation of the entire canon of Western devotional art. It’s the scholar making the controversial claim who is supposed to do that, or at least make a systematic start. MA and PhD dissertations invariably require hard slog.\n\n","date":"January 21, 2015 at 6:48 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185075","author":"Colin Berry","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Typo: “I for one shamelessly…”\n\n","date":"January 21, 2015 at 6:53 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185076","author":"Colin Berry","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"‘Restricted to the same images as the rest of us’ . So have you access to the catalogue of the Savoy collection and Beldon Scott, plus the others I have?  I have about fifty images of the Shroud mostly by artists of the seventeenth century and then up to 1750. So are these the same images you are using? As I have made clear I am trying to recreate the images on the Shroud  as they originally were, a fairly standard approach to such matters!\nBy opening up a database to everyone , I lay myself open to being shown to be wrong. I am quite happy to take the risk. To rule out even trying to get a database together shows a really closed mind!\n\n","date":"January 21, 2015 at 8:07 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185086","author":"Charles Freeman","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"The lengthy preamble and context should surely have made it clear that it was photographed images> of the TS that were in the frame.\n\n","date":"January 21, 2015 at 8:27 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185093","author":"Colin Berry","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Yes, a limited part of the total evidence that needs to be accumulated if Shroud studies are to move on. The controversies over what the Shroud photos do or do not show and how far some have been manipulated show that this is a confused area.\n\n","date":"January 21, 2015 at 11:52 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185138","author":"Charles Freeman","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"\n\n","date":"January 21, 2015 at 12:08 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185142","author":"Colin Berry","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"“To picture Yeshua’s elusive DEAD naked body on his burial cloth would have confused the Visitatio spulchri message (“HE IS NOT HERE but is risen”).”\nIf the shroud was made for the Quem Quaeritis rite, it was important that it did not depict a dead body for exactly that reason. But that is exactly why the Shroud does not depict a dead body. It depicts the imprint and bloodstains left by the body, and that is why it had to be monochrome, to resemble an imprint left by sweat or decay, and to have the negative quality that would result from such an imprint. Primitive though it was, the Besançon shroud had similar features, I believe, and Bergier indicates that these two were far from alone.\n\n","date":"January 21, 2015 at 10:40 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185121","author":"Hugh Farey","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"“Imprint”? “Monochrome” ? “Negative quality”?\nWhere on earth did you dig up these obscure and perplexing terms, Hugh? Spare a thought for your audience please, historians especially.\n\n","date":"January 21, 2015 at 11:06 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185127","author":"Colin Berry","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Young’s research shows that there was considerable variety in the linens ( always linen to conform with the gospel accounts) that were presented to the congregations and one can assume that there was no one standard image although shared knowledge e.g. to put the wound on the left side- must have been passed around. Some may have been just the sudarium and some may just have had bloodstains. There clearly was not a standard Quem Queritis image. The Mozarabic rites that go back to the seventh century in Spain talk of Peter and John going to the tomb and seeing ‘the recent imprints of the dead and risen man on the linens’ .\nYes, these were intended to be imprints – everyone would have known that a body with sweat and blood on it laid on a cloth would leave some sort of imprint, if only bloodstains, and it would be a negative of the body itself and the artist depicting it might well have decided not to use as many colours as the top class artists of the day ( judging from the few top-class painted linens that have survived). After all everyone seeing the cloth would have known that it was not the real thing but a symbolic representation- ‘our’ parish or monastery shroud brought out once a year at Easter .( ‘Representation’ is the word often used of the Shroud  image although there is a linguistic barrier here).\nHowever, as this was a revered cloth, carried in procession, laid on the altar, etc , it would have achieved some form of spiritual significance and have been treated with reverence, probably locked up between Easters. In some cases miracles would have been reported  and then the cloth would have been given even more status and one might even get a pope allowing pilgrims an indulgence. ( As is the case in similar objects- we have a  banner made in 1464 in Perugia, carried in penitents’ processions  that became associated with the cessation of plague and so, like the Shroud, got an indulgence even though everyone knew it was recently made.) This is the way these things tended to work even if we don’t know exactly what gave the Shroud sufficient status to earn that indulgence.\nThere is lots of material on how particular objects were transformed into apparently genuine relics although nothing survives of this for the Shroud except the prominence, I think, of Jeanne de Vergy in the  attempt. My favourite is the opportune discovery of the body of Mary Magdalene at St. Maximin in Provence  in 1279 when there was already a Mary Magdalene body at Vezelay. Here Charles of Salerno won out by saying he had a vision of where to dig and the body would be recognised by the amphora of Christ’s blood that Mary had gathered at the cross and a green shoot growing from her tongue. And this indeed was what was dug up.  The poor monks of Vezelay had nothing to challenge this and their shrine soon lost out to St.Maximin where pilgrims still come to this day.\n\n","date":"January 21, 2015 at 12:31 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185148","author":"Charles Freeman","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Historiosophers, please.\n\n","date":"January 21, 2015 at 11:23 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185132","author":"Hugh Farey","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Hugh,  “in modern language, sophist and sophistry are re-purposed and used derogatorily. A sophism is a specious argument for displaying ingenuity in reasoning or for deceiving someone. A sophist is a person who reasons with clever but fallacious and deceptive arguments”. In this acception,  Charles’s intellectual approach looks more like  an historosophist’s than an historiosopher’s as far as the TS is concerned.\n\n","date":"January 21, 2015 at 11:58 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185139","author":"Max patrick Hamon","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Hugh wrote, “It depicts the imprint and bloodstains left by the body, and that is why it had to be monochrome, to resemble an imprint left by sweat or decay,”. \nThe fact is In the very iconological economy of the bifolium Prepartio/Unctio AND Visitatio scenes, this reasoning just doesn’t work. Don’t you mix drama-oranges and iconogaphy-apples. \nBesides most likely the Shroud of Compiegne and Sindon Munda from Kornelimünster are two  halves of one original subtitute relic about the same length and width of the TS yet it clearly doesn’t bear any dorsal and/or ventral monochromatic image at all to resemble an imprint left by sweat or decay.\n\n","date":"January 21, 2015 at 11:32 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185133","author":"Max patrick Hamon","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Hugh wrote, “It depicts the imprint and bloodstains left by the body, and that is why it had to be monochrome, to resemble an imprint left by sweat or decay,”.\nThe fact is In the very iconological economy of the bifolium Prepartio/Unctio AND Visitatio scenes, this reasoning just doesn’t work. Don’t you mix drama-oranges and iconogaphy-apples.\nBesides most likely the Shroud of Compiegne and Sindon Munda from Kornelimünster are two halves of one original subtitute relic about the same length and width of the TS yet it clearly doesn’t bear any dorsal and/or ventral monochromatic image at all to resemble an imprint left by sweat or decay.\n\n","date":"January 21, 2015 at 11:33 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185134","author":"Max patrick Hamon","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Besides most likely the Shroud of Compiegne and Sindon Munda from Kornelimünster are two halves of one original subtitute relic about the same length and width of the TS\nMax, this is not true. \nSee\n\nFrom the webpage \nhttp://en.heiligtumsfahrt2014.de/wissenswertes/heiligt–mer/the-shroud-of-jesus\n“According to tradition, this cloth was used when Jesus was laid in the tomb.\nIt is an artfully woven linen cloth, comparable to an ornamental cover. It is approx. 1.80 m wide and 1.05 m long.\nOriginally it was twice as large. The missing half was given to Charles the Bald in around 875 for the establishment of his monastery in Compiègne, in exchange the abbey received the relic of the holy Kornelius and the holy Cyprianus.”\nAs position of the cut indicates, the original size of this cloth must have been not 4x1m (like TS) but about 1,8 m x 2m\n\n","date":"January 21, 2015 at 12:39 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185149","author":"O.K.","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Oskar I wrote: “Besides most likely the Shroud of Compiegne and Sindon Munda from Kornelimünster are two halves of one original subtitute relic about the same length and width of the TS”.\nNow, you commented : “Max, this is not true. (…) It is an artfully woven linen cloth, comparable to an ornamental cover. It is approx. 1.80 m wide(sic!) and 1.05 m long (sic).\nOriginally it was twice as large.”\nOskar, methinks you got it all mixed up here. \nKnown as “SIndun Munda” (i.e. “the clean/pure cloth” in clear reference to the Matthean “Sindon Karthara” (Mt 27: 59), the Charlemagne’s original substitute relic (that was twice as large as the Kornelimünster “Sindon Munda”, that is approximately 4m long and 1m wide (the second half used to be kept in Compiègne till it was destroyed at the French Revolution), WAS about the same length and width as those of the TS.\n\n","date":"January 23, 2015 at 6:58 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185659","author":"Max patrick Hamon","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Typo: Sindon kathara\n\n","date":"January 24, 2015 at 11:10 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185977","author":"Max patrick Hamon","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Is it not easier to explain added details in a copy of a faint original than to explain why the artist chose to paint a faint copy of the much more vivid original?\n\n(One of the Noalejo copies from 1527)\nSource:\nhttp://lasabanaylosescepticos.blogspot.se/2014_05_01_archive.html\n\n","date":"January 21, 2015 at 12:04 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185141","author":"Henrik","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"“Is it not easier to explain added details in a copy of a faint original than to explain why the artist chose to paint a faint copy of the much more vivid original?”\nI do not see any added detail in this beautiful copy.\nTo the contrary I do see some missing details (for example the epsilon blood mark).\nThe attempt to create a faint image with fuzzy contours is obvious. It is the best example of such an attempt but not the only one.\nWhy a painter of the 16th century would reproduce a faint image, if the original was not faint at the time? This is a non sense.\nWe can be sure that in 1527 the image was about the same as the Turin Shroud we see today: a faint image with fuzzy contours an without any added “details” like a crown or a loincloth.\nThe observation of this beautiful and successful reproduction of the TS before the Chambery fire is very interesting. I’ll look at it in detail.\n\n","date":"January 21, 2015 at 4:20 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185190","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"I was not very clear (english is not my native language). What I meant is that the SOT in 1527 probably reminded more about the Noalejo copy than the depictions Charles Freeman usually refers to. \nThank you for making that more clear.\n\n","date":"January 21, 2015 at 6:05 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185214","author":"Henrik","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"The image is very interesting and is evidently a copy of the ORIGINAL realized using A MIRROR. \nThe artist, Gir, gives the key putting the TEXT of way to speculate. \nThe image and the text must be seen with a mirror. It is probable that Gir was finding a better way of being able to copy of this curious way. Carlos\n(traducción mecánica)\nEn español:\nLa imagen es muy interesante y es evidentemente una copia del ORIGINAL realizada utilizando UN ESPEJO .\nEl artista, Gir, da la clave poniendo el TEXTO de manera especular.\nLa imagen y el texto deben ser vistos con un espejo.\nEs probable que Gir encontrara una mejor manera de poder copiar de esa curiosa manera.\nCarlos\n\n","date":"January 21, 2015 at 7:14 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185230","author":"Carlos","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"RECTIFICATION!\nMy comment is erroneous. The wound of the side is placed correctly in 2 copies and the texts in 2 Shrouds of Noalejo they are read correctly\n(en español)\n¡RECTIFICACION!\nMi comentario es erróneo. La herida del costado está situada correctamente en las 2 copias y los textos en las 2 Sábanas de Noalejo se leen correctamente\nCarlos\n\n","date":"January 21, 2015 at 9:17 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185253","author":"Carlos","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"It is very difficult to find good photographies of the POSITIVES of the Shrouds of Noalejo (typical Spanish! …… will be necessary to hope that some japanese or korean tourist realizes them …), specially of the Shroud of better quality. \n \n \nBut they are seen the wounds of the side in the correct side \n(en español)\nEs muy difícil encontrar buenas fotografías de los POSITIVOS de las Sábanas de Noalejo ( ¡típico español!……habrá que esperar a que algún turista japonés o coreano las realice… ), especialmente de la Sábana de mejor calidad.\n \n \nPero se ven las heridas del costado en el lado correcto\nCarlos\n\n","date":"January 21, 2015 at 10:34 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185266","author":"Carlos","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"“Why a painter of the 16th century would reproduce a faint image, if the original was not faint at the time?”\nBingo. Game, set, match.\n\n","date":"January 21, 2015 at 4:48 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185196","author":"David Goulet","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Are you sure  that the illustrated copy, above, is of the Shroud which was in Chambery at that point. The wound is on the wrong side and the bloodstains of the  Shroud are not reproduced, but perhaps you have documentation to say that it is.\nOne area to research is whether there was in fact a Spanish template for Quem Queritis cloths with a double figure on it and it may even be that the Shroud is a copy of that template- there seems to have been a double image in the cloths mentioned in the Mozarabic rites that go way back before the fourteenth century.\nSo much still to research!\n\n","date":"January 21, 2015 at 5:59 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185211","author":"Charles Freeman","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"The following paper\nhttps://www.shroud.com/pdfs/n69part2.pdf \ngives a preliminary translation of the latin text:\nUpper part:\nHere you can see the image of the Holy Shroud which is kept in the chapel at Chambery, in its\ntrue dimensions, by “Gir” in 1527\nLower part:\nThis depiction spread out from above is similar to the Shroud kept by the Duke of Savoy with\ngreat reverence\nBut isn´t the text on the side inverted? The image posted above shows the reversed side of the shroud? It would then explain the mirror-image.\n\n","date":"January 21, 2015 at 6:30 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185220","author":"Henrik","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Excuse me. I cannot see “in 1527” neither in the picture nor in the transcription: “Sindonis imaginem sacri Chambariaci saccelli cernere hic potest recta dimensione per Gir. Actum”.\nThe reasons of the dating would be others.\n\n","date":"January 22, 2015 at 3:05 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185303","author":"David Mo","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Have you seen the dorsal part of the two Noalejo shrouds? The article by Barta and Carrascosa which I  linked to in my first post above shows the whole Noalejo cloth outstretched. Although the resolution is poor, it is possible to distinguish the date of 1527 down at the left corner.\nI will though grant Freeman the point he frequently have made about the visible elbows which can be seen in the dorsal images of the two pre fire Noalejo copies – this will surely add some constraints on how the shroud wrapped the person/object during image formation, like if the person/object would have had to press the dorsal side of the shroud into spices/sand, or if the person/object never was used in the first place. To have the person in a loose shroud on a flat floor resulting in visible elbows on the dorsal side is of course an anatomically absurdity.\n\n","date":"January 22, 2015 at 5:30 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185332","author":"Henrik","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"“To have the person in a loose shroud on a flat floor resulting in visible elbows on the dorsal side is of course an anatomically absurdity.”\nThere was an opportunity for imprinting, real or simulated, before placing on a hard stone bench Henrik, one that medieval artists with a knowledge of scripture were aware, notably the juncture at which Joseph of Arimathea makes his first appearance, i.e. tricky, cumbersome  and no doubt messy transfer from the cross into an improvised fluid-absorbent linen “stretcher”.\n\nThere was ample opportunity for imprinting of those elbows (albeit notional) in the above painting.\nThat same configuration we see above could also explain why the artist who produced the 1516 Lier copy decided to show a highly prominent imprint of the buttocks. That unexpected dare one say indelicate feature was alluded to shortly before Christmas by Hugh Farey, inviting us to speculate. \nMight the Lier artist have been assuming that imprinting occurred en route from cross to tomb? It would explain why blood, real or simulated, is so prominent a feature of what is routinely  (misleadingly?) billed as a “burial shroud”. As I mentioned a while ago, there’s really no good evidence from scripture that Joseph’s linen was ever used or intended as such (quite the contrary in fact from the account in the non-synoptic Gospel according to St.John).\n\n","date":"January 22, 2015 at 6:14 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185344","author":"Colin Berry","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"It´s possible that medieval people understood the role of the shroud mentioned in the gospel, at least partially, as a carrier of the body to the tomb. That Jesus was placed in the shroud before entering the tomb is certainly consistent with the most straightforward reading of the four gospels (and don´t forget the linen strips). This does not exclude the possiblity though that Jesus remained in the shroud during the entire stay in the tomb (but you think that the Gospel of John suggests otherwise?). \nMaybe they interpreted the visible elbows as proof of an image formation taking place during the initial phase while the body where carried down from the cross or to the tomb – I don´t think that´s a very strong point in itself – without asserting that the elbows don’t fit into your historical reconstruction or your school of image mechanisms.\n\n","date":"January 22, 2015 at 9:02 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185380","author":"Henrik","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"All I’m saying, Henrik, is that elbow imprints on the dorsal surface may or may not have been present originally, depending on events (authenticity) or modelling assumptions (medieval origin). That being the case, no firm conclusions can be drawn from the presence of elbows in later “copies” , not necessarily faithful to the original. when the region of the TS in question was obliterated by fire in 1532. \nIt’s not just a single can of worms. It’s 2 or 3 cans of worms, not necessarily the same variety with no way of knowing which is which because the labels have been burned off and/or been re-labelled freehand with marker pen by an unknown hand. \nSorry, I couldn’t resist making the point that elbow imprints, had they been present, would square with prominent buttock imprints if the TS image had been imprinted on linen during transport to rock tomb before questionable burial rituals  ones that may or may not have involved cleaning off first-flow blood.\n Imprinting during transport makes medieval model-building options a lot simpler to imagine, e.g.simple sweat and blood imprinting, through excluding more exotic resurrection-linked phenomena (flashes of radiation etc).\nWe down-to-earth sceptics who consider that a rerun of the radiocarbon dating would return essentially the same answer have to to seize the opportunity for point-making when offered, given we have no exotic narratives up our sleeves with which to grab headlines.\n\n","date":"January 22, 2015 at 11:41 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185404","author":"Colin Berry","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Nineteenth (and earlier) century enthusiasts for other shrouds were happy to accept that they were all genuine, and did indeed give the Turin shroud the role of transport sheet, while their own favourite (Cadouin, Besançon) was the actual burial sheet.\n\n","date":"January 22, 2015 at 11:41 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185405","author":"Hugh Farey","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Henrik:\n“In 1527” is not present anywhere on the Noalejo’s shroud. It is a free translation of the text. This is not serious from the point of view of the epigraphy. In fact any serious investigation has not been made about this artefact. Neither an article published in a specialized review. We are only able to follow the trail of it till the beginning of the twentieth century. Therefore, before to draw any conclusion some expert enquiries have to be undertaken. In particular the dating of the cloth and paint, textile and epigraphic studies, and others. Without that, we can only speculate. For example, we cannot exclude that the cloth don’t be a free copy of a copy of a copy made in more recent date than 1527.\nIf these enquiries confirm the date that figure on the cloth, Charles should reconsider some points of this article. The colour of the Noalejo’s image is not so faint like the Turin Shroud, but much more than the copies that Charles has used as reference. Any degradation process would be previous to 1527.\n\n","date":"January 23, 2015 at 3:17 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185623","author":"David Mo","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"“The Shroud of Turin and its ancient copies” César Barta and Alfonso V. Carrascosa.\n“Scientific Research and Essays” Vol. 7(29), pp. 2526\n2544, 30 July, 2012\nAccepted 12 July, 2012\nAvailable online at\nhttp://www.academicjournals.org/SRE\nDOI: 10.5897/SRE12.384\nISSN 1992 – 2248 ©2012 Academic Journals\nCarlos\n\n","date":"January 23, 2015 at 5:47 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185650","author":"Carlos","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Carlos:\nThis article fails to satisfy the basic requirements that I demanded.\nThe magazine is not a reliable scientific review. (This subject was discussed in Dan’s blog not long ago).\nThe authors are not specialists in Archaeometry, textile History, Epigraphy, etc.\nTherefore they have not made any of the studies I mentioned. They only made a comparative study of the superficial features of the Noalejo shrouds.\nThe same thing can be stated for The Noalejo Shroud copies by César Barta, José M. Orenga and Daniel Duque if not worse. (https://www.shroud.com/pdfs/n69part2.pdf).\n\n","date":"January 24, 2015 at 3:29 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185906","author":"David Mo","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Por cierto, que yo sepa “Gir” no es un nombre español.\n\n","date":"January 24, 2015 at 3:33 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185907","author":"David Mo","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Translation:\nBy the way, “Gir” is not a Spanish name, as far as I know.\n\n","date":"January 24, 2015 at 3:36 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185908","author":"David Mo","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"P.s. Still no answer to my query as to why there is long hair and the Crown of Thorns on all the representations of the Shroud in these early centuries but they are not there today. The obvious answer is that they were indeed there but have decayed but perhaps you have a better explanation.\n\n","date":"January 21, 2015 at 6:01 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185212","author":"Charles Freeman","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"yawn…the earliest representation, the Lier copy from 1516, has no crown of thornes…\n\n","date":"January 22, 2015 at 10:35 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185545","author":"Thomas","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Well, it was there by 1517 when Antonio de Beatis specifically mentions it in his description of the Shroud, ‘ images impressed and shaded in the most precious blood of Christ and show most distinctly the marks of the scourging, of the crown on the head, of the wounds to the hands and feet and especially the wound to the side … All in a manner that would strike terror and reverence into the Turks, let alone Christians.’\nI am sure the Turks would have been mightily impressed by those faded images!\nDavid Mo is right- we need a lot more research on these so-called copies. Once  again it is always assumed in Shroud research that an image on a cloth  is miraculously preserved as it was when it was first created- but images on linen will fade if they are exposed to a lot of light-  how can we be sure of this in any one case without further examination?\nThere does seem to be a faint line across the forehead of the Lier copy which may be the remains of the Crown. The Crown is ,of course, shown in numerous other depictions of the Shroud and in some of the copies. ?All invented.\nDo you think the Getty Foundation might fund that  database?\n\n","date":"January 23, 2015 at 3:30 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185628","author":"Charles Freeman","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"“Well, it was there by 1517 when Antonio de Beatis specifically mentions it in his description of the Shroud, ‘ images impressed and shaded in the most precious blood of Christ and show most distinctly the marks of the scourging, of the crown on the head, of the wounds to the hands and feet and especially the wound to the side … All in a manner that would strike terror and reverence into the Turks, let alone Christians.’\nWell, you can choose to keep being highly selective, that’s your prerogative. But its not academic nor objective. De Beatis, I’m sure, is referring to the blood wounds resulting from the crown on the head as we see them today… the context of the whole sentence is around blood wounds, not body image or other forms of image.\n\n","date":"January 25, 2015 at 8:58 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186265","author":"Thomas","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"You are absolutely correct, Thomas re the misreading of syntax. “Marks” is followed by “of” and then subclauses with more “ofs” which are clearly governed by the single priming reference to  “marks”. Given the marks linked to scourging, nails and lance are not accompanied by the actual hardware that inflicted the wounds,  the latter identifiable only by their respective blood signatures, there are no grounds for assuming that the “marks” left by a crown “of” thorns represent the crown itself. The writer was simply deploying a compressed style of syntax as a means of bookending the 4 different origins for the blood stains each inflicted by a missing object.\n\n","date":"January 26, 2015 at 1:44 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186312","author":"Colin Berry","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"I don’t have the original Latin to hand , someone must have, but when you see the crown depicted on so many otHer engravings it does fit and the attempt here to explain it away does not make much sense when there is visual evidence that correlates with the description of a Crown.\nSo is the argument that there was not and never was a Crown of Thorns on the Man on the Shroud, shown front and back on both images? Even most of the (perhaps faded , that needs some thinking about) show it.\n\n","date":"January 26, 2015 at 2:37 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186317","author":"Charles Freeman","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"The full quote ( but, of course, only in English translation of the Latin original )  is’ shows most distinctly ( N.B.) the marks of the scourging, of the cords about the hands, of the crown on the head . .’  I think it is pushing it a bit far from this to say that the Crown was NOT there especially when there are so many depictions of it.\nEach copy, engraving, woodcut, lithograph, etc is unique in so far as it was made by a different ( and in most cases of the engravings, etc we have a named artist) artist and a date as most of these depictions, unlike the copies, were of particular exposition. We cannot divide the copies as somehow being better evidence than the depictions. Some of each will have vital information. The only way forward is to put them all together on a database and get specialists working on them .\nBut images on cloth do fade far faster that engravings.\n\n","date":"January 26, 2015 at 2:56 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186319","author":"Charles Freeman","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Postscript to my earlier comment re the intrinsic unreliability (?) of what one sees, or thinks one sees, or thinks one cannot see, in photographs of the TS.\nI’ve just recalled that last year I suddenly remembered there was a scanner on my inkjet printer, and used it once or twice to record model scorch images, instead of my handheld digital camera. The results were at least as good, indeed better, which is perhaps not surprising if I’m right in thinking that electronic scanning dispenses with converging lenses and other optics, as well as using uniform strip-lighting that is normal to the item being scanned.\nDoes anyone here know how the Durante and Halta Definizione images were each obtained? Might one have been a photographs in the first instance, the other a scanned image? I seem to recall seeing a gantry/guide rail type arrangement mounted above the TS in 2002 pictures of the recording set-up, but what was the mobile unit – a lens and camera or ‘merely’ an electronic photocell?\nWhat would be interesting at least to this neophyte Shroud researcher, aka Johnny-Come-Lately (thanks Mr.Rolfe)  would be to find that one was photographed, the other electronically scanned.  It might help explain the two-tone effect seen in the Halta image (above)  but barely detectable when I last checked Shroud Scope (Durante) images despite identical photoediting  (same  brightness/contrast/.midtone  settings in MS Office Picture Manager). Maybe one system sees/detects things the other doesn’t. If scanning were superior, and the two-tone effect scientifically-significant, might there be an additional criterion that needs to be met in attempts to model the TS image (not that one welcomes making an additional cross for one’s own back).\n\n","date":"January 22, 2015 at 4:26 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185322","author":"Colin Berry","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"PPS:  I should have researched scanners and how they operate before posting the above comment. In fact they do have a lens in the scanner unit. Apologies for that. But there’s another factor that may be relevant, apart from optical hardware. It’s the distance between the scanned object and the scanner sensor, which is bound to be much smaller than the case with point-and-shoot  photography. Might a scanner be better able to detect subtle differences in the surface, especially superficial ones that escape conventional digital photography? Oh, and I meant to say “making a rod” not cross for one’s own back.\n\n","date":"January 22, 2015 at 5:23 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185331","author":"Colin Berry","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Colin, what does “scanning” mean? The Haltadefizione “scan” is not using a laser beam, but a camera attached to a rail-robot system, controlled by a computer. 1649 photos were taken of the Shroud, then reassembled on a computer, resulting in a 72GB photo file. This photo file has never been shown publicly (at the resolution taken), not even on the app Shroud 2.0, although many people think so. What is on Shroud 2.0 is a lower resolution.\nSee the description with photos of the set up at http://www.haltadefinizione.com/en/the-shroud.html\n\n","date":"January 22, 2015 at 2:23 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185439","author":"Mario Latendresse","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Houston (or rather Mario and fellow IT/imaging experts): we have a problem:\nHaltadefinizione site (see link above): “HD digital photography by Haltadefinizione® is an indispensable tool for researchers who wish to access anytime to unique images of the Shroud and process them in real time”\nMario (above): This photo file has never been shown publicly (at the resolution taken), not even on the app Shroud 2.0, although many people think so. What is on Shroud 2.0 is a lower resolution.\nIt’s described as an “indispensable tool for researchers”, as indeed it probably is. But is it available to researchers? If so, then why no details on the Halta site about how to gain access, beyond those relating to the feeble Shroud 2.0 (a damp squib if ever there was).?\n\n","date":"January 22, 2015 at 3:16 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185448","author":"Colin Berry","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Thanks Colin and very well articulated. Will we see acknowledgement of error? Unlikely.\n\n","date":"January 26, 2015 at 2:35 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186316","author":"Thomas","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Acknowledgement of error?\nNot quite yet, Thomas, but maybe realization will dawn shortly:","date":"January 26, 2015 at 3:18 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186323","author":"Colin Berry","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Ref Colin’s illustration of the tomb portage or pre-burial scene at Jan 22, 6:14 am, is indicative I think of the general lack of forensic knowledge by many medieval and later artists, with perhaps the sole exception of Da Vinci who dissected many cadavers until forbidden to do any more.  The corpse is bent at the waist and so clearly not depicted in a state of rigor mortis.  This contrasts with the assertions of Barbet.  Barbet’s scenario for the transport is that the body was so stiff, that the cross-piece was removed from the upright with the arms still attached and the body was easily transported the very short distance to the tomb by five men: two holding the cross-piece (patibulum);  two with a band supporting the waist; and one at the feet.  There was no “stretcher” as otherwise the blood marks would show signs of smearing, and indeed this seems to be Barbet’s explanation for the blood mark across the small of the back from the supporting band.  Likewise the arms (sinistral arm only visible) in the illustration are shown hanging loosely at the sides.  Barbet asserts that the nails would be removed at the burial site, and it would take some definite effort to break the rigor at the shoulders to bring the arms down to the sides.  \nHugh’s enthusiasts for other Shrouds, and Colin’s perspective, both asserting that the present TS was used for transport, are therefore incorrect.\n\n","date":"January 22, 2015 at 2:10 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185437","author":"daveb of wellington nz","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Might one assume that it’s the concept that is being targeted, daveb  (imprinting at transport)? Are the details of that hypothesis being scrutinized and filtered to oppose a perceived agenda?\nNo agenda (on my part). The route to a sweat/blood imprint of a crucified man, probably modelled by an entrepreneurial medieval artisan, 13th/14th century, came directly from a consideration of the TS image characteristics (and radiocarbon dating).  Checklist: faint negative image with bloodstains, 3D properties, scorch-like spectral signature, suggestive of a contact imprint.  No evidence of pre-interment preparation or post-mortem decomposition, least of all  irradiation by energetic sub-atomic particles.\nIf it looks like a sweat/blood imprint, real or modelled, then it probably is one (stripping out the 20th/21st century interest initiated by the David Rolfe with his carefully crafted, mystery- mongering  “Silent Witness”, 1978 and coordinated Sunday Times Colour Supplement feature). Yes, the latter turned this head too, but only for 33 years. \nScales finally fell from this Johnny-Come-Latelys eyes. It’s taken all these years to learn DR’s real theist moral-rearmanent agenda (is there still an Oxford Movement?). Good luck to him I say. Some of us prefer to hang loose on those issues that so preoccupy our unanointed ‘Bishop of Beaconsfield’.\n\n","date":"January 22, 2015 at 2:55 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185443","author":"Colin Berry","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Correction: The Oxford Group, not Movement. (The two are often confused).\n\n","date":"January 22, 2015 at 3:37 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185451","author":"Colin Berry","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Oxford Movement: Composed of High Church Anglo-Catholics, published “Tracts for the Times” 1833-1841, advocating return to certain traditional Catholic practices.  Leading lights included Pusey, Wilberforce, Keble, and John Henry Newman, which last eventually converted to Roman Catholicism, was made a Cardinal and became a major English apologist for Catholic doctrine and was recently canonised by Pope Benedict who visited England for the purpose. \nOxford Group:  A group founded by Lutheran Minister Frank Buchman, ~1921, developed concept of moral re-armament, and becoming known as the Oxford Group by 1931. \nThere is a more recent Oxford Group, experts in a type of radio carbon dating of artefacts, but like many other scientists not as aware as they ought to be of certain fundamental principles concerning essential methods of representative sampling. \nMy fundamental points in commenting above were:  Prevalence of wide-spread ignorance concerning basic forensics until modern times, leading to faulty and unrealistic representations in depictions of Christ’s crucifixion and burial and hence faulty popular conclusions;  Based on forensics from the TS, it is unlikely that Joseph of Arrimathea’s shroud was used for transport purposes.\n\n","date":"January 23, 2015 at 2:38 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185766","author":"daveb of wellington nz","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Here’s what appeared at the end of the 1989 Nature paper:\nhttps://www.shroud.com/nature.htm\nConclusions\nThe results of radiocarbon measurements at Arizona, Oxford and Zurich yield a calibrated calendar age range with at least 95% confidence for the linen of the Shroud of Turin of AD 1260 – 1390 (rounded down/up to nearest 10 yr).  These results therefore provide conclusive evidence that the linen of the Shroud of Turin is mediaeval. \nThe results of radiocarbon measurements from the three laboratories on four textile samples, a total of twelve data sets, show that none of the measurements differs from its appropriate mean value by more than two standard deviations.  The results for the three control samples agree well with previous radiocarbon measurements and/or historical dates. \nHere’s what (arguably) should have appeared:\nThe results of radiocarbon measurements at Arizona, Oxford and Zurich yield a calibrated calendar age range with at least 95% confidence for the 3 contiguous samples of linen assigned to each of the 3 laboratories from a chosen corner of the Shroud of Turin of AD 1260 – 1390 (rounded down/up to nearest 10 yr). These findings, while demonstrating that the sampled linen of the Shroud of Turin is medieval, may or may not be confirmed for the entire Shroud: further testing from a larger number of sites, some less peripheral, closer to image-bearing areas, will be needed to confirm these preliminary data.\nThe results of radiocarbon measurements from the three laboratories on the four textile samples, a total of twelve data sets, show that none of the measurements differed from its appropriate mean value by more than two standard deviations. A more rigorous and detailed statistical treatment of data, while desirable, is unfortunately not possible, given the non-randomised apportionment of contiguous samples to each of the three laboratories.\nHaving acknowledged the limitations of the sampling frame, and the preliminary nature of the dating exercise, the results for the three control samples appear to agree well with previous radiocarbon measurements and/or their independently measured historical dates.\n\n","date":"January 23, 2015 at 3:22 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185780","author":"Colin Berry","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"“My fundamental points in commenting above were: Prevalence of wide-spread ignorance concerning basic forensics until modern times, leading to faulty and unrealistic representations in depictions of Christ’s crucifixion and burial and hence faulty popular conclusions; Based on forensics from the TS, it is unlikely that Joseph of Arrimathea’s shroud was used for transport purposes.”\nTotally in agreement.\nCarlos\n\n","date":"January 23, 2015 at 9:04 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185846","author":"Carlos","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Max: \nOskar, methinks you got it all mixed up here.\nKnown as “SIndun Munda” (i.e. “the clean/pure cloth” in clear reference to the Matthean “Sindon Karthara” (Mt 27: 59), the Charlemagne’s original substitute relic (that was twice as large as the Kornelimünster “Sindon Munda”, that is approximately 4m long and 1m wide (the second half used to be kept in Compiègne till it was destroyed at the French Revolution), WAS about the same length and width as those of the TS.\nUnfortunately not, as the photo shows. See where the cut goes. As today’s half of the “Sindon Munda” in Kornelimünster is is approx. 1.80 m wide and 1.05 m long, and the cut is paralel to the longer edge, the original size of the Sindon Munda must have been about 1.80m x2 m -twice as much -but in a different proportion (1:1 instead 4:1) than TS.\n\n","date":"January 23, 2015 at 7:10 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185663","author":"O.K.","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"David Mo wrote:\n““IN 1527” is not present anywhere on the Noalejo’s shroud. It is a free translation of the text. This is not serious from the point of view of the epigraphy.”\nNo, it is not a “free translation of the text”\n“1527” is obvious on the dorsal side of the Noalejo’s shrouds.\n http://www.academicjournals.org/article/article1380797649_Barta%20and%20Carrascosa.pdf\nDavid knows that but (if I understand well), he wants to read something that “made in 1527”. According to him, since “IN 1527″ (Capital letters are from David) is not written,we can not be sure of the true date of this painting. Moreover, ” This is not serious from the point of view of the epigraphy”\nEpigraphy ?\nLook at the 1571 Alloy painting which shows exactly the same epigraphy, and we don’t see “IN 1571”, just “1571”, with the same characters than those found in the Noalejo’s shrouds.\nIn the latter reproductions of the Shroud, the letters are different and much more similar to our modern numerals. This strongly suggests that the Noalejo’s shrouds were truly painted in 1527. \n“For example, we cannot exclude that the cloth don’t be a free copy of a copy of a copy made in more recent date than 1527.”\nThis sentence makes no sense. In this case, why 1527 ?\nThe Noalejo’s shrouds were painted in 1527.\nTherefore, ” Charles should reconsider some points of this article”.\n\n","date":"January 23, 2015 at 4:02 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185790","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Thibaut:\nMy sole point was that in Epigraphy (yes, the science of study of inscriptions and texts) you ought to transcribe literally the text and then interpret it. This is a formal lack of the studies by the CES and others that points to other general failures that I named.  \nFakers and copyists get used to puting false dates to cheat or dignify their copies. This is a very common fact.  You have to remove this possibility before to draw any conclusion from the Noalejo shroud. And this is a work for Archaeometry and History. You cannot dating an artefact on the sole basis of a date put on by nobody knows who. This is an indication, but not a definitive one. \nLast, but not least, the colour of the Noalejo shrouds is more intense than the Shroud of Turin. You can draw any conclusion of this?\n\n","date":"January 24, 2015 at 4:08 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185914","author":"David Mo","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"By the way, “Alloy” is “Alcoy”.\nYou’re wellcome.\n\n","date":"January 24, 2015 at 4:16 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185916","author":"David Mo","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"I am not sure why I should reconsider ‘this’ – ‘ presumably my HT – article on the basis of the Noalejo shrouds. We have to rule out for a start that they themselves have not faded over time. Then you have to place them against the mass of descriptions, one of which I have provided, others in my article, that show what an impact seeing the a shroud had on observers with its prominent bloodstains, plus the many depictions we have of it which show features such as the Crown of Thorns and long  hair at the back that have clearly disappeared.\nDo you really think that enormous crowds of pilgrims would have come across Europe for a single day of exposition when many of them must have been several hundred yards away if they could not see the images?\nIt really. Is a non- starter to use ancient copies of the Shroud, which may have faded themselves, and ignore the far greater mass of evidence that suggests otherwise to argue that the Shroud images were originally faint.\nThe basic problem is the assumption that the Shroud today is exactly as the Shroud has always been, seven hundred, or two thousand years ago. If it was it would truly be miraculous, transcending the normal laws of nature and decay even after it has been subject to hundreds of foldings, unfolding, having rosaries thrown at it ( the pilgrims waiting for their return can be seen in the Tempesta engraving) and stored we know not in what conditions between expositions. A miracle indeed!\n\n","date":"January 24, 2015 at 2:32 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185899","author":"Charles Freeman","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"“Charles should reconsiderer some points of this article”\nTotally in agreement.\nLas copias de Noalejo MANTIENEN los pigmentos pictóricos.\nLa Sábana de Turín CARECE de pigmentos pictóricos.\n“The components of the pigments used for these copies appear without difficulty when analyzed in the laboratory. The images on the Noalejo copies were painted with some kind of soil pigment. A preliminary analysis of the samples identified the presence of tin (Sn), lead (Pb), calcium (Ca), aluminium (Al), iron (Fe), and other heavy elements. Figure 25 shows an example of a spot analysis. For more representative results, microanalysis on eight particles found in the image sample CE1 were performed and the sum of the atomic percentages of the elements determined by EDX (Energy-Dispersive X-ray Spectroscopy) is shown in Figure 26. Nickel (Ni) may be another component in the pigment. \nThere was no previous preparation for the cloth and no oil was used. \nThe binding substance must be diluted gum (Opinion of Juan Manuel Miñarro. University of Seville. Sculpture department. Personal communication). The text is printed in gold leaf.”\n \nFigure 23. Photograph with optical microscope of the pigments of one copy of Noalejo.\nFigure 24. Photograph with scanning electron microscope of the pigments of one copy of Noalejo\nFigure 25. Spectrum of dispersive energy analysis made on the pigments of one copy of Noalejo. Presence of Tin (Sn) and Lead (Pb).\nFigure 26. Sum of atomic percentages for each element determined by EDX for eight particles found in the image sample CE1. Aluminium (Al), tin (Sn), iron (Fe) and nickel (Ni) may be the main components of the pigments.\nCarlos\n\n","date":"January 24, 2015 at 3:39 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185909","author":"Carlos","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Don’t manipulate my sentence, please.\n“If these enquiries confirm the date that figure on the cloth, Charles should reconsider some points of this article”. \n(I will have to register my copyrigh)t.\n\n","date":"January 25, 2015 at 4:19 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186110","author":"David Mo","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"I am sure that I shall have to reconsider some parts of my argument when we have specialist input that we have not yet had.\nHowever, I shall stick to two central points:\n1) We are still at the beginning of serious Shroud research in many areas as so much previous research has been badly focussed and so many areas have still not had specialist academic input.\n2) The Shroud now is not as it once was and we should be focussing on discovering how it looked originally. This would bring Shroud research into line with research on other ancient artefacts. I have never come across another artefact, especially one of vulnerable material, which is assumed to be totally unchanged over centuries.\n\n","date":"January 25, 2015 at 5:13 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186119","author":"Charles Freeman","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"I assume that all those who are contributing to this learned debate on how the images on the Shroud looked originally will have their Beldon Scotts to hand. If you can’t get hold of the catalogue of the Savoy collection, it is the fullest panorama of the evidence we need to discuss the issue and second hand copies are available on Abebooks. \nThe great architect of eighteenth century Turin, Filippo Juvarra,contributed an engraving of the ostension of 1737 ( now in the Royal Library in Turin). It is on page 257 of Beldon Scott.\nThe crowd is massed in good order in the Piazza Castello ( they had tightened up the procedure since the chaos shown in Tempesta’s engraving of 1613)  and I suspect that it is the architectural setting that most interested Juvarra- there is a wonderful Barogue viewing pavilion- but he presents the whole facade of the platforms. So the Shroud is at quite a distance but you can still see the images on it. Would Juvarra, and so many other artists, really have shown the images if they could not be seen and why would the Savoys arrange this ordered viewing by an enormous audience if hardly any of them would have been able to see the images. It does not make sense to me.\nOf course, Juvarra’s is only one of many depictions showing the images more clearly than they are now and with features that have not vanished with time. As I always say to anyone who asks me how to recreate the images on the Shroud today: ‘Have you got five hundred years to spare?’  It needs time and constant handling/ exposure to the elements to create faded images on cloth or to allow the pigments to disintegrate leaving only shadows where the paint once was.\n\n","date":"January 24, 2015 at 3:48 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185913","author":"Charles Freeman","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Illegitimi non carborundum.\n\n","date":"January 24, 2015 at 4:11 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185915","author":"Colin Berry","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"La Sábana de Sanlúcar de Barrameda, excepcional y única porque interpreta la imagen de la Sábana Santa en POSITIVO, carece de corona de espinas y de “perizonium”, tiene el cabello largo……. y fue ¡REGALO DEL PAPA! al embajador español en Roma, Conde de Olivares*.\nLa Sábana de Sanlúcar mantiene perfectamente los pigmentos pictóricos.\n\nEl Conde de Olivares regaló la Sábana al Duque de Medina Sidonia, señor de Sanlúcar, quien la donó junto a otras reliquias al Santuario de la Virgen de la Caridad (que él fundó) en el año 1613 mediante “carta de donación”.\nCreo que la hipótesis (?) de Charles Freeman tiene “agujeros” por todas partes.\n* Enrique de Guzmán y Ribera, embajador en Roma (1582-1591) y posteriormente fue nombrado virrey de Sicilia y virrey de Nápoles.\nCarlos\n\n","date":"January 24, 2015 at 4:36 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185921","author":"Carlos","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"I think we’re going round in circles. Charles is certainly correct that most of the pictures of ostentations, of all ages, are clearly defined full length portraits, and his critics are certainly correct that most of the actual copies of the shroud, of all ages, are as faint or nearly so as the Shroud itself. (Carlos’s picture above being a notable exception) The problem is to reconcile these two different styles of representation. There are several approaches, technical and cultural.\nFirstly, almost all the illustrations of ostentations in Beldon Scott are of engravings or woodcuts or prints, which do not lend themselves to indistinct representations of anything, while the copies in cloth mentioned above are paintings, which can be as faint as you like.\nSecondly, on those rare occasions when colour appears, it is invariably monochrome. Of course an engraving could hardly be anything else, but the della Rovere paintings show a monochrome image, and a poster for the 1684 exposition, which is mostly engraved but had a woodblock insert just for the images, has that wood block print in sepia.\nThirdly, the USP power of the Turin Shroud was that it held the two-fold image of Christ, not that it was just longer than its rivals in France, nor even that it had blood on it. Even if the pilgrims who came to see it never actually got close enough to observe it directly, they could buy a souvenir showing what they would have seen if they had had the chance.\nFourthly, as I have argued above, if the Shroud was originally made for a Quem Quaeritis ceremony then it was essential (as OK picked out) that it was not a painting of Christ lying in his shroud, but a representation of what he might have left behind. This makes more sense to me than a forged miracle, when in general the more “miraculous” it looked the better.  \nFifthly, by the time the shroud reached Chambery, let alone Turin, it had ceased to have any connotations of ‘realism’, and had become a ‘my relic is more magnificent than your relic’ status symbol, so advertisments, before or after, of ostentations not only showed a more magnificent representation of the shroud image, but also the magnificence of the management of it, with dozens of clerics and soldiers in serried ranks. There is an interesting comparison to be made between the Tempesta engraving of 1613 and the Bolkmann painting of 1686. Both are crammed with the same sort of people, but the impression in the earlier one is of chaotic enthusiasm, with soldiers rather vainly squashed up against the ostentation dais as the populace crush forwards, while in the Bolkmann, there is very clear military order, the crowds being firmly kept in place behind regiments of cavalry. In the first, the image on the Shroud is very visible, in the second, wholly hidden behind a silk cover.\nI’m interested in Bolckmann. He is wholly unknown to the internet other than for this one painting, which is described by Beldon Scott as “a unique visual document recording with remarkable accuracy the appearance of one of these events.” However, I’m not sure I agree with Beldon Scott’s rationale for his painting “the climactic moment when the attending bishops pull back the red silk covering.” I don’t think it had anything to do with the moment. I think the reason his painting doesn’t show any more than the bottom few inches of the shroud under its red silk covering was because he was honest enough to know that there was actually almost nothing to see, and that from the viewpoint of the painting it would have been a blank white sheet.\n\n","date":"January 24, 2015 at 5:58 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185928","author":"Hugh Farey","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Hugh,\nI think you gave the answer.\n“Firstly, almost all the illustrations of ostentations in Beldon Scott are of engravings or woodcuts or prints, which do not lend themselves to indistinct representations of anything, while the copies in cloth mentioned above are paintings, which can be as faint as you like.”\nThe illustrations of ostentations are constrained by technical considerations.\nThe painted copies are not constrained.\nConclusion: the illustrations of ostentations can not be a reliable source for the the knowledge of the TS as it was seen at the time.\nThe painted copies are the only one able to give some information about the TS as it was seen at the time.\nIn this sense the study of the shroud of Arquata is very important.\nhttps://shroudstory.com/2015/01/24/new-paper-on-the-shroud-of-arquata/\n\n","date":"January 25, 2015 at 3:42 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186213","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"But Charles does have a point. However indistinct, the man in the shroud has his feet together and is wearing neither a loincoth nor a crown of thorns, whereas the engravings nearly all have separated feet and are wearing a loincloth and a crown of thorns. It’s as if they were copying a standard, and if it was not the Shroud itself, I wonder if there was a statue, or painting, of the man in the shroud, now lost, which was there for pilgrims to see if they came when no exposition was going on. I believe nowadays there is a reproduction of the Shroud hanging above the altar in which it lies, for just such people to see. That statue perhaps had all the characteristics we see in the engravings, separates feet, loincloth, crown of thorns or whatever, and the engravers then copied that onto their pictures, even though they knew that the real thing was nothing like it. In some cases they may never have seen the real thing at all.\n\n","date":"January 25, 2015 at 5:20 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186234","author":"Hugh Farey","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"I think there would have been some documentation of this.\nWe know that Tempesta, who was known for the accuracy of his engravings,see his Rome of 1593, a copy of which is still in Turin, was in Turin at the request of the duke, to see several expositions and  although we only have documentation of 48  expositions between 1600 and 1700, it is suggested that they might have been every year. We also know,see Beldon Scott, that visiting ‘saints’ were allowed to see it and de Beatis, see challenged quotation above!, arrived with his cardinal and instructions were given for them to see it( in Chambery, of course). So I don’t think you needed a statue as well.\nI do increasingly wonder whether, in line with similar painted linens, that  there was not some repainting done from time to time- see the loincloth issue.\nThere are two full scale copies of the Shroud that I know of in Turin. The first is in a  side chapel of the Church of San Lorenzo just in front of the royal Palace. This is the one people are normally taken to see. There is another in the church next to the Shroud Museum in the west of town. I was told by the curator who unlocked the church for me  to  see it that it had been given to the church as it was there that the Shroud had been stored after the fire of 1997′\n\n","date":"January 26, 2015 at 3:36 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186324","author":"Charles Freeman","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Hugh,\nmaybe I missed something.\nDo you think that the drawings of public exhibitions (the basis of Charles’ claims) do represent the TS as it was or do you prefer to look at the many paintings which were made (for most of them) by a direct viewing of the TS?\n\n","date":"January 26, 2015 at 3:06 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186463","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"I don’t want to cut in in front of Hugh but a simple point needs to be made.  We are exceptionally lucky in having a very rich collection of representations of the Shroud as it once was. Some of these, invariably by unnamed artists, are copies on textiles which may or may not have faded with time. Some are on lead, the Liery Pilgrim Badge. Some are engravings,some etchings, some lithographs. Some are competent, some are amateur. Some show some features such as a Crown of Thorns, others, if only a minority,do not. Virtually all them how the hair on the back of the head as falling down across the whole nape of the neck, something that can no longer be seen today.\nIn some cases we know that the artit or engraver was exceptionally competent. Antonio Tempesta, for instance, was famous for his engraving of Rome of 1593  which can be accessed through the Metropolitan Museum, New Yrok, website. So famous was he that the Savoys asked him to Turin and he produced a composite view of the exposition ( it is composite in that it includes the Shroud coming in its carriage to the site where it was displayed as well as the display itself .) it is hard to imagine that in this one instance he was faking what he saw.\nI have consistently argued that this enormously rich resource for the study of tHe Shroud needs to be assembled on one database so that it is accessible to anyone, specialist in art history or not, to study.  It is quite extraordinary that it has been completely neglected. There will be features once on the Shroud that can be seen on both copies on textiles and engravings but if we persist in putting copies against engravings we will get nowhere. Some of each are competent ,some of each are incompetent as with any other works of art.\nSo please let’s move on and hope that someone will come forward to finance this work.\n\n","date":"January 26, 2015 at 3:44 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186472","author":"Charles Freeman","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"It is not just that the images are more clearly defined -it is that they consistently show features that are now lost.This suggests that the images are not now as they were then which is the crucial point from which I conduct my own research and encourage those who ask me to do likewise. It is the same method I used in my book on the Horses of St,Marks. Yes, we can learn a lot from looking at them today but we must take them back to their original context and condition if we are to understand their origins. In fact, I am only following the normal approach to ancient objects. I am not sure why Shroud researchers start the other way round in believing that what exists today is somehow more meaningful than what existed centuries before. Perhaps it is because none of them have ever systematically studied any other ancient object.\nI am glad we, or at least Hugh and I, can argue from Beldon Scott. Figure 163 shows the same ostension as the Bolckmann does but from close up while his is from a great distance- It is difficult to argue,contra Beldon Scott, that the image on the Shroud is not there when it is very much there in detail in Boglietto’s etching of 1683 which is a good example as it clearly shows the Crown of Thorns, the long hair on the neck and the thumbs in a similar way to other depictions. Not all depictions are detailed enough to show the now vanished thumbs but so far as I can see most show them pointing out at an identical angle suggesting that is how they once were on the Shroud. \nWhy would Bolckmann be the only person to show a depiction lacking the images (and it is not clear that they are not there) when everyone else seems to have reproduced them? Were all the other artists conned over a period starting from the very distinct images of the Lirey Pilgrim Badge onwards despite the change of owners.  Whether etchings, engravings or lithographs, whether 1578, 1683 or 1842 they all show strong images. It is only in the ostension of 1868 (B.S. p.296)  where we clearly see a deterioration in one image  and the artist Perrin had no problem in showing part of the front image as faint and the rest similar to early depictions. So why did all the others have this problem and what would be the source of the Crown of Thorns and long hair in the back if they were not there? 1868  was also the first ostension where the Shroud had to be placed within a frame – a sign that they knew that it was deteriorating.\nBeldon Scott is good on how the influence of the French court  ( Louis XIV) made the ostensions very much more ordered than they had been in the chaotic days of Tempesta.\n\n","date":"January 24, 2015 at 12:08 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185983","author":"Charles Freeman","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Either the Shroud looked much as it does today, in which case we must explain why the engravings are so clear with their loincloths and crowns of thorns, or it was much better defined, with loincloths and crowns of thorns, in which case we must explain why the paintings are so faint and tenuous. I have tried to see both points of view, but cannot help finding the engravings easier to ‘explain away’ than the paintings. Rather like souvenir postcards of Roman ruins, they were created to show what was ‘meant’ to be there rather than what actually was there. I have only heard a couple of arguments the other way – one that the faint paintings were as bright as the Shroud but they too have faded with age, and the other that they were copies of something else. Neither of them ring true with me. Charles is quite correct that we ought to try to imagine what the Shroud was like when it was first created, and no doubt the cloth has yellowed and the blood largely rubbed off, but the earliest Ab Originale copies are too similar to its present appearance for me to think it was very different.\nHowever, I do not see that having a fainter appearance detracts from Charles’s Quem Quaeritis hypothesis at all, quite the reverse; it strengthens it, as I have explained above.\n\n","date":"January 24, 2015 at 12:31 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185988","author":"Hugh Farey","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"We have to rule out that the copies have not faded.  If linen paintings were not so vulnerable  we would today  have hundred of thousands of them of all shapes and sizes and with every kind of image today. That is what the inventories both of domestic houses ( the York study) and churches and monasteries have so many of them, all, with a very few exceptions now disappeared.\nI still think that the images on the engravings, lithographs, etchings ,etc would not have shared similar features if these had not been visible to the different artists who had to provide copies.\nThe blood was important – apparently the members of the Savoy family used to kiss the wounds before the Shroud went on display.\nWe are lucky to have the Shroud – the Savoys could hardly throw it away if, in my view, it began to deteriorate in the nineteenth century. In England it would, of course, have been burned at the Reformation along with the lucrative Blood of Hailes and other relics purporting to originate in the life of Christ.\n\n","date":"January 24, 2015 at 12:55 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-185993","author":"Charles Freeman","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"In favour of Charles’s hypothesis about a late degradation of the Shroud image: The altar boys of the church of Noalejo used to play with the shroud, by disguising themselves as ghosts. This is not a good way to conserve paintings in cloths, I suppose. A degradation process similar to the Shroud is plausible.\n\n","date":"January 28, 2015 at 3:11 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186839","author":"David Mo","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Hugh  I think you are being far too charitable towards Charles views. There are massive holes in his arguments. But it’s a bit tiring going over them, and you for one seem to be very happy entertaining them, which to me is in the category ” a little too cute and smart for it’s own good”. You know, it really does reek of “smart asses who think they are smarter than they really are”. Good luck to you. Me – I’ve got better things to expend energy on\n\n","date":"January 25, 2015 at 9:06 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186268","author":"Thomas","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"P.S. Yes, Hugh is right . My argument for the Shroud having been created for a Quem  Queritis ceremony does not depend on the images being faint or not. It would have been a much smaller congregation and so long as some sort of effort was made to show the imprints ( and in many cases the clothes  probably have had images at all or perhaps just a pattern of bloodstains) then the ritual needs would have be satisfied. Yet, when we read of church inventories that have a hundred or more painted linens, many simply to hang up in the church, then there would be no need to create some kind of exotic technique specially to create the images on the Shroud. The expertise would have there but so is the evidence that these paintings were very vulnerable to decay and disintegration leaving we know not what traces of their presence.\nYet I still think the evidence is a) that they were more vivid than they are now b) that there were features on the Shroud now lost but even if the surface of the Shroud was , in some inexplicable  way, unchanged over the centuries, it could still be used in a traditional Quem  Queritis ceremony without anyone complaining.\n\n","date":"January 24, 2015 at 1:49 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186003","author":"Charles Freeman","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Would someone care to make me an offer for the GENUINE Mona Lisa?\n\nYes, this is the real one, not that cheap and garish imitation that hangs in the Louvre.\nThere are three ways you can tell that mine is the original. Firstly, all, and I mean ALL the original paint pigment has fallen off, leaving just a ghost of Da Vinci’s original.\nSecond, you will note that what remains is a tone-reversed negative. Yes, when pigment detaches from a Da Vinci, one is left with a negative of the original. Not many people know that.\nHowever, the real proof that mine’s the original comes from entering the image into a 3D rendering program:\n\nOnly a genius of the highest order – Leonardo Da Vinci – centuries, nay millennia ahead of his time – was able to paint an image that degrades to leave a photographic negative with encoded 3D properties.\nMessage to prospective purchasers: informal ostentations are held nightly at my home, 3, Railway Cuttings, East Cheam. Entrance is free, but viewers are expected to purchase the East Cheam Pilgrim’s Badge, cast in durable epoxy resin for a special reduced price (£35 plus VAT).\n\n","date":"January 24, 2015 at 3:15 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186011","author":"Colin Berry","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"This was both funny and on the mark. It deserves more hat tips than it thus far has received.\n\n","date":"January 26, 2015 at 9:45 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186388","author":"David Goulet","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Right and wrong, Thomas. There are holes in Charles’s arguments, as I have clearly pointed out above, but there are also coherent pieces which cannot be swept aside with the holes. That the Shroud today is not exactly as it always has been is surely not in doubt. Most of each bloodstain has disappeared, leaving only a few flakes jammed in the interstices of the threads, and the entire cloth has yellowed with age, possibly reducing the contrast. That is not to say that it was once a full colour painting of a dead man covered in blood, and I agree that the Lier copy (even though that too has no doubt deteriorated in detail) is probably a fair illustration of the Shroud as it ever was.\nHowever, as Charles, points out, engraver after engraver produced images of the shroud which, although very similar to each other, are nothing like the Shroud as we know it. Unless extensive repainting and unpainting is invoked, it is difficult to explain why. The particular aspect that intrigues me is that the feet are usually seen widely separated and pointing outwards, whereas the Shroud has them close together (overlapping) and pointing inwards.\nIn this instance, it does not matter whether the Shroud is authentic or medieval. Here are two styles of copy; they are very different; they both need explaining. I don’t think this is being either cute nor a smart ass. If you, or anybody else, has already satisfactorily come up with an explanation, then I have yet to read it. I look forward to it…\n\n","date":"January 26, 2015 at 5:24 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186344","author":"Hugh Farey","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"We are at the beginning of serious research and we have lots to work on even if there is no access to the Shroud itself.\n\n","date":"January 26, 2015 at 6:32 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186357","author":"Charles Freeman","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"“The particular aspect that intrigues me is that the feet are usually seen widely separated and pointing outwards, whereas the Shroud has them close together (overlapping) and pointing inwards.”\n\nSorry Hugh, but I beg to differ re the stated position of the feet on the TS. I may be out on a limb here, but even with my (arguably) best imaging, using the enhanced 2008 BBC/Haltadefinizione (edited to 25/50/-100 brightness/contrast/midtone in MS Office) I see no clear evidence for the feet being crossed. \n\nAdmittedly one might imagine that to be the case from the frontal image (left above), where there’s a vague diagonal slant of one foot (viewer’s left) to the right, and assuming a single nail based on the presence of just one prominent bloodstain. But that interpretation is not supported in the dorsal image (right) where there would seem to be soles of both feet being separately imaged, albeit less convincingly than one might wish for.\nWho’s to say that crossed feet are not a somewhat fanciful interpretation, introduced by an early artist of some renown, one that was subsequently accepted as ‘gospel truth’ by his contemporaries and later generations, but more an article of faith  – or unquestioning belief –  than anything else?\nNone of this detracts of course from your note of caution above. If anything, it makes the need for caution even stronger.\n\n","date":"January 26, 2015 at 6:49 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186359","author":"Colin Berry","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"PS Afterthought: the Lirey Pilgrim’s badge shows crossed feet, frontal and dorsal. It’s understandable that has been seen as the gold standard (well, lead/tin alloy) where image interpretation is concerned. But without knowing who produced the badge, and/or the accuracy of his own observation and interpretation, we’d be unwise to consider “crossed feet” to be an established feature of the TS.\n\n","date":"January 26, 2015 at 7:24 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186365","author":"Colin Berry","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Yes; I deliberately avoided the word ‘crossed’ and put ‘overlapping’ in brackets so as to try to fudge the description! Whatever their precise position, they are clearly different from way they are depicted in most of the engravings, well apart and pointing outwards.\n\n","date":"January 26, 2015 at 8:04 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186374","author":"Hugh Farey","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Reminder for O.K.: on October 13, 2013 at 8:32 am, I wrote: \n1/ In 798-802, as a token of his esteem, Baghdad Caliph Harun al-Rashid (763-809), offered Charlemagne a brandeum or substitute relic of the Matthean “Sindon Munda”/”Sindon Kathara” as gift.\n2/ The mot likely original size for the Kornelimünster substitute relic called “Sindon Munda” is 480×120/125cm.\n3/  In the mid-9th century the Kornelimünster monastery (under Benedictine rules) became imperial abbey and received three Saviour’s relics that were kept in Aix/Aachen: the loin cloth, the Sindon munda (Around 875 CE an exchange took place: Charles the Bald gave a relic of the head of the martyred Pope Cornelius for half of the shroud for the establishment of his monastery in Compiegne in France) and the sudarium Domini, the beloved disciple and Shim‘on Kefa found in the empty tomb. The fact is the Compiegne Shroud and Kornelimünster Sindon Munda were the two halves of the same representative relic or brandeum cut in two halves around 875. IT shall not be mistaken for the Sudarium Domini.\n4/ The Compiene halve was several times re-cut to get more brandea out of it and as such is not reliable to infer the original size of the brandeum Baghdad Caliph Harun al-Rashid gave Charlemagne.\n\n","date":"January 26, 2015 at 11:40 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186417","author":"Max patrick Hamon","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Correction: 240/250 x 180/200 cm\n\n","date":"January 27, 2015 at 11:55 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186665","author":"Max patrick Hamon","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"“As position of the cut indicates, the original size of this cloth must have been not 4x1m (like TS) but about 1,8 m x 2m”.\nOskar, you’re right.\n\n","date":"January 27, 2015 at 12:05 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186670","author":"Max patrick Hamon","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"I am happy you have admitted that,Max.\n\n","date":"January 27, 2015 at 1:09 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186688","author":"O.K.","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"The non-imaged original representative of the Shroud of Christ seems to refer to the TS as if the dorsal and ventral images were seen side by side and not upside down in head-to-head discontinuity.\n\n","date":"January 27, 2015 at 3:23 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186706","author":"Max patrick Hamon","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Ever since 817 CE, the Benedictine monks of Kornelimünster near Aachen (Aix-la-Chapelle) claimed to possess the Sudarium Domini (size 352 cm wide and 650 cm long that was over his head ) together with the apron or Linteum Domini (Last Supper relic) and the “Clean Shroud of Christ” or “Sindon Munda” (most likely a representative relic or brandeum. \nIn 1468 CE illustrations of the three relics (see THE SACRED LINEN-CLOTHS OF CHRIST’S PASSION IN EGYPT by Otto F. A. Meinardus, Winter 2003 • Coptic Church Review – Volume 24, Number 4, p. 108; link https://www.google.fr/url?sa=t&rct=j&q=&esrc=s&source=web&cd=6&cad=rja&uact=8&ved=0CEwQFjAF&url=http%3A%2F%2Fwww.copticchurchreview.com%2FCoptic%2FHome_files%2F2003%2520Winter.Vol24.%25234.pdf&ei=cbbHVKLKNs3ksATMo4CYBA&usg=AFQjCNEVzMNBbAaPcdmNxaLaD-G75IUdRQ&sig2=uIv9YtJO02CeA-FeqPl06w) both the Sudarium Domini and Sindon Munda are featured only with “drops” (neither face nor body image). No doubt, Charles (sticking to his pseudo-intellectual reasoning — along with Hugh?) would infer “drops” were originally painted at one point in time on the relics/substitute relics but disappeared at another point in time through folding and unfolding, which is NOT the case.\n\n","date":"January 27, 2015 at 11:51 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186663","author":"Max patrick Hamon","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Thanks for introducing us to those quaint little woodcuts, with which I was not familiar. I believe the actual Kornelimunster relics lack any images, except for a blur in the schuztuche which is sometimes interpreted as the dirt from Judas’s feet. However, as you point out, the 15th century woodcuts show them covered in drops of blood, which they clearly don’t have. Quite possibly the engraver had never even seen them. I agree with you that the relics never had any more marks than they have now, so perhaps you would like to speculate as to why the engraver (deliberately?) misrepresented them. It may shed light on the Shroud of Turin.\n\n","date":"January 27, 2015 at 6:52 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186743","author":"Hugh Farey","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"I am so glad we are moving the rich collection of depictions, accurate or otherwise, of the Shroud into the debate. Progress in a new direction at last.\n\n","date":"January 28, 2015 at 2:16 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186817","author":"Charles Freeman","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"I have looked up the full text (in English)  of the  Antonio De Beatis- the original is in fact in Italian not Latin as I imagined it would be from the chaplain of a cardinal. The full text  in translation is published by the Hakluyt Society, 1979 (there had apparently been an ‘unreliable’ French translation in 1913 but the 1979 translation is the first in English).  \nThere is a full account of the visit together with a legend that it had been brought back by a Savoy from the First Crusade.  I was interested to read on past the description to find ( p.141), ‘They say that the dimensions of these divine imprints are found to be different every time they are taken, and that they are as clearly visible from a distance as from close range.’\n It was exhibited to pilgrims on Good Friday and for three days in May from the (Chambery) castle wall and pilgrims would gather to see it in a meadow outside the town walls.  De Beatis goes on to tell us that the Savoys used to take it round with them but plague broke out in Chambery when they did so and now that it was securely kept at Chambery and the outbreaks of plague had ceased.\nI never imagined for a moment that the images as they originally were could not be seen from a distance and this seems supporting evidence.\n\n","date":"January 28, 2015 at 10:20 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186952","author":"Charles Freeman","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"As early as 1207, the  image of Yeshua’s DEAD NAKED body on the Constantinople Sindon is described as aperilepton, “elusive” (= unsubstantial, illusory, evasive, mysterious). This is at one and the same time totally consistent with the TS man image and in striking contrast with Charles’  opinion the TS man image was originally painted with a crown of thorns and loin cloth in 1325 CE± 65! \nIn the Rothchild Canticles (f. 84r), ca 1300 CE, the Shroud of Christ as an expanse of shining white cloth twisted into a knot and bearing two disembodied twin-like heads and a dove, stands for (the Triumph of ) the Holy Trinity. It is a simulacrum of the ultimate Holy Grail/Graal-like vision mystics aspired to. \nReminder: on April 19, 2012 at 7:26 am| #10, I wrote:\n“(…) In Hebrew “Gar El” means “Deus Habitet” = Tabernacle, “Gar Ael” means “The Messenger Shines (on it)” and gaal “to ransom, redeem” (…). Now, according to Christians,\nG-d’s messenger and martyr par excellence is Yeshua’ whose dead naked body shines on his burial cloth as an emblem of his resurrection.\n\n","date":"January 28, 2015 at 6:56 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186898","author":"Max patrick Hamon","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Link at: http://www.monasticmatrix.org/sites/monasticmatrix.osu.edu/files/figurae/9im57.gif\n\n","date":"January 28, 2015 at 6:56 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186899","author":"Max patrick Hamon","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Painted copies (no matter how faint) of the TS man body do not shine. Only the TS man image does.\n\n","date":"January 28, 2015 at 7:00 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186901","author":"Max patrick Hamon","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Reminder: KYROS (Κύρος), “Lord”, is the Greek form of Hebrew Kowresh (Old-Persian kūruš or Khūrvaš ) meaning “sun-like”, to name Yeshu’a in the Gospels.\n\n","date":"January 28, 2015 at 7:08 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186902","author":"Max patrick Hamon","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Reminder 2: the Holy Grail/Saint Graal as the vessel of the Christ-force “shines like the sun at midnight”…\n\n","date":"January 28, 2015 at 7:11 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186904","author":"Max patrick Hamon","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Reminder 3: Knights Templar’s secret chapters were held at midnight and they venerated a bearded head in figure of Baphomet ( > Hebrew Ba-Pheo-Emet, “In His Mouth (is the) Truth”) that, most curiously, is also described as having “four legs: two at the front and two at the back”\nOn May 4, 2014, I wrote:\n“(…) Re the head the Knights Templar venerated and cryptically said to be in figuram baffometi (in semblance of Baphomet):\nThe very word “baffomet/baphomet” does wordplay (medieval etymology) with the Old French phrase “Ba Mauffé”, “Down with the Devil” (referring to Yeshua’s awe inspiring death mask (= the Holy Face of his Holy Shroud with his sole head appearing through the “MONSTRance”, i.e. the crystal rock of a vast oculus as central circular opening in front side of a reliquary). Actually via an archaeopareidolia, his death mask could appear AS IF having “two horns” at forehead level.”\n“The word very baffomet/baphomet (my own scientific etymology) comes from the Hebrew Ba-phéo-Emet. Now transcripted in Italian “é la bocca della Verità”, “the word in his mouth is Truth”, through analogy, It does refer (my own iconocryptology) to “La Bocca della Verità” (or The Mouth of Truth”), an ancient marble mask with a hole in the mouth. The Knight Templars’ alleged ‘idole’ in likeness of a Baphomet is nothing but a combination of two Holy faces: both the Holy Face of the Holy Shroud and the Holy Face of the Holy Veronica II aka The (open-mouthed) Holy Face of the Manoppello Veil.”\n“Archaeocryptollogicaly speaking, this is made pretty obvious when you make a comparative study of the two Holy Faces in light of the Bust of Christ depicted in the Templar oak panel from Templecombe.”\n“The Knights Templar’ ‘Head’ was reported (by Hugues de Payraud) to have “four legs: two at the front and two at the back”. Actually the Shroud image does show a bearded head along with the frontal imprints of two legs and feet (the latter apparently ‘missing’ for a few Shroudies though) AND dorsal imprints of two legs and feet.”\n\n","date":"January 28, 2015 at 7:26 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186915","author":"Max patrick Hamon","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Re “La Bocca della Verità”, link athttp://upload.wikimedia.org/wikipedia/commons/7/7b/Bocca_della_verit%C3%A0.JPG\nNow compare it with the overlapping of the Holy Face of the Manoppello Veil and the Holy Face of the Turin Shroud. Ring any bell?\n\n","date":"January 28, 2015 at 7:36 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186917","author":"Max patrick Hamon","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"\n\n","date":"January 28, 2015 at 7:37 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186918","author":"Max patrick Hamon","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Re the TS bloodied body image iridescence, on May 30, 2013 at 12:48 pm, I wrote:\n“Besides the blood being red in bright sunlight, the Turin Sroud body image, seen under a certain angle and light, is fairly IRIDESCENT (as a translucent straw yellow impression). This observation is totally consistent with a light/pre-mordanting image formation process whether or not any carbon monoxide liberated along with fumigation smoke were trapped “there for ever” in the process (along with bilirubin?).”\n\n","date":"January 28, 2015 at 9:31 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186940","author":"Max patrick Hamon","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Twice now on this site I’ve reminded folk that any difficulty in seeing the TS body image from a distance would have been rendered less of a problem in public displays by the presence (or maybe deliberate addition) of blood stains and scourge marks. So while “over-flagellation” has been cited as evidence of a paying of lip service to  prevailing artistic fashion  it might equally well have been done to assist visibility, while not compromising the credibility that attaches to a faint body image per se deemed to be a genuine imprint of the body of Christ.\nResponse to my ‘blood-compensates-for-faint- body-image’  from the eccentric strand of thought that would have us believe that the TS body image is all about disintegrating medieval paint pigment? Answer: zero. \nWhy bother further when one’s own and others’ objections re blood and other crucial image properties (tone-reversed negative, 3D properties) persistently fall on deaf ears?\nChanging the subject: has anyone here ever tried mega-dosing on Vitamin C (say 1 gram or more per day, which may seem large, more than 12 times the UK RDA, but still only a third that recommended by Nobel Laureate Linus Pauling)? \nVitamin C is the current preoccupation on my sciencebuzz site (the TS having been relegated for now for reasons to do with monotonous banging of drums). Single 1g doses of Vitamin C cause my finger joints to “crack”. My wife who, without any prompting or encouragement from me, offered her services last weekend as a guinea pig says the same – her finger joints are now cracking.  Has anyone else here found that?\n\n","date":"January 28, 2015 at 11:40 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-186968","author":"Colin Berry","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Cloruro de magnesio.\nCarlos.\n\n","date":"January 28, 2015 at 2:30 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-187002","author":"Carlos","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Yes. I’m aware of the suggested link between joint noise and magnesium deficiency (with some folk taking the magnesium chloride supplement you indicate Carlos). But the joint noise (variously described a creaking, cracking, clicking) did not come on until after taking the first 1g tablet , finally went away after some weeks, and then immediately returned with 2nd, 3rd tablets. I suppose it’s possible that Vitamin C might cause loss of magnesium, explaining its action, but why 1g should have that effect is not obvious (the human body is said to contain 21-28 grams of Mg).\n\n","date":"January 28, 2015 at 2:49 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-187004","author":"Colin Berry","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Nice theory re: blood Colin. I’ve said it before, I’ve got a feeling some, if not all the blood, was added. I still on balance believe the image is ‘authentic’. But not necessarily the blood. Or at least not all of it.\n\n","date":"January 29, 2015 at 1:00 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-187115","author":"Thomas","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Thanks Thomas. It’s in fact quite instructive and possibly enlightening to put oneself in the position of a medieval monk who has been given the task of making a faint body imprint more visible from 50 yards,while (a) doing nothing that detracts from the ghostly body image and (b) can lend further credibility to a 33AD provenance consistent with or reinforcing the New Testament accounts of the torture and crucifixion..\nPersonally, I’d start with the major blood flows, and not worry too much about some of them seeming to trickle down the frontal hair, the important thing being to leave a signature of the crown of thorns (the latter not being imaged). I’d then add the scourge marks, making them as evenly spaced as possible, with minimal cross-crossing that looks untidy, and trying not to undo my major bloodstain handiwork work by mixing up or overlapping the two types. Forearms?  There’s a lot of work gone into creating those intricate blood trails there, so don’t go and spoil it by adding  some distracting scourge marks as well, bar the merest hint. I’d also be very careful to keep scourge marks clear of the area on the dorsal side where the viewer expects there to have been long hair reaching down to the shoulders, especially as the latter itself is poorly imaged. Maybe the colleague who did the body image to simulate a sweat imprint felt it best to give the merest hint of a hair imprint, hair tending to trap sweat, perhaps, as distinct from facilitating its passage from scalp to linen.\nOne then mentally compares one’s own mapping with the actual. \nHmmm. Now that’s interesting, at least to this pair of jaded but still quizzical eyes.\nMight there be the makings of a book here? Nah.Too much by way of bare bones, not enough flesh for an entire book.\nIt might make a magazine article though. Can anyone here suggest or recommend a suitable magazine targeted at history buffs in the the general population, available on news stands, preferably an online presence too? But would it accept a few thousand words from this gifted amateur (admittedly lacking solid academic credentials, sigh) on the “real” history of the Turin Shroud?\n\n","date":"January 29, 2015 at 3:07 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-187135","author":"Colin Berry","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"La utilización del cloruro de magnesio en las artrosis, y procesos similares, carece de base científica…..pero “funciona” en muchos casos, tras largos periodos de administración.\nSe lo administro a mi esposa en forma de polvo cristalino una cucharadita al día (es muy amargo y puede tener algún efecto laxante) y se lo he indicado a algunos de mis mejores amigos, siempre con muy buenos resultados que la medicación usual es incapaz de obtener.\nCon esa dosificación carece de efectos adversos.\nCarlos\n\n","date":"January 28, 2015 at 3:48 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-187016","author":"Carlos","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Thanks Carlos. Here’s a Google translation:\n“The use of magnesium chloride in osteoarthritis, and similar processes, no scientific basis … ..but “works” in many cases, after long periods of administration.\nWould administer my wife as a crystalline powder one teaspoon a day (very bitter and may have a laxative effect) and I have indicated some of my best friends, always with good results that the usual medication is unable to obtain.\nWith this dose no adverse effects.”\nThanks for the interest. Probably best we stop there.\n\n","date":"January 28, 2015 at 4:02 pm","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-187021","author":"Colin Berry","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Could Charles (AND Colin) account for an alleged “1325 CE± 65 monk” using an about  4,40  x  1,10m DOUBLY IMAGED cloth (implying it was wrapped around the body from head to toe) while  the original size of the most famous NON-IMAGED representative relic of the Sindon Munda/Sindon Kathara (or Matthean “PURE/CLEAN cloth”, first kept in Aachen or Aix-la-Chapelle and then –after having been cut in two halves– Compiègne and Kornelimünster) was only about  2,10 x 1,80m and NON-IMAGED (implying it was wrapped around the body from one side to the other)?\n\n","date":"January 29, 2015 at 7:05 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-187183","author":"Max patrick Hamon","site":"shroudstory"},{"title":"You cannot fold and unfold a painting (and more)","post":"Concerning the Noalejo copies David Mo wrote:\n“For example, we cannot exclude that the cloth don’t be a free copy of a copy of a copy made in more recent date than 1527.”\nDo you mean that the original copy based on the SOT could have been made in more recent years than 1527 or that this only applies to the two Noaeljo copies?\nOf course you can´t exclude that the two Noalejo copies were based on another copy.\n\n","date":"January 31, 2015 at 7:54 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","id":"comment-187737","author":"Henrik","site":"shroudstory"}]
