[{"title":"Another Take on the Urfa Mosaic","post":"I fully agree with this comment.  I don’t trust at all this comparative image technique.  It’s not a very scientific technique in my mind.  Way too much suggestive.  In fact, if the author took the Shroud face as the main image and use his technique again to compare it to other Jesus depictions, he would probably get the same result and the Shroud face then would be consider as the primary source for ancient Jesus depictions and not the ISA mosaic !  If he used one of the oldest Jesus fresco from the Roman catacombs, he would surely get, again, the same result and this fresco would be consider the primary source, etc., etc.\nAnd another thing I want to underline is the fact that this article don’t give us any proof at all that the Shroud and the Mandylion are one and the same thing.  It’s a preconception in the mind of the author.  In fact, even if the ISA mosaic hypothesis is true and was made around the time that the Mandylion came to Edessa, how can we be sure that this Mandylion wasn’t just another artistic depiction of Jesus (maybe or maybe not based on the Shroud) ?  It could well be the case !  In EVERY surviving copies of the Mandylion, Jesus is ALWAYS depicted has a living men without any traces of blood or injury in the face.   And another thing this article don’t give us is the real age of the ISA mosaic.  If we don’t have a true age for this mosaic (and also an absolute authenticity proof), then I found the author hypothesis to be really week…\nIn fact, one of the only good thing about this article is to point out the fact that, surely, there is a primary common source for the ancient depictions of Jesus and that this source was so important that it came to be THE source for every Jesus depictions…  But the question remain unanswered :  What was the primary source ?  We still don’t know.  And I still think the first source (the original one) was the Shroud but, as the author of the article point out, it could well be a fact that the Shroud was a primary source for just one artistic depiction of Jesus and then, this artistic depiction (the Mandylion ?) became THE main source for other Jesus depictions.  In my mind, this is a possibility as good as the hypothesis put forward by the author…\n\n","date":"May 24, 2011 at 11:41 am","url":"https://shroudstory.com/2011/05/19/another-take-on-the-urfa-mosaic/","cat":"art","id":"comment-3182","author":"Yannick Clément","site":"shroudstory"}]
