[{"title":"A Guest Posting by O.K. –  Even in China They Know Jesus’ Characteristic Features","post":"One note, the text above is of my autorship. I have sent it to Dan, a day or two ago.\n\n","date":"May 15, 2014 at 3:52 am","url":"https://shroudstory.com/2014/05/15/even-in-china-they-know-jesus-characteristic-features/","cat":"art","id":"comment-119751","author":"O.K.","site":"shroudstory"},{"title":"A Guest Posting by O.K. –  Even in China They Know Jesus’ Characteristic Features","post":"I apologize for the goof. I meant to say that and have fixed the title.\n\n","date":"May 15, 2014 at 3:56 am","url":"https://shroudstory.com/2014/05/15/even-in-china-they-know-jesus-characteristic-features/","cat":"art","id":"comment-119754","author":"Dan","site":"shroudstory"},{"title":"A Guest Posting by O.K. –  Even in China They Know Jesus’ Characteristic Features","post":"Thanks.\n\n","date":"May 15, 2014 at 4:16 am","url":"https://shroudstory.com/2014/05/15/even-in-china-they-know-jesus-characteristic-features/","cat":"art","id":"comment-119760","author":"O.K.","site":"shroudstory"},{"title":"A Guest Posting by O.K. –  Even in China They Know Jesus’ Characteristic Features","post":"Sounds heart-felt, but is it in fact, true? Iconography has been remarkably consistent, and images of the infant Jesus and his mother are almost always recognisable as such without any label. Type “icon” and the name of a holy figure into Google and dozens of very consistent similar images appear for almost anybody. Moses has gaunt cheeks and white hair,  Andrew’s hair is white and slightly unkempt, John the Baptist has darker, longer and wilder hair than anybody, and Peter has a very full beard and looks like Zeus. In icons of the Last Supper almost all the apostles are instantly recognisable.\nIn short, there most certainly are stock types for all the holy figures, and Jesus is just one of them. No doubt if I gave examples of twenty St Johns, OK would find an exception and say I was wrong; but if he finds twenty Christs and I find an exception, then for some reason that doesn’t count. Special pleading, if you ask me…\n\n","date":"May 15, 2014 at 7:31 am","url":"https://shroudstory.com/2014/05/15/even-in-china-they-know-jesus-characteristic-features/","cat":"art","id":"comment-119859","author":"Hugh Farey","site":"shroudstory"},{"title":"A Guest Posting by O.K. –  Even in China They Know Jesus’ Characteristic Features","post":"Sounds heart-felt, but is it in fact, true? Iconography has been remarkably consistent, and images of the infant Jesus and his mother are almost always recognisable as such without any label.\nYes, Hugh, but they are easily recognizable by their standard  attributes (Madonna with Child, for example), but we are talking about physical appearance. Tha Black Madonna of Częstochowa (http://upload.wikimedia.org/wikipedia/commons/5/51/Blackmadonna.jpeg ) is completely different from Raphael’s Madonna della Seggiola (http://upload.wikimedia.org/wikipedia/commons/f/f2/Raffael_026.jpg).\nSimilarly Saint John at Patmos by Velaquez http://www.wikipaintings.org/en/diego-velazquez/saint-john-at-patmos looks completely different from Bosch’s  http://www.wikipaintings.org/en/hieronymus-bosch/saint-john-the-evangelist-on-patmos-1485\nWhy isn’t it in the case of Christ? Why one physical look, even when portrayed with sinic features?\n\n","date":"May 15, 2014 at 7:51 am","url":"https://shroudstory.com/2014/05/15/even-in-china-they-know-jesus-characteristic-features/","cat":"art","id":"comment-119872","author":"O.K.","site":"shroudstory"},{"title":"A Guest Posting by O.K. –  Even in China They Know Jesus’ Characteristic Features","post":"\nBut this, for some reason, doesn’t count….\n\n","date":"May 15, 2014 at 9:07 am","url":"https://shroudstory.com/2014/05/15/even-in-china-they-know-jesus-characteristic-features/","cat":"art","id":"comment-119915","author":"Hugh Farey","site":"shroudstory"},{"title":"A Guest Posting by O.K. –  Even in China They Know Jesus’ Characteristic Features","post":"Why bother, you can simply go straight to the Michelangalo and the Last Judgment: http://upload.wikimedia.org/wikipedia/commons/3/3f/Michelangelo%2C_Giudizio_Universale_03.jpg \nBut those are exceptions, and the “classical” look of Christ is firmly established. Contrary to other prophets and saints. The differences in look there are an order of magnitude higher, than some variations on the Christ theme.\n\n","date":"May 15, 2014 at 9:20 am","url":"https://shroudstory.com/2014/05/15/even-in-china-they-know-jesus-characteristic-features/","cat":"art","id":"comment-119923","author":"O.K.","site":"shroudstory"},{"title":"A Guest Posting by O.K. –  Even in China They Know Jesus’ Characteristic Features","post":"I thought so. I think we’ll just have to disagree.\nCordially, of course.\n\n","date":"May 15, 2014 at 10:47 am","url":"https://shroudstory.com/2014/05/15/even-in-china-they-know-jesus-characteristic-features/","cat":"art","id":"comment-119966","author":"Hugh Farey","site":"shroudstory"},{"title":"A Guest Posting by O.K. –  Even in China They Know Jesus’ Characteristic Features","post":"I read the CM/CA paper referred by David Mo.  I found it particularly informative on the number of early beardless Christs, and I was reminded of a recent posting here in apocryphal writings of Jesus as “shape-shifter”, where his appearance was said to be different to different people.  Which is of course legendary stuff. \nHowever by the end of it, I considered the paper overly interpretive, and came to a conclusion of how artistic mythology is created and reinforced by such papers.  The paper is weak on some necessary objective factual evidence.  Much is made of the now discredited Pierre D’Arcy memo, and it was only too evident that the Thurston / Chevalier notorious paper had been uncritically embraced by the authors, and it was only too clear that this alone was sufficient for them to adopt an anti-authenticity position regarding the Shroud, with no mention of any scientific work to the contrary.   The idea presented being to reinforce their thesis that acceptance of Christ imagery is determined by popular-low culture, as anti-Pope Clement VII had acceded to the popular demand for the Lirey expositions against the factual evidence, an overly-subjective interpretation indeed.  \nIt cannot be surprising that iconic portrayals in the West differ considerably from those in eastern Christianity of whatever branch, Orthodox, Nestorian or Monphysite.  The Eastern focus was on representations of Mandylion imagery, and it was some centuries before this penetrated to the West. I wonder for example if Michelangelo had indeed ever heard of the Mandylion?  The Western imagery is largely irrelevant when it comes to debating to what extent the Mandylion influenced the appearance of Christ imagery.  \nFor a productive discussion concerning what influence the Shroud may have had on such imagery, the focus needs to concentrate on the eastern representations.\n\n","date":"May 15, 2014 at 4:37 pm","url":"https://shroudstory.com/2014/05/15/even-in-china-they-know-jesus-characteristic-features/","cat":"art","id":"comment-120094","author":"daveb of wellington nz","site":"shroudstory"}]
