[{"title":"Picture for Today: Poster for the 1931 Exhibition of the Shroud","post":"How many Camel power was the Roman tank in the Related News and Views ?\n\n","date":"March 13, 2015 at 2:22 am","url":"https://shroudstory.com/2015/03/13/picture-for-today-poster-for-the-1931-exhibition-of-the-shroud/","cat":"art","id":"comment-193265","author":"Emmett McMahon","site":"shroudstory"},{"title":"Picture for Today: Poster for the 1931 Exhibition of the Shroud","post":"Feet separated and toes pointing outwards. Long flowing hair in the neck. Burnmarks at a safe distance from the body. Large margin from the feet to the end of the garment and so on. The shroud seems to have more in common with earlier exhibition copies than the SOT itself even if photographs of the shroud were accessible in 1931.\nHugh Farey suggested earlier that a category of SOT copies (where the shroud is being held up) descended from a single copy of the original kept in the same place. Perhaps the common features within the tradition can be explained on the basis of mutual inspiration? This was simply the version of the Shroud that belonged to the common mindset during a couple of centuries in the same way as the negative contrast enhanced versions of the SOT, that show up on google, is how people imagine the shroud nowadays. \nThe majority of artists over the centuries (if not everyone) must have been familiar with this tradition before they contributed with their own works.\n\n","date":"March 13, 2015 at 6:35 am","url":"https://shroudstory.com/2015/03/13/picture-for-today-poster-for-the-1931-exhibition-of-the-shroud/","cat":"art","id":"comment-193275","author":"Henrik","site":"shroudstory"},{"title":"Picture for Today: Poster for the 1931 Exhibition of the Shroud","post":"Hello Dan, I can’t seem to find page on the Facebook. Precise name of the page, or link?\nThank u!\n\n","date":"March 13, 2015 at 6:02 pm","url":"https://shroudstory.com/2015/03/13/picture-for-today-poster-for-the-1931-exhibition-of-the-shroud/","cat":"art","id":"comment-193310","author":"nenadd","site":"shroudstory"}]
