[{"title":"Beyond LUWU and LOTTO","post":"An amazingly comprehensive collection of brass rubbings on the Google site.  But none could be mistaken as being taken from a real human person.  They are all too clearly taken from an inorganic template.  That is what sets the TS image apart.  It might be argued that the TS image could have been taken from a template.  But even more so it can be more strenuously argued that it was not.  That is not the case with the rubbings, which all too clearly have an inorganic origin.\n\n","date":"July 29, 2014 at 6:51 am","url":"https://shroudstory.com/2014/07/29/beyond-luwu-and-lotto/","cat":"art","id":"comment-141040","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Beyond LUWU and LOTTO","post":"Same old, same old… (sneer, sneer, sneer)…\n\n","date":"July 29, 2014 at 10:09 am","url":"https://shroudstory.com/2014/07/29/beyond-luwu-and-lotto/","cat":"art","id":"comment-141063","author":"Colin Berry","site":"shroudstory"},{"title":"Beyond LUWU and LOTTO","post":"If you didn’t find the truth yet, I guess you gotta keep searching, until all other options are excluded.  The Search is probably part of the fun stuff and teases the brain, but maybe you have to be in a state of denial to pursue it.\n\n","date":"July 29, 2014 at 4:14 pm","url":"https://shroudstory.com/2014/07/29/beyond-luwu-and-lotto/","cat":"art","id":"comment-141099","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Beyond LUWU and LOTTO","post":"1-“In the paper “Correlation of Image Intensity on the Turin Shroud with the 3-D Structure of a Human Body Shape” written by Jackson, Jumper and Ercoline in 1984, they estimated that he areas of direct-contact between the cloth and the back of the body were covering a total surface of ≈ 2800 cm2 at the time of the image formation, while on the front side, they were only covering a total surface of ≈ 1100 cm2”\nThis could be a good start to discuss wether “might John P.Jackson have been right in thinking the frontal and dorsal images of the Man on the Turin Shroud are subtly different”\n2-What does Colin see that is 3D in this?\n…\n\n","date":"July 29, 2014 at 10:33 am","url":"https://shroudstory.com/2014/07/29/beyond-luwu-and-lotto/","cat":"art","id":"comment-141066","author":"anoxie","site":"shroudstory"},{"title":"Beyond LUWU and LOTTO","post":"Looks like Colin learnt brass rubbing at Westminster Abbey, like me. Very nice, it is like entering the Gothic world, but nothing that could be called 3D.\n\n","date":"July 29, 2014 at 1:02 pm","url":"https://shroudstory.com/2014/07/29/beyond-luwu-and-lotto/","cat":"art","id":"comment-141082","author":"Louis","site":"shroudstory"},{"title":"Beyond LUWU and LOTTO","post":"When the creator of TS introduce blood to the image if he use brass rubbing technique?\n\n","date":"July 29, 2014 at 6:27 pm","url":"https://shroudstory.com/2014/07/29/beyond-luwu-and-lotto/","cat":"art","id":"comment-141120","author":"Sampath Fernando","site":"shroudstory"}]
