[{"title":"Bouguereau’s Mary","post":"May we see the ears please? I think I’ve seen that face somewhere else.","date":"October 29, 2013 at 6:46 am","url":"https://shroudstory.com/2013/10/29/bouguereaus-mary/","cat":"art","id":"comment-49090","author":"colinsberry","site":"shroudstory"},{"title":"Bouguereau’s Mary","post":"Interesting parallel, Colin. Arwen is daughter of a god that becomes the spouse of a Man. Mary is daughter of a Man who becomes spouse of a God. If we can get Liv Tyler to play the Blessed Virgin in a film the circle, er ring, will be complete.\n\n","date":"October 29, 2013 at 7:26 am","url":"https://shroudstory.com/2013/10/29/bouguereaus-mary/","cat":"art","id":"comment-49092","author":"David Goulet","site":"shroudstory"},{"title":"Bouguereau’s Mary","post":"I too saw this reconstruction of the Virgin Mary and yes, I agree it’s stunning, it’s also deceptive. You cannot detect skin color and tone from the Shroud, but common sense would suggest Miriam of Nazareth would look more like a woman of the Middle East than of Central Europe; more Palestinian than French.\n\n","date":"October 29, 2013 at 7:24 am","url":"https://shroudstory.com/2013/10/29/bouguereaus-mary/","cat":"art","id":"comment-49091","author":"Joe Veneroso","site":"shroudstory"},{"title":"Bouguereau’s Mary","post":"I’m glad you picked up on that David. Tolkien’s ‘Lord of the Rings’ has always been recognized as intensely religious, and it did not take long to locate a reference to that point in general, and even to Arwen in particular:\nFrom: Faith and Fantasy: Tolkien the Catholic, The Lord of the Rings, and Peter Jackson’s Film Trilogy\n“J. R. R. Tolkien once described his epic masterpiece The Lord of the Rings as “a fundamentally religious and Catholic work.” Yet nowhere in its pages is there any mention of religion, let alone of the Catholic Church, Christ, or even God. Tolkien’s hobbits have no religious practices or cult; of prayer, sacrifice, or corporate worship there is no sign.”\nbut later:\nAnother religiously significant addition is the elf princess Arwen’s intercessory prayer for “grace” to be given to Frodo. In Fellowship, seeking to save Frodo from the forces of Mordor, Arwen prays, like Moses or St. Paul expressing their willingness to be accursed for the sake of God’s people, that any “grace” given to her should instead pass to Frodo to save his life.\nhttp://www.decentfilms.com/articles/faithandfantasy\n\n","date":"October 29, 2013 at 7:34 am","url":"https://shroudstory.com/2013/10/29/bouguereaus-mary/","cat":"art","id":"comment-49093","author":"colinsberry","site":"shroudstory"},{"title":"Bouguereau’s Mary","post":"Despite several attempts to do so, and Peter Jackson often choosing NZ for his filming location, I have yet to succeed in persevering with Tolkien to any conclusion. I guess complex fantasy plots with large casts of characters all with abstruse names is not really my genre. Colin’s quote of Tolkien’s comment that “Rings” is a “fundamentally religious and Catholic work”, I can however understand. It exploits the cosmic conflict between ‘good’ and ‘evil’, a classic theme in any number of other heroic epics. Essentially the same perspective is dwelt on in the Book of Revelations, and other apocalyptic scriptures. \nRather more to my liking, are the works of Graham Greene. Catholicism here is more explicit, but Greene deals with it in an unconventional and unexpected way, and creates fascinating moral dilemmas, which are resolved in a way that is unexpected, and forces the reader to reflect on the issues he raises. Often depressing, but an excellent writer. A quote from Encyc Brit:  \n“The world Greene’s characters inhabit is a fallen one, and the tone of his works emphasizes the presence of evil as a palpable force. His novels display a consistent preoccupation with sin and moral failure acted out in seedy locales characterized by danger, violence, and physical decay. Greene’s chief concern is the moral and spiritual struggles within individuals, but the larger political and social settings of his novels give such conflicts an enhanced resonance. His early novels depict a shabby Depression-stricken Europe sliding toward fascism and war, while many of his subsequent novels are set in remote locales undergoing wars, revolutions, or other political upheavals.”\n\n","date":"October 29, 2013 at 7:30 pm","url":"https://shroudstory.com/2013/10/29/bouguereaus-mary/","cat":"art","id":"comment-49142","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Bouguereau’s Mary","post":"dave, do you think Heaven is going to look like where you live, in New Zealand? Because if it does, I will not even be disappointed.  If the Lord wants to, he can totally forget my mansion and give me a shack in NZ. Our country is one of great beauty, but yours takes my breath away.\nAdolphe William Bouguereau was one of the most famous artists of the 19th century in France. His Madonnas were calculated to appeal to the sensibilities of the bourgeois French who had grown up with the tales of the “phenomena” in Lourdes and La Salette and a few other places, including Paris with St. Marie Labouret., another wax-covered cadaver.  Needless to say, “La belle vierge Marie” didn’t look anything like Maryam Bint Joachim, daughter of the house of David.  She was in all likelihood very much like the Bedouin girls living there now; diminutive, malnourished, probably toothless and possibly bow-legged because of a lack of dietary protein. Not anyone in Daumiers’s “Fourth Class Carriage” would have sat next to her, mores the pity.\nOne of Bougereau’s finest works graces our humble San Antonio Museum of Art; “Admiration.” I got close enough to take a really good look.  This artist was so amazing he painted the veins under the clear and perfect skin with anatomical accuracy. He was voted President for Life of the Academy of Fine Arts, and rightly so. Because of his conventionality and convictions, he was nearly forgotten after Modernism, Cubism, Fauvism and all the other twentieth century “isms.”  I’m a big fan, he was awesome.\n\n","date":"October 29, 2013 at 11:29 pm","url":"https://shroudstory.com/2013/10/29/bouguereaus-mary/","cat":"art","id":"comment-49156","author":"Josie L. Tyner","site":"shroudstory"}]
