[{"title":"Cluny Medal versus Lirey Badge","post":"Dan,\nI think his whining about your choice of words is a distraction from the vacuity of his claim that it is really Jacques de Molay  It is absurd to believe that in 1353, canons at any Church would be issuing a medallion in honor of a heretic who had been burned at the stake at the instigation of the French King. Not exactly an underground thing. The de Molay theory is definitely a ROTFLMAO. Such a pilgrims badge would have been treason. There I’ve just wasted five minutes. Good work Colin.\n\n","date":"February 24, 2013 at 11:08 am","url":"https://shroudstory.com/2013/02/24/cluny-medal-versus-lirey-badge/","cat":"art","id":"comment-25505","author":"John Klotz","site":"shroudstory"},{"title":"Cluny Medal versus Lirey Badge","post":"And another thing. For Colin to insist on calling the Lirey badge underscores its connection to an active Church 40 years after de Molay was roasted. It under scores the point of its connection to the Church which had cooperated in King Phillip’s purge. So let’s, by all means call it the Lirey badge. From my prospective and German heritage, machts nichts.\n\n","date":"February 24, 2013 at 11:15 am","url":"https://shroudstory.com/2013/02/24/cluny-medal-versus-lirey-badge/","cat":"art","id":"comment-25506","author":"John Klotz","site":"shroudstory"},{"title":"Cluny Medal versus Lirey Badge","post":"I’ve got 4170 for “medallion of lirey”, i think we are mistaking a medallion for a badge.\n\n","date":"February 25, 2013 at 4:54 am","url":"https://shroudstory.com/2013/02/24/cluny-medal-versus-lirey-badge/","cat":"art","id":"comment-25593","author":"anoxie","site":"shroudstory"},{"title":"Cluny Medal versus Lirey Badge","post":"In French, we call it “un méreau/un mérel” that is a token used to show that a church official had attended a given ceremony. A pilgrim badge is the English phrase for “un insigne de pèlerinage”.\n\n","date":"February 25, 2013 at 9:31 am","url":"https://shroudstory.com/2013/02/24/cluny-medal-versus-lirey-badge/","cat":"art","id":"comment-25607","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Cluny Medal versus Lirey Badge","post":"Typo: pilgrimAGE badge\n\n","date":"February 25, 2013 at 12:16 pm","url":"https://shroudstory.com/2013/02/24/cluny-medal-versus-lirey-badge/","cat":"art","id":"comment-25642","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Cluny Medal versus Lirey Badge","post":"It was a joke but thank you for this precision, I didn’t know what a “méreau” was.\n\n","date":"February 26, 2013 at 4:29 am","url":"https://shroudstory.com/2013/02/24/cluny-medal-versus-lirey-badge/","cat":"art","id":"comment-25703","author":"anoxie","site":"shroudstory"},{"title":"Cluny Medal versus Lirey Badge","post":"I just read Colin’s first posting for day 7 shroudie alert. He seems to think we get upset with his theories and his skepticism. No we don’t. We get upset because we have learned that to disagree with him is to invite his wrath and insults. That is why so few make comments on his blog. That is why Thibault stopped commenting. Colin is his own worst enemy, not ours. And we are not his enemy except in his imagination. If he would just lighten up I think things would be much better all around.\n\n","date":"February 25, 2013 at 10:06 am","url":"https://shroudstory.com/2013/02/24/cluny-medal-versus-lirey-badge/","cat":"art","id":"comment-25617","author":"Paulette","site":"shroudstory"},{"title":"Cluny Medal versus Lirey Badge","post":"No Paulette, \nColin is right.\nHe discovered the truth: I must confess that I am a member of the TS Secret Confraternity.\nDan, you are a member of this confraternity and you should now acknowledge this fact.\nIt is true that in the past the members of our Confraternity did try to hide some facts and they burnt the TS in 1532. They obviously folded the TS as described in the Aldo Guerreschi-Michele Salcito paper. \nMore seriously, it is fascinating to observe CB’s evolution.\nHe has now a wonderful scenario for a movie.\nThibault.\n\n","date":"February 25, 2013 at 5:54 pm","url":"https://shroudstory.com/2013/02/24/cluny-medal-versus-lirey-badge/","cat":"art","id":"comment-25676","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Cluny Medal versus Lirey Badge","post":"Or perhaps he’s stopped commenting because there is nothing to comment any longer, whatever Colin’s behaviour.\n\n","date":"February 26, 2013 at 4:16 am","url":"https://shroudstory.com/2013/02/24/cluny-medal-versus-lirey-badge/","cat":"art","id":"comment-25701","author":"anoxie","site":"shroudstory"},{"title":"Cluny Medal versus Lirey Badge","post":"I wrote Colin Berry: “If you do love historical/legendary enigmas here is one for you: In old French “un grail” means “a  metallic square/diamond lattice”. Now just guess what is featured on the OBverse side of the Lirey Medaillon?\nCB, want to see for yourself the archaeo(crypto)perceptive image of the Blood Chalice of Christ? What can you “THINK YOU SEE” right in the Shroud face vertical axis once the image is shown upside down? \nREMINDER: the Shroud image does “behave” like an oversized Rorschach (this is an archaeoperceptive/optical fact).\nThe Shroud image is ALSO of the stuff that the medieval “grail” scenes are made of…\n\n","date":"February 25, 2013 at 11:37 am","url":"https://shroudstory.com/2013/02/24/cluny-medal-versus-lirey-badge/","cat":"art","id":"comment-25633","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Cluny Medal versus Lirey Badge","post":"I also wrote Colin Berry: “It was WELL BEFORE Jacques de Molay and Geoffrey de Charny met their fate on a small islet a little off the Paris Cardio…\nLe terme de graal est traduit en anglais par « grail » – le saint graal : the holy grail. Or graal se rapproche du terme de vieux français « grail » qui signifie gril et grille – car les deux mots ne sont différenciés qu’au XVIIème siècle – du latin cratis (grille, claie). Le verbe « griller » était orthographié « graailler », remarquez les deux « a ». On retrouve le gril dans un récit irlandais racontant l’évolution de Tuân mac Cairill réalisant l’Homme primordial en lui.\nIf you still don’t know the optical reason why YOU THINK YOU SEE “un homme grillé à petit feu” just pray Saint Lawrence for it…\nWhat is really your Knights Templar’s “SAIT VOIR ET SAIT OÏR”, “DOUBLE AND TRIPLE ENTENDRE AND SEE”? Zilch, nada, nothing, wallou.\n\n","date":"February 25, 2013 at 11:53 am","url":"https://shroudstory.com/2013/02/24/cluny-medal-versus-lirey-badge/","cat":"art","id":"comment-25638","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Cluny Medal versus Lirey Badge","post":"Typo: a little islet of the Paris Cardio\n\n","date":"February 25, 2013 at 11:58 am","url":"https://shroudstory.com/2013/02/24/cluny-medal-versus-lirey-badge/","cat":"art","id":"comment-25639","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Cluny Medal versus Lirey Badge","post":"I alos wrote CB: “Yeshua said: “Whoever is near me is near the fire” (Is it scorching hot enough, I mean Truth?)”\n\n","date":"February 25, 2013 at 12:12 pm","url":"https://shroudstory.com/2013/02/24/cluny-medal-versus-lirey-badge/","cat":"art","id":"comment-25640","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Cluny Medal versus Lirey Badge","post":"(Sorry I misposted the following comment and have to repost it here)\nNOTE: The trellis work on the Lirey Medaillion reverse side, together with the herring bone pattern on the obverse side do echo to the same combination carved in alabaster we can observe on the (4th?)-6th c. St Mark’s cathedra; trellis work in reference to the Holy Mandylion and herring bone to the Holy Shroud.\n\n","date":"February 25, 2013 at 4:00 pm","url":"https://shroudstory.com/2013/02/24/cluny-medal-versus-lirey-badge/","cat":"art","id":"comment-25663","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Cluny Medal versus Lirey Badge","post":"It does seem the two relics were either kept away together within the same table-reliquary or seperatetly within two reliquaries showing the same diamond lattice motif.\n\n","date":"February 25, 2013 at 4:06 pm","url":"https://shroudstory.com/2013/02/24/cluny-medal-versus-lirey-badge/","cat":"art","id":"comment-25664","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Cluny Medal versus Lirey Badge","post":"Typo: reliquary-table\n\n","date":"February 25, 2013 at 4:07 pm","url":"https://shroudstory.com/2013/02/24/cluny-medal-versus-lirey-badge/","cat":"art","id":"comment-25665","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Cluny Medal versus Lirey Badge","post":"To anoxie: \nAdditional comments: At the end of their pilgrimage (i.e. once returned home), pilgrims used to throw their pilgrimage badges into a well or a river (from a bridge) and make a wish. Most if not all towns and villages then had such time-honoured tradition spots.\nIn 95% cases, the best way to discriminate between medieval token/mark and pilgrimage badge is the presence or the absence of one or more holes to hang it.\n\n","date":"March 1, 2013 at 9:03 am","url":"https://shroudstory.com/2013/02/24/cluny-medal-versus-lirey-badge/","cat":"art","id":"comment-26018","author":"Max Patrick Hamon","site":"shroudstory"}]
