[{"title":"Comment Promoted:  The Stavronikita Epitaphios","post":"Good comment, but since the only image reference to this epitaphios comes from Dan’s 2011 posting, can he remember where he found it? Is it even from Stavronitika? Googling Stavronitika epitaphios brings up a different one altogether.\n\n","date":"June 28, 2014 at 9:27 am","url":"https://shroudstory.com/2014/06/28/comment-promoted-the-stavronikita-epitaphios/","cat":"art","id":"comment-133299","author":"Hugh Farey","site":"shroudstory"},{"title":"Comment Promoted:  The Stavronikita Epitaphios","post":"Daveb, you can will find an answer to your question here: http://www.elpenor.org/athos/en/e218ck20.asp\n“The work appears to belong to two different periods, with sections of an older epitaphios, apparently damaged or worn, having been patched on the red silk. Both the large ‘linen cloth’ impinging on the symbols of the Evangelists in the lower corners and disrupting the balance of the composition, and the second border, seem to indicate that the figure of Christ was not part of the initial design.\nThe iconographic theme is the symbolic representation of the sacrificial Lamb, surrounded by angelic hosts and the symbols of the Evangelists. The symmetrical composition, with the horizontal shroud (in some examples the sepulchre), the two angel-deacons with their liturgical fans venerating behind, the symbols of the Evangelists in the corners, and the ornamental motifs on the ground and the inner border recur in a series of fourteenth-century epitaphioi studied by Millet. A variation of the spiral motif decorating the arcs in the corners appears on the collar of a sakkos in the Vatican (14th c.) and on the epigonation of Metropolitan Anthimos in the Tismana Monastery (1370): these comparanda may indicate the approximate date of the earlier epitaphios. For the later work, comparisons may be made with the epitaphios of Metropolitan Makarios of Moldavia-Wallachia (1428) and those in the Meteora Monastery and in the Church of St Nicholas Radaut (today the Museum of Sucevita), although an even more recent ‘renovation’ based on older models cannot be excluded.”\n\n","date":"June 28, 2014 at 9:35 am","url":"https://shroudstory.com/2014/06/28/comment-promoted-the-stavronikita-epitaphios/","cat":"art","id":"comment-133302","author":"Tristan Casabianca","site":"shroudstory"},{"title":"Comment Promoted:  The Stavronikita Epitaphios","post":"That was quick! Thanks, Tristan.\nI’m confused though. If the ‘linen coth’, the ‘second border’ and the ‘figure of Christ’ were not part of the original design – then what was in their place when it was first made? Slightly odd.\n\n","date":"June 28, 2014 at 10:02 am","url":"https://shroudstory.com/2014/06/28/comment-promoted-the-stavronikita-epitaphios/","cat":"art","id":"comment-133308","author":"Hugh Farey","site":"shroudstory"},{"title":"Comment Promoted:  The Stavronikita Epitaphios","post":"Dan’s first posting on the Stavronikita was in March 2011, see:\nhttps://shroudstory.com/2011/03/28/herringbone-weave-within-stavronikita-epitaphios/  \nDiscussion there was fairly brief;  At the time Max PH had said  that it was only mid-6th century, but from Tristan’s ref, it would seem to be at least as early as 1370, possibly earlier.  Max had also referred to another, MPH: “The Monastery of Stavronikita epithaphios is only mid-16th c. CE. See also the 1300 CE ca zigzag/herringbone patterned epitaphios from the Byzantine Museum in Thessaloniki.”  The Thessalonika example appears to be quite different.  He then commented on the St Mark’s cathedra of 7th century, which did appear to have signs of a herring bone weave. \nThere was more extensive discussion some 15 months later when the stavronikita topic was revisited: https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/  \nReferences there were also made to earlier examples, 1300 and 1200, claiming to have the herring-bone weave.  Again discussion diverted to the 700 AD St Mark’s cathedra.  There was some dispute between Max & Yannick C re the dating of various epitaphioi, Yannick apparently wanting to demonstrate that the Mandylion was still in Edessa at the time of these epitaphioi, and hence Mandylion had to be a different object from the Shroud, but I think that ended up as shown to be a false argument.  \nDaniel Scavone had written an informative paper on epitaphioi, (the PDF is dated January 2000);  “GREEK EPITAPHIOI AND OTHER EVIDENCE FOR THE SHROUD IN\nCONSTANTINOPLE UP TO 1204” and can be found at:\nhttp://www.shroud.com/pdfs/scavone.pdf\nScavone makes the point that although Western crusaders had visited Constantinople in 1204, the Byzantines did not reciprocate, and the Lirey Shroud would have been unknown to them.  Nevertheless, several epitaphioi did show Shroud-like features, even centuries after 1204 when the burial cloths were taken, so that these features seemed so well-established in the Byzantine memory, that they persisted in the design of the various epitaphioi.  \nMy interest in the epitaphioi stems from the extremely long and somewhat frustrating debate concerning the Hungarian Pray manuscript of 1192-95, with well over 250 contributed comments, with contenders scarcely moving away from their initial viewpoints as to whether or not the Shroud had influenced its composition.  Hugh Farey had commented that what was needed to establish a connection was the discovery of some kind of “smoking-gun” clue.  I suggest that the “smoking-gun” might be found in a close study of the epitaphioi.  Scavone’s  paper is informative in this regard.  However the dating of several of the examples seem ambiguous, with many different opinions about the same object. \nThe epitaphioi often show features which could only have come from the Turin Shroud, but even though many of the examples post-date 1204, and often enough even 1355, it seems unlikely that knowledge of details from the cloth’s presence in Lirey was a factor in their design.  It seems to stem from a Byzantine tradition and the memory of when it was in Constantinople. \nI conclude that the epitaphioi provide strong evidence that the Shroud was in Contantinople prior to 1204, and that many details of its features were well enough known to have persisted in the Byzantine memory well after that time.\n\n","date":"June 28, 2014 at 6:35 pm","url":"https://shroudstory.com/2014/06/28/comment-promoted-the-stavronikita-epitaphios/","cat":"art","id":"comment-133814","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Comment Promoted:  The Stavronikita Epitaphios","post":"Daveb great posting.\nI agree it seems unlikely that a shroud in Lirey could have influenced the early epitaphios.\nRegarding the HPM wouldn’t it be nice knowing something about the text? It might illuminate some of the images\n\n","date":"June 29, 2014 at 1:16 am","url":"https://shroudstory.com/2014/06/28/comment-promoted-the-stavronikita-epitaphios/","cat":"art","id":"comment-134253","author":"Thomas","site":"shroudstory"},{"title":"Comment Promoted:  The Stavronikita Epitaphios","post":"Is that a blood belt I spy with my little eye just to the right of Christ’s hip?\nIs that a Shroud- like blood stain I spy above the right eye?\nOr merely more coincidence?\n\n","date":"June 29, 2014 at 1:25 am","url":"https://shroudstory.com/2014/06/28/comment-promoted-the-stavronikita-epitaphios/","cat":"art","id":"comment-134254","author":"Thomas","site":"shroudstory"},{"title":"Comment Promoted:  The Stavronikita Epitaphios","post":"There are occasional references to an epitaphios in Venice dating around 1200. But there seems little info out there on this. Just wonder if this might have been an epitaphios or even possibly the shroud taken from Constantinople to Venice.\n\n","date":"June 29, 2014 at 4:13 am","url":"https://shroudstory.com/2014/06/28/comment-promoted-the-stavronikita-epitaphios/","cat":"art","id":"comment-134268","author":"Thomas","site":"shroudstory"},{"title":"Comment Promoted:  The Stavronikita Epitaphios","post":"Good posting, Dave.\n Hugh Farey had commented that what was needed to establish a connection was the discovery of some kind of “smoking-gun” clue. I suggest that the “smoking-gun” might be found in a close study of the epitaphioi. \nTruly, I don’t think so. Based on the experience of the HPM debate, even the most evident example will not be the “smoking-gun” for any of the sceptics -rejecting a priori any existence of the Shroud before 14th century. No “smoking-gun” makes any impression on them.\n\n","date":"June 29, 2014 at 6:39 am","url":"https://shroudstory.com/2014/06/28/comment-promoted-the-stavronikita-epitaphios/","cat":"art","id":"comment-134283","author":"O.K.","site":"shroudstory"},{"title":"Comment Promoted:  The Stavronikita Epitaphios","post":"From Hugh’s almost predictable comment below 6:54am , I fear you might well be correct.  And I was only trying to help!\n\n","date":"June 29, 2014 at 7:01 am","url":"https://shroudstory.com/2014/06/28/comment-promoted-the-stavronikita-epitaphios/","cat":"art","id":"comment-134286","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Comment Promoted:  The Stavronikita Epitaphios","post":"You did help. The Byzantine herringbone pattern is another chip on the pile on the authentic side of the balance. It’s still not enough for me, as you predicted, but it’s more evidence. I like evidence!\n\n","date":"June 29, 2014 at 4:30 pm","url":"https://shroudstory.com/2014/06/28/comment-promoted-the-stavronikita-epitaphios/","cat":"art","id":"comment-134352","author":"Hugh Farey","site":"shroudstory"},{"title":"Comment Promoted:  The Stavronikita Epitaphios","post":"Zigzagging embroidery seems quite a common way of filling space in these silk and gold epitaphioi. Shrouds – which may be indicative – dresses, halos, even just background are often filled with it. There is even one epitaphios in which the shroud is almost the only thing not zigzagged.\n\n","date":"June 29, 2014 at 6:54 am","url":"https://shroudstory.com/2014/06/28/comment-promoted-the-stavronikita-epitaphios/","cat":"art","id":"comment-134284","author":"Hugh Farey","site":"shroudstory"},{"title":"Comment Promoted:  The Stavronikita Epitaphios","post":"My dear father, long since departed, grew up during the Great Depression of the 1930s, and for many years of his life worked as a butcher in a meat factory.  NZ Lamb is the best and continues to command excellent prices for its producers on global markets throughout the world.  The animals to be killed, being sheep, will follow any that chooses to lead them.  The slaughtermen know this and train a Judas sheep to follow the well-trodden path up to the killing chain, and allow the first few sheep to pass through the gate and back to the factory grazing ground to lead yet others in their turn.  The Judas sheep, also being sheep, do not really understand the nature or rules of the game, like one or two correspondents on a certain web-site, who do not fully understand what is at stake.  \nFor eventually the Judas sheep outlives its usefulness, and it becomes the turn of the Judas sheep who discovers that the gate is no longer open for it, and another has taken its place.  \nOr to draw on another analogy, it is a dangerous matter to run with the hares and hunt with the hounds.  It only confuses the horsemen, who can easily mistake their target.  \nAnother also once spoke in parables!\n\n","date":"June 29, 2014 at 7:41 am","url":"https://shroudstory.com/2014/06/28/comment-promoted-the-stavronikita-epitaphios/","cat":"art","id":"comment-134291","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Comment Promoted:  The Stavronikita Epitaphios","post":"The red silk liturgical cloth called “Epithaphios” is actually an old story in the realm of Shroud studies and has always been mentioned by Ian Wilson.\nIn his last Shroud book(2010) he mentions it again and there is a colour illustration (plate 27a). He found it similar to what he calls  an “arguably Shroud-inspired” Lamentation or Threnos scenes in 12th-century Byzantine art, pointing out that the embroiderers intriguingly incorporated a Shroud-like herringbone pattern, illustrated in Plate 27c.\nIW also mentions other cloths saying that it is very hard to understand how they could have been created “without some knowledge, however indirect, of the image on the cloth that we now know as the Turin Shroud.”\n\n","date":"June 29, 2014 at 9:22 am","url":"https://shroudstory.com/2014/06/28/comment-promoted-the-stavronikita-epitaphios/","cat":"art","id":"comment-134305","author":"Louis","site":"shroudstory"}]
