[{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Historians knows full well that it wasn’t a trend to show Christ dead before the beginning of the 13th century, first in Europe and then in the Byzantine world.  And how about a hasard… The beginning of the 13th century is precisely when the Latin crusaders camped in front of Constantinople for many months and during that time, Robert de Clari was able to see the public showing of the Shroud of Christ showing his full-size body.\nIf this Shroud was really the Shroud of Turin (as I think it was), then the drastic change of trend in Christian art at the beginning of the 13th century (first in Europe) have some good chances to be due to this probable first public showing of the body image and bloodstains that are present in the inside part of the Shroud.  If this was the very first time the Church of Constantinople agreed to make such an exhibition of such a gruesome and crude relic of a dead and suffering Christ (it’s truly possible that it was the case), then we can think that the Latin crusaders who saw this brought back in Europe this idea of a dead and suffering image of Christ (along with probably also the Shroud itself) and their testimonies could well have influenced the Christian art of that century, allowing the apparition of the first artistic trend that showed a dead and bloody Christ.\nBecause prior to the testimony of Robert de Clari in 1204 we have absolutely no other written mention of another public showing of a Shroud of Christ that bears a full-size body image on it and because this is precisely at that same era that art historians have noted an important change in the artistic trend regarding the depictions related to the Passion of the Christ, it is fair to assume that this public showing (every Friday in 1203 and 1204) of the Shroud in Constantinople (maybe the first ever official showing were people could see the inner part of the cloth with the body image and bloodstains) could well have been the starting point of this drastic change that took the main trend of the time (especially in Orient) which was called “the resigned Christ” (not a dead Christ but a sad one) to the next level that have been called “the suffering Christ” (showing a dead Christ with blood flowing from every stigmata).\nPersonally, I really think there is a truly possible link (probably direct) between these 2 events…  That would give a possible answer for the dead silence of ancient sources versus a Shroud of Christ that bears a body image on it: this image would have been conserved hidden from the eyes of the public for a long, long time by the Church of Constantinople (and probably also by the Church of Jerusalem at an earlier time).\nFrom all the historical data we know (we could also say: the lack of historical reference to a Shroud of Christ with an image), this hypothesis is certainly possible and the hdding would have been caused by the social, religious, theological and artistic context that was present in the Byzantine world up until ca. 1200.\nI have already said all this before but I think some people could learn one or two things by reading this and/or could start a reflection about the obscure years of the Shroud.\nLittle note to finish :  During the 5th and 6th centuries, which is the most probable era that saw the appearance of the Image of Edessa (and other supposedly miraculous image of the face of Christ), the main artistic trend of showing Christ during his Passion was called “the triumphant Christ” and some of the main characteristics associated with that trend (i.e. the head of Christ rised up, the eyes open and looking at us, the chest haughty, the face impassive, etc.) fits perfectly well with the known aspect of the Image of Edessa that we can see in every artistic copy that are still preserved today.  In other words, the idea that the Image of Edessa was nothing more than a painting of the face of the living Christ on a small linen cloth is backed-up by the social, religious, theological and above all, by the artistic context of the time where we saw, historically, the first public apparition of this relic of the living Christ (5th or 6th century).\nTo be a good historian, I think the first quality someone MUST have is an ability to replace things in the RIGHT HISTORICAL CONTEXT !!!  This include sometime to replace thing in the right theological context and/or in the right religious context and/or in the right social context and/or in the right artistic context.  If someone pretending doing history don’t do this properly, how can he come up with a hypothesis that have some chance to be good ???\nMeditate on that for a while…\n\n","date":"September 5, 2012 at 10:17 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-15912","author":"Yannick Clément","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"YC, \nOnce again, I cannot help thinking you’d better stick to Geography! \nThrough rehashing “the same half truth”, you most certainly will end up by convincing yourself this is “an absolute truth”. What do you make of Yeshua’s facial imprint left on a HIMATION (a CLOTH/SINDON about 4-5m long and 1.20m wide)? What do you make of the designation RAKOS TETRADIPLON (Rakos = Greek etymology for ‘rag’ in English) “old wiping rag folded in four” to describe a most precious religious painting as you want us to believe? Nothing, since the TWO designations do not fit in with your SELFSERVING pseudo-analysis. How can you convince yourself the Greek words ‘himation’, ‘rakos tetradiplon’ and ‘tetradiplon’ can ONLY refer to a “small face cloth”? This is beyond comprehension? Is this the way you apply “your” Ockham razor principle?\n\n","date":"September 6, 2012 at 6:11 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-15923","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Correction: a HIMATION (a CLOTH/SINDON about 4-5m long and 1.20-1.40m wide)\n\n","date":"September 6, 2012 at 6:34 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-15926","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"How can you be so sure the Edessa mage is “a small LINEN cloth”?\n\n","date":"September 6, 2012 at 6:17 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-15924","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Correction: How can you be so sure the Edessa Image CAN ONLY BE  “a small LINEN cloth”?\n\n","date":"September 6, 2012 at 6:30 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-15925","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"\nYannick Clément :\nIf this Shroud was really the Shroud of Turin (as I think it was)…\n\nWhy? \nWe only know a confuse testimony (de Clari) about a Shroud in Constantinople at the beginning of the 13th century. Not even a description. Only a vague reference about an object that appears and disappears suddenly. No more references. How this vaporous Shroud can influence all the cultural world of the 13th and before? Books of Hours and manuscript lamentations also?  How can you distinguish if the Shroud de Clari said he had seen is the cause or the effect of cultural attraction about the Christ’s death?\n\n","date":"September 7, 2012 at 2:03 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-15968","author":"David Mo","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"If the Shroud of de Clari was the same as the Shroud of Turin, I think it’s truly probable that this public showing of this Shroud (maybe the first ever) was one of the cause of this important artistic change concerning the depictions of Jesus related to his Passion, death and burial.  Don’t you think it would be logical?  Of course, all this depend of whether or not the Shroud of Constantinople was the same as the one kept in Turin today.  But when we consider also the testimony of Nicolas Mesarites written 3 or 4 years earlier (another eyewitness testimony) while he talked strangely about the nudity of Christ (which can be considered as a possible indirect reference to the nudity of the man of the Shroud) and also the piece of evidence we found in the Pray codex that the Shroud of Turin was most probably already present during the 12th century and it is probable that it was kept in Constantinople, I think all this build a pretty good case in favor of the hypothesis that the Shroud of Constantinople was effectively the one kept in Turin today.  And if it was so and if the public showing of 1203 and 1204 was the very first time the inner part of the Shroud (with all the injuries, bloodstains and body image we can see) was publicly showed to the faithful, I don’t have any doubt at all about the fact that it probably had a huge influence on Christian art, even if other things could also have contributed for this change (like the epidemies that were going on in Europe during that era, the spirituality linked with the stigmata of St Francis of Assisi, etc.).\n\n","date":"September 9, 2012 at 6:43 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16070","author":"Yannick Clément","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"1. Mesarites speaks directly about an image of Christ when he is speaking on Mandylion. He says nothing about an image on the sudarium. He says only the sudarium wrapped the Christ’s body and he was naked. This is a frequent idea and icon at this time, i.e. the shroud wrapping naked Christ. There is no reason to suppose he had seen something paint in the sudarium, but he only repeated this ordinary idea. Scavone fantasizes when he matches two sentences: Jesus rises from the tomb in the Resurrection morning (Mesarites) and the cloth is raised (de Clari). They are obviously different subjects: Christ and the cloth.   \n2. Codex Pray is not a proof of the existence of the Turin shroud. I argued about two or three months ago. (https://shroudstory.com/2012/05/27/jones-on-the-hungarian-pray-manuscript-codex-as-discussed-in-wikipedia/ June 2, 2012, 3:45 and after). We can repeat the debate if you wish. Summary: to match two different icons you must find any feature clearly common and specific to both. There is not this common feature in Codex Pray and Turin shroud. Only a confuse one (“poker holes”) and several not specific others. And there are substantial differences between Pray and Shroud.  \n3. You wrote: \n“If the Shroud of de Clari was the same as the Shroud of Turin, I think it’s truly probable that this public showing of this Shroud (maybe the first ever) was one of the cause of this important artistic change concerning the depictions of Jesus related to his Passion, death and burial. Don’t you think it would be logical?”\nI think this argument is not logic at all. \n3.1. The “artistic change concerning depictions of Jesus” doesn’t need a supposed identity de Clari/Shroud of Turin. It was prefigured and followed by other paintings and writings (legends, prayers, etc.) well known. You make a superfluous hypothesis. \n3.2. The FACT is they are unknown artifacts in the cultural world at the time. It is incompatible with the impact you suppose. We have abundant testimonies about Christ Chalkites, Camouliana, Mandylion, Veronica’s Veil… We have abundant testimonies about Vera Crux, Thorn Crown, Holy Spear, etc. All these were well known and impacting artifacts. But you hypothesize about a practically unknown object with great cultural impact. This is an oxymoron. \n3.3. I can establish a causal relation between two events or objects if, and only if, I can establish factual relations between them. This is not the case with de Clari and Shroud. Only imaginary relations can be established. Imaginary relations aren’t proof of anything.  \nYou haven’t answered my questions: \n“How this vaporous Shroud can influence all the cultural world of the 13th and before? How can you distinguish if the Shroud de Clari said he had seen is the cause or the effect of cultural attraction about the Christ’s death?”\n\n","date":"September 10, 2012 at 3:37 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16114","author":"David Mo","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"I have 4 thing to say to David Mo :\n1- It’s a big mistake to separate things like you do when it comes to do a good historical analysis about one particular period.  You got to ANALYZE THE WHOLE PICTURE that can be built from all these historical data.  And when you consider the testimony of de Clari, the testimony of Mesarites and the drawings found in the Pray codex, you must acknowledge with me that these data CAN be linked with the Shroud of Turin.  I say CAN and not MUST BE.  In the present state of our historical knowledge, there’s a very interesting possibility there that should be left open…  One thing’s for sure : these 3 documents cannot be used by anyone to completely discard the possibility that the Shroud of Turin could have been in Constantinople between at least the middle of the 12th century and the sack of the city in 1204.\n2- Mesarites talking about the nudity of Christ in relation with his Shroud his pretty strange because as I know, at the time Mesarites wrote his manuscript, the only depiction of Christ burial showing him naked could be found in the Pray codex !!!  Don’t come saying it was something natural to associated the nudity of Christ and his burial Shroud !!!  If I’m right, in normal Jewish or Christian burials from that era, it would have been completely odd to leave the dead naked…\n3- Concerning the probable relation between the Pray codex and the Shroud, if the monk who did the artworks in the Pray codex never saw the Shroud but just incorporated one very particular and noticeable detail from the Shroud that he heard from another person (who was an eyewitness) into a more standard artwork that fit in the category of the Epithaphios, I don’t think it would be strange to see a result like we see in the Pray codex.  Why necessarily thinking that the monk who did the artwork saw the Shroud with his own eyes ?  Can’t that monk heard (or read) some partial information about the Shroud coming from another person ?  I think it’s truly possible, especially when you consider the fact that this Pray codex has been manufactured far away from Constantinople…\n4- The artistic change that occurred at the beginning of the 13th century maybe doesn’t need the Shroud of Turin (I say maybe because I’m not so sure about that), but IF the Shroud that the crusaders saw with their own eyes was the Shroud of Turin, I think it’s fair to assume that this vision had some influences on later depictions of Christ related to his Passion, death and burial.\nOne thing’s for sure : an important change like that in religious art don’t come from nowhere. It must come from one or many things that have a profound effect on theology and art.  It can be something else than the Shroud and his image of course, but I think it’s fair to consider the possible influence of the Shroud on this kind of change.  Denying it would prove to be unfair and dishonest.\n\n","date":"September 10, 2012 at 4:55 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16117","author":"Yannick Clément","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"I am sure that all this has been said before. Robert de Clari was from Picardy , a ‘poor knight’ as he describes himself, and he brought back relics he had taken from the Palace at Constantinople which he gave to the monastery at Corbie in his native Picardy in two batches , 1206 and 1213. Michael Angold in his The Fourth Crusade ( p 13) suggests that de Clari’s account was written to justify his taking of the relics he gave to the monastery and that the account was lodged there. There is only one manuscript version of it that dates from a hundred years later, c, 1300. As Angold suggests there is no evidence that it was ever circulated very widely as it was never written for a wider audience. As has been widely suggested, the reference to the burial shroud in the Blachernae Chapel was only a marginal comment. We have absolutely no other mention of this relic and this suggests that it did not have a big following. It could not be the Mandylion or the OTHER set of burial cloths mentioned in the Pharos Chapel as these would not have been moved to an alternative shrine without a great deal of publicity ( These moves simply did not happen unless the relic was looted as did happen in some cases, e.g. the bones of St. Benedict from Monte Cassino -if you had a relic you hung on to it!)\n de Clari would presumably have known that at this date the burial shroud on show at Cadouin was the one which was packing in the pilgrims and making the abbey there very wealthy. We now know that it is a fake, made in one of the caliph’s workshops, but it was brought back after the First Crusade directly from Jerusalem and  obviously relics of the Passion that it was claimed were found in Jerusalem had a special cachet, as they had done ever since Helena had found ‘the True Cross’ there in the 320s and Arculf had seen both the burial shroud and the sudarium still there in the late seventh century.\n Wilson is clearly embarrassed by Arculf’s account but he repeats it omitting the reference to the shroud that Arculf saw in the tomb and arguing that the separate  sudarium was actually the  Turin Shroud that had been temporarily removed to Jerusalem because of an earthquake in Edessa. The fact that the Jerusalem sudarium was described as only eight feet long  and that it floated above a fire that was set alight to see if it was authentic ( it was!) is explained by Wilson as that it was the Turin Shroud but this time folded into two. Well, you have to give him full marks for imagination. In his determination to show that this sudarium was the Turin Shroud Wilson also omits the part of the account which says that it had been in Jerusalem all along but hidden by a Jew after it had been stolen from the tomb.\n\n","date":"September 10, 2012 at 4:05 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16082","author":"Charles Freeman","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Correction: although it is not entirely clear, Arculf may not have been referring directly to a shroud in the tomb – the points about the sudarium having been in Jerusalem all along still stands.\n\n","date":"September 10, 2012 at 4:26 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16084","author":"Charles Freeman","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"“We have absolutely no other mention of this relic and this suggests that it did not have a big following”. Charles Freeman.\n1.- “”We have absolutely no other mention of this relic ”\nEl núcleo del debate consiste en si esta reliquia ( this relic) era conocida bajo OTRO NOMBRE.\n2.-“and this suggests that it did not have a big following”\nNo es coherente con el testimonio de Robert de Clari “…and no one either Greek or French, ever knew what became of this shroud (syndoines) when the city was taken”.Dembowski.\nEl comentario de Robert de Clari SUGIERE que se trataba de una reliquia MUY CONOCIDA.\nCarlos Otal\n\n","date":"September 10, 2012 at 7:58 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16123","author":"Carlos Otal","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Carlos.\nWe do not have any other mention of the  shroud in the Blachernae chapel and de Clari, the knight from Picardy did not happen to know what happened to it. He does have a separate reference to the Mandylion in his description of the Pharos Chapel, in his History,  Chapter lxxxiii\nSo we have to look at the other evidence for what happened to the Blachernae Chapel during the sack. The main link is with St. Mark’s in Venice. The Venetians looted a number of icons from the Blachernae Chapel and took them to St. Mark’s. The details are to be found in Hans Belting, op.cit, p.195 ff ,’San Marco in Venice and its Icons ‘ and more recently in Paul Stephenson, The Byzantine World  (2010) Chapter 29, ‘Sacred Space between Constantinople and Venice’, esp. p. 419. Both show the link between icons in St. Mark’s and those in the Blachernae Chapel.\nSo the first place to look for the possible transfer of the Shroud from the Blachernae Chapel would be Venice as we know the Venetians looted from the Chapel. Unfortunately, we do not seem to have a list of what they took and the connection is only known through a study of the icons themselves in Venice.  Even more unfortunately a fire of 1231  in Venice destroyed much of what had been brought from Constantinople so the shroud may well have perished then if they had taken it.\nOne must also remember the immense destruction and chaos in Constantinople in 1204. Try reading the (Byzantine) account of Niketas Choniates if you haven’t already. He shows that there was unrestrained looting by the crusaders and many relics must simply have perished in the flames, especially if they were made of  cloth. Only those in the imperial palace were safe. One can hardly be surprised that many objects known to have been in Constantinople before 1204 are not recorded afterwards.\nMichael Angold’s The Fourth Crusade has an excellent chapter on what relics were known to have been taken from where and the hierarchy , starting with the cross, then phials of Christ’s blood,etc etc. No mention of a shroud among them (except in the Pharos Chapel in the palace where burial cloths of Christ are said to be of cheap cloth and to have smelt of myrrh). Either the Blachernae Shroud was not considered important enough to list or or  it simply disappeared in the destruction. We cannot know  and to assume that it was the Turin Shroud goes so far beyond any evidence that survives.\n\n","date":"September 11, 2012 at 6:38 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16133","author":"Charles Freeman","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"David Mo wrote: \n“We can repeat the debate if you wish. Summary: to match two different icons you must find any feature clearly common and specific to both. There is not this common feature in Codex Pray and Turin shroud.” \nTotally desinformative (I gave at least one crucial reference to the contrary – the pyramid-step pattern common to BOTH the Pray-codex  tomb-lid/burial cloth miniature and aTurin Sindon twill weave macrography – but most obviously Mr; David Mo hasnt’ even taken the trouble to check the piece of evidence that doesn’t fit with his most a-prioristic view, “intellectual dishonesty OBLIGE”.\n\n","date":"September 10, 2012 at 5:21 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16118","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Mistyping: step-pyramid pattern\n\n","date":"September 11, 2012 at 4:57 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16131","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Mr; David Mo’s refutation is first and foremost based  on “I think I thinks” not on any true material facts.\n\n","date":"September 10, 2012 at 5:26 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16119","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Yannick, you wrote: \n“Denying it would prove to be unfair and dishonest.”\nI don’t know if you are “unfair and dishonest”. I know your arguments (some) are wrong and illogical. (Give arguments, no disqualifications, please. Ce n’est pas très élégant comme argument, mon vieux). \nExample 1: I have supplied medieval examples of a naked Christ in the entombment. You are wrong at this point. I have supplied medieval examples of a naked Christ under the Shroud. You are wrong at this point. \nExample 2: People buried their dead dressed in the Middle Ages, but painted the Christ naked under the shroud. Shroud of Turin, also. Don’t confuse conventional sacred iconography with reality. You are wrong and illogical doing so. \nYes, you can consider a lot of things “possible”. But there are degrees of possibility. See point 3.2. in my last comment, for example. Your supposition is very unlikely. Ergo, illogical. \nYou haven’t any reason to match the three representations of Christ: Clari, Pray, Turin. I have done the analysis of Pray-Turin point by point and conclude with the image as a whole. (We don’t know nothing about the de Clari picture -was Christ naked?, for example). There is not another way to do it. You can’t explain anything without analyzing his parts first. The composition-resolution method, you know. \nPlease, say one feature, only one, that matches de Clari shroud with the Turin shroud (nudity, blood, hands position…). If there is no one, how can you make a comparison?\n\n","date":"September 11, 2012 at 6:56 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16135","author":"David Mo","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"David, just to clarify…unlikely doesnt imply illogical. For someone who uses it a lot to imply a faulty argument, its only fair that you use your words correctly. Thanks\n\n","date":"September 11, 2012 at 8:47 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16143","author":"ArtScience","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Thank you for your little English lesson, ArtScience. My terrible English needs it. But I think if someone is confusing degrees of possibility his fault is logical. In the sense we can speak about “logic of scientific investigation” or “logic of grammar”. It is not an empiric fault, but a logical one.\n\n","date":"September 11, 2012 at 10:06 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16145","author":"David Mo","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"No problem, David. I just thought I better make sure you knew that incorrect use of words can lead to difficulty understanding. I take it that you meant to say its improbable rather than illogical.\nThe reason I bring it up is in regard to above you mention above your point 3.2. I think it concerns whether a barely described artifact can have a big cultural effect. Many years ago, I got  interested in the effect of optical instruments on the history of art (see Hockney-Falco thesis). There seems to be a number of art historians (including Martin Kemp), who think it likely that artists such as Carravaggio, Holbein and others used mirrors, lens etc to project an image onto a surface for easy rendition of features, and this radically changed the history of art. However there is precious little documentary evidence of this. And you are talking about a number of centuries.  David Hockney describes it as “Secret Knowledge”, a secret passed on from studio to studio. And even in the cases where this knowledge isnt known, the new style of painting still becomes pervasive (see the followers of Carravaggio who tried to emulate the style without knowing the secret). So I think Yannick idea that a small showing of a naked Christ on a shroud could have a large ripple effect and without its cause been widely known, is entirely possible as an explanation of how come naked Christs come into vogue. Thats why I’d be a bit careful about disparaging unlikely ideas….change often only happens when something extraordinary comes along. I’m not saying this in necessarily the case, but art shifts often come from exposure to something different (eg primitive cubism from Picasso’s exposure to African sculpture in the Louvre).\nBTW I tried out some of the optical techniques myself and people were amazed at my much improved artistic skills, until I told them how I’d done it! Artists generally guard their secrets more wisely!!\n\n","date":"September 12, 2012 at 3:04 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16200","author":"ArtScience","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Can you please show me an example of a naked christ in his burial shroud that date BEFORE 1204 ?  There’s just the Pray codex to my knowledge…. Mon vieux !  ;-)\nAnd the mention about the nudity of Christ in a list of relics from Constantinople is completely unique to Mesarites who was probably one of the few who had the chance to see the Shroud out of his reliquary.  So, in this context of a list of relics that include the Shroud of Christ, this very particular mention is not banal as you seem to think.  It’s a clue and not a undeniable fact of course, but it cannot be thrown to the garbage.\n\n","date":"September 11, 2012 at 10:54 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16146","author":"Yannick Clément","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Before 1204? Why? De Clari speaks about a naked Christ? \nI can show you examples of Christ naked under the shroud, of course. What for? Will it be enough to convince you that the naked Christ idea was common at the time? Or will you start with new conditions?\n\n","date":"September 12, 2012 at 2:28 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16160","author":"David Mo","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"David Mo:\n“I can show you examples of Christ naked under the shroud, of course. What for? Will it be enough to convince you that the naked Christ idea was common at the time?”\n¿Común en aquel tiempo?.\nUsted, David, NO HA PODIDO MOSTRAR ninguna imagen de Cristo desnudo sobre la Sábana en todo el siglo XII, con la excepción del Códex Pray.\nCarlos Otal\n\n","date":"September 12, 2012 at 7:53 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16174","author":"Carlos Otal","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"David, I agree entirely with Carlos about the fact that before the sack of Constantinople (and the possible first ever exhibition of the inner part of the Shroud of Turin), with the exception for the drawing of the Pray codex, no naked Christ can be found in an artwork that is related to his burial and/or his shroud. That speak very loud to me because that show how odd the image on the Shroud is for the era that goes before the sack of Constantinople and even long after that. Jacques Bara in France did a cool research and never found a naked Christ in a depiction related to his Passion, death or burial before the 15th century in Toscani !!!  So, even after the Shroud of Turin was put in public display in France, artists were not willing to depict Christ naked in scenes related to his Passion and death !\nJust a simple example to show that it is true :  Look at all the Byzantine epithaphios you want and you’ll never see a naked Christ except in the particular drawing that we found in the Pray codex !  Elsewhere, Christ is always depicted with a modesty cloth or something like that…  That’s a very good clue to say that the artist who did the drawing in the Pray codex knew about the Shroud (even if it’s truly possible that he never saw it personally but just get second hand info).  Meditate about that my friend !\n\n","date":"September 12, 2012 at 3:53 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16201","author":"Yannick Clément","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Dave, \nWithout getting into all the particulars of my reconstruction of the TSM’s burial, here are a few main points:\nIt needed a minimum of 4-5 buriers.\nFirst the deceased eyes were closed or covered.\nSolely the long inner burial sindon (Heb. sovev) was moistened with alkaline waters.\nThen it was tautly wrapped lengthwise around the stiff rigid body while the legs and torso were tightly wrapped up widthwise with two long linen strips and/or a shawl (Heb. thalith) and the head tightly wrapped up (on top of the sovev) with a veil and a skullcap to both honour the deceased and counteract the head rigor mortis and keep the mouth shut (three wooden pieces were used to make a “small jaw box ” in conjunction with the two burial head dresses) \nDuring the image formation process, the sovev didn’t quite return to its natural size and shape as it got sort of taut again lengthwise through shrinking.\nThe uneven recording of the two arms imprint on the inner side of the burial cloth is due to the fact the deceased’s arms had been forced in rigor mortis from adduction to abduction thus creating sort of a counter-pressure to wrapping-up pressure. This resulted in a specific image distortion not to be extended to the whole body imprint.\nThe ritual fumigation allowed the latent body imprint to be revealed on the long inner ancient burial cloth.\n\n","date":"September 11, 2012 at 7:25 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16136","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Mistyping: the deceased’s eyes\n\n","date":"September 11, 2012 at 7:25 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16137","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"+ mistyping: The ritual fumigation allowed the latent body imprint to be revealed ONTO the long inner ancient burial cloth.\n\n","date":"September 11, 2012 at 7:27 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16138","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Addition: The chapter in Paul Stephenson’s book is by Thomas Dale. ‘Thomas E. A. Dale is a professor of Art History at the University of Wisconsin, Madison, where his research interests include Early Christian, Medieval and Byzantine art; Romanesque art (particularly representations of the body); San Marco in Venice; the cult of the saints; and cultural appropriation.’  What more could you ask in the way of expertise on the subjects we are discussing?\n\n","date":"September 11, 2012 at 8:22 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16142","author":"Charles Freeman","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"I will leave it up to the experts to follow up the reference  in Jaroslav Folda’s Crusader Art (2008), p. 72 that when Bishop Conrad of Halberstadt  returned to Halberstadt from the Fourth Crusade and the Holy Land in 1205 he had with him, ‘pieces of the Holy Shroud and sudarium’ (alongside many other relics of the Passion). The original source Folda gives  is the Gesta Episcoporum Halberstadensum.\nProfessor  Folda goes on to say that he is not sure whether  Conrad got his ‘Shroud and sudarium’ from the Holy Land or Constantinople as we simply have the list of what he came back with. Michael Angold repeats the story ( The Fourth Crusade, p.232) but wonders whether the Conrad was just given ‘tokens’ of these and his other more prestigious relics  by the emperor Baldwin from the collection in the Pharos Chapel as Conrad’s list is very similar to the list of relics we know to have been in the chapel but which were still there in 1205.\nObviously it would be interesting to find out whether there was any veneration of a Shroud, and the other relics*, from either Constantinople or the Holy Land in Halberstadt after 1205.\n* It is important to remember ‘the other relics ‘as in the case of the Sudarium of Oviedo which was discovered alongside a mass of other relics purporting to come from the Passion and Crucifixion but conveniently forgotten in the rush to find the Shroud and only the Shroud. If the Oviedo sudarium is believed to be genuine then why not the piece of the Cross and the blood of Christ that was found in the same chest?\n\n","date":"September 11, 2012 at 12:44 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16150","author":"Charles Freeman","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"And once one gets searching, there are other  references to Byzantine shrouds or sudaria. They are always listed as ancillary to the fragments of the Cross (the most popular gift by a Byzantine emperor to other rulers as it was considered the most prestigious of all relics) . Here is another account with translation.  The point I want to make is that Wilson’s account has blinded Shroud researchers to the many other references to burial shrouds of Christ. This is another example of  a/shroud controlled by the emperor suggesting that pieces of it were given out. \nBasileus misit et multa sanctuaria, / Quae in templis seu bellis sat sunt necessaria- / Nulla dona super terram his habentur paria: De sudario, de cruce, de corona spinea, / Qua delusit regem suum amaricans vinea. 1Huiusquemodi thesaurum non corrumpit tinea.”\n“The basileus [ Alexios I] sent him [Henry] many saintly things, necessary in churches as much as in wars- no gift on earth equals them: [fragments] of the shroud, of the cross, and of the crown of thorns, through which the vineyard that turned bitter deluded its king. Such a treasure is not corrupted by the moth.”\nFrom Benzo of Alba’s panegyric in honour of the emperor Henry IV, Holy Roman Emperor, 1084-1105.\n\n","date":"September 11, 2012 at 1:57 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16151","author":"Charles Freeman","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Charles, \nIt is not just because the well of truth is now poisoned, any pure living water is not still springing up into it.\n\n","date":"September 12, 2012 at 6:56 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16172","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Interesting references by M. Freeman.  I wasn’t aware of these ones. \nThis part of the Shroud and sudarium remind me of the list written by Baudouin II for the big selling of relics he did with St Louis King of France.  In this list too, there was an item called “part of the Shroud”.  Is it possible to think these pieces of the Shroud could have been taken from the 2 missing panels we see on the Shroud of Turin ?  No one can say for sure when these 2 missing parts of the Shroud were cut off and it’s truly possible to think that these missing panels were then cut out in many smaller pieces…  Maybe it was during the time the Shroud possibly was kept in Constantinople to give away by the Byzantine emperor as gifts to other kings or Church leaders ?  I think it’s an interesting possibility.\nAnd for the sudarium, I remind having read this term in some list of relics of Constantinople but what is not easy is the interpretation to give to this term.  Effectively, many time it was used by ancient authors (like in the Arculfe testimony : The author of the text used the word “sudarium” to described a piece of cloth of 8 feet long!) to describe a long piece of linen cloth like the Shroud of Turin (in fact, it is truly possible that this term found in the Gospel of John effectively describe the Shroud of Christ and not a simple face cloth) and on other occasions, it was used to describe a much smaller cloth used by Eastern people to take away the sweat.  So, this term “sudarium” we found in some list of relics from Constantinople could have described a long linen cloth (maybe the Shroud of Turin) or a smaller cloth…  It’s not easy at all to be certain about that.  Maybe it was used for the Shroud by some authors and for a smaller cloth by others.  Hard to say. \nNevertheless, I think it’s truly possible that at the same time, in Oviedo and in Constantinople, there were 2 different relics pretending to be the authentic sudarium of Christ, along with another long cloth that was also kept in Constantinople at the time (until the 13th century) and that was described as the authentic Shroud of Christ (this Shroud was sometimes described with some other smaller linen cloths and/or bands).  All these cloths were thought to be genuine and to have been found by the disciples in the empty tomb. \nWe know the size of the one in Oviedo but I really wonder if the one that was probably kept in Constantinople was as small…\n\n","date":"September 11, 2012 at 2:23 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16152","author":"Yannick Clément","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Yannick.  ‘And if it was so and if the public showing of 1203 and 1204 was the very first time the inner part of the Shroud (with all the injuries, bloodstains and body image we can see) was publicly showed to the faithful, I don’t have any doubt at all about the fact that it probably had a huge influence on Christian art, even if other things could also have contributed for this change (like the epidemies that were going on in Europe during that era, the spirituality linked with the stigmata of St Francis of Assisi, etc.).’\nIf this is your interest, Yannick, there is a mass of recent scholarship to explore on the relationship between the sack of 1204 and western art. In addition to Thomas Dale, look at the work of Holger Klein, for instance, which is freely available on his Columbia website. I can’t see how the public showing of a shroud in Constantinople could have as much impact as the actual mass of relics and Byzantine art that came back to Europe after 1204 which people could actually handle and copy. See Klein on ‘Refashioning Byzantium in Venice -1200-1400’ and his exhaustive article on the transfer of relics from east to west from which I got the information of the transfer by the emperor of a piece of the Shroud to Henry IV.\nIncidentally I find that the treasury at the monastery at Halberstadt still has a paten brought back by Conrad from Byzantium in 1205.\nI was lecturing on early Byzantine ivories at the Victoria and Albert Museum last year , and there was a fascinating casket that I had not seen before. It was Byzantine but had been found in a monastery in Italy. It was assumed that it must have been one of the treasures that had been brought back in 1204. It was objects such as these that would have provided models to work from, as they certainly did in Venice- it is hard to see how anyone would have been able to record an image on a Shroud within a church that would only have been lit by candles!\nOnce again there is the danger of giving the Shroud a status that it does not seem to have had. Shroud(s) were among among hundreds of relics in Constantinople and certainly not the most prestigious .Every list that does mention a shroud places in down the list behind the Cross, Crown of Thorns and the actual blood of Christ.Parts of John the Baptist also outclassed it. The isolation and elevation of the Shroud as a sort of uber-relic is a very recent phenomenon, not known in the medieval world.\n\n","date":"September 12, 2012 at 4:46 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16165","author":"Charles Freeman","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Hi Charles, when you mention shrouds, were these all with an image and blood etc. and are one of these the Shroud of Turin? I must say I’d be more than surprised that the Shroud (of T) itself didnt garner more interest than relics of cross, thorns etc. I cant understand how a large cloth with an  image, showing nail wounds in hands, and feet, side wound, real blood, indications of a crown of thorns, a summation of death and resurrection, plus an image of what Jesus looked like would be outclassed by any of these others (which are very easily faked). Any ideas of why this might be as it doesnt make the remotest bit of sense to me.\n\n","date":"September 12, 2012 at 9:15 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16178","author":"ArtScience","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Artscience. Well, you have stated one of the reasons that is given for doubting the authenticity of the Shroud, that such a Shroud would have been noticed. Although, as in the case of most relics, we have mentions of  several burial shrouds in Constantinople and in western Europe, not a single one is described as ‘a large cloth with an image, showing nail wounds in hands, and feet, side wound, real blood, indications of a crown of thorns, a summation of death and resurrection, plus an image of what Jesus looked like would be outclassed by any of these others (which are very easily faked).’  I would also expect some mention of the double image as this is a distinguishing feature of the Turin Shroud.\nWe have to wait until the fourteenth century for such a mention. As I have said before, I don’t accept a single reference that Ian Wilson has been able to provide as referring to the Turin Shroud, some of them obviously refer to other shrouds that were around and some refer to the Image of Edessa which is never described as a ‘shroud’. The same would go for the ‘;shrouds’ that I have found mentioned.\nNote the misleading comments of Dan Scavone who says that ‘sindon’ is the N.T. word for shroud. Well, it isn’t in any Greek lexicon or New Testament Greek dictionary that I know of. It refers to cloth ,especially fine linen, and that just describes the cloth Jesus was wrapped in.  It doesn’t become transformed into a general word for ‘shroud, any more than if Jesus’ body had been laid out on a table the word ‘table’ would become transformed into the word for ‘bier’.\n\n","date":"September 12, 2012 at 11:02 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16188","author":"Charles Freeman","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Answer to M. Freeman :\n1- A paten is certainly not a piece of a shroud nor a sudarium !  I think we should be VERY PRUDENT with this ancient reference saying that there was these cloths-relics related to the Passion that were brought in the monastery at Halberstadt in 1205…  If nobody can provide a solid evidence that these cloths ever where preserved at this monastery, I think we should not take this account as an historical fact.  Prudence is certainly needed here and more research is also needed to see if some kind of physical and/or historical proofs can be found at this monastery to confirm this ancient reference.  I think Michael Angold was correct when he looked at this particular reference with great prudence.  As I said myself, it’s truly possible that these cloths mentioned by Conrad of Halberstadt never left Constantinople and the Pharos Chapel until much later when Baudouin II sell them to St Louis King of France.  But I have to say that I’m not aware of a sudarium that would have been sold to St Louis in this mega-transaction. Who knows what happened of this sudarium ?  And who can say that it ever existed for sure in Constantinople and could not have been confused with the Shroud of Christ that was there also ?  As I said, it’s not evident to interpret all these ancient reference when the authors were using words like “sudarium”, “lintheum”, “sindon”, etc. to often talked about a same piece of cloth !  Truly, ancient writers didn’t had the same crazyness than us concerning precision !!!\n2- IF (note the “IF” because it’s the most important thing here) the inner part of the Shroud of Turin (where we can see the body image and most of the bloodstains) was showed publicly for the very first time in History during the time the Latin crusaders were at the gates of Constantinople in 1203-1204 and that many of these crusaders were able to see this completely unique, gruesome, crude and even scandalous image of a dead and suffering Christ, I’m totally convinced that this sighting would have had definitively a huge influence on the apparition of the Suffering Christ’s icons that first appeared in Europe (think about the Man of Sorrow icon for example that shows many similarities with the image we see on the Shroud!!!) once the crusaders returned home (with probably the Shroud itself with them in their “luggage”!!!!). Seriously, I can’t believe for one second that this incredible sight would not have left a huge impression on some of these crusaders who could have given testimonies (most probably not written but just oral) about that after their return from Constantinople…  I think a lot of mysteries surrounding the Shroud’s obscure history would get rational answers IF (the “IF” is important again!) it was really the Shroud of Turin that was put in public display in 1203-1204 in Constantinople and IF this was the very first public showing of the inner part of this relic…  This would also give a credible answer to the very good questioning of ArtScience. It is true that the Shroud of Christ was not considered as the premiere relic of Christendom during the Byzantine period (the “True Cross” was) and that historical fact would be easily explained if almost nobody during that period of time was aware that there really was a body imprint of this Shroud with lots of bloodstains showing all the stigmata of Christ !!! Imagine that the inner part of the Shroud was constantly kept away from public eyes (most probably hidden inside a reliquary) during all these years until the public showing of 1203-1204…  I really think this would explain many things…\n\n","date":"September 12, 2012 at 11:01 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16187","author":"Yannick Clément","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Yannick, 1)No, I never suggested that the paten had anything to do with the Shroud. However, if one thing still remains from Conrad’s expedition to Constantinople in the treasury at Halberstadt it would be useful to see if anything else of his supposed haul is also still there. As you may know the Treasury of St. Mark’s in Venice  still has a section devoted to relics from the Passion of Christ (the same as brought from Constantinople)  but they are hardly mentioned in the guidebooks. So it would be worth looking and seeing what else is in the Halberstadt Treasury. if I am ever that way i shall certainly look in!\n2) Your comment ‘But I have to say that I’m not aware of a sudarium that would have been sold to St Louis in this mega-transaction. Who knows what happened of this sudarium ? And who can say that it ever existed for sure in Constantinople and could not have been confused with the Shroud of Christ that was there also.’\nGood point , and one I have been making repeatedly- we simply don’t have enough precise statements about exactly what was where- and the word ‘sudarium’ is often used without a clear reference to the size of cloth that it refers to.  You have done sterling work here in showing how Wilson misuses sources. As I have replied to Art science , there is no documentary evidence which CLEARLY refers to what we know as the Turin Shroud. Perhaps I am just being over-cautious but it was the way i was trained as a historian.\n2) Your comment ‘IF (note the “IF” because it’s the most important thing here) the inner part of the Shroud of Turin (where we can see the body image and most of the bloodstains) was showed publicly for the very first time in History during the time the Latin crusaders were at the gates of Constantinople in 1203-1204 and that many of these crusaders were able to see this completely unique, gruesome, crude and even scandalous image of a dead and suffering Christ, I’m totally convinced that this sighting would have had definitively a huge influence on the apparition of the Suffering Christ’s icons that first appeared in Europe (think about the Man of Sorrow icon for example that shows many similarities with the image we see on the Shroud!!!) once the crusaders returned home (with probably the Shroud itself with them in their “luggage”!!!!). ‘\nI agree with the ‘IF” because we only have one record in a marginal comment by one crusader of a shroud with an image. Have you any evidence that anyone else saw this shroud, or that anyone could see blood or suffering on it? Is there any evidence in any of the chronicles of anyone affected by seeing a shroud so that they would have begun a new phase in art . ( One would need to read Professor Folda on this as this is his specialist subject and he is the acknowledged authority on the relationship between what the crusaders brought back and how it affected western art- I haven’t seen his book yet.)\n Note my earlier suggestion (no more than that) that the first place to look for the transfer of a relic from the Blachernae Chapel would be Venice as the Venetians took icons from the Chapel but, as I have said, most of the relics the Venetians looted were destroyed in the fire in the treasury of 1231 so that even if the Blachernae shroud had escaped the destruction in Constantinople itself, it might have perished in the fire.\nAnyway the images of the suffering Christ go back much earlier than 1204. I would refer you to Rachel Fulton’s From Judgment to Passion, Columbia UP,2002. While the Gero Crucifix of 970 is normally seen as the first ‘suffering Christ’, I was more moved by the Old English poem Christ III.\n‘And downcast in soul they shall also behold the ancient gashes and the gaping wounds in their God, even as His foes pierced His white hands and hallowed feet with nails and likewise  made blood run from His side, where blood and water issued forth together  in the sight of all, flowing before the face of men, while he was on the Cross’.\nIf that is not an image of the suffering Christ, probably tenth century, I don’t know what is.You will find many more details of the emergence of the ‘suffering Christ’ in the tenth and eleventh centuries in Fulton’s acclaimed study.\nI agree with so much of what you have written on Wilson, you have shown how his arguments fail to stand up in any sense at all, so I am sorry I have to disagree with you here!\n\n","date":"September 12, 2012 at 11:41 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16194","author":"Charles Freeman","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Hello M. Freeman !\nFirst of all, you don’t have to be sorry for disagreeing with me on one particular topic (i.e. The Shroud of Constantinople).  I have no problem with people who disagree with me as long as (like you do) they do it with intellectual honesty and they can bring solid arguments (and not just weak speculations that come almost solely from their imagination) to defend their point of view.  And I agree with you completely on the fact that Wilson’s arguments are very weak (I even prefer to use the term “partial” in every sense of this word !!!).  I also see that we agree (unlike some Shroud scholars who are evidently biased in their judgement in order to make links between some ancient texts and the Sudarium of Oviedo) on the FACT that the word sudarium did not always mean a little cloth in ancient texts.  It’s very important to understand that FACT…\nPoint #1 : It would be effectively a very good thing if you or another scholar could verify the path of Halberstadt just to see if there are some “traces” that can be found concerning these cloths-relics that are supposed to have been brought there.  If you find something, please let us know !\nPoint #2 : It’s a very complex subject.  I agree with you that the evidence is pretty thin in order to link the Shroud of Constantinople and the Shroud of Turin.  Effectively, the testimony of de Clari is the only one that is clear enough to understand that he’s talking about a Shroud of Christ with a body image on it (and it’s important to note that he was not just talking about a face image).  BUT…  When you put this testimony alongside the testimony of Mesarites written just 3 or 4 years earlier that make a very strange (no matter what David Mo can think, this is an odd reference) to the nudity of Christ while talking about his burial Shroud and alongside the drawings of the Pray codex (which is a book that was manufactured under the King of Hungary Bela III who had spend a long time in Constantinople before being his reign (ref.: Emmanuel Poulle), I think that allow us to build a much stronger case in favor of this possible link.  \nAnd concerning the fact that there was some suffering Christ icons before the beginning of the 13th century, I never doubt this reality but the FACT is that it WAS NOT an artistic trend at that time !  Artistic revolutions (any of them) never start from nothing and you can ALWAYS found some exceptions to the rule…  But that doesn’t change the fact that the trend to show a suffering, bloody and dead Christ really came strong during the 13th century and before that time, these kind of gruesome icons of Christ were certainly not fitting well in the theological, religious and social context of the time (prior to the sack of Constantinople), particularly in the Eastern Church.  This is another important aspect of the question to understand : the artistic trends were most probably linked tight with the theological, religious and social context of their time and I have no doubt that the possible first ever showing of the inner part of the Shroud just before the sack of Constantinople could have had a huge impact on starting (or more probably accelerating) a change of mentality inside the Church and also at a more global and social level that finally lead to the appearance of this artistic trend of showing a suffering Christ in religious art.  \nConcerning the Venice-France difference, I think it’s important to take good note of the letter written in August 1st, 1205 by Theodore Komnenos Doukas Angelos (http://en.wikipedia.org/wiki/Theodore_Komnenos_Doukas). This letter (I know it is contested but Poulle in one article mention a reference in which we can found a copy of the original letter) state that it was not the Venetians crusaders who have stolen the Shroud but the French crusaders. The letter states that the Venetians were more interested by the gold that could be found in Constantinople.  I think that’s explains why the Shroud of Constantinople could have ended up in Lirey instead of Venice.  Also, I think there are some references to the fact that it was French crusaders (in that group, there was supposedly Othon de la Roche who could have been the first European owner of the Shroud) who sacked the Church of Blachernes and not Venetians crusaders…  I think that can give us a true rational explanation for the Shroud’s presence in France in the 14th century…  Of course, this is pretty thin evidence but nevertheless, we cannot certainly exclude this possibility on that sole base.  Don’t forget also that Jeanne de Vergy (Geoffroy I de Charny’s wife at the time of his death) was a relative of Othon and that’s certainly not a hasard IF (the IF is important) the Shroud of Lirey was really the Shroud of Constantinople.\n\n","date":"September 12, 2012 at 1:23 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16198","author":"Yannick Clément","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"David Mo you wrote: \n“How this vaporous Shroud can influence all the cultural world of the 13th and before?”.\nHave you ever heard of its possible “cryptic influence” through Late Antique and Medieval legends (both hagiographic and non-hagiographic ones such as that of Saint Christopher and that of the Graal or Holy Grail), folk tales, liturgical Easter rituals, ‘visions’ (both apocalyptic and non-apocalyptic), cryptic iconography etc?\nE. g. the TRUE fact is from both 12th and 13th c. CE literary and iconographic documents, the “initiated eye” CAN read/ reconstruct BOTH the TS dorsal and frontal images…\n\n","date":"September 12, 2012 at 5:17 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16166","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"David Mo,\nHave your sight & brain  ever been impacted with the visual fact the Sindon Image DOES work like an oversized Rorchsach? Have you ever heard of Late Antique and Medieval archaeoperception, primary visualisation, archaeopareidolia and the like? Methinks, most obiously you haven’t.\n\n","date":"September 12, 2012 at 6:03 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16168","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Mistyping: Rorschach\n\n","date":"September 12, 2012 at 6:19 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16171","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"David Mo you also wrote: \n“I have done the analysis of Pray-Turin point by point and conclude with the image as a whole.” \n– Is it conclusive in the way the Pray codex image burial cloth is not/cannot be a representation of the Sindon now kept in Turin? \n– Is it a really IN-DEPTH analysis of yours to reach such  AN absolute truth? (I very much doubt so).\n\n","date":"September 12, 2012 at 5:44 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16167","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"I ask the same questions to Nicoletti and Aslanosky…\n\n","date":"September 12, 2012 at 6:11 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16169","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Mistyping: I’m asking the same questions to Nicoletti and Aslanovsli…\n\n","date":"September 12, 2012 at 6:14 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16170","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"\nCarlos Otal :\nDavid Mo:\n“I can show you examples of Christ naked under the shroud, of course. What for? Will it be enough to convince you that the naked Christ idea was common at the time?”\n¿Común en aquel tiempo?.\nUsted, David, NO HA PODIDO MOSTRAR ninguna imagen de Cristo desnudo sobre la Sábana en todo el siglo XII, con la excepción del Códex Pray.\nCarlos Otal\n\nCarlos: \nI didn’t said “over” the shroud. I wrote “under” because we are now discussing about the idea that Jesus was wrapped naked. You have got the wrong discussion. \nPerhaps you have some problem with English. I translate: \nNo dije “sobre” el sudario. Escribí “bajo” el sudario porque estamos discutiendo ahora sobre la idea de que Jesús fue envuelto en él desnudo. Se equivocó de discusión.\n\n","date":"September 12, 2012 at 8:52 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16175","author":"David Mo","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"To David Mo, \nJust playing on words to deny one’s bad faith, “ce n’est pas très élégant comme argument, mon vieux”…\n\n","date":"September 12, 2012 at 9:32 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16179","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"To David Mo again, \nif the TSM’s image was recorded ‘under” (on the inner side of the Sindon), once the sindon is unfolded to display the image it bears, the latter DOES appear over the sindon.\n\n","date":"September 12, 2012 at 9:41 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16180","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Do you want me to translate into Italian?\n\n","date":"September 12, 2012 at 9:45 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16181","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Typing error: “the latter DOES appear “as if” over the sindon.\n\n","date":"September 12, 2012 at 9:49 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16182","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Can Nicoletti and Aslanovski \nprovide us with TRUE material and/or visual facts (not just via intellectual theorising and piling-up of quarter-truths) proving beyond the shadow of a doubt that the Turin Sindon Image is not/cannot be the Image of Edessa; is not/cannot be the ‘figure’ on the ‘sydoine’ kept in Constantinople?\nOnce Aslanovki (very disdainfully) wrote: \n“I will, OF COURSE, ignore appeals to […] cryptography, steganography, […] (For the simple reason that these things are entirely fanciful and have no direct connection to Christian relics and art.).”\nHe surely meant cryptology and steganology (or cannot he discriminate between the four?).\nTherefore NON-CRYPTOLOGICALLY but ICONOLOGICALLY & THEOLOGICALLY speaking, can Aslanovski and/or Nicoletti account in clear plain English language E.G.. for the Abgar Legend variations and distortions (or the way a facial imprint in portrait mode on a small face cloth can turn into a facial imprint on a long rectangular cloth)? Can he also account for the Edessa Easter rituals (before 944) and “[the image] chang[ing] its appearance according to different ages” as “it showed itself in infancy at the first hour of the day, childhood at the third hour, adolescence at the sixth hour, and the fullness of age at the ninth hour, when the Son of God came to His Passion and cross”.\n\n","date":"September 12, 2012 at 9:10 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16176","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Mistyping: ?\n\n","date":"September 12, 2012 at 9:14 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16177","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Thanks for yours Yannick. We both agree on the need to do a lot of rethinking in this area and to follow up many leads that have still not been explored. The adulation of Wilson has made people lazy!!\n So it is a debatable questions as to whether the images of the suffering Christ are a development from an earlier tenth century tradition or were a new departure, in the form they took , in the thirteenth century. I shall look forward to reading Professor Folda in detail on this- as always too expensive to buy my own copy so i shall have to track one down next time I am in the Cambridge UL!.\nExploring relic collections on the ground is important because nowadays very few churches advertise what they have gathering dust in their sacristies. So I was delighted to find in the church of Catherine of Alexandria in Galatina , a finger of Catherine herself  and not any old finger but the one with the ring which the infant Christ placed on her finger himself  after he had appeared to her with His mother. It has been stolen from the body of St. Catherine in Sinai by a Norman noble who, as a good Catholic, believed that heretical Greek monks had no right to it!  There is scarcely a mention of it in the literature but there it still was, several hundred years later, in a room adjoining the church. That is why I prefer to do my own research on the ground.\nAlas, I have no plans to go to Halberstadt. My next tour is Istanbul/Constantinople itself but, of course, nothing of relevance left to explore so far as the Shroud is concerned. Then I take a tour of north-eastern italy and might just be able to look in on St Mark’s to see some of the icons they say were brought back from the Blachernae Chapel!\nGood researching – there is a long way to go but I think a lot of relevant material being covered by Profs. Klein, Dale and Folda. Both of us need to be on top of that if we want to take these debates further but alas I have too many other projects to continue contributing this blog.\nAs a matter of principle I do not reply to Stephen Jones.  For him to suggest that I will write anything, even if I know it to be false, just for money, places him beyond the pale.\n\n","date":"September 12, 2012 at 1:53 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16199","author":"Charles Freeman","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"\nArtScience :\n(…) David Hockney describes it as “Secret Knowledge”, a secret passed on from studio to studio. And even in the cases where this knowledge isnt known, the new style of painting still becomes pervasive (see the followers of Carravaggio who tried to emulate the style without knowing the secret). So I think Yannick idea that a small showing of a naked Christ on a shroud could have a large ripple effect and without its cause been widely known, is entirely possible as an explanation of how come naked Christs come into vogue. (…)\n\nCaravaggio was a celebrity in his time. His work was abundant, well known and praised. He has a school and a lot of imitators. He has nothing to do with de Clari’s shroud.\n\n","date":"September 13, 2012 at 1:53 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16216","author":"David Mo","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Hi David, sorry you are clearly missing the point of my mention of “Secret Knowledge”. I’m not suggesting Caravaggio had anything to do with the shroud at all – that makes me laugh,  as thats off by a couple centuries!  No, my point was that the use of optical instruments in the history of art is almost completely undocumented even though very influential – so I was drawing an analogy to Yannick’s theory that there might have been a showing of the shroud,  that was undocumented, and yet had an influence on future depictions of the burial of Christ. If I understood you correctly, you dismissed Yannick’s theory because you thought it an oxymoron for an undocumented artifact to have a large cultural influence. I disputed that with the counter-example above.\n\n","date":"September 13, 2012 at 5:53 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16219","author":"ArtScience","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"\nYannick Clément :\n That speak very loud to me because that show how odd the image on the Shroud is for the era that goes before the sack of Constantinople and even long after that. Jacques Bara in France did a cool research and never found a naked Christ in a depiction related to his Passion, death or burial before the 15th century in Toscani !!!  So, even after the Shroud of Turin was put in public display in France, artists were not willing to depict Christ naked in scenes related to his Passion and death !\n(…)  Meditate about that my friend !\n\nI meditate, Yannick, and you must meditate also. And these are the results of my meditationis:\nMeditatio Prima: You are wrong again. Why do you not read my preceding comments when I send you to them? I have shown some examples of naked Christ in a date long before to15th century in this forum. For example: Entombment. The Cloisters. 13th Century.  http://www.flickr.com/photos/elissacorsini/2163082112/in/set-72157601070709853/, I don’t know this Jacques Bara, but I think he was not very inspired if he said that. Or he was so an expert as you and I are. \nMeditatio Secunda: We are simple amateur (more or less) and our knowledge of the history of Art is very limited. (I have read three books on Byzantine Art. And you? Be honest, please). How many entombment or anointing paintings of the 12th Century do you know? Then, why do you ask to me? The lamentatio theme becomes widespread in the 14th and 15th Centuries. It’s the same with vir dolorum, entombments and other subjects around the Christ dead. But there were some examples before. To make generalizations on the basis of a few examples is very hazardous. Even if the Pray Codex was the first example of the naked Christ in the anointing theme known by experts in art, this mean nothing for the Turin Shroud authenticity case. \nMeditatio Tertia: How many documents do you know about the Christ dead in Byzantine 12th –epitaphioi came after? How many of these spoke about the Christ’s clothes in the tomb? You use an illogical argument: if the Byzantines buried their dead dressed, then they imagined the dead Christ dressed. Illogical. They didn’t bury their dead with a transparent veil, but painted the Christ dead with a transparent veil. Yes, Mesarites could have in mind paintings as this one:  http://imageshack.us/photo/my-images/856/ingeburgchantilly.jpg/ ( Ingeburg psalter, 1190 circa), when he was speaking about naked Christ under the Shroud. \nMeditatio Quarta: What are we discussing? I thought we were discussing about de Clari’s shroud and Carlos comes with a new problem, i.e. the Pray Codex. I prefer to finish with a subject before entering in another.\n\n","date":"September 13, 2012 at 3:20 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16218","author":"David Mo","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"And to close the case (for me at last): Yannick speaks about the possibility (he writes the word “possibility” once each two lines and “if” with capital letters). The possibility of an event is a very vague concept (it is physically possible that there are “lunatics” in the Moon and it is metaphysically possible First Motor existence), but he thinks the possibility Mesarites is talking about the Shroud of Turin (under de Clari’s shroud identity), is reinforced by the odd reference to a naked Christ. I don’t think so. This probability is strongly reduced by two facts: \n1. The image of a naked Christ under the Shroud was not odd at this time. If it was pictured in the Queen Ingeborg psalter (and others) we can think it was a well known concept at his time. \n2. When Mesarites speaks about an icon he mentions it directly. He made an accurate description of the Mandylion. But if he was in front to the “odd” and very important image of Turin Shroud or similar (and Yannick claims both odd and very impacting) it is incomprehensible he stopped talking about. The most impacting relic of the century and he only made a subtle and vague reference to Our Lord’s nudity!  Absolutely unthinkable. \nYes, it is possible Mesarites saw the Turin Shroud. It is metaphysically and physically possible. But it is historically very unlikely. \nAnd remember we are speaking about de Clari’s shroud because it is used as an argument against the radiocarbon dating. And you can’t opposite vague possibility to a well accepted dating method. Suppositions don’t cancel proofs. The sindonists must search out another way.\n\n","date":"September 14, 2012 at 2:20 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16255","author":"David Mo","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"All I know Dave is :\n1- de Clari’s account directly refers to a complete body image on the relic considered by the people of Constantinople as the true Shroud of Christ.  You can’t deny this basic historical FACT.\n2- Mesarites reference to the nudity of Christ in link with his burial shroud (which is most probably the same shroud that de Clari saw 3 years later) is VERY ODD in that context because we know for a FACT that absolutely no other artwork from that era showed a nude Christ in the scene of his burial (particularly true concerning the epitaphios) except for one drawing found in the Pray codex.  This is another historical FACT that cannot be denied, even though when we analyze it alone, it cannot be taken as any kind of proof that there was a body image on the cloth.\n3- There is one drawing in the Pray codex which is the only know artwork of that era to clearly depict some very particular characteristics that we see on the Shroud (like the famous burn holes and the nudity of Christ for his burial) while, at the same time, it should not be seen as a proper copy of the Shroud because the general style of the depiction is pretty much like any other images of the burial of Christ that we see on other epitaphios of that time.\nThese are 3 important HISTORICAL FACTS that should be considered TOGETHER in order to make a proper historical interpretation (something that you seem to avoid doing desperately).  And when we do this, we have no choice than to conclude that the probability that a Shroud of Christ that showed a complete body image of a nude Christ on it was present in Constantinople some time prior to the sack of the city in April 1204 is quite good, even though the 3 facts I report above are not enough to be considered as a real proof.  That’s why any credible historian will conclude that the first sure date for the appearence of the Shroud is during the second half of the 14th century in Lirey, France and not around 1200 in Constantinople.  But at the same time, it would be a terrible mistake for an historian not to consider seriously (or worse, to simply reject) the possibility for the Shroud to have been kept in Constantinople around 1200\nI really think that’s the most honest way to analyze the situation. \nConcerning your first meditation that you wrote above, Bara was not wrong.  You have to understand that he was referring mostly to paintings of Jesus on the cross !!!  And the only depiction of Christ nude on the cross he could find was these artworks done in Toscani in the 15th century.\nAnd one last thing versus your recent comments :  Do you need to be an astrophysicist to conclude that the Earth turn around the Sun ?  No !  All you have to do is consult credible and reliable scientific sources !  That’s the same thing for any historical research done concerning the obscure years of the Shroud !!!  Even though you an I are not Byzantine expert, that doesn’t mean we cannot do a good historical research based on true experts in that field !\n\n","date":"September 16, 2012 at 5:55 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16362","author":"Yannick Clément","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"David Mo:\n“The image of a naked Christ under the Shroud was not odd at this time. If it was pictured in the Queen Ingeborg psalter (and others) we can think it was a well known concept at his time.”\nEso es una ESPECULACIÓN, con fundamento en OTRA ESPECULACIÓN, a la que no he contestado anteriormente por ABSURDA ( su “under”).\nNo puede AFIRMAR lo que no PUEDE VER, usurpando la intención del artista.\nHay “perizonium” mínimos, muy pequeños, como se muestra en otra muchas iconografía a lo largo de los SIGLOS, de existencia compatible con la “under” Sábana del Queen Ingeborg Psalter. ( como ejemplo Simone Martini 1333).\nJesús DESNUDO en el BAUTISMO ha sido muy FRECUENTE en la iconografía desde la edad media.\nJesús DESNUDO y MUERTO, bajo sábana, sobre sábana … …. o en el camino de la sepultura, es una idea EXTRAÑA (ignoro la razón) a la iconografía de TODAS LAS ÉPOCAS, aún con muy ESCASAS pero notables excepciones, lo que da MÁS VALOR , cuando se muestra desnudo y muerto en la Edad Media, a su posible relación con el CONOCIMIENTO de la existencia de una Sábana con la imagen de Jesús desnudo.\nEn el siglo XIII el “Cloisters” es una excepción, como lo es en el siglo XIV la “mise au tumbeau” de la Iglesia de Onnens o la de la Iglesia de Landes.\nCarlos Otal\n\n","date":"September 14, 2012 at 5:01 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16261","author":"Carlos Otal","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Carlos, you wrote: \n“Jesús DESNUDO y MUERTO, bajo sábana, sobre sábana … …. o en el camino de la sepultura, es una idea EXTRAÑA (ignoro la razón) a la iconografía de TODAS LAS ÉPOCAS, aún con muy ESCASAS pero notables excepciones, lo que da MÁS VALOR , cuando se muestra desnudo y muerto en la Edad Media, a su posible relación con el CONOCIMIENTO de la existencia de una Sábana con la imagen de Jesús desnudo.\nEn el siglo XIII el “Cloisters” es una excepción, como lo es en el siglo XIV la “mise au tumbeau” de la Iglesia de Onnens o la de la Iglesia de Landes.”\nYou are wrong again. It is not true that the representation of a naked Christ on the shroud or under was an exception. Not only in the Middle Ages, but in the Renaissance and in Baroque period from Mantegna to Rubens the Crhist was naked or covered only by the shroud. He is depicted so by Michelangelo, Boticelli, etc. I have done a little survey in the French Ministère de Culture page for medieval manuscripts. I have looked for Christ in the Tomb enluminures in the 13th to 15th period. Approximately 30% were nude or with a transparent veil that concealed nothing.. So the concept of a naked Christ was a minority, neither “strange” nor “odd”, and it is explain naturally the Mesarites’ reference. My argument is not speculative. I summarize it: \nPart I.\n1. When somebody sees an important event and wishes communicate it he mentions it directly. It is “strange” or “odd” to use vague allusions or double meanings when you can say the things directly.\n2. The Christ’s image on a Shroud would be very important for Mesarites.\n3. Mesarites doesn’t speak about an image of Christ on the shroud. (By contrast with the Mandylion).\n4. Mesarites didn’t see any Christ’s image on the shroud. \nPart II.\n1. The naked Christ (yes, into, under or over the Shroud) was a normal iconic concept at this time both in prayers or manuscripts specially in rich books of aristocracy or convents.\n2. Mesarites uses a normal iconic concept of his time. \nCONCLUSION:  There is nothing “strange” in the Mesarites’ mention to a naked Christ. We don’t need to look for double meanings or pathological/theological inhibitions. There is no “más valor” (whatever this is meant for you) in speculative relations with occult and mysterious references. This is speculative. Not my argument. \nPS: The idea of naked Christ in the baptism is derived from the idea of St. Paul that Chist is a new Adam and the symbolic significance of Holy Baptism. The refusal of a naked Christ is a logical consequence of the sexual repulsion in the official Christianity. You’re welcome.\n\n","date":"September 15, 2012 at 2:06 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16311","author":"David Mo","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"David Mo:\n1.- En la iconografía, Jesús desnudo NO ES Jesús con perizonium, por muy transparente que éste sea.\n2.- En la iconografía Jesús desnudo ( sin perizonium o similar) y muerto ( bajo, sobre….etc, etc) es extraño, raro, singular o poco frecuente, como quiera denominarlo, en el siglo 13, 14, 15, 16, 17, 18, 19, 20 y lo que llevamos del 21….\n3.-Lo que es CONGRUENTE con la existencia de escasas pero notables excepciones que SI lo muestran desnudo (sin perizonium o similar).\n4.- Esta escasez iconográfica es MÁS notable con anterioridad a 1355.\n5.- Su propuesta “Mesarites uses a normal iconic concept of his time”, es una especulación no fundamentada y muy probablemente FALSA.\nCarlos Otal\n\n","date":"September 15, 2012 at 8:43 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16317","author":"Carlos Otal","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"JUST GUESS what was in the Byzantine Emperor’s PRIVATE CHAPEL of the Blachernes?\n Just icons, relic copies and/or fakes, not the least genuine and most precious relics of the Virgin and/or Christ. That’s what Mr. David Mo would like us to believe as historically speaking the most likely. Is Mr. David Mo kidding?\n\n","date":"September 14, 2012 at 5:14 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16262","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"( I thought I had posted this once- apologies if it appears twice in slightly different versions!)\nMax. Can you clarify, please, which building ‘chapel you are referring to in  your post.\nThe Blachernae was a district of Constantinople.\nThe Church of the Blachernae was built on the site of a sacred spring by the empress Pulcheria in 451. She filled it with relics of the Virgin Mary and it contained the famous icon of the Virgin  Blachernitissa that was said to have saved the city in 626 when it was attacked by the Avars. It was,of course, a public place with expositions of the relics, often in processions in the courtyard. I have always assumed that it was here that Robert de Clari saw his shroud with an image although I know of no other reference to this shroud and no else seems to have seen one either. We simply do not know how far we should trust his account without any corroborating evidence to support it.\nIt seems to have been looted in 1204 . I am awaiting  a copy of Thomas Bale’s article on the links between icons now in St. Mark’s Venice and the Church. The Church was burned down in 1434 and there is now a 1960s chapel on the site where the spring is still venerated.\nThe Palace of Blachernae was used by the later Byzantine emperors. Parts of it still stand and there are excavations going on. i visited it last spring to see whether there was anything worth bringing my study group to see but it is boarded off and there is no public access at present. It would, of course, have had its own private chapel, but I have no reference to it or what it contained.\nSo please let us know which chapel you are referring to.\n\n","date":"September 14, 2012 at 6:11 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16266","author":"Charles Freeman","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Charles, you wrote: “I have always assumed that it was here that Robert de Clari saw his shroud with an image”\nMost likey you are right. The Great Palace of the Boukoleon was  the primary residence of the Byzantine Emperors until 11th century as you know.. Then they moved from the Great Palace to the Blachernai palace and might well have made the lateral chapel of the Church of the Blachernai (or even the Church of the Blachernai itself) their own private chapel.\n\n","date":"September 14, 2012 at 6:35 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16269","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"REMINDER: The Image of Edessa was publicly displayed in times of great dangers and (beside private purposes) was ALSO displayed (in full, half or quarter length?) in the Byzantine Emperor’s private chapel of the Blachernes in 1204.\n\n","date":"September 14, 2012 at 5:57 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16264","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Historically speaking, THIS is the most likely.\n\n","date":"September 14, 2012 at 5:59 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16265","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Max- references please to the exposition of the Image of Edessa in the private chapel of the Blachernae palace in 1204.\nNormally at times of ‘great danger’ icons of the Virgin Mary were brought out  – the only reference I know of of an exposition in a procession of the Image of Edessa was in a time of drought, not quite the same thing. Then it went as far as the Blachernae Church, as I understand it , before returning to its permanent home in the Pharos Chapel. But perhaps you can provide a reference to it being moved in the early thirteenth century- the Image was such a famous relic it would surely have been documented.\nAs I don’t buy the argument that the Image of Edessa was the Shroud of Turin, I don’t see any connection with whatever de Clari saw or did not see in the Church of the Blachernae.\n\n","date":"September 14, 2012 at 6:34 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16268","author":"Charles Freeman","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"P.S.  See Holgar Klein ‘ ‘Sacred Relics and Imperial Ceremonies at the Great Palace of Constantinople’ downloadable from Klein’s website which gives details of the exposition of those relics in the Pharos Chapel\n\n","date":"September 14, 2012 at 6:38 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16270","author":"Charles Freeman","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Max- ‘made the Church of their Blachernae their private chapel’- I am sure we would have had a record  if they had taken it out of circulation. They would certainly have visited it in the way they did Hagia Sophia, another public space. You must have got ‘private chapel’ from somewhere – I am interested to know where.\n\n","date":"September 14, 2012 at 6:42 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16271","author":"Charles Freeman","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"The fact is the very designation “the Image of Edessa” can be much confusing as it might well have referred to more than one material object (painted small face cloth and its copies/ facial imprint on a long rectangular cloth displayed folded in four and its copies). \nLegendary or historicallly speaking, the Image of Edessa is known to have been a very efficient ATROPAIC image as early as the 6th c. CE. onward. \nI can only repeat what I already wrote as the most likely: “The Great Palace of the Boukoleon was the primary residence of the Byzantine Emperors until 11th century. Then they moved from the Great Palace to the Blachernai palace and might well have made the lateral chapel of the Church of the Blachernai (or even the Church of the Blachernai itself) their own private chapel.”\n\n","date":"September 14, 2012 at 6:50 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16272","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"I’ll try to find the exact reference(s).\n\n","date":"September 14, 2012 at 7:01 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16274","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Max. Fine, they may well have but there is absolutely no evidence that they did and it is extremely unlikely!!!  Please explain why this is an important point in any case, what does it add to the story?\n\n","date":"September 14, 2012 at 7:01 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16273","author":"Charles Freeman","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Charles btw, what makes you think Byzatine emperor couldn’t possibly have a private chapel and be so suspicious about the possibiity for hemto have one? (I’ll really try to find the exact reference(s) about (a) Byzanine emperor(s)’ private chapel).\nThe “sydoine” bearing the “figure” of the Lord (Yeshua) would have been the very emblem of his emperial power on earth.\n\n","date":"September 14, 2012 at 7:11 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16275","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"A Byzantine emperor would have the image “sit with him side by side” on two thrones as he saw himself as the representative of Christ on earth.\n\n","date":"September 14, 2012 at 7:14 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16276","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Charles,\n btw can you account for a public display of the/a sindon body image of the Lord in the Chapel of the Blachernes or do you just dismiss it as most unlikely as well?\n\n","date":"September 14, 2012 at 8:08 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16278","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Max- no having seen the what remains of the Blachernae Palace I am sure it would have room for a private chapel- that would be standard for the time. I just believe it would have been iINSIDE the palace and not in a public church so that these are two separate buildings.I am just interested that you have a REFERENCE to a private chapel and I wondered whether you were confusing two buildings in the Blachernae district.\nNo evidence for the ‘sydoine’ being a symbol of the emperor- please read Holgar Klein.See,for instance, how the emperors’ relic of St. Stephen played a large part in coronation rituals, no mention of a SHROUD having anything to do with any imperial ceremony  unless you can show me one.\n\n","date":"September 14, 2012 at 7:24 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16277","author":"Charles Freeman","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Charles, \nPlease don’t you put words in my mouth! I never wrote “the ‘sydoine’ was a symbol of the emperor”. I wrote the sydoine IMAGE/figure (of the resurrected?) Lord might well have been a(n) (most secret?) emblem of both the Byzantine emperor as representative of Christ  and his power on Earth.\nYou also wrote: “No evidence for the ‘sydoine’ being a symbol of the emperor.”\nIf so, how then do you account for  the Image of Edessa (whether the Mandylion and/or Hemation as sindons) having been initially placed on the imperial throne in 944? What do you make of the very symbolical fact the Byzantine emperor WAS the representative of Christ on Earth?\nThe ‘sydoine’ with the ‘figure’ of the Lord could only have been displayed inside the Blachernae palace or outside. What is the most likely for a public display? I cannot help thinking  the more convenient place to publicly display the relic  was inside the Church of the Blachernes or its lateral chapel so that the two relics (that of the Virgin and that of Christ) could symbolicaly “meet’ in time of danger/war. Was the lateral chapel used under normal circumstances as the Byzantine emperor private chapel? it just cannot be TOTALLY ruled out.\n\n","date":"September 14, 2012 at 8:52 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16281","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Mistyping;: the most convenient place\n\n","date":"September 14, 2012 at 8:59 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16282","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Max : ‘I wrote the sydoine IMAGE/figure (of the resurrected?) Lord might well have been a(n) (most secret?) emblem of both the Byzantine emperor as representative of Christ and his power on Earth.’  (Emblem/symbol-well I suppose there is a distinction!)\nWell,if it is it is very secret! And what is the point of the secrecy when the divine aura has to be promulgated to the public as we know that it was from texts such as  De Cerimoniis . I think it would have been seen as blasphemous if the emperor had tried to link himself to the risen Lord. All the references suggest that the emperor was seen as a fully human representative of God on earth and clearly subordinate to him.\nThe Image of Edessa was clearly of great importance to the emperors which is why it was kept so carefully and securely in the Pharos Chapel in its own case that only the emperor could open. I can see no evidence that it was the Shroud of Turin and a mass of evidence that it was never seen as a shroud -but this has been argued over ad infinitum and I am not going to reopen it.\n But there is no problem with the emperor having a special relationship with the Image as there were a number of relics that were of special importance and used as part of the public display of the emperor.(Again Klein is good on this-so I hope you bother to read him if you have not already.) Some go out on display, some appear in specific rituals ,e.g. the coronations (relics of Stephen), etc. The Robe of the Virgin was put on as a garment by the emperor Romanos when he went out to negotiate with  the Bulagrian ‘tsar’ Symeon in 924. Then there was the relic of the  True Cross that had an elaborate ritual in which it was processed around the city in July every year to ‘cleanse and and sanctify all places and houses of of the God-guarded and imperial city’ and then brought back to the throne room where it was placed on the imperial throne before being packed away again. So the emperors manipulated a number of different relics in different ways. Nowhere that I know of ( but there are many accounts involving relics so I, or Klein, may have missed something) is there anything that is clearly described as a ‘shroud’ being involved with imperial ritual.\nI am afraid I don’t go along with all this ‘secret’ stuff.  Too often pseudo-historians use it to fill in the gaps so I am always suspicious!!\n\n","date":"September 14, 2012 at 10:09 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16288","author":"Charles Freeman","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Charles,\nFirstly, it was a ‘SECRET’ image as it was only shown in private displays and in times of great danger. Because it was also kept folded in four within a reliquary table and thus might very well have never been seen as a burial cloth by “the unhappy great number of people” who would never have had  the opportuniyty to see it totally unfolded (THUS it might well be a secret after all)\nSecondly, you can ‘think’ Byzantine emperors were not seen as REPRESENTATIVE OF CHRIST. ‘Methinks’ NOT A FEW Byzantine scholars will TOTALLY disagree with you. The imperial throne was ALWAYS placed BENEATH Christ ’empty throne’ (THUS there was nothing blaphemous at all about it)\nThirdly, shall I repeat  it still remains to be proven the designation ‘the Image of Edessa’ could  not refer to TWO DISTINCT OBJECTS namely a painted small face cloth and a facial imprint on a long rectangular full body cloth displayed folded in four (see the relevant Abgar legend variations). What do you make e.g. of the Abgar legend different versions and other literary documents that go against ‘a small face cloth’ description of  the Mandylion-Image f Eessa? Btw can you tell me exactly what  Abramos saw in 944 and how he discriminated between the genuine Edessa relic and its two copies? (THUS to assert the Image of Edessa is not/cannot be the Turin Sindon IS definitely NOT an absolute truth, far from it). \nFourthly, in 1203 and 1204, the ‘sydoine’ bearing THE ‘figure’ of the Lord was kept in the chapel/church of the Blachernes. The latter also housed the famous icon-relic of the Virgin Blachernitissa, the palladium of the city of Constantinople. Now the Image of Edessa used to be the Palladium of the Parthian city. In time of great danger/war, couldn’t the two palladii have ‘met’ in the same location to protect the city of Constantinopole? (THUS the possible presence of the sindon/sydoine bearing the Lord’s body image used as a palladium just cannot be TOTALLY ruled out either).\n\n","date":"September 14, 2012 at 12:25 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16292","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"I am always very suspcious of historians and art historians using half- and even quarter-truths and present them as if they were absolute truths.\n\n","date":"September 14, 2012 at 12:31 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16293","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Sorry for all the typing errors, I am typing in haste…\n\n","date":"September 14, 2012 at 8:59 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16283","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Max, You make it quite clear from your ‘might haves’ ( what i would call ‘highly improbabilities’ ) that you are simply speculating . No problem here so long as they remain speculations but the overwhelming evidence is against your ‘might haves’ and we have to live with ‘best fits which are always provisional and can be changed as new documentary/archaeological evidence emerges. That’s my world and the world of most practising historians.\nI don’t believe that the Shroud of Turin and the Image of Edessa are the same. No Byzantine scholar has ever been able to find any evidence that they should be. I believe that the Image of Edessa was created ,like many other similar figures, most destroyed, of course, in the iconoclastic period, in the sixth century. Belting has the argument but ,of course, he is supported by others. This is why the attempts of Wilson and others to find a history between 30 and 550 fails so lamentably – and laughably-see my article on the Image of Edessa. There is no acceptable evidence yet found of any history ! \nNo evidence that the Image of Edessa was ever  folded into four. A LEGEND  only says that the cloth was folded into four when it was without an image and BEFORE it was handed to Jesus. (Wilson gives the misleading  impression in his The Shroud ( 2010) that it was described as tetradiplon AFTER the image was on it and sadly all too many have been misled by this, even myself at one point ( I now know better!).)   No evidence that Jesus folded it BACK into four when Jesus passed it on. There are reasons why it MIGHT HAVE been folded before it was given to Jesus (see my article Tetradiplon Revisited). \nThere are ways that it could have been folded into four  or the edges doubled up when it was stored so that the face could be kept in the centre in a smaller box but unless we have access to the Image of Edessa we would not know. There is not a single reference to tetradiplon of the Image after it had been wiped on Jesus’ face. \nThe tetradiplon text, the Acts of Thaddeus, makes it quite clear that the burial cloths of Jesus, which are mentioned later in the Acts, are distinct from the cloth that was originallly tetradiplon. So here, although this is purely a legendary account, there is no support in it, in fact the opposite, for the Image of Edessa and the Shroud of Turin being the same. But one can go on saying this forever without convincing those who wish to believe otherwise! Please note: I am saying  ‘There is no evidence’. We can only work when there is evidence.\nOf course  the emperor was the representative of God/ Jesus on earth, but the distinction between human and divine was made very clearly in the texts (otherwise you would never be able to depose an emperor).  You seem to have misquoted me.\nWhat I said: ‘All the references suggest that the emperor was seen as a fully human representative [sic] of God on earth and clearly subordinate to him.’\nWhat you seem to think I said: ‘Secondly, you can ‘think’ Byzantine emperors were not seen as REPRESENTATIVE OF CHRIST. ‘Methinks’ NOT A FEW Byzantine scholars will TOTALLY disagree with you. The imperial throne was ALWAYS placed BENEATH Christ ‘empty throne’ (THUS there was nothing blaphemous at all about it)’\nAs Christ was a consubstantial part of the Godhead, the emperor was clearly a representative of God/Christ /the Holy Spirit. I assumed that everyone would know this but perhaps I was wrong. I said nothing about  the emperor not being a representative of Christ!! The blasphemy would come if he crossed the boundaries and aligned himself with the divine Christ.\n I am not sure what you mean by the emperor’s empty throne being placed benath Christ’s empty throne. The evidence we have of the Chrysotrklinos ( the octagonal audience hall of the Palace) is that the empty imperial throne ( occupied ,of course by the emperor on special feasts and ceremonies) was under an image of Christ  believed to be a mosaic. (See J.M. Featherstone,’ De Ceremoniis and the Great Palace’, in P. Stephenson (ed.) ,The Byzantine World, Routledge, 2010, pp. 165-6.)\nI still don’t understand the context (s) in which you use the word ‘secret’. The danger is that if there is no evidence for something one says this is because it is ‘secret’. This way pseudohistory lies – not always, of course, but in the vast majority of cases I know of. (Particularly bad among the pseudohistorians of ancient Egypt!). Ian Wilson’s ‘secret history’ of the Shroud of Turin under the Knights Templar is an especially laughable case- I really could not believe his text on this. (Paraphrase: We don’t know what happened to the Shroud. Therefore we must look for people who kept secrets. The Knights Templar had lots of secret rituals.  Therefore it is likely the Shroud went to the Knights Templar and that is why we have no evidence of its existence.’ This is a classic of the genre!)  Sadly even he has now had to denounce Barbara Friel his main ‘source’.\n\n","date":"September 14, 2012 at 1:40 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16295","author":"Charles Freeman","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Charles, \nYou wrote: “I am afraid I don’t go along with all this ‘secret’ stuff” and “I still don’t understand the context (s) in which you use the word ‘secret’”.\nI use the word ‘secret’ in connection with the Edessan Image. \nYou do seem in total denial of secrecy as far as the ‘acheiropoetic Image’ is concerned. Is it because Early Christianism, Parthian & Byzantine History have no more secrets to you or is it just because as a NON- CRYPTOhistorian and NON-archaeoCRYPTOlogist, you don’t feel comfortable with visionary and apocalyptic literature, pseudohagiographic literature (e.g. Saint Christopher), legends, folk tales, cryptic iconography, pre-944 liturgical Edessan Easter rituals and the like?\nUnless of course you can tell me precisely and beyond the shadow of a doubt what exactly the ‘acheiropoetic Image’ looked like, when exactly it was created, what for, how and by whom, I cannot help thinking you are more ignorant than really knowledgeable as far as the Image of Edessa is concerned.\n\n","date":"September 14, 2012 at 4:44 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16300","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Quite happy to be ignorant of all these things, Max. Conventional history has served me well for forty years and it seems to get as close to the truth as your more esoteric methods. So what is wrong with not being a crypto-historian and archaecryptologist- all the top history professors I admire have done without them. They are simply not part of the world in which us conventional historians work but good luck to you!\n\n","date":"September 14, 2012 at 7:31 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16306","author":"Charles Freeman","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Charles, \n  I didn’t write “you were ignorant of all these things” (please don’t you put again words in my mouth)\n  I wrote:  “UNLESS OF COURSE you can tell me precisely and beyond the shadow of a doubt what exactly the ‘acheiropoetic Image’ looked like, when exactly it was created, what for, how and by whom”. \n  Does that mean neither you nor “all the great professors you admire” can? \n  Quite happy too you and ‘all the great professors you admire have done without cryptohistory and archaeocryptology. Quite happy if history has no secrets to them/to you and they/you can do without cryptohistory and archaeocryptology.\n  Thus (without reccuring neither to cryptohistory nor archaeolcryptology), can you or any of “the great professors you admire” convincingly explain for instance:\n1/ The Abgar Legend variations or to put it in other words, the way a facial imprint in portrait mode on a small face cloth can turn into a facial imprint on a long rectangular full-body cloth? \n2/ The pre-944 Edessan Easter rituals and in particular “[the acheiropoetic Image] chang[ing] its appearance according to different ages” as “it showed itself in infancy at the first hour of the day, childhood at the third hour, adolescence at the sixth hour, and the fullness of age at the ninth hour, when the Son of God came to His Passion and cross”.\n  Can you or any of “the great professors you admire” ALSO tell us for instance:\n1/ What exactly did the ‘acheiropoetic Image’ look like? When exactly was it created?  How can an ‘acheiropoetic image’ be created? By whom? What for?\n2/ What exactly did help Abramos to identify the original template from its two Edessan copies in 944?\n  I am waiting for your answers…\n\n","date":"September 15, 2012 at 7:04 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16314","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Btw can you and /or “all the great professors you admire” explain to me the Turin Sindon image formation process?\n\n","date":"September 15, 2012 at 7:21 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16315","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Max, You live in an esoteric world of your own to which none of us are privy. I doubt whether a single person reading this blog is able to enter into it. Good luck to you but you cannot expect people to answer questions from a perspective that is solely your own.\nI have been asking the simple questions such as ‘ What do you mean when you talk of the private Blachernae Chapel of the emperors? Do you mean a chapel within the Blachernae Palace or do you mean the Church of the Virgin Mary in the Blachernae district? I have no doubt that the emperors visited the Church of the Virgin Mary just as they did Hagia Sophia on certain feast days but I have never seen the Church referred to as their ‘private chapel’. \nIn addition, I am not sure what the point you are trying to make is by referring to the ‘private chapel’. How does that add to the story? \nRelic processions are well documented in the list of ceremonies of the emperors  and in other accounts. These were public displays and different relics appeared on different occasions. The problem we have with de Clari’s account is that despite quite a number of records about the icons/relics of the Church of the Blachernae no one other de Clari ever mentions a shroud. It certainly was not one of the important relics of the city or we would have known of it. As de Clari himself says, nothing more is known of it after the sack. It does not figure in any of the surviving lists of looted relics that Crusaders drew up. De Clari may have been mistaken as to what he saw in the gloom of the church, it may have been destroyed during the looting of the city. Without any documentary evidence to corroborate his account, the question must simply be left open as to whether it ever existed or, if it did, whether it survived the sack of the city. The Church of the Blachernae was after all one of the most vulnerable parts of the city and when one reads ( in Nikoletes Choniatas’ account)  that even the altar of Hagia Sophia was ripped apart by the crusaders ( with marble from Hagia Sophia reappearing in St. Marks!) one must wonder what elsewas lost.\nI am sorry, Max, to be so mundane. The questions I ask are the simple ones!\n\n","date":"September 15, 2012 at 11:56 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16320","author":"Charles Freeman","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"‘Btw can you and /or “all the great professors you admire” explain to me the Turin Sindon image formation process?’\nNo and at present no one else can. Look at the endless arguments on this blog.\nIt is a pity that the Shroud has been so mauled about by people who never had any background in ancient textiles and that samples were removed and left floating around without any conservation laboratory being in charge of how they were disseminated.Two problems follow 1) An enormous amount of knowledge about the Shroud has probably been lost or samples invalidated by the way they have been passed around.Many so called shroud researchers had no specific expertise in ancient textiles- the Shroud of Turin was probably the first ancient textile they had ever handled!!!- or had studied  the way that linen interacts with different substances or they carried out their work in what they themselves called ‘home laboratories’ There are sophisticated textile conservation laboratories around but how much of the shroud research has actually been done in one!\n2) Although with every year that passes, modern scientific techniques are more likely to explain how the image was formed, the Vatican has probably learned its lesson about letting the Shroud out again. I have no doubt that sophisticated analysis using the latest research techniques in one of the world’s top  textile conservation laboratories with expertise in working with ancient linen would help clarify many of the issues over which there are interminable debates by people who have no proper access to the original materials.\n\n","date":"September 15, 2012 at 2:07 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16323","author":"Charles Freeman","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Charles Freeman:\n“Many so called shroud researchers had no specific expertise in ancient textiles….”\nSe refiere quizás a:\n– Virginio Timossi, experto textil que realizó la primera monografía textil en 1933\nó a\n-Gilbert Raes, Director of the Institute of Textile Technology University of Gand (Belgium). A instancias del Vaticano.\nó a\n-John Tyrer, Chartered Textile Technologist, Associate of the Textile Institute and Associate of the Manchester College of Technology.\nó a\n-Gabriel Vial, History Museum of Materials of Lyon\nó a\n-P. H. South ,Precision Process (Textiles) Ltd, Derby. A instancias del Laboratorio de Oxford.\nó a\n-Mechtild Flury-Lemberg, Director of the Abegg Museum of Rigisberg-Berne. A instancias del Vaticano.\nó a\n -Ann Hedlund, Director of the Gloria F.Ross Center for Tapestry Studies. En 2010 y a instancias del director del laboratorio de Tucson y editor de “Radiocarbon”, T.Hull, sobre muestra de 12,39 mg de la Sábana NO QUEMADA en su posesión (¡¡¡¡¡¡¡¡)\nCarlos Otal\n\n","date":"September 15, 2012 at 3:35 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16325","author":"Carlos Otal","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"“Many so called shroud researchers had no specific expertise in ancient textiles…’\nThat is what I said,Carlos, not ‘all’ shroud researchers. For instance, not a single member of the original STURP team had so far as I am aware, and I am happy to be corrected, any expertise in ancient textiles. No preliminary examination of the physical condition of the  Shroud was made in 1978 before a programme of analysis was developed by the external STURP group. ( I blame those who let them in -suppose I wrote to the Director of the Louvre saying that I was a physicist with no knowledge of fifteenth century painting but I wanted access to the Mona Lisa and to be allowed to take samples off the surface- it would be the job of the Director  to tell me to get lost!) The STURP team just arrived and got to down to work under immense time  pressure to get their samples. Whoever heard of a proper programme of analysis working under such conditions! And the STURP team then separated and isolated  the samples from which a lot of the later work was done and we all know what happened when STURP made decisions about who should have them.\nOf course, some experts have worked on the Shroud and have done useful work. Mechtild Flury- Lemberg , for instance, whom you cite, rubbished Ray Rogers on reweaving so this was progress, even if her work is not acknowledged by the Ray Rogers fans. \nMy real point is that with every year that passes we develop new techniques of analysis and if these were applied to the Shroud in proper conditions by experts we are likely to solve the mystery of how the image of the Shroud was made. I am not saying that we will but there has been such progress in all these fields ,even since Flury- Lemberg was working ten years ago, that we can have some confidence that the mystery will be solved along with a more precise dating (as this field also is rapidly developing).\nSo over to the Vatican!\n\n","date":"September 16, 2012 at 4:41 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16331","author":"Charles Freeman","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Charles Freeman:\nTiene usted una idea NO CORRECTA de la actuación del STURP, lo que hace que su comentario sea TENDENCIOSO………. aunque no sea esa su intención.\nEl ” Proceedings of the 1977 United States Conference of Research on the Shroud of Turin”, más de 400 páginas, establecía no sólo el protocolo de actuación ANTE LA SÁBANA, sino variantes o protocolos alternativos, pues en 1977 no conocían el TIEMPO del que iban a disponer.\nEl STURP realizó SIMULACROS previos en los E.E.U.U sobre una RÉPLICA de la Sábana y cada miembro que participó en el estudio en Turín CONOCÍA perfectamente EL TRABAJO\nQUE DEBÍA REALIZAR.\nCarlos Otal\n\n","date":"September 16, 2012 at 5:09 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16334","author":"Carlos Otal","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Carlos. It think it is standard practice to examine a textile such as the Shroud in detail before any work is done on it, just as the Mona Lisa would be examined very carefully before any conservation work was done on it. The older the textile is the more this preliminary analysis is needed because we are dealing with very rare survivals of any cloth (outside Egypt) from before AD 1000 This is to make sure that when you actually touch the fabric you know exactly what harm you are likely to cause. It is also important to have time when in fact 1978 was an enormous rush. There does not seem to any proper scientific procedure for dealing with the samples removed from the Shroud in 1978. Was Walter MacCrone qualified or not qualified to analyse them? If he was not why was he given the job and by whom? How could Ray Rogers be sure of the provenance of his threads in 2003 and how does he know that they were not contaminated between 1988 and 2003? This was not a proper scientific way of going about researching the Shroud. No one was in overall control much of the wrangling would have been avoided if there had been a single TEXTILE  laboratory in charge of the whole process which worked on the samples in-house.\nThe Shroud has to be examined as a whole in laboratory conditions. We are 35 years on from the STURP investigation, 25 years on from the radio-carbon dating. In all the fields associated with the Shroud there have been enormous scientific advances and most ( stress ‘most’ ) of the inconclusive debates I see here still seem to depend on old samples or by people who have never examined the Shroud as a whole. Even if we have to wait another ten years for scientific analysis of the cloth to advance even further, I still think the mystery will eventually be solved. Until then, perhaps an open mind??\nThere are still problems to sort out. Are we sure that the blood on the Shroud and the Sudarium of Oviedo is AB? If so, most blood experts, so far as I can discover but this is not my field, believe that we have virtually no examples of AB before 900 and it really only becomes common with the mingling of Caucasian and Mongoloid groups after AD 1000.\n\n","date":"September 16, 2012 at 10:43 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16346","author":"Charles Freeman","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Charles Freeman:\n”  Si es así, la mayoría de los expertos en la sangre, por lo que he podido descubrir, pero este no es mi campo, creo que tenemos ejemplos prácticamente no antes de AB 900 y que realmente sólo se convierte en común con la mezcla de grupos caucásicos y mongoloides después del año 1000. ”\nLas Propuestas de Tiempo de origen de los Tipos O, A, B y AB del NATURISTA Peter J. D’Adamo NO SON ACEPTADAS en el Mundo Científico ……. Y Sus dietas tampoco.\nNO TIENE Científica y de base is an ESPECULACIÓN Que ha Generado UN GRAN NEGOCIO.\n-“Suponiendo que la constancia de la tasa de evolución, diversificación de los alelos representativos de los tres linajes humanos ABO (A101, B101, y O02) fue estimada de 4.5 a 6 millones de años”. Roubinet, Francis; Despiau, Stephanie; Calafell, Francesc; Jin , Fen; Bertanpetit, Jaume; Saitou, Naruya; Blancher, Antoine (2004). “La evolución de los alelos S del gen humano ABO grupo sanguíneo”.  Transfusion  44  (5): 707-15.\nEste hallazgo contradice directamente la afirmación de D’Adamo de la evolución del tipo de sangre.\n-“Su creencia de que O, A, B, AB y tipo de sangre se originó 30.000, 20.000, 10.000 y 1.000 años, respectivamente, no encaja con la teoría actual de la evolución del gen ABO, tampoco.”  Fumiichiro  Yamamoto.\nhttps://sites.google.com/site/abobloodgroup/appendix-32-abo-blood-type-diets-1\nhttps://sites.google.com/site/abobloodgroup/home\n-“Aunque el tipo de sangre O es común en todas las poblaciones de todo el mundo,  no hay pruebas de que el gen O representa el gen ancestral en el locus ABO. Tampoco es razonable suponer que un gen defectuoso que surgen espontáneamente y luego evolucionar a lo normal genes “. Saitou, Naruya; Yamamoto, Fumiichiro (1997).  ” Evolución de los Primates genes ABO de grupos sanguíneos y sus genes homólogos ” .  Biología Molecular y Evolución \nCarlos Otal\n\n","date":"September 16, 2012 at 1:48 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16349","author":"Carlos Otal","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Carlos. I am not sure  whether I have understood all you have written. I have no time for Peter D’Adamo and his diets -so let us ignore him!\nWe are talking about the specific AB blood group (not ABO). I do not know how secure the classification of the blood on the Shroud is but I am assured that there is general agreement that it is of the relatively rare AB group.\nHere is one  account from a researcher of a particular family grouping.\n‘The blood group AB represents less than 5% of the world’s population. Resulting from unions of European populations of group A and of Mongol population of group B, this group is very “young”, since it has been in existence for only 10 to 15 centuries. The first traces of group AB go back to just about the year 900. Research undertaken in Hungary, from a necropolis dating from the IVth and VIIth century to this date, did not placed any individuals belonging to the AB blood group.’\nOther sources suggest that the mixing of bloods took place when the Hungarians occupied the Carpathian Basin c. AD 900 and that is why you have no record of any evidence of AB blood groups before 900. (Mongoloids (B) also mixed with Indian and far eastern populations (As) which is why you have AB groupings there.)\nThe genetic mutation would have occurred in very few people at first and would only have spread as interaction increased which is why I have read other accounts that we should look at 1000-1100 for the appearance of a larger proportion of the AB blood type in Europe.\nI have no expertise in this field  and I am open to any evidence that AB blood groups existed before 900. I have simply never seen any evidence that they did so I shall stick with the AD 900 date until I am informed otherwise!\n\n","date":"September 16, 2012 at 2:54 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16353","author":"Charles Freeman","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Charles Freeman:\n” If so, most blood experts, so far as I can discover but this is not my field, believe that we have virtually no examples of AB before 900 and it really only becomes common with the mingling of Caucasian and Mongoloid groups after AD 1000.”\nLas propuestas de  tiempo de origen de los tipos  O, A, B y AB  del NATURISTA Peter J. D´Adamo NO SON ACEPTADAS en el mundo científico…….y sus DIETAS tampoco.\nNo tiene base científica y es una ESPECULACIÓN que ha generado  UN GRAN NEGOCIO.\n“Assuming constancy of evolutionary rate, diversification of the representative alleles of the three human ABO lineages (A101, B101, and O02) was estimated at 4.5 to 6 million years ago.”Roubinet, Francis; Despiau, Stephanie; Calafell, Francesc; Jin, Fen; Bertanpetit, Jaume; Saitou, Naruya; Blancher, Antoine (2004). “Evolution of the O alleles of the human ABO blood group gene”. Transfusion 44 (5): 707–15.\n \nThis finding directly contradicts D’Adamo’s assertion of blood type evolution.\n“His belief that O, A, B, and AB blood types originated 30,000, 20,000, 10,000, and 1,000 years ago, respectively, does not fit with the current theory of the evolution of the ABO gene, either.” Fumiichiro Yamamoto, Ph.D\nhttps://sites.google.com/site/abobloodgroup/appendix-32-abo-blood-type-diets-1\n“Although the O blood type is common in all populations around the world, there is no evidence that the O gene represents the ancestral gene at the ABO locus. Nor is it reasonable to suppose that a defective gene would arise spontaneously and then evolve into normal genes”. Saitou, Naruya; Yamamoto, Fumiichiro (1997). “Evolution of Primate ABO Blood Group Genes and Their Homologous Genes”. Molecular Biology and Evolution \nhttps://sites.google.com/site/abobloodgroup/home\nCarlos Otal\n\n","date":"September 16, 2012 at 3:43 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16354","author":"Carlos Otal","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"“Many so called shroud researchers had no specific expertise in ancient textiles…’  I already expressed my opinion about these kinds of critics that we often see versus Shroud science and I think that a good and honest scientist who can get some proper informations from good documentary sources and clever advices from real ancient textile experts can do a very good job of research concerning the textile aspect of the Shroud.  Ray Rogers is the most known example of that.  As a non-expert in ancient textile, he did a proper documentary research before and after the STURP investigation of 1978 (even though we learned recently that the sources he used concerning the ancient use of saponaria didn’t seem to have come from Pliny the Elder who wrote about another washing product made with olive oil and also used in ancient Egypt) and also he knock on the door of some ancient textile experts (like Anna Maria Donadoni who was the conservator at the Turin’s museum of Egyptology) to get proper answers to his questions.  Armed with this new and proper knowledge, he was then able to build a strong case in favor of the authenticity of the Shroud (i.e. that it was a real burial shroud that has enveloped for a short period of time the body of a real crucified man that can well be the historical Jesus of Nazareth).\nI’m sure other scientists over the years have done that kind of research of document and expertise and can do a pretty good scientific job on the textile aspect of the Shroud.\n\n","date":"September 16, 2012 at 5:34 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16360","author":"Yannick Clément","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"\nCarlos Otal :\nDavid Mo:\n1.- En la iconografía, Jesús desnudo NO ES Jesús con perizonium, por muy transparente que éste sea.\n2.- En la iconografía Jesús desnudo ( sin perizonium o similar) y muerto ( bajo, sobre….etc, etc) es extraño, raro, singular o poco frecuente, como quiera denominarlo, en el siglo 13, 14, 15, 16, 17, 18, 19, 20 y lo que llevamos del 21….\n3.-Lo que es CONGRUENTE con la existencia de escasas pero notables excepciones que SI lo muestran desnudo (sin perizonium o similar).\n4.- Esta escasez iconográfica es MÁS notable con anterioridad a 1355.\n5.- Su propuesta “Mesarites uses a normal iconic concept of his time”, es una especulación no fundamentada y muy probablemente FALSA.\nCarlos Otal\n\nIt is useless for you and me to discuss how we consider an almost inexistent and very transparent veil. I don’t recommend to you walk in the street with this “dress”. I think the police has not the same concept of nude than you.  \nI accept your last definition of the problem we are discussing. The naked Christ is not very frequent. I have find 5  pictures of the naked Christ (under, over), 5 with transparent veil and 9 with perizonium in the Enluminures web (1100-1500). Seven more were not clear. You can call it how you wish. I say that the iconic concept of the Naked Christ was not very frequent but normally seen in books of prayer and sermons. \nThe hermeneutics’ Golden Rule is: you don’t need to interpret a text if it is neither absurd nor incoherent. The Mesarites’ reference to a naked Christ under the shroud it is neither absurd nor incoherent. Ergo you don’t need any interpretation. The supposition of a double meaning or veiled allussion in the Mesarites’ words is superfluous.\n\n","date":"September 16, 2012 at 2:38 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16329","author":"David Mo","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"\nYannick Clément :\n“Many so called shroud researchers had no specific expertise in ancient textiles…’  I already expressed my opinion about these kinds of critics that we often see versus Shroud science and I think that a good and honest scientist who can get some proper informations from good documentary sources and clever advices from real ancient textile experts can do a very good job of research concerning the textile aspect of the Shroud.  Ray Rogers is the most known example of that.\n\nYannick:\nTo be an expert in some scientific branch it is not “to make a study”, “to devote many hours” or “to speak with clever expert”. Expert scientists have academic studies, years of experience, an important bibliography and are well recognized by their peers (they work together, are present in academic meetings, conferences, etc.). You can be an expert without some of this features, but not without all of them. \nRogers is the perfect case of non textile expert. He made two “extraordinary findings”. Red color of the blood in the Shroud is due to saponaria. The samples for radiocarbon dating were taken of an invisible mending. He never demonstrates his first hypothesis (never published nothing about). And Mechthild Flury-Lemberg refuted his theory of invisible mending. \nRogers was not an expert and made the typical inexpert mistakes. In STURP there was not an expert textile. They didn’t make any specific previous textile study on the Shroud. And Freeman puts a good example: this is unthinkable for a study of Mona Lisa or similar. No museum director will allow this. This is another example of inexpert ones doing work reserved to expert ones. They made big efforts to concluding nothing worthy. I don’t say this. They are Harry Gove’s words.\n\n","date":"September 17, 2012 at 2:36 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16373","author":"David Mo","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Charles,\nAs a 25-33% reliable-66-75% biased conventional historian as far as your book “the Turin Shroud and the Image of Edessa: A Misguided Journey” is concerned, you do seem to TOTALLY and most self-servingly overlook, underrate or overrate a few data and ‘guide’ the gullible or non-initiated reader. Therefore here are little reminders: \n  1/ (unless of course you totally reject the Robert de Clari’s testimony as pure fiction), in all likelihood the only TRUE ALTERNATIVE we are left with is: \n–EITHER the relic/icon-relic of the ‘sydoine’/sindon bearing the ‘figure’/structural appearance of Yeshua was kept as an emblem of the Byzantine emperor as the earthly representative/vicar of Christ (imperial will is God’s will) in the emperor’s private chapel for private displays INSIDE the Palace of the Blachernae after the 11th c. CE \n(As former hidden palladium of the city of Edessa, it was then translated for public displays OUTSIDE the palace in the Chapel of the Blachernae nearby, in 1203 and 1204 in times of war and great danger “to meet” the icon-relic of the Virgin known as the Blachernitissa, the palladium of the city of Constantinople) \n–OR the relic/icon-relic of the sydoine/sindon of Yeshua (as former hidden palladium of the city of Edessa?) was already housed (as early as 944 CE?) in the latter chapel along with the Blachernitissa (as actual palladium of the city of Constantinople).\n                                                                                                                      (To be continued)\n\n","date":"September 17, 2012 at 9:13 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16392","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"2/ In your book, you used a Holy Face that is part of the Triptych of St. Clare, 1310-mid1330 side panels, Trieste, Civico Museo Sartorio to represent the Mandylion as the Image of Edessa. The only snag is the latter being “positioned between episodes of the Passion (Road to Calvary and the Crucifixion)” can ALSO be implicitly identified with the Holy Veronica that was kept in the Vatican side-chapel from the turn of the 13th c. CE to the sack of Rome in 1527 CE. \n– Could not the Image of Edessa, the Mandylion and the Holy Veronica be one and the same material object? Most curiously, in your quest of the Image of Edessa, you just ignore the evidence/possibility/issue! \n– Now, in all likelihood the Holy Veronica that was kept in the Vatican side-chapel is the Veil of Manoppello. Most curiously, in your quest of the Image of Edessa-Mandylion, you just ignore the high probability and don’t even try to understand its possible connection with the facial imprint of a long rectangular full-body cloth such as the nearly 440cm long and 110cm wide Turin Sindon that can be described as a ‘tetradiplon’ (a quite fitting Byzantine Greek qualitative noun for a 4 x 1 or four times longer than wide fabric in weaver’s and clothier’s technical jargon)\n\n","date":"September 17, 2012 at 12:02 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16399","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Addendum: a 4×1 (nearly 440cm x neartly 110cm in  the meteric system) = a 4x2x2 (in the Assyrian Royal cubit sytem 4x2x2=  444.8cm x 110,4cm)\n\n","date":"September 17, 2012 at 2:29 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16404","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Mistyping: in the metric system ‘a 4×1’ (here a nearly 440cm long and nearly 110cm wide fabric) = ‘a 4x2x2’ in theAssyrian royal cubit system (here a 444,8cm long and 110,4cm wide fabric)\n\n","date":"September 17, 2012 at 2:34 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16405","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"+ mistyping (after work): (in the Assyrian Royal cubit sytem 4x2x2= 444,8cm long and 111,2 wide)\n\n","date":"September 17, 2012 at 2:53 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16406","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"(To becontinued)\n\n","date":"September 17, 2012 at 12:02 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16400","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"Mistyping: don’t even try to understand its possible connection with the facial imprint ON a long rectangular full-body cloth\n\n","date":"September 17, 2012 at 12:07 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-16401","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman","post":"On a jocular note, does anyone else think the stone depiction of Christ crucified between two thieves with the original post rather resembles three dancers throwing up, as it were, “jazz hands”? Caused a giggle for me.\n\n","date":"December 16, 2012 at 3:57 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","id":"comment-20496","author":"Gibson DelGiudice (@twiliteisntlit)","site":"shroudstory"}]
