[{"title":"Davor Aslanovski is right for once","post":"Dear Davor,\nSeriously. Very seriously. Do you entertain the idea that the Shroud was painted?\n\n","date":"July 5, 2012 at 8:13 am","url":"https://shroudstory.com/2012/07/05/davor-aslanovski-is-right-for-once/","cat":"art","id":"comment-13494","author":"John Klotz","site":"shroudstory"},{"title":"Davor Aslanovski is right for once","post":"No, absolutely not. And I never said anything to the effect. Whatever gave you such an idea?\n\n","date":"July 5, 2012 at 9:04 am","url":"https://shroudstory.com/2012/07/05/davor-aslanovski-is-right-for-once/","cat":"art","id":"comment-13495","author":"Davor Aslanovski","site":"shroudstory"},{"title":"Davor Aslanovski is right for once","post":"Davor:\nPues cree usted respecto a la pintura IGUAL que creían los científicos y los expertos del STURP que realizaron el estudio de 1978:\n“No pigments, paints, dyes or stains have been found on the fibrils. X-ray, fluorescence and microchemistry on the fibrils preclude the possibility of paint being used as a method for creating the image. Ultra Violet and infrared evaluation confirm these studies. Computer image enhancement and analysis by a device known as a VP-8 image analyzer show that the image has unique, three-dimensional information encoded in it. Microchemical evaluation has indicated no evidence of any spices, oils, or any biochemicals known to be produced by the body in life or in death. It is clear that there has been a direct contact of the Shroud with a body, which explains certain features such as scourge marks, as well as the blood. However, while this type of contact might explain some of the features of the torso, it is totally incapable of explaining the image of the face with the high resolution that has been amply demonstrated by photography.\nThe basic problem from a scientific point of view is that some explanations which might be tenable from a chemical point of view, are precluded by physics. Contrariwise, certain physical explanations which may be attractive are completely precluded by the chemistry. For an adequate explanation for the image of the Shroud, one must have an explanation which is scientifically sound, from a physical, chemical, biological and medical viewpoint. At the present, this type of solution does not appear to be obtainable by the best efforts of the members of the Shroud Team. Furthermore, experiments in physics and chemistry with old linen have failed to reproduce adequately the phenomenon presented by the Shroud of Turin. The scientific concensus is that the image was produced by something which resulted in oxidation, dehydration and conjugation of the polysaccharide structure of the microfibrils of the linen itself. Such changes can be duplicated in the laboratory by certain chemical and physical processes. A similar type of change in linen can be obtained by sulfuric acid or heat. However, there are no chemical or physical methods known which can account for the totality of the image, nor can any combination of physical, chemical, biological or medical circumstances explain the image adequately.\nThus, the answer to the question of how the image was produced or what produced the image remains, now, as it has in the past, a mystery.\nWe can conclude for now that the Shroud image is that of a real human form of a scourged, crucified man. It is not the product of an artist. The blood stains are composed of hemoglobin and also give a positive test for serum albumin. The image is an ongoing mystery and until further chemical studies are made, perhaps by this group of scientists, or perhaps by some scientists in the future, the problem remains unsolved.” Octubre 1981\n\n","date":"July 5, 2012 at 9:26 am","url":"https://shroudstory.com/2012/07/05/davor-aslanovski-is-right-for-once/","cat":"art","id":"comment-13496","author":"carlos","site":"shroudstory"},{"title":"Davor Aslanovski is right for once","post":"Exactly how many times would it take for me to repeat that I do not believe the image in the Shroud to be a painting before you can finally hear me? Tell me the figure, and I’ll quote myself the necessary number of times… In any case, let’s get it over with.\n\n","date":"July 5, 2012 at 10:35 am","url":"https://shroudstory.com/2012/07/05/davor-aslanovski-is-right-for-once/","cat":"art","id":"comment-13497","author":"Davor Aslanovski","site":"shroudstory"},{"title":"Davor Aslanovski is right for once","post":"Btw, I’m glad to see that Mr Porter CAN take a joke.\n\n","date":"July 5, 2012 at 10:41 am","url":"https://shroudstory.com/2012/07/05/davor-aslanovski-is-right-for-once/","cat":"art","id":"comment-13499","author":"Davor Aslanovski","site":"shroudstory"},{"title":"Davor Aslanovski is right for once","post":"I agree partly, in that I for one would like to hear more from Dan on occasion and on many of the discussions taking place here, as I would think others here would also. What do you say Dan?, a little more input couldn’t hurt!…I for one, enjoy reading your writings anyways.\nR\n\n","date":"July 5, 2012 at 3:53 pm","url":"https://shroudstory.com/2012/07/05/davor-aslanovski-is-right-for-once/","cat":"art","id":"comment-13512","author":"Ron","site":"shroudstory"},{"title":"Davor Aslanovski is right for once","post":"The best joke I realy enjoyed lately  was  Aslanovskipticism applied to the imaged Edessan cloth by an Ultratoxicorthodox/Taliban Roman catholic and how the latter demonstrated his ‘academic’ incompetency to seeing/detecting any evidence of a direct philological, textual, visual and archeo(crypto)logical link with the imaged Turin Sindon…NO WAY Mr DA, you surely will not take me or any of us here  with you to tour once again your  pseudoacademic Deadendlandish Ivory Tower of learned arrogance and ignorance….\n\n","date":"July 5, 2012 at 11:37 am","url":"https://shroudstory.com/2012/07/05/davor-aslanovski-is-right-for-once/","cat":"art","id":"comment-13500","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Davor Aslanovski is right for once","post":"Why not, for a change, use your misused skills to reach the TS icono(crypto)logical truh?\n\n","date":"July 5, 2012 at 11:41 am","url":"https://shroudstory.com/2012/07/05/davor-aslanovski-is-right-for-once/","cat":"art","id":"comment-13501","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Davor Aslanovski is right for once","post":"Can you?\n\n","date":"July 5, 2012 at 11:47 am","url":"https://shroudstory.com/2012/07/05/davor-aslanovski-is-right-for-once/","cat":"art","id":"comment-13502","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Davor Aslanovski is right for once","post":"I think there are already enough self-opionated sites on the web already (the Alkanovskian site might be a case in point).  I like this site the way it is, I think it’s pretty well unique.  I like the postings Dan discovers, and puts them here all in the one place which makes it a dream site for Shroudies.  Pity there’s not more of them. He just lets us all get on with it, sharing our mutual knowledge and ignorance collectively.\nAs for miffed specialists who spend countless hours writing 10,000 word research papers of llitle import, they shouldn’t take themselves so seriously.  They could get a life.  There’s a bigger world out here! \nAn excellent comment by Carlos above, I thought, which puts the case for the Shroud comprehensively and succinctly.\n\n","date":"July 5, 2012 at 4:48 pm","url":"https://shroudstory.com/2012/07/05/davor-aslanovski-is-right-for-once/","cat":"art","id":"comment-13513","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Davor Aslanovski is right for once","post":"Daveb, if you don’t mind me asking, do you consider yourself to be a Christian?\n\n","date":"July 6, 2012 at 2:35 pm","url":"https://shroudstory.com/2012/07/05/davor-aslanovski-is-right-for-once/","cat":"art","id":"comment-13544","author":"Davor Aslanovski","site":"shroudstory"},{"title":"Davor Aslanovski is right for once","post":"Actually DA’s article is a must read as it reflects the Ultraorthodox/zetetic SHORT VIEW of the issue. True Shroud researchers should be more aware about Aslanovskiptiis and their ‘NATURAL’ pseudoinfallibility….\n\n","date":"July 6, 2012 at 5:09 pm","url":"https://shroudstory.com/2012/07/05/davor-aslanovski-is-right-for-once/","cat":"art","id":"comment-13550","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Davor Aslanovski is right for once","post":"DA I did enjpy reading your last post. You proved to be a much better polemist than art historian.\n\n","date":"July 6, 2012 at 5:12 pm","url":"https://shroudstory.com/2012/07/05/davor-aslanovski-is-right-for-once/","cat":"art","id":"comment-13551","author":"Max Patrick Hamon","site":"shroudstory"}]
