[{"title":"Swipe of the Day","post":"Perhaps they weren’t ignorant idiots back then.  That in no way means they completely understood everything.  Architectural marvels in no way correlates to medical scientific understanding as we have it today.\n\n","date":"July 15, 2015 at 7:09 am","url":"https://shroudstory.com/2015/07/15/swipe-of-the-day/","cat":"art","id":"comment-205834","author":"Dcn Andy","site":"shroudstory"},{"title":"Swipe of the Day","post":"There’s much more in medieval cathedrals than meets the eye.\n\n","date":"July 15, 2015 at 7:33 am","url":"https://shroudstory.com/2015/07/15/swipe-of-the-day/","cat":"art","id":"comment-205840","author":"Louis","site":"shroudstory"},{"title":"Swipe of the Day","post":">A well known book is ‘Le Mystère des Cathédrales’\nwritten in 1929 by Fulcanelli (1839 – 1953), the mysterious\nFrench alchemist who was one of the first to write about\nthe mysteries surrounding the French cathedrals.\n>According to Fulcanelli a cathedral is an\nalchemical book written in stone. …\nLink:\nhttp://www.soulsofdistortion.nl/The%20mystery%20of%20the%20Cathedrals.html\n>The Gothic cathedral architecture originated in France in the early 12th century during the heydays of the Knights Templar.\n>The Knights Templar officially called the ‘Poor Fellow-Soldiers of Christ and of the Temple of Solomon’ formed a knight’s order of priests who protected the pilgrimage routes to Jerusalem.\n>The order was founded in 1118 by Hugo van Payens who managed to team up nine brave knight-priests. This group of nine knights became to be one of the richest and most powerful groups in history.\n>With their huge wealth, collected from financing the crusades, they were able to build the Gothic cathedrals in Europe. … etc. …\n—- —\nHere another clue:\n>…  the key to the major Arcanum is given quite openly in one of the figures, illustrating the present work. And this key consists quite simply in a colour revealed to the artisan from the first work. No Philosopher, to my knowledge, has emphasized the importance of this essential point. In revealing it, I am obeying the last wishes of Fulcanelli and my conscience is clear.\nhttp://shadowtheatre13.com/mysterycathedrals.html\nI am joking!…\nSee also:\n>… Anyone with knowledge of the alchemical books of the past will accept as a basic premise that oral instruction from master to pupil is the most valuable of all.  Fulcanelli received his own initiation in this way, as I myself received mine from him, although I owe it to myself to state that Cyliani had already opened wide for me the great door of the labyrinth that week in 1915, when the new edition of his little work was published. …\nSorry. I am joking!…\n\n","date":"July 15, 2015 at 10:47 am","url":"https://shroudstory.com/2015/07/15/swipe-of-the-day/","cat":"art","id":"comment-205860","author":"piero","site":"shroudstory"},{"title":"Swipe of the Day","post":"Alchemy is represented by a woman, in Paris…\nI am joking!…\n>Fulcanelli nous indique, dans son Mystère des cathédrales : “l’alchimie y est figurée par une femme dont le front touche les nues. Assise sur un trône, elle tient de la main gauche un sceptre, – insigne de souveraineté, – tandis que la droite supporte deux livres, l’un fermé (ésotérisme), l’autre ouvert (exotérisme). Maintenue entre ses genoux et appuyée contre sa poitrine se dresse l’échelle aux neuf degrés, scala philosophorum, hiéroglyphe de la patience que doivent posséder ses fidèles, au cours des neufs opérations successives du labeur hermétique .”\n>A sa  gauche une femme élève un matras. Il contient la quintessence des plantes, les digitales situées dans son dos, plantes toxiques. C’est un mal dont l’art peut extraire un bien. A droite, l’autre femme tient un astrolabe, instrument d’astronomie. Le point commun de ces trois figurations est de permettre de manifester l’invisible, que ce soit en possibilité de nature ou en compréhension de lois subtiles.\nHere a rough translation:\n>Fulcanelli tells us, in his Mystery of the cathedrals. “Alchemy is represented by a woman whose forehead touches the clouds Sitting on a throne, she holds in his left hand a scepter, – insignia of sovereignty – while right supports two books, one closed (esotericism), the other open (exoteric). Maintained between his knees and leaning against his chest rises across nine degrees scala philosophorum hieroglyph patience required of her faithful, during successive operations of the new hermetic labor. ”\n>To his left a woman raising a flask. It contains the quintessence of plants, located finger in his back, poisonous plants. It is an evil whose art can extract property. On the right, the other woman holds an astrolabe, astronomical instrument. Common to these three representations is to manifest the invisible, whether in kind or ability to understand subtle laws.\nLink:\nhttp://hermetism.free.fr/Alchimie.htm\nDo you know two works of Fulcanelli ? \n>His works are the “Mystery of the cathedrals” (see the photography of the original edition) and the “Dwellings of the philosophers”, published between the years 1926-30 and after published again regularly by Jean-Jacques Pauvert…\n>Fulcanelli shows that alchemy, before printed on paper, was engraved on the stone books that are the walls of certain cathedrals or castles. We go today discovering these paper and stone books.\nLink:\nhttp://hermetism.free.fr/indexUS.htm\n\n","date":"July 15, 2015 at 11:03 am","url":"https://shroudstory.com/2015/07/15/swipe-of-the-day/","cat":"art","id":"comment-205861","author":"piero","site":"shroudstory"},{"title":"Swipe of the Day","post":"St Bernard who’s Abbey was 15 K. From my Degruy ancestors chateau in the Orient Forest (locus of le Ray (Lirey) Shroud of Turin Chapel) was the intelligence behind Chartres and Notre Dame Cathedrals and the most admired man of his time . The Grand Orient Lodge of the Freemasons originated in the neighboring from de Gruy Chateau which is fitting because the Knights Templars originated in this Orient Forest. This neighboring Chateau Vendeuvre sur Barth was owned by the Duke of Luxembourg in exile and general Montmorency (close friend of our ancestor count Michael de Gruy(ere) and his cousin King Francois I) / our DeGruy Chateau Magny Fouchard was very old and because the Count of Gruy(ere)’s mother was a Vergy (shroud owners from de Ray) I believe this explains their presence in the Orient Forest. (Their original Castle / Chateau is in Switzerland at Gruyere’s and they were the first Knights over the walls of Jerusalem in the first crusade explaining their friendship with Othon de La Roche de Ray importer of the Shroud to deRay Castle at Ray sur Saone in Burgundy…Hugh de Payens head of the Knights Templars (Gruy were Templars) lived west of Troyes (Orient Forest) and was also friends of the Count de Gruy(ere) / it is important that general deGaulle retired near Clairvaux Monastery and the de Gruy Chateau as he was very devoted to the Merovingian kings (Dagobert) and considered restoring France to that heritage ( he flew the Templar Flag of Lorraine and a 50 ft high cross of Lorraine was erected near his house after he died / Fulcanelli was the owner of “the Bookshop of the Marvelous ” in Paris where all the Alchemists met plus my DeGruy ancestor who studied medicine in Paris and whose Foucher wife related him to Victor Hugo’s Foucher wife and we know Hugo saved Notre Dame Cathedral from destruction w/ his “Hunchback” books popularity ….\nFor those interested in my family history in the Orient Forest please see my daily Blog… /eugenerayarchitect.blogspot.com….ALSO you can google my past blogs via subject such as EUGENE RAY / SHROUD OF TURIN….EUGENE RAY / FULCANELLI  etc! etc\n\n","date":"July 15, 2015 at 2:51 pm","url":"https://shroudstory.com/2015/07/15/swipe-of-the-day/","cat":"art","id":"comment-205896","author":"Eugene Ray","site":"shroudstory"},{"title":"Swipe of the Day","post":"The same country , the US, can get a craft to Pluto and also be the home of a mass of creationists.\nIn the Middle  Ages they could build a Gothic cathedral and still turn up to Orleans to be given a cup of wine left over from the marriage feast of Cana.\n\n","date":"July 15, 2015 at 3:11 pm","url":"https://shroudstory.com/2015/07/15/swipe-of-the-day/","cat":"art","id":"comment-205898","author":"Charles Freeman","site":"shroudstory"},{"title":"Swipe of the Day","post":"So Charles there is no irrationality in the modern world? Homeopathy is pretty popular, is it not?\n\n","date":"July 16, 2015 at 2:41 am","url":"https://shroudstory.com/2015/07/15/swipe-of-the-day/","cat":"art","id":"comment-205923","author":"Thomas","site":"shroudstory"}]
