[{"title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame","post":"This is an excellent observation by Stephen. It’s only one small item, but it adds to the accumulation of items that combine to make a plausible conclusion. Some items of circumstantial evidence kick you in the face: the husband of the woman shot to death had powder burns on his hand. This is a slight piece of evidence but when it combines with all the other circumstance it is more than intriguing.\nOkay all you Occam maniacs. is there a simpler solution as to why the support is slanted and the slanted support became an Byzantine convention?\nPerhaps Charles freeman can give us some background on the slanted foot piece. How  common is it in crucifixion paintings and was limited to Byzantium art  or did it spread? Can its use be traced?\nI am seriously interested in this detective story.\n\n","date":"February 6, 2014 at 9:16 am","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","id":"comment-77001","author":"John Klotz","site":"shroudstory"},{"title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame","post":"Thanks John. I have since added a section on the complementary “Byzantine curve,” which like the Russian Orthodox cross, also is based on the strange belief that one of Jesus’ legs was shorter than other, and also originated in Constantinople in the 10th/11th century. \nThe simplest explanation that fits both facts (i.e. Occam’s razor) is that the origins of the Russian cross’ strange inclined footrest based on the belief that Jesus’ left leg was shorter than his right, and the “Byzantine curve”‘s strange curved body of Jesus on the cross to compensate for his unequal length legs being nailed at the same level, is that the full-length Shroud was known in Constantinople from at least the 10th/11th century!\n\n","date":"February 6, 2014 at 9:45 am","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","id":"comment-77009","author":"Stephen E. Jones","site":"shroudstory"},{"title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame","post":"‘folded eight times in the form of the Mandylion portrait’.\nThis certainly needs clarification. Does he mean eight fold?- in other words the THREE double foldings that are need to achieve eight sections as Wilson illustrates them but without any explanation from Wilson as to how tetradiplon can mean three rather than four doublings? \nWe really do need to clear up the confusing picture Wilson leaves on this, As is well known I think ‘tetradiplon ‘ used only of the cloth BEFORE it was unfolded in front of Jesus has a completely different significance ( it ties in with the tetradiplon folding used in ceremonies such as the Panathenaia festival and is this a means of giving the cloth Jesus used status before he used it) . Again Wilson is confusing in suggesting that  the cloth was folded ‘tetradiplon’ AFTER it had the face of Christ on it .\nI have no particular background on the slanted crucifixion foot piece. It will mean working through Schiller’s massive book on Christian iconography to see if it is standard iconography. A quick look- the earliest I see in Schiller is a ROMAN example, a wall painting  that is dated to 750 that does have a shorter left leg (illus 328). The famous Byzantine example from Mount Sinai of roughly the same date shows equal lengths of legs and a level board. All the Byzantine ones Schiller illustrates have a stable board so that seems to be the norm in the east but I am not an expert on this.\nIncidentally, if this is relevant  and the Rome crucifixion depiction IS taken from the Shroud this would add to the possibility that the Shroud might have come to the west early. After all the Roman crucifixion scene is roughly the same date that  the relic collection with relics from the Lord’s Tomb arrived in northern France! Wilson builds theories on less evidence than this!\n\n","date":"February 6, 2014 at 9:50 am","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","id":"comment-77011","author":"Charles Freeman","site":"shroudstory"},{"title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame","post":"Anyone want to have a go at explaining how Wilson’s illustrated three doublings equates with tetradiplon.e.g  FOUR doublings? If no one can provide a solution, I will assume that Wilson is being misleading here but I am open to hearing the other side of the story.\nWe simply need someone to provide a sequence of the doublings. As I see it four doublings ends up with a cloth divided into sixteen sections and this would cut across the face of the Mandylion.\nAs there is no evidence in the account (only in Wilson’s version of it in The Shroud, 2010, p.190-1) that the cloth was folded tetradiplon AFTER Christ wiped his face with it, I see no reason to follow Wilson and others on this anyway but I am happy for his case to be presented by those who support it.\nWilson’s interpretation of the Acts of Thaddeus is as follows ” Although its initially off-putting aspect is that it ‘explains’ the creation of the Image as by Jesus washing himself [off-putting indeed, for some, fairly conclusive perhaps for others], it intriguingly GOES ON [thus Wilson gives the impression that this is AFTER Christ has washed his face]to describe the cloth on which the Image was imprinted as tetradiplon- ‘doubled in four'”\n‘Doubled in four’  seems an odd translation as the more normal translation if one compares this to other uses of ‘tetra’ in Greek would be ‘doubled four times’, but possibly ‘doubled so as to make four sections’. ‘Doubled in four’ makes no sense to me at all- especially as Wilson’s illustration labelled ” ‘Tetradiplon’ or doubled in four’ shows a cloth doubled only three times.\n\n","date":"February 7, 2014 at 5:08 am","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","id":"comment-77198","author":"Charles Freeman","site":"shroudstory"},{"title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame","post":"You must think like a BYZANTINE.  TETRA = four; DIPLA = doubled.  Now if you fold a paper in half, you have two halves.  If you fold it again, you have four; but if you fold the whole thing once more, you have eight.  It is Exponential.  Very simple.  Observe the act. There it is.  Once unfolded, there are Eight sections.\nDo this with the length of the Shroud, and the Face appears on the top 1/8th.  This longitudinal arrangement, rather than the standard vertical setting of a portrait, is ally testified to by Byzantine art.\n\n","date":"February 7, 2014 at 11:58 am","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","id":"comment-77278","author":"Christopher Kelley","site":"shroudstory"},{"title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame","post":"Christopher Kelley ‘ Now if you fold a paper in half [FIRST FOLD], you have two halves. If you fold it again[SECOND FOLD], you have four; but if you fold the whole thing once more [THIRD FOLD], you have eight.’\nYes, but aren’t’ we meant to have FOUR (‘tetra’) foldings- as on the Panathenaic cloth illustrated on the Parthenon frieze (in the British Museum) where the four doublings can actually be picked out?\n\n","date":"February 7, 2014 at 12:23 pm","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","id":"comment-77287","author":"Charles Freeman","site":"shroudstory"},{"title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame","post":"You must think like a ‘Roman’ Byzantine.  If there are eight sections, that’s Tetradipla.  Try folding it like an accordion, then count.  But think Byzantine!\n\n","date":"February 7, 2014 at 8:02 pm","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","id":"comment-77359","author":"Christopher Kelley","site":"shroudstory"},{"title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame","post":"No matter what the author of the Acts of Thaddeus must have had in mind when he used the term “tetradiplon” in his text, this cannot have been a “subtle” way for him to talk about a long burial shroud of more than 4 meters long folded in 8 parts for the very simple reason that was already underlined months ago by M. Freeman, i.e. that in a later part of the same manuscript, the author make a specific mention of the burial cloths that were found in the empty tomb and it’s evident that, for him (as well as for St John Damascene and various eye-witnesses who saw the Mandylion in the Pharos Chapel in Constantinople and for all the Byzantine artists who saw the Mandylion), those burial cloths had nothing to do with the “tetradiplon” cloth he mentioned earlier in his text and that was used by Jesus to wash his face, thus producing a miraculous imprint on the cloth.  \nThis is as much evident as the nose in anyone’s face for anyone with a bit of judgement, unless you’re totally biased in favor of Wilson’s crazy ideas.  Really, I don’t know how can someone honest can read the totality of the Acts of Thaddeus and come up with the conclusion that the term “tetradiplon” used by the author was a subtle way to described the cloth as a long burial shroud folded in 8.\nThis “tetradiplon” controversy is a very good example of how poor Wilson’s historical work really is concerning the Shroud’s potential ancient past.\n\n","date":"February 7, 2014 at 4:17 pm","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","id":"comment-77323","author":"Anonymous","site":"shroudstory"},{"title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame","post":"And it’s also true the other way around: once you read the totality of the Acts of Thaddeus, it’s evident that the “tetradiplon” cloth used by Jesus to produce a miraculous imprint of his face had nothing to do with a burial cloth.  Note also that the miracle happen BEFORE the Passion, at a moment where Jesus was teaching and had no bloodstains or bruises on his face.  If the author of the Acts of Thaddeus had some notion of the true burial nature of the Mandylion, no doubt he would have made some kind of connection between this “tetradiplon” cloth and one of the burial cloth that was found in the empty or with the story of the Passion and/or death and/or entombment of Christ.  The truth is: there is absolutely no connection of this kind in the text.  Period.\n\n","date":"February 7, 2014 at 4:23 pm","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","id":"comment-77326","author":"Anonymous","site":"shroudstory"},{"title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame","post":"I am sorry, Christopher, I don’t buy it. If Wilson makes this case he needs a Byzantine scholar to back him. Until then I shall continue to argue that, so far as I am concerned , he is highly misleading.The lines are still open for anyone who can provide support for Wilson.\nWe know that in the Greek world the most prestigious cloth of all, the cloth that was taken up to the Acropolis in the Panathenaic festival that was attended by Greeks from all over and went on until the fourth century AD was folded double four times. If you are in the British Museum you can go and see it on the sculptures and it is so beautifully sculpted that one can count the double folds, four of them. My guess, and it is only a guess, is that this form of folding linked to this prestigious festival meant that a tetradiplon cloth had a special significance and this is why the Acts of Thaddeus say that the cloth as PRESENTED to Jesus (but contra to what Wilson suggests was never said to have been refolded as such, any more than the Panathenaic cloth would have been refolded after it had fulfilled its ritual function) as tetradiplon. It is a much more likely explanation than anything Wilson can offer. \n‘Anonymous’ has, of course, made the other point that Wilson conceals from us , that there is a totally separate mention of Christ’s burial cloths in the very same text so whoever wrote the Acts knew that there was the Image of Edessa and the burial cloth as separate items.\nOf course, nothing in this says anything either way about the authenticity of the Shroud as we have it today so that is not the issue there. I stick to my thesis that ,IF the Shroud were authentic, the most likely route to Lirey would have been with the relics known to have come direct to northern France, including some from the ‘Lord’s Tomb’, in the second half of first millennium.\n\n","date":"February 8, 2014 at 4:22 am","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","id":"comment-77428","author":"Charles Freeman","site":"shroudstory"},{"title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame","post":"P.S. If we are putting forward the hypothesis that the iconography of Christ is taken from the Shroud, then as Paul Zanker has argued in his The Mask of Socrates (you can actually track down the text with illustrations online), the earliest representations of Christ with a beard are not in the east but in Rome. So if the short left leg is important and we see it also first in Rome c.750, I think I am building up a credible thesis that the Shroud came into the west quite early on. \nI still think that likelihood of the Shroud being authentic is small but here at least is a thesis that does not contradict its authenticity.\nIt’s a long haul weaning people off Wilson’s hypothesis but I think it is important to stress that there are alternative and more plausible ways of showing how the Shroud if it were authentic could have ended up in Lirey. I think it is a pity that there are so many people with a genuine commitment to the authenticity of the Shroud who  are not prepared to do any further research on it or, after all these years, spot the serious inadequacies of the Wilson thesis. I still have no idea what he means by ‘double in four’ when he shows a cloth doubled into eight, but he was using this meaningless phrase as early as 1974 and he is still using it. Has no one ever challenged him to explain what he means? Perhaps they will in Melbourne. \n If you pass by Wilson completely it does not necessarily mean that the the Shroud is not genuine!\n\n","date":"February 8, 2014 at 5:54 am","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","id":"comment-77440","author":"Charles Freeman","site":"shroudstory"},{"title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame","post":"Quote from M. Freeman: “the earliest representations of Christ with a beard are not in the east but in Rome.”\nMy comment:  You’re right about that but if the Shroud has likely been the model (direct or indirect) for the Pantocrator type of icon (early 6th century and possibly a bit before that time), I seriously doubt it if the same thing for the few bearded Christ frescos that have been found in the catacombs of Rome.  On that subject, there are 2 things that make me think like this:  1- At that time (3th or 4th century A.D.) in Rome, the most common figure of God was a man with long hair and long beard (like Zeus and other great divine figures), so it is highly probable that those pagan depictions of God have been used to represent Christ at a time when no one knew what he looked like (which make me think the Shroud was still well hidden somewhere at that time).  And 2- There is not one of these bearded Christ frescos that show as many points of congruence as we found in most Pantocrator-like icons, which make me think the first depictions (the Roman frescos) were not based on the image we see on the Shroud, while it is the contrary for the Pantocrator-like icons.\n\n","date":"February 8, 2014 at 9:52 pm","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","id":"comment-77613","author":"Anonymous","site":"shroudstory"},{"title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame","post":"This is indeed a fascinating new wrinkle. It seems more than odd this legend of a lame/short-legged Jesus. My understanding is that the early church tended to go the opposite way and portray Jesus, the Christ, as a perfect human specimen (so too his mother). To then suggest that the Great Healer was himself lame and physical imperfect is counter-intuitive, to put it mildly. It would have had to based on some form of physical evidence.\nBut there are folks here better read on this subject who hopefully can correct me if I’m wrong. Is the legend itself verifiable, or is it a legend about a legend?\n\n","date":"February 6, 2014 at 10:31 am","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","id":"comment-77020","author":"David Goulet","site":"shroudstory"},{"title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame","post":"Certainly the tendency was to suggest Jesus was perfect as a human being and I don’t know of any depiction or legend that talks of him being deformed. You can’t really say that the crucifixion scene I quoted from Rome shows him deformed. Later, of course, from the thirteenth /fourteenth century, there is a stress on his wounds/blood but these always appear to have been inflicted on a body that was otherwise healthy.\n\n","date":"February 6, 2014 at 12:13 pm","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","id":"comment-77038","author":"Charles Freeman","site":"shroudstory"},{"title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame","post":"Charles Freeman knows what I mean by the shorthand “folded eight times”. But nevertheless I have added a footnote to explai: “34. That is “doubled in four” [Greek tetradiplon]. “Doubled then doubled twice again (thus making 4 X 2 folds)” (Wilson, I., 1974, “The Shroud in history,” The Tablet, 13th April, p.12.”\nGoogle “Russian orthodox cross” and select “Images” and you will see a great many images of a cross with a slanted footrest. \nThe “Byzantine curve” is more obscure, which is one reason I initially left it out. But Barnes (1934) and Petrosillo & Marinelli (1996) mention it, as referenced.\n\n","date":"February 6, 2014 at 10:47 am","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","id":"comment-77021","author":"Stephen E. Jones","site":"shroudstory"},{"title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame","post":"“Doubled then doubled twice again (thus making 4 X 2 folds)” Well, I make that three times 2 folds. Wilson only shows three double folds: the first doubling makes 2 sections, the second doubling four sections, the third doubling eight sections and this is what Wilson shows.   Perhaps Stephen Jones can explain what he thinks I know but don’t know. Perhaps he can go step by step through the doublings as he sees them.\nThe word Tetradiplon is unknown anywhere else ( except that it is exactly how the famous Panathenaic cloth was folded). The prefix ‘tetra’ on the other hand, is very common – at least 150 examples in a standard Greek dictionary such as Liddel and Scott. We can see that the most likely meaning when compared to other examples of the use of ‘tetra’ is four doublings but it could possibly mean doubled so as to make four (not eight) sections.\nIf Stephen can start by taking us through his doublings one by one, then that would be a start.\n\n","date":"February 6, 2014 at 12:03 pm","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","id":"comment-77032","author":"Charles Freeman","site":"shroudstory"},{"title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame","post":">But there is just a bit too much ‘presumably’ – ‘and if its strange inclined cross’ – ‘it must date from’ – language of speculation to make me comfortable. To his credit Stephen uses this cautionary language and doesn’t carelessly make it sound like fact.\nSo Dan doesn’t like it if I say “presumably” because it is the “language of speculation”, But Dan also doesn’t like it if I “make it sound like fact”! So since I am `damned if I do and damned if I don’t’ by Dan, I will ignore him and post what seems right to me.\nThe “must date from” is actually what Barnes says, as referenced:\n“This form of the Cross is quite universal among all Russians and must date from the time of the national conversion …. Now the missionaries who originally converted the Russians, somewhere about 988, came from Constantinople,” (Barnes, A.S., “The Holy Shroud of Turin,” Burns Oates & Washbourne: London, 1934, pp.65,66).\n\n","date":"February 6, 2014 at 11:07 am","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","id":"comment-77023","author":"Stephen E. Jones","site":"shroudstory"},{"title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame","post":"First Stephen, you quote me, “But there is just a bit too much ‘presumably’ – ‘and if its strange inclined cross’ – ‘it must date from’ – language of speculation to make me comfortable. To his credit Stephen uses this cautionary language and doesn’t carelessly make it sound like fact.”\nThen you write, “So Dan doesn’t like it if I say “presumably” because it is the “language of speculation”, But Dan also doesn’t like it if I “make it sound like fact”! So since I am `damned if I do and damned if I don’t’ by Dan, I will ignore him and post what seems right to me.”\nBy comfortable I mean convinced. I like the way you wrote it. Wording is perfect. There is nothing wrong with my not being comfortable or convinced. That is not a reflection on what you wrote or how you wrote it. I’m sorry if I wasn’t clear enough.\n\n","date":"February 6, 2014 at 2:09 pm","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","id":"comment-77052","author":"Dan","site":"shroudstory"},{"title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame","post":"Putting “Jesus was lame” into Google suggests that the idea first appears in the Talmud. There is also a Greek tradition (e.g. Odysseus) of the crippled hero.\n Other interpretations of the suppedaneum is that it is a balance (sheep up – goats down). This site has a bit to say about it: “http://www.sacredmint.com/wall-hanging-byzantine-cross.htm.”\nFor what it’s worth I don’t think one leg looks longer than the other anyway. Being crossed left over right simply means that one foot is missing, which is not the same as having a shorter leg, and I don’t think that iconographers would think any different. What’s more, as the frontal image shows the bloody top of the left foot, but no right, and the dorsal image shows the bloody bottom of the right foot,but no left, a different leg appears longer on each image.\nFinally, what happened when rigor mortis wore off? Had the image formation finished by then, or did the feet just naturally stay balanced on top of each other?\n\n","date":"February 6, 2014 at 11:18 am","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","id":"comment-77026","author":"Hugh Farey","site":"shroudstory"},{"title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame","post":"The Odysseus connection is a stretch. I’ve heard some modern kids say ‘Jesus is lame’  but obviously in a different context.\nAnyone else concur with Hugh…that the legs on the Shroud look the same length and no ancient iconographer would have reason to think otherwise?\n\n","date":"February 6, 2014 at 11:31 am","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","id":"comment-77027","author":"David Goulet","site":"shroudstory"},{"title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame","post":"What’s more, a quick review of early Byzantine crucifixes suggests that the suppedaneum got its shape not because it was tilted, but because it was an attempt at perspective, so that the feet could be shown flat. Most early crucifixes have a rhomboid or trapezoid suppedaneum, with the longest edges horizontal. Only later did the long edges acquire a slant of their own, and the shorter edges, sometimes but sometimes not, become vertical.\n\n","date":"February 6, 2014 at 11:33 am","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","id":"comment-77028","author":"Hugh Farey","site":"shroudstory"},{"title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame","post":"Yes, this seems to fit with the images that Schiller shows.\n\n","date":"February 6, 2014 at 12:05 pm","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","id":"comment-77033","author":"Charles Freeman","site":"shroudstory"},{"title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame","post":"David: My understanding is that the early church tended to go the opposite way and portray Jesus, the Christ, as a perfect human specimen (so too his mother). To then suggest that the Great Healer was himself lame and physical imperfect is counter-intuitive, to put it mildly. It would have had to based on some form of physical evidence.\nContrary:\nHe had no beauty or majesty to attract us to him,\n    nothing in his appearance that we should desire him. -Is 53:2 (NIV)\nBased on this verse, some of the Church Fathers maintained that Jesus was looking ugly, he was lame, unattractive and so on -thus he shouldn’t be portayed. They argued that not his look, but his message is something one should concentrate on. Only later the approach was changed, as it was understood that this verse depicts Christ during His Passion.\nHugh: Only later did the long edges acquire a slant of their own, and the shorter edges, sometimes but sometimes not, become vertical.\nAnd the question is WHY? Remeber, there were strict rules in painting icons, and no room for experiments.\nOther interpretations of the suppedaneum is that it is a balance (sheep up – goats down).\nAll those interpretations are most likely later inventions, trying to give answers (and some theological meaning) to principal question: WHY? Because it makes rather little sense from rational analysis. Only if basing on some higher authority it is understandable.\nAnyway the beginings of this strange feature seem to be shrouded in mystery!\n\n","date":"February 6, 2014 at 11:59 am","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","id":"comment-77029","author":"O.K.","site":"shroudstory"},{"title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame","post":"‘And the question is WHY? Remeber, there were strict rules in painting icons, and no room for experiments.’\nThat is simply not true.. I lectured on Byzantine icons for an hour on a study day the week before last and one of my key points was the way that standard themes, the Virgin and Child, the Annunciation, etc, were shown differently by different icon painters\n\n","date":"February 6, 2014 at 12:07 pm","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","id":"comment-77034","author":"Charles Freeman","site":"shroudstory"},{"title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame","post":"But this is not a minor diference, it is a revolution!\n\n","date":"February 6, 2014 at 12:11 pm","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","id":"comment-77036","author":"O.K.","site":"shroudstory"},{"title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame","post":"It starts with a minor differerence; horizontal lines become slanted. It only much later becomes an element in the “what did Christ look like?” debate.\n\n","date":"February 6, 2014 at 12:40 pm","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","id":"comment-77043","author":"Hugh Farey","site":"shroudstory"},{"title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame","post":"The question of what lame meant may be important. If Jesus was able to heal a man born blind, paralytics, etc. then it doesn’t make sense that he could not heal his own lameness — unless that lameness was a physical abnormality that was not linked to punishment for sin. Also as you noted the idea of Christ-perfect comes later on — but don’t most of the Byzantine icons come from this later period, not the Church Father period?\n\n","date":"February 6, 2014 at 12:11 pm","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","id":"comment-77035","author":"David Goulet","site":"shroudstory"},{"title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame","post":"Researching via Google for references to the shorter leg observation, one only finds links to Shroud sites. The lame-Jesus idea does go back to the Talmud. But where does the short leg observation first develop? The slanted suppedaneum, as Hugh suggests, is not evidence enough.\nIt appears to be only Shroudies, not ancient Byzantines, who see a shorter leg. Is there evidence outside of modern Shroud circles that shows Jesus with a shorter leg? If so, then I’d be more inclined to believe that early witnesses of the Shroud also deemed one leg shorter. Keep in mind they didn’t have a Shroud 2.0 app to work with so perhaps from their point of viewing one leg could look shorter.\nThere are a lot of presumptions here, as Dan rightly cautioned about.\n\n","date":"February 6, 2014 at 12:02 pm","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","id":"comment-77030","author":"David Goulet","site":"shroudstory"},{"title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame","post":"For what it’s worth, I found this on two websites discussing Orthodox icons:\n# 1: “Various reasons have been given for slanting the bottom bar. There is one tradition which states that, at the moment of His death, Our Lord’s foot slipped and the footrest tilted. A highly symbolic interpretation states that the slanted bar refers to the thief crucified on Our Lord’s right side—the “Wise Thief” who repented—who went to heaven and to the unrepentant thief crucified on Christ’s left side who did not. Another explanation is that the slant is an attempt to depict that the footrest slanted downward, toward the viewer, albeit in a two, rather than three, dimensional form.”\n#2: “The foot-rest of Christ’s Cross is slanted because it is believed that in the final moments before Jesus gave up His spirit, His flesh spasmed and the foot-rest was kicked out of place. But in this true event there is also symbolism. The foot-rest points up, toward Heaven, on Christ’s right hand-side, and downward, to Hades, on Christ’s left. One of the Orthodox Church’s Friday prayers clearly explains the meaning:  In the midst, between two thieves, was Your Cross found as the balance-beam of righteousness;\nFor while one was led down to hell by the burden of his blaspheming,\nThe other was lightened of his sins unto the knowledge of things divine.\nO Christ God glory to You”\n\n","date":"February 6, 2014 at 3:34 pm","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","id":"comment-77062","author":"Kelly Kearse","site":"shroudstory"},{"title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame","post":"Those are, of course, later interpreatations.\nThe truth is no one knows why the bar is slanted.\n\n","date":"February 6, 2014 at 3:40 pm","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","id":"comment-77064","author":"O.K.","site":"shroudstory"},{"title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame","post":"I learn something here every day.  Thanks Stephen, Kelly, Dan, everyone who comments.\n\n","date":"February 6, 2014 at 3:47 pm","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","id":"comment-77067","author":"Paulette","site":"shroudstory"},{"title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame","post":"Once again we see stale material about the shorter leg being posted as though it has been noticed only now. The Talmud should be used with care and circumspection.\n\n","date":"February 6, 2014 at 4:35 pm","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","id":"comment-77074","author":"Louis","site":"shroudstory"},{"title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame","post":"The great Russian iconographer, Leonid Ouspensky, was convinced the Shroud of Turin was NOT the burial cloth of Christ BECAUSE the left leg appeared shorter, making Christ lame.  I have this directly from one of his students in Paris, under whom I studied.  I took her, very much a doubter, to a film on the Shroud in London; at the end of the film, she declared, “Ouspensky must have been wrong!”\nLook earlier than the conversion of Russ, in 988.  Sts Cyril & Methodios, the Apostles to the Slavs, carried this Cross with them.  They grew up, secretly Orthodox, in Thessaloniki during the reign of the Iconoclasts.  Thereafter, having lived among Slavs in their native city, and conversant in Slavic, they set out for the Slavs’ homelands, bearing a zeal for Orthodoxy, and the Triumph of Orthodoxy over the Iconoclast heresy.  That heresy carried a profound misunderstanding or disregard for the Incarnation.  815 began a second stage of Iconoclasm, mild and “liberal” at first, but increasingly severe and tyrannical, in Cyril & Methodios’ youth.  Yet, by a sudden turn of events, the Triumph of Orthodoxy was achieved in 843.\nThis design of the Cross is PRIOR TO the arrival of the Mandylion /Image of Edessa (Shroud of Turin) in Constantinople.  The Image of Edessa was “the Prize” to be brought to the Imperial City for the Centennial of the Triumph; the Emperor desired to have it by 943.  But it took longer to secure from Edessa (Urfa), so it came a year late, 944, and was first displayed to the public on August 16, when it is still annually commemorated.\nHowever, at its arrival, the Cloth was still pinned to a board, folded in such a way that only the Face was visible, as had been characteristic of the Mandylion in Edessa.  It may have been as late as 1025 that the Cloth was first unpinned, and the full length of the Shroud seen in Constantinople — well after 988.  (We do see ikons changed as a result of this disclosure; eg., “Weep not for Me, Mother” – illustrating the Ode for Holy Saturday morning.)\nIF it was Christ’s LEFT leg that was shorter, or lame, then the angle of the bar would have been in the opposite direction.  That idea of lameness is not the answer.\nRather, whenever there is any change in iconography, it is with Purpose, not mere idle whim.\n9th Century Byzantium faced a new heresy, not only Iconoclasm within, but its inspiration, beyond the borders.  The new design of the Cross was a visual Answer to that heresy, which denied that Christ actually suffered in the flesh; it was a novel form of old Gnosticism.  It was said, by Orthodox Christians in answer to that heresy, that Christ suffered SO MUCH that He wrenched the footrest loose.  His suffering was not figmentary; it was Real!\nThe footrest then, like a scale, was “up” to the Good Thief on His right, and “down” to the other thief on His left.  You will often see the “Russian Cross” standing upon a lunar crescent.  The new form of the Cross, I suppose, did not “catch on” in quite the same way where the traditions were already fixed; but in Russia, it was the standard from the first.\nWho was the new heretic, the originator of Iconoclasm?  It was Muhammad.  The Qu’ran denies the Crucifixion.  This derives from Gnostic thought still lingering in Arabia.\n[We see today certain strains of a desire to minimize focus on Christ’s Sacrifice, dubbed “a slaughterhouse religion” by some.  It is another instance of the old Gnostic heretical twist.}\nThe Shroud makes clear that, after the Left foot was placed over the Right, and both nailed with a single spike, another spike was hammered through the Right Heel. A fourth nail.  This was the last wound Christ received before dying.  It achieved no necessary ‘structure’ for the hanging of a body; its only purpose was to dramatically increase Pains and Suffering to the Victim.  The Roman soldier pounding it in could hardly have known that he was thus fulfilling the Oldest Prophecy of Redemption: The LORD spoke to the Serpent saying, “He shall crush your head, and you shall crush His heel.”\n[PS. In truth, as Muhammad’s earliest Arabic biographies clearly attest, when, by brigandage, terrorism, and breaking of pacts, he seized Mecca in 630, he entered the Ka’aba to destroy all its 360 idols; he personally placed his hands over an ikon of the Virgin Mother of God holding her Child, Jesus, to protect it, while even a mural of Abraham there on the inner wall he ordered destroyed.  This same ikon of the Theotokos was known to exist even 50 years later.\nBut Islam still denies the reality of the Cross.  Scientists raised in Islam are stunned by the verifiable facts arising from the Shroud.  They see the errors of the Qu’ran.]\n\n","date":"February 7, 2014 at 2:14 am","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","id":"comment-77176","author":"Christopher Kelley","site":"shroudstory"},{"title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame","post":"Re “the errors of the Qu’ran” and “The Qu’ran denies the Crucifixion”. \nTo somebody familiar with Arabic and the phraseology of ancient criminal law in Aramaic present as subtratum to Surah An-Nisa’ 4:157-158 famous verses, it is cristal clear the Qu’ran is not denying the Crucifixion at all. Surah An-Nisa’ 4:157-158 verses have been mistranlated/misunderstood for centuries by Muslims even from Muhammad’s own time.\n\n","date":"February 7, 2014 at 8:09 am","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","id":"comment-77231","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame","post":"Max,  the Aramaic substratum is the key to many things in this field.\n\n","date":"February 7, 2014 at 10:32 am","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","id":"comment-77255","author":"Louis","site":"shroudstory"},{"title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame","post":"Re Max’s comment Q 4:157-158, Version I have is Penguin 1983, translated by N J Dawood ( = NJD);\n“They(= People of the Book) denied the truth and uttered a mosntrous falsehood against Mary. They declared: ‘We have put to death the Messiah Jesus the son of Mary, the Apostle of Allah.’ They did not kill him, nor did they crucify him, but they thought they did [NJD: Or literally, he was made to resemble another for them.)” \n“Those that disagreed about him were in doubt concerning his death, for what they knew about it was sheer conjecture; they were not sure that they had slain him. Allah lifted him up to His presence; He is mighty and wise. There is none among the People of the Book but will believe in him (= Jesus?) before his death; and on the Day of Resurrection he (presumably Jesus) will be a witness agains them.”  \nThe section does appear enigmatic. What does the NJD translation note signify? Does it mean that Muslims believe that somebody else was substituted for Jesus? Or is it an attempt to reconcile the Muslim belief that “Allah lifted him up”? Is it the Muslim version of Jesus’ resurrection? What does the last sentence mean? Does it mean that none of the People of the Book will believe in Jesus before he dies? Or does it mean that the truth about Jesus will be revealed to each one of them upon their death? How does the ‘Aramaic substratum’ resolve these enigma?\n\n","date":"February 8, 2014 at 6:46 am","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","id":"comment-77447","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame","post":"I told Max that the Aramaic substratum is the key to many things in the field and he understood what I was saying and kept quiet because being a very cultured scholar he knew I was referring to the background.\n\n","date":"February 8, 2014 at 9:01 am","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","id":"comment-77473","author":"Louis","site":"shroudstory"},{"title":"Touching on the Byzantine legend that Jesus had a shorter leg and therefore was lame","post":"\nAnonymous :\nQuote from M. Freeman: “the earliest representations of Christ with a beard are not in the east but in Rome.”\nMy comment:  You’re right about that but if the Shroud has likely been the model (direct or indirect) for the Pantocrator type of icon (early 6th century and possibly a bit before that time), I seriously doubt it if the same thing for the few bearded Christ frescos that have been found in the catacombs of Rome.  On that subject, there are 2 things that make me think like this:  1- At that time (3th or 4th century A.D.) in Rome, the most common figure of God was a man with long hair and long beard (like Zeus and other great divine figures), so it is highly probable that those pagan depictions of God have been used to represent Christ at a time when no one knew what he looked like (which make me think the Shroud was still well hidden somewhere at that time).  And 2- There is not one of these bearded Christ frescos that show as many points of congruence as we found in most Pantocrator-like icons, which make me think the first depictions (the Roman frescos) were not based on the image we see on the Shroud, while it is the contrary for the Pantocrator-like icons.\n\nPerhaps the Romans portrayed Jesus with a beard because, as the occupiers of Judea, they knew very well what Jewish men, especially its zealots, rabbis and mystics, looked like.\n\n","date":"February 8, 2014 at 10:01 pm","url":"https://shroudstory.com/2014/02/06/touching-on-the-byzantine-legend-that-jesus-had-a-shorter-leg-and-therefore-was-lame/","cat":"art","id":"comment-77618","author":"David Goulet","site":"shroudstory"}]
