[{"title":"Dirk Bouts’ The Entombment","post":"Well spotted, Mark! The fact remains though, the tailed-Epsilon-shaped like small blood rivulet we can observe on TS man’s forehead, stands just above his left eyebrow while on Dirt Bouts’ painting it is a mid-forehead Epsilon. Though reduced to its lower part, the same characteristic bloodstain rightly appears above Christ’s left eyebrow in the Hungarian Pray Ms upper section illustration, folio 28.\n\n","date":"July 10, 2015 at 10:19 am","url":"https://shroudstory.com/2015/07/10/dirk-bouts-the-entombment/","cat":"art","id":"comment-205139","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Dirk Bouts’ The Entombment","post":"IMO, Max’s comment is meaningless re: the placement.  The Epsilon shape is clear, and is too specific a match to be anything else but an attempt at being as accurate as possible, to resemble the Shroud.\n\n","date":"July 10, 2015 at 4:36 pm","url":"https://shroudstory.com/2015/07/10/dirk-bouts-the-entombment/","cat":"art","id":"comment-205172","author":"Nabber","site":"shroudstory"},{"title":"Dirk Bouts’ The Entombment","post":"Nabber , re the difference between half-perfect and alleged ‘exact match’, methinks you totally missed the real purport of my comment. You’d better  overlay the TS man’s face and,  first,  the HPM Christ’s face and, then,  the DB painting Christ’s face to really get my point., which you haven’t so far yet claiming it is meaningless.\n\n","date":"July 11, 2015 at 8:20 am","url":"https://shroudstory.com/2015/07/10/dirk-bouts-the-entombment/","cat":"art","id":"comment-205240","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Dirk Bouts’ The Entombment","post":"Unless the artist correctly interpreted the Shroud image as a mirror imprint, he might mistakenly interpret the location of the epsilon as over the right eyebrow, if he were thinking of it as a portrait image.  The central placing of the epsilon on the painting would seem to have been an artistic decision from considerations of symmetry.  Depiction of the epsilon seems quite distinct.  Note that the crown of thorns is incorrectly shown as a conventional circlet rather than the more likely helmet.  Also he has decided not to show the crossed hands over the pelvis.  Essentially he seems to have decided to capture the moment at the commencement of the laying out.\n\n","date":"July 10, 2015 at 5:01 pm","url":"https://shroudstory.com/2015/07/10/dirk-bouts-the-entombment/","cat":"art","id":"comment-205175","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Dirk Bouts’ The Entombment","post":"Funny that he didn’t notice Jesus’s moustache…\n\n","date":"July 11, 2015 at 4:28 am","url":"https://shroudstory.com/2015/07/10/dirk-bouts-the-entombment/","cat":"art","id":"comment-205224","author":"Hugh Farey","site":"shroudstory"},{"title":"Dirk Bouts’ The Entombment","post":"Not at all!  Check the Durante photo; moustache is not all that evident, easily mistaken for lips.  Incidentally, did you happen to notice the moustache particularly, when in Turin?  Compare Henrie, there appears to be a sort of white rectangular piece under the nose to me, (some kind of burial artefact?)  The beard is slightly forked, but I’d say the face appears narrower than on the image, perhaps typically Latinate, possibly from his model.  The epsilon is quite distinct, and we are looking at a post-1355 depiction.\n\n","date":"July 11, 2015 at 5:00 am","url":"https://shroudstory.com/2015/07/10/dirk-bouts-the-entombment/","cat":"art","id":"comment-205227","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Dirk Bouts’ The Entombment","post":"“…easily mistaken for lips…”   !!!   I think this is grasping at straws. The moustache is one of the most prominent and distinctive features of the Shroud, and cannot possibly be mistaken for anything else. Its representation is a good way of checking whether any alleged copy is really anything of the sort – alleged Byzantine copies always have thin pointed down-turned moustaches, and other alleged eye-witness reproductions, in spite of spotting minute details of the blood flows, completely miss the big, bushy, prominent, moustache of the Shroud.\nAnd in Turin, under the blue light which brought out the contrast to its maximum, the moustache was, of course, the most prominent feature of the face, along with the nose and beard.\n(Exit the villain, twirling his moustache….)\n\n","date":"July 11, 2015 at 2:16 pm","url":"https://shroudstory.com/2015/07/10/dirk-bouts-the-entombment/","cat":"art","id":"comment-205271","author":"Hugh Farey","site":"shroudstory"},{"title":"Dirk Bouts’ The Entombment","post":"Hugh:\n\nDieric Bouts – Resurrection (detail)\nSee this picture from Treppa & Aszyk book (http://kiw.ug.edu.pl/en/religion/659-ikona-z-manopello-prototypem-wizerunkow-chrystusa.html):\n\nI think it explains all.\n\n","date":"July 11, 2015 at 2:36 pm","url":"https://shroudstory.com/2015/07/10/dirk-bouts-the-entombment/","cat":"art","id":"comment-205274","author":"O.K.","site":"shroudstory"},{"title":"Dirk Bouts’ The Entombment","post":"Hugh, not grasping at straws at all, it was an honest comment after inspecting the Durante.  Check the Enrie negative, On my copy there is a distinct white rectangular area under the nose, and it doesn’t look like any any kind of moustache to me, twirling or otherwise! I can’t say that there is no moustache, but after close inspection, it wasn’t all that obvious to me.\n\n","date":"July 11, 2015 at 3:45 pm","url":"https://shroudstory.com/2015/07/10/dirk-bouts-the-entombment/","cat":"art","id":"comment-205284","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Dirk Bouts’ The Entombment","post":"Assuming the Byzantine connection, the link below is a better guide:\nhttps://shroudofturin.files.wordpress.com/2014/04/pantocratorsmarks.pdf\nThe “Veronica” preserved in Manoppello does not promise to be what some some suppose it to be.\n\n","date":"July 11, 2015 at 4:37 pm","url":"https://shroudstory.com/2015/07/10/dirk-bouts-the-entombment/","cat":"art","id":"comment-205293","author":"Louis","site":"shroudstory"},{"title":"Dirk Bouts’ The Entombment","post":"I don’t know what you have on mind, Louis. What Byzantine connection? This is circa 1450, the Shroud is already in the West, as well as Veronica. And what the count of Vignon marks I have made myself has to do with it?\n\n","date":"July 11, 2015 at 4:45 pm","url":"https://shroudstory.com/2015/07/10/dirk-bouts-the-entombment/","cat":"art","id":"comment-205294","author":"O.K.","site":"shroudstory"},{"title":"Dirk Bouts’ The Entombment","post":"I saw the epsilon bloodstain when I was looking at a more detailed image that Thomas de Wesselow showed in his presentation (https://shroudstory.com/2015/06/12/thomas-de-wesselow-on-why-the-image-is-unlikely-by-an-artist/). It seemed like a common characteristic with the shroud (along with the squiggly blood droplets). Both painting and image are on linens too. I wounder what Wesselow thinks of these similar possible artistic styles?\n\n","date":"July 11, 2015 at 4:59 pm","url":"https://shroudstory.com/2015/07/10/dirk-bouts-the-entombment/","cat":"art","id":"comment-205295","author":"Mark L","site":"shroudstory"},{"title":"Dirk Bouts’ The Entombment","post":"O.K., my emphasis was really on the moustache and that is why I posted the link. Both the Dierik Bouts painting and the “Veronica” have no moustache or very little of it. I interviewed Manoppello expert  Father Heinrich Pfeiffer for two hours and selected only a few Q/Rs for a pdf, which I can send you through Dan if you are interested. It is somewhat outdated, but there are a few things that might interest you since he also talks about recent Shroud history in general.\n\n","date":"July 11, 2015 at 5:02 pm","url":"https://shroudstory.com/2015/07/10/dirk-bouts-the-entombment/","cat":"art","id":"comment-205297","author":"Louis","site":"shroudstory"},{"title":"Dirk Bouts’ The Entombment","post":"Louis:\nI interviewed Manoppello expert Father Heinrich Pfeiffer for two hours and selected only a few Q/Rs for a pdf, which I can send you through Dan if you are interested.\nYes, it may be interesting, thanks.\n\n","date":"July 12, 2015 at 4:09 am","url":"https://shroudstory.com/2015/07/10/dirk-bouts-the-entombment/","cat":"art","id":"comment-205353","author":"O.K.","site":"shroudstory"},{"title":"Dirk Bouts’ The Entombment","post":"For me the man on the shroud clearly has a mo….but….without sophisticated lighting or digital enhancement how clear would that have been in the old days? Of course the HPM man doesn’t have a mo either, just a little bit of scruff around the chin\n\n","date":"July 11, 2015 at 5:31 pm","url":"https://shroudstory.com/2015/07/10/dirk-bouts-the-entombment/","cat":"art","id":"comment-205302","author":"Thomas","site":"shroudstory"},{"title":"Dirk Bouts’ The Entombment","post":"So here’s a question….what was the facial hair style for Jews in the first century AD? Was it big bushy beards or more like what we see on the shroud ie. Mustache, smallish forked beard.\nOr is the style of the gent more consistent with a euro man in the 1300s?\nSerious – and dare I say it important – question\n\n","date":"July 11, 2015 at 5:36 pm","url":"https://shroudstory.com/2015/07/10/dirk-bouts-the-entombment/","cat":"art","id":"comment-205303","author":"Thomas","site":"shroudstory"},{"title":"Dirk Bouts’ The Entombment","post":"The Romans were clean shaven. Jesus was like a kind of “hasid” and the “hasidim” have an ancient tradition, which we see even today, among Orthodox and Ultra-Orthox Jews.\n\n","date":"July 11, 2015 at 5:47 pm","url":"https://shroudstory.com/2015/07/10/dirk-bouts-the-entombment/","cat":"art","id":"comment-205305","author":"Louis","site":"shroudstory"},{"title":"Dirk Bouts’ The Entombment","post":"Thanks Mark, brilliant as always!\nObvious correlation.  I love all the comments.\nLike the 3 yr-old said to me the other day, “It looks like Jesus.”\n\n","date":"July 11, 2015 at 6:42 pm","url":"https://shroudstory.com/2015/07/10/dirk-bouts-the-entombment/","cat":"art","id":"comment-205316","author":"Chuck Hampton","site":"shroudstory"}]
