[{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Everyone knows how cloth is woven, with long unbroken threads.(P.S. I have worked in a museum textile department.) So if you want to copy a weave you have to show the threads going through. The artist has decided not to do this because he wants to follow other patterns of decoration from medieval art that have nothing to do with the Shroud. WHY NOT JUST SHOW THE SHROUD IF IT IS THAT IMPORTANT? No image of a body anywhere, he does not even bother to copy the bearded face of Christ which is surely what everyone would notice. Can we not just start with a common sense approach on this? Who are all these medievalists/art historians who can see the Shroud? Is this the Courtauld view? Please provide the medieval art experts!\n\n","date":"June 2, 2012 at 11:49 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11802","author":"LyFe","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Are you a medieval art expert? Listening to some of your reasoning shows an approach far from common sense. Why would an artist have to show the threads going thru to predict a pattern? Are you an artist? Have you ever heard of artistic license? …The image has a beard, however slight, but still there….Maybe the Aritist was under the impression the image was not noticeable immediately hense not placing it on the Shroud. The fact that he does not show much blood or none at all is not uncommon in Byzantine art, thats a fact. Maybe the artist never viewed the complete Shroud? Only partially as mentioned in historical documents, it was raised on Fridays in Constantinople and most likely only showing from the waist up. You and others opponents are in denile, plain and simple as the depiction of the ‘naked’, ‘arms folded’,’wrists crossed’, ‘elongated fingers’ with ‘no thumbs’ man cannot be easily dismissed so simply as you wish, as these items are not typical of medieval depictions of Christ art.\nR\n\n","date":"June 2, 2012 at 12:10 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11804","author":"Ron","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"I do not know what you mean with “typical”. But there are many works of medieval art with those characteristics. Codex Pray among them. I’m just a fan of medieval art. I’ve traveled through Europe following the path of Romanesque and Gothic (the Rinascimento, also) and I like to see websites on medieval illuminations and painting. So I can give you a few examples, if desired. \nDo you know an expert who denies it? Because it would be an expert on something else, not in medieval art.\n\n","date":"June 2, 2012 at 3:54 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11815","author":"David Mo","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"I think anyone who can STUDY the drawings of the Pray manuscript and not see a correlation with the Shroud is simply in DENIAL. Especially when medieval art historians agree wholeheartedly, that that is exactly what it depicts!!. But with that said I think the notion that Pray manuscript is needed as evidence to the radiocarbon dating being in error is irrelevant. As I’ve stated before (many times) anyone that accepts the 1988 C14 dating as being conclusive or ‘Rock solid’ evidence need to educate themselfs in the science if radiocarbon dating, protocols, procedures and failings. If one does so HONESTLY, then one would come to the conclusion that the c14 dating was and is INCONCLUSIVE and WORTHLESS, period. It truly dumbfounds me that people will or can still use the c14 dating as any kind of ‘proof’ to the age of the Shroud….It’s got to be denial or a bias, thats all I can think would drive people to believing it.\nR\n\n","date":"June 2, 2012 at 11:49 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11803","author":"Ron","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"“Especially when medieval art historians agree wholeheartedly, that that is exactly what it depicts!!”\nReally? How many medieval art historians? Do you know the names? At least some leading experts you mentioned.\n\n","date":"June 2, 2012 at 3:56 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11816","author":"David Mo","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Although I don’t agree with the central theme of his book, Thomas de Wesselow is one. He is a British Art historian specializing in medieval images…I’ll take his word over yours thank you.\nR\n\n","date":"June 2, 2012 at 8:08 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11822","author":"Ron","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Ron – exactly. I agree that his explanation of the resurreciotn is dubious, but when it comes to his art historian credentials they are strong. Until another highly qualified art historian provides an alternative viewpoint, that is all we’ve got\n\n","date":"June 11, 2012 at 5:43 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12189","author":"Matt","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"All four of the illustrations in the Pray Codex have those little circles, open or filled, serving a decorative purpose on clothing, or even the halo in the first (Crucifixion) scene. So you have to ask whether any significance can be attached to the groupings of 4 little circles in the tomb scene (largely obscured by the zig zag pattern on the alleged “shroud” that some, but by no means all interpret as a herringbone weave).\nIt’s a simple matter to show that if you place four little circles (“points”) at random on a sheet of parchment or paper, then the most probable pattern where the letters of the alphabet are concerned is an L.  Why? \nAny letter with a curve can straightaway be eliminated – 4 points are simply not sufficient  to define a curve in 11 letters of the alphabet, i.e : B,C,D,G,J,O,P,Q R,S,U. That leaves just 15 straight-sided letters. But 9 of those ( A, E, F, H, I (with bars to distinguish from the number 1), K,M,W and X need 5 or more points. That leaves just 6 that might be feasible, i.e. L,N,T, V, Y and Z.\nN and Z are highly improbable – needing four defining points at the corners of a rectangle with its 4 right angles. Y and T are also rather improbable, requiring the lowest point to be precisely positioned relative to the other three (with T especially improbable since the top 3 points need to be in a straight line).\nThat leaves just L and V. But one cannot make a symmetrical V with 4 points (3 as distinct from 4 being needed).\nThat means there is one letter that is uniquely most probable if one places four points at random on paper – the letter L\nThe L-shaped arrangement one sees in the Pray tomb illustration above is almost certainly nothing whatsoever to do with the Shroud and L-shaped  poker holes, and EVERYTHING  to do with the simple laws of randomness and probability.\nThere are several other criticisms that could be levelled at the Jones analysis, but I for one shan’t waste any further time in listing them here. \nAnyone who uses the fourth (post-Resurrection) illustration in the Pray series as evidence for a wound in the wrist, when the diagram shows scarcely any palm on that hand, and who shamelessly omits to mention the other more realistically-drawn hand showing the wound DEFINITELY centred on the palm, can hardly be considered  a serious and objective reporter of the facts, can they? \nOne cannot go selecting facts that support one’s case, ignoring the ones that do not, and still expect to be regarded as a scientist (no matter what degree or diploma qualifications routinely appear after one’s name).\n\n","date":"June 2, 2012 at 12:28 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11806","author":"colinsberry","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Colin you are forgetting there may also be a five hole depiction on the cloth, on the lower side and quite indicative of one of the more prominent burn hole patterns…..I think your theory is busted.\nR\n\n","date":"June 2, 2012 at 8:04 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11821","author":"Ron","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Sorry Ron, you’ve lost me. What do you mean by “five hole depiction”? Where is there a five-hole depiction on the supposed Shroud, or anywhere else in the Codex for that matter?\nOh, and you still have not said why a medieval artist who had seen burn holes in the Shroud would have incorporated them into an illustration of the tomb scene. If the Shroud had been moth-eaten from centuries of storage, would he have dutifully incorporated every moth hole as well, merely to signal that he had seen a Shroud that few others knew about (at that time), stored hundreds of miles away?\nI’m not pushing any theory, btw, but engaged in the scientific process of pouring cold water on others’ tendentious, fanciful, self-serving and ill-supported theories. Anything to do with alleged correspondence between Shroud and Codex stretches credulity beyond the elastic limit… There is nothing to suggest that someone with limited artistic skills, called upon to provide illustrations to accompany a Codex crammed with early Hungarian text (that few contemporaries would see, far less be able to read) would have gone in for a precious kind of symbolism or Dan Brown like insertion of clues. (” I’m feeling a bit feisty and adventurous today.  I’ll mischievously add an L-shaped pattern of holes, not because I think they were originally on the Shroud in the tomb, but merely to signal to posterity that this nameless uncredited illustrator, engaged in an otherwise  thankless task, has on his travels laid eyes on a Shroud, the existence of which the rest of Christendom, for the most part, is still ignorant”)\nPlease Ron (and some others here) – get real… Any resemblance between the Codex and the Shroud is purely coincidental. Compare an orange with an apple and you can see points of correspondence – but that does not mean they came from the same orchard, or even the same country…\n\n","date":"June 3, 2012 at 2:26 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11830","author":"colinsberry","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"I would accept the Pray Codex does not prove, by itself, the carbon dating in incorrect (personally I prefer the physical evidence).  Yet when we consider other historical evidence including the struck coins of Justinian II in 645 & Constantine Porphyrogennetos in 944 & CENTRO study of the Sudarium of Oviedo, historical study sheds serious doubt on the carbon dating.  This is before we ever consider the physical evidence brought to light by Sue Benford & Joe Marino and proven beyond doubt by a reluctant Ray Rogers who proved himself wrong and the Benford-Marino hypothesis correct.\n\n","date":"June 2, 2012 at 3:37 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11813","author":"Andy Weiss","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"No puede encontrarse en la iconografía cristiana ni “antecedentes” ni “consecuentes” que muestren, al igual que lo hacen el Códex Pray y la Sábana de Turín, la figura de un Cristo muerto, desnudo, con los brazos cruzados (derecho sobre izquierdo) alcanzando la altura de la región pubiana y cuyas manos no muestren los dedos pulgares.\nLo que hace altísimamente probable que el ilustrador del Códex Pray hubiera visto la Sábana Santa o tuviera una muy buena información sobre ella.\n\n","date":"June 2, 2012 at 5:08 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11817","author":"carlos","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Bing Translation: It may not be used in Christian iconography or “background” or “consistent” that show, as do the Pray Codex and the shroud of Turin, the figure of a Christ dead, naked, with their arms crossed (right over left) reaching the height of the symphysis region and whose hands do not show thumbs fingers.What makes clear the illustrator of the Pray Codex likely would have seen the shroud or had a very good information about it.\n\n","date":"June 2, 2012 at 5:20 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11818","author":"Dan","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Lübeck, Schleswig-Holstein, Dom, altar, 13th Century.\n\nYou’re welcome.\n\n","date":"June 3, 2012 at 3:33 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11834","author":"David Mo","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Sorry. 14th Century. I was counting the century  in the Italian way.\n\n","date":"June 3, 2012 at 3:39 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11835","author":"David Mo","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Se sigue usted CONFUNDIENDO.\nLa obra es de la 15th Century","date":"June 3, 2012 at 5:55 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11860","author":"carlos","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"This is another long comment (sorry again).  But I hope you’ll find it interesting !!!  \nWhat is very important to understand is this : The depiction of the Pray Codex is not a direct copy of the Shroud like it was often done in the Middle Ages in France and in Italy.  On the contrary, it is the same kind of depiction we often see on the famous epitaphios of the byzantine era.  That’s why I always had serious doubts about the possibility that the artist who did the drawing of Jesus was a real eye-witness of the Shroud of Turin while the cloth was kept in Constantinople.\nBut the very particular weaving of the cloth (done approximately), the missing thumbs and most of all, the series of 4 holes we can see that are identical to the L-shaped burn hole we see on the Shroud leaves no doubt in my mind that those particular elements could not have been draw there if the person did the artwork (probably a monk) did not learn these particularities from someone else who was a real eye-witness of the Shroud of Turin while he was kept in Constantinople during the 12th century.  Personally, I just the coincidence is just too big to be due uniquely to hazard.  It’s just too big !  \nSo, to summarize my point of view about the Codex of Pray, I would say that the most probable scenario is this :  The depiction of Christ being put in his burial Shroud was done by a monk in the pure style of many depictions we can see on the epitaphios.  This monk was not a direct eye-witness of the Shroud of Turin but he incorporated some particularities of the Shroud he learned from another person who was an authentic eye-witness of the Shroud (i.e, mainly the very particular style of weaving of the Shroud and the L-Shaped burn holes, and maybe the missing thumbs).\nHere’s another thing I want you to note :  The first epitaphios are dated from the beginning of the 8th century.  Here what Maurus Green had to say about that :  “It was thought that all hope of tracing the Epitaphioi earlier was gone (note :  the author mean earlier than the 12th century), when Müntz came across the manuscripts of Jaques Grimaldi’s work on Veronica and her veil. He has left us drawings of two objects that existed in the treasury of Pope John VII in the old St Peter’s (Plates 15 and 17). One was an actual epitaphios showing Christ on an oblong linen with the inscription, Jesus Christos ho epitaphios threnos. The other was the central figure of Pope John’s umbella (canopy or baldechino) used to decorate the altar of St Veronica once a year when the relic was exposed. This was the Veronica shrine in the chapel of Our Lady, both of which were erected by order of Pope John, who reigned from 705 to 708. Grimaldi tells us that the scenes depicted on the umbella reproduced those of the mosaics decorating the chapel. The Christ of the umbella seems to be lying on the stone of anointing.”\nNote about the manuscript of Grimaldi :  In it, there is a drawing of the umbella he personally did before the shrine was destroyed and the 2 epitaphios were lost.  You can see the drawing depicting Christ here :  http://www.crc-resurrection.org/878-histoire-du-saint-suaire.html  (it is the first image you can see on this page).\nThere’s a VERY GOOD PROBABILITY that the artist who did these 2 epitaphios for the pope John VII was someone who was able to see the actual Shroud of Turin because of some very interesting similarities we can see on the drawing of Grimaldi, namely the hands crossed over the pubis and, even more, the fact that the thumbs are missing !  Again, I really don’t think that those kinds of very particular similarities can be only due to hazard.  It must come from an eye-witness of the Shroud.  So, we can say that, along the depictions of Christ in the Pantocrator icons and the face of Christ on the Mandylion, the depictions of Jesus burial we see on the byzantine epitaphios probably came from the Shroud of Turin and it’s another good clue that point toward the fact that this relic is much more older than the date given by the C14 labs !!!\nTo finish, here’s a little reflection :  Since the first epitaphios are dated to the very beginning of the 8th century (and who knows if there was not some epitaphios done before that time), if the depictions of Christ burial we can see on those artwork really come from the Shroud (as I think), then this is another very clear indicator that the hypothesis of Ian Wilson versus the Mandylion is MOST PROBABLY WRONG !!!  Effectively, at the time the epitaphios of pope John VII were done, the Mandylion was still kept with great care in Edessa !  In that context, if we think for 2 seconds that Wilson’s idea is correct, how in the world an artist of John VII could have known for the hands crossed over the pubis and the missing thumbs when these features would have been well hidden behind the only exposed layer of cloth of the Mandylion (i.e. the region of the face) ?!?!?  \nI’ll say it again, when it comes to evaluate the level of likelihood of the hypothesis of Wilson, what is the most important thing to remember is the historical context of the time !!!  So, because history know now that the first epitaphios were done at the beginning of the 8th century (or even earlier) and with the high probability that this art form originate from the body image we can see on the Shroud of Turin, this historical context is VERY BAD for the idea defended by Wilson and others that, during that same period of time, the Shroud (called the Mandylion back then) would have been folded four times to show only the region of the face !!!  In reality, the facts and probabilities regarding the epitaphios and the fact regarding the Mandylion just don’t fit together !!!  For me, this is just one more very good clue (this time given by the history of byzantine art) that shows one more time that, in fact, the Shroud and the Mandylion were 2 different objects.  Of course, this is not the biggest clue that exist leading to this conclusion, but nevertheless, this is a very good clue that represent a very difficult task for Wilson and his followers to explain !!!  In fact, I’ve never read anything about this particular problem from Wilson himself or another one of his gang and, most importantly, I’ve never seen any of them offering a rational explanation about that.   For me, this speaks very loud.  I think the only way those people can escape the problem would be to make believe that the depiction of Christ burial on the epitaphios of John VII had nothing to do with the body image we see on the Shroud !!!  But, I hope you’ll agree with me that this scenario is highly unlikely !  Look at the picture one more time (http://www.crc-resurrection.org/878-histoire-du-saint-suaire.html) and note again the missing thumbs folks !  Now, be honest with me for once !!!!  How in the world this very odd feature could have come from something else than the Shroud of Turin ???\n\n","date":"June 2, 2012 at 7:44 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11820","author":"Yannick Clément","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"I’ve decided to write again my second paragraph because I made some mistakes that can make the text hard to understand.  Here it is again :\nBut the very particular weaving of the cloth (done approximately), the missing thumbs and most of all, the series of 4 holes we can see that are identical to the L-shaped burn hole we see on the Shroud leaves no doubt in my mind that those particular elements could not have been draw there if the person who did the artwork (probably a monk) did not learn these particularities from someone else who was a real eye-witness of the Shroud of Turin while it was kept in Constantinople during the 12th century. Personally, I just think that this coincidence is just too big to be due uniquely to hazard. It’s just too big !\n\n","date":"June 2, 2012 at 9:51 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11825","author":"Yannick Clément","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Carlos: To establish that a work of art is a copy of other work two criteria must be followed. First, you must establish a list of similarities and differences. Not enough with the similarities. Second, you must consider if similar features could not be produced by other circumstances which do not involve copying.\nFor the Codex Pray: The “sindonists” do not consider the important differences between the codex and the image of the Turin cloth. Only similarities. Bad method. \nThen, the “sindonists” not consider that the characteristics they define as unique can be found easily in medieval art. The artist painted codex Pray according to usual conventions of his time. He could take the position of the arms, the absence of thumbs, etc., from other paintings of the time. Even the nude. The assumption that only did it from the Shroud of Turin is unnecessary and unlikely. \nYou can group arbitrarily a number of features of a work of art that does not exist in another and pretend it is unique. In the same way you can arbitrarily group two sets of characteristics of two works of art and say that they alone possess them. Especially if your knowledge of medieval art is not very deep. This can be done even with to works of different periods. It is an arbitrary procedure that proves nothing. Bad method.\nObvious errors in the methodology explain why hardly any medieval art expert supports the thesis of “sindonists” on identifying Pray Codex and the Shroud of Turin images. And found on this flawed methodology the cancellation of a prestigious test as the carbon-14 is a mistake. The “sindonists” must find other evidence against the 1988 dating if they want to gain some credibility.\n\n","date":"June 3, 2012 at 2:05 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11829","author":"David Mo","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Yannick: Why epitaphioi and nothing else? In the frescoes and the “eluminures” of the Middle Ages are the same characteristics. They were everywhere. \nI can’t “see that [circles of CP] are identical to the L-shaped burn.”\nIf you want to see an “L” on the Shroud of Turin you must arbitrarily choose only the larger holes. But then they are no explication for the five circles in the form of “P” seen below in CP. If you choose to take into account the small circles, then there will be neither an “L” nor a “P” with five holes. All these figures are arbitrary. Not “identic” to anything.\n(For the picture Cf: Shroud Scope: http://www.sindonology.org/shroudScope/shroudScope.shtml ).\nWell, you can imagine the most unlikely circumstances for the image of CP. But the method in art history is another. When there is a simpler explanation of an image the assumptions that involve complex chains of events that do not have any proof should be abandoned. And there is no evidence of a direct or indirect contact between the author of the CP and the Shroud of Turin (whether human or divine).\n\n","date":"June 3, 2012 at 2:40 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11831","author":"David Mo","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"I think some here should read Stephen Jones latest blog on the Pray Codex, which Dan was nice enough to link too on a here. It’s actually quite informative.\n\n","date":"June 2, 2012 at 8:13 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11823","author":"Ron","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"There are only two good points made by skeptics on the manuscript.\n1) That the image of Jesus has no beard, as does the man on the shroud.\n2) That there is no image of the man on the cloth in the second picture.\nThe second is weak, but acceptable–just barely.  The cloth is shown folded over, and if the artist were to put an image on the cloth, no one would think that Jesus was somehow no longer in the tomb.  \nThat said, I still think that the image on the manuscript was based on the shroud.\n\n","date":"June 2, 2012 at 10:43 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11826","author":"tony","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"And why no blood? All witnesses who described the Shroud of Turin emphasized the marks of blood. How the CP author does not paint them? \nAnd the angel walking on the shroud? Simply impossible.\nIn my previous comment I contributed seven major differences that exclude the copy. And I could have contributed more.\n\n","date":"June 3, 2012 at 3:06 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11832","author":"David Mo","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"There are in fact 2 streaks of blood beneath the angel’s feet. And the face of jesus sits behind Mary’s right arm, rising up from the shroud, connecting to it through the alpha letter. The 4 holes are definitely the poker holes of the shroud, the L shaped alignment is assymetrical – if the circles were meant to be decorative then they would have been arranged symmetrically\n\n","date":"June 3, 2012 at 7:34 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11840","author":"matt","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"So we have one name of a medieval art historian, Thomas de Wesselow. Then we look up his book The Sign on Google and everyone thinks he is writing nonsense about the Shroud. He is not respected by anyone. So please can we have the real experts who can tell us that they can see the Shroud in the Pray Codex. I have googled Pray Codex too and I can find the art historian in Wikipedia who has argued against the Shroud being seen on the Codex but no art historian who can see it. I think the art historians are not even prepared to think about it as they can see no evidence of the Shroud and know that this shows Christ being buried as he is in other Christian paintings and the customs of the medieival times when the hands were crossed., Are you all experts, if not please give us some who know something different!\n\n","date":"June 3, 2012 at 12:52 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11827","author":"LyFe","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Ron: The argument from authority is secondary when you can argue about the evidence and reason independently. Moreover, the argument of authority can not rely on a controversial author.\n\n","date":"June 3, 2012 at 1:20 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11828","author":"David Mo","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"You guys kill me! I give you the name of a Art Historian and you belittle it? So his book is controversial but you cannot question his art authority so easily…Typical!! Furthermore there have been several other art historians that agree, their names just escaped me. You could follow Dave’s advice below and do some reading/ research and you’ll find them.\nThe painting you linked us to above, how rediculous. That was painted 200 years after the pray codex, in a different religious enviroment. Show us some paintings or drawings prior to or immediately around the Pray codex time, and your point will be made, not otherwise.\nColin, put your glasses on, and look at the lower part of the Shroud (Where some believe it’s the sepulchre), with the red crosses, look close now; there are 5 poker holes there.\nR\n\n","date":"June 3, 2012 at 12:55 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11846","author":"Ron","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"How much sillier can this Codex thing get? I’ve left you a short message  on my own site, Ron\n\n","date":"June 3, 2012 at 1:19 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11850","author":"colinsberry","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"The text that accompanies my close-up fails to appear on that link Ron. Never mind. what should be clear to all is that while there are indeed 5 holes among the red crosses, they are NOT in an L-shaped pattern. They instead form an approximate rectangle with a tail, so are totally IRRELEVANT where “L-shaped” poker holes are concerned. I also think you display a total lack of objectivity in imagining that a region of the manuscript covered with red crosses represents part of a Shroud that is elsewhere said to show a herring-bone weave, and you do not earn kudos by telling others to get glasses to see things that ARE NOT THERE. \nYou are no scientist, Ron, and I suspect you never will be, based on present performance. Maybe if you were a scientist, you would begin to understand the irritation that I and my scientifically-qualified compatriots feel about non-scientifically-qualified documentary-makers who try to tell us how to do our jobs, who hijack scientific congresses in an attempt to extricate so-called consensus views, who use their privileged access to the Shroud to adorn their blog with an HD close-up that had hitherto been kept hidden from bona fide researchers like myself, with possibly more still to come, and who, last but not least,  blocks access to the comments on his site to anyone whom he perceives as off-message – his message. \nOh, and to deploy the term “heliorectal syndrome” is not the  same as crudely labelling with the A word, not if you know your Greek and Latin. It is a reference to sunshine, and a subtle indication whence it can originate in some people who have too high an opinion of themselves – like prescriptionist documentary-makers who attempt to elicit scientific sound bites that chime with their own opinions instead of reporting objectively on what real scientists are actually thinking and doing…\n\n","date":"June 3, 2012 at 5:06 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11856","author":"colinsberry","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Neither close-minded skeptics nor obsessive fanatics will arrive at the truth of this matter, unless they’re prepared for a change in mind-set, and engage themselves in some honest research. \nThe matter is adequately covered by Ian Wilson “The Shroud” 2010, pp 184-188, and I don’t intend to retype so many pages from his book.  One of his principal authorities is Kurt Weitzmann (the art historian, not the comedian, when you Google for Weitzmann).  Wilson cites one of the earliest reliable records of the burial cloth by an English tourist of 1125, but the Byzantines were not prepared to sacrifice their earlier traditions of the mandylion, the legend of Abgar and so forth so easily, so these too are inventoried. \nUp until this time most depictions of Christ’s burial were to have him wrapped mummy-style, but from this time forth, we see a complete change, towards the threnos or lamentation depictions, with a nude prone Christ, hands crossed somewhat uncomfortably across the pubis region, and usually with only four fingers shown on each hand, with no thumbs.  ONE of these depictions is in the Hungarian “Pray” manuscript.  There are others, but you’re going to have to do your own research, there’s enough info out there, for anyone with sufficient honesty and industry to satisfy themselves.  \nI have several projects on at the moment, and I need more confidence in there being sufficient good faith out there before I’m prepared to invest more of my precious time on a topic, to those who seem basically hostile about it.  Go do your own research!  I just happen to be careful as to where I cast my pearls!\n\n","date":"June 3, 2012 at 7:51 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11841","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"El artista del Codex Pray NO intenta copiar la Sábana, probablemente no la ha visto, pero SI tiene alguna información que es RELEVANTE.\n1.- El cuerpo de Jesús yacente (muerto) está TOTALMENTE DESNUDO.\nNo existe en la iconografía medieval NINGÚN otro ejemplo de Jesús yacente totalmente desnudo.\n2.- Si a ello le añadimos la posición de los brazos y la ausencia de pulgares ( de los que si hay otros ejemplos en la iconografía) la COHERENCIA con la Sábana de Turín es EVIDENTE.\n3.- El artista del Codex Pray es un mal dibujante, pero muestra INTENCIONALIDAD en sus dibujos.\nNo existe en la iconografía medieval NINGÚN SARCÓFAGO con ese tipo de decoración TAN ENORMEMENTE cargado, NO tiene ningún parecido con un sarcófago, no tiene parecido con una sábana…..\nEl dibujo tiene una INTENCIÓN de difícil solución artística.\nLa presencia de los 2 grupos de agujeros, “holes”, de gran similitud con los de la Sábana de\nTurín es DECISORIA para entender que el artista ha querido representarla.\nEl anverso tiene un dibujo lineal que representa el hilado del tejido, el reverso tiene cruces representando el contacto con el cuerpo de Jesús.\nEl artista NO puede mostrar la impronta del CUERPO porque NO tiene solución técnica ¿ representaría el artista la espalda y el culo de Jesús en el lugar de las cruces?. Porque la impronta FRONTAL del cuerpo quedaría en el reverso de la parte que muestra el dibujo lineal del hilado del tejido, NO PUEDE SER VISIBLE.\n4.- El arcángel, NO pisa la Sábana, su pie NO CORTA la línea que dibuja la Sábana . Pero además, si la pisara sería irrelevante. \n5.-El notable escéptico Paul Eric Blanrue, creo que fue el primer crítico con el Codex Pray, interpreta los agujeros (holes) como ¡DIAMANTES! que evocan  la naturaleza divina de Cristo y el fenómeno milagroso de su resurrección y que conforman las letras P y X, monograma de Cristo. ( ¡le faltan diamantes para conformar la X del monograma!).\nEstá claro que NO puede eludirse la presencia de los 2 grupos de agujeros (holes) y que todo ello es COHERENTE con la Sábana de Turín.\n6.- El Codex Pray NO demuestra la existencia de la Sábana de Turín, pero es MUY SUGERENTE de su existencia.\n\n","date":"June 3, 2012 at 9:11 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11844","author":"carlos","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Carlos, please. You started by saying that there wasn’t a single case of Christ naked on the mediaeval iconography. Just as Mr. Jones had said. I gave you one. Now you ask for another. Well, I give you another example and I hope we finish the game this time.\n“Book of Hours Southern Netherlands” (Brabant?), C. 1375-1400: The entombment of Christ: http://www.biblical-art.com/artwork.asp?id_artwork=20015&showmode=Full \nI don’t understand what you mean by “consistency”. The only consistency we are talking about is similarity. And I said before the “similarities” that are not real or are not significant. The codex Pray is not only “consistent” with the Shroud of Turin in some aspect. It is also “consistent” with other images. And in some respects “inconsistent” with the shroud.\nYes, the artist had painted a body image if he wanted to represent a body image. An angel if he wanted represent an angel. And a woman if he wanted to represent a woman. No holes, crosses and broken lines for represent Christ image. \nI don’t know why the presence of some small loops (not identical in both images either in number or in the form) that you can associate only subjectively with Shroud of Turin is “decisive”. This makes no sense. \nPlease don’t make me put here sarcophagi so “loaded” as the CP. Enter that site: http://www.enluminures.culture.fr/documentation/enlumine/fr/rechexperte_00.htm. Write “Saintes Femmes au tombeau” at box “TITRE ENLUMINURE/SUJET” and you will find a few pictures with sarcophagi “suggestive” and “loaded”. That also does not seem even a sarcophagus! And if you also want to see a sarcophagus-like zigzag patterned CP I can provide: Saint-Jacques des Guérets, 12th century.\nI can’t argue with you (or anyone) about feelings experienced before an image of Christ or whatever else. Your “suggestions” are a personal matter.\nI don’t know what you mean by “cutting” and keep off the shroud. If the angel stepped on the shroud (set his foot on it) this would be a blasphemy in the iconographic and religious context of the time. Step on something or someone was a symbol of triumph over that thing.\nBlanrue isn’t an important personality in the area of the Shroud of Turin. (¿”Skeptic” means not in favor of authenticity?). Long ago he wrote a book and maintained a blog that closed years ago. The hypothesis that the small loops of the sarcophagus are ornaments (not necessarily diamonds) is plausible. They are similar to others that the painter place on the dresses of the characters. And these are obviously ornaments.\n\n","date":"June 3, 2012 at 12:20 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11845","author":"David Mo","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"David, no debe usted sacar mis palabras del contexto del debate, centrado en la posible relación del Codex Pray con la Sábana de Turín.\nMi afirmación:\n“No existe en la iconografía medieval NINGÚN otro ejemplo de Jesús yacente totalmente desnudo.”\n……está limitada obviamente por el año 1355 aprox., cuando la Sábana de Turín aparece en Lirey.\nEs una afirmación totalmente VÁLIDA y usted NO ha podido mostrar ningún ejemplo que la invalide. Sus ejemplos son POSTERIORES a la aparición de la Sábana en Lirey.\nSÓLO el Codex Pray muestra un Jesús muerto TOTALMENTE desnudo……además de mostrar la posición de brazos y ausencia de pulgares como se muestra en la sábana de Turín.\n\n","date":"June 3, 2012 at 5:29 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11858","author":"carlos","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Carlos: You  literally wrote: “ni antecedentes ni consecuentes”. I gave you an example you asked: the difference between the second half of the fourteenth century and the first of the fifteenth centuriy in the medieval art is not relevant to discuss if there were naked images of Christ at this time. That is our topic today. Now you change the conditions that you had put forward for not having to admit your mistake. So this is no way to argue. If I give you a new example dated around the thirteenth and fourteenth century you put new conditions. And so on till infinite. \nIn connection with your new “challenge” I had already responded in comment # 18. I have nothing new to add.\n\n","date":"June 4, 2012 at 2:22 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11870","author":"David Mo","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"El texto COMPLETO que escribí es:\n“No puede encontrarse en la iconografía cristiana ni “antecedentes” ni “consecuentes” que muestren, al igual que lo hacen el Códex Pray y la Sábana de Turín, la figura de un Cristo muerto, desnudo, con los brazos cruzados (derecho sobre izquierdo) alcanzando la altura de la región pubiana y cuyas manos no muestren los dedos pulgares.\nLo que hace altísimamente probable que el ilustrador del Códex Pray hubiera visto la Sábana Santa o tuviera una muy buena información sobre ella.”\nEs obvio que:\n1.- Antecedentes y consecuentes se REFIEREN al Códex Pray, 1192-1195\n2.- Antecedentes significa ANTES del Codex Pray\n3.- Consecuentes significa DESPUÉS del Codex Pray HASTA la Sábana de Lirey, 1192-95 a 1355-57\n4.- ¿O acaso supone que con la palabra CONSECUENTES me refiero hasta el año 2012 ?\n5.- El “entombment” de la catedral de Lübeck, que usted propone fechándolo erróneamente en el siglo XIV, es de principios del siglo XV, posterior a la Sábana de Lirey  y CLARAMENTE inspirado en ella.\n6.- Usted NO puede proponer ningún ejemplo iconográfico ANTERIOR  a la Sábana Santa, de Cristo DESNUDO muerto que no sea el Códex Pray.\n7.- Usted NO puede proponer ningún ejemplo iconográfico ANTERIOR a la Sábana Santa, de Cristo DESNUDO muerto, con los brazos CRUZADOS sobre el pubis y con las manos que NO muestren los pulgares, que no sea el Códex Pray.\n8.- Creo que está suficientemente CLARO y que resulta lícito establecer una estrecha relación entre el Códex Pray y la Sábana Santa.\n9.- La presencia de los 2 grupos de agujeros (holes) hacen ALTÍSIMAMENTE PROBABLE que el ilustrador del Códex Pray hubiera visto la Sábana Santa o tuviera una muy buena información sobre ella.\n10.- Le agradezco SU INSISTENCIA que permite REFORZAR mis argumentos.\n\n","date":"June 4, 2012 at 5:05 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11881","author":"carlos","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"There is already the link on this blog to Charles Freeman’s article on the Shroud. it is important for anyone who says you have to be open-minded to read it and it is very interesting. When he discusses the Pray Codex he says that they were burying people  as Christ is shown on the Pray Codex all over Europe many centuries before the Pray Codex. So the Turin Shroud cannot have inspired  all these burial pictures that daveb talks about..\n\n","date":"June 3, 2012 at 1:17 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11849","author":"LyFe","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"\ncolinsberry :How much sillier can this Codex thing get? I’ve left you a short message on my own site, Ron\nSorry, not interested in visiting your site.\nR\n\n","date":"June 3, 2012 at 1:33 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11851","author":"Ron","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"I just want to add another comment about the Pray Codex that could force some sceptics to rethink the whole thing again…  There’s another very striking feature that I completely forgot to mentioned yesterday in my long comment and it concern the fact that, in the depiction of Christ we found in the Pray Codex, his body is completely naked !  When you understand that this naked depiction of Christ is the only one who shows this very particular feature before the Shroud was publicly known in France during the 14th century, it is pretty EVIDENT that this can only be explain by the fact that the artist saw the Shroud with his own eyes or by the fact that he received some very precise information from someone who was an authentic eye-witness of the Shroud when the relic was kept in Constantinople during the 12th century.  There’s not much room for another rational explanation folks than these 2 possibilities !  Here I dare any sceptic to find me a depiction of Christ from the 12th or the 13th century !  You’ll search a long time because there’s simply no other.  And personally, because the depiction of Christ in the Pray Codex looks more to me like an epitaphios that was modified to include some very particular features of the Shroud than an exact copy of the Shroud, I tend to favoured the second option, i.e. that the artist (probably a monk) who did the artwork never saw the Shroud himself but had the chance to receive very clever information from a real eye-witness of the relic and decided to include them in his drawing.  These information include the very particular weaving of the cloth, the L-shaped burn holes, probably the missing thumbs too and, last but not least, the fact that the body of Christ was completely naked.  Right now, that’s where I stand in my reflection about the Pray Codex and there’s no doubt in my mind that it is a very powerful proof of the existence of the Shroud during the 12th century (most probably in Constantinople).  \nBy the way, if what I suspect is true about the depiction of Christ on the umbella of Pope John VII, i.e. that the artist who did the work was an eye-witness of the Shroud, that mean, at that time (8th century), this artist didn’t had the same guts than the one who did the depiction of Christ in the Pray Codex and decided not to show the nudity of Jesus by adding a modesty cloth…  That says a lot about the FACT that, at that time, it was completely unthinkable to show Jesus body naked, even for those who had seen the Shroud with their own eyes.  And I just want to make you understand that it is exactly the same thing in regard of the blood !!!  Effectively, the history of art informs us that it’s not until the 13th century (first in Europe) that we see the very first depictions of the suffering Christ showing bloodstains and bruises.  In this very particular context, do you really believe for one second that the Mandylion could have been exposed regularly, first in Edessa, then in Constantinople, while showing a lot of bruises and bloodstains that were very easy to see ?  You really believe that ???  The reality is this :  at the time the Mandylion first come up in Edessa up until the time it left Constantinople during the 13th century, if the face of Christ would have been showed with bruises and bloodstains like we see on the Shroud, it would have been judge as disgusting and scandalous for the time as if a depiction of Christ would have showed him with his body completely naked !!!  It’s sad people don’t know that (or don’t want to hear this historical truth), but THAT’S THE TRUTH.  And this truth lead us toward one single conclusion : The hypothesis of the Mandylion is most probably wrong and this relic was most probably what every artistic copies shows us, i.e. a cloth featuring only the face of the living Christ without any signs of injuries or bloodstains.  Again, when we understand correctly the historical context of the time, the reality is this : a cloth featuring this kind of living face of Jesus would have been “religiously correct” for the time, but never the face we see on the Shroud !!!\nSorry to come back again with this subject but it’s important that everyone understand that most important aspect of the historical context of the time (before the 13th century) regarding the depictions of Christ when it comes to evaluate correctly the hypothesis of Ian Wilson.  Evidently, but sadly too, it’s not a FACT that Wilson himself have emphasise in his books !!!  And you can easily see some bias right there…  Effectively, I just cannot believe that a man like Wilson is not aware of this important fact concerning the artistic context of ancient time and, nevertheless, he choose consciously to put that aside in order to sell his hypothesis.  This is not what I call an authentic quest for TRUTH.  Sorry folks but that’s the reality and that’s why I fight so hard against this particular hypothesis !   In the end, I think I have some very strong arguments that allow me to do so…\n\n","date":"June 3, 2012 at 4:42 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11854","author":"Yannick Clément","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"And here’s another comment of mine (shorter this time !) about the L-Shaped holes we see on the drawing of the Pray Codex :  Those holes have absolutely no artistic value whatsoever and they are not connected to any known religious signs !!!  Taking that into account, the probability that these holes represent the L-Shaped burn holes on the Shroud is EXTREMELY HIGH (let’s say 99.9%)…  As I said before, here, there’s not much room for another rational explanation that this…   If the Shroud is not directly or indirectly connected with the artworks contained in the Pray Codex, then I must be completely crazy or totally blind !!!  Since I don’t think I’m either of these 2 things, I firmly stand in my position.  Sorry for the skeptics out there…\n\n","date":"June 3, 2012 at 4:50 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11855","author":"Yannick Clément","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"“Those holes have absolutely no artistic value whatsoever…”  Of course they do not, Yannick, and for one very simple reason. The scenes depicted were not the work of an artist, but of a Codex (“book”) illustrator – with a severe restriction on parchment space. The little circles can be seen on all four illustrations, in one instance on the halo – so WERE intended purely as a decorative feature and a rather amateurish one at that.  \nThe probability that 4 holes drawn at random will form an L pattern is higher than for any other letter of the alphabet- as I have previously pointed out. The probability that the illustrator of the Pray manuscript, probably a monk, had seen the Shroud, and had decided to incorporate latterly-acquired poker holes for “authenticity” is essentially zilch…Had that been his intention, he would not have been so liberal with those little circles elsewhere in the other 3 diagrams. (Not surprisingly,  those other three rarely get a ,mention, given they are largely useless as anti-sceptic artillery – e.g. like the one (Picture IV,post-Resurrection) showing a nail wound in the palm  that would have been in the wrist if the illustrator had really been determined to incorporate Shroud detail for “authenticity”. \nFor real copper-bottomed authenticity, he could have produced a Picture V, showing a vacated Shroud with an imprint of both frontal and dorsal sides of a scourged and bloodied man, but did not do so.  Why not? Because he had never laid eyes on the Shroud, and was producing illustrations that fitted with Biblical accounts, and ones moreover that did not puzzle or shock the reader of that Codex, with hands protecting modesty (rendering all the concern about “nudity” somewhat  pointless and irrelevant). \n So modern man, Homo interneticus especially, is left focusing on those tiny decorative circles, reading into them things that would probably have had that illustrator looking blankly with incomprehension. or causing him to ROFL…\nI shall now take a long holiday from this site. Life’s too short to waste on endless wrangles about minutiae that in all probability have no bearing whatsoever on the provenance of the Shroud. \nThe best thing that could and should happen right now would be for David Rolfe to place all those squirrelled-away HD images of his into the public domain …  like tomorrow, not next week or next year…\n\n","date":"June 3, 2012 at 6:07 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11861","author":"colinsberry","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Before you leave this blog (I will miss you, I tell you that !), please read my other comment just above and explain to me how in the world a naked Christ like we see on the artwork of the Pray Codex could not be linked with the Shroud of Turin while you surely know that they were no such depiction of a naked Christ at that time in all the Christian world !!!  Ho, by the way, I still wait for you to answer the questions contained in my reply to you versus Rogers hypothesis concerning the image chromophore !!!  Can you please read carefully this long comment of mine : https://shroudofturin.wordpress.com/2012/05/21/creative-comment-of-the-day-by-colin-berry/#comment-11546\nAfter your reading will be done, can you please take every questions I wrote for you and give me a proper answer for each one ?  I would really appreciate that…  Thanks !!!\n\n","date":"June 3, 2012 at 6:20 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11863","author":"Yannick Clément","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"LF:  “… they were burying people as Christ is shown on the Pray Codex all over Europe many centuries before the Pray Codex. So the Turin Shroud cannot have inspired all these burial pictures that daveb talks about.”\nAs I noted above, usual depictions of Christ’s burial was mummy style up until 11th – 12th century.  Yannink mentions epitaphios from 8th c.  It’s evident that the image on the Byzantine burial cloth became more widely known from 12th c. onwards, as there is an artistic shift in the threnos and lamentation scenes as I described.  Check Wilson, Weizmann.  But maybe you just will never get it!   \nY:  No way were the Byzantines ever going to give up their precious traditions about Mandylion, Abgar etc, even if the evidence was in front of their eyes.  Possibly one reason why they kept the burial cloth securely locked up and continued with their inventories. \nCB  Letters L, V, W,  M etc:  This has to best tongue-in-cheek spoof on pseudo-science that Colin’s ever managed to come up with.  An undergrad in stat-math could drive a bull-dozer through it!\n\n","date":"June 3, 2012 at 5:26 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11857","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"I’ll say it again :  A cloth showing a beaten and bloody face like we see on the Shroud would have been considered completely scandalous at the time the Mandylion was known in Edessa and Constantinople…  And you have to understand also that if the Mandylion would have look like the face on the Shroud, it would have left a major influence on Byzantine art (especially the art regarding the Passion).  But that’s not what the history of byzantine art show us !  Sorry.  In fact, what the history of byzantine art shows us is that, before the 14th century, there was absolutely no depiction of Christ in the East showing him with bruises and/or bloodstains.  This is a clear indication (no matter what you can think) that the Mandylion had absolutely no influence whatsoever on the religious art regarding the Passion othe Christ.  This FACT alone should be well enough for you to understand that the Mandylion was exactly what the vast majority of ancient document said about it :  A small cloth (pretty much like a towel) showing only the face of the living Christ without any injuries or bloodstains.  And it is precisely BECAUSE the face on the Mandylion was like every known copies of the relic we have now that it never had any influence on the religious art concerning the Passion.  It’s as simple as that but, sadly, Wilson and all his fans (you seem to be in that group !) always seem to close their eyes in face of these basic FACTS.  Am I the only to see clearly here ???  Anybody who knows the history of religious art (especially the byzantine art) know full well that the Mandylion had absolutely no influence at all on the art of the Passion simply because THE FACE OF CHRIST ON IT HAD NOTHING TO DO WITH THE PASSION…  It’s a simple as that.  In my world, 1 + 1 = 2 !\n\n","date":"June 3, 2012 at 5:48 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11859","author":"Yannick Clément","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"“CB Letters L, V, W, M etc: This has to best tongue-in-cheek spoof on pseudo-science that Colin’s ever managed to come up with. An undergrad in stat-math could drive a bull-dozer through it!”\nSeeing as how you know so much about what an “undergrad in stat-math” would do to my reasoning, then why not attempt a critique yourself, daveb? Or is probability theory and statistics (which I taught for some years) not your forte?\nCasual sniping is so much easier than well-informed comment, n’est-ce pas?\n\n","date":"June 3, 2012 at 6:34 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11864","author":"colinsberry","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"There’s no apparent reason why the artist would be trying to build any letter of the alphabet with those circles. That’s why your argument that L is more probable than other letters is flawed.\nIf you’ve ever played Tetris you’ll know that there are exactly seven ways to place four circles on adjacent points of a grid, which become five if you consider mirroring patterns as identical. So if you ask, if the artist was placing circles at random, what is the probability that he would build an L-shaped pattern, I’d answer: 1/5. Not so low that it couldn’t happen by chance, but not insignificant either.\nAlso, you claim that the same L-shaped pattern is represented on other illustrations of the Pray Codex. If the artist was just drawing circles at random, chances are he’d have used different patterns. If instead he always consistently used the same pattern, that must mean it had some significance.\n\n","date":"June 4, 2012 at 3:37 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11878","author":"Onan the Barbarian","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Colin, I can’t believe you’re serious.  I hope you managed better training your students than this effort.  Yup, I have several Stage IIIs in the subject, with several sophisticated applications during my working life, But sorry I don’t have the time to waste just now, maybe some other time. Byeee!\n\n","date":"June 3, 2012 at 9:26 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11866","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"I am serious Dave – very serious. That’s why I use my real name. You on the other hand use a pseudonym which allows you to take potshots at me and others with impunity \nIf you are so well educated and experienced as you claim to be, then you would know that recognizing letters of the alphabet in an array of points that one has to mentally join up is not amenable to textbook analysis, and has to be approached empirically from first principles, analysing the characteristics of each letter one at a time, since there is no logic or pattern in the 26 letters. That is precisely what I did – I organised the alphabet into sets, according to the minimum number of points needed to define each letter, arriving at the conclusion that L was the most probable letter that would be “seen” in an  array of 4 points. This is not maths, or statistics or even probability theory – just a systematic approach applying common sense. A lot of science is just that – which is why this PhD scientist despairs when he sees folk – those parading their science degree included – over-analysing the Pray Codex, seeing things that are not there. \nResearch, any kind of research, scientific or otherwise, requires the ability to suss out new previously undetected patterns and relationships, while remaining strictly objective about one’s own and other’s ideas. You daveb are demonstrating no research skills right now.  You are simply sniping at my ideas while displaying intellectual laziness, unwilling or more probably unable to specify the flaw in my detailed step-by-step reasoning. All you do is demonstrate that of the two of us, it is I who is the bona fide researcher, prepared to set out his stall – and you a mere internet sniper-  possibly with feelings of insecurity and inadequacy, but safe to snipe behind a protective pseudonym. \nI am presently developing new theories on Stonehenge and Silbury Hill. I shall now devote myself entirely to that project.There is nothing happening here that need detain me a moment longer. \nColin Berry aka sciencebod\nPS:  Kindly put those HD images – all of them – into the public domain, David Rolfe. Do so soon please. I for one am running out of patience with someone who attempts to orchestrate the science while in fact hindering further progress with a selfish and squirrel-like propensity to hoard a valuable and much-needed.resource.\n\n","date":"June 4, 2012 at 1:52 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11869","author":"colinsberry","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"\nRon :\nThe painting you linked us to above, how rediculous. That was painted 200 years after the pray codex, in a different religious enviroment.\nR\n\nHow  religious differences affect on the issue we discussed? What differences are you talking about?\n\n","date":"June 4, 2012 at 2:30 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11871","author":"David Mo","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"It seems to be even between those who cannot see anything like the Shroud of Turin in the Pray Codex and those who can ,even if they cannot explain why the artist cannot simply show the Shroud in clear detail. The ‘yes’we can spot the Shroud’ team have not been able to show why the Shroud was considered so important when there were so many thousands of much more prestigious relics. Please read Charles Freeman’s article- the Crown of Thorns was so much more important as was the real blood of Jesus and pieces of the Cross and the Holy Lance. Why do you think the Shroud was more important than these?  I know Freeman is a historian who is criticising another historian ,Ian Wilson , and I am sure that there will be good debates on this, but his ideas seem relevant here too.\nThis debate has surely got nowhere. I still wait to hear of a respected art historian who can see the Shroud in the Pray Codex!\nP.S. From what I know about textiles, it would be very rare for linen to last two thousand years unless it was in a very dry climate such as Egypt. I don’t see much in this debate from anyone who has worked with textiles and knows this really big problem!\n\n","date":"June 4, 2012 at 2:30 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11872","author":"LyFe","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"\nYannick Clément :\n(…) they were no such depiction of a naked Christ at that time in all the Christian world !!!\nThanks !!!\n\nThird example I put in this forum: The Cloisters, 13th century,  http://www.flickr.com/photos/elissacorsini/2163082112/in/set-72157601070709853/\nCan you stop saying there aren’t images of naked Christ at this time? I get bored having to correct you again and again. Thank you.\n\n","date":"June 4, 2012 at 2:55 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11873","author":"David Mo","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"I didn’t know about that, sorry.  But that can mean this artwork too was most probably inspired by the Shroud.  Have you thought about that ?\n\n","date":"June 4, 2012 at 8:30 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11889","author":"Yannick Clément","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Yes. See my comment June 3, 2012 at 2:05 am | #18, please. If you want establish that a work of art influences another you have to give evidence, not mere conjecture. You can not ruin a test such as carbon-14 with conjectures only. \nIn addition to the reasons given in my previous comment I add that I find very unlikely the influence of Shroud of Turin on paintings and enluminures spread across Europe, from Spain to Hungary or Scandinavia. (See this, please: Hamra Church in Gotland,14th-15th century?; http://commons.wikimedia.org/wiki/File:Gotland-Hamra_kyrka_08.jpg ). \nFor this had happened, the Shroud of Turin should have been publicly known in Europe. That is not so. We know a few private exhibitions and also a few private references (almost only lawsuits) till the sixteenth century. No sign of the Shroud of Turin in  meditatio mortis , briefs, sermons and prayers for the death of Christ. That an image as unknown in the literature cause a strong impact on the iconography of the time is not understandable. It’s very unlikely.\n\n","date":"June 5, 2012 at 1:38 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11926","author":"David Mo","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"David ¿por qué modifica las fechas?\nNo es 14th-15th century.\nEs 15th century.\nHamra kyrka (Gotland). Passionsfries (15.Jh.)\nLa Sábana era bien conocida en Europa ( en “todo el mundo” según el obispo Pierre D´Arcis) y prueba de ello es la medalla conmemorativa que muestra su primera ostensión en Lirey en 1355-57.\nLa infuencia de la Sábana Santa en las obras que usted ha mostrado del SIGLO XV, Lübeck y Gotland es CLARA.\n\n","date":"June 5, 2012 at 3:56 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11931","author":"carlos","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"\nOnan the Barbarian :\nThere’s no apparent reason why the artist would be trying to build any letter of the alphabet with those circles. That’s why your argument that L is more probable than other letters is flawed.\nIf you’ve ever played Tetris you’ll know that there are exactly seven ways to place four circles on adjacent points of a grid, which become five if you consider mirroring patterns as identical. So if you ask, if the artist was placing circles at random, what is the probability that he would build an L-shaped pattern, I’d answer: 1/5. Not so low that it couldn’t happen by chance, but not insignificant either.\nAlso, you claim that the same L-shaped pattern is represented on other illustrations of the Pray Codex. If the artist was just drawing circles at random, chances are he’d have used different patterns. If instead he always consistently used the same pattern, that must mean it had some significance.\n\nYou have totally misunderstood and misrepresented what I said (I certainly did not say that ‘the same L-shaped pattern was elsewhere’ – quite the contrary in fact. I simply said there was an abundance of those little circles elsewhere, disputing one erroneous statement that 5 points made an L-pattern on the lower panel with the red crosses).\nI’m clearly wasting my time on this site, given the sniping and failure to comprehend plain English.\nI may do my own posting on the Pray Codex at some point in the future – but it’s not high on  my list of priorities. This entire Pray shebang is frankly a piece of non-scientific trivia from start to finish.\n\n","date":"June 4, 2012 at 4:30 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11880","author":"colinsberry","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Carlos: You lapses again in the mistakes that I have reported in my previous comment June 3, 2012 at 2:05 am., and in Jones on the Hungarian Pray Manuscript Codex as discussed in Wikipedia, June 2, 2012 at 3:45 am. \nThat is, you arbitrarily group features that interest you and forget another you’re not interested. My commentary June 2, 2012 at 3:45 am pointed several differences that exclude the codex Pray and the Shroud of Turin identity. You apply the same procedure to pretend that the Pray codex is unique. I beg you to read my objections on this point and try to answer it (what you call “reinforce” is simply repeat the same over and over again).\nBy the same procedure you conclude that if you have selected arbitrarily some features of the codex Pray that are repeated on the altar of Hamburg is because the last is “clearly inspired” in the first. \nI’m sorry, you have not proved anything. You simply have used a fallacious method: the arbitrary similarities method.  \nAnd now, you arbitrarily decide what means “consequent”. No, consequent in that case is any picture in the late Middle Ages context. Namely, the three centuries period in which the theme of Christ in the tomb raises and develops to its peak. From de last years of 12th to 15th centuries. As the anointing, the burial, pianti or vir dolorum. This is a period of a coherent subject in art history, not one that you arbitrarily decide.\n\n","date":"June 4, 2012 at 6:46 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11885","author":"David Mo","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Colin\nMan, you really, obsessively over-rationalise!!!! Nothing wrong with rational thought, but….You just can’t be that rational with a piece of art that holds as much symbolic representation as literal representation, it is such a one-dimensional world view. Having said that there is plenty of rational reasoning to lead one to the conclusion that the image does represent the shroud. Yes, circles are frequently used as decorative elements in the images, but they are always in symmetrical, repeated patterns. Looking at it rationally, it simply makes no sense to me that the artist would have departed from the norm to paint a “L shaped” “pattern” which has no decorative value whatsoever! Surely, if it was meant to be decorative it would have been in a symmetrical shape, such as a cross, etc. I really find your letter rationalising rather absurd. Also you have questioned why the artist would represent the poker holes at the expense of other features. I can’t answer that, only the artist knows, and remember this is a symbolic artwork not a literal representation, but anyone who looks at the shroud can see how strong a feature the poker holes are, and who knows maybe in the past they were interpreted in some spiritual manner. A latter representation of the shroud (I think from the 15th century) explicitly copied the poker holes.\nAlso – and this is just my interpretation – the head of Jesus behind Mary’s right arm, I believe, is meant to represent the face of Christ on the Shroud, the alpha letter connects the head of Christ to the shroud. Another subjective interpretation, the head has a remarkably composed and serene feel, like the shroud.\nAlso, there are red lines on the object – now they could be interpreted in different ways, of course, but I interpret them as representing the streaks of blood on the shroud, perhaps the two main streaks on the arms. Otherwise, what might they be? I am open to any alternative “rational” explanations, but at this stage I personally can’t think of any. If they indeed represent blood, why would there be streaks of blood on a tomb lid?Or did the artist just happen to randomly draw two red lines for some artistic effect (I think not)\n\n","date":"June 4, 2012 at 7:21 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11886","author":"Matt","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"“You just can’t be that rational with a piece of art that holds as much symbolic representation as literal representation,”\nThat is where you and so many others are totally mistaken. We are not discussing “pieces of art”. The four scenes  were merely line drawings (and rather crudely executed ones at that) to illustrate text in a Codex (“book”). There are simply no a priori grounds whatsoever for thinking that an illustrator, confined to small pages, probably quarto size, as distinct from a spacious canvas, would have attempted any kind of symbolic representation. If the commissioners of the Codex had wanted to make a link with the Shroud – assuming the latter to have been contemporaneous –  they could have said so in writing, instead of relying on readers to spot one particular L-shaped set of just 4 holes lost in a jumble of zig zag patterns. Get real…\n\n","date":"June 4, 2012 at 2:11 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11905","author":"colinsberry","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"respectfully, that is rubbish. There is plenty of symbolic , non-literal material on the shroud. How about the alpha letter floating above the shroud, connnecting to the head figure of Christ? How about the crosses over the mid portion of the shroud, representing Christ’s contact with the shroud and the head cloth? How about the fact that Christ’s body, being taken from the cross, and then laid out on the shroud, is free of blood marks (this is clearly symbolic,or at least based on social / spiritual mores). Where I agree with you is that the artist is not a particularly skilled one. That doesn’t matter. In fact that explains things like the fact he painted crosses over the shroud, near the angel’s feet, to represent Christ’s image on the shroud.\nYou haven’t addressed my points on the crosses, nor on the two red streaks. I think these are very valid, previously unmentioned points. I don’t think they are easy to dismiss, but I’d like to see you try….\n\n","date":"June 4, 2012 at 6:44 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11917","author":"Matt","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"also there are cross motifs near the angel’s feet and the two red streaks, which carry through under the head cloth, and depart from the herringbone pattern on the balance of the shroud. Again, my interpretation is that the crosses symbolically represent Christ’s image on the shroud. They also cross under the head cloth, again representing Christ’s physical contact with that object\n\n","date":"June 4, 2012 at 7:39 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11887","author":"Matt","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"\nDavid Mo :\nBy the same procedure you conclude that if you have selected arbitrarily some features of the codex Pray that are repeated on the altar of Hamburg is because the last is “clearly inspired” in the first. \n\n“In the Shroud of Turin”, must say, not “in the first”. Sorry\n\n","date":"June 4, 2012 at 7:59 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11888","author":"David Mo","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"So you guys  are still arguing! Who can see a large cloth with an image on it anywhere here? A tomb lid as seen in many other pictures with a pattern of steps on it is said to be a picture of weaving. But why is the way the weaving is done important -it has nothing to do with the relic and is the last thing you would see . The image would come first.  Then the Charles Freeman article shows that people were being buried like this in the sixth century. Had they seen the \\Turin Shroud all over Europe by then? You must have magic glasses the rest of us don’t have if you can see the Shroud. There is not even any evidence that anyone saw a shroud as important as a relic when compared to the relics of the Cross and the Crown of Thorns. Haven’t you got carried away with the Shroud?\n\n","date":"June 5, 2012 at 4:49 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11954","author":"LyFe","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"You are wrong in so many ways, most importantly is that the weave of the cloth would be one of the most prominent features one would notice on the Shroud, and one an artist or semi-artist would depict to clarify it being a cloth and not a stone lid. The poker type burn holes would definately be the most prominent thing someone would see on the Shroud when first viewed, hense the reasoning for their depiction. You amongst others do not take into consideration the extreme ‘faintness’ of the image, as you have only seen it in pictures.(Which enhances the contrast extremely) and as opposed to other features of the Shroud.\nThe point about a lid is a rediculous and nonsensical argument, as if one views the hundreds of entombment dipictions known, only a very few show any type of lid or esophagus most will show a sepulcre or nothing at all! There is alot more symbolism shown in the pray manuscript then you know, some mentioned above by Matt and a Byzantine trait in their art. The red x’s or crosses are of a particular meaning, and one would know this if they would study Byzantine art and it’s differences to post 1204 western art.\nR\n\n","date":"June 5, 2012 at 5:38 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11961","author":"Ron","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Try googling the image files  for # entombent Christ #. An open casket, coffin or sarcophagus (call it what you want) features prominently. Some even show the lid (though I could understand an artist feeling that the latter was not obligatory and risked cluttering up the picture).\nWe can all speculate till the cows come home on possible symbolic meanings for red crosses (I’ve seen “bloodstains” suggested) but in all probability the artist merely wanted a pattern that distinguished the lid of the burial receptacle from its vacated interior while carrying a visual cue for prior Crucifixion…\nA zig zag pattern (“herring bone weave”) and four tiny circles (“L-shaped poker holes”) are simply not sufficient grounds for rejecting the most likely interpretation – a sarcophagus lid – and substituting something radically different.  In the absence of greater effort on the part of an illustrator to convey that he intended us to see a Shroud, why buy into other tendentious suggestions? The illustrator could have shown two L-patterns back-to-back instead instead of just one, or blood stains, or a much longer shroud, or dare one say a twin image – frontal and dorsal. \n It is entirely wrong in my opinion that pure conjecture – and almost certain misidentifcation – should be constantly promoted as though it were sound scholarship. It’s not – it’s no more scholarship than those anecdotal UFO sightings – most of them coming from Ufologists…\n\n","date":"June 5, 2012 at 6:16 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11965","author":"colinsberry","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"\nMatt :respectfully, that is rubbish. There is plenty of symbolic , non-literal material on the shroud. How about the alpha letter floating above the shroud, connnecting to the head figure of Christ? How about the crosses over the mid portion of the shroud, representing Christ’s contact with the shroud and the head cloth? How about the fact that Christ’s body, being taken from the cross, and then laid out on the shroud, is free of blood marks (this is clearly symbolic,or at least based on social / spiritual mores). Where I agree with you is that the artist is not a particularly skilled one. That doesn’t matter. In fact that explains things like the fact he painted crosses over the shroud, near the angel’s feet, to represent Christ’s image on the shroud.You haven’t addressed my points on the crosses, nor on the two red streaks. I think these are very valid, previously unmentioned points. I don’t think they are easy to dismiss, but I’d like to see you try….\nWell said!…It must be stressed though; Byzantine “symbolism” here. Not post fall of Constantinople western art…There was a difference!\nR\n\n","date":"June 5, 2012 at 5:13 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11959","author":"Ron","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"I note Colin has still not addressed my points re: the crosses in the middle portion of the shroud, which I have stated symbolically denote the image of Christ on the Shroud, nor the two red streaks near this area (which I interpret as blood streaks).\nPresumably he thinks these are just random artistic emphasis\nBaloney!!!!\n\n","date":"June 5, 2012 at 11:29 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11969","author":"Matt","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"I’m flattered that you should think my opinion matters regarding your having seen symbolic significance in particular details. My opinion is probably no better (and hopefully no worse) than anyone else’s. That leaves the way clear for you to make whatever interpretations you wish – but without the illustrator on hand to interrogate posthumously, those interpretations of yours fall outside the bounds of scientific enquiry. They might fall within the bounds of art history enquiry though – where I freely admit to having no knowledge or expertise – but only if you can show there are/were innumerable precedents for crosses etc being used in the way you propose). \nI’m still debating in my mind how best to respond (diplomatically) to Stephen Jones on his own blog, who has just responded to me by saying: “But it is the Shroud depicted symbolically as a medieval tomb lid. Just another example of the artist’s “artistic license” needed to fit all the information he wanted to convey in a small 235 x 150 mm space”…    \nWonderful thing, those magic putty hypotheses, ones that can be infinitely moulded or remoulded to accommodate any and all objections…. Still, I suppose one should be grateful that Jones does at least recognise that the panel with the zig zag pattern and tiny circles IS the lid of a medieval tomb, and that any link with the Shroud is purely and simply perceived symbolism on the part of the illustrator (or more likely the beholder).\n\n","date":"June 6, 2012 at 12:13 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11971","author":"colinsberry","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"An important contextual aspect is typically left out of the discussion about the Codex Pray: the diplomatic relations between Hungary and the Byzantine empire in the decades preceding 1192-1195 (dating of the Pray manuscript). From Wikipedia on Manuel I Komnenos:\n“The Hungarian heir Béla, younger brother of the Hungarian king Stephen III, was sent to Constantinople to be educated in the court of Manuel, who intended the youth to marry his daughter, Maria, and to make him his heir, thus securing the union of Hungary with the Empire. In the court Béla assumed the name Alexius and received the title of Despot which had previously been applied only to the Emperor himself. However, two unforeseen dynastic events drastically altered the situation. In 1169, Manuel’s young wife gave birth to a son, thus depriving Béla of his status as heir of the Byzantine throne (although Manuel would not renounce the Croatian lands he had taken from Hungary). Then, in 1172, Stephen died childless, and Béla went home to take his throne. Before leaving Constantinople, he swore a solemn oath to Manuel that he would always “keep in mind the interests of the emperor and of the Romans”. Béla III kept his word: as long as Manuel lived, he made no attempt to retrieve his Croatian inheritance, which he only afterwards reincorporated into Hungary”.  \nI found it very likely that Béla had seen the Shroud in Constantinople. This is most likely the location of the Shroud around 1172. Béla left Constantinople well before 1192 and remained king of Hungary until 1196. That makes a very strong connection between the Shroud and Hungary, therefore to the Pray Codex.\n\n","date":"June 5, 2012 at 5:32 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11960","author":"Mario Latendresse","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Well said Mario.  I was aware of that but forget to mention it.  And this FACT get along very well with my hypothesis that the monk who probably did the artwork never saw the Shroud himself with his own eyes but incorporate some features of the relic on the base of information he get from an authentic eye-witness of the relic while it was still conserved in Constantinople.  I think that’s the most probable explanation for the artwork contain in the Pray Codex.\n\n","date":"June 6, 2012 at 10:40 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11998","author":"Yannick Clément","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Can those who can see the Shroud in the Codex ,please explain why it is the weave that is important? When you see the Shroud exposed can you see the weave at all? Why would the artist want to show it and not the image? By this time, it was not a special weave as this was a great age of European weaving. Anyway the markings on the tomb lid are not a weave , unless you have the special glasses you are given if you are a supporter of the Shroud. No sign yet of a respected art historan who can see the Shroud in the Codex!\n\n","date":"June 6, 2012 at 12:49 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11973","author":"LyFe","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"On this particular question of weaving style, I have to say this : when you take it alone, we cannot consider this particularity of the artwork of the Pray Codex as a real link between the Shroud and this artwork because there’s others epitaphios that exist and where you can see the same weaving style that was reproduced on the linen shroud.\nThis historical fact tell me 2 things :  1- That I’m probably right when I say that the monk who did the artwork in the Pray Codex based his technique on the byzantine epitaphios.  And 2- That the first epitaphios was probably based on the Shroud and the artist who did this artwork had probably the chance to see the relic very closely in order to noticed this strange sort of weaving.\nI should also say that the reproduction of the weaving style in the artwork of the Pray Codex must be regarded along all the other particular features that are there and that we can also found on the Shroud.  It’s the sum of these similarities that permit to conclude that the artwork in the Pray Codex was most probably linked with the Shroud of Turin, directly or, most probably, indirectly…\n\n","date":"June 6, 2012 at 10:48 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11999","author":"Yannick Clément","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Usted tiene que entender cúal es el TEMA de la obra que realiza el artista.\nEl tema NO es la Sábana Santa.\nEl tema SI es “The Three Marys at the Sepulchre”.\n(“Until around 1100, the discovery of the empty tomb was the moment normally chosen to represent the Resurrection of Jesus in art, rather than showing the risen Christ himself.” Wikipedia.)\n-Los actores del drama son el Angel y las 3 mujeres (The Three Marys). \n-Jesús ha RESUCITADO y no está allí.\n¿Cómo va el artista a pintar el Angel señalando a la figura de Jesús e indicando a las 3 mujeres que NO ESTÁ ALLÍ porque ha resucitado?\nSería ININTELIGIBLE señalar a la figura de Jesús para decir que ALLÍ  NO ESTÁ.\n( ¡además LA FIGURA sería DORSAL, mostrando espalda y culo, NO puede verse la imagen FRONTAL que estaría en el reverso de la Sábana!).\n¡Escena de MUY DIFICIL solución técnica para un gran artista!. Imposible para el mediocre artista del Codex Pray que tiene que recurrir a los SIMBOLOS!\nIntente usted dibujar el tema “The Three Marys at the Sepulchre” y además mostrar la figura de Jesús en la Sábana.\nEl dibujo será ININTELIGIBLE.\n( lamento no poder expresarme en ingles, por lo que es muy probable que usted no entienda mi comentario…… )\n\n","date":"June 6, 2012 at 2:31 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11977","author":"carlos","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Well, you floated around my interpretations very nimbly, Colin.\nAt least you are admitting the limitations of science.\nYes, we will never truly know what the artist intended, but why can’t we try? That’s what artistic interpretation is, whether it is interpretation of film, painting, music etc. I’m really curious as to why you keep ignoring my comment about the two red streaks on the shroud next to the cross motifs, I can only assume one of two reasons:\n1. For some reason you think my interpretation is ludicrous and not worthy of comment – if so I’d like to know why it’s ludicrous and what the two red streaks, otherwise not seen in the art, might mean\n2. It is a compelling point and you are ignoring it because it is an inconvenient observation for your perspective\nAt this point I believe the presence of two red streaks (representing blood), next to the crosses on the herringbone weave shroud (the crosses symbolically representing the image of Jesus on the Shroud), next to the L shaped holes are COLLECTIVELY compelling reasons pointing to the image being a representation of the shroud, and therefore discrediting the carbon dating.\n\n","date":"June 6, 2012 at 3:56 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11979","author":"Matt","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Colin said:\nA zig zag pattern (“herring bone weave”) and four tiny circles (“L-shaped poker holes”) are simply not sufficient grounds for rejecting the most likely interpretation – a sarcophagus lid – and substituting something radically different.\nYou can add to the two grounds of the herringbone weave, and the L shaped holes, the two red streaks likely representing blood (why would there be blood on a lid?), and the cross motifs on the central part of the shroud, as well as the image of Jesus’ serene face behind Mary’s right arm, connected to the shroud via the “floating” intermediary “alpha” letter\n\n","date":"June 6, 2012 at 4:02 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11980","author":"Matt","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Your guess re the red streaks is as good as mine, Matt, probably better. Yes, I am indeed aware of the limitations of science, which is why I generally decline to comment on isolated features unless or until I can make a connection with something else that helps back up any conclusions.\nThose 4 pictures are replete with all kinds of puzzling or bizarre detail, some of which may be deeply symbolic, or merely decorative or imaginative elements. \nBut as I have said before, there is a startling lack of internal consistency. So while you may be correct in interpreting the two red streaks as blood, you then have to explain why there is not a single trace of blood shown in the figure above in which Christ, recently crucified but almost entirely pristine, is being anointed – not even nail wounds which appear later in Picture IV of the series. Why be so coy in one picture and not another? There is no rhyme or reason, and I for one am not desperate to get inside the mind of a medieval monk of limited artistic ability under the eagle-eyed watch of a Father Superior, the  latter with a censor’s blue pencil concealed in his habit no doubt…\nIf you really were to paint yourself into a corner on this one, Matt, there is a possible escape route. You could say that the two pictures comprising the tomb scene represented an upstairs and downstairs so to speak, and that while the “artist” did not want blood sullying the upstairs picture, he exercised a little artistic license in allowing some to drip down onto the ambiguous tomb lid-cum-shroud (that description being a belated Stephen Jones master stroke of fancy footwork that had to be coaxed out of him) responding to an artist’s gravitational force field. Oops, that’s the scientist in me starting to assert itself. I must leave you now to do your own artistic interpretation without further input from me that some uncharitable souls (of which there are a number on this site)  might consider dubious or even subversive… Subversive? Moi?\n\n","date":"June 6, 2012 at 4:47 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11983","author":"colinsberry","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Question – does anyone know if the words in the manuscript relate in any meaningful and direct way with the images?\n\n","date":"June 6, 2012 at 4:08 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11981","author":"Matt","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Postscript: one has only to google  # pray codex “lid” #  (making sure that the L-word is inside quotation marks to narrow the search) and one gets six returns on the first page alone that pointedly state that it is a tomb LID, not the Shroud as some would have us believe.\nSo why are certain “old hands” of Shroudology still posting detailed analyses of the Shroud, “as seen in the Pray Codex,”  with its alleged “herring bone weave” or “L-shaped poker holes”  making no mention whatsoever of the alternative interpretation that it is simply a patterned lid, a fairly obvious conclusion that even this ageing science bod was able to figure out all by himself, and which he now discovers through googling has all the time been the mainstream view? But one could be forgiven for not knowing that from trawling the comments on certain sites with “Shroud” and “Turin” in their titles that shall remain nameless …\nSo why are certain Shroudologists proselytising their partisan interpretation, and disingenuously omitting to mention that their view is totally at odds with mainstream opinion, indeed omitting to mention the L word at all, except for those so-called “L-shaped poker holes”?  Could it be that the Codex is seen as one of the few remaining weapons in their dwindling armoury  – a gold-plated peashooter in effect – with which to undermine trust in the accuracy or validity of the  radiocarbon dating? \n Yes, I know about the question mark over the representativeness of the sample from the one corner – the one that allegedly was the subject for some painstaking invisible re-weaving, needing end to end splicing of individual fibres no less (pull the other one) – but if that is the real objection, valid or otherwise – then let’s discuss that and not muddy the waters with those spurious comparisons with a single Codex of obscure origin that emphatically does NOT show ANY part of the Shroud in CLOSE-UP…\n\n","date":"June 6, 2012 at 7:02 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11986","author":"colinsberry","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Colin\nA big “so what” re: the google search. They are hardly authoritative expert views, just opinions. Just as my view is an opinion. You can take or leave those opinions – as I do leave them  – and people can take or leave my opinion – as you leave mine.\nI remain convinced in my opinion. I’ve heard the counter – such as your suggestion that the L shaped circles are just a random decorative element – and I disagree with them  (I think it is totally illogical that an artist would draw an asymmetrical one- off motif when his use of circles in all other motifs in the images are symmetrical and repeated, not to mention the red blood streaks, the cross motifs etc)\nBTW, I was previously doubting on the Pray Manuscript representing the Shroud. I disagreed with Stephen  Jones on several of his interpretations and continue to do so. However there are several KEY features which convince me the images in the manuscript do represent the shroud. The concentraiton of these 4-5 factors around the feet of the angel through the alpha letter to Christ’s head convince me. Had there just been one or two factors then I might not have been convinced (and  I was NOT convinced until I saw the red streaks, the cross motifs in the centre of the object, and Christ’s head)\n\n","date":"June 6, 2012 at 8:31 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11989","author":"Matt","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"I did not say they were authoritative views, Matt. I simply pointed out that 6 returns on page 1 alone made it probable that “lid”, not Shroud, was probably the mainstream view.  Google and other search engines are mere filters – I do not need reminding of that, and feel somewhat belittled by your suggestion that I do. But hey ho, that’s web forums for you. \nHere is a link to the first of the 4 Codex illustrations with further links at the bottom to the other three. Anyone can quickly confirm, if they have not done so already, that those tiny circles are a decorative element in all 4 drawings, and in a variety of situations  – angel’s wings. halos, hems and other edgings on garments, tomb lid, tomb chamber, throne, waist bands etc – enough to preclude any idea that the ones in the tomb scene – a pattern of four on the lid and 5 on the tomb chamber itself, bear any special significance.  That’s unless one is actively seeking significance, attempting to mould the observations to suit a model (instead of vice versa) and doing so in a highly selective manner that can be summarised in the term “biased approach”. When bias, especially systematic, i.e. non-accidental bias intrudes, science goes straight out of the window,\nIn fact, you have shown bias in your comment above, Matt, by referring uncritically to “red blood streaks”. They are simply red streaks. To assume they represent blood without compelling grounds for doing so is to betray bias. I personally doubt they represent blood, but shan’t go into reasons right now,\n You have allowed your prior assumptions to colour your thinking Matt. Prior assumptions are anathema where science is concerned. One must continue to look askance at any and all assumptions. Better still, dispense with assumptions altogether. Switch to using “working hypotheses”, and make those hypotheses work for their living by constantly doing stress tests on them to evaluate their predictive utility. Hypotheses without predictive utility should be dumped ASAP.\n\n","date":"June 6, 2012 at 9:21 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-11992","author":"colinsberry","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Colin\nI am afraid you are as blinded and biased as the Shroud extremists ( I note here that I am still agnostic on the shroud’s authenticity, although steer towards the pro-authenticity view).\nI’ve said repeatedly that the use of the circles on the “shroud” has a number of key differences from use of circles in other images. Namely, it is a once used motif, unlike the other applications where they are repeated motifs characteristic of a decorative pattern AND it is assymetrical unlike the use of circles in the other applications.You appear to gloss over these FACTS\nYou continue to apply a highly rigid scientific approach to artistic interpretation, which is totally inappropriate. Fine if you are studying cells under a microscope, not fine if you are trying to unravel meaning in a medieval work of art.\nYes my interpretation of the red streaks is that they are blood. What’s wrong with that? What else could they be? Until I hear a more convincing explanation I will maintain that view\n\n","date":"June 6, 2012 at 7:43 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12016","author":"Matt","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Your Google search is obviously biased by the choice of the search words. If you search for “lid”, no wonder the first matches say it’s a lid!!!\n\n","date":"June 8, 2012 at 9:11 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12090","author":"Onan the Barbarian","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Colin\nYou said:\n“I personally doubt they represent blood, but shan’t go into reasons right now”\nWhy not? Why do you doubt they represent blood? Convince me!\nmmm, let’s see, the artists just decided to randomly paint two red lines, next to a pattern of crosses  located centrally on an object otherwise having a herringbone-like pattern, next to a cloth that looks like Jesus’s head napkin sitting on the object (refer John, Jesus’ cloths (Shroud) and head cloth were left behind) , which is next to 4 circles in a L shaped pattern, which bears no resemblance to the symmetrical repeated circle motifs in other images\n\n","date":"June 6, 2012 at 7:59 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12017","author":"Matt","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Let’s suppose those zig zag red streaks that match the pattern on the tomb LID were meant to represent blood, Matt? So what? Are you saying that blood, or a representation thereof, is unique to the Shroud? If so, why is the nail wound (red) on at least one of the hands shown centre-palm in Picture IV of the series?\nWe could go on like this all day, with you listing each point of weak correspondence between Shroud and Codex, and then challenging me to prove the two are not causally linked. Sorry, but the onus is on you to prove a connection, not on me to prove there is no connection. That remains true no matter how many so-called correspondences that you or Stephen assembles. Why? Because your exercise is worthless in statistical terms. In comparing works of “art” with the Shroud, you have a sample size of 1. If you had chosen a sampling frame of say 100 works of art, fitting some arbitrary criterion, and then taken samples within that frame at random, you might find that many showed several correspondences with the Shroud. You could have drawn a distribution curve, that may or may not have had a bell-shape, and reported the mean number of correspondences, and the SD about the mean,  and then calculated the probability that the number between the Codex and Shroud was, or was not, within the limits of  sampling error with p > or < 0.05 as the conventional significance test.\n Even with this more statistically more rigorous design you would have to convince sceptics that you were being objective in what you scored as a \"correspondence\". Some, myself included, would not allow you to count a red streak as \"blood\" and therefore a \"correspondence\", nor a black cross, and nor importantly a \"herring bone weave pattern\" unless you could prove conclusively that what others see as a tomb lid was definitely a woven burial shroud.\nI suggest we leave it there, since without the crucial supporting information on what the Pray illustrator did or did not wish to convey, this discussion is leading us nowhere…\nHave you thought of getting the text translated? Or searching for  and comparing with other Hungarian codices of the era? Nope, didn't think so…. What's the Latin, or early Hungarian/Ugrian for \"tunnel vision\"?\n\n","date":"June 7, 2012 at 2:24 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12026","author":"colinsberry","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"yawn, I’m leaving it there. Your world view is seriously distorted with a bizarre obsession with scientific extremism. There’s no point in any further debate!\n\n","date":"June 7, 2012 at 2:36 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12027","author":"Matt","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Colin\nIf you go to Stephen’s wesbite he now has an extract from the book “The Sign”. The author makes the same observation as me (independently) that the circles make no sense from a decorative perspective. Note the artist is an art historian EXPERT.\n\n","date":"June 6, 2012 at 9:37 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12021","author":"Matt","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"sorry I rushed the email, it should read “note the author is an art historian EXPERT”\n\n","date":"June 6, 2012 at 9:39 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12022","author":"Matt","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"\nMatt :\nyawn, I’m leaving it there. Your world view is seriously distorted with a bizarre obsession with scientific extremism. There’s no point in any further debate!\n\n“Scientific extremism”? More like statistical precision – or, in your case, Matt – lack thereof …\n\n","date":"June 7, 2012 at 2:54 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12028","author":"colinsberry","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"\nmatt :\nThere are in fact 2 streaks of blood beneath the angel’s feet. And the face of jesus sits behind Mary’s right arm, rising up from the shroud, connecting to it through the alpha letter. The 4 holes are definitely the poker holes of the shroud, the L shaped alignment is assymetrical – if the circles were meant to be decorative then they would have been arranged symmetrically\n\nMatt: symmetric effects in the CP motifs end on the sarcophagus. Watch as the zigzag marks are broken arbitrarily with crosses, that also are inscribed on the crumpled napkin. You can not interpret the lack of symmetry as you do. It\n\n","date":"June 7, 2012 at 4:01 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12029","author":"David Mo","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Mate, estoy de acuerdo con sus comentarios.\nLa obra está llena de símbolos.\nObserve que la mano del Angel tiene 6 dedos, 5 se ven y el pulgar queda oculto.\nDavid, sus argumentos son de enorme FRAGILIDAD.\nY como apunta Mate, un EXPERTO AUTÉNTICO como Thomas de Wesselow acepta el carácter excepcional del Codex Pray y su relación con la Sábana Santa.\nTengo criterio propio porque conozco bien el arte medieval, y comprenderá que de MÁS VALOR a la opinión de Wesselow que a la opinión suya o a la de colinsberry.\n\n","date":"June 7, 2012 at 6:44 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12030","author":"carlos","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"\ncarlos :\nY como apunta Mate, un EXPERTO AUTÉNTICO como Thomas de Wesselow acepta el carácter excepcional del Codex Pray y su relación con la Sábana Santa.\nTengo criterio propio porque conozco bien el arte medieval, y comprenderá que de MÁS VALOR a la opinión de Wesselow que a la opinión suya o a la de colinsberry.\n\nI wonder if you know the work of Wesselow or is a matter of faith. Because another authentics experts aren’t so confident as you are.\nBut maybe Wesselow provides some new arguments about the Codex Pray that we have not discussed yet. It would be interesting to know.\n\n","date":"June 7, 2012 at 10:17 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12044","author":"David Mo","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Colin Berry (CB) et al are convinced on the Pray Manuscript (PMs) not representing the Shroud. However to a truly initiated eye (i.e. somebody professionally used to decipher medieval miniatures and graffiti), a thorough comparative study of the two documents may yield up to nearly 30 points of similarity among which nearly a dozen of spy details (or key features). This is more than sufficient to convince any truly honest scholar the naked Christ and Shroud images in the PMs do represent the Turin Shroud. \n For example (one among many), CB et al’s blindness (“tunnel vision”) and sheer ignorance of the Shroud very materiality does show when they cannot even detect the same step pyramid weave (as opposed to the herringbone-like shaped weave Shroud overall image on the Lirey pilgrimage badge) observable both on the PMs image and on Turin Shroud CLOSE-UPS (see e.g. C14 sample macrophotographs) implying THE MINIATURIST DID TAKE A VERY CLOSE LOOK AT THE FRONT SIDE (bearing the image) of the relic then kept in 12th century Constantinople.  \n  The very difference in accurately featuring the Shroud weave in the Pray Ms and Lirey pilgrimage badge is most telling of a very little known fact about one of the Turin Shroud weave characteristics: whether you indulge into a close or overall examination of  the weave, the latter can be evocative of a step pyramid or a herringbone.\n\n","date":"June 7, 2012 at 11:17 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12048","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"If I read you correctly, Max, you are saying that the Shroud has a weave pattern with flat-top pyramids rather than, or in addition to,  the oft-stated “herringbone twill” with pointed “Vs”.?\n Is that really what you are saying? Perhaps you could provide us with a link to back up that remarkable claim (which seems to have evaded the search engines, and is not apparent in two close-up images of the Shroud I have hastily consulted, including the samples taken for radiocarbon dating, see links below). \nIt would indeed be a remarkable coup for the authenticists if the Shroud really did have those flat-top pyramids, as per Pray Codex, and that they were not simply the product of someone’s fertile imagination….\n  \nLink to radiocarbon samples \n Link to high-definition close-up \n\n","date":"June 7, 2012 at 12:31 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12050","author":"colinsberry","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"PS:  Seeing as how I’m back to having my comments vetted, I shall now take another long holiday from this site – so any response that Max might make to my question will neither be responded to or even acknowledged.\n\n","date":"June 7, 2012 at 12:38 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12051","author":"colinsberry","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"At macroscale, the front side Turin Shroud weave does appear as a “square-topped step pyramid twil”.\n\n","date":"June 7, 2012 at 4:04 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12071","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Colin Berry, David Mo & LyFe get archaeocryptologically real…if you can!\n\n","date":"June 7, 2012 at 12:39 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12052","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"How odd. That one appeared, while the substantive comment that preceded it did not. In fact, this is what showed on my screen when I hit the send button:\nJune 7, 2012 at 12:31 pm | #89\nReply | Quote\nYour comment is awaiting moderation.\nIf I read you correctly, Max, you are saying that the Shroud has a weave pattern with flat-top pyramids rather than, or in addition to, the oft-stated “herringbone twill” with pointed “Vs”.?\nIs that really what you are saying? Perhaps you could provide us with a link to back up that remarkable claim (which seems to have evaded the search engines, and is not apparent in two close-up images of the Shroud I have hastily consulted, including the samples taken for radiocarbon dating, see links below).\nIt would indeed be a remarkable coup for the authenticists if the Shroud really did have those flat-top pyramids, as per Pray Codex, and that they were not simply the product of someone’s fertile imagination….\nLink to radiocarbon samples\nLink to high-definition close-up\n\n","date":"June 7, 2012 at 12:42 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12053","author":"colinsberry","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Typo errors: “somebody used to decipherING”; “DO show”\n\n","date":"June 7, 2012 at 1:27 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12060","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Max is back !  Awesome !  He he !\nEven if I think the weaving done in the artwork of the Pray Codex can be directly related to the Shroud, I don’t think that this particularity, alone, can allow us to conclude that way.  Why ?  Simply because there are some examples of epitaphios from the 12th century that showed the same kind of weaving.  In that respect, one can think that the monk who did the artwork in the Pray Codex didn’t based his weaving style directly on the Shroud but instead, on another epitaphios.  But nevertheless, even if that was true, I think it’s pretty logical to assume that this very particular weaving style that we found on some epitaphios is also directly related to the Shroud.\nAnyway, I think that it is always an error to evaluate the question concerning a possible direct link between the artwork of the Pray Codex and the Shroud by taking only one particular element from the whole picture…  To do a proper and intelligent evaluation of the situation, we MUST look at all the different elements together.  And when we do that, there’s not much room for another possibility than to think that there really is a direct link between the Pray Codex and the Shroud of Turin, whether it come from an artist who was a real eye-witness of the Shroud or, more probably, from an artist who received some precise information about some particular aspects of the Shroud from an eye-witness.  Here, I think mostly about the holes we see in 4 places on each side of the body images on the Shroud because, as I know, there’s no other artwork from the pre-13th century era that show holes exactly like that.  But I should also say that the other elements related to the Shroud (the nudity of Christ, his hands crossed over the pubis, the lack of thumbs, the weaving style, etc.) that we can see in the Pray Codex can also have come from an eye-witness, whether it was the artist or someone else who gave him these info, but I’m not so sure because we can see other examples of these elements in other artworks of the same era (particularly on other epitaphios).  That’s why the holes are the key to understand that the Pray Codex and the Shroud are most probably linked together.\n\n","date":"June 7, 2012 at 1:29 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12062","author":"Yannick Clément","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"I’ will email  Dan two illustrations to back up my comment. Hope Dan will publish them…\n\n","date":"June 7, 2012 at 1:40 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12064","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Is there any chance, Max, you could email them to me separately?\nscien*ebod2011@dbmail.com\n(replace the asterisk with the letter c, let’s not make life too easy for the spammers)\nThanks\n\n","date":"June 7, 2012 at 1:48 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12065","author":"colinsberry","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"\nMax Patrick Hamon :\nAt macroscale, the front side Turin Shroud weave does appear as a “square-topped step pyramid twill”.\n\nSorry to repeat myself, but could you please provide a link to support that statement (which I for one have never previously encountered in the literature, and suspect that you have neither).\n\n","date":"June 7, 2012 at 4:09 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12073","author":"colinsberry","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"\nOnan the Barbarian :\nYour Google search is obviously biased by the choice of the search words. If you search for “lid”, no wonder the first matches say it’s a lid!!!\n\nAgreed. But there were enough references to “lid” from different independent sources to be confident that it was a mainstream interpretation.  \nThe Google search was intended merely to combat the tunnel vision displayed by those who fix on one particular small drawing  – showing a feature that might just be a burial shroud,rather than a sarcophagus lid. \nEven Stephen Jones on his “not up for debate site” is now saying that it IS a lid, but intended by the artist to be symbolic of the Shroud.  (I have the greatest admiration for bloggers who are able to mind-read the intentions of medieval illustrators, given the paucity of clues, and the bewildering lack of internal consistency, like pristine hands in one picture, and nail wounds in the next (centre palm in at least one hand, which is hardly calculated to say “This artist wants you to know he has seen the Shroud”).\n\n","date":"June 8, 2012 at 9:28 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12091","author":"colinsberry","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Colin: Only from wishful thinking someone might claim that what is represented in the codex Pray is the shroud and not the sarcophagus and its lid. I made a small study on thirty images depicting the scene of the Holy Women. 25 of them represents the angel sitting on the coffin or tombstone. 12 of them represents the shroud. In 8 cases the iconic representation is the same as the Codex Pray: The angel sat on the grave with the lid open. The angel shows the tomb and the napkin crumpled to the Holy Women.\nSome significant examples: \nPsalter d’Ingeburge, Musée Condé, Chantilly, S. XII (1195 circa).\nhttp://imageshack.us/photo/my-images/856/ingeburgchantilly.jpg/\nChasse de Saint Viance, siglo XIII\n http://www.culture.gouv.fr/emolimo/viance2.htm \nReims – BM – ms. 0234 Saintes Femmes au tombeau 13e s. (fin)\nhttp://www.enluminures.culture.fr/documentation/enlumine/fr/rechexperte_00.htm, \nPontifical à l’usage de Chartres, Orléans – BM – ms. 0144, Saintes Femmes au tombeau13e s. (début)\nhttp://www.enluminures.culture.fr/documentation/enlumine/fr/rechexperte_00.htm, \nAix-en-Provence – BM – ms. 0015, Psautier à l’usage d’Arras13e s. (deuxième quart),\nhttp://www.enluminures.culture.fr/documentation/enlumine/fr/rechexperte_00.htm,  \nJaume Ferrer Bassa 1346, santas mujeres http://commons.wikimedia.org/wiki/File:3women.jpg\nOrcagna, Andrea 1370-1371, santas mujeres http://commons.wikimedia.org/wiki/File:Andrea_%28Nachfolge%29_Orcagna_001.jpg\nGospel Lectionary portion of the Bamberg Apocalypse http://commons.wikimedia.org/wiki/File:BambergApocalypse09ThreeMarysAtTomb.JPG \nThe Women at the Tomb, German, Hildesheim, about 1170s, The J. Paul Getty Museum,\nhttp://www.getty.edu/art/gettyguide/artObjectDetails?artobj=112612&handle=li\nSacramentaire De Limoges, 1100. La Résurrection. Les Saintes Femmes Au Tombeau\nhttp://www.priceminister.com/image?action=slideshow&imagestype=PRODUCT&prdimageid=854762105&productid=87830196\nAvignon – BM – ms. 0190     f. 119  Saintes Femmes au tombeau 13e s. (fin) ; 14e s. (fin)\nhttp://www.enluminures.culture.fr/documentation/enlumine/fr/rechexperte_00.htm,  (Write “Saintes Femmes au Tombeau” in box “SUJET”).\nBesançon – BM – ms. 0054     f. 019v,  Saintes Femmes au tombeau ,sautier cistercien Datation   vers 1260, http://www.enluminures.culture.fr/documentation/enlumine/fr/rechexperte_00.htm,  \nCambrai – BM – ms. 0038     f. 119 Saintes Femmes au tombeau, Antiphonaire à l’usage de Cambrai,entre 1235 et 1245, http://www.enluminures.culture.fr/documentation/enlumine/fr/rechexperte_00.htm,  \nCambrai – BM – ms. 0528     f. 004v Sujet   Saintes Femmes au tombeau, méliaire Datation   12e s. (première moitié), http://www.enluminures.culture.fr/documentation/enlumine/fr/rechexperte_00.htm,  \nDijon – BM – ms. 0113     f. 165 Sujet   Saintes Femmes au tombeau, Breviaire à l’usage de l’abbaye Saint-Bénigne de Dijon Datation   14e s. (troisième quart), http://www.enluminures.culture.fr/documentation/enlumine/fr/rechexperte_00.htm,  \nOrléans – BM – ms. 0144     f. 090 Sujet   Saintes Femmes au tombeau, Pontifical à l’usage de Chartres Datation   13e s. (début) ; http://www.enluminures.culture.fr/documentation/enlumine/fr/rechexperte_00.htm,  \nRouen – BM – ms. 0221     f. 095 Sujet   Saintes Femmes au tombeau ,   Diurnal à l’usage des dominicaines de Poissy Datation   13e-14e s. http://www.enluminures.culture.fr/documentation/enlumine/fr/rechexperte_00.htm,  \nRouen – BM – ms. 0233     f. 067 Sujet   Saintes Femmes au tombeau,   Oraisons et capitules à l’usage de l’abbaye Saint-Ouen de Rouen Datation   vers 1090, http://www.enluminures.culture.fr/documentation/enlumine/fr/rechexperte_00.htm,  \nTours – BM – ms. 0149     f. 300v Sujet   Saintes Femmes au tombeau,  Bréviaire à l’usage de Saint-Martin de Tours Datation   peu après 1323 ? http://www.enluminures.culture.fr/documentation/enlumine/fr/rechexperte_00.htm,  \nTours – BM – ms. 0193 (f. 001-142)     f. 048v Sujet   Saintes Femmes au tombeau,   Graduel à l’usage de Saint-Martin de Tours Datation   13e s. (deuxième quart ou milieu ?). http://www.enluminures.culture.fr/documentation/enlumine/fr/rechexperte_00.htm,  \nVerdun – BM – ms. 0107     f. 089v Sujet   Saintes Femmes au tombeau, Bréviaire à l’usage de Verdun Datation   vers 1302-1305? http://www.enluminures.culture.fr/documentation/enlumine/fr/rechexperte_00.htm,  \nEtc., etc.\nPS: I am interested to know when Stephen Jones acknowledges that we are talking about the tomb “lid” and not with the direct representation of a shroud. It would be a significant setback.\n\n","date":"June 9, 2012 at 2:04 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12105","author":"David Mo","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Sorry David – have only just spotted this superbly documented comment. I shall go through your links later this evening – it’s so refreshing to have a wide angle view in all matters pertaining to the Shroud…\n\n","date":"June 9, 2012 at 2:08 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12118","author":"colinsberry","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"PS: Yup, quite a few tombs and tomb lids there, David, to say nothing of discarded burial shrouds. There is a problem, however, with your links to the enluminures site – you seem to have copied the site rather than the image location…\n\n","date":"June 9, 2012 at 3:23 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12119","author":"colinsberry","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"When I first saw the reference to the Pray Codex showing the Shroud of Turin I could not think what they were talking about. As David Mo says, the second scene of the Marys is always shown, and in much better illustrations than the Pray Codex, with an empty tomb and a lid. I never imagined otherwise. I really was amazed that some people thought the tomb and its lid were the Shroud. It seems that the Pray Codex is the only picture of these scenes they have seen and that is why they are so mistaken. If you had seen the Shroud you would have shown the image which is the most important thing about it, so the Pray Codex tells us nothing. No one has answered the question of why anyone would want to venerate the kind of weaving of which the Shroud is made rather than the image and , one has to say it again, the pattern on the lid is not a picture of a woven cloth. Does anyone know who was the first person who had this crazy idea about the Shroud being seen on the Codex? Normally one wants to show relics in full, this is what the public expected to see, so why try and hide away that it is the Turin Shroud by making it ‘symbolic’, rather than showing it as it really is. The more one reads on this blog, the less one believes in the Shroud being shown. Well done, Colin Berry and David Mo for keeping up the pressure. The replies show there is no evidence to support the Shroud being shown here,\n\n","date":"June 9, 2012 at 1:40 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12117","author":"LyFe","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"\ncolinsberry :\nPS: Yup, quite a few tombs and tomb lids there, David, to say nothing of discarded burial shrouds. There is a problem, however, with your links to the enluminures site – you seem to have copied the site rather than the image location…\n\nYes. I had problems to link the concret pictures. So, I linked the search page. Just write “Saintes Femmes au Tombeau” in  the box “SUJET” and you’ll get the list. \nClearly, in the Codex Pray the angel sits on on the grave and not on the shroud, as acknowledged by Mr. Jones. But this is even more absurd. The artist puts the alleged  marks of the shroud on something other than the shroud (the grave) to point the shorud. Corrections to overcome the difficulties makes the sindonist assumption increasingly absurd.\n\n","date":"June 10, 2012 at 1:25 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12127","author":"David Mo","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Time perhaps for Mr.Jones and others to give the Pray Codex a decent burial too? Or is “I challenge you to prove me wrong” now the name of the game? If so, it’s a game in which I for one have no wish to join in … \nThere’s still loads more real research that can be done on the Shroud,  as I discovered yesterday in discussing HD images with M.Latendresse and having been made aware of his magnificent Shroudscope that had previously evaded any number of my internet searches. The Shroudscope could belatedly do for Shroudology what the magnifying glass did for forensics, helping to distinguish between macroscopic impression and microscopic reality.\n\n","date":"June 10, 2012 at 2:10 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12128","author":"colinsberry","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"PS: Try right-clicking on an image, then click “Image location” rather than “Link Location” and you should then have a specific link to the image that can be pasted elsewhere. it works – I’ve just tested it, e.g. with this one, chosen at random:\n \n\n","date":"June 10, 2012 at 2:25 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12129","author":"colinsberry","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"PPS: another crop of pictures in the same genre, notably from the Eastern Orthodox Church, can be obtained by entering # holy myrrhbearers # into one’s image search. They invariably show the three Marys, an angel, a sarcophagus with discarded shroud. Sometimes the lid is shown, sometimes not, but when shown it usually has some kind of pattern to suggest it’s a piece of monumental masonry, even in simple line drawings. \nExample:  http://stnina.org/sites/stnina.org/files/images/icon-myhrrbearers-htm.img_assist_custom-300×392.jpg\nRing any bells?\n\n","date":"June 10, 2012 at 4:10 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12131","author":"colinsberry","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Colin\nThere is a wide variety of representations of Jesus’s entombment. The majority of representations that show a sarcophagus show one WITHOUT a lid. And then there are the representations that simply show Jesus laid on a slab of stone. There is no biblical case for a sarcophagus, only references to him being entombed in a sepulchre.\nIt is well documented that a red stone slab made from porphyry was transported from Ephesus to Constantinople in the 12th century. The stone was highly venerated as that which Jesus’s body was laid upon.\nGiven this, and given the likelihood that the shroud was in Constantinople, I differ from others and interpret the lower object with red crosses as being representative  of the red stone. The object above it is then undoubtedly (refer: 4 holes in L shaped patter mirroring the shroud – sorry Colin minimal chance this is just a random decorative element  – two red streaks likely representing blood – herringbone weave type pattern – crosses under the head napkin and beyond it on the shroud near the angel’s foot representing where Christ’s body and image was imprinted into these objects)\nColin, you can continue to rationalise this matter, but the cumulative evidence strongly suggests that the images are a representation of the shroud, therefore rubbbishing the carbon tests.\n\n","date":"June 10, 2012 at 8:27 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12163","author":"Matt","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Colinsberry is right- time to give this whole idea of the Pray Codex shows the Shroud a decent burial. Medieval art shows that if one wanted to show a relic one showed it in full- there was no point in hiding it away. The defenders of the idea that the  Pray Codex shows the Shroud have had to make the Shroud in the Codex more and more obscure (once they had realised that the tomb lid was not the Shroud!!)- this is not a Dan Brown mystery where some people are trying to pass on a secret message which only a few people will be able to guess. And if you were trying to pass on a secret message why do it in this Hungarian manuscript? What is extraordinary is that anyone ever believed this idea in the first place: Christ is being shown buried according to the custom of the twelfth century, he has no beard, the Shroud is too small for the Turin Shroud, there is no image on the Shroud in the Two Marys picture, It seems that there is a separate face cloth as in other pictures of the time, the pattern on the tomb lid is not weaving and there is no reason why the way the cloth was woven should be venerated, any more than the holes in the Shroud. I suppose some people will go on thinking that they can still see the Shroud but i cannot believe anyone will believe them. There are still no medival art historians ready to come out in support! Let’s move on.\n\n","date":"June 10, 2012 at 6:19 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12132","author":"LyFe","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"In the Pray Ms miniature lower panel, the Resurrection angel (Saint Michael) is trampling down (with his left foot, hence the presence of wrinkles in addition to the square topped step pyramid weave pattern) the raised up sarcophagus lid still covered with Christ’s shroud. In most medieval Empty scenes, the sarcophagus is featured in connection with the shroud. That is an iconographic FACT Collin Berry et al tend to curiously overlook. The scene is here cryptosymbolically evocative of both the angel’s words (“He is not here”) and Christ’s victory over Death. A telling-tale couple of bloodstains are featured on the Shroud: that of the side wound associated with two long blood rivulets respectively observable on the Turin Shroud front and back sides).\n\n","date":"June 10, 2012 at 8:17 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12136","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Correction: “In  most medieval Empty Tomb scenes”\n\n","date":"June 10, 2012 at 8:19 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12137","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"“A telling-tale couple of bloodstains”\nExactly, as I have pointed out. I am yet to hear any sort of convincing rebuttal as to what these red streaks may be. Probably because there isn’t a convincing rebuttal.\nOh let’s see, just a random decorative element like the singular, asymmetrical L shaped 4 holes!!!!!!!\n\n","date":"June 10, 2012 at 8:37 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12164","author":"Matt","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"\ncolinsberry :The text that accompanies my close-up fails to appear on that link Ron. Never mind. what should be clear to all is that while there are indeed 5 holes among the red crosses, they are NOT in an L-shaped pattern. They instead form an approximate rectangle with a tail, so are totally IRRELEVANT where “L-shaped” poker holes are concerned. I also think you display a total lack of objectivity in imagining that a region of the manuscript covered with red crosses represents part of a Shroud that is elsewhere said to show a herring-bone weave, and you do not earn kudos by telling others to get glasses to see things that ARE NOT THERE.\nYou are no scientist, Ron, and I suspect you never will be, based on present performance. Maybe if you were a scientist, you would begin to understand the irritation that I and my scientifically-qualified compatriots feel about non-scientifically-qualified documentary-makers who try to tell us how to do our jobs, who hijack scientific congresses in an attempt to extricate so-called consensus views, who use their privileged access to the Shroud to adorn their blog with an HD close-up that had hitherto been kept hidden from bona fide researchers like myself, with possibly more still to come, and who, last but not least, blocks access to the comments on his site to anyone whom he perceives as off-message – his message.\nOh, and to deploy the term “heliorectal syndrome” is not the same as crudely labelling with the A word, not if you know your Greek and Latin. It is a reference to sunshine, and a subtle indication whence it can originate in some people who have too high an opinion of themselves – like prescriptionist documentary-makers who attempt to elicit scientific sound bites that chime with their own opinions instead of reporting objectively on what real scientists are actually thinking and doing…\nLack of Objectivity eh! LOL Colin seriously, have you ‘looked’ closely at the pokerhole burnhole patterns on the Shroud? The main burn pattern of the 4, actually has 5 discernable holes (and can be deduced as a (P) pattern) if one wishes, the least of the four patterns has barely 4. The artist may have been depicting this has he saw it. So no, the 5 holes to 4 holes is not irrelevant. Who’s not being objective now?\nI’m glad I’m not a scientist, if scientists prove to be as errogant, self-assured, and as blinder fitted as you. ;-)\nColin, DavidMo et.al; I’ve read and viewed all your post and linked pictures…You have all decided your experts in art, show a number of paintings etc; showing a lid and decide on your own that this depleats the importance of the Pray Codex,…simply nonsense. \nThe artist of the PC may or may not have been following a trend in the depiction of the burial scene art of the time but that does not take away from the ‘idea’ that certain liberties were not taken, in the sense that the artist in question or someone close to him had seen the Shroud in person and decided to add the several identifying marks to thier depiction. David’s argument that we must also look at things missing as opposed to things being there is right, look at most all other paintings; See anything missing? Maybe all these other artists never actiually saw the Shroud, most probable since it went missing for 150 years after the fall of Constantinople. One must not dismiss Orthodox symbolism SHOWN on the PC as opposed to all other depictions shown. THe red crosses do mean something has not only for their shape but for their colour, but you guys would know that from your extensive knowledge wouldn’t you? One must also respect the Orthodox rules of depictions of icons, to understand certain hidden(?) details.\nSimply put, in my mind, all the other paintings you have shown, although interesting, and honestly I had seen many of them before, do NOT eliminate the PC as a depiction of the Shroud…\nAs for the comments pertaining to Art Historians not being interested in the PC, I see it no different then the many scientists of the world ‘clamming-up” about the disastrous C14 dating and it’s irroneous, if not untruthful result. Bunch of self-centred, egotistical ass-wipes only worried about their reputations.\nAgain I’m glad I’m not a scientist.\nRon\n\n","date":"June 10, 2012 at 8:48 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12139","author":"Ron","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"People see what they want to see. It’s a given of human nature. That’s why science had to be invented – but scientists too can have bad days when they see only what they want to see…  That’s why scientists can appear arrogant when scrutinising  the ideas or reasoning of other scientists – or in dismissing over-assertive and/or dogmatic non-scientists for that matter. Scrutineer scientists also come in for scrutiny – so it’s not a one-way street…\nBeing accused of arrogance comes with the territory if/when one is a scientist… A scientist who has never been accused of arrogance is probably too retiring for his own good. Science is a never-ending contest between rival ideas. What matters is taking the right road, and arriving at the correct answer. Politeness is OK, provided it does not give licence to the obscurantists or obsessional agenda-pushers to hold up or derail progress…\nI think I’ve said all I want or need to say on the Pray Codex. As far as I’m concerned, that collection of derivative, artistically third-rate medieval cartoons is a total diversion from the real business of establishing HOW and WHERE the Shroud came into existence.\n\n","date":"June 10, 2012 at 9:23 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12141","author":"colinsberry","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Colin, as to your last paragraph above, I feel the same about the infamous RadioCarbon Dating taken in 1988. To truly go about the business of establishing HOW and WHERE the Shroud came into existence, we must toss the c14 to the side, as way to much effort has been put on refutting the erroneus dates concluded. More time/ effort would be better served actually convincing the Turin authorities it’s time to have the Shroud properly studied. Enough of the games already!.\nR\n\n","date":"June 10, 2012 at 10:12 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12142","author":"Ron","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Ron: the restriction of the sample area for carbon dating to one corner was unfortunate – but would you really want to see the Shroud disfigured by multiple sampling sites?\nI have for some months have been mulling over the claims that the sample came from an unrepresentative corner that had been “invisibly repaired” through devilishly clever techniques, including end-to-end splicing of individual fibres. My considered opinion re those claims – from the late Ray Rogers in particular – someone whose many ideas but minimalist experimental verification I find increasingly difficult to accept at face value – can be expressed in a single word: poppycock. Correction- two words: utter poppycock.\n\n","date":"June 10, 2012 at 10:50 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12147","author":"colinsberry","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Collin Berry et al just “never IMAGINED otherwise than an empty tomb and a lid”. Their tunnel vision is based on a very poor descriptive knowledge of the Turin Shroud and very poor amateurish medieval iconographic vista… In the Pray Ms miniature lower panel, the Resurrection angel (Saint Michael) is trampling down (with his left foot, hence the presence of wrinkles in addition to the square topped stepped pyramid weave pattern) the raised up sarcophagus lid still covered with Christ’s shroud. In most medieval Empty Tomb scenes, the sarcophagus is featured in connection with the shroud. That is an iconographic FACT Collin Berry et al tends to curiously overlook. The scene is here cryptosymbolically evocative of both the angel’s words (“He is not here”) and Christ’s victory over Death (“He is risen from the dead”). A tell-tale couple of bloodstains is featured on the Shroud: that of the side wound associated with two long blood rivulets respectively observable on the Turin Shroud front and back sides).\n\n","date":"June 10, 2012 at 10:55 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12148","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Correction (sorry): “… the Resurrection angel (Saint Michael) stands with his right hand index pointing at the empty sarcophagus with his left foot resting on its lid still covered with Christ’s shroud, hence the presence of a wrinkle line in addition to the shroud square topped stepped pyramid weave pattern ” instead of “the Resurrection angel (Saint Michael) trampling down (with his left foot… )”.\n\n","date":"June 10, 2012 at 3:38 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12156","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Max: I do not know the word “cryptosimbolism” applied to the Middle Ages. I know the words symbol, icon, sign, signal, etc.. I have read some books on medieval art and semiotic and never found neither the name nor the concept. What is your reference source?\nDo you intend to say “esoteric symbol”? \nI think you confused concepts:\nIn semiotics applied to art a symbol is an object representing an abstract idea. The empty coffin symbolizes immortality. You say that the circles and broken lines in the codex Pray are signs of another object: the shroud. Well, they are signals, but not symbols.\nAny sign or symbol is understood within a cultural framework. In the twentieth century Western culture a raised fist means “I am a communist.” In the culture of the Sumerians a raised fist meant nothing. In the world of twentieth century sindonism circles with broken lines represent the Shroud of Turin. Among sindonists the fabric weft and the “poker holes” are frequently discussed. So they can interpret the image. In the medieval cultural context, four holes and broken lines meant nothing. \nBecause nobody in the Middle Ages identified the poker holes or the weave of the Shroud of Turin. No witness referred to them until the twentieth century. These details were not significant. And this applies to the Shroud of Turin and other cloths that represent the image of Jesus in a miraculous way. A Hungarian miniaturist who had access to this information is highly unlikely. An artist who painted these things to represent the linen of Turin would be a lunatic. Nobody would have understood him. Max, his theory about the Pray codex is just absurd. It is absurd from the point of view of semiotics, history of art and mere rationality.\n\n","date":"June 11, 2012 at 1:02 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12168","author":"David Mo","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"I never said  “that the circles and broken lines in the codex Pray are signs of another object: the shroud”. Can you read me? This is not another object this is the shroud lying flat on the displaced/raised up sarcophagus lid. I very much doubt about your abilty to properly read signs, signals, symbols, cryptic and esoteric symbols and the like when you just cannot properly read simple prose!\n\n","date":"June 11, 2012 at 7:07 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12199","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Final point. Can we please know who put forward the idea that the Turin Shroud can be seen on the Codex?  Where is it argued? The idea must have come from somewhere because it is not at all obvious. Did they mistake the tomb for the Shroud? Did they really believe that the tomb lid showed weaving and why did they think the weaving was more important than the image?\n\n","date":"June 10, 2012 at 4:50 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12158","author":"LyFe","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"None another than Ian Wilson has claimed the “credit” for that, LyFe, having been inspired he says by a reproduction of the Pray Codex that he came across in Ilona Bercovits’ “Illuminated Manuscripts in Hungary”(1969). \nYou have to hand it to the man – he knows his readers – and their thirsting for any bold new interpretation that just happens to gel neatly with preconceptions…\n Link to Ian Wilson \n\n","date":"June 10, 2012 at 5:14 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12160","author":"colinsberry","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"PS: though I see Wilson says that he himself failed to spot those famous ‘poker holes’  (yeah, right) – which he says were pointed out to him by   textile conservationist Mechthild Flury-Lemberg \n\n","date":"June 10, 2012 at 5:26 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12161","author":"colinsberry","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"I was interested to come across this depiction of Christ’s entombment in a stained glass window at Chartres Cathedral. Note the shroud-like image, right hand crossed over left. Not nude because it would have been offensive. Note the red burial platform / slab.\nhttp://www.sacred-destinations.com/france/chartres-cathedral-stained-glass-photos/slides/w03_8377c-entombment\n\n","date":"June 10, 2012 at 8:49 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12165","author":"Matt","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"and the work dates from circa 1150 AD\n\n","date":"June 10, 2012 at 8:51 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12166","author":"Matt","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Platform? Slab?  Since when have platforms or slabs been so highly ornate? It’s a sarcophagus, needless to say, a standard feature of medieval depictions of the entombment, some of which show the lid, some (like this stained glass window) do not.\n If you were working in the medium of stained glass, would you bother to include the lid? If so, how, where, at what angle, and at what risk of cluttering up the scene, or getting the perspective wrong etc etc.? So much easier to leave it out, and assume that most folk will recognize a sarcophagus when they see one, and a scene in which Christ is being reverentially lowered into it. Yup, I know that a sarcophagus does not feature in the Gospel account, but that’s not the point. It DOES feature in most medieval depictions of the Entombment, with enough instances of a separate lid in the picture to remove any confusion between a burial chamber and a bare slab.\nOne cannot hope to interpret anything in isolation –  whether it be a natural history specimen or an artefact like a work of art, governed by convention or fashion. It  has to be looked at in its relevant context.Just because it might look like a slab in one picture does not make it a slab, especially when it leaves an enshrouded corpse exposed to view, bulked up with 100lbs of myrrh and aloes.\n\n","date":"June 11, 2012 at 1:29 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12170","author":"colinsberry","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"“Since when have platforms or slabs been so highly ornate?”\nAgain you are really missing the point – do you not understand what “symbolism” means?\nthe bottom object represents the red stone of unction, the crosses are not a literal depiction, rather symbolic depicting the fact that Christ was laid on that slab.\nNotwithsatnding this, there ARE depictions of an ornate stone of unction, such as that you will see in the stained glass window at Chartres (dated 1150AD), which I posted a link to above\n\n","date":"June 11, 2012 at 4:26 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12177","author":"Matt","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"historical art depictions of Jesus’s entombment often show a “sarcophagus” without a lid. In fact, what is considered to be a “sarcophagus” may not actually be a sarcophagus. It could actually be the walls of the stone of unction. Search under images in Google and you will see the stone of unction now in Jerusalem. The stone actually has walls, which project slightly above the level of the stone. Obviously some art of the entombment has shallow walls and some deep walls. The various depictions might represent a mix of objects, ie. stone of unction or sarcophagus\n\n","date":"June 11, 2012 at 4:47 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12179","author":"Matt","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"\nLyFe :\nFinal point. Can we please know who put forward the idea that the Turin Shroud can be seen on the Codex?  Where is it argued? The idea must have come from somewhere because it is not at all obvious. Did they mistake the tomb for the Shroud? Did they really believe that the tomb lid showed weaving and why did they think the weaving was more important than the image?\n\nVery good questions.\n\n","date":"June 11, 2012 at 1:08 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12169","author":"David Mo","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"So Ian Wilson has a lot to answer for. How does someone with no qualifications in this field have so much power? Is it because people will swallow anything? I expect most people will have seen Charles Freeman’s article on The Shroud of Turin and the Image of Edessa ( it is referred to in one of the earlier postings by Dan). It is interesting that Freeman suggests a whole new avenue of research on the Shroud ( tracing back the Blachernae Shroud) because Wilson’s own arguments collapse so completely for lack of evidence. Perhaps a new start here.\n\n","date":"June 11, 2012 at 2:23 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12171","author":"LyFe","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Well, it’s a lot to do with our western meeja and book publishers, innit? They will always prefer a ‘man bites dog’ story to that of a ‘dog bites man’. Either that or report something of mind-numbing boredom providing it comes from an exotic foreign-sounding name. Example: yesterday’s  article in our UK Daily Wail, sorry Mail, with  “eminent church historian Antonio Lombatti”  expounding a set of somewhat pedestrian ideas on the provenance of the Shrouds that tell one essentially zilch. (Yes, you read that correctly – “Shrouds”. )\nhttp://www.dailymail.co.uk/news/article-2157217/The-Turin-Shroud-fake-Eminent-historian-claims-40-similar-cloths-originated-1-300-years-AFTER-crucifixion.html\n\n","date":"June 11, 2012 at 2:50 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12172","author":"colinsberry","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"“Ron: the restriction of the sample area for carbon dating to one corner was unfortunate – but would you really want to see the Shroud disfigured by multiple sampling sites?”\n“Restoration” damaged the shroud more than the 1986 sampling…\nR. Roger cleverly suggested to date the shroud based on the material burnt and vacuum cleaned during the “restoration”.\nThat said, I don’t think C14 datation is a priority.\n\n","date":"June 11, 2012 at 3:58 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12175","author":"anoxie","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Lamentation of Christ. The fresco of the church of St. Panteleimon in nonresonant. 1164\n \nhttp://artyx.ru/books/item/f00/s00/z0000001/st015.shtml\n\n","date":"June 11, 2012 at 4:09 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12176","author":"Tornike Chiboshvili","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Colin.\nI’m still waiting for an explanation from you as to the meaning of the two red streaks. You had earlier said you didn’t have time to offer an explanation. That seems very convenient for you. After all, you seem to spend plenty of time here countering other arguments. Until I hear an explanation, I will assume you don’t have a better one than that the streaks represent the blood of Christ on the shroud\n\n","date":"June 11, 2012 at 4:29 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12178","author":"Matt","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"I seem to recall saying that there was no obligation on me to “explain” every stroke of the pen or brush that an artist applies to a picture, especially when it’s an unknown third rate cartoonist like the Pray illustrator.\nAs I say, the Codex is an irrelevance, and a rather silly and time-wasting one at that. You do know, I take it, that the Shroud Codex connection was made by Ian Wilson and a textile restorer, and is no more or less valid than any connection (read ‘hunch’ that helps sell books) that you or I might make. \nI am busy right now with some Shroud Scope close-ups.  tNow they offer REAL insights into the Shroud and how it was (or was not) produced. Did you know, for example, that there is no obvious evidence for a wound under the “bloodstain” on the wrist?\nI make no apology Matt for “countering other arguments” or even “spending plenty of time here”. You seem to forget that I run my own websites, some (not all) devoted entirely to the Shroud. In fact I discovered just this morning that huge chunks of my views have been quoted verbatim on a religion discussion board, see link below, so somebody appreciates my time and efforts, even if you don’t.\nhttp://www.imdb.com/board/bd0000108/thread/200070993?p=20&d=200287514#200287514\n\n","date":"June 11, 2012 at 4:58 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12181","author":"colinsberry","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"I stongly diagree that it is an irrelevance. It is highly relevant to study of the shroud, because its likely integrity discredits the carbon dating that so many skeptics rely on.\nThe fact remains that there are a number of compelling facts that strongly point to the likelihood that the images depict the shroud:\n– the rarity of nude depictions of Christ, which in itself is not necessarily so compelling but when combined with:\n– the herringbone weave like pattern\n– The presence of one motif on the shroud, which happens to comprise 4 holes in an L Shape, the likelihood that the artist chose this as a decorative feature is very small given the motif’s lack of symmetry\n– a cloth sitting on the shroud, likely representing the head napkin\n– the shroud in its central portion having crosses on it, likely representing the shroud image of Christ\n– the red streaks representing the blood on the shroud (again the likelihood that the artist just decided to whack on two red streaks for no reason is small)\n\n","date":"June 11, 2012 at 5:41 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12187","author":"Matt","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"The face HIDDEN in (Holy Virgin) Mary’s right sleeve is Joseph’s (“The Carpenter”) (see Dormition of Mary, mosaic 12th century C.E., Sicily). It allows us to identify the very first Mary as “Mary of Joseph”. However, the visual double entendre here is a cryptic wink to the attentive observer meaning there is more in the miniature than meets the eyes. That’s precisely where “CRYPTOsymbolism” or “CRYPTOperception” comes in.\n\n","date":"June 11, 2012 at 5:03 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12182","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Typo error: “more than meets the EYE”\n\n","date":"June 11, 2012 at 5:39 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12186","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Colin Berry et al’s muddy blabla will never cover up their intrinsic ignorance of the Turin Shroud and subtleties of medieval iconology when it comes to correctly interpret the Pray Ms miniatures. THAT’S A FACT.\n\n","date":"June 11, 2012 at 5:08 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12183","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"\ncolinsberry :Ron: the restriction of the sample area for carbon dating to one corner was unfortunate – but would you really want to see the Shroud disfigured by multiple sampling sites?\nI have for some months have been mulling over the claims that the sample came from an unrepresentative corner that had been “invisibly repaired” through devilishly clever techniques, including end-to-end splicing of individual fibres. My considered opinion re those claims – from the late Ray Rogers in particular – someone whose many ideas but minimalist experimental verification I find increasingly difficult to accept at face value – can be expressed in a single word: poppycock. Correction- two words: utter poppycock.\nConsidered opinion? It’s called French invisible reweaving Colin. An art that is centuries old and ‘cleverly’ can completely hide a mending, even if viewed under weak magnification. They even have books on it!! If the finding of spliced threads is not enough for you, I don’t know what to say!…But that wasn’t the point of my comment. If you had read any of my previous comments on C14 dating and you were a true/honest scientist you would agree; a single sampling, even tested several times cannot give a reliable or truthful result, especially if contamination is not known!. Therefore under those circumstances the C14 dating should have been refuted from the start!  Any expert without a reputation to loose, would agree with me 100% on those points. It is unfortunate people do not do enough studying on the subject of radiocarbon dating. If they did, they would not put so much faith or emphasis on the radiocarbon dating.\nR\n\n","date":"June 11, 2012 at 5:22 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12184","author":"Ron","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Do Colin et al really believe all “the signals” on the sacorphagus lid are just random decorative elements? Random really?\n\n","date":"June 11, 2012 at 5:33 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12185","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"yes they seem to Max. It’s totally fanciful. They compare the 4 holes to the circles forming decorative mofifs in other images, seemingly oblivious to the fact that the use of circles in other images is always in repeated patterns which are symmetrical\n\n","date":"June 11, 2012 at 5:54 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12191","author":"Matt","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Good Friday. Lamentation of Christ. The fresco in the monastery of nonresonant, Macedonia, XII century. \nhttp://www.pravoslavie.ru/foto/image5181.htm\n\n","date":"June 11, 2012 at 5:47 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12190","author":"Tornike Chiboshvili","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Spasiva Tornike. Ia znaiu.\n\n","date":"June 11, 2012 at 6:29 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12198","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"I hope I’m not expected to respond to the most recent comments from Max and Ron – since I have no intention of doing so.  I for one have desire to get further involved in their subjective ideas on symbolism between two arbitrarily chosen artefacts, or with the pros and cons of the radiocarbon sampling that have been endlessly debated previously. \nI’m more inclined to the StarTrek school of science (“real science” in my book) – going boldly where no man etc etc….\n\n","date":"June 11, 2012 at 5:55 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12192","author":"colinsberry","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Colin why do you shirk my point about the radiocarbon dating? That is REAL science. The thing is, I think you know I’m right… Thats it, isn’t it? You along with all the Shroud skeptics will not or cannot face the fact that the C14 dating is irrelevant, if not total garbage. Why? Because it is allegedly the ONLY scientific point against the Shroud. Without the C14 dating there is absolutely nothing to go against the Shroud’s authenticity, scientifically!…Don’t believe me about the C14 dating, do some honest unbiased study on the topic.\nAs for the Pray Codex, if you along with the others want to continue ignoring the details properly and want to conclude it is a tomb lid, go ahead, I could care less, especially since you’ve proved many times before you like to ignore much of the evidence put forth to you or twist it to your fancy.\nR\n\n","date":"June 12, 2012 at 7:25 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12258","author":"Ron","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"“Colin why do you shirk my point about the radiocarbon dating?”\nBecause your point was not directly relevant to the post we are discussing. You would not be the first person to attempt to divert or derail discussion by changing the subject, retreating to what you consider more secure positions.\nIf Dan were to post on the subject of the radiocarbon dating, then you would find I have quite a lot to say, most of it at the expense of those who would have us believe that all those assembled scientists and others mistook a repair patch for the real thing.  But now I too am straying off the point. The post is about whether the Pray Codex has anything useful to say about the authenticity or otherwise of the Shroud. I  have made my views crystal clear on that subject, pointing out that most if not all Pray enthusiasts have mistaken a sarcophagus lid for the Shroud itself. One does not need to be an art historian to know that those lids appear frequently in Entombment pictures from the medieval era.  Uncritically interpreting a lid as a Shroud, probably because an “artist” of his era omitted to give it 3D thickness, does not say a great deal for the mental acumen of some here who would have us believe they are experts on everything medieval.\nAs for questioning my honesty and charging me with “twisting the evidence”, you have just extracted your last comment from me Ron (under considerable duress). I am not a glutton for punishment: so any further comments you address to me here or elsewhere will henceforth be ignored unless or until you see fit to reconsider your words and provide me with an apology.\nColin Berry MSc PhD (retired scientist, currently owner of 4 blogs on science-related issues).\n\n","date":"June 12, 2012 at 7:59 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12259","author":"colinsberry","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Typo:  “… no desire etc…  Apols.\n\n","date":"June 11, 2012 at 5:57 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12193","author":"colinsberry","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Colin Berry the Eel….\n\n","date":"June 11, 2012 at 6:00 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12195","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"What about visual double entendre in the Pray Ms miniature?\n\n","date":"June 11, 2012 at 5:58 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12194","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Just too bad Dan has not published the illustrations I emailed him to back up my comment about the Turin Shroud square-topped stepped pyramid weave pattern only detectable at macrolevel. It would have confirmed the Pray Ms miniaturist did represent the Turin Shroud as early as the 12th century CE…\n\n","date":"June 11, 2012 at 6:15 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12196","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"See Pr. Giorgio TESSIORE 1996 macrographic ink drawing of a Turin Shroud front side portion (front and back covers of his monography entilted “La Santa Sindone E Il Suo Mistero”, Torino, 1997.\n\n","date":"June 11, 2012 at 6:22 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12197","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Max: I think is your speech what is “cryptic”. You don’t answer to the objections and you ignore the questions. You call “cryptosymbolic” anything you wish to see in the image. It is impossible to follow a reasonable dialogue with you. I agree with Colin’s last comment.\n\n","date":"June 11, 2012 at 7:07 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12200","author":"David Mo","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"It is cryptosymbolic when there is symbolic double, triple entendre. Get it?\n\n","date":"June 11, 2012 at 7:14 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12201","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Visual double/triple entendre may lead to cryptosymbolism. For example, in medieva times, a protective marble sarcophagus (with portholes) used to protect the unction stone. In the Entombment of Jesus, by Nicholas of Verdun (1130–1205) in Klosterneuburg Abbey,  this is precisely this sarcophagus type that is to cryptosymbolically feature Jesus’ tomb.\n\n","date":"June 11, 2012 at 7:27 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12203","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Typo error (sorry): “read “burial bench slab” instead of “unction stone”\n\n","date":"June 12, 2012 at 8:30 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12262","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"In the Pray Ms Miniature of the Emty Tomb scene, at one and the same time, the image of the unction stone sarcophagus, the unction stone slab and the Turin Shroud merged into one heavily laden cryptosymbolic image.\n\n","date":"June 11, 2012 at 7:34 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12204","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"The image is all the more cryptologically laden as the field of red crosses (inspired from Byzantine church liturgical garment known as polystaurion ‘many-crossed’) is here evocative of the hundreds of cross graffiti carved by pilgrim crusaders in the Church of the Holy Sepulchre in Jerusalem.\n\n","date":"June 11, 2012 at 9:20 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12208","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Same typo error (sorry again): “read “burial bench slab marble facing/sarcophagus” instead of “unction stone sarcophagus”\n\n","date":"June 12, 2012 at 8:33 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12263","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Typo error (sorry again): “read “burial bench slab marble facing/sarcophagus” instead of “unction stone sarcophagus” and “the burial bench slab” instead of “the unction stone slab”.\n\n","date":"June 12, 2012 at 8:37 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12264","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"David Mo, I wish you were more in the know when it comes to medieval iconological subtleties…\n\n","date":"June 11, 2012 at 7:38 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12205","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Matt has much more medieval iconological vista than any Colin Berry, David Mo & Lyfe put together…\n\n","date":"June 11, 2012 at 8:05 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12206","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":":)\n\n","date":"June 11, 2012 at 9:58 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12209","author":"Tornike Chiboshvili","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"In relic worship  the relic was exposed once or twice a year for the faithful to see it.  Look at the reports of the exposure of the Veil of Veronica in Rome. The faithful expected to see it in full .  The more the relic looked like what it was supposed to be the better, that is what aroused the veneration. You did not need to hide the relic away.\n So why would a Hungarian illustrator try and show it as a symbolic, cryptic, object when he could have shown the Shroud as it was  with an image on it? He would reach a much bigger audience if he showed it as it was.  It reminds me of Dan Brown ,only a few initiates would have known about this secret relic and they would be given special clues (e.g. the four holes) no one else would know about. So did the llustrator of the Pray Codex belong to a secret cult, passing on a message about the Shroud that he did not dare show as it really was?  We must look out for examples of art where there are four holes in a L shape, put them together in a story and then we will have a new Dan Brown bestseller! The Knights Templar and the Holy Grail will be fitted in there somehow as in any good medieval mystery!\nWe must remember what has been established: that this was the idea of Ian Wilson who certainly knows nothing about medieval art  and iconography. If Charles Freeman is right Ian Wilson does not even know when Byzantine art begins. It is not an idea which comes out of a reputable department of medieval art. So the same question repeated: why do people follow Ian Wilson?\n\n","date":"June 11, 2012 at 10:37 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12210","author":"LyFe","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"To LyFe: Do you imply serious scholars should follow you, Colin Berry the Eel and David Mo (a whole bunch of amateurs with  next to no iconological vista)? Are you kidding?\n\n","date":"June 11, 2012 at 11:36 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12215","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Ever heard of the Mystery of Christ Resurrection? “Mystery” is a key word in Christian religion.\n\n","date":"June 11, 2012 at 11:48 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12217","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"During World War II, the Turin Shroud was SECRETLY translated and hidden away….\n\n","date":"June 11, 2012 at 11:52 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12218","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"No, Max, I am not expectng anyone to follow me because I am not putting forward any theory. All I am saying is that as someone who knows a little about medieval art ( for instance, unlike some , I knew that the tomb and the tomb lid were being shown and that these patterns were not the weaving of the  Shroud), I cannot see the Turn Shroud in this Codex. I have listened to those who say they can but they have not convinced me of anything. As I have said from the very first, I cannot  understand why anyone sees the Shroud here. You have had lots of chances to prove your point but you have failed and your arguments seem to get weaker every time you try. Then I ask who first thought of this idea and all anyone can come up with is Ian Wilson who is not an art historian. So I am just left where I started, completely unconvinced that anyone has proved that one relic of many thousands known in the Middle Ages is to be seen here but only by those who can spot it. \nIt seems to me that this is a desperate attempt to find the Turin Shroud somewhere. Have you ever thought that the Turin shroud was not seen to be important by anyone because there were so many other relics that had greater prestige, like the Cross, the Crown of Thorns, the Blood of Christ, the Veil of Veronica and hundreds of others? These are all well documented and the crowds followed them. No crowds are reported for any shroud. The most important Shroud was at Cadouin where the abbey grew rich from the pilgrims visiting it. ( Now, of course, we know it is a fake but ,like the Turin Shroud ,it was a large piece of cloth, made ,in this case, by workhops in the Muslim east.)\nThe Turin Shroud is a relic cult of today ,not one of the medieval ages- we would have known more about it if it had been and it would have een illustrated properly- a large cloth with a double image of a dead man with a beard  on it. Otherwise what is the point of playing Dan Brown games?\n\n","date":"June 11, 2012 at 12:00 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12220","author":"LyFe","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"When it come to the Turin Shroud reality is more than fiction.\n\n","date":"June 11, 2012 at 12:07 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12221","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"To LyFe: You listen. Too bad you cannot see. To get aware of the square-topped stepped pyramid weave pattern (as shown in the Pray Ms lower register miniature, fol 28; PLEASE see Giorgio TESSIORE’s macrographic pen and ink drawing along with a good quality macrophograph of the Turin Shroud front side portion. You rerally need magnifying glasses…\n\n","date":"June 11, 2012 at 12:13 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12222","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Well, if you need a magnifying glass to see it, that rules out anyone seeing it before the age of magnifying glasses. You completely fail to answer the basic question, why could the Shroud not be shown as it really was if the illustrator of the Pray Codx was wanting people to know it existed. And why was it considered as, or more, important than the many thousands of other first centrury relics that were being displayed troughout Europe at this time?\nThe Turin Shroud is a reality, the theories about where it was when and how we know this are largely fiction unless and until better supporting evidence is found- I have no objections to accepting this evidence  but some reputable scholar has to actually provide it!. I am waiting!\nThis is a desperate and weak attempt to show that the Shroud existed before the carbon-14 dating – if it is the best anyone can do, it is hardly convincing.\n\n","date":"June 11, 2012 at 1:00 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12223","author":"LyFe","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"BTW Colin Berr’s links are irrelevant. When I mean a macrophotograph of a sufficient portion of the Turin Shroud front side weave pattern, I mean  a macrophotograph at a regular 24:1 scale.\n\n","date":"June 11, 2012 at 1:36 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12227","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Have you seen Dan’s current post, Max  (“Abe Lincoln assassinated”) ? \n I bet you didn’t know I have spent the last 12 years and 5 months doing a cryptosymbological analysis of the scene of the crime, Max, i.e.the exact original site of Abe Lincoln’s assassination at Ford’s Theatre Washington DC.\n Using some state-of-the-art digital re-processing techniques, together with slow, medium paced and breathtakingly fast Fourier transforms on Google Earth images, I have been able to show the presence of at least two now considerably eroded grassy knolls in the immediate neighbourhood of the theatre. But a word of caution:  they are easily mistaken by the non-cognoscenti  for the sites of a supermarket and gas filling station respectively. \nDon’t you think it amazing that there is an exact match between 4 pollen grains on the murder weapon, forming a distinctive, nay iconic  L-shape, and the uniquely hard-wearing ryegrasses on those knolls, designed to resistant trampling by small children,\nlunch-time sunbathers, lovers and assassins alike? \nThis is simply too much of coincidence, don’t you think, to be anything other than absolute unchallengeable proof that Booth was attempting to anticipate Lee Harvey Oswald by an exact century (with rounding error)?  How much longer must I wait for MY genius to be recognized on this site, secondary to yours of course (the latter being self-evident with every comment you post  ;-) ?\n\n","date":"June 11, 2012 at 1:53 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12228","author":"colinsberry","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"To Colin Berry the Mummy cooker/toaster: Don’t be jealous. Mentioning YOUR (ONLY DERISIVE) GENIUS, I do enjoy it.\n\n","date":"June 11, 2012 at 2:48 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12230","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"In the Middle Ages and Byzantine period, Christ “body and blood” on the Shroud was linked to several Christian mysteries (the Incarnation, the Resurrection, the Redemption and even the Holy Trinity). This was the “mysterious” contact relic par excellence… \nAll Turin Shroud Late Antique and Medieval pieces of evidence put together amount to a most convincing proof when seriously studied in depth.. That most of the Shroud related documents should be studied in the light of Cryptochristianism, Byzantine Iconoclasm, periods of clandestinity etc makes it rather difficult though. Hence the harsh but never desperate task for intellectually honest and serious scholars to demonstrate the Turin Shroud really is Rabbi Yeshua’s shroud in spite  of  archsceptical amateurs with next to no iconological vista and very poor descriptive knowledge of the Turin Shroud\n\n","date":"June 11, 2012 at 2:17 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12229","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Addition: “several Christian mysteries (the Book of Revelation, the Incarnation, the Redemption and even The Holy Trinity – not to mention the pseudo-hagiographyc legends, the Holy Grail and the Head in figuram baffometi of the knight Templars)”\n\n","date":"June 11, 2012 at 2:59 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12232","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"\nMax Patrick Hamon :\nTo Colin Berry the Mummy cooker/toaster: Don’t be jealous. Mentioning YOUR (ONLY DERISIVE) GENIUS, I do enjoy it.\n\n;-)\n\n","date":"June 11, 2012 at 2:54 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12231","author":"colinsberry","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"\nMax Patrick Hamon :\nI never said  “that the circles and broken lines in the codex Pray are signs of another object: the shroud”. Can you read me? This is not another object this is the shroud lying flat on the displaced/raised up sarcophagus lid. I very much doubt about your abilty to properly read signs, signals, symbols, cryptic and esoteric symbols and the like when you just cannot properly read simple prose!\n\nMax: Do not make assumptions about what I understand or not understand, please. I understand your “esoteric” chatter very well. I also understand very well that you make up “esoteric” symbols arbitrarily. I understand very well that you defend the absurd theory that the coffin lid is the shroud and the more absurd theory of “cryptic” symbols in the Codex Pray. \nI was trying to explain you some basic terminology of iconology: difference between symbol and “signal” or “index”. I see you have a problem with what “represent something” means. But don’t trust that I will continue to clarify concepts. Your esotericism not interests me at all. Sorry.\n\n","date":"June 12, 2012 at 2:42 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12240","author":"David Mo","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"To David Mo: You can try to hide behind theorical terms to deny iconological facts/most likely correct interpretations. You still don’t understand me when I wrote the Shroud is shown still lying half length flat on the displaced/raised up sarcophagus lid. CANNOT YOU STILL READ SIMPLE PROSE?\nYou don’t understand or just intellectually refuse to see the wrinkle line and rumples in connection with the angel left foot resting on the  shroud covered sarcophagus lid; OBVIOUSLY YOU ATRE IN COMPLETE DENIAL. You refuse to take into account the same square-topped stepped pyramid weave pattern observable both on the Pray Ms lower register miniature and at macrolevel in the Turin Shroud etc. Because you have next to no iconological vista and very poor descriptive knowledge of the Turin Shroud, you are just trying to make up for your ignorance by being intellectually DISHONEST. You are just demonstrating here nothing but your basic INTELLECTUAL DISHONESTY. I have wished you would have known better.\n\n","date":"June 12, 2012 at 5:35 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12242","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"BTW English is far from being the language I master most…\n\n","date":"June 12, 2012 at 5:37 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12244","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Instead of “cryptosymbolism”; I should have used “cryptic evocation”.\n\n","date":"June 12, 2012 at 6:13 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12248","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"TO David Mo: In iconology have you ever heard of SPY DETAILS?\n\n","date":"June 12, 2012 at 5:41 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12245","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"PLEASE, could “high scholar” David Mo explain to me what SPY DETAIL mean… if he knows the real meaning of the phrase.\n\n","date":"June 12, 2012 at 5:58 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12246","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"I do think the Pray Ms third panel miniature upper and lower registers are just too tricky to analyse be left to sheer amateurs such as David Mo et al. All the more so if they want to impose their very amateurish analyses to others.\n\n","date":"June 12, 2012 at 6:36 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12252","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"Correction: “TO be left” etc.\n\n","date":"June 12, 2012 at 6:37 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12253","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"+ correction: “their very amateurish AND SUPERFICIAL analyses” etc.\n\n","date":"June 12, 2012 at 6:41 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12254","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"The 12th century CE anonymous Benedictine monk either drew the Turin Shroud (hereafter TS) front side square-topped stepped pyramid characteristic weave pattern from memory or copied it from another illumination now lost. Because the characteristic weave pattern is only discernable at macrolevel (HD macrophotographs or macrographic pen & ink drawing by Tessiore), they are very few among 20th-21st century CE Shroud specialists, those who are even aware of it. In addition to ten other tell-tale details, this is what I will identify as a SPY DETAIL establishing a compelling link with the TS\n\n","date":"June 12, 2012 at 8:53 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12265","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Masterly Demolition of the Hungarian Pray Manuscript?","post":"When I say “very few”, I mean possibly Tessiore and… me.\n\n","date":"June 12, 2012 at 9:05 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12267","author":"Max Patrick Hamon","site":"shroudstory"}]
