[{"title":"Having Nightmares","post":"Hey, cool. I learned to paint watching Bob Ross. Want a picture of a mountain or a tree, I’m your guy. Need a painting of a person, well I’m almost as good as the kids in my granddaugther’s kindergarten class.\n\n","date":"April 28, 2015 at 9:12 am","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","id":"comment-197842","author":"John Green","site":"shroudstory"},{"title":"Having Nightmares","post":"Dan, I can understand how an artist may be able to paint something free hand that is the size of a standard canvass.  However, a 14 foot linen cloth may be a different story.  This is why Isabel develops an underlying “cartoon” first to make sure the proportions are correct.  I have a replica and it is a BIG canvass to try to “paint” free hand.\n\n","date":"April 28, 2015 at 10:57 am","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","id":"comment-197847","author":"Russ Breault","site":"shroudstory"},{"title":"Having Nightmares","post":"\nI am artist, painter.  I used to do replicas of famous paintings.  I included a Caravaggio, A Thomas Gainsborough and a Van Gogh that I did.  I once attempted the Shroud. It did not work out at all, I simply could not do it.    I painted the Mona Lisa and other famous paintings but The Shroud ended up looking like a disaster.   I threw it away it looked so bad.\nPhoto realism is incredibly difficult to do.\nThe Shroud of Turin would fall into the category of photo realism with some holographic observations made by people that have been up close and personal to it.   One such person made comment, “the body appeared to come up right out of the cloth”  looking at from a specific angle and disappear completely from other angles.  Those were comments made by someone who spent an entire day examining the Shroud \nI have never seen a painting or known anyone that could produce this effect with paint or with photography. \nIt is true, with perhaps some rare exception, lines are drawn when doing a painting, (I always do)  and then smoothed out later so they cannot be seen.  That also involves making fairly aggressive contact with the canvas with a brush or wet towel to hide the lines. \nThis is a 14′ piece of cloth of a very unusual weave, that I cannot in my wildest imagination ever picture any person using to make a Jesus replica/photo realism work.   \nLook at the dorsal image,\nIt looks like a XRay photo graph/ morgue photo.   \nWould anyone out there like to hang this on their wall?     The dorsal image?\n“Look at my painting”   Possible, but highly unlikely. \nIf one truly believes this is a painting.  I would suggest going to the company in Belgium that has Shroud fabric for sale.  3 or 1 herringbone twill fabric, pure linen and purchase the finest point brushes made on Earth and a half a gallon of myrrh resin for pigment to get the straw yellow color.   There is also a company that sells a 14 replica of The Shroud.  Use that as a role model and begin the work\nby making micro  tiny dots on the fabric, leaving some of the canvas colored and some uncolored. You cannot draw lines on a work like this.  Dotted.  It’s a mirror image, so you need some kind of role model to use to accurately capture rights and lefts reversed. \nThe English language does not have words to describe how incredibly difficult it would be to replicate the “look and feel” of the Shroud image using paint.\nPhoto realism is by far the hardest thing to capture on canvas.  There are only a handful artists in the world that can really pull it off.  Often they will use camera obscura to do the work and that does not guarantee it will look right.   A lot of talent involved.  \nIf a mistake is made, one would have to purchase another piece of 14′ fabric and start over again.  Long story short.   if one went to the trouble of using a 14″ piece of cloth, why not just make a imprint with a real body?  So much easier and it will be realistic looking.\nIt would be a better theory to imply both were done.  Imprint and some bizarre pigment  \nThe Shroud image reminds me of when we were kids, we would stick our faces into a copy machine and make copies.   The Shroud has that “look” to it, a very genuine look. There is a reason for that.\nI am not posting this to start a debate.  I just don’t have time.   I suggest to the person that believes this is a painting, to actually attempt to do a “Shroud replica” just to get an idea of what this would involve.  And I am saying that in a respectful sense.  Try it.\n\n","date":"May 2, 2015 at 12:26 am","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","id":"comment-198117","author":"Dave Hines","site":"shroudstory"},{"title":"Having Nightmares","post":"http://goodshepard007.imgur.com\n\n","date":"May 2, 2015 at 1:00 am","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","id":"comment-198120","author":"Dave Hines","site":"shroudstory"},{"title":"Having Nightmares","post":"These are my paintings.  A Caravaggio, A Thomas Gainsborough and Van Gogh.\nNote how different The Shroud looks compared to paintings.  \nhttp://goodshepard007.imgur.com\n\n","date":"May 2, 2015 at 1:06 am","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","id":"comment-198121","author":"Dave Hines","site":"shroudstory"},{"title":"Having Nightmares","post":"My gut feeling tells me Joseph of Arimathea obtained the Shroud Fabric from a merchant outside the Damascus Gate selling his goods for the passover.  (Likely from Syria) This was done right after he got permission from Pilate to get the body, and on his way back to Golgatha he got the closest approximation to what he could find that would substitute for a burial cloth.  A unique one of kind cloth for a very unique one of a kind person.\n\n","date":"May 2, 2015 at 1:35 am","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","id":"comment-198124","author":"Dave Hines","site":"shroudstory"},{"title":"Having Nightmares","post":"If something has happened to the Shroud to remove virtually all of the original pigment, it is sure not beyond the bounds of credibility that the outline was removed too, especially if it was in, say, charcoal, with no medium or binder to keep in in place.\n\n","date":"April 28, 2015 at 11:43 am","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","id":"comment-197850","author":"Hugh Farey","site":"shroudstory"},{"title":"Having Nightmares","post":"Sorry, Russ, I cannot imagine a worse nightmare than one with me in the star role.\n\n","date":"April 28, 2015 at 2:25 pm","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","id":"comment-197861","author":"Charles Freeman","site":"shroudstory"},{"title":"Having Nightmares","post":"I thought you might get a kick out of being in my dream!\n\n","date":"April 28, 2015 at 3:08 pm","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","id":"comment-197867","author":"Shroud Encounter","site":"shroudstory"},{"title":"Having Nightmares","post":"I am always wondering how all the pigment removed from the original painting to leave us a negative image? Furthermore it gave us  3D coding as well.\n\n","date":"April 28, 2015 at 4:39 pm","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","id":"comment-197880","author":"Sampath Fernando","site":"shroudstory"},{"title":"Having Nightmares","post":"Hi, Sampath Fernando!\nWas 3D imaging ever performed on the Sudarium of Oviedo for the purpose of comparing both sets of data (Sudarium and Shroud, VP8 analyzer)?  Do you have a link to this comparative study?  \nBest,\n\n","date":"April 30, 2015 at 7:47 pm","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","id":"comment-198054","author":"Angel","site":"shroudstory"},{"title":"Having Nightmares","post":"Hi Angel\nThe 3D imaging was prepared by Dr. Miñarro López, Professor of Sculpture at the University of Seville, Spain as mentioned in the article (see link in this thread) and illustrated in the second image. His paper is a masterly monograph and he provides all the details about how he proceeded.\nWell, Spain has done its job, now it is left to the US to do the rest. There is no point in only talking about past achievements, we should look at the future.\n\n","date":"May 1, 2015 at 9:21 am","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","id":"comment-198081","author":"Louis","site":"shroudstory"},{"title":"Having Nightmares","post":"Dan, Shroudies at your end will probably have to get beyond “tacos”, “tequila” and …. “cucaracha”. What about the outlines here?:\n https://www.academia.edu/11804110/Is_the_Sudarium_of_Oviedo_the_key_to_unraveling_the_mystery_of_the_Shroud_of_Turin\n\n","date":"April 28, 2015 at 3:24 pm","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","id":"comment-197872","author":"Louis","site":"shroudstory"},{"title":"Having Nightmares","post":"\nDavid Hines’ views, as an artist attempting to copy a picture, are interesting, if subjective. However, my own view is that the person who produced the Shroud did not really know what his finished work would look like when he started it. He was clearly, I think, not attempting to paint a picture. He was attempting to create an image which looked as if it might have been left by a sweaty body in a tomb. I think that changes some of Hines’s basic parameters.\n\n","date":"May 2, 2015 at 2:05 am","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","id":"comment-198125","author":"Hugh Farey","site":"shroudstory"},{"title":"Having Nightmares","post":"Hi Hugh, thanks for responding. Up late? Wrapped up in the Shroud? Slightly off subject, Thomas Gainsborough was a good portrait artist wasn’t he?\nI did not have a thin enough brush so I had trouble with the hair.  Colors are not as subtle.\nAnyways, If it was not for the fact the image resides on the outermost fiber of the fabric, or residing in the micro thin layer of starch fractions (As Ray Rogers believes)  and The image did not show up in a VP 8 analyzer the way it does I would say the image was a imprint of myrrh resin and blood that once covered a body.  High grade myrrh is  transparent which would not show up if backlit.  The color is right. Dr. Baima Ballone did say he found myrrh and aloes in the blood by anti body antigen testing.  For someone hard pressed to think The Shroud was a contact image, that is the direction my research would be going.  To start by covering a human cadaver in myrrh and aloes and wrapping in a shroud for 3 days and then remove it and see what you have.  If one really knew scripture and wanted the most realistic looking Jesus imprint possible, that would be the way to go.  I did it with a sculpture of Jesus once, the results were astounding.  Myrrh resin hardens and will take on the exact shape of the 3D figure.  It looked like a linen statue of Jesus afterwards.  You could even stand it up.  But such a process would not match the chemistry and physics of the Shroud image. What is really needed is for Pope Francis to allow scientists just to scrape off just a bit of the image and analyze it.   Perhaps down by the feet.  Just a tiny bit.  No big deal.\n\n","date":"May 2, 2015 at 6:39 am","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","id":"comment-198135","author":"Dave Hines","site":"shroudstory"},{"title":"Having Nightmares","post":"Correction, I meant to say metaphorically speaking.\n\n","date":"May 2, 2015 at 4:12 pm","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","id":"comment-198163","author":"Dave Hines","site":"shroudstory"},{"title":"Having Nightmares","post":"Good Afternoon, hope all is well in the UK.   Hypothetically speaking let’s say the Shroud was done using paint.\nThe artist would need a good understanding of how to paint a mirror image, lefts and rights reversed.\nAs a result of a contact image, lefts and rights are reversed, which is one of the reasons I believe a role model would be necessary to do the work.\nIt is hard to image how the rights and lefts of an image are reversed without seeing it in a mirror to be certain it is correct and to replicate the effect.\nAt some point the artist would have needed to make an imprint of a genuine human form and see how it transferred to cloth so his own depiction would be accurate.\nSide wound on linen is done correctly.  Shown on right side as would happen with a contact image.  When Image is displayed in a mirror the side wound moves the left and from the perspective of the person, would be on their right.   Which would be correct. \nIf the artist did not understand that as a result of a contact image rights and lefts are reversed the side wound would have been illustrated on the left side, not right side.\nViewing it from our perspective, not the person wrapped in Shroud. \nThis would be a work meant to be displayed/viewed in a mirror to show the true image.\nI can’t image an artist doing such a thing.  Why not just make a imprint and be done.\nIt would save time and look better.  No chance of a mistake.  \nAgain hypothetically The Shroud was painted but the\n1. Artist did not use plain weave white linen as used in Jewish Burial?!\n2. Did not illustrate wounds in the palms of the hand?!\n3. Did not illustrate eyes?!  (for the most part left the canvas unpainted in that area)\n4. Did not illustrate ears?!\n5. Did not illustrate thumbs?!\n6. Did illustrate a nude, bare butt Jesus with scourge wounds?!  (the only work that does so)\n7. Illustrated extremely excessive scourge wounds?!  Based on what historical record?\nAn early centuries or mid century  artist depicting Jesus like this would probably end up in a burial Shroud himself or at the very least not have many friends in the city/town he lived in.\n\n","date":"May 2, 2015 at 4:54 pm","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","id":"comment-198164","author":"Dave Hines","site":"shroudstory"},{"title":"Having Nightmares","post":"Like many of the classic portraitists, the Gainsborough comes quite close to being of almost photograph quality of its subject.  While complimenting David Hines’ artistic efforts (I just would not know where or how to start), I think he would admit that it lacks the tonal subtleties of the original.  While the original might even be first thought to be a photograph with its subtle treatment of light, his copy could never be thought to be anything else but a painting.   \nHowever, his comments are important, and the first that I have seen on this site by anyone with any practical experience, knowledge and competence in portrait work, as distinct from mere art critics, or art historians.  I think it signals the end of the “flaky paint” hypothesis, and we can conclude that the Shroud image was never a painting.  \nA particular comment attracted my interest, the “now-you-see-it, now-you-don’t” qualities of the Shroud image.  I wondered if this might be due, not merely to the superficiality of the image depth, but because the image pixels are confined to the very crowns of the image fibres, so that the precise angle of observation might be a factor in this subtlety.  His experiment with a myrrh-covered statue I also find intriguing, notwithstanding his comments of its not complying with the image’s chemical properties. \nI am sorry that I fail to be impressed by Hugh’s response, in attributing the image to a human agency intending to create a “sweaty imprint”.  To my mind Hugh is too locked-in to the results of the radiocarbon dating, and is unable to concede that they might be incorrect, or irrelevant.  If a  “sweaty imprint” was the intent, then a more convincing and persuasively realistic negative image as shown up by the Pia-Henri photographs could not have been so intended, and it is stretching the laws of unintended consequences to claim it as an accident.  Likewise similar comments apply to the peculiar 3-D qualities of the image.\n\n","date":"May 2, 2015 at 3:21 pm","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","id":"comment-198160","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Having Nightmares","post":"Hello of Daveb of Wellington: The only reason posted on this subject is because this is how I got involved with The Shroud in the 1st place in 2009.  I was planning to do a photo realism resurrection painting & was looking for a role model to use as Jesus.  Of course The Shroud came up.  I would be the 1st to agree my imitation of  the Thomas Gainsborough “Lady in Blue” does not match his great talent.  It is flat out incredibly difficult to paint a photo realism looking  portrait.  My original on canvas does look better than this high contrast copy,  but lacks the “super pro look”  Thomas G gets.  Quite a few steps down the scale from his work. \nHypothetically speaking,  you have 4 suspects brought in for questioning by forensic detectives to find out who is guilty of the crime/act of producing Shroud Image\nWe have\n1. Mr Paint\n2. Mr. imprint\n3. Mr. Ammonia\n4. Mr Light\nMost people would agree Shroud image is\n1. Cunning\n2. Baffling\n3. Powerful\nWhich of the 4 suspects is the most cunning, baffling and powerful?\nIf I was Mr. Light I would go for a plea bargain and/or claim temporary insanity as defense.\n“I did not know what I was doing when I produced the image, it all happened so fast”\n\n","date":"May 2, 2015 at 4:00 pm","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","id":"comment-198162","author":"Dave Hines","site":"shroudstory"},{"title":"Having Nightmares","post":"Some interesting ideas from both Daves, if somewhat misguided, as it will not surprise either of them to hear me say.\nI think Dave Hines overstates the complexity of producing a reversed image. A statement like “If the artist did not understand that as a result of a contact image rights and lefts are reversed the side wound would have been illustrated on the left side, not right side,” seems to me extraordinary. Why should an artist not understand that? It is not an intellectual challenge of any severity, I think.\nThe question “Artist did not use plain weave white linen as used in Jewish Burial?!” is relevant. A burial shroud was never going to be seen again, but a ritual liturgical object was intended to be displayed publicly, and with solemnity and deep respect. An elaborate and expensive cloth makes more sense in the liturgical scenario than the burial one, although the bible’s rich man Joseph of Arimathea’s buying of a shroud offers a counterbalance to that argument.\nAs for the other questions, they miss the point. The creator of the Shroud was not aiming at a picture of Christ as such, but at a ‘realistic’ depiction of the kind of image that might have appeared had the Shroud covered a dead man.\nDaveb misrepresents me completely. “To my mind Hugh is too locked-in to the results of the radiocarbon dating, and is unable to concede that they might be incorrect, or irrelevant.” This is nonsense, as he well knows. I have repeatedly conceded that the radiocarbon dates might be incorrect. I am also able to consider any evidence for the authenticist argument dispassionately and on its merits. On balance, as I have repeatedly explained, I think that the evidence for a medieval date is more convincing than the contrary evidence, but to claim that I am locked-in to my opinion is scurrilous.\nAs an example, I fully appreciate that both the negativity, and its corollary, the 3D quality of the image, would seem to be remarkable accidental consequences of an artist attempting to simulate a sweat-induced image. However, Colin is working on a possible procedure that might do just that. “It is stretching the laws of unintended consequences to claim it as an accident” may be true, or perhaps not. Time may tell.\n\n","date":"May 2, 2015 at 5:45 pm","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","id":"comment-198166","author":"Hugh Farey","site":"shroudstory"},{"title":"Having Nightmares","post":"I find Hugh’s response as extraordinary as he seems to find mine.  \nHis only possible reason for claiming that on balance the evidence for a medieval date is the radiocarbon dating but he is now saying that he might be incorrect (but I don’t know that he can in fact in his heart of hearts truly concede this).  His claims of “repeatedly conceding that they might be incorrect” is fresh news to me! \nThe Shroud image itself as such is hardly a convincing liturgical prop.  Its image is in fact quite elusive.  More persuasive as liturgical props are the epitaphioi, such as the Stavroniska which seems to be modeled on the Shroud image, and are known to have been used as such.  I can conceive no reason why anybody should come up with the idea that a sweaty imprint might be appropriate for such a purpose, given the highly elaborate and decorated props that liturgies have customarily used. \nAs for the suitability of the cloth for an actual shroud to wrap a dead body, we cannot know the circumstances that may well have constrained Joseph of Arimathea in his choice.  Perhaps he had intended it for his own burial, or it may have been an himation ready to hand, it was likely a public holiday and the markets were closing up for the day.  Given the extent of trade within the empire and even beyond, its origins might have been from anywhere, and it is not enough to assert that no other contemporary herring-bone linen weave from the Middle East is known.  It was not until Gamaliel II in the second century that Jewish burials became more spartan than hitherto.  \nColin has now been attempting to reproduce the properties of the image for some three years, with indifferent success only, although I applaud his perseverance.  Might we suppose that a less chemistry-informed artisan would have struck it lucky any sooner?  As one early commentator observed, Colin is more likely to end up proving the resurrection from all his efforts.\n\n","date":"May 2, 2015 at 7:34 pm","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","id":"comment-198170","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Having Nightmares","post":"\nHello Daveb, I want to say upfront I do not believe The Shroud is a imprint of myrrh.   I did some experiments with wrapping a myrrh covered3D statue in linen.  That is all. I wanted to see what would happen.  Then I exposed the “linen myrrh statue” to bright flashes of light to see how the myrrh resin would react to the light.  To see if bright light would change its color. \nPlease excuse the poor quality of these photos taken 3 years ago. I filmed the entire experiment and took several still shots but I do not  have access to them here.  This is all I have on this computer.   Myrrh resin is much like tree sap.  When exposed to the open air it will begin to harden and get sticky,  myrrh was applied to statue then wrapped in a pure linen cloth. Myrrh sticks to what it makes contact with and then hardens and makes a replica of the 3D figure it is making contact with.   Very detailed.  I recently purchased some very pure myrrh resin from Egypt and am going to run some different experiments applying it to a herringbone twill pure linen cloth.  I will photograph those results with a quality camera so you can see a decent quality photo.   These are pretty poor.  The linen will take on a 3D form and then it flattens out over time.  Myrrh is sepia, caramel color very close to what is seen on the Shroud.  That does not mean that it is myrrh on The Shroud.  I will not even get in that discussion. Just a few photos to see.  Sorry about the poor quality of these photos.\n\n","date":"May 2, 2015 at 11:38 pm","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","id":"comment-198181","author":"Dave Hines","site":"shroudstory"},{"title":"Having Nightmares","post":"Good Evening Daveb,\nI thought I would share with you some recent mathematical matches I found.\n.On a Gematria Calculator when you type in Jesus of Nazareth it comes up 1128\nWhen you type in Shroud of Turin it comes up  1128   (English Gematria)\nOk, so\nJesus of Nazareth =1128\nShroud of Turin =1128\nThen there is\nBehold the Image of Edessa =  1128\nIt’s not a painting =                  1128\nIt’s The Mandylion =                 1128\nShroud of Turin =                      1128\nA Picture of Jesus =                  1128\n3D Hologram of Jesus =            1128\nJesus of Nazareth =                 1128\nShroud is Genuine  =               1128\n3D Hologram of the King =       1128\nA Picture of the King  =            1128\nIsraeli King Jesus   =                1128\nRisen Lord Jesus =                  1128\nOn a side note.  If the middle initial of Barrie Schwortz was a C instead of a M\nHe would also be 1128.  \nThere are a few more, one was  Sudarium in Spain = 1128\nOne could say these are all coincidental matches, then there is the type of person who would say they are not coincidences.\nEach person has to\n1.Search their own heart and trust what their inner gut is telling them and/ or\n2. Conduct a mathematical/English alphabet investigation into the matter\n3. Spend time in prayer and ask a Higher Power for insight \nA combo of all three would be the best approach. .\n\n","date":"May 3, 2015 at 12:10 am","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","id":"comment-198183","author":"Dave Hines","site":"shroudstory"},{"title":"Having Nightmares","post":"Colin is continuing to do open-ended experimentation. He has just stumbled on an entirely unpredicted effect with his new cheiropoietic hand/flour/water model (Stage 1 imprinting), one that is arguably replete with possible implications re image fuzziness. It’s to do with instant adhesion, dare one suggest ‘medieval superglue’. It’s to do with instant fleecing-up of linen. Details later.\n\n","date":"May 3, 2015 at 12:22 am","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","id":"comment-198186","author":"Colin Berry","site":"shroudstory"},{"title":"Having Nightmares","post":"Hi Daveb,\n1.Galileo Galilei ” Mathematics is the language that God wrote the universe in.”\n2. PLATO “Numbers are the highest degree of knowledge, it is knowledge itself.”\n3. Saint Augustine  “Numbers are the thoughts of God”\nHere is the dark side in English Gematria\nMark of Beast= 666\nWitchcraft  =666\nSatans Seal =666\nDemonic Evil = 666\nDemon Inside = 666\nSatans Hell = 666\nThe Eden Snake = 666\nCorrupt  =666\nSlaughter =666\nNew York =666\nhttp://www.gematrix.org/\nTry out a few things and see what happens.\n\n","date":"May 3, 2015 at 12:32 am","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","id":"comment-198187","author":"Dave Hines","site":"shroudstory"},{"title":"Having Nightmares","post":"“I find Hugh’s response as extraordinary as he seems to find mine.” I do not find daveb’s response extraordinary at all. It is entirely typical of most authenticists, who like firmly to divide opinions on the shroud into two entirely separate and antagonistic camps, categorising those who do not think the shroud is genuine as anti- rather than non- authenticity, and usually as fanatical atheists desperate to bring about the downfall of Christianity. These people, we read, “ignore” all the evidence, are “locked-in” to their point of view, “unable to concede” any possible alternative. They are usually infantile morons as well. The truth, of course, is that many people, who hold both authenticist and non-authenticist opinions, are nevertheless able to understand and appreciate the views and evidence of those of the opposite opinions, and can engage in constructive debate about all of them.\nI agree with daveb, for example, that an Epitaphios serves its purpose as a metaphorical transposition of Burial Cloth to Altar Cloth, with its elaborate embroidery and clear and distinct image of Christ, and usually some people and angels as well. I pursued the idea that the Shroud itself might be an early version of such a function myself, but abandoned it for exactly the reasons daveb suggests. However, the Byzantine rites of the early centuries of the Church are far removed from those of medieval Europe, for whom a more realistic acting out of the discovery of the empty tomb, the angels and the Shroud, became encapsulated in the Quem Quaeritis ceremony. Real people represented the three Marys, others represented the angels, a real box represented the tomb and a real sheet represented the Shroud. The Shroud was brought to the altar and displayed to the people. If it bore an image (and to be fair, we have no evidence that this was customary), it was only a vague impression of the body which had lain in it, so as not to confuse it with the living presence of the risen Christ at the altar (a point made by OK some months ago). In this respect I differ from Charles Freeman, who thinks that the image was originally much brighter (but to be fair to him, pictures of the public exhibition of the Shroud do show a much clearer image, and descriptions of them seem to concur, which is why I postulated that there might have been two shrouds, one for veneration and one for exhibition).\nJust as non-authenticists differ in their interpretation of the evidence for a medieval provenance, so authenticists are also at considerable odds with each other, although they usually fragment into different camps which refuse, ignore, and are unable to accept, or at least unwilling to discuss the opinions of the others. The process by which the Shroud was formed, the attitude of the body and the Shroud itself, the events leading up to the covering of the body and, more philosophically, the meaning and possibility of a supernatural occurrence are all matters of dispute, and could fruitfully be matters of debate, if only people didn’t characterise those of a different opinion so negatively.\n\n","date":"May 3, 2015 at 3:37 am","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","id":"comment-198193","author":"Hugh Farey","site":"shroudstory"},{"title":"Having Nightmares","post":"HI Hugh, I have never read a post of yours and then thought  “Hugh is a moron”  In fact I think quite the opposite.  We certainly cannot and should not stereo type a person who believes the Shroud is authentic as being  a _________ or one who does not is a ___________.   But unfortunately  it does happen all time   I know many people not convinced of the authenticity of the Shroud, intelligent people of good moral character.  Good role models for their children. Your posts serve a positive purpose.  If a civil debate can take place, great, I am all for that. Everyone benefits from that.  To refer to a person as “anti authenticity” has a negative sound to it. Since you brought that up I am going to stop using that word.\nThe Shroud is not a salvation issue. It is a witnessing tool only.   If my belief/conviction the Shroud was authentic began and ended there, it would mean nothing.  Meaningless.  If one was to come to believe The Shroud was authentic and is physical evidence of the resurrection of Jesus it could lead to a person to consider the possibility that   “if this is true then I should be able to make contact with this person who has risen from the dead”  As crazy and as improbable as that may sound,\nBelief the Shroud is authentic could potentially  lead to a person with some type of serious issue going on with their life, be that a health issue or financial in which all previous efforts to solve the problem have failed to consider a different course of action to solve the problem. An example would be  a last resort desperate move  to ask a “Higher Power Intelligence” to solve the “impossible challenge”  Because  “nothing else has worked”\n And Lo and Behold shortly after “asking the “Higher Power” for help,  the “impossible challenge” is solved. This leaves one thinking,  “I did ask for this thing to be done and now it is”,  “Is the event of my asking the Higher Power for help and the problem being solved related or not related?’  Coincidence or not coincidence?\nOver the last 7 years I have seen enough physical evidence of the Spirit of God working in my life to be convinced beyond any reasonable doubt the Shroud is authentic.  Many of which could not be presented as evidence in a court of law type setting.   That is unfortunate.\nBelief that the Shroud is authentic can positively transform the life of another person  I know that it has for me.   It is what is done with that belief that makes the difference.  Not just the belief. There is Faith without action, and Faith with action.  The latter is the better.\nNo one wants come to the end of their life with a “What If?”  “What might have been”\nThe Shroud is kind of saying  “Give the Spirit of God a chance to work in your life”\n“All things really are possible with faith”   The message behind The Shroud. \nIn English Gemetria\nJesus of Nazareth = 1128\nShroud of Turin = 1128\nBehold the Image of Edessa = 1128\nIt’s not a painting =1128\n Shroud is genuine = 1128\nA picture of Jesus =1128\n3D Hologram of Jesus = 1128\nRisen Lord Jesus 1128\n     Are these coincidences or not?\nA numerical message left behind by the Spirit of God or not?\n\n","date":"May 3, 2015 at 5:06 pm","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","id":"comment-198226","author":"Dave Hines","site":"shroudstory"},{"title":"Having Nightmares","post":"One day,Hugh, we will have a conference dedicated to those who believe that we should be exploring the Shroud within its medieval context. Before this, we need a database of all the early depictions, both copies and pictures of expositions, and descriptions of the Shroud who saw it early on so that we have some substantial evidence to work from. I laugh when I hear  that the Shroud is the most researched artefact in history – the many  early depictions make up an immense area where no research has been done at all! And we need to ask a loom expert to the conference- none seems to be around here.\n I agree with you that when you look at all the early depictions, while there are certain features such as the Crown of Thorns and the long hair at the back of the head that appear again and again and have now disappeared, there are discrepancies between the depictions that need further exploration. Bearing in mind that the loin cloth may well have been painted on after the Council of Trent  decree of 1563, is it possible that the Shroud itself was repainted or should we be exploring two different shrouds, one faint ,one brightly painted so that it could be seen at expositions as you suggest? All open to discussion- neither of us are locked in to what might eventually be found. That is the fun of being a historian.\n\n","date":"May 3, 2015 at 4:49 am","url":"https://shroudstory.com/2015/04/28/having-nightmares/","cat":"art","id":"comment-198196","author":"Charles Freeman","site":"shroudstory"}]
