[{"title":"Here is a crowdfunding campaign we should be able to support","post":"Quote : “But the presence of that blood, now that science can detect and do so much with it, may have been the reason the Vatican effectively sabotaged the C14 test and has subsequently denied all further scientific investigation.”\nMy comment:  HERE WE GO AGAIN WITH ANOTHER CONSPIRACY THEORY VERSUS THE SHROUD.  There is surely a new documentary and/or a new book in preparation…  The “Jesus inc. consortium” is alive and well.\n\n","date":"August 9, 2013 at 10:36 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-40821","author":"Yannick Clément","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"Yannick, you may be right. Don’t scream so, however, it hurts my ears. If you are right and this is part of the storyline, we need to know much more before we can decide to throw money at this film.  I’d like to see David Rolfe comment on this.\n\n","date":"August 9, 2013 at 11:08 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-40825","author":"Paulette","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"The nice thing about fiction is that you can decide the outcome, Instead of Richard Dawkins you have a famous forger.\n\n","date":"August 9, 2013 at 11:14 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-40826","author":"Paulette","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"My speculation as to why the Vatican did what they did is purely that.  It is personal and not part of the story. That is summarised at the top of the campaign page.\n\n","date":"August 9, 2013 at 11:26 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-40830","author":"David Rolfe","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"If you don’t take such a speculation to make money out of it Mr. Rolfe, you got my admiration!  So many persons have gotten into the Shroud world in the last two or three decades just to make money out of it that it’s really disgusting to see.\nNow that I have said that, can you give us a little description of your speculation concerning the blood on the Shroud versus the Vatican’s views about this cloth?  Just curious.  If you’re honest about not wanting to make money out of it, then I don’t any good reason why you wouldn’t agree to share your thoughts here on the blog with us for free! ;-)\n\n","date":"August 9, 2013 at 1:03 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-40836","author":"Yannick Clément","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"Let me say straight away that I do hope to make money from my new film.  I am a professional film maker.  It is my living. I will not make any money unless I get the film developed and taken up by a major studio and that is what this crowd funding is for.   I did make money from my first film The Silent Witness in 1978 but the two I have made since then have lost (a lot) of money. I have returned to this subject at the end of my career because of what I know about it and as I have said in the campaign, the sense of injustice I feel.\nLet me come to the point about the blood. It is pure speculation on my part.  But something has to explain why, when it came to the crunch, the Vatican did what it did to the test.  I may well have been the “crunch”. I went to meet Professor Gonella to sign the contract I had been negotiating with him for several months on behalf of the BBC. We were going to film the test and broadcast the film about it along with the result as an exclusive. It depended on the tests being done blind, of course, and the labs signing up to the strict protocols that had been agreed in principle. \nWhen I arrived in Turin and met again with Gonella he was as white as a sheet. That morning he had just been informed “from above” that the protocols were being abandoned.  If I had signed that contract as planned that day the Vatican – as well as Turin  – would have been bound by it. Without the protocols I could not sign it. \nJean Paul II was about to leave for a trip to South America.  Cardinal Ratzinger (Pope Benedict) was his right hand man. After years of procrastination and politicking over the test with Gove and the rest of the C14 community there was now no room for delay. If the C14 had found in favor or the Shroud the clamor to follow up with every conceivable test would have been deafening and probably irresistible. The blood would have been high on the list.  Who could say what that might (and still might) yield in terms of genetic information? We could be looking at the genome of God or of a humble and delusional carpenter. \nI think it very significant that Pope Benedict made an impromptu Easter exposition of the Shroud his last act as Pope.  The cloth was on his conscience.\n\n","date":"August 9, 2013 at 2:35 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-40841","author":"David Rolfe","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"Thanks for the reply David.\nFirst, I want to clearly state this:  I have no problem to see profesionnal film maker like you doing a serious and well-documented film about the Shroud.  I saw your last one and I thought it was interesting in many aspects.\nWhat I meant with my previous comment is that, unlike documentaries like yours and some others, what makes my blood boiled is to see a book or a documentary capitalizing on complete non sense about the Shroud or on some new theories that are purely based on speculations and not on hard scientific facts.  That’s what I call “the Jesus inc. consortium”.  So, when I heard that you were talking about a pure speculation about the Shroud and the Vatican, I just wanted to learn from you if you had the idea of making a new movie that would rest on this speculative basis.  I just hope you’ll never do anything of that nature related to the Shroud…  A 3rd movie in the line of the previous 2, no problem!  But a new movie about some highly speculative hypotheses about the Shroud and/or the Vatican, that would be a shame from someone like you… \nAnd concerning the blood, as Barrie Schwortz often said in interviews, that blood is so aged and degraded that it’s highly improbable that any complete DNA profile can be obtained from it.  In this context, I just don’t see why the Vatican would be afraid of someone who could steel some particles of blood from the Shroud in order to play Dr. Frenkenstein…  If this is the reason why the Vatican is so reluctant to allow a new series of direct researches on the Shroud, I don’t know what to say…  I’m almost sure this is not the true reason.\nAnd if a complete DNA profile could ever be found from the blood on the Shroud, I don’t know what kind of genetic information could be regarded as being potentially “dangerous” for the Christian faith. Of course, there could be the problem of someone wanting to clone Jesus, but even this would not afraid me at all since the spychic and, more importantly, the soul of this person would never be the same as the one Jesus had while on Earth…  In other words, it would never be the real Jesus, so who cares?\n\n","date":"August 9, 2013 at 3:46 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-40849","author":"Yannick Clément","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"I already have previously stated mu personal belief that the Shroud has the image of Jesus Christ at the moment of his resurrection.  I do not feel I have to give anyone money for my belief.\n\n","date":"August 9, 2013 at 2:39 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-40845","author":"Emmett McMahon","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"If my eyes doesn’t fool me Emmett, what I see on the Shroud look much more like a dead Jesus after he was taken out of the cross than the Risen Lord! ;-)\nIn fact, if we would see an image of the Risen Lord on the Shroud with something like a glorious body and/or open eyes, we could start thinking like David Roemer who said elsewhere : “It was Gnostics that may have made the Shroud.”!!!\n\n","date":"August 9, 2013 at 3:30 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-40847","author":"Yannick Clément","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"Here is where you seem to be very “LOST”. What Emmett said is “AT THE MOMENT OF HIS RESSURECTION”…meaning at the precise moment of the resurrection (whatever the resurrection was), not a moment before or after. Meaning it was a human corpse till that precise moment and at that precise moment something happened which caused a instant image to form. A very quick moment later the corpse was gone (risen). Get it now?…geez.\nR\n\n","date":"August 13, 2013 at 9:58 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41182","author":"Ron","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"It is GOD we are conversing about here, you know the guy who is capable of anything.\n\n","date":"August 13, 2013 at 10:00 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41183","author":"Ron","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"\nBut the presence of that blood, now that science can detect and do so much with it, may have been the reason the Vatican effectively sabotaged the C14 test and has subsequently denied all further scientific investigation.\n\nHe should be more specific when he writes “C14 test was sabotaged”.\n\n","date":"August 10, 2013 at 3:57 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-40872","author":"anoxie","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"I would hope for the documentary he would. Otherwise I believe any reader here would have a pretty good idea of what he means, or should know, that mainly it is the changes in protocol, and as I feel, the elimination of STURP from any further tests…\nI’ve always had a ‘FEELING’ considering the big ‘show’ made that infamace day on the deciding of where to cut, that they already knew where to cut to get the most ‘unreliable’ results…This may sound simply to be speculation, but one must wonder; Of the whole 42 sq. ft. cloth, they just happened to cut the only section of the cloth that had shown to be different from the rest in certain photos…go figure.\nR\n\n","date":"August 10, 2013 at 1:30 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-40910","author":"Ron","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"Quote from Ron: “I’ve always had a ‘FEELING’ considering the big ‘show’ made that infamace day on the deciding of where to cut, that they already knew where to cut to get the most ‘unreliable’ results…”\nMy answer: If you have read carefully the book of Meacham called “The Rape of the Turin Shroud”, you should know that they had decided where to cut long before that “infamace day”, since Gonella and the Church authorities had already set-up their mind for weeks (and maybe months) prior to this morning…  Note that this information comes directly from Meacham’s book and I’m not inventing anything here.  \nAlso, if you read carefully Meacham’s book, you will noticed that the most rational (and thus, probable) reason that can explain why the authorities choose to take only one sample in that particular corner of the Shroud is not at all because they thought or knew that this action would produce a false positive result (again the conspiracy theory put forward on a purely speculative basis!) but simply because this was a corner that had already been cut once before (in 1973, so it was already “damaged” in their minds) and it was also located in one of the areas of the cloth that was the most distant from the body image (thus making the sampling of a few grams of fabric more subtle in their minds for future public showings).  \nThese 2 very probable reasons (both related to the preservation of the “good look” of the cloth much more than a desire to take the best possible samples for C14 dating) were what really drove the authorities (including their scientific adviser Gonella) to take such a bad decision, which was taken long before the sampling day (again, if we believe Meacham’s claims that we can find in his book).\nI don’t understand why so many people have so much difficulty to believe such a rational and simple explanation.  Again, if we take Occam’s razor… ;-)\n\n","date":"August 11, 2013 at 3:57 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-40993","author":"Yannick Clément","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"Ok, I didn’t get he thought of a “divine blood”. That’s far fetched.\n\n","date":"August 12, 2013 at 2:59 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41095","author":"anoxie","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"How about this thought, the Vatican has decided that The Shroud from Jesus Christ’s burial and they are of the thought that all should quit running their little tests on it – some of the tests are to make a mockery of The Christ ?\n\n","date":"August 10, 2013 at 3:54 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-40918","author":"Emmett McMahon","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"\nDavid Rolfe :\nWho could say what that might (and still might) yield in terms of genetic information? We could be looking at the genome of God or of a humble and delusional carpenter. \n\nJust curious-exactly what is the expectation here?  Which specific genes (or sequence information) in the nuclear DNA and/or mitochondrial DNA will discern between the two?\n\n","date":"August 11, 2013 at 4:45 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-40995","author":"Kelly Kearse","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"Honestly Mr. Kearse, I don’t see the point of Mr. Rolfe here…  What can we expect to find in the DNA of Jesus that could be different from any other normal human being?  Can you tell me?  Because be sure of one thing:  if Mr. Rolfe think that we could find something extraordinary in the DNA of Jesus, that means he’s not really believing in the reality of the Incarnation of God.  Again, in my mind, we’re dealing here with a concept about Jesus that is very close from the Gnostic heresy, which is an heresy that never completely disappeared all along the centuries, up until this day…\n\n","date":"August 11, 2013 at 5:44 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41000","author":"Yannick Clément","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"Complementary comment:  The popularity (it seem popular in my mind) of this notion that “something” potentially special might exist in the DNA of Jesus (which would directly and automatically refers to his divine nature) only help to prove what I often said:  The belief in the Incarnation of God in our humanity is truly the Christian dogma that is the hardest to fully believe and, even today, I’m sure the majority of Christians on this planet still do not completely believe in it…  It’s pretty sad because this belief really tells more about who is God than any speach about Jesus or his Father.\n\n","date":"August 11, 2013 at 5:49 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41001","author":"Yannick Clément","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"I would like to change the last sentence of my previous comment : It’s pretty sad because this Incarnation of God in our humanity (a God who took 100% of our human nature, except only sin and NOTHING ELSE THAN THAT) really tells more about who is God than any speach about Jesus or his Father.\n\n","date":"August 12, 2013 at 8:27 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41051","author":"Yannick Clément","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"The DNA of God might not consist of any peculiar genes, but rather a particular combination of ordinary genes, just as a particular combination of genes might predispose a child towards an excellence, given appropriate education, in Science, Athletics or the Arts.\n\n","date":"August 12, 2013 at 12:28 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41080","author":"Hugh Farey","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"What would lead us to think that we can find God in human genes?  I agree that God created the genes but they are not the source of God.\n\n","date":"August 12, 2013 at 2:11 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41088","author":"Emmett McMahon","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"If people really wants to find something that was truly different in Jesus of Nazareth versus every other human being, which made him truly a God-Man (or a Man-God), I think they should seek in the greatness of his merciful heart (we can also say « his soul ») instead of seeking to find some divine genus (or even just some talentuous genus)!   And when it comes to this kind of difference, sorry but science has nothing to do with it…  It’s just not in his domain of expertise.\n\n","date":"August 12, 2013 at 2:13 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41089","author":"Yannick Clément","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"Complementary comment:  Jesus was not Superman but Love in person…  I think understanding this can help to understand that there is nothing special to seek in his DNA…\n\n","date":"August 12, 2013 at 2:17 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41090","author":"Yannick Clément","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"We are talking about The All Powerful Almighty God who is in reality invisible.  Does God need DNA to exist ? ?  I would have to say that it is one of the Mysterious facts that we are not capable of understanding the full of. It seems to me that DNA is necessary for the material world.\n\n","date":"August 12, 2013 at 2:47 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41093","author":"ekmcmahon","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"Does God need DNA to exist ?\nMy answer:  As a material human being (Jesus) in our material universe? Most certainly…  At least, he freely choose to.\n\n","date":"August 12, 2013 at 3:46 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41100","author":"Yannick Clément","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"he choosed to.\n\n","date":"August 12, 2013 at 3:47 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41101","author":"Yannick Clément","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"chose\n\n","date":"August 12, 2013 at 6:14 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41109","author":"Hugh Farey","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"How about “it was his choice” ?  Or some variation?\n\n","date":"August 12, 2013 at 6:25 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41110","author":"Emmett McMahon","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"I should have said :  The most important thing to understand is that he freely choosed to.\n\n","date":"August 13, 2013 at 8:31 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41176","author":"Yannick Clément","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"I should have said : The most important thing to understand is that he freely chose to.  (I just read Hugh’s comment) !!!  Thanks Hugh.\n\n","date":"August 13, 2013 at 9:18 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41179","author":"Yannick Clément","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"bs david\n\n","date":"August 13, 2013 at 12:16 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41129","author":"rick","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"\nYannick Clément :\nQuote from Ron: “I’ve always had a ‘FEELING’ considering the big ‘show’ made that infamace day on the deciding of where to cut, that they already knew where to cut to get the most ‘unreliable’ results…”\nMy answer: If you have read carefully the book of Meacham called “The Rape of the Turin Shroud”, you should know that they had decided where to cut long before that “infamace day”, since Gonella and the Church authorities had already set-up their mind for weeks (and maybe months) prior to this morning…  Note that this information comes directly from Meacham’s book and I’m not inventing anything here.\nAlso, if you read carefully Meacham’s book, you will noticed that the most rational (and thus, probable) reason that can explain why the authorities choose to take only one sample in that particular corner of the Shroud is not at all because they thought or knew that this action would produce a false positive result (again the conspiracy theory put forward on a purely speculative basis!) but simply because this was a corner that had already been cut once before (in 1973, so it was already “damaged” in their minds) and it was also located in one of the areas of the cloth that was the most distant from the body image (thus making the sampling of a few grams of fabric more subtle in their minds for future public showings).\nThese 2 very probable reasons (both related to the preservation of the “good look” of the cloth much more than a desire to take the best possible samples for C14 dating) were what really drove the authorities (including their scientific adviser Gonella) to take such a bad decision, which was taken long before the sampling day (again, if we believe Meacham’s claims that we can find in his book).\nI don’t understand why so many people have so much difficulty to believe such a rational and simple explanation.  Again, if we take Occam’s razor… ;-)\n\n I have read Meacham’s book, several years ago by the way and you can think what you like and/or accept Meacham’s answers, but I don’t…Just too much weirdness surrounding the sampling choice.\nR\n\n","date":"August 13, 2013 at 12:27 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41130","author":"Ron","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"That’s your opinion Ron…\n\n","date":"August 13, 2013 at 8:31 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41177","author":"Yannick Clément","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"That’s right. You finally get it!….It’s my opinion and just as good as yours, unless you can show substantial evidence to your argument and can refute mine. Anyways the argument that the Vatican decided to pick that specific area just goes to prove my point, as they definitely already had the idea that it was contaminated (from the early cutting and investigation). So WHY pick a MOST PROBABLY contaminated area?\nR\n\n","date":"August 13, 2013 at 9:42 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41180","author":"Ron","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"I got at least one solid testimony in the person of William Meacham…\n\n","date":"August 13, 2013 at 10:10 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41185","author":"Yannick Clément","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"The ‘argument’, meaning that area was chosen because it was already damaged.\nR\n\n","date":"August 13, 2013 at 10:10 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41186","author":"Ron","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"And I already have answered your question Ron :  It was most probably to preserve the good look of the Shroud…\n\n","date":"August 13, 2013 at 10:11 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41187","author":"Yannick Clément","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"\nYannick Clément :\nI got at least one solid testimony in the person of William Meacham…\n\nHow do you get “solid testimony’ from someone’s speculation? Meacham was only speculating as to the reasons, he was not absolutely sure….Ron 1 Yannick 0….;-)\nR\n\n","date":"August 13, 2013 at 10:12 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41188","author":"Ron","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"\nYannick Clément :\nAnd I already have answered your question Ron :  It was most probably to preserve the good look of the Shroud…\n\nSo why not around one of the ‘MANY’ charred areas, if LOOKS was important lol…retarded argument, sorry.\nR\n\n","date":"August 13, 2013 at 11:00 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41193","author":"Ron","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"Ron 2, Yannick 0.  ;-)\nR\n\n","date":"August 13, 2013 at 11:04 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41195","author":"Ron","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"Ron, I think you should read again Meacham’s book with more attention.  First, his testimony about the whole “C14 affair” is one of the most credible we can find because he was in Turin when the protocol meeting was done and, after that, he kept in touch with Gonella and also with Father Rinaldi who knew everything that was going on in Turin.  So, by talking with these guys, he became fully aware of the fact that only one sample would be taken long before the sampling day mainly because the Turin authorities wanted to preserve the “good look” of the Shroud and he clearly said that Gonella fully agreed with this plan.  It is an “insider” information that we should consider very solid.  And concerning your argument that, with such a state of mind, the authorities could have agreed that multiple samples could be taken underneath the patches of the 1532 fire, again, I would like you to read again Meacham’s book because he talk in length about that aspect of the question!  Effectively, Meacham wrote in his book that this possibility was put on the table at the protocol meeting but it was eventually rejected by all the participants, mainly because of the good and scientific argument that was brought in by one of the radiocarbon expert (Bib Otlet) who clearly said to the others that taking such samples was very risky to produce an imprecise result.  Here’s what Otlet said (quote taken in Meacham’s book): “Yes, there is the burnt toast problem.  If you want to remove the butter, you have to do it before you toast the bread.”  This image was used to make understand that, by taking the charred material underneath the patches, there was a true possibility that an exchange of carbon atoms could have been done between a substance that could possibly have been present on the cloth with one of the component of linen.\nSeriously Ron, I don’t think we can reject the whole testimony of Meacham on the subject of the C14 dating just by saying it was only speculations!  One thing’s for sure: his testimony appeared to me much more credible and plausible than all the complete speculative non sense related to a conspiracy theory that would have been performed by the Church or the C14 labs!\nP.S. :  You should stop saying things like “Ron 2 Yannick 0”.  We’re not in a boxing ring, we’re here to exchange our ideas on one particular topic…\n\n","date":"August 13, 2013 at 12:59 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41197","author":"Yannick Clément","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"It is Bob Otlet and not Bib Otlet.  Error of spelling.  Sorry.\n\n","date":"August 13, 2013 at 1:00 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41198","author":"Yannick Clément","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"Interesting note:  Even though, at the protocol meeting in Turin, Meacham agreed with the others concerning the fact that there was potentially a high level of risk to date the charred material that was present underneath the patches of the 1532 fire, he wrote in his book that, later on, he changed his mind about that (mainly because of Ray Rogers, who reassured him about the validity and the relevance to date such material) and even wrote an official request to the Turin authorities (signed by many Shroud researchers, among them Rogers himself), asking them to allow a new C14 dating that would be done on the charred material that was extracted from the immediate vicinity of the burn holes in 2002 and has been preserved to this day in small bottles.  For Meacham and the others, this kind of C14 dating would only have been a kind of preliminary dating mostly intended to check out if the C14 result of 1988 was representative of the rest of the cloth or not.  The authorities never gave them a positive answer to their request and we’re still waiting for a new dating test.\n\n","date":"August 13, 2013 at 3:45 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41207","author":"Yannick Clément","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"I would like to share with all of you what I consider to be the most accurate summary of what happened just prior to the C14 dating of 1988, which help to explain the highly probable erroneous medieval result obtained by the 3 labs who did the dating.  This come from pages 87 and 88 of William Meacham’s book “The Rape of the Turin Shroud”.  Remember that Meacham was present at the protocol meeting and had good contacts with both Gonella and Father Rinaldi, so he knows what he’s talking about.  Here’s the summary he gave about the situation that prevailed just before the dating (I underlined some parts that I consider crucial to understand the dating mess of 1988 by writing them in caps lock):\n“Cardinal Ballestrero’s letter of October 1987 at last set the ball rolling towards a radiocarbon dating of the Shroud, despite the continuing and sometimes frantic machinations of the Gove-Canuto-Harbottle axis, now without Chagas, particularly in a last ditch but futile campaign to forge a united front amongst the original seven labs to insist on no reduction  in their number.  The appeal of dating the most famous relic in the world with all the attendant favorable publicity was too strong for the chosen ones to resist.  Representatives of the three labs met with Michael Tite of the British Museum and Gonella in London in January 1988, supposedly to find out if their “stringent requirements” would be met, but in fact to accept THE CONDITIONS WHICH GONELLA WAS SETTING.  The basic parameters of the new protocol were spelled out: each laboratory would send a representative to Turin to witness the sample taking which would be “under the supervision of a qualified expert”; control samples of known age would be provided by the British Museum; the whole procedure would be recorded by video; the labs would submit their results to the British Museum and a statistical institute in Turin.  A date for the sample-taking was not announced, but rumored to be in the spring.  It was hoped that results could be announced by the end of 1988.\nOne certainly felt that an historic occasion was approaching; I doubted that a bulls eye date of first century would be obtained, but was cautiously optimistic that a result would indicate some antiquity for the Shroud, perhaps back to the 4th or 5th centuries, owing to some intractable contamination.  This could be taken as a good indication that the Shroud was the genuine article.  I made one last effort to persuade Gonella of the need for the SMALL TEAM OF ADVISORY ARCHAEOLOGISTS that I had suggested, PARTICULARLY FOR THE SELCTION OF SAMPLING SITES.  Again, I put it to him in the strongest terms that A MINIMUM OF TWO SITES WAS NEEDED.  BY THIS STAGE, HE WAS NOT LISTENING, and I did not receive a response.  Fr. Rinaldi kept me informed of what he learned of the developments; and IT WAS CLEAR THAT GONELLA WAS PROUDLY RUNNING THE SHOW.  No one knew just HOW MUCH HE WAS GOING TO RUIN IT, but there was a shadow in my mind of continuing NAGGING WORRY THAT HE WOULD TAKE THE SOLE SAMPLE FROM A BAD LOCATION, AND THE SHROUD COULD BE ASSIGNED AN INCORRECT AGE.”\nThat’s it my friends!  Now, after this reading, if someone still want to claim that Gonella did a good job and that he was not responsible for the dating mess of 1988, I think this person will have to look at himself in the mirror and ask himself if he can have maybe a little bias in favor of the late Gonella, which goes just too far versus the reality and the truth!  \nSeriously, from Meacham’s testimony, it is clear that, not only the pressures coming from the C14 labs (especially Gove) to take STURP out of the picture and do the whole dating alone by themselves, but also Gonella’s antics and lack of listening to true experts in the field of radiocarbon dating (like Meacham) had a huge impact on the dating mess of 1988…  Nevertheless, it should be noted that maybe Gonella’s was somewhat forced to do what the Church authorities had decided (especially concerning the will to take just one sample in an already “damaged” corner of the cloth to preserve his “good look”) , but in the end, even if this is true, that would not be enough to make him totally not guilty concerning the most probable erroneous dating result of the Shroud’s age.  Effectively, as the official scientific advisor of the whole project, it would have been of his duty to get out of the project (or at least threaten the authorities to do so) well before the sampling day if, as Meacham’s say in his book, he knew that only one sample should be taken in one corner of the cloth.  And also, it would have been of his duty to hardly criticize the medieval result after its publication.  But unfortunately, as Meacham’s clearly wrote in his book, the official scientific advisor did nothing of that nature and, even worse, he seem to have done precisely the opposite, as he kept pushing very hard, during the months preceding the sampling day, for that only one sample should be taken instead of the 3 different samples that were originally planed.\nBut the main point of the whole thing is this:  The decision to take only one small sample from one already “damaged” corner of the cloth, no matter if this came from Gonella himself or from the Church authorities, was most certainly driven by a desire to preserve at the max the look of the Shroud.  As Meacham’s wrote in page 68 of his book: “I believe he (Gonella) genuinely wanted to limit the amount of material removed from the Shroud and any visible alteration to it, which is of course a legitimate concern, BUT HE TOOK IT TO THE EXTEME.”  The remaining question is this:  Did Gonella was the one in Turin who really choose to take only one sample in a corner of the cloth to preserve his look or did the real responsible was the Cardinal of Turin, Ballestrero?  Here’s the opinion of Meacham (found in page 69 of his book): “The pity is that Gonella involved himself so deeply in this matter and took charge at the final stage, COMMITTING A HUGE ERROR IN THE CHOICE OF SAMPLING SITE AND THE NUMBER OF SAMPLES.  At the higher level of responsibility is Ballestrero, who delegated too much power to Gonella and failed to see the dangers of this.”\nConclusion:  If we believe Meacham, the biggest responsible of the 1988 mess (at the scientific level) was Gonella and Cardinal Ballestrero was almost as guilty as him, but not on a scientific level, but only because he blindly followed the opinion of his scientific advisor without consulting or listening to other experts in the field of radiocarbon dating (like Meacham’s himself), and the principal reason of the medieval result was the choice of Gonella to take just one sample from an already “damaged” and potentially contaminated area of the cloth.  So, if we believe Meacham’s “insider” opinion on the subject, there’s absolutely no need to call for a conspiracy theory of any sort to explain the medieval result…  Instead, this mess was mainly caused by the “extreme” desire of one man (Gonella) to absolutely preserve the “good look” of the cloth, instead of making everything he could (for example, by taking at least 3 different samples and saying yes to Meacham’s suggestion to form an advisory team of archaeologists to supervised the sampling) to find the real age of the cloth.  I really don’t think we have to look elsewhere to find the real explanation for the dating mess of 1988 and, having said that, I don’t really see the need to produce another documentary on the subject.\n\n","date":"August 14, 2013 at 8:25 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41251","author":"Yannick Clément","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"Yannick, suppose you had been responsible for delivering the C-14 samples to the labs. How would you have done it? Would you have taken three 1cm square samples from different areas of he cloth, one for each lab; or would you have taken three 3cm square samples, and divided them so that each lab received three samples, one from each area? And whereabouts on the cloth would you have taken the samples from? This was presumably the problem that Gonella faced, and I should be interested to know how somebody else would have tackled it.\n\n","date":"August 14, 2013 at 8:36 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41252","author":"Hugh Farey","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"Since it is a fact that Baima Bollone was allowed by the Turin authorities in 1978 to take some small threads from the cloth for his analyses (by the way, I never heard this had a visible impact on the look of the cloth), I don’t see why this kind of precise thread sampling could not have been done also in 1988 for different areas of the cloth.  Remember that there was no need at that time to take a huge amount of material for the dating…  Look, in all logic,\nthis particular kind of thread sampling could even have been done for threads located on the backside of the cloth, preventing even more the risk of making a visible impact on the cloth.\nSome will say that taking these kind of small threads here and there on the cloth would have been risky because some of those could have come from another cloth than the Shroud itselfm but if a proper microscopic and chemical analysis would have been done by STURP after the sampling of those threads and before the C14 dating by the labs, the risk of dating another piece of fabric than the Shroud would have been near absolute zero.\nThis is the kind of sampling and dating that should have been performed in 1988 in order to really find the true age of the Shroud.  But as Meacham said in his book, that was not the main priority of Gonella and the Turin authorities!  Their main priority was to prevent any noticeable damage to the cloth.  And to take the words of Meacham: Gonella pushed that notion to the extreme…  There’s no doubt in Meacham’s mind (and in my mind also) that, as a scientific advisor, he could have done a much better job in 1988.  And as I said, if he was somehow manipulated by the Turin authorities (note that this is not what Meacham said in his book), then he should have drop out of the project well before the sampling day.  This would have been much better than to stay on board of such a bad directed project.\n\n","date":"August 14, 2013 at 10:49 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41259","author":"Yannick Clément","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"Individual threads. The labs wanted 40mg, the shroud has a density of about 25mg/cm2, and the warp/weft numbers are about 40/30 per cm. Therefore in a square cm of shroud there are about 70 threads, each weighing about 0.36mg. To make up a lab requirement Riggi and Gonella would have had to cut about 110 1cm threads per lab, maybe making each one 3cm long and cutting it in three so that each lab could have exactly the same make-up of its samples. 110 threads, each 3cm long. Is that what you had in mind?\n\n","date":"August 14, 2013 at 12:47 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41264","author":"Hugh Farey","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"Yes.  Extracting those here and there on the Shroud would not have had a huge impact in my mind, especially if they would have extracted them on the backside of the cloth (to do this, of course, they should have taken the Holland cloth off the Shroud).\nOne thing’s for sure:  Today, there would not be an important number of threads needed to do a new C14 and, in my mind, that would be the best way to do an accurate dating while preserving the look of the cloth.\nIf Baima Bollone was able to remove a few small threads in 1978 without making a visible impact on the relic, I don’t see why this could not be done again.\n\n","date":"August 14, 2013 at 1:01 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41267","author":"Yannick Clément","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"Last note:  Even if my idea of a sampling of scattered threads would not have been feasible in 1988, that doesn’t change a thing about the most probable reason (i.e. the preservation of the look of the Shroud) that explain why they choose to take only one sample in a very risky area of the cloth and that doesn’t change a thing also about the fact that Gonella is one of the main responsible of this dating mess.\n\n","date":"August 14, 2013 at 1:57 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41270","author":"Yannick Clément","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"Was Gonella a scientist ? People responsible for the dating are the one who signed the paper.\n\n","date":"August 15, 2013 at 7:45 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41329","author":"anoxie","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"Yes, he was. See http://www.shroud.com/pdfs/n67part8.pdf.\n\n","date":"August 15, 2013 at 7:55 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41331","author":"Hugh Farey","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"In hisbook, Meacham fully recognized the fact that Gonella was a true scientist but, at the same time, he said that, to his knowledge, he did not knew too much about radiocarbon dating (on the contrary to archaeologists like Meacham himself!)…\n\n","date":"August 15, 2013 at 8:27 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41334","author":"Yannick Clément","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"\nHugh Farey :\nYannick, suppose you had been responsible for delivering the C-14 samples to the labs. How would you have done it? Would you have taken three 1cm square samples from different areas of he cloth, one for each lab; or would you have taken three 3cm square samples, and divided them so that each lab received three samples, one from each area? And whereabouts on the cloth would you have taken the samples from? This was presumably the problem that Gonella faced, and I should be interested to know how somebody else would have tackled it.\n\nI’ll tell you how I would have done it;\nIt’s so simple, one questions the intelligence of the people responsible. Samplings taken from any location ‘centrally-located’ on the Shroud would have been optimal. The numerous charred areas or areas immediately adjacent to them would have been ideal areas in which to extract samples and could have been done from ‘several’ different areas of the Shroud without excessive visible alteration to the Shroud and therefore giving a substantially better ‘representation’ of the whole Shroud.. In fact I believe in 2002 this was actually done during the so-called restoration…fairly large areas were actually removed from the charred areas! So why not in 1988 when it would have been paramount to achieving an accurate c14 reading? Furthermore, to achieve a more reliable conclusion both AMS and the older liquid counter method would have been prudent; at the time a more trusted/reliable method of c14 testing then AMS. This would have of course required a single much larger sample to be extracted, but just one. One must also remember AMS was still in it’s infancy and had not proven to that point to be very reliable, failing miserably in earlier trial runs. The point is, if whomever was responsible for the extracting actually ‘listened’ to the various c14 experts, including Meacham, they would have or should have known this. Therefore, I would conclude there was no substantial reason NOT to extract several proper sized samples from disparate areas of the cloth and that there was several areas to do so, without substantially changing the appearance of the Shroud.\nR\n\n","date":"August 16, 2013 at 10:25 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41410","author":"Ron","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"If you read again Meacham’s book Ron, you will note that the question of sampling the charred material around the fire holes was a possibility that was totally rejected at the protocol meeting in Turin that was done before the sampling of 1988 and even Meacham himself was against this kind of unsure sampling.\nLater on, after the 2002 restoration, Meacham made a full turn of 180 degree about that because Ray Rogers convinced him that such a material was very good and not that risky for an accurate C14 dating.  At that point in time, Meacham, Rogers and other Shroud researchers wrote to Turin and ask the authorities to do a new C14 dating with the charred material that has been scraped away from the 1532 fire holes and well preserved in glass bottles during the 2002 restoration.  If I remember well, the Turin authorities did not even send them an answer!!!\n\n","date":"August 16, 2013 at 10:50 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41412","author":"Yannick Clément","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"Who cares! …Yannick you seem to think you alone have read books (closely) and maintain the ‘real’ knowledge. As I stated before I have read Meacham’s book, twice actually, along with dozens of others and have studied the process of radiocarbon dating in detail. I am completely aware of all that went on leading to the 1988 c14 fiasco, and my point stands…If they had used some common-sense, my idea of how it should have been tackled should have been followed…Why they ‘truly’ did not, is the million dollar question and ridiculous to think it was simply due to aesthetics. Furthermore, I do not need to rely simply on Meacham’s book, to come to my conclusions. I can think for myself. \nR\n\n","date":"August 16, 2013 at 1:11 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41414","author":"Ron","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"All I say is that your idea was put on the table at the protocol meeting and eventually rejected by every one who was there, including Meacham.  I don’t say this particular sampling idea is not good however.  As I said, even Meacham changed his mind about that.  So, maybe this could have been the best solution, but it was not kept by the specialists that were there in Turin, because they judged it too risky for contamination and exchange of C14 atoms with some products that could have been present on the cloth at the time of the fire of 1532.\nPersonally, I still think a proper sampling of small pieces of threads taken here and there on the backside of the cloth would offer a very good cluster of dates that could give us a very accurate average age for the cloth, without damaging it too much and while preserving its “good look” for public exhibitions.\n\n","date":"August 16, 2013 at 2:09 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41417","author":"Yannick Clément","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"\nYannick Clément :\nAll I say is that your idea was put on the table at the protocol meeting and eventually rejected by every one who was there, including Meacham.  I don’t say this particular sampling idea is not good however.  As I said, even Meacham changed his mind about that.  So, maybe this could have been the best solution, but it was not kept by the specialists that were there in Turin, because they judged it too risky for contamination and exchange of C14 atoms with some products that could have been present on the cloth at the time of the fire of 1532.\nPersonally, I still think a proper sampling of small pieces of threads taken here and there on the backside of the cloth would offer a very good cluster of dates that could give us a very accurate average age for the cloth, without damaging it too much and while preserving its “good look” for public exhibitions.\n\nBack in 1988 you could NOT just take small pieces of thread from here and there and do a proper c14 dating. You needed a minimum of 5mg of pure carbon to achieve a proper test sampling, which meant an original sampling weight of approx. 23 mgs to start with. That would require a fair size piece. Approximately 1/2 of the 50mg pieces given to each lab. Today it can be achieved with as little as 2-3mg pure carbon.\nTaking thread samples from all over the place and bundling them to achieve the weight would be counter productive because you’d be mingling the sample areas. As I said before; areas immediately adjacent to the scorch’s would have been ideal and they almost certainly should have been aware of this back then. Ray Rogers was not the first to realize the potential of the scorched areas as being good areas as samples, in fact any knowledgeable c14 scientist or technician would have been aware of this, even Meacham, although he is no c14 scientist.\nR\n\n","date":"August 16, 2013 at 5:34 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41424","author":"Ron","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"So why didn’t they do that? Setting aside deliberate dishonesty, I don’t think we can dismiss Gonella, Riggi or the others present as stupid. Gonella, especially, had been in contact with the leading researchers in the field for months. Gove, Meacham and others had indeed been listened to, and their views considered. I think there were two main reasons for not using pieces from under the patches, and although neither of them hold much water today, they were major factors at the time.\nThe most important I think was that at the time they really thought there was a good chance that combustion could skew a C-14 dating. I don’t know whether that was based on evidence or just suspicion, but it does seem to have been a serious consideration, and even before the dating was carried out, would have had proponents of both sides claiming that if the date was not what they wanted, it was because of changes to the C-14 content due to the circumstances of the 1532 fire. Neither Gove nor Meacham could guarantee that this was impossible, or even unlikely.\nThe second reason is that taking pieces from under a patch would have meant unpicking a long section of the backing cloth and folding the shroud back to find suitable spot. By 2002, of course, this wasn’t a problem, but even in 1988 the aura of ‘holiness,’ not just around the shroud but around every religious object – and person for that matter – was much stronger than it is today. It was verging on sacrilege for anyone other than a priest even to touch the cloth, and to pull it about quite so drastically may have seemed a secularisation too far.\nI always used to enjoy Stephen Jay Gould’s defences of various utterly discredited 19th century scientists because, although they were overtaken by progress, he never dismissed them as idiots but tried to explain what it was that made them think as they did. We should do the same here.\n\n","date":"August 17, 2013 at 3:03 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41430","author":"Hugh Farey","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"“Gove, Meacham and others had indeed been listened to, and their views considered” …Did you mean to write; IF Gove, Meacham and others had been listened too? …because it’s pretty obvious they were not….especially in Meacham’s case. I am not stating at all that they were stupid, quite the opposite, …maybe a case of  ‘temporary insanity’ though. ;-)\n“The second reason is that taking pieces from under a patch would have meant unpicking a long section of the backing cloth and folding the shroud back to find suitable spot.” …Nonsense, they had previously unstitched  the Shroud in 1978 during the STURP examination, …it wasn’t STURP who did so actually, but still it was done, so this would not have been an issue in 1988.\nR\n\n","date":"August 17, 2013 at 9:53 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41444","author":"Ron","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"No, I really meant that Gove and Meacham’s ideas had been listened to and rejected. In particular, I imagine Meacham’s paper “Radiocarbon Measurement and the Age of the Turin Shroud” was most carefully considered. Apart from the fact that the paper is almost wholly devoted to the unreliability of any carbon date from wherever taken, Meacham’s final, “tentative proposals” are as follows:\n1) a single thread from between the images. It’s hardly surprising this was rejected. It would not have had sufficient mass to be tested on its own, so would have to have been mixed in with another sample. If the two were of the same date, then it would make no difference whether the thread were present or not, and if they were different, then it would not be possible to distinguish them anyway.\n2) a small piece just in from the edge next to the Raes site. That’s what was finally taken.\n3) a piece of the charred cloth. Why? Meacham had spent an entire section of his paper explaining why such a sample could be more unreliable than all the rest.\n4) a piece of the side strip. Again, why? It might determine whether or not the side strip was the same age as the ret of the cloth, but whatever its date, it would not confirm the age of the main body of the cloth.\n5) a piece of the backing cloth. This was to be used as a control, and as it was three other controls were used instead.\nTo be honest, having decided to carry out the C-14 test, Meacham’s very negative opinions regarding the accuracy of any such test at all hardly makes him a useful advisor.\nGove, on the other hand, had suggested 3 20cm (eight inches?) weft threads and 2 or 3 warp threads of 63cm (probably 2 feet – was he working in old units?). It is not clear if he wanted each laboratory to be given these, or if they were to be divided by seven. If the former, then he actually wanted 21 weft and 14-21 warp threads to be extracted for the seven labs then postulated. (If the latter then there wasn’t enough material).\nIt is easy to be wise after the event, but I do understand Gonella’s reluctance to cut dozens of threads out of the shroud, or to bother with pieces of contaminated charred material. It was clear from the science labs that added contaminant such as oils, soot or extraneous fibres was removeable beforehand. In 1977 a few inches of the backing cloth had been tentatively unpicked by nuns, and equally tentatively sewn back up again. To unpick the whole of one end and some distance up one or both sides may have been, as i suggested before, a sacrilege too far.\nOne more thing: nobody at all, that I can find, considered the possibility that undetectable interweaving was a possible source of contamination, neither STURP not anybody else. Incidentally, did anybody else in STURP, apart from Meacham, suggest a sample site, or did they just complain about it afterwards?\n\n","date":"August 17, 2013 at 11:16 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41450","author":"Hugh Farey","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"But don’t you think that mingling the sample areas (as you said) would reduce a lot the risk of dating one single sample that could be more contaminated than normal (just like the C14 sample of 88 probably was)?  I really think so!  I think that sampling small pieces of threads from every parts of the cloth would be the very best sampling procedure to do, as long as a team of expert could make sure that every small pieces of fabric really come from the main body of the Shroud.  Once you can be sure about that, then the dating result you got should be a very precise average age for the cloth, which come from the “cluster of samples” you had taken.  \nThe most important thing with my idea of sampling is to make sure that every small pieces of fabric you will date really comes from the main body of the Shroud, which is something that, I’m sure, can be done quite easily nowdays.  Once you’re sure about that, I don’t see any problem with the idea of “mingling the sample areas”.  On the contrary, since you would be sure that all the small samples you would get really comes from the same piece of cloth (the Shroud), I think this kind of “cluster sampling” would give a much more accurate result than any other sampling method that can be done, including the dating of the charred material.  \nAnd concerning this particular method, even if I think there are some chances that Rogers can have been right about the idea that such material do not represent a high risk of contamination, I still have some doubts about that, mainly because of what Otlet told the participants at the protocol meeting in 1988 (see: https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/#comment-41197).  I have no doubt about the fact that Otlet surely knew what he was talking about more than Rogers, because on the contrary of Ray, Otlet was a true expert in the field of C14 dating…\n\n","date":"August 18, 2013 at 6:01 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41519","author":"Yannick Clément","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"Note: my previous comment is a reply to Ron’s comment #60.\n\n","date":"August 18, 2013 at 6:01 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41520","author":"Yannick Clément","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"I think there is a problem with mixed samples. I think you’re correct that dating different samples from different areas gives the best estimate of the date of an artefact, but mixing them up before testing is a dangerous procedure. It assumes that there is no possibility of an outlier; if there is, then the entire sample is compromised and the date is meaningless. The more threads extracted from different areas and mingled, the greater the possibility of an outlier. This too may have been a significant factor in deciding to take the sample from a single area only. (Ironically, therefore, it may have been in order to exclude the possibility of interweaving that the single sample was taken.)\nYou’re right that Otlet didn’t think much of sampling the charred areas, which makes you wonder why Meacham suggested them. It’s no surprise that his suggestion was rejected.\nI think the only viable alternative to taking the test material from where it came from was to extract a minimum of three 3cm x 1cm samples from different areas of the cloth, and dividing them into three sets of three 1cm x 1cm squares for the three labs to test independently. I don’t think anybody at all, not even Meacham, considered that this level of damage to the cloth was acceptable.\n\n","date":"August 19, 2013 at 3:29 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41545","author":"Hugh Farey","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"Fellow Shroudies\nThe main purpose of my campaign is to create an event in the form of a major movie  that, combined with other forces, persuades/pressures the Vatican to reopen the cloth to scientific scrutiny. Then, many of these imponderables may be answered. In the meantime, if you can think of a better way to achieve this, let me know. If not, I would ask you to circulate the link below to as many people you know who might be interested.  Please consider making a donation however small ($1) to indicate support. Thank you.\nhttp://www.performancefilms.co.uk/Preview/preview.html\n\n","date":"August 17, 2013 at 2:21 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41458","author":"David Rolfe","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"Good luck with your project Mr. Rolfe, but personally, I seriously doubt that any movie about the Shroud, no matter how good it can be, will change anything about the desire of the Vatican to wait before allowing a new series of direct tests on the cloth.  Of course, this is only my personal feeling.\n\n","date":"August 18, 2013 at 5:45 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41518","author":"Yannick Clément","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"Hugh; Meacham may have been a little negative, but he was being cautious and he was also mostly correct…He warned about the issue of contamination with fabric and especially  a fabric with unknown history. They definitely did not listen to his point on the importance of acquiring samples from several disparate areas. Gove also warned about the sampling areas and about minimal size of sampling, but he raised so many issues they probably just wrote him off….These were the concerns raised by the two, that I had in mind with my comment.\nYannick; If you are talking about present day c14 sampling and not what occurred back in ’88, then I believe the best method would be to acquire several small samples from several different areas of the shroud. You should remember though,  these samples must still be quite large, (single threads would not suffice). As I mentioned before, with todays technology, I believe a  2 to 3 mg weight of pure carbon is necessary for a legitimate test. That’s pure carbon, the weight of the actual sample being cut would then need to be approx.16 mgs, if my calculations are correct. \nFurthermore, as I’ve mentioned several times before on this blog, I don’t believe a new c14 testing would be wise, until they can find a absolute solution to the contamination issue, especially when dealing with fabrics.\nR\n\n","date":"August 19, 2013 at 10:56 am","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41590","author":"Ron","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"I think that if they would chose enough small pieces of threads, they could get enough material to do a proper C14 dating and achieve a pretty accurate dating.  Nevermind what Hugh is thinking, I don’t believe that mixing pieces of linen taken here and there would be dangerous for accuracy, as long as the labs would make sure that every single thread would be a real thread from the original Shroud and not a contamination that came later on (as part of a reweaving or simply an accidental contamination due to the numerous folding and unfolding and public showing of the cloth over the centuries).  Once you make sure all the small pieces of threads that would be taken here and there on the backside of the cloth are pure linen from the original cloth, I don’t see any good reason to suspect that there would still be a high level of contamination on those threads that would skewed the real age of the Shroud by several centuries…  Some decades or one or two centuries, maybe (who knows)?  But 8 or 10 or more, I seriously doubt this.\n\n","date":"August 19, 2013 at 3:40 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41599","author":"Yannick Clément","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"Yannick, Hugh is actually correct. To retrieve several pieces of thread from all over the Shroud and combine them would be to completely defeat the whole  purpose of acquiring dissimilar samples. They probably have more then enough material sitting in containers right now, from the 2002 restoration. Enough material possibly to do a dozen tests. But please do not underestimate the issue of contamination. The complete area of the Shroud is so contaminated, from centuries of exposure to all types of elements, its possible it can never be properly tested. Think of the Shroud hanging or stored in caves, cathedrals, wherever, with oil lamps burning all night long, (the only source of artificial light used for centuries) and the Shroud flax soaking up all that carbon….How possibly could they extract that from the Shroud? …At the moment I don’t think it’s possible and until it is, a new series of c14 testing is best left on the back-burner.\nR\n\n","date":"August 19, 2013 at 11:31 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41629","author":"Ron","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"I think you’re confusing “listen to” and “agree with.” Meacham’s general point was fine, but his actual suggestions (a thread from here, a charred section there) were confused. If that was the best he could do, it’s no wonder they didn’t agree with him.\n\n","date":"August 19, 2013 at 3:52 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41601","author":"Hugh Farey","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"The idea of taking small pieces of threads here and there on the backside of the Shroud comes from my own little head, not from Meacham’s book…  I just thought it would be the best idea of sampling to avoid getting an inaccurate age for the cloth (due to contamination), while preserving its “good look”.  I know I’m not an expert in C14 dating, but this idea should deserve some thoughts.  As I said in other comments, Meacham ended up asking Turin to date the charred material that was scraped away during the 2002 restoration.  Before that, his idea was to take at least 3 different samples in 3 different areas of the cloth.\n\n","date":"August 19, 2013 at 4:40 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41603","author":"Yannick Clément","site":"shroudstory"},{"title":"Here is a crowdfunding campaign we should be able to support","post":"” I think you’re confusing “listen to” and “agree with.” – …Maybe so, and I agree some of his suggestions were ‘out-there’, but they should have at least understood the importance of dissimilar samples and the contamination issue, which from what I got out the book, was to Meacham, the biggest  issues and I don’t think he was alone in stressing these points to the Shroud custodians.\nR\n\n","date":"August 19, 2013 at 11:39 pm","url":"https://shroudstory.com/2013/08/09/here-is-a-crowdfunding-campaign-we-should-be-able-to-support/","cat":"art","id":"comment-41632","author":"Ron","site":"shroudstory"}]
