[{"title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)","post":"I went to the University today which has a large selection of books on art history, including byzantine art.\nI couldn’t find this epitaphios, but I found a similar one ( similar pose, marks over the body, weaved shroud) that was dated in a reputable source at 1200AD.\nWhere did you find the image Colin?\nWould be great if we can find some answers on this!\n\n","date":"July 22, 2012 at 3:44 am","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","id":"comment-14085","author":"Matt","site":"shroudstory"},{"title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)","post":"“Más espectacular es el Aer Epitaphios del monasterio de Stavronikita. Mide 91,5 x 113 cm, y parece consistir en dos bordados distintos que se juntaron. Las fechas más probables de los bordados son los siglos XIV y XV. Igual que con el epitaphios de Pantokrator, el icono de Cristo lleva un taparrabos y se aprecian claramente los pulgares. El cuerpo está cubierto de sangre de un color bastante oscuro, salvo la sangre de la herida del costado, que es mucho más roja. Las manchas de sangre del antebrazo son parecidas a las de la Síndone.\nHay otro detalle de este epitaphios muy difícil de explicar a menos que se relacione con la Síndone. En cadáver yace en un lino del mismo color que la reliquia turinesa, pero lo que es más significativo que el color y el tejido del lino son idénticos al color y tejido de la Síndone. \nLa fecha del bordado hace improbable que ésta fuese el modelo directo, pero la influencia es innegable. Parece ser una tradición en varios epitaphioi que refleja conocimientos de la reliquia, probablemente de cuando estuvo en Constantinopla.” \nMark Guscin.”LA SÍNDONE Y LA IMAGEN DE EDESA .Investigaciones en los monasterios del Monte Athos (Grecia)”. Linteum 34 (enero-junio de 2003), 5-16\nhttp://www.redentoristas.org/sabanasanta/archivosiconos/sindoneedesamarkguscin.pdf\nCarlos\n\n","date":"July 22, 2012 at 6:00 am","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","id":"comment-14087","author":"carlos","site":"shroudstory"},{"title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)","post":"Bing Translation: “Most spectacular is the Aer Epitaphios of the monastery of Stavronikita.” It measures 91.5 x 113 cm, and seems to consist of two different embroidery that came together. The most probable dates of embroidery are the 14th and 15th centuries. As with the epitaphios of Pantokrator, the icon of Christ performs a loincloth and can be seen clearly thumbs. The body is covered with blood from a rather dark color, except the blood from the wound in the side, which is much more red. Forearm blood stains are similar to the of the shroud.\nThere is another detail of the epitaphios is very difficult to explain unless it relates to the shroud. In corpse lies in a linen of the same color as the Turin relic, but what is more significant that the color and fabric of flax are identical to the color and fabric of the shroud.\nThe date to the embroidery makes it unlikely that this would be the direct model, but the influence is undeniable. “It seems to be a tradition in several epitaphioi that reflects knowledge of the relic, probably from when he was in Constantinople”.\n“Mark Guscin.”THE SHROUD AND THE IMAGE OF EDESSA.Research in the monasteries of Mount Athos (Greece) “.” Linteum 34 (January-June 2003), 5-16\nhttp://www.redentoristas.org/sabanasanta/archivosiconos/sindoneedesamarkguscin.PDF\nCarlos\n\n","date":"July 23, 2012 at 12:01 pm","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","id":"comment-14129","author":"Dan","site":"shroudstory"},{"title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)","post":"Dan\nThat date is interesting. The epitaphios from 1200 (Venice) is very similar style, including markings and blood all across the body, and the herringbone weave. Either G. schiller is wrong (I think unlikely) or the info you have posted is wrong. Of course they might be 100-200 years apart, but that seems unlikely given their striking similarities\nI’ll try and get into the uni and so a colour photocopy and scan of the 1200 AD Venice one.\n\n","date":"July 23, 2012 at 6:41 pm","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","id":"comment-14146","author":"Matt","site":"shroudstory"},{"title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)","post":"Concerning the herringbone weave present in this epitaphios (which represent for me a very good indicator that some Byzantine artists had seen the Shroud), I’ve seen an interview with a renown Shroud scholar named Antoine Legrand (a Frenchman) in which he stated that it was common to find an herringbone weave in the ancient Byzantine epitaphios.  Here’s an hypothesis about that (Legrand in his interview seemed to think that) : Maybe the first ever epitaphios (or the first few examples) were done by an artist (or artists) who had seen the Shroud and then, it become a sort of trend to reproduce this sort of weave on most epitaphios…  I think it is truly possible, but what I really would like to know is if there is or not a majority of ancient epitaphios that shows herringbone weaves like that.  I’ve never seen any study done about this aspect of the question regarding the epitaphios.  Would be great if someone can do a study like that.\n\n","date":"July 22, 2012 at 5:46 pm","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","id":"comment-14096","author":"Yannick Clément","site":"shroudstory"},{"title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)","post":"Good comment Yannick. It seems unlikely that epitaphios artists would have just coincidentaly decided to use a herringbone weave pattern. I think it is highly likely that they did so having viewed the Shroud, or at least heard of the Shroud’s herringbone weave. The only other realistic possibility I can think of is that maybe linen cloths at the time the epitaphios were created in the 1200s / 1300s had herringbone weave? Can anyone confirm or deny this?\nAs I said above, I viewed an epitaphios dated circa 1200 AD in G. Schiller’s authoritative Iconography of Art volume. That had the herringbone weave, so if one accepts the argument that the use of the herringbone weave pattern on shrouds shown in epitaphios was influenced by the Shroud of Turin, then that provides further evidence for the Shorud of Turin’s existence before 1200AD.\n\n","date":"July 22, 2012 at 11:02 pm","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","id":"comment-14106","author":"Matt","site":"shroudstory"},{"title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)","post":"Don’t believe what Max said about the dating of the first epitaphios Matt !!!  In his very good article, Maurus Green clearly state that the first two epitaphios that we know were created for a chapel in the Vatican during the papacy of Pope John VII (between 705 and 707) !!!  And these 2 artworks (that had been lost at the time St-Peter’s Basilica was rebuild during the 16th century) have very interesting similarities with the Shroud of Turin (like the fact that the body is lying in the same exact position than the frontal image on the Shroud with the hands crossed over each other and without the thumbs !), even if the only copy of one of these 2 epitaphios I’ve seen don’t seem to show the herringbone weave of the Shroud… See for yourself here: http://www.crc-resurrection.org/878-histoire-du-saint-suaire.html    \nIt is the first picture on that page…\nNote that these 2 earliest representations of the entire frontal body of Christ lying on his back for his burial were done during the time the Mandylion was still kept in Edessa… A time where, if we believe Ian Wilson, the Shroud was folded in 8 to show only the face and no one would have known about the image of the entire body !!!  For me, this is a pretty interesting clue (here, I recognize that this is just a clue, unlike the 22 facts I gave you in my recent paper) that Wilson’s hypothesis is completely wrong.\nAnd for those of you who can understand French, here’s the link for the very good interview with Antoine Legrand : http://www.youtube.com/watch?v=ppKFofQBFJM\nIf you understand him, you’ll noticed that he don’t believe one second in the Mandylion hypothesis and, like a good historian, he follow the FACTS and conclude that the Shroud went from Jerusalem to Constantinople (most probably directly), and then, in 1204, he was probably transferred to Athens in the hands of Othon de la Roche, and then, he was sent to France, probably in the Castle of De la Roche in Ray-sur-Saône (Franche-Comté).  In the present state of our historical knowledge, there’s no doubt that this is the most prudent and rational conclusion regarding “the road of the Shroud”, because it is the hypothesis that requires the least speculations and extrapolations…  You can see just with this example that Legrand was far from being a polemist like Wilson !\n\n","date":"July 23, 2012 at 5:03 pm","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","id":"comment-14137","author":"Yannick Clément","site":"shroudstory"},{"title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)","post":"Yannick wrote: \n“Don’t believe what Max said about the dating of the first epitaphios Matt !!! (…)Maurus Green clearly state that the first two epitaphios that we know were created for a chapel in the Vatican during the papacy of Pope John VII (between 705 and 707) !!! ”\nActually there are not two original epitaphioi but TWO 17th CE drawings of THE SAME Umbella as recorded by Grimaldi. Green (after Münz but before Bonnet-Eymard) just MISTOOK Grimaldi’s two drawings of the same epitaphios for two distinctive epitaphioi and so did Yannick blindly following his “Green guru”!\nThe fact also is we can share with I. Wilson serious doubts whether the Umbella’s appearance via Grimaldi’s two drawings could be genuinely compatible with an 8th c. CE date:  the Crucified Yeshua is depicted with a loin-cloth in the Umbella scene. \nNow “in the 8th c. CE  and before, the commonest way to depict Yeshua was with him wearing a colobium, or long sleeveless robe as in John’s VII’s time in St Mary Antiqua Rome (see G; Schiller, Iconography of Christian Art) also in the Rabula gospels, also on the wall of Pope John VII’s chapel in St. Peter’s as copied by Grimaldi”. \nYeshua’s loin-cloth iconography only starts c. 1000 CE NOT BEFORE!\n“Besides, there is NO EVIDENCE for the “Veronica” itself (which Veronica exactly since there are couple of them + the Uronica?)  -the showing of which the Umbella is said to have ornemanted -having been in Rome BEFORE c. 1000 CE.” \n“According to Grimaldi’s careful archiving, the shrine that housed this “Veronica”, the same shrine the window of which the Umbella ornemanted, bore an inscription ‘Pope Celestine III had this work done in the 7th year of his pontificate (…). Since Pope Celestine III’s pontificate was 1191-98, AGAIN the indications are that the Umbella did not date from the time of Pope John VII (i.e. 705-7 CE), but MUCH MORE LIKELY sometimes around the end of the 12th century CE.”\nCan we still UNCRITICALLY believe Yannick Clément?\n\n","date":"July 24, 2012 at 5:53 pm","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","id":"comment-14188","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)","post":"Well before the Pray codex (1192-1195 CE), the liturgical  embroidered silk cloth known as the Epitaphios (threnos) of Thessaloniki (ca 1300 CE), that of Venice (ca 1200 CE), or the Lirey Pilgrimage leaden badge (1370-1390 CE), I hold the cathedra of Saint Mark (6th century CE) to be the earliest iconographic testimonial of Yeshua’s zigzag weave patterned burial cloth.\nThe “desacrated” throne is a 3D alabaster replica at reduced scale of the Hetoimassia (or relic-throne of the “Preparation” to the Second Coming of Christ). Hetoimassia, literally “preparation”, meaning “that which has been prepared” or “that which is made ready”, specifically refers to the “sign of the Son of Man” and his return at the Last Judgement.\nThe motif essentially consists of an empty throne with a prominent cushion and various Christic relics (among which his burial cloth covering or sitting on the throne and/or his pre-burial sudarium/ burial Byssus small face-cloth draped round a crux gemmata and/or the ring of twisted rushes, to which thorns were attached to form his crown around or over the cross).\n\n","date":"July 23, 2012 at 6:14 am","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","id":"comment-14113","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)","post":"Yes the 1200 AD Venice epitaphios is the one I viewed in G. Schiller’s authoritative volume.\nMax – I fail to see any zigzag weave pattern in the Hetoimassia:","date":"July 23, 2012 at 6:45 am","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","id":"comment-14114","author":"Matt","site":"shroudstory"},{"title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)","post":"Matt,\nHere is the link to the Hetoimassia or relic-throne known as the cathedra or throne of Saint Mark:\nhttp://stephanhuller.blogspot.com/2009/11/my-article-on-throne-of-st-mark-has.html\n\n","date":"July 23, 2012 at 7:10 am","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","id":"comment-14116","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)","post":"The same herrring-bone pattern also appears in conjunction with a veil & a full length portrait of Christ in a last quarter of the 8th century CE  missal miniature from the Echternach Abbey (founded in 698 CE as a Benedictine monastery by St. Willibrord, an English monk).\n\n","date":"July 23, 2012 at 7:06 am","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","id":"comment-14115","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)","post":"1:  I went to the stephanhuller site referred to by Max at #9.  There are certainly some intriguing pictures there, and I certainly noted a definite herring-bone pattern on one of them.  There was also some rough(?) lettering, looked as if it had been hand carved, I thought it might be early Greek, I wonder if Max or someone else is able to provide a translation.  I was a little disappointed that the pictures had no identifying captions, tags or commentary.  Most of the text seemed to be a kind of promo for Stephan’s article, and his wonderment that his paper had been accepted for publication along with other prestigious writers, but little other information.  \n2:  I attempted a search of the web for more definitive examples, but as yet not with much success.  It was apparent that herring-bone weave was commonly practised from ancient times   The herring-bone pattern in other art forms also seems to have had some popularity, extending to block or brickwork walls, and even to beadwork by southern African tribes such as the Bdelebe(?).   \n3.  I discovered a fascinating paper by Diana Fulbright: “Akeldama Repudiation of Turin Shroud omits evidence from the Judean desert”. by Diana Fulbright, 2010; Shroud of Turin Centre, Richmond VA. Paper can be found at: http://www.acheiropoietos.info/proceedings/FulbrightAkeldamaWeb.pdf\nIt is possible to download the paper, but only as a “secure” pdf.  The security means that it is not possible to copy any of the text or graphics from this paper.\nIn December 2009, following the discovery of a sealed 1st c. Jewish tomb at Akeldama, when a “shrouded” body was discovered, it was widely proclaimed that the Turin Shroud could not be 1st c. as this single example was in simple weave.  This inference is clearly an extremely weak deduction, with no statistical significance.  It almost appears as if the body may not have been shrouded at all, but was merely wrapped in its own clothing, indeed with mixing of kinds, both wool and linen (apparently permitted for dead bodies under Mishna regs).  The DFulbright paper is directed against the Akeldama assertions, citing several examples of herring-bone weave from ancient times, Even more complex patterns of weaving were found at Masada, including a diamond twill.  The sash of Rameses III (1200 BCE) included a number of complex patterns, including a 3:1 herring-bone twill.  It is apparent that weavers were quite capable of producing quite intricate patterns from ancient times. \n4.  Indeed the apparent prevalence of the herring-bone twill, probably means that some caution is required when artifacts are discovered with this pattern.  It would be precipitate to associate such occurences with the TS, unless there was clearly some other associative or corroborative evidence, such as when it is definitely related to a threnos, lamentation, or epitaphios artifact.  That there is a zigzag pattern on the 6th c. St Mark’s cathedra is certainly a tempting association, but it may be just a little too tenuous to make a decisive connection with the twill of the TS.\n\n","date":"July 23, 2012 at 9:11 pm","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","id":"comment-14147","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)","post":"Please, dont you mistake me, these representations of an herringbone weave pattern cloth are very rare as far as pre-13th c. CE Religious Art Works are concerned.\n\n","date":"July 24, 2012 at 5:50 am","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","id":"comment-14155","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)","post":"All the more rare as on the lower lateral and back sides can be seen a trellis pattern evocative of that  of the Holy Face of the Holy Mandylion/Sindon tetradiplon\n\n","date":"July 24, 2012 at 6:18 am","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","id":"comment-14157","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)","post":"To DavebWNZ\nThe (4th?)-6th c. St Mark’s cathedra was part and parcel of the booty from the 1204 CE sack of Constantinople by Franks & Venetians. \nThe hand carved lettering (lower front side) is not early Greek at at all. Personnally I read it as a desecration formula in Samarithan square Hebrew (written from left to write and not right to left as expected).\n\n","date":"July 24, 2012 at 5:38 am","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","id":"comment-14153","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)","post":"To recur to mirror writing to carve a name (Mark(os) Evangelist(os) Alexandria) in Aramaic script on the front of the seat, might well imply a meaning contrary to the title here associated with the word ‘eshel’ (the tamarisk/the pre-eminent one) carved in Samaritan type old square script .\n\n","date":"July 24, 2012 at 12:29 pm","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","id":"comment-14177","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)","post":"…and the replica at reduced scale of the Hetoimassia emptied relic-throne.\n\n","date":"July 24, 2012 at 12:42 pm","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","id":"comment-14178","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)","post":"This might well indicate the relic kept inside the throne was desecrated.\n\n","date":"July 24, 2012 at 1:10 pm","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","id":"comment-14180","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)","post":"PS \nBoth the Mark’s cathedra and Echternach Missal miniature appear with the Tetramorph symbols in conjunction with a herringbone weave patterned cloth (either carved in alabaster or pen & ink drawn).\n\n","date":"July 24, 2012 at 5:45 am","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","id":"comment-14154","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)","post":"The pen & ink drawing/miniature was made by an 8th c. CE BENEDICTINE artist & scribe monk named Thomas. (See my posts on the 12th c. CE Pray Ms pen & ink drawings)\n\n","date":"July 24, 2012 at 6:03 am","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","id":"comment-14156","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)","post":"Max: Thank you for your additional comments above.  The trellis work on the back, together with the herring bone pattern on the front are certainly an intriguing combination,  Trellis work = Image of Edessa; Herring bone = TS.  There has to be some kind of message there!  I wonder if it was made in Constantinople, or arrived there from somewhere else?  Why is Stephan H including it in a journal on “Coptic” studies? What does it have to do with Copts I wonder?   \nThere are several other intriguing patterns as well: a sort of six-armed ‘starfish’ symbol, with groups of circles (eucharist loaves??) occurring in three groups of three (trinity??), but one group has five circles (five wounds??) another four circles (X or cross??); On the upright support, there seems to be a “tree of life” with a figure; the sides show a human figure on one side, and an animal (lamb??) on the other.  A very intriguing and symbolic object!! \nI think you’ve made your point that the herring bone and trellis together with the other symbolism, gives a strong case, and I have to withdraw my remark about the connection being tenuous.  I merely wished to make the point that herringbone as a general kind of pattern used by weavers was not as uncommon as some had attempted to assert, and that this pattern can also occur merely for general decorative purposes in mundane use.\n\n","date":"July 24, 2012 at 8:20 am","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","id":"comment-14164","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)","post":"Dave: On much older photographs, we clearly can see the eight, five and three beatitude eight-armed star constellations of Heaven/Paradise in conjunction with the Tetramorph on the back, right and left sides of the throne and the four Evangelists two by two flanking a herring-bone cross in the medallon on top. On its upper front  the sacrificial Lamb appears central to both the Tree of Life and the four rivers of Paradise/Heaven.\n\n","date":"July 24, 2012 at 9:29 am","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","id":"comment-14166","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)","post":"Mistyping: “a herring-bone weave patterned cross”\n\n","date":"July 24, 2012 at 9:32 am","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","id":"comment-14167","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)","post":"See Revelation 5: 13-14\n\n","date":"July 24, 2012 at 9:36 am","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","id":"comment-14168","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)","post":"Given its reduced size, the relic-throne of the Word of G.od (directly inspired from the Hetoimassia) might well have been used to display a portrait of Christ/Yeshua and /or the Gospels. Possible origins Alexandria or Edessa.\n\n","date":"July 24, 2012 at 9:51 am","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","id":"comment-14169","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)","post":"(Egypt or Syria)\n\n","date":"July 24, 2012 at 9:55 am","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","id":"comment-14170","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)","post":"…I would say Syria.\n\n","date":"July 24, 2012 at 10:09 am","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","id":"comment-14171","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)","post":"I bet Huller would say Egypt.\n\n","date":"July 24, 2012 at 10:15 am","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","id":"comment-14172","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)","post":"Huller wrote: “In 828 CE a simple but quite beautiful object was removed from Alexandria and taken to Venice by a group of Italian pirates. The object in question was an alabaster chair, said to be the legendary Throne of St. Mark, the Christian apostle and gospel writer who, it was claimed, had once presided over the infant church in Egypt. This object represented the very beating heart of the early Christianity. According to Italian and Coptic tradition (which have meticulously pieced together in a previous article), the throne was taken with two other objects supposedly associated with the Evangelist – his body and an autographed copy of the Gospel according to Mark.” \nIs the removal form Alexandria of the “throne of St Mark” a legend or not? Was it part of the Venetians’ booty from the 1204 CE sack of Constantinople? It should be further investigated.\n\n","date":"July 24, 2012 at 10:49 am","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","id":"comment-14173","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)","post":"Stephan Huller’s reading of the inscription see “The Gnostic Throne of Alexandria\nBy Stephan Huller and Ruairidh (Rory) Bóid (Monash University)”\n\n","date":"July 24, 2012 at 11:00 am","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","id":"comment-14174","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)","post":"Beware: Huller’s  book is mostly self-delusional.\n\n","date":"July 24, 2012 at 4:31 pm","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","id":"comment-14183","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)","post":"Max: Thank you for these further comments.  In view of the herring bone and trellis patterns, perhaps we need to ask Huller how comes Alexandria knows about the burial cloth.   I have seen one paper that claims that the burial cloth was actually a priestly type of robe worn by Mark who the author alleged had some secretarial role in the Sanhedrin,  This would seem at odds with the gospel account that Joseph of Aramathea “purchased a shroud” but perhaps this was only a shorthand gloss for what actually happened.  I wasn’t entirely happy with the particular paper which seemed to make several gross assumptions, and some seemed to be in error.  But if Mark was Peter’s secretary in Rome, it’s likely he would at least know something about the burial cloth, especially if Peter still retained it. \nBack to Alexandria – Many early Christian centres often seemed to claim a prominent gospel figure as their founders, in order to establish some kind of apostolic authority.  Whether Mark was the actual founder of the church in Alexandria, could perhaps be debatable.\n\n","date":"July 24, 2012 at 6:33 pm","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","id":"comment-14192","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)","post":"We can also asked ourself: \nWas also the genuine (not the replica at reduced size) throne of Mark removed and, if so, at what time? Couldn’t the two thrones have been confused?\n\n","date":"July 24, 2012 at 6:54 pm","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","id":"comment-14193","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Herringbone Weave within Stavronikita Epitaphios (Revisited)","post":"Dan\nDid you not have any luck tracking down a better resolution image, also can you please provide the source for this image???\nPersonally, I find so much of the science still inconclusive or questionable , I think the better clues lie in art history / history.\nI’m going to try and get the image from 1200 AD\n\n","date":"August 3, 2012 at 8:01 am","url":"https://shroudstory.com/2012/07/21/herringbone-weave-within-stavronikita-epitaphios-revisited/","cat":"art","id":"comment-14440","author":"Matt","site":"shroudstory"}]
