[{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"There’s a simple answer to the reader’s comment, Dan. What folk have been  interpreting as the biblical ‘face cloth’  spread out and completely covering a sarcophagus lid (they had to be helped with correctly identifying the latter)  is nothing of the sort.\n It is in fact the Shroud spread over (but not completely covering) the sarcophagus lid. It is the lid that has the little decorative circles aka  ” L-shaped holes”‘ (sheer coincidence re the Shroud). One of the distinctive, some might say symbolic features of the REAL shroud (small s) in the Codex are the two wavy lines at the end of the shroud, probably representing bloodstains as others have suggested.\nHere’s  an enlarged  piccy from my own blog posted just a few minutes ago that shows the Shroud on the sarcophagus lid, with everything but the Shroud blanked out.\nI have always believed the Pray Codex to be a complete diversion and irrelevance where the Shroud of Turin is concerned. It was through being  brusquely challenged yesterday to explain the two wavy red lines, together with totally uncalled for slurs on my integrity and character, that made me give up precious minutes of my life to take a second long hard look at that not-terribly well executed miniature in an otherwise obscure monastic manuscript.\nThere are no poker holes on the Shroud as depicted in the Pray Codex, but there are little decorative circles on the sarcophagus lid, and the latter does have a pattern that could be mistaken for a herringbone weave, given the eye of faith….\n\n","date":"June 13, 2012 at 10:32 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12392","author":"colinsberry","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Collinsberry, here’s a good one for you and all the other sceptics :  If we would take a group of 100 peoples on the street and give to every person all the basic facts there is to know about the Shroud of Turin and the Pray Codex, also about the testimonies of Robert de Clari and Nicolas Mesarites in Constantinople, also about the close connection there was between the Hungarian kingdom and Constantinople during the 12th century, and also about the art history of that period of the second part of the 12th century (where there’s no other known depiction of Christ entombment showing him nude and no other known depiction of his Shroud showing 4 L-shaped holes), and then, if we would make a survey with this group of people to know if they think the artwork of the Pray Codex is related to the Shroud of Turin, I honestly believe that there would be well over 90% of people who would answer “yes”.  It would be very fun to make the test and see the result !!!\n\n","date":"June 13, 2012 at 10:46 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12394","author":"Yannick Clément","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Methinks most people in the street would look at you blankly, Yannick, and mumble an excuse for hurrying on their way…\n\n","date":"June 13, 2012 at 11:26 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12397","author":"colinsberry","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"HA HA HA !!!\n\n","date":"June 13, 2012 at 12:01 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12400","author":"Yannick Clément","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"good point Yannick. It is the collective evidence that is compelling, rather than one or two discrete factors\n\n","date":"June 14, 2012 at 4:21 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12429","author":"Matt","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"This goes without saying!\n\n","date":"June 14, 2012 at 5:40 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12438","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Archceptics just don’t want to face both the individual AND the collective evidence. That the reason why any and every discrete factor shall be CRYPTanalyise with extra care and iconological vista to get a very solid grounded file to oppose them.\n\n","date":"June 14, 2012 at 5:45 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12439","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"That is precisely HERE that the archaeocryptologist comes in….\n\n","date":"June 14, 2012 at 6:05 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12443","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Correction to my first para, written in haste (when is WordPress going to give us a preview facility?)\n“There’s a simple answer to the reader’s comment, Dan. What folk have been interpreting as the biblical ‘face cloth’  Shroud of Turin, complete with L-shaped poker holes, spread out and completely covering a sarcophagus lid – they had to be helped with correctly identifying the latter-  is in fact nothing of the sort.\n\n","date":"June 13, 2012 at 11:41 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12399","author":"colinsberry","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"(I repeat my last two Comments #124-125 since the thread to the Pray Ms miniature is now here) I wrote: “…[with] a minimum of iconological vista), you’ll see a wrinkle line (and rumples amid the square-topped stepped pyramid weave pattern in connection with the angel’s left foot resting on the SHROUD COVERED SARCOPHAGUS LID. The latter, according to medieval standard can be see EITHER raised up OR just displaced […].”\nTo really be aware of what I mean, just ask a graphic artist friend of yours how he would sketchily feature wrinkles and rumples in a lying flat square-topped stepped pyramid weave pattern shroud with on top a rolled up (semi-transparent?) napkin/veil, and you’ll get the answer. Now compare the resulting sketch with that of the miniature.\nFrom then on, you might well become aware the anonymous minaturist Benedictine monk actually found a rather ingenuous and economic solution.\nAddition: you will ask your friend to sketch a view of the two items seen from above.\n\n","date":"June 13, 2012 at 12:23 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12402","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"CB’s evidencing of the rolled up napkin/veil is FAULTY.\n\n","date":"June 13, 2012 at 12:25 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12403","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"My version offers an explanation for the two wavy red lines (blood) and for the small black crosses (merely a decorative feature to distinguish between shroud and sarcophagus lid).\n I suspect that most folk looking at my picture with the non-essential detail blanked out will accept my interpretation. Why? Because it offers a common sense explanation for why the image is the way it is, given that the artist was having to cram a lot of detail into a very small area..The empty Shroud is shown partially covering the sarcophagus lid, but the decorative circles (wrongly identified as “poker holes”)  and the zigzag pattern were on the lid alone, not the Shroud. \nEnd of story. RIP Pray Codex (it’s had its moment of fame, and should now be allowed to slip back into the same formulaic, derivative-art obscurity from which it originated).\n\n","date":"June 13, 2012 at 12:51 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12406","author":"colinsberry","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Good try Colin, but not good enough. What you perceive as the Shroud (and others like myself perceive as the face cloth) has a clearly defined thicker edge that finishes well to the right of the two red streaks (blood stains) and the crosses.\nBut good to see you now acknowledge the red streaks represent blood, which are not on the face cloth (your “Shroud”) but are clearly on the herringbone weave- like shroud.\nMakes no sense whatsoever that a sarcophagus lid would have streaks of blood on it.\nJust as it makes no sense to me (unlike you) as to why an artist would happen to randomly paint 4 small circles in an assymetrical L shape mirroring the prominent poker holes on the real shroud (remembering that in reality the image is faint and the poker holes are a prominent feature, possibly one of mystery back in time)\nI am going to test your claim\n“I suspect that most folk looking at my picture with the non-essential detail blanked out will accept my interpretation.” on my 15 year old, 150 IQ son tonight, doing my very best not to influence his opinion (he is sufficiently confident and outspoken that he will state his view rigorously regardless of any influence)  \nMatt\nPhD (History)\n\n","date":"June 14, 2012 at 3:24 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12425","author":"Matt","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Just another thought upon perusing the image again, I’m sure people have touched on this before…In the upper image of the nude Christ, neither of his hands have thumbs. This is logical for his right hand, given the perspective, but not so logical for the left hand. It would have been logical for the thumb to be displayed for the left hand, given the perspective. The fact that it isn’t provides further strength to the case that the image is based on the real shroud.\n\n","date":"June 14, 2012 at 3:42 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12426","author":"Matt","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Further to my point at 3:24 am, if the crosses were only connected to what Colin calls the shroud (and I call the face cloth) then the crosses should have gone further to the right across the raised cloth. They don’t and the image clearly depicts a face cloth lying over the shroud, with the crosses underneath and to the left of the face coth representing Christ’s image on the shroud UNDERNEATH the face cloth\n\n","date":"June 14, 2012 at 3:48 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12428","author":"Matt","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Colin Berry aka Oilscienceboiled aka The Imaginary Expert strikes back!\n\n","date":"June 14, 2012 at 6:01 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12441","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"I mean “IMAGInary expert”….\n\n","date":"June 14, 2012 at 6:02 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12442","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"He still mistake it for the long pied of linen cloth! Really this guy needs X1.000.000.000 magnifying glasses!\n\n","date":"June 13, 2012 at 12:53 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12407","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Still, there would be nothing much left to see f the napkin/veil. Nope..\n\n","date":"June 13, 2012 at 12:54 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12408","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"correction: ” still mistakeS”, “long PIECE of”\n\n","date":"June 13, 2012 at 12:55 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12409","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"On CB’s blog I wrote: YOU REALLY REALLY NEED ICONOLOGICAL GLASSES (after testing your very bad sight to get adaptaters)\n\n","date":"June 13, 2012 at 1:32 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12411","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"…ad hoc adaptaters needlful to say.\n\n","date":"June 13, 2012 at 1:33 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12412","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"POINTLESS? Even a tiny straw may be a crucial forensic evidence in criminology why not tiny ink features?\n\n","date":"June 13, 2012 at 12:31 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12404","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Correction: “a tiny witty biity straw”\n\n","date":"June 14, 2012 at 5:54 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12440","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"BTW Dan, could you tell me why you didn’t puplish the illustrations I emailed you to back up my comment on my formal identification of  the Pray Ms miniature shroud square-topped stepped pyramid weave pattern with the Turin Shroud marcrographic weave pattern? It would have saved me time and energy to make my point clearer.\n\n","date":"June 13, 2012 at 12:42 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12405","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"I wrote on CB’s blog: Quite a feast for a “scientist” to be unable to discriminate the Christ shroud (a most famous long piece of linen cloth here lying flat) with a rolled up napkin/veil on top, altoghether pen & ink drawn in a 12th century CE miniature!\n\n","date":"June 13, 2012 at 1:07 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12410","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Good day to you Matt. Here’s a quick (and partial reply) since I have things to do. While you do not make it clear precisely where you think your face cloth ends and the sarcophagus starts, I think you have a problem with those black crosses. Three of them are shown to the right of where I suspect your “clearly defined thicker edge” is located. My long stretch of shroud accommodates ALL the black crosses, and has none anywhere except the burial shroud.\nWho says there is blood on the sarcophagus lid? I certainly don’t. My interpretation is that it is just peeping through on the wavy end of the shroud having tracked down the inside surface that is out of view – the illustrator having added it there as a sort of nuanced gesture (“gentle hint”) not wishing to turn stomachs.\nI look forward to hearing your son’s opinion. IQ of 150? Has he decided what HIS doctoral dissertation is to be on yet?\n\n","date":"June 14, 2012 at 3:43 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12427","author":"colinsberry","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Colin\nIt is pefectly clear where the face cloth ends, in my opinion – it is just a little to the right of the red streaks, with some double thickness, dimpled type lines. There are clearly crosses between this edge of the face cloth and the red streaks. The crosses clearly depict Christ’s image on the shroud, which the face cloth sits on top of.\nWell, that’s my strong opinion, anyway.\nyou are perfectly entitled to your view!\n\n","date":"June 14, 2012 at 4:33 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12431","author":"Matt","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"ok, results in. My son traced the outline of the cloth and it agreed with my opinion independently.But….to be fair my wife independently came to your conclusion Colin\n\n","date":"June 14, 2012 at 5:40 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12437","author":"Matt","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"I’ve asked 5 people today to trace the outline of the face cloth, and all have come to the same conclusion I did. They clearly see the edge of the cloth as I have, and consider the cloth is transparent, hence why you can see a couple of the crosses through the cloth.\n\n","date":"June 15, 2012 at 3:15 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12494","author":"Matt","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"ha ha ha. Just thought I’d add in my PhD since you did for yourself the other day, just to make it clear that contrary to what “some” people may think, it is not just nutty simpletons who believe the manuscript images were based on the shroud. BTW, in my Catholic prayer group 3 out of 8 members are current doctoral students in SCIENCE. So  much for science and Christianity being incompatible!\n “Who says there is blood on the sarcophagus lid? I certainly don’t. My interpretation is that it is just peeping through on the wavy end of the shroud having tracked down the inside surface that is out of view”\nNow that is a good one!!!!\n\n","date":"June 14, 2012 at 4:27 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12430","author":"Matt","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"I recently read a paper by Gian Carlo Rinaldi (one of the Italian CICAP “High Priests”) on the Pay codex miniatures. Here’s my comment  to him via Dan’s blog: \nLe raffigurazioni del corpo di Cristo sdraiato nudo sulla sua sindone, rimarebbero priva di (quasi) ogni spiegazione se non le si vedessero causate dalla presenza della Sindone durante il XII secolo nella capitale bizantina. Ad occhio nudo ma iniziato, si vede che Lei non è del tutto un esperto del’Arte Medeviale. Mancano a Lei non solo una vista iconologica ma anche una intima conoscenza decrittiva de la relica. La sua detta “analysis” è proprio una buffa DA e PER gran ignoranti in materia iconografica. Lei è proprio un esperto immaginario, un Italian Kutnetzov del’Arte Medeviale.\n\n","date":"June 14, 2012 at 5:05 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12432","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Typo error: “La raffigurazione”\n\n","date":"June 14, 2012 at 5:10 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12433","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"…ponere tutto nel singolare doppo.\n\n","date":"June 14, 2012 at 5:22 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12435","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"“Correction: “Ad occhio nudo pure iniziato”\n\n","date":"June 14, 2012 at 9:11 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12455","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Here are comments (MOST OF THEM WERE CENSORED BY Colin Berry) on his blog): Oilscienceboiled, you keep asserting those who believe the Pray Ms has a link with the Turin Shroud are just nuts and simpletons. Do you really, honestly think you are scientifically, scholarly and/or professionally qualified to offer a credible opinion on a 12th century cryptic ms? Are you kidding? You are nothing but an imaginary expert, a British Kutnetzov of Medieval Art! (May G.d forgive Oilscienceboiled, he just doesn’t know what he is doing!).\nYou just cannot admit the relationship between the archaeological and the iconographic document as it would RUIN your Jacques-de-Molay-tortured-on-a-grate theory. BTW JdM was burnt at the stake in a kneeling (not a standing-up) position on a little island a little off Paris Cardio…. Your ignorance of the subject matter is JUST BEYOND LIMITS (“just flabbergasting” as you would say it across the Channel)…\n\n","date":"June 14, 2012 at 6:51 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12444","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"In one of his illustations, Colin Berry’s desperate attempt at BLANKing out his imaginary Pray Ms empty shroud looks much more like trying to BLUE IT OUT [of nowhere]!\nTo CB: Meaning misinterpretation, WHY did you blanked out the “large” red spot in connection with the double red rivulet? Trying to wipe out as much as possible of the forensic evidence of your iconographic crime scene?\n\n","date":"June 14, 2012 at 8:37 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12447","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Why shan’t you take a look at the Turin Shroud? Cannot you CRYPYOICONOLOGICALLY see the relatively “large” red spot seen in connection with the double red rivulet might well be evocative of the wound side large bloodstain (on the Turin Shroud front side) in tight  connection withe the double blood rivulet (TS back side)? I guess you…won’t!\n\n","date":"June 14, 2012 at 8:44 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12448","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"One here has to admit or not the miniaturist’s artistic licence to feature the TS correlated large bloodstains and double blood rivulets…\n\n","date":"June 14, 2012 at 8:49 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12450","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"TO DAN PORTER BLOG MASTER I repeat my unattened question: “could you tell me the reason why you didn’t publish the illustrations I emailed you a week ago to back up my comment on my formal identification of the Pray Ms miniature shroud square-topped stepped pyramid weave pattern with the Turin Shroud marcrographic weave pattern? It would have saved me time and energy and made my point clearer almost fromthe start of this endless debate/wrangle.\n\n","date":"June 14, 2012 at 7:08 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12445","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Max, maybe it’s because he is in the middle of moving! He’s got alot going right now. Give him some time.\nR\n\n","date":"June 15, 2012 at 7:45 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12511","author":"Ron","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"I think it is significant that Colin has finally admitted that the two red streaks represent blood on the shroud. I am happy to be corrected but as far as I can recall there are no images of this period that show the shroud in an entombment scene, with blood stains / marks. This uniqueness presents a further argument for the pray manuscript images having been influenced by the shroud.\n\n","date":"June 14, 2012 at 8:56 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12451","author":"Matt","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Good point, Matt. Actually we can stil push a little further on and more in-depth to make it even a VERY good point….\n\n","date":"June 14, 2012 at 9:03 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12453","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"\nMatt :\nI’ve asked 5 people today to trace the outline of the face cloth, and all have come to the same conclusion I did. They clearly see the edge of the cloth as I have, and consider the cloth is transparent, hence why you can see a couple of the crosses through the cloth.\n\nWhy should cloth be transparent, Matt? Have you looked at any linen recently? And if the cloth were transparent, how come it’s only a few inconsequential crosses that show through?\nAdmit it. There are no compelling biblical grounds for the illustrator needing to include a napkin in his picture, but every reason to show a burial shroud, which is what that heap of discarded cloth represents, with those inexpert black crosses to distinguish between shroud and patterned sarcophagus lid.\n\n","date":"June 15, 2012 at 3:27 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12495","author":"colinsberry","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Colin\nHow about you ask a few people for their opinion? Without bias. Just say “look, do you see that cloth looking object sitting on the object with the pyramid like pattern? Can you trace with your finger what you think the outline of the cloth is”\nI have nothin to “admit”. The cumulative evidence points strongly in favour of the view that the images in the manuscript has been influenced by the shroud.I’m not going to repeat each item of evidence again, it’s been done to death.\nAnd again you make the “fundamentalist scientist” error of trying to interpret everything literally, in terms of questioning why the head napkin should be transparent.\nIn your world view, we need to rationalise the great symphonies, the great art, the geat poetry. There is no room for artisitc licence, symnolism, metaphor. What a sad, souless, artless and one dimensional world view.\n\n","date":"June 15, 2012 at 6:02 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12509","author":"Matt","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Certainly I am coming at it from a different perspective than you and others, Matt, but to portray it in the terms you do as a clash between art and science is laughable (and if the truth be told, a wee bit pathetic).\nThe Pray Codex is NOT a work of art, nor was it intended as such. It is a small line illustration in a Codex (i.e. early book). The “artist” had no real-life tableau in front of him – he had to draw what was in his imagination, and it’s clear that perspective was something that he (and probably most of his contemporaries) had still to master. That is why it can take the modern viewer a little time just to discern that it is a medieval-style and probably anachronistic sarcophagus with its raised lid that dominates the picture (a fact that seems to have eluded quite a few here too it seems if you go back through earlier posts and comments). \nThat’s why you cannot just stick the Codex under someone’s nose and ask “Tell me what  you see”. The answer is likely to be as untutored as the ones we have seen here earlier. You have to present your straw poll sample with rival interpretations, maybe with some background biblical notes, and then ask: “Which is the better interpretation of what you see, viewed within its historical and religious context?”.\nI too will stop here, rather than repeat what I have already said. I have made my position clear on my own strawshedder blog, and see that it is already listed near the top of page 2 returns of a Google search of # pray codex#.  \nYou see, unlike some here, I have to think long and hard before expressing an opinion, knowing that my future credibility as a blogger, to say nothing of search engine rankings, could be undermined by indulging in over-hasty or fanciful judgements.\n\n","date":"June 15, 2012 at 6:34 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12510","author":"colinsberry","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Colin Berry wrote: “You see, unlike some here, I have to think long and hard before expressing an opinion, knowing that my future credibility as a blogger, to say nothing of search engine rankings, could be undermined by indulging in over-hasty or fanciful judgements.” \nCB, you care to much for the hearsay and search engine rankings. STILL  -and no matter how LONG & HARD you can think,- you are not only wrong in your opinion but also in the iconological facts just under your nose when it comes to decipher a slightly cryptic medieval art work.\n\n","date":"June 15, 2012 at 2:10 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12543","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"I’ve just come to this comment of Colin’s and again have to disagree and feel the need to explain this: \n“There are no compelling biblical grounds for the illustrator needing to include a napkin in his picture, but every reason to show a burial shroud, which is what that heap of discarded cloth represents”\nWhy are there “no compelling biblical grounds” Colin? The linen cloths and the head napkin are both mentioned in John. Neither are mentioned in Mark, which nonetheless provides a strong basis for the picture. The artist has created a scene that is a composite of the story of different gospels. Both gospels of John and Mark were the most highly revered gospels at that time. Creating a composite picture is in fact highly logical when one thinks that the Christian worldview is a composite of accounts that are in spirit the same, but have differences here and there.\n\n","date":"June 20, 2012 at 6:25 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12762","author":"Matt","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"It’s not the composite nature of the picture that is the problem, Matt. The problem is ione of getting inside the mind of a Codex illustrator who is confronted with the following three consecutive verses from John: “And he (Peter) stooping down, saw the linen clothes lying; yet went he not in. Then cometh Simon Peter following him, and went into the sepulchre, and seeth the linen clothes lie. And the napkin that was about his head, not lying with the linen clothes, but wrapped together in a place by itself.”\nNow I make no pretence at being able to read the mind and intentions of that monk or whoever. But if his version of the Bible was similar to my own, King James, 1925, then he might indeed think there was “no compelling reason” to show the napkin. Were he to do so with strict adherence to the text, he’d have to create a separate place for it in his already overcrowded picture – a miniature don’t forget – and that would risk creating a needless distraction from what surely must be the chief item of interest – namely the vacated Shroud. \nI maintain, as do some others on this board, that the latter, with or without a napkin too, is shown draped on the patterned lid of a sarcophagus. The latter has been wrongly identified with the Shroud, and we all know why (because of the 4 holes that can be seen as “L-shaped”). Why would a medieval illustrator invite ridicule by including 4 “burn holes” on a putative Shroud in a tomb scene, inviting the tart comment – “OK, so you have seen the Shroud on your travels, but why choose to flag it up with the one detail that was NOT on any shroud purchased by Joseph of Arimathea.?  Some might think that he would have hinted at a double image, or a nail wound on the wrist, or a CLEAR epsilon-shaped mark on the forehead – not an indistinct blotch etc etc – anything but those anachronistic “poker holes” easily overlooked among all the patterning (stepped pyramids, not herringbone weave). And if the latter, then two back-to-back sets of poker holes. He  might also have considered placing his 4 little circles on something that was unequivocally the Shroud, not the raised lid of a sarcophagus, propped up at an angle, as it appears in so many other depictions of the Entombment in larger less cluttered, better-executed less ambiguous paintings of the era..  He’d also have eschewed overkill with those little circles by using them sparingly, if at all, elsewhere. \nBut who’s to say the little circles were not his way of testing that his quill was properly loaded with ink?  Don’t forget – there was no scrap paper in those days, just expensive parchment. \n But as I say, I cannot read the illustrator’s intentions. Others here, you included, appear to be able to do so. But then I’m just a retired science bod. You are that magnificent denizen of certain internet websites, this one and Stephen E Jones’s included, known as a Shroudie Spotter, with an ability to see the Shroud, even in pictures of St.Alexius healing that young girl … Yup, you mistook the image of the girl at death’s door, before healing, with the Shroud of Turin, and it was a tedious and boring old science bod who had to point out your tunnel vision. But I bet that did not stop you ticking another box in that “I-Spy  the-Shroud in Unlikely Places”  book of yours…   ;-)\n\n","date":"June 20, 2012 at 7:14 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12767","author":"colinsberry","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Actually it only SEEMS transparent (this may be due to a minor featuring error) as the tiny black slanted crosses are nothing else but a rather ingenuous and economic attempt by the Benedectine monk to feature the SQUARED-TOPPED STEPPED PYRAMID WEAVE PATTERNED WRINKLED SHROUD PORTION (wrinkles resulting from  the Resurrection angel’s foot resting on the shroud covered sarcophagus lid). Some 12th century CE miniatures are just tricky to decipher and DO NEED AN INITIATED EYE/AN EYE FOR FORMS (whether that of a highly qualified Medieval Art Historian or that of an Archaeocryptological Analyst/Archaeocryptologist well versed/most experienced deciphering in Medieval miniatures and graffiti….\n\n","date":"June 15, 2012 at 5:11 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12506","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"The fact is there is compelling ground to interpret the two items (that is the napkin/veil and the shroud) as an interpretation of the famous pasage relating  the Empty Tomb scene in John’s Gospel by the anonymous Benedictine monk. \nActually, the latter might well be not that anonymous if we consider he  substituted his own face to that of Joseph ‘The carpenter) into the First mary ‘s sleeve. In Hebrew Yossef can mean “adds up”. THis is consistent here with a face added up to the sleeve.  The hidden face should be read then in the light of the “a” = “jozef  a……”. Now if we take a very close look, the face can seen with the eyes shut. This is the clinch to deciphering his second name/surname: ÁLMOS, a Hungarian name of the legendary founder of Hungary, meaning “dreamy; sleepy” or, according to folk etymology, “the Dreamt One.” Hence, if my deciphering is correct the miniaturist name would be no other than JÓZSEF ÁLMOS.\n\n","date":"June 15, 2012 at 5:49 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12507","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Colin\nI never claimed the image was a great piece of art. In fact I have stated that it is a relatively poor illlustration. But it is still ART, in that it is a representation of something, with symbolic and metaphorical context.\nAnyway, any further debate is futile because our positions are deeply entrenched and not at all reconcilable. But thanks for the chat, I’ve learnt something and in fact become more convinced of my position.\n\n","date":"June 15, 2012 at 8:34 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12514","author":"Matt","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Matt: I have stated my opinion, based not just on pictures 3A and 3B, in the Pray Codex, but all 4 of them (noting previously details like the mid-palm nail wound in Picture 4 that do not square with the illustrator having had sight of the Shroud). I could also point out the total absence of blood or wounds of any sort in Picture 3A, which again is hardly consistent with an illustrator wanting to send coded messages. I also realized that the “sheet” with the zig zag pattern was in fact a lid (from which the “artist” had somewhat inconsiderately omitted to show the third dimension, i.e. thickness). That happened as a result of looking at more artistic renderings of the Entombment scene in medieval art generally, many of which show the lid separate from the sarcophagus, as per Codex, sometimes propped up at an angle, as per Codex.\nSo let me say this. My position is not “entrenched” as you put it, even if yours is. In fact I have been careful to insert the word “preliminary” into the title of my one and so far only posting on the Pray Codex. If you or someone else can come up with more persuasive evidence that the illustrator was trying to incorporate details specific to the Shroud, and which don’t have more mundane explanations, like decorative features that you and others fancifully interpret as poker holes or herringbone weave, then you will find me more than ready to reconsider and even recant. (It doesn’t bother me unduly whether the Shroud of Turin is exactly the age range suggested by radiocarbon dating. It could be 500 years older, and I would still be intrigued to know how it was produced).\nI still maintain that the answer to the provenance and ‘symbolism’ of the Shroud is to be found on the Lirey Pilgrim’s badge, aka Lirey Medallion, aka Cluny medal. Seek (with your favourite search engine) and ye shall find. Just look for a particular WordPress blog that is not this one, and which shows thermal imprints off bas-relief templates on its banner….\n\n","date":"June 15, 2012 at 9:27 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12515","author":"colinsberry","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"\ncolinsberry :Certainly I am coming at it from a different perspective than you and others, Matt, but to portray it in the terms you do as a clash between art and science is laughable (and if the truth be told, a wee bit pathetic).\nThe Pray Codex is NOT a work of art, nor was it intended as such. It is a small line illustration in a Codex (i.e. early book). The “artist” had no real-life tableau in front of him – he had to draw what was in his imagination, and it’s clear that perspective was something that he (and probably most of his contemporaries) had still to master. That is why it can take the modern viewer a little time just to discern that it is a medieval-style and probably anachronistic sarcophagus with its raised lid that dominates the picture (a fact that seems to have eluded quite a few here too it seems if you go back through earlier posts and comments).\nThat’s why you cannot just stick the Codex under someone’s nose and ask “Tell me what you see”. The answer is likely to be as untutored as the ones we have seen here earlier. You have to present your straw poll sample with rival interpretations, maybe with some background biblical notes, and then ask: “Which is the better interpretation of what you see, viewed within its historical and religious context?”.\nI too will stop here, rather than repeat what I have already said. I have made my position clear on my own strawshedder blog, and see that it is already listed near the top of page 2 returns of a Google search of # pray codex#.\nYou see, unlike some here, I have to think long and hard before expressing an opinion, knowing that my future credibility as a blogger, to say nothing of search engine rankings, could be undermined by indulging in over-hasty or fanciful judgements.\n“Think long and Hard” LOL, come on Colin, you along with Mo and curly see a few old paintings with a ‘Lid’, (and let me stress again here that only a few of the dozens upon dozens of burial paintings show a lid at all.) and you instantly come to A conclusion, which to you instantly and nicely eliminates ‘details’ such as the herringbone weave and poker hole depictions, that most everyone sees (sept you ofcourse). But in saying that, everyone can and will have different opinions about the PC, and what it depicts and everyone is free to their opinion. I just think you are wrong on most of your assumptions…I have my own assumptions aswell; such as what we see is the Shroud (outter) side with the herringbone weave, 4 poker holes and wavy blood streaks depicting what can be seen on the outter side of the Shroud. The Red cosses and some red ‘x’s with the 5 poker holes depicts the inner side of the Shroud (the image side), hense the crosses in red depicting the devine one. The ‘Bundle’ you and Matt have been discussing I see as ‘possibly’ the linen strips, not the face cloth as I think the face cloth is depicted slung over Mary’s arm. The PC obviously was not drawn by a ‘skilled’ artist as several amatueristic ‘perspective’ errors were made, but although it’s failings, it does include alot of details and some ‘Byzantine style’ hidden symbols. To me it seems quite clear whomever the artist was had either directly viewed the Shroud or the details were dictated to him. Some details he derived from scripture but some obviously from the Shroud as these details would not be known unless the Shroud was viewed!…Lets not forget many clergy/monks etc; would make their pilgrimages to Constantinople and if the Shroud was there and raised each Friday, one must expect it would have been the foremost attraction one wouldn’t want to miss. \nR\n\n","date":"June 15, 2012 at 10:13 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12520","author":"Ron","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Mentionnig “[a] thermal imprint”, a&mong the 2-3 theories currently put forward to account for the famous relic series of geometrical burn holes, is that they might well result from granules of burning incense deliberately (fire ordeal)/accidentally sprinkled onto the Shroud. Each year at Easter, in the very course of the Holy Saturday liturgy, an L shape Resurrection mark (as a sign alluding to Lumen Christi) used to be deliberately imprinted on the Paschal candle by placing granules of incense. NOW the Pray Ms 3B miniature, is just followed by the text of the Exultet (Exultet jam Angelica turba coelorum/Exultent Divina Mysteria)… the very hymn that was sung at mass while the L shaped like mark was precisely imprint into the wax with granules of burning incense. Archsceptics will mantrically repeat, this is just another coincidence… Could any of the stubborn archsceptics, tell me exactly how many coincidences do they need before they think  all the spy details are not just coincidental?\n\n","date":"June 15, 2012 at 12:11 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12523","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Typo corretion: “embedded into wax” (instead of “imprinted”)\n\n","date":"June 15, 2012 at 12:46 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12525","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"+ typo correction: “L-like shaped Resurrection mark”\n\n","date":"June 15, 2012 at 12:50 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12526","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"On the throne right arm pummel of a Resurrected Christ in Majesty (Santa Pudenziana Mosaic, ca. 400, Rome), the same L like shape can be seen. Also notice the zigzag weave pattern on the left arm pummel. Still doesn’t ring a bell? A 111/112cm width/long cloth shows stretched just at the back of the throne at Christ shoulder level. Before the 2002 restoration of the Shroud, what was the latter’s exact width? 111-112cm. Still doesn’t ring any bell? The face of Christ is 4-5cm off-centred on the left… just like in the Turn Shroud. Still doesn’t ring any bell. How many bells shall ring before one of you archsceptics can hear with your eyes?\n\n","date":"June 15, 2012 at 12:43 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12524","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"I forget to tell the two Christ faec (Thet of the mosaic and that of the Turin Shroud are at the same scale 1:1 with congruent spy details. The postion of the feet on the P. mosaic is also assymetrical as on the TS…Still no bell ringing?\n\n","date":"June 15, 2012 at 4:12 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12557","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Are you saying that the Santa Pudenziana Mosaic is showing the Turin Shroud? So where was the Turin Shroud in 400 AD ? In Rome? Please explain what your argument is for those who don’t live in the cryptic world of yours but just look at art works as they are.\n\n","date":"June 15, 2012 at 1:15 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12533","author":"menedemus","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"If you look at art works as they are, you can check for yourself. Just Google and /or take a flight to Rome with the ad doc material to measure the mosaic cloth alone and in correlation with the Christ face… if you are allowed to (as a professional archaeocryptologist and Shroud scholar, I was allowed to).\n\n","date":"June 15, 2012 at 1:24 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12537","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"That was in 1997…\n\n","date":"June 15, 2012 at 1:26 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12538","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Better speak Italian….\n\n","date":"June 15, 2012 at 1:28 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12539","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Memory Error: actually the L-like shape is not to be see on the throne pummel but on Christ palium. Sorry.\n\n","date":"June 15, 2012 at 1:33 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12540","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"A BLACK  “L” stands out on the flashing gold of Christ’s clothing (the pallium a civilian’s tunic) (Tunic in Greek othonion/sindon = shroud).\n\n","date":"June 15, 2012 at 1:40 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12542","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"The Turin Sroud body image, seen under a certain angle and light, is IRIDESCENT (as a translucid straw yellow impression) = the use of flashing gold mosaic tiles to feature Christ’s pallium.\n\n","date":"June 15, 2012 at 2:16 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12544","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"= Pallium Lumeni Christi\n\n","date":"June 15, 2012 at 2:20 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12546","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"= Lumen Christi in Sindonem\n\n","date":"June 15, 2012 at 2:23 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12547","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"= L in Sindonem\n\n","date":"June 15, 2012 at 2:24 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12548","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"= Linus Christi\n\n","date":"June 15, 2012 at 2:25 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12549","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"The official first Pope’s name was Linus as secular representaive of Christ on earth that is as his vicarius…\n\n","date":"June 15, 2012 at 2:40 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12551","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Peter was not officially Pope.\n\n","date":"June 15, 2012 at 2:43 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12552","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Going back to the Hungarian Benedictine monk (Friar Jozsef Almos?)  one must bear in mind that most if not all Benedictine monks were well versed in the art of hiding informations (e.g. in an nnocuous miniature like we have here). This cryptographic art is known as steganography and  dates back as early as the 5th century BCE.\n\n","date":"June 15, 2012 at 6:54 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12569","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"In 1518, a Benedictine monk named Johannes Trithemius wrote “Polygraphiae,” the first known published treatise on cryptography in the western world.\n\n","date":"June 15, 2012 at 6:58 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12570","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"It does seem that the Turin Shroud was once used as an altar cloth as the impact of burning incens is situated precisely in the middle of the rectangle of the cloth folded in four.  Can therefore the making of a capital L introducing the word “Lumen” be due to chance ant not be deliberate (e.g. an ordeal by fire), it’s still diffficult to say…\n  In the the French RILT n° 26, were published two different analyses of the charred by four grains of incens:: one  by French chemist ingeneer Raymond Souverain and another by French CIELT honorary chairman MM. van Cauwenberghe. The latter wrote:\n  ‘[Les] cinq miniatures [que contient le Codex de Pray] : \n   Le Christ en Croix\n   La descente de Croix\n   L’onction du corps du Christ\n   La visite des Saintes Femmes au tombeau\n   Le Christ en majesté\n  Dans la partie inférieure de cette dernière miniature, on peut lire (paroles et mussique) l’Exultet chanté le Samedi saint lors de la pose des grains d’encens sur le cierge pascal […].\n  [Ce jour de la semaine sainte] Le diacre chante “Lumen ChristiDeo gratias” puis l’Exultet, celui-là même que nous connaissons aujpurd’hui encore et que l’on retrouve sur la miniature : \n  “Exultet jam Angelica turba caelorum ;\n  Exultent divina mysteria ;\n  Et pro turbo tanto regis victoria, tuba insonet salutaris.\n  Gaudeat et tellus tantis irradiata fulgoribus ;\n  Et aeterni Regis spendore illustrata,\n  Totius orbis se sentiat amisisse caliginem.”\n  Sûr de son intuition, le miniaturist a reproduit endessous du Christ en majesté cet Exuktet avec paroles et musique de l’époque, en “neumes”.\n  Le musicologue Henri Carcelle […] a daté ces signes musicaux anciens appelés “neumes”, du grec “pneuma” qui veut dire soufffle, en usage jusqu’à la fin du XIIe siècle ; ce qui concorde avec les datations paléographiques [1192-1195] [de] Monsieur Emmanuel Poulle […].’\n  I hope the information is useful…\n\n","date":"June 16, 2012 at 7:00 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12581","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"\nRon :\nI have my own assumptions aswell; such as what we see is the Shroud (outter) side with the herringbone weave, 4 poker holes and wavy blood streaks depicting what can be seen on the outter side of the Shroud. The Red cosses and some red ‘x’s with the 5 poker holes depicts the inner side of the Shroud (the image side),\nR\n\n1. You can’t refute a scientific test with assumptions. If you want to refute scientific evidence you must provide scientific evidence, not speculation. Speculation about the Codex Pray do not override the carbon14 test.\n2. Speculation about the holes are not subjective, it is non consistent because need to combine different criteria for the four holes in “L” form and the five as “P”.\nPlease, go to Latendresse page http://people.bridgewater.edu/~rschneid/FocusProjects/Shroud/ShroudMeasure/enrieImg.html and say us the coordenates of the four and five holes that you see in the shroud.\nThen, go to the ShroudScope ( http://www.sindonology.org/shroudScope/shroudScope.shtml ) click on “Poker Holes” box and explain us how is possible than you see a group of five holes and M. Latendresse only groups of three or four.\n\n","date":"June 17, 2012 at 1:40 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12627","author":"David Mo","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Good day to you David\nIf you wish to see hot from the presses  the latest example of Shroudie tunnel vision, of seeing what you want to see, then spare a minute to have a look at the current post on Stephen E Jones’s site, and look at comment no.9 from Matt (yes, our very own Matt, who uses that site among other things to totally distort or misrepresent what I say here).\nHere’s what he wrote. Take a look at the St.Alexius fresco, and see if you agree with me that he has overlooked the obvious fact (with so many figures duplicated) that it is a before-and-after scene, and that what he interprets as the Shroud of Turin is in fact the sick girl at death’s door – shown on the right again as being “on the mend”.\nMatt’s comment\nStephen I got an interesting book on the Christian World in the Middle Ages, I found an image from the 11th century, a fresco from the church of San Clemente, Rome. It depicts scenes from the life of St Alexius, who lived in the fifth century, and interestingly was based in Edessa.\nIn this image, St Alexius is praying over a sick girl, but look at the object by his right side. It looks suspiciously like a representation of the Shroud of Turin, although it is a bit hard to decipher the detail. At the very least, it is Jesus’s full length image on “something”.\n\nThoughts???\nMatt\nJune 17, 2012 3:54 PM\n\n","date":"June 17, 2012 at 5:41 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12628","author":"colinsberry","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"I did not put you back on moderation, Colin. Two links in one comment triggers moderation. As usual, you jump to conclusions in your blog, Colin.\n\n","date":"June 17, 2012 at 7:29 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12632","author":"Dan","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"On the Shroud Scope I have drawn overlaying bounding boxes for the so called poker holes on the Shroud, but, sorry, they are not indicative of the way these holes could have formed neither how many holes exist near these bounding boxes. Clearly there is a pattern of more than four holes at one location on the Shroud. That one location has a similar pattern as the one on the Pray Codex miniature. See \nhttp://www.dshroud.com/shroudScope/shroudScope.shtml?zl=6&image=4&lon=9006.5&lat=875.5&poker=t\nThe Pray Codex cannot be understood without referring to the diplomatic context of Hungary vs Constantinople. The king of Hungary Bela III lived at the Constantinople court for almost a decade and was supposed to become the next  Byzantine emperor. He was for a while second in ranking in the Byzantine empire. He most likely saw the shroud that was in Constantinople. Bela III became king of Hungary until 1296. Oddly enough, the similar patterns to the poker holes of the Shroud of Turin are now on this miniature drawn by a Hungarian monk in a clear context of Jesus tomb, somewhere between 1293-1295. There is therefore a likely connection between the Constantinople shroud, the Pray Codex and the Shroud of Turin.\n\n","date":"June 17, 2012 at 10:58 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12634","author":"Mario Latendresse","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"I’m hugely grateful to you for your Shroud Scope, Mario. But I have to take issue with anyone who spots 4 small circles on a densely patterned sarcophagus lid (“zig zags”) and wants to make a connection with the so-called poker holes on the Shroud. It’s not that they can definitely be excluded as a symbolic representation of the poker holes. It’s simply that there is insufficient corroborating evidence or “context” to be certain that those holes are not mere coincidence, or served some other function in the illustrator’s mind that we can only guess it. (Who’s to say that a monk doing the initial line outlines for a miniature with a quill pen and ink did not use little circles to ensure there was enough ink in the quill to start on the next bit without needing a second dip, recalling that scrap paper for testing did not exist at that time?).\nThe kind of evidence that would have impressed this sceptic would  have either been a hint of some kind of image on the burial shroud, preferably twin – frontal and rear – or – if using the poker holes (an irrational and anachronistic choice of feature when you think about it, but never mind) – to have shown TWO L-shaped distribution of “holes” back to back, like bookends, reflecting the pattern and symmetry on the Shroud of Turin.\nBtw, there is what looks for all the world like a line of stitching on the dorsal side of your 2002 Durante image, just above waist level. I suspect that it’s an artefact of scanning, based on the fact that the vertical “stitches” appear to be continuous with the weave of the linen, i.e. a kind of kink that puts two sections of weave out of register. Would I be right in thinking that the line of “stitches” is due to some kind of hiccup in the scanning or subsequent splicing of images, and is not ito be mistaken or some kind of major repair work with needle and thread, a botched attempt at “invisible “reweaving”?\n\n","date":"June 17, 2012 at 11:38 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12635","author":"colinsberry","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Colins Berry wrote\n“Btw, there is what looks for all the world like a line of stitching on the dorsal side of your 2002 Durante image, just above waist level.”\nI am not sure I understand. I cannot reproduce this on Firefox or Safari on a Mac. At which zoom level does it happen and which browser are you using?\nWhat might be happening is a gap of one or two pixels between the tiles when the Shroud is displayed. The shroud is displayed as rectangular image tiles of 400×200 pixels. I have seen this on the iPad, but not always. (So far I attribute this to a Safari rendering engine bug on the iPad) It would clearly be seen as a repetitive pattern of vertical and horizontal straight pixel lines right through the entire Shroud image and can hardly be confused with stitches. If you could attach an image of what you see that would clarify what is wrong.\nAs for the level of coincidences of the Pray Codex miniature details and the Shroud, it is important to take into account the entire context and details at the same time. So far, in the discussion that has been going on this post, none ever refer to the essential fact that Bela III, king of Hungary when the Pray Codex was produced, had been at the Constantinople court for a decade a few decades prior to 1293-1295 and was almost at the level of Byzantine emperor while over there. He surely must have seen the shroud that was in Constantinople. Given the fact that the shroud of Constantinople is the most likely place where the Shroud of Turin was, this fact cannot be put aside. In your reply, you did not consider this fact, neither the other clear fact that on the Shroud you have two different patterns of holes: two with a L shape, two others like a P shape (for a better term, they look like a rectangle). This is exactly the two patterns you see on the Pray Codex miniature.\nThese are two details among others.\nIn any attempt to measure the coincidence of such depictions one is left to quantify the probability that all these details find their way together on the same small miniature drawing. And again taking into the global context of the relation of Bela III and Constantinople. (Of course, you already know that the king is financially supporting the Benedictin monastery where the monks lived.)\nWe could actually model such coincidences.\nAnd as an aside curiosity about the Shroud Scope, you can see a loose thread that was drop on the Shroud when the shot was taken (a lost thread during the restoration?): \nhttp://www.dshroud.com/shroudScope/shroudScope.shtml?zl=11&image=3&lon=3962&lat=6097&poker=t\nTo all readers, where do you think this thread comes from?\n\n","date":"June 17, 2012 at 1:37 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12638","author":"Mario Latendresse","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"\nDan :\nI did not put you back on moderation, Colin. Two links in one comment triggers moderation. As usual, you jump to conclusions in your blog, Colin.\n\n Thank you for that information Dan (I trust the reported house move is going well, btw). I wonder how many folk here knew that two or more links triggered moderation – I certainly did not.\nAnyway, I shall now remove references to “pre-moderation” from my posting – but the rest regarding Shroudie tunnel vision, as displayed by Matt on Stephen E Jones’s site, remains. \nOpportunities to make a telling point cannot be allowed to slip through one’s fingers, especially when it serves as a riposte to appalling site-  one that persistently attempts to demonise and even to deny the right of reply to sceptics such as myself. Yes, it is you and that propagandist siteof yours  I refer to here, Stephen E Jones, one that makes a mockery of that science degree that you are at such pains to flaunt. But you won’t know I am writing this since you have said on more than one occasion that you do not read the comments on Dan’s site (“empty vessels” etc).\nLink to my own site B (which I reserve for ephemera and the more controversial stuff):\nhttp://strawshredder.wordpress.com/2012/06/17/stop-press-heres-the-latest-example-of-shroudie-tunnel-vision/\n\n","date":"June 17, 2012 at 7:52 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12633","author":"colinsberry","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"\nRon :\n… come on Colin, you along with Mo and curly see a few old paintings with a ‘Lid’, (and let me stress again here that only a few of the dozens upon dozens of burial paintings show a lid at all.)\nR\n\nDoes this statement is based on a personal study? How many  dozens of coffins have you counted?\nI did a small survey that is somewhere in these forums. Almost a third of the coffins at the scene of the Holy Women were represented with its cover beside it. Although no more than a quarter would be sufficient to conclude that this type of representation was common in medieval paintings.\nHere a massive representation of sarcophagus with its lids. Several lids are rectangles placed diagonally. As in the Codex Pray.\nhttp://imageshack.us/photo/my-images/820/ataudes.jpg/\nToledo, San Román church, 13th century.\n\n","date":"June 17, 2012 at 12:36 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12636","author":"David Mo","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"\nMario Latendresse :\nOn the Shroud Scope I have drawn overlaying bounding boxes for the so called poker holes on the Shroud, but, sorry, they are not indicative of the way these holes could have formed neither how many holes exist near these bounding boxes. Clearly there is a pattern of more than four holes at one location on the Shroud. That one location has a similar pattern as the one on the Pray Codex miniature. See\n(…)\nThe Pray Codex cannot be understood without referring to the diplomatic context of Hungary vs Constantinople.\n\nHello, Mr. Latendresse. Congratulations for your wonderful pages Shroudscope and Length Measurements…. Both are very useful. Now, some questions: \n1. If you don’t see poker holes in  “L” forms why do you highlight it with these forms?\n2. Can you say the coordenates of the poker holes in “L” and “P” forms?\n3.You suppose Bela III had to see the shroud of Turin in Byzantium. Is there a document in this regard? Or is it just a guess?\n4.  To assume that Bela III saw the shroud in Byzantium we must first assume that the shroud was in Byzantium. Are not too many assumptions? Do you have any more than assumptions?\n5. Do you know any medieval description of any medieval cloth with Christ (Mandylion, shroud, Veronica, etc.) figures describing the weft of the tissue? It would surprise me greatly.\nThank you.\n\n","date":"June 17, 2012 at 1:03 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12637","author":"David Mo","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"1. I am not sure I understand your question since I do see an L form in two places, one of them more prominent than the other, as well as two P-like forms. In the case of the latter they look like a rectangle, perhaps we should call them O-form? I did draw four L forms to point out the fact that the four patterns go together as if something that was burning on one panel (assuming the Shroud was folded) made it through the other panels of the Shroud. This is clearly a simplification of what we can readily see, since some locations have different number of holes. Do you agree?\n2. You want to know the coordinates of the L and P forms on the Shroud Scope? This is essentially what I sent in the last post for the L form. The URL contains the coordinates. Note that these coordinates depend on the zoom level. Here is the URL to one L form, I am sure you can find the others (one other L and two P-like forms) by panning an changing the zoom level.\nhttp://www.dshroud.com/shroudScope/shroudScope.shtml?zl=8&image=3&lon=3482&lat=12552.5&poker=t\nNotice the lat and lon parameters (the coordinates), as well as the zl (zoom level) parameter in this URL.\nDoes it work for you?\n3. The assumption that Bela III saw the shroud in Constantinople is based on common sense and knowledge of what the Byzantine Empire was all about.  The Byzantine Empire was a state centered on Christ. The Emperor was often depicted as servant of Christ. The relics of Christ were the most important treasure of the Byzantine Empire. Bela III was the heir of the Byzantine Empire, second only to the Empire. Bela III was sent to Constantinople to further is education. Between the statements that Bela III “never saw” the shroud and he “saw” the shroud, I conclude that the second one is most likely.\n4. There was a shroud in Constantinople. This is based on several written documents. The question is: was the shroud in Constantinople the Shroud of Turin? But this is the whole discussion of this post. And your question appears to be formulated as if you are assuming that there is no evidence at all (written or otherwise) that no shroud of Christ was reported to exist in Constantinople. This would contradict many written documents.\nDo you agree that there is a reported (by various written documents) shroud of christ in Constantinople?\n5. There are probably many such representations of the Shroud weave during medieval time. There is of course the Lirey Medallion (still at the Cluny Museum in Paris) and for example the following \n\nNotice that the church housing this fresco was constructed in 1164 as a foundation of Alexius Angelus Comnenus, a son of Constantine Angelos and Theodora Komnene, a daughter of Byzantine Emperor Alexios I Komnenos. \nDo you agree that this fresco does depict the weave of the cloth (of that shroud in the fresco)?\nNote: I wrote “shroud” not “Shroud”, the former is the shroud we see on the fresco, the latter is the Shroud of Turin.\n\n","date":"June 17, 2012 at 2:44 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12641","author":"Mario Latendresse","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Hello again Mario\nI have just put up a quick post so you know what I am referring too. My picture also appears to show a loose thread, but it’s that line of “stitching”(?) that interests me most.\nhttp://shroudofturinwithoutallthehype.wordpress.com/2012/06/17/shroud-scope-6-is-that-transverse-stitching-across-the-dorsal-view-or-just-an-artefact-of-imaginmg-6-2/\n\n","date":"June 17, 2012 at 2:17 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12639","author":"colinsberry","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"PS: I am using Firefox as browser, and MS Office Picture Manager to improve contrast.\n\n","date":"June 17, 2012 at 3:04 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12642","author":"colinsberry","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"From the photos you posted, this is certainly not a Shroud Scope artifact neither do I think it comes from scanning the image. I think it is a slight defect in the weaving of the cloth (as if the tension on the weft was not kept for a few centimeters) and not stitches.\n\n","date":"June 17, 2012 at 3:05 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12643","author":"Mario Latendresse","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Thanks Mario. I’m inclined to agree (and would not have bothered you with it, but for the fact that I could find nothing about that interruption in the weave pattern elsewhere).\n\n","date":"June 17, 2012 at 3:31 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12645","author":"colinsberry","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"\nDavid Mo :\n\nRon :I have my own assumptions aswell; such as what we see is the Shroud (outter) side with the herringbone weave, 4 poker holes and wavy blood streaks depicting what can be seen on the outter side of the Shroud. The Red cosses and some red ‘x’s with the 5 poker holes depicts the inner side of the Shroud (the image side),R \n1. You can’t refute a scientific test with assumptions. If you want to refute scientific evidence you must provide scientific evidence, not speculation. Speculation about the Codex Pray do not override the carbon14 test.\n2. Speculation about the holes are not subjective, it is non consistent because need to combine different criteria for the four holes in “L” form and the five as “P”.Please, go to Latendresse page http://people.bridgewater.edu/~rschneid/FocusProjects/Shroud/ShroudMeasure/enrieImg.html and say us the coordenates of the four and five holes that you see in the shroud.Then, go to the ShroudScope ( http://www.sindonology.org/shroudScope/shroudScope.shtml ) click on “Poker Holes” box and explain us how is possible than you see a group of five holes and M. Latendresse only groups of three or four.\nFirst don’t place my comments out of context. I never used the PC to refute the C14 dating. If you read ALL my comments carefully, you’d know there are many reasons to refute the C14 without the PC or even the proposed reweaving. It’s common sense, if one “reads” on the science/protocols/limitations of C14 testing…that the c14 of 1988 should be nullified…maybe you should do some research in this area too? Second, I don’t give a shit what Latendresse sees, does he have better vision then I?, I don’t think so. Maybe YOU should take a closer look at the Shroud poker-holes also?\nHey, I just mentioned my speculations, how I observe the details on the PC, just as everyone else has done so also! Everyone including yourself and I can only speculate on WHAT WE SEE. Can you refute that?\nR\n\n","date":"June 18, 2012 at 1:03 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12651","author":"Ron","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"I should qualify here that although I stated I don’t care what Mr. Latendresse sees, as opposed to what I see, I do respect his opinion.\nThanks.\nR\n\n","date":"June 18, 2012 at 1:23 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12652","author":"Ron","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"I respect your opinion, Mr. Latendresse’s opinion and any other opinion. But your answer evade my question. In european football we say “throw balls out”. It is a way of stop the game when things go wrong.\n\n","date":"June 18, 2012 at 1:49 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12655","author":"David Mo","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Thank you. \nMy answers:\n1.Yes, I agree. By “simplifficación” I understand that to highlight the structure of the holes can be said that there are five in the shape of “P” or 15 shaped “O” or rectangle. That is, identify holes and is arbitrary. If we adopt a model we see “L” and “P” and if we adopt another will see rectangles or “O”.\n2.No. The concrete description of the coordenates shows that you can only see “L” and “P” if you use different norms.  That is, big holes only for the “L”, big and small holes for the “P”. And you forget the holes disturbing your interpretation. \nConclusion: The similarity between the Codex Pray rings and poker holes in the shroud is arbitrary.\n3-4: I agree: there was a shroud with image in Constantinople. But not “reported by various written documents”. Only crusader de Clari mentions it in 1204 (a few later the death of Bela III).\n5. No. I did not ask you for representations of the shroud, but for descriptions. We know very little medieval descriptions or representations of the shroud of Turin. We know a little more for the Mandylion and the Veronica Holy Face. No reference to the weft of the fabric is done till modern times. No reference of the poker holes. Medieval descriptions talk about the placement of the hands, the face of Jesus, his expression and wounds. The weft of the fabric or the holes (if there were) was irrelevant information. Is highly unlikely that Bela III says this to painter and this one paints just this to report the presence of the shroud of Turin in the tomb. This explanation has no base. It is just absurd. \nConclusion: There is not evidence of any relationship between the shroud in Constantinople around 1200 and the Pray codex. Only baseless assumptions.\n\n","date":"June 18, 2012 at 1:38 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12653","author":"David Mo","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"“Thank you, Mr. Latendresse”. Sorry.\n\n","date":"June 18, 2012 at 1:40 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12654","author":"David Mo","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"\nMario Latendresse :Colins Berry wrote\n“Btw, there is what looks for all the world like a line of stitching on the dorsal side of your 2002 Durante image, just above waist level.”\nI am not sure I understand. I cannot reproduce this on Firefox or Safari on a Mac. At which zoom level does it happen and which browser are you using?\nWhat might be happening is a gap of one or two pixels between the tiles when the Shroud is displayed. The shroud is displayed as rectangular image tiles of 400×200 pixels. I have seen this on the iPad, but not always. (So far I attribute this to a Safari rendering engine bug on the iPad) It would clearly be seen as a repetitive pattern of vertical and horizontal straight pixel lines right through the entire Shroud image and can hardly be confused with stitches. If you could attach an image of what you see that would clarify what is wrong.\nAs for the level of coincidences of the Pray Codex miniature details and the Shroud, it is important to take into account the entire context and details at the same time. So far, in the discussion that has been going on this post, none ever refer to the essential fact that Bela III, king of Hungary when the Pray Codex was produced, had been at the Constantinople court for a decade a few decades prior to 1293-1295 and was almost at the level of Byzantine emperor while over there. He surely must have seen the shroud that was in Constantinople. Given the fact that the shroud of Constantinople is the most likely place where the Shroud of Turin was, this fact cannot be put aside. In your reply, you did not consider this fact, neither the other clear fact that on the Shroud you have two different patterns of holes: two with a L shape, two others like a P shape (for a better term, they look like a rectangle). This is exactly the two patterns you see on the Pray Codex miniature.These are two details among others.\nIn any attempt to measure the coincidence of such depictions one is left to quantify the probability that all these details find their way together on the same small miniature drawing. And again taking into the global context of the relation of Bela III and Constantinople. (Of course, you already know that the king is financially supporting the Benedictin monastery where the monks lived.)\nWe could actually model such coincidences.\nAnd as an aside curiosity about the Shroud Scope, you can see a loose thread that was drop on the Shroud when the shot was taken (a lost thread during the restoration?):\nhttp://www.dshroud.com/shroudScope/shroudScope.shtml?zl=11&image=3&lon=3962&lat=6097&poker=t\nTo all readers, where do you think this thread comes from?\nMario your point above about Bela III visiting and living in Constantinople is a strong point! One that the details eluded me when I made my comment that the artist’s specific ‘clues’ on the PC, may have been ‘dictated’ to him. So thank you for making your comment.\n I would think it would be ‘VERY UNLIKELY’ that Bela III would not have viewed the Shroud, especially with his high standing! He may have even possibly been given direct personal access to the Shroud for the same reason,…better then most for sure. I don’t think there is much speculation in that reasoning also. He may have even had a subordinate make a sketch of the Shroud for all we know, as so much has been lost to antiguity. I also agree that ALL details on the PC must be considered as a whole and not disected when coming to any conclusions.\nR\n\n","date":"June 18, 2012 at 1:52 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12656","author":"Ron","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"\nDavid Mo :I respect your opinion, Mr. Latendresse’s opinion and any other opinion. But your answer evade my question. In european football we say “throw balls out”. It is a way of stop the game when things go wrong.\nDid you ask me a question? I didn’t see one. If you meant a return as to how I see 5 holes, I said look for yourself! If you don’t see that one of the poker hole patterns is made up of 5 distinctive if not more holes, you along with Colin need an eye examination.\nR\n\n","date":"June 18, 2012 at 1:58 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12657","author":"Ron","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"To Mr. Lantendresse. It looks to me that, that “thread” seems to be resting on the Shroud. I think I can see a slight shadow on the top-side. I would assume it could be, ‘maybe’ from a pair of cloth kiddy gloves used during the restoration or when the Shroud was placed for the pictures.\nR\n\n","date":"June 18, 2012 at 2:12 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12658","author":"Ron","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"\nMario Latendresse :\nAs for the level of coincidences of the Pray Codex miniature details and the Shroud, it is important to take into account the entire context and details at the same time. So far, in the discussion that has been going on this post, none ever refer to the essential fact that Bela III, king of Hungary when the Pray Codex was produced, had been at the Constantinople court for a decade a few decades prior to 1293-1295 and was almost at the level of Byzantine emperor while over there. He surely must have seen the shroud that was in Constantinople. Given the fact that the shroud of Constantinople is the most likely place where the Shroud of Turin was, this fact cannot be put aside. \nTo all readers, where do you think this thread comes from?\n\nIt is assumed that Pray Codex proves the existence of shroud of Turin before 1350. You can not start assuming what the argument is to prove: the “likely” existence of the Turin Shroud in Constantinople prior to 1350. This is a logical fallacy.\nTrue, the context is important, but only if we can link the context to events. Moreover, there is another important context for understanding the presence of a shroud in Constantinople in 1204 and the shroud of Lirey in 1350: the frenzy market of relics broke out in Europe at that time. A lot of relics manufactured in the Middle East was spread out by the courts of Europe at great prices. Even small religious centers participated in it. Thus it arose forty shrouds, several holy face, boxes of nails of Calvary, forests of the Holy Cross, feathers of archangels, liters of Jesus’ blood and other nonsense. Do it have to do with the mysterious appearance of a fabulous relic in a modest collegiate church of France in the midst of the Hundred Years War? Very likely.\nYou see, the context is multidirectional.\n\n","date":"June 18, 2012 at 2:29 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12660","author":"David Mo","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"You misunderstood my statements. I did not assume, in this particular reasoning, that the “Shroud” (as the Shroud of Turin) was in Constantinople. I stated that there was a shroud in Constantinople (notice the lower case shroud). This is a fact well supported by historical documents. So the “logical fallacy” appears as a confusion from your reading of my post. That there are copies of shrouds or other relics is irrelevant. We can today clearly identify a copy of the Turin Shroud vs the Turin Shroud itself.\n\n","date":"June 18, 2012 at 3:39 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12683","author":"Mario Latendresse","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"\nRon :\n\nDavid Mo :I respect your opinion, Mr. Latendresse’s opinion and any other opinion. But your answer evade my question. In european football we say “throw balls out”. It is a way of stop the game when things go wrong.\nDid you ask me a question? I didn’t see one. If you meant a return as to how I see 5 holes, I said look for yourself! If you don’t see that one of the poker hole patterns is made up of 5 distinctive if not more holes, you along with Colin need an eye examination.\nR\n\nWell, say in what coordenates you see the 5 holes. It is easy. The discussion will end immediately. Otherwise we only have free charges on lack of sight. Is it a matter of ophthalmology?\n\n","date":"June 18, 2012 at 2:36 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12661","author":"David Mo","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Cuando se trata de establecer la posibilidad de una relación entre la Sábana de Constantinopla y la Sábana de Turín, AMBAS CON IMAGEN, es una FALACIA permanente de los escépticos ( siempre la utilizan) el hacer referencia a los 40 sudarios (?) existentes en la Edad Media, sin que puedan DOCUMENTAR mínimamente ninguno de esos INEXISTENTES sudarios ( CARENTES DE IMAGEN).\n\n","date":"June 18, 2012 at 4:19 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12663","author":"carlos","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Until you can show a large shroud with a double image on it on the Pray Codex ,you are not going to persuade anyone outside the Shroud community that this is a representation of the Shroud of Turin. Readers of this blog may be convinced that they can ‘see’ it , but don’t expect to convince anyone else especially as no one defending the Codex on this blog has shown that they have any expertise in the history of art and there are lots of questions as to why a relatively obscure ( compared to the other more  prestigious relics held in Constantinople) relic should be illustrated by anyone in the first place. Burial shrouds were never first rank relics at any point in the Middle Ages and  no one here  has come up with an original academic article making the case for the Codex showing the Shroud.\nIt is the same with Professor Lombatti’s article- it is a pity that it was released through a newspaper because comments on it  should be avoided on it until the original, which will be published in a prestigious academic journal, is available  and one hopes then that it is subject to any criticism it deserves from people who have the same academic credibility and experience as Professor Lombatti. One can study the Shroud for years on end but if one does not have a basic background in medieval art or history, then you are hardly likely to say anything of importance. There is still no clear DOCUMENTARY evidence that an academic historian would accept for the existence of the Shroud before 1350.\n I leave ti to the scientists to argue if there is any SCIENTIFIC evidence in the Shroud existing earlier that the medieval period\n\n","date":"June 18, 2012 at 4:40 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12664","author":"menedemus","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"The author of the book “The Sign” is a reputable art historian and he claims that the codex was influenced by the Shroud. Until you, or Colin or any other skeptic can present an art historian of equal or better standing than him arguing based on comprehensive analysis that the codex is unlikely to have been influenced by the Shroud, then you are on the losing side of the argument in terms of art history.\n\n","date":"June 18, 2012 at 7:17 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12668","author":"Matt","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Colins y Mario:\n“Otras anomalías, especialmente en trama, son debidas a la habilidad o experiencia del tejedor, dando lugar a zonas más o menos tupidas.\nAnomalía también, para nosotros ahora, es observar que algunos hilos de trama ROTOS dentro del cuerpo del tejido, fueron anudados durante la tejedura, cosa que no se haría hoy por el más alto precio de la mano de obra.”\nHay un magnífico estudio TEXTIL, en español, de F.López-Amo: “ESTUDIO TÉCNICO-TEXTIL DE LA SÍNDONE DE TORINO Y EL SUDARIO DE OVIEDO”, en que se estudia las IRREGULARIDADES del hilado.\nCreo que es único.\nhttp://upcommons.upc.edu/revistes/bitstream/2099/1630/1/116-7.pdf\nhttp://upcommons.upc.edu/revistes/bitstream/2099/1644/7/articulo_boletin_117.pdf\n\n","date":"June 18, 2012 at 4:47 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12665","author":"carlos","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Thomas de Wesselow was once a reputable art historian. His credibility has been shattered by the ‘The Sign’ as you will see a) by the range of reviews it has got b) by the embarrassed silence on the part of the art history establishment since it came  out. In his pages on the Pray Codex he does little more than repeat some speculative ideas by others- he nowhere adds any significant reason for seeing the Shroud in the Codex.\nIt is sad that Professor Lombatti’s detailed analysis of all these issues  and his full rebuttal, point by point of Ian Wilson’s history,has not yet been translated into English. But Lombatti is already being condemned by all and sundry on the basis of a newspaper report of an article he is due to publish in one of the most prestigious medieval journals around. But, hey, what does a Professorship in these issues count for if you are from Italy- probably as a sophisticated a place to study medieval history as anywhere- if there are all these US/UK experts who already know the truth about relic cults, Byzantine art, medieval depictions of the entombment, medieval Greek and Latin, etc. etc, areas which normally take years of full time study to master, certainly if you are going to be awarded a professorship.\n\n","date":"June 18, 2012 at 9:32 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12671","author":"menedemus","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Menedemo, no confunda la velocidad con el tocino.\nLa opinión que tenga Wesselow sobre el hecho de la Resurrección, su interpretación, NO tiene nada que ver con su condición de EXPERTO en arte.\nEl que Wesselow no le guste a usted es otra cosa.\n\n","date":"June 18, 2012 at 1:37 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12678","author":"carlos","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"\ncarlos :\nCuando se trata de establecer la posibilidad de una relación entre la Sábana de Constantinopla y la Sábana de Turín, AMBAS CON IMAGEN, es una FALACIA permanente de los escépticos ( siempre la utilizan) el hacer referencia a los 40 sudarios (?) existentes en la Edad Media, sin que puedan DOCUMENTAR mínimamente ninguno de esos INEXISTENTES sudarios ( CARENTES DE IMAGEN).\n\nCarlos / Corneliotel (?): Your reasoning does not include a fallacy. It includes at least two. You pass from “I do not know” to “nobody knows”. And from “nobody knows” to “there is not”. Logically inconsistent. \nHow do you base your assertion that nobody knows painted shrouds in the Middle Ages? I believe that such a claim could only make it emphatically by an expert in medieval art and plenty substantiate on the material studied. In this forum no one has mentioned an expert of such characteristics.\nFurthemore, I do not claim neither existed or nor painted shrouds. My reasoning is much easier to understand.\n1. There were at least 40 shrouds of Christ in the Middle Ages.\n2. One of those shrouds at least was known and had a full body image. De Clari mentioned it.\n3. About 1350’ there was in Europe an intense and lucrative trade of relics.\n4. About 1350’ there were several canvases with the image of Christ “not made by human hands.” For example, the Veil of Veronica had been a resounding success in Rome.\n5. There were pictures (frescoes and manuscripts) representing Christ in the tomb in the same position of the Shroud of Turin.\n6. There were pictures of Jesus naked. Many of them represent baptism.\n6a. I have put here a 12th century image representing the embalming with naked Christ..\n7. It is possible that a forger or forgers group decided to make a relic with those characteristics that represent the true shroud of Christ mixing all these precedents (common models of its time).\n8. This relic could be the Shroud of Turin.\nCan you say which of these statements is false or contradictory? Can you say why you don’t accept my hypothesis?\n\n","date":"June 18, 2012 at 9:42 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12672","author":"David Mo","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"The crucial point, in support of David Mo’s clear summary of the issues, is that it had been normal practice since the sixth century at least , to bury a body with its hands crossed over the genitalia. This was true for both men and women. So if you are Benedictine monk  in an enclosed order making an illustration of the burial of Christ, you would simply copy the method of burial you have seen around you. (There are lots of examples from cemeteries so we are absolutely secure on this.) You did NOT need to copy it from the Turin shroud because you would have seen actual examples of bodies being wrapped up just like this.They are giving Jesus a typical Christian burial, using examples, of course, from the gospels for the figures who are doing the anointing.\nAnd we must get away from the idea, that seems to be accepted without anybody thinking about it, that the Turin Shroud would have been  thought to be something special. Goodness knows in Constantinople, you have far ,far better relics around- a big fragment of the Cross was the top Constantinople relic, taken out and about in the streets in a grand procession every year,  and second to that was the holy icon of the Virgin Mary painted by Luke which,when taken out on the walls, had saved the city from being captured. Then there is the robe of the Virgin Mary that one of the emperors would put on to give him protection when he went out of the city to negotiate with Byzantium’s enemies.Then there is the Mandylion which is of the living face of Christ so it cannot be the same as a large piece of cloth with the figure of a dead naked Christ (sorry, Mr. Wilson).  There are lots of documents about these and all we have is ONE mention by Robert de Clari of an image on a cloth in the Blachernae Chapel which might or might not be the Turin Shroud.\nIf someone decided to paint a relic from Constantinople ,it would be very strange for them to choose the shroud when there were so many more more famous ones to choose from.\nThey say that there were 3,600 separate relics in Constantinople and the Turin Shroud would be nowhere near the top!  If it had been we would have had MORE documents about it and they surely would have said that it was a double image, not just an image.\n\n","date":"June 18, 2012 at 1:48 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12679","author":"menedemus","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"David, su comentario es una generalización que no tiene ninguna relación con mi comentario.\nYo hablo de la Sábana de Turín ( la conocemos bien) y su muy probable relación con la Sábana de Constantinopla ( conocemos documentalmente que se mostraba a los fieles para que vieran la IMAGEN de Cristo).\n¿Conocemos documentalmente de la existencia SIMULTANEA, en la misma época, de 2 SÁBANAS que pretendieran ser MORTAJA (lienzo funerario) de Cristo y que mostraran su IMAGEN?\n¡NOOOOOOOO!\nMantener que hayan existido y se hayan destruido otras mortajas similares es una PURA FICCIÓN.\nIgualmente  podría mantenerse la FICCIÓN de que hayan existido documentos que demostraban la autenticidad de la Sábana y que al igual fueron destruídos……\nAsí que las 2 UNICAS SÁBANAS que pretendieran ser MORTAJA y  mostraran IMAGEN de Cristo, y que no siendo documentalmente simultáneas SI SON cercanas en el tiempo, son la Sábana de Constantinopla y la Sábana de Turín.\nY que bien cabe la posibilidad, con mucha probabilidad, de que ambas Sábanas fueran LA MISMA, pues la de Constantinopla fue ROBADA y tras siglo y medio aparece la de Turín en Lirey.\n¿Alguien puede demostrar documentalmente la existencia de alguna OTRA Sábana con esas características de ser mortaja y mostrar la imagen entre 1200-1350?.\n¡NOOOOOOOOO!\nHablar de 40 sudarios medievales al tratar sobre la Sábana de Turín es una FALACIA que pretende DESINFORMAR o CONFUNDIR al lector poco conocedor del tema.\n\n","date":"June 18, 2012 at 4:16 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12685","author":"carlos","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Quote from Mario Latendresse :  “I stated that there was a shroud in Constantinople (notice the lower case shroud). This is a fact well supported by historical documents.”\nComment from me :  It’s true that there was a shroud kept in Constantinople as a relic of Christ, and it’s ALSO TRUE that, at the same time, there was also the Mandylion and the Keramion that were kept in that same city.  This is also WELL SUPPORTED by historical documents…  So, on that solid historical base, I tell you this :  You can forget about Wilson hypothesis folks, unless you still believe in Santa Claus !!!  And I here, I don’t even talk about a bunch of artistic evidences that makes also a very solid case against the hypothesis proposed by our friend Wilson.\nIt’s funny how some people have a different interpretation of historical documents, whether it goes in the direction of their preconceived ideas (i.e. for the presence of a Shroud of Christ in Constantinople) or not (i.e. for the presence, at the same time, of a Shroud of Christ AND the Mandylion in Constantinople, proving that the Mandylion had absolutely nothing to do with a burial cloth of the Passion of Christ)…  In fact, there’s at least 10 different ancient sources that specified, in the SAME MANUSCRIPT, that there was a shroud (or burial cloths) associated with the Passion of Christ AND the face cloth known as the Mandylion (some of these sources mentioned also the Keramion in association with the Mandylion).  The best known of these sources being the eyewitness testimonies of Nicolas Mesarites and Robert of Clari, which are both dated from the early 13th century, just before the sack of Constantinople.  These documents that make a clear separation between the Shroud of Christ and the Mandylion (most of them being eyewitness accounts) are well enough to support the FACT that the Mandylion hypothesis of Wilson is completely wrong, just like they are well enough to support the FACT that a Shroud of Christ (most probably accompanied by other non-imaged linen cloths from the tomb) was being kept in Constantinople as an authentic relic of the Passion of Christ (from at least 958, which is the first known written attestation of its presence in that city).\nSorry for those who can be offended by the truth contain in this comment but I couldn’t help myself !!! ;-)\nI also want to specify again this other truth :  Even if the Mandylion hypothesis is no good, that doesn’t mean at all that this relic, who represent a living Christ rlookin a lot like the face on the Shroud, is not related in some way with the authentic Shroud of Turin.  For me, the study done by Vignon and somewhat confirmed by Whanger, concerning the high level of concordance between the image of the face on the Shroud and the image of Christ’s face on the copies of the Mandylion, gave results that are good enough to state that there really is a true link between the 2 objects, even if the Mandylion is not the Shroud, just like the Pantocrator is not the Shroud…  This link proves that the Shroud is much older than the C14 result of 1988 and can be dated to at least the end of the 6th century, if it’s not before…\n\n","date":"June 18, 2012 at 5:01 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12686","author":"Yannick Clément","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"\ncarlos :\nDavid, su comentario es una generalización que no tiene ninguna relación con mi comentario.\nYo hablo de la Sábana de Turín ( la conocemos bien) y su muy probable relación con la Sábana de Constantinopla ( conocemos documentalmente que se mostraba a los fieles para que vieran la IMAGEN de Cristo).\n\nGeneralizations??? What do you think I was talking about? Sex of angels? I made a very concrete statement about his way of thinking and an alternative hypothesis to yours based on seven specific claims. I made two very specific questions. If you do not know how to answer is your problem. No my “generalizations”.\n\n","date":"June 19, 2012 at 1:23 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12689","author":"David Mo","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"“…your way of thinking”, sorry.\n\n","date":"June 19, 2012 at 2:06 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12692","author":"David Mo","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"-David, sus “seven specific claims” son generalizaciones, con excepción de la 2 ( existencia de la Sábana de Constantinopla con la IMAGEN de Cristo), porque no son precisas ni son necesarias para HACER UNA RELIQUIA FALSA o para FALSIFICAR UNA RELIQUIA.\n-Hacer una reliquia FALSA no precisa de ANTECEDENTES.\n-Su hipótesis de que la Sábana de Turín sea una RELIQUIA FALSA es MUY IMPROBABLE.\nNo tiene el mínimo sentido teniendo en cuenta las ENORMES DIFICULTADES de su realización que hoy siguen SIN SOLUCIÓN. Una Sábana con manchas de sangre, por ejemplo, hubiera obtenido los mismos resultados……\n-FALSIFICAR UNA RELIQUIA precisa de la existencia de un ORIGINAL (auténtico o falso), que es lo que se falsifica.\n-¿Admitiría usted que sus “falsificadores” pretendieron FALSIFICAR la Sábana de Constantinopla desaparecida hacia el año1200?\n\n","date":"June 19, 2012 at 6:42 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12695","author":"carlos","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"\nYannick Clément :\n<\nFor me, the study done by Vignon and somewhat confirmed by Whanger, concerning the high level of concordance between the image of the face on the Shroud and the image of Christ’s face on the copies of the Mandylion, gave results that are good enough to state that there really is a true link between the 2 objects, even if the Mandylion is not the Shroud, just like the Pantocrator is not the Shroud…  This link proves that the Shroud is much older than the C14 result of 1988 and can be dated to at least the end of the 6th century, if it’s not before…\n\nFor me these similarities do not prove anything.\nVignon and Whanger are not experts in Byzantine art. They accumulate a number of similarities between a few  Byzantine images and the Shroud of Turin. But no method at all. They forget the fundamental characteristics of Byzantine Christs that do not appear on the shroud of Turin. See Erwin Panofsky, Meaning in the Visual Arts: the symbolic circles in the head . But althoug there was similarities between the shroud of Turin and the Byzantine Pantocrator, this would not mean anything. Would have to show which of the two influences the other. And remember that Byzantine art existed long before the Shroud of Turin was known.\n\n","date":"June 19, 2012 at 1:45 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12690","author":"David Mo","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Since it’s far more easy to replicate the Pantocrator Icon or the Mandylion (remember that nodoby has been able yet to replicate the Shroud), I would say that, in all logic (and if we use the Ockham Razor to help us), it’s much more probable that the Shroud was at the origin of these artworks (because I’m pretty sure the Mandylion was also a painting) than the reverse.  Remember that the Pantocrator and the Mandylion were copied on numerous occasion and these copies are pretty much the same.  If I would present you 10 copies of the Pantocrator and 10 copies of the Mandylion and tell you that there originals are in that group, I think you would have a hard time finding the authentic artworks.  It’s not the same at all for the Shroud and the copies that were made from it.  This little example is enough to understand that the probability that the Shroud was at the origin of these icons is highly probable.\n\n","date":"June 19, 2012 at 8:32 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12697","author":"Yannick Clément","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Hear, hear, David. I cannot understand how Wilson has got away with his bizarre idea that Byzantine art began in the middle of the sixth century for so long. (Of course, most people know that and just don’t take him seriously as a historian or art historian , but it still goes on being repeated. )  Does anyone seriously think that they found the Turin Shroud , were so excited by whatever they could see on it, that they started a whole new genre of painting., with the dead face of the Shroud being transformed into the living face of the Byzantine icons of Christ.\nDavid is making the point, that perhaps no one dares to say,  that the Turin Shroud is more likely to be a copy of a Byzantine icon than the other way round.There is no no known case in art history so far as I know where a relic has started off a new school of art!!\nI think Hans Belting( and he really is an expert) argues that the Shroud is actually a medieval copy of an older Byzantine image which explains why it has so many Byzantine characteristics.\nI want to keep an open mind on the Shroud- after all so long as Christ was a historical person who was crucified ( and i strongly believe he was), he would have been buried in a Shroud. I am just against making up stories that , like the Byzantine art began in the mid-sixth century one, that are plain nonsense and can easily be refuted. People can believe what they like, it is when such stories get out on websites and repeated in such a way that readers think that they are accepted by mainstream historians  that they need to be refuted. David has done good work here in keeping everyone’s feet on the ground!\n\n","date":"June 19, 2012 at 5:13 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12694","author":"menedemus","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Wilson is a polemist and a book seller.  That explain why he still goes on with his hypothesis, simply because it sell !!!  But, as you say, the fact that his incorrect ideas are still considered in the Shroud world with great respect like they were close to the truth is something that I have a hard time to explain rationally.  Maybe it’s just because other Shroudies (some are authentic historians) have defended his ideas, giving them more “credibility” (SIC).  But the truth is that they did it in such a way that bias (often religious bias) is evident.  That should have ringed a bell for some people involved in the Shroud world, but that’s not the case, obviously.  Another good reason I think is the fact that most people don’t go deep into this historical subject (as I have done) to really learn ALL the historical and artistic FACTS surrounding it.  In the Shroud world, for years, people have been only fed with one side of the coin (the Wilson side) !  That’s completely deplorable.  If they would learn what I’ve learn, I think most of them would simply drop this Mandylion hypothesis, as I’ve done myself, and start to look elsewhere for a rational explanation concerning the Shroud’s obscure history.  But in the end, as I also said, the fact that the Mandylion, just like the Pantocrator Icon, was probably an artwork based (directly or indirectly) on the Shroud is, for me, a proof that the Shroud was there at the time (5th or 6th century) and this can be considered as solid evidence.  But not the hypothesis of Wilson !  As I often say, the fact that there is an obvious link between the 2 objects don’t mean at all that they were one and the same !!!  It’s just ludicrous to think that way.\n\n","date":"June 19, 2012 at 8:46 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12698","author":"Yannick Clément","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Of course, I agree with you about Wilson and I am sure that gradually people are realising that his views are accepted by no one other than himself. But it will take time because he has sold so many copies and not enough people have read the arguments against his views.\nBUT Yannick, you can find earlier artworks, starting from the 4th century in any history of Byzantine art which show how the idea of a fully frontal figure,first the emperors (many scholars place the fully frontal image of Constantine on the Arch of Constantine in Rome (AD 315) as the first), then Christ in the same pose evolved. You can also look at the coffin lids of Egypt where the living faces of the deceased are placed on the wood of the lid  (and these go back  even earlier) and again scholars see these as  the inspiration for the faces on icons. These are real images in wood or marble and they can be easily copied and you can trace a tradition in art directly from them.  The Turin Shroud, on the other hand shows a man who is dead and has marks of suffering so this does not look like a model which has been copied. What date do you think the copying began?\nI repeat ‘There is no no known case in art history so far as I know where a relic has started off a new school of art!!’  I think you must make your case a lot stronger before it becomes believable.\n\n","date":"June 19, 2012 at 9:05 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12699","author":"menedemus","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"What date do you think the copying began?\nThe first known images of Christ with beard and long hair are the ones found in the catacombs in Rome and I think the date from the 4th century at least.  But it was more during the second part of the 6th century that this image of Christ really seem to have been considered as the norm.  Some people from that time must have seen the image on the Shroud.  I just don’t see any better and rational explanation to explain that important change from a beardless Christ looking like a Roman to a more semitic Christ with beard and long hair exactly like we see on the Shroud.\n\n","date":"June 19, 2012 at 10:45 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12707","author":"Yannick Clément","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Well, Yannick, I remain to be convinced but I admire the depth with which you do your research. I think the mechanism by which the transmission from cloth to icon would have taken place would be quite difficult to establish.\nOf course, everyone working in this period has such a lack of sources!\n\n","date":"June 19, 2012 at 11:47 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12712","author":"menedemus","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"\nYannick Clément :\n Remember that the Pantocrator and the Mandylion were copied on numerous occasion and these copies are pretty much the same.  If I would present you 10 copies of the Pantocrator and 10 copies of the Mandylion and tell you that there originals are in that group, I think you would have a hard time finding the authentic artworks.  It’s not the same at all for the Shroud and the copies that were made from it.  This little example is enough to understand that the probability that the Shroud was at the origin of these icons is highly probable.\n\nYour argument begins with an error and an unverifiable assumption. \nThe error is that what we call “Pantocrator” is not a concrete image that was located anywhere. It is an iconographic category designating all the images that represent God in his power, or God Almighty. We need not suppose that there was a first christian pantocrator that was copied from others. The image was evolving from that of Zeus Pantocrator up to a canonical form. Speaking of copies “of the Pantocrator” is meaningless. It’s like talking about copies of “The Madonna” or copies of “The Holy Women.” \nThe second assumption is unverifiable. There were copies of the Mandylion, but we do not know how the original or copies were. What we know are recreations made from imaginary descriptions. So we can have no certainty about the original-copy relations in the case of the face of Edessa.\nSo, your argument loses all sense. \nPS: We detect easily the shroud copies because they are no good copies. But sometimes the copist is better artist than the original. Then the task becomes more complicated. Unless we have additional data. That is not the case under discussion.\n\n","date":"June 19, 2012 at 9:07 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12700","author":"David Mo","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Don’t get me wrong.  The Pantocrator Icon I talk about is the one where we see Christ with a bible in one hand and the other is raised and the first known artwork depicting Christ that way is found in Ste Catherine monastery in the Sinai desert and has been dated somewhere during the second half of the 6th century.  When I talk about the Pantocrator, that’s what I mean.  Before the 6th century, there is no example of an Icon of Christ like that…\n\n","date":"June 19, 2012 at 10:48 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12708","author":"Yannick Clément","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Yannick: It would be preferable further clarify references. We understand better from the start.\nAlthough you would intend to refer to Christ in the monastery of Saint Catherine, that does not give more strength to your argument. I do not know much of Byzantine art, but I know some things. It is not true that the image of Christ of Saint Catherine is the first in which he appears with a beard, the book in one hand and extending the other. Despite what is stated, the bearded Christ is a representation existed since the early Christian centuries (For example: Christ between alpha and omega in catacomb of Comodilla). He symbolized the Divine Wisdom and some relate it to the Arian controversy. In the basilica of Santa Pudenziana in Rome is an image of Christ in Majesty, bearded with a book in hand and the other extended. Although the mosaic was restored Christ’s image is of the 5th century. Perhaps the claim that the icon of St. Catherine is the first Pantocrator refers to the first Christ’s image to which that meaning is attributed. However, the concept of Pantocrator is 4th century. \nBut I insist that the argument that certain similarities between Byzantine icons and the Shroud of Turin can be explained by stating that Byzantine art stems from the Shroud makes no sense. It works rather in contrary direction.\n\n","date":"June 20, 2012 at 1:29 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12739","author":"David Mo","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Another quote from David : “There were copies of the Mandylion, but we do not know how the original or copies were.”\nOh yes we know !!!  There are many copies of the Mandylion still preserved today in many countries that were done while the relic was kept in Constantinople, from 944 to, at least, 1204 or beyond…  Some copies, like the Holy Face of Laon, were done by Slav artists who were most probably eye-witnesses of the relic.  So, there’s no doubt that we have a very good understanding of what the image on the Mandylion looked like…  And byzarrely, it’s almost the same face than the Pantocrator Icons of Christ I told you before !!!  A coincidence you think ?  NO !!!  Those artworks of a living Christ were most probably influenced (directly or not) by the image on the Shroud.  Sorry but the face of the Shroud is just too much like these artistic representations of the living Christ to not be related with them.\n\n","date":"June 19, 2012 at 3:49 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12722","author":"Yannick Clément","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Please Yannick, you  mistake legends for facts. I copy of a web page:\n “According to a legend that hasn’t been confirmed, Jacques Pantaléon of Troyes, the former archdeacon of Laon Cathedral and the future Pope Urban IV, sent the icon of the Holy Face to the convent of Montreuil-les-Dames in 1249. But dependable sources—notably a text from 1467, which mentions the worship of the image—only attest to the presence of the icon in Montreuil from the fifteenth century.” \nTo my knowledge there is no certainty that any of the alleged copies of the Mandylion is a real copy and not a false copy or recreation. Not knowing the original is difficult to know which is closer.\nYou can’t base any argument on these vagueness.\n\n","date":"June 20, 2012 at 1:42 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12741","author":"David Mo","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"It is a well establish fact that slav artist who have been in Constantinople did copies of the original.  It is also true that copies of the relic were done while it was still kept in Edessa, but I don’t think any of them has survived.\n\n","date":"June 20, 2012 at 10:36 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12784","author":"Yannick Clément","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Look David, there was even some of these very old copies (some done during the 12th century) that used the Greek term “acheiropoietos” (not made by human hands) as a title for the copy.  It’s a clear sign that the artist who did the work intended to make a close copy of the original “acheiropoietos” image of Edessa, that was now kept in Constantinople.  So, yes, we have a very good idea of the general aspect of the relic and the face on it was very close to the one we see in the Christ Pantocrator icons.\n\n","date":"June 20, 2012 at 2:42 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12801","author":"Yannick Clément","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"\ncarlos :\n…\n-Hacer una reliquia FALSA no precisa de ANTECEDENTES.\n(…)\n-FALSIFICAR UNA RELIQUIA precisa de la existencia de un ORIGINAL (auténtico o falso), que es lo que se falsifica.\n-¿Admitiría usted que sus “falsificadores” pretendieron FALSIFICAR la Sábana de Constantinopla desaparecida hacia el año1200?\n\nI find some contradiction in the first two phases, but good.\nMaking a false relic suppposes no “original” really existing. Just imagination and people credulity. No one with common sense would think that wiping the sweat from the face the eyes can be printed. However,  many images circulated with the face and eyes of Christ imprinted on cloths in the Middle Ages. Alleged printed at Gethsemane and on the way up to Calvary. The first to invent this kind of relics was not based on any original. As was not based on any original archangel feather who invented relic of Archangel Michael’s feather, which apparently there are several copies.\nTherefore, no. We can’t know whether a potential forger tried to copy the shroud that de Clari mention or put your imagination in motion from dispersed materials without an unic reference. It seems more likely the second assumption. Because de Clari says the shroud disappear after the city sacking and from 1204 to 1350 is a long time without news of the Shroud of Constantinople.\n\n","date":"June 19, 2012 at 9:35 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12702","author":"David Mo","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"\ncarlos :\n-David, sus “seven specific claims” son generalizaciones, con excepción de la 2 ( existencia de la Sábana de Constantinopla con la IMAGEN de Cristo), porque no son precisas ni son necesarias para HACER UNA RELIQUIA FALSA o para FALSIFICAR UNA RELIQUIA.\n\nI do not understand your reasoning. My seven claims were precise and true. I have put here documentation confirming each. Some truths are so glaring that would be impossible to deny them (traffic of relics in the Middle Ages, for example). Some of them have been admitted to this forum by yourself. Now you say they are not “precise” (?). You have a very particular way of deriving their claims as agreed or not their beliefs. \nCertainly they are not “necessary” to explain a forgery of a relic. They are “sufficient”. Do you understand the difference? Well, don’t  attribute the claim that they are necessary to me, because it is not what I’m saying.\n\n","date":"June 20, 2012 at 2:02 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12743","author":"David Mo","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"“…You have a very particular way of deriving their claims as agreed or not their beliefs. ” Must say “…your claims as agreed or not to your beliefs.” Sorry.\n\n","date":"June 20, 2012 at 2:06 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12744","author":"David Mo","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Colin\nNow you are simply being nasty and childish.\nIf you go to Stephen’s site, you will see I have admitted I was wrong. Unlike some people, I am genuinely interested in exploring interpretations and different points of view. I found something, I put forward a theory, I searched further and tested – and found my theory wrong. I’m man enough to admit it.\nI note that you proudly state that you picked that it was St Alexius tending to a sick girl – well the last laugh is on you because upon my further research I found the legend that clarifies that the “little girl” is actually St Alexius, and it is the Pope visiting him. So before you go pointing your finger and going “ha ha you were wrong” maybe you need to consider your own human fallibility as well.\nAnd now I’ve heard it all about the 4 L shaped holes. Testing the  ink? Please, that’s just really desperate!!!!! The fact is the cumulative evidence is overwhelming in support of the codex image being influenced by the Shroud. Please explain the blood as represented by the red streaks, when no shroud in an entombment scene in art showed blood, within hundreds of years of this image (I’ve seen the odd image dating much later that shows blood on a shroud, probably because as Christianity evolved Christ’s humanity and suffering came to be emphasised more) .\n\n","date":"June 20, 2012 at 8:52 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12776","author":"Matt","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"OK Matt, I’ll let you have the last word. You know my view on the Codex – i.e. that seeing it as a Dan Brown style teaser is wishful thinking on the part of you Shroudie Spotters and a tedious distraction from more important issues – like how was the image created, regardless of whether that happened in the 1st or 12th century AD. My beef is with pseudo-science being used to counter or attack real science. I’d be blogging on the Shroud, as I do on Stonehenge, if it had no Christian content whatsoever. Maybe someone needs to tell that evangelist pal of yours on the other site – especially as he flaunts his BSc degree and Dip Ed while being free and easy with his demonising labels…\n\n","date":"June 20, 2012 at 9:13 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12778","author":"colinsberry","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"I’ve missed something . Can someone please give me the comment number here that explains how you know that the red zig-zag lines , which I assumed were part of the decoration on the tomb lid  in the space between the separate sudarium and the Shroud held by the angel, actually show blood.\nHave you also the latest on whether the blood on the Shroud is AB ( this used to be argued but I haven’t seen it recently) and is there anyone who can follow that by making comments as to whether, if the blood on the Shroud is authentic, how the blood relates genetically to the blood of Jesus’ ‘parents’?\n\n","date":"June 20, 2012 at 11:11 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12787","author":"menedemus","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"For the AB blood type question, I know that there will be a paper about that who will be published in a near future on the shroud.com website…  This paper tend to conclude that the blood type is probably AB.\n\n","date":"June 20, 2012 at 1:04 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12794","author":"Yannick Clément","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"For my part menedemus, I was challenged by someone, Matt I think, to explain the red zig zag marks on the Codex. He or whoever considered that they represented blood on what he interpreted as the Shroud, except that the latter was what  I and others thought was the lid of a sarcophagus propped up at an angle to reveal an empty chamber.. Rightly or wrongly,  I refused to be drawn on those red zig zags,, at least initially, saying there was no onus on me to account for every detail in the Codex.\nBut when I came to take a close look at the red zig zags, I noticed they were wavy in profile. What’s more, they matched a similar wavy profile, i.e. with rounded crests, on the adjacent black pattern. But elsewhere the black pattern was strictly stepped, with sharp right angles, That’s when I (for one) thought that the combination of wavy red lines and adjacent wavy black lines was separate from the stepped black elsewhere, with strict right angles, and perhaps represented the furled wavy end of the Shroud.  \nYup, the wavy black was the end of the Shroud, extending from that complicated heap of linen, and PERHAPS, just perhaps, the red wavy line represented a fringe of blood on the end of the Shroud. For my trouble, I have been accused of conceding, nay caving in. on the claim that the red represents blood. I merely said that the red MIGHT represent blood, as part of a new interpretation, showing the Shroud as draped over a substantial length of sarcophagus lid, making it longer than a mere head cloth/napkin. \nThat’s the thanks one gets for partially (at any rate) concurring with others’ views here .  But then we all know that for some who inhabit this site, it’s the agenda that matters, not the details… We retired science bods – with no axe to grind – are interested purely in the details. It’s others who push their agendas, and don’t wish to be bothered with inconvenient detail…\n\n","date":"June 20, 2012 at 1:22 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12795","author":"colinsberry","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Colin\nTo be fair you didn’t say MIGHT, you said “probably” (10.32) and also indicated a fairly strong belief in the notion of red streaks as blood at comment at 12.51.\nYou said:\n“But when I came to take a close look at the red zig zags, I noticed they were wavy in profile.\n“What’s more, they matched a similar wavy profile, i.e. with rounded crests, on the adjacent black pattern. But elsewhere the black pattern was strictly stepped, with sharp right angles”\nSimply not true. The black lines are only SLIGHTLY off the right angle next to the red streaks, and if you go further over to the right in the vicinity of the L shaped circles you will see further evidence of black lines that are slightly curved / off the right angle\n\n","date":"June 21, 2012 at 4:38 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12841","author":"Matt","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Thank you both for the information. It is a pity that the art work on the Codex is often so indistinct that it is hard to be certain what its inspiration was. Cautious as I am by nature, I am,= not convinced that the Shroud is there, partly because I do not understand why anyone would want to copy it without making it very clear, from the size of the cloth and the double image, what they were wanting to show their audience.I have seen no good reason why this has to be a secret or symbolic picture of the Shroud.\n\n","date":"June 20, 2012 at 1:54 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12796","author":"menedemus","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Snap\n\n","date":"June 20, 2012 at 2:14 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12798","author":"colinsberry","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"“I do not understand why anyone would want to copy it without making it very clear, from the size of the cloth and the double image, what they were wanting to show their audience.I have seen no good reason why this has to be a secret or symbolic picture of the Shroud.”\nUnlike Church Frescoes or paintings, the image is not intended for “public consumption”. The manuscript was likely used as a resource by monks / clerics. Therefore there was no driver to explicitly show an image of the shroud. This may also explain why Jesus is shown nude, without the usual skimpy cloth around his waist and pubic area – there was no need to protect Jesus’s modesty in a highly public setting.\nGiven Hungary’s close connections with Constantinople at the time, it is likely that the Shroud and its characteristics were quite well known amongst holy men in Hungary, therefore there would be little need to represent it literally. But as anyone who has viewed the Shroud with the naked eye will testify to, two of the most apparent features to the naked eye are the red streaks of blood on each of the arms, and the two sets of 4 poker holes in an L shape. These were simple enough to illustrate fairly literally by the rather unsilled artist working on a miniature work as we see in the codex illustration. By contrast, imagine the difficulty for the unskilled artist working in a miniature medium trying to represent a light, ghostly image of Jesus – difficult. This is why the artist has taken the “shortcut” of representing the body image in a more symobolic manner by way of the cross motifs in the middle of the shroud, just adjacent to the angel’s foot.             \nIt should be kept in mind that the main purpose of the illustrations is unrelated to the shroud. The illustrations merely illustrate the story of Jesus’s death, descent from the cross, burial and resurrection. The knowledge of the Shroud and its characteristics has merely informed the art. Probably just as the presence of the venerated red stone “stone of unction” at the time in Constantinople has informed the red colouring of the burial stone at the bottom of the image. If the stone in Constantinople had been yellow, then we probaly would see yellow crosses on the burial stone at the bottom of the picture. The knowledge of the sacred relics has merely informed the art – it’s as simple as that. There is not an agenda to mysteriously and symbolically reveal the Shroud.       \nThis is simply my interpretation, any how.\n\n","date":"June 21, 2012 at 4:12 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12839","author":"Matt","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"To David Mo, \nAre you a Late Antique and/or Medieval Art expert to be so assertive? NO. Are you a professional Late Antique &/or archaeological/archaeocryptological analyst? NO. \nMy slight guess is YOU NEVER EVEN HEARD of the use of steganography/cryptography in Late Antique & Medieval Religious Art works (before I mentioned it on this very blog). \nHow can you really think of a 13th-14th century CE archaeological paleopathological bloodpattern-analytical hyper-necrorealistic artist producing such a fraud? Have you any RELIABLE historical/official  document(s) PROVING without the least rational doubt such a hyper-necrorealist genius artist ever existed? Can you even give a name? Your reasonement is just an iconological FALLACY to convince ignoranti… Alike Colin Berry, Antonio Lombatti, you are just anotherTurin Shroud anti-authenticistic TALIBAN. Too bad on the other side (the Turin Shroud authenticists), they are also talibans. Talibans vs Tablibans is REALLY not good at all for the unraveling of scientific and archaeological Truth. \nOnce elected as MISLEADER in Late Antique & Medieval Art History, what will be your next step? Are you planning to destroy the Turin Shroud once and for all?\n\n","date":"June 20, 2012 at 2:54 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12803","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Typo error; ” a professional Late Antique &/or MEDIEVAL archaeological/archaeocryptological analyst”\n\n","date":"June 21, 2012 at 4:00 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12836","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"“Are you planning to destroy the Turin Shroud once and for all?”\nEven if science destroyed its credibility as 1st century AD, it would still survive as a monument to human ingenuity…\n\n","date":"June 20, 2012 at 3:04 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12805","author":"colinsberry","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Better Ask the Giant Bouddah…\n\n","date":"June 20, 2012 at 3:16 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12807","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"You mean anti-authenticisticTalibanic pseudo-Science (and pseudo archaeology)\n\n","date":"June 20, 2012 at 3:22 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12810","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Applied real Science will never destroy the Turin Shroud its crediblity. Only applied pseudo Science can in the eyes of ignoranti.\n\n","date":"June 20, 2012 at 3:26 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12811","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"or misapplied real Science can….\n\n","date":"June 20, 2012 at 3:35 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12812","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Colin\nIf it is an ingenious invention created by human hands, why with all the modern knowledge and technology we now possess no one has been able to convincingly explain how the image was created, and REPLICATE the image with ALL its unique characteristics? \nIf you, or someone else, can convincingly explain and replicate the image with all its characteristics, then I might be open to changing my view on the shroud\nUntil then…\n\n","date":"June 21, 2012 at 4:18 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12840","author":"Matt","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Sorry, Matt, but what you propose is hardly a fair test. John Jackson produced some very passable replica images of the Shroud from bas relief templates that were “negative”, i.e. light/dark reversed,  and even had encoded 3D information, but he then proceeded to play down that work on what might be described as minor technical flaws (e.g. flat spots on some of the 3D imaging that could well have been resolved with more tweaking on the z axis or the smoothing control.\n One can even produced a luminous ‘ghost-like’ negative with partial 3D off a quick charcoal sketch,  or from scorch marks as I have repeatedly shown in a series of postings on my own site. But I don’t press the issue here, knowing that if I do the bar will just be raised higher and higher. \nI personally would accept a list of strictly scientific criteria, including the tricky, as yet unresolved one re the lack of fluorescence under uv, but aesthetic considerations have no place in that list.\n(Re the fluorescence: I wish I had a uv lamp, since I strongly suspect that thermal imprinting at low temperatures, sufficient to dehydrate PCW hemicelluloses but not celluloses, may well produce a highly superfiicial sepia image that would be non-fluorescent.  I challenge the still-working scientists to do that experiment, and see if I am not right).\n\n","date":"June 21, 2012 at 4:44 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12843","author":"colinsberry","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Colin\nI fail to see why it isn’t a fair test, given today’s technology and knowledge?\nthe flourescence is a key one…if you could prove that then I’d be one step closer to contemplating that the shroud MIGHT be a human invention (despite what you might think I’m actually pretty much agnostic on the shroud’s creation – albeit leaning slightly more towards a divine explanation)\n\n","date":"June 21, 2012 at 5:07 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12849","author":"Matt","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Colin\nSurely can’t be too hard to find a skeptical practising scientist to test that, or for you to access the necessary equipment?\n\n","date":"June 21, 2012 at 5:10 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12850","author":"Matt","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"TO DMo: The Turin Shroud image doesn’t belong to any known mid 13th-mid 14th artistic trend…. You IGNORANT.\n\n","date":"June 20, 2012 at 3:15 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12806","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Can DMo, CB, AntLomb and all the rest of them discriminate between the Shroud Image as prototype and 40 of its post-1515 copies?\n\n","date":"June 20, 2012 at 3:43 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12814","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"I very much douibt so.\n\n","date":"June 20, 2012 at 3:46 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12815","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"\nmenedemus :\nCautious as I am by nature, I am,= not convinced that the Shroud is there, partly because I do not understand why anyone would want to copy it without making it very clear, from the size of the cloth and the double image, what they were wanting to show their audience.\n\nHi menedemus, like you I also was not totally won over by the PM. But…\nI grant you that its not the best of pen and ink drawings (btw a very difficult medium as unlike most artistic mediums you’re sort of stuck with your crap lines if you make a mistake….I speak as one who has done pen and ink exhibitions). But the reason I single out your quote about the small size of the shroud is that I have seen it mentioned many times and even in WIkipedia as evidence against the PM representing the Shroud. There are many things about the PM that are ‘suggestive’ of a connection, but I think the last image on Steve Jones page about the PM is the most impressive and is almost completely ignored by all.\nhttp://theshroudofturin.blogspot.ie/2012/05/my-critique-of-pray-codex-wikipedia-1.html\nHave a look at the two figures attending to the left and to the right. Steve Jones emphasizes with a green line the flow of the shroud around the two figures. This is the only sensible understanding I can make of the two figures who otherwise seem to be playing a bit of tug of war with some strange material in the background. Without Steve’s lines I would have completely ignored what these two were up to, but now my attention is grabbed, there seems to be no other proper explanation than they are holding onto the lengths of a rather extended shroud (if anything its now too long!). Notice how the cloth bunches up towards the head and flows over to be draped over the man on the left. I’m sorry to say I originally dismissed Steve Jones as an evangelical nutter but he has pinpointed a very strong and hidden bit of evidence that what is depicted is actually very large piece of material. (For those who disagree, please explain to me what the two guys to left and right are up to and whats in their hands). \nWhilst I’m at it, can anyone also explain what is being depicted other than the shroud in the image here of Emperor Romanus receiving some large piece of cloth with a disembodied head. This illustration also have a pre-1300 date. O, I do like a mystery….and trying to sense of it!\n\n","date":"June 20, 2012 at 7:00 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12824","author":"ArtScience","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Meant to include this link to illustration of Emperor Romanus receiving his “laundry”…see image half way down the page\nhttp://shroudofturinnews.com/documented-proof-of-shroud-of-turin/\n\n","date":"June 20, 2012 at 7:05 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12825","author":"ArtScience","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"You make a mistake. See better the picture here: http://www.unito.it/unitoWAR/ShowBinary/FSRepo/X033/Allegati/sacre_impronte.pdf. \nThe Mandylion is not the pink cloth. It is clearly differentiated by color. The Mandylion is white and cloth pink. This pink cloth is the cloack of the character who present the Mandylion to the emperor. It has the same color and appearance than the other capes. As the Mandylion was a sacred image the man can not touch it directly. So he holds it with his cloak.\nThere is no description of the Mandylion as an image of a full-length body. This is acknowledged even by M. Poulle.\n\n","date":"June 21, 2012 at 3:41 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12835","author":"David Mo","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Actually Stephen Jones’ emphasis of the shroud flow with a green line is not totally accurate.\n\n","date":"June 20, 2012 at 8:17 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12828","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"He aslo totally missed the minaturist’s signature (Alamos Jozef) within the very shroud (lower folded line, upper section miniature). Actually SJ even makes a few iconographic misiterpretations and overlooks a few tale-tell iconographic details. He’s definitely neither a Medieval art historian nor an archaeocryptological analyst used to decipher relatively cryptic medieval miniatures or graffitis….\n\n","date":"June 20, 2012 at 8:23 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12829","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Good morning, ArtScience: \nI do not agree with Mr. Jones and you. I think there is another possibility. The painter of the Codex Pray is using an iconographic framework. He intend to paint some thing as the Ingeeburg Psalter (Musée Condé, Chantilly, 1195 circa). (http://imageshack.us/photo/my-images/856/ingeburgchantilly.jpg/) . \nOr this one:\nhttp://www.photo.rmn.fr/cf/htm/CSearchZ.aspx?o=&Total=34&FP=63233701&E=2K1KTSGGDDHHR&SID=2K1KTSGGDDHHR&New=T&Pic=25&SubE=2C6NU0TPSXFQ. (Allemagne, Berlin, Skulpturensammlung und Museum für Byzantinische, 14th Century). \nBut I prefer this one:\n http://www.europeana.eu/portal/record/03918/8F93197282B8D6BAE3866E1013EEED4534653F36.htmll  , (Heures. Vie de sainte Marguerite , mise au tombeau , 1300). \nYou can see how the idea of linen which continues on the back or the hands of the characters is a commonplace at the time. But not everyone has the same idea of continuity. I prefer the comparison with the Book of Hours. Life of Saint Margheritte because it coincides perfectly with the folds under the head and feets that represent the end of linen at this point. The same that Mr. Jones marks with green. And you can see that the concept of the wrapping sheet is different to the shroud of Turin. It is a lateral wrapping.\nIn any case, I would not draw hasty conclusions from a glance on the picture. You have to know a lot of medieval art. And do not think that the Codex Pray artist paints directly what your eyes see or your imagination dictates him. In the Middle Ages there were iconographic models. And the artists use those models. Not realistic representation of reality.\n\n","date":"June 21, 2012 at 3:25 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12834","author":"David Mo","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Hi David, again an excellent reply. Yes, the Heures, Vie de sainte Marguerite image really does show the use of iconographic templates to achieve folding cloth depictions, but it does then beg the question why did the artist go to the trouble of showing the two attendants on right and left in an apparent tussle with the surplus material….what other explanation is there for whats in their hands other that material from the shroud, though I’m open to suggestions.  I suppose your point is that the artist might not necessarily be illustrating the shroud but might be trying to do a copy of something similar to  Ingeeburg Psalter.\nI think that my original point that the shroud depicted in the PM is actually very long, is still valid whether the artist is trying to do something like the Ingeeburg Psalter or attempting a depiction of the shroud. Though whether the top and bottom images on the PM  are both actually the shroud seems debatable. Some nice puzzles to think over.\nBTW Do you know what is being depicted but the long extended cross extending from the bottom image to the top image? There almost seems to be a detached hand holding the cross.\n\n","date":"June 21, 2012 at 4:13 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12873","author":"ArtScience","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"ArtScience. Thanks for this information and your thoughtful analysis. Please may I say that when there are so many strange postings on this subject and quite a lot of name-calling, that it is good to find someone who is trying to actually work through the issues!\n The question remains, and has been raised by others during these discussions – is why  the Shroud has to be concealed in this way. If, and there is not enough evidence to be sure of this ( I am being cautious again) , Robert de Clari is describing the Turin Shroud in the Chapel at Blachernae in 1203, it shows that there were no inhibitions about  unrolling it so that the full image could be seen. This was the common practice of course, people wanted to see the relic fully exposed. We do have an illustration of the Crown of Thorns in Paris being shown to the crowds from a tower. So why not show the Shroud more clearly?\nOn Stephen Jones’ blog, there was some statement about the authorities in Constantinople not authorising the Shroud to be shown in full but  no Catholic ( and it is assumed that the illustrator of the Pray Codex was a Benedictine monk) would have taken any notice of any such decree from the schismatic Greek Orthodox Church. Look at what happened just a few years later in 1204- the Crusaders just grabbed what relics they could from the Greeks and took them back to Europe. Many said that it was God’s will that they should do so!\nYes, mysteries are fun – so long as one keeps one’s feet on the ground -it is a pity that the surviving sources are so few.\nDo not worry about Max Patrick Heron We have been trying to get him to explain himself more clearly -at present he is adding nothing to any argument but seems to live in some kind of cryptical world of one-liners followed by typo corrections. There is nothing here that can persuade anyone of anything and perhaps if we keep on making the point he will even realise this himself.\nN.B. Menedemus is a character in one of Erasmus’ work on relics who was a loyal Catholic but sceptical of the relic cults  he saw around him in the 1520s. Not to be confused with an obscure Greek philosopher of the same name!\n\n","date":"June 21, 2012 at 4:11 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12838","author":"menedemus","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Should I repeat here once more: to the steganographic/crytographic eye, a comparative study of the Pray Ms five pen & ink miniatures in the light of the TS can yield  nearly 33 points of similarity among which more than 13 spy details.  Most likely, this is NOT JUST COINCIDENTAL. All these pieces of evidence PUT TOGETHER verge on a PROOF almost beyond the least rational doubt .. but not beyond Menedemus et al blatant ignorance of them/it….\n\n","date":"June 21, 2012 at 4:38 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12842","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"In terms of arguments here, only image comparisons can talk better than a thousand words. I eamailed Dan Porter a couple of such illustrations. He didn’t even bother to publish it nor even has the courtesy to answer my “why so”….  Hence you have no chance to see how right or wrong I really am…\n\n","date":"June 21, 2012 at 4:59 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12846","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"In the light of the TS, the detection of a dozen of spy details in the Pray Ms two miniatures featuring the shroud of Christ can fairly be considered as a substitute for fingerprinting in archaeological document comparative studies.\n\n","date":"June 21, 2012 at 5:38 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12852","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Thanks Menedemus, I’m just curious as to the truth of the Turin Shroud and have no real bias either way. I come from a physics background but also studied art and researched into old master techniques so I was curious as to how the image was formed. It would be nice if there were some truth to its claims, but getting reliable evidence for or against seems tricky as there often seems to be an agenda behind the evidence. I’ve only a very cursory knowledge of the Shroud but it does stand out as  unusual in art history (and it also stands out from its copies as it seems to be very obviously of a different level of skill and detail involved). I have a couple ideas of how it might have been made if indeed  it was.\nYes, I have noticed that there is a fair level of rough and tumble in the forum …. just got to laugh it off if possible!  Nevertheless I’ve learnt a lot by snooping in here every so often, and am thankful for people’s opinions, as I feel it has helped me better formulate my own opinions. Nice hearing from you, best wishes.\nPS Thanks for the explanation of the origin of the name you use.\n\n","date":"June 21, 2012 at 3:59 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12872","author":"ArtScience","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Typo errors: “Almos Jozef”; “lower semi folded line in the miniature upper section”\n\n","date":"June 20, 2012 at 8:43 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12830","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"\nDavid Mo :\nAs the Mandylion was a sacred image the man can not touch it directly. So he holds it with his cloak.\n\nNice explanation, David…I can go with that! That enlarged image helps clarify that. Thanks. One mystery solved.\nWhat is your opinion of the green line on the PM as extolled by Steve Jones? That certainly still seems to be indicating a long shroud. Though I might not have made the final green connection on the right that he does (giving a continuous cylinder of cloth!)\n\n","date":"June 21, 2012 at 4:01 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12837","author":"ArtScience","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"DMO wrote: As the Mandylion was a sacred image the man can not touch it directly. So he holds it with his cloak. \nThis is not David Mo’s personal explanation. Any serious Shroud researchers know that from old (at least the late 1980s if not before). TIME TO UPDATE!\n\n","date":"June 21, 2012 at 4:45 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12845","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"I agree with much but not everything Stephen says. Personally I think the feminine figure on the right is holding part of the larger shroud with her left hand, but I think the other elements that he has coloured in green are simply parts of the clothing that the characters are wearing\n\n","date":"June 21, 2012 at 5:00 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12847","author":"Matt","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"actually the hand position of the character on the left indicates he might be holding part of a larger shroud too\n\n","date":"June 21, 2012 at 5:03 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12848","author":"Matt","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Thank you, ArtScience.\nMy opinion is stated above: comment of June 21, 2012 at 3:25 am.\nI see the last link do not works well. Please, try  with: Mise au tombeau. Heures ; Vie de sainte Marguerite. http://www.culture.gouv.fr/public/mistral/enlumine_fr?ACTION=CHERCHER&FIELD_98=SUJET&VALUE_98=%27Mise%20au%20tombeau%27&DOM=All .\nIt is the last picture of the list.\n\n","date":"June 21, 2012 at 9:26 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12861","author":"David Mo","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Could DMo provides us with LINKS to mid13th-mid 14th century CE NECRO-HYPERREALISTIC fake shrouds (fakes in Medieval Art) in connection with Christ Entombment/Empty Tomb PROVING there were that many Christ fake shrouds around then? I JUST CHALLENGE HIM!\n\n","date":"June 21, 2012 at 5:57 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12854","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"I mean FULL LENGTH HYPER-NECROREALISTIC CHRIST FAKE SHROUDS….\n\n","date":"June 21, 2012 at 7:30 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12859","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"This  would be a real hit in Medieval Christ shroud Iconography since I have never seen any of them mid 13th-mid 14th century CE hyper-necrorealistic shroud!\n\n","date":"June 21, 2012 at 1:10 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12864","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"The only pre-1350 hyper-necrorealistic full length Christ shroud I know of is the Shroud now kept in Turin…\n\n","date":"June 21, 2012 at 1:14 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12865","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"I cannot help thinking AnLomb is just selling it… He will  not show us the slightest image of any other mid-13th-mid 14th century CE hyper-necrorealistic FULL LENGTH Christ shroud to back up his claim….\n\n","date":"June 21, 2012 at 1:32 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12867","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"According to Antonio Lombatti there are 40 of them to PROVE IT!\n\n","date":"June 21, 2012 at 7:33 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12860","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"We will have to wait to see what Lombatti is actually arguing in his article when it comes out but I wonder whether (perhaps a mistranslation from the Italian), the word ‘copy’ is the right one to use. It may be that there were a large number ( forty perhaps) of cloths claiming to be the original burial shroud. This is ,of course,typical of medieval relic cults in general and not a large number when you remember how many pieces of the Cross, thorns from the Crown of Thorns, the six or seven heads of John the Baptist,etc.were around. Europe , especially if you include the Byzantine empire, was a large place, communications were very poor and individual communities would develop their own cults ,often unaware that three or four hundred miles away, another shrine would be claiming to have exactly the same relic as they had. Even if you knew of your rivals ,you would still develop a legend to show why yours was the real one!  So are we really talking about COPIES here or simply alternative versions of shrouds  each claiming to be the authentic one.\nI don’t know the original source for ‘the forty’ but i am certainly not surprised to hear of forty different places each claiming to have the original shroud. It fits well with what we know of medieval relic cults in general.\n\n","date":"June 21, 2012 at 10:11 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12862","author":"menedemus","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"\nArtScience :\nI think that my original point that the shroud depicted in the PM is actually very long, is still valid whether the artist is trying to do something like the Ingeeburg Psalter or attempting a depiction of the shroud. Though whether the top and bottom images on the PM  are both actually the shroud seems debatable. Some nice puzzles to think over.\nBTW Do you know what is being depicted but the long extended cross extending from the bottom image to the top image? There almost seems to be a detached hand holding the cross.\n\nIf there are the same opportunities of truth for hypothesis A and hypothesis B, we say we do not know if either A or B. That is, we do not know if the painter of the codex had seen the shroud of Turin. That is what some sindonists are trying to prove.\nBut I think  one of the two hypotheses is extraordinary. It is extraordinary that a monk from a Hungary monastery had information about the type of weave of a cloth exposed to the crowd in Constantinople. And remarkably, the monk had chosen represent this instead the image. I do not know similar cases in medieval art. And extraordinary events require extraordinary evidence. No such evidence exists; so we can say that it is very unlikely that the Pray codex represents an image of the Shroud of Turin.\nMoreover there are strong indications or evidence that the image of the codex Pray is not inspired by the Shroud of Turin. For example: The sindonists emphasize the anomalous position of the marks of blood on the hands. They think it is a specific feature of the Shroud of Turin that is not found elsewhere. But the hand marks in the codex Pray are in the palms, as in almost all works of art. Therefore we can say for sure hat the Codex Pray artist had no information about the Shroud of Turin.\nFor the first reason I would be skeptical about the Pray Codex is inspired by the Shroud of Turin. For the next two I can say that I am sure that this is not true.\nPS: Ingeburg (or Ingeborg) in English, not “Ingeeburg”. Sorry for my error. She was a Danish princess who was married to Philip II Augustus of France. It seems with not much enthusiasm on their part.\n\n","date":"June 22, 2012 at 2:25 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12875","author":"David Mo","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Just a show off of cheap rampant rationalistic ignorance from a NON-art historian & NON-archaeocryptological analyst…\n\n","date":"June 22, 2012 at 6:34 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12886","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"HI David thanks for your reply. I must admit I’m not so persuaded this time by your arguments.\nI’m not entirely sure why its extraordinary that a Hungarian monk might have gone to Constantinople and seen shroud with herringbone pattern from say a couple feet way, then returned and after months/years tried to recollect what he could.  He might have decided that his skill in drawing a body imprint on the cloth was not sufficient to distinguish it from an image of a dead and singularly unrisen Christ resting on shroud, so decided that herringbone texture was the next best thing. I think its an established fact we are dealing not the most versatile of artists and to add to his pains the necessity of showing what is a faint human body image flattened …now that would have been extraordinary!  \nWe know that witness testimony and memory can be unreliable, so he might have painted the nail wounds where people expected and also he was more interested in conveying the crucifixion and resurrection story than igniting an anatomical controversy. (poor bastard, if only he knew his drawing would be subjected to this level of forensic detail, he’d be squirming in his grave!).  So I’d downgrade your extraordinary to mildly unusual, but then I dont know medieval art like you do.\n\n","date":"June 22, 2012 at 2:25 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12916","author":"ArtScience","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"ArtScience: \nThere is not throughout the Middle Ages an image painting  a subject in terms of the weave of a fabric or material. That would be extraordinary.\nThere is no possibility of perceiving the weave of a fabric if not taken into hands and look at this detail. Impossible for an obscure Hungarian monk had had this opportunity. That would be extraordinary twice. \nNo one representation of the Shroud of Turin till the modern times portrays him as “faint.” (Fibula, della Rovere, Clovio, etc.) The Shroud of Turin did not look as today at least till the sixteenth century. At that time a witness describes it as “done today.” \nIf the resemblance of the image is so vague that it can be attributed to poor memory of the painter, it can also be attributed to the painter never saw the shroud of Turin. The theory that the Pray codex is a copy of the Shroud of Turin is kept only if you can establish clear similarities that only can be explained as copies. If it doesn’t matter the wounds are or are not in the palms then the resemblance is unverifiable. The logic conclusion is skepticism. \nSindonists derive from the assertion of the theory of strong resemblance to one of the likeness weak when they are in trouble. That’s cheating, bluntly speaking.\n\n","date":"June 23, 2012 at 1:50 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12940","author":"David Mo","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"DMo’s very misleading and desinformative speech again. What does he know about Benedictine artist Monks’ art works and their use of steganography and cryptography? NOTHING, ZILCH, NADA, INUTING! His persistent cheap rampant (pseudo) rationalistic dogmatic ignorance in medieval Art History is flabbergasting! All the more so as he wants other to think like him! NO WAY!\n\n","date":"June 23, 2012 at 5:24 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12944","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Menedemus: \nFerdinand de Mély (Le Saint-Suaire de Turin est-il authentique? Paris,1902, p. 21) briefly cites forty sindones. It should be borne in mind that the concept need more precission. It include complete shrouds with or without image and wraps.\nGaetano Ciccone quotes 16 full shrouds:\n“1 – Sindone di Torino\n2 – La Santa Sindone di Aquisgrana\n3 – Il Santo Sudario di Arles\n4 – Il Santo Sudario di Besançon\n5 – Il Santo Sudario di Cadouin\n6 – il Santo Sudario di Cahors (Sainte Coiffe)\n7 – Il Santo Sudario di Carcassonne (Saint Cabouin)\n8 – Il Santo Sudario di Compiègne (Saint Seigne)\n9 – Il Lino di Cristo di Iohanavank in Armenia\n10-Il Santo Sudario di Lisbona\n11-Il Santo Sudario di Magonza\n12-Il Sudario del Senor di Oviedo\n13-La Sindone di Parigi\n14-Il Santo Sudario di San Giovanni in Laterano in Roma (da non\nconfondere con l’immagine acheropita del Laterano che è un dipinto su\ntavola).\n15-Il Sudarium Christi di Andechs in Baviera (che sarebbe una metà)\n16-La Sindone Mondissima di Limoges.”\n(Gaetano Ciccone: La Sindone svelata e i quaranta sudario\nEditrice Donnino, 2006)\nThe same author quotes 100 fragments of Christ’s shroud. According Ciccone most shrouds had not image. But he says also that from many others we have not even description or an incomplete description only.\nThis is the situation of the relics of the Shroud in the Middle Ages. I ought this information to an e-mail from Antonio Lombatti, June 13, 2012.\n\n","date":"June 22, 2012 at 2:49 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12876","author":"David Mo","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Everybody  will notice the 40 shrouds are now only 16…. (I just like the way you & AntLomb back up your claim!) \nNow among the sixteen here listed, “Il Sudario del Senor di Oviedo, Il Santo Sudario di Cadouin, il Santo Sudario di Cahors (Sainte Coiffe) etc etc etc” ARE definitely NOT FULL LENGTH LONG NECRO-HYPERREALISTIC burial cloths. Are you kidding? \nYou & AntLOMB are just playing on the very ambiguity of the words Sindone/Sudario to hardly reach 16 shrouds. Your INTELLECTUAL DISHONESTY does show: it has hardly no limits!\nMy question STILL IS AND REMAIN, can you or AntLomb just PROVE (beyond any rational doubt) all these claimed  “40 shrouds” were hyper-necrorealistic rendering of a true full length Christ LONG shroud produced with the same or almost the same ingenuity as the LONG Shroud now kept in Turin was… THE ANSWER IS: NONE OF YOU TWO CAN; That’s a fact.\nCan you or AntLomb tell HOW MANY of them NECRO-HYPERREALISTIC LONG shrouds date back BEFORE 1356-1357 c. CE? If any candidate, can you or AntLomb show us a picture/photograph of it?\nDo you &/or AntLomb really know the meaning of the compound words “HYPER-NECROREALISTIC”/ NECRO-HYPERREALISTIC” mean? I very much doubt so.\nThis is just a very short answer of mine in snatches. However it tells much about the way David Mo & AntLomb DO manipulate and squeeze facts to have them fit into their talibanic view of Art and Churh Histories when it comes to the TS…. (a LONG piece of burial/linen cloth).\n\n","date":"June 22, 2012 at 6:01 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12882","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"BTW why don’t you also include all the Greek epitaphoi…?\n\n","date":"June 22, 2012 at 6:19 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12884","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"If the “sindoni/sudari” list is to prove anything, it will just prove the long Shroud now kept in Turin was the protoype and they alleged “necro-hyperrealistic” long/short/reduced scaled shrouds are only copies or copies of copies!\n\n","date":"June 22, 2012 at 6:42 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12887","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Typo error: “Do you &/or AntLomb really know what the compound words “HYPER-NECROREALISTIC” and NECRO-HYPERREALISTIC” mean? I very much doubt so.”\n\n","date":"June 22, 2012 at 6:13 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12883","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Thanks, ArtScience and David Mo. Yes, this is a basic issue that you have pinpointed, David. We have lots of  different versions of the same relics ( not just shrouds,of course),  but we simply do not have clear enough descriptions to be able to trace the fate of each and, in the case of the many shrouds.etc which of them might or might not relate to what we now know as the Turin Shroud. Recognising this is an important step forward because all too often even the most obscure reference to an image on a piece of cloth is assumed by enthusiasts to be a reference to the Turin Shroud. This is not good history.\n I share David’s scepticism over the Pray Codex. While the writer of the latest posting on this blog (just posted, 22nd June)) is convinced by the evidence, i am of the the school that you really do need a lot more evidence before making the kind of assertion. As the key feature of the Turin Shroud is the double image, I start from the assumption that unless this is clearly shown in an illustration or directly referred to then I am not buying. As seems to have been established in other discussions here , the  idea only came from Ian Wilson and no one was ever able to produce a peer-reviewed research paper by an art historian which has backed the idea. (Not too late, if anyone knows of one!- de Wesselow adds nothing of importance in The Sign)\nWhat has been surprising is the number of enthusiastic supporters of the ‘Pray Codex shows the Shroud school’ who do not seem to have even the most elementary knowledge of medieval art. David and others have done a great job in opening up the subject and showing that you really do need to know quite a lot about illustrations of this period before you start making the kind of dogmatic statements some people here and on a neighbouring blog have been making.I am on the fringes of this world but know of academics who have spent years of their lives studying these issues -yet here we find all kinds of pseudo-experts telling exactly what we SHOULD be seeing in what is a rather low-quallity illustration of a well-known gospel scene, made by a Catholic Benedictine monk of a possible relic held by schismatic Greek orthodox Christians. Just too far-fetched to stick with me.\nThere are two points I will conclude with. Not necessarily relevant but may be taken up.\n1) Whether the Turin Shroud is 650 or 2000 years old, it is an important artefact, a rare piece of cloth and a rare piece of art because of the difficulties in defining how it might have been made. If it had been a work of art of say 1300 ,the age of Giotto, imagine how it would have been treated for further examination/ conservation. There would have been a long period of examination in controlled conditions before anyone even thought of doing any work on the surface. I don’t need to repeat the sorry story of how the Turin Shroud has been treated  -virtually every basic procedure for dealing with an item of this age and vulnerability has been ignored.  I am sure people thought they were doing the right thing but far too many people who had absolutely no training in the most basic of conservation techniques were let loose on the Shroud, and even allowed to take off substances from it. The chances of every really finding out how it has been made are certainly diminished as a result. The substances detached  from the Shroud are floating around the world, it is not even clear who controls them (at the very least they should all be returned to one conservation laboratory, probably in Italy so that a team of textile experts can work on them in one place).  I have even read of one enthusiast who has managed to get hold of part of the Shroud which he treats as a relic. It is a shocking story of how not to treat medieval ( or earlier) art.\n2) The Protestant reformers had a point ( although I deplore the way they destroyed relics).\nAll too often a relic became more important than Christ and the scriptures. Some pro-Shroud supporters come across as more attached to the piece of cloth than to the man who may, or may not, have been laid in it. Not healthy, and probably idolatry ( see Ten Commandments) rather than Christianity.\n\n","date":"June 22, 2012 at 6:30 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12885","author":"menedemus","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"I leave Menedemus the Archsceptic to his cheap rampant rationalistic dogmatic ignorance of the use of steganography and cryptography in religious Art Works by Benedictine monks and early cryptochristians before them….\n\n","date":"June 22, 2012 at 6:50 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12888","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"At times things seems only just too far-fetched for ignorant short-sighted/minded people….\n\n","date":"June 22, 2012 at 6:56 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12889","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"You might be interested in the following two posts on my blog:\nhttp://deumvidere.blogspot.co.uk/2012/06/image-of-edessa-and-turin-shroud-part.html\nhttp://deumvidere.blogspot.co.uk/2012/06/image-of-edessa-and-turin-shroud-part_22.html\n\n","date":"June 22, 2012 at 8:10 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12895","author":"Davor Aslanovski","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Davor. I notice that on your link Andrea Lombatti has given the reference to his own article on this issue. It is much more comprehensive than Averil Cameron (who, as one of the finest Byzantine scholars in the world, has better things to be spending her time on) and deals with all the points, refuting Ian Wilson and his supporters in particular.\n I think you overestimate the amount of support Wilson has – do any of these ‘scholars’ hold an academic position in Byzantine/medieval history or literature? I think you will find not. \nLombatti’s article needs to be in English. I hope it will be translated soon.  Anyone relying on the 944 sermon by Gregarius ( a typical welcoming of a relic to a new home sermon) needs to quote from the early part of the sermon where Gregarius makes it clear that not only is he looking at a cloth with just a face on it  (of Christ, of course) but that this cloth was given by Jesus, after he had wiped his face with it ,in the garden of Gethsemene  to the apostle Thomas who then handed it to Thaddeus who then, of course, keeps it and brings it to Edessa. So, as far as Gregarious is concerned, the cloth by-passed the tomb altogether. This is the clinching point.\n The sweat of Jesus is thick ‘like blood’ – i.e. it is not actually blood  and the point Gregarius is making about the wound in the side, although rather theologically obscure is that the water of the sweat is similar to the prestigious water that flowed, on a later occasion at the Crucifixion, from Jesus’ side alongside blood. It is for that reason that  the Image is to be honoured.\nIn fact, the first part of Gregarius’ sermon is one of the best pieces of evidence we have that the Image of Edessa/Mandylion that Gregarius was welcoming to Constantinople was not a burial shroud. \nHere is the relevant passage. Gregarius is telling his congregation  the story of the Image of Edessa by narrating the events by which it came to Edessa. Thaddeus has arrived with the Image in Edessa and the story goes on:\n‘And Thaddaios answered [to king Abgar], “When Ananias [ the messenger of Abgar], who you entrusted the letters to, said in hope that apart from your health, you also wished to look upon the likeness of his [Christ’s] face as it was seen, Jesus told him to come quickly to you with the letter, in which he promised to send you one of his disciples after his ascension, and I [Thaddeus] am that disciple. But Jesus, undergoing the passion of his own free will, believing that human nature fears death – indeed death comes upon the very nature that was made to live – taking this linen cloth [i.e. the Image of Edessa that Thaddeus is holding] he wiped the sweat that was falling down his face like drops of blood [note ‘like drops of blood’, not actual blood!]  in his agony. And miraculously, just as he made everything from nothing in his divine strength, he imprinted the reflection of his form on the linen.\nWhen he came down the mountain after praying, he gave it [ the cloth] to Thomas, one of my fellow disciples, as I was not there. He [Christ] told him to give it to me [Thaddeus], so that after the ascension I could bring it to you.’\nAnd anyone who still thinks that Gregarius is talking about a burial shroud needs some serious help. There is, of course, as you will find when you read Lombatti’s article, a mass of other evidence making it clear that the Image of Edessa is not a burial shroud.\nThere is also an article by Charles Freeman- found online ‘Charles Freeman Shroud of Turin’- that shows how tetradiplon refers to the method by which the Image of Edessa was folded for storage in such a way that the face of Christ was not folded.\n\n","date":"June 22, 2012 at 9:15 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12897","author":"menedemus","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"I wrote Davor:\nyou erroneously wrote (an example among many): “the fact that authors who have had first-hand acquaintance with the image (Gregory Refendarius, the author of the Narratio de imagine Edessena, Nicolas Mesarites, Constantine Stilbes, Anthony of Novgorod, and Robert de Clari) never mentioned that it portrayed more than Jesus’ face.”\nActually, this is short from a fact. As far as Robert de Clari’s testimony is concerned his use of the old French word “figure” = “semblance” (in Latin figura) does mean “[la]configuration humaine”, “[l’]apect général/[la] structure d’un corps humain” hence the whole body….\nAll the best with your most interesting blog.\n\n","date":"June 22, 2012 at 9:30 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12898","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Typo error: “hence the whole body or part of it…”\n\n","date":"June 22, 2012 at 9:32 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12899","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"@ menedemus: I cannot discuss Nicolotti’s (I suppose you meant Nicolotti rather than Lombatti) work before I have read it. If I have indeed only retold in English what he had already published in Italian, I will delete my posts. For the time being, though, I think I can safely assume that our arguments are not exactly identical. \n@ Max Patrick Hamon: I, naturally, don’t think that there is anything erroneous in that article. I will explain why you are wrong on the Robert de Clari’s testimony, but before I do so, I must ask: is it really only ‘one example among many’ and, if so, what else do you object to?\n\n","date":"June 22, 2012 at 10:12 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12901","author":"Davor Aslanovski","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Devor, \ntoo bad you cannot see all your errors. Shall I repeat, the old French word “figure” used by Robert de Clari JUST CANNOT ONLY REFER to the head. It does refer to “la forme”, “la personne” of Christ. De Clari picked out the word “figure” instead of “semblance” (likeness) or any other vocable because he did  mean the whole body (or,at least a part of it) not just the head. This philological fact just doesn’t fit into your attempt to iconologically theoricized on the image of the Holy Face of the Holy Mandylion as totally distinct from the Shroud image….\n\n","date":"June 22, 2012 at 10:57 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12903","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"I also wrote: “Devor, (one more example of your most subjective readings of Christ face/head iconography): On the contrary, the very fact that Jesus’ face on both the Image of Edessa and The Holy Face of the Holy Mandylion are shown either disembodied and/or with a truncated neck is significant. Most obviously, they both can be read as spy-details in conjunction with the Turin Shroud face as the latter does seem as if separated from the rest of the body.”\n\n","date":"June 22, 2012 at 10:45 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12902","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Anatomically stricto sensu, the neck is not even recorded on the TurinShroud. What we see is the lower jaw subarea…\n\n","date":"June 22, 2012 at 11:05 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12904","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"…or what is in correnpondance with it (and look like a piece of wood cut /sawn off from the Titulus Damnationis but this is another (paleographic) story…)\n\n","date":"June 22, 2012 at 11:14 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12905","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Here is Davor Aslanovki’s Mission Statement:\n“Well, my mission is more or less the same as that of the Coca-Cola company.\nThe Coca-Cola Promise: The Coca-Cola Company exists to benefit and refresh everyone it touches. The basic proposition of our business is simple, solid, and timeless. When we bring refreshment, value, joy and fun to our stakeholders, then we successfully nurture and protect our brands, particularly Coca-Cola. That is the key to fulfilling our ultimate obligation to provide consistently attractive returns to the owners of our business.\nEverything we do is inspired by our enduring mission:\n    To Refresh the World… in body, mind, and spirit.\n    To Inspire Moments of Optimism… through our brands and our actions.\n    To Create Value and Make a Difference… everywhere we engage\nWell, you know, mutatis mutandis.\nAs usual, it’s hard to put a finger on what exactly an art historian contributes to this world.\nBut if The Coca-Cola can get away with refreshing the world… in body, mind, and spirit, or with creating value and making a difference, well, then so can I.\nI will refresh you and inspire you for moments of optimism with my insights on theology of art in Abrahamic religions. And with many other riveting subjects.”\nAt face value it just sounds great… for Americans, the only snag here is that Coca-cola is dangerous with the potential to both cause and aggravate diabetes (risk of developing Type-2 Diabetes, weight gain and obesity).and also cause cancer… A most unfortunate comparison to promote one’s blog if you ask me…\n\n","date":"June 22, 2012 at 12:55 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12909","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"This reminds me of the Romance of Commerce in G.H. Well’s Tono-Bungay… A Coca-cola Art historian? Don’t say….\n\n","date":"June 22, 2012 at 1:10 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12910","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"A purple-patch indeed…\n\n","date":"June 22, 2012 at 1:13 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12911","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Davor you wrote: “I must ask: is it really only ‘one example among many’ and, if so, what else do you object to?”. You just asked for it. Actually there will more to object but I have to save up time to work…\n\n","date":"June 22, 2012 at 1:16 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12912","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Is there anything in relation to my posts, rather than to the perils of Coca Cola consummation, that you would like to discuss?\n\n","date":"June 22, 2012 at 2:41 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12917","author":"Davor Aslanovski","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"To Davor: \nWhat do really make of Robert de Clary’s testimony, (La conquête de Constantinople, ch. 92): \nEt entre ches autres en eut un autre des mousters que on apeloit medame Sainte Marie de Blakerne, ou li sydoines la ou nostres sires fu envelopes, i estoit, qui cascuns desvenres se drechoit tous drois, si que on i pooit bien veir le figure nostre seigneur, ne seut on onques ne Griu ne Franchois que chis sydoines devint, quant le vile fu prise. \n1/How then do you translate the old French words “sydoine” & “figure”?\n2/How can the French knight write about an alleged mere face shroud/towel “se drechoit tous drois” when most obviously he is speaking of a “sydoine”/synne/sindon”?\nI’d very much like to know…\n\n","date":"June 22, 2012 at 3:20 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12918","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"The Turin Shroud face (original document) that does seem as if separated from the rest of the body is consistent with both the Image of Edessa and The Holy Face of the Holy Mandylion being shown either disembodied and/or with a truncated neck. Do you deny this visual fact?\n\n","date":"June 22, 2012 at 3:33 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12919","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Would you kindly put all these and any other comments/questions you may have together and post them on my blog? Let’s not lead this conversation in two places.\nAlso, can you please explain the distinction you are making between the ‘Image of Edessa’ and ‘The Holy Face of the Holy Mandylion’?\n\n","date":"June 22, 2012 at 5:08 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12925","author":"Davor Aslanovski","site":"shroudstory"},{"title":"A Pointless Discussion of the Hungarian Pray Manuscript?","post":"Davor, PLEASE FIRST do reply to my questions (just don’t ask a question in  reply to my questions. Thank you).\n\n","date":"June 22, 2012 at 5:22 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","id":"comment-12929","author":"Max Patrick Hamon","site":"shroudstory"}]
