[{"title":"Ian Wilson Responds to a Posting in This Blog","post":"You failed to mention that the very next day Jones, wrote, “This is truly a major Shroud discovery by Max Patrick Hamon. Again congratulations to him and thanks to Dan Porter for first posting it.”\n\n","date":"January 30, 2014 at 10:17 am","url":"https://shroudstory.com/2014/01/30/ian-wilson-responds-to-a-posting-in-this-blog/","cat":"art","id":"comment-75163","author":"Paulette","site":"shroudstory"},{"title":"Ian Wilson Responds to a Posting in This Blog","post":"Not to suggest through casual reading that I might agree with Max or Stephen; I don’t. I agree with Ian on this.\n\n","date":"January 30, 2014 at 10:29 am","url":"https://shroudstory.com/2014/01/30/ian-wilson-responds-to-a-posting-in-this-blog/","cat":"art","id":"comment-75164","author":"Dan","site":"shroudstory"},{"title":"Ian Wilson Responds to a Posting in This Blog","post":"Quote : “So I am sorry, but much as I would like to be able to endorse Max Patrick Hamon’s argument, it doesn’t get any support from me.”\nMy reply: So I am sorry, but much as I would like to be able to endorse Ian Wilson or Max Patrick Hamon’s hypotheses concerning the Shroud obscure past, both point of views don’t get any support from me (as well as for the majority of scholars who are not actively involved in the pro-Shroud world)! :-)\n\n","date":"January 30, 2014 at 11:29 am","url":"https://shroudstory.com/2014/01/30/ian-wilson-responds-to-a-posting-in-this-blog/","cat":"art","id":"comment-75167","author":"Anonymous","site":"shroudstory"},{"title":"Ian Wilson Responds to a Posting in This Blog","post":"Firstly, one should be reminded here that my posting was just ‘a flash illustrative comment of mine” (not a thorough research paper as I was short of time then to write up a more comprehensive paper on Carolingian and Medieval Benedictine Art works and the Turin Shroud).\nSecondly, is Ian Wilson’s disclaiming gospel Truth? Is he a Carolingian or medieval Art Historian? Is he familiar with Benedictine cryptography applied to Art works? BTW are you Dan? Are you Yannick? Can Wilson or any of you tell me the real meaning then of such a hand gesture?\nThirdly, can Wilson or any of you correctly discriminate between a natural similar hand gesture, a symbolic similar hand gesture and an encoded/cryptic symbolic similar hand gesture? Could you tell me the difference whether the last two are done with the right or the left hand?\nFourthly, if there are that many examples of this same (unnatural) LEFT hand gesture made with a telescopic index finger pointing at the head of Christ in the whole Carolingian and Medieval iconographic corpus besides the Stuggart Psalter, can Wilson or any of you show them to me? \nWaiting for your examples and explanations…\nRegards,\n\n","date":"January 30, 2014 at 6:23 pm","url":"https://shroudstory.com/2014/01/30/ian-wilson-responds-to-a-posting-in-this-blog/","cat":"art","id":"comment-75197","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Ian Wilson Responds to a Posting in This Blog","post":"Can Wilson, Dan or Yannick disagree on this with more solid/serious iconological arguments than just “Many examples have no value” or “I disagree with Max” or “it doesn’t get any support from me” (this is a bit too short don’t you think from “Shroud Scholars”)?\n\n","date":"January 30, 2014 at 6:59 pm","url":"https://shroudstory.com/2014/01/30/ian-wilson-responds-to-a-posting-in-this-blog/","cat":"art","id":"comment-75198","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Ian Wilson Responds to a Posting in This Blog","post":"While agreeing with Ian Wilson that this particular monk illuminator often seems to make caricatures of hands a common motif in the illustrations of the Psalter, I am sympathetic to Max’s perspective. Hand signals were a very common and accepted means of silent communication throughout the ancient world. Nor through scanning quickly through the Psalter did I come across another specific instance of the epsilon sign. It may well be that the other various hand signs shown also have their own particular significance which is now unknown to us. \nIt seems to have originated with a wide assortment of finger counting systems which included sophisticated forms of finger calclations, silent bargaining practices, guessing games of skill such as variations in the morra game, to the extent that literary allusions to numbers often became metaphors, many of them derogatory or vulgar. Georges Ifrah cites very many such examples in chapter 3 of his history of numbers “From One to Zero”. That such allusions found their way into the literature would indicate a common understanding of what was intended. It adequately demonstrates that hand signals were once a very common and well-understood means of silent communication. \nWhen seen in the context of the scourging illustration in the Psalter, with its other Shroud-like motifs, a naked Christ with crossed hands over the pelvis, scourging blood marks, two executioners wielding Roman flagra tipped with pellets, then the suggestion of the epsilon signal pointing to the heads is more than just interesting. It may in fact be of some quite definite significance. It is known that Charlemagne did have links with Constantinople, and some of his court may have been privy to a private exposition there or elsewhere. \nOn the other hand, it is by no means certain that the cloth reported by Arculf to Adamnan was in fact the Shroud or else some other like object. That the illustrator of the Psalter made a point of emphasising hand signs may very well also have a significance which is now lost to us.\n\n","date":"January 30, 2014 at 8:37 pm","url":"https://shroudstory.com/2014/01/30/ian-wilson-responds-to-a-posting-in-this-blog/","cat":"art","id":"comment-75202","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Ian Wilson Responds to a Posting in This Blog","post":"That’s a very interesting summary of an aspect of history I was unaware of. It provides context that helps explain Max’s certitude that the epsilon hand is a Shroud clue. I like the idea that the other fingers throughout the work also have cryptic meanings, but we the modern audience have lost the ability to decipher them.\nThis may all be a red herring of course, but what a fascinating one!\n\n","date":"January 31, 2014 at 5:14 pm","url":"https://shroudstory.com/2014/01/30/ian-wilson-responds-to-a-posting-in-this-blog/","cat":"art","id":"comment-75503","author":"David Goulet","site":"shroudstory"},{"title":"Ian Wilson Responds to a Posting in This Blog","post":"Max, take it easy, both you and Ian Wilson can thrash out any diferences in a scholarly way, which will be of benefit to all Shroudies.\n\n","date":"January 31, 2014 at 8:46 am","url":"https://shroudstory.com/2014/01/30/ian-wilson-responds-to-a-posting-in-this-blog/","cat":"art","id":"comment-75416","author":"Louis","site":"shroudstory"},{"title":"Ian Wilson Responds to a Posting in This Blog","post":"Firstly, had Wilson applied to Vignon marking of the hair  the same spurrious principle (signum multiplex signum nullus) he applied here to the SP miniature,  he should also have discarded as “going over the top”, any identification of any wips of hair with the “reversed 3” bloodstain on the TS man’s forehead. Actually the very SP miniature curious TAILED-EPSILON hand sign is graphically even more accurate than any of the 2-3 tufts of hair one can see on some Byzantine and Medieval Christ portraits.\nReminder to Yannick Clément aka “Anonymous” (sic!):\n On October 29, 2012 at 6:35 am | #23, in reply to one of your comment on “hand gesture” typology, I already wrote:\nSecondly, “YC wrote: “I have read that this depiction [the Panocrator Christ] came from Syria and was very popular at the time but I don’t know if these 2 features [2 main characteristics of the Pantocrator] (the Holy Scriptures and the teaching hand) were present on this Syrian icon… ”\nI then correctted him on this: “It is not a teaching but a blessing hand!”\nYC just replied: “Teaching or blessing hand, the difference is thin and anyway, one of these 2 features were ALWAYS part of the Pantocrator icon, just like it is also on these coins that don’t represent directly the face on the Shroud but the Pantocrator Christ.”\nTo your unintiated/oversimplistic eye, between blessing and teaching the difference is thin indeed!\nMost obvioulsy, your sense for subtle details is definitetly NOT your cup of tea when you come to archaeologically, theologically and/or sindonologically look at (See? Understand? Decipher?) Artworks/icons/images in conjunction with the TS.”\nLast but not least, Dan hadn’t even the slightest notion of what I was talking about when I first mentioned the SP miniature depicting a backview of a totally maned Yeshouas! \nNow these “Shroud scholars” are telling us what should be thought of it as if they were specialists of the issue!\n\n","date":"January 31, 2014 at 10:35 am","url":"https://shroudstory.com/2014/01/30/ian-wilson-responds-to-a-posting-in-this-blog/","cat":"art","id":"comment-75438","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Ian Wilson Responds to a Posting in This Blog","post":"Typo: when I first mentioned the SP miniature depicting a backview of a totally NAKED Yeshoua/Jesus!\n\n","date":"January 31, 2014 at 10:38 am","url":"https://shroudstory.com/2014/01/30/ian-wilson-responds-to-a-posting-in-this-blog/","cat":"art","id":"comment-75439","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Ian Wilson Responds to a Posting in This Blog","post":"Hi Dave, thanks for your support! \nYou wrote: “That the illustrator of the Psalter made a point of emphasising hand signs may very well also have a significance which is now lost to us.”  Not at all! Symbologically speaking (that is at second reading level), the out-of-sized LEFT hand sign stands here (specific context of an execution) for “hand of bad/perveted justice” as opposed to NORMAL-SIZED RIGHT hand sign (see  e.g. in Le Livre des Merveilles by Marco Polo, Ms. Fr. 2810, Bibliothèque nationale de France).\n\n","date":"January 31, 2014 at 11:21 am","url":"https://shroudstory.com/2014/01/30/ian-wilson-responds-to-a-posting-in-this-blog/","cat":"art","id":"comment-75443","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Ian Wilson Responds to a Posting in This Blog","post":"Addition:Le Livre des Merveilles by Marco Polo, Ms. Fr. 2810, Bibliothèque nationale de France, miniature of King Chesumur Rendering Good Justice, fol. 19v)\n\n","date":"January 31, 2014 at 12:42 pm","url":"https://shroudstory.com/2014/01/30/ian-wilson-responds-to-a-posting-in-this-blog/","cat":"art","id":"comment-75450","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Ian Wilson Responds to a Posting in This Blog","post":"Max: The significance of hand signs (particularly those once associated with numbers) no longer has the common recognition that it once did, but is now a matter only for specialists and antiquarians. Consequently any significance in such illustrations as the Psalter are likely to be missed by even the learned. I would guess that the decline of the practice occurred with the introduction of Hindu-Arabic numerals, commencing with Gerbert of Aurillac, Pope Sylvester II around 1000AD, with his apices, and subsequently by Leonardo Fibonacci with his Liber Abaci around 1200AD. This is of course much later than the date of the Psalter, when the significance of hand signs would have been more commonly prevalent.\n\n","date":"January 31, 2014 at 3:42 pm","url":"https://shroudstory.com/2014/01/30/ian-wilson-responds-to-a-posting-in-this-blog/","cat":"art","id":"comment-75487","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Ian Wilson Responds to a Posting in This Blog","post":"To Dave:\n-The Heb. Sadin, Gr. Sindon, Lat. Sindon/-onis and Old French, Sydoine, all derive from Sanskrit Sindhuy, literally “Indian [fabric]”, i.e. “fabric from Sindh/India”\n– The tailed-reversed 3-like shaped bloodstain over the Turin “Indian [Fabric]”/burial cloth man’s right eyebrow image on the front side looks like a tailed-non-reversed 3 on the back side. Seen in the light of Indian (Devanagari, Old Nagari & Punjabi) scripts, the former (tailed-reversed 3-like shaped) “bloodsign” (as seen on the forehead image on the burial front side) can read like the Indian number 3 and the latter (tailed-non-reversed 3) “bloodsign” (as seen on the burial back side) like the Indian number 6.\n– The earliest Benedictine monks’ icono(crypto)graphic art work dates back to 775 c. CE (full length portrait of Christ in conjunction with a herring-bone patterned curtain (that of the Temple of his Holy Blood and Body as a “cryptic allegory” of the Book of Revelation).\nTo Dan(iel Porter), Yannick (Clément), Hugh (Farey), Ian (Wilson) etc (if there are really open to corrections): \nWhether it comes to Faith, Mystic Quest for God/Christ/Rabbi Yeshua in light of Rabbinic cryptic symbology of Seder, Benedictine monks’ (and nuns’) Art of cryptography & steganography and the Medieval iconographic corpus), Blaise Pascal’s famous quote: \n“There is enough light for those who only desire to see, and enough obscurity for those who have a contrary disposition”,\n…could never been best applied.\nReminder One: The Passover Seder Table is set with a linen cloth. Atop this is placed a matzah/ unleavened bread holder with “three” compartments (“3”//“non-reversed tailed 3” in Indian script). Atop this is placed a divided “six” Compartment Meal Plate or Seder tray (“six”/“reversed tailed 3” in Indian script). In Hebrew, it is called qe’arah (“gradalis” in Medieval Latin, in Old Occitan “grasal”. The Hebrew for “Divine/Passover Seder Plate [of Christ]” is Qe’arahel (one of my several etymologic/cryptographic findings in 1994) > Old French Graal, greal, which turned into “Grail” (reference to the diamond-shaped metallic/golden silver long side-face cover of the reliquary in which the “Christ’s Body & Blood Passover Seder symbolic Plate/Yeshoua’s bloodstained burial linen cloth with its body image on” was kept; btw a reliquary “very much like” that of Edessa & Constantinople as Ark(s) of the New Covenant). According to Wolfram von Eisenbach (around 1208), the Holy Grail was then said to be kept somewhere in legendary… “India”. (I Studied the Turin Shroud and made researches in light of the Grail and Holy Grail medieval legends along with John’s Visions from the Book of Revelation and Late-Antique and Medieval Christian legendary hagiobiographical Literature, for more than 10 years 1994-2004) and I have neen studying and made some reserach in Benedictine Art of cryptography and steganography for 25 years.)\nReminder Two: Ian Wilson wrote up his short article “to please” Hugh Farey (you know “the guy who can turn into a cryptologist in 15 minutes” while being totally ignorant of medieval iconography hand sign typology) and/or keep the BSTS editotial line given by Farey as Wilson  just took over the former’s spurrious principle (signum multiplex signum nullus). Wilson didn’t even notice he was in blatant contradiction with his own “scholarly handling” of the Vignon Marking!\n\n","date":"February 2, 2014 at 9:08 am","url":"https://shroudstory.com/2014/01/30/ian-wilson-responds-to-a-posting-in-this-blog/","cat":"art","id":"comment-75952","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Ian Wilson Responds to a Posting in This Blog","post":"Fascinating. I wonder if any of it is true? Incidentally, one of my several etymologic/cryptographic findings in 2014 comes just now, from Googling ‘seder plate’ and ‘Hebrew,’ where I find it is universally called “Ka’ arah.” If adding “el” on the end makes it “divine,” then some etymological connection with “grail” would be plausible, if there weren’t more substantiated alternatives relating it to the Greek for “bowl.”\n\n","date":"February 2, 2014 at 9:26 am","url":"https://shroudstory.com/2014/01/30/ian-wilson-responds-to-a-posting-in-this-blog/","cat":"art","id":"comment-75955","author":"Hugh Farey","site":"shroudstory"},{"title":"Ian Wilson Responds to a Posting in This Blog","post":"Hugh, you rely too much on Googling here in terms of “substance”. Are you just another Googling-Unfree-Thinker?\n\n","date":"February 2, 2014 at 9:45 am","url":"https://shroudstory.com/2014/01/30/ian-wilson-responds-to-a-posting-in-this-blog/","cat":"art","id":"comment-75963","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Ian Wilson Responds to a Posting in This Blog","post":"Small addition: In 1994, in the light of the Turin Shroud man’s blood covered body, besides the Hebrew Qe’arahel, “G.od’s [Flesh & Blood Passover Seder] Plate”, to cryptographically allude to the Parthian/Byzantine metallically trellised reliquary-table with a vast central opening the relic was kept in, i.e. within a monstrance in semblance of a salver (in Welsh “disgyl”) containing the semblance of a man’s severed head,  I found a second Hebres cryptographic etymology, this time to be read in conjunction with the relic once taken out of its monstrance and seen unfold: Gar Al, which literally can be translated both as “the [most] High dwells [in]”,  “the [most] High shines [out of it]”.  \nIn this, the Old French word Graal follows a number of medieval Jewish commentators, such as Abraham ibn Ezra and David Kimchi, who took the Hebrew word al to be a shortened form of elyon, “the Highest,” an epithet for God in many places in the Bible. In Medieval ecclesiastic Latin Gar Al/El can read as a transcription of the Latin phrase Deus Habitat for “Tabernacle” as G.od”s eternal dwelling alluding to Hebrew 10: 31.\n\n","date":"February 3, 2014 at 11:14 am","url":"https://shroudstory.com/2014/01/30/ian-wilson-responds-to-a-posting-in-this-blog/","cat":"art","id":"comment-76196","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Ian Wilson Responds to a Posting in This Blog","post":"Reminder: \n– The Hebrew verb gaal, “to redeem”, wordplays with the Old French word Graal. Besides, on December 30, 2011 at 9:39 pm | #31, I wrote: ” (…) you can see (in conjunction with the discolouring circular nimbus-like/dish-like mark left by the table-reliquary vast circular opening, the Chalice-of-Christ Bloodied Graalic semblance/archaeopareidolia… right in the Turin Shroud positive face/bust image vertical axis, seen UPSIDE DOWN. \n– Seen in conjunction with the Chi-Rho Christian symbol/Christ’s monogram, the “nimbus marking” around the TS man’s face/bust could have evoked a 3-6 compartment Passover Seder vast circular plate. Seen in conjunction with a staurogram, another nearly similar Christian symbol, it could have evoked then a 3-4 compartment Passover Seder vast circular plate…\n– Christ Relics were Byzantine and Carolingian Emperors’ attributes as representatives of Christ on Earth.\n\n","date":"February 3, 2014 at 12:12 pm","url":"https://shroudstory.com/2014/01/30/ian-wilson-responds-to-a-posting-in-this-blog/","cat":"art","id":"comment-76210","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Ian Wilson Responds to a Posting in This Blog","post":"Reminder for Hugh:\n– Helinandus, a Flemish trouvère who became a Cistercian monk at Froidmont and a noted scholar, sides with Robert of  Boron to make the Graal a ‘Paschal dish’.\n– It is said about the Graal: “A naked Christ then appears from out of the holy vessel”.\n\n","date":"February 3, 2014 at 3:11 pm","url":"https://shroudstory.com/2014/01/30/ian-wilson-responds-to-a-posting-in-this-blog/","cat":"art","id":"comment-76233","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Ian Wilson Responds to a Posting in This Blog","post":"Totally fascinating, Max.  Re your reference to -al & elyon.  I’m aware that “El” was the classic Mesopotamian Sky god father (of the gods?).  He is mentioned as such in the Epic of Gilgamesh, I think specifically in the legend of Utnapishtim, which you would be aware of. The name survived in several allusions as a suffix, such as Ba’al, Babel, and of course right down to Hebrew times as ‘elyon’ which you mention. \nGeorges Ifrah gives several examples of the various Hindu numerals, including the 3 and 6 you mention.  However I don’t see in his text that they may have predated the first century CA. I seem to recall that the earliest examples he found were not much before the 8th century, but that might be only because they were etched on durable copper and have survived.\n\n","date":"February 3, 2014 at 3:30 pm","url":"https://shroudstory.com/2014/01/30/ian-wilson-responds-to-a-posting-in-this-blog/","cat":"art","id":"comment-76237","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Ian Wilson Responds to a Posting in This Blog","post":"In the Phoenician Ba’al-Anat epic, El and a comprehensive Mesopotamian pantheon is described. Ba’al is portrayed as an upstart youthful seasonal fertility god who dies in the winter and is resurrected in the spring.  The epic begins with the chaos wrought by the storm god Mot, and might be associated with the random flooding brought about by the two rivers.  The Phoenician epic, apparently written by a priest of Ba’al around 1300BCE is the first known example of an alphabetic script superseding the older cuneiform.\n\n","date":"February 3, 2014 at 4:28 pm","url":"https://shroudstory.com/2014/01/30/ian-wilson-responds-to-a-posting-in-this-blog/","cat":"art","id":"comment-76249","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Ian Wilson Responds to a Posting in This Blog","post":"Neither in the 12th c. CE, Chrétien of Troyes would have teased his readership (all too keen for riddles) with an empty word/empty etymological word plays (Graal/gaal, Hebrew for “to redeem” or Graal/Qe’arahel, “G.od’s [Flesh & Blood Passover Seder] Plate” or Graal/Garal, “the [most] High dwells [in]”,  “the [most] High shines [out of it]”) nor the early 9th c. CE anonymous Carolingian monk (living under Benedictine rule, thus leading a mystic quest for G.od and probably familiar with the art of Benedictine cryptography and steganography) would have with an empty tailed-non-reversed-3-like shaped sign hand signs pointing a telescopic index finger to Christ’s head in conjunction with a back view of his stark naked body. \n  No one can just dismiss them saying none of them had a cryptographic purpose. It is most likely the monk artist’s use of intriguing hand sign was meant to draw the attention of the astute observer/mystic quester for G.od as it can read like an “Indian (hand) Sign”, or to put in Latin words, a Signum Sindonis = “a Shroud (most distinctive) Sign”.\n In the SP there are several similar hand signs painted in conjunction with Christ’s head while such a sign never appears elsewhere in conjunction with Christ’s head in the whole/known medieval iconographic corpus.\n\n","date":"February 3, 2014 at 3:37 pm","url":"https://shroudstory.com/2014/01/30/ian-wilson-responds-to-a-posting-in-this-blog/","cat":"art","id":"comment-76238","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Ian Wilson Responds to a Posting in This Blog","post":"Sorry Mr Ian Wilson, you’re wrong.\n\n","date":"February 3, 2014 at 4:27 pm","url":"https://shroudstory.com/2014/01/30/ian-wilson-responds-to-a-posting-in-this-blog/","cat":"art","id":"comment-76247","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Ian Wilson Responds to a Posting in This Blog","post":"Effectively, I think he’s wrong about a lot of things regarding the history of the Shroud…\n\n","date":"February 3, 2014 at 4:36 pm","url":"https://shroudstory.com/2014/01/30/ian-wilson-responds-to-a-posting-in-this-blog/","cat":"art","id":"comment-76250","author":"Anonymous","site":"shroudstory"},{"title":"Ian Wilson Responds to a Posting in This Blog","post":"Max, you are either on to something that your specialized studies gives you unique insight into, or you are chasing a red herring all the way to Atlantis. If it’s the former I hope you can find the Rosetta stone that will vindicate you to the broader academic community. If it’s the former I hope you pack a life-jacket. Keep on questing amigo.\n\n","date":"February 4, 2014 at 11:00 am","url":"https://shroudstory.com/2014/01/30/ian-wilson-responds-to-a-posting-in-this-blog/","cat":"art","id":"comment-76496","author":"David Goulet","site":"shroudstory"},{"title":"Ian Wilson Responds to a Posting in This Blog","post":"Correction: Etymologically and cryptologically speaking, Graal read as Qe’arahel can be better translated in English “G.od MESSENGER’s [Flesh & Blood Passover Seder] Plate”\n\n","date":"February 4, 2014 at 9:55 am","url":"https://shroudstory.com/2014/01/30/ian-wilson-responds-to-a-posting-in-this-blog/","cat":"art","id":"comment-76473","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Ian Wilson Responds to a Posting in This Blog","post":"Reminder One (one of my 1994 findings): In Old French, “un grail” means “a square/diamond metallic lattice”. Thus, etymologically speaking, the Old French word Graal shall no be mistaken for the word Grail as the latter is used as a metonym for the long-squared reliquary-table in which the holy relic was then kept. More precisely, it just alluded to the diamond golden silvered lattice pierced with a vast central pearl-rimmed opening/oculus endowed with a rock crystal stone protecting the Holy Face of the Holy Sindon reliquary-table long front side.\nReminder Two (one of my 1994 findings): once you turn the Shroud face/bust image upside down, and look at it (in primary visualisation) as a Rorschach test image, the semblance/vision/archeopareidolia of a Chalice of Blood does show in the vertical axis of the Shroud face/bust.\nReminder Three (one of my 1994 findings): re Wolfram von Eschenbach’s telling us that the stone was an emerald fallen off the face of Lucifer cryptically alludes to the fact that the Holy Face of the Holy Sindon (originally kept being placed under the transparent Holy Face of the Holy Mandylion as most likely, both were known as the Image of Edessa) would once be put away in a emerald green silk protective cover (or samit) and the vessel thus hanged well above the ground/(side) chapel altar by means of chains to the ceiling. It used to make the long-squared reliquary-table within its emerald-green silk protective cover, looks like a giant emerald stone as if falling from the church ceiling.\n\n","date":"February 4, 2014 at 12:48 pm","url":"https://shroudstory.com/2014/01/30/ian-wilson-responds-to-a-posting-in-this-blog/","cat":"art","id":"comment-76524","author":"Max Patrick Hamon","site":"shroudstory"}]
