[{"title":"It’s Art, Not Science","post":"I have enormous respect for both Dan and Daveb, They have both taught me much. However, specious arguments from pseudo-skeptics, self-described as scientists, really don’t provide much enlightenment.\nI won a gold medal for science in high school. That does not make me a scientist. Neither did the fact that one of my instructors may have had a teaching certificate for science make him a scientist. Joe Nickel’s white lab coat and microscope do not make him a scientist, neither does his degree in journalism.\nHowever, I do have a lifetime of experience is evaluating evidence and arguments seeking to determine the truth. I do think that some of the self-described scientists could enlighten us with say a listing of their peer-reviewed published articles and their degrees.\nOn the other hand, Colin Barry is someone with some scientific credentials and a legitimate claim to being a scientist. That doesn’t make his claim that this Image of the Shroud of Turin is Jacques DeMolay other than nonsense.\nI have spent more than five decades reading the science pages of the New York Times on a daily basis. I have on occasion subscribe to Scientific America. I remember at first being a little discombobulated when I read several decades ago that the basis of all existence was actually an exercise in the law of probabilities. I was somewhat mollified when I asked myself: Who’s law is the law of probabilities?\nBottom line is this: spare us the claim of superior knowledge of a “scientist.” Just give us facts and we will make our own judgment’s.\nIn my considered opinion, weighing all the facts and evidence, the shroud of Turin is authentic and is consistent with the Resurrection. Other then your unsupported disbelief, if you have a contrary view, just the facts please. Given the qualifications of the scientists who in general agree with me, I am more interested in any facts a skeptic may have rather than predispositions of a pseudo-skeptic claiming to be a scientist.\n\n","date":"June 15, 2014 at 11:43 am","url":"https://shroudstory.com/2014/06/15/its-art-not-science/","cat":"art","id":"comment-129780","author":"John Klotz","site":"shroudstory"},{"title":"It’s Art, Not Science","post":"Well said John, totally agree.\n\n","date":"June 15, 2014 at 2:20 pm","url":"https://shroudstory.com/2014/06/15/its-art-not-science/","cat":"art","id":"comment-129809","author":"Mike M","site":"shroudstory"},{"title":"It’s Art, Not Science","post":"My suggestion (which is all it is) that the image on the TS is that of a Templar (J de Molay or perhaps G. de Charney) is not based on science. It’s based on a close examination of the Lirey Pilgrim’s badge (that vital artefact having incidentally having evoked zero attention and interest on this site prior to 2012).\nBoth the badge, and the later Lier copy of the TS, present a picture of utter simplicity as regards the early TS. When folk challenge one to reproduce the TS in all its detail, which TS are they referring too – the Mark1 TS, as portrayed on the Lirey badge, or the progressively more complex TS we see later, notably with more and more blood embellishments, the latter the only evidence for death by crucifixion, there being no visible wounds as such on the TS basal image.\nI’ll try and put these ideas together into a post in the coming days, but at present am preoccupied by the terrible turn of events in Iraq, and especially the provocative words and past misdeeds of that mentally-unbalanced warmonger Tony Blair. He’s as good as admitted that his real aim was regime change in 2003, something he omitted to tell us at the time in his dodgy dossiers. \nIf only there were such a thing as impeachment procedures in the UK…\n\n","date":"June 16, 2014 at 12:10 am","url":"https://shroudstory.com/2014/06/15/its-art-not-science/","cat":"art","id":"comment-129903","author":"Colin Berry","site":"shroudstory"},{"title":"It’s Art, Not Science","post":"Question for Colin:\nGiven the small scale of the badge, could one reasonably expect to see the full detail of the Shroud on it?\n\n","date":"June 16, 2014 at 1:15 am","url":"https://shroudstory.com/2014/06/15/its-art-not-science/","cat":"art","id":"comment-129918","author":"Thomas","site":"shroudstory"},{"title":"It’s Art, Not Science","post":"It’s a big topic,Thomas, too big to discuss here as a comment. Try googling Lirey badge AND Machy Mould. There’s no shortage of detail on the Badge, e.g. the herringbone weave, but while there’s a lot relating to the De Charny/Vergy heraldry and instruments of torture, there’s remarkably little given to the figure itself, and little or no attempt to depict him as a victim of crucifixion, far less Jesus. One has to ask why. \nThere’s a number of other spy clues that need to be taken into consideration  – the peculiar twisted structure (that Ian Wilson was too quick in my view to identify as a “blood belt” from a lance wound), the diamond trellis on the reverse side, and ESPECIALLY the detail on the Machy mould, notably the addition of that small inset face, presumably Jesus, and the word SUAIRE. \nSo while there’s less detail than one might wish regarding the TS man himself, the Badge and Mould together are packed with detail, much of it enigmatic and crying out for meaningful interpretation.  \nI believe the 2 badges (assuming the Mould was employed, as can be reasonably assumed from the traces of lead) were vital aids in the re-branding of a Mark 1 Shroud that merely depicted a double image of a naked man, pure and simple, but you’ll have to read my several postings to get the full picture. Suffice it to say that the Mark 1 TS may have been described and promoted initially as a sweat imprint on a burial shroud – a whole body version if you like of the extant Veil of Veronica that was attracting hordes of pilgrims. It may or may not have been a sweat imprint, and may or may not have been 1st century. One thing’s for certain: the chemistry of acid action (real or improvised “sweat”)  on linen, probably heat-assisted, may not be too dissimilar from that of thermal action  e.g. template scorching)  if the end result were to superficial sepia-tinted partially-dehydrated carbohydrates in both instances.\nOne has to ask not only what the Lirey Badge/Mould are telling us, but also what they are NOT telling us (and why not, given the wealth of peripheral and enigmatic detail).\n\n","date":"June 16, 2014 at 1:53 am","url":"https://shroudstory.com/2014/06/15/its-art-not-science/","cat":"art","id":"comment-129922","author":"Colin Berry","site":"shroudstory"},{"title":"It’s Art, Not Science","post":"Colin,\nIt amazing how chaotic the world has become that it is almost impossible to simply ascribe labels to individuals. I think you should note that the label   I ascribed to you is  “scientist.” That was not written by me as “irony” but as recognition of a fact. As far as Jacques de Molay is concerned, I think like Leonardo there is more than one deMolay. There is an historical individual named de Molay and there are all the de Molays of myth. \nTo posit de Molay as the figure on the Lirey badge is to honor a de Molay of myth. I expect that the real deMolay was neither the evil, devil worshipping charicature drawn by King Philip and his henchman nor the secular saint honored by the Masons. I do not think finding the real de Molay is possible. Leonardo was a very complex individual of great genius. There may very well be secrets of himself that he kept. However, was he the champion of an underground stream of heresy and conspiracy? Frankly, I doubt it extends as far as the Leonardo of either Holy Blood, Holy Grail or the da Vinci Code. One I’ve read and one I haven’t. \nThere are mysteries that demand resolution because of their importance. Deciphering Christ is important to this day. I am not sure that decoding da Vinci or de Molay rises to that level of importance. The one I read claims to be history.\nAs some of those who I confide in are aware, I am struggling with an issue of supreme importance to to me and I think posterity. We are deep into what I refer to as to “Apocalypse of Selfishness.” The sixth mass extinction of species is underway. One species extinguished may be us.\nIt just so happens that suddenly on the world stage there appears a personalty who may very well be the one most important voice in leading humanity away from the brink of extinction. He happens to be that most despised of creatures in the view of some de Molay adherents: a Roman Catholic pope.\nWe are a long way from King Philip and de Molay and the Borgias. We are not along way from He who was martyred by selfishness for the answer to the problems we face begin with an extraordinary exercise of selflessness epitomized by Him and recorded on the Shroud of Turin. We have a prophet proclaiming that right now. His name is Francis. I pray that I am right.\n\n","date":"June 16, 2014 at 4:46 am","url":"https://shroudstory.com/2014/06/15/its-art-not-science/","cat":"art","id":"comment-129941","author":"John Klotz","site":"shroudstory"},{"title":"It’s Art, Not Science","post":"John Klotz: have only had time to skim your long and heartfelt comment. I’ll take another look after attending to an errand. For the moment, I’d simply use the opportunity to suggest that “shroudology” can sometimes require an appreciation of art, sometimes science, and preferably both in harmony (admittedly a counsel of perfection). But why not view it primarily as detective work, requiring a keen eye for clues and fine detail AND the ability to use those often slender leads to construct a reasonable scenario. The latter may or may not convince a court of law (catering for you legal eagles) or be potentially testable (catering for us less assertive science bods)? Seen in those terms almost anyone can function as a shroudologist, provided that their feet remain planted at all times on terra firma.\n\n","date":"June 16, 2014 at 5:06 am","url":"https://shroudstory.com/2014/06/15/its-art-not-science/","cat":"art","id":"comment-129944","author":"Colin Berry","site":"shroudstory"},{"title":"It’s Art, Not Science","post":"Sacre bleu! I agree\n\n","date":"June 16, 2014 at 5:20 am","url":"https://shroudstory.com/2014/06/15/its-art-not-science/","cat":"art","id":"comment-129948","author":"John Klotz","site":"shroudstory"},{"title":"It’s Art, Not Science","post":"I guess we will just have to wait until our technology advances to the level of the 13 th century to make a  fake shroud as well as the shroud of  Turin. Does anybody else think the preceding sentence is as ridiculous  as I think it is,\n\n","date":"June 15, 2014 at 6:52 pm","url":"https://shroudstory.com/2014/06/15/its-art-not-science/","cat":"art","id":"comment-129846","author":"paul","site":"shroudstory"},{"title":"It’s Art, Not Science","post":"It’s not ridiculous, it’s irony. Well said.\n\n","date":"June 15, 2014 at 8:08 pm","url":"https://shroudstory.com/2014/06/15/its-art-not-science/","cat":"art","id":"comment-129862","author":"John Klotz","site":"shroudstory"},{"title":"It’s Art, Not Science","post":"science is great but it has limitations. Reaching the truth on the shroud requires multi-dimensional analysis, including, critically an understanding of the arts and the philosophy of art and symbolism, AND critically human behaviour and psychology. This is where some of the more scientifically minded here struggle.\n\n","date":"June 15, 2014 at 7:45 pm","url":"https://shroudstory.com/2014/06/15/its-art-not-science/","cat":"art","id":"comment-129859","author":"Thomas","site":"shroudstory"},{"title":"It’s Art, Not Science","post":"I am not looking for scientific truth only logic. Read the book called THE PHYSICS OF CHRISTIANTY and you might come to the conclusion we will never replicate it as I have.\n\n","date":"June 15, 2014 at 8:47 pm","url":"https://shroudstory.com/2014/06/15/its-art-not-science/","cat":"art","id":"comment-129868","author":"paul","site":"shroudstory"},{"title":"It’s Art, Not Science","post":"The Knights Templar were suppressed by Pope Clement V, under pressure from King Philip IV, whose treasury was empty and who was unable to lay his hands on the knights’ wealth. Jacques de Molay had been summoned by the pontiff to discuss new crusading plans, and it was also in his interest to go from Athens to France in order to raise the morale of the knights, who had lost Acre.\nAfter the Order was suppressed Clement made it clear that there could be no group claiming to be successors and the Templar property was given to the Hospitallers. Later, King Dinis I of Portugal persuaded Pope John XXII to found a new order of “successors”, the “Military Order of Christ”. Among its members were;\nVasco da Gama\nPedro Álvares Cabral\nBartolomeu Dias\nPrince Henry the Navigator\nFernão Magalhães (Magellan)\nMartim Afonso de Souza\nThe Portuguese vessels had the famous red flag on their sails. When Cabral discovered Brazil, it was the flagpole with the “Military Order of Christ” that was driven into the ground to claim the territory.\nThe Templars were not heretics, as the “Chinon parchment” demonstrates. Philip had Jacqued de Molay sent to the stake before Clement could proclaim the Templars’ innocence.\nDe Molay faced Notre Dame as he died, that was his request.\n\n","date":"June 16, 2014 at 11:19 am","url":"https://shroudstory.com/2014/06/15/its-art-not-science/","cat":"art","id":"comment-129993","author":"Louis","site":"shroudstory"}]
