[{"title":"Jones on the Hungarian Pray Manuscript Codex as discussed in Wikipedia","post":"Mr. Stephen Jones has write in his blog, The Shroud of Turin (Sunday, May 27, 2012),\na comment that includes usual topics on the subject of the Codex Pray with some personal contributions. I find these statements are meaningless and I explain why:\n“These are the main features shared in common between the Shroud and the PM. But a more complete list includes at least twelve (12) unique features shared between the PM and the Shroud:\n“1.Jesus is naked (uniquely in the medieval era);”\nFalse. \n“2.His hands are crossed over His pelvis;”\nIrrelevant. It is a normal position in the entombment representation. In the case of Christ or others.\n“3.Jesus’ right hand is over His left;”\nIrrelevant for the same reason. \n“4.there is a nail bloodstain in His right wrist (Plate IV);”\nSubjective. I don’t see it at all. \n“5.no thumbs are visible;”\nIrrelevant. It is a normal position in the medieval imagery when the hands are crossing. \n“6.Jesus’ fingers are very long;”\nIrrelevant. It is a normal representation of the hands at iconography of the time.\n“7.there is a mark above Jesus’ right eye corresponding to the reversed `3′ bloodstain on the Shroud of Turin;”\nSubjective. I don’t see it. \n“8.the Shroud is more than double the body’s length;”\nAnd…?\n“9.the Shroud has a herringbone weave pattern;”\nIrrelevant. There is not any representation of herringbone weave in the Pray picture. There is gravestone ornaments. You can find similar ornaments on others gravestone medieval representations.\n“10.the Shroud has an L-shaped pattern of four `poker holes’;\n11.and another pattern of five `poker holes’;”\nSubjective. There are groups of five or eight holes and you can bring them together as you like. Never in form of “P”, as in the codex Pray.\n“12.the end of the PM’s shroud below Jesus’ feet (upper scene) has a ragged edge which corresponds with (i.e. does not perfectly match) the Shroud of Turin’s, with the latter’s missing corner not yet removed.”\nSubjetive. I don’t see it. And it is absurd, because you can find millions pictures of cloth pieces as the Shroud of Turin before being cut.\nIn short: all the alleged identity between the image of Turin and the Codex Pray are false, absurd, irrelevant or subjective. I can show examples of all the statements I have made, but I think they are unnecessary because any amateur of medieval art known them. But I shall do it if you wish.\nBut it is easy to find some important differences. These differences show us that the author of the Codex Pray illustrations had not in mind the linen of Turin when drawing.\n1.There is no direct representation of the shroud with the imprint of Christ, as one would expect in a medieval illustration that would represent it. The idea that the artist’s left esoteric “marks” for “connaiseurs” interpretation is contrary to the canons of medieval painting.\n2.There are no marks of blood in the codex illustrations (CPI). (Only one exception: small marks in the hands without blood yarns). In the Shroud of Turin are abundant.\n3.In the CPI the shroud ends at shoulders. It can’t wrap the head.\n4.In another image of the CP hand injuries are on the palm, not near the wrist as in the Shroud of Turin.\n5.In the CPI Jesus has a small beard.\n6.The structure and form of the CPI are typical of the iconography of the Holy Women at the Tomb. The angel is sitting on the grave and he shows them the shroud (the creased cloth).\n7.It is unthinkable that a Christian artist of the Middle Ages paints the angel stepping on the Christ Shroud. What is under the foot of the angel is the tombstone, not the shroud.\nTherefore, it is clear that the representation of the Codex Pray has nothing to do with the image of the Shroud of Turin.\n (I apologize for my English. It is not my usual language, obviously. I hope it’s intelligible at least and you don’t spend long time decrypt it, as Mr. Jones uselessly spends with the Codex Pray).\n\n","date":"June 2, 2012 at 3:45 am","url":"https://shroudstory.com/2012/05/27/jones-on-the-hungarian-pray-manuscript-codex-as-discussed-in-wikipedia/","cat":"art","id":"comment-11794","author":"David Mo","site":"shroudstory"},{"title":"Jones on the Hungarian Pray Manuscript Codex as discussed in Wikipedia","post":"Brilliant, David. A masterly demolition if I might say of a fatuous comparison – one that would have us believe that an apple is really modelled on an orange …\n\n","date":"June 2, 2012 at 5:12 am","url":"https://shroudstory.com/2012/05/27/jones-on-the-hungarian-pray-manuscript-codex-as-discussed-in-wikipedia/","cat":"art","id":"comment-11795","author":"colinsberry","site":"shroudstory"},{"title":"Jones on the Hungarian Pray Manuscript Codex as discussed in Wikipedia","post":"I hadn’t even heard of the Pray Codex until recently. Whoever came up with the idea that the Turin Shroud could be seen in it? Where might the Shroud have been seen and why would it not have been copied directly in the pictures?. This just seems to be a poor piece of medieval art which is drawing on conventions from more sophisticated works. Christ is just being shown buried in a way that Christians were buried in the Middle Ages and the pattern on the tomb has nothing to do with the weave of the cloth and why would you want to venerate the weave and not the image which could have been put there if the artist had wanted to. It is amazing how some people see things the rest of us can’t!\n\n","date":"June 2, 2012 at 6:42 am","url":"https://shroudstory.com/2012/05/27/jones-on-the-hungarian-pray-manuscript-codex-as-discussed-in-wikipedia/","cat":"art","id":"comment-11796","author":"LyFe","site":"shroudstory"}]
