[{"title":"Lamentation Art","post":"Nice repeat of data most probably taking the date of the Shroud back to the 1st century.\n\n","date":"February 16, 2015 at 7:47 am","url":"https://shroudstory.com/2015/02/16/lamentation-art/","cat":"art","id":"comment-191185","author":"ekmcmahon","site":"shroudstory"},{"title":"Lamentation Art","post":"This is, no doubt unintentionally, a little disingenuous, if I may say so. The words above do not appear in Schiller’s book, although the illustration does. Schiller, in fact, makes no mention of the Shroud of Turin at all. Nor is she so naive as to say that a large Shroud in art was a sudden appearance of the 11th century, as this is clearly not true.\nWhat Schiller does is to trace the first appearance of various scenes leading to the entombment in iconography. The earliest representations, dating from the 9th century, depict the ‘Bearing Of the Body’ (in which the body is invariably shrouded in a long cloth or strips of bandage). Next appears the ‘Entombment’ itself (10th century). Here again, Christ is usually fully shrouded. A century or so later we begin to find the ‘Annointing’ and the ‘Lamentation.’The former, of course, requires an at least partially exposed body, and nearly all the Lamentations I have seen show Christ in a loincoth, lying on a slab or table, which is often covered in a cloth, which may not be a shroud at all.. Schiller says that the origin of this scene, which has no biblical justification, “may derive from funeral customs in east and west.” She is also very conscious of the role that the Easter liturgy, and the paraphernalia associated with it, played in the development of entombment iconography.\n\n","date":"February 16, 2015 at 9:10 am","url":"https://shroudstory.com/2015/02/16/lamentation-art/","cat":"art","id":"comment-191191","author":"Hugh Farey","site":"shroudstory"},{"title":"Lamentation Art","post":"Interesting. We can see here how false quotations, hence bad arguments, spread.\n\n","date":"February 16, 2015 at 9:26 am","url":"https://shroudstory.com/2015/02/16/lamentation-art/","cat":"art","id":"comment-191192","author":"Dan","site":"shroudstory"},{"title":"Lamentation Art","post":"I have added the following text, in red, at the top of this posting:  “Please note: Even though one might get the impression that Gertrud Schiller wrote these words in her book, she did not do so.  No one specifically says she did. But in reading three posting to which links are provided, one could think so.  I did. I stand corrected.”\n\n","date":"February 16, 2015 at 9:49 am","url":"https://shroudstory.com/2015/02/16/lamentation-art/","cat":"art","id":"comment-191196","author":"Dan","site":"shroudstory"},{"title":"Lamentation Art","post":"I take it that the boxed quotes were supplied by editors at the Associates for Biblical Research.  They perpetuate the Wilson hypothesis of the Image of Edessa being the Shroud.  There is a much better candidate, “The Image of God Incarnate” originally the “Image of Camuliana” found there in the 6th c. probably taken there from Antioch by Patriarch Ephraim during the siege by the Persian Chosroes.  Following its discovery in Camuliana, it was paraded around Cappadocia and then taken to Constantinople in 574.  There are several Byzantine references to it, it was modeled for various military palladia, but together with inconoclastic periods and following several military defeats, and a series of continuous earthquakes, the superstitious Byzantines locked it away for some centuries until the unscrupulous emperor Alexios III broke the imperial covenant made with God and opened it (1195-1203).  Hence the observations made by Robert de Clari in 1204. It may even have been the model for the original Image of Edessa and the numerous copies made of it.  It would account for the Justinian 7th century coinage showing a Shroud like facial image of Christ, along with Homs vase image, but which later reverted to a less suffering non-Pantocrator imagery, because of this covenant.  A suffering image of Christ was then evidently deemed unsuitable as a palladium for Byzantine military aspirations.\n\n","date":"February 16, 2015 at 3:15 pm","url":"https://shroudstory.com/2015/02/16/lamentation-art/","cat":"art","id":"comment-191215","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Lamentation Art","post":"They perpetuate the Wilson hypothesis of the Image of Edessa being the Shroud. There is a much better candidate, “The Image of God Incarnate” originally the “Image of Camuliana”\nDave.\nHave you read this? http://www.voltosanto.it/Inglese/paginadx1.php?c=2\nMarkwardt was perhaps one step from the key to the puzzle. Nevertheless -he disregarded it like many others…\n\n","date":"February 16, 2015 at 3:20 pm","url":"https://shroudstory.com/2015/02/16/lamentation-art/","cat":"art","id":"comment-191216","author":"O.K.","site":"shroudstory"},{"title":"Lamentation Art","post":"Thanks Oskar.  It seems that Pfeiffer identifies the Camuliana with the Manoppello, but the ref does not elaborate on why he thought that.  He also notes that the image disappears from Constantinople and somehow ends up in Rome.  This corresponds to the time when Markwardt claims that the Camuliana was hidden away arising from iconoclasm, the defeats and the earthquakes.  \nMarkwardt notes that the Camuliana was the first one to be described as acheiropoietios, “not made by human hands” as stated by Pfeiffer.  He also notes the legends that on its discovery, the Camuliana immediately spawned two copies of itself, and one might therefore speculate that Ephraim may have hidden more than one cloth at Camuliana, one of which might have become Manoppello, if in fact Manoppello is also acheiropoietos, and not a painted copy (not known).      \nMuch is made of the assertion that no-one knows what the “Image of God Incarnate” looked like.  However Markwardt gives a number of clues, beginning at p.37 of his St Louis paper, section ‘Full-length and On-cloth Images of Jesus’: \n1) With regard to its full-length image, first, the “custom of displaying the Redeemer on the Cross…began with the close of the sixth century”; \n2) A full-length crucified Jesus was illustrated in a Syrian Gospel Book dateable to 586, the very year that a copy of the archetypal Image of God Incarnate was displayed on a Byzantine labarum at the Battle of Solachon; \n3) Only an acheiropoietos full-length image of Jesus crucified could have convinced the iconoclastic Eastern Church clergy to countenance, and perhaps even invent, crucifixes and crucifixion images; \n4) Mozarabic Rite of the Visigothic Church of Spain began to recite that “Peter ran to the tomb with John and saw the recent imprints of the dead and risen one on the cloths” (likely written by Bishop Leandro of Seville, who was in Constantinople 579-582);  \n5) Pope Gregory the Great ordered the creation of a tempera painting of a full-length (albeit clothed and non-suffering) Jesus, installed in the Sancta Sanctorum Chapel, and named it the Acheropita, the acheiropoieton (Gregory papal ambassador to Constantinople 579-585).\nNotes that Image of Edessa, never reported to be more than an Image of the face, could not have inspired crucifixes, crucifixion portrayals, a reference to bodily imprints on Jesus’ burial cloth, or the full-length image of Jesus called the Acheropita. … And so on!\n\n","date":"February 16, 2015 at 9:31 pm","url":"https://shroudstory.com/2015/02/16/lamentation-art/","cat":"art","id":"comment-191238","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Lamentation Art","post":"It seems that Pfeiffer identifies the Camuliana with the Manoppello, but the ref does not elaborate on why he thought that.\nIt is not mentioned in this article, but if you read interview with him in Badde, he mentions that the earliest legends concerning Camuliana Image had references to water, that the image was created through the contact with water -that echoes the composition   and transparency of the Manoppello Veil. It is also mentioned by Markwardt (“Pseudo-Zachariah also relates a legend which recites that this linen cloth had been discovered, inexplicably dry, in a garden well located in the Cappadocian village of Camuliana”, pg. 23 of his St. Louis paper http://www.shroud.com/pdfs/stlmarkwardtpaper.pdf ).\nNotes that Image of Edessa, never reported to be more than an Image of the face\nIs that a great problem? Note that there were at least three miraculous images reported in 6th century: the Image of Edessa, the Image of Camuliana, and the Image of Memphis,reported solely by Anonymous Pilgrim of Piacenza. \nThe problem is that Wilson, Markwardt and others always assume that there could have been no more than just one true acheiropoietos (the Shroud).\n\n","date":"February 17, 2015 at 9:22 am","url":"https://shroudstory.com/2015/02/16/lamentation-art/","cat":"art","id":"comment-191275","author":"O.K.","site":"shroudstory"},{"title":"Lamentation Art","post":"Hello Dan,\nAs the author of all four articles “The SOT’s Earlier History …” I am solely responsible for all the main text and picture explanations – not ABR editors or organization leadership. ABR does not have a major interest in the Shroud, being more concerned with archaeology. As an ordinary member of the ABR fellowship I knew many of their readers had at least a passing interest in the SOT; the ABR leadership is open-minded and I am grateful that they provided a means for me to address the Shroud’s pre-15th century history. With many other shroudies around the world I still find Wilson’s basic thesis (tweaked in a couple of areas) the best explanation for its earlier whereabouts. I’ve read Markwardt’s interesting thesis but have not yet studied all its parts in enough detail.\nHugh believes that my picture explanation of Schiller’s illustration #595 is unintentionally misleading. “Unintentionally” is certainly correct. I can clearly remember my aim – I wanted to demonstrate the remarkable resemblances  between the Shroud and art like the Victoria & Albert Museum threnos (crossed hands, missing thumbs, semi-nude, diagonal lines and cloth’s long length – shown later in my article), but didn’t want to suggest that all these 11th -12th cen. lamentation depictions had as many similarities, hence choosing #595 to introduce the point. What I should have done was to have picked one of the earlier (pre-944) examples Hugh mentions and then said “within a hundred years … Byzantine art often transitions away from these earlier “burial preparation” representations to ones having striking similarities to SOT images.” But does that illustration (#595) suggest an influence from the SOT? Wilson still thinks so noting on p.182 of his 2010 book that the mummy wrappings from before the 11th cen. gradually gave way to semi-nudes on a prominent, large cloth. He references Weitzmann’s “The Origin of the Threnos” – and as I review that paper Weitzmann does seem frequently to note mummy-type depictions  before the 11th cen.; he uses Schiller’s #595 (his fig. 10, Constance, Rosgarten Museum) as “An innovation of great consequence … is the nakedness of Christ.” To borrow a phrase from Dan Scavone: Why do these often depicted mummy/cloth strip burials before the 11th cen. suddenly have to make room for ones that look more and more like the Shroud images? \nI have not seen the Shroud Guild’s Facebook page, but I’m amazed at any assertion that I’m making “false quotations” to spread “bad arguments.”  (I’ve probably misunderstood Dan). Of course Schiller did not pose “Why?” – I did.  Nowhere did I credit the picture text to Schiller.  As I view the way pictures and their accompanying text are presented in books and articles, I don’t see why any experienced reader would be confused. (If a scholar like Schiller had discussed the SOT’s possible influence it would be well known in Shroud literature, and inept for any writer to falsify it).  And are the changes (comparing Christ burial art before to that after 944)  really a “bad” argument? I’ll let the readership comb through the art historical books and make up their own minds as to how valid Wilson’s insight was.\nThanks for giving me a chance to reply. – John Long\n\n","date":"February 17, 2015 at 1:12 pm","url":"https://shroudstory.com/2015/02/16/lamentation-art/","cat":"art","id":"comment-191291","author":"John Long","site":"shroudstory"},{"title":"Lamentation Art","post":"Markwardt devotes several pages of his 2014 paper, examining the Wilson Mandylion theory in detail.  One telling argument against it is that the Image of Edessa showed only the face, and it is asserted that its alleged full length images only became known some time after its transfer to Constantinople by John Curcuas in 944.  Nevertheless, soon after the discovery of the Camuliana and its transfer to Constantinople in 574, the iconoclastic Byzantines saw fit to portray upper body icons of Christ, invented crucifixes, used the full image of Christ as palladia and labara, and a full-length crucified Jesus illustrated a Syrian Gospel book in 586.  I’ve itemised some of the particular arguments above.  Because of various set-backs, military and natural, the superstitious Byzantines saw the need to hide and conceal the cloth under an imperial covenant with God, which was only broken late in the 12th century, when the full image was again revealed.  However there is considerable authenticist scholarship invested in the Mandylion theory, and doubtless it will persist, until the stronger merits of the Camuliana hypothesis become more widely accepted.\n\n","date":"February 17, 2015 at 3:39 pm","url":"https://shroudstory.com/2015/02/16/lamentation-art/","cat":"art","id":"comment-191297","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Lamentation Art","post":"One telling argument against it is that the Image of Edessa showed only the face, and it is asserted that its alleged full length images only became known some time after its transfer to Constantinople by John Curcuas in 944. \nStill neither you, nor Markwardt understands the point. I suppose Wilson had understood it (and the threat to his hypotheses) and that’s why he twisted his argumentation in his 1991  Holy faces, Secret places.\nWe can say with very high confidence that the Image of Edessa brought to Constantinople in 944 was actually the Shroud (the more I read confabulated relations in “Story of the Image of Edessa” by Porphyrogenitus, the more convinced I am). \nNevertheless the question remain: was it the same cloth that was brought to King Abgar 900 years before?\nThey say Mandylion showed only the face. Fine, then look for the cloth that shows only the face.\nBecause of various set-backs, military and natural, the superstitious Byzantines saw the need to hide and conceal the cloth under an imperial covenant with God, which was only broken late in the 12th century, when the full image was again revealed. \nI think the reasons were different. Entirely.\n\n","date":"February 17, 2015 at 4:01 pm","url":"https://shroudstory.com/2015/02/16/lamentation-art/","cat":"art","id":"comment-191298","author":"O.K.","site":"shroudstory"},{"title":"Lamentation Art","post":"Oskar, I think it is you who fails to understand the point.  As persistently stated by Yannick from many years ago, there is not one Byzantine scholar who accepts Wilson’s theory, and I have been slow to accept that, until Markwardt’s paper.  As I stated above “there is considerable authenticist scholarship invested in the Mandylion theory, and doubtless it will persist, …” and that is clear enough from your own response.  Nevertheless there are likely links between the Camuliana and the Edessa cloths.  Edessa may have been copied from Camuliana.  You say “Look for the cloth that shows only the face”  That seems to me an inference to the Manoppello, which is not the Shroud.  The Mandylion is reported as being sent to King Louis of France after 1204, and later destroyed during the French Revolution.  The Mandylion was always deemed to be a face, until at least after 944, and yet from after the discovery of Camuliana, we have full length images in illustrations and crucifixes and banners.  I think your reference to the cloth sent to Abgar is naive.  I think Markwardt gives an adequate explanation in his Antioch paper referring to the conversion of Abgar VIII the Great, (not Abgar V), and that may well have been the Shroud which Bishop Avercius Marcellus had temporary custody of from Antioch.  It finds an echo in Bardaisan’s contemporary Hymn of the Pearl.\n\n","date":"February 17, 2015 at 5:20 pm","url":"https://shroudstory.com/2015/02/16/lamentation-art/","cat":"art","id":"comment-191300","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Lamentation Art","post":"Oskar, I think it is you who fails to understand the point. As persistently stated by Yannick from many years ago, there is not one Byzantine scholar who accepts Wilson’s theory, and I have been slow to accept that, until Markwardt’s paper.\nYes. And why should we care about that? As I have shown in this post https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/ those scholars will never go beyond their very limited horizon of their imagination (which they do lack, as well as the basic knowledge of the Shroud, as well as fundamental ability to weight all the facts and draw reasonable and sensible conclusion). \nEdessa may have been copied from Camuliana. \nIs this the only possibility?\n You say “Look for the cloth that shows only the face” That seems to me an inference to the Manoppello, which is not the Shroud.\nYes. But is directly linked to the Shroud, as I have shown in my humble presentation: https://shroudofturin.files.wordpress.com/2014/06/addendum-manopello-shroud-comparison3d.pdf\nThe Mandylion is reported as being sent to King Louis of France after 1204, and later destroyed during the French Revolution.\nWas this the same Mandylion that was brought to Constantinople in 944?\nWas this the same Mandylion that according to the legend was brought to King Abgar circa 30 AD?\nNothing here is that simple as those narrow-minded Byzantine scholars would like to think.\nThe Mandylion was always deemed to be a face\nYes. The question is: why?\nand yet from after the discovery of Camuliana, we have full length images in illustrations and crucifixes and banners.\nThe Camuliana was brought to Constantinople in 574.\nThe Image of Edessa was rediscovered in circa 544 or shortly before.\nSo the connection with Edessa is just as plausible as with Camuliana.\nI think Markwardt gives an adequate explanation in his Antioch paper referring to the conversion of Abgar VIII the Great, (not Abgar V), and that may well have been the Shroud which Bishop Avercius Marcellus had temporary custody of from Antioch. It finds an echo in Bardaisan’s contemporary Hymn of the Pearl.\nMarkwardt does not give facts, only another hypothesis. Which is no better than many other, based on pure speculation without solid evidence.\n\n","date":"February 17, 2015 at 6:22 pm","url":"https://shroudstory.com/2015/02/16/lamentation-art/","cat":"art","id":"comment-191303","author":"O.K.","site":"shroudstory"},{"title":"Lamentation Art","post":"The grounds for claiming that the Image of Edessa was rediscovered in 544 are highly questionable.  The story appears to be a borrowing from when the true Shroud was rediscovered in the walls of Antioch as a consequence of the earthquake there in 544.\nAntioch is the natural apostolic home of the burial cloths.  \nThe Image of Edessa was always only ever claimed to be a face, and remained so until well after 940.  How then could 6th-7th century iconoclastic Byzantines then produce crucifixes, images of the crucifixion, and upper torso icons of Christ, based only on a facial image?  Further there are Byzantine pre-940 references to the Image of God Incarnate, and yet as far as the Byzantines knew, the Edessan cloth was only a face.  It seems to me you would have a stronger case for the Mandylion becoming the Manoppello, which may in fact be your position.  \nIn that case Markwardt’s case for the Camuliana being the true Shroud makes a great deal of sense.  Further his case for the Abgar legend being a coded allegory referring to the conversion of Abgar VIII is a great deal more credible than accepting an improbable legend at face value as literally true, considering the pagan environment of the court of Abgar V Ukkama.\n\n","date":"February 17, 2015 at 11:02 pm","url":"https://shroudstory.com/2015/02/16/lamentation-art/","cat":"art","id":"comment-191311","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Lamentation Art","post":"The grounds for claiming that the Image of Edessa was rediscovered in 544 are highly questionable. The story appears to be a borrowing from when the true Shroud was rediscovered in the walls of Antioch as a consequence of the earthquake there in 544.\nAntioch is the natural apostolic home of the burial cloths. \nDave, I think you take Markwardt’s claims too uncritically. Whatever he states, you take it at face value. While my opinion is that Markwardt’s historical essays -although containing a lot of interesting informations -are based not on solid evidence, but on mere speculations, developed about some minor episodes, developed in quite novelistic fashion.\nThus they cannot be considered without a lot of reservations.\nThere is not a slightest indication, slightest document giving as clue that the Shroud was ever in Antioch. On the other hand we have clear testimonies about Image of Edessa being rediscovered in 6th century. We have good reasons to suppose that it was actually the Shroud (further on).\nThe Image of Edessa was always only ever claimed to be a face, and remained so until well after 940. How then could 6th-7th century iconoclastic Byzantines then produce crucifixes, images of the crucifixion, and upper torso icons of Christ, based only on a facial image? \nUnless perhaps someone knew the true nature of the cloth at that period (memory of which was apparently lost in the iconoclasm period). And I am quite certain that in 944 the Byzantine court knew the true nature of the cloth, but trying to avoid theological scandal, they tried to conceal it.\nBesides, you don’t need to know the whole image to produce crucifixes. They migh have appeared naturally, without the knowledge of the Shroud. \nFurther there are Byzantine pre-940 references to the Image of God Incarnate, and yet as far as the Byzantines knew, the Edessan cloth was only a face.\nAnd there is no indication that the Image of God Incarnate (aka Camuliana, aka Veronica, aka Manoppello, according to Pfeiffer) was anything else but just the face image. Markwardt knew Pfeiffer’s  (and Badde) stance, nevertheless he rejected it, pursuing his own imaginative scenario, and dropping the key element (Manoppello) out of the hands.\nIt seems to me you would have a stronger case for the Mandylion becoming the Manoppello, which may in fact be your position. \nYes. But not exactly. I have stated many times here, that the Mandylion has never been a single object.\nJust look at the propsed routes of both relics, Manoppello and the Shroud:Both cloths are candidates for being the Mandylion. And I believe that both cloths actually were the Mandylion, in different historical periods.\n\n","date":"February 18, 2015 at 5:41 am","url":"https://shroudstory.com/2015/02/16/lamentation-art/","cat":"art","id":"comment-191323","author":"O.K.","site":"shroudstory"},{"title":"Lamentation Art","post":"I do not take Markwardt merely at face value, but he writes with better argument, together with relevant citations (251 in his St Louis paper) than the authors of other papers given undue prominence.  Despite the apostles fleeing Jerusalem after the stoning of Stephen, and Peter founding the Antioch church, you presume that they left the burial cloths behind in Jerusalem, even though there are early references claiming that they were kept by Peter.  \nThe Mandylion was claimed to be “painted in choice colours” which does not fit a description of the Shroud image, and as yet there are no grounds for presuming that the Manoppello is anything but a painted image.  On the other hand the Camuliana is the very first image that is described as “acheiropoiteios”.  I recall that Scavone (still apparently a supporter of the Mandylion theory) gives citations indicating that the “Image of God Incarnate” did include a body image, but fails to recognise that this cannot apply to the Mandylion.  Markwardt examines Wilson’s Mandylion theory in considerable detail, and identifies the reasons why it cannot be sustained.  \nAfter attending to securing the church in Antioch against Chosroes, Bishop Ephraim suddenly departed on a mission to Cappadocia when he might have been expected to stay and rally the populace.  On his return to Antioch this is not held against him but he continues in his role as Patriarch, it must have been an exceedingly important mission.  \nIf the Shroud is the true burial cloth of Christ, then clearly it had be in existence somewhere at this time, and the Camuliana would seem to be the best candidate.   \nAs you would know and have sometimes posted, the Abgar legend was rewritten on a number of occasions, doubtless sometimes garbled from what the Scribe had thought he had heard, and doubtless to suit current local agendas, even to borrowing tales which had actually occurred elsewhere.  \nI suggest that you endeavour to read again Markwardt’s three conference papers on the history of the Shroud in detail including the citations, “Ancient Edessa and the Shroud”, “Antioch and the Shroud”, “Modern Scholarship and the Shroud”,  setting aside any preconceived ideas, and see if you can come to a better conclusion.\n\n","date":"February 18, 2015 at 3:24 pm","url":"https://shroudstory.com/2015/02/16/lamentation-art/","cat":"art","id":"comment-191339","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Lamentation Art","post":"Daveb:\n“I recall that Scavone (still apparently a supporter of the Mandylion theory) gives citations indicating that the “Image of God Incarnate” did include a body image,…”\nDo you have any reference?\n\n","date":"February 18, 2015 at 7:15 pm","url":"https://shroudstory.com/2015/02/16/lamentation-art/","cat":"art","id":"comment-191356","author":"Henrik","site":"shroudstory"},{"title":"Lamentation Art","post":"Henrik, The reference I have in mind is “CHAPTER I.   Acheiropoietos Jesus Images in Constantinople:  the Documentary Evidence” by Daniel C. Scavone.  The ref underwent several updates, but I believe can now be found at: http://www.sindonology.org/scavone-acheiropoietos.pdf  \nScavone’s Document IV refers to a letter of Constantine VII to his troops in 958.  The particular relic is variously described as The Image of Camuliana,  The Image of God Incarnate, and the Garment that God wore.  \nScavone’s full paper is a heavy read, but is well worthwhile for those interested in the evidence.  Scavone of course identifies it with the Mandylion. \nHowever Markwardt in his recent paper also refers to similar incidents occurring in the 6th-7th c. when Christ’s image was used for military palladia, and showed at least the upper torso.  \nI recommend a close study of Scavone’s paper.  Subsequently he wrote a much briefer conference paper on the same topic, but you need to see the “Documentary Evidence paper.\n\n","date":"February 19, 2015 at 3:31 am","url":"https://shroudstory.com/2015/02/16/lamentation-art/","cat":"art","id":"comment-191368","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Lamentation Art","post":"Thanks, I will take a look at this.\n\n","date":"February 19, 2015 at 6:55 pm","url":"https://shroudstory.com/2015/02/16/lamentation-art/","cat":"art","id":"comment-191407","author":"Henrik","site":"shroudstory"},{"title":"Lamentation Art","post":"Hi John,\nGood of you to write. I felt that the Shroud Guild’s Facebook selection (not your fault) from your History somewhat exacerbated an impression that Gertrud Schiller, whose eminence in Christian iconography is undisputed, endorsed the idea that its evolution may have been in part derived from the ‘sudden’ appearance of the Shroud after centuries of obscurity, which she didn’t.\nSchiller did have ideas, but I have to say that she does not express them very clearly and her oeuvre is much more descriptive than explanatory. Essentially I think she sees the expanding liturgy as the prime mover, with the Anointment and Lamentation scenes (scenes particularly associated nowadays with the Shroud) being relatively late comers both liturgically and artistically. The Lamentation in art seems to have begun life at the foot of the Cross, before the body was enshrouded, and the Anointment seems to have begun just outside the tomb, necessitating at least a partial unwrapping. Later the sites of these scenes became both less well defined and more confused with each other, but I think that between them they account for the arrival of the uncovered body without the necessity of the sudden discovery of the Shroud. Sadly Schiller’s Volume 3, which covers the Resurrection and subsequent events, has not been published in English, but as we have examined in some detail on this site, the Three Marys scene, another particularly associated with the Shroud, shows a continuous development, without any surprises, from the 5th century or so onwards.\nIn order to justify an influence on art of the Shroud, we really need to specify a date of revelation and what, precisely, was revealed (just the head? just one body? both bodies?). I don’t think this has been sufficiently defined, but if it ever were, I don’t believe that a comprehensive review of paintings and sculptures before and after that watershed would be sufficiently distinctive to justify it. If the arrival of the Mandylion in Constantinople in 944 is taken as the start point, then that presupposes that the Mandylion and the Shroud were the same, which is by no means generally accepted.\nOh, and by ‘bad argument’, I’m sure Dan was not being rude. I think he was using the word technically, to mean ‘unjustified.’ Misattributions (or misquotations) do not lead to sound conclusions.\n\n","date":"February 18, 2015 at 9:30 am","url":"https://shroudstory.com/2015/02/16/lamentation-art/","cat":"art","id":"comment-191331","author":"Hugh Farey","site":"shroudstory"},{"title":"Lamentation Art","post":"DaveB:\nI am terribly sorry to say so, but your are WRONG, on several issues. \nScavone’s Document IV refers to a letter of Constantine VII to his troops in 958. The particular relic is variously described as The Image of Camuliana, The Image of God Incarnate, and the Garment that God wore. \nThere is no reference at all to link the Image of Camuliana with theofórou sindónos. Scavone does not write about that! Furthermore, there is also no indication that Image of Camuliana contained something else but the face. \nThe Mandylion was claimed to be “painted in choice colours” which does not fit a description of the Shroud image, and as yet there are no grounds for presuming that the Manoppello is anything but a painted image.\nOh, really? Have you read this? http://manoppello.eu/eng/index.php?go=badania Have you checked my paper: https://shroudofturin.files.wordpress.com/2014/06/addendum-manopello-shroud-comparison3d.pdf\nWhere is the paint? No matter it looks like being “painted in choice colours”, it is not a painting made by any technique we know. How do you explain the correspondence with the Shroud?\n There are serious grounds to consider it acheiropoietos, just like the Shroud.\nHowever Markwardt in his recent paper also refers to similar incidents occurring in the 6th-7th c. when Christ’s image was used for military palladia, and showed at least the upper torso. \nDocumentary evidence, please. Markwardt’s speculations does not interest me. \nI recall that Scavone (still apparently a supporter of the Mandylion theory) gives citations indicating that the “Image of God Incarnate” did include a body image, but fails to recognise that this cannot apply to the Mandylion.\nThere are no such citations in Scavone’s paper you linked. \nAfter attending to securing the church in Antioch against Chosroes, Bishop Ephraim suddenly departed on a mission to Cappadocia when he might have been expected to stay and rally the populace. On his return to Antioch this is not held against him but he continues in his role as Patriarch, it must have been an exceedingly important mission. \nIt does not prove anything.\nI suggest that you endeavour to read again Markwardt’s three conference papers on the history of the Shroud in detail including the citations, “Ancient Edessa and the Shroud”, “Antioch and the Shroud”, “Modern Scholarship and the Shroud”, setting aside any preconceived ideas, and see if you can come to a better conclusion.\nI have read them. And there are no arguments there that would convince me that Markwardt’s heories are anything more than speculations at best, if not just historical novels.\nMarkwardt examines Wilson’s Mandylion theory in considerable detail, and identifies the reasons why it cannot be sustained. \nThe only reasons why it cannot be sustained, are conformism and cowardice of those so called ‘historians” who are not ready to admit that it may be (and probably is in general account) true. That’s why they invent thousands of really trivial problems, just to debunk it at all cost. \nYou know what -I must truly say this, even if it may sound brutal. You are really uncritical about Markwardt.  You blindly accept whatever he says, but most of his papers are in fact, nothing else but mere speculations without solid evidence, although presented in a nice way. When you look at them with a more critical eye, you will see that they actually add little to our direct knowledge of the Shroud. The number of citations does not reflect the actual value of the paper, really -it may even be used to mask actual low content of the article.\nMarkwardt actually copied most of his recent ideas from Pfeiffer, (often through Badde books). Yet -what is sad, he seemed to be too much opportunistic to follow Pfeiffeir’s ideas. As frustrated Badde writes, there seems to be some fierce opposition against Manoppello, even among (or perhaps especially) Shroud scholars. They are afraid of another “miraculous image” on the horizon.\n\n","date":"February 19, 2015 at 8:12 am","url":"https://shroudstory.com/2015/02/16/lamentation-art/","cat":"art","id":"comment-191380","author":"O.K.","site":"shroudstory"},{"title":"Lamentation Art","post":"Thanks Hugh – I appreciate your comments and don’t think Dan was being rude. I continue to enjoy his blog each day. The question of the Shroud’s earlier history is a gigantic puzzle, with all of us trying to fit the peices together in the most convincing whole.  I do understand your  “arrival of the uncovered body without the necessity of the sudden discovery of the Shroud” judgement, but when that uncovered body continues to morph into something like the V&A depiction, I can’t help but feel  a recent aquisition of the Shroud had something to do with it. Thanks again – John Long\n\n","date":"February 19, 2015 at 2:41 pm","url":"https://shroudstory.com/2015/02/16/lamentation-art/","cat":"art","id":"comment-191393","author":"John Long","site":"shroudstory"}]
