[{"title":"Did Leonardo da Vinci Accidentally Invent 3D Pictures","post":"Interesting to know he painted another one from a different perspective., but  doesn’t really compare to the shroud. We already know from Mario’s Shroudscope that “The depth map is typically produced by hand or by using a second photograph that was taken with a different angle when the main photograph was taken. In the case of the Enrie Vertical 3D Photograph of the Shroud Scope, the depth map is the image itself. It is very rare that a regular photograph can be used that way.”\n\n","date":"May 2, 2014 at 6:38 am","url":"https://shroudstory.com/2014/05/02/did-leonardo-da-vinci-accidentally-invent-3d-pictures/","cat":"art","id":"comment-108727","author":"Mike M","site":"shroudstory"},{"title":"Did Leonardo da Vinci Accidentally Invent 3D Pictures","post":"And beyond :\nMario Latendresse has created the second photograph of his anaglyph according to arbitrary parameters.\n“depth map” on the shroud is isotropic, no perspective, and it’s “the fuzzier the further” and not necessarily “the brighter the closer” as used in his second photograph.\n\n","date":"May 2, 2014 at 1:49 pm","url":"https://shroudstory.com/2014/05/02/did-leonardo-da-vinci-accidentally-invent-3d-pictures/","cat":"art","id":"comment-109000","author":"anoxie","site":"shroudstory"},{"title":"Did Leonardo da Vinci Accidentally Invent 3D Pictures","post":"Anoxie wrote: “Mario Latendresse has created the second photograph of his anaglyph according to arbitrary parameters.” \nSorry, but this statement is false. \nBy “second photograph”, I assume that you are referring to the “depth map”. As explained on the Help Shroud Scope web page, the two photographs used to generate the anaglyph are exactly the same photograph coming from Enrie. No modifications were applied to the Enrie photograph to get a depth map.\nOf course, the anaglyph was created using a parameter, but that is a basic requirement to generate the anaglyph itself and a large range of values for this parameter produce essentially the same result. In other words, the parameter needed is not essential, nor unique.\nAnoxie also wrote: ““depth map” on the shroud is isotropic, no perspective, and it’s “the fuzzier the further” and not necessarily “the brighter the closer” as used in his second photograph.”.  \nSorry, but this statement is also false.\nA “depth map” has nothing to do with isotropy and the depth map does represent a relation between distance and brightness demonstrated by the anaglyph itself.\n\n","date":"May 2, 2014 at 6:48 pm","url":"https://shroudstory.com/2014/05/02/did-leonardo-da-vinci-accidentally-invent-3d-pictures/","cat":"art","id":"comment-109193","author":"Mario Latendresse","site":"shroudstory"},{"title":"Did Leonardo da Vinci Accidentally Invent 3D Pictures","post":"Basically i meant you don’t know how the 3d is encoded on the shroud, you are assuming “facts”.\nIf you use the vp8, you can see “3d”, it does’t mean you.ve deciphered the way cloth body distance is encoded.\nYou write : a “depth map” has nothing to do with isotropy\nOnce again, you create an artificial depth map to generate your anaglyph. To do so you use an horizontal shift (stereoscopic vision required by the anaglyph) but contrary to the example of this post (the two mona lisa) you don’t know under which perspective you should look at the shroud (left right, oblique, upside down).\nYou write : the parameter needed is not essential, nor unique\nWell, to create a subjective 3d vision.\nTo put science in a “depth map” one has to have a scientific model. I’m right, not asking, not dogmatic.\n\n","date":"May 3, 2014 at 12:51 am","url":"https://shroudstory.com/2014/05/02/did-leonardo-da-vinci-accidentally-invent-3d-pictures/","cat":"art","id":"comment-109451","author":"anoxie","site":"shroudstory"}]
