[{"title":"Maybe the Nails Didn’t Go Through the Wrists","post":"I have only responded on the site a few times.  I’m the guy who was told by my Guardian Angel that I was looking at the Image of the Living Jesus Christ.  I also said in one of the posts that I was happy (should have said impressed) to see the blood stain in the wrist.  To my eyes, the stain is located just below where the hand bones are located.  If you place your hand down, palm up, and press oh the bones there in the wrist bone area – the thumb has a tendency to draw inwards towards the palm.  This is just as the left wrist and hand that is visible in the photo of the Shroud.\n\n","date":"February 25, 2015 at 6:12 am","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","id":"comment-191793","author":"Emmett McMahon","site":"shroudstory"},{"title":"Maybe the Nails Didn’t Go Through the Wrists","post":" \nLos únicos trabajos que se hicieron incluyendo la experimentación (sobre 12 brazos recién amputados), las radiografías y la disección fueron los del cirujano Pierre Barbet, posteriormente repetidos y corroborados con iguales resultados por Doménico Tarantini, cirujano del “Ospedal Generale di Trani”.\n“J’ai mesuré, sur ces photographies et sur d’autres clichés directs de dimensions cotées, la distance entre le trou et la tête du troisième métacarpien : elle dépasse un peu huit centimètres.”\nSobre la mano de Hugh muestro la situación aproximada que tendría el punto de salida de un supuesto clavo atravesando el espacio de Destot en la muñeca (wrist), a 8 cm de distancia de la cabeza del tercer metacarpiano\nCarlos\n\n","date":"February 25, 2015 at 7:44 am","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","id":"comment-191795","author":"Carlos","site":"shroudstory"},{"title":"Maybe the Nails Didn’t Go Through the Wrists","post":"Google says that Carlos said:\nThe only jobs that were done including experimentation (of 12 new amputees arms), radiographs and dissection were the surgeon Pierre Barbet, subsequently repeated and corroborated with equal results by Domenico Tarantini, surgeon “Ospedal Generale di Trani”.\n“I measured on these photographs and other direct shots of listed dimensions, the distance between the hole and the head of the third metacarpal, but goes beyond just eight centimeters.”\nOn the hand of Hugh I show the approximate location that would point out a nail course through space Destot wrist (wrist), 8 cm from the head of the third metacarpal\n\n","date":"February 25, 2015 at 8:21 am","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","id":"comment-191799","author":"Dan","site":"shroudstory"},{"title":"Maybe the Nails Didn’t Go Through the Wrists","post":"“Approximations”, “correction factors”, “adjustments”, “my hands are smaller/larger”…Has anyone tried these types of measurements using the other hand of the TS man as an internal  standard? Are both hands exactly equivalent?  Or is it difficult because a portion of the one hand is masked and the other one is curved, making it hard to tell exactly where the wrist begins or tips of the fingers lie?  If so, then…Simply looking at the image in the positive or negative version on photographs or apps, the bloodstain appears more toward the wrist than the hand, certainly the center of the palm, at least to me.  But maybe that’s much too simplified…wonder how that group of kids that was surveyed on the holes in the Pray Codex would vote on this one?  Gotta run, don’t have that much time on my hands, er wrists\n\n","date":"February 25, 2015 at 8:53 am","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","id":"comment-191801","author":"Kelly Kearse","site":"shroudstory"},{"title":"Maybe the Nails Didn’t Go Through the Wrists","post":"Every time I look at the Shroud image I see a wound that is at the lower end of the palm and extending to the top edge of the wrist. Could the answer to palm vs wrist simply be ‘both’. It’s not that great a distance between the two and (if one believes the image is of a crucified victim) wouldn’t we expect a wound widened by the force of gravity, muscular spasms and then removal of the corpse? I certainly wouldn’t expect a nice clean, surgical wound.\n\n","date":"February 25, 2015 at 9:31 am","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","id":"comment-191807","author":"David Goulet","site":"shroudstory"},{"title":"Maybe the Nails Didn’t Go Through the Wrists","post":"Good point! As is often the case the truth may lie in the “in between” area….\n\n","date":"February 25, 2015 at 2:02 pm","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","id":"comment-191823","author":"Thomas","site":"shroudstory"},{"title":"Maybe the Nails Didn’t Go Through the Wrists","post":"When I look at the left hand of the Man of the Shroud I see no clear outlines of the distal phalanges of the four fingers because perhaps they are in partially flexed position, and if this is true, as it seems from Dr. Petrus Soons Hologram of the Man of the Shroud, distal extremities of the fingers are farther away from the covering sheet than more proximal carpal área.\nAnyway the image is not a radiograph and can not be compared to a plain wrist/hand X-Ray so any measurements done on it are but approximative.\nNevertheless if I draw a line in correspondence to the axis of the fourth metacarpal bone the exit nail wound is quite near to it in the medial carpal área possibly on the so called Destot’s space(between the lunatum, triquetrum capitatum and hamatum bones) as described by Dr. Pierre Barbet.\nThus I think that from an anatomical point of view, nothing contradicts the hypothesis of the exit wound be on the carpal área.\n                                                                         regards\n                                                               Antero de Frias Moreira\n                                                       (Centro Português de Sindonologia)\n\n","date":"February 25, 2015 at 12:11 pm","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","id":"comment-191813","author":"Antero de Frias Moreira","site":"shroudstory"},{"title":"Maybe the Nails Didn’t Go Through the Wrists","post":"We really do need pictures here, don’t we? Carlos has lined up a bump on my hand with the end of the ulna (with a long thin rectangle), and we see the Space of Destot about a centimetre further forward. It is still about a centimetre behind any of my possible wound sites,  showing that Barbet was wrong (as Dr Zugibe also described). However, the situation is actually worse than that, as the bump in my hand is not the end of the ulna, but the pisciform carpal, and the Space of Destot even further up the arm. The three possible wound sites are thus well within the metacarpal area.\nAnd, sadly, Kelly, the image of the other hand is rather deformed and it is impossible to get sensible measurements off it.\n\n","date":"February 25, 2015 at 12:44 pm","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","id":"comment-191816","author":"Hugh Farey","site":"shroudstory"},{"title":"Maybe the Nails Didn’t Go Through the Wrists","post":"Con “chichón o sin “chichón” mi supuesto es correcto y el rectángulo inferior marca la ARTICULACIÓN “RADIOCARPAL” en donde se inicia la muñeca, no (negación) el cúbito que para las mediciones es AQUÍ INDIFERENTE. Mi error ha sido el no prolongar el rectángulo sobre su mano creyendo que usted lo entendería.\nSus puntos N1 N2 están en el carpo, en la muñeca (wrist) y su punto N3 está a más de 2cm del espacio de Destot.\nCarlos\n\n","date":"February 25, 2015 at 2:59 pm","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","id":"comment-191826","author":"Carlos","site":"shroudstory"},{"title":"Maybe the Nails Didn’t Go Through the Wrists","post":"Google says Carlos said:\nWith “bump or without” bump “my assumption is correct and the bottom rectangle marks the JOINT” radiocarpal “where the wrist, no (negation) ulna as for measurements is HERE INDIFERENTE starts. My mistake was not to prolong the rectangle over your hand believing that you would understand.\nYour points N1 N2 are in the carpal, wrist (wrist) and point N3 is more than 2cm space Destot.\nCarlos\n\n","date":"February 25, 2015 at 3:42 pm","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","id":"comment-191829","author":"Dan","site":"shroudstory"},{"title":"Maybe the Nails Didn’t Go Through the Wrists","post":"When I measure from what looks like the major knuckles on the middle finger to the centre of the “wound” on Shroud Scope, I get 54mm. When I measure the same distance on my own hand, the wound is almost in the middle of the back of the hand, nowhere near the wrist.\n\n","date":"February 25, 2015 at 1:01 pm","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","id":"comment-191818","author":"ChrisB","site":"shroudstory"},{"title":"Maybe the Nails Didn’t Go Through the Wrists","post":"Imagine a man with a brush who put a stain “circa” where painters of his day put it. He would be amused in learning of your discussions.\n\n","date":"February 25, 2015 at 1:07 pm","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","id":"comment-191819","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Maybe the Nails Didn’t Go Through the Wrists","post":"Hugh wrote: “the image of the other hand is rather deformed and it is impossible to get sensible measurements off it.” \nActually both hand images are relatively deformed (one more than the other). \nRe complex geometry and volumetric bloodied body image resulting partially recorded on a planar surface (once the cloth removed and seen totally unfolded), now WHAT IF the TS man’s hand volumetric images had been recorded first when the linen cloth was moistened with a watery solution, taut lengthwise, compressed widthwise (with outer shorter and/or longer dry shrouds) and then when it got sort of taut again while slightly shrinking via drying out procedure*? \n(*fumigation of the body resting on his side and in extra height on two stones/piles of bags; a burial procedure carried out in the funeral antechamber prior to placing the body in the funeral chamber strictly speaking) \nReminder for Hugh et al: the TS figure does satisfy the geometric conditions of contact-AND-gradual/slight-loss-of contact formation (implying at least two slightly different body-to-cloth configurations).   \nBesides, shouldn’t the hand images appear somewhat deformed (e.g. with elongated fingers) if we take into account the real possibility for the TS man’s arms to have been forced from adduction to abduction to counteract rigor mortis? It could have resulted in the hands while exerting some increasing pressure, slightly raising up and slipping on the inner side of the burial cloth as the latter got sort of taut again lengthwise while still compressed widthwise by means of outer shorter and/or longer dry shrouds. Whence, the hand image deformation could be the result of  this hand-to-cloth pressure increase during drying/purifying procedure. Indeed the hand images’ X-ray-like recording implies body-to-cloth very strong pressure at hand level, which you’ve totally overlooked notwithstanding your self-proclaimed “openness to experimentation”.\n\n","date":"February 25, 2015 at 1:36 pm","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","id":"comment-191820","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Maybe the Nails Didn’t Go Through the Wrists","post":"And although the fire marks have now obliterated this, every depiction of the Shroud from the Lirey Pilgrim badge on, shows the elbows of the dorsal image either lying alongside the back, or more usually with a gap. And as you will see from tryIng this lying down you cannot even reach the palms of the hands to cross them front let alone the wrists. Whenever I bring  this up in lectures it causes great amazement as there is an assumption that the two body images must match each other.\n\n","date":"February 25, 2015 at 1:43 pm","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","id":"comment-191821","author":"Charles Freeman","site":"shroudstory"},{"title":"Maybe the Nails Didn’t Go Through the Wrists","post":"From the discussion in the ‘Very Disturbing’ topic.\nThese are the ShroudScope measurements of the Shroud hand:\nSummary: the lenght from the end of proximal phalanges to the basis of the knuckles + from the basis of the knuckles to the centre of the wound where the nail exited (which is very clearly marked by the dark spot on negative!) is around 11 cm.\nHere is the photo my hand:\n\nThe corresponding distance is exactly 11 cm as well (check the ruler). The begining of the scale is in the presumed nail exit, and it is clearly in the wrist.\nConclusion: as my hand seems to correspond closely to the hand of the Shroud Man, and the distance of 11 cm from the end of mine finger joints leads to the wrist (one example is enough to demonstrate that), we can say that the nail exit is in the wrist just as both the look on the Shroud and forensic analysis indicate.\nThe probable location of the nail exit is one of those proposed by Zugibe ( http://www.shroud.com/zugibe.htm ) so either the space between navicular, lunate, greater multangular and capitate bones, or so called Z-area.\nEnd of discussion.\n\n","date":"February 25, 2015 at 1:48 pm","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","id":"comment-191822","author":"O.K.","site":"shroudstory"},{"title":"Maybe the Nails Didn’t Go Through the Wrists","post":"As I stated repeatedly on the earlier thread on this topic (Very Disturbing), there are several excellent reasons why attempts at measuring from the “tips of the fingers” are doomed to fail at any attempt to locate the position of the wrist wound.  But both Hugh and OK continue to play their silly game.  I mentioned: variability of hand sizes, the presumption of co-planarity of the hand and cloth, and the assumption that the tips of the fingers had in fact imaged onto the cloth.  \nIf the cloth was rumpled at the location of the hands then that image would be distorted, and the hands would then appear to be longer than actual.  \nConsidering the location of the hands, there is an excellent post-mortem reason why the cloth should be rumpled in this area.  Those with less imagination may be informed by discreet enquiries to any mortuary worker who will be well acquainted with this common phenomenon in male cadavers. \nThe best way of locating the position of the wound is at the wound site itself, using a sufficiently clear image of the outline of the hands.  It may be noted there that the blood smear of the wound extends from where the metacarpals of the thumb and fifth finger converge at the wrist carpals to just beyond the junction with the radius and ulnar.  If you can’t see it, then you need a better image.\n\n","date":"February 25, 2015 at 2:35 pm","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","id":"comment-191824","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Maybe the Nails Didn’t Go Through the Wrists","post":"If the cloth was rumpled at the location of the hands then that image would be distorted, and the hands would then appear to be longer than actual. \nDave, I can assure you that the cloth was not rumpled and was tightly lying  over the hands, following their shape. Just look at the intensity of the image, which is more less constant in the hands area:\n\nHad the cloth been rumpled, or not parallel to the hand (which is the case for finger endings), there would be drop or modulation in intensity. But this is not the case here.\nActually you can determine the shape and dimensions of hands very precisely if you take effort to make very precise measurements, and use imagination a little bit. That’s how this work is done.\nThe best way of locating the position of the wound is at the wound site itself, using a sufficiently clear image of the outline of the hands. It may be noted there that the blood smear of the wound extends from where the metacarpals of the thumb and fifth finger converge at the wrist carpals to just beyond the junction with the radius and ulnar. If you can’t see it, then you need a better image.\nThe image is clear enough. And this method confirms measurements. The nail exit is in the wrist, in either of the positions indicated by Zugibe. Read his descriptions very carefully:\nhttp://www.shroud.com/zugibe.htm\n\n","date":"February 25, 2015 at 4:28 pm","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","id":"comment-191831","author":"O.K.","site":"shroudstory"},{"title":"Maybe the Nails Didn’t Go Through the Wrists","post":"OK ,You don’t need to tell me to read Zugibe, His is only one interpretation.   I think he failed with his arm tension conclusions, I’ve already said why. \nYou don’t know if the cloth in that location was rumpled or not.  You don’t know if it was rumpled or not at the time the image formed.  If it wasn’t rumpled, then it ought to have been.  Ask any mortician. He can tell you why!\n\n","date":"February 25, 2015 at 6:51 pm","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","id":"comment-191840","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Maybe the Nails Didn’t Go Through the Wrists","post":"I am agreeing with Daveb.\nAs Image on TS is a negative image, you need special knowledge and skills to work with it. But the negative of the photograpgh (or positive image of the TS) taken by Mr. Secondo Pia,  give us more detail information of the hand wounds. It clearly show that nail went through the wrist area rather than the middle of the palm.\n\n","date":"February 25, 2015 at 5:30 pm","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","id":"comment-191836","author":"Sampath Fernando","site":"shroudstory"},{"title":"Maybe the Nails Didn’t Go Through the Wrists","post":"No, Carlos. I agree that the length under discussion is about 11cm, and that 11cm on the Shroud goes from the end of the phalanx to the wound, and that the 11cm on your hand goes from the end of the phalanx to the wrist. However, your hand is considerably smaller that than that of the Shroud man, as I showed in my own comparison of it. I do not believe that the knuckle of the finger under the ruler is under the 60cm mark (compare it to the knuckle of the thumb as a quick comparison). If, as I showed earlier, I enlarge your hand so that your phalanges match the Shroud’s phalanges, the wound is now more in the metacarpal than the carpal zone.\nAnd daveb, everything you have said about the medial and distal phalanges, and the tips of the fingers, is perfectly correct. They are difficult to see, possibly because they were not in contact with the cloth, and maybe the cloth was orthogonal to their plane. They are impossible to measure. That is why is have not mentioned them at all in my comments or calculations until this very moment.\nAnd yes, the wound does look as if it is in the wrist. I do not think that the generations of scholars who have supposed it to be in the wrist were blind or stupid. It does look as if the hand narrows at that point, just as hands do narrow at the attachment to the arms. However, the measurements suggest that our perception is faulty at this point. Just above the blood stain is a severe crease, and a deceptive line of blood which appears to define the edge of the arm, but actually doesn’t. This is my take on the actual outline of the arm:\nhttp://imgur.com/FaYARPG.\nAnd yes, hands do vary in size (which is why they have to be scaled for comparison), and to a certain extent, in proportion, but the metacarpals are invariably considerably longer than their proximal phalanges.\n\n","date":"February 25, 2015 at 4:29 pm","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","id":"comment-191832","author":"Hugh Farey","site":"shroudstory"},{"title":"Maybe the Nails Didn’t Go Through the Wrists","post":"“And yes, the wound does look as if it is in the wrist. I do not think that the generations of scholars who have supposed it to be in the wrist were blind or stupid.”  Thank you, Hugh.  Now you and OK can put your scaling rulers back in their case where they belong.\n\n","date":"February 25, 2015 at 6:54 pm","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","id":"comment-191842","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Maybe the Nails Didn’t Go Through the Wrists","post":"Here is the link: http://i.imgur.com/FaYARPG.png\n\n","date":"February 25, 2015 at 6:52 pm","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","id":"comment-191841","author":"Hugh Farey","site":"shroudstory"},{"title":"Maybe the Nails Didn’t Go Through the Wrists","post":"I consider the interpretation of the linked Durante image faulty.  The crease mentioned is quite minor, nor does the blood trickle detract from the plainness of the true location of the wound on the wrist, as clearly shown on the superior imagery of the Enrie negatives, more particularly so upon zooming.  The result is plain to see.  I’ve already given several reason why measuring of distances in this area is likely to result in faulty interpretations.\n\n","date":"February 26, 2015 at 5:13 am","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","id":"comment-191866","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Maybe the Nails Didn’t Go Through the Wrists","post":"Hugh, I’d like you very much to EXACTLY locate the nail exit wound in the left hand and highlight its precise edges.\n\n","date":"February 26, 2015 at 11:06 am","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","id":"comment-191897","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Maybe the Nails Didn’t Go Through the Wrists","post":"Image processing can lead to serious errors, including those images published in peer-reviewed journals.\n\n","date":"February 25, 2015 at 7:07 pm","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","id":"comment-191844","author":"Louis","site":"shroudstory"},{"title":"Maybe the Nails Didn’t Go Through the Wrists","post":"Interesting that we are hotly debating where the nail wound is…and not “is there a nail wound”. If this is a bas relief work, would we even be having the discussion?\n\n","date":"February 26, 2015 at 9:38 am","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","id":"comment-191888","author":"David Goulet","site":"shroudstory"},{"title":"Maybe the Nails Didn’t Go Through the Wrists","post":"Max, and DavidG, you both make a similar point in different ways. I cannot identify the exact point of the nail wound because there isn’t one. There is a big oval mark (my N2) but it does not seem to be directly associated with any flow. Then above it there is the end of a distinct trickle (N1), but the trickle does not seem to be associated with the oval mark below. Between these, and a little further out from the thumb is a third mark, a sort of irregular sigmoid, one end of which could also be the wound site (N3). Curiously, between these three there is a tiny spot where the cloth is completely unmarked.\n\n","date":"February 26, 2015 at 12:59 pm","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","id":"comment-191905","author":"Hugh Farey","site":"shroudstory"},{"title":"Maybe the Nails Didn’t Go Through the Wrists","post":"So if this is a bas relief, any guess as to how the ‘wounds’ were made?\n\n","date":"February 26, 2015 at 1:36 pm","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","id":"comment-191907","author":"David Goulet","site":"shroudstory"},{"title":"Maybe the Nails Didn’t Go Through the Wrists","post":"If the blood was deliberately added to the shroud to impart verisimilitude, I would say that it had been trickled on with some kind of pipette. The flows on the hair, the arms, from the chest and across the back all show similar characteristics – the trickles are roughly the same width, density and zigzag with a similar regularity (although I confess I have not done detailed measurements on them, it’s just how it seems to me), suggesting that they were all applied more or less at the same time by the same person in the same way.\nOf course, if the Shroud is genuine then the blood arrived in a different way – or, fairly obviously, in different ways. Some appears to have been a flow from a living person, which dried on the body but when remoistened made a contact with the cloth, some may have seeped directly from the dead body onto the cloth from an open wound, and some may have simply been contact stains from moist excoriations or abrasions. I do not know how different these methods of transfer should look, but suspect that it should be more apparent in the final appearance than it actually is.\n\n","date":"February 26, 2015 at 2:32 pm","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","id":"comment-191916","author":"Hugh Farey","site":"shroudstory"},{"title":"Maybe the Nails Didn’t Go Through the Wrists","post":"Unlike other paintings, no one can explain how the (negative) image of a person got printed on the Turin Shroud.  In 14th centuary no one knew how to produce a negative of a photopraph. Although many people are trying to explain the image using their expertise still no one managed to give us a reasonble explaination.\nTS image is a negative of a photograph.  No one can deny that.\nDue to the complex nature of the image of TS, I don’t think noone will be able to give a explaination how the negative image got printed in near future as well.\n\n","date":"February 26, 2015 at 7:27 pm","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","id":"comment-191927","author":"Sampath Fernando","site":"shroudstory"},{"title":"Maybe the Nails Didn’t Go Through the Wrists","post":"Fernando wrote: “Due to the complex nature of the image of TS, I don’t think noone will be able to give a explaination how the negative image got printed in near future as well.”\nActually, I have been able to give one that can account for all the TS image OBJECTIVE characteristics.\n\n","date":"March 2, 2015 at 3:35 am","url":"https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/","cat":"art","id":"comment-192154","author":"Max patrick Hamon","site":"shroudstory"}]
