[{"title":"More from Fanti on the skewed nose","post":"Dan, Giulio and all, \nJust because the issue did pique my curiosity, I will write up a paper on the skewed nose as the accidental characteristic, associated with a couple of others, could make crucial evidence Justinian II ‘s Solidus obverse Christ face was directly copied by a Byzantine engraver/sculptor from “the TS face IN CONJUNCTION with the Manoppello Veil”.\nI have much higher quality photographic TS face-MV face overlaps by Sister Blandina Paschalis Schlömer OCSO that can make my point even clearer (for those who have eyes but still cannot see ;-) ). I can also even prove beyond any rational doubt that the numismatic skewed nose is neither a minting error nor a damage impact not to mention the obvious fact that  neither the doubled-stranded quiff of hair nor the skewed nose are features “directly” borrowed to pre-7th century CE Pantocrator Christ type (as some YC blogger here most wrongly contends).\nStay atune! (BTW, thank you Dan for publishing my “flash 1st draft” on the skewed nose)\n\n","date":"October 26, 2012 at 8:19 am","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18327","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"More from Fanti on the skewed nose","post":"Typo: “borrowed from”\n\n","date":"October 26, 2012 at 8:21 am","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18328","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"More from Fanti on the skewed nose","post":"+ typo: “double-stranded”\n\n","date":"October 26, 2012 at 8:30 am","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18329","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"More from Fanti on the skewed nose","post":"Right on the target, Giulio!\n\n","date":"October 26, 2012 at 9:47 am","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18341","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"More from Fanti on the skewed nose","post":"It’s truly discouraging to see this message from Fanti…  All I can do, is write again 2 comments I made 2 days ago about all this non sense :\nIf the Shroud would have been known of the emperor at that time (during his first reign), it’s evident that he would never have allowed a different representation like the one he allowed during the second reign ! It’s pure rational thinking but this kind of thinking is very often put aside when it comes to speculate wildly on supposed direct links between the Shroud and some Byzantine artworks. The solidus of Justinian II doesn’t show anything more than the Pantocrator image of Christ that look very Shroud-like simply because the Pantocrator images (which dates from at least 500 A.D. onwards) were most probably influenced in some way (direct or not) by the image on the Shroud.\nOne last important comment to those who are tempted to defend at all cost the present hypothesis that makes a direct link between the nose from this very ancient Byzantine coin and the nose on the Shroud : Be certain that this speculative assumption would NEVER stand for more than 2 seconds in a court room, simply because the characteristic of the nose of this ancient coin could well be due to a bunch of different things that have nothing to do with the image on the Shroud (and no matter what Fanti can think, an deformation of the mold in which this coin was minted is truly a fair and rational possibility). \nDon’t you think this joke of a possible direct influence of the Shroud on this Pantocrator coin as last long enough ???  I really think so.  If this reflect the state of today’s Shroud science, it’s easy to understand why most of the international scientific community has a tendency to see sindonology as a sick joke and to see most of the Shroud researchers (especially in the historical field) as having no credibility whatsoever.  In the 60s, there was a beautiful hippy song named Were Have All the Flowers Gone?  If I would like to summarize the sad state of Shroud science (especially of the historical research link with the Shroud) these days, I think I would use the title of this song and change it for Were Have All the Rational Thinking’s Gone?\n\n","date":"October 26, 2012 at 10:16 am","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18345","author":"Yannick Clément","site":"shroudstory"},{"title":"More from Fanti on the skewed nose","post":"YC wrote: “this speculative assumption would NEVER stand for more than 2 seconds in a court room,” Which yours?\nI can already hear the Presiding Judge (PJ) telling YC:\n– “My Youngman, don’t you judge/dismiss a file before having even read it, please”,\nand asking him:\n– “….matter of fact, who are you? A professional numismatist specialized in ancient coins, Byzantine coins?”\nYC:\n– “No, not at all your Honour.”\nPJ:\n– “Hmm, I see. A Byzantine Art expert or an Iconographer then?”\nYC:\n– “No, not at all your Honour.”\nPJ:\n– “Hmmmmm, I see. An image archaeological analyst or cryptanalist, maybe?”\nYC:\n– “No, not at all your Honour.”\nPJ:\n– “Hmmmmmmmmm, I see. Thank you. Who bats next?”\n\n","date":"October 26, 2012 at 10:48 am","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18347","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"More from Fanti on the skewed nose","post":"Any people with 2 once of reason and judgement knows that the emperor would never have allowed a totally different depiction of Jesus on the coins he minted during his second reign !  The fact that during his first reign, he made Pantocrator coins of Jesus and then, during his second reign, he made coins of Jesus with a completely different look is ENOUGH to understand that he NEVER saw the Shroud with his own eyes !  NEVER he would have allowed this kind of drastic change in the depiction of Christ during his second reign if he would have been aware of the Shroud during his first reign !  COME ON !!!!  Were Have All the Rational Thinking’s Gone???\n\n","date":"October 26, 2012 at 10:52 am","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18349","author":"Yannick Clément","site":"shroudstory"},{"title":"More from Fanti on the skewed nose","post":"PJ:\n– “Still hold on my youngman. Maybe then you’re a forensic?\nYC:\n– “No at all your Honour, I am a Gefrographer and proud to be one.”\n\n","date":"October 26, 2012 at 11:03 am","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18352","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"More from Fanti on the skewed nose","post":"Who ever told you, my youngman, the emperor Justinian II saw the Shroud?\n\n","date":"October 26, 2012 at 11:04 am","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18353","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"More from Fanti on the skewed nose","post":"Fanti… He he !\nAnd my logical conclusion applied also to you and Latendresse who think the emperor might have saw the Mannoppelo vail or the Mandylion or whatever you might guess !  During his first reign (end of the 7th century), the emperor Justinian II only saw the Pantocrator icon and later, during his second reign (beginning of the 8th century), he saw a different Syriac icon of Christ that was popular at the time and decided to put it on the new coins he was making.  THERE IS NO MYSTERY THERE.\n\n","date":"October 26, 2012 at 11:39 am","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18356","author":"Yannick Clément","site":"shroudstory"},{"title":"More from Fanti on the skewed nose","post":"My name is Fanti and I am not Mario either. I PERSONALLY never said the emperor saw the Shroud. I JUST said in all likelihood a Byzantine engraver did. Cannot you read me or are you just poisoning the well of truth to to add up more to confusion to confusion?\n\n","date":"October 26, 2012 at 12:09 pm","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18360","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"More from Fanti on the skewed nose","post":"Typo (I am about to leave): My name is NOT Fanti and I am NOT Mario either. I PERSONALLY never said the emperor saw the Shroud. I JUST said in all likelihood a Byzantine engraver did. Cannot you read me or are you just poisoning the well of truth to to add up more confusion to confusion?\n\n","date":"October 26, 2012 at 12:11 pm","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18361","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"More from Fanti on the skewed nose","post":"Los hallazgos del Prof. Giulio Fanti son en principio MUY INTERESANTES.\nYannick ESPECULA con el pensamiento de Justiniano II…….\n¿Conoce Yannik que Justiniano II era una MALA BESTIA, un cruel ASESINO?\nCarlos Otal\n\n","date":"October 26, 2012 at 11:27 am","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18355","author":"Carlos Otal","site":"shroudstory"},{"title":"More from Fanti on the skewed nose","post":"That doesn’t mean my friend Carlos that he would have been so stupid that after having seen the Shroud or another official relic of Christ showing an image of his face (like the Mandylion for example), he would not have stick to this particular representation of a Christ with a long beard and long hair when he made new coins during his second reign !!!\nCOME ON !  Am I the only one to have some kind of rational judgement here ?\n\n","date":"October 26, 2012 at 11:42 am","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18357","author":"Yannick Clément","site":"shroudstory"},{"title":"More from Fanti on the skewed nose","post":"Una buena pregunta\n\n","date":"October 26, 2012 at 11:44 am","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18358","author":"Louis","site":"shroudstory"},{"title":"More from Fanti on the skewed nose","post":"YC,\nHave/can you ever consider(ed) the simple possibily for a Byzantine engraver to have had the rare opportunity to,see (and even closely examined the relic e.g. in Edessa, the Parthian Rome in the hands of the Arabs)  or intellectually/rationally am I too demanding on you?\n\n","date":"October 26, 2012 at 12:22 pm","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18362","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"More from Fanti on the skewed nose","post":"If that would have been the case Max, logically, the emperor would have been aware of this and would not have made later on a coin during his second reign that would show a totally different depiction of Christ !!!  This is just PURE RATIONAL THINKING.  COME ON !!!  It will always be possible for you, Mario Latendresse, Carlos Otal, Giulio Fanti or others to make wild speculations in order to find a direct link between the solidus with a broken nose and the Shroud or some other relics associated with Christ like the Mandylion or the Manoppello vail (by the way, there is no historical record of this particular relic before the 16th century !!!), but be sure that using the Occam’s razor principle, your special assumptions will ALWAYS be considered as highly unlikely beside the much more simple possibility that the emperor only intent to produce an image of the Pantocrator on the coin he mint during his first reign.  THAT’S THE REALITY MAX AND YOU KNOW THIS AS WELL AS ME !!! ;-)\n\n","date":"October 26, 2012 at 1:05 pm","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18365","author":"Yannick Clément","site":"shroudstory"},{"title":"More from Fanti on the skewed nose","post":"I forgot to add this :  And that’s why your case would stand for 2 seconds in a court room !  He he !!!\n\n","date":"October 26, 2012 at 1:07 pm","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18366","author":"Yannick Clément","site":"shroudstory"},{"title":"More from Fanti on the skewed nose","post":"YC, do you seriously think  you are a pure rational thinker as far as the TS is concerned?\n  Are you kinding? \n  My youngman, you are just an IMAGINARY numismatist scolar, Roman Parthian Byzantine (Art) historian and court Presiding Judge. Don’t you forget.\n  Don’t you rely TOO MUCH on your TOO LITTLE knowledge. They are photographic, iconological, numismatical, archaeological and forensic facts that just prove you’re TOTALLY WRONG (the engraver did use the Pantocrator Christ type to devise Justinian II’s Solidus obverse featuring a skewed nosed Christ, ONLY AS traditional pre-image/representation. The photographic,numismatic, forensic, icnological, archaedological fact is he also introduced a few new elements such as for example the skewed nose and the double stranded quiff of hair).\n  It should be reminded here, The case of the TS in authenticity is first and foremost a step by step and even minute pieces of evidence by minute pieces of evidence process BEFORE we can reach crucial evidence. NOT even the most minute piece of evidence shall be dismissed or overlooked on the sole assumption of a YC non-expert in the relevant fields here involved.\n\n","date":"October 27, 2012 at 7:32 am","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18409","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"More from Fanti on the skewed nose","post":"Typos: My youngman, you are just an IMAGINARY numismatist scHolar, Roman Parthian Byzantine (Art) historian and court Presiding Judge. Don’t you forget.\nDon’t you rely TOO MUCH on your TOO LITTLE knowledge. THERE are photographic, iconological, numismaTIC archaeological and forensic facts that just prove you’re TOTALLY WRONG\n\n","date":"October 27, 2012 at 7:44 am","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18411","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"More from Fanti on the skewed nose","post":"More typo (sorry): numismatist scholar\n\n","date":"October 27, 2012 at 7:45 am","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18412","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"More from Fanti on the skewed nose","post":"I really don’t know what Fanti is talking about. First I have never read a forensic report that states the noise was broken! In fact medical forensic specialists have stated it is not broken but that cartilage has been displaced i.e shifted…Big difference. Second I look at the expended image above and I see signs of impact damage. But if Fanti says the curvature is evident on other coins then my argument is void. Would be nice to see these other coins to evalute this curvature ourselves. I also question his confidence that the image was clearer in ancient times. How can he be so sure. Would’nt the body image get equally darker with the rest of the cloth? Leaving the contrast the same but just darker?\nR\nR\n\n","date":"October 26, 2012 at 12:50 pm","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18363","author":"Ron","site":"shroudstory"},{"title":"More from Fanti on the skewed nose","post":"Ron, actually the curvature is not only evident/proeminent on half a dozen additional Byzantine coins BUT ALSO on high quality Turins Sindon-Manoppello Veil faces perfect overlaps by German iconographer, Blandina Paschalis Schlömer. Remember: the ancient engraver(s) copied BOTH what (t)he(y) really saw and what (t)he(y) believed (t)he(y) saw within an iconological canonic frame.\n\n","date":"October 27, 2012 at 7:40 am","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18410","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"More from Fanti on the skewed nose","post":"There are a handful of Justinian II coins on the http://www.wildwinds. None of them show a crooked nose. Entering ‘regnantium’ as a search produces a few more long-haired, bearded Christs. None of them have a crooked nose either. On http://www.forumancientcoins.com there are five pages of them, and a few have seriously wonky noses, but they are wonky in different ways. Entering “Justinian II” and ‘coins’ on Google images gives you enough to ransom an emperor, all different, and the only thing they have in common is the straightness of their noses.\n\n","date":"October 27, 2012 at 8:37 am","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18413","author":"Hugh Farey","site":"shroudstory"},{"title":"More from Fanti on the skewed nose","post":"Hugh:\n25 sólidus First Reign Justinian II\nhttp://www.acsearch.info/search.html?search=similar%3A470707\nCoins Justinian II\nhttp://www.acsearch.info/search.html?search=Justinian+II&view_mode=0&en=1&de=1&fr=1&it=1&es=1&ol=1&sort=&c=&a=&l=\nCarlos Otal\n\n","date":"October 27, 2012 at 11:03 am","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18419","author":"Carlos Otal","site":"shroudstory"},{"title":"More from Fanti on the skewed nose","post":"Gracias, Carlos. More and more of the straightest noses known to numismatics…\n\n","date":"October 27, 2012 at 11:28 am","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18420","author":"Hugh Farey","site":"shroudstory"},{"title":"More from Fanti on the skewed nose","post":"I wrote BYZANTINE (not just Justian II’ solidus) coins with the Christ face on the obverse side…\n\n","date":"October 27, 2012 at 1:19 pm","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18422","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"More from Fanti on the skewed nose","post":"…Giulio already mentioned 4 of them….\n\n","date":"October 27, 2012 at 1:22 pm","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18424","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"More from Fanti on the skewed nose","post":"Are they on the internet?\n\n","date":"October 27, 2012 at 2:06 pm","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18426","author":"Hugh Farey","site":"shroudstory"},{"title":"More from Fanti on the skewed nose","post":"A good specimen of the gold solidi is said to be preserved in the museum in the city of St. Gallen (Sankt Gallen in German) in Switzerland. Jesuit Fathers Werner Bulst and Heinrich Pfeiffer wrote a book on the subject of how the image of Christ developed in art entitled “Das Turiner Grabtuch und das Christusbild” and there is a review in one of the BSTS newsletters.\n\n","date":"October 27, 2012 at 6:08 pm","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18431","author":"Louis","site":"shroudstory"},{"title":"More from Fanti on the skewed nose","post":"It’s a shame that the BSTS reproduction isn’t clearer, but I concede that the emperor’s nose looks broken. Not particularly crooked though. Interestingly, it also shows Jesus’s hair as flowing behind his clothes on both sides. Breckenridge speculates that later minters misread the folds of cloth around the neck as hair, which is why later coins (such as Fanti’s) show the hair coming forward of the clothes, usually on the right hand side. Given the large number of coins found (and published), it might not be impossible to find other examples of Fanti’s coin incontrovertibly stamped from the same die. Then it would be easier to  compare blemishes, and find out if the nose is invariably as crooked.\n\n","date":"October 28, 2012 at 6:02 am","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18446","author":"Hugh Farey","site":"shroudstory"},{"title":"More from Fanti on the skewed nose","post":"That’s right but that is because the newsletters are computer-produced and not printed in a press and the review appeared in one of the older issues and with advances in technology the more recent issues have much better images. Comparison will be needed to make sense of the clumsily minted coins, but the fact that there are coins with the Shroud face, however crude they may be, does help in tracing the history of the relic, and, needless to say, finding other examples of Fanti’s coin will probably take time.\n\n","date":"October 28, 2012 at 9:54 am","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18452","author":"Louis","site":"shroudstory"},{"title":"More from Fanti on the skewed nose","post":"Hi Hugh & Louis, e.g. you can find at least four examples of skrewed/crooked/broken nosed Christ portrait on Byzantine coin obverse at:\nCoinArchives.com Search Results christ solidus nomisma semissis hyperpyron – Recherche Google and http://www.fitzmuseum.cam.ac.uk/index.html\n\n","date":"October 28, 2012 at 6:31 pm","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18459","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"More from Fanti on the skewed nose","post":"OK,Max. Thanks for the lead.\n\n","date":"October 28, 2012 at 8:00 pm","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18472","author":"Louis","site":"shroudstory"},{"title":"More from Fanti on the skewed nose","post":"…but there are more of them.\n\n","date":"October 28, 2012 at 6:33 pm","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18460","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"More from Fanti on the skewed nose","post":"See more precisely:\nGold solidus of Emperor Justinian II (685-95, 705-11), Constantinople, 692-95. \n-CM.2063-1950. http://www.fitzmuseum.cam.ac.uk/index.html\nCoinArchives.com Search Results christ solidus nomisma semissis hyperpyron\n– Stack’s Bowers and Ponterio > Sale 172 – Nov. 2012 Baltimore Auction Sess. B & C\nAuction date: 16 November 2012 Lot number: 11829\nI- ra & Larry Goldberg Coins & Collectibles > Auction 70\nAuction date: 4 September 2012 Lot number: 3464\netc\n.\n\n","date":"October 28, 2012 at 6:40 pm","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18461","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"More from Fanti on the skewed nose","post":"Error:  see ArtCoins Roma s.r.l., Auction 4, 1148  (instead of -CM.2063-1950. http://www.fitzmuseum.cam.ac.uk/index.html)\n\n","date":"October 28, 2012 at 7:11 pm","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18465","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"More from Fanti on the skewed nose","post":"See Classical Numismatic Group, Inc. SB 1248, DOC II 7 (broken  and bent nosed Christ face etc etc\n\n","date":"October 28, 2012 at 6:58 pm","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18463","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"More from Fanti on the skewed nose","post":"It took me less than 15 minutes to find them.\n\n","date":"October 28, 2012 at 7:00 pm","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18464","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"More from Fanti on the skewed nose","post":"Thanks. One can see that you are good at this.\n\n","date":"October 29, 2012 at 7:46 pm","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18526","author":"Louis","site":"shroudstory"},{"title":"More from Fanti on the skewed nose","post":"To all, In view of the difficulty a few active participants on this blog do have to see the TSM’s skewed/broken nose, I sent Dan via email a second Flash Illustrartive REply (FIRE) in order to shed more light on the numismatic sindonological issue here involved. I do hope Dan will publish it in reply to the arch-sceptics’ ceaseless attacks, disbelief and/or denial.\n\n","date":"October 29, 2012 at 8:49 pm","url":"https://shroudstory.com/2012/10/26/more-from-fanti-on-the-skewed-nose/","cat":"art","id":"comment-18529","author":"Max Patrick Hamon","site":"shroudstory"}]
