[{"title":"More on Waldemar Januszczak doesn’t think the Shroud of Turin is real","post":"The Paintings from the catacombs in Rome were in all probability not even ‘known to exist’ until their recent find, in very recent times. These places were of the utmost secrecy to the early Christians. Secret places for them to gather and pray~in light of the persecutions. This can be considered and proposed, from the fact that early renditions of Christ were of a young strapping non-bearded blond haired youth, reminiscent of Apollo! Yet almost immediately after the finding of the Mandylion (Image of Edessa) in the mid 6th century, hidden in the west gate of Edessa, hidden since possibly the 1st century, the “caricature” changed to the one we see in the Pantocrator and many other renditions found throughout the ancient world, and with an uncanny resemblance to the face we see on the Shroud. What are the chances of this being a “New Invention”, especially with traits as the double image? and a NAKED Jesus? …In my humble opinion, the notion that this was an ‘Invention’ out of the blue, is actually quite laughable to say the least.\nR\n\n","date":"December 28, 2011 at 5:01 pm","url":"https://shroudstory.com/2011/12/28/more-on-waldemar-januszczak-doesnt-think-the-shroud-of-turin-is-real/","cat":"art","id":"comment-6233","author":"Ron","site":"shroudstory"},{"title":"More on Waldemar Januszczak doesn’t think the Shroud of Turin is real","post":"Ron, did you knew that the Mandylion origin is not known at all historically speaking ?  The most probable date that the cloth appeared in Edessa is the second part of the 6th century and it is quite clear that this Abgar legend was modified at that time to include the cloth.  Before that time, the Abgar legend didn’t make any mention of a miraculous cloth.  There was only an exchange of letters between Abgar and Jesus !  All this seem to me like a “cover up” to make believe this cloth (probably a false relic) have a pedigree that goes all the way to Jesus and 1st century Palestine…  Guscin in his book “The Image of Edessa” was quite prudent versus the origin of the image and state that it’s origin is unknown.  It’s completely true.\nThose images from the catacombs are clues to me that the Shroud existed during those early days and it was the base for those frescos, but probably not directly.  My feeling is that it happened something quite like it happened for the Pray Codex :  During those days (3rd or 4th century) some people must have seen the authentic Shroud somewhere (probably in Palestine) and came to Rome where they describe the face of the Shroud to some artists who did the artwork based on their testimony.  That could explain why the face is not an exact copy of the Shroud face but at the same time, is too close to it to be due simply to hasard.  And I don’t think the Mandylion had anything to do with those frescos.\nDid you ever thought of another possibility for the Mandylion ?  Here it is :  Maybe it was a false relic created during the second half of the 6th century by an artist who was working in catimini with the Shroud as a model.  At that time, the Shroud would have been kept secretly and the general public wasn’t aware of it.  Then, the Mandylion became rapidly known (because mainly of his inclusion in the Abgar legend and his so-called miraculous role in the defense of Edessa in 544) and since the general belief was that this was the real face of Jesus on that cloth (not made by human hands), this Mandylion surely became the principal model for every Jesus depictions after the second portion of the 6th century like the Pantocrator from the Saint Catherine’s monastary…\nWhat do you think of this scenario ?  I think it is as logical as the hypothesis of Wilson and maybe more because during the 3rd and 4th century, the Mandylion is supposed to have been hidden in a wall from Edessa…\n\n","date":"December 31, 2011 at 10:30 pm","url":"https://shroudstory.com/2011/12/28/more-on-waldemar-januszczak-doesnt-think-the-shroud-of-turin-is-real/","cat":"art","id":"comment-6397","author":"Yannick Clément","site":"shroudstory"},{"title":"More on Waldemar Januszczak doesn’t think the Shroud of Turin is real","post":"I’m aware of the non-existant pre-6th century history of the Mandylion, no-one including Wilson has proported to know of such, …just conjecture. But the finding of the Image of Edessa, such as it was called, in the apex of a gate in 525ad, is very interesting. Would someone hide a fake relic in the apex of a gate? Basically hidden for centuries? Or maybe it was just made up? That would be quite a hoax or joke don’t you think? …Very implausible to my mind. Something was found in that gate and whatever it was it was found to be ‘not made by the hand of man’. I would guess myself it was the actual Shroud as we do not know when it was placed in the gate, could have been at anytime prior to 525ad…Which does not go against your scenario, which I must say is quite plausible and would explain alot of things.\nI had the same thoughts as you when I first saw the fresco from the catacombs, it looked too similar to the Shroud image to be just coincidence and I still ponder on that thought. It may just be a ‘clue’ that the Shroud was ‘known of’ or ‘witnessed’ in those early centuries by some early christians, but it’s presence kept secret for reasons we already know…\nR\n\n","date":"January 1, 2012 at 7:11 pm","url":"https://shroudstory.com/2011/12/28/more-on-waldemar-januszczak-doesnt-think-the-shroud-of-turin-is-real/","cat":"art","id":"comment-6430","author":"Ron","site":"shroudstory"},{"title":"More on Waldemar Januszczak doesn’t think the Shroud of Turin is real","post":"Another possible scenario for the Pantocrator of Saint Catherine’s monastary is that the artist who paint this icon was directly looking at the Shroud for a model (but that the Shroud was a different relic than the Mandylion)…  It is also a possible scenario because this monastry is located in Palestine and the Shroud might well have been in Palestine during that time…\nThose 2 possible scenarios have the same chances to be true than the Mandylion scenario and even better chances from my point of view…\n\n","date":"December 31, 2011 at 10:52 pm","url":"https://shroudstory.com/2011/12/28/more-on-waldemar-januszczak-doesnt-think-the-shroud-of-turin-is-real/","cat":"art","id":"comment-6400","author":"Yannick Clément","site":"shroudstory"},{"title":"More on Waldemar Januszczak doesn’t think the Shroud of Turin is real","post":"Yannick, FYI; The St Catherine’s monastery is located in the Sinai desert at the foot of Mt Sinai, not Palestine. The Pantocrator is much too close to the Shroud image itself, like 70+ points of congruence and in the placement of facial features, to have been created from a copy. It can then be concluded, that the pantocrator was painted, with the artist being in ‘direct view of’ and ‘in-of the measurement’ of the Shroud itself!…That is NOT only in my opinion.\nR\n\n","date":"January 1, 2012 at 7:39 pm","url":"https://shroudstory.com/2011/12/28/more-on-waldemar-januszczak-doesnt-think-the-shroud-of-turin-is-real/","cat":"art","id":"comment-6434","author":"Ron","site":"shroudstory"},{"title":"More on Waldemar Januszczak doesn’t think the Shroud of Turin is real","post":"You’re maybe right about the Sinai cause today, it is located in Egypt, but I thought that during those days, the sinai desert was part of Israel.  I can be wrong here about that fact.\nBut I’m sure you’re right about the fact that the highest probability for the creation of the Pantocrator goes in the direction that the artist was looking directly at the Shroud.  But since the Mandylion was kept in Edessa during those days and not in the Sinai desert, I tend to favored the probability that the Shroud was kept in Palestine, near the Sinai desert during that time, while the Mandylion was in Edessa and had probably nothing to do directly with the Pantocrator, since, for me, the Mandylion was a false relic created also while the artist was looking at the Shroud.  In other word, I think the Mandylion and the Pantocrator icons were all artistic works based on the real Shroud.  I think it’s the most probable possibility to explain all the points of congruence we can see in the Pantocrators icons and also in the Mandylion copies we still have today.\n\n","date":"January 2, 2012 at 12:48 am","url":"https://shroudstory.com/2011/12/28/more-on-waldemar-januszczak-doesnt-think-the-shroud-of-turin-is-real/","cat":"art","id":"comment-6448","author":"Yannick Clément","site":"shroudstory"}]
