[{"title":"Most Scientists . . . Don’t You Just Love It","post":"Another quote from the book is about the use of “gum arabic” which I believe Rogers found traces of in the Raes-carbon sample threads:\n“Leonardo seems to have consulted with him on his unique method of using dry colors on vellum, and he was particularly interested in how to achieve flesh tones and how to handle lake pigments—those manufactured by mixing dye with certain insoluble binders, in this case gum arabic. Gum arabic is extracted from the acacia tree and can be used as a binder for pigments or even as a fixative for the whole sheet.”\nWhitney, Catherine; Silverman, Peter (2011-12-19). Leonardo’s Lost Princess: One Man’s Quest to Authenticate an Unknown Portrait by Leonardo Da Vinci (p. 77). John Wiley and Sons. Kindle Edition. \nRogers point was not that the cotton in the Shroud was a major impact on the carbon date, it’s that the gum arabic was used to bind cotton into the threads because the cotton could be died and the linen does not dye well or at all. It was dyed cotton that was used by the repairers to  age the sample to match the rest of the Shroud. Rogers. Chemist\\’s Perspective, p, 74.\n\n","date":"January 20, 2014 at 8:02 am","url":"https://shroudstory.com/2014/01/20/most-scientists-dont-you-just-love-it/","cat":"art","id":"comment-73800","author":"John Klotz","site":"shroudstory"},{"title":"Most Scientists . . . Don’t You Just Love It","post":"I am curious about that interesting portrait … and the analyses.\nIf you read under :\nhttp://en.wikipedia.org/wiki/Portrait_of_a_Young_Fianc%C3%A9e\nThere is the description :\n>Portrait of a Young Fiancée, also called La Bella Principessa (English: “The Beautiful Princess”), is a portrait in coloured chalks and ink, on vellum, of a young lady in fashionable costume and hairstyle \nand then \nYou can find something about :\nThe physical and scientific evidence from multispectral analysis and first-hand study of the painting, as described by Kemp …\n— —\nHere other informations :\n>Kemp recently published, with a colleague, a book called “La Bella Principessa: The Story of the New Masterpiece by Leonardo da Vinci,” which contains a chapter by Biro, entitled “Fingerprint Examination.” In the manner of a law-enforcement officer presenting forensic evidence in court, Biro arranges the images of the “St. Jerome” and the “Principessa” fingerprints side by side, with arrows pinpointing what he identifies as eight overlapping characteristics between them. I asked Charles Parker—a latent-fingerprint examiner with more than thirty years of experience in the field, who has helped to establish guidelines for fingerprint examiners in the United States—to review the chapter. He said that most of the arrows don’t point to actual overlapping characteristics, just random details, and that, judging from the images presented, the partial fingerprint on “La Bella Principessa” is too poorly detailed for an identification to be made. “No other examiner I know would sign off on it,” he said. “I couldn’t even get it past the door.” Wertheim agreed with this assessment, and suggested that Biro’s approach was the equivalent of trying to identify a man based on seeing his ear poking out from behind a bush for a fraction of a second.\n>“The fingerprint community can get quite dogmatic,” Biro told me in another conversation. “They don’t like people who rock the boat, and I could be seen as a loose cannon to some, because I’m questioning a lot of things.”\nSource :\nhttp://www.newyorker.com/reporting/2010/07/12/100712fa_fact_grann\n— —\nand from another source :\n>The attribution to Leonardo DaVinci, based on  the multispectral scanning of  the Research Laboratory Lumiere-Technology, was confirmed in 2009 by six Art historians, Nicholas Turner, Carlo Pedretti, Alessandro Vezzosi, Mina Gregori, CristinaGeddo and Martin Kemp.\n>The main opposition came from the experts in New York and from some observers who had missed this attribution when the work was in the hands of Christie’s and the Gallery Ganz, against the background of lawsuit at the Court of New York brought against Christie’s by Jeanne Marchig, the previous owner who had consigned the drawing to the auction house for sale.\n>Through the knowledge of the original colours of the restored work, Martin Kemp and Pascal Cotte had tentatively identified the portrait as that of Bianca, the illegitimate daughter of Duke Ludovico Sforza, who was legitimized in 1496 and married to Galeazzo Sanseverino, Commander of the armies of the Duke. She died tragically a few months after her marriage. \nLink :\nhttp://www.lumiere-technology.com/discoveries2.html\n— —\nBut … there are other stories around Bianca Sforza :\nAccording to Italian art historian Carla Glori, the face of the enigmatic “Mona Lisa” (also known as “La Gioconda”), painted by the great Renaissance master Leonardo Da Vinci, and the replica, the “Prado Mona Lisa” is the face of Bianca Giovanna Sforza. However, that claim does not convince those who have sustained for many years the belief that it is a portrait of Mona Lisa or Lisa Gherardini.\n>Based on research by Glori, Bianca Sforza was the wife of Galeazzo Sanseverino and the legitimate daughter of Ludovico il Moro and Bernadina de Corradis, who lived in Bobbio, in northern Italy. The writer claims the portrait was painted from the Malaspina dal Verme Castle, Bobbio, from where there is an observable bridge, the Ponte Vecchio Bobbio (Old Bridge of Bobbio), visible over the sitter’s left shoulder.  …  …\nInstead\n>Retired Oxford professor Martin Kemp, however, said the bridge in the portrait of Lisa del Giocondo and the historic Bobbio bridge do not seem very similar.\n>“There have been many attempts to identify the landscape as a specific location and I do not find the resemblance to the Bobbio bridge all that close,” Kemp said, according to The Daily Mail.\nSource :\nhttp://www.theepochtimes.com/n2/arts-entertainment/the-two-faces-of-leonardo-da-vincis-mona-lisa-192868.html\n— —-\nHere the last story : an italian book …\nEnigma Leonardo: decifrazioni e scoperte vol.1\nLa Gioconda. In memoria di Bianca\ndi Carla Glori, Ugo Cappello\n———————————–\nAt the end …\nIf you want to try to understand the enchantment (see : Galeazzo Sanseverino and Bianca Sforza …) and all the (presumed) findings,\nyou have to translate the words :\nROGAS ABACUM SINE  VINCI – (P.1495)\nSource :\nhttp://www.carlaglori.com/cartiglio/decifrazioni-e-soluzioni-2010-2013/\n… and\ndo you know Messer Ambrogio da Rosate (a wizard), prime astrologer ?\nHe was able to prepare the poison …\nfor the death of\nGian Galeazzo Sforza (1469-1494), Duke of Milan !\nThen there is the work by Azzolini :\nAstrology and Politics in Renaissance Milan,\nHarvard University Press (2013)\nLink :\n          (function() { var scribd = document.createElement(\"script\"); scribd.type = \"text/javascript\"; scribd.async = true; scribd.src = \"#{root_url}javascripts/embed_code/inject.js\"; var s = document.getElementsByTagName(\"script\")[0]; s.parentNode.insertBefore(scribd, s); })()        \n— —\nAll these stories are far from the Holy Shroud,\nbut there is a possible analogy with the strange\nstories of attempts, manipulations, “scientific empoisoning”, etc. …\nAm I an awkward guest ?\nSorry …\nI simply tried to indicate/describe the History and the plots …\n\n","date":"January 20, 2014 at 10:56 am","url":"https://shroudstory.com/2014/01/20/most-scientists-dont-you-just-love-it/","cat":"art","id":"comment-73813","author":"piero","site":"shroudstory"},{"title":"Most Scientists . . . Don’t You Just Love It","post":"If you have followed the story about Bianca Sforza\nthen there are the\n>Corresponding stitch holes and incison marks between La Bella and the Sforziad. Image via The Guardian\nLink :\nhttp://www.3pipe.net/2011/07/enhancing-art-of-seeing-leonardo-case.html\n>….On January 25th 2012, Mystery of a Masterpiece was aired on the NOVA program on  PBS in the US. It provided a wonderful overview of much of the evidence presented above, though its true highlight was the section on the identification of the Sforziad source volume in Poland …\nSee also :\nMystery of a Masterpiece. (Documentary) NOVA. PBS. Aired 25th January 2012. Excerpt edited by H Niyazi.\nLink :\nhttp://www.pbs.org/wgbh/nova/tech/mystery-masterpiece.html\n— — —-\nIn the case of the other claim, there is the starting point,\nthe phrase :\nIACO:BAR:VIGEN/NIS P.1495 – written on cartouche (of 1495).\n—–\nThe painting has been generically attributed to Jacopo de’ Barbari due to the presence of a cartouche with the inscription IACO.BAR. VIGENNIS. P. 1495, with the enigmatic presence of a fly above it. However, the attribution to the Venetian painter is now generally regarded as wrong, due to pictorial and historical considerations.\nThe painting has been even attributed to Leonardo da Vinci …\nSource :\nhttp://en.wikipedia.org/wiki/Portrait_of_Luca_Pacioli\n—-\nInstead, if you love the Mathematics,\nsee under :\nhttp://cage.ugent.be/~hs/pacioli/pacioli.html\nPacioli clearly is exposing a theorem to one of his pupils …\n— —\nand\nthere is a link :\nhttp://www.carlaglori.com/cartiglio/decifrazioni-e-soluzioni-2010-2013/\nHere the italian words (for the curious idea about the particular in that portrait) :\n>Particolare del Ritratto di Luca Pacioli con un allievo: messa a fuoco del dettaglio posto sotto la manica sinistra dell’allievo (Galeazzo Sanseverino, indicato dalla vedova Isabella quale complice del Rosate) comparato con alcuni campioni di arsenico nativo e di arsenico con rame (nel centro). Osservando attentamente, si riscontra analogia tra la forma dipinta e\n quella naturale dell’arsenico nativo.\nArsenic = poison !\n…. I am thoughtful … this seems to be only a fur…\nIn my opinion, we have to find a more decisive proof.\nHave you tried ?\n— —\nI hope to see the same deep critical insight for the problems of the Shroud because the acuteness about Leonardo was great, but in the case of the Holy Shroud we are still waiting for the useful exact analyses since the year 1998. The working “aculeus” of the AFM tip was not used on linen fibrils in order to obtain the truth …\n\n","date":"January 20, 2014 at 11:48 am","url":"https://shroudstory.com/2014/01/20/most-scientists-dont-you-just-love-it/","cat":"art","id":"comment-73819","author":"piero","site":"shroudstory"},{"title":"Most Scientists . . . Don’t You Just Love It","post":"Piero,\nYou certainly are up to date on the Principessa and very knowledgeable about the  /early Renaissance court of the Sforzas.\nHowever. the mystery of Bianca’s death is beyond the scope of my inquiry. The reason I am attracted to it as an analogy is the issue of provenance and how if the scientific evidence and other examinations are detailed enough, the issue of gaps, even huge gaps, in the provenance history are not determinant. The  twin issues are whether this is an authentic daVinci and whether the Shroud is the authentic burial cloth of Christ.\nI think that the issue of the portrait was resolved  by the discovery the Sfoza book in  Warsaw with the missing page. There is no issue but that the Shroud is either the most ingenious fraud  in history or the authentic burial cloth. The similarity is in the centuries of missing history. However in both cases it is ultimately science that determines authenticity. The gap fades to insignificance in the face of the science.\n\n","date":"January 20, 2014 at 1:38 pm","url":"https://shroudstory.com/2014/01/20/most-scientists-dont-you-just-love-it/","cat":"art","id":"comment-73831","author":"John Klotz","site":"shroudstory"},{"title":"Most Scientists . . . Don’t You Just Love It","post":"I beg your pardon ! This blog is centered on Turin Shroud and my interventions were a bit far from the Shroud …\nIn any case I have appreciated your past words about the conspiracies (in one of your messages, in September 2013) … and then this is my fast explanation about these strange interventions.\n— * — * —\nThe other question connected is the multispectral analysis … and the level of resolution obtained about the analyses on linen fibrils.\nPerhaps we can find other time to discuss that issue …\n\n","date":"January 21, 2014 at 10:23 am","url":"https://shroudstory.com/2014/01/20/most-scientists-dont-you-just-love-it/","cat":"art","id":"comment-73934","author":"piero","site":"shroudstory"},{"title":"Most Scientists . . . Don’t You Just Love It","post":"“Rogers point was not that the cotton in the Shroud was a major impact on the carbon date, it’s that the gum arabic was used to bind cotton into the threads because the cotton could be died and the linen does not dye well or at all.”\nIf the threads that were radiocarbon dated were from about 1300AD rather than 30AD, they would have given a date of about 1300AD rather than 30AD. They were, and they did. Any Gum Arabic, being soluble in water and destroyed by Sodium Hydroxide, was completely washed away in the cleaning process, and had no effect on the dating process at all, whatever date it was. If the Gum Arabic had been used as a glue to bind cotton to linen threads, the  samples would have fallen to pieces as a result of the cleaning process and been impossible to use for radiocarbon dating.\n\n","date":"January 20, 2014 at 2:29 pm","url":"https://shroudstory.com/2014/01/20/most-scientists-dont-you-just-love-it/","cat":"art","id":"comment-73836","author":"Hugh Farey","site":"shroudstory"},{"title":"Most Scientists . . . Don’t You Just Love It","post":"Hugh, I’m a little confused by your last two sentences. Rogers asserted he found gum arabic together with cotton. If the gum arabic was not used to bind the cotton and linen threads, what was its purpose? I read that you say that NaOH would have dissolved the gum arabic, the sample would have fallen to pieces, then could not be used for C14 dating. But the C14 dating was carried out. Did the labs not then dissolve the gum arabic? Or was it a more superficial cleaning without NaOH?\n\n","date":"January 20, 2014 at 3:48 pm","url":"https://shroudstory.com/2014/01/20/most-scientists-dont-you-just-love-it/","cat":"art","id":"comment-73850","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Most Scientists . . . Don’t You Just Love It","post":"As you know, I tend towards the idea that the radiocarbon dating was an accurate assessment of the age of the piece of the shroud that was tested. As such, all contamination was effectively removed, leaving the basic material to be tested. It is not impossible that gum arabic (and rose madder) was present on the shroud for some purpose or other, but I do not think it had anything to do with interpolated weaving. The entire ‘splice’ hypothesis and the evidence which supports it is inconsistent, from the relative amount of cotton to linen, to the nature of the ‘splices.’ Some have said that the interpolated threads were an intimate blend of cotton and linen (Fanti), others that separate threads of linen and cotton were twisted together (Benford), and others that two pieces of cotton were glued together end on (Villarreal). Even if some sort of ‘glue’ had been considered necessary to hold the shroud together, gum arabic would have been a silly choice as it goes very sticky under any kind of moisture, such as a bishop’s fingers, which would have ended up covered in shreds of mended shroud!\nAll the labs cleaned their material remarkably thoughoughly. Vacuuming or ultrasound were used to remove loose foreign bodies, ether, ethanol or dertergent for fats, waxes and oils, and then various acid (hydrochoric), alkali (sodium hydroxide) and distilled water washes. One of the Zurich test samples (one from the mummy wrapping) did fall to shreds under the treatment and was lost. The rest of the samples, I suppose, preserved their integrity. There is no likelihood that any coating of any kind managed to survive this treatment.\n\n","date":"January 20, 2014 at 7:36 pm","url":"https://shroudstory.com/2014/01/20/most-scientists-dont-you-just-love-it/","cat":"art","id":"comment-73876","author":"Hugh Farey","site":"shroudstory"},{"title":"Most Scientists . . . Don’t You Just Love It","post":"No coating survived this treatment. Sounds like a rather harsh cleaning procedure for linen, no? Is it possible that the cleansers themselves could have affected results? I mean how do you remove the remover?\nI’m sure all you science bods are cringing at this naive question but I’m struck that we’re dealing with very old linen here, not dense fossils or bones.\nHow do we know that the method of cleansing linens for C-14 testing does not affect the results?\nJust questioning the assumption here, indulge my ignorance.\n\n","date":"January 21, 2014 at 4:52 pm","url":"https://shroudstory.com/2014/01/20/most-scientists-dont-you-just-love-it/","cat":"art","id":"comment-73989","author":"David Goulet","site":"shroudstory"},{"title":"Most Scientists . . . Don’t You Just Love It","post":"Good question. The control for this was to clean and date the three control samples in exactly the same way at the same time. They all came out reasonably correctly correlated with their known dates, so there is no reason to suspect that the cleaning process itself distorted the dating.\n\n","date":"January 21, 2014 at 4:59 pm","url":"https://shroudstory.com/2014/01/20/most-scientists-dont-you-just-love-it/","cat":"art","id":"comment-73993","author":"Hugh Farey","site":"shroudstory"},{"title":"Most Scientists . . . Don’t You Just Love It","post":"“The rest of the samples, I suppose, preserved their integrity. There is no likelihood that any coating of any kind managed to survive this treatment.”\n“I suppose” is that a scientific judgment? You admit that one sample in fact fell apart. Then state “There is NO likely hood that any coating OF ANY KIND managed to survive this treatment.”\nNo likelihood means 100% assurance. I know of few things on this earth 100% assured except in the words of the American rabble rouser and enemy of the English King Benjamin Franklin who wrote: “‘In this world nothing can be said to be certain, except death and taxes.” The labs themselves stated they believed their accuracy was a 95%. \nBut NO ONE is claiming that he coating is what was carbon dated, it was the linen threads that were. The importance of the cotton and the encrustrations was that they were a marker in the Raes and crabon samples of the new (medieval) linen.\nHow much time have you spent examining the Scanning Electronic Microscope photographs of the late John Brown of Georgia Tech published by shroud.com in 2005 a few days after peer-reviewed papers in Thermocheimca Acta papers.\nPeer review, like carbon data, is no 100% guarantee of accuracy, but it is a starting point. Outside of Jull’s silly 2010 paper published by Radiocarobon, a journal of which he was the editor, and the original 1989 Nature article which noted only in its  acknowledgements but did not comment, on a finding of cotton in the sample, is there any other peer reviewed article you are relying on? In fact when you whnen to the communication of the lab that found the cotton cited you find that cotton was “intertwined” with the sample fibers. \nIn any event the findings of Rogers was that the linen was new and this the carbon dating skewed. Future tests when finally allowed can deal with dating issues at the quantum level. In fact the STURP experiments used various tools that depended on the quantum actions of the samples (flouresence for example is the discharge of a photon when the the material is agitated).\nMarcello Truzzi who was the philosopher of “pseudo-skepticism” stated that when you dispute something as not being proved, unless you present evidence of a contrary position, you can not claim the contrary position has been proved, only that the principal proposition has not been proved. Numerous articles [published in peer reviewed journals have demonstrated that the carbon tests were flawed.\nThere is a wealth of material on shroud.com citing sources on the carbon dating which note false, even supercilious dating results. One such was a finding that the object being sampled was dated to a future time than the current date: time-traveling carbon dating.\n\n","date":"January 21, 2014 at 9:17 am","url":"https://shroudstory.com/2014/01/20/most-scientists-dont-you-just-love-it/","cat":"art","id":"comment-73919","author":"John Klotz","site":"shroudstory"},{"title":"Most Scientists . . . Don’t You Just Love It","post":"The citation for Browns paper with the SEM photgraphs is http://www.shroud.com/pdfs/brown1.pdf\n(Sorry for typos, I posted prematurely)\n\n","date":"January 21, 2014 at 9:19 am","url":"https://shroudstory.com/2014/01/20/most-scientists-dont-you-just-love-it/","cat":"art","id":"comment-73920","author":"John Klotz","site":"shroudstory"},{"title":"Most Scientists . . . Don’t You Just Love It","post":"Well I can’t agree with any of that.\nYes, I suppose all but one of the samples preserved their integrity. This is on the basis that one sample which did disintegrate was mentioned in the Nature paper, although it is not specifically recorded that the others did not. Suppose is a perfectly valid word to use in this context.\nThe sample that fell apart did so specifically because of its ‘loose weave,’ not because it was glued together with a water soluble glue. If any of the other samples had been held together by water soluble glue, they would have disintegrated as well.\n“No likelihood” does not mean 100% certainty. If I had meant there was no doubt at all, I would have said so.\nI have studied Robert Brown’s SEM paper carefully for months. His first (optical) photo appears to show an orange-brown thread with little white patches on it which he says represent the places where warp threads cross over it. However the first white patch appears on the crest of a wave, not in the trough, the second occurs on one side of a trough only, and the last trough shows no white patch at all. In a 3/1 twill weave, the underside of this thread would show the opposite – it would appear to be a white thread (being covered with three adjacent warp threads) little orange brown patches where it was exposed to the air. This is not apparent from the photo. I do not find his paper conclusive.\nNext, is it not a little disingenuous first to suggest that peer-review is a “starting point” for some degree of reliability, and then dismiss all the papers you disagree with as silly. Is it not a little biased to dismiss a paper published in his own journal by Jull, but not another paper published in his own journal by Rogers?\nAnd no, there is no evidence that the cotton fibres identified among the Oxford samples were ‘intertwined.’ Where did that idea come from?\nObviously as fundamental to physics, all experiments are ultimately quantum science based, but there is no application of any current understanding of QED that is relevant to the Shroud.\nI don’t think it was particularly observant of Truzzi to declare that disputing one idea is not the same as proving its opposite. I’m so glad I don’t fall into that trap though!\nCan you name any of the “numerous articles” published in a peer reviewed journal that demonstrate that the carbon tests were flawed?\nAnd finally, can you quote the artifact that carbon dated further into the future than the current date? Because if so, then you will also know why.\n\n","date":"January 21, 2014 at 3:58 pm","url":"https://shroudstory.com/2014/01/20/most-scientists-dont-you-just-love-it/","cat":"art","id":"comment-73981","author":"Hugh Farey","site":"shroudstory"},{"title":"Most Scientists . . . Don’t You Just Love It","post":"\nHugh Farey :Good question. The control for this was to clean and date the three control samples in exactly the same way at the same time. They all came out reasonably correctly correlated with their known dates, so there is no reason to suspect that the cleaning process itself distorted the dating.\nDid the control samples have similar characteristics to the Shroud linen? Is there a link to more info about the control samples. I’m suddenly very curious about them.\n\n","date":"January 21, 2014 at 5:03 pm","url":"https://shroudstory.com/2014/01/20/most-scientists-dont-you-just-love-it/","cat":"art","id":"comment-73994","author":"David Goulet","site":"shroudstory"},{"title":"Most Scientists . . . Don’t You Just Love It","post":"Wiki says the samples were: a fragment of weave coming from an Egyptian burial, discovered in 1964 and already carbon-dated to 1100 A.D.;\na piece of mummy bandage carbon-dated to 200 A.D.;\na sample of the cloak having belonged to Louis IX of France and preserved in Saint-Maximin, Var, France, which had a verifiable provenance and was woven between 1240 and 1270.\nI don’t see, though, the results for the control samples.\n\n","date":"January 21, 2014 at 5:19 pm","url":"https://shroudstory.com/2014/01/20/most-scientists-dont-you-just-love-it/","cat":"art","id":"comment-74000","author":"David Goulet","site":"shroudstory"},{"title":"Most Scientists . . . Don’t You Just Love It","post":"Found the results in the Nature article. also found this note: “The three control samples, the approximate ages of which were made known to the laboratories…” Does that mean before testing began? That’s would be a bit dodgey if so.\n\n","date":"January 21, 2014 at 5:30 pm","url":"https://shroudstory.com/2014/01/20/most-scientists-dont-you-just-love-it/","cat":"art","id":"comment-74004","author":"David Goulet","site":"shroudstory"},{"title":"Most Scientists . . . Don’t You Just Love It","post":"I’m preparing an article on the radiocarbon dates for the June edition of the BSTS Newsletter. However, for a lot of fun, get onto OxCal Project (it’s free but you have to log in), and enter the Radiocarbon BP dates, for instant conversion into calendar dates via the latest calibration curve.\n\n","date":"January 21, 2014 at 7:12 pm","url":"https://shroudstory.com/2014/01/20/most-scientists-dont-you-just-love-it/","cat":"art","id":"comment-74029","author":"Hugh Farey","site":"shroudstory"}]
