[{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Pam is always interesting, if not convincing.\nI don’t buy this argument.\nHowever she touches on something interesting in terms of the image‘arrival and veneration or the Holy Mandylion in Constantinople.’ It looks like it is depicting the mandylion as a white cloth, but the long pink robe might be a kind of cryptic reference to the length of the shroud?\n\n","date":"June 12, 2014 at 4:03 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-128722","author":"Thomas","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"There are a few points to be mentioned here. Dr. Alan Whanger and other American Shroudies who helped him in his research were driven out of the realm of Shroud studies simply because they were accused of “seeing” things. In my view, it was one of the most unjust things to have happened in this field. For more, the very people who were poking fun at them were also encouraging others who were also “seeing” things, but this time in England:\nhttps://www.academia.edu/6568383/Does_the_Shroud_show_a_Mandaean_burial\nSo, it is permitted to “see” things in England, where ghosts are also “seen” — I am joking! — but not in the United States?\n\n","date":"June 12, 2014 at 11:18 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-128798","author":"Louis","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"This is a fascinating paper. If anyone  doubts it, they should honor us with a pointed rebuttal. \nI think Pam has been very even handed in the way she deals with this material. For example, she accepts, and recognizes, Ian Wilson’s Mandylion theory, but then rejects Ian’s earlier proffer of a “poker hole” explanation  of the L shaped burn holes. \nGiven the testimonies in the record already, I believe the Shroud’s presence in Constantinople  is as well established as it could be. It isn’t enough for a skeptic to reject it simply because he can’t accept it. That is the dreaded argument from incredulity. Although I must admit that  from the outset, I have rejected the argument that the moon is made of green cheese.\nPam’s paper is not green cheese. It is documented and worthy of serious discussion.\nThe burden has shifted to the skeptics to proffer an alternative explanation of the material.\n\n","date":"June 13, 2014 at 12:07 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-128984","author":"John Klotz","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"It is indeed a fascinating and well researched paper, and in Pam’s usual style, couched as a series of suggestions for other scholars to ponder rather slammed in your face as an indisputable fact, which is always refreshing. Her ideas about the Varangian guard are particularly interesting to me.\nHowever, a pointed rebuttal!\n1) I think Pam is probably correct about the poker holes – they are not deliberate. However I cannot see anyone insensing a picture of half someone’s naked back. I think the scenario would work just as well if the cloth were folded inwards rather than outwards, so that there was no visible image at all.\n2) The Pray manuscript has been discussed too many times to warrant it being brought up again. The rectangular blocks are clearly the tomb, not the cloth; the zigzag decoration looks nothing lke herring-bone and the little circles are either mere decoration or some feature of the  construction of the tomb and its lid.\n3) The pictures of the Manylion are quite specific and show a smallish cloth with fringes round the sides and a diamond pattern of dots connected with lines. This seems to have been a popular pattern – Pam shows a lectern covered with it as well. However it looks nothing like herring-bone, and I do not agree that it is an artistic representation of it. If anything it argues against the Mandilion being the Shroud.\n4) Pam implicitly wonders if the long purple cloth that accompanies the letter, the Mandilion and its box in various illustrations could be a reference to the Shroud. I think not, as it is found just about everywhere when a functionary carried something important. It is not impossible that the length of cloth used to carry something reflected its importance, which would give some kind of relevance to the term tetradiplon. \n5) The ‘Varangian’ guard illustration shows a man, probably an Emperor, being carried by his arms and legs. I do not agree that this is a reference to the Shroud, however odd or misplaced the picture may be.\n\n","date":"June 13, 2014 at 5:18 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129035","author":"Hugh Farey","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"‘and the little circles are either mere decoration or some feature of the construction of the tomb and its lid’ See my latest contribution to the Dan Scavone discussion. William Forsyth in his book on medieval French sculpture, which I don’t have in my office at the moment, lists several examples of small circular, always circular, holes in these tomb lids which reflected actual circular holes that had been placed in the Sepulchre in the ninth century but which the iconographic tradition seems to have treated as if they were original. So no need to claim that they are the ragged (i.e. clearly not circular) poker holes!\n\n","date":"June 13, 2014 at 5:39 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129040","author":"Charles Freeman","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"William Forsyth in his book on medieval French sculpture, which I don’t have in my office at the moment, lists several examples of small circular, always circular, holes in these tomb lids which reflected actual circular holes that had been placed in the Sepulchre in the ninth century but which the iconographic tradition seems to have treated as if they were original.\nCharles, if you have it (those are pictures, I presume), put a scan or something for us. This may be important.\n\n","date":"June 13, 2014 at 6:14 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129050","author":"O.K.","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"It’s in a footnote that lists all the examples of  small circular holes that are shown drilled in the tomb lids that he knows. I don’t have the book with me as I lent it out but when I do I will reproduce the footnote.The book is specifically about sculptures of Christ being laid out, lamented over, etc, which are very common in northern France. The Pray Codex fits within the same iconography rather than being a unique depiction as some seem to suggest.  There are other very similar layings out of the the corpse with its hands crossed as on the Shroud Forsyth has a number of sculptured examples.\nIt took me some time to realise that some people actually thought that the tomb lid was the Shroud but these decorated tomb lids are quite common in depictions of the resurrection.\n\n","date":"June 13, 2014 at 6:25 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129052","author":"Charles Freeman","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"“It’s in a footnote that lists all the examples of small circular holes that are shown drilled in the tomb lids that he knows. I don’t have the book with me as I lent it out but when I do I will reproduce the footnote”\nWhere is Andrea Nicoloti when you need him?\n\n","date":"June 13, 2014 at 8:09 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129072","author":"Mike M","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Two questions\n1. Are they “L”?\n2. When did “L” shaped holes first appear?\nWe don’t know when the holes first appear on the Shroud but we know they are there, that they are L shaped, they continue through two layers of the Shroud becoming less distinct with each layer.\nEvery “convention” has to have a point of origin. These mysterious “L” shaped holes had to originate some place, don’t you think? Why and how would such a convention come into being.\nWith all due respect, sloughing off the Pray manuscript is in my opinion absurd. There are  L shaped holes and they roughly correspond to the Shroud.\nIt’s not photograph. It’s a drawing of something the monk saw and he tried to replicate. It may not have been the Shroud but a representation of the Shroud perhaps generations removed from the Shroud. Even photographs copied and reproduced in  multiple generations lose detail in each generation.\nThe  “L” shaped holes are a fingerprint. That the fingerprint was frequently copied makes them more important not less, unless you can point to actual representations that are clearly the “L” shaped holes and could not have originated with the Shroud –  Sayancient China or Egypt circa 1 BCE or earlier – before there was a Christ or a crucifixion.\nIf you can’t,  all you have unsupported speculation from a skeptic. That and $5.00 buys a medium mocha at Starbucks.\n(And don’t give us I read it once i a book but I can’t find it now!!!).\n\n","date":"June 13, 2014 at 8:35 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129078","author":"John Klotz","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"I know exactly who has my book, a friend who has been travelling in Northern France and was interested in these sculptures. You can always find your own copy in a library and check me out! It is very obvious that this is not the shroud – there is not even a hint on the Pray Codex of the images which are the defining feature of the Shroud! I can’ t imagine whoever thought it was the Shroud.\n\n","date":"June 13, 2014 at 10:11 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129100","author":"Charles Freeman","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"I’m with you John. Charles and Hugh are wrongly applying 20th century rationalism to 12th century culture and mentality\n\n","date":"June 13, 2014 at 5:43 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129217","author":"Thomas","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"William Forsyth’s book is definitely not about “MEDIEVAL (my upper cases),French sculpture” but “Entombment of Christ: French Sculptures of the 15TH and 16TH (my upper cases) Centuries” (Cambridge, MA: Metropolitan Museum of Art/Harvard University Press). It is irrelevant here as far as 9TH-12TH CE Christ’s entombment iconography is concerned!\n\n","date":"June 13, 2014 at 8:39 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129079","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"No, the is the first chapter that looks at the antecedents of the later sculpture. Please don’t comment unless you actually know the book.\n\n","date":"June 13, 2014 at 10:13 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129101","author":"Charles Freeman","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Charles you wrote: “You can always find your own copy in a library and check me out! It is very obvious that this is not the shroud – there is not even a hint on the Pray Codex of the images which are the defining feature of the Shroud!”\nSince Forsyth didn’t even mention the 12th Hungarian Pray Ms miniature depicting Yeshua’s entombment in a book tackling 1450-1600 entombment of Christ iconography, according to you it means the HPM shall be dismissed… It speaks volumes the way you read the Forthsyth book and “the 1st chapter that looks at the antecedents of the later sculpture” to make your opinion!\n\n","date":"June 13, 2014 at 10:34 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129106","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"There might be something in the circles being holes on a tomb lid…..but why holes also on the lower cross filled rectangular shape….that is problematic for your holes on lid theory\n\n","date":"June 13, 2014 at 5:30 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129210","author":"Thomas","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"I repost here what I posted on another tread: \nCharles, you most misleadingly wrote again and again:\n“And it does not take long to dismiss the Pray Codex- there is a stepped pyramid pattern on the tomb cover, not a herringbone, and the holes are circular not ragged as the poker holes on the Shroud are. The ROUND holes are found in several depictions of the tomb lid as there were actually round holes drilled into the Sepulchre in Jerusalem which were copied by artists.”\nActually, it doesn’t take you long to totally miss… two crucial clues:\nThe Turin Shroud INNER SIDE weave pattern looks a herringbone pattern when viewed AT SCALE ONE. However when seen AT MACRO- or MAGNIFYING-SCALE, the same weave pattern can be drawn in iconic reduction (= for simplification’s sake) as FLAT SQUARE (= non-loopy/non semi-circular) -top stepped pyramid pattern. The Pray codex pen & ink drawing does show the same flat square-top stepped pyramid pattern as characteristic weave pattern unit evocative of the TS inner side bearing the image.\nIn medieval times, a protective marble sarcophagus with portholes used to protect the unction stone. In the Entombment of Jesus, by Nicholas of Verdun (1130–1205) in Klosterneuburg Abbey, this is precisely this sarcophagus type that cryptically features Yeshua’s burial bench.The two series of 4-5 SMALL round holes are NOT the portholes “drilled into the Sepulchre in Jerusalem” AT ALL. Are you kidding or blind?\nOn September 12, 2013 at 6:52 am, I already wrote:\n“Charles,\nwith due respect, iconologically speaking, it does seem you just cannot discriminate between drawing holy sepulchre portholes and small holes in the twilled linen fabric known as the Turin Shroud and are also not very familiar with medieval Benedictine monk cryptic art to say the least. (…) Methinks Fundamentalism and Arrogance are father and mother of Ignorance.”\nFor the earliest depiction (586 CE) of the flat square-top stepped pyramid pattern in conjunction with both Yeshua’s crucifixion AND EMPTY TOMB scenes, see the earliest crucifixion in an illuminated manuscript, from the Rabbula Gospels, Biblioteca Medicea Laurenziana, Florence, Italy\nRe earliest (symbolic) depiction of the blackened-rimmed burn holes, on October 16, 2013 at 10:24 am I wrote:\n“For another 390-400 CE mosaic cryptically and symbolically featuring the blackened-rimmed burn holes, see the Santa Pudenziana apse mosaic of Christ in majesty: black L (for Lumens Christi) marks the latter’s pallium (= Greek himation, a very large rectangle of fabric that can be draped as a shawl, a cloak, or a head covering; a current 4,20×1,40m for a 5ft 9-6ft tall man was the correct size; size much like the TS)”.\n\n","date":"June 13, 2014 at 8:47 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129082","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Hugh you wrote: “The rectangular blocks are clearly the tomb, not the cloth”. \nWrong.”The rectangular blocks” iconocryptically depicts BOTH on one hand the tomb and its lid and on the other hand Yeshua’s burial cloth inner side (or “warp side”) bearing the image and its ‘many-red-crossed’ fine transparent backing linen byssus.\nYou also wrote: “the zigzag decoration looks nothing lke herring-bone and the little circles are either mere decoration or some feature of the construction of the tomb and its lid.”\nWrong again (see my previous post).\n\n","date":"June 13, 2014 at 10:17 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129102","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Wrong? Me? How very dogmatic of you. Have you any actual evidence for your confidence? Or must we rely entirely on your paleoiconocriptographic authority?\nBecause I don’t.\n\n","date":"June 13, 2014 at 12:12 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129137","author":"Hugh Farey","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Hugh, what is REALLY dogmatic AND wrong is to assert, as you DID, “The rectangular blocks are CLEARLY (my upper cases) the tomb, not the cloth; the zigzag decoration looks nothing lke herring-bone and the little circles are EITHER mere decoration OR some feature of the construction of the tomb and its lid.”\nEver heard of “double visual entendre” in terms of cryptic iconography?\nActually, I do have iconographic evidence for my confidence.\nWhat are YOURS?\n\n","date":"June 13, 2014 at 8:39 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129254","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"About there not being a hint of the Shroud on the Pray Codex, you are just wrong. There is no debate but a profound difference of opinion about the facts. If you don’t see “L” shaped holes on the Codex than I am reminded of “None are so blind as those who will not see.”\n\n","date":"June 13, 2014 at 10:29 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129104","author":"John Klotz","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Max, John, everyone, I warned in this thread:\nhttps://shroudstory.com/2014/06/11/anticipating-the-conference-dan-scavone-on-evidence-of-the-shroud-in-edessa/#comments\nO.K.\nJune 12, 2014 at 5:03 pm\nDave, I have a feeling that Charles is simply looking for a pretext for another brawl here. As I have no time for this already, I suggest simply ignoring him for this moment.\n\n","date":"June 13, 2014 at 10:37 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129108","author":"O.K.","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"If you have evidence from both illuminations and sculpture that there depictions of the Resurrection scene with circular holes in the tomb lid and if you know that in the Sepulchre in Jerusalem there actually were circular holes in the tomb lid, then you tend to agree with experts such as Forsyth that one is a copy of the other. It defies the imagination that these are copies of the irregular poker holes, especially as the L goes in the wrong direction if the Shroud is viewed from the front (but perhaps after all it was viewed from the back which is why the artist did not see the images?). And how anybody can see herringbones in the tomb lid pattern is beyond me.\nWhoever had the imaginative genius to dream this all up in the first place? Max, Ian Wilson? – and who is going to be the first Shroudie to break ranks and admit that the emperor has no clothes? After all it hardly destroys the case for or against authenticity if it is admitted that there is no way that this can be the Shroud.\n\n","date":"June 13, 2014 at 12:30 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129139","author":"Charles Freeman","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Defies the imagination? That phrase defies meaning. Everything else you said is valid.\n\n","date":"June 13, 2014 at 3:18 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129182","author":"David Goulet","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Then why are there also circles on the ‘tomb base’ if that’s what you think it is ?\n\n","date":"June 13, 2014 at 5:50 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129220","author":"Thomas","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"I’ve always thought the herringbone weave idea was batty….but the pattern could easily be trying to represent weave in a more generic sense\n\n","date":"June 13, 2014 at 5:56 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129221","author":"Thomas","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Charles you wrote: “And how anybody can see herringbones in the tomb lid pattern is beyond me.”\nYou totally (and most deliberately?) miss the point! I repeat (just in case you cannot understand my English):\nWhen VIEWED AT MACRO- or MAGNIFYING-SCALE, the TS herringbone weave pattern can be DRAWN IN ICONIC REDUCTION (= for SIMPLIFICATION OF THE DRAWING) as FLAT SQUARE-TOP STEPPED PYRAMID PATTERN. The Pray codex pen & ink drawing does show the same flat square-top stepped pyramid pattern as characteristic weave pattern unit evocative of the TS inner side (or “warp side”) bearing the image.\n(Charles, methinks you still cannot discriminate between the warp and weft sides as far as the TS is concerned and you don’t have the eyes for simplified iconographic forms to represent the TS “warp side”. Shall I provide you with diagrams and tables to demonstrate it to your and Hugh’s utter shame?) \nFor the earliest depiction (586 CE) of the flat square-top stepped pyramid pattern in conjunction with Yeshua’s EMPTY TOMB scenes, see the illuminated manuscript, from the Rabbula Gospels, Biblioteca Medicea Laurenziana, Florence, Italy.\nCharles, you also wrote: “It defies the imagination that these are copies of the irregular poker holes”. Firstly, most likely they ARE NOT poker holes. Secondly, it only defies YOUR OWN short-sighted and short-brained imagination as far as the Sindon iconography is concerned.\nYou first wrote: “And it does not take long to dismiss the Pray Codex”. Oh, really? Actually methinks it does take YOU (and Hugh) a very long time to correctly decode the miniature.\n\n","date":"June 13, 2014 at 9:15 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129264","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Repeating things doesn’t make them clearer. But “Actually, I do have iconographic evidence for my confidence,” sounds more hopeful. What is it?\n\n","date":"June 14, 2014 at 3:42 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129338","author":"Hugh Farey","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Re repeating things and need for clarification:\nOn September 6, 2013 at 11:23 am, Charles wrote: \n“no one can persuade me that the stepped pyramid design on the coffin lid is a herringbone pattern – and I don’t see why anyone would want to copy the weave but not the images on the Shroud (not shown on the Pray Codex).”\nThe true fact is, in the HPM upper panel (unctio), Yeshua’s frontal body image is copied (implying the observer stepped back more than three paces to examine the Shroud’s inner side) but weave is left out. In the lower panel (visitatio), this is the reverse: Yeshua’s shroud weave (along with the relic’s many-red-crossed backing cloth) is copied (simplified drawing implying very close examination of the warp side bering the image) but body image is left out. Optically speaking, the 12th drawing does make sense under actual conditions of observations as the Shroud body image seems virtually to disappear like mist/completely the closer you step to it (namely within three paces) and reappears when you step back (namely beyond three paces). This is additional evidence if not proof. Charles TOTALLY missed it since his mind is set!\nOn September 6, 2013 at 12:54 pm, Hugh wrongly wrote:\n“I agree that the zig-zag pattern on the lid of the Pray manuscript tomb, and the crosses all over the body of it, are (sic) NOTHING TO DO (my upper cases)  with the shroud.” \nthe fact is I have crucial iconographic evidence to the contrary I will send Dan by e-mail to post in his blog as soon as I’ll have time to write away a flash illustrative reply.\nHugh also wrongly wrote: \n“[…] I think the illustration derives, second, third or fourth hand, from the marble surround of the holy sepulchre, and the apertures in it. The peculiar diagonal line of crosses might even be an attempt to depict a corner.”\nAs if, through copying one the other, the much larger port-holes “drilled into the Sepulchre in Jerusalem” could have turned into two sets of SMALL 4-5 black-rimmed holes and the said sets still not be strongly evocative at all of the TS sets of blackened-rimmed burn holes!?\n\n","date":"June 14, 2014 at 7:54 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129382","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"More repetition. Still no evidence. Just telling me I’m wrong is hardly likely to persuade me or anyone else otherwise. I still think the rectangular slabs are the tomb not the shroud, and that the pattern on them, and the holes, represent aspects of the tomb not the shroud. My evidence for this can be found by typing “Three Marys” into Google images, where you will find images such as this: http://taylormarshall.com/2011/05/three-marys-at-empty-tomb-saintes.html or this:http://www.wikiart.org/en/duccio/the-three-marys-at-the-tomb-1311 or this:http://www.journeywithjesus.net/Essays/20090406JJ.shtml or this:http://roughplacesplain.tumblr.com/post/46746360194/easter-the-three-women-at-the-tomb, all of which show a clearly angular patterned stone tomb and crumpled cloth grave-clothes.\nIf you have any evidence to the contrary, what is it?\n\n","date":"June 14, 2014 at 8:41 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129398","author":"Hugh Farey","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Hugh, \nyou wrote: “I still think the rectangular slabs are the tomb not the shroud, and that the pattern on them, and the holes, represent aspects of the tomb not the shroud.”\nCannot read my English or shall I repeat (you force me to):\nIconocryptologically speaking (the Benedictine monk artist’s cryptographic visual double entendre), “the rectangular blocks”  depict AT ONE AND THE SAME TIME the tomb and its lid AND Yeshua’s burial cloth inner side (or “warp side”) bearing the image and its ‘many-red-crossed’ fine transparent backing linen byssus/cloth.” \nHugh, don’t you be too impatient for me to prove you’re wrong in your opinion (“the zig-zag pattern on the lid of the Pray manuscript tomb, and the crosses all over the body of it, are (sic) NOTHING TO DO (my upper cases) with the shroud.”)\n\n","date":"June 14, 2014 at 9:24 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129411","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"One cannot but agree with Hugh Farey. If his examples are not enough, here are some more.\n\nhttp://www.getty.edu/art/gettyguide/artObjectDetails?artobj=3409&handle=li","date":"June 14, 2014 at 2:29 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129516","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Don’t you twist facts, please: I myself DO SEE a sarcophagus and its deplaced rectangular slab. No question.\nHOWEVER\nRe the Benedictine monk artist’s MOST CRYPTIC depiction of both sarcophagus and slab, to the initiated eye for iconocryptographic forms (see the face hidden in one of the Mary’s sleeves that gives “the cryptographic reading beat”), a fact just cannot be as easily dismissed: \nthe HPM cryptic depiction can operate at no less than three reading levels (or visual triple-entendre):\n–1st degree or literal/traditional reading level (a displaced marble onyx/alabaster slab and its cross-covered sarcophagus (a level neither you, Andrea, Alberto, Hugh, Davor, Charles and Collins cannot bypass as all you “fakists” most DESEPERATELY remain MENTALLY STUCK in it).\n–2nd degree or symbolical/allegorical reading level (Empty Tomb symbolic scene and Yeshua’s Victory-over-Death allegory in conjunction with the Holy Sepulchre and Byzantine church liturgy; a level all you most painstakingly only half reach).\n–3rd degree or crypto-figurative/evocative/non traditional reading level (Yeshua’s long burial cloth somehow folded in two yet partially sort of rolled up onto itself with wrinkles and rumples and its many-red-crossed fine transparent backing linen cloth showing with on top of it his fine transparent head band still rolled up unto itself).\nReminder: if you can see the Shroud weave you cannot see the body image and if you can see the body image you cannot see the Shroud weave. This is definitely what is alluded to/implied in the lower register (visitatio) and in the upper register (unctio) to the initiated eye. Now the question is: have you, Alberto, Andrea, Davor, Hugh, Charles, Collins,  got the initiated eye for iconocryptographic forms? You haven’t.\n\n","date":"June 14, 2014 at 4:01 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129551","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Typo:(a level neither you, nor Andrea or Alberto or Hugh or Davor or Charles or Collins can bypass as all you “fakists” most DESEPERATELY remain MENTALLY STUCK in it).\n\n","date":"June 14, 2014 at 4:03 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129553","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Hugh, you wrote: “the little circles are either mere decoration or some feature of the construction of the tomb and its lid.” Do you have late -antique and/or medieval iconographic evidence (e.g. clearly decorative distinctive L-shaped sets of four little circles or letter-shaped sets of five little circles + tomb depictions) for your confidence?\n\n","date":"June 14, 2014 at 9:06 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129406","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"The true fact is YOU HAVEN’T ANY!\n\n","date":"June 14, 2014 at 9:32 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129415","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"That’s perfectly true, Max. However, having established from my examples that the rectangular slabs are the tomb not the shroud, then it is a logical inference that the marks on them are marks of the tomb, not the shroud. \nNow what about some evidence for your flight of fancy about monks double entendres? Not repetition, evidence. I wish I could jump about shrieking The True Fact Is, You Haven’t Any, but every now and then, given enough goading, you do eventually come up with something.\nWhat about it, eh?\n\n","date":"June 14, 2014 at 9:41 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129417","author":"Hugh Farey","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Hugh, just beware of “your logic”/confidence when actually you have blind spots as far as image cryptology (here Benedictine cryptography/steganography) is concerned. I do have some evidence, even a crucial one to back up my claim while you finally admit YOU HAVEN’T ANY to back up yours in terms of clearly decorative distinctive late-antique and medieval L-shaped sets of four little circles or letter-shaped sets of five little circles + tomb depictions.\n\n","date":"June 14, 2014 at 10:27 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129438","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Max, everything I have is clearly expressed here so that everyone can understand my thinking. Paintings of marks on a box are intrinsically more likely to represent marks on the box than on a putative cloth lying in a crumpled heap on top of it. If you really have any evidence to contradict this, why not tell us what it is?\n\n","date":"June 14, 2014 at 10:55 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129446","author":"Hugh Farey","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Clearly the Pray Codex has signs from the Shroud:\n1-Jesus is naked (how common in 12th century art?)\n2- palms crossed at the Goin, no Thumbs visible (why would an artist lose the thumbs?)\n3- the upper panel focuses on Jesus while the lower panel focuses on the shroud itself. Clearly there is a zigzag pattern with two waving streaks of red lines in the lower left corner (indicating blood stains) and an L shaped set of holes (indicating the poker holes).\nIt takes a lot of faith to dismiss those as mere coincidence. Why would the tomb led has L shaped set of circles? Why would it have the red lines? When was a tomb decorated in such manner or in any manner whatsoever? It is ridiculous to claim that an artist can draw the weave and the image at the same time. Whoever said this can gladly demonstrate how this could be done.\n\n","date":"June 14, 2014 at 2:56 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129525","author":"Mike M","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"The illustrations in the Pray Codex are cartoon in style and not Italian Renaissance Art with its aspirations to realism, level of detail, strong colours, and perspective, nor for that matter even Byzantine art.  It is clearly intended to be representational only.  The codex is the first known attempt at a written work in the Hungarian language, with little preceding tradition behind it, and it must be seen as such.  Holes will not be shown with their ragged edges but merely as small circles; the pattern of the weave was not intended to withstand a textile specialist’s scrutiny, but merely indicated by its striking feature, a zigzag pattern.   \nMax’s principal arguments, succinctly summarised by Mike M, are strong evidence that the illustrator indeed knew of  the Shroud image.  It is reasonable that the oblique rectangular shape near the bottom of the picture, with its wavy edge and zigzag pattern is intended to indicate the Shroud cloth, rather than a tomb lid with straight edges, whereas the underlying slab with its cross marks (a different pattern) does have straight edges.  The four holes arranged in an L-shape and oriented square to the cloth edges, occur in the centre of this rectangle, i.e. on what may be taken as the cloth.  \nThe Klosterneuberg Pulpit illustration said to predate 1181 has some similarities with the Pray illustration, but is more stylised, the Christ has some draping (enshroudment?), appears as being placed into a burial casket (western burial practice), it is a Lamentation scene, not a post-Resurrection scene, and the oblique rectangle in the background might be construed as the lid of the casket.  But that is not what is seen in the Pray illustration, which aims at a kind of before-and-after depiction.\n\n","date":"June 14, 2014 at 5:37 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129582","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"I think this is another occasion when we’ll just have to differ. I think the shroud is the crumpled thing on top of the rectangular slab, that the zigzag lines look nothing like herringbone, and that the holes are part of the tomb, not the shroud, and you think differently. Nothing wrong with that. Max, however, claims he has “crucial iconographic evidence” to substantiate your belief and to undermine mine. If it exists, it would be very helpful. Perhaps it would persuade me, and Charles Freeman for that matter, that the Shroud is indeed older than the 13th century.\nBut there’s no sign of it…\n\n","date":"June 14, 2014 at 7:36 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129627","author":"Hugh Farey","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"By far the person most qualified to comment on this is an art historian. De wesselow is a well qualified one and argues authoritively that the image is based on the shroud.\n\n","date":"June 14, 2014 at 9:02 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129647","author":"Thomas","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Thomas, Not only De Wesselow is an art historian more capable in reading a painting than any of us here, but he also specializes in Medieval art covering the period in which the codex was painted. Furthermore, the fact that he is an agnostic/atheist  takes religious bias out of the equation. Unfortunately, Hugh won’t believe because he doesn’t want to believe. Recently, he seemed to know more forensics than Zugibe, Barbet and Bucklin. They must be wrong and he must be right because they differ on the details (re-position of the nail).\n\n","date":"June 14, 2014 at 10:58 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129674","author":"Mike M","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"The distinguishing feature of the Shroud is its double image that you cannot miss. There is absolutely no evidence of this double image anywhere on the Pray Codex so that rules it out for me straightaway and I cannot see, perhaps I have the wrong glasses, any other indication that this might be the Shroud – in fact almost all the evidence suggests cloths that are depicted are NOT the Shroud. Crossed hands over the pelvic area are very common in burials, certainly in Christian Europe they go back to the first millennium and eventually artists started to copy them in both east ( the epitaphios tradition) and west  for the burial of Christ so there is nothing unusual here. In fact, the Pray Codex is well within the normal iconographic tradition.\nI am still intrigued to know whoever started the idea that this was the Shroud and why so many people jumped on the bandwagon. They clearly know nothing of the division between east and western Christianity after 1054 and how difficult it would have been for heretical Catholics to get into the Greek Orthodox relic collections and even then whoever it was missed the images but somehow saw the poker holes. Please.\n  What do you lose in the debate over authenticity if you take out the Pray Codex?\n\n","date":"June 17, 2014 at 2:54 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-130154","author":"Charles Freeman","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Well said that man.\nHere’s a comment I placed on my own seditious site early last year that may answer your whodunnit question, Charles, or rather whoseddit.\ncolinsberry says:\nMarch 6, 2013 at 3:12 pm \nDavid Rolfe advised me to check out the recent TV documentary he did for the BBC, narrated by Rageh Omaar. It was ostensibly to see John Jackson doing his darnedest to whittle down, sorry up, the age of the Shroud, and making Oxford’s Prof Chris Ramsay feel obliged to check out Jackson’s wacky CO hypothesis (negative results, needless to say, which was entirely predictable from recalling undergraduate physics and chemistry). But in passing, we saw Ms.Mechthild Flury-Lemberg, the textile restorer, telling us that some inconspicuous little circles among the “herring bone weave” in one of the 4 Pray Codex illustrations were a “perfect match” for the L-shaped poker holes on the Shroud (they weren’t!). Shame it was neither shroud nor fabric of any description hosting those hugely diagnostic pen-drawn circles (looking more unmistakeably hole-like than any other tiny pen-drawn circles I have ever seen previously in my entire life ;-) but, sad to relate, merely the lid of a sarcophagus, which was patterned certainly, though not with a herring-bone weave. Towering oaks of mis- and dis-information from little acorns of mistaken sightings grow.\n\n","date":"June 17, 2014 at 3:07 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-130156","author":"Colin Berry","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Well thats an incredibly narrow view. You have ignored a whole range of possibilities that could easily explain the lack of double image.\nPlease explain the red streaks close to the angel’s foot. To me represent the blood on the shroud, possibly the streaks on the arms. Why on earth would there be 2 red streaks on a tomb lid.\nHow about the adjacent cross images in my view representing the image on the shroud?\nWhy two sets of holes and in such an irregular shape which de wesselow says make no decorative sense being assymmetrical?\n\n","date":"June 17, 2014 at 4:36 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-130173","author":"Thomas","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Please show me any images of tombs with holes which in any way resemble what we see in the HPM image. Holes on a tomb lid and tomb base. In assymetrical and non artistic compositional manner.\n\n","date":"June 17, 2014 at 4:54 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-130175","author":"Thomas","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"I personally see no hope of convincing those who swallow camels and strain at gnats and are predisposed against authenticity, no matter what proofs might come to light!  it is too much of a challenge for their world-view.  There is no other ancient object for which an explanation can readily be found, but one.  And they yet cry “ignorance is no argument of proof!”  Make one!  Too difficult!\n\n","date":"June 14, 2014 at 9:23 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129657","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Well said\n\n","date":"June 14, 2014 at 10:59 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129676","author":"Mike M","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"I thought Hugh was a practicing Catholic. Why would he be bothered by the Shroud being authentic?\n\n","date":"June 14, 2014 at 11:46 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129681","author":"Chesterbelloc","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Just for a handful of silver he left us,\n  Just for a ribbon to stick in his coat—\nFound the one gift of which fortune bereft us,\n  Lost all the others she lets us devote;\nRobert Browning: “The Lost Leader” 1845;\nOccasioned by Wordsworth abandoning the liberal cause.\nI now see the Dark Side has gained a recruit.\nI weep for the BSTS.\n\n","date":"June 15, 2014 at 12:25 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129686","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Are we getting a liitle extreme?\n(He says, fastening a pretty ribbon in his coat, pocketing his silver  (!!! – if only) and opening the door marked “Hornéd Ones Only”)\n1) Yes, I’m a practicing Catholic and it matters not a whit whether the Shroud was made 2000 years ago or 500 years ago or yesterday afternoon.\n2) If I had an emotional preference, I’d like the Shroud to be authentic. I like “real” things so much better than “artificial ones” and old things better than new, in principle. Mike’s comments are absurd. “Hugh won’t believe because he doesn’t want to believe.” For a start he knows nothing of what I will or won’t do, and for a second, belief is not a matter of personal preference! And “Recently, he seemed to know more forensics than Zugibe, Barbet and Bucklin.” This is nonsense too, as you all know. In recent posts Mike has repeatedly named this holy trinity of pathologists as a unified bulwark against all possibility of fraud, but has yet to cope with the fact that Zugibe, in particular, thought Barbet incompetent. I did not, as you have read, disagree with either of their medical opinions, but they cannot both be correct. For his own reasons Mike shovelled a major diagreement among anatomists about the position of the nerves of the hand into a convenient cupboard marked “detail” in order to emphasise that they all agreed that the shroud was a picture of a dead body.\n3) I have never swallowed a camel.\n4) The BSTS as usual, like shroudstory.com and shroud.com, has got a fair-minded, generous and kindly editor who represents everybody’s point of view impartially and does not let his personal incllnations intrude upon his editorship.\n5) Thomas de Wesselow is a very persuasive art historian with many sensible things to say about the Pray manuscript. His comments on the polystaurion, in particular, seem relevant, although I disagree with his interpretation. In particular, he has homed in on the five little circles on the lower, cross-covered rectangular shape. He does not comment on the fact that there are five, rather than the four of the shroud, and he does not even notice that there is a line of diagonal crosses interrupting the more rectilinear pattern at the same place.\n6) Don’t we all look forward to Max’s “crucial iconographic evidence”!\n\n","date":"June 15, 2014 at 4:28 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129715","author":"Hugh Farey","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"“For a start he knows nothing of what I will or won’t do”.. You are right, I don’t . But I can have an idea from what you have been doing.\n“belief is not a matter of personal preference!”.. I disagree, if not then where would bias come from, it wouldn’t exist. People have pre-conceived beliefs and they support them even when the evidence points otherwise. Here is is a nice study for you http://www.socialjudgments.com/docs/Bastardi_Uhlmann_and_Ross_Wishful_Thinking.2011.pdf\n“He does not comment on the fact that there are five, rather than the four of the shroud”\nHugh, you are doing it again. Dismissing the overall conclusion of a specialist based on a technicality. Just like you want to dismiss what you call the  “Holy trinity” of pathologists conclusion that the shroud image is that of a real scourged, crucified and dead man because for minor differences among them over the position of the nail.\n\n","date":"June 15, 2014 at 8:40 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129747","author":"Mike M","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Sorry, Mike, that’s what we scientists do. Overall conclusions are based on accumulations of detail, and one irritating little detail can throw a beautiful theory completely awry. Number of holes – well, it’s only a detail, pyramidal zig-zags looking nothing like herringbone – trivial distinction, big line of three diagonal crosses – sorry, not relevant at all! Well, I’m afraid I disagree.\nWhat bothers me a little, if I may express a personal opinon, is not that some people make a connection between the Pray manuscript and the Shroud. There are unexplained marks on the manuscript, and I can understand how the connection is made. I just disagree. No, what bothers me is that unless I wholeheartedly concur with these opinions, I am a bigoted non-believer, selling out to the devil. Is that what you really think? Thank goodness the BSTS Newsletter is in the hands of someone more evenhanded!\n\n","date":"June 15, 2014 at 10:09 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129757","author":"Hugh Farey","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"“No, what bothers me is that unless I wholeheartedly concur with these opinions, I am a bigoted non-believer, selling out to the devil”\nWhen did I say that? When I talked about ” you believe what you want to believe ” I was talking about the shroud’s authenticity not your personal, religious, beliefs. I never said any of what is quoted above.\n\n","date":"June 15, 2014 at 11:04 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129773","author":"Mike M","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"I agree mike that the 5 holes is a technicality. If the artist was working from memory or there were ‘chinese whispers’ that resulted in precision being foregone then that is plausible. After all the exact details of the gospels do not strictly align do they.\none could even argue that you could interpret 5 holes on the dorsal side of the shroud.\n\n","date":"June 15, 2014 at 4:19 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129826","author":"Thomas","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"My definition of a camel is non-representational sampling that had a lot wrong with it and yielded results that failed a chi-square test! And I think you’ve swallowed that one.\nTo run with the hares and hunt with the hounds is folly and can only lead to a disastrous outcome.  A first-century purser can vouch for that, and it didn’t do him much good!\n\n","date":"June 15, 2014 at 4:43 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129719","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Hugh:\nNo, what bothers me is that unless I wholeheartedly concur with these opinions, I am a bigoted non-believer, selling out to the devil. Is that what you really think? \nCalm down, Hugh. \nA week or two ago, I was making a week-long discussion with one sceptic (and his friends) on his own forum (so he was moderator, and could do with my posts whatever he want).\nDuring that discussion:\n* I was called moron several dozen times.\n* I was called “a fanatic” also several dozen times.\n* I had been once dehumanized and sent for compulsory re-education\n* I was being accused of ignorance in physics and differential calculus.\n* I was called “philosopher” and “humanist” (that was the worst insult).\n* My posts were either changed or removed several times.\nNevertheless, I prevailed, and my opponent simply run away from discussion under the pretext of “personal commitments”.\nSo sometimes patience pays off!\n\n","date":"June 15, 2014 at 10:33 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129762","author":"O.K.","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Sorry, Mike; I wasn’t continuing to refer to you specifically in my second paragraph. It was daveb who said (albeit somewhat tongue-in-cheek, I hope) that I had gone over to the Dark Side. However you have been at pains to suggest that I am simply adhering to pre-existing beliefs in the face of more or less incontrovertible evidence (bigoted non-believer). This isn’t true. I came to the Pray manuscript with an open mind, and have come to a different opinion from you. It’s not ridiculous, or a refusal to believe in the obvious truth, it’s as valid a position as your own. \nYou did say that it was “ridiculous to claim that an artist can draw the weave and the image at the same time.” Ridiculous, note. What about the Lirey Pilgimage Badge? I think that artist has achieved the ridiculous, don’t you?\nAnd OK, it’s OK. I too often been called fool, not least by eminent commentators on this very blog, let alone others. I spent a very entertaining couple of months with randi.com at one point, and and well aware of the vituperation permitted on less enlightened sites than this! And sporadically I have been – as when I misquoted Fanti about the propensity of bleached and unbleached linen to darken or lighten in sunlight. What fun Max had with that.\nIncidentally, if you’re reading this, Max, what about your “crucial iconographic evidence”? Is it unfair to begin to think it doesn’t really exist?\n\n","date":"June 15, 2014 at 11:37 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129777","author":"Hugh Farey","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"“What about the Lirey Pilgimage Badge? I think that artist has achieved the ridiculous, don’t you?”\nIncorrect, on the badge it’s either the body image or the background weave. Never both at the same time.\n\n","date":"June 15, 2014 at 12:15 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129782","author":"Mike M","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"“Incorrect, on the badge it’s either the body image or the background weave. Never both at the same time.”\nNope. It’s the two in juxtaposition, like a man against a herringbone weave background. \nThat’s because it’s the TS that is being represented, as distinct from a reconstruction of the Biblical narrative. \nNo L-shaped poker holes were thought necessary to help the observer make the correct identification (contrary to Ian Wilson’s claimed sighting of poker holes). The double image, crossed-hands, HB weave were considered sufficient, as indeed some of us think they were).\n\n","date":"June 15, 2014 at 12:34 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129788","author":"Colin Berry","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"“I am simply adhering to pre-existing beliefs in the face of more or less incontrovertible evidence (bigoted non-believer)”\nWrong again,  big·ot·ed definition;\n(having or revealing an obstinate belief in the superiority of one’s own opinions and a prejudiced intolerance of the opinions of others.)\n\n","date":"June 15, 2014 at 12:19 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129783","author":"Mike M","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Is there a weave over the raised body image? No. To paint a body image “juxtaposed” over the weave AND obscuring the weave it will be perceived as a body in a shroud rather than the image of a body on the shroud. To accurately paint the image of a body on a shroud and paint the weave at the same time you will end up with a mess of intersecting lines. Unless you know about the badge from before this is what you will preceive, a body in a shroud not the image of a body in a shroud.\n“No L-shaped poker holes were thought necessary to help the observer make the correct identification”\nHow do you know what an artist thought necessary to do? This is what happened when a scientists tries to pose as an art historian.\n\n","date":"June 15, 2014 at 12:51 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129795","author":"Mike M","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Please, let us leave the personal attacks out. The BSTS has never had a party line, so much so that it was also the policy of Ian Wilson when he was the newsletter editor and he is the first one to take to task anyone who claims to demonstrate that the TS is the genuine article with pseudo-science. He still does it and it is a demonstration of honesty.\nThere are Shroud websites which also made room for anti-authenticists, even for those who believe that Jesus survived the crucifixion and went to India, where he lies buried:\nhttp://holyshroudguild.org/uploads/2/7/1/7/2717873/the_quest_for_jesus_in_shroud_research.pdf.pdf\nThere are others, not in the least inclined to believe that the TS is authentic, in fact who ignore it, who believe that Jesus was buried, not in India, but in Talpiot:\nhttps://www.academia.edu/7138360/Jesus_was_not_buried_in_Talpiot_Part_III\nWhat do the Church authorities believe? The relic is not an article of faith and as I have stated more than once, the Creed does not say “..and was buried wrapped in the Turin Shroud.”\nTwo popes, and one Shroud custodian, have referred to the relic as an “icon”, so does that goes to say that they relied on the letter penned by Bishop d’Arcis, in what Geoffrey de Charny told Pope Clement V, and not in what pro-authenticity Shroudies have said?\n\n","date":"June 15, 2014 at 11:37 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129778","author":"Louis","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Icon or relic? In the Middle Ages there were a lot of artefacts , usually made for a religious purpose, that somehow acquired an aura of sanctity or  were associated with miracles. They became objects of veneration and accepted by the Church as such, even earning indulgences. A good example is the fifteenth century banner of the Virgin Mary protecting the people of Perugia from plague, still on show in the Oratory of San Bernardino in Perugia. When paraded it became associated with the cessation of plague and so an indulgence could be gained by visiting it.\nThe Church’s view from the 1390s, certainly to this day as endorsed by pope Francis, is that the Shroud has achieved ‘object of veneration’ status but no more than this, which is why in the 1390s there was no attempt  to stop it being  exposed at Lirey when it was still in the church there. (If the Church had believed it was an out and out forgery,they would not have allowed continued display.)\nWhen I read that the Shroud is either a deliberate forgery or authentic,  I insert  the third, and to me most likely possibility, is that it was made for some other religious purpose, achieved status possibly through causing (unrecorded) miracles, and then crossed the line between icon and relic, as Kennedy ,et. al. claim in the introduction to their edition of  de Charny’s Chivalry. The Church authorities were simply pushing it back where it belonged without undermining its status as an object of veneration.\nAs i have said before the Shroud of Besancon seems to have been in the same category as there is an  account that it was associated with the revival of a dead man. The ref. is F. Chamel, Le Linceul du Christ, Paris, 1902, p. 46, apparently citing the church’s Actes for the miracle.\n\n","date":"June 17, 2014 at 6:23 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-130188","author":"Charles Freeman","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"All I can say is that the Church is cautious, unwilling to make any pronouncement about authenticity because not enough data is available, be it scientific or historical. It is called “icon” but treated as a “relic”. Imaging can help, but to a certain extent, and it can also be controversial.\n\n","date":"June 17, 2014 at 6:16 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-130397","author":"Louis","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Dave you wrote: “Max’s principal arguments, succinctly summarised by Mike M, are strong evidence that the illustrator indeed knew of the Shroud image.”\nActually, Mike’s comment DO NOT summarise my principal arguments at all as far as the HPM folio 28 lower register cryptic data are concerned. \nIn order to correctly relate the simplified yet unexplained/cryptic iconic marks to the Shroud details it represents, no less than three iconographic pieces of evidence DO build-up into THE crucial iconographic evidence. \nReminder: the three still unexplained/cryptic marks are “the flat square-top stepped pyramid pattern” (instead of an herringbone pattern), “the line of three diagonal red crosses” (amid straight lines of the same pattern) and “the set of 4 small round holes on the upper, zig-zag-covered rectangular shape in conjunction with the set of 5 small round holes” on the lower, cross-covered rectangular shape.\n\n","date":"June 15, 2014 at 12:38 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129789","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"PS: My iconographic crucial evidence will also explain the significance of the two wiggly red lines.\n\n","date":"June 15, 2014 at 12:45 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129791","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"To MikeM (12:51pm)\nFirst para: sorry, non comprendo.\nSecond para.  Nope, am not posing as an art historian, perish the thought, merely an observer of artefacts of questionable artistic skill and value, focusing purely on those details the artisan has chosen to feature, those he hasn’t. \n(Remember: the mould for the cast lead/tin Lirey badge had first to be scratched onto soft stone – not everyone’s idea of high-minded art nouveau)\n The three independent lines of visual content (double image, crossed hands, HB weave) are all highly individualistic, or would be if unaware of context. They should be sufficient I suspect in most medieval French minds to say “Mais oui, c’est le, ‘ow you say it, “in-thing, must-see” Shroud of Lirey”? \nAdding poker holes, an accidental. latterly-acquired,  disfiguring, blemish, risked being the 14th century equivalent of inviting unhelpful comment from Relics-U-Like pilgrimage TripAdvisor.\n\n","date":"June 15, 2014 at 1:35 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129802","author":"Colin Berry","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Colin,\nRe-First para; very simple. If you have Shroud2.0 you can easily Comprendo. You can either see the weave or the body image. To see the body image zoom out, to see the weave, zoom in. You can’t have both at the same time. To paint a man (naked, crossed hands..etc) and paint the HB weave around it. The painting will be for a body in the shroud, this is not what you have in the empty tomb (the lower panel in the HPM). You cannot paint the empty shroud with both the body image and HB weave at the same time. Hope you understand now\n\n","date":"June 15, 2014 at 2:12 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129807","author":"Mike M","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Sorry, Mike M. You’ve still lost me.\nForget the HPM. Look at the TS – either Shroud Scope at top magnification, which I have, or, presumably Shroud 2.0 (which I don’t, but for which promotional copies are available on the internet).\n Of course you can see herringbone weave and image coloration in the same field of view. Why should they be impossible to view simultaneously, given that the image thickness is said to be 200-600nm, which  encompasses the range of wavelengths of ordinary visible white light between ultraviolet and near infrared –  much smaller than thread or weave dimensions?  If resolution is sufficient to see the weave, you can see the image and vice versa. It ain’t rocket science.\nWhy bother to make a distinction between the weave and the superficial image that resides on its surface? Kindly explain what point is being served.\n\n","date":"June 15, 2014 at 2:45 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129812","author":"Colin Berry","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"The distinction is between painting a body in a shroud vs the image of a body in a shroud.\n\n","date":"June 15, 2014 at 4:32 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129829","author":"Mike M","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"reminder: It also refers to “lateral neural inhibition” on examining closely the Shroud: under ACTUAL observation within three paces the body image is no longer detectable while the weave is; beyond three paces this is the reverse, the weave are no longer detectable while the body image is.\n\n","date":"June 16, 2014 at 3:44 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129932","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"I would like to clarify my comment of 4.19pm\nIf you look at the dorsal image there are more than 4 holes. Granted, there are more than 5.\nThe precise detail is not necessarily critical when we are likely dealing with a situation of hearsay eg. the HPM artist heard from someone, who heard from someone else who had seen the Shroud in Constantinople.\nWhat is critical is that there are 4 holes on the frontal, and more than 4 on the dorsal.\nOf interest, in Christian numerology the number 5 can relates to Christ’s 5 wounds from the crucifixion\n\n","date":"June 15, 2014 at 8:06 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129861","author":"Thomas","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"To Mike M: apologies – I failed to grasp the point you were making. Yes, the Lirey artist produced a medallion that, on its own, might have been interpreted as bearing the image of a real person laid out on linen. But that’s artistic licence, surely? He simply aimed for greater impact by representing the Shroud’s 2D image as a bas-relief, the casting technique making that technically feasible. It was arguably a way of flagging up to the badge’s owner and later viewers that the TS image was not to be seen as a mere painting, but, correctly or otherwise,  as an imprint created and left behind by a real person. Plus ça change…\n\n","date":"June 16, 2014 at 4:22 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-129935","author":"Colin Berry","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"On the “please show me” line of thinking. I agree that some aspects of the Pray manuscript do not appear to have contemporary parallels. However that does not necessarily relate it to the Shroud. In common with lots of similar scenes, it shows a rectangular box, an awkwardly placed lid, an angel posed on the lid, and a crumpled cloth. There are so many of these that to suppose the Pray manuscript shows something different requires a leap of imagination that I am not prepared to take. Max’s idea that the rectangular shapes are indeed the tomb, but with symbolic representations of its contents, make better sense.\nI do not think I have seen another picture of a sepulchre covered in crosses, although there are examples of scuptured ones, but it became a decorative feature of Byzantine textiles – specifically priestly garments – in the 11th century. The pattern seems to indicate ‘priestly contents’, as it were, and would apply just as well to a tomb containing a ‘priest.’ It need not indicate the shroud.\nMost of the similar tomb scenes show one side and one end of the tomb. The end wall mostly angles upwards, but in some cases only the top edge is angled and the bottom edge is as horizontal as the side wall. It’s a bit of an artistic challenge. This painting shows a very similar shape to the Pray picture (http://www.journeywithjesus.net/Essays/20090406JJ.shtml) and I think the diagonal line of crosses on the Pray picture may be meant to indicate the corner of the tomb.\n\n","date":"June 17, 2014 at 12:16 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-130261","author":"Hugh Farey","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Hugh, you wrote: “Max’s idea that the rectangular shapes are indeed the tomb, but with symbolic representations of its contents, make better sense.”\nShall I repeat, besides the literal/traditional reading level (a sarcophagus box and its lid) and the symbolic/allegorical level (Empty Tomb  scene as allegory of Yeshua’s Victory-over-Death in conjunction with the Holy Sepulchre and Byzantine church liturgy via the many-crossed covered rectangular shape reminding of crusader’s graffitis and the Byzantine polystauron, both as a liturgical garment and the Constantinople transparent fine linen backing cloth decorated with crosses), there is a third reading level (crypto-figurative/\ncrypto-evocative reading level definitely referring to the Constantinople/Turin Shroud blood decals and weave.\n\n","date":"June 17, 2014 at 4:38 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-130353","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Well, I agree with two-thirds of that, Max. What more could you hope for?\n\n","date":"June 17, 2014 at 5:20 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-130369","author":"Hugh Farey","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"On June 17, 2014 at 5:20 pm Hugh wrote:\n“Well, I agree with two-thirds of that, Max. What more could you hope for?”\nReply: You to agree with three-thirds (i.e. Benedictine iconosteganographic rendering of the Constantinople Shroud with its ‘many-red-cross’ covered backing cloth included).\nReminder for Charles, Hugh, Thomas and Dave:\n“To hide in plain view a secret message and/or image (too sacred to be shared with the vulgus peccum) within a corpus of innocuous religious miniatures, paintings, carvings and/or sculptures as if it were part and parcel of each composition is what the Benedictine arts of “(icono-)steganography” and “(icono-)cryptography” are all about.”\n(This is the opening sentence of my ‘flash illustrative reply’ paper entitled “Hungarian Pray Ms folio 28r lower ink drawing section: A late 12th c. CE Benedictine cryptic depiction of the Constantinople Shroud?”  and subtitled “More than meet the non-initiated eye”).\nSince I haven’t that much spare time at the momen, I hope to finish by the end of the week or middle of next week.\n\n","date":"June 18, 2014 at 4:35 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-130634","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"I cannot accept that the oblique rectangle in the Pray manuscript illustration of the women’s visit to the tomb is intended to represent a tomb lid.  I’m aware that there are other instances where such a rectangle may represent a tomb lid, but these are burial and lamentation depictions.  The bottom half of the Pray illustration is a post-resurrection scene.  \nIf the illustration is zoomed up to even moderate magnification, it is clear that the edge of the Pray rectangle is wavy; whereas the edge of the underlying slab is shown straight.  There are other cloths near the feet of the angel, some with + marks, a few looking like bandages.  There are three different patterns shown: 1) on the slab – the solid crosses and a few small circles; 2) on the oblique rectangle – a type of zigzag pattern with the four small circles arranged as an L;  3) on the cloths at the angel’s feet – a set of + marks. \nStrong arguments for the oblique rectangle being intended to represent the Shroud are: its wavy edge, i.e. a cloth; the zigzag pattern suggesting the herring-bone twill; the four circles arranged as an L.  To assert that this rectangle is intended to represent a tomb lid in this post-resurrection scene is I think just too much of a squirming wriggle!\n\n","date":"June 17, 2014 at 5:23 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-130372","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Well, with your permission I’ll just carry on squirming! I do not nor have ever compared the Pray Manuscript to Burial or Lamentation scenes. “The Three Marys” has a very strong iconographic tradition of its own, and in almost every case the depiction shows a rectangular tomb, an oddly placed lid, a posing angel and a rumpled shroud – and three Marys, usually carrying ointments. There is absolutely no tradition of a stiff shroud replacing the oddly placed lid (although either the lid or the shroud or both are occasionally omitted altogether). Jesus himself is an occasional invisible presence (we can see him, though), and guards, either asleep or in panic, are an option.\nThe decoration of the tomb is highly variable, and the decoration of the lid is often different from that of the tomb itself. Were it not for the little circles, no one would have thought it associated with the shroud for a moment.\nAh, but the little circles…\n\n","date":"June 17, 2014 at 5:55 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-130391","author":"Hugh Farey","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"I rarely seem to get answers from H PM skeptics to what I think are valid points.\nHugh….the holes are problematic for the skeptic. How about the red lines reminiscent of blood.\n\n","date":"June 17, 2014 at 9:27 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-130481","author":"Thomas","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"The holes are not all problematic as we know that there were actual circular holes in the Sepulchre in Jerusalem that artists tended to copy.  My goodness, there is a real desperation to see something, just anything, that might just overlap with the Shroud. It’s fun to watch from the sidelines.\n\n","date":"June 18, 2014 at 2:19 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-130586","author":"Charles Freeman","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"You are rather deviously avoiding the core questions, making it appear that your opinion is more authoritative than it actually is, so how about trying to answer questions?I’m quite comfortable changing my view if I see a compelling reason to do so.  \n– I don’t deny the existence of holes in sepulchres. But from what I know they are usually in a symmetrical or at least artistic pattern, not the assymetrical / non-artistic patterns seen on the HPM. And they are usually a lot larger than the tiny holes we see on the HPM. De Wesselow who is an EXPERT in things art historical supports these views (which I would note I have personally held for years).Please explain your objections to this.\n– Please explain why, if the object is a tomb lid, that there are two red lines which look very much like depictions of blood. Note these are next to the central cross-filled area of the object which I interpret as symbolising the body image on the shroud (which if true would have blood to just one side of it, and L shaped holes just to the other side of it, like the Shroud.) I don’t know of any precedence for a blood covered tomb lid.\n– If the cloth on top of the object is the Shroud, then it is very small. The artist is not that gifted, but I’m sure if it was the Shroud he would have made it look closer to full body shroud size. Rather it appears to be the size of a face covering cloth, in which case as per John’s Gospel account we would also expect to see the Shroud. And in fact we do here, because it is the object you think is the tomb lid. And the notion that the cloth is the head cloth is also suggested by the floating image of Christ’s  head nearby. \nI look forward to some proper attempts to address these questions rather than rhetoric.\n\n","date":"June 18, 2014 at 2:42 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-130591","author":"Thomas","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"I have just spent an hour or more scanning through very many images over several Google pages of “The Three Marys at the tomb”.  Most of the oldest ones were no earlier than the 15th century.  You can click on most of them to get larger views and some provenance info.  There is a ceiling fresco at Notre Dame cathedral dating to the 14th century which merely shows an angel and one of the Marys.  I think I came across only two that had representations of a tomb lid, both unpatterned.  In desperation I Googled “The Three Marys at the tomb Byzantine” but fared little better.  The one that came closest to anything like the Pray illustration is that by Duccio dated 1308-1311.  The tomb lid is at a similar angle to the Pray rectangle but is unpatterned.  Clearly it post-dates the Pray of ~1195.  Possibly the Pray illustration may have influenced this work.  \nIf anyone can point me to a selection of pre-1195 images of The Three Marys at the tomb with some similarity to the Pray illustration, including a patterned tomb lid at a similar angle, I’d like to know the URL of how to find them.  Meantime I think the arguments are too strong that the Pray rectangle is intended to represent the Shroud, or at least the illustrator has been influenced by what he knew or had heard about the Shroud.  And it’s ~1195!\n\n","date":"June 17, 2014 at 11:33 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-130535","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Dream on, Daveb, dream on.\n\n","date":"June 18, 2014 at 2:03 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-130579","author":"Charles Freeman","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"I gain confidence in the hpm theory from your lack of willingness or ability to address what are valid points.\n\n","date":"June 18, 2014 at 2:12 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-130583","author":"Thomas","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"The most valid point of all is that the main feature of the Shroud is its images. This is what distinguishes it from the many other medieval shrouds that also claimed to be the real burial cloth of Jesus. So how could the illustrator of the Pray Codex leave them out? To me this is absolutely conclusive. Whether  the illustrator had seen one of the more accessible shrouds, such as the one at Cadouin that was popular at this time, and copied that, I don’t know. But looking at the many other depictions of shrouds we see from the twelfth century on, I don’t think any specific one was copied  but there were certain iconographic traditions that were followed.\nCall me cussed but I am not going to see a Turin Shroud anywhere unless I see the two images that distinguish it from the other  shrouds around, several of which were also believed to be ‘the real thing’ and ,unlike the shroud that was claimed to be in ‘heretical’ Constantinople, were freely available to be seen by Catholic pilgrims.\n\n","date":"June 18, 2014 at 2:49 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-130595","author":"Charles Freeman","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"‘To the left of the Stone of Unction is the burial site itself. This is an ancient structure covered by a dome called the Rotunda. At the center of the Rotunda is a wood and stone structure that has enshrined the grave for over 300 years. This structure is the edicule. Round holes have been drilled in the sides of the grave.\nOn Easter festivities, tongues of fire burst out of these holes. Several days before this ceremony, the Holy Fire, pilgrims from all over the world position themselves so that they can get a glimpse of the sight.’\n From a description of the tomb of Jesus in Jerusalem.These holes are supposed to have been drilled in the ninth or tenth centuries and thus would have passed on to the illustrator of the Pray Codex and other illustrators, who may,of course, not have visited Jerusalem themselves and would have picked up the tradition and put them in.\n\n","date":"June 18, 2014 at 3:26 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-130612","author":"Charles Freeman","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"But just ‘why’ does there have to be a double image?\nConsider just one of probably a number of possibilities:\n– the sole objective of the HPM artist was not to accurately depict or record the shroud image, like some later artists. His main objective was to depict the resurrection event, but incidentally may have been aware (either through first hand witness or hearsay) of some of it’s characteristics such as the holes, and it was easy and efficient to depict them\n\n","date":"June 18, 2014 at 3:02 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-130605","author":"Thomas","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"‘the sole objective of the HPM artist was not to accurately depict or record the shroud image’. Well, that explains why we cannot see it!!\n\n","date":"June 18, 2014 at 3:27 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-130613","author":"Charles Freeman","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Ok, if you want to be smart… I could express it another way:\n‘the sole objective of the HPM artist was not to explicitly depict or explicitly record the shroud image’.\n\n","date":"June 18, 2014 at 3:37 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-130618","author":"Thomas","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"This image of Jesus in a tomb shows three large circles / holes on only the base (not the lid).\n\nThe size is totally different from the HPM, and the circles / holes are arranged in an artistic and decorative manner, as opposed to the rather random and no-decorative small holes/circles on the HPM\n\n","date":"June 18, 2014 at 3:09 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-130607","author":"Thomas","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Charles at 3.26am:\nHow many holes, in what sort of pattern? Do you have an image?\nThis is meaningless unless we can know the format of the holes.\n2 or 3 holes in a line, say, is just not comparable\n\n","date":"June 18, 2014 at 3:41 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-130620","author":"Thomas","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Just in case you’ll miss it:\nOn June 17, 2014 at 5:20 pm Hugh wrote:\n“Well, I agree with two-thirds of that, Max. What more could you hope for?”\nReply: You to agree with three-thirds (i.e. Benedictine iconosteganographic rendering of the Constantinople Shroud with its ‘many-red-cross’ covered backing cloth included).\nReminder for Charles, Hugh, Thomas and Dave:\n“To hide in plain view a secret message and/or image (too sacred to be shared with the vulgus peccum) within a corpus of innocuous religious miniatures, paintings, carvings and/or sculptures as if it were part and parcel of each composition is what the Benedictine arts of “(icono-)steganography” and “(icono-)cryptography” are all about.”\n(This is the opening sentence of my ‘flash illustrative reply’ paper entitled “Hungarian Pray Ms folio 28r lower ink drawing section: A late 12th c. CE Benedictine cryptic depiction of the Constantinople Shroud?” and subtitled “More than meet the non-initiated eye”).\nSince I haven’t that much spare time at the moment, I hope to finish by the end of the week or middle of next week.\n\n","date":"June 18, 2014 at 4:38 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-130636","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Reminder two:  Benedictine (icono-)steganography takes (icono-)cryptography a step farther by hiding an encrypted message/image so that no one suspects it exists. Re the HPM, ideally, anyone scanning the ink drawing section will fail to know they contains encrypted Shroud data unless he/she had been initiated to the sacred image.\n\n","date":"June 18, 2014 at 5:09 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-130643","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"“(icono-)steganography takes (icono-)cryptography a step farther by hiding an encrypted message/image so that no one suspects it exists.”\nTrumped: max-phiconosteganography takes (icono-)steganography yet another step further by hiding an encrypted message/image so well that no one but max-ph suspects it exists.\n\n","date":"June 18, 2014 at 5:31 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-130650","author":"Colin Berry","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Arrogant ignorance of (Benedictine) steganography from a blindfolded scientific foodie strikes back!\n\n","date":"June 18, 2014 at 6:18 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-130663","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"De Wesselow, a Medieval Art Historian (though ignoring all about Benedictine iconosteganography) suspects it exists too. Can English foodie Colin Berry turn into a Medieval Art Historian AND professional image cryptologist/cryptanalyst overnight, I very much doubt it.\n\n","date":"June 18, 2014 at 6:25 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-130664","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Charles F: “Dream on, Daveb, dream on.” \nBut neither Charles nor Hugh, despite all their claimed expertise in the topic, nor yet anyone else, apparently has yet been able to answer my honest question at Jun 17, 11:33pm:\n“If anyone can point me to a selection of pre-1195 images of The Three Marys at the tomb with some similarity to the Pray illustration, including a patterned tomb lid at a similar angle, I’d like to know the URL of how to find them.”  Perhaps there are none!  All I’ve been able to find are a few post-1195, one only might have had a pattern!  Do they exist or not!  Or is it possible that the Pray influenced later representations of the Three Marys, and the artists construed the rectangle as a tomb lid, despite its wavy edge, its L holes and its zigzag pattern?  Max seems to see these features as a cryptic message. Perhaps he’s right! \nI fail to see where dreaming comes into it!  It’s an ‘ad hominem’ devoid of any evidence responding to the substance of the objection!\n\n","date":"June 18, 2014 at 5:41 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-130654","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"To foodie aka Colin Berry:\nTo paraphrase Blaise Pascal famous sentence: \nIn iconosteganography and iconocryptography\nThere are enough light and signs\nFor those who can see and hear\nAnd enough shadows and ‘mental background noise’ patterns\nFor those who cannot or won’t\n\n","date":"June 18, 2014 at 6:30 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-130666","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Hope I’ll succeed to demonstrate to you all how the Constantinople Shroud with its red-crossed backing cloth (now kept in Turin with a different backing cloth) was camouflaged into a sarcophagus box with its oddly displaced lid in the HPM…\n\n","date":"June 18, 2014 at 6:59 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-130676","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Daveb’s point is certainly pertinent. If, however, later “Three Marys” derived from the Pray picture, their artists clearly understood the skewed rectangle as a lid, not a sheet. However I don’t think the iconography of the Three Marys does stem from this picture. Queen Ingeborg’s Psalter is contemporary and shows a very similar scene, including a skewed lid, and there are earlier versions from the 10th century onwards with some of the relevant elements: from Italy, in Met Mus Art (10th Cent – ‘house’ style tomb with shroud, angel sitting on skewed surface), the Pontifical of Westminster (10th Cent – San Baudelio, Spain (no lid or shroud),  San Miguel, Estella, Spain (two angels lifting the lid, shroud in tomb), Aachen (1020, Antependium of Otto II, including skewed platform for angel, but a ‘house’ style tomb with shroud inside), the Bamberg Apocalypse (11th Century – angel sitting on sarcophagus, no lid, shroud in ‘house’ style tomb)  and several others.\nThomas’s points are also valid, and I have not failed to address them. My response to the little circles is really “I don’t know.” I agree that they do not seem to be purely decorative, but I disagree that they are anything to do with some accidental chars in the shroud. I do not think that my ignorance should be taken as supportive of any hypothesis, however. On the Pray drawing of the seated Christ an acolyte also has rather clumsily placed little circles on his clothes, and it looks as if the artist started to fill the central strip and then gave up. I differ from Charles here in that I don’t think they represent the oculi, which if present always play a more prominent part in the design.\n\n","date":"June 18, 2014 at 7:59 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-130691","author":"Hugh Farey","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Thanks Hugh.\nWell, the circles in the HPM were done for some reason. You agree they don’t make much artistic / decorative sense. Its impossible to get inside a 12th century artist’s mind, but if they were not decorative then to me at least influence from the Shroud’s holes is a reasonable explanation, especially given their L shaped nature.\n\n","date":"June 19, 2014 at 5:34 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131158","author":"Thomas","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Good that you acknowledge the circles make little if no decorative sense. Why the easy dismissal that they may represent the holes on the shroud?  Please explain.\n\n","date":"June 20, 2014 at 8:12 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131891","author":"Thomas","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Lots of stuff posted while I was writing that.\nThomas: I’m not sure why, if the number of holes (4 or 5) is irrelevant to the Pray tomb being the Shroud, it really matters about the number of oculi drilled in the tomb.\nMax: It’s no use reminding us of evidence that doesn’t (yet?) exist. Produce it.\nDaveb: http://www.pinterest.com/pin/543528248748686042/ and http://imagesonline.bl.uk/index.php?service=search&action=do_quick_search&language=en&q=%235996\n\n","date":"June 18, 2014 at 8:14 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-130696","author":"Hugh Farey","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Hugh wrote: “Max: It’s no use reminding us of evidence that doesn’t (yet?) exist. Produce it.”\nI will in due time produce old and new pieces of evidence that do exist (I am very busy at the moment and have no time for writing away even a 6 page article). Methinks Hugh and Colin have quite a lot more spare time than I have for studying the TS and being impatient in my “flash illustrative reply” paper…\n\n","date":"June 18, 2014 at 8:32 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-130699","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Typo: Methinks Hugh and Colin have quite a lot more spare time than I have for studying the TS and being impatient to be proven wrong in my “flash illustrative reply” paper\n\n","date":"June 18, 2014 at 8:34 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-130700","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Thank you Hugh for the Three Women at the tomb references, which is precisely what I was looking for.  Both predate by a few decades the Pray manuscript.  The Cologne example has a patterned lid, four crosses with circular decorations in the crosses’ quadrants.  The Ingeborg Psalter has a plain undecorated lid.  Both lids are skewed in a similar way as the Pray rectangle.  You mention other earlier works which I have not pursued. \nThere are distinctive variants in the Pray example:  1) There is no box or casket evident; the underlying base is a slab;  2) A tomb lid without a box or casket would be meaningless as such;  3) The skewed rectangle might be considered perhaps as a stylistic copy of a feature from the other works;  4) The feature may therefore  have been intended to represent something else;  5)  The rectangle’s wavy edge compared to the slabs straight edges, the zigzag pattern, and the four holes set in an L shape square to the rectangle, are highly suggestive of a cloth rather than a tomb lid, specifically the Shroud cloth;  6) I consider Charles’ reference to the fire holes in the Stone of Unction Rotunda as quite irrelevant in the context of any of The Three Marys representations; he might well choose any other set of random occurrence of holes.  \nI think there are sufficient indications in the Pray rectangle that it may well be intended to represent the Shroud cloth, and that remains my view of the matter.  Others may choose to have a different view and not see it as such.  But I think they are mistaken.\n\n","date":"June 18, 2014 at 4:34 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-130906","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"It appears that at some point a Shroud ‘researcher’ who knew nothing about the iconography of depictions of the Resurrection mistook the tomb lid as an actual depiction of the Shroud. Quite apart from the mistaken belief that this was a shroud, the fact that the  pattern was stepped pyramids and not herringbones and that the holes were circular and that the L went the wrong way for a copy of the ragged and uneven poker holes, for some inexplicable ( well to me at least) reason this became a bandwagon from which it it seems impossible to pull some people off.\nNo matter that there would be no reason to depict the poker holes but not the images.  No matter that depictions of cloth relics, such as the hundreds of cases where cloths with the living face of Christ ( Edessa, Veil of Veronica and others) are always shown with the images intact by the artist. Here the artist has struck out on his own and produced a Shroud of Turin WITHOUT the double images that distinguish it from the other Shrouds being displayed as relics of the burial in this period. No matter that there were circular  holes drilled into the Sepulchre in the tenth or eleventh century ( the sources seem to differ on the date  but they were there for all the Crusaders to see at the time of the First Crusade (1099, capture of Jerusalem) and thousands of crusaders would have flooded back to Europe with the knowledge that there were circular holes in the sepulchre  which by the twelfth century had become part of the iconography). No matter that it would have been virtually impossible at this date for a heretical Catholic to get into the Byzantine imperial relic collections. No matter, no matter.\nAnd all to suggest that the Shroud was around, as were many other ‘burial shrouds’, by 1195.\nI do believe that anyone who swallows this is dreaming. Much of the debate seems to rest on the conviction that this IS the Shroud WHATEVER and so there MUST be some explanation for every piece of evidence that this NOT the Shroud.\nP.S. Those who have read Beldon Scott’s major study of the Shroud will know that the holes from the fire of 1532 did become an object of veneration in the belief that the fire had miraculously stopped or been stopped without damaging the sacred images. This, according to Beldon Scott, is why they  were always depicted with such care by artists. But the poker holes  were never seen as sacred.\n\n","date":"June 19, 2014 at 3:13 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131123","author":"Charles Freeman","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Thank you Charles for your further comments on this issue.\nI should think that an all-important question in any artist’s work, is “What is the subject he is intending to depict?” Then there are the questions of secondary messages that the artist also wants to communicate.  \nIn the various depictions of the Veronica, Image of Edessa, Mandylion etc, I could only agree that the principal subject is clearly the living face of Christ.  In all the various depictions of the visit of the Three Marys to the Tomb that I have seen, it is clearly the sense of wonder at the realisation of the Risen Christ.  I can recall no instance where the Shroud image was featured in any of these works, even as late as the 1500s, even though the Shroud was known to have been in Europe during the previous 200 years or so.  Most of the artists would have been aware of the Shroud, and they would need little imagination to associate it with the Resurrection.  But they never chose to represent it in these scenes. \nThe Lamentation scenes and the epitaphioi first seem to appear as early as about 1200, often depicting a Shroud-like image of the Christ recumbent in death.  The Stavronitska is a particularly good example, showing both scourge marks and blood flows.  The subject is always the depiction of Christ in death, sometimes including the burial rite by the mourners. \nThe Pray illustration is perhaps our first known attempt at representing the burial of Christ in a Shroud-like posture, completely naked, crossed hands near the groin, no thumbs.  The lower illustration is of course not the first known attempt at the Resurrection morning visit.  The subject remains the sense of wonder at the realisation of the Risen Christ.  The subject is not the image of Christ in death, nor the image on the Shroud.  Even if the artist knew of the image, it would not be within his purpose to depict it. \nHoles are visible on the underlying slab, and also on the slanted rectangle.  Perhaps these may be an echo of what crusaders had seen on the Jerusalem tomb.  The holes in the slab seem to be arranged randomly, whereas those on the rectangle are arranged as a deliberate L, in a similar pattern as on the Shroud.  However, a slab is not a casket, such as is clearly depicted on the Cologne and Ingeborg Psalter examples.  A tomb lid is therefore meaningless in this context.  But the artist has followed a tradition in showing the general shape of having a slanted rectangle, \nYou may see pyramids.  I see a zigzag pattern, quite like the herring-bone twill.  I also see that the edge of the rectangle appears wavy, not straight, suggesting a fabric.  The arrangement of holes in an L shape is the clincher for me.  I think there is a secondary message that the artist is subtly attempting to convey, but without distracting attention away from his principal subject.    \nI do not see this as dreaming on my part, but more as perspicacity, obvious enough for anyone else with eyes to see.  You may see a tomb lid, even though there is no casket whence it might have been.\n\n","date":"June 19, 2014 at 6:30 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131174","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Daveb. If ,for whatever, reason, you have to see the Shroud in the Codex, you have to do what you have done and claim that the artist for some reason of his own was not, unlike the usual illustrator, actually painting a narrative picture but somehow creating a cryptic message through symbols. But why should he go against the whole artistic traditions of his time- why is he trying to pass on some secret message when he could simply have painted the Shroud as it was? No doubt you can reply by imagining some reason but you will simply be piling up improbability onto improbability. Your basic problem is that you HAVE to see the Shroud but you or no one else would ever have seen it if someone had not misled you in the first place. I wonder who.\n\n","date":"June 19, 2014 at 8:12 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131200","author":"Charles Freeman","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Oh dear, so  narrow Charles, so narrow\n“the fact that the pattern was stepped pyramids and not herringbones and that the holes were circular and that the L went the wrong way for a copy of the ragged and uneven poker holes, for some inexplicable ( well to me at least) reason this became a bandwagon from which it it seems impossible to pull some people off.”\nWhat don’t you get man? Is the L going the wrong way really so problematic, especially if the artist was working from memory or hearsay?   \n“No matter that it would have been virtually impossible at this date for a heretical Catholic to get into the Byzantine imperial relic collections.” How bout the strong Hungarian / Constantinople connections of the time?\n\n","date":"June 19, 2014 at 5:42 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131162","author":"Thomas","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Thomas – I think that if this is the shroud which I don’t believe for a moment, then it could be evidence that it was already in the west by this time.\nI don’t think  ‘narrow’ is the right word for someone who is not convinced by the evidence- it might be more appropriate for someone who is convinced despite the lack of any evidence!\n\n","date":"June 19, 2014 at 7:58 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131196","author":"Charles Freeman","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Further response to Charles:  We do not know if the illustrator of the Codex Pray had seen the Shroud or not, but he clearly knew of it.  This is evident in the recumbent Christ which also happens to include a blood stain on the forehead.  That knowledge of the Shroud had penetrated to the West by 1195 is evident  from a) English pilgrim of 1150; b) Icelandic Nicholas Soemundarson 1157 inventory of the imperial relic collection; c) Archbishop William of Tyre 1171; d) also 1200 inventory of Antonius of Novgorod.  There may well have been others.  Earlier Byzantine records provide sufficient evidence of the Shroud’s actual presence in Constantinople.  \nThis is more substantial evidence than any that might place the Shroud in early medieval France, for which there is none, but which you apparently favour yet with nothing to substantiate it.  \nThe illustrator has no need to show the Shroud image, in the visitation scene; it is already present in the recumbent Christ above.  Nevertheless he hints at it symbolically.  \nYou may consider me misled.  I might respond with epithets of blindness and obstinacy, but there is no need for that.  As for improbability, I think there is more evidence that the Pray illustrator knows of the Shroud, than any you might be able to muster for any Frankish theory.\n\n","date":"June 19, 2014 at 5:08 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131419","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Dave, do not worry.\nI plan soon to write a paper that hopefully should put an end to this debate about the Pray Codex, once and for all!\nJust wait.\n\n","date":"June 19, 2014 at 5:19 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131422","author":"O.K.","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Wot worry?  Who, me??\n\n","date":"June 19, 2014 at 6:15 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131445","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Daveb. I don’t favour any one theory over another, other than the probability, rising from my own work on relic cults, that the Shroud is medieval.\n   My point in all my contributions is to highlight areas where the evidence does not stack up. The fact that all you can now say about the lower register of the Pray Codex is that the illustrator ‘hints at the [Shroud] symbolically’ says it all to me- why should he not just show it- as other illustrators show the Images of Edessa and Veil of Veronica -why the secrecy? ‘Hints’ are not good enough and we are concerned with the Shroud AFTER the Resurrection not BEFORE as shown in the upper register. We have lots of examples of Christ’s body being laid out- I have been communicating with a US scholar who has done extensive work on this.  The Pray Codex is an excellent example of its time in showing no flowing wounds while  a hundred years later these wounds, still bleeding, are beginning to be illustrated in these scenes. The blood on the Shroud (and I am being neutral here) is either because it is blood from an actual body or because it is somehow related to the blood cults of the thirteenth /fourteenth centuries.\n    I am also trying to highlight the many areas of research that still remain to be examined so far as the Shroud is concerned, notably the documented trade/import (including the Crusades) of relics directly from Jerusalem (even from ‘the Lords’ tomb’)  to northern France.It may well be that relevant documentation is lost but to dismiss this area of research altogether is simply unscholarly (might I even say ‘narrow?’). On what grounds do you reject it as not even worthy of further examination, especially as it is not incompatible with the possible authenticity of the Shroud?\n    One of the major problems is that there are all too many shrouds out there all claiming to be the real thing and this is why I only would accept depictions or descriptions of a Shroud depicted with a double image as evidence of the one which is now known as the Shroud of Turin. One must also remember that we have documented examples of thousands of painted linens used in churches for various ceremonial purposes (and never claimed as relics) and this complicates research still further.\nAs an old-fashioned historian trained in a particular way to examine and assess evidence, I have to admit to finding Max incomprehensible – in a class entirely of his own!\n\n","date":"June 20, 2014 at 4:36 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131610","author":"Charles Freeman","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Charles, I thought you were smarter…\n\n","date":"June 20, 2014 at 7:48 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131660","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Charles wrote: \n“Here the artist has struck out on his own and produced a Shroud of Turin WITHOUT the double images that distinguish it from the other Shrouds being displayed as relics of the burial in this period.”\nAbsent the fact the Ts man’s body is invisible when the weave pattern is visible (through lateral neural inhibition), had the Benedictine monk artist depicted Yeshua’s body image with outline in the Three Holy Women Visitation at The Empty Tomb scene, it would have been at cross-purpose to the very idea the tomb was EMPTY on that morning. Hope you get the idea…\n\n","date":"June 19, 2014 at 7:18 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131470","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Yes exactly Max. The artist was not skilled in 3d artistic representation and a ‘flat’ representation of Jesus’ s body could have easily looked like a body rather than image – as you say being at cross purposes to a resurrection scene.\n\n","date":"June 20, 2014 at 8:04 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131888","author":"Thomas","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Charles:  You say: “The fact that all you can now say about the lower register of the Pray Codex is that the illustrator ‘hints at the [Shroud] symbolically’ says it all to me- why should he not just show it- as other illustrators show the Images of Edessa and Veil of Veronica -why the secrecy?” \nThis tells me that you have utterly missed the point, you have failed utterly to take on board anything that anyone on this site has had to say about the Pray Codex;  that you are stuck in a skeptical rut, unbelievable in one who claims artistic credentials in religious works; you fail to understand the illustrator’s intention, or the subject of the illustration. \nNotwithstanding a family member is a notable NZ artist with several professional commissions to her credit, I have few such pretensions about my own abilities in the field of art.  But even I know that it is necessary to look beyond the self-evident particularly when it comes to viewing religious works. \nI regret I see no further point in continuing what to me has been a most frustrating and unrewarding discussion.\n\n","date":"June 20, 2014 at 6:22 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131637","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"I regret I see no further point in continuing what to me has been a most frustrating and unrewarding discussion.\nSee, Dave? I warned:\nO.K.\nJune 12, 2014 at 5:03 pm\nDave, I have a feeling that Charles is simply looking for a pretext for another brawl here. As I have no time for this already, I suggest simply ignoring him for this moment.\n\n","date":"June 20, 2014 at 6:27 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131638","author":"O.K.","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Daveb, I don’t think what we are doing here is unrewarding. My aim has never been to convince the skeptic to change their mind because I know they won’t. These discussions are viewed by other spectators and they matter the most. It doesn’t take long to see that we make more sense to them, and that is what matters the most. You sow the seeds, God takes care of the growing part.\n\n","date":"June 20, 2014 at 8:27 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131671","author":"Mike M","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"These discussions are viewed by other spectators and they matter the most. It doesn’t take long to see that we make more sense to them, and that is what matters the most.\nMike, it is not so easy.\nThere is such think as eristc -and Charles is a master in it.\nRead this http://coolhaus.de/art-of-controversy/\n\n","date":"June 20, 2014 at 8:36 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131673","author":"O.K.","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Thanks OK, lots of good information about debate there.\n\n","date":"June 20, 2014 at 11:18 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131709","author":"Mike M","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"To Charles et al, \nMark my word: I will prove beyond the shadow of a rational doubt the sarcophagus box & lid do cipher/’steganograph’ the ‘Theophoron (= Christophoron) Sindonos’ aka’ sindon tetra(di)plon’ aka Constantinople Sindon/Sydoine aka Turin Shroud. Stay tuned.\n\n","date":"June 20, 2014 at 7:32 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131655","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Can’t wait.\n\n","date":"June 20, 2014 at 8:41 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131674","author":"Charles Freeman","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Nice to year you can’t wait to be proven totally wrong!\n\n","date":"June 20, 2014 at 8:52 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131679","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"I don’t think that not believing the same as somebody else can be fairly described as looking for a pretext for a brawl. I think that’s unfair. As you know I agree with Charles, but I am not looking for a pretext for a brawl. I want to know what makes people think differently from me – there may be aspects I hadn’t considered which will make me adjust my stance. I had not really considered the polystaurion design in relation to ecclesiastical vestments before, for example, and Daveb’s challenge to find earlier examples sent me scouring the internet most fruitfully. Overall, I do not find the Pray-Shroud connection sufficiently convincing for me to chamge my mind yet, but if the promised papers from Max and OK are as definitive as they say they will be, perhaps I will!\n\n","date":"June 20, 2014 at 12:57 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131745","author":"Hugh Farey","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Hugh, the Codex Pray has been discussed here so many times, that any mention that Codex Pray must, or mustn’t be related to the Shroud can be viewed as provocation.\nIn fact, I think the dispute is quite easy to solve, but one must have proper methodological approach to it. I try to show it later, as I have no time now to write a new paper, and Dan has no time to post it all around here (he still has an info from me about Kornelimünster relics to be posted).\nAnyway, Hugh, have a look at this; https://shroudstory.com/2014/06/18/the-manoppello-this-little-cloth-cannot-be-further-ignored-in-shroud-research/\n\n","date":"June 20, 2014 at 1:08 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131750","author":"O.K.","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"‘ provocative’ Well, that is very sad because it means new ideas and approaches to the evidence or lack of it are condemned out of hand.\n\n","date":"June 20, 2014 at 3:10 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131786","author":"Charles Freeman","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"There is room for both those who believe that on the balance of evidence that the Shroud is authentic and those like myself who believe that this unlikely to work together to open new avenues of research and accept that others, once favoured, are now redundant – I would put the Pray Codex in the redundant box, partly because it adds nothing anyway. (I suspect Hugh is in the same camp as I am.)\n. The presentations at the St. Louis conference suggest that research is stagnant and largely repetitive. What is likely is that the solution to the ‘ mystery’ of the Shroud will come from outside the Shroud community probably from someone working on other linen artefacts, medieval or  earlier, or iconography. There seems no awareness in the Shroud community as to just how much expertise on things like medieval linens and a ancient weaving techniques h ave moved on. Many are still stuck in the technology of 1978 as if that decided the composition of the Shroud and its images for all time.\nWith research within the Shroud community so stagnant it seems likely that someone who has had nothing to with the Shroud,  will come up with some evidence, probably relating to some other issue, that convinces the wider world for or against the authenticity of the Shroud. And the Shroud community risks being left on the sidelines either way.\n\n","date":"June 20, 2014 at 3:39 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131797","author":"Charles Freeman","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":">>With research within the Shroud community so stagnant it seems likely that someone who has had nothing to with the Shroud, will come up with some evidence, probably relating to some other issue, that convinces the wider world for or against the authenticity of the Shroud. And the Shroud community risks being left on the sidelines either way.<<\nThat may have already happened to an extent with de Wesselow's book. His theories don't give particular comfort to either side in this debate, but he's definitely not part of the \"shroudie\" camp, and he did bring fresh insights from his point of view as an art historian.\n\n","date":"June 20, 2014 at 5:01 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131829","author":"Chesterbelloc","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"I have sent my posting to Dan. I want it to be easily viewed by anyone, instead of looking for it in a jungle of comments.\nI hope Dan will publish it very soon…\n\n","date":"June 20, 2014 at 3:43 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131798","author":"O.K.","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"I look forward to it. Meanwhile, you’re quite right that the Pray manuscript has been discussed many times. in my first comment to this post, above, I made various other points. One that seems worth raising again, because it concerns ‘the herringbone weave’ again, is Pam’s suggestion that the pattern of dots joined by lines in the shape of a diamond ‘trellis’ might also be related to the Shroud. Any ideas about that?\n\n","date":"June 20, 2014 at 4:15 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131815","author":"Hugh Farey","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"I am intrigued why no one else seems to see any potential significance in the two red streaks in the HPM\n\n","date":"June 20, 2014 at 8:22 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131893","author":"Thomas","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Don’t you worry Thomas, I have identified them on the TS beyond the shadow of a rational doubt. Stay tuned.\n\n","date":"June 20, 2014 at 9:01 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131900","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"A most tiny detail gave the game away…\n\n","date":"June 20, 2014 at 9:05 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131901","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Thomas, the red line are very significant. I have listed them in the summary somewhere up there. I also really like your theory that the three crosses are symbolic of the image of Jesus. I never thought of that before and it makes sense as a symbol considering the trinity.\n\n","date":"June 20, 2014 at 10:54 pm","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131936","author":"Mike M","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Thanks Mike the skeptics seem to be conveniently ignoring the red lines presumably they think they are decorative or random – which I think is absurd\n\n","date":"June 21, 2014 at 1:01 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131956","author":"Thomas","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"I suppose no one has seen any significance in the red wavy lines because bloodstains, especially those on the Shroud, do not go in wavy lines.\n\n","date":"June 21, 2014 at 2:22 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131974","author":"Charles Freeman","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"As we wait for the definitive version from Max or OK, we need to remind ourselves what it may tell us.\n1) that the Shroud was made before 1195, but not how long before that. It would not be incompatible with a medieval dating.\n2) the difficulties of a Catholic getting into a Byzantine imperial relic collection to see the exposed Shroud are so immense, that it would provide circumstantial evidence,no more than that, that the Shroud was in the west by that date.\nI am sticking to needing evidence of the two images as ,for me, that distinguishes the Turin Shroud from its many rivals. I think that is quite reasonable.\n\n","date":"June 21, 2014 at 2:09 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131970","author":"Charles Freeman","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"De wesselow states\n‘Hungary was ruled at the time by King Bella III a staunch ally of the Byzantine Empire’\n\n","date":"June 21, 2014 at 2:16 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131973","author":"Thomas","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"I do think all the diplomatic links are important to follow  up especially as Bella III had an early life in Constantinople, so lots of useful research to be done here, but the Pray Codex is western iconography, not Byzantine ( compare Max and his Benedictine  claims).  Never neglect a possible avenue of research!\nAnyone who had seen the Shroud exposed east or west would have seen the two images and this was an age when people advertised relics, not concealed them. I don’t see a single piece of evidence linking the  Pray Codex to the Shroud but those who do need to explain why this relic had to be concealed in such a mysterious way and on a manuscript that seems never to have been circulated. This is clearly not a royal commission – much too basic.\nThe common sense position is that the Codex falls within the conventional iconographic depictions of the day when the wounds of Christ were not emphasised or even shown ( later they became the major feature of such depictions). This suggests that the illustrator was either drawing his own shroud or depicting one of the many that were being displayed in Western Europe  that had no bloodstains or images on them.\nUnless, of course, we have the first and only recorded images of wavy bloodstains. . . .\n\n","date":"June 21, 2014 at 4:06 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131993","author":"Charles Freeman","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"It’s a bit fruitless debating with someone so closed minded but I would be interested to know what you think the red lines are if you don’t think they represent blood.\n\n","date":"June 21, 2014 at 4:12 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131995","author":"Thomas","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"I have no idea what they are. They are in red, the predominant colour on the Shroud so we know the illustrator was using that as a general colour. The fact that there are two parallel wavy lines might suggest he was being decorative but I wouldn’t know. Perhaps an expert in these things would know whether wavy lines have a particular significance. I did not know that circular holes on a Resurrection tomb lid represented the actual circular holes on the Sepulchre lid in Jerusalem that were in place when the crusaders saw them- it was an ex pert who told me. Perhaps the same will happen here.\n Bloodstains very unlikely especially as the five wounds of Christ shown on the Shroud and iconography from the thirteenth century are not illustrated on the body. The illustrator is certainly not copying what might be blood from the Crown of Thorns as surely he would have reproduced the same pattern.\nSo for me blood stains are at the bottom of the list unless an expert can show me a  similar case.\n\n","date":"June 21, 2014 at 4:45 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-132004","author":"Charles Freeman","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"“Thanks Mike the skeptics seem to be conveniently ignoring the red lines presumably they think they are decorative or random – which I think is absurd”\nNot true, Thomas. You have misjudged at least one sceptic, someone who is not given to “ignoring” evidence. See my posting from 2 years ago:\nhttp://strawshredder.wordpress.com/2012/06/13/preliminary-opinion-on-that-pray-codex-that-is-supposed-to-show-the-shroud-of-turin/\n\n","date":"June 21, 2014 at 1:19 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131958","author":"Colin Berry","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Colin I think the cloth’s edge finishes well to the right of the red lines. This cloth is St John’s head cloth. The crosses beneath and to the side of this cloth represent Christ’s image on the shroud.  I suspect the red lines represent the squiggly blood trails on the two arms on the shroud. So we have represented what perhaps were the 2 most conspicuous shroud features of the time – the blood and the holes\n\n","date":"June 21, 2014 at 1:59 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-131968","author":"Thomas","site":"shroudstory"},{"title":"Navy Seals at the Battle of Gettysburg?  A Picture of the Shroud in 1036?","post":"Thomas et al,\nHopefully, I’ll have some spare time (a couple of hours) to finish my Flash Illustrative paper by the end of next week. I have changed the title and subtitle for:\nHungarian Pray Ms folio 28r lower ink drawing section:\nTHE CONSTANTINOPLE/TURIN SHROUD CAMOUFLAGED INTO A SARCOPHAGUS BOX & LID? (or The steganographic crucial evidence)\n\n","date":"June 21, 2014 at 5:55 am","url":"https://shroudstory.com/2014/06/12/navy-seals-at-the-battle-of-gettysburg-a-picture-of-the-shroud-in-1036/","cat":"art","id":"comment-132024","author":"Max patrick Hamon","site":"shroudstory"}]
