[{"title":"Not a Work of Art by Leonardo da Vinci","post":"For some reason volume was very low.\n\n","date":"August 1, 2015 at 3:48 am","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","id":"comment-207128","author":"ekmcmahon","site":"shroudstory"},{"title":"Not a Work of Art by Leonardo da Vinci","post":"I like the words of Isabel – “no human being has a brain to create this image”. My intuition says this god made image was created by some form of radiation. \nLike to hear some comments from Mr. Freeman.\n\n","date":"August 1, 2015 at 4:44 am","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","id":"comment-207131","author":"Sampath Fernando","site":"shroudstory"},{"title":"Not a Work of Art by Leonardo da Vinci","post":"Everyone on this website agrees that Leonardo Da Vinci has nothing to do with the Shroud of Turin.\n\n","date":"August 1, 2015 at 6:27 am","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","id":"comment-207136","author":"PHPL","site":"shroudstory"},{"title":"Not a Work of Art by Leonardo da Vinci","post":"The idea is laughable.\n\n","date":"August 1, 2015 at 8:12 am","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","id":"comment-207145","author":"Dcn Andy","site":"shroudstory"},{"title":"Not a Work of Art by Leonardo da Vinci","post":"Leonardo da Vinci, born April 15, 1452, died May 2, 1519;\nD’Arcis memorandum 1389, with claim that Shroud had been exhibited some 34 years previously; subsequently a continuous record.  End of story!\n\n","date":"August 1, 2015 at 4:32 pm","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","id":"comment-207170","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Not a Work of Art by Leonardo da Vinci","post":"There are many good reasons why the Shroud as we know it was not painted by Leonardo da Vinci, but the fact that he was born in 1452 is not one of them. Not one proponent of the da Vinci hypothesis is ignorant of the discrepancy between the dates, and the first thing they invariably do, before any consideration of how much the Shroud looks like Leonardo or his style, or opportunity or reason to create it, is to try to reconcile the problem, usually by claiming that the original was destroyed and had to be replaced.\nThis being so, why does every critic of the Leonardo hypothesis invariably produce this old chestnut as their first (or even only) comment? Some deep-seated insecurity there, I reckon…\n\n","date":"August 2, 2015 at 4:08 am","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","id":"comment-207233","author":"Hugh Farey","site":"shroudstory"},{"title":"Not a Work of Art by Leonardo da Vinci","post":"Hugh, your mental gymnastics in support of the inauthenticity brigade never fail to astonish.  It cannot even be supported by your much-cherished spurious radiocarbon dating!  There’s only one reason why an uninformed person might be justified in imagining it was Leonardo, and that’s because, just like the Shroud image, Leonardo was a master of realism!  I wonder if the original, supposedly destroyed was the the one that Robert de Clari saw in Constantinople in 1204, or the one that inspired the Bardesanic Hymn of the Pearl ~200 AD, or the one that a group of clerics paraded around Anatolia calling it the Image of Camuliana, or perhaps the one that inspired the Byzantine epitaphioi, or maybe it was all of them, but most unlikely that it was none of them!\n\n","date":"August 2, 2015 at 4:41 am","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","id":"comment-207242","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Not a Work of Art by Leonardo da Vinci","post":"Wriggling, daveb, wriggling…. I agree with everyone of the points you made above, but you didn’t start with them, did you? You started with the old joke that the Shroud existed before Leonardo was born, and that therefore he couldn’t have done it. That’s what they all start with. It’s only when it’s pointed out that nobody on the Leonardo side is unaware of the respective dates that any real attempt to discredit it is made. First the Straw Man, then the reasoned argument. I wonder why.\n\n","date":"August 2, 2015 at 4:50 am","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","id":"comment-207245","author":"Hugh Farey","site":"shroudstory"},{"title":"Not a Work of Art by Leonardo da Vinci","post":"Wonder no more.  You’re the one with the Straw Man.  You never mentioned that Leonardo knew to place aragonite limestone on the soles of the feet, the knee and the nose, nor that he knew what plants the mourners placed in the burial cloth so they’d leave the right kind of pollens, insect borne or not!  Or perhaps you thought that the real burial cloth was the one destroyed in the St Stephen’s church fire at Besancon and that Leonardo was able to resuscitate it!\n\n","date":"August 2, 2015 at 5:58 am","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","id":"comment-207253","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Not a Work of Art by Leonardo da Vinci","post":"More very good reasons why Leonardo probably didn’t paint the Shroud; my first comment began with the fact that there were many such. Strange that authenticists (It’s not just daveb) begin with a spurious one, don’t you think?\n\n","date":"August 2, 2015 at 6:24 am","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","id":"comment-207255","author":"Hugh Farey","site":"shroudstory"},{"title":"Not a Work of Art by Leonardo da Vinci","post":"On the contrary, the dates are most relevant!  Leonardo’ life-time spanned 1452 – 1519. \nIn 1449 & 1452 Margaret de Charnay is known to have exhibited the Shroud at Liege and Macon.  In 1453 she makes a decision to bequeath it to Savoy and in 1457 Duke Louis negotiates a settlement with the Lirey canons and it remains with Savoy. In 1502 it is housed at St Chapelle in Chambery.  In 1509 Margaret of Austria has it placed in a specially commissioned silver casket.  In 1532 the fire breaks out and in 1534 the Poor Clare nuns arrange repairs.  \nAt what window of opportunity was the Shroud alleged to be lost?  And when in Leonardo’s extremely busy schedule did he find time to research an unknown method of making such an image, and fabricate its replacement?  The only possible time that it could be done, was when it was in the safe and protective custody of Savoy!\n\n","date":"August 2, 2015 at 3:23 pm","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","id":"comment-207279","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Not a Work of Art by Leonardo da Vinci","post":"The whole Da Vinci hypothesis is simply ludicrous to say the least. For the many reasons DaveB of Wellington has stated, plus lets not forget the simple fact it has been scientifically attested that the image was NOT PAINTED, no pigments, no binders etc… Then there is the St. Catherine’s Christ Pantocrator painted in 550ad which matches the Shroud we see today with dozens of points of congruence and shows several Vignon markings. It should be established by now the Pantocrator artist used the Shroud as a model, as many coins and other paintings of the 5th and 6th centuries did also…Point is we know from this Pantocrator the Shroud we have today IS the Shroud which existed before Da Vinci 100% and before the alleged carbon14 dates.\nRon\n\n","date":"August 2, 2015 at 10:08 am","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","id":"comment-207270","author":"Ron","site":"shroudstory"},{"title":"Not a Work of Art by Leonardo da Vinci","post":"Aside from the Shroud and even more importantly, the Sudarium is documented as having been in Oviedo, Spain since the 7th century. \nIf both cloths (Shroud and Sudarium) covered the same face, how was it possible for DaVinci to paint the Sudarium?\n\n","date":"August 2, 2015 at 8:51 pm","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","id":"comment-207294","author":"Angel","site":"shroudstory"},{"title":"Not a Work of Art by Leonardo da Vinci","post":"I don’t think anyone has even contemplated that the Sudarium has been painted. The multitude of scientific studies done on the Sudarium markings show pretty well they were extrusions of blood/pericardial fluid…1 part blood 6 parts peri-fluid…I doubt highly anyone in DaVinci’s time or earlier were aware of this or it’s meaning.\n\n","date":"August 3, 2015 at 10:27 am","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","id":"comment-207347","author":"Ron","site":"shroudstory"},{"title":"Not a Work of Art by Leonardo da Vinci","post":"edit:  how was it possible for DaVinci to have painted the Sudarium?\n\n","date":"August 2, 2015 at 8:54 pm","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","id":"comment-207295","author":"Angel","site":"shroudstory"},{"title":"Not a Work of Art by Leonardo da Vinci","post":"Leonardo da Vinci 1452 – 1519: \nBorn 1452 to Florentine notary, apprenticed to Florentine artist Verrocchio stayed with him until 1481;  \nFirst Milanese Period 1482-99: work for Duke Ludovico Sforza, painter & engineer of the Duke, six major works include Virgin of Rocks, Last Supper; commission for abortive horse statue monument; Maintained extensive workshop with students & apprentices. \nSecond Florentine Period 1500-08:  soon after victorious French entry into Milan; various engineering and military works for Florentine governing council; Visits Mantua, Venice 1500, returns to Florence;  Departs Florence 1502 to work for Cesare Borgia, surveys and produces maps of territories; 1503 returns to Florence, plans for canal route connecting Florence to sea; works for 3 years on major painting Battle of Anghiari; Paints Mona Lisa 1503-06;  Intensive scientific studies on anatomy (dissects 30 cadavers) and also on hydrology (fluid flow), flights of birds.  \nSecond Milanese Period 1508-13:  In 1506 French governor of Milan, d’Amboise sought release of Leonardo from Florentine signoria, Battle of Anghiari remained unfinished.  1507-08 assisted Rustici with bronze statues for Florence baptistery then settled in Milan.  Main work in Milan architectural advice on various projects.  Little painting during this period, trained pupils in his studio, but his scientific work flourished at this time.  Trivulsio, marshal of victorious French army returns to Milan, commissions Leonardo to sculpt his tomb, an equestrian statue, but after some years of preparatory investigations, this project also proves abortive. \nLast years 1513-19:  1513 temporary expulsion of French from Milan, Leonardo (aged 60) went to Rome at time of great artistic activity.  Despite monthly stipend and accommodation from Giuliano de Medici, there were no large commissions.  Worked on mathematical studies, technical experiments, surveyed ancient monuments.  In 1516, leaves Italy forever, accepts invitation of French king Francis I as “First painter, architect and engineer to the king”, settles in small residence at Cloux near King’s summer palace at Amboise on the Loire, near Tours. Allowed considerable freedom of action.  Various plans for palace and architecture but projects came to nothing because district threatened with malaria.  Very little painting during this period, spending most of his time editing his scientific studies, treatise on painting, his anatomy treatise.  1519, dies at Cloux, buried in palace church of St Florentin, church devastated during French Revolution, completely torn down ~1800, grave can no longer be located.  \nThe Shroud 1452-1519 … :\nWithin a year of Leonardo’s birth, Margaret de Charnay had gifted the Shroud to the House of Savoy, and the Shroud was then kept in the Savoy Chateau at Chambery, east of Lyon.  Essentially the Savoy territory extended from Lake Geneva in the north to the Isere River in the south and eventually extended east across the Alps into Piedmont.  In 1502 the Shroud was housed in the newly-built Sainte Chapelle at Chambery.  In 1509, it was placed in its silver casket commissioned by Margaret of Austria.  This was where it was located at the time of Leonardo’s death in 1519, and before the fire of 1532.  Following a French invasion of Savoy in 1535, the Shroud was temporarily trasnsferred to Turin, but was returned to Chambery in 1561.  Following the transfer of the Savoyard capital to Turin in 1563, the Shroud itself was eventually moved to Turin in 1578, being eventually housed in the Guarini chapel in 1694.      \nAssessment of the argument:\nAlmost all of Leonardo’s working life was spent in Italy – Florence, Milan, Rome – and there is no suggestion that he had any contact with the House of Savoy, in a foreign territory, during this period.  His extensive notebooks cover an exceptionally broad scope of diverse interests, and are all available in various publications.  Many of the projects he wrote about came to nought.  Although he is a pioneer in modern anatomy, nothing has ever been found in his notebooks suggesting that he was ever interested in creating a replica of a lost burial cloth of Christ, the creation of a mysterious image on linen by some means unknown to others, nor is he known to have attempted any such experiments, nor is there anything even suggestive of it in the Leonardo museum.  \nHis last years near Tours were as remote from Chambery, as were his early years in Florence and Milan. \nIt’s over, Game, Set and Match!  It wasn’t Leonardo!\n\n","date":"August 3, 2015 at 12:53 am","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","id":"comment-207303","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Not a Work of Art by Leonardo da Vinci","post":"To be fair, I think Hugh makes a point.\nIt is possible that:\n– An original Shroud existed (that was exhibited in the mid 1300s)\n– That it was lost or destroyed\n– That a copy or “new version” was created by Da Vinci\nBut are these just “smart ass” points? They may be theoretically possible, but….\nwhy would it be done, for instance? If the Shroud has just been exhibited once in the mid 1300s, and was a marginal relic (that had apparently been “discredited”)\nIn summary – I think it is theoretically possible, but rather unlikely. But more likely than the “Shroud as painting” theory, though!\n\n","date":"August 3, 2015 at 1:41 am","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","id":"comment-207309","author":"Thomas","site":"shroudstory"},{"title":"Not a Work of Art by Leonardo da Vinci","post":"When was it lost?  When was it destroyed? When was it replaced?  Da Vinci had diverse interests, but never showed any interest in anything remotely concerned with anything resembling the Shroud.  He’s Italian.  Shroud’s in Savoy? Doesn’t work!  You haven’t been following the line of reasoning closely enough!  Hugh cannot make a single positive point in favour of the proposition that is not easily refuted.\n\n","date":"August 3, 2015 at 2:16 am","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","id":"comment-207311","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Not a Work of Art by Leonardo da Vinci","post":"Again – it’s theoretically possible, but unlikely (Very)\n\n","date":"August 3, 2015 at 3:00 am","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","id":"comment-207313","author":"Thomas","site":"shroudstory"},{"title":"Not a Work of Art by Leonardo da Vinci","post":"I think it is extremely unlikely. If the original had been destroyed, what exactly did daVinci use as a model to “perfectly replicate” the original? Was he aware of any copies, such as the Christ Pantocrator? …No record of him visiting St Catherine’s monastery by the way. Leonardo kept notes of ALL his works, yet no notes on the most astounding of his works? …DaVinci may have been good, but sorry I think he would fall immensely short of producing the Shroud image we witness today. An image which has attributes not even discernable by the human eye!…As DaveB says; It’s over…..\nNext ludicrous hypothesis…\nRon\n\n","date":"August 3, 2015 at 10:20 am","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","id":"comment-207346","author":"Ron","site":"shroudstory"},{"title":"Not a Work of Art by Leonardo da Vinci","post":"Regardless, we need to get back to the real questions…such as how, in the middle of a French provincial backwater, an imprint from a sculpture or bas relief as good as those created by European masters of the time, was created (with no trace or evidence – direct or indirect – left behind), to deceive paying pilgrims…because that is the only anti-authentic story line that I see having even the faintest potential!\n\n","date":"August 3, 2015 at 3:21 am","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","id":"comment-207316","author":"Thomas","site":"shroudstory"},{"title":"Not a Work of Art by Leonardo da Vinci","post":"“Hugh cannot make a single positive point in favour of the proposition that is not easily refuted.” Hugh doesn’t want to make any such point. Hugh has been at considerable pains to agree with every point against Leonardo da Vinci painting the Shroud. Hugh doesn’t think that Leonardo did paint the Shroud. Hugh wonders why the anti-Leonardo faction are so desperate to prove him ‘wrong’ when he has never supported the da Vinci hypothesis from its very inception. Hugh wonders why authenticists of the Shroud in general spend so much time denying and refuting non-existent non-authenticist arguments. \nIf the Shroud as we know it today is not the Shroud of 1350, then it is far more likely to have been made as a replacement after the 1532 fire, which, as reported, would have destroyed the original. But before daveb leaps in with da Vinci’s death in 1519, such a scenario denies the 1350 radiocarbon date, unless there were bolts of the cloth lying around for hundreds of years just in case. That date, incidentally, is also by far the best reason why Leonardo didn’t paint the Shroud even during his lifetime, although noticeably missing from the anti-Leonardo arguments above.\n\n","date":"August 3, 2015 at 3:39 am","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","id":"comment-207318","author":"Hugh Farey","site":"shroudstory"},{"title":"Not a Work of Art by Leonardo da Vinci","post":"HF: “That date, incidentally, is also by far the best reason why Leonardo didn’t paint the Shroud even during his lifetime, although noticeably missing from the anti-Leonardo arguments above.”  Not so!  \nMy comment Aug 2, 4:41 am, 2nd sentence: ” It cannot even be supported by your much-cherished spurious radiocarbon dating!”  Every possibility and counterargument covered!\n\n","date":"August 3, 2015 at 4:22 am","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","id":"comment-207320","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Not a Work of Art by Leonardo da Vinci","post":"Oh, yes. So it was.\n\n","date":"August 3, 2015 at 5:22 am","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","id":"comment-207326","author":"Hugh Farey","site":"shroudstory"},{"title":"Not a Work of Art by Leonardo da Vinci","post":"Please concentrate!\n\n","date":"August 3, 2015 at 5:58 am","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","id":"comment-207331","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Not a Work of Art by Leonardo da Vinci","post":"If you look at depictions of Christ being buried by the sophisticated artists of the fourteenth and fifteenth centuries they all show Christ’shair falling back..Leonardo would never have painted it straight down onto the shoulders as we see on the Shroud.\n\n","date":"August 3, 2015 at 12:10 pm","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","id":"comment-207352","author":"Charles Freeman","site":"shroudstory"},{"title":"Not a Work of Art by Leonardo da Vinci","post":"What a joke!   :)\nIf DaVinci painted the Shroud, I’m the Queen of Spain.\n\n","date":"August 4, 2015 at 11:31 am","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","id":"comment-207409","author":"Angel","site":"shroudstory"},{"title":"Not a Work of Art by Leonardo da Vinci","post":"It seems to me that you have forgotten to say\nthat the idea of Leonardo as an author of\nthe current “Shroud of Turin” had been made,\nfifteen years ago, indicating the Shroud as\na pyrography (= Irene Corgiat)…\nHere the story:\n>Convegno sulla Sindone che il CICAP Gruppo Piemonte\nha organizzato per il 24 ottobre 2000 presso la prestigiosa\nsede dell’Aula Magna del Politecnico di Torino.\nRough translation:\n>Conference on the Shroud that CICAP, Piedmont Group,\norganized for October 24, 2000 at the prestigious\nheadquarters of the Great Hall of the Polytechnic of Turin.\nSource:\nhttp://www.cicap.org/piemonte/cicap.php?content=sindone&section=convegni\n>…In sala era presente anche la giornalista Vittoria Haziel, la quale durante il dibattito ha mostrato la fotografia di un volto in tutto e per tutto simile a quello della Sindone, realizzato con la tecnica del pirografo da Irene Corgiat, un’artista di Baldissero Torinese. \nRough translation:\n>…In the room there was also the journalist Victoria Haziel, which during the debate had shown the photograph of a face in every way similar to that of the Shroud, made with the technique of pyrography by Irene Corgiat, an artist of Baldissero Torinese.\nI do not think that the Shroud is a pyrography, also there is\nnot a clear explanation (for that presumed artwork/pyrography)\nregarding the simultaneous presence on the cloth for the stains\nof blood, some of which conceal the image of the body\n(if I’m not mistaken).\nThen, try to solve the problem about\nthe Irene Corgiat’s use of an electric pyrotool\non linen and the inherent controls on that material\nusing a microscope …\nHow it appears (under a microscope) a linen fiber,\nbefore and after, a pyrography?\n— — —\nVittoria Haziel’s book is entitled:\n“La Passione secondo Leonardo”\n(= The Passion According to Leonardo).\nIt is written in Italian and was published in Milan\nby Sperling & Kupfer in 1998…\nLink:\nhttp://carverscompanion.com/Ezine/Vol7Issue2/KMenendez/KMenendez.html\n\n","date":"August 4, 2015 at 9:37 am","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","id":"comment-207399","author":"piero","site":"shroudstory"},{"title":"Not a Work of Art by Leonardo da Vinci","post":"A Must see on the Shroud\nIf you recall, a while back, I mentioned the image on the Neutron Star,\n(Chandra telescope, B1509) titled “The Hand of God” was (to my eye) the same face as that of the Shroud of Turin.  \nPlease see the comparative fluorescence study of the Shroud of Turin against the Chandra telescope image B1509. The Sudarium is also included. \nThe  images are detailed on the following link:  I have dial-up with slow download and I’m unable to see the bottom half of the images, but you may have better luck.\nWhat I don’t get or see is the “Star of David” image.  Will someone please explain?\nhttp://home.kpn.nl/britso531/\n\n","date":"August 5, 2015 at 12:23 pm","url":"https://shroudstory.com/2015/08/01/not-a-work-of-art-by-leonardo-da-vinci/","cat":"art","id":"comment-207491","author":"Angel","site":"shroudstory"}]
