[{"title":"Origin of the Gammadia","post":"I found this on a BYU site from a book by john Welch and Claire Foley.\n“Among the textile fragments excavated at Masada were the remains of pieces of fabric with L-shaped cloth markings affixed to them. Dating to before A.D. 73, these are among the very earliest known examples of such marked garments. Among the textile fragments excavated at Masada were the remains of pieces of fabric with L-shaped cloth markings affixed to them. Dating to before A.D. 73, these are among the very earliest known examples of such marked garments. Scholars refer to these markings as gammadia, some of them being shaped like the Greek letter gamma (G). Though similar patterns have been found in several locations, the significance of these markings remains unknown to archaeologists and art historians. Because these markings seem to appear artistically in conjunction with some hope for life or glory after death, their presence on the clothing found at Masada may reflect something about the religious hopes and convictions of the Jewish fighters who died there.”\nIt doesn’t appear the L is Shroud-based, if this info is correct. However, could the L have been added to the Shroud mimicking the existing the Jewish cultural understanding of it? The last line of the blurb above is very intriguing in light of that.\n\n","date":"July 22, 2014 at 4:24 pm","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-139836","author":"David Goulet","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"It may leave a lingering curiosity if the L-Markings on the Shroud were indeed  1st Century Gamma-Markings signifying a type of Light-Radiation (unknown then and now).  And, that the Gamma-Lumen Markings were created around the 1st century to either mimic the Light-Radiation of the Image on the Shroud or to enhance, brand, and claim the Shroud Image as the ultimate Sacrifice searing in the code of Bodily-Resurrection.  Even suggesting that what created the Image also created the L-Markings (Gammadia).\n\n","date":"July 25, 2014 at 10:00 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-140294","author":"clublu22014","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"See also https://ojs.lib.byu.edu/spc/index.php/BYUStudies/article/viewFile/6399/6048\nE. Goddenough remarks that the marking is usually in connection with burial rites.\nInterestingly, the Gammadia L-sign is also found often in a set of four, like on the Shroud.\nThe sign is usually shown close to the knee (on a garment).\n\n","date":"July 22, 2014 at 5:01 pm","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-139842","author":"Mario Latendresse","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"I did some additional research and it appears that the Gamma symbol is the third letter of the Greek alphabet and also because of the three points on the symbol-similar to a backwards “7” it is the oldest symbol of the Trinity.  I have no idea if it has any relation to the burn holes on the Shroud but it would fascinating to find a connection.\n\n","date":"July 22, 2014 at 8:39 pm","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-139867","author":"Russ Breault","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"Gamma or L (Lumen)?\nThe Greek letter gamma represents the number Three.\nThank you very much for all the informations and explanations\nabout the Gammadia!\nBut …\nWhere is the useful proof about the true epoch of that ancient “reference mark”?\nWhich kind of analyses on that “sealed verdict” (“Gamma = Trinity” … or “L = Lumen”…\nin medieval era… ?)?\nThe samples have already been taken in 2002 and are held in Turin.\nBut … they have destroyed the original configuration.\nWhich kind of withdrawal or dust sampling (… in order to control the material\nusing adequate analyses) can solve that “poker holes/Gammadia” problem?\nAnother question:\nPowders are really contaminated?\nIf (after the famous restoration, performed in 2002) we are in those conditions,\nthen (perhaps) we can no longer understand anything (about the ancient\norigin of the holes)…\nAm I wrong in my remark?\nWhere is the right analytical solution?\n… and then you should do as someone who wanted.\nThus :  to burn those carbonaceous grains (with 14C tests)…\n… without further analyses?\nNow I’m perplexed …\nHow to work accurately?\nWhere is the right nano-analytical way to solve the problem?\nCFM ?\n\n","date":"July 23, 2014 at 12:45 pm","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-139992","author":"piero","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"Aldo Guerreschi demonstrated very clearly that the water stain pattern was probably a result from when the Shroud was folded in a particular manner and rolled up to be kept in an urn similar to how the Dead Sea Scrolls were kept.  If water or condensation got into the bottom of the urn it would create the same water stain patterns as seen on the Shroud.  I usually say the stains are from the dowsing of the 1532 fire but it is probably not the case given the repetitive pattern of the water stains over the entire cloth. This relates to the “L” shaped pattern of holes as Mario posted above in that it seemed to be a Jewish symbol circa first century.  So now it has me wondering if the burn hole pattern was just an accident with a Byzantine censor (as I usually say) or a more deliberate symbol applied by first century Jews who may have kept the cloth in an urn until it was taken out of Jerusalem two years prior to 66 when the uprising began that led to the destruction of the temple.  According to Eusebius the faithful were “warned by the Holy Ghost” to leave Jerusalem around 64.  Eusebius writes that all the sacred objects related to Christ were taken to Syria and were dispersed to Beruit, Pella and Edessa. Is it possible that as a symbol of ancient Judaism that the burn hole pattern was kind of Jewish “branding” to establish its authenticity?  I am just speculating…but it has my juices going.\n\n","date":"July 22, 2014 at 9:42 pm","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-139875","author":"Russ Breault","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"It’s been asked before why those ‘poker holes’ were never repaired. If the L shape did have significance as a Jewish ‘victory over death’ symbol then this may explain why the holes were left intact. If 3rd to 9th century Byzantines still recognized the significance of the L shape this means they would not have dared repair those holes.\nAnd if the holes were created in the medieval era, when the appreciation of the symbolism was lost, then they most certainly would have been repaired, no? Unless it was known that those holes existed from the very beginning in which case – even if the symbolism was lost – the need to preserve their unique presence (a checkmark of provenance) was paramount.\nJust speculating as well but I find it a major coincidence that the L shape has this cultural symbolism and we just happen to find it on the Shroud. It may even has repercussions for the Pray Manuscript. This is a fascinating find.\n\n","date":"July 22, 2014 at 10:49 pm","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-139887","author":"David Goulet","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"Russ, the relation between the Shroud’s “poker holes” and the Gammadia has been noted before in a blog entry. See \nhttp://frenz64.wordpress.com/category/the-shroud-of-turin/page/2/\nIt is not an extensive analysis but the resemblance and possible relation is noted.\nThis relation is speculative, but it appears as a likely explanation for the presence of these “poker holes”. Also, note that the poker holes were done by forming not only a Gamma, but a “notched Gamma”, which is also one of the representation of the symbol found on ancient cloths and artistic renderings (I rely on Erwin Goodenough comments on that matter. I have not located these representations yet). Although, the “notched” is quite prominent on the Shroud.  As can readily be seen on the Shroud, some other “Gammas” are without a notch because the poker holes were not done completely through the Shroud when it was folded. \nThe symbolism of the Gamma was still used in the fifth and sixth centuries by Christians. It could have been done during that period.\nAlthough the relation is speculative, the symbolism of the Gamma and the Shroud matches very well: the Gamma is supposed to represent victory over death, immortality, and so on.\n\n","date":"July 22, 2014 at 11:19 pm","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-139893","author":"latendre","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"Here is another image showing the Gammadia symbol on an altar cloth showing Abel and Melchezidek.  The use on an altar cloth is intriguing because the L shaped pattern of holes is shown 4 times on the Shroud–two times where the front image can be seen and two more where the dorsal image can be seen. http://ldstempleendowment.blogspot.com/2010/03/garments-veil-and-gammadia-markings_03.html\n\n","date":"July 22, 2014 at 11:45 pm","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-139903","author":"Russ Breault","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"I am trying to figure out why the “L” symbol came to mean victory over death for the early Jewish believers circa first century. It could also symbolize a general belief in the resurrection–not necessarily Christian ie, the Pharisees believed in the resurrection whereas the Sadducees did not. Could it be because the bottom part of the L represents the body in death where as the vertical part of the L represents the body rising from the dead?  Did the Jews at Masada place this emblem on their clothes because they knew they would all die at the hands of the Romans but believed they would see each other again at the resurrection?  Not one Jew was found alive when the Romans reached the summit.\n\n","date":"July 23, 2014 at 12:52 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-139909","author":"Russ Breault","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"This is such an intriguing question, Russ.  I can’t help but associating the L-Shaped Markings with the L-Shaped (Chevron) over the inner circle on the 1st Century Jesus Family Tomb.  But I know a host of other critics will not see this relationship as a resurrection symbol.  I once read on a Tabor Blog that this symbol was also used as a resurrection sign on the Mausoleums of Augustus and Tiberius.  It does seem to be a first century cultural fad.\n\n","date":"July 24, 2014 at 9:39 pm","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-140210","author":"Annette Cloutier","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"A fairly comprehensive review of the three episodes of water stains and burn holes is: “”FURTHER STUDIES ON THE SCORCHES AND THE WATERMARKS” by Aldo Guerreschi – Michele Salcito, (c) 2005 Relazione al Congresso di DALLAS 2005. At:\nhttp://www.shroud.com/pdfs/aldo4.pdf  \nGuerreschi describes his concertina folding / jar storage experiment, replicated on television with Ian Wilson present, and described and diagrammed by Wilson in his 2010 book.  \nThe authors note that the L shaped holes occurred when the cloth was folded in four, when it would then fit the size of a Byzantine altar cloth.  Hence the inference that the holes may have been caused by incense.  Wilson also has a reference that the burial cloths were tested “by fire and water” and speculates that the holes may have occurred during some ‘trial by fire’.  That the holes gave the pattern of a gammadia, opens speculation as to whether the pattern was deliberate, or if accidental, seen as providential and hence not mended.  \nRegarding the early location of the Shroud, Markwardt makes a persuasive argument that it was stored in Antioch until about the mid-6th century, pending the destruction of the city by earthquake and Persian siege, when it was only then taken to Edessa.  He interprets the Doctrine of Addai / Acts of Thaddeus as a deliberately secret analogy to record the important occasion of when Bishop Marcellus Avercius was given temporary custody of the cloth in the late second century as a kind of visual aid for the conversion of the court of Abgar VIII the Great at Edessa, and celebrated in the Bardesanic “Hymn of the Pearl”.\n“ANCIENT EDESSA AND THE SHROUD: HISTORY CONCEALED BY THE DISCIPLINE OF THE SECRET”  By Jack Markwardt, 2008:\nhttp://ohioshroudconference.com/papers/p02.pdf\n\n","date":"July 23, 2014 at 1:48 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-139916","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"What if the Mark1 Shroud had been a scorched-on representation of a Templar leader, notably Jacques de Molay, slow-roasted to death in 1314 (using a heated metal template or similar modelled on the individual in life)?\nWhat if an attempt had been made by the Shroud’s first recorded custodians in a tiny French village (L for Lirey?) to claim it was a sweat imprint of the crucified Jesus, while covering their backs with the production of the Mark 1 Lirey Pilgrim’s badge (with what looks suspiciously like a barbecue grill with trellis pattern on the reverse side)?\nWhat if the Lirey custodians then pushed their luck too far in producing a  Mark 2 pilgrim’s badge (see Machy mould) to which an inset feature was added, namely a representation of the Veil of Veronica above the word SUAIRE, i.e. a possible attempt to suggest that the Shroud was a life-sized post mortem version of the Veil of Veronica, with a heat scorch now cleverly ‘re-invented’ as aged body sweat?\nWhat if that Mark 2 Lirey badge was the last straw where the local bishop at Troyes was concerned (Ian Wilson having also proposed something along these lines in his splendid BSTS comparison between the Lirey badge and Machy mould), and threatened the Lirey custodians with charges of wilful misrepresentation or worse?\nWhat if the Lirey custodians then panicked, and quickly added some L-shaped poker holes to the Shroud, maintaining that they had never claimed it to be the burial shroud of the crucified Jesus but that it might have been used to wrap the ‘slow-roasted to death’ St.Lawrence, still relatively corpus intactus  in Rome, circa AD 258? (thus that L for Lawrence)?\nFanciful narrative? Maybe, but mine does not lack for some supporting detail(s) that might be described as otherwise enigmatic  and unexplained (can the proponents of alternative “what if” scenarios say the same?), and it doesn’t stop with that trellis pattern, or some other curious details on the Lirey pilgrim badge or surviving mould thereof.\nLook for example at this example from early art (sorry, I don’t have a date) of St.Lawrence being slow-roasted.\nhttps://encrypted-tbn2.gstatic.com/images?q=tbn:ANd9GcQhPkSQp1W_9QVKpzzZy1EpLEucPW7QgYr5wHfa5jJ6kh0-NfF8\n Does not the martyr’s posture and state-of-undress, with strategic positioning of crossed hands, remind you of something?\n\n","date":"July 23, 2014 at 2:02 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-139918","author":"Colin Berry","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"“What if the Lirey custodians then panicked, and quickly added some L-shaped poker holes to the Shroud,….”   why L shaped?\n\n","date":"July 23, 2014 at 9:07 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-139967","author":"David Goulet","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"It would be L for (St.) Lawrence, or, less probably, L for Lirey David.  L for Lawrence would dovetail neatly with the point Thomas made earlier re the short(ish) hair and the (shortish) beard. That is exactly how the Man on the TS is depicted on the Lirey badge, regardless of hair or beard length on the actual TS. \nThe Lirey custodians were engaged in a long-term process of creating a myth around their possession, but had to ensure there was an alibi to keep the Bishop(s) of Troyes off their backs. Officially it was the Shroud of Lawrence(?). Unofficially it was the whole body version (post mortem) of the Veil/Suaire of Veronica.\n\n","date":"July 23, 2014 at 9:57 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-139971","author":"Colin Berry","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"Colin’s referenced image of St Lawrence is one of a great number of artist’s representations of the saint on the web, and this one seems to be the only one that has any similarity at all to the TSM.  His reference provides no clue as to its provenance, but it can be found at:\nhttp://communio.stblogs.org/index.php/2009/08/saint-lawrence/\nBut again there is no clue given as to its provenance.  Perhaps someone else may be able to identify it.  If there is any connection, then the more logical conclusion would be that whoever painted it knew of the TSM image, rather than the other way around, and decided to copy the TSM posture.  So it would be quite illuminating to know the provenance of the image, which could well imply a pre-medieval date for the Shroud.  So Colin’s argument can easily be turned on its head. \nGoogle on “St Lawrence gridiron” and you’ll discover several pages of references to the restaurant of that name in Boise USA.  The tradition that St Lawrence was slow roasted, together with the comment he’s supposed to have made “I’m done on this side, Turn me over” may well be legendary, and due to a copyist’s misprint of “… passus est …” in omitting the ‘p’ thus “… assus est …” = ‘he was roasted’.  The more usual form of executing Christians at that time was beheading.  St Lawrence’s head is preserved as a relic.\n\n","date":"July 23, 2014 at 3:43 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-139929","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"Oh dear, yet another claim that it was the TS that influenced art, even that of the iconic St.Lawrence with his celebrated and memorable method of of dispatch.  \nSo why the crossed legs, daveb, if it’s merely a plagiarising of the Shroud, which frankly I doubt? Crossed feet (maybe), though I’ve recently concluded from spending lots of time on Shroud Scope that they weren’t (though one can excuse medievals for thinking the feet were crossed).\nNaturally I chose the picture that best-approximated the TS posture, but there are scores, hundreds of them available by googling (st.lawrence, roasted, grid iron) etc, showing a huge range of combinations, with and without loin cloth, with and without rods for holding down the subject, with and without securing cords on wrists, midriff or ankles etc etc. Incidentally,  the securing cord (?) on St.L’s midriff, where shown,  is interesting in view of the Lirey badge dorsal side, with its so-called “blood belt” (Ian Wilson), given it’s the only “blood” imagery.  Securing cords are not needed for crucifixion, not with nails at any rate, but I know another form of despatch that does, as did the Templars. \nOne might also venture to suggest that it was the iconography of St.Lawrence that made nudity in devotional art respectable, provided certain conventions for concealment of procreational/recreational paraphernalia were followed.\nDevotional art had many centuries (eleven to be exact) in which to perfect the iconography of St.Lawrence.prior to the first public display of the Lirey Shroud in 1357 display. Is it too much to ask that it be relieved of the charge of being “derivative” or, alternatively, credited with an amazing precocity, using paint to record the Shroud’s ‘pre-history’ while failing to leave a few token words, indeed any words, by way of explanation in script?\nBut where would this site be with its Shroud-spotting and Shroud-spotters? St.Lawrence must come as a welcome break from HPM-ology…\n\n","date":"July 23, 2014 at 4:41 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-139935","author":"Colin Berry","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"Typo last sentence: “without” its Shroud-spotting etc…\n\n","date":"July 23, 2014 at 4:44 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-139937","author":"Colin Berry","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"Colin, St Lawrence is usually shown in art as beardless and with shortish hair, although sometimes with a small beard.\nThis seems to contrast with the long haired, bearded man on the Shroud.\n\n","date":"July 23, 2014 at 6:12 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-139945","author":"Thomas","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"Truly there do not seem to be all that many of them as you assert.\nTry this – Google “St Lawrence martyr saint” hit the ‘Images’ button.\nYou get 20 images to the page, and quickly scan through the first 10 pages.  Maybe 80% of the images are meant to be our subject and the other 20% somebody else.  Most of the images of St Lawrence are of him live as a deacon of the church, and perhaps two or three of them to a page depict his martyrdom on the griddle.  So out of 160 images of the saint, maybe only 20 or 30 of them show his martyrdom, and these are depicted in a variety of ways. \nTo make any kind of credible association with the Shroud, either one way or the other, it’s probably necessary to go through the somewhat tiresome and time-consuming business of tabulating a catalogue of the relevant depictions, with names of artists, likely dates, description of the various postures, and state of draping.  I suspect that both of us have rather more compelling priorities at present.\n\n","date":"July 23, 2014 at 6:29 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-139948","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"Frankly, I can’t see what relevance attaches to the proportion of images of the saint in life v death, since it’s the manner of his death that is in the frame, and the way the particular gruesome way he died was portrayed in art over the centuries, relieving the TS of having to be ground-breaker in matters of slow torture and nudity.\nWhat’s more, your search terms needed to be more focused on his death. Try googling (st.lawrence martyrdom grid iron), and see the difference:\nhttps://www.google.co.uk/search?q=st.lawrence+martyrdom+grid+iron&source=lnms&tbm=isch&sa=X&ei=F5bPU-O1FqzH7Abe2YHIBw&ved=0CAYQ_AUoAQ&biw=1429&bih=727&dpr=0.9\n\n","date":"July 23, 2014 at 7:08 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-139952","author":"Colin Berry","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"Russ…According to The Masada Myth by Nachman Ben-Yehuda of Hebrew University, two women and five children survived the Roman siege of Masada.  Apparently, they hid in a water cistern!\n\n","date":"July 23, 2014 at 10:03 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-139974","author":"David O.","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"On June 12, 2013 (at 9:49 am), I wrote:\n  “[Prior to the fourth c. CE,*] a ‘fire’ trial by deliberate application of molten grains of resin from an incense censer just cannot be totally ruled out. Actually, this is the most likely.\nMore specifically, the second earliest ‘L’/‘Γ’ (gamma)-like shaped marks, I came across in my research work, are to be found on several ancient Egyptian and Ethiopian Coptic domestic, garment and/or liturgical textiles. Greek capital letter gammas (mirrored and non mirrored) generally occur in pairs (front and back or top and bottom). \n  The repeated motif as 4 gamma-shaped patterns appears to have been at the same time both decorative and symbolic. Most likely, it does have a meaning as a reference to Yeshua’s burial winding sheet/garment 4 ‘L’/‘Γ’-shaped burn-holes caused by incense grains and geometrically distributed on the famous burial cloth. Besides the ‘L’ and ‘Γ’ the ‘I’ also occurs as early as the 5th c. CE. Etc.\n  Roman and Byzantine paintings and mosaics often include representations of decorated textiles with ‘clavi’/’gammadia’ that can symbolically be equated with the TS 4 geometrical SERIES OF burn-holes.\n  Re gammadion (from Greek γαμμάδιον): in ancient Greek the word tetraskelion (Greek: τετρασκέλιον), literally meaning, “four legged”, is one of the other names for the shape. Now the Knights Templar’s ‘head’ or alleged ‘idol’ was reported (by Hugues de Payraud) to have ‘four legs’, two at the front and two at the back.”\nAnd on June 14, 2013 (at 7:51 am), I also wrote:\n*Reminder: the L-shaped BLACKENED burn-holes DOES echo the clavus/key-like BLACK ‘L’ standing out on the flashing gold pallium/Roman himation of a Resurrected Christ in Majesty (Santa Pudenziana Mosaic, ca. 400, Rome). The fire trial or incense censer accident might well have occurred before 400 CE.\n\n","date":"July 23, 2014 at 12:23 pm","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-139986","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"Re the earliest L-like shaped mark I came across, on June 15, 2012 (at 12:43 pm – #58 Reply), I wrote:\n  “A BLACK “L” stands out on the flashing gold pallium of a Resurrected Christ in Majesty (Santa Pudenziana Mosaic, ca. 400, Rome). Now the pallium is the Roman evolved form of the Greek himation). Also notice the zigzag weave pattern on the left arm pummel. Besides a 111/112cm width cloth shows stretched just at the back of the throne at Christ shoulder level. Before the 2002 restoration of the Shroud exact width was 111-112cm.\n  The two Christ face (That of the mosaic and that of the Turin Shroud are at the same scale 1:1 with congruent spy details. The face of Christ is 4-5cm off-centred on the left just like in the Turn Shroud and the position of the feet on the Pudenziana mosaic is also asymmetrical as on the TS.The latter’s body image, seen under a certain angle and light, looks like translucent straw yellow impression. This is consistent with the use of flashing gold mosaic tiles to feature Christ’s pallium.\n  The L letter identifies the clothing as Pallium Lumeni Christi = Lumen Christi in Sindonem\n= L in Sindonem = Linus Christi. (The official first Pope’s name was Linus as secular representative of Christ on earth i.e. as his vicarius. Peter was not officially Pope).\nNote: Lumen Christi (Latin: Light of Christ). See also Lumen verum illuminans omnem hominem (antiphon) and Inventor rutili dux bone luminis (hymn).”\nReminder, on June 15, 2012 at 12:11 pm – #55 Reply), I wrote:\n  ”Each year at Easter, in the very course of the Holy Saturday liturgy, an L shape Resurrection mark (as a sign alluding to Lumen Christi) used to be deliberately imprinted on the Paschal candle by placing granules of incense. NOW the Pray Ms 3B miniature, is just followed by the text of the Exultet (Exultet jam Angelica turba coelorum/Exultent Divina Mysteria)… the very hymn that was sung at mass while the L shaped like mark was precisely imprint into the wax with granules of burning incense.”\n\n","date":"July 23, 2014 at 12:34 pm","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-139988","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"On June 12, 2013 (at 9:49 am), I wrote:\n“[Prior to the fourth c. CE,*] a ‘fire’ trial by deliberate application of molten grains of resin from an incense censer just cannot be totally ruled out. Actually, this is the most likely.\nMore specifically, the second earliest ‘L’/‘Γ’ (gamma)-like shaped marks, I came across in my research work, are to be found on several ancient Egyptian and Ethiopian Coptic domestic, garment and/or liturgical textiles. Greek capital letter gammas (mirrored and non mirrored) generally occur in pairs (front and back or top and bottom).\nThe repeated motif as 4 gamma-shaped patterns appears to have been at the same time both decorative and symbolic. Most likely, it does have a meaning as a reference to Yeshua’s burial winding sheet/garment 4 ‘L’/‘Γ’-shaped burn-holes caused by incense grains and geometrically distributed on the famous burial cloth. Besides the ‘L’ and ‘Γ’ the ‘I’ also occurs as early as the 5th c. CE. Etc.\nRoman and Byzantine paintings and mosaics often include representations of decorated textiles with ‘clavi’/’gammadia’ that can symbolically be equated with the TS 4 geometrical SERIES OF burn-holes.\nRe gammadion (from Greek γαμμάδιον): in ancient Greek the word tetraskelion (Greek: τετρασκέλιον), literally meaning, “four legged”, is one of the other names for the shape. Now the Knights Templar’s ‘head’ or alleged ‘idol’ was reported (by Hugues de Payraud) to have ‘four legs’, two at the front and two at the back.”\nAnd on June 14, 2013 (at 7:51 am), I also wrote:\n*Reminder: the L-shaped BLACKENED burn-holes DOES echo the clavus/key-like BLACK ‘L’ standing out on the flashing gold pallium/Roman himation of a Resurrected Christ in Majesty (Santa Pudenziana Mosaic, ca. 400, Rome). The fire trial or incense censer accident might well have occurred before 400 CE.\n\n","date":"July 23, 2014 at 12:35 pm","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-139989","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"If the L letter stood for Lumen Christi (Paschalis Vigilia), “Light of Christ (of Easter Vigil)” in 4th c. Roman Churches, seen as a Gamma letter (symbol of the third letter of the Greek alphabet), it stood for the TRIkirion (or Paschal Trikirion), the liturgical THREE-candle holder used at Easter time on Holy Saturday Midnight in Byzantine, symbol of the Christ Resurrection Light of Easter and Eternal Life.\nSee  e.g. Holy Saturday Midnight Wiki Easter Vigil entry: \n“The order of the Paschal Vigil is as follows (with some minor local variations):\nAfter the reading of the Acts of the Apostles the Midnight Office is served “at the fourth hour of the night”,generally, in practice, timed to end shortly before midnight, during which is sung again the Canon of Holy Saturday and are read commentaries of Saints Epiphanius of Cyprus and John Chrysostom.\nThe epitaphios or “(liturgical shroud) on the tomb” depicting the dead body of Christ is solemnly venerated for a last time and then ceremoniously taken into the altar and laid on the Holy Table towards the end of the canon.\nAfter the dismissal of the midnight office all the lights in the church are extinguished except for the unsleeping flame on the Holy Table (altar), and all wait in silence and darkness. Where possible, the Holy Light arrives from the Holy Sepulchre during Holy Saturday afternoon and it is used to light anew the unsleeping flame.\nAt the “time for matins”,usually in practice at the stroke of midnight, the priest censes around the Holy Table, and lights his candle from the unsleeping flame. The Holy Doors are opened, after which the priest exclaims “Come receive the light from the light that is never overtaken by night, and glorify Christ, Who is risen from the dead!” or a similar variation depending on tradition. After this proclamation, the priest approaches the congregation with the Paschal trikirion (lit from the unsleeping flame), and the people light their candles from the flame.”\n\n","date":"July 23, 2014 at 1:29 pm","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-139995","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"The Gammadion on garment can also identify a disciple of Christ.\n\n","date":"July 23, 2014 at 1:57 pm","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-139998","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"In the 12th c. CE Byzantine church, the‘ L’/‘Γ’ (gamma)-like shaped burn-marks evolve into a specific polystaurion, ‘many-(black-or/and-red) crossed’ motif.\n\n","date":"July 23, 2014 at 2:37 pm","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-140002","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"Max, thanks for re-posting all of your prior posts.  Very helpful!\n\n","date":"July 23, 2014 at 3:23 pm","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-140010","author":"Russ Breault","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"The “L” may turn out to be a good lead in Shroud studies, minus the Christian symbolism, with no link either to trinity or resurrection. Maimonides tells us that the white linen belt\nworn by the Temple priests was taken from a cloth measuring 32 cubits and 32 is the gammatria, from the Greek gamma.\nNumerology is even used today by some to “decipher hidden secrets” in the Bible, but this is pointless, the interface with science can tell us more.\nBut, to return to the main point, any link made between the textiles found in Masada and Christians — again with the use of “L”  —- is misleading. The textiles were dated to AD 73, at which point the Zealots were still active. The Sadducees, Pharisees and Judaeo-Christians had no connections with this group. To say that the textile with the “L” denotes Christian presence in the region in the first century is like saying that the Gospels are fairy tales, filled with lies. Judaeo-Christians and Zealots had nothing to do with each other. If the two groups are mixed then it will mean that Jesus was quasi- zealot, the reason why he was nailed to the cross, and I don’t know whether believing Christians will countenance that.\nMasada has it myths, largely because Josephus was not always accurate. That is why it is no longer considered a symbol of Jewish resistance/nationalism. Many of the human bones buried there were found together with those of pigs. These could be the result of Roman burials with blood (animal) sacrifice.\nIt is possible that there was Christian presence there, but not before Christianity had been recognised by the State, around the fifth to the sixth centuries.\n\n","date":"July 23, 2014 at 7:31 pm","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-140026","author":"Louis","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"The question of Zealotry is debatable.  Four separate NT verses refer to “Simon the Zealot” as one of the chosen apostles:  Matt 10:4; Mark 3:18; Luke 6:15;  Acts 1:13.  Not a great deal is known about him, but tradition has him as a missionary in Egypt, and there are a variety of stories about his martyrdom, in Persia and elsewhere, and also that he met his death by being sawn in half.  Those who assert that he was in fact of the Zealot party, say that it was partly to offset the choice of Matthew, a tax collector, whereas Simon was a member of the tax-hating Roman-hating Zealots, and that the kingdom of Jesus was to reach out to people in all walks of life. \nJ P Meier, among others, asserts that ‘Zealot’ is a mistranslation, that the term reflected Simon’s zealousness, and that the Zealot movement did not really get under way until the start of the Jewish War in 66 AD.  Nevertheless Simon is given the appellation in all four NT verses quoted.  Others trace the movement back to the time of the Idumean Herod (the Great).  \nFrom Josephus’ Jewish Antiquities: “The Zealots were a “fourth sect”, founded by Judas of Galilee (also called Judas of Gamala) in the year 6 against Quirinius’ tax reform, shortly after the Roman Empire declared what had most recently been the tetrarchy of Herod Archelaus to be a Roman province, and that they ‘agree in all other things with the Pharisaic notions; but they have an inviolable attachment to liberty, and say that God is to be their only Ruler and Lord.’ ” \nAnd of course there’s much more!  Yer pays yer money and yer makes your choice!  Still debatable!\n\n","date":"July 24, 2014 at 1:03 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-140075","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"OK, but this is going off the point, which is to say that there can be no link between a cloth found in Masada in the first century and the Judaeo-Christians. Simon was probably an ex-Zealot who joined the Jesus movement.\nThe Zealots came into existence in AD 6. While J.P. Meier is right in saying that their group began to get under way with the start of the Jewish war it does not mean that the members were inactive. They carried daggers and murdered who in their view was collaborating with the Romans and disappeared in the crowd. They kept an eye on the Sadducees and it is probable that the murders of some of their victims went unrecorded:     https://www.academia.edu/7471223/Jesus_was_not_buried_in_Talpiot_-_Part_III\n\n","date":"July 24, 2014 at 8:34 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-140134","author":"Louis","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"Postscript to my previous comments re the L-symbol, or, as I prefer to hypothesize, L-word.]\nHow odd that the first home for the Shroud on arrival in Turin, having been brought from Chambery in1578, was not its present one, i.e. the chapel between St.John’s Cathedral and the Royal Palace, but, the chapel of St. ????????? . Can you guess?\nYup, it’s that same L word again. That’s Lorenzo, i.e. Lawrence. Do I hear folk say that’s just a coincidence? How many coincidences that link Lawrence with the Shroud are needed, one wonders, to tip a balance between correlation and causation?\n\n","date":"July 24, 2014 at 3:34 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-140089","author":"Colin Berry","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"Is this ‘gammadion’ as widespread as is implied by some of the above? There do seem to be some references to the Trinity, which I think have more to do with the letter’s third position in the alphabet rather than the number of points. Pictorially, a delta is far more frequently found as a reference to the Trinity. Overall, it seems to me, the gammadion nearly always refers to an L shape with equal length arms, often four at a time, either with their ends touching, forming a svastika, or with their angles almost meeting at the centre of a cross, which may be upright or diagonal.\nEcclesiastically, the chief examples seem to be found in a single church, in Ravenna, where they are found in conjunction with Ns, Zs, Is, Hs, Rs and various other symbols adorning the the togas of holy people. It is not obvious that the gamma has any special significance of its own. In modern times, the gamma as a corner-shape is often found in conjunction with the polystaurion worn by Byzantine clerics, where it may be a fortuitous reference to the Trinity.\nAs for why the ‘poker-holes’ weren’t repaired, was this because there was simply no need, as they have well-defined edges, so not in danger of fraying. They are sometimes described as being fringed with a pitch-like substance (insense?) which might act as some kind of glue.\n\n","date":"July 24, 2014 at 3:44 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-140092","author":"Hugh Farey","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"HF: “There do seem to be some references to the Trinity, which I think have more to do with the letter’s third position in the alphabet rather than the number of points.”  \nIt’s more than this.  Greeks used an alphabetic numerary system, dating from at least the 3rd century BCE; The twenty-four letters of the alphabet plus three obsolete letters were divided up into three groups of nine, representing: units, tens, hundreds.  Various markings extended the system up to 100 million, e.g. the letters written above an ‘M’ denoted myriads (=10,000).  Gamma is not only the third letter in the alphabet, it actually represents the number three.  Refer Georges Ifrah’s text p.261 et seq.  The Jews adapted a very similar system using Hebrew letters.  For example the Hebrew symbol for the numeral three is the letter ‘gimel’.  A Syrian bishop is known to have scolded the arrogance of Greek mathematicians, as he knew about Hindu numerals and their use of a base 10 system, which included a zero place-holder, the fore-runner of our modern numeration system.\n\n","date":"July 24, 2014 at 5:51 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-140110","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"http://www.bing.com/images/search?q=jesus+family+tomb+images+over+tomb&id=B295B52057203C4688D1874E7A9E7D0223B26CE1&FORM=IQFRBA#view=detail&id=93D183BAB2FA26AAB50A58B6E0F6A6BC9EEF8451&selectedIndex=6     \nAlso… a few more pictures of the L-Shaped (aka Chevron) symbol over the 1st century Jesus Family Tomb ..http://www.jesusfamilytomb.com/the_chevron.html\n..\n\n","date":"July 24, 2014 at 10:29 pm","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-140215","author":"Annette Cloutier","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"Hi Annette!\nPlease, don’t take us to sites where there is no professional archaeology, and where speculation abounds. The chevron was found on pottery in ancient Greece, around 2000 BC, it is like the lambda. We must not forget that Jerusalem was also hellenized, with the Greek influence particularly strong on richer (Sadduceean)families. A statue of Ishtar was once in Solomon’s temple, he also built  and dedicated a temple to her, Jesus himself spoke about Baal being worshipped.\nMonotheism, as we understand it today, was really defined at the Council of Nicaea in AD 325.\nThe Talpiot tomb probably belonged to a rich family. See the first two parts of the three-part article:\n  https://www.academia.edu/7556467/Jesus_was_not_buried_in_Talpiot_-_Parts_I_and_II\n\n","date":"July 25, 2014 at 10:13 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-140295","author":"Louis","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"Often relics are not repaired as the damage shows that they caught fire, or whatever, but through divine intervention they survived. This is certainly true of the 1532 fire marks that were preserved because they showed that the fire was stopped in time and they act as evidence of this. That is why the nuns repaired the Shroud with just a backing cloth and why you always see them in any depiction of the Shroud (Beldon Scott is, as ever, good on this)\nI leave it to others to suggest why other parts of the Shroud may have needed reweaving.\n\n","date":"July 24, 2014 at 5:10 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-140108","author":"Charles Freeman","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"Addition to my July 23, 2014 at 1:57 pm Reply:\nThe Gammadion on garment can also identify a disciple of Christ who ‘is’ born in heavens (i.e. to Eternal life). In Greek the phrase Γεννήθηκε στην ουρανούς, (Genní̱thi̱ke sti̱n Ouranoús), “Born in Heavens” has got a Gamma letter for initial. \nRe saint Lawrence/Vincent iconography, in the second half of the 12th c. CE Berzé-la-Ville mural painting, the Benedictine Abbot painter endowed the saint with sindonological characteristics as the latter ‘put on’ Christ i.e. lived (and died) in imitatio Christi. In Late Antique and Medieval Christian iconography, many saints (whether real or imaginary) are endowed with sindonological features.\n\n","date":"July 24, 2014 at 7:37 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-140122","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"The Saint Marco Basilica mosaics (mid 14th century) depicting the life of St Isidore are worth seeing in this respect.\n\n","date":"July 24, 2014 at 7:41 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-140124","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"See saint Isidore tied to a horse mosaic (1343-1356 CE) at http://fr.akginternal.orangetest.com/C.aspx?VP3=SearchResult&VBID=2UMESQIS0GEZ\n\n","date":"July 24, 2014 at 7:48 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-140125","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"Reminder: the oldest icon of Shroud-like Christ Pantocrator (encaustic on panel, c. 527 CE in St. Catherine Monastery, Sinai, Egypt), holds in his left hand a codex showing on its cover the 4 L-shaped motif.\n\n","date":"July 24, 2014 at 8:10 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-140129","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"In Early Middle Ages, High Middle Ages, & Late Middle Ages, theTrinity symbol consist in three dots not a Gammadion (see e.g. Sinai Christ Pantocrator icon mentioned above).\n\n","date":"July 24, 2014 at 8:19 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-140130","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"…dots in Delta configuration.\n\n","date":"July 24, 2014 at 8:24 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-140131","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"Thanks Max, very informative.  The four gamma on the Codex act like a decorative frame, except that it’s not a complete rectangle as it’s broken at the mid-sides by some kind of small emblem on a golden circle.  The gamma and the three delta arranged dots are set at each quadrant of the central cross, so there are twelve dots in all (12 apostles??).  I wonder if the fact that there are four quadrants in the cross, led to the tradition of the four gamma signs.  Any comment on what the small emblems might be?\n\n","date":"July 24, 2014 at 4:33 pm","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-140183","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"Dave, re the 4 small emblems on a golden circle, most likely they refer to the 4 small circular area of burning one can see on the TS off the body image and in conjunction with the 4 (mirrored and non mirrored) Γ (Gamma)-shaped burn holes and marks. Symbolically they also refer to the 4 cardinal points with the Cross at the very centre.\n\n","date":"July 24, 2014 at 5:22 pm","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-140187","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"… and (that goes without saying), they refer to the Four Evangelists/Gospels.\n\n","date":"July 24, 2014 at 5:36 pm","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-140189","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"Re ‘Colin Berry’s saint Lawrence’, saint Lawrence Early, Middle and Late Medieval iconography and the ‘Grail’ legend:\nIn old French “un grail” means “a square/diamond metallic lattice” hence the deSIGNation  can work as a synecdoche (figure of speech in which a term for a part of something refers to the whole of something or vice versa) and refer  to a reliquary table covered with a gilded silver diamond metallic lattice much alike that of the Holy Face of the Holy Mandylion or Holy Sindon kept in Constantinople till 1204.\nOn April 3, 2014 (at 10:27 am), I wrote:\nActually Colin Berry is just recycling one of my own ideas to fit in his scorch theory-like speculation. I first drew his attention to the Saint Lawrence and Turin Shroud issue as early as February 2013.\n– First on February 25, 2013 at 3:43 pm, in CB’s blog, I wrote:\n“The Old french vocable graal is translated « grail » into English (le saint graal : the holy grail). Now the old French word «graal» is very close to the Old French « grail » that means grid and metallic lattice from Latin cratis. The French verb « griller/to roast » was spelt i Old French « graailler »; notice the two « a » as in graal.”\n“The ‘grid/grail theme’ is also to be found in an Irish Fairy Tale telling Tuân mac Cairill’s turning into The Primeval Man (Adam Qadmon = Yeshua Ha-Ben Adam) within him (notice too how Cairill wordplays with Grail): \n“The fisherman of Cairill, the King of Ulster, took me in his net. Ah, that was a happy man when he saw me! He shouted for joy when he saw the great salmon in his net.\n“I was still in the water as he hauled delicately. I was still in the water as he pulled me to the bank. My nose touched air and spun from it as from fire, and I dived with all my might against the bottom of the net, holding yet to the water, loving it, mad with terror that I must quit that loveliness. But the net held and I came up.\n“‘Be quiet, King of the River,’ said the fisherman, ‘give in to Doom,’ said he.\n“I was in air, and it was as though I were in fire. The air pressed on me like a fiery mountain. It beat on my scales and scorched them. It rushed down my throat and scalded me. It weighed on me and squeezed me, so that my eyes felt as though they must burst from my head, my head as though it would leap from my body, and my body as though it would swell and expand and fly in a thousand pieces.\n“The light blinded me, the heat tormented me, the dry air made me shrivel and gasp; and, as he lay on the grass, the great salmon whirled his desperate nose once more to the river, and leaped, leaped, leaped, even under the mountain of air. He could leap upwards, but not forwards, and yet he leaped, for in each rise he could see the twinkling waves, the rippling and curling waters.\n“‘Be at ease, O King,’ said the fisherman. ‘Be at rest, my beloved. Let go the stream. Let the oozy marge be forgotten, and the sandy bed where the shades dance all in green and gloom, and the brown flood sings along.’\n“And as he carried me to the palace he sang a song of the river, and a song of Doom, and a song in praise of the King of the Waters.\n“When the king’s wife saw me she desired me. I was put over a fire and roasted, and she ate me. And when time passed she gave birth to me, and I was her son and the son of Cairill the king. I remember warmth and darkness and movement and unseen sounds. All that happened I remember, from the time I was on the gridiron until the time I was born. I forget nothing of these things.”\n“And now,” said Finnian, “you will be born again, for I shall baptize you into the family of the Living God.”————–So far the story of Tuan, the son of Cairill.”\nNow the Greek word for fish (ICHTUS), works nicely as an acronym/acrostic  for “Ίησοῦς Χριστός, Θεοῦ Υἱός, Σωτήρ”, (Iēsous Christos, Theou Yios, Sōtēr), which translates into English as “Jesus Christ, God’s Son, Saviour”). Besides the fish on the grid with the flames raging underneath is an alchemical image of Chymische Schriften by J.J. Hollandus published  in 1773 in Vienna.\n“Léon Gineste rappelle que l’écuelle de terre qui constitue le troisième et dernier étage de l’athanor alchimique est nommé grassal – une des étymologies du mot graal est gresal. C’est pendant la phase de coagula que, dans ce troisième étage, la pierre est retournée afin que toutes ses faces soient cuites. Le terme griller se rapporte à cette cuisson”. \n(see http://www.nonagones.info/correlation-geometrique-geographique.php?depl1=Partie+VI+-+Le+carr%E9+SATOR&ph=F1010301.jpg)\nIf Colin Berry still doesn’t understand the optical reason why HE THINKS HE SEES “un homme grillé à petit feu/a slow roasted man” in the TS man image, just let him pray Saint Lawrence (or saint Vincent) for it, saint Cecil (or saint Pareidolia) too…”\n– Then on October 16, 2013 at 9:53 am | #12 Reply | I first wrote in DP’s blog:\n“Re CB being the victim of grail/grid “semblance and avision”, is another good example of RE-EXPERIENCED archaeopareidolia…”\n“Actually the first “CRYPTIC SYMBOLICAL” rendering of the ‘visionary experience’ of a man been slowly roasted while the observer was looking at the burial Shroud (now kept in Turin) dates back to the first half of the 5th C. CE (see the Maryrdom of St Lawrence mausoleum of Gallia Placidia, Ravenna). Many Turin Shroud data are here YET ciphered (via iconosteganogrphy).” \n– Then again on October 16, 2013 at 10:08 am | #14 Reply | and October 19, 2013 at 10:15 am | #53 Reply |:\n“Notice in the Ravenna mosaic the most intriguing characteristic of Saint Lawrence’s grate: it has wheels! Actually the two small wheels cryptically feature two of the four somewhat round scorch marks/water stains in conjunction with the 4 series of smaller burn marks & holes one can still see off the TS body image.”  \nA few Art Historians saw in the nimbused figure in the mosaic not so much saint Lawrence as Christ himself. Notice the two Gammadia on “saint Lawrence”‘s garment are not two capital “L”s but two capital “I”s for Iesus, Yeshua, which tends to prove wrong CB’s casual reading (“It would be L for (St.) Lawrence”)\n“Actually, in the Ravenna mosaic the gridiron grate leg rings (about 5cm in diameter) are about twice smaller in diameter than expected and look more like small wheels. Now the roundish scorch marks/water-stains in conjunction with the 4 series of symmetrical burn-holes and marks on the TS, are about 5cm in diameter too. This is both a spy clue and a de-rhyming pattern in the composition (to read in conjunction with the gridiron grate’s Γ (Gamma)/horizontally mirrored L-shaped corners)”.\n“Most likely the original size of the bloodied body long burial cloth (TS) was 111x436cm not 113x444cm, present size. Hence folding shall be adapted to get about 28x27cm square folding marks all over the cloth surface (and conjure up an archaeopareidoliac grate image in conjunction with roundish scorch marks/water-stains as pareidolia of wheels + blood-belt as pareidola of raging flames under a gridiron grate).”\n“There is another late 11th-early 12th/mid 12th c. CE Shroud-like cryptic Martydom of Saint Vincent/Lawrence being roasted on a grate by Benedictine Abbot-mural artist (Hugh of Cluny (1049-1109)?) See his designed programme of mural paintings in the Cluniac chapel of Berzé-la-Ville in Burgundy). ”\nNotice in the latter depiction, saint Vincent/Lawrence grid pattern: mirrored and non mirrored L/Γ (Gamma)-shaped  series of geometrical small circles. Notice the intriguing ‘circular bind’ around the hands and take a look at the TS man’s hand image area…\n“Actually Saint Vincent and Saint Lawrence are currently mistaken one for the other. (They both embody the Chistian’s profession of Faith in “Jesus Christ, God’s Son, Saviour” i.e. the ICHTUS, “the Fish”).\n– Then again on October 16, 2013 at 5:24 pm | my #23 Reply |, I wrote in DP’s blog:\n“(…) can Colin Berry) “scientifically” recognized a naked Templar by means of the head on the Lirey Pilgrim badge? Is that what he calls circumstantial evidence? A medieval observer taking a look at the Lirey Pilgrim badge, would have either recognized the Holy Shroud or mistaken the naked man for Saint Lawrence or Saint Vincent (not a Knight Templar)!”. Can Colin Berry discriminate between saint Lawrence and saint Vicent? He just cannot. Can he discriminate between knight Templars such as De Molay, De Charny, De Craon, De Goneville, De Payraud etc, he just cannot either.\n– Then again on October 16, 2013 at 5:30 pm |my #26 Reply |, I wrote:\n“Addendum regarding Colins Berry’s biased opinion: Jacques de Molay and Geoffrroi de Charney were burned at the stakes KNELT AND IN THEiR SHIRTS (and not stark naked) not on a gridirion grate like Saint Lawrence and Saint Vincent!”\n-Then again on October 16, 2013 at 7:10 pm | my #29 Reply |:\n“Reminder: Saints who died in imitation of Christ’s self-sacrifice and martyrdom (i.e. in imitatio Christi) could be depicted with Christ-like and even at times Shroud-like characteristic traits AND/OR (pareidoliac) attributes whence the iconosteganographic depictions of e.g. Saint Lawrence (in Ravenna, early 5th c. CE) and Saint Vincent (in Berzé-la-Ville, early 12th c. CE).”\n\n","date":"July 25, 2014 at 6:21 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-140259","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"At the very beginning of the stories of saint Lawrence, saint Vincent and Tuan, the son of Cairill, there was at least one sindonological fact: Yeshua’s (bloodied) body imprint on his large burial wrapping could be mistaken for a scorch…\n\n","date":"July 25, 2014 at 6:32 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-140261","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"On February 16, 2013 at 12:50 pm, I wote:\n“NATURAL CLOTH-TO-CORPSE ARCHAEOLOGICAL THERMAL PRINTING”\nReminder for Colin Berry et al:\nArchaeo(crypto)logically speaking, in the most likely hypothesis the TSM is Yeshu’a, a natural cloth-to-corpse pysychochemicothermal imprinting should account in turn for a high resolution superficial body image, undisturbed bloodstains and a two thousand years’ old degraded blood still looking fresh on the cloth. To trigger up such an accidental/providential image formation process, it requires:\n1/pre-mordanting conditions (i.e. burial linen cloth in-soaked with aqueous alkaline solution such as the Red Heifer waters and/or Jerusalem limestone/Malky dust mixed with waters + ammonia present in urea residues)\n2/auto-collimation (body covered with “opaques” present in the Judean desert and/or Jerusalem limestone/Malky dust + long inner burial linen cloth first tautly wrapped lengthwise and then compressed widthwise around body + next to skin-to-cloth contact followed by gradual loss of next-to-skin-to-cloth contact through burial inner sheet shrinkage and relative loosening as it gets sort of taut again front and back and gradually unstuck from deceased’s body the latter resting in extra height and being laid first on its left side and then right side while drying out\n3/heating source such as corpse in hyperthermia and/or fumigation as a purifying and drying-out ritual.\nNaturally pre-mordanted linen once naturally mordanted, THE MORDANTING looks like a very light scorch or “pre-scorch”.\n\n","date":"July 25, 2014 at 7:09 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-140270","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"Typo: a natural cloth-to-corpse pysiochemicothermal imprinting\n\n","date":"July 25, 2014 at 7:10 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-140273","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Origin of the Gammadia","post":"typo (sorry): PHYSICOchemicothermal imprinting\n\n","date":"July 25, 2014 at 7:11 am","url":"https://shroudstory.com/2014/07/22/origin-of-the-gammadia/","cat":"art","id":"comment-140274","author":"Max patrick Hamon","site":"shroudstory"}]
