[{"title":"Palm Sunday","post":"Last evening, as I have done for some years past, and despite a temporary hearing impairment, I proclaimed the Passion reading to a full congregation at our Palm Sunday Vigil Mass.  This Year B, it is the Passion according to the rudimentary Mark, who always tells it like it was.  There are many passages there which relate to our various discussions on aspects of the Shroud cloth. \nNearly all of the male characters come out of the narrative fairly badly, while the women seem to fare rather better.  This is a sea-change in the contemporary social wisdom concerning gender roles.  Was Jesus anointed for his burial?. The opening passage gives the answer.  A woman comes in and pours an alabaster jar of pure spikenard over the head of Jesus, specifically for his burial we are told.  It is the men who complain of the waste, ointment to the value of 300 denarii, a whole year’s wages for a workman.  \n“One of you is about to betray me!”  “Before the cock crows twice, you will deny me three times!”  At Gethsemane, the disciples cannot keep watch with their master, but fall asleep.  Mark’s gospel is the only one that tells of a young man, fleeing naked, as he leaves his linen cloth behind with the guards.  Some think it is a pointer to the author of the gospel.  Adrie vd Hoeven has suggested it may indeed have been the very Shroud cloth itself, that Joseph of Aramathaea recovered when he went to see Pilate.  Jesus is silent before the Sanhedrin, while the so-called witnesses against him contradict one another, until the direct question is put to him by the high priest, “Are you the Christ, the Son of the Blessed One?”  Receiving an affirmative answer, the high.priest tears his robes, foreshadowing the tearing of the temple veil at the crucifixion.  \nAll attempt to “do their duty”.  The servant girl identifies Peter, but he denies he knows the man.  Pilate knows that it is out of jealousy that the Sanhedrin has delivered Jesus to him, and seeks to release him, but succumbs to the crowd’s demand to release Barabbas.  \nWe are told of the treatment by the soldiers in the praetorium, their mocking, the beatings, the crowning of thorns, and eventually the scourging, all as portrayed on the Shroud cloth.  Simon of Cyrene is pressed into service to carry the cross during the journey to Golgotha.  Even those crucified with him have nothing but taunts. “Let him come down from the cross and we will believe him.”  It is the women who wait by the cross, and note where he is laid. \nThere are so very many different characters in this narrative.  A thoughtful reflection can be achieved by pondering on what character we can most identify with, or most resemble.  It is a tale of gross human weaknesses, only redeemed by the eventual victory of the cross and resurrection. \nAt Communion time, I had the privilege of offering the chalice to a long-time stalwart of our parish, a close friend, who only recently had been baptized, and it was his first Holy Communion.  I feel that this particular Easter has already begun propitiously.\n\n","date":"March 28, 2015 at 10:25 pm","url":"https://shroudstory.com/2015/03/28/palm-sunday-3/","cat":"art","id":"comment-194745","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Palm Sunday","post":"Palm Sunday at the Anastasis:\nhttp://news.yahoo.com/worshippers-pray-historic-holy-land-sites-palm-sunday-093604784.html\n\n","date":"March 29, 2015 at 6:50 pm","url":"https://shroudstory.com/2015/03/28/palm-sunday-3/","cat":"art","id":"comment-194808","author":"Louis","site":"shroudstory"}]
