[{"title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross","post":"In my latest incarnation as revered biblical scholar, here’s a verbatim account of what I added as an appendix to my recent unceremoniously entitled “body bag” posting that may (hopefully) resolve any perceived difficulties. It differentiates between Joseph of Arimathea’s linen on the one hand, used to transport the body from cross to tomb (as per synoptic gospels) and the final burial “shroud” , as per John, the latter probably narrow windings if the truth be told  that replaced the temporary linen. (see also a separate appendix on the Pray manuscript that arguably combines the synoptic versions and John’s showing both Joseph’s opened out linen AND the winding cloths in readiness).\nFrom my posting:\nAPPENDIX 1 : what the NT has to says on the “linen”:\nMatthew, Chapter 28:  \n57. When the even was come, there cam a rich man of Arimathea, named Joseph, who also himself was Jesus’ disciple.\n58. He went to Pilate and begged the body of Jesus. Then Pilate commanded to body to be delivered.\n59. And when Joseph had taken the body, he wrapped it in a clean linen cloth.\n60. And laid it in his own new tomb, which he had hewn out in the rock: and he rolled a great stone to the door of the sepulchre and departed.\nThere is no evidence there that the linen cloth was intended to be used as the final burial shroud. Indeed, it’s clear it was intended primarily for transporting body from cross to tomb. One is not entitled to assume that a sheet of linen used to transport a bloodied body then doubled as the final burial shroud, implying there was no cleaning of the body. How likely was that? Why would the Marys bring ointments etc the next day, unless it was intended to first wash the body – and then remove it from the soiled ‘body bag’ prior to wrapping in  fresh clean sheets?\nMark, Chapter 15\n43  Joseph of Arimathea, an honorable counsellor, which also waited for the kingdom of God, came, and went in boldly unto Pilate, and craved the body of Jesus.\n44. And Pilate marvelled if he were already dead: and calling unto him, the centurion, he asked him whether he had been any while dead.\n45. And when he knew it of the centurion, he gave the body to Joseph.\n46.And he bought fine linen, and took him down, and wrapped him in the linen, and laid him in a sepulchre which was hewn out of a rock, and rolled a stone unto the door of the sepulchre.\n47. And Mary Magdalene and Mary the mother of Joses beheld where he was laid.\nHow likely is it that a length of cloth used to transport a bloodied body from the site of execution would double as final burial shroud?\nLuke, Chapter 23\n50  And, behold ,there was a man named Joseph, a counsellor and he was a good man and a just:\n51… etc etc\n52. This man went unto Pilate and begged the body of Jesus.\n53. And he took it down, and wrapped it in linen, and laid it in a sepulchre that was hewn in stone, wherein never man before was laid.\n54. And that day was the preparation, and the sabbath drew on.\n55. And the women also, which came with him from Galilee, followed after and beheld the sepulchre, and how his body was laid.\n56. And they returned, and prepared spices and ointments; and rested the sabbath day, according to the commandment.\nJohn, Chapter 19\n38. And after this, Joseph of Arimathea, being a disciple of Jesus, but secretly for fear of the Jews, besought Pilate that he might take away the body of Jesus: and Pilate gave him leave. He came therefore, and took the body of Jesus.\n39. And there came also Nicodemus (which at the first came to Jesus by night) and brought a mixture of myrrh and aloes, about a hundred pound weight.\n40. Then took they the body of Jesus, and wound it in linen clothes with the spices, as the manner is it of Jews to bury.\nObserve there is no indication as to what was used to transport Jesus to the tomb. While the “clothes” used  to “wind” Jesus are described as linen, it seems fairly certain they used new material, different from that (unspecified) material used for transport. Might this be the source of confusion – the reference to linen used in two different contexts, one for transport in Matthew, Mark and Luke, and another different linen in John used for the final “winding”.\nMatthew, Mark and Luke describe a linen ‘body bag’ – unlikely to be used as burial shroud. John describes a linen burial shroud, with no indication as to what preceded it, if anything,  as body bag.\n\n","date":"December 2, 2014 at 2:39 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","id":"comment-174267","author":"Colin Berry","site":"shroudstory"},{"title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross","post":"Colin\nso John seems to be the odd one out.\nThe 3 synoptics imply that Jesus was transported from the cross to the tomb and then laid to rest in the one cloth. It was a temporary fix before the proper burial rites.\nFollowing the synoptics, it is consistent to think that the shroud was used to transport Jesus to the tomb and that on the third day He resurrected leaving behind the Shroud and the image – a “by product” of the resurrection.\n\n","date":"December 3, 2014 at 3:25 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","id":"comment-174424","author":"Thomas","site":"shroudstory"},{"title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross","post":"I don’t think lack of “smudges” is problematic.  Anyone who has shared the carrying of a man knows that it can be undertaken without much movement of cloth across the body. Why we just had a “team building” exercise at work recently which involved to three of us carrying a colleague. You support on  the underside and the clothing, cloth, shroud or whatever can remain stationary. Especially if the journey is a relative short one.\n\n","date":"December 3, 2014 at 3:35 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","id":"comment-174427","author":"Thomas","site":"shroudstory"},{"title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross","post":"If I read you correctly, Thomas, what you are saying is there is nothing to say that the sheet of linen, purchased by J of A, was not the one onto which the blood and image of the present TS was acquired, i.e. it could have been used for transport from cross to tomb, and still have been in place, burial shroud-like at the instant of Resurrection, even if not originally intended as the final burial shroud (the sabbath having interrupted final preparations).\nYou’re right, there’s nothing immediately inconsistent with that narrative. But it would turning a blind eye to the writings of Zugibe who claims that the body must have been washed (or partly so) to account for the imprinting and appearance of the scourge marks. All sorts of complications arise if the present shroud had received blood both before and after washing. The different blood stains would surely be far more heterogeneous and “complex” than is the case. \nIn drawing attention to the synoptic accounts of a sheet of linen being deployed to receive the body immediately after removal from the cross, I am simply flagging up what I consider to be a new and credible non-authenticity scenario. A medieval entrepreneur realized those verses from the three synoptic gospels offered an opportunity to build on the Veil of Veronica theme. If a lady’s shawl,  briefly dabbed onto a sweat and blood-stained  face en route to the site of execution could subsequently develop into a portrait-quality likeness, as per legend, albeit with miraculous assistance,  then why not the imprint of sweat and blood left on Joseph’s linen too (with biblical authority too, unlike the Veronica legend!? What’s more, there would be an instant defence against the charge that one was falsely claiming to have the genuine burial shroud. Response: “Who said anything about burial shroud? It’s not the shroud – it’s simply the linen used to transport the body from cross to tomb, and later retained as a keepsake , without laundering, such that sweat imprint gradually yellowed with age.”\nPlease believe me when I say I’m not here to wind people up with a non-authenticity message, but will hang around until I’m absolutely certain that folk know the grounds upon which that message is based. Even now there are some who don’t seem to have cottoned onto the fact that the “scorch hypothesis” is still in business. What’s changed is the rationale for medieval scorching of a life-sized double image. Initially I tried to link that with the Templar executions by slow roasting, based on Lirey’s Geoffroi de Charny being allegedly a nephew of de Molay’s key aide, Geoffroi de Charney who died the same day in 1314 (plus scraps of evidence from the Lirey badge etc). There is no longer any need to seek a Templar link if the purpose of the scorch technology was to produce a life-sized version of the Veronica – the faint scorch image being cunningly marketed as an ancient yellowed imprint left by sweat, with additions of blood as the finishing touch.St.Francis de Sales’ letter to his mum in 1614 when Bishop of Geneva says it all. He had seen the Shroud at close quarters and viewed it as an image bearing sweat and blood. The word sweat was used several times.\nMust run. Grandfatherly duties.\n\n","date":"December 3, 2014 at 4:06 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","id":"comment-174432","author":"Colin Berry","site":"shroudstory"},{"title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross","post":"Well there are all sorts of scenarios. I have always been open to the idea that the shroud is authentic but that some of the blood markings are later “add ons”. There aren’t many who share that view but I think it’s a possibility.\n\n","date":"December 3, 2014 at 4:23 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","id":"comment-174434","author":"Thomas","site":"shroudstory"},{"title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross","post":"The Rubens is a beautiful painting, an excellent devotional work for the pious-minded, and owes everything to its artistic conceptions and very little to its gruesome reality.  The body shows little signs of rigor mortis, hardly any blood can be detected, the descent wasn’t nearly so graceful, and very likely the body was taken down by merely removing the cross-beam from the upright.  Colin’s extracts omit the verses referring to the tomb being close by, virtually on the site, a short walk, so that there was no need of a body bag.  \nI doubt if an authenticist narrative can allow of a body bag, as there is no sign of smearing on the TSM image.  Interpreting the texts “wrapped him in fine linen” as a body bag is stretching the interpretation to suit one’s suppositions.  One does not use “fine linen” for body bag purposes.  Colin’s text seems to be that of the King James version, an excellent text, but like any translation, the translators’ presuppositions intrude and have used the words “wound in fine linen” apparently presuming a bandage type wrapping was meant.  Even Jerome’s Latin Vulgate used the word “lignaverunt” suggesting he may also have been presuming bandages, a mummy style burial. \nThere are several other excellent translations, some say “bound”, others including the Jerusalem Bible merely say “wrapped”.  I see nothing in any of the texts that necessarily or inferentially imply a body bag was used.\n\n","date":"December 2, 2014 at 5:38 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","id":"comment-174282","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross","post":"There’s a wiki entry devoted entirely to the ‘Descent from the Cross” and with it a gallery of images. \nhttps://en.wikipedia.org/wiki/Descent_from_the_Cross#Gallery\nMany of the images show the body being received into Joseph’s sheet of linen, exactly as per biblical chronology (synoptic gospels) or being transported in the linen sheet, the latter being used more as a stretcher than a closed-up body bag. (Artists would prefer the former over the latter for obvious reasons, leaving the face visible). The body bag idea was inspired by my revised belief that the TS could have been someone’s  entrepreneurial idea of modelling a bigger and better version of the Veil of Veronica  for which Joseph’s linen summoned up for immediate transport made a lot more more sense than any final burial shroud, especially if as seems reasonable the body was intended to be washed free of blood and sweat before applying ointments etc). A stretcher would have imprinted one side only. The “body bag” idea allows for simultaneous imprinting of both sides, albeit in a “thought experiment” for post hoc rationalization of the TS image –  not I hasten to  actually imprint from sweat, real or  simulated (considering, as I now do, the TS image to be a contact scorch from a 3D or bas relief template that ‘masquerades’ as an ancient sweat/blood imprint).\nAs I said earlier, daveb would seem to me to be placing far too much emphasis on the one reference to the tomb being near the cross. Personally I would not wish to carry a naked bloodied crucified man even 10 yards as if an animal carcase,  far less 100 or more. Joseph’s provision of linen can be interpreted as a respectful gesture to the newly dead, still on display to onlookers, once the humiliation and public spectacle of Roman crucifixion had been completed.\n\n","date":"December 2, 2014 at 6:24 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","id":"comment-174289","author":"Colin Berry","site":"shroudstory"},{"title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross","post":"PS: While the main title is “Descent from the Cross” there’s an alternative one given: “Deposition of Christ”. Deposition into what? Into Joseph’s linen, obviously as shown in most of the accompanying images, yet curiously the text fails to make a single reference to the linen. I confess to finding myself totally wikified…\n\n","date":"December 2, 2014 at 6:40 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","id":"comment-174290","author":"Colin Berry","site":"shroudstory"},{"title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross","post":"I don’t think the word deposition originally included a suggestion of where the subject eventually ended up. De-position meant the moving of something from somewhere, not to somewhere, if you see what I mean. The current meaning of the word deposit, where the place where the subject ends up is more important than where it comes from, is relatively modern.\n\n","date":"December 2, 2014 at 9:15 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","id":"comment-174305","author":"Hugh Farey","site":"shroudstory"},{"title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross","post":"OK, point taken Hugh. Semantics we know, ancient v modern,  can be a bit of a minefield, at least for those who take a word and assume it has a specific meaning. But there’s the other side of the coin too: those who read of Joseph of Arimathea’s purchase of “fine linen” and take that to mean the final burial shroud. There’s no evidence I can see in any of the four gospels that Joseph’s linen was bought or intended for that purpose. Indeed, the evidence supports an entirely different interpretation: it was intended to receive and enclose, partially or completely, the body of Jesus immediately after removal from the cross, and to assist with discreet transport to the sepulchre. The rest is speculative,  but from the narrative in John appearing to pick up from where the synoptics left off, any cladding that was used for concealment and transport was then replaced with different linen, what might then properly be termed a burial shroud. That would have been after washing and application of spices, ointment etc. As you indicated earlier, medieval artists, some of them at any rate,  clearly saw Joseph’s linen as a solution to immediate needs before arrival at the tomb.\nNo one has yet commented on the possible insights offered by the Hungarian Pray manuscript – namely that it shows both Joseph’s linen under the laid-out body, and replacement narrow winding strips in readiness. Does not the John account suggest that the latter were in place, along with spices etc, before Nicodemus vacating of the tomb and final preparations for interment before the arrival of the sabbath.. \nIn that scenario, blood etc would have been on Joseph’s linen, which having served its purpose could then have been taken from the tomb for laundering and re-use. Pro-authenticity imaging of the body would have been onto Nicodemus’s arguably tighter, more compact, more disposable winding strips, with or without some (fairly minimal) late seepage of blood.\nTake-away message: Joseph’s “fine” line was unlikely to have been one and the same as the shroud with a body image if requiring a resurrection event. But it could have been proposed  by medieval entrepreneurs  (“Relics-U-Like”) as the transport linen onto which an apparent sweat/blood imprint had been formed, a full body-sized version of the Veil of Veronica, post rather than pre-mortem.\n\n","date":"December 2, 2014 at 9:58 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","id":"comment-174308","author":"Colin Berry","site":"shroudstory"},{"title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross","post":"Whatever Colin’s expertise in biblical exegesis, he is clearly echoing the interpretation of a large number of artists, considering how many paintings there are of large areas of cloth draped around the corpse as it was lowered. If Colin’s interpretation of scripture is unjustified, he is nevertheless in good company.\n\n","date":"December 2, 2014 at 7:37 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","id":"comment-174295","author":"Hugh Farey","site":"shroudstory"},{"title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross","post":"Scripture has nothing to say about the exact moment when Joseph deposited the body in the burial cloth. When it comes to painting it depends on the artist’s imagination, which is not gospel truth.\n\n","date":"December 2, 2014 at 8:06 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","id":"comment-174297","author":"Louis","site":"shroudstory"},{"title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross","post":"The terminology is somewhat confusing.\nHere is a Rubens’ ‘deposition’:\nhttp://en.wikipedia.org/wiki/The_Deposition_(Rubens)\nIn Dutch: ‘Kruisafneming’ vs. ‘Graflegging’; in German: ‘Kreuzabnahme’ vs. ‘Grablegung’.\nIn English, the distinction is perhaps somewhat less clear, I don’t know. And of course, there are also paintings representing intermediate scenes, such as the transport from the Cross towards the tomb.\nThe Antwerp painting is most often referred to (in English’) as ‘The Descent from the Cross’.\nThe main point is, that the ‘descent from the cross’ is not described in the gospels. A fortiori, no ‘linen’ of ‘shroud’ is mentioned in connection with the descent from the cross.\nRubens recycled iconographic elements that were in common use, including some kind of shroud or linen being depicted in connection with the ‘descent from the Cross’. However, this shroud or linen  is unusually prominent  on the Antwerp painting. Compare for instance with this painting (da Volterra) that had directly inspired Rubens:","date":"December 2, 2014 at 8:38 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","id":"comment-174299","author":"Jos verhulst","site":"shroudstory"},{"title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross","post":"“The main point is, that the ‘descent from the cross’ is not described in the gospels. A fortiori, no ‘linen’ of ‘shroud’ is mentioned in connection with the descent from the cross.”\nHow do you square that with Mark Chapter 15, Jos? viz:\n46.  And he bought fine linen, and took him down, and wrapped him in the linen, and laid him in a sepulchre which was hewn out of a rock, and rolled a stone unto the door of the sepulchre.\n\n","date":"December 2, 2014 at 8:50 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","id":"comment-174301","author":"Colin Berry","site":"shroudstory"},{"title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross","post":"Is the linen the TS is currently imaged on considered ‘fine’ by medieval standards?\n\n","date":"December 2, 2014 at 11:27 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","id":"comment-174312","author":"David Goulet","site":"shroudstory"},{"title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross","post":"Sure it was David. It came with a 700 year guarantee…But we’ll need to look out the store receipt.\n\n","date":"December 2, 2014 at 11:41 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","id":"comment-174313","author":"Colin Berry","site":"shroudstory"},{"title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross","post":"I really think Colin ought to see if he can get himself a copy of Pierre Barbet’s book “A Doctor at Calvary”, so that his comments can be somewhat more informed on aspects of the crucifixion which he seems unaware of.  Barbet’s style may not be entirely to Colin’s liking, as Barbet was a devout and religious man and this piety is reflected in his reverent approach to his subject.  Setting that aside, his forensics are professionally executed, and  the classical and other sources he draws on are most informative.  He considers various alternative scenarios for what may have occurred, and the conclusions he reaches are well-considered and most rational.  Certainly not any kind of pseudo-science!  Later pathologists, notably Zugibe, differed from Barbet only in aspects of minor detail and these differences are themselves debatable anyway. \nHis chapter 8 discusses ‘The Descent from the Cross, The Journey to the Tomb, and the Entombment’, chapter 9, ‘The Burial’. \nI received my own Image Books 1963 copy from a dear elderly Catholic lady who was moving out of the district a few years ago, and I treasure it.  I see that a modern hard-bound version is currently available on Amazon priced at $19.95, and it also seems available elsewhere.  Good reading!\n\n","date":"December 2, 2014 at 2:16 pm","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","id":"comment-174328","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross","post":"Does the pomposity come naturally, or is it something you have to work at?\n\n","date":"December 2, 2014 at 2:57 pm","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","id":"comment-174332","author":"Colin Berry","site":"shroudstory"},{"title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross","post":"Any suggestion of pomposity or apparent condescension wasn’t intended.  I was genuinely trying to be helpful.  You raise a lot of issues on this site, which suggest you’re not at all aware of Barbet’s work, and I happened to learn a lot from it over the last few years.  Over to you whether you pursue it or not.\n\n","date":"December 2, 2014 at 11:05 pm","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","id":"comment-174388","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross","post":"“You raise a lot of issues on this site, which suggest you’re not at all aware of Barbet’s work”.\nPriceless! Have you consulted any logicians recently? You really ought, for your own good.\n\n","date":"December 3, 2014 at 12:53 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","id":"comment-174398","author":"Colin Berry","site":"shroudstory"},{"title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross","post":"Clarification:  You raise a lot of issues on this site.  Fine! So do we all.  Some of the content that you post would suggest that you do not know Barbet’s work.  I trust that passes the CB test criteria of logical statements.\n\n","date":"December 3, 2014 at 1:43 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","id":"comment-174407","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross","post":"I, for one, appreciate Jos’ study, although it does not seem that it will help in Shroud studies.\n\n","date":"December 2, 2014 at 3:29 pm","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","id":"comment-174336","author":"Louis","site":"shroudstory"},{"title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross","post":"A bit off-track:\nThe link below takes you to an article worth reading, about the Incarnation, not the deposition. One sees here a sort of echo of the views of the German Protestant theologian Ernst Käsemann, who was a student of Rudolf Bultmann:\n http://www.huffingtonpost.com/james-carroll/christ-actually_b_6255534.html?ncid=txtlnkusaolp00000592\n\n","date":"December 2, 2014 at 4:06 pm","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","id":"comment-174340","author":"Louis","site":"shroudstory"},{"title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross","post":"I don’t know of any art where a shroud is ‘at the ready’ at the bottom of the cross.\nWould be interested to know if anyone knows of an example.\n\n","date":"December 3, 2014 at 1:58 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","id":"comment-174412","author":"Thomas","site":"shroudstory"},{"title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross","post":"I should read the lead article shouldn’t I! Rather than just comments\nMy understanding though is its still rare in art to see the shroud / linen cloth in the deposition scene.\n\n","date":"December 3, 2014 at 3:41 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","id":"comment-174429","author":"Thomas","site":"shroudstory"},{"title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross","post":"Google “deposition” “Christ” into images, and see how many paintings include a large sheet, in addition to the almost universal loincloth. It is certainly not rare to see such a thing in a depostion scene. It may even be the norm.\n\n","date":"December 3, 2014 at 7:58 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","id":"comment-174456","author":"Hugh Farey","site":"shroudstory"},{"title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross","post":"Don’t you rely too much on an early 17th c. CE painting to really know how, exactly, Yeshua’s body was taken down from the cross in the first third of the 1st c. CE.\nFrom a pratical standpoint, to save time and ressources, Yeshua’s 4-6 buriers used, as a stretcher, a short ladder (the very same ladder used to take him down from the cross and transport it to the tomb near-by)  (along  with a much larger shroud much like the Kornelimünster Sudarium Domini?). A short ladder and/or a more larger shroud are indeed BETTER CANDIDATES to do the job than an up-and-over long and narrow rectangle of linen secured with temporary ties to accommodate a corpse and transport it near-by. E.g. the 350 x 600cm Kornelimünster Sudarium Domini needs no temporary ties and could received Yeshua’s stiff rigid body with its arms abducted.\nBesides don’t you rely too much too on the translation of the Gospel from one translation vernacular language (ancient Koine Greek) into another translation vernacular languages (modern English).\nE.g. Mark Chapter 15, 46 can read in modern English translation either:\n“And he bought fine linen, and took him down, and wrapped him in the linen, and laid him in a sepulchre which was hewn out of a rock, and rolled a stone unto the door of the sepulchre.”\nOr:\n“(Joseph of Aramathea) having bought fine linen (for his own burial beforehand), he took him down (and then transport him with 4-5 other buriers), and (then they) wrapped him in the linen, and (then they) laid him in a sepulchre that was hewn out of a rock, and (then they) rolled a stone unto the door of the sepulchre.”\n\n","date":"December 3, 2014 at 5:49 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","id":"comment-174441","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross","post":"Typo: E.g. the 350 x 600cm Kornelimünster Sudarium Domini needs no temporary ties and could HAVE received Yeshua’s stiff rigid body with its arms abducted.\n\n","date":"December 3, 2014 at 5:51 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","id":"comment-174444","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross","post":"How odd. There’s resistance being shown on this site to the idea of the body being transferred directly from cross to J of A’s linen. It first showed in Jos Verhulst’s posting (this one) and has been demonstrated in a number of comments since, typified by daveb’s, telling us that no sheet was needed to transport the body to the tomb, it being just a short distance, according to one biblical verse. \nMaybe someone can explain the difficulty with the three synoptic passages that all say essentially the same thing, namely that the body of Jesus was received into J of A’s sheet immediately after “taking down” from the cross and/or before arrival at the tomb. Medieval artists showed no  inhibition in portraying the deposition from cross to linen, as I had to remind folk, and have been supported in that by Hugh Farey.\nSo what’s the difficulty? Is it something to do with the question (unresolved) as to to whether J of A’s linen was still in place at the moment of image imprinting in the tomb (pro-authenticity narrative naturally)? If so, that’s not the issue where this posting is concerned, which is purely to do with the timing of the body’s initial placement into J of A’s linen, not the subsequent fate of that linen.\nMy interest in the precise timing (for which I’m happy to accept the synoptic gospel account) is to do with building credibility for my ‘sweat imprint’ hypothesis, i.e. to help with rationalizing my scorch hypothesis. It was not intended to cast doubt on any of the proposed pro-authenticity scenarios that start with the arrival of a body at a tomb.  \nMy interest is focused entirely on  a medieval trickster’s thinking as to what may have happened en route from cross to tomb, long enough for a sweat/blood imprinting of the TS image that repeated on a larger scale that which, according to legend, produced the fabled face on the Veil of Veronica.  Having said that, I realize the difficulty of keeping the different scenarios  – pro- and anti-authenticity- in their separate water-tight compartments. But we should surely all agree on respecting the chronology of the biblical record as far as J of  A’s linen sheet is concerned, whether or not we see it as one and the same as the ‘Holy Shroud’ that presently resides in Turin. J of A’s linen make its first appearance at the cross, not the tomb.\n\n","date":"December 3, 2014 at 12:40 pm","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","id":"comment-174485","author":"Colin Berry","site":"shroudstory"},{"title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross","post":"Colin I for one have no resistance to the idea. It’s one I’ve always held.\n\n","date":"December 4, 2014 at 1:35 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","id":"comment-174572","author":"Thomas","site":"shroudstory"},{"title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross","post":"Pleased to hear it Thomas. But have you considered the implications? Imprinting onto a linen sheet used immediately after ‘taking down’ generates an entirely different narrative (or possible narratives) than imprinting much later onto the same sheet or a replacement one.  It’s not an area I’m not keen to get into, having said many moons ago that much of what has been written re  ‘re- bleeding’ from old wounds, ‘unclotting’ , etc by this or that mechanism (fibrinolysis, serum exudates of retracted blood clots etc) strikes me as counter-intuitive, indeed credulity-stretching. None of those complicated  some might say contrived scenarios are needed if the imprinting occurs, whether 1st or 14th century, from a real or simulated corpse in which the wounds are still relatively fresh. But all of that overlooks the elephant in the room – the time constraints imposed on imprinting of a secondary body image. If the TS is J of A’s linen sheet, then who’s to say it was not replaced with something else (like Nicodemus’s linen) prior to imprinting of body image by supernatural processes?  Who’s to say that medieval hoaxers had no intention of “modelling” a supernatural imprinting of body image – and were content to propose a Veronica-like imprinting of sweat as well as blood onto the transport linen en route to the tomb?\nI may be totally wrong re imprinting mechanisms, but am sure about one thing: the biblical record simply does not justify the description Turin “Shroud” if there’s no evidence that the sheet of linen was ever intended to be used as the final burial shroud. It should be re-named the Turin Linen, or maybe “Turin Imprint”, leaving open the possibility of it being a  larger post-mortem analogue of the pre-mortem Veil of Veronica. Any miracle would be less to do with  ‘resurrection -imprinting’ than morphing of a sweat-imprint into a negative image of a recognizable human being.\n\n","date":"December 4, 2014 at 2:18 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","id":"comment-174575","author":"Colin Berry","site":"shroudstory"},{"title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross","post":"I like the thinking outside the usual narrative here because it opens possibilities for both sides of the authenticity debate. If the TS is the transport cloth then perhaps this explains some of the anomalies on it – depending on the method of transport the body may not have been lying flat and there might not have been pressure (resistance) against the back and buttocks (as would be presumed on a tomb slab) – explaining why we don’t see a flattening effect on the backside of the image. Is the blood belt a point of resistance?\nA transport linen would need to be longer and stronger than a simple enrobing death shroud. Hugh has pointed out many times how thick the linen is.\nIf it’s the transport cloth would this explain Jesus’ more supple arms in death, rigor not having set in (this occurring later)?\nIf this was the transport linen (versus the burial shroud)then it does remove the Resurrection as a possible image formation source. The image would be natural, though no less a ‘miracle’ given the conditions required to create it.\nSome questions for our forger theory: why did they choose this type of linen for their reproduction? If they are basing their material selections on the Gospels, then why not choose a finer linen as mentioned in the\nGospels?\nThis is a hyper-realistic image (naked, anatomically accurate, etc) even if it is not a painting, is it consistent with the medieval mindset?\nThis is a good ‘questioning of our assumptions’ moment. Let’s keep it rolling.\n\n","date":"December 4, 2014 at 10:02 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","id":"comment-174621","author":"David Goulet","site":"shroudstory"},{"title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross","post":"CB wrote: “Maybe someone can explain the difficulty with the three synoptic passages that all say essentially the same thing, namely that the body of Jesus was received into J of A’s sheet immediately after “taking down” from the cross and/or before arrival at the tomb.” (…) J of A’s linen make its first appearance at the cross, not the tomb”.\nThis is just an interpretation/misrepresentation (of a modern English version of an interpretation in translation Koine Greek), not a fact stricto sensu. Actually, the true meaning of the sentence remains  open to more than just one interpretation.\nReminder for CB: most likely, the cross and tomb were two places not more than 30 yards [90 feet] apart and, when still on the cross, Yehsua’s head was veiled to keep the blood coming out of his nose and mouth, which implies blood smearing (see the Oviedo Sudarium evidence). Most curiously, the alleged ‘genial medieval trisckster/forger’ would have faked the shroud that would have received the body and be used to transport it as a shroud all covered in clear unsmeared blood. Come on give us a break.\n\n","date":"December 3, 2014 at 3:57 pm","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","id":"comment-174505","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross","post":"If we follow CB’s pseudo-logic, the very existence of the Oviedo Sudarium should have stopped him from faking Yeshua’s head blood image on the TS.\n\n","date":"December 3, 2014 at 4:03 pm","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","id":"comment-174507","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross","post":"Reminder two for CB: the tomb consisted of an antechamber with an inner burial chamber. Most likely the corpse was first wrapped-up in the antechamber and then placed on a vaulted stone bench near the entry.\n\n","date":"December 3, 2014 at 4:25 pm","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","id":"comment-174510","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross","post":"Typo: Yehsua’s head was veiled to keep the blood FROM coming out of his nose and mouth\n\n","date":"December 3, 2014 at 4:05 pm","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","id":"comment-174508","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross","post":"Have just taken a closer look at the Rubens painting  that is the subject of this posting (click to enlarge) and spotted something I’d missed (maybe other did not). The linen sheet is actually being used to aid removal from the cross, being deployed like a chute or slide. One of the important-looking gents (probably Joseph of Arimathea) has a free end of linen wound around the leg of Jesus and clearly being used as a friction brake.  There are other outstretched hands being used to support and ease the body down gently.\nSome here have tried to dismiss the idea of Joseph’s linen being used primarily as a means of transport to the tomb, stating that wasn’t necessary (tomb nearby) despite the biblical record stating that J of A’s linen was produced at the cross (not the tomb). Well, now we have another entirely practical reason for using linen at the cross that was needed whether the tomb was 10 or a 1000 yards away – i.e. as an aid to “deposition”. \nHere is one more reason for thinking that Joseph’s linen was not intended for use as the final burial shroud, just one more that can be added to a growing list. Why do we assume the image on the TS, whether authentic or not, was imprinted onto a burial shroud, when there was an opportunity for imprinting onto Joseph’s linen, the latter being removed and replaced by something else (as hinted at in the gospel according to St.John – and the Pray manuscript). Sorry to repeat myself – but Turin “Shroud” looks increasingly like a misnomer – one that may well have put generations of scholars off the scent.\n\n","date":"December 4, 2014 at 6:15 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","id":"comment-174596","author":"Colin Berry","site":"shroudstory"},{"title":"Paper Chase:  New paper by Jos Verhulst on Rubens’ Descent from the Cross","post":"PS  One might predict that “deposition” linen for use as a chute would be twice body length or more!  Oh, and of good sturdy quality. Ring any bells?\n\n","date":"December 4, 2014 at 6:47 am","url":"https://shroudstory.com/2014/12/02/paper-chase-new-paper-by-jos-verhulst-on-rubens-descent-from-the-cross/","cat":"art","id":"comment-174599","author":"Colin Berry","site":"shroudstory"}]
