[{"title":"Pareidolia Again","post":"To paraphrase Scripture:\n“Ignorance of ignorance. All is ignorance.”\n\n","date":"December 27, 2013 at 8:44 am","url":"https://shroudstory.com/2013/12/27/pareidolia-again/","cat":"art","id":"comment-68938","author":"John Klotz","site":"shroudstory"},{"title":"Pareidolia Again","post":"The image on the Shroud does not meet the definition of pareidolia.\n\n","date":"December 27, 2013 at 3:27 pm","url":"https://shroudstory.com/2013/12/27/pareidolia-again/","cat":"art","id":"comment-69139","author":"Andy Weiss","site":"shroudstory"},{"title":"Pareidolia Again","post":"There are at least some things identified on the Shroud by Professor Avinoam Danin that merit consideration. For those who have not read his book “Botany of the Shroud” and seen the excellent photographs, there is another way to have a look:\nhttp://www.people.fas.harvard.edu/~brach/Jerusalem_Flowers/?honnan=Nemzeti_Hirhalo\n\n","date":"December 27, 2013 at 6:10 pm","url":"https://shroudstory.com/2013/12/27/pareidolia-again/","cat":"art","id":"comment-69218","author":"Louis","site":"shroudstory"},{"title":"Pareidolia Again","post":"Louis, I checked the site, but only the text captions came up. The graphics didn’t show, I don’t think it was my security filters. Have the graphics been taken down, or are they still there?\n\n","date":"December 28, 2013 at 12:13 am","url":"https://shroudstory.com/2013/12/27/pareidolia-again/","cat":"art","id":"comment-69309","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Pareidolia Again","post":"David, I checked the link now and everything is there. I used to have such problems with my last computer, a dual-core with Vista but have had no such problems now with an i5 with Windows 7. What you can do is to click on the link several times till the graphics show because that is what I used to do. Apparently you do not have the book, but this no problem because the graphics are of excellent quality, exactly as they appear in the book. Good luck and let us know your views.\n\n","date":"December 28, 2013 at 5:59 pm","url":"https://shroudstory.com/2013/12/27/pareidolia-again/","cat":"art","id":"comment-69659","author":"Louis","site":"shroudstory"},{"title":"Pareidolia Again","post":"David, did you manage to look at the graphics? I am waiting for your views, even if it is negative, because the suggestion came from me.\n\n","date":"January 3, 2014 at 9:09 am","url":"https://shroudstory.com/2013/12/27/pareidolia-again/","cat":"art","id":"comment-71587","author":"Louis","site":"shroudstory"},{"title":"Pareidolia Again","post":"Site came up fine for me.  I’m not a big fan of “I think I see,” even from experts.\n\n","date":"January 7, 2014 at 8:27 pm","url":"https://shroudstory.com/2013/12/27/pareidolia-again/","cat":"art","id":"comment-72538","author":"Andy Weiss","site":"shroudstory"},{"title":"Pareidolia Again","post":"But how about David? I’m still waiting to see what he has to say, even if it is a thumbs down. Danin served as a corporal in the Israeli army, fought in a war, he speaks his mind. If he did write about what he sees it is because he, as a botanist, sees it. At the end of his book he says that his research left him sleepless on many nights, wondering why he had to play this role in Shroud research and I am convinced that he would have the opportunity to confirm at least some of this research had the Church paved the way for him. Even Ian Wilson, who is careful about claims that have been made all along these years, has kept an open mind. That is what he said in his last Shroud book.\n\n","date":"January 7, 2014 at 8:59 pm","url":"https://shroudstory.com/2013/12/27/pareidolia-again/","cat":"art","id":"comment-72541","author":"Louis","site":"shroudstory"},{"title":"Pareidolia Again","post":"Louis,\nI’ve had a detailed look at the link you posted above, and find it a little confusing. Before we get into the Shroud, we get a brief survey of some typical Israeli plants: Phoenix dactylifera, Olea europaea, Anastatica hierochuntica, Anemone coronaria, Capparis aegyptia, Cistus creticus, Chrysanthemum coronarium, Hippocrepsis unisiliquosa, Ridolfia segetum, Rhamnus lycioides and Ziziphus spina-christi.\nNext we get some of the plants ‘identified’ as having left marks on the Shroud: Gundelia tournefortii, Pistacia sp. and Zygophyllum dumosum, Rhamnus licioides, and Anthemis bornmuelleri or Matricaria recutita, as well as the Capparis aegyptia, Chrysanthemum cononarium and Cistus creticus previously mentioned.\nOf these 17 plants, only 7 left their pollen on the shroud, according to Max Frei, and he identified a further 51 plants which do not appear on Danin’s list at all. Phoenix dactylifera and Olea europaea, (the date palm and olive tree) are prolific wind-blown pollinators, so it is strange that Frei did not identify any pollen at all from them, nor from either Anthemis bornmuelleri or Matricaria recutita, whose flowers are identified as clustered thickly around the head. Neither of these plants is found near Jerusalem anyway.\nSpines of Rhamnus lycioides, Gundelia tournefortii and Ziziphus spina-christi are suggested, implying that the crown of thorns was a most elaborate affair carefully composed of strands of three different bushes. Max Frei only identified pollen from Gundelia, although the other two also flower at the same time.\nFinally, Danin considers Zygophyllum dumosum as a particularly indicative plant (and its pollen was identified by Frei), which would be more convincing if the plant grew in Jerusalem, which it doesn’t.\nLooked at as a whole, the whole plant identification issue looks more like a cross between pareidolia and simple wishful thinking than any systematic analysis.\n\n","date":"January 8, 2014 at 10:15 am","url":"https://shroudstory.com/2013/12/27/pareidolia-again/","cat":"art","id":"comment-72591","author":"Hugh Farey","site":"shroudstory"},{"title":"Pareidolia Again","post":"Hugh,the good thing about you is that as a science teacher you are able to analyse many things relating to this field, make a detailed study and thus raise important questions. I  don’t see everything that Professor Avinoam Danin identified on the Shroud, only some two or three things. The thorn image in particular seems to be very clear and I have a complete strand of Ziziphus spina-christi taken from the area near Jerusalem. \nPerhaps there should be two lines of research:\n— A comparison should be made between the tapes Uri Baruch examined, what remains of Max Frei Sulzer’s collection and the pollen that was vacuumed off the Shroud during the restoration\n— Professor Danin must be given the opportunity to continue his research, which means the authorities will need to keep the doors open for him. He is no stranger, he was one of those invited to the round table in Turin by Cardinal Severino Poletto\n\n","date":"January 8, 2014 at 11:05 am","url":"https://shroudstory.com/2013/12/27/pareidolia-again/","cat":"art","id":"comment-72594","author":"Louis","site":"shroudstory"}]
