[{"title":"Petrus Soons’ Anaglyph vs Mario Latendresse’s at SchroudScope","post":"PETER SOONS WEB SITE STATES: Because the image on the Shroud is made up almost entirely of a yellow-reddish coloration, this is highlighted on an orthochromatic plate, allowing an excellent reproduction of the image and an enhancement of the image details, which made them very suitable for the conversion of 2D to 3D that we did later. Basically showing a richness in details that have not been surpassed by the quality of all the photographs that have been taken since 1931. Another factor that makes the Enrie photographs the best ones to use is the fact that he also used photographic glass plates of up to 40 x 50 cm to make the photographs of the face and other details and that he had the opportunity to control the lighting and exposure times at his leisure.\nProf. Fanti and Privitera’s paper titled “Constructive of Quantitative image of Turin Shroud for Details Recognition” provides XYZ measurements from the 2002 Durante’s transparency. If we were to use an XYZ sampling from the measurements provided in Fanti/Privitera’s paper  we can get an approximate quantitative measurement on how much details are lost with the use of Enrie’s Orthochromatic film which is not sensitive to the color red compared to pan-chromatic film photographing the Shroud of Turin. \nSince, we are discussing the renditioning of the 3d hologram of the face on the Shroud we can randomly find samplings from 17 areas by utilizing the colorimetric data in fig. 6 from the Fanti/Privitera’s paper.  I decided to use the designation “k” that contain XYZ values as 0.486  0.422  .0.093.  To simplify any calibration procedures you can convert XYZ value to a PMS color, which converts to, 7411 build. To further simplify the procedure you can convert the PMS color into RGB readings.  Approx. R: 234 G: 169 B: 112 . Using any rasterizing photo program that allows you to toggle channels on and off, create a file filling the background with the RGB build stated above. Using your marquee create another box overlapping the file so you can create two halves. I selected PMS Pantone Bright Red since the red value was maxed at 255 and the rest followed as green 64 and blue 50. Now that you have a file with 1/2 of the image with a build of 234,169,112 the other 255,64,50 go ahead and toggle the red channel on and off. Not surprisingly, there’s a lot of blue and green light still available to create a latent image on the Enries’ photo. Better yet these XYZ values are from Durante’s transparencies and not from the Shroud. The problem is taking a quantitive value from a scanned transparency one would  expect lightness (L) values measured in CIELAB values to decrease substantially.  That would mean the values given from fig 6 are in fact already degraded from the original subject (SHROUD). So one can make the assumption that sample k taken from the original Shroud would have had higher green and blue RGB values increasing the linear characteristics on Enries’ ortho film between image area to non-image area of the Shroud. If one was to continue sampling and compare non-image area with the image area throughout the Shroud you can determine the linear characteristic which then can be quantified how much exposure increase is needed to compensate for the ortho film and you can compare how much destructive interference had occurred between image area and non-image area compared to pan-chromatic film.\nKeep in mind, I’m not professing  there isn’t any destructive interference occurring using Ortho film with the Shroud as the subject, however it’s not as great as the critics tend to have us believe.\n\n","date":"January 16, 2013 at 11:46 am","url":"https://shroudstory.com/2013/01/16/petrus-soons-anaglyph-vs-mario-latendresses-at-schroudscope/","cat":"art","id":"comment-22122","author":"Giorgio","site":"shroudstory"},{"title":"Petrus Soons’ Anaglyph vs Mario Latendresse’s at SchroudScope","post":"Hi Giorgio, are you posting this excerpt from Petrus Soons’ Website to say that it explains how the 3D anaglyphs were produced? That excerpt does not explain that, so I am wondering why you posted it.\n\n","date":"January 16, 2013 at 1:39 pm","url":"https://shroudstory.com/2013/01/16/petrus-soons-anaglyph-vs-mario-latendresses-at-schroudscope/","cat":"art","id":"comment-22129","author":"latendre","site":"shroudstory"},{"title":"Petrus Soons’ Anaglyph vs Mario Latendresse’s at SchroudScope","post":"Hello Mario, My response was meant for the Nov. 18th original posting on this subject. I’ve read that Andy seemed to be concerned that the film used by Enrie by default should not have been selected by Dr. Soons to create his hologram. I’m, not so convinced.\n\n","date":"January 16, 2013 at 2:33 pm","url":"https://shroudstory.com/2013/01/16/petrus-soons-anaglyph-vs-mario-latendresses-at-schroudscope/","cat":"art","id":"comment-22133","author":"Giorgio","site":"shroudstory"},{"title":"Petrus Soons’ Anaglyph vs Mario Latendresse’s at SchroudScope","post":"Giorgio, thanks for the answer. It was not obvious at all that this was the reason you posted this text :-) Also, which part of this text you posted comes from Soons’ Website? The entire text? What is the URL of that text since I can only find parts of that text on Soons’ Website? I find this text quite difficult to follow, probably due to a lack of context and also the non standard notation used. I think the differences between various photographs is a moot point regarding the 3D data embedded in the Shroud. This can be demonstrated by simply showing how each such photograph can be used to generate an anaglyph. The “quality” of the resulting anaglyphs will vary. Although, the Enrie photograph (besides the Durante and Pia photographs) appears to be the easiest one to use to generate an anaglyph.\n\n","date":"January 16, 2013 at 2:48 pm","url":"https://shroudstory.com/2013/01/16/petrus-soons-anaglyph-vs-mario-latendresses-at-schroudscope/","cat":"art","id":"comment-22135","author":"latendre","site":"shroudstory"},{"title":"Petrus Soons’ Anaglyph vs Mario Latendresse’s at SchroudScope","post":"Hello Mario.\nYou can find his excerpt at: http://shroud3d.com/making-of-the-holograms/enrie-photographs\n“THE PHOTOGRAPHS OF GIUSEPPE ENRIE 1931” \nThe link read in it’s entirely, can be very confusing, at least for me.\n\n","date":"January 16, 2013 at 3:40 pm","url":"https://shroudstory.com/2013/01/16/petrus-soons-anaglyph-vs-mario-latendresses-at-schroudscope/","cat":"art","id":"comment-22140","author":"Giorgio","site":"shroudstory"},{"title":"Petrus Soons’ Anaglyph vs Mario Latendresse’s at SchroudScope","post":"Hi Giorgio, thanks for the link, but that Web page (at  http://shroud3d.com/making-of-the-holograms/enrie-photographs) does not contain the text you posted. The Web page at that link starts with the paragraph “When in September 2005 we had produced the first hologram of the face based on a black and white photograph (slide) of the face made by Barrie Schwortz during the STURP investigations of 1978 I made an appointment with Prof. Alan Whanger in January of 2006, knowing that he was in the possession of about 35 high grade second- and third-generation photographic prints that were donated to him by Father Francis L. Filas, who had a set of first-generation negatives. Alan also had three prints from the original Enrie negatives, obtained for him from Turin by Father Peter Rinaldi. The Holy Shroud Guild gave him blanket permission to use them.”. And the rest of that Web page does not contain the text you posted. So, from which part of Soons’ Web site did you get the text you posted? Thanks.\n\n","date":"January 16, 2013 at 4:11 pm","url":"https://shroudstory.com/2013/01/16/petrus-soons-anaglyph-vs-mario-latendresses-at-schroudscope/","cat":"art","id":"comment-22143","author":"latendre","site":"shroudstory"},{"title":"Petrus Soons’ Anaglyph vs Mario Latendresse’s at SchroudScope","post":"Same link I just cut and paste it. Last paragraph starting from the third sentence.\nEnrie Photographs\n Making of the Holograms\nGiuseppe Enrie 1931.\nTHE PHOTOGRAPHS OF GIUSEPPE ENRIE 1931\nWhen in September 2005 we had produced the first hologram of the face based on a black and white photograph (slide) of the face made by Barrie Schwortz during the STURP investigations of 1978 I made an appointment with Prof. Alan Whanger in January of 2006, knowing that he was in the possession of about 35 high grade second- and third-generation photographic prints that were donated to him by Father Francis L. Filas, who had a set of first-generation negatives. Alan also had three prints from the original Enrie negatives, obtained for him from Turin by Father Peter Rinaldi. The Holy Shroud Guild gave him blanket permission to use them.\nAfter seeing the hologram Alan Whanger made available for me these negatives that I took to the Netherlands to have them digitized. Why did we use the Enrie negatives to produce the next holograms ?\nIn May 1931 the Shroud’s owner, King Victor Emmanuel 3rd of Savoye, agreed to have a new series of photographs made on occasion of a Shroud exposition that was held that year and the photographer that would make these photographs was a professional photographer, GIUSEPPE ENRIE. The last time that photographs had been taken was in 1898 when Secondo Pia had made the famous series that showed that the image on the Shroud was like a photographic negative and that set in motion the scientific interest in the Shroud. Since then there had been great advances in photographic technologies and Enrie had moreover the possibility to make his shots with the Shroud not covered by glass. He photographed the complete Shroud in 3 sections and could also make a series of life-size close-ups of the face, the back and the shoulders and also of the bloodstain on the wrist area of the left arm.\nIn 1931, the most reliable light-sensitive material was an orthochromatic emulsion on a glass plate. This emulsion was sensitive to the blue and green elements of white light and insensitive to red. The result was that the red components of the Shroud image were not picked up and produced a sort of transparency, increasing the difference with the green and blue elements of the white light. Because the image on the Shroud is made up almost entirely of a yellow-reddish coloration, this is highlighted on an orthochromatic plate, allowing an excellent reproduction of the image and an enhancement of the image details, which made them very suitable for the conversion of 2D to 3D that we did later. Basically showing a richness in details that have not been surpassed by the quality of all the photographs that have been taken since 1931. Another factor that makes the Enrie photographs the best ones to use is the fact that he also used photographic glass plates of up to 40 x 50 cm to make the photographs of the face and other details and that he had the opportunity to control the lighting and exposure times at his leisure.\n\n","date":"January 16, 2013 at 4:49 pm","url":"https://shroudstory.com/2013/01/16/petrus-soons-anaglyph-vs-mario-latendresses-at-schroudscope/","cat":"art","id":"comment-22145","author":"Giorgio","site":"shroudstory"},{"title":"Petrus Soons’ Anaglyph vs Mario Latendresse’s at SchroudScope","post":"Hi Giorgio, thanks for the precision, but I think there is a misunderstanding here! In my previous post, I asked if the entire text that you posted came from Soons’ Website. You simply gave me a link, so I assumed that met “yes all the text I posted comes from Soons’ Website”.  What you are pointing out is just a part of that text. So, did you write the rest of the text that you posted, that is, what comes after \n“Prof. Fanti and Privitera’s paper titled “Constructive of Quantitative image of Turin Shroud for Details Recognition” provides XYZ measurements from the 2002 Durante’s transparency. If we were to use an XYZ sampling from the measurements provided in Fanti/Privitera’s paper we can get an approximate quantitative measurement on how much details are lost with the use of Enrie’s Orthochromatic film which is not sensitive to the color red compared to pan-chromatic film photographing the Shroud of Turin. “? \nYes or no?\nIf no, where does it come from?\nThanks,\n— Mario Latendresse\n\n","date":"January 16, 2013 at 5:31 pm","url":"https://shroudstory.com/2013/01/16/petrus-soons-anaglyph-vs-mario-latendresses-at-schroudscope/","cat":"art","id":"comment-22152","author":"latendre","site":"shroudstory"},{"title":"Petrus Soons’ Anaglyph vs Mario Latendresse’s at SchroudScope","post":"Mario i understand now. Yes, The above paragraph are my own words. Sorry for all the confusion.\nGiorgio\n\n","date":"January 16, 2013 at 6:42 pm","url":"https://shroudstory.com/2013/01/16/petrus-soons-anaglyph-vs-mario-latendresses-at-schroudscope/","cat":"art","id":"comment-22154","author":"Giorgio","site":"shroudstory"}]
