[{"title":"Picture for Today","post":"It would seem that the restoration did not include the original mid-17th century bright residual colours of the cloth, which have since flaked off!!???  Someone had to say it!\n\n","date":"February 1, 2015 at 5:57 am","url":"https://shroudstory.com/2015/02/01/picture-for-today-2/","cat":"art","id":"comment-188026","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Picture for Today","post":"Daveb, you need the opinion of a professional art conservationist. Anyway, leave it there for a year you will be surprised what comes out of it. All the feed back from people much smarter than you have been very positive.\n\n","date":"February 1, 2015 at 7:26 am","url":"https://shroudstory.com/2015/02/01/picture-for-today-2/","cat":"art","id":"comment-188043","author":"MikeM","site":"shroudstory"},{"title":"Picture for Today","post":"Is that really MikeM touching base? Or has CharlesF cybermorphed?\n\n","date":"February 1, 2015 at 7:35 am","url":"https://shroudstory.com/2015/02/01/picture-for-today-2/","cat":"art","id":"comment-188045","author":"Colin Berry","site":"shroudstory"},{"title":"Picture for Today","post":"I can only presume that MikeM did not grasp my less than subtle use of irony.\n\n","date":"February 1, 2015 at 1:29 pm","url":"https://shroudstory.com/2015/02/01/picture-for-today-2/","cat":"art","id":"comment-188096","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Picture for Today","post":"Yes, you’re probably right, daveb. Sadly, Charles F is probably not false-flagging as MikeM, despite my deep suspicions. I’ll now have to find another way of destroying his otherwise impeccable credentials as a historian. \nSpeaking of irony, I was pleased to see the other day that there’s to be a new feature installed on the next Google Translate update.  It’s a fine-tuning of the ‘Auto-Detect language’ facility, one that will enable it to detect irony with a claimed 95% success rate, especially on Old World websites. \nThe word on my grapevine is that it’s to be installed as default setting on all New World websites  so as to reduce the risk of international misunderstanding, obviating the need for hassle-free rendition to Cuban seaside resorts, water-boarding, all-out-nuclear war etc.\n\n","date":"February 1, 2015 at 2:08 pm","url":"https://shroudstory.com/2015/02/01/picture-for-today-2/","cat":"art","id":"comment-188105","author":"Colin Berry","site":"shroudstory"},{"title":"Picture for Today","post":"I agree Dave.  That is the first thing I noticed is how faint the image looks contrary to Charles’ premise.\n\n","date":"February 1, 2015 at 8:59 am","url":"https://shroudstory.com/2015/02/01/picture-for-today-2/","cat":"art","id":"comment-188060","author":"Russ Breault","site":"shroudstory"},{"title":"Picture for Today","post":"There are very few words under the address:\nhttp://test2.e20progetti.it/docbi/modules/smartsection/item.php?itemid=108\n= … a Quittengo (oratorio di Roreto).\n>In conjunction with the exhibitions of the Shroud of 1998 and 2000 started a project in multiple phases, which provided, in collaboration with the Superintendence of Piedmont, cataloging, photographic documentation, the study and the proposed restoration of all representations Shroud recoverable in the Biella …\n— —- —\nWe can read that, with the collaboration of the Superintendence for Artistic and Historical Heritage [who directed the work] was initiated action for recovery of the most damaged works and then had been recovered five paintings depicting the Holy Shroud.\nHere I want to add that:\nthis place (Roreto) is located only three kilometers from my house\n(in fact I live in Campiglia) …\nIn my Valley there have been (who have lived or were born there)\nand there are still some painters …\nI want to clarify that I am not a painter and I have nothing to do with the restoration of the painting as it was run.\n— — —\nHere another address about\nfrescoes depicting the Shroud made on the walls of private homes in Piedmont:\nhttp://www.piemontesacro.it/sindone/indirizzi_affreschi_sindonici_piemonte_valle_d_aosta.htm\n\n","date":"February 1, 2015 at 10:23 am","url":"https://shroudstory.com/2015/02/01/picture-for-today-2/","cat":"art","id":"comment-188071","author":"piero","site":"shroudstory"},{"title":"Picture for Today","post":"How very odd. Firstly, the almost complete disappearance of the ventral image, in contrast to the dorsal, and not only the image itself, but even the burn-patches from 1532. It is not even possible to make out which arm crosses over which, and there are absolutely no blood flows.\nSecondly, the picture has been restored. Why did it need restoring? Was it because the faithful, touching the frontal image with lips or fingers, had more or less eroded it away? (The painting, I mean, not the Shroud itself)\nAnd thirdly, the feet are spread apart and outwards, very unlike the Shroud, which makes us wonder how carefully the artist really observed it.\nVery interesting.\n\n","date":"February 1, 2015 at 2:24 pm","url":"https://shroudstory.com/2015/02/01/picture-for-today-2/","cat":"art","id":"comment-188108","author":"Hugh Farey","site":"shroudstory"},{"title":"Picture for Today","post":"The 12th c. CE Hungarian Pray Ms monk artist was a more careful observer indeed…\n\n","date":"February 2, 2015 at 10:37 am","url":"https://shroudstory.com/2015/02/01/picture-for-today-2/","cat":"art","id":"comment-188398","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Picture for Today","post":"I think I would have to agree with at least most of Hugh’s observations.  There is some suggestion of burn hole patches on the dorsal half of the cloth at right.  Apart from the cloth itself, the other colours, particularly those of the figures are quite vivid, and it is a certainly a beautiful art-work on that account.  How closely does this restored painting of the Shroud reflect the artist’s initial intentions, and how closely did the artist observe the cloth, if indeed he ever did? \nThere were at least two separate times when Cardinal Borromeo viewed the Shroud, the first in 1578, and the second some four years later.  In 1578 he had also been granted a private showing.  I interpret the posting above suggests the painting was done some time after 1650, and so I would guess it is intended to be representational or symbolic, particularly with figures of the Virgin and cherubim, and hardly a real historic record of any actual event.  \nIan Wilson’s 2010 book, ch 18 makes some interesting observations on the Borromeo ostentations.  Borromeo had made a vow during the plague in Milan of 1576, to walk a pilgrimage to Chambery to see the Shroud, announcing this in 1578 when he was aged only 40.  This provided Duke Emmanuel-Philibert with the excuse he needed to transfer the Shroud to his new capital at Turin, away from Chambery, a little too close to France, and an easier distance for the pilgrimage.   \nOne of Borromeo’s companions, the later cardinal Agustino Cusano, wrote up the event.  His comments on the cloth’s appearance are instructive.  Referring to the image, he writes, “… I say, not with the human art of a painter nor with a variety of colours, but miraculously stamped and portrayed by his own body.  The whole figure is rather obscure, like a dark shadow, or like the first sketch of a painting that now you see it, now you don’t, and that arouses greater desire and diligence to see it again better;  now it is seen better up close, now further back … ”  A similar impression of the vagueness of the image prevails even today.  \nCusano wrote this less than 230 years after the first known ostentation at Lirey, and only some 44 years after the Poor Clare repairs of 1534, notwithstanding l’Abbe Bouchage’s record of a vivid detailed description of the image at that time.  A painting which has flaked?  I don’t think so!\n\n","date":"February 1, 2015 at 10:30 pm","url":"https://shroudstory.com/2015/02/01/picture-for-today-2/","cat":"art","id":"comment-188180","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Picture for Today","post":"And then we have the fresco of 1583 in the Vatican, Galleria delle Carte Geographiche,  showing the ostension shortly after the Shroud arrived in Turin where the images are quite clearly visible from quite a distance – and people are gazing at it from several hundred yards back. (It is fig. 42 in Beldon Scott- I assume everyone has got their second hand copy by now or else these discussions are hardly worthwhile.)  This was clearly a case where, to borrow a phrase from the revd. padre Cusano, it may have been seen better ‘further back’ or at a distance as  de Beatis  noted in 1517.\nI am mystified by this copy. The blessed Amadeo XI died in 1472 but was very much the patron saint of the Savoy dynasty and shown in other depictions so it no surprise to see him alongside Carlo Borromeo who put his stamp on the authenticity of the Shroud (for what reasons we do not know) and the Savoys exploited this for all they could. So that is standard. But it seems as if the frontal image is incorrectly on the  right- it is too faint to make out for sure- and it looks as if the seam of the Shroud is running along the bottom – in other words they may have been holding it upside down. I prefer the clarity of many of the other depictions that Beldon Scott shows as they at least correlate with each other.\nI leave it to Colin to try and destroy my reputation if that is they way he works. No need for a response!\n\n","date":"February 2, 2015 at 7:49 am","url":"https://shroudstory.com/2015/02/01/picture-for-today-2/","cat":"art","id":"comment-188337","author":"Charles Freeman","site":"shroudstory"},{"title":"Picture for Today","post":"Charles, you have amused me recently. You know why? Because of your interview for the magazine “Do Rzeczy Historia”: \nhttp://eprasa.pl/news/do-rzeczy-historia/2015-02-28\nWhen I saw this article in that so much right-wing magazine, I was so amazed that I even purchased that issue! It seemed unbelievable to me that such a magazine (pro-catholic and fiercely anticommunist) would ever publish such sceptical article about the Shroud. But it was much clearer to me when I read that interview, and it gave me impression that you had made a fool from yourself there. Really impressive achievement.\n\n","date":"February 2, 2015 at 10:09 am","url":"https://shroudstory.com/2015/02/01/picture-for-today-2/","cat":"art","id":"comment-188389","author":"O.K.","site":"shroudstory"},{"title":"Picture for Today","post":"Charles wrote:\n“But it seems as if the frontal image is incorrectly on the right- it is too faint to make out for sure- and it looks as if the seam of the Shroud is running along the bottom – in other words they may have been holding it upside down.”\nThat would indicate that the backside of the SOT is being displayed which would explain the faintness of the image. All the characters (cherubs included) seem to observe the side which is not being displayed. You could however point to creases in the weave and barely discernible intensity differences in certain areas in the upper part of the shroud as proof of the seam of the shroud running along the top. This was actually my initial impression. But in the end I think this is an example of pareidolia for what we both want to see. Stronger arguments for explaining away the faintness would be required.\n\n","date":"February 2, 2015 at 11:18 am","url":"https://shroudstory.com/2015/02/01/picture-for-today-2/","cat":"art","id":"comment-188420","author":"Henrik","site":"shroudstory"},{"title":"Picture for Today","post":"Henrik. It is an interesting idea that the image may have soaked through although where is the backing cloth?\nI think the confusion over this single picture in an out of the way church in rural Piedmont that has been restored from we know not what original does not make it a very good example to prove an argument either way. I stick to my belief that we need a database of as many depictions as we can get  to build up the way in which the Shroud looked at different times in tis history. If there is evidence that the loincloth was added, that  is evidence that it may have been repainted at other times in its history. All pure speculation, of course, but one must keep one’s mind open to these possibilities.\n\n","date":"February 2, 2015 at 11:56 am","url":"https://shroudstory.com/2015/02/01/picture-for-today-2/","cat":"art","id":"comment-188434","author":"Charles Freeman","site":"shroudstory"},{"title":"Picture for Today","post":"Yes the backing cloth was there in 1650 so the artist probably didn´t know what the reversed side looked like. He could still have imagined what it looked like though. This is how I wrongly read your post. I stretched your idea with the seam a bit too far I guess.\nAs you wrote, I think that the restoration is the greatest source of uncertainty in this case.\nThe hypothesis of the loincloth is certainly an interesting one. But couldn´t Trent instead have influenced the artists who copied the SOT directly to add the garment in their paintings? After all, the different loincloths seem to differ from each other?\n\n","date":"February 2, 2015 at 1:29 pm","url":"https://shroudstory.com/2015/02/01/picture-for-today-2/","cat":"art","id":"comment-188477","author":"Henrik","site":"shroudstory"},{"title":"Picture for Today","post":"Possibly. What is fascinating is the two earliest depictions we have of the Shroud with the loincloth are with Borromeo presiding as the central figure in 1578 and Francesco Lamberti, bishop of Nice,  presiding in the Carlo Malliano engraving of 1579. Lamberti was one of the signatories of the 1563 Trent ban on lascivia which involved the covering up of nude religious figures, as was the fate of Michelangelo’s Last Judgement in the Sistine Chapel. Borromeo was the papal secretary in 1563 and heavily involved in Trent as well and was obsessed about covering up nude art when he became Archbishop of Milan. I don’t think either would have been seen holding up a nude body of Christ! And seeing how relics were cut up, shared around, closed off in reliquaries, etc, there would have been no impropriety in adding on a loin cloth- in fact greater impropriety in leaving the figure exposed at the height of the Catholic Counter-Reformation.\nBut lots still to be researched on the iconography of the Shroud loincloths!\nThere does seem to be  a line along the bottom third of the Cloth but really the whole thing is too indistinct  and the way the left hand legs are painted is so different from the other images that I don’ t know of anything can be made of it. I shall put the Vatican fresco of 1583 with its distinct images seen from afar as my counterblast!\n\n","date":"February 2, 2015 at 3:50 pm","url":"https://shroudstory.com/2015/02/01/picture-for-today-2/","cat":"art","id":"comment-188515","author":"Charles Freeman","site":"shroudstory"},{"title":"Picture for Today","post":"How strange. I see the frontal image as being on the left, as we look at it, and the head-and-shoulders dark shape on the right as the back of the head and the hair spread out over the shoulders. The feet at the left end of the cloth look to me like the top of the feet, and the dark feet at the right end look like footprints. I see no indication of the seam at all.\nI also don’t think it’s fair to say that it could be upside down, even if the images were the opposite of the conventional. I don’t think it matters which way up it is!\nFinally, any depiction of the shroud being held by holy people is to a certain extent impressionistic, as of course anybody holding the shroud can’t actually look at it. All those bishops and priests perched at the top of the display platforms that we see in all those engravings could not have been engaged in contemplation of the face of their God. Perhaps they all had private viewings inside the church later.\n\n","date":"February 2, 2015 at 1:55 pm","url":"https://shroudstory.com/2015/02/01/picture-for-today-2/","cat":"art","id":"comment-188483","author":"Hugh Farey","site":"shroudstory"},{"title":"Picture for Today","post":"CF: “I don’t think either [ = Borromeo & Lamberti] would have been seen holding up a nude body of Christ! ”  Conceivably the artist, aware of Borromeo’s views on nude religious art, may have decided to bow to his known sensitivities on the matter, and hence chose to show a very faint (barely discernible) frontal image on his depiction of the TS, notwithstanding that Borromeo had already died in 1584, apparently several decades previously (canonised 1610).\n\n","date":"February 3, 2015 at 4:52 am","url":"https://shroudstory.com/2015/02/01/picture-for-today-2/","cat":"art","id":"comment-188735","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Picture for Today","post":"The loin cloth is on the depictions made at the time of Borromeo’s visit and everything is clear there. Better to stick with depictions actually made at the time rather than use ones painted outside Turin many years later by an unknown artist.\n\n","date":"February 3, 2015 at 7:10 am","url":"https://shroudstory.com/2015/02/01/picture-for-today-2/","cat":"art","id":"comment-188762","author":"Charles Freeman","site":"shroudstory"}]
