[{"title":"Picture for Today: Fresco in Pinerolo","post":"Do you know, the more I see pictures like this (the Black Madonna one was another), the more I become convinced that there must have been two distinct shrouds of Turin, in the same cathedral, at the same time – the one we know, from which the various ex origine copies were made, and the exhibition one, which appears in every single engraving and painting of the Shroud being held up. The two traditions are too identical in themselves (faint image, no loincloth, feet together, distinctive blood belt versus bold image, loincloth, feet apart, no bloodbelt) to be independent painterly interpretations of the same thing. It seems that the exhibition copy was either made after the 1532 fire, or had the marks of the fire added to it (not particularly correctly).\nSlightly tongue-in-cheek corollary:- this being so, the Shroud we know was not held at the corners by countless grubby fingered ecclesiastics, was not contaminated by episcopal grime, and did not fray such as to require mending, invisible or otherwise…\n\n","date":"March 1, 2015 at 4:30 am","url":"https://shroudstory.com/2015/03/01/picture-for-today-fresco-in-pinerolo/","cat":"art","id":"comment-192075","author":"Hugh Farey","site":"shroudstory"},{"title":"Picture for Today: Fresco in Pinerolo","post":"Hugh’s t-i-c corollary is a teaser, but I’d say with a highly questionable conclusion.  I’d guess that all the representations of exhibitions would post-date 1453 when Geoffray’s grand-daughter Margaret de Charnay passed the Shroud onto the House of Savoy.  Wilson 2010 has three such representations, and as far as the detail can be seen they seem to fit the feet apart, loin-cloth pattern.  Prior to 1453, known exhibitions by the De Charnay family were:  ~1355 before Geoffray I killed at Poitiers;  1389 provoking Bishop D’Arcis;  From 1489, annual showings on Doubs R;  1449 (Liege, Belgium); 1452 (Macon). \nThere seem to be two fundamental styles of post-1453 representations: 1) representing actual events, cloth usually held by five bishops;  2) symbolic as above with assorted saints, sometimes cherubs or other heavenly figures.   Wilson’s ones are of actual Savoy showings.  \nThe pre-1453 showings would certainly be of the true Shroud.  But what to make of the apparent convention that seems to have developed during the Savoy period? Was in fact a pseudo-duplicate made up for casual exhibitions?  Or are the artists just blindly following an early precedent in their depictions because of the faintness of the image?  But it is curious that when copies were made, they corresponded more accurately with the actual Shroud.  Regardless, it does seem that routine repairs were carried out on the actual Shroud, and I’d surmise that Hugh’s comment to the contrary is no more than naughty provocation.\n\n","date":"March 1, 2015 at 5:44 am","url":"https://shroudstory.com/2015/03/01/picture-for-today-fresco-in-pinerolo/","cat":"art","id":"comment-192082","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Picture for Today: Fresco in Pinerolo","post":"Of course people could have made painted copies in the past. However I have not come across another copy similar to the image like TS. As TS is a negative image of a crucified person no one was able to duplicate another one similar to TS with many hidden details.\n\n","date":"March 1, 2015 at 4:47 am","url":"https://shroudstory.com/2015/03/01/picture-for-today-fresco-in-pinerolo/","cat":"art","id":"comment-192078","author":"Sampath Fernando","site":"shroudstory"},{"title":"Picture for Today: Fresco in Pinerolo","post":"Beldon Scott has done extensive work on the archives and I am sure that if there was any public reference to two Shrouds he would have spotted it and it is hard to imagine they concealed one as this would not be typical of relic cults where the emphasis was on public display.\nIf as I believe , the loincloth was painted on in the 1570s, there may have been no,inhibitions about doing some further repainting.  There are precedents for valued painted linens being touched up as these  images, on the outer fibrils of the cloth, disintegrated so easily.\nI was looking at an exhibition of Indian textiles at the weekend and it was noted that the high rate of decay was such that there are few surviving from before the end of the nineteenth century- mainly cotton in this case,of,course. Certainly there is documentation of thousands, if not hundreds of thousands, of medieval. painted linens, now disappeared. All the more reason to treasure the Shroud .\n\n","date":"March 1, 2015 at 8:50 am","url":"https://shroudstory.com/2015/03/01/picture-for-today-fresco-in-pinerolo/","cat":"art","id":"comment-192096","author":"Charles Freeman","site":"shroudstory"},{"title":"Picture for Today: Fresco in Pinerolo","post":"Sampath, \nRight on.  It’s the “hidden details” all of these experts are pretending to not know.\n\n","date":"March 1, 2015 at 7:50 am","url":"https://shroudstory.com/2015/03/01/picture-for-today-fresco-in-pinerolo/","cat":"art","id":"comment-192094","author":"Stan Walker, MD","site":"shroudstory"},{"title":"Picture for Today: Fresco in Pinerolo","post":"The trouble is that it’s not just the loincloth. The posture of the arms, legs and feet and the lay of the hair are pretty consistent across the ‘exposition’ pictures, and completely different in many of the ‘ex origine’ pictures. Furthermore, unless they kept popping the loincloth on and off, these two series of pictures are more or less contemporaneous over years and years. Fossati’s list of copies (http://www.shroud.com/pdfs/ssi12part4.pdf), has non-loinclothed versions from 1516, 1571,1634, 1643 and finally 1898, and loinclothed versions from 1620, 1646, 1652, 1653, 1678, 1697, and 1708. In the non-clothed versions the feet are crossed or point straight down, in the others the feet splay outwards. He has cropped his images too tightly to see whether the loinclothed ones are in fact cropped from exposition pictures. Fossati also lists some less specifically dated copies. 1588 – no loincloth, 1649 – no loincloth, 1652 – no loincloth.\nI agree that the idea that there were two Shrouds in the same place at the same time is unsupported by any other evidence though!\n\n","date":"March 1, 2015 at 10:04 am","url":"https://shroudstory.com/2015/03/01/picture-for-today-fresco-in-pinerolo/","cat":"art","id":"comment-192101","author":"Hugh Farey","site":"shroudstory"}]
