[{"title":"Pictures of Ostentations","post":"I use a series of these exhibition etchings in my lecture in dealing with the C-14 debacle.  At the very least it demonstrates the absolute insanity of choosing either of the outside corners where we know it had been held and handled hundreds of times.  Here is a clip from one of my lectures, the etchings start about 8 minutes into the clip. https://www.youtube.com/watch?v=e_7Ge-ul6hs\n\n","date":"May 26, 2014 at 8:51 am","url":"https://shroudstory.com/2014/05/26/pictures-of-ostentations/","cat":"art","id":"comment-124758","author":"Russ Breault","site":"shroudstory"},{"title":"Pictures of Ostentations","post":"What a brilliant set of pictures. If I have one caveat, Russ, it would be to suggest that the selection of a single much-handled corner for radiocarbon dating was not the choice of the radiocarbon labs, as you imply. (“Apparently, the carbon dating labs didn’t know that” “cutting one sample into three pieces is not the same as cutting three different samples.”) Such protocols as had been decided by the labs’ representatives had specifically argued against that. They were overruled by the scientific advisors to the bishop of Turin, who are reported as having argued among themselves for a hour or so before finally picking on the area anyone could have predicted years previously. One wonders very much whose the final decision was (Riggi), and why.\n\n","date":"May 26, 2014 at 9:25 am","url":"https://shroudstory.com/2014/05/26/pictures-of-ostentations/","cat":"art","id":"comment-124766","author":"Hugh Farey","site":"shroudstory"},{"title":"Pictures of Ostentations","post":"You are right Hugh.  In fact I usually do correct that statement during the Q&A.  The question always comes up, “Why haven’t they carbon dated it again?”  That is when I reveal the sad news it was the Church itself who made the decision as to how many labs were involved, where the sample(s) would be cut and the location.  No wonder they haven’t asked for another test!   If the 1988 test results are questionable…it is their own fault for allowing aesthetics to supersede a rigorous protocol. However, I do not hold the carbon labs blameless. They knew the risks of taking one sample and the risks of a sample taken from the corner edge.  Did they raise a protest?  Not to my knowledge.\n\n","date":"May 26, 2014 at 10:06 am","url":"https://shroudstory.com/2014/05/26/pictures-of-ostentations/","cat":"art","id":"comment-124781","author":"Russ Breault","site":"shroudstory"},{"title":"Pictures of Ostentations","post":"While it seems unlikely that John Jackson’s hypothesis that absorbed atmospheric CO affected the C-14 dating, one wonders if the 1532 fire may have had something to do with it.  The CO2 and CO from the smoke of the fire ought not to have affected it, as the carbon atoms would have then been from the parent cloth.  However, Is it possible that the heat of the fire and the smoke may have acted as a kind of catalyst which accelerated the absorption of carbon atoms already present in the atmosphere of 1532?  There is a simple experiment to test this.  All that seems necessary is to date a sample from a piece of cloth of  reasonably ancient age, then subject the cloth to fire and charring in a simulation of the Chambery fire, and then to date an unaffected sample from the charred cloth.  Any disparity in the two dates should then be evident.\n\n","date":"May 26, 2014 at 7:56 pm","url":"https://shroudstory.com/2014/05/26/pictures-of-ostentations/","cat":"art","id":"comment-124896","author":"daveb of wellington nz","site":"shroudstory"}]
