[{"title":"Please keep her away from the Shroud of Turin","post":"Would it be appropriate to say “leave the work to the experts”?  That is really badly done.  I’m not even an amateur but I think I could have done a better job than that.\n\n","date":"August 24, 2012 at 10:48 am","url":"https://shroudstory.com/2012/08/24/please-keep-her-away-from-the-shroud-of-turin/","cat":"art","id":"comment-15429","author":"Andy Weiss","site":"shroudstory"},{"title":"Please keep her away from the Shroud of Turin","post":"May G.od protect Shroud research from somewhat misguided amateurs & experts!\n\n","date":"August 24, 2012 at 11:34 am","url":"https://shroudstory.com/2012/08/24/please-keep-her-away-from-the-shroud-of-turin/","cat":"art","id":"comment-15437","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Please keep her away from the Shroud of Turin","post":"LMAO! Now that is funny…Poor elderly lady, well intentioned, but most likely suffering from cataracts or some vision infliction nonetheless, has managed to destroy what she intended to restore…She must feel terrible!\nR\n\n","date":"August 24, 2012 at 12:32 pm","url":"https://shroudstory.com/2012/08/24/please-keep-her-away-from-the-shroud-of-turin/","cat":"art","id":"comment-15441","author":"Ron","site":"shroudstory"},{"title":"Please keep her away from the Shroud of Turin","post":"Restorations may be controversial, at least here, we can reach a consensus to say it is not brilliant.\n\n","date":"August 24, 2012 at 2:35 pm","url":"https://shroudstory.com/2012/08/24/please-keep-her-away-from-the-shroud-of-turin/","cat":"art","id":"comment-15443","author":"anoxie","site":"shroudstory"},{"title":"Please keep her away from the Shroud of Turin","post":"Looks like an image of the “Snow monkey” on Internet Explorer images. \nI didn’t mean to laugh, but it’s hysterical.  I feel badly for the restorer, as well.\nBest,\nAngel\n\n","date":"August 24, 2012 at 10:06 pm","url":"https://shroudstory.com/2012/08/24/please-keep-her-away-from-the-shroud-of-turin/","cat":"art","id":"comment-15459","author":"Angel","site":"shroudstory"},{"title":"Please keep her away from the Shroud of Turin","post":"It does show forth the expertise of the original artist.\n\n","date":"August 25, 2012 at 10:07 am","url":"https://shroudstory.com/2012/08/24/please-keep-her-away-from-the-shroud-of-turin/","cat":"art","id":"comment-15470","author":"Andy Weiss","site":"shroudstory"},{"title":"Please keep her away from the Shroud of Turin","post":"And now for a dissenting voice!  “I think it looks better this way”: (???)  Letter published in Wellington Dominion Post, August 27, 2012: \n“I’m going to stick my neck out: Cecilia Gimenez has vastly improved the portrait of Jesus in her home town church in Spain.  The original was decidedly twee – a sentimental, chocolate-box confection reflecting 19th ventury sensibilities.”\n“She has done something wonderful; a primitive Christ, painted from the heart.”\n“I see the influence of Tony Fomison in her work.  Perhaps she’s spent some time in New Zealand?”  Gillian Cameron, Karori (NZ). \nYou haven’t heard of Tony Fomison?  Neither have I.  Some NZ wannabe artist I presume.  But I won’t bother to Google to find out.  Our country is a wonderful tapestry of weird and wonderful people!\n\n","date":"August 28, 2012 at 6:09 pm","url":"https://shroudstory.com/2012/08/24/please-keep-her-away-from-the-shroud-of-turin/","cat":"art","id":"comment-15548","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Please keep her away from the Shroud of Turin","post":"Look at the scenario through another lens.\nYou have a single, old, photograph of your father that you want to be restored, and with a tremendous amount of hesitation you give it to a restorer.  The restorer then restores the photo and returns it to you.  Yet, the original image of your father has now become the restorer’s version of how he or she believes your father should look.  Would you be content?  Since your photo is irreplaceable, I think not.\nI’m certain this restorer had all the best intentions, but she should not have deviated from the original image on the portrait. \nHow easy it would have been for her to buy her own canvas and paint her own original Picasso-like masterpiece.\nWhat she did, whether deliberate or not, is tantamount to restoring the Mona Lisa and turning her smile into a sneer.\n\n","date":"August 31, 2012 at 8:12 pm","url":"https://shroudstory.com/2012/08/24/please-keep-her-away-from-the-shroud-of-turin/","cat":"art","id":"comment-15672","author":"Angel","site":"shroudstory"},{"title":"Please keep her away from the Shroud of Turin","post":"Angel’s analogy is a good one.  I restored a photo for an elderly friend’s grandfather, one of the early pioneers in Dunedin.  But it was all done electronically.  Original was scanned, and then a colour cloning tool applied to the damaged areas on the JPEG.  The result was so splendid that the retouched photo was able to feature as the cover picture on the family history document I’d prepared for the family who were delighted with the result.  Cecilia Giminez’ efforts above illustrate only too well the destructive power of incompetence and ignorance.\n\n","date":"September 1, 2012 at 4:39 pm","url":"https://shroudstory.com/2012/08/24/please-keep-her-away-from-the-shroud-of-turin/","cat":"art","id":"comment-15695","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Please keep her away from the Shroud of Turin","post":"daveb of wellington nz,\nYour restored photo probably made your family very proud.  Genealogy is a tremendous amount of work, so it’s great you have a nice cover for your family’s history.\nThis story made me think of the original artist’s family.  Surely they must have been devastated at the result, although unintentional.   Certainly, it was an accident; unfortunately, a very costly one.\nRegards,\n\n","date":"September 6, 2012 at 8:08 pm","url":"https://shroudstory.com/2012/08/24/please-keep-her-away-from-the-shroud-of-turin/","cat":"art","id":"comment-15958","author":"Angel","site":"shroudstory"},{"title":"Please keep her away from the Shroud of Turin","post":"People are streaming in from all over the world and are paying the church to see this restored painting.\nABC News with Diane Sawyer just reported that the church made millions off the restoration and the artist is suing.  Apparently she wants her fair share of the money.\n\n","date":"September 20, 2012 at 7:06 pm","url":"https://shroudstory.com/2012/08/24/please-keep-her-away-from-the-shroud-of-turin/","cat":"art","id":"comment-16628","author":"Angel","site":"shroudstory"}]
