[{"title":"\nDid Max Frei misidentify Carduus argentatus Shroud pollen as Gundelia tournefortii?\n","post":"\n\nMr. Jones,prof. Danin quotes in his last book prof. Litt sayng: \"I cannot make a precise identification of the pollen at the genus level, even less at the species level. However, with a high level of probablility, I can exclude that the pollen I have seen from the sticky tapes belong to Gundelia.\".but from your post I understand that prof. Litt made indeed an indentification at the genus level (cardus) even if he has previously said it was not possible..So, prof. Litt has changed his mind?\n\n","author":"domenico","date":"August 13, 2010 at 4:12 PM","url":"http://theshroudofturin.blogspot.com/2008/11/did-max-frei-misidentify-carduus.html","site":"moore"},{"title":"\nDid Max Frei misidentify Carduus argentatus Shroud pollen as Gundelia tournefortii?\n","post":"\n\ndomenico>Mr. JonesThanks for your comment and apologies for my delay in replying. I am now on holidays from almost full-time work as a relief (aka substitute or supply) teacher, so I can begin to catch up with my blogging.>prof. Danin quotes in his last book prof. Litt sayng: \"I cannot make a precise identification of the pollen at the genus level, even less at the species level. However, with a high level of probablility, I can exclude that the pollen I have seen from the sticky tapes belong to Gundelia.\"I have seen that quoted elsewhere, e.g. on the Shroud of Turin Blog and The Definitive Shroud of Turin FAQ, but from memory I have not posted it myself, although I do have it in a copy of a private email between Prof. Danin and another person:\"In his report to CSST Prof. Litt wrote: `The images produced by light microscopy (interference contrast) and by confocal laser-scanning microscopy show clearly that waxes are preserved and cover the structure and sculpture of the pollen grains. This is the reason why I cannot make a precise identification of the pollen at the genus level, even less at the species level. However, with a high probability, I can exclude that the pollen, I have seen on the sticky tapes, belong to Gundelia.'\">but from your post I understand that prof. Litt made indeed an indentification at the genus level (cardus) even if he has previously said it was not possible. So, prof. Litt has changed his mind? I don't know whether Prof. Litt has changed his mind. In the same email Prof. Danin wrote:\"In the summer of 2001, I informed Dr. Whanger of the results of the pollen analysis carried out by Prof. Dr. T. Litt in Bonn; I told him that what was considered earlier as Gundelia tournefortii got a lower grading and fell into the `box' of Carduus type.\"Probably the key to this apparent contradiction is the word \"precise.\" That is, Prof. Litt was able to tentatively identify what Frei thought was the pollen of Gundelia tournefortii as being of the genus Carduus, without being able to conclusively identify it as such.Stephen\n\n","author":"Stephen E Jones","date":"September 26, 2010 at 9:18 PM","url":"http://theshroudofturin.blogspot.com/2008/11/did-max-frei-misidentify-carduus.html","site":"moore"}]
