[{"title":"Doubting the Pollen Evidence","post":"There is also the paper by Marzia Boi, a professional palynologist, which can be found on this very site on May 25th 2015 under ‘ A Treasury of Reading Material’. She concurs that the Frei samples/’findings’ should NOT be used and that we should start with totally new samples.\nThis is an important paper in the absence of a Thomas Litt’s full analysis.j\n\n","date":"September 13, 2015 at 3:48 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210251","author":"Charles Freeman","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"Los escéptico CONFUNDEN a muchos autenticistas con el tema del polen centrando su atención en la “especie”\nComo ejemplo el de la Gundelia.\nEl polen del GÉNERO Gundelia está presente en la Sábana Santa.\nY sea cual fuera la ESPECIE (“Gundelia aragatsi” vs.”Gundelia tournrfortii”) , la PRESENCIA de ese polen es totalmente favorable a la autenticidad de la Sábana dada la distribución geografica del GÉNERO.\nDistribución geográfica del GÉNERO Gundelia: \nAsia-Temperate: Caucasus (Transcaucasus (Armenia ,Azerbaijan , Nagorno Karabakh , Nakhichevan )) \nMiddleAsia: (Kazakhstan (Kazakhstan,Turkmenistan(Turkmenistan), Uzbekistan (Uzbekistan )) \nWestern Asia (Afghanistan (Afghanistan), Cyprus (Cyprus ), Iran (Iran ), Iraq (Iraq, Lebanon-Syria (Lebanon, Syria ),Palestine (Israel, Jordan ), Sinai (Sinai ,Turkey (Turkey ))\nAfrica: Northern Africa (Algeria (Algeria ))\nCarlos\n\n","date":"September 13, 2015 at 7:00 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210271","author":"Carlos","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"Understood, Carlos, but actually thistle pollen is much the same whatever the genus, and anyway it now seems that the “Gundelia” pollen was misidentified even at genus level. Possibly Carduus instead.\n\n","date":"September 13, 2015 at 7:45 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210277","author":"Hugh Farey","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"“We must not be hasty too hasty to dismiss it altogether”. Naturally, although Professor Danin seems to have changed his mind.\nHowever, in the following interview.it is said that that the dusts vacuumed from the relic confirm the data obtained by Max Frei Sulzer, supported by fragments of pollen grains detected on the relic.\nWe may expect a paper on this in the future:  https://www.academia.edu/8841978/Professor_Giulio_Fanti_discusses_the_controversies_in_the_realm_of_Shroud_studies\n\n","date":"September 13, 2015 at 8:43 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210279","author":"Louis","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"There is a reason why I concentrate on the blood evidence and the nature of the image. They have been analyzed down to the quantum level and determined to be real blood and an image that is not a painting BY SCIENCE.\nI was truly amazed by an earlier  post by Charles Freeman that he hadn’t read Rogers book and couldn’t be bothered by Rogers work because it wasn’t Freeman’s field.\nAs I have written, the study of the Shroud is multi-disciplinary and any anyone who doesn’t take the time to study the multi-disciplines involved is like a blind man trying to define an elephant. We should honor Freeman with the “Brass Tusk Award.” Can’t be ivory for obvious reasons and brass seems to fit Freeman to a tee.\n\n","date":"September 13, 2015 at 5:11 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210260","author":"John Klotz","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"They have been analyzed down to the quantum level\nJohn.\nCan you specify what do you mean by “down to the quantum level”?\nRegards\n\n","date":"September 13, 2015 at 5:51 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210266","author":"O.K.","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"The devices used by the STURP team included those whose analysis depended on the properties of matter at the very basic level of existence. In Heller’s book he relates how they used a microspectrophotometer searching for a “soret band” of light spectrum of a tiny speck on the Shroud which would indicate blood. To me that’s down to the quantum level.\nWe now have much more advanced tools which could be used including much sophisticated Multispectral Digital Imaging that was used on the Mona Lisa and to identify da Vinci as the artist who sketched a drawing of a young bride: La Bella Principessa. \nI am really jammed right now and I am ducking in and out so that’s as far as I can go for now. La Bella Principessa is discussed in Chapter 14 of my book the Coming of the Quantum Christ when I deal with the provenance of the Shroud. Quantum mechanics began with the discovery that light exhibited properties of both wave and matter in packets labeled quanta. Use of scientific analytical devices that depend on analyzing the spectrum of light of an object, in my view, is analysis down to the quantum level.\nIt’s all about light. Then too, some theologians might say that’s what God is all about. “And the light shines in the darkness.”\n.\n\n","date":"September 13, 2015 at 6:35 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210268","author":"John Klotz","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"In Heller’s book he relates how they used a microspectrophotometer searching for a “soret band” of light spectrum of a tiny speck on the Shroud which would indicate blood. To me that’s down to the quantum level. […] Use of scientific analytical devices that depend on analyzing the spectrum of light of an object, in my view, is analysis down to the quantum level.\nYes. But myself, I wouldn’t overuse the term “quantum” (use more precise term “spectroscopic” instead). It may be misleading -and besides it sounds bizarre in scientific publications.\n\n","date":"September 13, 2015 at 6:57 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210270","author":"O.K.","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"OK,\nI am not writing for a scientific academic audience. I am trying to reach out to a more general audience.  \nMy literary ideal is actually a lyricist, Stephen Sondheim who has the ability to express the most lyrical of sentiments in the “vernacular” so to speak.\n“Today, the world was just an address,\na place for me to live in,\nno better than alright.\nBut here you are, and what was just a world is a star.\nTonight”\nHis language moves from mundane to the most lyrical and romantic in a single phrase.\n\n","date":"September 13, 2015 at 7:22 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210272","author":"John Klotz","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"John:\nI am not writing for a scientific academic audience. I am trying to reach out to a more general audience. \nYes. But in your statements regarding science, try to be as much accurate, as it is possible with regards to a general audience. Less poetry, more precise language.\nThere are too many quack doctors in the field of syndonology. Be clear in your language -to avoid the misunderstanding, or even misleading the public.\n\n","date":"September 13, 2015 at 11:02 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210287","author":"O.K.","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"But I have read Rogers and Schwalbe’s paper and note that they reproduce the photograph of the same corner as the samples were taken from and the same corner that John Jackson has reproduced the photograph with his own conviction that there was no reweaving there.  Even Ian Wilson has been convinced!!\nOn that issue with Flury -Lemberg and other experts who have examined the Shroud close-up specifically for reweaving, we can safely conclude that this is a dead end subject.\nI have struggled to follow the logic of even the short article Rogers wrote = my heart sinks at the idea of having to plough through a whole book of his!, so with lots of new works on painted linens and weave fragments competing for my attention, i think that the latter will have more relevance.\nWhen people ask me what to read on the Shroud, I always start them off on Beldon Scott because that is the only full length study of the Shroud based on archival research. So i am equally amazed that many who talk as if they were experts on the Shroud have not even read it.\nThe blood tests have never been replicated, despite the enormous sophistication of blood testing in recent years. I always assumed that a test was not valid until it had been replicated by an independent investigator- no such luck here. However, I have compiled my personal list of all the known bloods of Christ, bleeding hosts,etc, etc, for the fourteenth century which show that there was a big market in such relics and, although no expert I have consulted who has read Heller and Adler or looked at the Evans photographs of blood thinks that it is blood, the application of human blood to a relic claiming to be authentic was quite common in the fourteenth century  and , if anyone does replicate the tests and shows that there is human blood on the Shroud, this is the first period we should be looking at for its addition. \nAll honours,awards, etc, in whatever metal are gratefully received!\n\n","date":"September 13, 2015 at 6:03 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210267","author":"Charles Freeman","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"It’s all very well to propose a new round of pollen investigations, but following the 2002 “restoration”, that is likely to prove quite difficult if not impossible.  The debris on the Shroud from this “restoration” was supposed to have been collected, and one might hope that is adequately catalogued “somewhere in Turin”.   How accessible it might be to bona fide investigators would be another question entirely.  Meantime we have to be satisfied with the previous investigations by Frei, Danin, Baruch and Litt, hoped for publications at some time in the future, and with what Hugh Farey makes of it all, himself no specialist in palynology, an extremely difficult science.  The comment that pollen cannot be identified at species level seems peculiar.  One might expect that the DNA of pollen grains ought to be exclusive at the species level, and one might hope for a technology that could actually make this identification, when past samples could be re-examined.  I think it was Stephen Jones who had at one time suggested that the pollen collected might be radio-carbon dated.  How feasible that proposition might be could be doubtful, and likely have the disadvantage of destroying what pollen samples might be available.  We end up with yet another unsatisfactory situation, apparently having put all our trust in those with a claim to know the science, but apparently who knew a lot less than they thought they did.\n\n","date":"September 13, 2015 at 5:21 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210261","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"It is not a bad idea to start with reading what a professional says about an issue- I dont’t think anyone should really comment on the pollen issue until they have digested Marcia Boi’s article. She is a professional in this field who has no particular axe to grind.\nWhy should we have to be satisfied by what Frei, who had no expertise as palynologist, had to say when experts in  the field can quite clearly point out where he has gone wrong.\n\n","date":"September 13, 2015 at 10:52 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210284","author":"Charles Freeman","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"We all refine our opinions with age, I guess. In my article (2014) I mentioned Marcia Boi’s 2010 opinions, but not, unsurprisingly, her 2015 ideas. In 2010, apart from spotting what she thought were a few misidentifications, she was mostly concerned with what the presence of all those species might signify in terms of funeral rites, and not at all dismissive of Frei’s findings. This year, she is much more critical. Frei’s studies are ” wildly inaccurate”, his pollen was  “forcibly made\nto match a probable geographic origin”, and his conclusions are “partial and ambiguous.” One after another, even after giving it initial credence, anybody who examines the pollen data finds it too anomalous to be acceptable as any kind of evidence.\nDaveb makes an interesting comment. “We end up with yet another unsatisfactory situation, apparently having put all our trust in those with a claim to know the science, but apparently who knew a lot less than they thought they did.” Without wishing to be dismissive, this is the attitude of many authenticists, whose uncritical acceptance of anything which supports their belief (and, with McCrone in mind, an uncritical rejection of anything which doesn’t) has led them to come a cropper when discrepancies and uncertainties are pointed out. Eventually, I truly believe, a general consensus for authenticity or otherwise will be established, on the basis of new data, or old data reinterpreted, but simply putting all ones trust in “scientists”, without carefully evaluating their work for ones self, is not the way to do it.\n\n","date":"September 13, 2015 at 12:29 pm","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210290","author":"Hugh Farey","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"Hugh:\nDaveb makes an interesting comment. “We end up with yet another unsatisfactory situation, apparently having put all our trust in those with a claim to know the science, but apparently who knew a lot less than they thought they did.” Without wishing to be dismissive, this is the attitude of many authenticists, whose uncritical acceptance of anything which supports their belief (and, with McCrone in mind, an uncritical rejection of anything which doesn’t) has led them to come a cropper when discrepancies and uncertainties are pointed out.\nI agree with you and Daveb’s comment (with a deep irritation). However, I must also add that attitude of the skeptics (I can name you one honorable exception) is the same, or even much worse. Malice, manipulations, misleading statements, character assasinations, sophistic acrobatics, eristic tricks -are the favorite methods of several so-called “skeptics”. The latest editorial in TCA is the best example of this way of “research”.\n\n","date":"September 13, 2015 at 12:40 pm","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210292","author":"O.K.","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"If one cannot trust scientists to carry out their work competently, but need to rely on one’s own conclusions, of what possible value could Science be to any kind of human endeavour?  \nAs for Frei, his fundamental training was in botany, he exercised the science of palynology to the extent that it had been developed in his time, had often applied it giving evidence in several criminal cases, and was widely consulted by several other Police jurisdictions, to the extent that he was commissioned to investigate the plane crash when former UN Secretary-General Dag Hamerskjoeld was killed.  \nIt might be fair to ask to what extent has Hugh  Farey been commissioned to give palynological evidence in criminal cases!\n\n","date":"September 13, 2015 at 3:36 pm","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210299","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"It’s not about whether anyone has been commissioned to give any evidence in any case. It is about whether the evidence stacks up; whether all premises presented in the clearest possible way, understandable for all, justify the clearly expressed conclusions.   Or in other words: do their claims make any sense, based on all what we know?\nIf some “experts” screwed their job, this can be detected. Pollen identification needs expertise in the field, but identification of badly performed science needs expertise of a completely different sort.\n\n","date":"September 13, 2015 at 4:02 pm","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210304","author":"O.K.","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"No, of course it wouldn’t be fair. You’re back to clinging to putting all your trust in ‘experts’ who must be right rather than looking at their data for yourself. I know absolutely nothing about pollen that I haven’t read on the internet in the last three years or so and have never been asked to do anything in a criminal case. So what? Does that mean I’m wrong? Try me. Did Frei use a light pressure or a heavy one? Did he fold his tapes on themselves or not? Did he accurately identify 58 species of plant? Did he compare his samples with “botanical gardens worldwide renowned for their collections”? Are any of the contradictions and obscurities I pointed out in my article untrue? If so, name one. Or is everything I say to be ignored because I haven’t testified in a trial? \nHe was commissioned to investigate the plane crash when Dag Hammarskjold was killed. Yes indeed. He attempted to do this by melting down as much of the airframe as he could, weighing it, and examining it for traces of bullets or bombs. He concluded that one could “exclude the possibility of hostile actions from the air or from the ground” and that there was “no room for the suggestion of sabotage”. His conclusions were challenged immediately, and the possibility of sabotage was, and continues to be, investigated.\n\n","date":"September 13, 2015 at 5:34 pm","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210312","author":"Hugh Farey","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"No; no part of the Shroud has been “analyzed down to the quantum level.” Hardly anything has. While it is true that everything is made of atoms, and that the interior of atoms operate according to the rules of quantum physics, it is certainly not true that any of the experiments on the Shroud depended on any knowledge of any of it. The Soret band was discovered and explained by Jacques-Louis Soret in 1883, and does not require any quantum analysis to be useful. To the layman, there does not seem to be much difference in scale between ‘a small speck’ and an electron, such that one can say “To me that’s down to the quantum level,” but the difference is similar to that between the solar system and a football.\n\n","date":"September 13, 2015 at 7:40 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210275","author":"Hugh Farey","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"Hugh,\nMax Planck circa 1900 theorized that light was both wave and discrete particles he called quanta, scientists were doing experiments using light. That fact that a prism split a light “beam” into various spectra was old news. However, that was a process at the quantum level of the object. So too was the two slit experiment, one the basic proofs of quantum mechanics preceded Plank’s definition of “quanta” by a century.\nIndeed, the phrase “quantum mechanics wasn’t adopted instantaneously when Planck first theorized the existence of quanta but a two decades later.. \nI am really jammed until at least 9/22 so I can’t engage in extended debate but I do try to keep my eye on things.\n\n","date":"September 14, 2015 at 7:26 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210360","author":"John Klotz","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"Yes, I know. The fact that a steam engine operates at a quantum level, which of course it does, does not mean that any  quantum science is needed to operate it. The same is true of all Shroud investigations ever made. No experiments, results or the conclusions drawn therefrom were any more “at the quantum level” than James Watt and his steam engine.\n\n","date":"September 14, 2015 at 8:03 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210364","author":"Hugh Farey","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"I’ve just read John’s reply that he was using the term poetically. Fair enough – not sure why he wrote “BY SCIENCE” in capital letters if that was the case though…\n\n","date":"September 13, 2015 at 7:47 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210278","author":"Hugh Farey","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"O.K. seems locked into a close world as if advances in science cannot possibly tell us anything new about the Shroud. Yet there is a lot of new work- Boi’s article is one- that can move one on to new understandings, showing that some positions, such as Frei’s are no longer tenable. Every field of science is the same.\n\n","date":"September 13, 2015 at 1:48 pm","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210295","author":"Charles Freeman","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"To your info Charles; your provocation does not move me at all. You have discredited yourself enough in the Shroud world, to be worthy of any serious discussion.\n\n","date":"September 13, 2015 at 2:25 pm","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210298","author":"O.K.","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"You have no need to discuss with me. We need a serious consideration of articles such as Boi’s who, among others with the relevant expertise, has shown that Frei’s arguments are not to be trusted. It would help if there was evidence that Boi had been actually read! If you don’t read these articles you are bound to give the impression that you are locked in.\n\n","date":"September 13, 2015 at 4:09 pm","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210305","author":"Charles Freeman","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"I have read Boi’s article.\nI trust that her assessment is fair.\nI think there are some lessons from the whole pollen story that need to be remembered by the Shroud scholarship. I hope they will be.\nI have a large dismay, that some people pretending themselves to be experts and scientists let down my trust. It doesn’t matter whether they are pro- or anti- authenticity.\n\n","date":"September 13, 2015 at 5:20 pm","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210311","author":"O.K.","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"Do you know what is the Society for Organic Petrology (=TSOP)?\nIf I well remember Rogers did indicate to me (only vaguely)\nsomething (articles of possible interest regarding\nthe study of the possible age of pollen grains…)\nabout TSOP, twelve years ago (in 2003)…\nThe exact subject was the following:\nan agreement of TSOP with Elsevier\nabout an offer (at special price) for\n“the Review of Paleobotany and Palynology” (Elsevier).\nLinks:\nhttp://www.tsop.org/\nhttp://www.journals.elsevier.com/review-of-palaeobotany-and-palynology\n\n","date":"September 14, 2015 at 11:53 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210376","author":"piero","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"Concerning this post on the pollen question namely the misidentification of Gundelia Tournefoetii species versus «Carduus» I invite commenters to re-read the interesting post on this issue on Dr. Stephen Jones’ Blog titled «Did Max frei Misidentify Carduus Argentatus Shroud Pollen as Gundelia Tournefortii?http://theshroudofturin.blogspot.pt/2008/11/did-max-frei-misidentify-carduus.html\nIt’s worth reading it\n                                                                   regards\n                                                           Antero de Frias Moreira\n\n","date":"September 14, 2015 at 2:13 pm","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210387","author":"Antero de Frias Moreira","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"So of course I did. After establishing that the pollen in question is not able to be identified at the species level, and that it better resembles pollen from the genus Carduus than the genus Gundelia, Jones leaps to the quite unwarranted identification of the pollen as from the species Carduus argentatus, which, he says “grows around Jerusalem”, and is more attractive than Gundelia anyway. Actually Carduus argentatus is widespread from Spain to Afghanistan, and the Carduus genus generally consists of nearly 100 species distributed all over Eurasia and Africa. Why Carduus argentatus would be a more attractive funeral decoration than Gundelia tournefortii escapes me. Although its leaves are less spiky than Gundelia, it is still a very awkward plant to handle, and its flower, a single typical purple thistle-flower, is not at all as pretty as Gundelia, a round head of lots of tiny yellow inflorescences.\n\n","date":"September 14, 2015 at 3:40 pm","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210393","author":"Hugh Farey","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"Disculpe, Hugh.\nYo no había leido su interesante artículo “Problems with pollen”.\nCarlos\n\n","date":"September 15, 2015 at 10:44 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210458","author":"Carlos","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":" \nParece que el GÉNERO Helichrysum es el más firme candidato tras los estudios de Marzia Boi sobre el polen de la Sábana Santa y de su hallazgo (2015) con el microscopio electrónico de un grano de polen de Helichrysum, incrustado en la sangre, en el Sudario de Oviedo.\n \nhttp://www.lastampa.it/2015/02/11/esteri/vatican-insider/it/sul-sudario-di-oviedo-lo-stesso-polline-trovato-sulla-sindone-ZCBh6vwTGQYhC1JKRjxjzM/pagina.html \nCarlos\n\n","date":"September 15, 2015 at 6:26 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210437","author":"Carlos","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"There may, of course, be Helichrysum on the Sudarium, but not on the Shroud, especially if neither cloth was originally from Israel. However, the generic similarity between Gundelia, Carduus and Helichrysum pollen serves to cast greater suspicion on a confident  identification of any of them.\n\n","date":"September 15, 2015 at 7:48 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210442","author":"Hugh Farey","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"“There may, of course, be Helichrysum on the Sudarium, but not on the Shroud, especially if neither cloth was originally from Israel.”\n¿Argumentos?\nCarlos\n\n","date":"September 15, 2015 at 9:23 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210446","author":"Carlos","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"Disculpe, Hugh.\nYo no había leido su interesante artículo “Problems with pollen”.\nCarlos\n\n","date":"September 15, 2015 at 10:46 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210460","author":"Carlos","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"The latest information we have is that Professor Avinoam Danin now seems to agree with Professor T. Litt and that should put an end to the discussion about Gundelia tournefortii. Another reason is that Uri Baruch did not examine the grains in the way that he should have done. He did not even wash them before examination.\n\n","date":"September 15, 2015 at 9:30 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210447","author":"Louis","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"But, Louis, this time two years ago you said: “Uri Baruch did not remove the grains from the tape, but examined them in situ. His work was defended by Professor Avinoam Danin, who felt that it was Dr. Thomas Litt who had not examined the grains correctly by cleaning them first.”\n\n","date":"September 15, 2015 at 10:04 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210452","author":"Hugh Farey","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"Correct, Hugh. I was relying on what Professor Danin told me, which was published in an article entitled “Shroud Studies bring Good News”, which had more to do with Dr. Barbara Frale’s finding of the Chinon Parchment and the possible Templar- Turin Shroud connection.\nI do not know what kind of lens Uri Baruch used, but I presume that he had better equipment than Professor Litt because Professor Danin told me that he would have to use better equipment, not the confocal lens he was using. \nWell, from what I can judge, both Uri Baruch and Professor Litt did not wash the grains before examination, however Professor Danin felt that the former’s work was reliable because of the lens he was using.\nFor some reason or the other Professor Danin has changed his mind and that is why I wrote the previous comment.\n\n","date":"September 15, 2015 at 10:45 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210459","author":"Louis","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"Baruch used the microscope that was available at Whanger’s home and had been personally bought by Whanger. Litt had at his disposal the most advanced professional instruments.\n\n","date":"September 15, 2015 at 10:54 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210461","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"Where is this information derived from?\n\n","date":"September 15, 2015 at 11:24 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210462","author":"Louis","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"Louis, it is well known that Baruch worked in the private home of the Whangers, while Litt worked in Bonn where he was a university professor and had a specialized laboratory. Baruch used an Olympus AX-70 microscope. Litt (according to Danin) availed of interference contrast microscopy and confocal laser-scanning microscopy, that is the best one could wish for this type of research. If he needed a more ordinary instrument, no doubt he could obtain one. See for example:\nhttps://www.shroud.com/pdfs/daninx.pdf\nhttp://greatshroudofturinfaq.com/Science/Pollen/Gundelia-tournefortii-questioned.html\n\n","date":"September 15, 2015 at 2:29 pm","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210474","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"Thanks for the information, Gian Marco. Being a palynologist one could presume that Uri Baruch used sophisticated equipment, or at least that was the impression I got from what I heard. I do not know why Professor Danin changed his mind. In the interview below you will read about some confirmation about Max Frei Sulzer’s findings. One must wait to see what will come of this:\n https://www.academia.edu/8841978/Professor_Giulio_Fanti_discusses_the_controversies_in_the_realm_of_Shroud_studies\n\n","date":"September 15, 2015 at 3:14 pm","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-210478","author":"Louis","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"Wouldn’t it be impossible to now obtain new samples of pollen from the shroud since its “restoration” of 2002? Supposedly the vacuumed areas were preserved in small vials? Is that true?\nSSG member\n\n","date":"October 7, 2015 at 7:37 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-211962","author":"J.Wayne Phillips, MD","site":"shroudstory"},{"title":"Doubting the Pollen Evidence","post":"This is actually an old demand, as you can read in the article, published in 2003:\nhttps://www.academia.edu/16338005/Shroud_Studies_bring_Good_News_-_February_2003\nProfessor Avinoam Danin no longer supports what remains of the Frei collection, the remaining part of which is in private hands, unavailable for examination.\nWhat was obtained in 2002 also remains unavailable for research.\n\n","date":"October 7, 2015 at 7:56 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","id":"comment-211965","author":"Louis","site":"shroudstory"}]
