[{"title":"Melissopalynology: Pollen Evidence","post":"The question of the pollens is highly controversial !  But, for me, I have little doubts about the fact that the general conclusions of Max Frei, taken as a whole, are true.  I think there’s a good probability that there is really some pollens on the Shroud that came from the Jerusalem and the Constantinople region (and maybe also the region of Edessa).  Firstly, I say this because some of his findings were later confirmed by other independent experts in pollens.  I know that, recently, critics have been made that because the pollens taken by Frei were stuck in the scotch tapes, any analysis could only be specific about the general species of pollens and not about the subspecies that can really tell the exact location.  But I personally believe that Frei conclusions can be good because there is other clues that indicate quite clearly that the Shroud was once kept in the region of Jerusalem and in the region of Constantinople.  \nIf we take Jerusalem first, there is the fact that some aragonite dusts were found on the heels, the nose and the knees and are similar in composition with the aragonite found in Jerusalem these days is one major clue that the Shroud was once kept in the Jerusalem area (and the man who was put in it walked in that region just before dying).  And I want to say that I’m not aware of the existence of a real and strong scientific critic of this finding which I found strange because, in the Shroud world, it seems like every finding encounter an opposite view or hypothesis.  There is also the finding of the very particular stitching made between the side strip of the Shroud and the main cloth by Machtild Flury-Lemberg.  Because she only found the same type of stitching once on some pieces of cloths coming from the Jewish fortress of Massada (destroyed by the Romans in 74 A.D.), it is another major clue that help to confirm that the Shroud once was kept in Palestine. \nThen, for Constantinople, there is 2 majors clues that exist and help to confirm that the Shroud was once kept in this city.  First, we have the account of Robert de Clari, a French knight of the 4th crusade that talk about the Shroud of the Lord that was exposed every friday in a Church of this city and that bears the image of his body.  Second, we have the Codex of Pray in Hungary that contains some artworks representing Christ entombment and where we could see a representation of the herringbone weave of the Shroud.  We can also see the body of Christ laid in the cloth and who contain some major similarities with the body image of the Shroud, like the position of the body, particularly the hands, the fact that he his nude, etc.  Last but not least, we can see the representation of the series of 4 little holes (call by some the poker holes) that are found on the Shroud.  It is evident that the artist that has made those artworks had seen the real Shroud before.  And, because historians can date this Codex to the years 1192-1195 A.D. and they know that there was a delegation of diplomats from Hungary who came to Constantinople in 1150, there’s some good chances that it was during this visit that the artist saw the Shroud and depict it.  And his artworks would have been included in the Codex of Pray later on. \nIn brief, the fact that the conclusions made by Frei seems to have found confirmations later on, from other fields of science (chemistry and textile for Jerusalem and history, art and exegesis for Constantinople) is enough for me to think it can well be correct.  If some of Frei conclusions would have specified some regions like Quebec (where I live !) or China or even Egypt, it would have been very questionable for me !!!  But no, most of his conclusions talked about Italy, France, Turkey and Palestine and there are facts that exist to confirm (or at least, to highly suggest) that the Shroud spend some time in all of those places !  That’s not unusual… \nOf course, it would be better to get some more confirmations from other independent experts in the field of palynology (new samples taken properly from the Shroud would help a lot) but, because of the arguments I’ve told you, I think there’s some good chances that Frei was correct after all !!!  Only new researches will tell if my feeling is right or wrong on this topic.  But, if the Shroud is genuine like I believe he is, I don’t see any good reason to reject the possibility that pollens from Jerusalem and Constantinople were found on the cloth…\nYannick \n\n","date":"August 17, 2011 at 10:43 am","url":"https://shroudstory.com/2011/08/16/melissopalynology-pollen-evidence/","cat":"news_&_views","id":"comment-3620","author":"Yannick Clément","site":"shroudstory"}]
