[{"title":"Numerous Plant Species and Human Lineages Identified. Now What?","post":"The value of this paper is not in its conclusions, which are so catholic as to admit of almost any place or time from which the Shroud may have originated, but in the fact that DNA analysis of very small particles is now possible and has been carried out. Fairly arbitrary scoopings of dust mean that these findings are painted with a pretty broad brush, but the concept is precise and a useful analytical tool. Incidentally, for the scientists among our readers, I thoroughly recommend downloading the ‘Supplementary Material’ which can be found after the Acknowledgements, which adds a good deal more information.\nOf the pollen, of course, only two or three of the two dozen or so species listed in this paper coincide with anything discovered by previous palynologists. Where is the Gundelia which made up a third of the previous assemblages? Where the “continuous carpet” of Matricaria or Anthemis of Avinoam Danin? Where the Carduus, the Helicrysum, or Scheuermann’s Chrysanthemum? I do not know how accurate the DNA analysis might be, but for such a small quantity of known plant material found on the Shroud itself to end up in the hooverings implies that all the rest of it is exogenous.\n\n","date":"October 21, 2015 at 4:22 pm","url":"https://shroudstory.com/2015/10/21/numerous-plant-species-and-human-lineages-identified-now-what/","cat":"news_&_views","id":"comment-213281","author":"Hugh Farey","site":"shroudstory"},{"title":"Numerous Plant Species and Human Lineages Identified. Now What?","post":"It has only been in the last few years that the Shroud/cloth has been in a protected status behind glass and strict handling rules.  Before that time it has been open to anything in the air, on the surface of where it may have been lain, unknown number of hands  that were moving, opening or folding closed – in other words, about 2,000 years of unsanitary conditions. A bad example would be if an astronaut who had done a moon walk brought back and uncleansed space suit and opened it up around the shroud, it is possible that a very small amount of real moon dust could be found on the Shroud.\n\n","date":"October 21, 2015 at 5:21 pm","url":"https://shroudstory.com/2015/10/21/numerous-plant-species-and-human-lineages-identified-now-what/","cat":"news_&_views","id":"comment-213284","author":"Emmett McMahon","site":"shroudstory"},{"title":"Numerous Plant Species and Human Lineages Identified. Now What?","post":"Well…\nApparently, until now, it has not been found\nthe DNA of the American Indians or\nthe DNA of Aboriginal Australians ….\nHowever (putting aside the jokes) a\nscientific study should take into\naccount what we can say with the\nCalculus of Probability.\nThen there is another thing to consider:\nthere is not yet a careful comparison with the\nDNA found on another famous relic:\nthe Sudarium of Oviedo.\n— —\nHowever, as I have already had occasion\nto emphasize in a previous message,\na “marginal difference of DNA” (ie: not for\nthe DNA of the Person who was in contact with\nthe ancient lignocellulosic materials) does not\nimply anything about the authenticity of the two relics!\nAnd, before to finish with the “complex topic DNA”,\nI still have doubts about the possibility to assign\na “rough date” (even with an approximate dating)\nfor the DNA of the people involved in the release\nof “genetic traces” and extraneous to that dead Man.\nThis “dating of DNA” would help us to solve\nthe problem regarding the contamination\nwith foreign DNA, that is:\nwhether it is a kind of ancient or modern contamination…\n\n","date":"October 22, 2015 at 9:07 am","url":"https://shroudstory.com/2015/10/21/numerous-plant-species-and-human-lineages-identified-now-what/","cat":"news_&_views","id":"comment-213349","author":"piero","site":"shroudstory"}]
