[{"title":"Paper Chase:  New Paper on SEM Analysis of Pollen","post":"The Shroud has been carrying it’s own travel diary for all to read.  It shows from day 1 on forward into time.\n\n","date":"November 5, 2015 at 4:52 am","url":"https://shroudstory.com/2015/11/05/paper-chase-new-paper-on-sem-analysis-of-pollen/","cat":"paper_chase","id":"comment-214244","author":"ekmcmahon","site":"shroudstory"},{"title":"Paper Chase:  New Paper on SEM Analysis of Pollen","post":"I look forward to Hugh’s reply to this one. So far as I can see of the seven pollen species they picked out, their own table 3 shows that every one  except the single Balanites aegiptica has a range that may include the Near East but also includes France and Spain. Therefore it would appear deeply misleading to say in their abstract that this is an indicative of. Palestinian origin of the Shroud. It could equally be indicative of an French Italian origin!\nThey argue that the two pollen samples of the myosotis ramasissoma are of European origin and so must have been placed on later! Why are these not original, making six of the seven pollens possibly all European? I stand to be corrected but this seems a case of having decided what you want your conclusion to be and fitting the evidence to it!i\nAs always I am interested in mentions of calcium carbonate as this is to be found in tHe gesso sealing a cloth before it is painted. Good to see it coming up again!\n\n","date":"November 5, 2015 at 12:31 pm","url":"https://shroudstory.com/2015/11/05/paper-chase-new-paper-on-sem-analysis-of-pollen/","cat":"paper_chase","id":"comment-214254","author":"Charles Freeman","site":"shroudstory"},{"title":"Paper Chase:  New Paper on SEM Analysis of Pollen","post":"P.S. And there is also the assumption that the Shroud was made, pollen dropped on the surface of the linen before it was moved anywhere and this pollen never dropped off. Unlikely, unless it was stored, say in an Egyptian tomb, until rediscovered. In fact the many unfoldings of the Shroud in the open air, well over fifty in the seventeenth century alone, make the pollen evidence very difficult to assess, especially when we may well have had visiting pilgrims not only laying their painted cloths on it ( as has been put forward as a reason, if an unlikely one – again why did these pigments never algal off again – for the existence of the pigments) but placing flowers as well.\n\n","date":"November 5, 2015 at 1:14 pm","url":"https://shroudstory.com/2015/11/05/paper-chase-new-paper-on-sem-analysis-of-pollen/","cat":"paper_chase","id":"comment-214257","author":"Charles Freeman","site":"shroudstory"},{"title":"Paper Chase:  New Paper on SEM Analysis of Pollen","post":"I don’t know what to say that hasn’t been said before, really. Not one of Lucotte’s plants appear on anybody else’s list, in spite of whole carpets of flowers apparently being found strewn around the Shroud. Max Frei’s identifications were suspect because his identifications were based almost exclusively on a collection of plants from the Middle East. I note with suspicion that Lucotte’s identifications are based on “the Rossignol palynothèque, specially devoted to Near East pollens” and that “Palestinian pollen grains produced by trees and tree-like shrubs are described by Horowitz & Baum.” A more balanced study would not have assumed that the pollen was Middle Eastern from the start. I suggest that had Lucotte or Frei consulted a Palynology of Japan or Brazil, they would have identified very different species and demonstrated a Far Eastern or South American provenance for the Shroud.\n\n","date":"November 5, 2015 at 2:24 pm","url":"https://shroudstory.com/2015/11/05/paper-chase-new-paper-on-sem-analysis-of-pollen/","cat":"paper_chase","id":"comment-214262","author":"Hugh Farey","site":"shroudstory"},{"title":"Paper Chase:  New Paper on SEM Analysis of Pollen","post":"And Lucette even admits that some recent ‘ European’ pollen they found in their sample may have been due to contamination in the aspirator that sucked up the dust!\nHow did they know what was contamination?\n\n","date":"November 5, 2015 at 4:20 pm","url":"https://shroudstory.com/2015/11/05/paper-chase-new-paper-on-sem-analysis-of-pollen/","cat":"paper_chase","id":"comment-214267","author":"Charles Freeman","site":"shroudstory"},{"title":"Paper Chase:  New Paper on SEM Analysis of Pollen","post":"No doubt there will come a time when it will be feasible to radiocarbon date pollen grains.  Perhaps we should suspend judgment until then.\n\n","date":"November 5, 2015 at 2:17 pm","url":"https://shroudstory.com/2015/11/05/paper-chase-new-paper-on-sem-analysis-of-pollen/","cat":"paper_chase","id":"comment-214261","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase:  New Paper on SEM Analysis of Pollen","post":"According to Mr. Rucker’s hypothesis Carbon Dating of Shroud wonn’t give you a proper date but as Daveb says radiocarbon dating of pollen from Middle East may give an approximate date for the Shroud as it came to the Shroud after the any suspecting radiation.\nToday DNA results are using to convict many suspects. Also now we know that according to DNA analysis we can suspect that the linen cloth came from India and used it in some where in Middle East.\n\n","date":"November 5, 2015 at 4:29 pm","url":"https://shroudstory.com/2015/11/05/paper-chase-new-paper-on-sem-analysis-of-pollen/","cat":"paper_chase","id":"comment-214268","author":"Sampath Fernando","site":"shroudstory"},{"title":"Paper Chase:  New Paper on SEM Analysis of Pollen","post":"Totally agree, Daveb. This sort of study is meaningless unless one can construct a chronology showing when and how the pollen was added. Quite why pollen and, earlier, DNA, on surface material can show the origin of the actual WEAVING, I don’t know. Has anyone actually looked at Indian weaves- the wonderful exhibition of Indian fabrics now on in London at the Victorian and Albert showed that they tended, like most weaves of the ancient world, to be simple ones.\nThe Shroud has been exposed so many times across France and Northern Italy. As I understand it, the hoovered DNA material comes from as far back as 1978 and who knows who may have handled it since then.\nI am not a scientist but I assume that no one could possibly peer review this kind of shambolic work and yet it gets passed around on the internet without critical comment.\n\n","date":"November 5, 2015 at 2:47 pm","url":"https://shroudstory.com/2015/11/05/paper-chase-new-paper-on-sem-analysis-of-pollen/","cat":"paper_chase","id":"comment-214264","author":"Charles Freeman","site":"shroudstory"},{"title":"Paper Chase:  New Paper on SEM Analysis of Pollen","post":"Mr. Freeman please don’t underestimate the Indian weavers. They had technology to do many things before Jesus was born. Have you been to Elora Caves? If you visit those caves you will realise that India had high technology to construct many complex things.\n\n","date":"November 5, 2015 at 4:41 pm","url":"https://shroudstory.com/2015/11/05/paper-chase-new-paper-on-sem-analysis-of-pollen/","cat":"paper_chase","id":"comment-214269","author":"Sampath Fernando","site":"shroudstory"},{"title":"Paper Chase:  New Paper on SEM Analysis of Pollen","post":"No, I don’t underestimate the Indian weavers. If you are in London come and see the wonderful Indian Fabric exhibition at the V and A. With the DNA not datable and there being no clear reason why the DNA found on the Shroud should suggest that it was actually WOVEN in India, there is no need to suggest an Indian origin unless some kind of other evidence relating, say, to the pattern and dimensions of the weave is found. No one has yet come up with any.\nThe DNA and pollen is surface material on a cloth that has been exhibited very often in the open air and specially laid out over the centuries for observers to look at. The Savoys used to kiss the wounds before it went on display. Apparently other cloths were laid on it.  Rosaries were thrown at it when it was on display. There are stories that during the 1978 examination, things floated down form the ceiling onto it. Lucette raises the possibility of  contamination of the samples. We simply cannot trace the actual weave to anything found on the surface unless, presumably, they are flax fibres which match the original.\n\n","date":"November 6, 2015 at 3:00 am","url":"https://shroudstory.com/2015/11/05/paper-chase-new-paper-on-sem-analysis-of-pollen/","cat":"paper_chase","id":"comment-214283","author":"Charles Freeman","site":"shroudstory"},{"title":"Paper Chase:  New Paper on SEM Analysis of Pollen","post":"Professor A. Danin’s papers appear in Gérard Lucotte’s references, however it does not mean anything today because the professor changed his mind about Max Frei’s collection recently, athough he stands by the flower and plant images he said he identified on the Shroud.\nIn 2003 he wanted Turin to allow the taking of fresh samples from the relic, but apparently his request fell on deaf ears. See the last paragraph:\nhttps://www.academia.edu/16338005/Shroud_Studies_bring_Good_News_-_February_2003\n\n","date":"November 5, 2015 at 3:38 pm","url":"https://shroudstory.com/2015/11/05/paper-chase-new-paper-on-sem-analysis-of-pollen/","cat":"paper_chase","id":"comment-214266","author":"Louis","site":"shroudstory"},{"title":"Paper Chase:  New Paper on SEM Analysis of Pollen","post":"“Scientifc Research” is NOT a peer-reviewed journal and does NOT belong to the JCR system. These results published here and in their current form would never be accepted by any serious institution.\n\n","date":"November 6, 2015 at 4:50 am","url":"https://shroudstory.com/2015/11/05/paper-chase-new-paper-on-sem-analysis-of-pollen/","cat":"paper_chase","id":"comment-214285","author":"Gabriel","site":"shroudstory"},{"title":"Paper Chase:  New Paper on SEM Analysis of Pollen","post":"I had my doubts about peer review because I saw that at times what was published in a peer-reviewed journal was dismissed later on by a paper in a similar journal. So one can imagine what happens when there is no peer review. Dr. Paolo Di Lazzaro explained the whole process in detail in the response to question no.9:\n https://www.academia.edu/11355553/Dr._Paolo_Di_Lazzaro_explains_his_research_on_image_formation_on_the_Shroud_of_Turin\n\n","date":"November 6, 2015 at 6:40 am","url":"https://shroudstory.com/2015/11/05/paper-chase-new-paper-on-sem-analysis-of-pollen/","cat":"paper_chase","id":"comment-214287","author":"Louis","site":"shroudstory"},{"title":"Paper Chase:  New Paper on SEM Analysis of Pollen","post":"One must add that the pollen grains require more examination. Professor Giulio Fanti, at the University of Padua, whose work on the DNA found its way into the recent paper published in “Nature” said that the pollen fragments from the Shroud examined by him matched the results obtained by Max Frei Sulzer:\n https://www.academia.edu/8841978/Professor_Giulio_Fanti_discusses_the_controversies_in_the_realm_of_Shroud_studies\n\n","date":"November 6, 2015 at 12:09 pm","url":"https://shroudstory.com/2015/11/05/paper-chase-new-paper-on-sem-analysis-of-pollen/","cat":"paper_chase","id":"comment-214301","author":"Louis","site":"shroudstory"},{"title":"Paper Chase:  New Paper on SEM Analysis of Pollen","post":"Where did Giulio Fanti say any such thing? His report on his DNA analysis lists Robinia, Picea, Trifolium, Lolium, Plantago, Pyrus, Prunus, Cichorium, Humulus, Cucumis, Vitis, Carpinus, Juglans and Salix, 14 genera of which one single example (Carpinus) is also found on Max Frei’s list. Fanti knows very well that no subsequent pollen analysis, by DNA or SEM or even just looking again at through a microscope, has done anything at all to verify Max Frei’s speculations, so I am surprised that he has claimed that he has “matched the results obtained by Max Frei Sulzer.” The reference you give says nothing about pollen or Max Frei.\n\n","date":"November 6, 2015 at 3:35 pm","url":"https://shroudstory.com/2015/11/05/paper-chase-new-paper-on-sem-analysis-of-pollen/","cat":"paper_chase","id":"comment-214319","author":"Hugh Farey","site":"shroudstory"},{"title":"Paper Chase:  New Paper on SEM Analysis of Pollen","post":"Have you read the response to the question about pollen grains in the link provided above? It mentions them as well as Max Frei Sulzer. It must be remembered that Professor Fanti was working on pollen dust and fragments, not on grains that were found intact. Some of his results did match the ones obtained by the Swiss criminologist. Yet, his study remains incomplete and is the reason for my previous comment.\nIt would help if what remains of Frei Sulzer’s collection in Durham, NC is made available for examination.\n\n","date":"November 6, 2015 at 4:04 pm","url":"https://shroudstory.com/2015/11/05/paper-chase-new-paper-on-sem-analysis-of-pollen/","cat":"paper_chase","id":"comment-214323","author":"Louis","site":"shroudstory"},{"title":"Paper Chase:  New Paper on SEM Analysis of Pollen","post":"For some reason or the other, Professor Danin no longer considers what he wrote about the pollens valid. Well, who did the examination was Uri Baruch, but then he left the field of palynology to go into computer sciences. Professor Danin does however maintain that he has identified flower and thorn images on the Shroud.\nHe was wanting Turin to provide more grains, and that was back in 2003. See the last paragraph:\n     https://www.academia.edu/16338005/Shroud_Studies_bring_Good_News_-_February_2003\n\n","date":"November 6, 2015 at 4:12 pm","url":"https://shroudstory.com/2015/11/05/paper-chase-new-paper-on-sem-analysis-of-pollen/","cat":"paper_chase","id":"comment-214326","author":"Louis","site":"shroudstory"},{"title":"Paper Chase:  New Paper on SEM Analysis of Pollen","post":"I do apologise, Louis. For some reason my ‘search’ function did not pick up the second mention of pollen in your paper, which does indeed have Fanti saying that “the fragments of pollen grains on the relic detected by me [Fanti] match the results published by him [Frei].” However, in his book “Il Mistero della Sindone” Fanti gives a list of 24 species of plant, of which, as above, only one matches anything on Frei’s list. Prunus, it is true, appears on both lists, but Max gives Prunus arabica, while Fanti gives Prunus salicina. How these two lists can be described as matching beats me completely.\n\n","date":"November 6, 2015 at 5:14 pm","url":"https://shroudstory.com/2015/11/05/paper-chase-new-paper-on-sem-analysis-of-pollen/","cat":"paper_chase","id":"comment-214327","author":"Hugh Farey","site":"shroudstory"},{"title":"Paper Chase:  New Paper on SEM Analysis of Pollen","post":"There is nothing to apologise for, Hugh. You are right about the confusion that can be caused when things are stated differently in two different publications. I even pointed out to Professor Fanti that what he stated in “La Sindone: Primo secolo dopo Christo!” was partially changed in a paper he authored later.\nI think he faces the same problem all Shroud scientists face: no access to the relic, even for a non-invasive examination. So they have to work on the data they have.\nRegarding that podcast with Dr. Alan Whanger, did you ask him about the pollen grains in his collection?\n\n","date":"November 6, 2015 at 5:34 pm","url":"https://shroudstory.com/2015/11/05/paper-chase-new-paper-on-sem-analysis-of-pollen/","cat":"paper_chase","id":"comment-214329","author":"Louis","site":"shroudstory"},{"title":"Paper Chase:  New Paper on SEM Analysis of Pollen","post":"Alas, no. We did discuss the pollen, but I didn’t appreciate, as perhaps I should have done, that Alan actually had possession of Frei’s collections. As it was, Alan got so bogged down in the piles of detritus he can now see covering the body, from flowers to nails, chains, various pieces of notices and even two crowns of thorns, that I think he began to lose credibility. I suspect that is why Avinoam Danin has become so much more circumspect recently.\n\n","date":"November 6, 2015 at 6:32 pm","url":"https://shroudstory.com/2015/11/05/paper-chase-new-paper-on-sem-analysis-of-pollen/","cat":"paper_chase","id":"comment-214331","author":"Hugh Farey","site":"shroudstory"},{"title":"Paper Chase:  New Paper on SEM Analysis of Pollen","post":"Dr. Alan sent me his book — which even Mother Teresa appreciated — and I read and reviewed it, but it is not online. The information obtained from the newsletters he sent also helped. All this was years ago.\nIan Wilson took exception to many of the things that Dr. Alan said he identified on the Shroud and published his views in the BSTS newsletters. It seems that that was the beginning of the controversy. Professor Danin also kindly provided me with all the information I needed, however I think the Church has not appreciated his efforts sufficiently, which is what I judged after reading his book “Botany of the Shroud”, which has beautiful illustrations. As a botanist Prof. Danin is certain that he does see images of flowers and thorns on the Shroud, in fact he showed some of what he saw to Cardinal Severino Poletto during the special showing of the relic at the end of the Round Table held in Turin. As I said, the palynologist was Uri Baruch, who left the field.\nI think we have to start from scratch, and will depend on Turin to provide new grains and an examination of what is left of Max Frei Sulzer’s collection in the possession of Dr. Whanger.\n\n","date":"November 6, 2015 at 7:03 pm","url":"https://shroudstory.com/2015/11/05/paper-chase-new-paper-on-sem-analysis-of-pollen/","cat":"paper_chase","id":"comment-214332","author":"Louis","site":"shroudstory"},{"title":"Paper Chase:  New Paper on SEM Analysis of Pollen","post":"It is important  to stress again and again in just how many contexts the Shroud has been exposed and exhibited since Lirey.  All kinds of things would have drifted on, been placed on,etc, over the centuries. There does seem to be an assumption thatn whatever is found on the surface was there from day one whenever that may have been and somehow stayed on all that time and the subsequent additions can be ignored.\n\n","date":"November 7, 2015 at 2:25 am","url":"https://shroudstory.com/2015/11/05/paper-chase-new-paper-on-sem-analysis-of-pollen/","cat":"paper_chase","id":"comment-214337","author":"Charles Freeman","site":"shroudstory"},{"title":"Paper Chase:  New Paper on SEM Analysis of Pollen","post":"P.S. Accounts of 1418 say that Margaret de Charny exhibited the Shroud each Easter Sunday in a meadow on the banks of the River Doubs.  Lots of pollen may have drifted on at this time of year, as also in early May, the normal date on which the Shroud was exhibited.\n John Heller, Report on the Shroud of Turin,p. 115. Having told of the lady who brought roses to be placed by the Shroud,one of which touched it and was then passed back to her,  Heller goes on: ‘Not only this woman but all the clerics and Turinese university personnel who came into contact with the Shroud invested with special meaning the act of touching it with some object- with a handkerchief, a card, or some postage stamps. It was as though they felt that something mystical might be transferred from the cloth to the touched object. Or perhaps it was merely a souvenir.  I would discover later that this was more the rule than the exception’.\nTouching or kissing a relic  and placing objects on it to absorb the spiritual energy ( such touched objects were known as brandea) was such a normal part of medieval life and continued after the Reformation so attempts to link what has been found on the Shroud with the moment of its creation are fruitless unless the surface material is dated or related directly to the original flax.\n\n","date":"November 7, 2015 at 4:47 am","url":"https://shroudstory.com/2015/11/05/paper-chase-new-paper-on-sem-analysis-of-pollen/","cat":"paper_chase","id":"comment-214340","author":"Charles Freeman","site":"shroudstory"}]
