[{"id":"comment-196733","author":"wholt4@hotmail_com","post":"There should be no controversy about the shroud whatsoever. All one needs to do to understand that the shroud could not be the burial cloth of Jesus is read the Bible, specifically the Gospel of John, to see that the burial clothes of Jesus are recorded, quite clearly, by one of those that witnessed it personally, John. Jhn 19:39 He was accompanied by Nicodemus, the man who earlier had visited Jesus at night. Nicodemus brought a mixture of myrrh and aloes, about seventy five pounds Jhn 19:40 Taking Jesus’ body, the two of them wrapped it, with the spices, in strips of linen. This was in accordance with Jewish burial customs. STRIPS of linen were used, not one continuous cloth, and the strips were cemented with 75 pounds of spices, does any of that sound even remotely similar to the shroud? Jhn 20:6 Then Simon Peter came along behind him and went straight into the tomb. He saw the strips of linen lying there, Jhn 20:7 as well as the cloth that had been wrapped around Jesus’ head. The cloth was still lying in its place, separate from the linen. These verses describe the fact that Jesus had a separate cloth wrapped around his head, again, not one complete sheet. Does not even the Pope read the Bible?.","date":"2015-04-18","mins":"2:15 pm","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-196845","author":"wholt4@hotmail_com","post":"Which is why you must be indwelt by the Holy Spirit of God to understand the meaning. Without the mind of Christ, one can do no better that to lean on his own understanding. Isa 6:9 He said, “Go and tell this people: “ ‘Be ever hearing, but never understanding; be ever seeing, but never perceiving.’ Isa 11:2 The Spirit of the LORD will rest on him— the Spirit of wisdom and of understanding, the Spirit of counsel and of might, the Spirit of the knowledge and fear of the LORD— Pro 3:5 Trust in the LORD with all your heart and lean not on your own understanding; Mat 13:14 In them is fulfilled the prophecy of Isaiah: “ ‘You will be ever hearing but never understanding; you will be ever seeing but never perceiving. 1 Co 2:14 The person without the Spirit does not accept the things that come from the Spirit of God but considers them foolishness, and cannot understand them because they are discerned only through the Spirit. 1 Co 3:19 For the wisdom of this world is foolishness in God’s sight. As it is written: “He catches the wise in their craftiness” [ 1 Co 2:16 for, “Who has known the mind of the Lord so as to instruct him?” But we have the mind of Christ..","date":"2015-04-19","mins":"1:07 pm","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"}]
