[{"id":"comment-208696","author":"dcn_andy","post":"Thanks Dan. This will be fascinating to read. I enjoy his work..","date":"2015-08-21","mins":"1:47 pm","url":"https://shroudstory.com/2015/08/10/a-superbly-detailed-exploration-of-the-image-of-edessa/","cat":"history","title":"A superbly detailed exploration of the Image of Edessa"},{"id":"comment-200528","author":"dcn_andy","post":"I agree Nabber. Just because there is a lack of evidence in no way proves anything except there is no evidence of which we are aware. It is reasonable in light of no evidence to not make unsupported claims, but there is equally no problem putting forth the idea as one possibility. One from either side cannot claim the other to be erroneous since there is no evidence to support or refute either idea..","date":"2015-05-29","mins":"10:37 am","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","title":"Challenging the Othon de la Roche Story"},{"id":"comment-200527","author":"dcn_andy","post":"I wonder if Mario would make this wonderful and interesting book available in English? Since I cannot read French, this would be inaccessible to me. I think it is important..","date":"2015-05-29","mins":"10:32 am","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","title":"Challenging the Othon de la Roche Story"},{"id":"comment-200529","author":"dcn_andy","post":"Google Translate of the back cover of the book: The Shroud of Besancon was very popular for nearly three centuries, attracting large crowds in his early ostensions the 16th century. Its popularity is so great that in 1705 King Louis XIV ordered the suspension of ostensions to prevent the German soldiers took the city by hiding among the tens of thousands of foreign pilgrims. The Shroud of Besançon in 1794 disappeared during the French Revolution, but there are still many ancient manuscripts and publications describing. 826 The manuscript of the 18th century Besançon’s library archive is composed of two separate essays pursuing diametrically opposite goals, the first arguing for the authenticity of the Shroud of Besançon and the second to the contrary. This book presents an original transcript of the first essay and a modernized version of the second essay published in 1831, with comments. The authors of these essays comparing the Shroud of Besancon with the Shroud of Turin, sometimes to determine which would be genuine. The reader can judge the relevance of these comparisons and better discover these two Shrouds. He also discover modern elements of the second essay and particularly an authentic shroud is more credible if it produces a three dimensional image, a very pertinent remark by modern scientific developments on the Shroud of Turin. What is the origin of the Shroud of Besancon? Was he as popular as the Shroud of Turin? Does the history of the Shroud was combined with that of the Shroud of Turin? The knight Othon de la Roche is it really the origin of the Shroud of Besançon or perhaps is it rather the cause of one in Turin? These are some fascinating questions addressed in this book. The author is a researcher in computer science and bioinformatics research center in Silicon Valley. He has a Ph D in computer science and mathematics from the University of Montreal and has published numerous scientific articles in computer science, bioinformatics and applied mathematics. He is also the editor of the website sindonology.org on the Shroud of Turin. He is the proud father of two lovely girls..","date":"2015-05-29","mins":"10:41 am","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","title":"Challenging the Othon de la Roche Story"},{"id":"comment-207516","author":"dcn_andy","post":"I would say Dreisbach & Fulbright are far more qualified on this issue than is Berry. Yep, that’s my opinion. Sorry Colin, I just find some of your statements to be beyond the pale of reasonable..","date":"2015-08-05","mins":"7:29 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","title":"When is a Sindon Not a Sindon?"},{"id":"comment-208691","author":"dcn_andy","post":"Interesting. Of course no one in the Church has ever accepted the apocryphal writings as history or necessarily historical. To use them to determine historical fact apart from the authority of the Church would be misguided, in my opinion..","date":"2015-08-21","mins":"1:03 pm","url":"https://shroudstory.com/2015/08/19/who-is-addai/","cat":"history","title":"Who is Addai?"}]
