[{"id":"comment-209795","author":"tristan_casabianca","post":"So, Marco, when you wrote your paper, you never studied Rogers’ writings in A chemist’s Perspective, because, according to you, your editorial was focused on Rogers’ article in TA and therefore Rogers’ book was “irrelevant”? I’m not sure this argument based on a serious lack of research is good for your case..","date":"2015-09-07","mins":"1:01 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209601","author":"tristan_casabianca","post":"I’m not a chemist, so, at first glance, I’m being disturbed by some of their references: they don’t mention Benford and Marino’s article on discrepancies in the radiocarbon dating area published in Chemistry Today, but they quote their first papers already mentioned by Rogers in 2005? Why (real question, no irony)? Is it because Quad mosaic analysis doesn’t fit well with their sentence:”Among those [theories], a popular one is the so called “invisible mending”, disclosed by S. Benford and J. Marino and based on the analysis of low resolution (JPEG format) pictures of the Shroud”? They don’t want to engage with other confirmations (Villarreal), they don’t want to mention other results (Riani’s article in Statistics and Computing). By the way, I hope that this editorial was not reviewed by a historian… Look at the “medieval” title, and look at this sentence: “According to these authors [Benford and Marino], the part of the Shroud from where a C14 sample was obtained does not belong to the main linen, but is a Middle Age addition which precisely matches the kind of weaving, and moreover has been painted to exactly match the color of the main Shroud. ” But of course Benford and Marino, in the same paper quoted by Bella et alii, deal explicitely with the art of tapestry in the Renaissance. They knew the difference between the Middle Ages and the Renaissance… It’s not so difficult to grasp ;) So, why was “medieval” added in the title, when it’s not even in the quotation given above (just “invisible mending”)?.","date":"2015-09-04","mins":"2:09 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209612","author":"tristan_casabianca","post":"Just to be sure, Marco, even after reading Rogers’ book pp. 53 54 (google books is your friend), do you still maintain that you are correct? Because I tend to think that Thibault is right. It seems to me that your medieval blunder is maybe not the only one….","date":"2015-09-04","mins":"4:54 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209832","author":"tristan_casabianca","post":"Marco, I don’t want be too harsh, but before writing on a topic, even for an “editorial”, you have to be at least familiar with it. Otherwise it looks much more like a lampoon than an editorial. Your “medieval” blunder is horrific and demonstrates that you don’t know the topic in and out, to say the least. Your misintepretation of the data in a paragraph was easily detected within a couple of minutes by Thibault. Why? Because he knows the topic in and out. I guess that before this week you never opened Rogers’ book… This not how serious science works: You should have been more familiar with the bibliography. It’s the beginning of all serious research, or all good editorial in a peer review. Mi dispiace..","date":"2015-09-07","mins":"12:51 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209644","author":"tristan_casabianca","post":"Sorry Hugh, i’m not convinced so far (quite the contrary). I think the first diagram does not come from blood area. Rogers is 100% clear in his book. Rogers, Achemist’s perspective, p. 54: “Figure VIII 3 [figure 4 in Thermochimica acta] shows a mass spectrum that was taken when the first decomposition products started to appear over a sample image fibers. The sample appears to be nearly pure polyhexose material, e.g. Cellose. There is a significant peak at m/e 126 (hydroxyméthylfurfural) but there is not much at m/e 96 (furfural). The shroud is nearly pure linen, but linen is not pure celluose like cotton”. The legend of diagram: “Mass spectrum obtained by from the pyrolisis of sugars from Shroud image sample 1 EB. The sample didi not contain any pentose sugars”. As already stated by Thibault, Rogers explicitly writes that sample 1 EB comes from a image area, with no blood, no schorch, no water (p. 53). Https://books.google.fr/books?isbn=0615239285.","date":"2015-09-05","mins":"5:29 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-210345","author":"tristan_casabianca","post":"According to Bella, “Of course, no one was able to criticize the key findings of [their] work” on this blog!!! His definition of “pseudoscience” shows clearly that, unfortunately, you don’t need to understand philosophy of science to become a chemist..","date":"2015-09-14","mins":"4:44 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","title":"The Chemist Rogers and Plastic Bags"}]
