[{"id":"comment-39336","author":"tristan_casabianca","post":"I think we have a lot of good reasons for associating something supernatural with the shroud.The result is really clear when you apply the classical criteria of historical assessment. Http://onlinelibrary.wiley.com/doi/10.1111/heyj.12014/abstract.","date":"2013-07-20","mins":"11:25 am","url":"https://shroudstory.com/2013/07/20/any-good-reasons-for-associating-anything-supernatural-with-the-shroud/","cat":"image_theory","title":"Any good reasons for associating anything supernatural with the shroud?"},{"id":"comment-91475","author":"tristan_casabianca","post":"Daveb, I have never said that the Resurrection hypothesis was “a fact”, only the most likely… it’s quite different If you have not read it, I cansend you my article published last year (The Shroud of Turin: A historiographical approach”)..","date":"2014-03-21","mins":"4:06 am","url":"https://shroudstory.com/2014/03/20/comment-promoted-another-hypothesis-about-the-image-formation/","cat":"image_theory","title":"Comment Promoted:  Another hypothesis about the image formation"},{"id":"comment-91324","author":"tristan_casabianca","post":"Hugh, i think that the main interest of this short peer reviewed communication is to show us, once again, how unlikely the “natural” hypothesis is. You need a set of circumstances that is fantastically low. And a side interest of the paper : new forensic experts who say there was a corpse (not a giant bas relief made by an unknown genius…) in the shroud..","date":"2014-03-20","mins":"6:44 pm","url":"https://shroudstory.com/2014/03/20/comment-promoted-another-hypothesis-about-the-image-formation/","cat":"image_theory","title":"Comment Promoted:  Another hypothesis about the image formation"},{"id":"comment-91446","author":"tristan_casabianca","post":"Oh I do think the natural hypothesis is totally unconvincing/unlikely: its plausibility (does our knowledge in other fields support or reinforce the hypothesis?) is clearly insufficient : the image on the shroud is unique. The natural hypothesis relies on unverified and complicated data (with the corona hypothesis, you need an earthquake at the right time and place). If the man on the shroud is Jesus, the Natural hypothesis cannot explain historical facts widely accepted by New Testament scholars: the empty tomb, the early paulinian creed (1 Co 15, 3 7) which appeared in the first decade after the crucifixion..","date":"2014-03-21","mins":"2:29 am","url":"https://shroudstory.com/2014/03/20/comment-promoted-another-hypothesis-about-the-image-formation/","cat":"image_theory","title":"Comment Promoted:  Another hypothesis about the image formation"}]
