[{"id":"comment-214352","author":"tristan_casabianca","post":"I agree. “Extraordinary” claims do not require “extraordinary” evidence. It’s not the way it works. Cf. My article here that also deals with bayesian probability: The Shroud of Turin, The Resurrection of Jesus and the Realm of Science: One View of the Cathedral. Http://www.academia.edu/8531212/The Shroud of Turin the Resurrection of Jesus and the Realm of Science One View of the Cathedral.","date":"2015-11-07","mins":"9:43 am","url":"https://shroudstory.com/2015/11/07/a-guest-posting-by-o-k/","cat":"guest_posting","title":"A Guest Posting by O.K."},{"id":"comment-65126","author":"tristan_casabianca","post":"Kelly, your point 3 refers to what theologians and philosophers call “the argument from experience”. If it is a powerful argument for yourself (unless and until you have a good reason for thinking you are deluded), it is not an argument based on a logical reasoning, it is not an argument that can convince even an unbeliever. And muslims or hindus can describe the same kind of fruitful transformations. Look at an argument from history. If we use traditional criteria of historical assessment, we can be pretty sure that the Turin shroud is the burial cloth of Jesus of Nazareth. But much more that that, the probability that the image is the consequence of the bodily resurrection of Jesus of Nazareth is very high. An extract of the conclusion of my article published this year in the Heythrop Journal: “As judged by our current knowledge, [the Resurrection Hypothesis] is the most likely of the three hypotheses that have come under scrutiny [Garlaschelli Hypothesis and Natural Hypothesis]. Its level of plausibility is high, which is not the case for the other two hypotheses. Its explanatory scope does not constitute a major obstacle, although its explanatory power could be improved. It is less ad hoc than its rivals and offers the possibility of a substantive illumination on related fields of research. This does not mean, however, that the RH is proven to be historical; it is simply the most likely hypothesis when we adopt a Minimal Facts approach to test for the best explanation.” http://onlinelibrary.wiley.com/doi/10.1111/heyj.12014/abstract.","date":"2013-12-22","mins":"3:34 pm","url":"https://shroudstory.com/2013/12/22/building-a-house-on-argumentum-ad-ignorantiam/","cat":"comments_promoted","title":"Building A House on .Argumentum ad Ignorantiam"},{"id":"comment-201310","author":"tristan_casabianca","post":"Bonjour Yannick ! I think that your “semi natural hypothesis”, semi because it leaves the door open for Jesus’ resurrection, is interesting but contrived. It is strongly ad hoc (“who knows if”…). Moreover, one possibility offered by your semi natural hypothesis (“manual extraction”) doesn’t take into account an uncontroversial fact: the empty tomb. Best, Tristan..","date":"2015-06-08","mins":"6:19 am","url":"https://shroudstory.com/2015/06/08/guest-posting-by-yannick-clment/","cat":"guest_posting","title":"Guest Posting by Yannick Clément"}]
