[{"id":"comment-115185","author":"tristan_casabianca","post":"Dan, it’s not new at all, the study (at least its first part) has been published online in 2013 and mentioned in your blog. A letter to the editor, by spanish experts in orthopaedics and traumatology, has already been published. For example, on the right shoulder dislocation, they write : “The image of both the shoulders on the Shroud is destroyed due to burn damage. So, any deductions made about the shoulders are based upon the angle formed by the upper edge of the trapezius muscle as compared to the contralateral side. In addition, it does not deﬁne the exact placement of the humeral head centre. The authors proposed an alternative interpretation of an anterior dislocation that could be consistent with an indirect mechanism of dislocation (as provoked by a fall during which the right hand came into contact with the ﬂoor). It could be argued that the movements, traction needed, and position in cruciﬁxion could reduce the dislocation if it was present. Alternatively, it also could be stated that the traction exerted during cruciﬁxion could dislocate the shoulder due to body weight as well. However, in this case, the dislocation would be inferior” Caja VL, Reverte Vinaixa MM. ‘‘Do we really need new medical information about the Turin Shroud?’’ published in Injury journal (Injury 2014; 45: 460–4) by Bevilacqua M, Fanti G, D’Arienzo M, and De Caro R. Injury (2014). Http://www.injuryjournal.com/article/S0020 1383(14)00115 6/abstract.","date":"2014-05-09","mins":"2:33 am","url":"https://shroudstory.com/2014/05/08/breaking-news-new-injury-details-seen-on-the-shroud-of-turin/","cat":"article","title":"Breaking News:  New Injury Details Seen on the Shroud of Turin"},{"id":"comment-91165","author":"tristan_casabianca","post":"Another hypothesis about the image formation process has just been published in a peer reviewed journal : Forensic Science, Medicine and Pathology : Tattoli, Tsokos, Buschmann, “Could the Shroud of Turin be an effect of post mortem changes?” You can have a free access to the first two pages. Http://link.springer.com/article/10.1007/s12024 014 9547 6#page 1 (parental discretion advised).","date":"2014-03-20","mins":"9:02 am","url":"https://shroudstory.com/2014/03/20/from-gethsemane-to-the-tomb/","cat":"article","title":"From Gethsemane to the Tomb"},{"id":"comment-79747","author":"tristan_casabianca","post":"Of course, the reference to Dante has a devastating effect on the credibility of the paper… What a shame… But, if we are fair minded, we have to say that neither the 11th on the Richter scale nor the “Dante effect”, have no impact whatsoever on the validity of the scientific conclusion (the possible effects of a 8 9 Richter Scale earthquake on the radiodatation of the shroud). By the way, Achenbach knows perfectly well (I hope) that Meccanica is a good peer reviewed journal and not open access (http://www.scimagojr.com/journalsearch.php?q=14471&tip=sid&clean=0). So why does he suggest the contrary? This is bad journalism (and bad faith?)..","date":"2014-02-16","mins":"4:14 am","url":"https://shroudstory.com/2014/02/16/the-shroud-of-turin-story-brings-up-all-the-usual-issues-about-click-bait-journalism/","cat":"press_coverage","title":"The Shroud of Turin story brings up all the usual issues about click-bait journalism"},{"id":"comment-171549","author":"tristan_casabianca","post":"Ockham’s razor (criterion of simplicity) is not at all the main weapon in the hands of historians and philosophers. For sure, it is the most popular, the most discussed, but not the most important. From my article published last year in the Heythrop Journal (“The Shroud of Turin: A Historiographical Approach”): “Historical criteria do not fall from the sky; they are part of a slowly built up methodology routinely used by historians, whatever may be their opinion on the subject being discussed. This article will use criteria specified by Christopher Behan Mc Cullagh. One can list these in order of priority from the most important to the least; this list, while not written in stone, provides a general idea of the most important conditions to satisfy. Thus one has: 1) plausibility: does our knowledge in other well known fields support or reinforce the hypothesis? 2) Explanatory scope: can the hypothesis do justice to all the facts? 3) Explanatory power: the hypothesis has to be specific and accurate, rather than ambiguous. 4) Less ad hoc: ceteris paribus, the hypothesis should not invoke or rely on unverified data (this includes the criterion of simplicity). 5) Illumination: does the hypothesis shed light on other widely accepted phenomena? This last criterion was added by Licona who believes it contributes further specification.”.","date":"2014-11-16","mins":"6:41 am","url":"https://shroudstory.com/2014/11/16/maybe-friar-ockham-was-wrong/","cat":"books","title":"Maybe Friar Ockham was wrong"},{"id":"comment-125859","author":"tristan_casabianca","post":"It’s simply because Craig follows a “Minimal facts approach”, that takes only into account historical data receiving the widest consensus among scholars (Jesus’ crucifixion, Paul’s conversion, the empty tomb, the rapid spread of christianity). Therefore he does not need the TS to prove the death of Jesus. Virtually all scholars already agree : Jesus died by crucifixion around 30 AD. Craig is familiar with the shroud : “The mystery of the shroud still remains. If it is a forgery nobody knows how it was done. It is so totally unlike medieval paintings of that time. If you’ve ever seen pre Renaissance paintings, the figures almost look like flat cartoon figures without any perspective, whereas the man on the shroud is anatomically accurate. It’s quite a striking image. So some scholars who’ve been working on this whole shroud thing believe the carbon 14 test may have been skewed in some way because the shroud was damaged by fire around the 1500s. When the nuns repaired the shroud, they may have interwoven cloth into the fabric of the shroud in order to repair tears, patches or rips. It may be where they took the piece, a centimeter square piece of the hem of the shroud, some would suggest, that this may have been part of the repair work on the edge rather than the original fabric. So they want to rerun the test, but the Catholic Church doesn’t permit it because when you carbon date these things it destroys the sample, and so for them it’s destroying this precious relic. It’s sacred so they don’t want people doing it. The Church hasn’t agreed to letting it be done again, but until those carbon dating tests are reversed, I think one can’t say that the shroud is authentic. You would need to have those tests somehow shown to be erroneous. Apart from those tests, the signs of authenticity on the shroud are quite remarkable.” http://www.reasonablefaith.org/forum on the resurrection with william lane craig#ixzz33 Gojw L9i.","date":"2014-05-31","mins":"2:39 am","url":"https://shroudstory.com/2014/05/30/bradley-bowen-craig-knows-better-than-to-put-the-shroud-of-turin-forward-as-historical-evidence/","cat":"books","title":"Bradley Bowen: Craig knows better than to put the Shroud of Turin forward as historical evidence"},{"id":"comment-214489","author":"tristan_casabianca","post":"I really don’t know if there are writings on the shroud. But I what I do know is that there is a significative difference between young students (less than 22 years old) unaware of pareidolia, like in this study, and professional optical engineers and historians well aware of this psychological phenomenon..","date":"2015-11-11","mins":"6:19 am","url":"https://shroudstory.com/2015/11/11/psychological-influences-in-seeing-inscriptions-on-the-shroud-of-turin/","cat":"paper_chase","title":"Psychological Influences in Seeing Inscriptions on the Shroud of Turin"}]
