[{"id":"comment-73167","author":"david_sunfellow","post":"Hi Dan. Thanks for letting your readers know that Barrie’s TE Dx talk is posted on NHNE Pulse. For the record, while NHNE Pulse does spend a lot of time covering near death experiences, we also cover many of other topics as well. But I will stick with ND Es here. If you, or any of your readers are on the fence about ND Es; if you are not sure if they are legitimate spiritual experiences or simply products of malfunctioning brains, I encourage you to check out this outstanding presentation by Dr. Bruce Greyson, who is Professor of Psychiatry at the University of Virginia. He gave this tour de force talk in 2011 to an audience in India: You readers may also be interested in these resources: ND Es Absolutely, Positively NOT Caused By Malfunctioning Brains http://nhne pulse.org/ndes absolutely positively not caused by malfunctioning brains/ How Near Death Experiences Are Changing The World http://msv nhne.org/how near death experiences are changing the world/ NDE Stories http://ndestories.org/stories/ Extraordinary Human Capabilities http://nhne pulse.org/extraordinary human capabilities/ Magic is everywhere! Finally, thank you for this fantastic blog. The Shroud, as you well know, is one of humankind’s most remarkable historical artifacts. I’m grateful for the work you are doing to keep those who are interested well informed..","date":"2014-01-12","mins":"2:41 pm","url":"https://shroudstory.com/2014/01/12/barrie-schwortz-tedx-talk-featured-on-nde-site/","cat":"other_blogs","title":"Barrie Schwortz’ TEDx Talk Featured on NDE Site"},{"id":"comment-73174","author":"david_sunfellow","post":"What relevance do Shroud studies have to Dr. Bruce Greyson’s talk? And near death experiences? And reincarnation stories? And… Here’s the relevance for me: If you examine these topics closely enough, I believe you discover universal truths that underpin all life. For example, if you study the core truths that underpin near death experiences from around the world, you discover that they are in surprising alignment with the core truths presented by Jesus in sources that pre date Christianity (in the Sayings Gospel Q, for example). This is remarkable, I think. In essence, you’ve got a fellow who lived two thousand years ago who said and did things that changed the course of human history in very dramatic ways. But what, exactly, did he say and do? And is any of it relevant to us today? Does it still have the power to change lives? Produce miracles? Lift people into higher states of consciousness? Near death experiences are full of stories of changed lives, miraculous healings, and people encountering the kind of unconditionally loving God that Jesus spoke about two thousand years ago. After decades of research, I’m convinced that Jesus tapped into the same Reality than near death experiencers are tapping into today. I’m also convinced that the life, teachings, death, and possible resurrection of Jesus continue to have important things to add to the discussion. Because near death experiences are a current and unfolding phenomenon, there are many ways to learn more about them. But how can we learn more about Jesus? And then compare his teachings and experience to ND Es and related phenomenon? Modern Biblical scholarship has provided a lot of insight into who Jesus was — and wasn’t. If the Shroud is authentic, it could add to (and correct) the other historical records we have. For example, the man pictured on the shroud was crucified, but the nails were not driven through his palms. Instead, they were driven through his wrists. There are also blood stains on the Shroud. As science progresses, there may be ways to extract all kinds of interesting information from this. And then there is the way that the image on the Shroud was burned into the fabric that suggests something very, very unusual took place. Is this proof that Jesus resurrected? And if so, is this an experience that is possible for the rest of humankind? And, no, this line of reasoning is not as far fetched as it seems. Right now, all over the world, people are experiencing the kind of events that fill the pages of the New Testament. And that includes people rising from the dead, complete with doctors scratching their heads and reams of medical records to verify the impossible has, indeed, happened. A good case in point is near death experiencer Anita Moorjani: http://ndestories.org/anita moorjani/ You can find other stories, many of which include miraculous healings, posted here: http://ndestories.org/ Having a physical artifact that is linked to Jesus that can add and/or clarify important parts of his story, gives us more of an ability to understand what the guy actually said and did, as well as what happened to him. And I, for one, am extremely interested in knowing all about this. As more people make the connection between modern day near death experiences and the life and teachings of Jesus, I think they will be interested too. Ditto for research that is being done with past life experiences, miracles and spontaneous healings, angelic appearances, and the like. All of these things shed light on who we are, why we are here, and where we are headed….","date":"2014-01-12","mins":"5:23 pm","url":"https://shroudstory.com/2014/01/12/barrie-schwortz-tedx-talk-featured-on-nde-site/","cat":"other_blogs","title":"Barrie Schwortz’ TEDx Talk Featured on NDE Site"},{"id":"comment-73166","author":"david_sunfellow","post":"Hi Dan. Thanks for letting your readers know that Barrie’s TE Dx talk is posted on NHNE Pulse. For the record, while NHNE Pulse does spend a lot of time covering near death experiences, we also cover many of other topics as well. But I will stick with ND Es here. If you, or any of your readers are on the fence about ND Es; if you are not sure if they are legitimate spiritual experiences or simply products of malfunctioning brains, I encourage you to check out this outstanding presentation by Dr. Bruce Greyson, who is Professor of Psychiatry at the University of Virginia. He gave this tour de force talk in 2011 to an audience in India: You readers may also be interested in these resources: ND Es Absolutely, Positively NOT Caused By Malfunctioning Brains http://nhne pulse.org/ndes absolutely positively not caused by malfunctioning brains/ How Near Death Experiences Are Changing The World http://msv nhne.org/how near death experiences are changing the world/ NDE Stories http://ndestories.org/stories/ Extraordinary Human Capabilities http://nhne pulse.org/extraordinary human capabilities/ Magic is everywhere! Finally, thank you for this fantastic blog. The Shroud, as you well know, is one of humankind’s most remarkable historical artifacts. I’m grateful for the work you are doing to keep those who are interested well informed..","date":"2014-01-12","mins":"2:39 pm","url":"https://shroudstory.com/2014/01/12/barrie-schwortz-tedx-talk-featured-on-nde-site/","cat":"other_blogs","title":"Barrie Schwortz’ TEDx Talk Featured on NDE Site"}]
