[{"id":"comment-208967","author":"barrie_schwortz","post":"I think it is important that I correct and clarify the statement made by this blogger and some of the comments that followed. First, my actual comment regarding the crucifix in 1978 was made only to John Jackson. What I told John was that 20 years from now, when looking at my photographs of the STURP team at work, someone would see the crucifix and use that against us or our work. That proved to be prophetic since 20 years later, Harry Gove did just that in his book, “Relic, Icon or Hoax.” He included one of those photographs and stated: “Note the wooden crucifix around Jackson’s neck” (or words to that effect), as if somehow that would affect our data or conclusions. Remember that there were 3 Jews (including Adler) and several atheists and agnostics on the team so the wearing of a crucifix by one team member was totally irrelevant. As I have pointed out for years, that had no impact on the spectral, chemical, photographic and other data gathered by STURP and would simply be used as a red herring by some future skeptic to attack STURP on a personal basis. Jackson had every right to wear that symbol of his faith if he so desired. I never asked John to remove the crucifix but only that he tuck it under his shirt. However, in 1978 most of the STURP team members were not very media savvy (due to the nature of their work in the weapons industry) and did not understand the impact such a simple and innocent gesture might cause years later. So sadly, Gove (and now Colin Berry) have proven me to be correct. As for Heller and Adler (and several other team members who did not go to Turin for the data gathering portion of our work but examined the data upon our return), that was mainly because we were under funded and the cost of airline tickets and hotels had to be kept to a minimum, so only those team members who were essential for the data gathering went to Turin. To be clear, NO ONE ever claimed that Heller and Adler were present during the examination in 1978. One only has to look at the 1978 STURP Team page of Shroud.com, which has been online for nearly 20 years (http://www.shroud.com/78team.htm) to see a complete list of all the formal team members and which ones participated directly in the data gathering event. Frankly, I find it totally ridiculous that Colin would claim that Heller and Adler used their positions on the team to “boost their credentials as fully involved rather than associate status STURP” (members). Both were fully involved and were active, full fledged team members BEFORE we went to Turin and did not need the STURP project to boost their careers. The only one who fell into that category was Walter Mc Crone, who became an associate member when Rogers delivered his tape samples to him AFTER our return and it was only then that he signed the appropriate non disclosure agreement. That is why Mc Crone is not on that list, as it reflects only those who were original members of the team. Others who were full fledged team members but did not participate in the data gathering included Diane Soran and Larry Schwalbe (of Los Alamos National Laboratory), Dr. Robert Bucklin and Dr. Joseph Gambescia (forensic and medical experts), and Jim Drusik of the Los Angeles County Museum of Art (who I have mentioned previously to Charles Freeman on this blog). So once again Colin, you have selected and presented certain facts completely out of context to try and prove your point and once again, you attack the character of the researchers rather than their science or their conclusions. I suppose I’ll have to compile a list of the deceased STURP team members and send it to you to make it easier for you to plan your next ad hominem attack on those who are not alive to defend themselves. Like several other skeptics over the years, you must believe that if you can’t attack the science, your only recourse is to personally attack the scientists themselves. Shame on you..","date":"2015-08-25","mins":"1:35 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-208974","author":"barrie_schwortz","post":"Colin, perhaps I should remind you that STURP’s primary objective was to determine the properties of the image on the Shroud. To that end, the majority of the experiments were oriented towards that goal. We understood the blood would be significant, which is why we welcomed Heller and Adler to the team, but they did not have to be in Turin to gather the data, since they had complete access to ALL of STURP’s data, including the tape samples, Vern Miller’s superb scientific photography and Mark Evans’ excellent photomicroscopy, not to mention all the spectral and other data. That is what they used to evaluate the bloodstains (just as you have). There was no time in STURP’s test plan to do any in situ analyses in Turin. The goal was to gather as much data as we could in the short time allowed to us and evaluate it in depth after we returned. A geologist doesn’t have to take the core sample himself, he just has to evaluate it afterwards. I should also mention that Adler was given the opportunity to examine the Shroud up close and personal on multiple occasions in later years. He was the only American scientist on the conservation commission of the Turin Archdiocese and was highly regarded by everyone. This also explains why a significant amount of STURP’s time was spent performing the various photographic and imaging experiments. They would provide a qualified database of accessible materials for future research, since we were the first group ever given such access to the Shroud and it was unknown whether any similar research would be permitted in the future. As you know, no such permission has ever been granted since. In many ways we were charting new territory, as no other similar examinations had ever been performed. However, calling Adler and Heller’s absence in Turin a “gross breach of professional standards” is a gross exaggeration and doesn’t take into account any of the countless factors and circumstances that STURP encountered along the way in their effort to obtain permission to examine the cloth. It is very easy to be critical 38 years later, but you do so without any real knowledge or context of what took place. It’s too bad you weren’t there in 1978, as I am sure you could have made a valuable contribution, but you weren’t there and now you are passing judgement on these men without any of the facts. I am sure you had an esteemed career and held many responsible positions. Just remember that Ray Rogers had an equally esteemed career and advised the U.S. Government and military on matters of national security, even after his retirement as a Fellow at Los Alamos National Laboratory. As he was dying of cancer, he devised a method to foil IED’s in Iraq, and probably saved many lives by doing so. As for writing memoirs, only Heller wrote such a book, and it was less a memoir than an overview of STURP and his personal experiences as a member of the team. Adler wrote a number of papers about the Shroud that were posthumously compiled into a book by Dorothy Crispino. Heller spent considerable time with each team member during his research for his book. In fact, he spent a full week at my studio in Santa Barbara, California interviewing me and did the same with most of the others. He did it when the experiences were all fresh in our minds so it is probably the most accurate rendition of what we did throughout the process. To my knowledge, you are the first (and only) person to level that type of criticism on what is a truly important historical document. It is perfectly acceptable to disagree (even strongly) with the methods and conclusions of any researcher. In fact, Rogers and the others would have vehemently defended your right to do so. But it is absolutely unnecessary to launch baseless attacks on their character and accuse them of negligence or worse, which you have done on numerous occasions. That is true whether they are alive OR dead. A little respect goes a long way..","date":"2015-08-25","mins":"5:47 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"}]
