[{"id":"comment-192837","author":"barrie_schwortz","post":"“…the so called UV F photo of the radiocarbon corner of the Shroud (whose provenance I cannot determine but which is certainly not from Vern Miller’s 1978 collection)…” To my knowledge, the only researchers to ever perform UV fluorescence photography on the Shroud were the STURP team and Vern Miller. The provenance of those images is without question. Every member of the STURP team had access to all the images taken in 1978, including Vern’s. All data was shared equally amongst team members..","date":"2015-03-08","mins":"5:34 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-196994","author":"barrie_schwortz","post":"“I am quite happy to accept that the original pigments had largely fallen off by 1978…” You don’t seem to understand the technology Charles. Had the Shroud been created using any quantity of paint or pigment, it would have penetrated the cloth and there would have been plenty there for STURP’s instruments to detect. At best, only some of the surface pigment would have flaked off, but there would have been plenty remaining within the weave and fibers of the cloth..","date":"2015-04-20","mins":"8:16 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-192841","author":"barrie_schwortz","post":"I see your point Hugh. If that is one of Miller’s UV photos, it has been heavily manipulated, perhaps when someone drew the overlay on it. The actual UV images are considerably darker and with greater contrast..","date":"2015-03-08","mins":"6:16 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-196986","author":"barrie_schwortz","post":"I knew both David Sox and Fr. Peter Rinaldi personally. Take my word for it, between the two I would ONLY trust Rinaldi..","date":"2015-04-20","mins":"6:36 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-196967","author":"barrie_schwortz","post":"Charles, as I explained to you in an earlier post on this blog, STURP had Jim Drusik of the Los Angeles County Museum as a member of the team and our resident expert when it came to art and art history. However, STURP’s purpose was primarily to characterize the image on the cloth scientifically and not trace its historic origins. Our primary goal was to determine what formed the image. To that end, we obtained the spectral characteristics of every paint, pigment and binder used from medieval to modern times and did detailed spectral analyses across the entire Shroud. We found none. As I said before, it’s called SCIENCE!.","date":"2015-04-20","mins":"4:23 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-74036","author":"barrie_schwortz","post":"Hugh said: “Rogers had no opportunity to examine the shroud for interwoven cotton, only stray fibres on sticky tape slides.” That is incorrect. Not only did Rogers examine the actual Shroud in close detail, so did Jackson and Jumper and Pellicori and Devan and many others. I have posted a pdf with some photos I made during the 1978 exam that shows this clearly. The last photo is Rudy Dichtl purchasing the infamous “white cotton gloves” that left modern cotton on the surface of the Shroud. Here’s the link: http://www.shroud.com/pdfs/sturpmicroscopy.pdf I hope this is helpful..","date":"2014-01-21","mins":"8:56 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-89666","author":"barrie_schwortz","post":"To date, I have received no answer from Dr. Jull to the several e mails I sent him to follow up on photographing the remaining sample. I am still prepared to photograph it should it be made available. According to the experts I spoke with, most labs would never destroy or use all of an existing sample but would typically keep some small pieces in reserve. The Zurich and Oxford labs now state that they have no Shroud samples remaining, while Arizona apparently kept substantial portions after their tests. I don’t believe they were required to return them to Turin, much as STURP was not required to return any of the materials they gathered. I am still hopeful that the Donahue sample will be made available at some point in time so it can be photographed and included with the other images I made..","date":"2014-03-16","mins":"3:11 pm","url":"https://shroudstory.com/2014/03/16/so-was-the-small-arizona-piece-in-doug-donahues-custody-ever-made-available-to-barrie-schwortz/","cat":"carbon_14_dating","title":"So, was the small Arizona piece in Doug Donahue’s custody ever made available to Barrie Schwortz?"},{"id":"comment-89695","author":"barrie_schwortz","post":"Good science must be done with complete transparency, particularly when dealing with something as controversial as the Shroud. Even Dr. Jull admitted to me that the 1988 tests were rather poorly performed. Arguing over the sample site, leaving the room for 30 minutes and returning with sealed, stainless steel (opaque) containers rather than glass, failure to perform chemical analyses on the samples (required by their own protocol) or release the raw data or explain mathematical inconsistencies in the process, etc., etc., have led to many conspiracy theories. I still personally prefer to look for a credible, scientific answer (like the reweave theory) than to resort to conspiracies. In the end however, you reap what you sow..","date":"2014-03-16","mins":"5:14 pm","url":"https://shroudstory.com/2014/03/16/so-was-the-small-arizona-piece-in-doug-donahues-custody-ever-made-available-to-barrie-schwortz/","cat":"carbon_14_dating","title":"So, was the small Arizona piece in Doug Donahue’s custody ever made available to Barrie Schwortz?"},{"id":"comment-89699","author":"barrie_schwortz","post":"I only need to have it in my possession for one day, so it can be photographed in the exact same manner as the other samples I imaged at the lab in 2012 and added to the collection (which STERA, Inc. Has made publicly available). After that, it can go back to the lab. No, I don’t think a petition is a good idea. I would rather hope they realized the importance of documenting the remaining sample, which might be equally useful in quelling some of the conspiracy theories. I doubt it would ever show up on e bay, but stranger things have happened!.","date":"2014-03-16","mins":"5:46 pm","url":"https://shroudstory.com/2014/03/16/so-was-the-small-arizona-piece-in-doug-donahues-custody-ever-made-available-to-barrie-schwortz/","cat":"carbon_14_dating","title":"So, was the small Arizona piece in Doug Donahue’s custody ever made available to Barrie Schwortz?"}]
