[{"id":"comment-3658","author":"barrie_schwortz","post":"My busy schedule makes it difficult for me to keep up with all the Shroud blogs out there, but this particular posting called for a response. There is no way to coat a porous linen surface like the Shroud with any light sensitive elements in liquid form without some traces of those elements soaking in and remaining in the cloth, even hundreds of years later. The pyrolysis mass spectrometry used on the Shroud would have detected as little as one part per billion of those elements if they were there. Blueprints, platinum chloride platinotype prints and gum bichromate or chromium prints are all products of the late 19th or early 20th century so they could not have been used in medieval times to create the Shroud. J.H. Schulze is credited as the first man to discover the fact that silver salts exposed to light turned black. He made this discovery in 1727. In the same year he discovered that silver chloride turned black under light. In 1737 he used silver nitrate in the same manner. He used cut stencils to expose his silver salts. Thomas Wedgewood and Humphrey Davy repeated Schulze’s experiments some years later by printing leaves instead of stencils. They tried to make a permanent emulsion but did not succeed. It was not until 1818 that Joseph Niepce produced the first photographic negative, which I believe still exists. Since silver, platinum and chromium were NOT found on the Shroud, those processes must be eliminated as possibilities. Of course, the Shroud’s image properties themselves are the best evidence that it was NOT created photographically (even though its lights and darks are reversed, like a photo negative). You might wish to read the article I wrote in 2000 titled “Is the Shroud of Turin a Medieval Photograph” (http://www.shroud.com/pdfs/orvieto.pdf) that addressed Nicholas Allen’s camera obscura experiments in which Allen produced an excellent photographic image using silver salts and other medieval raw materials. However, that process resulted in an image dramatically different than the image on the Shroud. One of my college professors used to say that “common sense is the least common of all the senses!” If we are going to make outrageous claims that modern processes were used hundreds of years prior to their actual invention, then we should start searching ancient ruins for medieval digital cameras (Ye Olde I pod)!.","date":"2011-08-22","mins":"4:19 pm","url":"https://shroudstory.com/2011/08/22/razor-swift-the-shroud-of-turin-is-real/","cat":"flagrum","title":"Razor Swift: The Shroud Of Turin Is Real!"}]
