[{"id":"comment-9631","author":"barrie_schwortz","post":"For those not familiar with the 2002 restoration of the Shroud, read the Comments on the Restoration page of shroud.com at http://www.shroud.com/restored.htm for details..","date":"2012-03-25","mins":"3:31 pm","url":"https://shroudstory.com/2012/03/25/comment-promoted-travertine-aragonite-limestone/","cat":"history","title":"Comment Promoted: Travertine Aragonite Limestone"},{"id":"comment-166662","author":"barrie_schwortz","post":"Excellent point Wm W! Here is the first sentence of the comment I wrote (that the Catholic Herald editor deleted): “Those aspects of the Shroud are far from my areas of expertise.”.","date":"2014-10-29","mins":"4:04 pm","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science"},{"id":"comment-72969","author":"barrie_schwortz","post":"For some interesting background on some authentic Shroud relics I saw in Portugal that came from the Savoy family, read the article by Portuguese relic expert Carlos Evaristo at http://www.shroud.com/pdfs/fatima2011.pdf Here is a brief quote: “Maria Pia, who was the daughter of the first King of unified Italy, Vittorio Emanuele II, at 15 years of age wed Portugal’s King Luis I in 1862 bringing with her to Portugal a series of Holy Relics from the Shroud of Turin.”.","date":"2014-01-10","mins":"8:58 pm","url":"https://shroudstory.com/2014/01/10/how-many-more-purported-pieces-are-out-there/","cat":"history","title":"How many more purported pieces are out there?"},{"id":"comment-16958","author":"barrie_schwortz","post":"Thank you Gabriel. I was not aware of this particular paper so it was not included on our Bibliography of STURP Published Papers page (http://www.shroud.com/78papers.htm). Of course, it was authored and published many years after the STURP team ended its formal existence. However, since you brought it up, I have added it as #29 to the list on our site as of today. Also note this quote from Larry Schwalbe on the page: “As I said, these papers do not deal directly with the data collected in 1978. Instead, the work was intended to serve as background to support a future investigation that we thought was still possible in the late 80s. There are probably more papers like these. Perhaps including these will flush out more such information.” And that’s exactly what happened! Thank you for your contribution!.","date":"2012-09-26","mins":"5:06 pm","url":"https://shroudstory.com/2012/09/26/paper-chase-barrie-schwortz-the-shroud-of-turin-research-project-1978-scientific-examination-of-the-shroud/","cat":"history","title":"Paper Chase: Barrie Schwortz’ “The Shroud of Turin Research Project 1978 Scientific Examination of the Shroud”"}]
