[{"id":"comment-74001","author":"barrie_schwortz","post":"The corrected version is now online. Thanks for pointing it out to me..","date":"2014-01-21","mins":"5:24 pm","url":"https://shroudstory.com/2014/01/21/18th-anniversary-for-shroud-com/","cat":"news_&_views","title":"18th Anniversary for shroud.com"},{"id":"comment-3962","author":"barrie_schwortz","post":"Thank you all for your comments! I totally agree and have already started working on the redesign of the Main Menu page. I particularly appreciate the technical suggestions and will include them when I update the site for our 16th anniversary update on January 21, 2012. And no, this is not going to get anyone into trouble with me! The site has needed a face lift for years but other priorities always got in the way. Thanks for giving me a much needed nudge!.","date":"2011-09-20","mins":"1:33 pm","url":"https://shroudstory.com/2011/09/20/a-call-to-freshen-up-shroud-com/","cat":"news_&_views","title":"A Call to Freshen Up shroud.com"},{"id":"comment-202256","author":"barrie_schwortz","post":"We already include those words (and others) in the Metadata and Keywords on our Spanish language pages, which is why Dan found us when searching on La Sábana Santa de Turín. Still, it wouldn’t hurt to add them to our English language pages as well. Thanks for the tip..","date":"2015-06-15","mins":"2:08 pm","url":"https://shroudstory.com/2015/06/15/a-tip-for-shroud-of-turin-website-owners/","cat":"other_sites","title":"A Tip for Shroud of Turin Website Owners"},{"id":"comment-107227","author":"barrie_schwortz","post":"I strongly urge anyone using Internet Explorer to switch over to Mozilla Firefox immediately. It is free and far more robust than IE. Once installed, find and download the following two add ons (also free): No Script, which blocks web pages from running scripts on your computer. This can affect the functionality of certain web pages but you can permanently allow the pages you trust. Otherwise, you can temporarily allow pages that don’t properly function when you visit them. The default is to block all scripts and give you the options (which can be a hassle sometimes – but it keeps you safe). The second add on is Key Scrambler, which encrypts all of your keystrokes while on the web, making your passwords and the other information you enter much safer. It used to be an add on to Firefox but is now a standalone program. The personal version is free and you can find it via Google..","date":"2014-04-30","mins":"6:20 pm","url":"https://shroudstory.com/2014/04/30/browser-issues-this-blog-and-more/","cat":"news_&_views","title":"Browser Issues:  This Blog and More"},{"id":"comment-131342","author":"barrie_schwortz","post":"The video in question is an edited and shortened version of a program produced in 2010 by nuns from the Chemin Neuf community in Lyon, France. The original title is “He Is the Image of the Invisible God – Shroud of Turin,” which was released in June 2010 on a 16 language DVD. Here is a link to the original program on our website store page: http://www.shroud.com/obtain.htm#Video. Also appearing in the original program were Thibault Heimburger, Christian Cataldo, Ed Prior and others. I have no idea who re edited the program or whether they obtained permission to do so. You can view the entire original 35 minute version of the program on the Net For God website at this link: http://www.netforgod.tv/VOD/index.html (Scroll down the list of programs and select: “Il est l’image du Dieu invisible Le Linceul de Turin,” then select the language you wish to view in)..","date":"2014-06-19","mins":"1:26 pm","url":"https://shroudstory.com/2014/06/19/hathos-warning/","cat":"uncategorized","title":"Hathos Warning"},{"id":"comment-131376","author":"barrie_schwortz","post":"Hello O.K.! Yes, I intend to include it in our next update, which will go online as soon as the Archdiocese of Turin activates their reservation system. I just got two e mails from you but there was no message in either..","date":"2014-06-19","mins":"3:08 pm","url":"https://shroudstory.com/2014/06/19/hathos-warning/","cat":"uncategorized","title":"Hathos Warning"},{"id":"comment-131518","author":"barrie_schwortz","post":"Ooops! Sorry..","date":"2014-06-19","mins":"9:27 pm","url":"https://shroudstory.com/2014/06/19/hathos-warning/","cat":"uncategorized","title":"Hathos Warning"},{"id":"comment-201161","author":"barrie_schwortz","post":"For more information on the 2002 intervention, see Comments on the Restoration at http://www.shroud.com/restored.htm..","date":"2015-06-05","mins":"6:56 pm","url":"https://shroudstory.com/2015/06/05/housekeeping-how-to-participate/","cat":"news_&_views","title":"Housekeeping:  How to Participate"},{"id":"comment-43827","author":"barrie_schwortz","post":"Dear David – Read the 2005 article on the Manoppello by Roberto Falcinelli at http://www.shroud.com/pdfs/roberto.pdf. It has been available online for 8 years..","date":"2013-09-11","mins":"5:11 pm","url":"https://shroudstory.com/2013/09/10/i-say-let-all-of-us-help-david-help-us-all/","cat":"crowdfunding","title":"I say let all of us help David help us all"},{"id":"comment-131386","author":"barrie_schwortz","post":"Hello O.K. – I got your e mail and have just responded. I also have house guests for the next 3 days so cannot do an update until the beginning of next week at the earliest. However, I expect the reservation system will be going online by the end of this month. (In 2010 it went online about 9 months before the beginning of the exposition)..","date":"2014-06-19","mins":"3:31 pm","url":"https://shroudstory.com/2014/06/19/hathos-warning/","cat":"uncategorized","title":"Hathos Warning"},{"id":"comment-201729","author":"barrie_schwortz","post":"The Turin authorities designed and commissioned a new display cabinet for this exposition, which is what we see pictured in all the photos. It is different than the permanent reliquary in which the Shroud is usually stored..","date":"2015-06-12","mins":"2:52 pm","url":"https://shroudstory.com/2015/06/12/lights-cameras-action-and-the-drones-of-turin/","cat":"2015","title":"Lights, Cameras, Action and the Drones of Turin"},{"id":"comment-40913","author":"barrie_schwortz","post":"Thanks Dan! Good idea!.","date":"2013-08-10","mins":"1:53 pm","url":"https://shroudstory.com/2013/08/10/more-on-the-shroud-affair/","cat":"crowdfunding","title":"More on The Shroud Affair"},{"id":"comment-215507","author":"barrie_schwortz","post":"We started using the pdf format in 1999, before it became widely accepted, and the first 23 papers we published in that format were placed in the root directory of the website. It quickly became apparent that this was the ideal format for papers on the site, so we created a new folder specifically for files of that format and all new pdfs were placed in that directory. It currently contains 1600 pdf files. The root directory only includes those first 23 pdf files and we have left them in that directory to avoid changing any links on the website, since those are often used as references in published papers, books and presentations..","date":"2015-12-02","mins":"4:37 pm","url":"https://shroudstory.com/2015/12/02/searching-for-papers/","cat":"other_sites","title":"Searching for Papers"},{"id":"comment-142462","author":"barrie_schwortz","post":"The problem has now been corrected and the blocking file removed. Unfortunately, we added the blocking file in January 2014 when our bandwidth shot through the roof and generated over 130 GB of traffic in just a few days, nearly tripling our average monthly bandwidth. According to our service provider, this was mostly generated by search engines. With the file removed, search engines can once again access the pdfs..","date":"2014-08-05","mins":"3:35 pm","url":"https://shroudstory.com/2014/08/05/searching-shroud-com-academia-edu-and-other-sites/","cat":"news_&_views","title":"Searching shroud.com, academia.edu and other sites"},{"id":"comment-172398","author":"barrie_schwortz","post":"Due to my travel and lecture schedule this year, we had to apply for an extension to our normal July 15 filing date. Our return was filed on October 29, 2014 so the 2013 data should show up soon..","date":"2014-11-21","mins":"12:51 pm","url":"https://shroudstory.com/2014/11/20/steras-annual-fundraising-campaign/","cat":"other_sites","title":"STERA’s Annual Fundraising Campaign"},{"id":"comment-22397","author":"barrie_schwortz","post":"I am always happy to speak about the Shroud, no matter what the point of view is of the sponsoring organization. Since many Evangelical Christians do not accept the Shroud as authentic, the opportunity to address such a group is a great opportunity to inform them of the facts and perhaps open their minds a bit to the Shroud. I never involve myself in theology in my presentations and simply share the facts and my own personal experience with it over the last 35 years. And yes, they will pay a modest honorarium to STERA, Inc. For my services, but that is not the primary reason for making the presentation..","date":"2013-01-22","mins":"3:03 pm","url":"https://shroudstory.com/2013/01/22/pitn-taking-advantage-of-the-shroud-of-turin/","cat":"news_&_views","title":"PITN Taking Advantage of the Shroud of Turin"},{"id":"comment-43995","author":"barrie_schwortz","post":"Hi Kelly, I spoke with Richard today and the website and museum are not quite ready. The site currently is using place keeper photos (with new ones soon to replace them)and the current captions are only temporary until the finals are written. Richard doesn’t have a date for the grand opening yet..","date":"2013-09-12","mins":"6:52 pm","url":"https://shroudstory.com/2013/09/12/the-wabash-shroud-of-turin-museum/","cat":"news_&_views","title":"The Wabash Shroud of Turin Museum"},{"id":"comment-20926","author":"barrie_schwortz","post":"Actually, Whanger was referring to the 1931 Enrie photos. No major photography was done in 1973..","date":"2012-12-21","mins":"2:05 pm","url":"https://shroudstory.com/2012/12/16/who-took-which-sticky-tape-samples-where-and-when-6bd-pictured/","cat":"news_&_views","title":"Who took which sticky tape samples where and when? 6BD Pictured?"},{"id":"comment-20936","author":"barrie_schwortz","post":"There were two sets of tape samples taken in 1978, one by Frei and the other by Rogers. I believe the above diagram is of Frei’s sampling. You can find a map of Rogers’ sample sites at this link: http://www.shroud.com/mapping.htm.","date":"2012-12-21","mins":"6:30 pm","url":"https://shroudstory.com/2012/12/16/who-took-which-sticky-tape-samples-where-and-when-6bd-pictured/","cat":"news_&_views","title":"Who took which sticky tape samples where and when? 6BD Pictured?"},{"id":"comment-35650","author":"barrie_schwortz","post":"I was contacted by this company about a month ago and they sent me their printed literature. I also spoke to the owner on one occasion. They wanted STERA, Inc. To include their product on shroud.com. I asked them to furnish the name of the priest who provided the image and was told he was from Spain and named “Fr. Laisney.” They claimed he was part of the “restoration” team so I contacted Turin today and was told that they never heard of Fr. Laisney and he had nothing to do with the 2002 restoration. Also, the material on their website and printed literature is inaccurate when it talks about the Shroud. We will not be working with them..","date":"2013-06-01","mins":"6:24 pm","url":"https://shroudstory.com/2013/06/01/we-received-a-high-resolution-scan-from-one-of-the-priests/","cat":"news_&_views","title":"We received a high resolution scan from one of the priests . . ."},{"id":"comment-20522","author":"barrie_schwortz","post":"It is quite possible that the sample being discussed was taken in 1973 as Max points out, but I have no information on those samples at all. However, maybe the questions should be addressed to the man who now holds the Frei collection, Dr. Alan Whanger, or to Paul Maloney, who had the Frei collection and studied it extensively for several years before transferring it to Whanger. They might be able to provide more accurate information than either Danin or Lucotte. As I said in my earlier post, in 1978 I photographed Frei’s sample taking from beginning to end and, at one point, he did reach to put tape on the Shroud face. It was that moment that John Jackson intervened and physically stopped him from doing so and a moment later I made a well known photo of the resulting confrontation. (See http://www.shroud.com/gallery/thumbnails/5 B 5.jpg). I think the idea that the samples in question might have come from Frei’s 1973 examination makes a lot of sense..","date":"2012-12-16","mins":"7:15 pm","url":"https://shroudstory.com/2012/12/16/who-took-which-sticky-tape-samples-where-and-when-6bd-pictured/","cat":"news_&_views","title":"Who took which sticky tape samples where and when? 6BD Pictured?"},{"id":"comment-20829","author":"barrie_schwortz","post":"I believe Dr. Alan Whanger made that statement some years ago, although he was not referring to damage done by tape samples, but rather by rolling and unrolling the Shroud. However, he provided no data to support his claim so it was mainly conjecture. As for the conversation between Frei and Jackson (with Luigi Gonella acting as referee), it was very heated and was specifically about putting tape ANYWHERE on the face of the image. It ended with the decision that NO ONE would take any tape samples from the face, which is considered the most iconic part of the Shroud image..","date":"2012-12-20","mins":"2:50 pm","url":"https://shroudstory.com/2012/12/16/who-took-which-sticky-tape-samples-where-and-when-6bd-pictured/","cat":"news_&_views","title":"Who took which sticky tape samples where and when? 6BD Pictured?"},{"id":"comment-20523","author":"barrie_schwortz","post":"Sorry for the small thumbnail. Here’s a slightly larger version: http://www.shroud.com/gallery/images/5 B 5.jpg.","date":"2012-12-16","mins":"7:18 pm","url":"https://shroudstory.com/2012/12/16/who-took-which-sticky-tape-samples-where-and-when-6bd-pictured/","cat":"news_&_views","title":"Who took which sticky tape samples where and when? 6BD Pictured?"},{"id":"comment-211627","author":"barrie_schwortz","post":"Thanks to Dan for remembering our dear friend Fr. Kim Dreisbach. You might also wish to read the memorial we published on shroud.com after his passing. Here is the link: http://www.shroud.com/late06.htm#kim.","date":"2015-10-01","mins":"3:00 pm","url":"https://shroudstory.com/2015/09/30/i-am-the-onliest-one-who-can-go-and-im-scared/","cat":"people","title":"“I am the ‘onliest’ one who can go, and I’m scared.\""}]
