[{"id":"comment-52989","author":"barrie_schwortz","post":"Judging the Tilma’s authenticity on what little I know about it would be very similar to many Shroud skeptics who dismiss the Shroud based on their own limited knowledge! Frankly, there has been very little scientific testing done on the Tilma so there is no database of verified information that one can access as there is with the Shroud. We still don’t know for sure what material the Tilma is made of! However, as there is with the Shroud, much misinformation floods the internet about it that perpetuates a Tilma “mythology.” Some of that mythological “evidence” will not withstand scientific scrutiny. Of course, I could not go into that kind of detail in the EWTN interview. The Jerusalem meeting I attended this past July (see http://www.shroud.com/latebrak.htm#3rd3) was my first exposure to any information about the Tilma, so I am truly not qualified to have any opinion. As I said to Anonymous, “I will leave the study of the Tilma to others and be happy to read their conclusions.”.","date":"2013-11-27","mins":"6:49 pm","url":"https://shroudstory.com/2013/11/27/a-guest-posting-by-yannick-clment-solid-as-a-brick-wall/","cat":"guest_posting","title":"A Guest Posting by Yannick Clément: Solid as a Brick Wall"},{"id":"comment-52985","author":"barrie_schwortz","post":"Don’t forget that Jackson and Jumper’s access to scientists was based on who was readily available to them at Los Alamos and Sandia labs, along with other government facilities like the Air Force Weapons Lab, Air Force Academy and the Jet Propulsion Lab. Consequently, textile experts and iconographers were just not part of the mix. My own involvement came about because I worked as a photographic consultant on a project for Los Alamos with Don Devan (imaging scientist), who ultimately brought me onto the STURP team based on our working together for 7 months. In the end, I am sure every STURP member would agree that experts in those disciplines would have been very useful. Unfortunately, it just didn’t happen that way. Ray Rogers told me personally how disappointed (and angry) he was in Mc Crone, who betrayed Rogers’ trust with his actions. I personally believe Mc Crone had his own agenda, based on conversations I had with him before his death. Maybe I’ll include the details of those conversations in the book I hope to write someday. Happy Thanksgiving!.","date":"2013-11-27","mins":"6:24 pm","url":"https://shroudstory.com/2013/11/27/a-guest-posting-by-yannick-clment-solid-as-a-brick-wall/","cat":"guest_posting","title":"A Guest Posting by Yannick Clément: Solid as a Brick Wall"},{"id":"comment-136325","author":"barrie_schwortz","post":"Hi Mike! This is a different student who attends the St. Louis Priory school..","date":"2014-07-08","mins":"2:54 pm","url":"https://shroudstory.com/2014/07/08/new-documentary-in-the-works/","cat":"other_blogs","title":"New Documentary in the Works"},{"id":"comment-52990","author":"barrie_schwortz","post":"O.K. : Hello, Barrie, sorry that I post here, but I am interested in obtaining those STURP papers listed here: http://www.shroud.com/78papers.htm Is there any fromal procedure, required, some reference or credentials needed? Hi O.K. – Send me an e mail for details..","date":"2013-11-27","mins":"6:54 pm","url":"https://shroudstory.com/2013/11/27/a-guest-posting-by-yannick-clment-solid-as-a-brick-wall/","cat":"guest_posting","title":"A Guest Posting by Yannick Clément: Solid as a Brick Wall"},{"id":"comment-36403","author":"barrie_schwortz","post":"Thank you Angel!.","date":"2013-06-07","mins":"6:36 pm","url":"https://shroudstory.com/2013/06/04/the-high-price-of-success-at-stera/","cat":"kelly_kearse","title":"The High Price Of Success at STERA"},{"id":"comment-36461","author":"barrie_schwortz","post":"Amen!.","date":"2013-06-08","mins":"2:53 pm","url":"https://shroudstory.com/2013/06/04/the-high-price-of-success-at-stera/","cat":"kelly_kearse","title":"The High Price Of Success at STERA"},{"id":"comment-36320","author":"barrie_schwortz","post":"It most certainly would. Thanks Ron!.","date":"2013-06-06","mins":"3:47 pm","url":"https://shroudstory.com/2013/06/04/the-high-price-of-success-at-stera/","cat":"kelly_kearse","title":"The High Price Of Success at STERA"}]
