[{"id":"comment-194740","author":"barrie_schwortz","post":"I guess it depends on what you define as true. With the exception of Kelly Kearse, who often posts to this blog and is himself an expert in DNA and blood, there is no one in this group of bloggers as qualified as Adler was to draw those conclusions. He was a brilliant blood chemist, knew exactly what he was doing and he studied the actual blood of the Shroud. He was also one of the other Jewish members of the STURP team, so he had no pro authenticity agenda and was only interested in analyzing the samples using the tests that were available to him and doing good chemistry. In my opinion, he did..","date":"2015-03-28","mins":"9:06 pm","url":"https://shroudstory.com/2015/03/28/is-bilirubin-still-accepted-as-an-explanation-for-the-red-blood/","cat":"article","title":"Is Bilirubin Still Accepted as an Explanation for the Red Blood?"},{"id":"comment-194742","author":"barrie_schwortz","post":"Good question Hugh, but perhaps it is a moot point. Pellicori was an optical physicist (an expert in optics and lenses) who actually designed and built one of the instruments we used to examine the Shroud in 1978. In my opinion, his personal observation of a single thread or fiber has no more bearing on the chemical analyses done by Adler than the comments on this blog. My money is still on Adler..","date":"2015-03-28","mins":"9:32 pm","url":"https://shroudstory.com/2015/03/28/is-bilirubin-still-accepted-as-an-explanation-for-the-red-blood/","cat":"article","title":"Is Bilirubin Still Accepted as an Explanation for the Red Blood?"},{"id":"comment-114896","author":"barrie_schwortz","post":"Great to see an article about Ernie Brooks! He put the full resources of Brooks Institute behind the STURP photographic efforts and contributed greatly to our success. Also, Mark Evans, who was responsible for STURP’s photomicroscopy experiments, was a graduate student at Brooks Institute at the time..","date":"2014-05-08","mins":"6:15 pm","url":"https://shroudstory.com/2014/05/08/ernie-brooks-of-sturp/","cat":"article","title":"Ernie Brooks of STURP"},{"id":"comment-194783","author":"barrie_schwortz","post":"Adler had to work with microscopic particles of blood lifted from the Shroud by Rogers’ tape samples. I am sure that was a limitation not encountered by Dr. Carter in his work. Also, we know the samples he tested were at least 700 years old. Adler was extremely cautious about making claims for the blood and even referred to it as “primate” blood rather than human. This was noted again in a recent posting by Kelly Kearse who explained that the more sophisticated tests in use today were not available to Adler in 1978. I think everyone agrees that new testing should be done at some point in the future that could answer these questions more completely..","date":"2015-03-29","mins":"11:41 am","url":"https://shroudstory.com/2015/03/28/is-bilirubin-still-accepted-as-an-explanation-for-the-red-blood/","cat":"article","title":"Is Bilirubin Still Accepted as an Explanation for the Red Blood?"},{"id":"comment-194782","author":"barrie_schwortz","post":"The Orphaned Manuscript will be published in our next website update in late April or early May, along with the final two issues of Shroud Spectrum International..","date":"2015-03-29","mins":"11:29 am","url":"https://shroudstory.com/2015/03/28/is-bilirubin-still-accepted-as-an-explanation-for-the-red-blood/","cat":"article","title":"Is Bilirubin Still Accepted as an Explanation for the Red Blood?"},{"id":"comment-194733","author":"barrie_schwortz","post":"Sorry Hugh. Adler never said that the bilirubin is what made the blood still red. He explained to me that bilirubin was a hemolytic agent that broke down the cell walls of the red blood cells releasing hemoglobin, which is what caused the blood stains to remain red..","date":"2015-03-28","mins":"8:33 pm","url":"https://shroudstory.com/2015/03/28/is-bilirubin-still-accepted-as-an-explanation-for-the-red-blood/","cat":"article","title":"Is Bilirubin Still Accepted as an Explanation for the Red Blood?"},{"id":"comment-194785","author":"barrie_schwortz","post":"I mention this story in my lectures and interviews because it was that conversation with Adler that ultimately tipped me towards accepting the Shroud’s authenticity. I already knew the image was not a painting, scorch or photograph but until Adler and I had that conversation, the reddish color of the blood was a stumbling point for me (and Vern Miller as well). That conversation took place about seven years before I learned of Rogers’ work with Sapponaria, so I now mention both in my lectures..","date":"2015-03-29","mins":"11:50 am","url":"https://shroudstory.com/2015/03/28/is-bilirubin-still-accepted-as-an-explanation-for-the-red-blood/","cat":"article","title":"Is Bilirubin Still Accepted as an Explanation for the Red Blood?"},{"id":"comment-194732","author":"barrie_schwortz","post":"Alan Adler was a noted blood chemist, a member of STURP and he directly examined the blood on the Shroud and performed microchemical analysis on the samples. He published his work in credible scientific journals. His conclusions were anything but hunches..","date":"2015-03-28","mins":"8:29 pm","url":"https://shroudstory.com/2015/03/28/is-bilirubin-still-accepted-as-an-explanation-for-the-red-blood/","cat":"article","title":"Is Bilirubin Still Accepted as an Explanation for the Red Blood?"},{"id":"comment-194787","author":"barrie_schwortz","post":"I agree David. In fact, I believe Turin agrees as well. See the paper by Bruno Barberis, president of the Turin Center for the Study of the Shroud, which was presented at the Valencia Conference in 2012. It was titled Perspectives for the Future Study of the Shroud. Here’s the link: http://www.shroud.com/pdfs/barberisv.pdf. It would require creating a new group of independent researchers, formulating a comprehensive test plan and submitting it to the authorities for review and approval. That’s exactly what STURP did in 1978..","date":"2015-03-29","mins":"12:17 pm","url":"https://shroudstory.com/2015/03/28/is-bilirubin-still-accepted-as-an-explanation-for-the-red-blood/","cat":"article","title":"Is Bilirubin Still Accepted as an Explanation for the Red Blood?"},{"id":"comment-194738","author":"barrie_schwortz","post":"Yes, that is correct. I was raised in an Orthodox Jewish home. However, if I could answer your second question with any authority I could stop doing this and go do something else! I know what the image is NOT. I still do not have any idea of what mechanism can create an image with the same chemical and physical properties as the image on the Shroud. But I’ve only been doing this for 38 years. Maybe next year….","date":"2015-03-28","mins":"8:47 pm","url":"https://shroudstory.com/2015/03/28/is-bilirubin-still-accepted-as-an-explanation-for-the-red-blood/","cat":"article","title":"Is Bilirubin Still Accepted as an Explanation for the Red Blood?"},{"id":"comment-197088","author":"barrie_schwortz","post":"Sadly, Diana Fulbright is extremely ill and has been unable to get us the paper to include on the page. Perhaps Paolo can send it to us?.","date":"2015-04-21","mins":"3:45 pm","url":"https://shroudstory.com/2015/04/21/retracted-papers/","cat":"article","title":"Retracted Papers"},{"id":"comment-197089","author":"barrie_schwortz","post":"In June 2014 we published several articles relating to the Carpinteri paper. Here’s the link to our article: http://www.shroud.com/late14.htm#quake. It includes further links to papers by archaeologist Jeff Williams and Shroud researcher John C. Iannone. Williams’ paper was originally published in 2011 in International Geology Review and can be found on Academia.edu at this link: https://www.academia.edu/6108262/Quake Article. Iannone’s paper is at: http://www.shroud.com/pdfs/iannoneearthquake.pdf..","date":"2015-04-21","mins":"3:53 pm","url":"https://shroudstory.com/2015/04/21/retracted-papers/","cat":"article","title":"Retracted Papers"},{"id":"comment-101734","author":"barrie_schwortz","post":"Actually, there were 3 or 4 Catholics, 3 Jews, 1 Mormon, 1 Evangelical, some Protestants of various denominations in addition to some agnostics (and perhaps even some atheists). Since declaring one’s religious affiliation was never a prerequisite for membership in the STURP team, we don’t have an accurate list. Members were asked to join the team based solely on their scientific or technical skills and what they could contribute to the scientific examination of the Shroud..","date":"2014-04-20","mins":"3:36 pm","url":"https://shroudstory.com/2014/04/20/wayne-phillips-hopes-to-create-a-small-shroud-army/","cat":"press_coverage","title":"Wayne Phillips:  Hopes to create a small “Shroud Army”"},{"id":"comment-190957","author":"barrie_schwortz","post":"The sole purpose of the tests performed by STURP was to determine the image formation mechanism of the Shroud. It was NEVER to prove it was “authentic” or even that it wrapped the body of Jesus. Had that been the case, many of the team members would not have participated. Any such comments made by individual team members after the fact do not necessarily represent the consensus of the STURP team..","date":"2015-02-13","mins":"3:52 pm","url":"https://shroudstory.com/2015/02/13/two-more-articles-about-upcoming-cnn-series-on-finding-jesus/","cat":"press_coverage","title":"Two More Articles About Upcoming CNN Series on Finding Jesus"},{"id":"comment-49360","author":"barrie_schwortz","post":"Here is the link to our August 31, 2013 announcement of the English language edition of the book: http://www.shroud.com/latebrak.htm#booklist3.","date":"2013-10-31","mins":"4:08 pm","url":"https://shroudstory.com/2013/10/31/new-book-about-christs-relics-from-ignatius-press/","cat":"books","title":"New Book About Christ’s Relics from Ignatius Press"},{"id":"comment-206974","author":"barrie_schwortz","post":"The least common of all the senses!.","date":"2015-07-30","mins":"3:57 pm","url":"https://shroudstory.com/2015/07/29/barrie-schwortz-on-catholic-radion-indy/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Catholic Radio Indy"},{"id":"comment-94668","author":"barrie_schwortz","post":"I never said that Frei’s work was worthless. I only stated that his claims were not backed up by peer reviewed science or published in any credible journals, making them anecdotal at best. This was not an attack on Frei but simply a statement of fact. It has NOTHING to do with whether or not he was a member of STURP. Sadly, it was Frei’s own actions, both during and after the 1978 examination, that led to doubts about his methods and conclusions. As an example, for many years those of us who lectured on the Shroud used a 35mm slide in our presentations that Frei himself had provided to us, claiming it was a scanning electron microscope image of a pollen he found on the Shroud. It wasn’t until several years later that we found out it was in fact a reference slide and not a pollen from the Shroud at all. It was then that many of us stopped discussing the pollen issue publicly and removed it from our presentations. I believed then as I do now, that there is plenty of other credible empirical evidence for the Shroud’s authenticity within the published scientific literature and we should not have to resort to unsupported anecdotal evidence to make our points. It is easy to accept and defend information that supports our personal beliefs whether it is credible or not, and ALL of us are susceptible to such errors in judgement. Unfortunately, this happens all too frequently in the Shroud world and has the negative side effect of making all Shroud science seem suspect while giving plenty of ammunition to the skeptics out there to attack us. Sorry you were offended O.K. But the truth is the truth (not arrogance). Remember, it was my responsibility to observe and document these events as they occurred..","date":"2014-03-29","mins":"5:51 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show"},{"id":"comment-94375","author":"barrie_schwortz","post":"The VP 8 was purchased by William Mottern of Sandia Laboratories from Interpretation Systems to use in the examination of the x rays they were making at the lab. Bill felt it was another way to extract image data from nearly monochromatic x rays. He originally saw the VP 8 advertised in a trade journal and bought one. Shortly after the Shroud image was placed into Bill’s VP 8, Jackson and Jumper purchased one for STURP’s use and the man who came to install it was Pete Schumacher, founder of the New Mexico Shroud Museum in Alamogordo. Two of our team members were from the Jet Propulsion Laboratory and were directly involved in the space program. Don Lynn was in charge of imaging on the Voyager, Viking, Mariner and Galileo projects. At some point in time, some journalist out there wrote erroneously that the VP 8 was used in the space program and it seems to have stuck and become part of Shroud “mythology.” JPL had far more sophisticated technology than the VP 8. As for Frei, his work can only be considered anecdotal at best and is not supported by any peer reviewed science. There is a lot more I could say about this, but this post is already longer than I like, so we’ll just leave it there for now..","date":"2014-03-28","mins":"7:59 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show"},{"id":"comment-94697","author":"barrie_schwortz","post":"My single biggest objection to the 2002 restoration was the fact that NO scientists were involved. It didn’t matter one bit whether they were American, Italian, French or otherwise (and there were plenty of good ones available in Italy). Is no one else concerned that for 12 years a completely untested piece of cloth has been fastened to the back of the Shroud? Let’s not turn this into an issue of nationalism. It is not about that!.","date":"2014-03-29","mins":"6:51 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show"},{"id":"comment-94682","author":"barrie_schwortz","post":"Rogers did not own the journal. He was simply one of its founding members but retired from any involvement with it years before he submitted his paper to it for publication. The editors spent 5 months (much longer than normal) reviewing Rogers’ paper and asking for changes and corrections before accepting it for publication..","date":"2014-03-29","mins":"6:23 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show"},{"id":"comment-94728","author":"barrie_schwortz","post":"Perhaps the Polish translation of the interviews I gave Gorny in English are incorrect. I never said the image had faded. I said that the lighter cloth behind the Shroud lowered the APPARENT CONTRAST of the image. That is completely different and something that professional photographers know about. Did you see the Shroud in 2010? Have you compared the Durante post restoration images with those of Vern Miller or myself? The evidence speaks for itself. It sounds like I am going to have to carefully examine the English version of the book to make sure it is accurate before it is released to the public. Thanks for the heads up O.K..","date":"2014-03-29","mins":"8:03 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show"},{"id":"comment-32898","author":"barrie_schwortz","post":"Correct. I do mention it now when I lecture, b ut I did not have that information in 1995 when I spoke with Adler. In the speech I was simply relaying the story as it occurred chronologically. Thanks for the kind words too!.","date":"2013-05-04","mins":"3:46 pm","url":"https://shroudstory.com/2013/05/03/barrie-schwortz-tedx-via-della-conciliazione-talk/","cat":"science","title":"Barrie Schwortz’ TEDx Via della Conciliazione Talk"}]
