[{"title":"1999 Interview with Isabel Piczek","post":"Thank you Dan for publishing this very interesting and educating video. \nNicely explained with Four points why Shroud is not a painting.\n“Shroud is actually not a painting”, “it so mysterious ” and “the blue print of the future”.\n\n","date":"July 26, 2015 at 3:32 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206578","author":"Sampath Fernando","site":"shroudstory"},{"title":"1999 Interview with Isabel Piczek","post":"I have found these last two Shroud Report videos Dan has put up absolutely fascinating, in that they illustrate very nicely how the ‘big guns’ of 20th century Shroud research were able to put their points of view, more or less unchallenged at the time and then, by sheer weight of ‘authority’ have remained more or less the foundations of authenticist belief ever since.\nRegardless of her undisputed eminence as a monumental muralist, Dame Isobel’s views cannot go unquestioned.\n1) Her three main objections to the Shroud as a painting are that there is no carrying medium, no light source, and no outline. Anybody, artist or not, with a finger dabbed in powder paint, can produce an image with no medium, no light source and no outline in a very short time, especially if they are thinking of producing something resembling a contact print of a cloth laid on a body. The fact that my version looks nothing like the Shroud is nothing to do with the technique, but simply with my ability to visualise and represent the figure I’m attempting to image. Dame Isobel goes on to announce that there is absolutely no ’emulsion’ on the Shroud. She may well be correct. This is presumably derived from the STuRP findings that the image is entirely due to degradation of the fibres, and is, of course, in direct contradiction of Rogers’s thin layer of impurities.\n2) Next, she lists in detail the knowledge and skills an artist must have mastered “inside and out” in order to produce a good image: anatomy, perspective, foreshortening, paint chemistry, mathematics and geometry. However, unless she had a phenomenal childhood, this simply isn’t true, as her own remarkable work at the age of 14 illustrates very well. The skills of observation, imagination and reproduction are paramount, and although they can no doubt be studied and mastered, any number of child prodigies demonstrate that they may be acquired almost innately.\n3) From the foregoing list, Dame Isobel particularly concentrates on foreshortening, and makes the remarkable statement that the Shroud shows ‘strong’ foreshortening. I suppose the veracity of this depends on one’s definition of ‘strong’. To me, Mantegna’s “Lamentation Over The Dead Christ” and Dali’s “Christ of St John of the Cross” show strong foreshortening. The Shroud’s foreshortening, if any, is very weak compared to those, and could be produced entirely by observation, not by mathematical knowledge. Furthermore, the whole concept of foreshortening depends on angles between an object and an observer. If there is any foreshortening at all, this is evidence in favour of an artist, not against one.\n4) Then we move on to the catacombs, and Dame Isobel’s assertion that the portraits of Christ with a beard that we find in them must derive from personal knowledge of what he looked looked like. However her statement that some of the paintings derive from the 1st century is highly questionable, and she conveniently forgets that most of the paintings show Christ entirely differently. I agree with her that even if the Shroud is authentic, early portraits in Rome cannot derive from it, but her idea that any of them can be assumed to reflect personal knowledge of Jesus is unjustified.\n5) A couple of Dame Piczek’s later illustrations are not clear to me. An image said to be made of very diluted iron oxide with minimal binder actually looks like a piece of stained glass, with the lead borders clearly visible, and a variety of different colours, none of which looks like iron oxide. Is this in fact the correct illustration? \n6) Now this I don’t understand at all. “It is always the paint particles which are inside [the] agglomerate, and the outside is the paint emulsion, while McCrone for instance claimed that he found inside of paint particles some kind of gooey yellow material.” Even Russ tails away in his attempt to make any sense of it. “What you’re saying here is that […] if it was paint you would have the actual pigment particles surrounded by the emulsion […] and not the opposite, and … and … OK, so …” Even he can see that this makes no sense, and is not, of course, what McCrone claimed.\n7) Then we have the extraordinary idea that early descriptions of artistic methods, such as those of Cennini (and Pliny, interestingly), cannot be relied upon as accurate guides as their language is too archaic to be understood. Actually I don’t think that Cennini has a lot to say about a specific technique which might produce the Shroud, although I’m sure Charles Freeman would disagree, but the implication is that, if a modern artist were to produce a good replica of the Shroud using a technique described by a 13th or 14th century writer, it would not be valid as he would probably have misinterpreted the writer. That’s special pleading of quite a high order in my opinion. Incidentally, McCrone’s single mention of Cennini in ‘Judgement Day for the Shroud of Turin’ is as follows: “Both red pigments (red ochre and vermillion), the paint medium (collagen tempera), and faint monochrome images were popular with artists during the Middle Ages (Cennini 1437, Eastlake 1847).” Dame Isobel’s arbitrary dismissal of McCrone and others: “They don’t even understand what Cennini and Eastland were referring to” is mere snobbery. Eastland wrote in English but mostly gives his sources in their original, so that his translations can be confirmed if necessary.\n8) Dame Isobel’s next point is that monochrome paintings of the kind illustrated by McCrone, such as those of Simone Martini in the Palais des Papes in Avignon, were only ever preparatory sketches for frescoes which would normally be laid over the top. In this McCrone does seem to have conflated some of the various monochrome styles of painting, from different times and different countries, described by Eastlake, but the fact that such a style of painting occurred at all, means that it was available as a means of creating the Shroud image.\n\n","date":"July 26, 2015 at 8:47 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206593","author":"Hugh Farey","site":"shroudstory"},{"title":"1999 Interview with Isabel Piczek","post":"I’m enamored with Ms Piczek’s work, returning to her analysis suggesting the image was ejected onto the shroud as a quantum hologram during the time of explosion of the event horizons, pointing out the lack of entropy, gravity and negative image.\nThanks for posting this video Dan, I haven’t seen it.\n\n","date":"July 26, 2015 at 1:04 pm","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206607","author":"jenx","site":"shroudstory"},{"title":"1999 Interview with Isabel Piczek","post":"And Stephen Hawking should not lecture us about art.\n\n","date":"July 26, 2015 at 2:31 pm","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206612","author":"Paulette","site":"shroudstory"},{"title":"1999 Interview with Isabel Piczek","post":"I challenge Hugh to identify any single work of art, not a photograph, but whether monochrome or not, whether on linen or not, that has been successful in persuading reputable and experienced forensic pathologists, that the subject was actually a real person, alive or not, and not actually a product of a mere artist’s skill.  \nBecause that is what he seems to be implying in his demolition of Isobel Piczek’s assessment.  It may be that several of the points that he makes might well be valid.  But that does not mean that Ms Piczek is fundamentally wrong in her assessment that the Shroud is not a painting.  \nIt may be true that some pathologists are not entirely persuaded that the Shroud image is in fact that of a real corpse.  But the fact remains that a succession of several highly reputable and experienced pathologists have been convinced that it is so in fact, and have written comprehensively on their analyses of the same.   \nWhere is this other image, Hugh, that has also fooled such pathologists?  There is none!\n\n","date":"July 26, 2015 at 4:30 pm","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206615","author":"daveb of wellington nz","site":"shroudstory"},{"title":"1999 Interview with Isabel Piczek","post":"Thank you Daveb, my fellow engineer. \nMr. Farey has to prove that Shroud is a painting. I am 100% gurantee that Mr. Farey never prove that Shroud is a painting.\n\n","date":"July 26, 2015 at 6:04 pm","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206619","author":"Sampath Fernando","site":"shroudstory"},{"title":"1999 Interview with Isabel Piczek","post":"What nonsense. We’ve been here before, many times; the old “if you can’t prove it was done your way then it musty have been done my way” argument. No I don’t have to do anything of the sort. If there is something wrong with what I said about the video, please point it out. It may be that Dame Isobel is entirely correct that the Shroud is not a painting – when have I ever said it couldn’t be? – it’s just that none of her arguments demonstrate that it can’t be.\n\n","date":"July 26, 2015 at 7:08 pm","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206622","author":"Hugh Farey","site":"shroudstory"},{"title":"1999 Interview with Isabel Piczek","post":"Your straw-man “if you can’t prove it was done your way then it must have been done my way” is what is nonsense, as I never proposed any kind of alternative method at all.  \n1) You postulated a finger dipped in powder paint – Do you imagine that the resulting image would fool any pathologist? 2) You object to the lady’s assertion that there is no sign of any emulsion, on the specious grounds that it is counter to Roger’s unproven claim that the image resides on a coating, Suggest you check with Colin Berry on that one, or perhaps Adler, or perhaps Paolo di Lazzaro;  3) Of the various skills an artist would require, you include anatomy, and then boldly imply that a child prodigy could reproduce the same; 4) Why anyone who is aware of McCrone’s shortcomings in his Shroud work would even bother including him as any kind of reliable reference escapes me; I wouldn’t see Dame Isobel’s dismissal of McCrone so much as snobbery, but more a fair assessment about which there is some consensus (e.g. about 30 other fellow STURP colleagues of McCrone);   5)  Such aspects as light direction and light source, together with brush strokes, are the sort of standard features that graphics specialists look for when assessing a painting, and their absence in the case of the Shroud quickly persuaded Barrie Schwortz that it was no such thing.  \nSo, come on Hugh, where is this other image that would confuse the pathologists?  Or as Sampath has noted below, do you still imagine that the Shroud is a painting despite the absence of any other such example?\n\n","date":"July 26, 2015 at 8:46 pm","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206626","author":"daveb of wellington nz","site":"shroudstory"},{"title":"1999 Interview with Isabel Piczek","post":"On July 21, 2015 at 4:27 am – Mr. Farey wrote that he is agreeing with Mr. Freeman that Shroud is a painting and it was created for a liturgical purpose\n\n","date":"July 26, 2015 at 7:22 pm","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206623","author":"Sampath Fernando","site":"shroudstory"},{"title":"1999 Interview with Isabel Piczek","post":"I don’t recall Hugh every claiming the Shroud was a painting, but he has mused that it was artisan created as an altar cloth, or other such liturgical item. Hugh is the one person here who avoids making a declaration on what created the icon’s image. His mantra, which I appreciate, is “I don’t know for sure but I’ll look at all angles until I do.”\n\n","date":"July 26, 2015 at 9:32 pm","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206628","author":"David Goulet","site":"shroudstory"},{"title":"1999 Interview with Isabel Piczek","post":"OK I suppose for a scientist.  Other professionals have to make on time decisions!\n\n","date":"July 27, 2015 at 2:00 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206643","author":"daveb of wellington nz","site":"shroudstory"},{"title":"1999 Interview with Isabel Piczek","post":"Sampath is correct, and David Goulet is being too generous: \nPosting – A Rare Piece of Cloth, Jul 21, 2015 \nJul 21, 3:31 am\nHF:  ” … As a 14th century artefact, the Shroud was manufactured towards the end of the great Byzantine relics craze, … chances of an adventitious painter persuading the Dean of Lirey to try to pass off a quick monochrome brass-rubbing as holy relic are, I suspect, small, … more likely that it was made for a liturgical purpose, almost certainly connected with Easter, and acquired its relic status fortuitously. … ”\nJul 21, 4:11 am\nPHPL:  “Thanks for your comments Hugh. Can we therefore say that you agree with Charles Freeman ? ” \nJul 21, 4:27 am\nHF:  “In principle yes, although there are a number of points about which we disagree, (etc) ”\nNeed we say more?\n\n","date":"July 27, 2015 at 2:21 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206644","author":"daveb of wellington nz","site":"shroudstory"},{"title":"1999 Interview with Isabel Piczek","post":"I am not saying that the Shroud IS a painting but that it WAS a painting which disintegrated with time as most painted medieval linens did. If you look at the lithograph of 1868 that Beldon Scott reproduces you can see that one figure has lost its paint from the shoulders down while the rest is still intact. By 1898 the disintegration of the painted images seems to have been complete.\nMcCrone found some remnants of the pigments, STURP found the remans of the calcium carbonate that made up the gesso, so far so good, but things may have deteriorated still further since then and even a modern scanner, miles ahead of anything in 1978, ,might not be able to pick anything up. I hope we see one day.\nIf you follow Cennini’s instructions on how to apply gesso to the outer fibrils of a linen and then paint on top when it is dry, you don’t have to use laser beams because you only have to wait five hundred years and the linen under the gesso and paint will become discoloured – as it is discoloured through the gesso and paint ,it will vary according to the thickness of the original pigment and will only be on the very top of the underlying cloth as found by STURP and the 1976 Commission. The central panels of the Zittau Lenten Veil show very similar images to those on the Shroud . Here the pigments were steamed off in the Second World War.\nThe two figures on the Shroud are not of the same body- the arms at the back could not possibly be the same arms of the front as you would have to hunch up the shoulders at the back ( which they are not) to cross the arms at the front.\nThe artist must have believed that there was a sacred element to the Image of Edessa/ Veil of Veronica face off Christ as he reproduced it on the Shroud without adapting the hair to show it falling down. So you have the odd effect of the head of a man standing attached to the figure of Christ lying down.\n\n","date":"July 28, 2015 at 6:13 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206744","author":"Charles Freeman","site":"shroudstory"},{"title":"1999 Interview with Isabel Piczek","post":"” What does a policeman do when he finds a corpse? He sends it to a pathologist! We only had one choice: asking the experts!\nIndeed not we alone, but all physicians and pathologists consulted by us and the international media were deceived: Prof. Cyril Wecht, Former President of the US Academy for Forensic Sciences, Home Office Pathologist Prof. Christopher Milroy of the University of Sheffield; Prof. Mihatsch, University of Basle/Switzerland; Prof. Dr. Carsten Nygren, Oslo; Prof. Dr. Pierluigi Baima Bollone, University of Turin; Prof. Jean Pierre, University of Paris, as well as a dozen pathologists shown the film by my colleague Luc Bürgin, a whole auditorium of Mexican physicians and professors of the University of Cluj/Romania, to which I showed the film, all believed the film showed a real corpse, not a dummy. The German dermatologist Dr. T. Jansen even wrote an article for the “Munich Medical Weekly”, claiming that the film shows a (human) girl suffering from Progeria. More than one critic claimed that Santilli exploited the corpse of a girl deceased from a genetic disorder out of sheer greed. ). If I am guilty of anything, than it is trusting in leading representatives of the medical profession. But who was more competent to judge an alien autopsy than a professional forensic pathologist?”\nFrom ‘Statement by Michael Hesemann, author of “Beyond Roswell”.’ (http://www.outtahear.com/beyond_updates/Alien%20Autopsy%20Proved%20Fake/STATEMENT%20BY%20MICHAEL%20HESEMANN.htm)\nDaveb’s reliance on various pathologists convictions that the photos they were looking at were of real people is not unreasonable, any more than those UFOlogists who concluded that the Roswell autopsy was genuine on the basis of professional forensic pathologistical concurrence. However, I do not think that any of the Shroud researchers would have said, if asked, that it could not possibly be a painting. What they all said was that it was sufficiently accurate to represent a real body. In his ‘Autopsy Report’ for example, Dr Robert Bucklin does not discuss the possibility that it might not be at all. We have already discussed at some length that Dr Fred Zugibe thought that Dr Pierre Barbet’s anatomy was seriously deficient, and mentioned that Dr Norman Lee thought that the evidence clearly showed that the man had been buried alive, or that Dr Michael Baden didn’t think that the Shroud could have covered a real body. None of these people, except possibly Baden, were particularly concerned about whether the images they were shown could have been artificially made, but prepared to treat the image from the start as if it were genuine, and work from there. Anatomical deficiencies, which many of them noticed, were not therefore considered as evidence of artificiality, but were carefully explained from a forensic viewpoint, so the arms were dislocated, or the man was angled this way or that because of rigor mortis, or he was laid on a pillow of some kind, or he had Marfan’s syndrome. Curiously, the few forensic pathologists who have examined the shroud in intimate detail, Drs Eugenia Rizzati, Emilio Mari and Giovanni Judica-Cordiglia, do not appear to have considered the anatomy of the image at all.\nI do not want to get into a “my pathologist is better than your pathologist” squabble, and i agree with daveb that in general they treat the Shroud as if it was a photograph of a dead body, but I do not think that that means that it could not be an artifact.\nAs for the rest of the comment above, daveb treats my remarks as if they were replies to quite different questions, rather than comments on Dame Isobel Piczek’s video. She does not mention pathologists at all. She does say that it is impossible to produce a portrait without binder, light direction or outline, and she is wrong. She does say that there is no covering on the Shroud, which conflicts with Rogers’s impurity layer. She does say that no such painting could be produced without mastery of a number of disciplines, all of which she appears to have managed herself by the age of 14. She does say that the Shroud shows ‘strong’ foreshortening, when it doesn’t, and so on.\nAll this challenging to do this or that like a game show is contrary to any kind of objective study. Do I prove that the Shroud is a fake because nobody can produce a similar one made by a dead body? Does the uniqueness of an artefact prove a supernatural origin? Of course not.\nAs for what I claim or do not claim, well, for a start it hardly matters, but for what it’s worth, I am currently swayed towards some kind of artificial creation, more probably by imprinting than the use of a paintbrush specifically, and inclined to the view that much of the original material has been deliberately removed, leaving degraded fibres, not unlike the manner described by Guarlaschelli. If this sounds like fanatical anti-authenticity then I’d love to hear a description of Joe Nickell’s views.\n\n","date":"July 27, 2015 at 4:53 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206651","author":"Hugh Farey","site":"shroudstory"},{"title":"1999 Interview with Isabel Piczek","post":"“BOTH arch-miraculists and arch-fraudulists have eyes, but they don’t really see”\n\n","date":"July 27, 2015 at 5:49 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206656","author":"Max patrick Hamon","site":"shroudstory"},{"title":"1999 Interview with Isabel Piczek","post":"I think it is the arch-anti-archers who really don’t see. \n\n","date":"July 27, 2015 at 6:07 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206658","author":"Dan","site":"shroudstory"},{"title":"1999 Interview with Isabel Piczek","post":"Oh really? I’ll show how you can mistake fascinating pieces of evidence for just crazy stuff (e.g. re the two coins placed on the the TS man’ eyes).\n\n","date":"July 27, 2015 at 6:25 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206661","author":"Max patrick Hamon","site":"shroudstory"},{"title":"1999 Interview with Isabel Piczek","post":"Too bad for the archaeological and scientific truth the Shroud literature mostly if not solely turns around the (arch-)fraudulists’ and (arch-)miraculists’ totally biased opinions.\n\n","date":"July 27, 2015 at 7:09 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206666","author":"Max patrick Hamon","site":"shroudstory"},{"title":"1999 Interview with Isabel Piczek","post":"This post was posted on this website on  November 11, 2011\n=============\nPaper Chase: The Findings of Robert Bucklin\nNovember 11, 2011\nDan\n.\nDr. Robert Bucklin M.D, was a former Professor of Pathology and Forensic Pathologist in Los Angeles, and member of STURP (The Shroud of Turin Research Project.) He personally conducted over 25,000 autopsies in his capacity as a Forensic Pathologist, to determine the Identity and exact cause of death of the “Man on the Shroud.”\nHe conducted an autopsy on the Shroud of Turin for STURP, and described the wounds of “The Man on the Shroud” in minute detail. His full findings may be read on http://shroud.com/bucklin.htm He positively identified the Man on the Shroud as Jesus Christ, and Crucifixion as the means of execution.\nA summary of Dr Robert Bucklin’s research on the Body of the Man on the Shroud is as follows: \n———————————————-\n1. The body was approximately 5ft 11inches tall.\n2. The body weighed approximately 175 pounds.\n3. The body was anatomically well developed and normal.\n4. The body had stiffened in Rigor Mortis.\n5. The body had long hair, and a short beard.\n6. The body had multiple puncture wounds over the entire scull area.\n7. The body had an abrasion at the tip of the nose.\n8. The right cheek was distinctly swollen.\n9. Rounded foreign objects can be seen over the right and left eyes.\n10. There is a large blood stain over the right chest area, consistent with the post mortem wound to the chest.\n11. There is a penetrating skin wound in the right chest wall produced by a sharp puncturing instrument.\n12. The blood flows from the injuries in the wrist indicate that the victim died with his hands raised about 65 degrees from the horizontal.\n13. The body had been nailed through both wrists.\n14. Only four fingers are visible of both hands, suggesting injury to the Median nerve of both wrists.\n15. The body had been nailed through both feet.\n16. The left foot had been flexed over the right foot before nailing.\n17. There are a series of traumatic injuries which extend from the shoulder areas to the lower portion of the back, and down to the backs of the calves. These images are dumbbell-shaped imprints, applied possibly by a whip.\n18. There is abrasion and denuding of the skin over the right and left shoulder blade area consistent with a heavy object, like a beam resting over the shoulders.\n19. The whip injuries occurred earlier than the other injuries.\n20. Had been scourged with His hands above His heads, by two separate soldiers.\n21. The victim was executed in an upright position with His arms extended upwards.\n22. A Crucifixion type posture would be the most plausible explanation for these findings.\n23.The wound in the right side released a watery type fluid from the body cavities as well as blood from the heart area.\n24. The Man on the Shroud died of postural asphyxia as the result of His position during the Crucifixion.\n25. There is also evidence of severe blood loss from the skin wounds, as well as fluid accumulation in the chest cavities related to terminal cardio-respiratory failure.\n26. In the case of Man on the Shroud, the forensic pathologist will have information relative to the circumstances of death by Crucifixion which he can support by his anatomical findings.\n27. The forensic pathologist will be aware that the Individual Whose Image is depicted on the cloth has undergone:\n– Puncture injuries to His wrists and feet\n– Puncture injuries to His head\n– Multiple traumatic whip-like injuries to His back\n– Post mortem puncture injury to His chest area which has released both blood and a water type of fluid.\nDr Robert Bucklin concluded, “From this data it is not an unreasonable conclusion for the forensic pathologist to determine that only One Person in history has undergone this sequence of events. That Person is Jesus Christ.”\n===================================\n3.   “The body was anatomically well developed and normal”\n        False. No ears, no navels, right arm is  too long, right hand is too long, forehead is too     small,  et cetera.\n13. “The body had been nailed through both wrists.” \n       False. We can see only one wrist.\n15. “The body had been nailed through both feet.”\n       False. We don’t even see the feet.\n16.  “The left foot had been flexed over the right foot before nailing.”\n        False. We don’t even see the feet.\n 20  “Had been scourged with His hands above His heads, by two separate soldiers.”\n         Did Bucklin view the scene ? A shame for a scientist to write things like that.\n\n","date":"July 27, 2015 at 5:56 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206657","author":"PHPL","site":"shroudstory"},{"title":"1999 Interview with Isabel Piczek","post":"As far as I’m aware, PHPL is not a forensic pathologist, and it is not apparent that he is competent to comment on a professional report by a pathologist. \nRe 3:  We are looking at some kind of imperfect imprinted image, presumably dating from before the 14th century when the skills of creating such images are ambiguous.  Ears are not visible because they’re covered by the subject’s hair.  Several explanations are available for any apparent geometrical distortions of anatomy, including the relative dispositions of cloth and body, injuries during the execution, possibly natural deformities, and the unknown nature and imperfections of the imaging process. \nRe 13:  There is a mark visible on one wrist consistent with nailing, with blood flows along the arm consistent with this trauma, and similar flows on the other arm.  It is therefore a reasonable forensic conclusion that both wrists were nailed. \nRe 15 & 16:  On both the Durante and Enrie images, the soles of both feet are clearly visible on the dorsal images.  On the ventral image, there is an indistinct image of the instep of the right foot, the left instep is not clearly visible.  This appears to be due to bridging of the cloth by the natural angle of the feet.  Such images as are visible are sufficient to draw a forensic conclusion. \nRe 20:  There are no scourge marks visible on the arms, and it is therefore a reasonable supposition that the reason would have to be that, in accordance with best scourging practice, the prisoner was maintained in an upright position by near suspension with arms secured above his head.  If the prisoner happened to faint during this process, the punishment might continue without interruption.\n\n","date":"July 27, 2015 at 6:54 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206665","author":"daveb of wellington nz","site":"shroudstory"},{"title":"1999 Interview with Isabel Piczek","post":"daveb of wellington nz  has commented at length on the C14 Shroud test to criticize it,  I guess that he is a C14 expert. Having said that, there is sometimes no need to be an expert to criticize an expert’s report. We have a good example with the fake Hitler diaries short-lived saga for example.\nConcerning the replies to my comments, (that  I won’t reply to because there is no need to) they are typical of what to expect from shroudies. The reasonable conclusion ( to use a well-worn expression ) of all this is that just as Bucklin he is  heavily biased towards authenticity. I nevertheless appreciate that he writes “presumably dating before the 14th century”. A revealing sentence.\n\n","date":"July 27, 2015 at 8:03 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206668","author":"PHPL","site":"shroudstory"},{"title":"1999 Interview with Isabel Piczek","post":"PHPL, do you think the image is “presumably” that of a crucifixion victim AFTER or OF the 14th c. CE?\n\n","date":"July 27, 2015 at 9:00 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206670","author":"Max patrick Hamon","site":"shroudstory"},{"title":"1999 Interview with Isabel Piczek","post":"I am not a C-14 expert and recall no time that I have ever commented on the specific technology involved.  It so happens that in my time I have certainly been a more than competent expert on questions of probability, applied statistics, and sampling systems.  These have included several in-house reports for my employer at the time, a major NZ Corporate.  These have included several analyses of accident statistics, applications involving major expenditures on projects with uncertain outcomes, and the design of sampling systems for the Corporate Audit division.  My several comments on the 1988 C-14 TS project have addressed the inadequacy of the sampling procedures, and were within my specific competence. \nI have also had some 10 years experience closely associated with the Audit Division, and came to understand the evidential procedures required of audit forensics, which are not dissimilar to the evidential requirements of the forensic processes in pathology, fundamentally based on issues of probability and likelihood as distinct from the rigour demanded in scientific research or criminal prosecution.   \nPHPL falsely asserted that images of the feet could not be seen.  I have demonstrated that there are in fact images of the feet adequate for a forensic conclusion.  But PHPL chooses to close his eyes to this plain fact.\n\n","date":"July 27, 2015 at 3:22 pm","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206696","author":"daveb of wellington nz","site":"shroudstory"},{"title":"1999 Interview with Isabel Piczek","post":"Daveb, I couldn’t have said it better myself. Most curiously, PHPL didn’t critize 9 (“Rounded foreign objects can be seen over the right and left eyes”) that was Bucklin’s weakest point (for lack of better 3D images). Actually on Tumbarelli’s 3D reconstruction of the TS face,  rounded or somewhat rounded solid foreign objects appear to have been recorded on the right eye, astraddle the left lower eyelid and zygomatic arch, in the middle and on the outer corner of the left eyebrow arch.\n\n","date":"July 27, 2015 at 7:49 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206667","author":"Max patrick Hamon","site":"shroudstory"},{"title":"1999 Interview with Isabel Piczek","post":"I wrote this some time ago: \n“The Shroud is not a “medieval artwork” in the usual sense of a portrait or a pictorial scene. The Shroud is the image of the trace of a corpse on a sheet as imagined by a medieval artist”.\nSo you cannot ask for other medieval images that had deceived some pathologists. “I challenge Hugh to identify any single work of art, not a photograph, but whether monochrome or not, whether on linen or not, that has been successful in persuading reputable and experienced forensic pathologists, that the subject was actually a real person, alive or not, and not actually a product of a mere artist’s skill”.\nThis is a wrong question. First of all because the usual medieval images (we are speaking of the Gothic period, are we not?) is not made to simulate the imprinting of a corpse on a sheet. This is the main purpose of the author or the Shroud and it is not the same of crucifixions, descents from the Cross and entombments of the epoch. Secondly, and derivated from the first point, there is not any believers’ group oriented to show that Mantegna’s, Martini´s or Giotto’s works are real imprints of a corpse. Obviously, they are not.\nAnd I had also written: \n“I be grateful if someone explains me what are the stylistic features of the Shroud that  do not correspond to the Gothic style. We can say the schools of Firenze or Siena, for example. Or the Franc-Flemish style, if you like”.\nThat is to say, even with different purposes, the image of the Shroud and the pictures of the last Gothic period have some similarities. Stretched features (specially the fingers and the nose), short blonde hair, swollen belly, broad pectorals, etc., are some striking similarities and I am sure that an expert on Gothic art (Wesselow not, of course), will find some others. And I have already shown on another occasion that Gothic artists had a good anatomical knowledge similar to the image of the Shroud, if not better. \nNOTE: I say that not Wesselow because he makes the same mistake as usual between sindonists: he denies that the Shroud is a work of art. I agree. But this is not the question!\n\n","date":"July 28, 2015 at 1:58 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206722","author":"David Mo","site":"shroudstory"},{"title":"1999 Interview with Isabel Piczek","post":"Sculptors like Pisano were masters of their age. To assume that the shroud was created off a sculpture or bas relief is to assume a work at least the equal and probably greater than Pisano  in a French regional location. With no evidence of equivalent works.\n\n","date":"July 28, 2015 at 3:29 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206725","author":"Thomas","site":"shroudstory"},{"title":"1999 Interview with Isabel Piczek","post":"‘Stretched features’? I’m 187cm tall and I’ve measured some of my limb dimensions – eg. fingers, hands – and they aren’t dissimilar to what is seen on the Shroud Man. I would describe my hand / fingers sizes as just slightly longer than average for a man of my height.\nShort blonde hair? – I think the Shroud Man’s hair colour is indeterminate and length seems mid length\nSwollen belly – that seems an overstatement\n\n","date":"July 28, 2015 at 4:06 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206731","author":"Thomas","site":"shroudstory"},{"title":"1999 Interview with Isabel Piczek","post":"BTW I’m neither a “fraudulist” (the TS image is a fake or a “make-believe”) nor a “miraculist” (the TS image is supernatural) or a “naturalist” (the TS image results from a real corpse first left about 36 hours at “cave tomb”/room temperature) or even a “survivalist” (the TS image is that of a man that has survived crucifixion) but a “halakhist” ( > Halakha = the collective body of Jewish religious laws derived from the Written and Oral Torah) that is my opinion as a professional cryptologist is the TS image formed on burial as the Second Temple period buriers most likely subjected the tightly wrapped-up corpse to a (myrrhic?) aloetic fumigation to make up for the anointing procedure that could not be performed on that very day for lack of time for grinding the spices. My approach leaves open the door to a return to life first in flesh and bones, whether miraculous or not.\nIndeed it is too bad for the archaeological and scientific truth the Shroud literature mostly if not solely highlights the (arch-)fraudulists’ and (arch-)miraculists’ totally biased opinions.\n\n","date":"July 28, 2015 at 2:56 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206723","author":"Max patrick Hamon","site":"shroudstory"},{"title":"1999 Interview with Isabel Piczek","post":"typo: the anointing procedure that could not be performed on that very day for lack of time for grinding the spices and make spicy perfume oil.\n\n","date":"July 28, 2015 at 3:02 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206724","author":"Max patrick Hamon","site":"shroudstory"},{"title":"1999 Interview with Isabel Piczek","post":"To David Mo:\nOriginally speaking, if the TS image correspond ONLY to last Gothic period style, how then can he account for the TS image being epitaphios-like and the Hungarian Pray Ms illustration? Most obviously, the epitaphioi and HPM ink-&-pen drawing are not last Gothic period style at all as David Mo misleadingly wants us to believe. Methinks his alleged TS image “Art History” is very cheap history indeed. What does he make of  the Caroligian, Greco Byzantine, and Roman styles (the latter with Byzantine influences) as far as the TS image is concerned? NOTHING.\n\n","date":"July 28, 2015 at 3:30 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206726","author":"Max patrick Hamon","site":"shroudstory"},{"title":"1999 Interview with Isabel Piczek","post":"Typo: threnos-epitaphios-like\n\n","date":"July 28, 2015 at 3:31 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206727","author":"Max patrick Hamon","site":"shroudstory"},{"title":"1999 Interview with Isabel Piczek","post":"Max, see this, please: http://www.apostoliki-diakonia.gr/en_main/catehism/theologia_zoi/themata.asp?cat=hist&NF=1&main=texts&file=8.htm , http://www.ashgate.com/isbn/9781409420385 ,\nHere a byzantine Pantocrator by Simone Martini: http://i4.ytimg.com/vi/dqTf83EzeRE/hqdefault.jpg\n\n","date":"July 29, 2015 at 10:36 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206871","author":"David Mo","site":"shroudstory"},{"title":"1999 Interview with Isabel Piczek","post":"David, I do know these works of art (even de visu!).\nYour theory  (the TS image is “last Gothic period style”) is not proven but contradicted by links to which I could refer you to illustrate the TS image has Roman (HP Ms), Greek Byzantine (Threnoi-Epitaphioi) and even Carolingian (Stuggart Psalter) artistic versions too, which is in blatant contradiction with your most ventured opinion!\n\n","date":"July 29, 2015 at 11:38 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206877","author":"Max patrick Hamon","site":"shroudstory"},{"title":"1999 Interview with Isabel Piczek","post":"Contradicted? Why?\nThe links I have provided you show the influence of  byzantine art on the first Renaissance. No surprise if they have many points in common. What is the problem?\nThe illustrations of the Stuttgart Psalter are beautiful. So…?\n\n","date":"July 30, 2015 at 1:37 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206934","author":"David Mo","site":"shroudstory"},{"title":"1999 Interview with Isabel Piczek","post":"On another thread you wrote: “we cannot say if the hidden thumbs of the Shroud are a perfect copy of a human corpse or an artistic convention”. \nThe fact is we can say it is at worse a perfect copy of the TS man’s hands and NOT a “last Gothic period” artistic convention (see the Threnoi-Epipahioi and HPMs illustrations). \nBesides it does seem major Byzantine Art historians such as Ernst Kitzinger and Hans Belting do not share your most ventured (and should I say cheap) layman’s opinion the TS image is “last Gothic period art” at all!\n\n","date":"July 30, 2015 at 5:57 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206948","author":"Max patrick Hamon","site":"shroudstory"},{"title":"1999 Interview with Isabel Piczek","post":"“The illustrations of the Stuttgart Psalter are beautiful”.\nActually, several are missing, still ONE is tale telling  of the TS dorsal image (follow the dots. Coincidences make sense only for a few).\n\n","date":"July 30, 2015 at 6:01 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206949","author":"Max patrick Hamon","site":"shroudstory"},{"title":"1999 Interview with Isabel Piczek","post":"My comments don’t appear. What’s the problem?\n\n","date":"July 29, 2015 at 8:52 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206858","author":"David Mo","site":"shroudstory"},{"title":"1999 Interview with Isabel Piczek","post":"This one did. I see don’t see anything pending approval. .  \n\n","date":"July 29, 2015 at 10:21 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206865","author":"Dan","site":"shroudstory"},{"title":"1999 Interview with Isabel Piczek","post":"Thomas:\nPisano was not the only artist with anatomical knowledge at that time. There were in Europe other painters and sculptors and their disciples. Furthermore, Garlaschelli’s experiment shows that it is not difficult to make an acceptable copy of a human body. And Garlaschelli and his team were not artists. In any case, we are discussing the unfortunate statement of  I. Piczek that medieval artists weren’t able to make a correct anatomical image. This is a big mistake for an expert! And this is not the unique in Piczek’s statements.\nI think the claims about the perfection of the Shroud image are biased by the strong beliefs of the sindonist experts. I don’t think that a prudent pathologist would dare to present a conclusion based on a blurred picture as the Shroud in front of a court. To act in a video or a sindonist congress is another thing. Of course.\nMeasurements on the blurred Shroud image are a subjective matter. For exemple, the distance between the two images is 18 or 12 cm. depending authors. And Dr. Zugibe didn’t evaluate the appearance of the fingers as you do. The very long fingers (the index is as long as the middle finger!) are similar to some spiritual images of the  Madonna or the saints.\n\n","date":"July 29, 2015 at 10:32 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206867","author":"David Mo","site":"shroudstory"},{"title":"1999 Interview with Isabel Piczek","post":"Perfect now!\n\n","date":"July 29, 2015 at 10:33 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206868","author":"David Mo","site":"shroudstory"},{"title":"1999 Interview with Isabel Piczek","post":"See:  Pisanello1395-1455, Madonna With a Quail. (I canno include the link. It is easey to find)\n\n","date":"July 29, 2015 at 10:36 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","id":"comment-206870","author":"David Mo","site":"shroudstory"}]
