[{"title":"John Klotz’ new Quantum Christ Blog","post":"Quote : “By the way, I am not saying that image was created by a laser. I am saying that the image formation process acted similar to a laser.”\nComment :  2 Italian scientists named Fazio and Mandaglio wrote recently 3 very interesting papers about the image on the Shroud and they came to a completely different conclusion, saying that the stochastic (uneven) distribution of the colored fibers in the image area was absolutely not compatible with the effect of a laser, which would have caused an much more homogeneous distribution of colored fibers at the surface of the cloth.  For these 2 researchers, the stochastic distribution of the Shroud image is much more compatible with a very mild and natural process involving a low-temperature chemical process like Maillard reactions and/or thermal radiation released after death by the tortured and crucified corpse of the Shroud man.\nAnd concerning the important question asked by John, I think Mario Latendresse is one of the best person to answer that because he addressed that issue in his 2005 paper about the Shroud presented at the Dallas conference.  I think he favored the hypothesis that the process was not necessarily acting in a totally vertical way but more at the shortest distance between the corpse and the cloth, which could be at a different angle than 90 degree).  \nBut, being no expert, I will let him address that issue more precisely…  One thing’s for sure :  I don’t think that, in the present state of our knowledge, someone can be completely sure about that.\n\n","date":"April 21, 2013 at 6:07 pm","url":"https://shroudstory.com/2013/04/21/john-klotz-new-quantum-christ-blog/","cat":"image_theory","id":"comment-31493","author":"Yannick Clément","site":"shroudstory"},{"title":"John Klotz’ new Quantum Christ Blog","post":"If we consider the surface of the cloth at a microscopic scale, we see a heaving landscape of hills and valleys caused by the weave of the cloth, and perhaps even the layering of the fibres of each thread. Collimated rays of light (or other wavelengths) hitting the cloth at an angle would necessarily cause ‘shadows,’ which would extend behind the hills in the opposite direction to the incident rays. Rays perpendicular to the cloth wouldn’t create shadows. If an appropriate analysis of, say, Mark Evans’s photos were made, increasing the contrast between ‘image’ and ‘background,’ it would indeed be possible to determine whether the rays hit the cloth orthogonally or not.\nMuch of the discussion of this question comes from consideration of the lack of ‘sides’ to the image, and particularly the fact that there is no ‘Agamemnon mask’ appearance to the head, which must have occurred if the sheet were draped closely over the head. This has lead some people to suggest that whatever emanated from the body must have done so vertically, Others, suggesting that the sheet was roughly flat over the body, and held away from the sides either by bags of spices or by tension, are not in agreement whether the front of the face, in particular, shows distortion or not.\nIt seems logical to assume that some parts of the body were actually in contact with the cloth, and others were not. Where there was contact, there would not, of course, be any directionality, and one might guess that all parts in contact with the body would be similarly marked. It is interesting that the images of the forehead, nose and cheeks are not, in fact, equally dark – one of the reasons the 3D imagery is so successful. The mechanism for image forming nevertheless seems the same for both contact and non-contact areas. Colin Berry thinks this is peculiar, and attributes all the image to contact, but at different pressure in different places, and he may be correct. In this case, the ‘Agamemnon mask’ effect is eliminated by using a bas relief rather than a full-depth body. John Jackson recognises a similar problem, but achieves his affect by imagining the cloth sinking through different thicknesses of an image-making aether before coming to rest on the stone surface of the tomb.\nIf there is some non-contact image formed by rays of some kind, I suggest that a photomicrograph of the side of the nose would be a good place to look for ‘shadows.’\n\n","date":"April 21, 2013 at 6:48 pm","url":"https://shroudstory.com/2013/04/21/john-klotz-new-quantum-christ-blog/","cat":"image_theory","id":"comment-31495","author":"Hugh Farey","site":"shroudstory"},{"title":"John Klotz’ new Quantum Christ Blog","post":"Check Latendresse paper: “Evidence that the Shroud Was not Completely Flat During Image Formation” Dr. Mario Latendresse; Also separate reference for Slides: “The Turin Shroud Was Not Flattened Before the Images Formed and no Major Image Distortions Necessarily Occur from a Real Body”. The two files can be found at:\nhttp://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.160.656\nhttp://www.sindonology.org/papers/latendresse2005aSlides.pdf\n\n","date":"April 21, 2013 at 7:01 pm","url":"https://shroudstory.com/2013/04/21/john-klotz-new-quantum-christ-blog/","cat":"image_theory","id":"comment-31496","author":"daveb of wellington nz","site":"shroudstory"},{"title":"John Klotz’ new Quantum Christ Blog","post":"Hugh,\nThank you for your comment. I am not prepared to go much further into this at this time since I am dealing with the C-14 aspects and awaiting a copy of David Sox’s 1981 book. I already have his 1988 book. Sox played an interesting role in the C-14 process and instigated the C-14 labs to push STURP out (not that they needed much encouragement.) \nIn any event, I find Adler’s account interesting. I think I learned something. But when it comes to a “natural” explanation of the image on fall back to Heller: \n“We do know, however, that there are thousands upon thousands of pieces of funerary linen going back two millennia before Christ and another huge number of linens of Coptic Christian burials. On none of these is there any image of any kind. A few have some blood and stains on them, but no image.” Heller, Report on the Shroud of Turin\nI do not believe that any image explanation advanced thus far employing a “natural” process can account for the resolution of the Shroud. Almost all of them would result in diffusion of some kind and that would have prevented the finely detailed image. \nI will be returning to this issue. What I am “playing” with is this concept: If you apply Occam’s razor, you may discover that the simplest explanation is the Resurrection. To simply reject it, is perhaps what Richard Dawkins has dubbed “an Argument from Personal Incredulity:” Just because you can’t believe it doesn’t mean it isn’t so. Of course, he wouldn’t admit its application in this regard. See Dawkins, Richard (2008-01-16). The God Delusion (p. 155). Houghton Mifflin Harcourt. Kindle Edition.\n\n","date":"April 21, 2013 at 7:17 pm","url":"https://shroudstory.com/2013/04/21/john-klotz-new-quantum-christ-blog/","cat":"image_theory","id":"comment-31497","author":"John Klotz","site":"shroudstory"},{"title":"John Klotz’ new Quantum Christ Blog","post":"Occam’s razor is always a good thing to bear in mind, but we must beware of mistaking a simple word for a simple explanation. “Resurrection” may in fact be both scientifically and intellectually far more complicated than “Natural” or “Forgery,” for example. I think Dawkins rejects “Resurrection” because he sees it as a word rather than an explanation, and furthermore, a word often used as a shield from rational thought, like Mystery, Miracle and Magic. In recent years, he has begun, in conversation with theologians, to explore the concepts behind the early days of Christianity, and the rationality behind them, and, I think, begun to soften on the concept of Resurrection, if not on the physics of what was once described by a British bishop as the “conjuring trick with bones” than constituted the events that actually took place 2000 years ago.\n\n","date":"April 22, 2013 at 4:25 am","url":"https://shroudstory.com/2013/04/21/john-klotz-new-quantum-christ-blog/","cat":"image_theory","id":"comment-31506","author":"Hugh Farey","site":"shroudstory"},{"title":"John Klotz’ new Quantum Christ Blog","post":"Hugh,\nI happen to believe that all things are natural, even the primordial consciousness we call God. We attach words like “paranormal” to events we do not understand and comprehend. Because an event is singular does not mean it is “unnatural.” And I would frankly demur from your description of the Resurrection as more complicated than fraud. \nFraud can be a very complex event. Exhibit Number One might be the Redford-Newman movie “The Sting.” The Not-so-Right Rev. David Sox referred to the Shroud as “greatest forgery of all time.”  If it were a forgery he would be close to correct. The intricate details of the Shroud and its complex imagery were beyond the capabilities of any forger at any time of history. The non-Resurrection hypotheses of image formation, given the very special time frame involved, all falter on the same fine points because no one has proposed a workable theory that doesn’t involve a process of image diffusion, and the image is too fine for diffusion to have occurred.\nIf I am wrong, show me a sharply defined image that arose on a burial cloth within 48 hours of death.\nOf course, I am begging a very important question: What is the Resurrection?\n\n","date":"April 22, 2013 at 10:39 am","url":"https://shroudstory.com/2013/04/21/john-klotz-new-quantum-christ-blog/","cat":"image_theory","id":"comment-31517","author":"John Klotz","site":"shroudstory"},{"title":"John Klotz’ new Quantum Christ Blog","post":"I’m sorry if I unintentionally implied sacrilege, but all the intricate physical details which cannot be explained by forgery are no less intricate, nor excused from detailed explanation, by a resurrection hypothesis. It may be that the resurrection hypothesis is correct, but I don’t think Occam’s Razor is evidence in its favour.\n\n","date":"April 22, 2013 at 1:53 pm","url":"https://shroudstory.com/2013/04/21/john-klotz-new-quantum-christ-blog/","cat":"image_theory","id":"comment-31523","author":"Hugh Farey","site":"shroudstory"},{"title":"John Klotz’ new Quantum Christ Blog","post":"The image that has seared itself on our imagination was not, of course, produced by release of ammonia gas, whatever the chemical theorists might claim, explosives experts included. \n It must have involved some kind of  thermally-induced component as well – possibly a flash of radiant energy, but more probably one that required close atom-to-atom, molecule-molecule proximity between something that had become hot – through application of heat –  and a target substance, easily prone to thermal alteration.\nHere’s a possible equation:  \n2NH3  (ammonia) + 3N2O (from NH4NO3)   -> 4N2 +  3H2O  + scorching of immediate environment. leaving a visible imprint.\nI refer of course to the man-made disaster that occurred at the Texas fertilizer plant.  :-(\nhttp://colinb-sciencebuzz.blogspot.fr/\n\n","date":"April 22, 2013 at 11:23 am","url":"https://shroudstory.com/2013/04/21/john-klotz-new-quantum-christ-blog/","cat":"image_theory","id":"comment-31520","author":"colinsberry","site":"shroudstory"},{"title":"John Klotz’ new Quantum Christ Blog","post":"JK: “If I am wrong, show me a sharply defined image that arose on a burial cloth within 48 hours of death.” \nJohn, Two other cases are known. The Jospice mattress cover, and another. The second was that of an ancient Egyptian woman, but I forget all the details, but think it might have been on some type of veil. The veil was in the Louvre museum for some years, but either the image disappeared or the veil was lost without trace. You might be able to Google for more details. Max Patrick Hamon brought it to my attention over the last year or so.  \nJospice mattress cover: “Jospice Mattress Imprint”, Peter Carr, Fr O’Leary PDF on Shroud website:\nhttp://www.shroud.com/pdfs/imprint.pdf \n“Can the Jospice Mattress Imprint be compared to the Image on the Shroud?” Louis C. de Figueiredo:\nhttp://holyshroudguild.org/uploads/2/7/1/7/2717873/can_the_jospice_mattress_imprint.mht_2.pdf\nThe second paper is written in what I think is rather turgid prose, but you can read past that. \nMy own views on the TS image are that it may or may not be miraculous. The miracle may consist in merely being the serendipitous concommitance of environmental circumstances that permitted the image to form by some as yet unknown natural process, in other words, more providential than miraculous. I can take the point that the image is not that of a risen glorified Christ, but is of a very dead body at a particular moment of time. I see the only evidence of resurrection as being that: Here we have what appears to be a genuine burial cloth, withour a body, yet with an image of an uncorrupted body that had to be formed within 48 hours of death. The body could not have been removed by manual means, as otherwise there would be evidence of smearing and tearing because of the glutinous substances on the cloth (e.g. myrrh). That is adequate enough evidence for me personally. We do not know if it is a normal process or not, as in other cases, any such image would probably disappear as a result of the chemistry of the corruption processes.  \nThe most successful attempts at forming an image by experimental processes to date are 12 years of experiments by Giovanna De Liso in connection with seismic events, probably associated with the concurrent release of mildly radioactive radon gas.\n“Shroud-like image formation during seismic activity”; Giovanna de Liso; ENEA Frascati Conference May 2010.\nhttp://www.acheiropoietos.info/proceedings/DeLisoWeb.pdf\nThere have been follow-up papers to De Liso’s work by other authors.\n\n","date":"April 22, 2013 at 4:32 pm","url":"https://shroudstory.com/2013/04/21/john-klotz-new-quantum-christ-blog/","cat":"image_theory","id":"comment-31532","author":"daveb of wellington nz","site":"shroudstory"},{"title":"John Klotz’ new Quantum Christ Blog","post":"David,\nJospice Mattress Imprint:\nThanks for pointing to the link on HSG. Regarding the first link, on shroud.com, the material was written by Father Francis O’Leary, with whom I had some contact. There was no choice but to disagree with the good priest, even taking some of his time, for he was desperately in need of funds to run the hospital for terminal patients who could not afford to pay. Carr, although having his own interpretation, did not contradict what I had proposed. \nTo go a bit further now, telergy can also be invisible, without leaving marks on something material, because the origin lies in the psyche. It is possible that the Gerasene “demoniac” (Gospel according to Mark) possessed this psychic energy and would be considered a paranormal today. His paranormal abilities enabled him to break chains, recognise Jesus’s divinity and the psychic energy (telergy) released by him when he was healed by Jesus was felt by the large herd of pigs who rushed down the steep bank. The Gospel says that the man was left in his “right mind”. The Greek cultural influence in ancient Palestine — Hypnos — personification of sleep, Thanatos, personification of death, and so on — made the people interpret “invisible working”, that is mental problems, as “possession”. It makes sense to believe that Jesus healed both those who suffered from physical and mental diseases.    \nTS: You are right in keeping an open mind about the image-formation process and more can probably be learnt, and with more confidence if Turin allows another hands-on examination.\n\n","date":"April 22, 2013 at 9:17 pm","url":"https://shroudstory.com/2013/04/21/john-klotz-new-quantum-christ-blog/","cat":"image_theory","id":"comment-31545","author":"Louis","site":"shroudstory"}]
