[{"title":"3D of the Day:  Imprinted in a Contact-Only Mechanism?","post":"Bueno, Colin, es natural que haya “ojos” por todos los sitios….\nCarlos\n\n","date":"August 15, 2015 at 2:10 pm","url":"https://shroudstory.com/2015/08/15/3d-of-the-day-imprinted-in-a-contact-only-mechanism/","cat":"image_theory","id":"comment-208327","author":"Carlos","site":"shroudstory"},{"title":"3D of the Day:  Imprinted in a Contact-Only Mechanism?","post":"As you say, Carlos, there are eyes “all over the place”, and that’s not counting the coins that will no doubt be making a reappearance shortly on this thread (though not from me, I hasten to add).\nI’ve been playing around with contrast, viewing it as an entirely empirical tool for confirming what one can already make out vaguely, seeking merely reinforcement of one’s visual senses/gut feelings  (I leave the theory to others).  My guess is that the “eyes” are probably artefactual. Why? When one looks at the rest of the image there are a series of horizontal ridges, shadowed on their lower sides. They are probably the warp threads (the image side of the TS being, we’re told, predominantly warp face – 75% no less – in the case of a 3/1 herringbone weave. Those ridges tend to be blotchy and wavy, i.e of variable width, probably due to intersection of the vertical weft threads. So the “eyes” may be accidents, due to meetings of warp and weft threads, favoured by the orientation selected for my image. I am still waiting for someone to see what’s unusual about the picture – though the embedded B/W 2D reference benchmark (no 3D history) and its shadowing should give a clue, as hopefully might this let-down comment also – at least for those who might wish to conjecture a flash from On High (another clue) that caused eyes to suddenly re-open!   ;-)\n\n","date":"August 15, 2015 at 3:07 pm","url":"https://shroudstory.com/2015/08/15/3d-of-the-day-imprinted-in-a-contact-only-mechanism/","cat":"image_theory","id":"comment-208331","author":"Colin Berry","site":"shroudstory"},{"title":"3D of the Day:  Imprinted in a Contact-Only Mechanism?","post":"PS: Carlos may put my reply into Google Translate (English to Spanish) when he sees it. Will it make sense? That I cannot say. But there’s a simple rough-and-ready way of checking it for gross errors. Put one’s English into Google, then back-translate the Spanish translation to English. Here’s my back-translated comment. A few things have been lost in translation, especially towards the end, but it hopefully makes broad sense:\nAs you say, Charles, no eyes “all over the place” and that’s not counting the coins certainly be making a comeback soon in this thread (though not me, I hasten to add).\nI’ve been playing with the contrast, viewing it as an entirely empirical tool to confirm what we already can vaguely make out, looking only strengthening the visual senses / gut feelings (I leave to others the theory) themselves. My guess is that the “eyes” are probably artifactual. Why? When you look at the rest of the image, there is a series of horizontal ridges, shaded on their undersides. Are probably the warp (the side of the image of being TS, we are told, deform predominantly face – not less 75% – in the case of a woven herringbone ridges 3/1 These spots tend to be wavy, it is ie. variable width, probably due to the crossing of the threads of vertical frame. So the “eyes” can be accidents because meetings warp and weft threads, favored by the orientation in my image. I’m still waiting for someone to see what is unusual in the picture – but the reference / embedded 2D BW reference (unprecedented in 3D) and its shadow should give you a hint, as you might expect could this comment down too – at least for those who wish On a glint of guess Alto (another clue) that caused his eyes to reopen soon! ;-)\n\n","date":"August 15, 2015 at 3:33 pm","url":"https://shroudstory.com/2015/08/15/3d-of-the-day-imprinted-in-a-contact-only-mechanism/","cat":"image_theory","id":"comment-208332","author":"Colin Berry","site":"shroudstory"},{"title":"3D of the Day:  Imprinted in a Contact-Only Mechanism?","post":"Why dwell on the eyes?  Even the blood stains on the forehead show elevation.  This 3D scan is crude and serviceable for generalities only. \nAs for the eyes, the right eye in this image protrudes.  This would be consistent with an orbital hemorrhage and proptosis and consistent with the the trauma incurred to this side of the face.  This, I am an expert on.\n\n","date":"August 15, 2015 at 8:04 pm","url":"https://shroudstory.com/2015/08/15/3d-of-the-day-imprinted-in-a-contact-only-mechanism/","cat":"image_theory","id":"comment-208336","author":"Stan Walker, MD","site":"shroudstory"},{"title":"3D of the Day:  Imprinted in a Contact-Only Mechanism?","post":"Assuming that the “Shroud” image can be interpreted like a medical photograph is a step too far,\nAssuming that apparent 3D properties in a VP-8 machine or modern-day digital equivalent e.g ImageJ, can be used like a CT scan to give real 3D information is another step too far,\nPutting those two steps together has taken more than one ‘medical expert’ over the edge of the sindonological cliff.\n\n","date":"August 16, 2015 at 12:07 am","url":"https://shroudstory.com/2015/08/15/3d-of-the-day-imprinted-in-a-contact-only-mechanism/","cat":"image_theory","id":"comment-208345","author":"Colin Berry","site":"shroudstory"},{"title":"3D of the Day:  Imprinted in a Contact-Only Mechanism?","post":"Thank you, Stan, for your optical expertise. Is there a rhinologist among our readers who could explain how the nose in the image appears to have shrunk so completely into the cheeks so as not to protrude in any way from the upper plane of the face?\n\n","date":"August 16, 2015 at 2:38 am","url":"https://shroudstory.com/2015/08/15/3d-of-the-day-imprinted-in-a-contact-only-mechanism/","cat":"image_theory","id":"comment-208349","author":"Hugh Farey","site":"shroudstory"},{"title":"3D of the Day:  Imprinted in a Contact-Only Mechanism?","post":"While waiting for your rhinologist Hugh, you might be interested to hear the suggestion I flagged up yesterday on my own site.\nThe angular nature of the face has always been cited as the chief objection to imprinting by contact, at least in a medieval Garlaschelli-style model involving manual moulding, e.g. with his powder frottage.  It’s the nose especially that is the problem, giving rise to distortion and other anomalies  dependng on whether the cloth follows the contours whether it bridges, leaving gaps.\nHere’s my solution, in the new flour-powder imprinting model. The powder was applied to all parts of the face except the nose. When wet linen was draped over, pressure was applied to the nose (ouch) to flatten it, (more correctly, to deform it by pushing skin and cartilage to one side – left or right). Thus reduced to a little more than a shallow bony step there is,  one need hardly add,  the corresponding gap in the imprinted image. Remedy? The “nose” was then added, using flour essentially like paint (but they didn’t make a terribly good job of it, did they, the nose and surrounding area looking a total disaster area, at least in the 3D rendering above?).\nSelf-promotion postscript:\nObtaining those eyes requires that two things be done as regards LIGHTING, the oh so crucial lighting in ImageJ. All will be explained in today’s Topic 4. \nPreliminary results with the microscopy will be Topic 5 later today – a very tricky area , but one that has provided additional clues as to how the image may have been developed in TWO stages – first with a flat iron to fix the flour and see an initial faint image (allowing for more doctoring if needed) then followed by oven roasting to bring up the full (Maillard?) colour, followed finally by image attentuation, e.g. soap and water. One can tentatively identify all these stages under the microscope in the model system. Matching the end stage with the TS, the latter a centuries- old image, will be the real challenge, but things look promising as regards seeing single/isolated fibre coloration – a remarkable phenomenon – though maybe not the so-called half-tone effect.\n\n","date":"August 16, 2015 at 3:16 am","url":"https://shroudstory.com/2015/08/15/3d-of-the-day-imprinted-in-a-contact-only-mechanism/","cat":"image_theory","id":"comment-208351","author":"Colin Berry","site":"shroudstory"},{"title":"3D of the Day:  Imprinted in a Contact-Only Mechanism?","post":"“Here’s my solution, in the new flour-powder imprinting model. The powder was applied to all parts of the face except the nose.”\nThis one is funny. Could you include it in your final version or is it another ephemeral hypothesis?\n\n","date":"August 16, 2015 at 3:49 am","url":"https://shroudstory.com/2015/08/15/3d-of-the-day-imprinted-in-a-contact-only-mechanism/","cat":"image_theory","id":"comment-208353","author":"anoxie","site":"shroudstory"},{"title":"3D of the Day:  Imprinted in a Contact-Only Mechanism?","post":"What is it? The flour absorbed the nose to such an extent that nose was left?\n\n","date":"August 16, 2015 at 11:02 am","url":"https://shroudstory.com/2015/08/15/3d-of-the-day-imprinted-in-a-contact-only-mechanism/","cat":"image_theory","id":"comment-208372","author":"Louis","site":"shroudstory"},{"title":"3D of the Day:  Imprinted in a Contact-Only Mechanism?","post":"If there’s one thing that one sees time and again with the trolling tendency, it’s an inability to cope with new ideas, and a deep and scarcely rational resentment towards those who propose new ideas, whether good, bad or indifferent. Solution?  Here’s some well-intentioned advice. Don’t be content with dipping a toe in the water. Take the plunge. Come on in, the water’s luverly.  Let’s be hearing YOUR ideas – good, bad or indifferent.\nAs regards the nose being doctored, it’s actually a development of Luigi Garlaschelli’s ideas. He gave up on the face, saying a bas relief must have been used, it not apparently occurring to him that the nose is pliable and can thus be ‘pushed to one side’,  But look what he had to say about the fingers. He suggested that they were  ‘painted’ by hand rather than imprinted (difficult in his dry linen model) and not, he added, terribly well done – explaining perhaps the unnaturally spindly look.\nOne wonders if the hair too might also have been done separately from the rest of the face, e.g. with a woodblock or similar, which is not unlikely, given the way it frames the face with a gap between the two, more obvious at the two sides.\n\n","date":"August 16, 2015 at 4:48 am","url":"https://shroudstory.com/2015/08/15/3d-of-the-day-imprinted-in-a-contact-only-mechanism/","cat":"image_theory","id":"comment-208356","author":"Colin Berry","site":"shroudstory"},{"title":"3D of the Day:  Imprinted in a Contact-Only Mechanism?","post":"Garlaschelli’s hypothesis uses necessarily the red ocher ….. does he think to add it to the flour in some moment? \n(en español)\nLa hipótesis de Garlaschelli utiliza necesariamente el ocre rojo…..¿piensa añadirlo a la harina en algún momento?\nCarlos\n\n","date":"August 16, 2015 at 5:40 am","url":"https://shroudstory.com/2015/08/15/3d-of-the-day-imprinted-in-a-contact-only-mechanism/","cat":"image_theory","id":"comment-208361","author":"Carlos","site":"shroudstory"},{"title":"3D of the Day:  Imprinted in a Contact-Only Mechanism?","post":"Is nobody interested (sob, sob) in how those “eyes” were generated In Image 3D?\nNo? Oh well, never mind. I’ll just leave you with this and get back to my floury dining table and microscope …\n\nYou may need to rotate your laptop screen through 90 degrees.\n\n","date":"August 17, 2015 at 1:09 am","url":"https://shroudstory.com/2015/08/15/3d-of-the-day-imprinted-in-a-contact-only-mechanism/","cat":"image_theory","id":"comment-208402","author":"Colin Berry","site":"shroudstory"},{"title":"3D of the Day:  Imprinted in a Contact-Only Mechanism?","post":"Colin:\nConozco bien algunos aspectos de la incidencia de la luz y de la angulación sobre la imagen de la Sábana.\nSi usted tiene un ordenador portátil que sea “antiguo” podrá observar un fenómeno muy curioso, la transición paulatina de la imagen positiva a la imagen negativa cuando va desplazando (angulando) la pantalla del ordenador hasta la HORIZONTAL.\nO bien con una “pantalla antigua” de un ordenador de sobremesa, desplazando la pantalla hacia la HORIZONTAL o bien girándola paulatinamente en la VERTICALIDAD.\nLa imagen de la Sábana debe ser en COLOR.\nEs un ESPECTÁCULO ver como el positivo del rostro se va transformando en negativo….y hay detalles que se hacen más patentes. \nLas intensidades de los tonos se van modificando gradualmente hasta invertirse, “como si” se cortara la imagen por planos de intensidades…..\nEn las pantallas “modernas” el funcionamiento es distinto y la imagen no ( negación) se altera con las angulaciones.\nCarlos\n\n","date":"August 17, 2015 at 4:18 am","url":"https://shroudstory.com/2015/08/15/3d-of-the-day-imprinted-in-a-contact-only-mechanism/","cat":"image_theory","id":"comment-208409","author":"Carlos","site":"shroudstory"},{"title":"3D of the Day:  Imprinted in a Contact-Only Mechanism?","post":"There’s maybe been a misunderstanding there Carlos.Yes, I knew that certain screen tilts can produce those weird changes in the image (there’s a guy  with his own site who thinks the new info is real!).\nAs an alternative to rotating the screen, simply turn your head through 90 degrees instead to see what happens to that image on the right. It’s not a screen artefact. It’s the result of turning an image from horizontal to vertical in ImageJ  so as to obtain a different pattern of light and shade. It’s the shadowing that creates the 3D effect when using the default non-zero z scale setting.\nHere’s a graphic from my site where the screen or  head-turning has been done for you as the lighting control is increased. \nhttps://shroudofturinwithoutallthehype.files.wordpress.com/2015/08/diagonal-series.png?w=640&h=516\nObserve the way that empty eye sockets acquire eyes when it’s overhead instead of the side illumination from the left (the latter being ImageJ’s default setting which introduces arbitrary bias and selection  needless to say).\n Moral: always rotate the image in ImageJ  to reveal detail that might otherwise be missed, even if it’s artefactual detail!.\n\n","date":"August 17, 2015 at 4:46 am","url":"https://shroudstory.com/2015/08/15/3d-of-the-day-imprinted-in-a-contact-only-mechanism/","cat":"image_theory","id":"comment-208412","author":"Colin Berry","site":"shroudstory"}]
