[{"title":"Quote for today on why the shroud image is not a scorch","post":"There may be much truth in what Kiwi Dave says, who is to say? But look carefully at each sentence. It is not science. That’s not to disparage  – science is but one part of human experience – the human condition.  No science is required to admire a sunset,  or to be moved,  as I always am, by Bruch’s Violin Concerto.\nBut when I visit this site I wear my science bod hat, and here’s what I have just posted to my own site:\n“It’s interesting, and perhaps instructive, to compare the 3D imaging of my thermal imprint with the original artefact. Note the prominence of the cheeks that look raised in the 3D image, but are not in the artefact. That’s because the cheeks made quick and close contact with the linen, left a quick scorch imprint, so are accentuated in 3D. Now look at the Shroud image. Is there not a similar effect at work? Look at the features that are accentuated. Is it not more to do with flat surfaces rather than elevation?”\n\n","date":"February 11, 2012 at 12:06 pm","url":"https://shroudstory.com/2012/02/11/quote-for-today-on-why-the-shroud-image-is-not-a-scorch/","cat":"image_theory","id":"comment-8142","author":"sciencebod","site":"shroudstory"},{"title":"Quote for today on why the shroud image is not a scorch","post":"What you see when you look at the negative is what might be described as a “face pressed up against  the glass” effect:\nNow imagine the process occurring in stages – first the bridge of the nose, then the moustache and beard, lips, forehead, cheek, chin etc. The first to impact against a resistance (in my model the linen/bed sand) will imprint the most,  giving the greatest scorch density, then progressively less as it becomes harder to push deeper into the source of resistance. \nIn other words, what is being mapped – and subsequently displayed in an “encoded 3D image” is a kind of physical relief  but  instead of picking out the highest points, it is picking out a series of planes. The difference is subtle,  i.e emphasising flat surfaces rather than peaks, and might explain many, indeed most of the peculiarities of the image.\n\n","date":"February 11, 2012 at 2:03 pm","url":"https://shroudstory.com/2012/02/11/quote-for-today-on-why-the-shroud-image-is-not-a-scorch/","cat":"image_theory","id":"comment-8147","author":"sciencebod","site":"shroudstory"},{"title":"Quote for today on why the shroud image is not a scorch","post":"1.  I’m glad for Colin’s sake that he has an aesthetic dimension to his life – I too appreciate Bruch.  But there’s also a lot more to FORENSICS than just its scientific aspect, as any prosecuting attorney or defence counsel knows.  Having once been assigned to an Audit Off ice for about 10 years, I know they describe much of their work as “forensic”.  Science by itself is inadequate for forensics.  My son recently served on a jury trial, and the two expert science witnesses contradicted each other (both no doubt collecting their appearance fee).  Ring any bells?\n2.  (a) Forensic: relating to, used in, or connected with a court of law;  (b) Forensics: the art or study of formal debating (both definitions from Collins).\n3.   My comments, which may or may not be science (Who is to say?!!), at the head of this page, were intended to contribute to the forensics of our debate, and I believe they are reasonably powerful arguments, or at least highly persuasive.\n4.   The process of imprinting on the Shroud (assuming it was indeed a process) may or may not have picked out a series of planes, this is possibly a matter of perception or degree.  However, thermal contact printing is not necessarily the only method of producing such an effect.\n5.  The proninent appearance of the cheeks may well be because of the severe bruising suffered by the subject!\n6.  It was a source of wry amusement to my late countryman, the long-departed Ernest Rutherford, notable Physicist, that he was awarded the Nobel Prize for Chemistry!  What does that tell us about Science?!!  What does it tell us about categories?\n\n","date":"February 11, 2012 at 4:41 pm","url":"https://shroudstory.com/2012/02/11/quote-for-today-on-why-the-shroud-image-is-not-a-scorch/","cat":"image_theory","id":"comment-8149","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Quote for today on why the shroud image is not a scorch","post":"“The prominent appearance of the cheeks may well be because of the severe bruising suffered by the subject!”\nThe reference to cheeks was not in regard to the Shroud  – it was to  my experiments with a small metal trinket that was heated and then pressed into linen to scorch an image… (like branding)…\n\n","date":"February 11, 2012 at 6:27 pm","url":"https://shroudstory.com/2012/02/11/quote-for-today-on-why-the-shroud-image-is-not-a-scorch/","cat":"image_theory","id":"comment-8153","author":"sciencebod","site":"shroudstory"},{"title":"Quote for today on why the shroud image is not a scorch","post":"PS: Your “forensics” frightens me. A few centuries ago, it might have been called an Inquisition (oops, better not go there…)\n\n","date":"February 11, 2012 at 7:39 pm","url":"https://shroudstory.com/2012/02/11/quote-for-today-on-why-the-shroud-image-is-not-a-scorch/","cat":"image_theory","id":"comment-8156","author":"sciencebod","site":"shroudstory"},{"title":"Quote for today on why the shroud image is not a scorch","post":"Of all the forgery theories the scorch one is the only one that bears a chance of being able to partly explain the image on the Shroud. \nHowever, to avoid the distortions in the image the underlying statue would have to be a bas relief (as has already been tested before by numerous experimenters but might be worth a revisit).  I also think it would have to be a low relief as well, because any bedding down movement might show as a blurring of markings.\n I think that rather than using a sand bed, instead a bed of dense but compressible wool, would help transfer the depth information into an increase in pressure of the linen against the hot surface (as I dont think the sand bed would be responsive enough to achieve a linear relationship between the depth and the pressure). The scorching on the top surfaces of fibres and the ability to scorch some fibres and not neighbouring fibres might all be down to pressure difference as Colin mentioned. I’m not sure whether that level of responsiveness in possible with a scorch image to give the subtlies in the Shroud, but some experimentation might give some indication of this. I disagree with Colin that just showing the principle is enough and the rest is arts and crafts – I spent many years working in transferring  theoretical results into workable technologies with sufficient fidelity ….sometimes its not possible. \nBut I agree with Colin that I wouldnt be too confident about the UV fluorence results if you are not comparing like with like pyrolysis results (ie image and 1500’s fire pyrolysis results as they were created under different circumstance).  I’d like to see the proper report on this as it seems like an important result to establish. \nHowever I still think the bas relief method would struggle to explain the faint image on the other side of the head given that the fibres in between dont appear to affected. Also the blood patterns apparently being created before the image (how sure are we of this?) I’d like to see a comparison of the intricate blood and whip marks, to see if these correlate exactly as they are precise enough as markers – I saw somewhere some very faint images (only visible after image processing) of the leather parallel strip marks that lead towards the actual whip wounds – that was very impressive to me.  There are a number of other physical results I’ve come across whilst researching in only the last month that I found to be perplexing if you work on the hypothesis that its a fake, and thats not to mention some of the historical documents.  So I cant dismiss the Shroud as easily as Colin does.\n\n","date":"February 12, 2012 at 8:14 pm","url":"https://shroudstory.com/2012/02/11/quote-for-today-on-why-the-shroud-image-is-not-a-scorch/","cat":"image_theory","id":"comment-8184","author":"ArtScience","site":"shroudstory"},{"title":"Quote for today on why the shroud image is not a scorch","post":"What a splendid comment, ArtScience, the best reply I have ever had on this site.\nHope you don’t object, but I have used it to prime the Comments on my new site –  I hold you up as a role model for good blogging etiquette (something that is sadly in short supply here –  Barrie Schwortz and some others please note).\nColin Berry aka sciencebod\n Shroud of Turin without all the hype\n\n","date":"February 13, 2012 at 1:38 am","url":"https://shroudstory.com/2012/02/11/quote-for-today-on-why-the-shroud-image-is-not-a-scorch/","cat":"image_theory","id":"comment-8189","author":"colinsberry","site":"shroudstory"},{"title":"Quote for today on why the shroud image is not a scorch","post":"Hi Colin, glad you felt that way about the comment and wish you success on your new blog. I’d contribute if I felt you were going to be fair in admitting positive aspects to the pro-Shroud evidence where fitting, as well pointing out what the science seems to be saying, but I haven’t been encouraged so far by your sense of fairness nor actually your level of science (yes it was me who commented on your original blog about not being impressed by your claims of 3d from what looked like 2 level grey scale image, nor the claims of cellulose being a good conductor, when a moments thought about why one is able to hold a burning match, would say otherwise… A startling  omission from a biochemist … Makes one thinking about excommunication from the world of science for such ;) Joking of course!\nHowever if you were willing to put up with my thoughts and recommendations and my fuming against rabid sceptics like yourself (as opposed to enlightening refreshing scepticism) and a healthy amount of good natured humorous snipes, I’d be willing to join in and id like to see where the science leads and perhaps re-examine the uv data and also try and get a decent scorch print. Perhaps we might even get round to discuss the merits of Dutch group Focus!\n\n","date":"February 13, 2012 at 11:11 am","url":"https://shroudstory.com/2012/02/11/quote-for-today-on-why-the-shroud-image-is-not-a-scorch/","cat":"image_theory","id":"comment-8197","author":"ArtScience","site":"shroudstory"},{"title":"Quote for today on why the shroud image is not a scorch","post":"In fact, the rubber balloon version of the “boil water in a paper bag” Scout camp trick could be giving us important clues as to mechanism, which clearly do NOT have to involve water. It would take too long to explain here, and others might question the relevance (which relates to what i consider to be Raymond Rogers’ unsatisfactory reasoning re scorching). I’ll leave you with a tiny clue-   think extended polymer molecules forming a rigid structure-  as exist in paper and linen AND in STRETCHED rubber. You may then have an explanation for why cellulose can be surprisingly efficient at conducting heat away from surface-scorched hotspots without becoming chemically or even physically degraded in the process, and thus maintaining strength and structural integrity – and looking unchanged, with intact birefringence, at least under Rogers’ light  microscope.\n\n","date":"February 13, 2012 at 3:57 pm","url":"https://shroudstory.com/2012/02/11/quote-for-today-on-why-the-shroud-image-is-not-a-scorch/","cat":"image_theory","id":"comment-8202","author":"colinsberry","site":"shroudstory"},{"title":"Quote for today on why the shroud image is not a scorch","post":"I wish you both well in your endeavours.  Both Sciencebod & Artscience ignore the fundamental objection at the head of this blog – the unlikelihood of anyone making such an object.  That is not to say that the image may be the product of some natural phenomenon as yet not understood or fully explored.  It may have occurred soon after the burial work..  I wouldn’t yet rule out some as yet unknown photo-chemical process.  I don’t see that this has been fully tested.  Personally I think the forgery hypothesis will eventually show up as a dead end!  Subjective yes, but one can have an instinct about these things.\n\n","date":"February 13, 2012 at 11:57 pm","url":"https://shroudstory.com/2012/02/11/quote-for-today-on-why-the-shroud-image-is-not-a-scorch/","cat":"image_theory","id":"comment-8220","author":"Daveb of Wellington NZ","site":"shroudstory"},{"title":"Quote for today on why the shroud image is not a scorch","post":"“..the unlikelihood of anyone making such an object…”\nThe issue of human psychology and motivation, especially with regard to our distant ancestors possessed of a mindset that we can only guess at, is one I try to avoid, preferring to concentrate on the physical evidence. But you might find some some explanations for the question you pose by reading Dan’s current post on a book with “True Icon” in the title, supplemented by the fascinating wiki entry on “Icon”, especially the references to an early Christian aversion to fully 3D icons – statues and the like- while taking a more tolerant approach to bas relief.  But I won’t ask if you are thinking what I am thinking, and making the same connections between 2D and 3D iconography… Like: was a a smithy’s pyrography the route to acceptable iconography…\n\n","date":"February 14, 2012 at 5:00 am","url":"https://shroudstory.com/2012/02/11/quote-for-today-on-why-the-shroud-image-is-not-a-scorch/","cat":"image_theory","id":"comment-8226","author":"colinsberry","site":"shroudstory"},{"title":"Quote for today on why the shroud image is not a scorch","post":"Hi Dave, I do think your objections are valid and the creation of the shroud by means suggested with a life size bas relief does seem like the equivalent of mobilising entire US armed forces in order to kill a gnat, if we are to believe the reports of the gullibility of medieval people for relics! But as Colin mentioned that isn’t really a scientific objection, we just want to see could it be done with technologies available. The imprint characteristics hint more strongly to a scorch than any other approach, however I doubt that it FULLY explains the image like Colin is already claiming, but I do think it is worthwhile investigating to be sure the claims are robust to attack.  I agree that there is no other recorded art form of a similar type using heated statues, though there is an ancient art practised in many cultures going by the name of pyrography of creating burnt image art.!\n\n","date":"February 14, 2012 at 3:58 am","url":"https://shroudstory.com/2012/02/11/quote-for-today-on-why-the-shroud-image-is-not-a-scorch/","cat":"image_theory","id":"comment-8222","author":"ArtScience","site":"shroudstory"},{"title":"Quote for today on why the shroud image is not a scorch","post":"Pyrography generally uses a hot poker or similar onto wood etc as though it were a pencil or brush, so any image produced would be likely to represent light/dark as perceived by the eye, and as represented conventionally in art, and most definitely not as a negative. Any hot metal used for producing a pyrographical Shroud was not deployed  then as an artist’s brush but more as a livestock owner’s branding iron. In other words, there had to be an initial metal template produced as a “positive” that could then produce ONLY negative representations of itself when pressed into an organic matrix -, wood, cloth etc. \nSo while I like the introduction of that new term “pyrography”, showing that the method for producing art by surface scorching has ancient roots, let’s be careful not to take it too literally if it means producing subtle, non-stylised POSITIVE images. There is/was nothing subtle about the negative light/dark reversed image on the Shroud, especially the head, with those staring eyes, or those strange bony hands and fingers, as viewed in medieval times by those with no access to cameras to produce our friendlier B/W reversals.\n\n","date":"February 14, 2012 at 4:26 am","url":"https://shroudstory.com/2012/02/11/quote-for-today-on-why-the-shroud-image-is-not-a-scorch/","cat":"image_theory","id":"comment-8224","author":"colinsberry","site":"shroudstory"},{"title":"Quote for today on why the shroud image is not a scorch","post":"Well  I cant take much credit for the term pyrography, though I must admit I’m quite a wizz at googling! \nAnd you are quite right that the Shroud is not very subtle in appearance when viewed with the naked eye, so that makes it all the more startling to find hidden in it information that would have been wasted on the medieval or modern unaided eye! So why the hell would a medieval forger  go to that elaborate extent to put that incredible detail in given that it wouldnt be noticed by his contemporaries? There’s a question you could pose on your shiny new blog, Colin if you are actually trying to find the truth about the Shroud (which I’m completely undecided about myself), rather than give the solace to those who have already decided that its a fake.\n\n","date":"February 14, 2012 at 3:08 pm","url":"https://shroudstory.com/2012/02/11/quote-for-today-on-why-the-shroud-image-is-not-a-scorch/","cat":"image_theory","id":"comment-8237","author":"ArtScience","site":"shroudstory"},{"title":"Quote for today on why the shroud image is not a scorch","post":"@ArtScience\nMy aim is not to give solace to anyone – any such effect being purely accidental and unintended. My aim is to expose the cynical perversion of so-called science which to this day is still being used to represent the Shroud as incapable of explanation by conventional physics and chemistry.  The aim of those so-called scientists, who in a previous age would have been called witchdoctors, is to foist on the impressionable the conclusion that the Shroud could only have arisen as a result of supernatural phenomena.\nEinstein said that God does not play dice. No disrespect to one of the greatest minds of all time, but I consider it far more probable that God plays dice at the subatomic level than Paul Daniels-style conjuring tricks to baffle and bemuse gullible grownups.\n\n","date":"February 14, 2012 at 4:17 pm","url":"https://shroudstory.com/2012/02/11/quote-for-today-on-why-the-shroud-image-is-not-a-scorch/","cat":"image_theory","id":"comment-8241","author":"colinsberry","site":"shroudstory"},{"title":"Quote for today on why the shroud image is not a scorch","post":"\ncolinsberry :\n@ArtScience\n“…said that God does not play dice”. No disrespect to one of the greatest minds of all time but…..\n\nThat’s quite alright, Colin, no disrespect taken, but I certainly cant remember saying that, especially since I do actually play dice ;)\nBut seriously, Colin, how on earth can you can yourself a rational scientist when every rational argument against your cause is either ignored or put down with some stupid remark (like using terms such as ‘so-called’,  witchdoctor, gullible or pseudo-science etc )? If just strikes me as totally dishonest. You might be too set in your ways to be open to argument.\nIt reminds me of a quote by another great mind, Max Plank (one of Einstein’s greatest influences): Science advances one funeral at a time.\nAnyway, I hope that you carry on with your experiments because nature always seems to do a better job of convincing than humans do.\nPS by the way, Bohr had a nice retort to Einstein’s quote, something like:”Don’t you go telling God what he can and cant do”.  Though I might sometimes have similar thoughts to yourself regarding the nature of the Shroud, I think we should also bear in mind Bohr’s words.\n\n","date":"February 14, 2012 at 5:38 pm","url":"https://shroudstory.com/2012/02/11/quote-for-today-on-why-the-shroud-image-is-not-a-scorch/","cat":"image_theory","id":"comment-8246","author":"ArtScience","site":"shroudstory"},{"title":"Quote for today on why the shroud image is not a scorch","post":"My words: “I consider it far more probable that God plays dice at the subatomic level than Paul Daniels-style conjuring tricks to baffle and bemuse gullible grownups.”\nBohr’s words, endorsed by yourself, and directed at my words:  “Don’t you go telling God what he can and cant do”.\nNotice anything? I referred merely to probability, and to what I “consider”. Nowhere did I make any strident statements of the kind referred to.\nTell me, ArtScience: while you have made some highly perceptive comments – at least one of which I have commended – do you not consider yourself guilty of wilfully misrepresenting another’s words in an attempt to damage his credentials?\nAs for “ignoring rational arguments” I have as you know just set up a specialist Shroud site.  It is dedicated to addressing each and every one of the major scientific (or pseudo-scientific) arguments that attempt to portray the Shroud as being anything other than an ingenious medieval forgery.  It will take time and much research, needless to say, but when it’s complete no fair-minded critic  – which I hope will include yourself- will be able to accuse me of “ignoring” any of the science. Arguments that lie outside the realm of science I leave to others – horses for courses and all that…\nCorrection to something I said earlier: I suggested that facial bruising was not part of the Gospel record. I discover on re-reading the book of St.Matthew that it may well have been, although not explicitly stated: \n“Others smote him with the palms of their hands” and later “And they spit upon him and took the reed  and smote him on the head”.\n\n","date":"February 14, 2012 at 7:08 pm","url":"https://shroudstory.com/2012/02/11/quote-for-today-on-why-the-shroud-image-is-not-a-scorch/","cat":"image_theory","id":"comment-8250","author":"colinsberry","site":"shroudstory"},{"title":"Quote for today on why the shroud image is not a scorch","post":"Hi Colin, actually I feel as though I rather under represented your words as you seem to sprinkle phrases like Mickey Mouse science (Adler’s work for instance), pseudo-science, and various other belittling put  downs rather liberally, and almost entirely without justification. But I dont want to get into that…I prefer to stick as close to the science as possible. \nNow going back to the birefringence problem, and Ray Rogers claims about the cellulose fibres in the image area retaining their birefringence and hence ruling out strong heat as the cause of the image. \nI’m not so sure now that I disagree with his conclusions….he has a paper that seems to show cellulose’s susceptibility to heat and radiation and the loss of birefringence….that loss seems to be permanent (he gives examples of ancient cellulose which bear birefringence marks of cosmic rays or radiation from radon). I think I remember you mentioning  something about the possibility of repair of this loss by active oxygen….can you give more details, so I can clarify this point, and determine whether we can hold on to this evidence or have to dump it. Thanks\n\n","date":"February 15, 2012 at 2:21 pm","url":"https://shroudstory.com/2012/02/11/quote-for-today-on-why-the-shroud-image-is-not-a-scorch/","cat":"image_theory","id":"comment-8310","author":"ArtScience","site":"shroudstory"},{"title":"Quote for today on why the shroud image is not a scorch","post":"@ArtScience\nI am in the course of preparing a post that offers an explanation as to why scorched areas (mainly affecting the primary cell wall) can be immediately adjacent to unscorched cellulose and its medullas and to deeper fibres, while showing an image, albeit a blurred one,  on the opposite side of the fabric. Clue: recall the physics of heat conduction vis-a-vis radiation, and their different requirements.\n\n","date":"February 15, 2012 at 3:15 pm","url":"https://shroudstory.com/2012/02/11/quote-for-today-on-why-the-shroud-image-is-not-a-scorch/","cat":"image_theory","id":"comment-8311","author":"colinsberry","site":"shroudstory"}]
