[{"title":"Is Colin Berry Onto Something?","post":"His research sounds interesting.\n\n","date":"July 2, 2015 at 6:53 am","url":"https://shroudstory.com/2015/07/02/is-colin-berry-onto-something/","cat":"image_theory","id":"comment-204341","author":"Dcn Andy","site":"shroudstory"},{"title":"Is Colin Berry Onto Something?","post":"Okay … then I think you have to perform comparative\nanalyses for what you have been achieved, with respect\nto other Shroud-like materials … because I do not believe\nthat in order to find the truth suffice graphics or\n“chemo-graphic explanations” (for the Shroud image).\nIn my opinion the ATR-FTIR technique could already\nbe another very interesting analytical way …\nIndeed, about ten years ago (in August 2005)\nI received a brochure from the HUT (= Helsinki University of Technology),\nit was titled:\n“FT-IR and UV Raman spectroscopic studies on thermal\nmodification of Scots pine wood and its extractable compounds”\nIt was a Dissertation [for the degree of Doctor of Science in Technology]\nby Mari Nuopponen (April 2005).\nLink:\nhttps://aaltodoc.aalto.fi/handle/123456789/2560\nIn the section “Research methods”, in the study by Nuopponen,\nthere was a paragraph about the “Attenuated total reflectance tecnique”\n(= ATR-FTIR), with a simple schematic picture of the ATR-FTIR spectroscopy\n(with a rough indication about the sampling depth…).\nNuopponen wrote:\n>… Usually the analysis depth is in the range of 0.3-3 micrometres. …\nInstead Wikipedia write:\n>…The penetration depth into the sample is typically between\n0.5 and 2 micrometres, with the exact value being determined\nby the wavelength of light, the angle of incidence and the\nindices of refraction for the ATR crystal and the medium being probed. …\nLink:\nhttps://en.wikipedia.org/wiki/Attenuated_total_reflectance\nIf I correctly remember, unfortunately, Heimburger then tried to do something\nwith a UVRR technique, but apparently he failed to get anything good.\nAlso I do not even know the exact details of that particular story …\nand searching other informations (surfing the Web) I have found nothing.\n— —\nHow to use the PCA (= Principal Component Analysis):\nThe infrared spectroscopy combined with the multivariate analytical\nmethod principal component analysis (PCA) and Gaussian peak fitting\nis an efficient approach to probing structural change in polymers during heating…\nFor example, I have read that:\n>… Discrimination between spectral data and repeatability of measurements have been magnified and verified using principal component analysis, in order to verify the effectiveness of the method in distinguishing the four resin categories …\nSource, the study:\n“Application of ATR-far-infrared spectroscopy to the analysis of natural resins”\nby Silvia Prati, Giorgia Sciutto, Rocco Mazzeo, Cristian Torri, Daniele Fabbri \npublished in:\nAnalytical and Bioanalytical Chemistry\nMarch 2011, Volume 399, Issue 9, pp 3081-3091\nDate: 11 Nov 2010\nHere another “ATR-FTIR study”:\nApplication of ATR-FTIR spectroscopy and principal component analysis\nin characterization of 15-acetyldeoxynivalenol in corn oil\nby\nYongwei Fu, Kiyohiko Toyoda, Ikko Ihara \nHere two very short excerpts from the abstract:\n>… The feasibility of ATR-FTIR spectroscopy with\nPrincipal Component Analysis (PCA) was investigated for detecting\n15-AcDON in crude and refined corn oils. …\n>… The results suggested that ATR-FTIR spectroscopy could be\na promising method for rapid screening of 15-AcDON in crude\nand refined corn oils.\nLink:\nhttp://www.sciencedirect.com/science/article/pii/S1881836614000342\n— —\n“Analysis of the physical properties of developing cotton fibres”\nby\nAlenka Kljun, Hassan El-Dessouky,Thomas A.S. Beniansm, Florence Goubet, Frank Meulewaeter, Paul Knox\nEuropean Polymer Journal \nHere the beginning of the Abstract:\n>Cotton fibres develop over four stages: initiation, elongation,\nsecondary-wall thickening, and maturation.\n>They develop a significant crystalline structure during the\nsecondary wall thickening stage of development.\n>Cotton fibres were harvested from 17 days to 60 days after flowering (dpa).\n>Transmission Electron Microscopy (TEM), Interferometry,\nAttenuated Total Reflectance Fourier-transform Infrared (ATR-FTIR) spectroscopy, immunofluorescence labelling, and fluorescence spectroscopy were used to characterise the cotton fibres in different stages. …\n— —\nNow I see that I overdid a bit (perhaps are already sufficient\nfor us just the simple analyses in Optical Microscopy),\nin fact the interesting tests by Colin could perhaps be a\nlot more rough (compared to textile reality of the Shroud)\nthan it appears, and I have to wait the inherent images.\nThen now I have to close my extremely boring message.\n\n","date":"July 2, 2015 at 11:26 am","url":"https://shroudstory.com/2015/07/02/is-colin-berry-onto-something/","cat":"image_theory","id":"comment-204370","author":"piero","site":"shroudstory"},{"title":"Is Colin Berry Onto Something?","post":"Colin has been for two years onto a scorch hypothesis.\nCan our reader explain his scorch hypothesis and why Colin has given up?\n\n","date":"July 3, 2015 at 12:49 am","url":"https://shroudstory.com/2015/07/02/is-colin-berry-onto-something/","cat":"image_theory","id":"comment-204409","author":"anoxie","site":"shroudstory"},{"title":"Is Colin Berry Onto Something?","post":"Yes he seems to have abandoned the scorch theory and was probably wrong. But that doesn’t mean his new theory or subsequent theories are wrong. Good on him for exploring.\nI still think the Shroud dates from the time of Christ, though :)\n\n","date":"July 3, 2015 at 1:57 am","url":"https://shroudstory.com/2015/07/02/is-colin-berry-onto-something/","cat":"image_theory","id":"comment-204414","author":"Thomas","site":"shroudstory"},{"title":"Is Colin Berry Onto Something?","post":"What if Jesus’ body was washed with Saponaria officinalis and his body sprinkled with a spice? What if loving hands then smoothed the cloth down on his body? Has Colin maybe found a way to make Rogers’ hypothesis viable?\n\n","date":"July 3, 2015 at 5:23 am","url":"https://shroudstory.com/2015/07/02/is-colin-berry-onto-something/","cat":"image_theory","id":"comment-204420","author":"Paulette","site":"shroudstory"},{"title":"Is Colin Berry Onto Something?","post":"What is needed to make Rogers’ hypothesis viable are to find out the reactants. Flour is not one of them.\n“Spice” “oil” “myhrr” “sweat” “urine” “saponaria” or “loving hands” mean i don’t know.\n\n","date":"July 3, 2015 at 5:32 am","url":"https://shroudstory.com/2015/07/02/is-colin-berry-onto-something/","cat":"image_theory","id":"comment-204423","author":"anoxie","site":"shroudstory"},{"title":"Is Colin Berry Onto Something?","post":"So he has been “probably” wrong (does he/you explain why?) for years, promoting a scorch hypothesis and insulting “shroudies”.\nNow he is probably “onto something”, something being somewhat a bad melting pot of the very same shroudies’ theories.\nThe only serious “breakthrough” being “probably” a Maillard reaction as an explanation for the browning. Wow.\n\n","date":"July 3, 2015 at 5:25 am","url":"https://shroudstory.com/2015/07/02/is-colin-berry-onto-something/","cat":"image_theory","id":"comment-204421","author":"anoxie","site":"shroudstory"},{"title":"Is Colin Berry Onto Something?","post":"On second thought I doubt Colin is getting a superficial image. So maybe the cloth was washed in the manner that Rogers proposed. What Colin has done is shown how contact might work with a coating of something on the body. So many variables!!!\n\n","date":"July 3, 2015 at 5:36 am","url":"https://shroudstory.com/2015/07/02/is-colin-berry-onto-something/","cat":"image_theory","id":"comment-204426","author":"Paulette","site":"shroudstory"},{"title":"Is Colin Berry Onto Something?","post":"If the Shroud did indeed wrap the body of Jesus then it is difficult to see how a Maillard reaction was involved. Maillard requires high temperature and we will have to assume that Jesus’ tomb was inside a furnace, while other Jews were buried in air-conditioned tombs.\nRay Rogers wrote about a Maillard-like reaction and ruled out hot irons and statues, and his suggestion led Dr. Paolo Di Lazzaro to say that experiments have to be made to prove this hypothesis. In this case all the Shroud’s image characteristics will have to be reproduced, and we know that it is not just a contact image.\nIt is important to note photograph no.2 in the link below and compare it with the images Colin posted on his blog:   https://www.academia.edu/11355553/Dr._Paolo_Di_Lazzaro_explains_his_research_on_image_formation_on_the_Shroud_of_Turin\nA lot more experiments will be needed.\n\n","date":"July 3, 2015 at 9:59 am","url":"https://shroudstory.com/2015/07/02/is-colin-berry-onto-something/","cat":"image_theory","id":"comment-204441","author":"Louis","site":"shroudstory"},{"title":"Is Colin Berry Onto Something?","post":"“Maillard requires high temperature”\nThis was Colin’s argument when he was onto something, Thibault answered:\nhttps://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/\n\n","date":"July 3, 2015 at 10:14 am","url":"https://shroudstory.com/2015/07/02/is-colin-berry-onto-something/","cat":"image_theory","id":"comment-204444","author":"anoxie","site":"shroudstory"},{"title":"Is Colin Berry Onto Something?","post":"Actually who is the chemist here is Colin and Ray Rogers believed that Maillard would only be one component, and he did not press the point, being open to other views.\nJesus’ body would have been baked at 165º C to get that image. Remember that Rogers ruled out hot irons and statues. Did you have a look at the two images?\n\n","date":"July 3, 2015 at 10:39 am","url":"https://shroudstory.com/2015/07/02/is-colin-berry-onto-something/","cat":"image_theory","id":"comment-204447","author":"Louis","site":"shroudstory"},{"title":"Is Colin Berry Onto Something?","post":"Thibault has given an argued answer. Not considering it claiming “Colin is the chemist here”, is not convincing, to say the least…\n\n","date":"July 3, 2015 at 10:50 am","url":"https://shroudstory.com/2015/07/02/is-colin-berry-onto-something/","cat":"image_theory","id":"comment-204449","author":"anoxie","site":"shroudstory"},{"title":"Is Colin Berry Onto Something?","post":"Interesting point.\nDo you know the 2005 paper by Steven D. Schafersman, Ph.D. ?\nTitle:\n“A Skeptical Response to Studies on the Radiocarbon Sample from the Shroud of Turin\nby Raymond N. Rogers Thermochimica Acta 425:189-194, 2005”\nSteven D. Schafersman, Ph.D. \nI have just read the strange claims…\nHere some excerpt:\n>… McCrone frequently complained that anyone with a simple polarizing microscope …\n[… omitted words …] could easily see and identify the abundant (millions) of tiny red ocher pigment particles that coat all the fibers in the image and blood areas.\n>Undoubtedly, STURP members did see these abundant and colorful reddish particles on the Shroud image and blood fibers–but never on the Shroud non-image fibers–but, against all reason and evidence, decided they were naturally-occurring alkaline iron precipitates and then ignored them!\n>To this day, STURP members continue to ignore the pigment particles …\n>… Red ocher/iron oxide/hematite is easily identified by its color and by crossing the polarizing filters of the polarizing microscope and examining the refractive index of a particle. Hematite has a very high refractive index, blood a low RI, and they are easily distinguished using the proper technique. This technique is known to every forensic microscopist, optical mineralogist, and rock petrologist …\n>… But STURP members never used this simple and powerful technique. They apparently never observed the Shroud sticky tape sample fibers with a polarizing microscope, for if they had, they would have no trouble identifying the bright orange and red particles as red ocher/iron oxide/hematite, not “blood sherds” or “alkaline iron precipitate,” which is what they incompetently called them. …\nI do not think that McCrone and Schafersman were right.\nAlso I understand that you are not a scientist, however\nI’m curious to read your answer …\n—***—\nToday I have found another ATR-FTIR study:\n“ATR-FTIR as a thickness measurement technique for hydrated polymer-on-polymer coatings.”\nHere an excerpt from the abstract:\n>… We propose a new method, that is, attenuated total reflection Fourier transform infrared spectroscopy (ATR-FTIR) to determine the relative thickness, combined with atomic force microscopy to calibrate the ATR-FTIR measurements. This technique was successfully employed to determine the hydrated thickness of a series of crosslinked tetraglyme coatings on ultrahigh molecular weight polyethylene substrates intended to reduce wear of acetabular cups in total hip replacements. The hydrated coatings ranged from 30 to 200 nm thick and were accurately measured despite the relatively high root-mean-square (RMS) roughness of the substrates, 20-35 nm (peak-to-peak roughness 55-100 nm). The calibrated ATR-FTIR technique is a promising new method for measuring the thickness of many other polymer-on-polymer and hydrated coatings.\nSo…\nIt should also be a curious method to work considering the fact\nthat (in absolute) AFM (= atomic force microscopy) controls\nhave more resolution than ATR-FTIR controls…\n— —\nThe reader from Palo Alto wrote:\n>You and your blog mates are being unfair to Dr. Colin Berry.\n>As I see it he is the real successor to Raymond Rogers.\nDr. Raymond Rogers claimed to be able to work using the petrographic\nmicroscope (…then, unless Steven D. Schafersman is truly right in his\nremarks, Rogers was able to work!).\nInstead I don’t see the same scientific behavior for Dr. Colin Berry.\nBut this seems to be turned as a lesser question with respect\nthe interesting graphic presentations shown by Colin…\nIt is for these reasons that I have mentioned the idea of checks\nto be carried out with the ATR-FTIR technique, although I prefer\nthe SPM way (and, in particular, the AFM techniques…).\nAnyway I hope you forgive my little confusion (around the term:\nOptical Microscopy) made yesterday.\nEven the way ATR-FTIR is in “optical field” (and thus for\nthe ATR-FTIR must see the “sampling depth”, that is, the value of D)\nand then yesterday, when I spoke of Optical Microscopy\nI was referring to the very simple controls, using the Light Microscopy.\nHere the last vague “ATR-FTIR reference”:\n“Effect of short wavelength UV-irradiation on\nageing of polypropylene/cellulose compositions”\nby\nHalina Kaczmarek, Dagmara Ołdak, Przemysław Malanowski, Hanna Chaberska\nLink:\nhttp://www.sciencedirect.com/science/article/pii/S0141391004001533\nAbstract\n>Polypropylene compositions containing 5–30% cellulose\nwere pre-irradiated (λ=254 nm) and then composted in garden soil\nin laboratory conditions.\n>The effect of photochemical reactions on the course of further\ndegradation during composting was investigated.\n>Photo- and bio-induced changes in samples were studied using\nreflectance infrared spectroscopy (ATR-FTIR) and tensile tests.\n>Destruction of surface morphology were also observed by\nscanning electron microscopy (SEM).\n>It was found that photo- and bio-induced changes in PP/cellulose compositions are accelerated compared to these processes occurring in pure components. The mechanical properties of sample tested are lower than those for PP alone but the influence of cellulose amount on the mechanical strength of compositions is insignificant.\n>ATR-FTIR spectroscopy combined with SEM is very useful\nfor fast estimation of polymer surface changes\nduring environmental degradation.\n— —\nIf you want to deepen the argument:\n“ATR – Theory and Applications”,\nthere is the following link:\nhttp://www.piketech.com/files/pdfs/ATRAN611.pdf\n(= only three pages!)\nand you can read someting about the\n“depth of penetration (dp) of the IR beam into the sample” at page 2.\nλ is the wavelength of light\nand\nθ is the angle of incidence…\n\n","date":"July 3, 2015 at 11:50 am","url":"https://shroudstory.com/2015/07/02/is-colin-berry-onto-something/","cat":"image_theory","id":"comment-204459","author":"piero","site":"shroudstory"},{"title":"Is Colin Berry Onto Something?","post":"I have found other “ATR-FTIR” links:\nhttp://www.piketech.com/ATR-Crystal-Selection.html\nhttp://www.shimadzu.com/an/ftir/support/faq/2.html\nhttp://www.utsc.utoronto.ca/~traceslab/ATR_FTIR.pdf\nhttp://old.vscht.cz/anl/vibspec/FTIR%20Reflection%20Techniques.pdf\n— — —\nAll ATR crystals have different spectral ranges.\nThe following factors contribute to the depth of light penetration for ATR measurements:\n– 1) Wavenumber,\n– 2) angle of incidence, and\n– 3) refractive index. \nBased on these factors, the depth of penetration into the sample at the contact position is given by the inherent\nequation…\nAnd, from the equation, we can see that:\npenetration depth increases at lower wavenumbers (longer wavelengths). …\n— —\nI think that using the ATR-FTIR technique is also possible to draw some interesting information about the composition of\nthin layers present on linen fibers involved in Body Image …\nI think that you can perform the appropriate experiments (with Crown Discharge, or VUV, or using the Maillard pathway, etc ….) in order to obtain a sort of useful database for the subsequent comparison of the spectra.\nThen: using  ATR-FTIR, AFM and AFM “three point bending”\nwe can hope to solve the Enigma ….\nSo…\nWhat is your opinion on this matter?\nI hope in your answers.\n\n","date":"July 4, 2015 at 9:25 am","url":"https://shroudstory.com/2015/07/02/is-colin-berry-onto-something/","cat":"image_theory","id":"comment-204507","author":"piero","site":"shroudstory"},{"title":"Is Colin Berry Onto Something?","post":"I wrote:\n“…Then: using ATR-FTIR, AFM and AFM “three point bending” we can hope to solve the Enigma ….”\nSorry…!\nI beg your pardon, because I wrote that phrase with reference to the “chemical-physical enigma”. Instead, speaking from a religious (= Christian Faith) point of view, this is only a nonsense…\nProbably the hasty and incorrect phrase originated from the fact that my mind was a bit ‘doubtful due to the fact that the layers that originate the picture of this body on the Shroud have been shown as having a thickness of 200-600 nm and instead our friend Colin B. said that the thickness varies, but he has never measured exactly (if I’m not mistaken) the value of the thickness …\nThis boring question for thickness measurement has its importance when you want to use the technique ATR-FTIR and in fact there are limitations to the thickness (de = “depth of penetration”) ..\nAlso if you want to consider the AFM techniques, these do not have not a significative penetration into the material (= so… you have to cut it into the thin slices if you want to investigate it in the sense of the “z direction/verse”) and then there is not a true meaning about the use of AFM regarding the thickness (= z parameter). Taking apart the use of ATR-FTIR, other surveys in the direction of the thickness can be carried out with the use of TEM (or with SNOM, but I believe that the penetration into the material with this microscopy technique is much more limited than the TEM ).\n\n","date":"July 5, 2015 at 7:15 am","url":"https://shroudstory.com/2015/07/02/is-colin-berry-onto-something/","cat":"image_theory","id":"comment-204602","author":"piero","site":"shroudstory"},{"title":"Is Colin Berry Onto Something?","post":"I am disappointed about my rough interventions, with errors that are turning in a ridiculous manner my thought.\nFor example:\n>the picture of this body on the Shroud \ninstead of:\n>the Image of the Body on the Shroud.\nand \nde = “depth of penetration” instead “dp” … perhaps this happened because I wanted to write something on effective depth of penetration (de = depth effective), but I had only few minutes at disposal, etc. …\nand then\nI have seen that I also forgot to write something about\nthe combination of ATR spectroscopies with SPM analyses (= AFM, etc.), this is the non-destructive way to follow!\nSo, you can try to read something about:\n“Vibrational analysis with scanning probe microscopy”.\nAn overview of techniques is available at the address:\nhttps://en.wikipedia.org/wiki/Vibrational_analysis_with_scanning_probe_microscopy\n>The technique of vibrational analysis with scanning probe microscopy allows probing vibrational properties of materials at the submicrometer scale, and even of individual molecules.\n>This is accomplished by integrating scanning probe microscopy (SPM) and vibrational spectroscopy (Raman scattering or/and Fourier transform infrared spectroscopy, FTIR).\n>This combination allows for much higher spatial resolution than can be achieved with conventional Raman/FTIR instrumentation.\n>The technique is also nondestructive, requires non-extensive sample preparation, and provides more contrast such as intensity contrast, polarization contrast and wavelength contrast, as well as providing specific chemical information and topography images simultaneously. … etc.  …\n— —\nHere the hypothesis, a possible (or not?) future title:\n“Christian Faith Eroded to the Very Core after the discussions of results obtained from Advanced Microscopies”\nI don’t write for denying the Resurrection and disturbing the blog…\n— —\nIn any case, trying to stay more balanced, I would also like to say that quoting (and only in part) Maria Valtorta (or other visionaries) is a thing that should not have much sense from a scientific point of view.\nIn fact (for example) this mystic /visionary person spoke of two different things:\n– the influence of severe kidney dysfunction (= production kidney toxins) in the formation of Image (on the linen cloth)\nand also of\n– a lightning coming from deep space that strikes (or pierces?) the stone of the tomb (and then I think that this second alleged fact was mentioned by prof. Fanti\n[to reinforce his Corona Discharge hypothesis], but now I have not the exact words of the book at hand…).\n\n","date":"July 6, 2015 at 4:46 am","url":"https://shroudstory.com/2015/07/02/is-colin-berry-onto-something/","cat":"image_theory","id":"comment-204707","author":"piero","site":"shroudstory"},{"title":"Is Colin Berry Onto Something?","post":"Do you know ATR-Raman controls?\nHere a vague link:\nhttp://lib.dr.iastate.edu/cgi/viewcontent.cgi?article=3609&context=etd\n\n","date":"July 7, 2015 at 11:49 am","url":"https://shroudstory.com/2015/07/02/is-colin-berry-onto-something/","cat":"image_theory","id":"comment-204863","author":"piero","site":"shroudstory"},{"title":"Is Colin Berry Onto Something?","post":"So why does he not produce such an image using Maillard? I want to see it.\n\n","date":"July 3, 2015 at 10:54 am","url":"https://shroudstory.com/2015/07/02/is-colin-berry-onto-something/","cat":"image_theory","id":"comment-204451","author":"Louis","site":"shroudstory"},{"title":"Is Colin Berry Onto Something?","post":"a/ Maillard reaction happens at room temperature, that was the point\nb/ What candidate reactants may have been at stake? He was looking for it, ask him directly, i don’t think he has given any clue so far on this blog.\n\n","date":"July 3, 2015 at 11:02 am","url":"https://shroudstory.com/2015/07/02/is-colin-berry-onto-something/","cat":"image_theory","id":"comment-204454","author":"anoxie","site":"shroudstory"},{"title":"Is Colin Berry Onto Something?","post":"And what room temperature would that be and why have clues not be given? As I said, I want to see a Shroud-like image produced by Maillard and published in a peer-reviewed journal. Image no 2. in the link above can serve as a guide.\n\n","date":"July 3, 2015 at 11:10 am","url":"https://shroudstory.com/2015/07/02/is-colin-berry-onto-something/","cat":"image_theory","id":"comment-204456","author":"Louis","site":"shroudstory"},{"title":"Is Colin Berry Onto Something?","post":"Image n° 2 is a superficial coloration, not a shroud like image. Rogers had produced a superfical coloration by Maillard.\n\n","date":"July 7, 2015 at 2:23 am","url":"https://shroudstory.com/2015/07/02/is-colin-berry-onto-something/","cat":"image_theory","id":"comment-204820","author":"anoxie","site":"shroudstory"},{"title":"Is Colin Berry Onto Something?","post":"Dan, you wrote: “Rogers was always respectful to others. That is a big difference.”\nNot until he re-examines Benford-and-Marino’s theory, Ray Rogers (Peace be upon his soul), had FIRST earlier dismissed both of them as being from “the lunatic fringe”. Is it what you think is being respectful?\n\n","date":"July 4, 2015 at 8:23 am","url":"https://shroudstory.com/2015/07/02/is-colin-berry-onto-something/","cat":"image_theory","id":"comment-204503","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Is Colin Berry Onto Something?","post":"Ray Rogers was a thermochemist. He was NO Second Temple period archaeologist, NO forensic archaeologist NO archaeological bloodstain pattern analyst and NO archaeocryptanalyst. As such and irrespective of body hyperthermia, he failed to imagine the possible practice of a (myrhic?) aloetic fumigation to dry out the TS man’s bloodied body (I do hope Louis C. de Figueiredo won’t make any disrespectful ad hominem attacks on me again  just because I am telling the truth re what the real field of a shroud researcher really is and  I think he is/may be(totally) wrong or subjective while substantiating my opinion).\nRe the TS image formation process: Colin Berry mostly kept recycling my own ideas he first discarded (such as light or pre- mordanting, collimation (via cloth-to-body compression/decompression), use of dust — limestone and/or Judean desert-sand dusts and/or Red Heifer ashes). \nRe the most superficial volumetric negative (in the photographic sense) image formation mechanism, my theory is thermal vapours from the gradually decompressing/loosening long inner winding burial sheet tautly compressed lengthwise —and widthwise in smaller outer dry shrouds—and in-soaked and reacting with a lightly/pre-mordanting alkaline water-based solution (made of deposit of mixed starch and detergent on the outside of the linen threads + human lactate residues, limestone dust and maybe Red Heifer ashes) moisturizing the crucifixion victim’s stiff rigid bloodied body have formed the dorsal-and-frontal imprint through a cloth-to-body “sticking-and-gradual-unsticking process” to account for  the integrity of  the blood clots.\n\n","date":"July 6, 2015 at 3:55 am","url":"https://shroudstory.com/2015/07/02/is-colin-berry-onto-something/","cat":"image_theory","id":"comment-204703","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Is Colin Berry Onto Something?","post":"Colin Berrry just “Hey presto” replaced the limestone and/or Judean desert-sand dusts and/or Red Heifer ashes I advocated by his white flour dust.\n\n","date":"July 6, 2015 at 4:10 am","url":"https://shroudstory.com/2015/07/02/is-colin-berry-onto-something/","cat":"image_theory","id":"comment-204704","author":"Max patrick Hamon","site":"shroudstory"}]
