[{"title":"Contact prints from a 3D figure will always be wider and suffer from wrap-around distortion. True or false?","post":"Not only a genius in what you described but a genius in covering his or her trail.  The lack of evidence in creating / transporting such a forgery as you have described should be addressed by Shroud skeptics if skeptics are going to attack and exploit much smaller holes in evidence provided by Shroud supporters.\nAgain, I appreciate your work.  I too would like to see if the image can be replicated by natural means.\n","date":"April 3, 2016 at 10:39 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/12/contact-prints-from-a-3d-figure-will-always-be-wider-and-suffer-from-wrap-around-distortion-true-or-false/","cat":"contact_imprint","id":"comment-7058","author":"Bill","site":"colinberry"},{"title":"Contact prints from a 3D figure will always be wider and suffer from wrap-around distortion. True or false?","post":"This might be a good time to point out that this retired scientist has resumed work on some previous lines of interest, being content now to leave his TS flour-imprinting model on the table so to speak. Yes. I’m happy to respond to questions, but they must address specifics. \nOther interests? I have a new explanation for the enigmatic Silbury Hill in the pipeline, shortly to be published on  another website, far more Google-visible than this one.  I’m assisting a well-known broadsheet journalist  with his investigation into another unsolved mystery, and today posted on the subject of smokeless coal (it’s maybe not as clean-burning as it’s made out to be).\nhttp://colinb-sciencebuzz.blogspot.co.uk/2016/04/is-officially-approved-smokeless-house.html\nSo much to do…   Must now get some sleep.\nGood night.\n","date":"April 3, 2016 at 10:59 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/12/contact-prints-from-a-3d-figure-will-always-be-wider-and-suffer-from-wrap-around-distortion-true-or-false/","cat":"contact_imprint","id":"comment-7059","author":"Colin Berry","site":"colinberry"},{"title":"Contact prints from a 3D figure will always be wider and suffer from wrap-around distortion. True or false?","post":"We aren’t discussing Leonardo or any artist for that matter (imprinting off a template, especially a real person, is technology, not art). We’re discussing a master forger, focused on producing a fake replica that would captivate and convince at first sight. The fact that his handiwork still passes muster in the 21st century shows his genius in keeping things simple but credible – by going for an uncluttered relatively detail-free negative imprint, using the “blood” not body image to identify the subject and manner of death. Again, placing bloodstains in all the biblically-correct locations is technology, not art.\n","date":"April 3, 2016 at 9:54 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/12/contact-prints-from-a-3d-figure-will-always-be-wider-and-suffer-from-wrap-around-distortion-true-or-false/","cat":"contact_imprint","id":"comment-7057","author":"Colin Berry","site":"colinberry"},{"title":"Contact prints from a 3D figure will always be wider and suffer from wrap-around distortion. True or false?","post":"I recognize that it is basically a rhetorical question, but in as much as skeptics attempt to exploit any possible hole in Shroud theories and Shroud supporters, as you yourself have done, it seems only fair to address my question as well.  In as much, you can choose to blow it off, that is your right.\n","date":"April 3, 2016 at 9:43 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/12/contact-prints-from-a-3d-figure-will-always-be-wider-and-suffer-from-wrap-around-distortion-true-or-false/","cat":"contact_imprint","id":"comment-7056","author":"Bill","site":"colinberry"},{"title":"Contact prints from a 3D figure will always be wider and suffer from wrap-around distortion. True or false?","post":"I am discussing one issue – where are the trials, errors, writings, communications, statues, hypotheses -similar to what you are doing here – from the Medieval artist that created the Shroud of Turin?\n","date":"April 3, 2016 at 9:39 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/12/contact-prints-from-a-3d-figure-will-always-be-wider-and-suffer-from-wrap-around-distortion-true-or-false/","cat":"contact_imprint","id":"comment-7055","author":"Bill","site":"colinberry"},{"title":"Contact prints from a 3D figure will always be wider and suffer from wrap-around distortion. True or false?","post":"Sorry Bill. I’ve wasted far too much of my advancing  years addressing your kind of multiple choice tick box “science”.  Select one issue at a time for discussion in depth and I might be interested.\n","date":"April 3, 2016 at 8:36 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/12/contact-prints-from-a-3d-figure-will-always-be-wider-and-suffer-from-wrap-around-distortion-true-or-false/","cat":"contact_imprint","id":"comment-7054","author":"Colin Berry","site":"colinberry"},{"title":"Contact prints from a 3D figure will always be wider and suffer from wrap-around distortion. True or false?","post":"Mr. Berry:\nI appreciate your perspective on the Shroud, and am glad that there are those who are willing to look at the Shroud through all lenses.\nIn another perspective, all of your evidence serves as circumstantial evidence to disprove the Medieval artist theory.  If a Medieval artist was responsible, where are the numerous trials, errors, communications like those that you and many others have done?  Instead there is absolutely nothing, no statues, no writings, no documented trials, hypotheses, nothing.  Was the Medieval artist  so brilliant as to:\n1.  Devise a way to cover up every last one of his tracks (trials, etc.) save one ‘admission’\n2.  Complete a perfect anatomy artwork that is unique to its time\n3.  Create an artwork that uniquely shows up as 3d in VP-8, which he knew nothing about\n4.  Remember to put Palestinian pollens in it\n5.  Fool and confound modern scientists for 35 years\n6.  Fool multiple forensic pathologists into believing it is a real body\n7.  Create an artwork that shows up better in negative photography than natural light\n8.  Put it on an authentic linen from the Middle East\n9.  Do this all by himself, from France.\n10.  Put the blood / paint on before making the image\n11.  And again, do all of the above without leaving a single shred of evidence\nIf someone 700 years from now looks back at this time, they will find an incredible amount of evidence of skeptics attempting to replicate the Shroud of Turin.  Where is the evidence from the person attempting to make the original?\n","date":"April 3, 2016 at 7:58 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/12/contact-prints-from-a-3d-figure-will-always-be-wider-and-suffer-from-wrap-around-distortion-true-or-false/","cat":"contact_imprint","id":"comment-7053","author":"Bill","site":"colinberry"},{"title":"Contact prints from a 3D figure will always be wider and suffer from wrap-around distortion. True or false?","post":"PS: Here are improved images after taking steps to remove the colour difference between ‘flat’  and curved bottle-mounted images,  showing the results before and after applying  “Edit Invert” (tone/colour reversal) in Image J. to convert the image from a “positive” to a “negative”.  (One gets the colour reversal from orange to blue in imageJ whether one wants it or not):\n\n","date":"February 23, 2016 at 7:28 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/12/contact-prints-from-a-3d-figure-will-always-be-wider-and-suffer-from-wrap-around-distortion-true-or-false/","cat":"contact_imprint","id":"comment-7008","author":"Colin Berry","site":"colinberry"},{"title":"Contact prints from a 3D figure will always be wider and suffer from wrap-around distortion. True or false?","post":"Update: 23rd Feb.\n\nCare to guess how and WHY this quickie experiment was done? Clue: there’s a wine bottle behind the picture on the right.\nSee the tail-end of this posting for details.\n","date":"February 23, 2016 at 1:32 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/12/contact-prints-from-a-3d-figure-will-always-be-wider-and-suffer-from-wrap-around-distortion-true-or-false/","cat":"contact_imprint","id":"comment-7005","author":"Colin Berry","site":"colinberry"},{"title":"Contact prints from a 3D figure will always be wider and suffer from wrap-around distortion. True or false?","post":"Casting an eye around the online shroudosphere, admittedly jaundiced through long exposure to pseudoscience, I am frankly amazed at the persistence of so much ossified thinking. Examples? The supposed anomaly in artistic terms of the double-image (Stephen Jones’ site, still setting up this and other strawman targets), or the supposed difficulty presented by the presence of blood (or “blood”)  on a burial shroud (International Skeptics Forum, that term ‘burial’ being yet another unwarranted assumption).\nOne has obviously failed to penetrate the carapace of ‘received wisdom’ that protects so much of sindonology. Must do better.\nToday, I shall start to assemble a “Shroud Manifesto”, one that spells out a distinctly different message than the one currently on offer anywhere else on the internet.\n","date":"January 18, 2016 at 9:02 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/12/contact-prints-from-a-3d-figure-will-always-be-wider-and-suffer-from-wrap-around-distortion-true-or-false/","cat":"contact_imprint","id":"comment-6789","author":"Colin Berry","site":"colinberry"},{"title":"Contact prints from a 3D figure will always be wider and suffer from wrap-around distortion. True or false?","post":"I see umbrage is being taken at the routine deployment of the terms ‘anti–authenticity’ and/or ‘anti-authenticist’ on the International Skeptics Forum, previously the James Randi Education Foundation, its Round 4 interest in the TS now acquiring some of the character of an Icelandic saga.\nhttp://www.internationalskeptics.com/forums/showthread.php?t=299015&page=70\nThis blogger has considerable sympathy with that objection to a term that seems to make authenticity the default position despite the 1260-1390 dating.  Those imaginative, some might say increasingly desperate attempts to explain away that dating by conjecturing this or that oversight or mishandling (especially that so-called invisible patching or mending) do not constitute solidly-based scholarship. (I see even Stephen Jones  is now acknowledging that there was no known representation of the TS head-to-head double image in art prior to the Lirey Pilgrim’s badge, the latter reasonably presumed to have been cast circa 1355, a point this blogger made to some effect on Dan Porter’s site ahead of Jones  shortly prior to its shutdown.\nYes,”anti-authenticist” is a loaded term,, and as such one that should be rejected by all who care about objective rational and scientific enquiry. A better term might be pro (or anti-) medieval provenance. Those who pour scorn on the radiocarbon dating should be pressing for a re-run, albeit more invasive when returning to harvest multiple samples, instead of attempting to blacken the reputations of those who produced the Nature paper under the supervision, indeed (it should be stressed) direction of the Shroud’s curators.\n","date":"January 17, 2016 at 8:49 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/12/contact-prints-from-a-3d-figure-will-always-be-wider-and-suffer-from-wrap-around-distortion-true-or-false/","cat":"contact_imprint","id":"comment-6782","author":"Colin Berry","site":"colinberry"},{"title":"Contact prints from a 3D figure will always be wider and suffer from wrap-around distortion. True or false?","post":"This passage has just been added to the end of the posting – as an afterthought.\nIs not the term ‘lateral distortion’ somewhat misleading? The shape of those discs – circular – did not distort on imprinting. How could it, given the linen stayed approximately tangential to each disc around the circumference? If the truth be told, it’s not the imprint that is distorted, excluding the elongation relative to the cross-sectional width of the bottle (the latter being the diameter, essentially a geometrical construction, ie. imaginary line through the centre of the bottle.). It is the “appearance” of the perceived image of template to the eye or camera that is distorted, inasmuch as those discs appear progressively slimmer and more oval-like as one moves away from the centre.\n I really must make an effort to curb these afterthoughts:\n","date":"January 15, 2016 at 11:30 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/12/contact-prints-from-a-3d-figure-will-always-be-wider-and-suffer-from-wrap-around-distortion-true-or-false/","cat":"contact_imprint","id":"comment-6759","author":"Colin Berry","site":"colinberry"},{"title":"Contact prints from a 3D figure will always be wider and suffer from wrap-around distortion. True or false?","post":"Congratulations Colin.\nYou have shown that there is no obvious wrap-around distortion in the contact imprint coming from a very small template (Galaxy warrior) or a perfect cylinder as long as certain conditions are met.\nAnd then ?\nThen, you have to show that on a real human face and/or a life-size bas relief. \nGiven your experimental model, I see no obstacle to these experiences.\n","date":"January 14, 2016 at 9:14 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/12/contact-prints-from-a-3d-figure-will-always-be-wider-and-suffer-from-wrap-around-distortion-true-or-false/","cat":"contact_imprint","id":"comment-6753","author":"HEIMBURGER","site":"colinberry"},{"title":"Contact prints from a 3D figure will always be wider and suffer from wrap-around distortion. True or false?","post":"Thanks TH. Yes, the face is THE problem, as I’ve discovered from attempting to imprint off my own, or miniatures crafted with baked clay. I’m not rushing to suggest the face was done from a bas relief, since that would rule out imprinting, dare one say modelling  from a real person, but there are a number of things that make a bas relief the obvious candidate, at least from my non-authenticity perspective. Examples that spring to mind are the severe vertical cut-offs at both sides of the TS face, the lack of obvious difference between skin and hair, the relatively small response of the nose to 3D-rendering in Image J etc. I feel in my bones that we are missing something, but still can’t think what. If the answer doesn’t come from the head region, with the most concentrated detail, it’s hard to see where else it will come from. Any ideas?\n","date":"January 14, 2016 at 10:10 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/12/contact-prints-from-a-3d-figure-will-always-be-wider-and-suffer-from-wrap-around-distortion-true-or-false/","cat":"contact_imprint","id":"comment-6754","author":"Colin Berry","site":"colinberry"},{"title":"Contact prints from a 3D figure will always be wider and suffer from wrap-around distortion. True or false?","post":"Update:I have just added a further 10 pix to the posting (scroll down to end as far as “Late addition” in red font). They were an afterthought – an experiment to determine how serious or otherwise is the image elongation when imprinting off a curved surface. A  perfect cylinder (cider bottle) was chosen for the experiment.\nHere’s the final result. See the posting for the preceding steps.\n\n","date":"January 14, 2016 at 6:38 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/12/contact-prints-from-a-3d-figure-will-always-be-wider-and-suffer-from-wrap-around-distortion-true-or-false/","cat":"contact_imprint","id":"comment-6749","author":"Colin Berry","site":"colinberry"},{"title":"Contact prints from a 3D figure will always be wider and suffer from wrap-around distortion. True or false?","post":"How nice it would be to get a comment or two that was relevant to the posting and the chief point that it makes – namely in this posting that partial ‘immersion’ into enveloping linen of a 3D template, specifically 1/3rd of the circumference if cylindrical in cross-section, produces an imprint that is the same size as the template. That makes a nonsense of those categorical assertions that contact imprinting always produces a degree of obvious distortion.\nWelcome as relevant comments are, this site does not exist primarily as a discussion forum, as was Dan Porter’s now lapsed site. It’s a record of a personal research programme, reported in real time. I make no claim that every experiment I do is entirely original, or that I have dutifully read everything written in every language regarding the issues addressed. If anyone knows of specific findings from the past that they think I should be aware of, then there’s a facility for leaving a comment (comment note, as distinct from rant) which is more than can be said for conventional reports in scientific journals. \nThe internet has unique advantages as a medium for instant communication. There’s sadly a downside too, as has of late become plain to see here.\n","date":"January 13, 2016 at 10:40 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/12/contact-prints-from-a-3d-figure-will-always-be-wider-and-suffer-from-wrap-around-distortion-true-or-false/","cat":"contact_imprint","id":"comment-6745","author":"Colin Berry","site":"colinberry"},{"title":"Contact prints from a 3D figure will always be wider and suffer from wrap-around distortion. True or false?","post":"Yes, you have centered the problem…\nhabitual rants don’t help or substitute\nthe serious researches.\nI forgot to quote Delfino Pesce…\n>PESCE DELFINO, V. – Lettera – Pesce Delfino ribatte\nsulla Sindone – Tempo Medico, 15 Aprile 1989, p.3 e 66.\nLink:\nhttp://shrouduniversity.com/libraryarticles2.php\nIn fact the work executed by him, in the past,\nusing a bas-relief made red-hot seems to be hardly credible.\nBut see also what were the ideas by Nickell:\nNickell J.: Inquest on the Shroud of Turin,\nBuffalo: Prometheus Book, 1983\nUnfortunately, here, I cannot leave contributes\nof “high collaboration” with those persons who\ndeny the validity of modern tests, with works of\ncontrol based on advanced types of microscopy\n(= using AFM techniques, AFM-Raman, etc.)…\n— — —\nHere my “feeble suggestion”,\ninstead to observe the bottle’s circumference:\nHave you tried to see what are the IR-Geometries\n(IR = infrared) of the images obtained from the\nsurface of a linen sheet that covers a manikin full\nof liquid (with “body temperatures” near 20-30 Celsius)?\nTry also to put a little sand bag over the linen sheet\nand observe what is the effect (on  image produced\nby IR-Geometry) of the pressure applied from above…\nThis little work can easily be done.\nThis seems to me the first right way to follow…\nAm I wrong?\n","date":"January 14, 2016 at 4:13 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/12/contact-prints-from-a-3d-figure-will-always-be-wider-and-suffer-from-wrap-around-distortion-true-or-false/","cat":"contact_imprint","id":"comment-6748","author":"piero","site":"colinberry"},{"title":"Contact prints from a 3D figure will always be wider and suffer from wrap-around distortion. True or false?","post":"Are you able to work with an useful graphical tool\n[= an animation, in order to improve what you described\nin your own page] and show us … what happens with an increasing\ndegrees of physical contact?\nI doubt you’ll have much luck with your galactic warrior.\nSo far I see no signs of interest as instead was the\nsituation in the blog of Dan Porter (often with long discussions!) …\n— — —\nIn 1980 also father Gaetano Intrigillo obtained\nexperimental impressions by using cloths soaked\nin a watery aloe and myrrh solution, placed on\na clay face equipped with hair, beard and\nmustache human sprayed with sweat and blood,\ncovered with dripping blood and surrounded by\na chin guard (figure 3).\nHere the original text:\n>Nel 1980 anche don Gaetano Intrigillo realizzò\nimpronte sperimentali utilizzando teli precedentemente\nimmersi in soluzione acquosa di aloe e mirra,\nposti su un volto in creta, fornito di capelli, barba\ne baffi umani, spruzzato con sudore e sangue,\ncosparso di colature ematiche e circondato\nda una mentoniera (figura 3)\nLink:\nhttp://www.sindone.org/santa_sindone/la_sindone/00024091_teoria_del_contatto.html\nColin,\nDo you are able to describe for us, poor readers,\nwhat is the exact difference between what did Intrigillo\n(and other researchers) and your new attempts?\n— —\nPlease, could you give a vote (for example: from 1 to 10)\nfor each of the following names?\n– Paul Vignon,\n– Ruggero Romanese\n– Giovanni Judica Cordiglia,\n– Sebastiano Rodante\n– Gaetano Intrigillo\n– Emily Craig\n– Paul-Eric Blanrue\n– Luigi Garlaschelli\nThank you in advance…\n","date":"January 13, 2016 at 4:27 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/12/contact-prints-from-a-3d-figure-will-always-be-wider-and-suffer-from-wrap-around-distortion-true-or-false/","cat":"contact_imprint","id":"comment-6743","author":"piero","site":"colinberry"}]
