[{"title":"Has there ever been a single, undeniable, unmistakable photograph of any of these things on the shroud?","post":"Yes, at least as far as Pilate coins’ very partial imprints on the TSM orbital image area are concerned. \nWARNING: don’t you rely on the Shroudcope or Tom Wolfe’s video stills of the Shroud face as the photographs are biased (loss of very tiny details 0,4-1,5mm in size). The best photographs to be used here are 1931 Enrie, 1978  Miller (B& W) and 2002 Durante Shroud face (and HAL 2008?) real close ups.\nOnly authentic/first generation and second photographic copies of the TS face photographs (real close up)  of the related areas do yield the relevant numismatic information through magnication and enhancements of  2-3 suspected areas (3D, digital squeeze and red paint brush).\n\n","date":"August 29, 2013 at 3:58 pm","url":"https://shroudstory.com/2013/08/29/has-there-ever-been-a-single-undeniable-unmistakable-photograph-of-any-of-these-things-on-the-shroud/","cat":"image_theory","id":"comment-42333","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Has there ever been a single, undeniable, unmistakable photograph of any of these things on the shroud?","post":"The Shroud Scope has several photographs as they were distributed to many researchers.\nThe Shroud Scope can show the 1931 Enrie photograph (negative version) without any digital pre-processing and also the (positive) 2002 Durante Shroud Face Only without any digital pre-processing when these photographs and the highest level are selected. At other zoom levels, only a rescaling is done according to the zoom level selected. Therefore, I do not understand why you wrote that the Shroud Scope does not present the 1931 Enrie photograph. Am I interpreting incorrectly the statement you made above (#1)?\n\n","date":"August 29, 2013 at 10:13 pm","url":"https://shroudstory.com/2013/08/29/has-there-ever-been-a-single-undeniable-unmistakable-photograph-of-any-of-these-things-on-the-shroud/","cat":"image_theory","id":"comment-42379","author":"Mario Latendresse","site":"shroudstory"},{"title":"Has there ever been a single, undeniable, unmistakable photograph of any of these things on the shroud?","post":"Hi Mario! \nYes you are. My comment was ONLY referring to the Shroudscope “2002 Durante Shroud face only” (this is not a “real” close up of the Shroud face but just a detailed view from the 2002 Durante OVERALL photograph (as far as I could judge by comparison with the authentic 2002 Durante Shroud Face photograph and 1978 Miller’s and 1931 Enrie’s). A few very minutes details (0.4 to 1.5 mm in size) are lacking. You should check with Mgr Ghiberti.\n\n","date":"August 30, 2013 at 8:04 am","url":"https://shroudstory.com/2013/08/29/has-there-ever-been-a-single-undeniable-unmistakable-photograph-of-any-of-these-things-on-the-shroud/","cat":"image_theory","id":"comment-42395","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Has there ever been a single, undeniable, unmistakable photograph of any of these things on the shroud?","post":"Hi Max! The 2002 Durante Face Only on the Shroud Scope is NOT a “detailed view” of the face digitally taken from the overall Durante 2002 because the Face Only image has a higher resolution than the overall one. It is a “real” close up in the sense that it has a higher resolution. According to your message you would have a different 2002 Durante Face Only. What is the resolution of that image (pixel per mm) that you have?\n\n","date":"August 30, 2013 at 12:25 pm","url":"https://shroudstory.com/2013/08/29/has-there-ever-been-a-single-undeniable-unmistakable-photograph-of-any-of-these-things-on-the-shroud/","cat":"image_theory","id":"comment-42406","author":"latendre","site":"shroudstory"},{"title":"Has there ever been a single, undeniable, unmistakable photograph of any of these things on the shroud?","post":"I should have added that the details about the resolution of the images presented on the Shroud Scope are discussed on the following help page http://www.sindonology.org/shroudScope/shroudScopeHelp.shtml. In particular, as described on that help page, the resolution of the 2002 Durante Face Only image is  0.08 mm per pixel (said differently, 12.5 pixels per mm) whereas the 2002 (overall) Durante image resolution is 0.1905 mm per pixel (said differently, 5.25 pixels per mm). Therefore, the Face Only image is more than twice the resolution of the overall image. The Face Only image is a close-up view of the overall image because the Face Only image is not blurry at the 0.08 mm per pixel resolution.\n\n","date":"August 30, 2013 at 12:55 pm","url":"https://shroudstory.com/2013/08/29/has-there-ever-been-a-single-undeniable-unmistakable-photograph-of-any-of-these-things-on-the-shroud/","cat":"image_theory","id":"comment-42409","author":"latendre","site":"shroudstory"},{"title":"Has there ever been a single, undeniable, unmistakable photograph of any of these things on the shroud?","post":"Max ~ With great respect to you, the 1931 Enrie photo is not a good photo to do research on due to the nature of the pushed contrast image.  Pushed contrast changes the image itself scaling to only all back or all white and getting rid of the middle colors.  FOr these reasons, I respectfully disagree with that statement.\n\n","date":"August 31, 2013 at 2:48 pm","url":"https://shroudstory.com/2013/08/29/has-there-ever-been-a-single-undeniable-unmistakable-photograph-of-any-of-these-things-on-the-shroud/","cat":"image_theory","id":"comment-42509","author":"Andy Weiss","site":"shroudstory"},{"title":"Has there ever been a single, undeniable, unmistakable photograph of any of these things on the shroud?","post":"Andy, with great respect to you, \nFirst and foremost and as far as the 1931 Enrie Shroud face photograph is concerned, the deep contrast comes mainly from the use of an oblique lighting, which, in terms of archaeological inscription/imprints, is the best way to reveal any inscriptions/imprints that are really  there but nearly invisible to the naked eyes. Ask any forensic image analyst, glyptographist, paleographer or archaeologist worth his salt, he will confirm you the use of such ‘a revealing technique’ to help him to read inscription or imprint. \nSecondly THE SAME intriguing minute patterns DOES ALSO show (though a little less constrasted) on BOTH 1978 Miller’s and 2002 Durante’s Shroud photographs (I still have to check Hal 2008 Shroud eye area photographs).\nThe FACT is no less than THREE different photographic procedures (orthochomatic, traditional silver and digital) and a very close eidomatic numismatic reading grid based on the the blood pattern analysis, do confirm the presence of partial Pilate coin patterns on both eyes each time. \nThere “those who think they see” what is not really there (and are all too prone to be the victim of pareidoliae,  semi pareidoliae in terms of misreading namely Filas et al) AND “those who think they don’t see” what is really there (and are all too prone to judge it is just “crazy stuff” namely Dan, Schwortz etc). There is ‘a third way’ to SEE what is really and not really there and that’s my way as a professional cryptologist who applies his Art to both Archaeology and Criminology.\n\n","date":"August 31, 2013 at 4:23 pm","url":"https://shroudstory.com/2013/08/29/has-there-ever-been-a-single-undeniable-unmistakable-photograph-of-any-of-these-things-on-the-shroud/","cat":"image_theory","id":"comment-42519","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Has there ever been a single, undeniable, unmistakable photograph of any of these things on the shroud?","post":"Correction: Only DIGITIZED/DIGITAL authentic/first generation and second photographic copies of the TS face photographs (real close up)\n\n","date":"August 29, 2013 at 4:05 pm","url":"https://shroudstory.com/2013/08/29/has-there-ever-been-a-single-undeniable-unmistakable-photograph-of-any-of-these-things-on-the-shroud/","cat":"image_theory","id":"comment-42336","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Has there ever been a single, undeniable, unmistakable photograph of any of these things on the shroud?","post":"The true fact is, in the Second  Temple period, the custom was not ‘prevalent’ but most likely only SPORADIC among hellenized (originally Sadduccean?) liberal Phariseans (mainly from Cyprus?).\n\n","date":"August 29, 2013 at 4:15 pm","url":"https://shroudstory.com/2013/08/29/has-there-ever-been-a-single-undeniable-unmistakable-photograph-of-any-of-these-things-on-the-shroud/","cat":"image_theory","id":"comment-42337","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Has there ever been a single, undeniable, unmistakable photograph of any of these things on the shroud?","post":"Re “The Shroud also seem[ing] to have a kind of X-ray quality, for teeth can partially be seen showing through the slightly open lips”,.\nThis is an optical illusion due to the fact the TS body image was recorded as the long inner shroud aka Turin Shroud was in-soaked with a watery solution and tightly compressed next to the skin in shrouds.\nIn the Manotppello Veil, Yeshua’s face is  featured with teeth as the dyer-copist did copy what he believed he saw on Yeshua’s burial shroud.\n\n","date":"August 29, 2013 at 4:32 pm","url":"https://shroudstory.com/2013/08/29/has-there-ever-been-a-single-undeniable-unmistakable-photograph-of-any-of-these-things-on-the-shroud/","cat":"image_theory","id":"comment-42342","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Has there ever been a single, undeniable, unmistakable photograph of any of these things on the shroud?","post":"The optical illusion is due to banding.\n\n","date":"August 29, 2013 at 4:34 pm","url":"https://shroudstory.com/2013/08/29/has-there-ever-been-a-single-undeniable-unmistakable-photograph-of-any-of-these-things-on-the-shroud/","cat":"image_theory","id":"comment-42343","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Has there ever been a single, undeniable, unmistakable photograph of any of these things on the shroud?","post":"The letter is written by one Claire Allen, but so far I have been unable to check on her credentials.  She asserts these alleged attributes as definite facts, when in truth they are disputed by as many experts who propound them. This is misleading.  It is not sufficient for an attribute to be true for it to be a fact. It must also be KNOWN to be true. When there is oontroversy about the assertion, it cannot be said to be KNOWN to be true, and hence it is not a FACT. A number of investigators have claimed to have discerned the various attributes, but others have denied them. It would seem that Ms Allen has only considered those claims which have made the assertions. Even the claims made by dirt on the feet being Jerusalem limestone lack peer review.  As I said, they may be true, but in the present state of knowledge, they cannot be asserted as such.\n\n","date":"August 29, 2013 at 4:38 pm","url":"https://shroudstory.com/2013/08/29/has-there-ever-been-a-single-undeniable-unmistakable-photograph-of-any-of-these-things-on-the-shroud/","cat":"image_theory","id":"comment-42344","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Has there ever been a single, undeniable, unmistakable photograph of any of these things on the shroud?","post":"Dave, whenever I CAN SEE/CHECK my illustrative tables (3D, digital sueeze and red paint brush enhancements of the TS man’s right and left eye area, this is a FACT. One of my three tables does confirms what both an American professional numismatist and an Israeli scholar numismatist years ago “sensed” as far as the Pilate partial coin imprint on the right eye is concerned.\n\n","date":"August 29, 2013 at 4:56 pm","url":"https://shroudstory.com/2013/08/29/has-there-ever-been-a-single-undeniable-unmistakable-photograph-of-any-of-these-things-on-the-shroud/","cat":"image_theory","id":"comment-42348","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Has there ever been a single, undeniable, unmistakable photograph of any of these things on the shroud?","post":"After the ‘cat chase’ (a cat hidden/camouflaged in full view in a photograph) the time  will come for a “Pilate coin chase”(partial coin imprint hidden in full view)…\n\n","date":"August 29, 2013 at 5:09 pm","url":"https://shroudstory.com/2013/08/29/has-there-ever-been-a-single-undeniable-unmistakable-photograph-of-any-of-these-things-on-the-shroud/","cat":"image_theory","id":"comment-42350","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Has there ever been a single, undeniable, unmistakable photograph of any of these things on the shroud?","post":"Once you’ll see the Pilate coin partial imprint, I’ll guarantee you, you’ll be able to see them and become aware they were there all the time…\n\n","date":"August 29, 2013 at 5:13 pm","url":"https://shroudstory.com/2013/08/29/has-there-ever-been-a-single-undeniable-unmistakable-photograph-of-any-of-these-things-on-the-shroud/","cat":"image_theory","id":"comment-42351","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Has there ever been a single, undeniable, unmistakable photograph of any of these things on the shroud?","post":"Max, I take it you have read Ms Allen’s published letter in full where she makes several assertions, not only those quoted above. In a letter published in a prominent Catholic paper, they are represented as FACTS. My point is that it is irrelevant whether the claims she makes are true or not.  It is also irrelevant whether you or I agree or disagree with them. Several of the assertions she makes are known to be disputed by experts as equally qualified as those who claim them, or else they lack proper peer review. In my view it is misleading to represent these assertions as known and accepted facts, when there is lack of agreement among those qualified to judge.  When there is lack of agreement we can only speak of informed opinions, not irrefutable assertions. Ms Allen, you and I are all entitled to our own informed opinions, and to promulgate them as opinions, regardless of whether they are true or not. We are not entitled to represent or publish them as FACTS.\n\n","date":"August 29, 2013 at 6:16 pm","url":"https://shroudstory.com/2013/08/29/has-there-ever-been-a-single-undeniable-unmistakable-photograph-of-any-of-these-things-on-the-shroud/","cat":"image_theory","id":"comment-42356","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Has there ever been a single, undeniable, unmistakable photograph of any of these things on the shroud?","post":"Dave,\n Re allegedly archaeological opinion being definitely  NOT proven archaeological fact, I just cannot but agree with you. \nHowever the fact remains the same principle applies to both “those who think they see” what is not really there ((and are all too prone to be the victim of pareidoliae or semi pareidoliae) AND “those who think they don’t see” what is really there (and are all too prone to judge it is just “crazy stuff”).  \nSceptics are right in a way as Filas et al did fail to REALLY demonstrate/prove the presence of such patterns.  Sceptics should also be reminded thoiugh of the possibilty for the patterns to have been more “sensed” than correctly identified so far.\nNow if Dan accept to publish on his blog a short Flash Illustrative Reply  of mine (as a sort of backF.I.RE to that neverending coin-on-eye scepticism/advocacy), I can help you et al to finally START FIGURING OUT FOR YOURSELF there are very partial Pilate coin imprints on the TS face eye areas INDEED.  \nIf accepted, my flash paper would be entitled then “The Turin Shroud & the Pilate coin chase” and subtitled “Are there really partial coin imprints hidden in full view?”.\n\n","date":"August 30, 2013 at 7:42 am","url":"https://shroudstory.com/2013/08/29/has-there-ever-been-a-single-undeniable-unmistakable-photograph-of-any-of-these-things-on-the-shroud/","cat":"image_theory","id":"comment-42394","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Has there ever been a single, undeniable, unmistakable photograph of any of these things on the shroud?","post":"Re “Imprints seen under magnification on the Shroud reveal those of flowers and spices used in the Jewish burial procedure.”\nGenuine floral images around or on the TS face do show in 3D images and digital squeeze and confirm not all but some of Avinoam Danim’s findings.\n\n","date":"August 29, 2013 at 4:41 pm","url":"https://shroudstory.com/2013/08/29/has-there-ever-been-a-single-undeniable-unmistakable-photograph-of-any-of-these-things-on-the-shroud/","cat":"image_theory","id":"comment-42345","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Has there ever been a single, undeniable, unmistakable photograph of any of these things on the shroud?","post":"To answer your question, Dan – nope.\n\n","date":"August 31, 2013 at 2:44 pm","url":"https://shroudstory.com/2013/08/29/has-there-ever-been-a-single-undeniable-unmistakable-photograph-of-any-of-these-things-on-the-shroud/","cat":"image_theory","id":"comment-42508","author":"Andy Weiss","site":"shroudstory"}]
