[{"title":"Radiation Man:  A New BSTS Article","post":"At least this experiment accounts for the missing thumbs. If you had a GI Joe with ‘kung fu grip’ you’ll know that the first thing to break off that hands were the thumbs!  Jesus must have had ‘kung fu grip’.\n\n","date":"January 24, 2014 at 9:18 am","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-74378","author":"David Goulet","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"This experiment, and others, lead me to a question about the Shroud. Why was the linen folded over the body at the head and not by the side of the body? It seems a less efficient way to wrap a body than via a side fold. I know of no hospital or morgue that would think to fold a death sheet in such a way.\n I recall someone here speaking of how Jewish burial shrouds were often altar cloths… do I recall that correctly? That would explain why the sheet was longer than it was wide and would necessitate such an odd fold.\nWhich brings me back to a comment that Daveb shared that if the Shroud is a medieval creation why would the artisan not have used a side fold — the most common way to cover a body? How would the artisan have known of Jewish burial customs?\nPerhaps a future GI Joe experiment, or bas belief crucifix, could try using a side fold to see if that would make any measurable difference to the image.\n\n","date":"January 24, 2014 at 9:29 am","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-74382","author":"David Goulet","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"I speculated at some point that a) shrouds were not long and thin, and b) that even if they had been, they would have been folded over the feet rather than head. It was speculation, as my knowledge of burial shrouds of any age is pretty meagre, and I have since learnt that there are some Egyptian mummy shrouds that are indeed long and thin, and which seem to have been tied top and bottom (rather like a wrapped sweet).\nUndeterred, having so speculated, I wondered why a forger, or artist, or icon painter, might want to use a long thin sheet, folded at the head.\na) to fill a particular space, such as a reredos?\nb) to act as an altar cloth, as Byzantine churches still do?\nc) because a bolt of 1m wide cloth was available and to make a seam down the middle of the image seemed irreverent?\nand\nd) if the image was used for display or as part of a rite, the most important part of it should be in the middle.\nJust ideas…\n\n","date":"January 24, 2014 at 10:05 am","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-74386","author":"Hugh Farey","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"Message to Hugh:  I hope you won’t pass by this comment of mine: https://shroudstory.com/2014/01/21/cat-among-the-pigeons/#comment-74381\nI ask you an important question in it regarding your recent BSTS article…\n\n","date":"January 24, 2014 at 11:52 am","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-74406","author":"Anonymous","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"I’ve been working on it, Anonymous, and replied on that page. Thanks.\n\n","date":"January 24, 2014 at 1:55 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-74414","author":"Hugh Farey","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"The problem with all those hypothesis involving a burst of energetic radiation is the fact that they can’t account for the reality of the Shroud image at fiber level, in the sense that we know that the image formation process was only able to color one, maybe 2 fibers in deep AND, AT THE SAME TIME, was able to do so not only at direct contact points between the body and the cloth, but at some close distance (up to something probably between 2 and 4 cm away from the corpse).\nIn my mind, if a radiation process involve the same amount of energetic release from every point of the body, no doubt that such a process will colored more than 1 or 2 fibers deep into the cloth at contact points if it is able to color only 1 or 2 fibers deep in zones where the source is located something between 2 to 4 cm away from the cloth.\nI hope people understand my reasonning here.  Note that Di Lazzaro never directly address this theoretical issue in all the papers he published over the years concerning his UV light hypothesis, no more than Fanti concerning his Corona discharge hypothesis or Colin with his scorch hypothesis…  The  day Di Lazzaro, Fanti or Colin will show me 2 pieces of linen cloth that will show the same exact extremely thin color penetration of 1 or 2 fibers coming from 2 different set-up (one where the source of energy would have been placed in direct contact with the cloth and the other one where the same exact source of energy would be placed at 3 cm or so), I will start to consider more seriously their hypotheses…  But I seriously doubt they’ll be able to show me this kind of coloring result before I die.\n\n","date":"January 24, 2014 at 11:51 am","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-74405","author":"Anonymous","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"Just to summarize my reasoning, I would say that it is extremely hard for me to buy the idea that some burst of energetic radiation located in direct-contact with a linen cloth could only colored 1 or 2 fibers deep on the top surface of that cloth, while the same exact sort of burst of energy (with the same exact intensity) could produce the very same result for the color penetration if we place the source of energy at 3 cm or so from the cloth.\n\n","date":"January 24, 2014 at 2:00 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-74415","author":"Anonymous","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"Why would a forger use a long thin cloth to simulate a Shroud? Maybe the Shroud is authentic, but the Why? question still remains! \nThere has been some speculation as to how Joseph of Arimathaea may have come by the Shroud. A Synoptic gospel merely says he “bought a Shroud”, but maybe that’s just shorthand. Passover that year was very special as it fell on the sabbath, and Preparation day may well have been a public holiday, and maybe the Jerusalem market had closed early. In the afternoon the paschal lambs were already being slaughtered at the temple.  One explanation might be that it was originally intended as Joseph’s own personal Shroud, which would have befitted his station.  Van der Hoeven made a speculative case for it being John Mark’s temple garment that he dropped in the garden at Gethsemane; then picked up by one of the guards, and given to Pilate. When Joseph sought permission to claim the body, he was then able to reclaim it for a burial cloth. As I said, “speculative”. Alternatively, it may have been Joseph’s own temple garment. There does seem to be a problem in how such an expensive cloth could have been acquired at such short notice on that day, and why such an expensive cloth was used for that purpose. But there can only be speculation with such plausible arguments that can be mustered in support of any hypothesis.\n\n","date":"January 24, 2014 at 4:08 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-74445","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"It’s an interesting experiment. It takes me back to my very early days for printing copies of engineering drawings with photographic paper, also the taking of profiles of corroded rail sections. All these of course were only two dimensional. \nI can see flaws in the underlying hypothesis. Were the light sensitive properties of say silver salts known in the 13th c., I don’t know.  No traces of such salts or similar mineral light sensitive salts have ever been found on the Shroud cloth. That’s a large amount of silver to be spread on a 4m x 1m surface, and also a large amount of phosphorescent paint. Ensuring uniform density of both chemicals could be an insuperable challenge, assuming it occurred to the artist to take the need of it into account. ‘Anonymous’ mentions the superficiality of the Shroud image; photo salts would I expect penetrate the fibres. The actual chemical nature of the image grains is still enigmatic, some have mentioned oxidation of the PCW or linen coating, and a mineral content would seem excluded.  \nI still wouldn’t exclude radiation as a factor, not necessarily as the primary image formation mechanism, but as a vehicle or facilitator in the process (seismic radiation, or geo-magnetism perhaps).\n\n","date":"January 24, 2014 at 5:48 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-74461","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"I don’t know that Hugh Duncan reads this blog, so if I may I’ll suggest that he does not claim that the body in the Shroud was painted in a luminous material, or that the Shroud itself was photosensitive. I think he simply took a fairly often expressed idea, that radiation from the body – of some kind – might interact with the Shroud – somehow – to produce an image, and ran with it. If he had a particular point, it might be that many people have speculated about a radiation/image possibility, but no one has actually tried to see whether it works at all or not. I was surprised at how well it did, myself.\n\n","date":"January 24, 2014 at 7:02 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-74468","author":"Hugh Farey","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"The problem is that it surely don’t work AT FIBER LEVEL.  As Barrie Schwortz said so nicely in various interviews:  Something can look like the Shroud but if it doesn’t replicate all the known physical and chemical characteristics of the image, it’s not the same thing (and I would add: “so, in the end, it must be seen as unrelevant”).\n\n","date":"January 25, 2014 at 7:55 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-74601","author":"Anonymous","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"Whenever someone says  “it does not work at the fiber level” my advice is to run for the hills. Alternatively, set up a lab for viewing things at the fiber level. You may find that what you see has not been reported previously. That is the joy of science – finding  new territory that others would have you believe has already been thoroughly explored- and ruled uninteresting and not worthy of further investigation. That’s your cue to investigate further. Chances are, you’ll discover entirely new territory where you are not supposed to  go. Don’t pursue a career in science unless you are prepared to step  into the unknown where others say you are not supposed to go. Science is about moving from the known to the unknown – and is not for the faint-hearted.\n\n","date":"January 25, 2014 at 8:21 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-74603","author":"colinsberry","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"\ncolinsberry :\n Science is about moving from the known to the unknown – and is not for the faint-hearted.\n\nSubstitute ‘science’ with the word ‘life’ and it’s doubly true.\n\n","date":"January 25, 2014 at 9:07 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-74605","author":"David Goulet","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"Although I completely agree that all the characteristics of the Shroud image have to be accounted for before an explanation of its creation can be acceptable, it is remarkable that the photographic hypothesis is one of the few that does work “at the fibre level.” What’s more, and unlike most other demonstrations, this has been shown many times, by Nicholas Allen, Narthan Wilson, Picknett & Prince, and even myself (http://www.shroud.com/pdfs/n39part6.pdf). Reproducibility of experimental findings being another important aspect of scientific discovery.\n\n","date":"January 26, 2014 at 5:18 am","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-74640","author":"Hugh Farey","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"Does work at fiber level?  Show me real proofs of this…  \nAnd with those experimental proofs (i.e. microscopic photographs showing the same kind of fiber coloration and the same absence of color penetration), I want you to also explain to me how in the world a source of light that would only be able to color one fiber deep at a distance of maybe 3 or 4 cm away from the cloth would also colored only one fiber deep in other parts where the cloth is in direct contact with the source of light?  In my mind, there is only one hypothesis that have been proposed so far to explain this and it’s the one of Rogers involving a thin layer of impurities that would be located at the top surface of the cloth.  But the only problem with Rogers’ hypothesis for the image chromophore versus any image formation hypothesis involving a burst of high energetic radiation like a burst of light is the fact that, as Rogers wrote, it’s almost impossible for such a source of high energy to be able to color only the layer of impurities without also affecting the underlying fiber (thus causing a deeper color penetration, especially in areas where the source of energy is in direct-contact with the cloth). \nIn order to have a real proof that such a hypothesis would work at fiber level, you would need to have a linen cloth covered with a thin layer of carbohydrate impurities and make two tests of coloration: one with the source of energy located in direct-contact with the cloth and another with the source of energy (which would be of the same exact intensity as the first test) located at 3 cm or so and microscopically prove that, IN BOTH CASES, only the thin layer of impurities has been colored without the production of any noticeable defects anywhere in the structure of the underlying fibers and with no more color penetration for the test done with the source of energy located in direct-contact with the cloth than the other test done with the source of energy located away from the cloth…  Good luck!\n\n","date":"January 26, 2014 at 7:20 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-74735","author":"Anonymous","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"I think you’re getting muddled here. The source of light in the Nicholas Allen, Nathan Wilson and Picknett & Prince experiments was the sun, and in mine was a projector bulb some distance from the cloth. Allen, Picnett & Prince and I used photosensitive chemicals which discoloured only one side of the cloth substrate as part of the photomoderated reaction. Wilson simply left his cloth with the sun shining on it.\n\n","date":"January 26, 2014 at 8:12 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-74748","author":"Hugh Farey","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"“only one side of the cloth substrate” do not mean in any way that you or the others were able to only color a layer of one single fiber deep on the cloth’s surface while leaving the underlying fibers uncolored and undammaged…\n\n","date":"January 26, 2014 at 8:27 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-74751","author":"Anonymous","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"Question for Hugh:  How can you apply “photosensitive chemicals” so that only the first fibers on the top surface of the cloth will be covered by them?  In other words, how can you completely prevent those chemicals to go deeper into the cloth, thus allowing a coloring chemical reaction with the source of light that would affect (color) fibers deeper into the cloth?\nI’m very curious about that.  Would you use the evaporation-concentration phenomenon to do so?  I’m skeptical that it could have the same high concentration effect as it could do for carbohydrate impurities for example.  Unless mayve the “photosensitive chemicals” you used are in a solid state and not in a liquid state…  Maybe…  Would need evaporation tests on linen samples to know this for sure.\n\n","date":"January 27, 2014 at 11:39 am","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-74835","author":"Anonymous","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"Thank you for your question, Anon; I didn’t make myself clear. In my experiment, the photosensitive solution (potassium dichromate in water, with a touch of egg-white for glue, if I remember) was rubbed thoroughly over and into the entire cloth. When it dried the cloth was stiff and yellow on both sides. It was exposed to a projector lamp shining through a photographic negative, and turned shades of brown, with a clear positive image on one side. The entire cloth was then rinsed very thoroughly, boiled and ironed, and the dichromate was washed away, leaving a faint image on one side of the cloth. I did not at the time have a microscope sufficiently powerful to study individual fibres. Whether Picknett & Prince and the others did or not I couldn’t say. Also, at the time I didn’t think about the fact that an evaporation concentration gradient might have concentrated the solution on the surfaces of the cloth. That may have contributed. Nathan Wilson claims that his image was superficial, without the use of any chemicals, although I have not seen any micrographs of his fibres.\nAs the source of energy for most of the photograph experiments was the sun, it does not make a lot of sense to carry out an experiment with “the source of energy located in direct-contact with the cloth,” nor another one “located at 3 cm or so.”\nNor do you need to have a cloth “covered with a thin layer of carbohydrate impurities,” unless you are wedded to Rogers’s impurity layer hypothesis, which is far from established.\n\n","date":"January 27, 2014 at 2:08 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-74852","author":"Hugh Farey","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"After reading you, I think it’s truly possible then that you can obtain a very superficial image on a linen cloth that way, because it rely on the same kind of evaporation-concentration phenomenon described by Rogers.\nNevertheless, such a hypothesis, in the case of the Shroud, is truly irrelevant (on the contrary to Rogers’ own hypothesis) because of the evidence of the bloodstains, which indicate that the image must have come from a real torture and crucified corpse…\n\n","date":"January 27, 2014 at 4:41 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-74871","author":"Anonymous","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"By the way, the last part of my above statement is also true concerning Colin Berry’s scorching hypothesis…  Sorry for you guys but the blood and serum stains are there on the Shroud to totally contradict your ideas (which are good try nevertheless).\n\n","date":"January 27, 2014 at 4:45 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-74873","author":"Anonymous","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"Question for Colin Berry:  How in the world the same exact source of heat (with pretty much the same intensity) could only color the first fiber at the top surface of a linen cloth while the source of heat is located at 3 or 4 cm away from the cloth and, AT THE SAME TIME, could also color ONLY the first fiber at the top surface of the same linen cloth while the very same source of heat is located in direct-contact with the cloth?\nTheoretically speaking, I think it’s fair to say that such a scenario seem close to absolute zero in term of probability…\n\n","date":"January 27, 2014 at 11:42 am","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-74837","author":"Anonymous","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"If you want my opinion, then all you have to do is ask. But kindly wait for an answer before attempting to preempt my reply with your probability assessments. I do not take questions under any kind of duress.\nIn fact, I will make a posting of your question, and provide a short answer on my own site.\n\n","date":"January 27, 2014 at 1:00 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-74843","author":"colinsberry","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"I think this is a truly important question to answer.  Especially concerning hypotheses like yours.  My answer wasonly theoretical and based on good sense.\n\n","date":"January 27, 2014 at 2:02 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-74851","author":"Anonymous","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"\nAnonymous :\nI think this is a truly important question to answer.  Especially concerning hypotheses like yours.  My answer was only theoretical and based on good sense.\n\nHere’s a link to an answer that is informed by experiment as well as theory. \nhttp://shroudofturinwithoutallthehype.wordpress.com/2014/01/27/response-to-a-confontational-question-on-shroudstory-com-from-anonymous-re-modelling-of-the-shroud-image/\n\n","date":"January 27, 2014 at 2:09 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-74854","author":"colinsberry","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"I just printed your reply on your website.  I will read this carefully tonight and come back to you as soon as possible.\n\n","date":"January 27, 2014 at 4:43 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-74872","author":"Anonymous","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"I read your answer on your website and I found 2 problematic aspects of the whole question that you did not addressed properly:\n1- You never told us how you can avoid, with the same degree of heat, any color penetration deeper than one or two fibers into the cloth, no matter if the source of heat is placed in direct contact with the cloth or at 3 or 4 cm away from it, which is the result you need to achieve in order to reproduce properly the body image of the Shroud man in 3D (as it was demonstrate by Jackson et al. from STURP in their 3D study).  Effectively, if you only produced direct-contact scorches, the 3D rendering of your image should look like valleys and plateau instead of showing a real 3D.  In fact, all you address was the color penetration inside one single fiber, but I did not find anything regarding the ability of your process to restrict the production of colored fibers to just one, maybe two fibers deep into the cloth and no more than this, no matter if the source of heat is located in direct-contact with the cloth or at 3 or 4 cm away from it.  And be sure that no matter what you can think or write about that, in order to convince me, you would need to show me microscopic photos to back you up.  I say: good luck my friend!  Note:  there are PCW able to get colored more easily than the inner part of the linen fibers EVERYWHERE inside the cloth and not just on the top surface of the cloth.  I seriously doubt that you could achieve the feat of being able to restrict your color penetration to one single fiber on the top surface of the cloth… And even if you would be somehow able to do so, it would only be with one of the two set-up I talked about (direct-contact and 3-4 cm location from the source of heat) and never with both…\n2- Concerning the production of color at a distance from the cloth, you wrote: “…PCW may become discoloured in affected threads (note that there are PCW everywhere inside any thread, and not just on the top surface of the thread) even with a small air gap (BUT NOT EXCESSIVE – MILIMETRES RATHER THAN CENTIMETRES).  I’m sorry Colin, but this DO NOT MATCH the results of Jackson et al. from STURP who specifically wrote that the image formation process was able to color any given thread up to a distance of 3.7 cm.  Taking what you said and what Jackson et al. said into account, how can you still think you can achieve, with the use of heat, an image with the same exact properties as the one we see on the Shroud?\n\n","date":"January 28, 2014 at 9:30 am","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-74957","author":"Anonymous","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"The rather esoteric skill of scorching linen is one I practice quite a lot now. I have not found it easy only to discolour the top few fibres using statues, but it is relatively simple using, for example, a hot metal spatula brushed over the surface. In theory, an entire image could be ‘painted’ using this process, but it would be very difficult and probably pointless. However it is not impossible that, using Colin’s damp suppression method, something similar could be achieved using a bas relief.\nOf, course, using a bas relief or a heated spatula, then the distance of the cloth from the hot object is never more than a few millimetres, and the apparent “distance/intensity” is an illusion caused by the variation of contact pressure between the two surfaces. It would only be by using an actual body shape that the same observed phenomenon would describe an actual situation rather an apparent one.\nAs soon as one postulates an image formed at a distance, one is immediately confronted with the twin problems of the direction in which the image forming agent dispersed, and the shape of the cloth over the body. These have not been satisfactorily resolved.\n\n","date":"January 28, 2014 at 10:07 am","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-74962","author":"Hugh Farey","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"As I said in my previous comment:  in order for me to buy this, I need some microscopic photographs that will prove that.\nAnd even if such a heat process could really produce a complete image (front and back) of a man with absolutely no color penetration anywhere (just saying this is almost non sense to me), this would not answer why a medieval forger would have wanted to accomplish such a feat that was impossible to see to the naked eye anyway!!!  \nLook, I can buy the improbable idea of a forger who would have wanted to created a sort of ghost image of Jesus on a burial cloth in order to produce an enigmatic false relic, but I’m not ready to buy the idea that, along with this, he would have taken time to make sure that there would have been absolutely no more color penetration is darker zones than in lighter zones. \nIt’s fun to imagine things, but one day, we must also be logical and rational…\n\n","date":"January 28, 2014 at 11:39 am","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-74972","author":"Anonymous","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"Question for Colin Berry:  Have you noticed that, when we look at the Quad mosaic photos of the Shroud, the color of the body image is very much like the color of the scorched areas…  I wonder if you noticed that (pretty sure you did) and I would like to ear you about that.\nFor me, this is another indication of what Jackson often said about the fact that the chemical reaction that lead to the formation of the body image looked like a scorch, even though there seem to be some slight differences (at least between the properties of the scorches that are on the Shroud and the body image)…\n\n","date":"January 27, 2014 at 4:49 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-74874","author":"Anonymous","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"\nAnonymous :\nAs I said in my previous comment:  in order for me to buy this, I need some microscopic photographs that will prove that.\nAnd even if such a heat process could really produce a complete image (front and back) of a man with absolutely no color penetration anywhere (just saying this is almost non sense to me), this would not answer why a medieval forger would have wanted to accomplish such a feat that was impossible to see to the naked eye anyway!!!\nLook, I can buy the improbable idea of a forger who would have wanted to created a sort of ghost image of Jesus on a burial cloth in order to produce an enigmatic false relic, but I’m not ready to buy the idea that, along with this, he would have taken time to make sure that there would have been absolutely no more color penetration is darker zones than in lighter zones.\nIt’s fun to imagine things, but one day, we must also be logical and rational…\n\nIt’s a common misconception among armchair chair scientists that everything can be ruled in or ruled out by being “logical and rational”. \nSo what about the mysterious “second image” that is said to be present on the superficial fibres on the oipposite side of the linen, with noting in between the two faces? \nhttp://www.wnd.com/2010/04/146689/\nHow does being “logical and rational” help there.\nSometimes one has to hold logic and rationality in abeyance while one attempts to get one’s head round new unfamiliar phenomena, and  some of believe it’s only by experimentation and modelling  phenomena, with progressive refining one’s techniques that one can hope to get a handle.\nRemember – there’s still no certainty as to how those ancient Egyptians were able to construct those pyramids with primitive technology – with some still claiming that only aliens could have achieved the task.\nI shall be responding to your points (and those of Hugh’s) in more detail on my own site, but it may be a day or two since I have two other postings in the course of preparation (Rogers’ so-called vanillin clock, and a response to Ian Wilson on the Machy Mould). Please bear with me.\n\n","date":"January 28, 2014 at 1:15 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-74985","author":"colinsberry","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"I will probably take time to answer this comment later.  But Colin, how about this other comment of mine: https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/#comment-74957\nI hope you’ll take time to answer this…\n\n","date":"January 28, 2014 at 2:01 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-74990","author":"Anonymous","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"As I say, I’ll respond in due course, but am working on other postings right now. For now, just a small reminder. My model is not one of a static cloth draped over a hot template. It involves manual moulding to the major contours with a damp overlay making that possible. Only the shallower  grooves and crevices of, say, a bas relief template,  would escape imaging as a consequence of tenting effects, so most parts of the template would come within a few mm of cloth, where convected steam could assist heat transfer and imaging. where there is no actual contact.\nJackson’s 3-4 cm separation is not fact – it is model-dependent, assuming a real corpse emitting mysterious high energy radiation, and loosely draped linen. It is an authenticist’s model. It is not what I would call a scientific model., especially when invoking collapsing cloths etc.\n\n","date":"January 28, 2014 at 2:15 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-74993","author":"colinsberry","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"For the moment Colin, I will only say this versus your above comment :  The simple fact that the body image did not penetrate the cloth no more in dark zones than in light zones should be enough for anyone who is honest versus the subject to reject the idea that this sort of image could have been forged.  Seriously, why someone would have wanted to accomplish a feat that was not even noticeable for anyone during the Middle Ages?  \nAnd I’m not even talking of the unbelievable skill that such a forger must have had in order to accomplish that feat…\nAnd I’m not even talking about the evidence of the bloodstains, which clearly indicate that this image was formed on the cloth by a real crucified corpse…  \nAnd I’m not even talking about…  And about…  And about…\nSeriously Colin, here’s my advice to you if you really want to find a cause for the image that can be scientifically sound : start searching for some biological interraction between a real crucified corpse and the top surface of the Shroud.\n\n","date":"January 28, 2014 at 3:13 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-74997","author":"Anonymous","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"“… anyone who is honest versus the subject… “?\n“Seriously Colin, here’s my advice to you…”\n“scientifically sound…”?\nHave you ever considered changing your style of responding to others?  \nHave you ever considered making an effort NOT to come across like Sue Townsend’s Adrian Mole at age 13 and 3/4?\nI’m starting to understand why you switched to describing yourself as “anonymous”.\nI shall respond to your previous points, as promised, on my own site, if only to demonstrate that I am not evading the issues, which I have never pretended for one moment are not tricky. But am now logging off here (yet again) for another breath of fresh air, to escape this pathetic juvenile inquisition and brow-beating. I may be gone a while.\n\n","date":"January 28, 2014 at 3:32 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-75000","author":"colinsberry","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"Concentrate on this please: The simple fact that the body image did not penetrate the cloth no more in dark zones than in light zones should be enough for anyone who is honest versus the subject to reject the idea that this sort of image could have been forged. Seriously, why someone would have wanted to accomplish a feat that was not even noticeable for anyone during the Middle Ages?\n\n","date":"January 28, 2014 at 3:55 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-75004","author":"Anonymous","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"What are you saying? Do you mean an image “not even noticeable for anyone during the Middle Ages”? Not even noticeable enough to allow the charge that some one confessed to painting the unnoticeable? Not even noticeable enough to make a medallion of the unnoticeable?\n\n","date":"January 28, 2014 at 4:12 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-75005","author":"Dan","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"You didn’t understand me correctly Dan.  When I said “a feat that was not even noticeable for anyone during the Middle Ages”, I was talking about the ultra-superficiality of the image (which is limited to 1, maybe 2 colored fibers in deep on the top surface of the cloth) not only in lighter zones, but ALSO in darker zones.  \nNo one has a microscope in the Middle Ages to notice such a thing.  Why a forger would have wanted to restrict the color penetration of his image like that?  And not only that, but how could he managed to do so in every parts of the image (light as well as dark parts) with a forgery technique like a scorch?  It’s pretty ludicrous, except if we think this unknown genius was able to manually and artificially colored only a thin layer of impurities concentrated on the top surface of the cloth.  But as Rogers said so well, any kind of high energetic technique (like a scorch for example) must be exclude in such a case because it’s way too strong to only color a layer of impurities without affecting the underlying fibers…\nI hope these precisions are enough for you to understand me perfectly…\n\n","date":"January 28, 2014 at 4:28 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-75009","author":"Anonymous","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"We can say that, along with the evidence coming from the bloodstains, the ultra-superficiality of the image is a real huge problem for any forgery proposal, especially when it involved a chemical change of the linen fiber itself (PCW or the whole fiber) because the linen fibers (including the PCW) are not restricted to the top surface of the cloth…\n\n","date":"January 28, 2014 at 3:21 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-74998","author":"Anonymous","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"Professor Giulio Fanti has said that the “second image”, an echo of the main image, is the result of the corona discharge he has proposed, in fact he said that only this theory can explain what may have happened.\n\n","date":"January 28, 2014 at 1:44 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-74987","author":"Louis","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"“Only” this theory (corona discharge)? If he really said that, which I doubt, then the good professor does not understand the meaning of the term “theory”, at least in a scientific context. A theory is only a provisional mental construct or model, always at risk of being falsified by new findings, and replaced with a different theory. Fanti’s ideas are in any case better described as a hypothesis, not yet qualifying as a theory.\n\n","date":"January 28, 2014 at 2:01 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-74991","author":"colinsberry","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"That’s understandable, but it could soon be a hypothesis on the way to becoming a theory. What is at issue here is the question of corona discharge.\n\n","date":"January 28, 2014 at 3:35 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-75001","author":"Louis","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"I just read this on Colin Berry’s website: “That (note: the extreme superficiality of the image) was the result of a host of chance physical,  chemical and botanical effects related to the interaction of a heated template with a heat-susceptible woven fabric.”\nMy answer:  Yes…  Yes…  And Santa Claus is a real bearded man who fly in the sky with a sleigh…\nCome on Colin!  Do you know what are the odds for a medieval forger to produce with heat a totally superficial image of the complete body (both sides) of a man on a linen cloth without ever producing any color penetration in any area of the image (not even in area were the image is much darker than average)?  Near absolute zero.\nAND I’M NOT EVEN TALKING ABOUT THE EVIDENCE OF THE BLOODSTAINS THAT DISCARD THE IDEA OF A FORGERY.\nI have nothing else to say to you.\n\n","date":"January 29, 2014 at 12:25 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-75076","author":"Anonymous","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"Re that shouted comment in upper case: kindly stop wasting the time of sceptics like myself  by asking detailed questions about image formation, requiring considered replies, then attempting to trump whatever answer you get with your repeated blood mantra.\n It’s not just pure exhibitionism, Adrian Mole. It’s downright bad manners too.\n\n","date":"January 29, 2014 at 12:51 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-75078","author":"colinsberry","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"I don’t wanna waste my time anymore with someone who can’t see the reality of facts and prefer to rely on his personal preconcieve notions of what must have formed the Shroud image…\nJust by merging together the evidence of the bloodstains and the evidence of the ultra-superficiality of the image (as superficial in darker zones as it is in lighter ones), any intelligent person would come to the conclusion that the Shroud image has not been formed by a forger using heat…  But now I see that you just don’t want to look at REALITY…  By the way, you’re not the first to act like this…  Einstein did the same thing versus the idea of a universe in expansion!\n\n","date":"January 29, 2014 at 12:58 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-75079","author":"Anonymous","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"I think the first part of the sentence you quote of Colin’s is entirely apt, whether or not the Shroud is genuine, icon or forgery. If it were commonplace, whatever the method, we might expect to have found more of them. “A host of chance physical, chemical and botanical effects,” to which I would couple historical accident as well, explain the extremely unusual rather well. \nHere’s another thought. If the heat required to discolour the linen were not too great (perhaps due to the preparation of the linen), it might have been possible to apply the blood to the bas relief without it burning or discolouring itself. Applying the cloth to this would lift off the blood first before the discolouration of the linen.\nAnyone warmed any blood recently? Anyone got Dracula’s phone number?\n\n","date":"January 29, 2014 at 12:36 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-75077","author":"Hugh Farey","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"No matter what you might think (or wish), when it comes to the idea of a forgery involving heat, Colin sentence is totally discarded by the evidences of both the ultra-superficiality and the bloodstains…\n\n","date":"January 29, 2014 at 12:59 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-75080","author":"Anonymous","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"\nAnonymous :\nI don’t wanna waste my time anymore with someone who can’t see the reality of facts and prefer to rely on his personal preconcieve notions of what must have formed the Shroud image…\nJust by merging together the evidence of the bloodstains and the evidence of the ultra-superficiality of the image (as superficial in darker zones as it is in lighter ones), any intelligent person would come to the conclusion that the Shroud image has not been formed by a forger using heat…  But now I see that you just don’t want to look at REALITY…  By the way, you’re not the first to act like this…  Einstein did the same thing versus the idea of a universe in expansion!\n\nWho’s to say that the most of the damaged, more brittle, more superficial fibres in the darker zones have not broken off over the centuries, so there’s now less difference compared with the lighter zones, creating a ghostlier, more homogenous image? Or are you one of these people who imagines the TS to look exactly the same today as it did centuries ago?\nYour all-conquering bloodstains flake off too with age and handling (revealing to some eyes at any rate hints of mantra-defying underlying image).\n\n","date":"January 29, 2014 at 1:13 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-75083","author":"colinsberry","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"PS. If you look at Fig 20. page 15/24 of Thibault’s anti-scorch pdf, there’s a 1978 Mark Evans photomicrograph of a TS image region. \nhttps://shroudofturin.files.wordpress.com/2012/10/scorch-paper-en.pdf\nIf I’m not mistaken it shows many instances of broken ends of  yellow or brown fibres, especially darker ones (even if there is not supposed to be “darker ones” in the half-tone narrative).  The Fanti, Di Lazzaro, Heimburger paper on macroscopic v microscope characteristics of the TS also made reference to the more brittle nature of image fibres\nhttp://www.academia.edu/4294684/Microscopic_and_macroscopic_characteristics_of_the_Shroud_of_Turin_image_superficiality\n  So it’s not a huge jump to say that they will tend preferentially to break and fall away with time, creating a false impression of the remaining image fibres being scarcer and more superficial than was really the case initially.\n\n","date":"January 29, 2014 at 2:04 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-75090","author":"colinsberry","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"In fact, here’s the precise passage from that paper (which to my way of thinking isone of the most neglected observations in the whole of shroudology):\n11) Image-area tapes (pressure sensitive adhesive tapes used by STURP team to sample the TS) “lifted” more  easily than non-image tapes suggesting that the topmost fibers in the image area were somehow weakened; the linen ﬁbers seen on the body-image tapes are shorter and more fractured than are those from non-image area.”\n\n","date":"January 29, 2014 at 2:28 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-75092","author":"colinsberry","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"Anon, your criticism of Colin is way over the top. He is working with a hypothesis — what you call a preconceived notion — formed by his observations of the Shroud. Following his hypothesis has proven fruitful in his debunking some of the assumptions about the Shroud, i.e. 3D imaging being totally unique. \nAs Hugh has noted, there are indeed still serious challenges to Colin’s hypothesis.\nYou are right to question his hypothesis, that’s good science. But when he takes the time and effort to respond with a sincere reply, then have the common courtesy to say ‘thank you but I do not agree’. You can call his hypothesis b.s. all you want in the privacy of your home.\nThis thread was actually quite interesting until you decided to storm out and take your ball with you.\n\n","date":"January 29, 2014 at 1:43 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-75085","author":"David Goulet","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"I just need to redone my first post again:\nHe wrote this on his website: “That (note: the extreme superficiality of the image) was the result of a host of chance physical, chemical and botanical effects related to the interaction of a heated template with a heat-susceptible woven fabric.”\nMy answer: Yes… Yes… And Santa Claus is a real bearded man who fly in the sky with a sleigh…\nAny rational person know that the Shroud image, because of its very unusual characteristics (including all that concern bloodstains), cannot have been produced by a scorch.  This was rejected by STURP years ago and I just wanted to point out to Colin that when you take into account the évidences of both the extreme superficiality and the bloodstains, the hypothesis he defend AT ALL COST has no value whatsoever concerning the Shroud reality.\nIf he want to defend the idea of a forgery, I have no problem, but please, take all the FACTS into account.  If he could do this, he will realize (just like me) that the only forgery hypothesis that can still account for the Shroud image is one that involve an image naturally formed by a real crucified corpse.  I’m affraid there’s no other credible possibility than this one if you still want the Shroud to be a forgery.\nWould be nice to see Colin and Hugh realize this once and for all…\n\n","date":"January 29, 2014 at 2:03 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-75088","author":"Anonymous","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"And concerning Colin’s attempts to replicate the color of the Shroud image on linen, such attempts (just like the one done by Garlaschelli by the way) are much too short because they don’t take into account the question of the blood and serum stains…  The reality is this : to replicate the Shroud properly, you need to place a real crucified corpse into a real burial linen cloth.  And not only this, you must wait some time after death in order for the bloodstains on the body to become solid enough to only leave mirror images of themselves on the cloth.\nAdler was pretty clear about that…\n\n","date":"January 29, 2014 at 2:19 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-75091","author":"Anonymous","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"Oh, dear, facts (sorry, FACTS) again. I have before me three of the most important papers published by the STURP team in peer-reviewed journals; ‘A Chemical Investigation of the Shroud of Turin,’ ‘A Comprehensive Examination of the Various Stains and Images on the Shroud of Turin,’ and ‘Physics and Chemistry of the Shroud of Turin.’ None of these papers dismiss the possibility that the image may be a scorch, and the last two are at pains to point out how similar the image is to a scorch. It is plain that Heller, Adler, Rogers, Schwalbe and Jackson recognised that some form of scorch hypothesis was perfectly tenable, bloodstains or not, and went to some trouble to discuss it.\nThis seems to contradict your forcefully stated view that “any rational person know that the Shroud image … cannot have been produced by a scorch. This was rejected by STURP years ago.”\nOh, and you seem to have missed my idea that a template pre-painted with blood would even answer your ‘blood first image second’ contention.\n\n","date":"January 29, 2014 at 5:27 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-75112","author":"Hugh Farey","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"And what do you make of this sentence that we find in STURP general conclusion report: “We can conclude for now that the Shroud image IS that of a REAL HUMAN FORM of a scourged, crucified man. It IS NOT the product of an artist.”\nNow, unless I don’t understand correctly STURP words, when I read “IS the image of a REAL human form” and “IS NOT the product of an artist”, I understand that it include any forgery hypothesis involving heat, like the scorch hypothesis of Colin Berry.\nThis general conclusion can be read here: http://www.shroud.com/78conclu.htm\n\n","date":"January 30, 2014 at 11:45 am","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-75169","author":"Anonymous","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"Hugh, I was going to mention that too (that there was no black and white dismissal by STURP on scorching)\nYannick, your rebuttal?\n\n","date":"January 30, 2014 at 4:10 am","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-75145","author":"Matthias","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"I think it’s also helpful to qualify what is meant by ‘scorch’. Man-made vs. natural (as in a bio-chemical). There was an exchange previously with Yannick, er, the Phantom, and there was some agreement that the image could be a natural scorch created by some yet unidentified bio-chemical reaction, i.e. a Maillard-type reaction. Scorch is a word with many applications and STURP was obviously aware of this.\n\n","date":"January 30, 2014 at 11:09 am","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-75166","author":"David Goulet","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"David, a Maillard reaction is not the same as a scorch.  Scorch involve important quantity of heat.  Maillard reactions are happening at NORMAL TEMPERATURE.  Don’t mix apples and oranges.  When I reject any scorch hypothesis, I reject any idea that the image could have been formed by an energetic radiation like heat, no matter from what source this supposed heat could come from.\n\n","date":"January 30, 2014 at 11:51 am","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-75171","author":"Anonymous","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"Additional note:  On the contrary to the scorch hypothesis, I don’t contest the possibility of a photographic image produced on the top surface of a linen cloth, if the light sensitive product has been concentrated on this portion of the cloth.  Nevertheless, this particular hypothesis is also ruled out by the evidence of the bloodstains alone, nevermind the fact that an expert like Barry Schwortz also rule it out regardless of the evidence of the bloodstains (https://www.shroud.com/pdfs/orvieto.pdf)…\n\n","date":"January 30, 2014 at 2:04 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-75180","author":"Anonymous","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"\nAnonymous :David, a Maillard reaction is not the same as a scorch. Scorch involve important quantity of heat. Maillard reactions are happening at NORMAL TEMPERATURE. Don’t mix apples and oranges. When I reject any scorch hypothesis, I reject any idea that the image could have been formed by an energetic radiation like heat, no matter from what source this supposed heat could come from.\nI’ll defer to your better understanding on the Maillard process. But you prove my point about terminology. You understand a scorch as radiative heat. But a bio-chemical scorch would be more like a scorch caused by acid – which occur at normal temperatures. STURP saw no evidence of a man-made scorch, as you pointed out above. What they could not rule out is a natural scorch caused by an unidentified cocktail of bio-chemical factors. This doesn’t mean they think that’s what it was, but that based on the image’s properties this cannot be ruled out.\nWe can’t talk about apples and oranges until we decide what a fruit is.\n\n","date":"January 30, 2014 at 2:03 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-75179","author":"David Goulet","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"Who knows if some biological substances (like urea and/or lactic acid) could have been present on the skin and hair of the Shroud man (left there after the drying of the abundant sweat of the man while on the cross) and could have interracted with the thin layer of impurities postulated by Rogers in order to form the image?  Personally, it’s a possibility I would not discard.  But I doubt such a chemical reaction at normal temperature could be called “a scorch” (scientifically speaking)…\n\n","date":"January 30, 2014 at 5:42 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-75195","author":"Anonymous","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"Note: it is also possible, as Fazio and Mandaglio described, that the image could have been caused by a stochastic process involving the normal heat released by the fresh corpse after his death, which would have interracted with only a random portion of the most superficial fibers that would have been hit by this very low energetic release (or, more probably, with a random portion of the thin layer of impurities described by Rogers that would have been hit by this very low energetic release).  Such a process, just like the Maillard hypothesis of Rogers, would have happened at normal temperature and would have produced a latent image, which would have taken years and maybe even decades to fully “develop”.  In my mind, the normal heat release of the fresh crucified corpse is  the only heat that could rationally have taken part in the image formation process.  But again, I doubt the color result of this could be called “a scorch” (scientifically speaking).\n\n","date":"January 30, 2014 at 5:49 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-75196","author":"Anonymous","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"There is a fairly broad spectrum of possible linen degradation mechanisms between the purely physical (such as the conduction of heat from hot metal), and the purely chemical, such as the hydrolitic effect of sulphuric acid. The Maillard reaction is a combination of the two and rarely happens without the application of heat, which is why toast and steak are so often given as examples of it. Other factors might be the preparation of the linen beforehand, as with Rogers’s putative starch or Saponaria layer (the ‘soapy custard’ hypothesis), and the length of time taken to develop the image, possibly including a ‘dormant’ period by which the cloth has become predisposed to discoloration, but only actually discolours after some trigger such as a chapel fire. Any or all of these or a combination of them, may have led to the result we have ended up with today. In that sense, although I agree with David that the ‘scorch’ result may have originated with a Maillard reaction, I also agree with Anonymous that although the word ‘scorch’ can be applied with some precision to the result, it does not necessarily describe, in its normal sense, the method.\n\n","date":"January 30, 2014 at 2:09 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-75183","author":"Hugh Farey","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"To conclude this topic, I just want to summarize in a few words my thoughts about all the hypotheses for image formation involving a form of another of high energetic radiation (including the scorch hypothesis of Colin Berry or some supernatural hypotheses like the ones proposed by Di Lazzaro or Fanti):  To me, believing that the Shroud image (especially when you consider its ultra-superficiality, which is the same in darker zones as it is in lighter ones, and also when you consider the probable fact that the bloodstains, which were not affected at all by the image formation, were on the cloth first) could have been formed by such a thing is as crazy as believing a painter could have uniformly painted such an extremely superficial full body image (front and back)!\nI don’t know for all of you, but for me, this is what logic and rational thinking leads me.  And I’m not even talking about some other strange particularities (like the total absence of a body image of the back of the knee on the dorsal image), which gives any forgery hypothesis even less credit…\n\n","date":"February 2, 2014 at 5:39 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-76043","author":"Anonymous","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"Complement :  The absence of an image of the back of the knees, the presence of bloodstains before the image formation, the extreme superficiality of the image everywhere on the cloth (in darker zones as much as in lighter ones), etc. \nTo me, all those things are well enough to discard any forgery hypothesis involving any form of an artistic technique and are well enough to put very serious doubts over any supernatural hypothesis that involve a form or another of high-energetic radiation.\n\n","date":"February 2, 2014 at 5:42 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-76045","author":"Anonymous","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"I can only repeat what I’ve said to you repeatedly, which you refuse to take on board. There is far, far more to science – the understanding of phenomena, natural or man-made – than the application of logic and rationality. Those two alone never led to the making of new discoveries, certainly not the new ‘paradigms’. The latter often come about through appreciating the limitations of existing data, and having the humility to realize that the data we have at our disposal are maybe incomplete, giving a misleading picture is over-analysed. We do not know what we do not know.\nCandidly, you would never hack it as a research scientist. You not only lack the vision thing. More importantly, you lack humility in failing to appreciate the shaky foundations on which your much trumpeted mantras are based (“ultrasuperficial”, “blood before image” etc). You are a peddler of half-truths. content merely to attack others’ ideas and/or working hypotheses, having nothing constructive to offer in their place.  \nIf you think the TS image was formed by chemical action, then produce your evidence.\n\n","date":"February 2, 2014 at 6:03 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-76051","author":"colinsberry","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"I only talk about probabilities here.  And once you consider all the pertinent data without to absolutely disauthenticate the relic and without being despair to link it with the Hollywoodish idea of what kind of burst of energy the Resurrection of Christ might have produced, then probabilities clearly point in direction of a natural formation involving a real crucified body (probably the one of the historical Jesus of Nazareth).  \nI don’t say your hypothesis is 0.0 in term of probability.  I just say those must be estimated as something close to, let’s say, 0.1%.\n\n","date":"February 2, 2014 at 6:42 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-76059","author":"Anonymous","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"There was a missing word in my last comment.  Here it is again: I only talk about probabilities here. And once you consider all the pertinent data without wanting to absolutely disauthenticate the relic and without being despair to link it with the Hollywoodish idea of what kind of burst of energy the Resurrection of Christ might have produced, then probabilities clearly point in direction of a natural formation involving a real crucified body (probably the one of the historical Jesus of Nazareth). \nI don’t say your hypothesis is 0.0 in term of probability. I just say those must be estimated as something close to, let’s say, 0.1%.\n\n","date":"February 2, 2014 at 6:44 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-76060","author":"Anonymous","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"\nAnonymous :\nThere was a missing word in my last comment.  Here it is again: I only talk about probabilities here. And once you consider all the pertinent data without wanting to absolutely disauthenticate the relic and without being despair to link it with the Hollywoodish idea of what kind of burst of energy the Resurrection of Christ might have produced, then probabilities clearly point in direction of a natural formation involving a real crucified body (probably the one of the historical Jesus of Nazareth).\nI don’t say your hypothesis is 0.0 in term of probability. I just say those must be estimated as something close to, let’s say, 0.1%.\n\nI shan’t try responding to any of that. It’s gobbledegook – from start to finish.\n\n","date":"February 2, 2014 at 7:49 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-76071","author":"colinsberry","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"PS  On second thoughts – gibberish.\n\n","date":"February 2, 2014 at 7:51 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-76074","author":"colinsberry","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"You know I’m right.  It’s just you not ready to admit it.  If you really want to disauthenticate the Shroud, start looking for the naturally produced image of a real crucified man who looked like Jesus of the Gospel on a real burial cloth or, if you really want to keep the “forgery” path, at least, start thinking about a “natural” forgery done by someone who used of a real crucified corpse in order to produce naturally his body image on a linen cloth…  That way, you and your hypothesis would become much more credible.\n\n","date":"February 2, 2014 at 7:54 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-76076","author":"Anonymous","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"You say “start thinking”. I have been thinking and researching and model-building for over 2 years, posting my results and thoughts as I get them. Yet when I ask you to produce your evidence for a chemical imprinting  mechanism (evidence, not hankering for) you fail to deliver. Come on. You and that guru of yours have/had years in which to supply hard experimental evidence for the existence of a chemical signature on the linen, with acquisition of new matter from an exogenous source, e.g. a decomposing corpse. I repeat. Where is your evidence?\nIf you wish to enter into scientific debate, instead endlessly reciting your impressionist dirges, then you MUST produce your evidence.\nAnd no. I do not know you are right, as you charmlessly put it. I believe you to be utterly deluded. Once you are willing to put yourself in the position of someone who has NOT rejected the radiocarbon dating, and then ask why someone would want to produce the unusual TS image, and more importantly  HOW, and once you start to eliminate the possibilities (not a painting, since no pigment traces, and probably NOT a chemical imprint because there is apparently nothing there of exogenous origin), then you may well find that STURP and others were too quick to write off simple thermal imprinting. \nLook at the new banner on my site obtained with my latest (LOTTO) methodology, and you will see that tangible progress has been made over two years. But I am content right now to convince myself. Convincing the mantra-intoning diehards like you who accept negligible pro-authenticity evidence without question, who fail to see the flimsiness of the existing database or the agenda-driven nature of so much of what passes for Shroud-research, may take a little longer.\n\n","date":"February 3, 2014 at 1:35 am","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-76118","author":"colinsberry","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"If I may translate: Anon is saying that if you consider the existing data (without a jaundiced eye skeptic’s eye nor the eye of an authentist prone to science fiction) then the odds are in the favour of a natural image formation.\nYour rebuttal above still applies. The existing data is far from conclusive and the minute you stop questioning your assumptions you miss the opportunity for fresh insights.\n\n","date":"February 2, 2014 at 11:19 pm","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-76103","author":"David Goulet","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"I believe Anon favours the Maillard reaction hypothesis suggested by Rogers and Arnoldi in 2003. It is interesting that they appear less certain of their methods than Anon does. The paper’s very title gives this away: An Amino Carbonyl Reaction (Maillard Reaction) May Explain the Image Formation.\nThe paper describes how such a reaction could theoretically come about; the amino reactants may derive from a corpse, and the surface of the shroud could have been prepared using chemicals which rendered only the surface fibres susceptible. Experiments using ammonia as the gas and dextrin (very similar to gum arabic, as it happens) as the sugar showed that a Maillard reaction between these two components does, in fact occur.\nBut that’s as far as it went. There was no attempt to carry out the experiments using a big piece of cloth, a more realistic starch & saponaria preparation, or any chemicals actually associated with dead body. Attempts to explain the precision of the image are vague in the extreme.\nIt is not impossible that some form of Maillard reaction was involved in the formation of the image, although, since Rogers and Arnoldi experimented using only ammonia, there is no suggestion that a dead body was an essential part of the image formation. Ammonia was common enough in medieval Europe, and if it was known to discolour cloth, might have been a good choice for a forger!\n\n","date":"February 3, 2014 at 6:25 am","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-76160","author":"Hugh Farey","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"Yes, but where’s the chemical signature on the TS linen image for a Maillard reaction, or, for that matter. any other fixation of exogenous chemicals (amines, reducing sugars etc)?\nSurely that Maillard reaction should only have been touted as a possibility by first discovering the appropriate chemical signature. But that was never attempted (to my knowledge) although there is one reference as I recall to there being NO surplus of fixed nitrogen in image fibres.\nSo we have an essentially mythical reaction being promoted here on an almost daily basis by one of Rogers’ devotees as though it were a scientific given. It’s not, and what anonymous is doing here is attempting to preempt or replace sound if slow and systematic science with pure fantasy.\nHe hasn’t the first clue as to the scientific method, and is all at sea as well with that chosen instrument of his (logic and rationality) given that he does to appear to appreciate that logical argument agrees with the sharing of a initial premise. If his premise is that the radiocarbon dating was wrong by 1300 years, and mine is that it was broadly correct, then is it any wonder that with conflicting premises we arrive at totally different conclusions?\nThere’s more I could say about his attempts to specify how a medieval forger would operate, to which I would reply: he’s probably been giving that serious thought, if at all, for the last few hours. Some of us have been thinking about it for years – in depth –  and writing about it, willing to entertain objections –  and find his reasoning, dare I say logic, is flawed in that respect too, judging by what he has said earlier on this thread.  I may expand on that later if he refuses to get off that high horse of his, claiming as he does a monopoly on making all the the right connections. I hope for his sake he’s not a DIY electrician.\n\n","date":"February 3, 2014 at 7:03 am","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-76166","author":"colinsberry","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"Well I agree, of course. What I was hoping was that Anonymous would return to the source of his conviction and maybe appeciate why it is not quite as obvious to some people as it is to others. Then he might feel less frustrated by their apparent obduracy!\n\n","date":"February 3, 2014 at 9:07 am","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-76180","author":"Hugh Farey","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"I’m not frustrated.  I just don’t understand why some people like you still consider human-made forgery hypothèses, which have all been set aside by STURP (and that are obviously off-track concerning the Shroud and the sum of very particular characteristics associated to it), instead of taking STURP conclusions seriously and start looking for some natural interraction between a real crucified corpse (which could still have been, if you don’t want the relic to be authentic, another person than Jesus) and some reactive products that were concentrated on the top-surface of the cloth (possibly on both sides).  To me, it is as obvious as the nose in anyone’s face that this is the right path to follow in order to solve the mystery of the Shroud image…  I think the main error you did (note that many other researchers did the same error over the years) is to consider separately the body image and the bloodstains, which must be considered as a whole.\n\n","date":"February 3, 2014 at 11:45 am","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-76200","author":"Anonymous","site":"shroudstory"},{"title":"Radiation Man:  A New BSTS Article","post":"By the way, I don’t know if Rogers hypothesis was right on the target.  More tests need to be done to verify this.  I still wait for such tests to be done…  I also think Fazio and Mandaglio’s hypothesis of a very weak and natural release of energy (probably heat) by the corpse that could have yield the dehydration of some superficial fibers (or more probably of a thin layer of impurities) deserve to be tested properly under good lab control.  And it’s the same thing for the hypothesis proposed by John De Salvo concerning a possible Volckringer pattern phenomenon (or something very similar in nature).\nHave you noticed that all those hypotheses still wait to be tested properly under good lab control?  Only Rogers had time to make some preliminary tests, but those were just preliminary stuff…  More researches need to be done regarding all those interesting hypotheses.\n\n","date":"February 3, 2014 at 11:55 am","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","id":"comment-76202","author":"Anonymous","site":"shroudstory"}]
