[{"title":"Real 1st century or simulated 14th century sweat imprint?","post":"Have just this minute added this image to my posting.\n\nIt carries the caption:\n“Never could the clash of the Two Cultures be more excruciatingly apparent than right now, Compare this blogger’s approach (scorched linen model) with that of Charles Freeman’s writing off of STURP science (and my own modest contributions).”\n\n","date":"November 12, 2014 at 1:33 pm","url":"https://shroudstory.com/2014/11/12/real-1st-century-or-simulated-14th-century-sweat-imprint/","cat":"image_theory","id":"comment-170863","author":"Colin Berry","site":"shroudstory"},{"title":"Real 1st century or simulated 14th century sweat imprint?","post":"What’s Hugh doing on the cover of History Today?\n\n","date":"November 12, 2014 at 3:44 pm","url":"https://shroudstory.com/2014/11/12/real-1st-century-or-simulated-14th-century-sweat-imprint/","cat":"image_theory","id":"comment-170894","author":"ChrisB","site":"shroudstory"},{"title":"Real 1st century or simulated 14th century sweat imprint?","post":"Nicely done, ChrisB. :)\n\n","date":"November 12, 2014 at 3:49 pm","url":"https://shroudstory.com/2014/11/12/real-1st-century-or-simulated-14th-century-sweat-imprint/","cat":"image_theory","id":"comment-170895","author":"David Goulet","site":"shroudstory"},{"title":"Real 1st century or simulated 14th century sweat imprint?","post":"Btw,  I didn’t wish to seem abrupt with one of the site’s commenters whom I hold I high regard. All I would ask is he takes another look  at the STURP 1981 Summary, which I also hold in high regard, while disappointed that it’s mainly a collection of negative statements.\n But please note there’s nothing there about the ‘positive’ claims that STURP team leaders are best remembered for. There’s nothing there about Rogers’ starch impurity coating idea, there’s nothing about Jackson’s collapsing cloth idea, there’s nothing about Adler’s bilirubin/permanently red blood idea. When I protest at Charles’s blind spot to the STURP findings I always try to cite the 1981 summary. It’s that I take as STURP’s position, not the outrageously self-indulgent pro-authenticity pap that followed. (Sorry Dan, but someone has to say it).\nAnyway, I’m getting increasingly interested in another instance of pseudo-science, namely the labelling of gluten-intolerance as an autoimmune disease. I suspect there’s a lot of NC there (the nutritional equivalent of PC) where dietary cereals can do no wrong.  I speak as an ex-head of food safety and nutrition at an industrial  research association, so have a particular interest in that area, but  am no lackey for commercial interests, There’s much research to do there, so don’t be surprised if you find me appearing less and less on this site in the days and weeks to come. \nBut I shall keep my hand in. Thibault Heimburger may be interested to know I’m doing experiments with pectinase treatment of linen right now, but am in no hurry to publish results or any results for that matter. The time has passed for publishing ongoing results in real time. That was a big mistake on my part.\n\n","date":"November 12, 2014 at 4:20 pm","url":"https://shroudstory.com/2014/11/12/real-1st-century-or-simulated-14th-century-sweat-imprint/","cat":"image_theory","id":"comment-170899","author":"Colin Berry","site":"shroudstory"},{"title":"Real 1st century or simulated 14th century sweat imprint?","post":"Exploring gluten intolerance sounds intriguing. And as you don’t have to wait for Turin to proceed with the real science, probably less frustrating. Carry on, sir.\n\n","date":"November 12, 2014 at 4:24 pm","url":"https://shroudstory.com/2014/11/12/real-1st-century-or-simulated-14th-century-sweat-imprint/","cat":"image_theory","id":"comment-170902","author":"David Goulet","site":"shroudstory"},{"title":"Real 1st century or simulated 14th century sweat imprint?","post":"Colin, for some peculiar reason there seems to be an incredible amount of gluten intolerance in New Zealand, mainly women, but also some men I know are also susceptible.  I have heard that the principal flour millers in NZ (Champion) changed their blends some years ago, to the extent that some commercial bakers won’t now use the brand as they consider it inferior to others available.  I wonder if it’s credible that the increase in gluten has stimulated a type of immune response, so that some persons are now intolerant to all gluten.  I suggest it as one possible avenue for your research. \nThere also happens to be a religious dimension to it.  Some churches offer their communicants the option of gluten free wafers for those who are gluten intolerant.\n\n","date":"November 12, 2014 at 5:22 pm","url":"https://shroudstory.com/2014/11/12/real-1st-century-or-simulated-14th-century-sweat-imprint/","cat":"image_theory","id":"comment-170907","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Real 1st century or simulated 14th century sweat imprint?","post":"That’s the thing, DaveB: gluten can stimulate an immune response that destroys the lining of the gut. Take the gluten away and the gut can slowly heal. Yet it’s called an autoimmune disease, as if there were something wrong with one’s own defences, which necessarily require  an ability to distinguish between self and non-self. There’s something not right here, and I’m determined to get to the bottom of it. Whose idea was it to classify it as an autoimmune disease, and why? If someone dies of a single wasp sting, is that an autoimmune disease too? There’s a smell of bad science here, of assuming that an immune over-reaction is the patient’s fault. I say it’s more likely that wheat and other cereals have evolved a devilishly clever way of punishing those who try to feast on their seeds, exploiting a weak point in one’s immune system – that make individuals whose genetic and immune systems  have yet to evolve counter-defences turn against themselves. Best to regard all cereals as potentially toxic …\n\n","date":"November 12, 2014 at 5:40 pm","url":"https://shroudstory.com/2014/11/12/real-1st-century-or-simulated-14th-century-sweat-imprint/","cat":"image_theory","id":"comment-170911","author":"Colin Berry","site":"shroudstory"},{"title":"Real 1st century or simulated 14th century sweat imprint?","post":"All cereals??  I think rice and oats are OK, even if you’re gluten intolerant.  Haven’t heard that Scots & Orientals have any kind of adverse reaction to their staples.  Could be more like poor blending practices rather than wheat evolving a defence revenge tactic.\n\n","date":"November 12, 2014 at 10:53 pm","url":"https://shroudstory.com/2014/11/12/real-1st-century-or-simulated-14th-century-sweat-imprint/","cat":"image_theory","id":"comment-170950","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Real 1st century or simulated 14th century sweat imprint?","post":":-)\n\n","date":"November 12, 2014 at 3:56 pm","url":"https://shroudstory.com/2014/11/12/real-1st-century-or-simulated-14th-century-sweat-imprint/","cat":"image_theory","id":"comment-170896","author":"Colin Berry","site":"shroudstory"},{"title":"Real 1st century or simulated 14th century sweat imprint?","post":"You’ve written off STURP science.\nYou’ve insulted STURP scientists.\nYou’ve claimed to have solved the mystery (“After 2 years, and over 200 postings, I think I’ve finally cracked it – the enigma of the Shroud of Turin.”) vs HT version “Origins of the TS, Solving history’s greatest mystery”.\nExcept your outrageous behavior vs Charles civility, no, i can’t see the difference.\n\n","date":"November 12, 2014 at 1:51 pm","url":"https://shroudstory.com/2014/11/12/real-1st-century-or-simulated-14th-century-sweat-imprint/","cat":"image_theory","id":"comment-170865","author":"anoxie","site":"shroudstory"},{"title":"Real 1st century or simulated 14th century sweat imprint?","post":"You bore me anoxie with your trolling. Give it a rest (or take a holiday).\n\n","date":"November 12, 2014 at 1:53 pm","url":"https://shroudstory.com/2014/11/12/real-1st-century-or-simulated-14th-century-sweat-imprint/","cat":"image_theory","id":"comment-170868","author":"Colin Berry","site":"shroudstory"},{"title":"Real 1st century or simulated 14th century sweat imprint?","post":"I think you’re in the worst position to criticize Charles for writing off STURP science, and furthermore, you’re asking us to compare.\nThis was my answer to your suggestion.\n\n","date":"November 12, 2014 at 2:05 pm","url":"https://shroudstory.com/2014/11/12/real-1st-century-or-simulated-14th-century-sweat-imprint/","cat":"image_theory","id":"comment-170873","author":"anoxie","site":"shroudstory"},{"title":"Real 1st century or simulated 14th century sweat imprint?","post":"Goodnight, one and all.\n\n","date":"November 12, 2014 at 2:09 pm","url":"https://shroudstory.com/2014/11/12/real-1st-century-or-simulated-14th-century-sweat-imprint/","cat":"image_theory","id":"comment-170876","author":"Colin Berry","site":"shroudstory"},{"title":"Real 1st century or simulated 14th century sweat imprint?","post":"As much as I dislike Anoxie’s caustic style, s/he has a point. Colin, you’ve been pretty dismissive in the past about STURP’s roster. I asked you once to name any Shroud researcher you respected (including STURP) — you replied there wasn’t one (you were just being honest).\nThe best you could say previously about Ray Rogers was that perhaps he’d been duped by others and had studied a false sample.\nLately you seem to have found a new appreciation for at least some of the STURP research. I don’t mind you tearing a strip off Charles for writing off STURP, but the optics might be better if you acknowledged that you’ve had a change of mind about STURP — that your writing off of their work was premature. Fair is fair.\n\n","date":"November 12, 2014 at 2:24 pm","url":"https://shroudstory.com/2014/11/12/real-1st-century-or-simulated-14th-century-sweat-imprint/","cat":"image_theory","id":"comment-170878","author":"David Goulet","site":"shroudstory"},{"title":"Real 1st century or simulated 14th century sweat imprint?","post":"I could try explaining David. But not now. Another time.\n(Oh, and I seem to recall praising the work and rigorous scientific approach of STURP’s Joseph Accetta, but never mind)..\n\n","date":"November 12, 2014 at 2:32 pm","url":"https://shroudstory.com/2014/11/12/real-1st-century-or-simulated-14th-century-sweat-imprint/","cat":"image_theory","id":"comment-170879","author":"Colin Berry","site":"shroudstory"},{"title":"Real 1st century or simulated 14th century sweat imprint?","post":"Whatever happened to Colin’s “light scorch theory”. Now its “sweat imprints”. Is there a difference?\n\n","date":"November 12, 2014 at 3:09 pm","url":"https://shroudstory.com/2014/11/12/real-1st-century-or-simulated-14th-century-sweat-imprint/","cat":"image_theory","id":"comment-170885","author":"Don","site":"shroudstory"},{"title":"Real 1st century or simulated 14th century sweat imprint?","post":"Those “sweat imprints” of two hands seems to be saying this theory is also applicable to finding Sasquatch.\n\n","date":"November 12, 2014 at 4:21 pm","url":"https://shroudstory.com/2014/11/12/real-1st-century-or-simulated-14th-century-sweat-imprint/","cat":"image_theory","id":"comment-170900","author":"Stan","site":"shroudstory"},{"title":"Real 1st century or simulated 14th century sweat imprint?","post":"I think it’s called “exploring all avenues” but steering clear of the miraculous.\n\n","date":"November 12, 2014 at 5:26 pm","url":"https://shroudstory.com/2014/11/12/real-1st-century-or-simulated-14th-century-sweat-imprint/","cat":"image_theory","id":"comment-170908","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Real 1st century or simulated 14th century sweat imprint?","post":"Hi Colin,\nThat the Shroud image could have been seen as a sweat imprint in the past by some people is not surprising.\nBut what does it tell us about the image forming process?\nIncidentally, your claim about the relationships between the Lirey badge (and the Lirey Shroud face) and the Veronica Veil are very dubious.\nThe face on the Lirey badge is simply a representation of the face of the Lirey shroud.\nFrom the resemblance between the Lirey badge and some pictures of the Veronica Veil you can’t conclude that the Lirey Shroud has been inspired by the Veronica Veil.\nAs I wrote you many months ago, I add that the word “Suaire” in French (modern French language as well as medieval French) does not necessarily mean “”facecloth” with connotations of sweat” as you wrote. This word is and was used in a much larger sense, including burial cloth. As a general rule,French language is in general very precise. But it is an exception.\nWhat about the relationship between your “light scorch hypothesis” and the “sweat imprint” ?\n\n","date":"November 12, 2014 at 5:38 pm","url":"https://shroudstory.com/2014/11/12/real-1st-century-or-simulated-14th-century-sweat-imprint/","cat":"image_theory","id":"comment-170910","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Real 1st century or simulated 14th century sweat imprint?","post":"Reluctantly, I shall today be responding to your points on my own site,Thibault  under Comments of my current posting – where I have the ability to filter out the aggressive trolling we see above.\n\n","date":"November 13, 2014 at 12:49 am","url":"https://shroudstory.com/2014/11/12/real-1st-century-or-simulated-14th-century-sweat-imprint/","cat":"image_theory","id":"comment-170970","author":"Colin Berry","site":"shroudstory"}]
