[{"title":"Could this be clinching evidence that the Shroud image is a contact scorch?","post":"Have just been looking at my flag counter. \n\nKnow what? I feel another pdf coming on – Thibault’s probably. 17 views no less from France, probably all Thibault’s, assuming MPH is busy elsewhere..Yup, Thibault seems to be trawling my site, looking for the more controversial postings it would seem (yes, I get a list of individual postings viewed, all free and unasked for from WordPress).\nOK, so will there shortly be a third Thibault pdf signposted at the top of Dan’s site, not just anti-scorching, but anti-me, the man, the retired science bod? But for what purpose if folk read them, as I have done, gives a detailed response (3 postings no less in response to the anti-scorching pdf ) only to get ZERO response. Yes, ZERO response, despite Thibault returning again and again to this site with his nitpicking questions and  his overarching, haughty, condescending dismissal of my approach and ideas . \nHere’s some unsolicited advice, Thibault. Take a break from Shroudology. You have been overdoing it dear chap. Listen, I know a physician in your neck of the woods who comes well recommended. Oops…\n","date":"February 5, 2013 at 9:19 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/02/01/could-this-be-clinching-evidence-that-the-shroud-image-is-a-contact-scorch/","cat":"medieval_forgery","id":"comment-1833","author":"colinsberry","site":"colinberry"},{"title":"Could this be clinching evidence that the Shroud image is a contact scorch?","post":"Here’s a quickie response to Matthias, put to Hugh, on the Other Site. I may embellish later.  \nFebruary 5, 2013 at 4:34 am | #7 \nWhat’s your current preferred theory Hugh? Is it the scorch theory?\nalthough I see some good points in Colin’s ideas, there are a few things that still trouble me about the scorch theory, including:\n– the general anatomical correctness of the image: statues of the 1300s were still struggling with anatomy\nSome say the head is too small!  Yup. I think it looks too small. As for those fingers, their length and skeletal quality… \n– certain characteristics of the image – eg. the rear foot sole imprints – very much appear as genuine organic images from a real body, rather than images generated from a bas relief template or equivalent\nI agree. The images are indistinct, but the little we see has an authentic look, so that indistinctness is only to be expected if, say, the linen had been pulled up against the underside of the feet. They definitely speak of a statue rather than (easier) bas relief. It’s possible I suppose that there was cannibalisation of separate templates – some bas relief, say for the head, some statue – for the limbs say. \n– the “wrist problem” – why the blood on the wrist when this was basically unknown in artistic depictions. Surely the wound would have been placed on the hand.\nBut that does not gel with the Shroud having been on display centuries before its showing at Lirey, to the extent that “poker holes” are said to be incorporated into the Pray Codex (not that I believe that for one moment). Surely the wrist wound(s) would have been incorporated too, and then appeared much earlier in Western art if the Shroud had been around as the authoritative guide.  Or there again, maybe the wrist wound was painted on afterwards by an overzealous 16th century(?)monk, but lacking in anatomical knowledge, and mistaking metacarpals for phalanges.\n– the general appearance of wounds across the body appear quite authentic to my eyes, rather than something ‘faked’\nThere are no wounds on the Shroud body image. Bloodstains, yes, but no wounds.\n– why the absence of loin cloth, again a historical norm. A fake created by scorching on a bas relief could have built in a loin cloth into the relief. Again why the big departure from the cultural norms of the time?\nBecause the crossed hands serve the same modesty-protecting function as a loin cloth? And crossed hands are surely more authentic in the context of being enshrouded in an enclosed tomb, away from casual observers and/or inquisitive eyes.\nPS: Here’s Hugh’s response, which appeared after I posted the above:\nFebruary 5, 2013 at 6:34 am | #8\nHi Matthias; the shroud is such a varied topic that I don’t have any theory encapsulating the entire thing. I’m mostly exploring the scorch idea for three reasons:\na) Several of the original papers by the STURP team describe the shroud as having many of the characteristics of a scorch, in particular the relationship between pressure or distance and image intensity and the fact that the image seems to be made of degraded cellulose.\nb) Scorching linen and observing the results is something anybody can do in their kitchen!\nc) Although degrading cellulose by scorching may not be the answer, experiments with superficiality, 3-D imaging and UV fluorescence may suggest a mechanism that can be achieved in other ways (gas diffusion or painting, for example).\nAll the difficulties you mention are entirely valid, and were the main reasons the STURP team rejected the hypothesis, but they are, for time being, outside my purlieu, as it were!\n","date":"February 5, 2013 at 8:56 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/02/01/could-this-be-clinching-evidence-that-the-shroud-image-is-a-contact-scorch/","cat":"medieval_forgery","id":"comment-1831","author":"colinsberry","site":"colinberry"},{"title":"Could this be clinching evidence that the Shroud image is a contact scorch?","post":"Thanks Hugh. Hugely thought-provoking as ever. Yes, i spotted that coincidence of blood and Type A TIDS. It seemed to support a blood-first scenario. Any views?\n","date":"February 3, 2013 at 8:09 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/02/01/could-this-be-clinching-evidence-that-the-shroud-image-is-a-contact-scorch/","cat":"medieval_forgery","id":"comment-1821","author":"colinsberry","site":"colinberry"},{"title":"Could this be clinching evidence that the Shroud image is a contact scorch?","post":"And another thing…\nIt is fascinating to compare Enrie’s photo with Durante’s. Enrie’s face, in addition to the crease across the beard, also shows a short double one under the chin, and another long one between the top of the head and the adjoining watermark. These are very prominent in Enrie, and almost invisible in Durante. Clearly “shadow” marks which have been pulled flat. All the more reason to wonder at the beard mark, which although also pulled flat, is clearly coloured along its length.\n","date":"February 3, 2013 at 8:07 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/02/01/could-this-be-clinching-evidence-that-the-shroud-image-is-a-contact-scorch/","cat":"medieval_forgery","id":"comment-1820","author":"Hugh Farey","site":"colinberry"},{"title":"Could this be clinching evidence that the Shroud image is a contact scorch?","post":"Yes, I too was surprised at how “easy” it was to see the streaks in Enrie, and how difficult in Durante’s. \nWhatever the true reason, how anyone could think those streaks*, regardless of how recorded for posterity,  represent simple folds and/or creases, as distinct from captured coloured image, doth truly pass all understanding!\nI’ve enjoyed reading your current comments on The Other Site, Hugh…\n* Well, the Type A ones at any rate, which were in the frame. Maybe Thibault’s response was based on looking too long and hard at an Enrie negative, and not long emough at the ‘less processed’ digital era Durante picture. It may well be that many on the Enrie are simply not visible on the other, for the reason given – they are non-imprinted streaks that are picked up purely by their casting a shadow as you suggest. Good thinking.\n","date":"February 3, 2013 at 8:18 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/02/01/could-this-be-clinching-evidence-that-the-shroud-image-is-a-contact-scorch/","cat":"medieval_forgery","id":"comment-1822","author":"colinsberry","site":"colinberry"},{"title":"Could this be clinching evidence that the Shroud image is a contact scorch?","post":"Colin: “Yes, I too was surprised at how “easy” it was to see the streaks in Enrie, and how difficult in Durante’s.”\nThe reason is easy to find.\nBut I will not give the answer on this blog.\n","date":"February 3, 2013 at 9:39 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/02/01/could-this-be-clinching-evidence-that-the-shroud-image-is-a-contact-scorch/","cat":"medieval_forgery","id":"comment-1823","author":"Thibault HEIMBURGER","site":"colinberry"},{"title":"Could this be clinching evidence that the Shroud image is a contact scorch?","post":"That makes two chicken-shit comments from you in one night, Thibault, three if you count the lies and slander you posted on The Other Site.  Aren’t we doing well?\n","date":"February 3, 2013 at 9:56 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/02/01/could-this-be-clinching-evidence-that-the-shroud-image-is-a-contact-scorch/","cat":"medieval_forgery","id":"comment-1824","author":"colinsberry","site":"colinberry"},{"title":"Could this be clinching evidence that the Shroud image is a contact scorch?","post":"Just a sample of Colin’s posts:\n“That is simply unscientific Thibault, and defies commonsense too” \n“With reluctance I have to say this Thibault – you don ‘t have the first clue as to the scientific modus operandi. Everything you write confirms that again and again”.\n““Much more interesting”? Have you any idea how condescending and arrogant you sound, Thibault? What gives you the right to decide what is or is not interesting? For your information I find little of that section above interesting at all, and of dubious relevance.”\n“You are seriously testing my patience with your barracking and false insinuations…”\n“PS: And I see you have repeated your ridiculous allegations on Dan Porters’ site. Contemptible. And you have the nerve to bandy around the term “gentleman”. It is you, Thibault, who needs to look at the way you interact with others online. You need to stop talking down the whole time, or posturing as if you know all the answers. You don’t.”\n“” Is the banding effect (which is a fact) consistent with the scorch hypothesis? I wonder..\nThibault.\nYou feel free to wonder,Thibault. Every second spent wondering is a second less spent promulgating your goal-directed brand of pseudo-science”.\nIs Colin a gentleman? You decide.\nNo more comment on this blog.\n","date":"February 3, 2013 at 10:32 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/02/01/could-this-be-clinching-evidence-that-the-shroud-image-is-a-contact-scorch/","cat":"medieval_forgery","id":"comment-1825","author":"Thibault HEIMBURGER","site":"colinberry"},{"title":"Could this be clinching evidence that the Shroud image is a contact scorch?","post":"I’m reminded of a naughty but nice joke I heard back in the 70s, just as the North Sea Oil boom was getting into full swing:\nOilman with foreign accent (I won’t say which) to barman: “Aberdeen! It’s the arsehole of the world”\nVoice from elderly local in corner: “So, would ye jus’ be passin’ through like?”\nPS: I have just inserted this into the text of the posting:\nBeware incoming (uncharitable thought): some of us dismiss radiation because there is no obvious means by which radiant energy from accessible or realistic parts of the em spectrum – near uv, visible, infrared –  can be absorbed sufficiently by white linen to produce chemical change, either as a primary consequence of bond scission, or secondary thermal effects. What the ‘radiationists’ seem to be doing, if I’m not mistaken, is to adduce  imprinting of the neck etc across an air-gap in a loosely-draped model, as evidence for action at a distance  – despite the subjective model, and, more importantly,  in clear contradiction to elementary physics (no chemical change without prior absorption of radiation). They then  compound the felony by invoking the inverse square law.  The latter only tells you that the flux density falls off (dramatically) with distance,  but that is irrelevant if it’s the wrong type of radiation (or  target, in this case linen)  that is unable to absorb sufficient radiation to be altered by it  to leave a “burned patch” ( leaving a recognizable image adds another order of complexity, even in 21st century ENSA laboratories far removed in time and space from 1st century rock tombs, one  that is usually glossed over if mentioned at all) . As Joe Nickell accurately observed, the pseudo-scientists start with the desired result and then work backwards to find the evidence.\nSee also this posting that has just appeared on Dan Porter’s site highlighting the contact/no contact issue. No prizes for guessing where the poster’s sympathies lie, but was it ever thus, despite the urbane front and affected semi-detachment?\nThere is more, much more, I could add in a similar vein. The ‘Shroud Center of Colorado’ beware:  I have you in my cross-hairs, oops, metaphorically-speaking of course – through having seen that recent stinker of a pdf from your two Vatican-appointed knights (why not Dr.John Jackson?)  that is frankly not just misinformation, but a mine of DISINFORMATION. \n","date":"February 4, 2013 at 9:38 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/02/01/could-this-be-clinching-evidence-that-the-shroud-image-is-a-contact-scorch/","cat":"medieval_forgery","id":"comment-1827","author":"colinsberry","site":"colinberry"},{"title":"Could this be clinching evidence that the Shroud image is a contact scorch?","post":"In order to see a crease at all, it must be differently coloured from the background of the cloth. One way of achieving this is for the crease to be lit from the side, when, if it is a valley, the side closest to the light source will be in shadow, and the side facing the light source, being more perpendicular to it, will be brighter than the background. If the crease is a ridge, the shading is reversed. This would occur in completely uncoloured cloth, and I believe most of the type 2 TIDS are of this kind. Intriguingly, the Shroud Scope “Durante 2002 Horizontal” image has the beard to the left of the eyes, while the “Face only” close up has it to the left. Because we seem to be attuned to think of light as generally coming from the top-left, the long crease running from the forehead, very close to the epsilon mark, through an eye and on down the length of the cloth, appears to be a ridge in the “Face only” version, but a valley in the bigger version. I wonder which it is.\nOther creases are possible. Sigmoid, or recumbent creases, are typified by a single large shadow if the ‘lip’ is facing away from the light source, or simply a bright leading edge if it is facing towards it.\nAs I say, these shadow details are observable in otherwise completely unmarked cloth. However, I have some difficulty with them in the shroud. If the shadow was a result of light coming from above or below the camera, as it travelled the length of the shroud, then transverse creases should be almost impossible to see, which is not the case. If from the right or left, then longitudinal creases should be invisible – also not the case. And if from any of the other four points of the compass, then the herringbone weave of the shroud should be much better defined in the strips lying across the rays of light than in those lying parallel to it. Also not the case.\nAll this being true, one is inclined to think that the visible colouration of TIDS may not be due to the light and shadow at all; in which case they would be visible even if the shroud were ironed completely flat. Many of the TIDS, especially the type 1s, seem to be of this type. They seem to have twin verges darker than the background, and pale middles, which seem to me to be about the same colour as the background. I’m inclined to postulate that these are sigmoid or recumbent folds, over which the image was made, leaving the hidden interior pale. Some of them have very sharply defined edges, which suggests some pressure, closing the fold quite tightly together, and others less so (such as the big one across the beard) where the image mechanism appears to have coloured the interior as well. Just as a test, I would expect one side of such a crease, which consists of two layers of cloth, to be darker than the other.\nThe most interesting one is right through the middle of a bit of the foot bloodstain (dorsal image), which is wholly uncoloured, suggesting the the fold was firmly closed when the blood made contact with the cloth.\nShroud Scope has a measuring device, which is not terribly accurate, varying according to the magnification of the image, but indicates that the widest of the ‘white valleys’ is less than 2mm, which means that the folds are less than 1mm apart, approximately equal to the thickness of the cloth, I guess.\nFortuitously (you might have guessed) I have recently spent some time rolling up and unrolling 5 metre lengths of cloth, which were acting as scenery for a travelling theatre, and these kinds of creases, both transverse and longitudinal, are very easy to ‘iron in’ as it were, and quite difficult to get out again later. Any mention of the shroud before the 1532 fire generally assumes it to be folded rather than rolled, from Ian Wilson’s Mandylion Face, to the Lirey poker holes, to the marks from the 1532 fire, so I am guessing that these creases are from the original manufacture of the cloth, be it 1st or 13th century, although some of them could easily have been ironed in further by one or other pressing mechanism, such as a hot bas relief.\n","date":"February 3, 2013 at 7:43 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/02/01/could-this-be-clinching-evidence-that-the-shroud-image-is-a-contact-scorch/","cat":"medieval_forgery","id":"comment-1816","author":"Hugh Farey","site":"colinberry"},{"title":"Could this be clinching evidence that the Shroud image is a contact scorch?","post":"Introductory para:  Well. I’m delighted to see that you have restored your Mobylette time machine to full working order, Thibault, and are able to enlighten us on the entire history of the Shroud from the date of its inception. \nHowever, I have to take issue with you on some ever so tiny details. That might take some time, given the number of details you have raised, and the fact that I am now becoming increasingly bored, not so much with the Shroud, as to the tactics of Shroudologists, and am more concerned right now with finalising my (damning) critique of Oppenheimer’s book on the genetic origins of les rosbifs.  Here, by way of a courtesy, is my immediate response  to your first point.\nYou say “dozens of transverse creases”. I don’t know which creases you are referring to, but what seems abundantly clear from the Durante 2002/ShroudScope image of the transverse crease at chin level  is that we are seeing  a feature that has essentially the same character and homogeneity as the body image.  In other words, it is not just a crease, but a baked-in crease, something you overlooked to mention (odd for someone who is so attentive to detail). (Late edit: I shall post details tomorrow of what provisionally one might call Type A and Type B transverse markings).\n Now that baked-in crease might in theory have arrived with the 1532 fire. But you say the crease is the result of “rolling” for storage. Are you not forgetting something? The bilateral symmetry of the 1532 scorch marks indicates without a shadow of doubt that the Shroud had been folded down its midline – between the eyes so to speak – at the time of the 1532 fire. Quite how could it have been folded down its long axis AND a number of transverse axes (again, symmetry)  – AND rolled up all at the same time to give a multitude of baked in creases  is a difficult concept for me to grasp. I suppose it’s just possible there had been rolling as well as folding. Perhaps you could supply some diagrams to back up your theory. \nIn the meantime, I work on the assumption that the baked-in creases were acquired at the time that the Shroud image was imprinted, especially as there is one at chin level, and another at the top of the head (best seen in Enrie negatives) , suggestive of imprinting when a rigid hot template was forced down into linen.\nThere are other details I could mention, like the twin-track appearance of the crease, tricky perhaps to explain as simple folding, but possible by the kind of invagination that might occur when the linen is subject to deformation from a rigid template under applied pressure exposing it to complex forces, especially when there is a soft backing underlay that allows a lot of movement. Invagination creates  cold spots – or cold linear furrows –  able to  escape scorching, as I proposed many moons ago.\n“This crease has nothing to do with the image formation process.”\nSorry, Thibault, but critics who indulge in that kind of dogmatic assertion are not ones I hasten to respond to. You may have to wait a while for answers to the rest of your points.\n","date":"February 2, 2013 at 8:30 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/02/01/could-this-be-clinching-evidence-that-the-shroud-image-is-a-contact-scorch/","cat":"medieval_forgery","id":"comment-1812","author":"colinsberry","site":"colinberry"},{"title":"Could this be clinching evidence that the Shroud image is a contact scorch?","post":"Regarding the crease (A above), it is just one of dozens of transverse creases “caused by compressing the fabric in the process of rolling it inappropriately… it is very important to analyse the correct interrelations, because we have to be careful not to give inappropriate weight to the existence of these creases.” (Flury-Lemberg, Sindone 2002).\nThis crease has nothing to do with the image formation process.\nThese transverse creases are very different from the “V-shaped” fold running vertically all along the center line of the fabric. “its existence points to the fact that the cloth, in order to protect its precious content, has been folded length wise with the image facing in, apparently from a very early point in time”. But once again this fold was made after the image.\nMuch more interesting is the discovery of another almost invisible fold, called by FL the “primary fold”. This fold can only be seen using grazing light. It is another much more delicate v-shaped grove only a few centimeters away from the other one described above which also runs along the whole length of the fabric. It belongs to the very first folding after the Shroud had been finished and is due to the production process of the fabric and is not the result of using the fabric.\nThis is certainly the only fold that was there before the image.\nI have no high-resolution photographs of this particular fold but at the first look there is nothing interesting to expect.\nTherefore A is false.\nRegarding B and C, I see no problem at all with any kind of non-contact process.\nThis kind of process may or may not leave an image between the chin and the chest.\nActually there is an image whose intensity is clearly related to the color of the transverse bands that are clearly seen.\nOnce again the “banding effect”.\nIs the banding effect (which is a fact) consistent with the scorch hypothesis ? I wonder..\nThibault.\n","date":"February 2, 2013 at 7:29 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/02/01/could-this-be-clinching-evidence-that-the-shroud-image-is-a-contact-scorch/","cat":"medieval_forgery","id":"comment-1811","author":"Thibault HEIMBURGER","site":"colinberry"},{"title":"Could this be clinching evidence that the Shroud image is a contact scorch?","post":"2nd  para’ (See response to introductory para below)\n“These transverse creases are very different from the “V-shaped” fold running vertically all along the center line of the fabric. “its (sic )existence points to the fact that the cloth, in order to protect its precious content, has been folded length wise with the image facing in, apparently from a very early point in time”. But once again this fold was made after the image.”\nOn what grounds do you expect me or anyone else to accept an  ex cathedra statement like “the fold was made after the image”?\nThat is simply unscientific  Thibault,  and defies commonsense too  – see my final picture above where it’s clear that the transverse streak at chin level is an INTRINSIC part of a centrally-situated AND remarkably homogeneous image, not some later add-on. \nSee the additions made today to this posting regarding the  chin-level imperfection  which I describe as a Type A “TIDS” (Transverse Image-Defacing Streak”). Note the central zone between the twin tracks largely devoid of colour that can be accounted for in the scorch hypothesis. Can YOU account for it Thibault – someone who seems content to accept a 1st century provenance while freely admitting to having no working hypothesis to explain how the Shroud image was created?\n","date":"February 3, 2013 at 6:46 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/02/01/could-this-be-clinching-evidence-that-the-shroud-image-is-a-contact-scorch/","cat":"medieval_forgery","id":"comment-1814","author":"colinsberry","site":"colinberry"},{"title":"Could this be clinching evidence that the Shroud image is a contact scorch?","post":"Paragraph 3:\n“Much more interesting is the discovery of another almost invisible fold, called by FL the “primary fold”. This fold can only be seen using grazing light. It is another much more delicate v-shaped grove only a few centimeters away from the other one described above which also runs along the whole length of the fabric. It belongs to the very first folding after the Shroud had been finished and is due to the production process of the fabric and is not the result of using the fabric.\nThis is certainly the only fold that was there before the image.\nI have no high-resolution photographs of this particular fold but at the first look there is nothing interesting to expect.”\n“Much more interesting”?  Have you any idea how condescending and arrogant you sound, Thibault? What gives you the right to decide what is or is not interesting?  For your information I find little of that section above interesting at all, and of dubious relevance.\n“Certainly the only fold that was there before the image”? Only rarely is there certainty in scientific research, Thibault – just degrees of uncertainty.\nWith reluctance I have to say this  Thibault  – you don ‘t have the first clue as to the scientific modus operandi. Everything you write confirms that again and again.\n","date":"February 3, 2013 at 7:09 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/02/01/could-this-be-clinching-evidence-that-the-shroud-image-is-a-contact-scorch/","cat":"medieval_forgery","id":"comment-1815","author":"colinsberry","site":"colinberry"},{"title":"Could this be clinching evidence that the Shroud image is a contact scorch?","post":"Colin,\nI was just writing a polite answer to your previous posts, with a proposal to send you some photographs from Flury-Lemberg’s book, showing that you are wrong regarding the creases and particularly your “final picture” .\nWhile I was writing, I received your last post.\nSince this last post is simply an insult to me and to Mrs. Flury-Lemberg (probably the best expert in the world), I will not waste my time with you.\nI am ready to discuss with a gentleman. You are not a gentleman.\nSadly,\nThibault.\n","date":"February 3, 2013 at 7:49 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/02/01/could-this-be-clinching-evidence-that-the-shroud-image-is-a-contact-scorch/","cat":"medieval_forgery","id":"comment-1817","author":"Thibault HEIMBURGER","site":"colinberry"},{"title":"Could this be clinching evidence that the Shroud image is a contact scorch?","post":"Nowhere did you say anything about sending photographs – which I would have been happy to receive, and nowhere did I make any reference to the good lady – whom you only mentioned in passing. So kindly leave Mme. Flury-Lemberg out of this, Thibault. You are seriously testing my patience with your barracking and false insinuations…\nPS:  And I see you have repeated your ridiculous allegations on Dan Porters’ site. Contemptible. And you have the nerve to bandy around the term “gentleman”. It is you, Thibault, who needs to look at the way you interact with others online. You need to stop talking down the whole time, or posturing as if you know all the answers. You don’t. Oh, and one final thing: anyone who thinks that the streaks on the Shroud are simple folds and creases with no imprinting reveals a monumentally poor grasp of that artefact and what those photos represent…\n","date":"February 3, 2013 at 8:00 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/02/01/could-this-be-clinching-evidence-that-the-shroud-image-is-a-contact-scorch/","cat":"medieval_forgery","id":"comment-1819","author":"colinsberry","site":"colinberry"},{"title":"Could this be clinching evidence that the Shroud image is a contact scorch?","post":"Reply to 5th and final para:\n“Therefore A is false”.\nA is simply a label on a diagram, showing a prominent transverse marking. Whether or not you accept my view that it is as intrinsic to the Shroud image as anything else – you cannot say it is “false”. How can a feature that has precisely the same hue as the body image, yet largely obliterates any superimposed body image due to having that  pale central zone between the twin tracks, be described as “false”?\n“Regarding B and C, I see no problem at all with any kind of non-contact process.”\nYou don’t see any problem with there being no known radiation capable of scorching linen at a distance, while still  leaving an imprint of undamaged hair?\n“This kind of process may or may not leave an image between the chin and the chest.\nHow can it leave an image, given the air gap? \nWhat’s the source of radiation? How was it brought to a focus  or collimated – needed to form an image as distinct from a diffuse discoloration? Since when has wishful thinking been a substitute for science – or are you content to be seen as promoting pseudo-scientific twaddle?\n“Actually there is an image whose intensity is clearly related to the color of the transverse bands that are clearly seen. Once again the “banding effect”.\nThe banding effect is usually wheeled out to counter the suggestion that the face looks too thin and gaunt. In fact the margins are not sufficiently linear to lend much support to yarn variability as the major cause for the abrupt cut off of the face at the two lateral margins. The high degree of bilateral symmetry also makes it improbable that banding is the major reason for the severe and, some might say, unrealistic mask-like character of that face. If it were not for the photogenic enhancement that comes with turning the pseudo-negative into a positive, I doubt whether the TS would exert the hold it does on so many folk – given its luminous and haunting character. However, a quick charcoal sketch of yourself, as could be had in many a tourist centre, would probably endow you too with a luminous and haunting quality, Thibault,  after uploading to ImageJ software. \n” Is the banding effect (which is a fact) consistent with the scorch hypothesis? I wonder..\nThibault.\nYou feel free to wonder,Thibault. Every second spent wondering is a second less spent promulgating your goal-directed brand of pseudo-science.\n","date":"February 3, 2013 at 7:52 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/02/01/could-this-be-clinching-evidence-that-the-shroud-image-is-a-contact-scorch/","cat":"medieval_forgery","id":"comment-1818","author":"colinsberry","site":"colinberry"}]
