[{"title":"Really, Really New Big Deal Shroud of Turin Website","post":"Okay, I decided to buy a copy of the History Channel’s Real Face of Jesus DVD. There it was listed as a hot topic in History’s online shop. When I clicked on the link I discovered that I can only pre-order it for delivery more than a month from now. What gives?\n\n","date":"September 29, 2010 at 12:02 pm","url":"https://shroudstory.com/2010/09/28/americans-deeply-ignorant-about-religion-shroud-of-turin/","cat":"image_theory","id":"comment-1460","author":"guest","site":"shroudstory"},{"title":"Really, Really New Big Deal Shroud of Turin Website","post":"Would be nice if I had some of those red/blue 3d glasses they use for some 3d movies. Maybe the site could give instructions on where to get them. I do have a pair of polarized glasses from a recent movie but they don’t work.\nEverything else looks good so far.\n\n","date":"September 29, 2010 at 2:29 pm","url":"https://shroudstory.com/2010/09/28/americans-deeply-ignorant-about-religion-shroud-of-turin/","cat":"image_theory","id":"comment-1462","author":"Francis","site":"shroudstory"},{"title":"Really, Really New Big Deal Shroud of Turin Website","post":"Francis, you can order 3D glasses from Amazon.com. You want to be sure you order the red and cyan ones. You want good ones such as Pro-Ana PRO-X style glasses for viewing anaglyphs on LCD monitors. They’ll run you about $4.70 plus shipping. Here is a link: http://www.amazon.com/Pro-AnaTM-Prescription-Glasses-Movies-Screens/\n\n","date":"September 29, 2010 at 2:40 pm","url":"https://shroudstory.com/2010/09/28/americans-deeply-ignorant-about-religion-shroud-of-turin/","cat":"image_theory","id":"comment-1463","author":"Episcopalian","site":"shroudstory"},{"title":"Really, Really New Big Deal Shroud of Turin Website","post":"You might want to caution your readers.\nThere is something troubling about the 3D imagery generated by Petrus Soons. Look at the blood stains on the forehead and in the hair. They are close to full white ranging mostly from 211 to 240 on a 255 grayscale. Yet it is in the extreme that the stains are seemingly on the same elevation as surrounding 88 gray. I think impossible! How was this accomplished? \nDid Soons find some brilliantly intelligent software that imitates non-algorithmic human swizzling? There are other instances where the plotted terrain cliffs or flies dramatically up or down because it seems human judgment says it should in places where ordinary algorithms would certainly fail to accomplish this. This is particularly so where Soons applies the Barrie Schwortz adjustment on the left cheek but not the right cheek, yet the hill and valley pattern is the same. Check it out with the stereoscopic images and densitometer in Photoshop. How is this so?\nI can find nowhere on his cite where Soons explains his methods or what computer programs he used except for the prepping of anaglyphs, lenticulars and stereos. What did he use?\nThe VP8 work was honest and true. It may have been primitive but it worked. Let’s just say I have a hard time understanding how the Soons images are algorithmically done. Reproduce this work in the public eye, I say. Explain how software does such magical things. Provide some large hidef images for examination. \nAl\n\n","date":"September 30, 2010 at 5:04 pm","url":"https://shroudstory.com/2010/09/28/americans-deeply-ignorant-about-religion-shroud-of-turin/","cat":"image_theory","id":"comment-1468","author":"Nova Scotia","site":"shroudstory"}]
