[{"title":"Rejecting all the “energetic” hypothesis for the Shroud of Turin image","post":"As I understand it, Roger’s Maillard-based theory involves creating the equivalent of an emulsion layer on the surface of the fibers.  This layer reacts with the ammonia-based products associated with the process of putrefaction and discolors to produce an image. It is an interesting and indeed ingenious theoretical construct in many ways.  One of its attractions is that it can be seen as an entirely natural process without recourse to more esoteric explanations. Indeed, from my own discussions with Ray Rogers, it is clear that he set out to find some kind of theory for image formation that was a natural process to counteract the claims for the “miraculous” that he felt had tarnished the reputation of STURP.  He succeeded in finding a theory. However, as anyone who has any technical experience of creating images will quickly testify, the possibility that the process could account for an image of the size, complexity and, above all, homogeneity of the Shroud image is zero.  I would gladly raise that numerical estimate if anyone, anywhere can cite a meaningful image of anything created by a Maillard reaction.\n\n","date":"July 11, 2012 at 6:21 am","url":"https://shroudstory.com/2012/07/11/rejecting-all-the-energetic-hypothesis-for-the-shroud-of-turin-image/","cat":"image_theory","id":"comment-13724","author":"shroudenigma","site":"shroudstory"},{"title":"Rejecting all the “energetic” hypothesis for the Shroud of Turin image","post":"Read again the book of Rogers please, especially the portion where he talked about 2 preliminary tests he did to verify some aspects of his hypothesis.  These 2 tests were so good (even if they were not intend to be done to replicate the Shroud), that Rogers stayed with this hypothesis and wanted to search more deeply in that direction.  That speak loud to me.  Do you believe one second that if his preliminary tests would have gave bad results, he would have stayed with this hypothesis until his death ?  This is a ludicrous idea.  He would have started to look elsewhere.  The reality is this :  HE DID NOT…\nI also want to react to one thing you said : “it is clear that he set out to find some kind of theory for image formation that was a natural process to counteract the claims for the “miraculous” that he felt had tarnished the reputation of STURP.”\nI’m sure this was not the principal motivation of Rogers.  His first motivation was to find the truth and, because he was a credible scientist, how in the world would he start to search elsewhere than in the direction of a “natural” hypothesis ?  By the way, if Rogers hypothesis is correct regarding the Shroud, that doesn’t mean one bit that Jesus has not resurrect !  It seem like most people around here think that the Shroud MUST be the by-product of a supernatural event in order to “protect” the fundation of Christian faith !  What a ludicrous idea !  If the resurrection was JUST a dematerialization of his body (without puffs of smoke and laser beams !), then how Rogers hypothesis could be seen has a “threat” for the reality of the resurrection ?  Don’t you believe in the Incarnation ?  That Jesus was a real man and, by implication, his dead body was really a human corpse ?  Don’t you believe that a real human corpse that was tortured and died of crucifixion could not have released some biological products (like water vapor, different kinds of amines from ammoniac to putrecine, urea, lactic acid, sweat, etc.) that, IT IS PROVEN (read again please the STURP papers, particularly the ones writen by Rogers and also Pellicori), can leave a coloration on linen that is similar than what his seen on the Shroud ???  In that context, I don’t see one good reason why Jesus corpse could not have stayed in his shroud for, let’s say, 36 hours, well enough time to leave an imprint on the cloth, and then, only at that time, leave the Shroud by the way of a dematerialization that was not accompanied by a release of any kind of radiation…  Give me one good reason why the scenario I just describe cannot be true ???  One thing’s for sure :  if Rogers hypothesis would be proven one day to be good versus the Shroud, nobody would have the right to claim that it is a proof that Jesus never resurrect.  What I really want to say about that is this :  In the present state of our knowledge, because science has not come full circle versus all the possible natural hypotheses concerning the image formation, we don’t need the help of a by-product of the resurrection to explain this relic…\nAnd along with his quest for truth, I’m sure it’s true that Rogers wanted to shut the mouth to the supernatural fringe (that has very sadly taken the lead of Shroud research after the infamous 1988 C14 dating) and, in my mind, IT’S ALL IN HIS HONOUR !!!  That’s why the supernatural fringe (with their fanatism to always push forward their bad religious agenda, that is to try to prove the resurrection using the Shroud, which goes, by the way, totally against the correct catholic theology) have started an anti-Rogers crusade after his death !  It’s not an happy sight to see them acting the way they do.  In fact, for someone like me, who want to stay scientifically grounded in his seek for truth versus the Shroud and who is a catholic who don’t consider himself to be a “religious freak”, it’s completely disgusting to see the state of Shroud research these days…\n\n","date":"July 11, 2012 at 5:55 pm","url":"https://shroudstory.com/2012/07/11/rejecting-all-the-energetic-hypothesis-for-the-shroud-of-turin-image/","cat":"image_theory","id":"comment-13748","author":"Yannick Clément","site":"shroudstory"},{"title":"Rejecting all the “energetic” hypothesis for the Shroud of Turin image","post":"Nothing I say should suggests anything but the deepest respect for Ray Rogers. Neither does it follow that my criticism of the Maillard hypotheses indicates favoring any other particular image formation theory.  The fact is that nowhere in history or indeed today can anyone point to any kind of image produced by a Maillard reaction. If its supporters deem it possible to create a 14ft evenly graduated image of both sides of a corpse then they should be able to show, say, a 6 inch version of anything.  Until they can, I suggest that time spent theorizing and eulogizing would be better spent making one.\n\n","date":"July 12, 2012 at 4:41 am","url":"https://shroudstory.com/2012/07/11/rejecting-all-the-energetic-hypothesis-for-the-shroud-of-turin-image/","cat":"image_theory","id":"comment-13770","author":"shroudenigma","site":"shroudstory"},{"title":"Rejecting all the “energetic” hypothesis for the Shroud of Turin image","post":"M. Rolfe, for once, I mostly agree with your comment !  I think it’s about time now that some other chemist could take Rogers work and push it forward.  I truly believe we could have some nice surprises.  You must recongnize that, other than Rogers (who sadly died before having been able to really test and develop his hypothesis properly), there is no other scientist who really took up his work and tried to make experiments in order to analyze it more deeply.  That’s maybe the only reason why “nowhere in history or indeed today can anyone point to any kind of image produced by a Maillard reaction”, like you said…  Who can be sure about that ?  As I said often, Rogers was pleased enough by the few preliminary experiments he made (because they proved that some important aspects of the image on the Shroud could be reproduced with the process he proposed) that he stayed with it until his death.  If those preliminary tests would have gaven him very bad results, do you think he would have defend his hypothesis until he died ?  I really don’t think so.  That’s not a proof that his hypothesis was correct regarding every aspect of the Shroud, but that proved that, theoretically, regarding all the data we know about this relic, more testing deserve to be done to check it out properly and, right now, no one has the right to discard it on the simple base that “nowhere we have found another image like the Shroud produced by a Maillard reaction”.  Have you ever thought that the phenomenon that was active inside the tomb and inside the Shroud could have been VERY UNCOMMON (like the tortured and crucified body was also very uncommon) while, nevertheless, remaining totally natural ???  That would explain the lack of other examples like the image on the Shroud.  I think it’s fair to say that, in nature, there really are phenomenons that are extremely rare because it need that a lot of different factors (some can be rare too) must be joined together at the same time and in the same place.  So, I ask you :  Why wouldn’t be the same thing for the Shroud ???  Who can be sure about that ??? And we must also note this important fact : How many burial Shroud from the first century of a beaten, scourged and crucified man do we have intact these days ?  Absolutely zero !  So, in that context, if the image formation process that lead to the image we see on the Shroud needed a tortured and crucified body (and not a “normal” corpse) in order to be active (simple supposition on my part), wouldn’t be normal that no other body image as good as the one on the Shroud have been found ???  All that to say this : Can we please wait until all the possible experiments could be performed regarding Rogers hypothesis before thinking that it MUST be discarded ???  Should I remind you that, for the moment, this hypothesis should be seen as one of the only hypothesis that present a true rational explanation (theoretically for the moment) that could account for all the data we know about the Shroud ?  I say “could” of course because it’s far from being proven yet, but nevertheless, this hypothesis is one of the few that can pretend explaining ALL the different aspects of the Shroud (even the possible image of the hair, the beard and the mustache that might be present on the reverse side of the cloth)…\n\n","date":"July 13, 2012 at 2:15 pm","url":"https://shroudstory.com/2012/07/11/rejecting-all-the-energetic-hypothesis-for-the-shroud-of-turin-image/","cat":"image_theory","id":"comment-13826","author":"Yannick Clément","site":"shroudstory"},{"title":"Rejecting all the “energetic” hypothesis for the Shroud of Turin image","post":"Yannick ¿ha medido la distancia entre la parte más externa del PÓMULO DERECHO y la parte más externa del PÓMULO IZQUIERDO?\nTiene alguna EXPLICACIÓN que justifique la distancia, inferior a 11 centímetros, que se mide entre ellos?\n¿Sobrenatural?\n\n","date":"July 11, 2012 at 6:28 pm","url":"https://shroudstory.com/2012/07/11/rejecting-all-the-energetic-hypothesis-for-the-shroud-of-turin-image/","cat":"image_theory","id":"comment-13749","author":"corneliotel","site":"shroudstory"},{"title":"Rejecting all the “energetic” hypothesis for the Shroud of Turin image","post":"I really don’t think that Ray Rogers hypothesis goes against the idea of a vertical projection that COULD have caused that kind of result…  More laboratory researches need to be done to verify Rogers hypothesis.  Sadly, that still wait to be done.  Of course, it is much more easy to go into a lab with a little piece of linen and bombard it with protons, neutrons, UV lasers or a corona discharge and pretend that the result is similar to the Shroud’s image ! ;-)\n\n","date":"July 11, 2012 at 7:37 pm","url":"https://shroudstory.com/2012/07/11/rejecting-all-the-energetic-hypothesis-for-the-shroud-of-turin-image/","cat":"image_theory","id":"comment-13758","author":"Yannick Clément","site":"shroudstory"},{"title":"Rejecting all the “energetic” hypothesis for the Shroud of Turin image","post":"Thanks Yannick.  That really piques my interest to read Ray’s book.  I have it but haven’t made time to read it.  Perhaps I need to do so.\n\n","date":"July 11, 2012 at 7:28 pm","url":"https://shroudstory.com/2012/07/11/rejecting-all-the-energetic-hypothesis-for-the-shroud-of-turin-image/","cat":"image_theory","id":"comment-13755","author":"Andy Weiss","site":"shroudstory"},{"title":"Rejecting all the “energetic” hypothesis for the Shroud of Turin image","post":"Really ?  You got this great book (one of the best ever written about the Shroud) and you didn’t had time to read it ?  GO AHEAD my friend !!!  Don’t lose one more second !!! :-)\n\n","date":"July 11, 2012 at 7:34 pm","url":"https://shroudstory.com/2012/07/11/rejecting-all-the-energetic-hypothesis-for-the-shroud-of-turin-image/","cat":"image_theory","id":"comment-13757","author":"Yannick Clément","site":"shroudstory"},{"title":"Rejecting all the “energetic” hypothesis for the Shroud of Turin image","post":"Thanks for your encouragement, my friend.  Barrie told me it was quite excellent.  I would have really like Ray Rogers.\n\n","date":"July 11, 2012 at 9:27 pm","url":"https://shroudstory.com/2012/07/11/rejecting-all-the-energetic-hypothesis-for-the-shroud-of-turin-image/","cat":"image_theory","id":"comment-13764","author":"Andy Weiss","site":"shroudstory"},{"title":"Rejecting all the “energetic” hypothesis for the Shroud of Turin image","post":"Your welcome.  The problem in the Shroud world (or part of the Shroud world) is that all the partisans of any supernatural hypothesis for image formation (I don’t want to mention any name because there are easy to spot) had a tendency to do some Rogers bashing after he died in order to try to buried his interesting hypothesis with him in the grave !  And when I see people acting like that, I just found it completely disgusting simply because it goes against a real seek for truth…  There’s a lot of politics and bad agendas in the Shroud world these days and, in my mind, this is going to destroy the rest of credibility that might be left in sindonology.  The danger is real and, already, the effects are there.  I have talked to a bunch of scientists in the last couple of years (scientists that work outside the Shroud world) and realized that most of them don’t take Shroud science very seriously…  It’s sad to see and it’s mainly due to these members of the supernatural fringe who constantly want to destroy any good and rational science made by some credible scientists concerning the Shroud.  Why ?  Simply because they know that there’s a real possibility that one of them (like Rogers for example, but there are others) can approach the truth versus the Shroud while avoiding to call for any supernatural phenomenon and that goes completely against their system of belief regarding this “holy” relic…  For someone who have eyes to see, religious fanatism (that often goes with money-making agenda while using Jesus-Christ) is everywhere in the Shroud world and it’s very sad to note.  And as I say, it all really started when the results of the C14 where published at the end of the 1980s.  From that moment on, we saw a bunch of religious fanatics taken the lead of Shroud research and that phenomenon is still going on these days…  I’ll leave you with a short reflection of mine :  From the moment a person (a scientist or not) proposed some kind of supernatural hypothesis to explain the body image on the Shroud, that person automatically fall in the trap of religious agenda.  Why ?  Simply because someone will NEED faith in order to believe in his hypothesis !!!  Automatically, this kind of hypothesis can only be backed-up by “faithful” scientist and, when something like that happen, automatically we’re steping out of true and correct science to fall into what Rogers called “the lunatic fringe” of Shroud science and what I prefer to call “the supernatural fringe” of Shroud science (which is more or less like science-fiction to me).  And I want to make it clear :  I say that even if I believe the Shroud is authentic and Jesus-Christ truly resurrect !  I think someone can be a catholic believer and, at the same time, stay open to the possibility that the image was formed naturally…  One don’t go against the other in my mind.\n\n","date":"July 13, 2012 at 1:28 pm","url":"https://shroudstory.com/2012/07/11/rejecting-all-the-energetic-hypothesis-for-the-shroud-of-turin-image/","cat":"image_theory","id":"comment-13819","author":"Yannick Clément","site":"shroudstory"},{"title":"Rejecting all the “energetic” hypothesis for the Shroud of Turin image","post":"“I really don’t think that Ray Rogers hypothesis goes against the idea of a vertical projection that COULD have caused that kind of result…”\nRogers no habría admitido una proyección ORTOGONAL al plano de la Sábana……..\nLa “vertical projection” sólo es posible si la Sábana está plana ( Mario Latendresse disiente), pero son las MEDIDAS las que deben decidirlo.\nLa nariz (NOSE) no son unos PUNTOS, es una gran MASA de color, vertical, en el centro de la cara.\nLos PÓMULOS Y MEJILLAS no son unos puntos, son 2 grandes MASAS de color a ambos lados de la nariz.\nEl CABELLO no son unos puntos, son 2 grandes MASAS de color a ambos lados de la cara.\nNO SON PUNTOS, son  GRANDES MASAS las que habrían tenido contacto con la Sábana para admitir la imagen por contacto y la PROYECCION VERTICAL…….pero las medidas realizadas entre puntos opuestos en la cara que ATRAVIESEN la nariz (NOSE) dan resultados NO POSIBLES en la imagen de un SER REAL que sea una proyección vertical por contacto con la Sábana.\nSÓLO son coherentes esas medidas con una proyección ortogonal al plano de la Sábana.\nLas medidas realizadas sobre la cabeza que da Mario Latendresse en “The Turin Shroud Was Not Flattened Before….” son medidas NO POSIBLES en un SER REAL en contacto (imagen por contacto) con la Sábana.\nEn la Fig 1  de su trabajo, Mario determina los vectores F, G y H, que atraviesan la nariz (NOSE).\nF.- Width of face, tip nose……11,6 centímetros. NO POSIBLE en imagen por CONTACTO.\nG.-Width of face-hair………….21,1 centímetros.¡NO POSIBLE! en imagen por CONTACTO.\nH.-Head height…………………..25,1 centímetros. NO POSIBLE en imagen por CONTACTO.\nCualquier medida que se haga sobre la Sábana atravesando la nariz (NOSE) pone en EVIDENCIA que el contacto no ha podido producirse para generar la imagen.\nPara la demostración NO SE PRECISA un Laboratorio ni grandes científicos.\nSE PRECISA SÓLO una cinta de medir, el rostro propio o el rostro de familiares o amigos……y la voluntad de realizar la medición.\n¿Conoce algún adulto de conformación normal, de estatura entre 1,70-1,80 metros, con abundante cabello, que presente esas medidas apuntadas F, G y H  sobre su cabeza?\nNo lo encontraría porque no son posibles.\nEsas medidas sólo SON COMPATIBLES con la proyección ORTOGONAL de un cuerpo al PLANO de la Sábana.\nCarlos\n\n","date":"July 12, 2012 at 7:43 am","url":"https://shroudstory.com/2012/07/11/rejecting-all-the-energetic-hypothesis-for-the-shroud-of-turin-image/","cat":"image_theory","id":"comment-13771","author":"corneliotel","site":"shroudstory"},{"title":"Rejecting all the “energetic” hypothesis for the Shroud of Turin image","post":"\nshroudenigma :\nNothing I say should suggests anything but the deepest respect for Ray Rogers. Neither does it follow that my criticism of the Maillard hypotheses indicates favoring any other particular image formation theory.  The fact is that nowhere in history or indeed today can anyone point to any kind of image produced by a Maillard reaction. If its supporters deem it possible to create a 14ft evenly graduated image of both sides of a corpse then they should be able to show, say, a 6 inch version of anything.  Until they can, I suggest that time spent theorizing and eulogizing would be better spent making one.\n\nThis is reasonable and I think Rogers would agree. In short we need more experimentation with this hypothesis. I think Rogers hypothesis of a Maillard reaction is the most plausible but we need scientists to actually pursue it to see where it leads.\n\n","date":"July 12, 2012 at 7:43 pm","url":"https://shroudstory.com/2012/07/11/rejecting-all-the-energetic-hypothesis-for-the-shroud-of-turin-image/","cat":"image_theory","id":"comment-13796","author":"Chris","site":"shroudstory"},{"title":"Rejecting all the “energetic” hypothesis for the Shroud of Turin image","post":"I thought about this aspect of the problem Chris and I came out with the idea that the very best persons that would be able to take the lead and pursuie Rogers work are some of his colleagues at Los Alamos National Lab, starting with Bob Villarreal, who already did some analyses concerning Rogers work regarding the C14 sample…  I really believe that this guy (because he’s also a chemist, and because he know the subject and knew Rogers personally) would be the best one (along with other colleagues maybe) to start a new series of experiments versus Rogers hypothesis.\n\n","date":"July 13, 2012 at 2:22 pm","url":"https://shroudstory.com/2012/07/11/rejecting-all-the-energetic-hypothesis-for-the-shroud-of-turin-image/","cat":"image_theory","id":"comment-13827","author":"Yannick Clément","site":"shroudstory"},{"title":"Rejecting all the “energetic” hypothesis for the Shroud of Turin image","post":"Do you have contacts with Bob Villareal ? Actually, there is a very serious hypothesis to explore here, according to Rogers’ hypothesis + Thibaut’s paper on reactive amines. And the image pattern is consistent with a diffusion process. I think there should be physicists at the LANL able to study rigorously this hypothesis.\n\n","date":"July 14, 2012 at 8:26 am","url":"https://shroudstory.com/2012/07/11/rejecting-all-the-energetic-hypothesis-for-the-shroud-of-turin-image/","cat":"image_theory","id":"comment-13844","author":"anoxie","site":"shroudstory"},{"title":"Rejecting all the “energetic” hypothesis for the Shroud of Turin image","post":"No, not at all.  I don’t know Villarreal.  I just mention this name as someone who could possibly be interested to push forward the work of Rogers.  I really think he would be one of the best person alive to do the kind of very technical analyses it is needed.  But, the question is always the same : Can someone like him (and/or one of his colleagues at Los Alamos) could be interested to do this kind of tough job concerning something like the Shroud of Turin ???  I’m not sure, but I don’t think it’s impossible to see that happening one day.  I know that M. Villarreal is very interested by the subject…  That’s one good point!!!\n\n","date":"July 15, 2012 at 6:37 pm","url":"https://shroudstory.com/2012/07/11/rejecting-all-the-energetic-hypothesis-for-the-shroud-of-turin-image/","cat":"image_theory","id":"comment-13880","author":"Yannick Clément","site":"shroudstory"},{"title":"Rejecting all the “energetic” hypothesis for the Shroud of Turin image","post":"Ok.\nThere are very solid arguments pointing to a diffusion process. Maybe it’s time to request for help, if he is interested he could give a look or foward it to his PhDs.\n\n","date":"July 16, 2012 at 5:55 am","url":"https://shroudstory.com/2012/07/11/rejecting-all-the-energetic-hypothesis-for-the-shroud-of-turin-image/","cat":"image_theory","id":"comment-13891","author":"anoxie","site":"shroudstory"},{"title":"Rejecting all the “energetic” hypothesis for the Shroud of Turin image","post":"Please, please!…..in 2012 you do not need a PhD student to simulate a diffusion process like this. Currently, you have readily available software like FLUENT or STAR CCM to simulate the motion/diffussion of the amines (perhaps not the chemistry)from a body. Everyday, similar simulations applied to heat, human sweat and blood are being carried out for medical and confort evaluation purposes.\n\n","date":"July 16, 2012 at 6:51 am","url":"https://shroudstory.com/2012/07/11/rejecting-all-the-energetic-hypothesis-for-the-shroud-of-turin-image/","cat":"image_theory","id":"comment-13892","author":"Gabriel","site":"shroudstory"},{"title":"Rejecting all the “energetic” hypothesis for the Shroud of Turin image","post":"The point is to have a multidisciplinary approach and get a final answer.\n\n","date":"July 16, 2012 at 8:08 am","url":"https://shroudstory.com/2012/07/11/rejecting-all-the-energetic-hypothesis-for-the-shroud-of-turin-image/","cat":"image_theory","id":"comment-13893","author":"anoxie","site":"shroudstory"}]
