[{"title":"Response of my thermally-imprinted models of the Man on the Turin Shroud to an allegedly crucial test with ultraviolet light.","post":"Colin,\nFirst, I would like to wish you a happy new year 2016.\nAfter some researches, I have found what follows:\nAll of the “détecteurs de faux billets” I have found, like yours, transmit a UV light between 350 and 375 nm (UVA).\nIn STURP experiment the UV source “enabled wavelengths of 335 to 375 nm…” and ” the film was to record only radiation emitted in the visible region of the spectrum, and none of the reflected , exciting UV”. \nSo, Your experiments are significant.\nQuestions:\n1) How do you explain the differences between your scorch experiments and Hugh’s scorch experiments (showing fluorescence) ? Hugh ?\n2) How do you explain the reddish fluorescence of the margins of the burns on the Shroud ?\n","date":"January 2, 2016 at 8:36 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/02/response-of-my-thermally-imprinted-models-of-the-man-on-the-turin-shroud-to-an-allegedly-crucial-test-with-ultraviolet-light/","cat":"turin_shroud","id":"comment-6645","author":"HEIMBURGER","site":"colinberry"},{"title":"Response of my thermally-imprinted models of the Man on the Turin Shroud to an allegedly crucial test with ultraviolet light.","post":"Hello again TH. A  Happy New Year to you and your family.\nThanks for tracking down the range of wavelengths used in the 1978 work. Yes they are broadly similar to those in the typical bank note detector, though having a somewhat greater output in the shorter range of wavelength (335-350nm).\nThe only reason i can think for Hugh seeing fluorescence is to do with the source of lamp. I get the impression that Hugh’s 150W source (!) is a modified tungsten lamp, one that takes a while to get up to maximum temperature, probably radiating progressively more UV-B as it does so. Mine uses a small coated fluorescent tube, a mere 4 watts.\nWhy should the margins of the TS burn holes fluoresce red? One can only speculate, but I suspect it’s to do with the chemistry of partial carbonization that occurs at much higher temperatures than my typical oven temperatures of 200- 250 degrees C.The elemental carbon in charred organic material is said to have a graphite-like structure of fused benzene rings. The latter is formed by condensation/polymerization of low molecular aromatic monomers (benzenoid precursors).  I suspect that its those precursors that do not fully polymerize to elemental carbon, maybe becoming PAH (polycyclic aromatic carbons), similar to naphthalene, anthracene etc that are responsible for the pink or red fluorescence , but I’m open to other suggestions. There is NO carbonization in any of my scorches, including the Mark1 type formed with heated metal templates. How do I know? Answer: they decolorize completely when treated with domestic bleach (sodium hypochlorite). Elemental carbon cannot be bleached.\nMy position is that charred edges with intrinsic fluorescence cannot be held up as typical “scorches” and then used to rule out any kind of thermally-assisted  imprinting as the mechanism of the TS body image formation.\n","date":"January 2, 2016 at 9:01 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/02/response-of-my-thermally-imprinted-models-of-the-man-on-the-turin-shroud-to-an-allegedly-crucial-test-with-ultraviolet-light/","cat":"turin_shroud","id":"comment-6646","author":"Colin Berry","site":"colinberry"},{"title":"Response of my thermally-imprinted models of the Man on the Turin Shroud to an allegedly crucial test with ultraviolet light.","post":"good stuff keep at it! this mystery will be solved!\n","date":"January 2, 2016 at 6:02 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/02/response-of-my-thermally-imprinted-models-of-the-man-on-the-turin-shroud-to-an-allegedly-crucial-test-with-ultraviolet-light/","cat":"turin_shroud","id":"comment-6642","author":"Mutant Buzzard","site":"colinberry"},{"title":"Response of my thermally-imprinted models of the Man on the Turin Shroud to an allegedly crucial test with ultraviolet light.","post":"Thanks. MB.  I seem to recall you looking in once or twice before. Were you ever on Dan Porter’s site too – maybe under a different pseudonym? Or another site?\n","date":"January 2, 2016 at 6:11 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/02/response-of-my-thermally-imprinted-models-of-the-man-on-the-turin-shroud-to-an-allegedly-crucial-test-with-ultraviolet-light/","cat":"turin_shroud","id":"comment-6643","author":"Colin Berry","site":"colinberry"},{"title":"Response of my thermally-imprinted models of the Man on the Turin Shroud to an allegedly crucial test with ultraviolet light.","post":"Have just added this image to the end of the posting.\n\nLet’s hope it inserts here (have switched from Firefox to Chrome – don’t ask).\nWhy the sudden interest in rye flour?\nMy flour-imprinting model was piloted using wheat flour, which works fine in principle, but there’s a problem in practice. it’s quite difficult to get rid of the thick encrusted material in the final soap-washing stage. Might that be due to the gluten protein of wheat, which is unique in nature not only for its visco-elastic properties (exploited in dough and breadmaking) but also insolubility in water. Maybe there were alternatives in the medieval period, equally good for image-making, but easier to attenuate in the final washing stage to get that iconic faint and ghostly image.\nRye flour has approximately the same protein content as my previously used wheat flour (approx 10%). Might it be superior overall to wheat flour? We shall find out in the next day or two.\n","date":"January 2, 2016 at 4:13 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/01/02/response-of-my-thermally-imprinted-models-of-the-man-on-the-turin-shroud-to-an-allegedly-crucial-test-with-ultraviolet-light/","cat":"turin_shroud","id":"comment-6636","author":"Colin Berry","site":"colinberry"}]
