[{"title":"Doh! I can think of only 19 reasons why the Shroud image was made by thermal imprinting (“scorching”) onto linen from a heated effigy","post":"So – on a different topic – what about that explosion at the fertilizer plant then? I’ve just this minute resurrected my sciencebuzz site to provide an hypothesis that folk won’t have read elsewhere.\nUpdate: 22 April: Here’s a summary of my ‘nitrous oxide’ hunch that I have submitted to New Scientist:\nLetter to New Scientist sent 21 April 2013-04-21\n“So what caused the devastation at the Texas fertilizer plant? Ignoring the initial reports that it was simple combustion of anhydrous ammonia (highly improbable except at elevated temperature or with oxygen enrichment) the later implication of large stocks of ammonium nitrate (said to be as great as 270 tonnes!) did not make a lot of sense either. That would surely have left a huge crater had even a fraction decomposed explosively and caused devastation on an even wider scale.\nThe key feature surely is the video footage that shows a sudden conflagration with flames soaring up hundreds of feet – a fireball in other words. That speaks of rapid combustion rather than a classical explosion resulting from detonation and instant decomposition. Is there a mechanism by which that could have occurred, involving ammonia and/or ammonium nitrate?\nI believe there is, based on the following equation:\n2NH3 + 3N2O -> 4N2 + 3H2O (+ heat and light energy)\nammonia gas + nitrous oxide – > nitrogen + steam\nThe ammonia gas was stored on site as the liquid under pressure. Any rupture of the tanks by fire would have produced an abundance of ammonia gas. The nitrous oxide, N2O, aka laughing gas?\nN2O, a powerful oxidant, roughly comparable to molecular oxygen (both relight a glowing splint) is formed when ammonium nitrate is decomposed by heat:\nNH4NO3(solid) -> N2O(gas) + 2H2O\nIn other words, both the ammonia AND the ammonium nitrate were involved. Ammonia was the fuel, and nitrous oxide was the prime oxidant.\nThe above mechanism might explain why the tragedy was not made worse by release of unburnt ammonia fumes, a deadly asphyxiating agent (paralyses respiratory muscles), given the reaction products are innocuous nitrogen and water vapour only.\nChemistry aside, whose bright idea was it to store tons of ammonium nitrate so close to human settlement? More to the point, why did the regulatory authorities allow it, or overlook it?”\n","date":"April 19, 2013 at 8:46 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/09/17/doh-i-can-think-of-only-19-reasons-why-the-shroud-image-was-made-by-thermal-imprinting-scorching-onto-linen-from-a-heated-effigy/","cat":"heated_effigy","id":"comment-2115","author":"colinsberry","site":"colinberry"},{"title":"Doh! I can think of only 19 reasons why the Shroud image was made by thermal imprinting (“scorching”) onto linen from a heated effigy","post":"No. Why should I do your homework? ImageJ is available to everyone, not just me. Produce your own scorch from a template, process it in ImageJ to get a reasonable facsimile of the original, then apply those same settings to the Shroud ‘as is’ sepia image. Do that, as i have done and reported, and you should find that the 3D enhancement is every bit  as good if not better than Jackson’s and others’ VP8 result.\nI repeat: the scientific way is to start with a known 3D object, and then go to 2D, then back to a 3D facsimile via optimized settings, then apply those same settings to the 2D Shroud image.\nTrying to do it the other way round, i.e. enhancing the Shroud image, from 2D to  semi-3D, and then claiming. as you have done, that the result is (aesthetically) more pleasing  than anything that can be achieved from digitally-processing a model scorch, is simply NOT scientific. I repeat: you do not know what the 3D image was like that produced the 2D Shroud image.  You are not even prepared to say how it was formed ( radiation? chemical imprinting?). You are simply twiddling knobs on your VP8 or ImageJ until you get a pleasing image of “Jesus”, and then declaring your settings to be the gold standard that everyone else must emulate. Call that science?\n","date":"April 18, 2013 at 5:46 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/09/17/doh-i-can-think-of-only-19-reasons-why-the-shroud-image-was-made-by-thermal-imprinting-scorching-onto-linen-from-a-heated-effigy/","cat":"heated_effigy","id":"comment-2109","author":"colinsberry","site":"colinberry"},{"title":"Doh! I can think of only 19 reasons why the Shroud image was made by thermal imprinting (“scorching”) onto linen from a heated effigy","post":"You wrote: “No. Why should I do your homework? ImageJ is available to everyone, not just me.”\nI have ImageJ but I am unable to find how to produce a relief.\nThank you for your help !!\n","date":"April 18, 2013 at 6:11 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/09/17/doh-i-can-think-of-only-19-reasons-why-the-shroud-image-was-made-by-thermal-imprinting-scorching-onto-linen-from-a-heated-effigy/","cat":"heated_effigy","id":"comment-2110","author":"Thibault HEIMBURGER","site":"colinberry"},{"title":"Doh! I can think of only 19 reasons why the Shroud image was made by thermal imprinting (“scorching”) onto linen from a heated effigy","post":"So why make out that VP8 is needed for “true” 3D, implying that ImageJ is irrelevant, and then say you need assistance with using ImageJ? Why knock something of which you have no experience?\nI would say that my 3D Shroud result with ImageJ to be every bit as good (indeed, probably better) than any published VP8 result. What’s more, I understand what ImageJ is doing – it is merely converting image density to height on a z axis, so it’s conceptually not difficult to see how a contact scorch from a 3D object can produce a credible 3D or semi-3D effect, and why the same settings work well on the Shroud image, even if the Shroud image had not been produced by scorching, but by some other mechanism capable of capturing 3D relief as image density.\nIf you are genuinely interested in using ImageJ, then you have only to say, and I will give a brief list of instructions. However, a word of advice. There is no “true” result if you do not know what your original 3D subject looked like… The best approach, scientifically speaking,  is to select a model (e.g. a contact scorch).  If the results do not appeal, then try a different model.  You may get to prefer some models over others. The worst one can do is  dispense with model-building, relying purely on aesthetics and preconceptions in a knob-twiddling exercise.\n","date":"April 18, 2013 at 7:27 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/09/17/doh-i-can-think-of-only-19-reasons-why-the-shroud-image-was-made-by-thermal-imprinting-scorching-onto-linen-from-a-heated-effigy/","cat":"heated_effigy","id":"comment-2111","author":"colinsberry","site":"colinberry"},{"title":"Doh! I can think of only 19 reasons why the Shroud image was made by thermal imprinting (“scorching”) onto linen from a heated effigy","post":"For example, your “x11-cropped-final-x2.png” image.\nHow is it that the blood stains do not show any kind of relief, contrary to the VP8 images ? \nYou wrote: “If you are genuinely interested in using ImageJ, then you have only to say, and I will give a brief list of instructions. ”\nYes, I am.\n","date":"April 18, 2013 at 7:50 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/09/17/doh-i-can-think-of-only-19-reasons-why-the-shroud-image-was-made-by-thermal-imprinting-scorching-onto-linen-from-a-heated-effigy/","cat":"heated_effigy","id":"comment-2112","author":"Thibault HEIMBURGER","site":"colinberry"},{"title":"Doh! I can think of only 19 reasons why the Shroud image was made by thermal imprinting (“scorching”) onto linen from a heated effigy","post":"Had I used the as-is sepia Shroud image, then the bloodstains would have shown a 3D effect. But I did not – I used the inverted images, in which bloodstains are white (zero image intensity).\n One can enter an image into Image J with File/Open, and then use Edit /Invert to reverse light and dark tones.\nAs regards the steps for 3D transformation, one could do a lot worse than use the ones described by Dan Porter on his site:\nhttp://shroudstory.com/2011/12/22/do-your-own-vp8-like-3d-images-of-the-shroud-of-turin/\n","date":"April 18, 2013 at 8:11 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/09/17/doh-i-can-think-of-only-19-reasons-why-the-shroud-image-was-made-by-thermal-imprinting-scorching-onto-linen-from-a-heated-effigy/","cat":"heated_effigy","id":"comment-2113","author":"colinsberry","site":"colinberry"},{"title":"Doh! I can think of only 19 reasons why the Shroud image was made by thermal imprinting (“scorching”) onto linen from a heated effigy","post":"Nitpicking ? Yes “le diable est dans les détails”. I forget your (usual) graceful comment.\nI could explain in detail what I mean by “true” 3D and why in my opinion there is something wrong in your digital processing. \nFirst, could your provide the links explaining in detail how ImageJ works to provide images in relief starting from a 2D picture ?\n","date":"April 18, 2013 at 5:19 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/09/17/doh-i-can-think-of-only-19-reasons-why-the-shroud-image-was-made-by-thermal-imprinting-scorching-onto-linen-from-a-heated-effigy/","cat":"heated_effigy","id":"comment-2108","author":"Thibault HEIMBURGER","site":"colinberry"},{"title":"Doh! I can think of only 19 reasons why the Shroud image was made by thermal imprinting (“scorching”) onto linen from a heated effigy","post":"It’s totally absurd to talk about “true” 3D characteristics.of the TS.  How can you say the characteristics of any TS re-processing are “true” when you have never laid eyes on the original subject that was imaged, and are not even prepared to say how the TS image itself was formed? (Reminder: this blogger says the evidence it was formed as a contact scorch is vastly greater  than the feeble mystique-preserving reasons advanced for saying it was not, and any 3D processing is purely arbitrary, settings being chosen to best show what one thinks the original subject MAY have looked like).\nThis is supposed to be model-building – not an aesthetics contest…\nRichard Dawkins and others are right to ignore Rolfe’s Enigma Challenge – they know they will/would encounter this kind of nitpicking objection – which I have to say is all we ever seem to get from you TH – nitpicking.\n* I shall add a link later to an earlier post in which I tried to make the settings in ImageJ for processing the TS image less arbitrary by normalising on scorch images first in a situation where it was possible to compare processed scorch image with the ORIGINAL 3D subject. I say that my digital processing is done SCIENTIFICALLY.\nHere’s the link – from over a year ago. Note the title (a reference to ‘normalisation’)\nhttp://strawshredder.wordpress.com/2012/03/18/there-is-something-rather-special-and-unusual-about-this-image-of-the-man-on-the-shroud/\n","date":"April 18, 2013 at 7:26 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/09/17/doh-i-can-think-of-only-19-reasons-why-the-shroud-image-was-made-by-thermal-imprinting-scorching-onto-linen-from-a-heated-effigy/","cat":"heated_effigy","id":"comment-2107","author":"colinsberry","site":"colinberry"},{"title":"Doh! I can think of only 19 reasons why the Shroud image was made by thermal imprinting (“scorching”) onto linen from a heated effigy","post":"” But if it’s 3D enhancement of a scorched-on image, you seek, I suggest you take a look at my banner, especially the image at the extreme right.”\nJust a short comment, Colin.\nYour so-called 3-D “image at the extreme right” is NOT a true 3-D image of the adjacent image (in the sense of the 3D “VP8” characteristics of theTS image) .\nYou own scorch experiment shows only obvious “artistic effects” that have nothing to do with the true 3D characteristics of the TS image.  The “nose” of your template is flat although it is one of the more bright part, the borders are artificially bent etc…\nThis has nothing to do with the 3D MAP (it is truly a map) of the TS image. (Just compare with the image at the extreme left of your banner);\nIn fact,  I have tried to find on your blog an image coming from your scorch experiments having the TRUE 3D characteristics of the TS. I found none, except the coins (i.e the smallest objects).\n","date":"April 17, 2013 at 10:24 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/09/17/doh-i-can-think-of-only-19-reasons-why-the-shroud-image-was-made-by-thermal-imprinting-scorching-onto-linen-from-a-heated-effigy/","cat":"heated_effigy","id":"comment-2106","author":"Thibault HEIMBURGER","site":"colinberry"},{"title":"Doh! I can think of only 19 reasons why the Shroud image was made by thermal imprinting (“scorching”) onto linen from a heated effigy","post":"What makes you think that a motley crew of self-selected and/or co-opted scientists – most of whom few had heard of in terms of prior research achievements – should have the last word on the Shroud?\nI shan’t try to respond to all your points – being somewhat tired of checklist Shroudology. But if it’s 3D enhancement of a scorched-on image, you seek, I suggest you take a look at my banner, especially the image at the extreme right.\n","date":"April 14, 2013 at 7:19 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/09/17/doh-i-can-think-of-only-19-reasons-why-the-shroud-image-was-made-by-thermal-imprinting-scorching-onto-linen-from-a-heated-effigy/","cat":"heated_effigy","id":"comment-2103","author":"colinsberry","site":"colinberry"},{"title":"Doh! I can think of only 19 reasons why the Shroud image was made by thermal imprinting (“scorching”) onto linen from a heated effigy","post":"With specialized photography that filtered for scorch, the real scorches from the 1532 fire show while the image disappears.  The scorch was ruled out by STURP in 1978.   A scorch would penetrate the cloth more than the few microns of the Shroud image.   A scorch could not touch selected fibers 1/500th of an inch while not touching adjacent fibers. Also, the scorch does not account for the many other properties…3Dimensionality, image not beneath blood,   But if it is a scorch, than just make one. Surely with 21st century technology we should have a shroud duplicate from medieval technology.\n","date":"April 14, 2013 at 6:55 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/09/17/doh-i-can-think-of-only-19-reasons-why-the-shroud-image-was-made-by-thermal-imprinting-scorching-onto-linen-from-a-heated-effigy/","cat":"heated_effigy","id":"comment-2102","author":"Rick","site":"colinberry"}]
