[{"title":"I certainly have real reservations about Petrus Soons’ 3D work. Any comments now?","post":"My children have 3D glasses and after borrowing the glasses from them I have had a look at the photo provided by Dan.\nI share the 5 difficulties by Dan but in my view, there is a very strong objection missing: what original image have they used?. Is it freely available for reproduction of results? Is its origin traceable?\nHowever, I have found a few curious things, although I don’t know to which extent are the product of image treatment or truly are present in the image and the autors have only made them more evident:\n1. Carlos Otal, in the past, has commented in this blog the point that the distance between the eyes is too small for a human being. Looking at the image, now this looks more evident and I am more inclined now to admitting the explanation given by him to this fact, e.g., that the image has a preferential vertical direction and is truly anisotropic.\n2. Having a look at each eye, the claim that coins are present cannot be held anymore\n3. The same with the flowers around the head.\n4. However, in the neck three hebrew letters seem to appear in white profile from left to right; lamed (or perhaps mem), ayin and a final tzade\n\n","date":"November 18, 2012 at 9:39 am","url":"https://shroudstory.com/2012/11/18/i-certainly-have-real-reservations-about-petrus-soons-3d-work-any-comments-now/","cat":"image_theory","id":"comment-19175","author":"Gabriel","site":"shroudstory"},{"title":"I certainly have real reservations about Petrus Soons’ 3D work. Any comments now?","post":"I mean from left to right in the image but from right to left as we see it.\n\n","date":"November 18, 2012 at 9:42 am","url":"https://shroudstory.com/2012/11/18/i-certainly-have-real-reservations-about-petrus-soons-3d-work-any-comments-now/","cat":"image_theory","id":"comment-19176","author":"Gabriel","site":"shroudstory"},{"title":"I certainly have real reservations about Petrus Soons’ 3D work. Any comments now?","post":"Dr. Soons took the 3D data from the Shroud image and created this 3D model, including a full sized hologram and a 24-layer lenticular which all show an amazing level of detail never before seen.  That said, your questions are good and ought to be put to Dr. Soons so he can explain precisely how it was made and what he did and did not do.  To this point unless proven otherwise, Dr. Soons’ work is not art, but represents the 3D data encoded on the Shroud so one can see it in vertical relief.\nI wish he would have used an image different from this image because Enrie used pushed contrast which actually changed the pixels so that he ended up changing the midrange pixels to either black or white.  While this enhances the image, using your logic, Dan, is this justified?  Why would Enrie need to create a pushed contrast image in the first place?  I think it’s obvious he wanted to get a better, clearer image.  In doing this, he actually distorted the image.  I would love for Dr. Soons to use a Schwortz image.\n\n","date":"November 18, 2012 at 11:48 am","url":"https://shroudstory.com/2012/11/18/i-certainly-have-real-reservations-about-petrus-soons-3d-work-any-comments-now/","cat":"image_theory","id":"comment-19178","author":"Andy Weiss","site":"shroudstory"},{"title":"I certainly have real reservations about Petrus Soons’ 3D work. Any comments now?","post":"I have contacted Dr. Soons to ask him to address your questions.\n\n","date":"November 18, 2012 at 11:58 am","url":"https://shroudstory.com/2012/11/18/i-certainly-have-real-reservations-about-petrus-soons-3d-work-any-comments-now/","cat":"image_theory","id":"comment-19179","author":"Andy Weiss","site":"shroudstory"},{"title":"I certainly have real reservations about Petrus Soons’ 3D work. Any comments now?","post":"It is easy to observe the full stereovision effect of the Shroud 3D video (with the two pictures side by side), by holding a piece of paper (A4 if you’re British) vertically against the divide between the two, and putting your face to the paper so that each eye can only see its own version. Allow your eyes to let the two images merge into one, and there you go. It’s a clever effect, and only slightly marred by being completely inhuman. The moustache seem to jut bizarrely forward, the eyes are too deeply sunk, and the neck appears to have been carved away to nothing. The whole of the right side (the image’s right, that is) of the face below the cheek bone seems hollow as the man turns his head to the left (his left), and the beard seems to be hanging in space in front of the rest of the face.\nFor this reason, surprisingly, I believe the ‘model’ upon which the familiar picture has been superimposed, has not been fiddled about with to make it more acceptable. However, I do understand that a ‘model’ has to be made. Simply taking the photo by itself results in all sorts of bizarre ridges and furrows created by the weave. These have to be smoothed out, to give a rather dull uniform grey computer ‘model’ (with extremely odd proportions) which can be artificially lit from various directions. The photo is then retrofitted back onto the model. That is why a relatively uniform surface , such as the cheeks, can be covered in such a wide range of greys, which if they really represent distance should cover it in pimples and pocks.\nThe good old VP8 image analyzer photo shows what happens if you take the image ‘as is.’\n(Incidentally, what happened to that machine? Was it ever used for anything else?). The analyzer used an absolute scale of brightness (as, perhaps, did Soons), which had the effect of envisioning the shroud as completely horizontal above the ‘body’ which created the image, whereas later versions have assumed that the shroud was draped. This means that the grey scale has to be ‘interpreted,’ as areas which could have different contours on the body would show up with the same brightness on the shroud, and vice versa. Most of the interpretations I have seen of this are highly subjective, and my own view is that the ‘horizontal’ interpretation produces better 3D results.\nPerhaps also surprisingly to anybody who hasn’t tried it, but this effect is not peculiar to the shroud, nor does it prove that the shroud is not a painting or drawing. (Other things may prove that, but the 3D effect does not.) You need a picture of a person with ‘face on’ lighting against a black background. Photoshop and similar programs have a ‘bas relief’ filter and an ’emboss’ filter, which emulate the VP8 in slightly different ways. With a little parameter adjustment it is possible to get images at least as accurate as the shroud, and sometimes a good deal more so.\n\n","date":"November 18, 2012 at 3:19 pm","url":"https://shroudstory.com/2012/11/18/i-certainly-have-real-reservations-about-petrus-soons-3d-work-any-comments-now/","cat":"image_theory","id":"comment-19181","author":"Hugh Farey","site":"shroudstory"},{"title":"I certainly have real reservations about Petrus Soons’ 3D work. Any comments now?","post":"Several decades ago I used overlapping stereo pairs from aerial photography to assist in planning a major railroad realignment which was to cross several gorges.  Viewing these stereos gave the effect of being suspended several hundred feet above the terrain, and could almost be vertigo inducing.  The effect works by parallax, photographs of the same terrain viewed from different positions along the flight path.  Each eye views a single photograph, and the brain does the rest giving a visual 3-D impression.  Binoculars create s similar effect on real 3D objects by a virtual stretching of the base-line between the eyes. \nThe 3D imaging of the VP-8 analyser seems to work in a different way.  There is only one original image, but as I understand it, the 3D is encoded by variations in brightness.  It would seem that the 3D holograms of the VP8 Shroud image have been somehow backwards coded to give the two stereoscopic pairs necessary to create the effect when the two related images are viewed.  One question might be how well the two stereoscopic pairs have been derived from the original hologram object.  This might account for some of the peculiarities reported in the comments.  \nI endeavoured to follow Hugh’s tip on using an A4 cardboard sheet, but did not succeed.  I guess my vision might not now be what it once was, with or without spectacles.  I’ll see if I can pick up some 3D glasses locally, and try it again.\n\n","date":"November 18, 2012 at 8:41 pm","url":"https://shroudstory.com/2012/11/18/i-certainly-have-real-reservations-about-petrus-soons-3d-work-any-comments-now/","cat":"image_theory","id":"comment-19182","author":"daveb of wellington nz","site":"shroudstory"},{"title":"I certainly have real reservations about Petrus Soons’ 3D work. Any comments now?","post":"Some years ago there was a craze for autostereograms which were pictures with hidden 3D information hidden in the pattern. Nothing at all like the shroud, but they did give us a lot of practice in focussing two separate images on top of each other. I use reading glasses, and find that for Soons’s images I need a distance from the screen of about 30cm, with the pictures about 6cm high, for my A4 paper thing to work. Any bigger and I can’t get them to merge, and any closer and they’re too blurred for my eyes, even with glasses!\nTo make his images, I imagine Soons could use something like the ‘trace contour’ function on Photoshop to make a ‘contour map’ of the shroud based entirely on differences in grey, and then using the contours make a virtual 3D image using 3D landscape modelling software. All the different 3D views could easily be derived from that.\n\n","date":"November 19, 2012 at 3:27 pm","url":"https://shroudstory.com/2012/11/18/i-certainly-have-real-reservations-about-petrus-soons-3d-work-any-comments-now/","cat":"image_theory","id":"comment-19211","author":"Hugh Farey","site":"shroudstory"},{"title":"I certainly have real reservations about Petrus Soons’ 3D work. Any comments now?","post":"Hugh ~ Pete Schumacher who open the Shroud Exhibit and Museum (SEAM) in Alamogordo, NM has some of the remaining working VP8s and he has done research work with Dr. Petrus Soons over the past couple years.  According to Dr. Soons and Pete, his 3D is not artwork, but a visual display of the brightness encoding on the Shroud similar to what the VP8 does.  This museum is one of the only places in the world where one can come in and interact with the VP8.  I am the webmaster for the SEAM online presence.\n\n","date":"November 19, 2012 at 9:19 am","url":"https://shroudstory.com/2012/11/18/i-certainly-have-real-reservations-about-petrus-soons-3d-work-any-comments-now/","cat":"image_theory","id":"comment-19198","author":"Andy Weiss","site":"shroudstory"},{"title":"I certainly have real reservations about Petrus Soons’ 3D work. Any comments now?","post":"” According to Dr. Soons and Pete, his 3D is not artwork, but a visual display of the brightness encoding on the Shroud similar to what the VP8 does.”\nI don’t think so. 3D on the shroud has no outline. VP8 data show a shape looking like a bas relief.\nYou can get something closer to a real human shape if you assume the shroud was wrapped around the corpse and take into account local cloth-corpse configuration, image formation mechanism, variegated pattern of the shroud itself, but you won’t get outlines.\n\n","date":"November 19, 2012 at 11:59 am","url":"https://shroudstory.com/2012/11/18/i-certainly-have-real-reservations-about-petrus-soons-3d-work-any-comments-now/","cat":"image_theory","id":"comment-19204","author":"anoxie","site":"shroudstory"},{"title":"I certainly have real reservations about Petrus Soons’ 3D work. Any comments now?","post":"The VP8 yields an image based on brightness encoding.  No matter what it looks like, the result is not art but a brightness map.  \nDr. Soons accounted for the cloth wrapping the victim on the Shroud so you end of up seeing the brightness data that is there in vertical relief, 3D just like the VP8.\n\n","date":"December 1, 2012 at 1:35 pm","url":"https://shroudstory.com/2012/11/18/i-certainly-have-real-reservations-about-petrus-soons-3d-work-any-comments-now/","cat":"image_theory","id":"comment-19716","author":"Andy Weiss","site":"shroudstory"},{"title":"I certainly have real reservations about Petrus Soons’ 3D work. Any comments now?","post":"It doesn’t look like the vp8.\nDr Soons’ 3D requires asumptions, extrapolations and even imagination (arms) to fill the gaps, create an outline, smooth the surface, create a volume and lay a flat greyscale skin on it.\nThere are so many arbitrary parameters that it is no longer science but artwork whereas VP8 is basic, direct but scientific.\nWhen Dr Jackson presented a more realistic 3D image, he described clearly his assumptions.\n\n","date":"December 2, 2012 at 5:01 am","url":"https://shroudstory.com/2012/11/18/i-certainly-have-real-reservations-about-petrus-soons-3d-work-any-comments-now/","cat":"image_theory","id":"comment-19730","author":"anoxie","site":"shroudstory"},{"title":"I certainly have real reservations about Petrus Soons’ 3D work. Any comments now?","post":"Hi Andy, you wrote:\n“Dr. Soons accounted for the cloth wrapping the victim on the Shroud so you end of up seeing the brightness data that is there in vertical relief, 3D just like the VP8.”\nCould you point out the document that states that fact, that is, “accounted for the cloth wrapping”? Thanks. I could not find a clear description of taking into account the cloth wrapping on his website.\nI made a 3D anaglyph at (can be seen at http://www.sindonology.org) not doing any transformation on the Enrie photograph (in particular no depth map was created by hand).  The result shows clear 3D property but not as much as the ones created by Petrus Soons. So he must have done many transformations to obtain his 3D anaglyph. But so far I could not find a clear description of what he did, in particular how he generated the depth map.\nBest,\nMario Latendresse\n\n","date":"December 1, 2012 at 7:11 pm","url":"https://shroudstory.com/2012/11/18/i-certainly-have-real-reservations-about-petrus-soons-3d-work-any-comments-now/","cat":"image_theory","id":"comment-19721","author":"Mario Latendresse","site":"shroudstory"},{"title":"I certainly have real reservations about Petrus Soons’ 3D work. Any comments now?","post":"Gabriel, basing your opinion on Petrus Soons’ 3D work, you wrote as if it were a fact:  “Having a look at each eye, the claim that coins are present cannot be held anymore”. \nNow such an opinion is totally inconsistent as: \n– you haven’t make it quite clear whether you hold Petrus’ holographic images to be art or scientific work…\n– Petrus himself thinks his holograms support the presence of two small coins placed over the eyes…\n\n","date":"November 19, 2012 at 3:50 pm","url":"https://shroudstory.com/2012/11/18/i-certainly-have-real-reservations-about-petrus-soons-3d-work-any-comments-now/","cat":"image_theory","id":"comment-19213","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"I certainly have real reservations about Petrus Soons’ 3D work. Any comments now?","post":"Petrus Soons wrote: “In the holograms we can clearly see the presence of TWO SMALL SOLD OBJECTS on top of the eyelids. There were however no more details visible on the surface.”\n\n","date":"November 19, 2012 at 6:00 pm","url":"https://shroudstory.com/2012/11/18/i-certainly-have-real-reservations-about-petrus-soons-3d-work-any-comments-now/","cat":"image_theory","id":"comment-19226","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"I certainly have real reservations about Petrus Soons’ 3D work. Any comments now?","post":"Typo: you haven’t made it quite clear\n\n","date":"November 19, 2012 at 3:52 pm","url":"https://shroudstory.com/2012/11/18/i-certainly-have-real-reservations-about-petrus-soons-3d-work-any-comments-now/","cat":"image_theory","id":"comment-19214","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"I certainly have real reservations about Petrus Soons’ 3D work. Any comments now?","post":"Max, I do not have any proof to say whether it is an artwork or a true reconstruction.  In the absence of any original picture available or a comprehensive description of the whole process, I was just playing the game “I think I see”.  I know he sees flowers and coins. I don’t. I know he sees hebrew letters in the neck. I see “other hebrew letters”. Perhaps, as my children say,  the 3d glasses I borrowed from them “are magic”:-)) and  in the absence of traceable and scientifically solid methods,  I also have the right to play the same game…..Humm.. At this point, I have started thinking that these glasses are really magic.\n\n","date":"November 19, 2012 at 6:00 pm","url":"https://shroudstory.com/2012/11/18/i-certainly-have-real-reservations-about-petrus-soons-3d-work-any-comments-now/","cat":"image_theory","id":"comment-19225","author":"Gabriel","site":"shroudstory"},{"title":"I certainly have real reservations about Petrus Soons’ 3D work. Any comments now?","post":"Playing the game of facts mistaken for fiction or fiction mistaken for facts?\n\n","date":"November 19, 2012 at 6:04 pm","url":"https://shroudstory.com/2012/11/18/i-certainly-have-real-reservations-about-petrus-soons-3d-work-any-comments-now/","cat":"image_theory","id":"comment-19227","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"I certainly have real reservations about Petrus Soons’ 3D work. Any comments now?","post":"The fact is you’re just playing the game ‘I don’t think I see”/”I think I don’t see” (not “I think I see”)\n\n","date":"November 19, 2012 at 6:20 pm","url":"https://shroudstory.com/2012/11/18/i-certainly-have-real-reservations-about-petrus-soons-3d-work-any-comments-now/","cat":"image_theory","id":"comment-19228","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"I certainly have real reservations about Petrus Soons’ 3D work. Any comments now?","post":"…when it comes to coins as solid objects.\n\n","date":"November 19, 2012 at 6:23 pm","url":"https://shroudstory.com/2012/11/18/i-certainly-have-real-reservations-about-petrus-soons-3d-work-any-comments-now/","cat":"image_theory","id":"comment-19230","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"I certainly have real reservations about Petrus Soons’ 3D work. Any comments now?","post":"…which means you may be either right or wrong or half right-half wrong…\nThe fact is by just “having a look at each eye” to infer “the claim that coins are present cannot be held anymore” is mere jumping to conclusion. All the more so when a physicist like Jackson and at least three outsanding medical forensics also detected somehow rounded solid objects placed over each eyelid.\n\n","date":"November 19, 2012 at 6:40 pm","url":"https://shroudstory.com/2012/11/18/i-certainly-have-real-reservations-about-petrus-soons-3d-work-any-comments-now/","cat":"image_theory","id":"comment-19231","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"I certainly have real reservations about Petrus Soons’ 3D work. Any comments now?","post":"…plus at least three image analysts….\n\n","date":"November 19, 2012 at 6:48 pm","url":"https://shroudstory.com/2012/11/18/i-certainly-have-real-reservations-about-petrus-soons-3d-work-any-comments-now/","cat":"image_theory","id":"comment-19232","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"I certainly have real reservations about Petrus Soons’ 3D work. Any comments now?","post":"…namely Mottern, Haralick and Tamburelli (plus myself)\n\n","date":"November 19, 2012 at 7:12 pm","url":"https://shroudstory.com/2012/11/18/i-certainly-have-real-reservations-about-petrus-soons-3d-work-any-comments-now/","cat":"image_theory","id":"comment-19233","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"I certainly have real reservations about Petrus Soons’ 3D work. Any comments now?","post":"Typo: at least three outstanding medical forensic specialists\n\n","date":"November 19, 2012 at 7:55 pm","url":"https://shroudstory.com/2012/11/18/i-certainly-have-real-reservations-about-petrus-soons-3d-work-any-comments-now/","cat":"image_theory","id":"comment-19236","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"I certainly have real reservations about Petrus Soons’ 3D work. Any comments now?","post":"The true fact is both negative and positive sight & brain misperceptions can be mistaken for magic…\n\n","date":"December 2, 2012 at 8:15 am","url":"https://shroudstory.com/2012/11/18/i-certainly-have-real-reservations-about-petrus-soons-3d-work-any-comments-now/","cat":"image_theory","id":"comment-19732","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"I certainly have real reservations about Petrus Soons’ 3D work. Any comments now?","post":"Reminder: Even if Petrus made the 3D photos from Enrie photograph of the face, still the fact remains that information was lost as he had to minimize to invisibility weave appearance in general. Since the weave pattern was thus made more than “very subtle”, it  might well have caused the already faint floral and coin patterns hardly standing out on the Shroud fabric to technically disappear from the hologram.\n\n","date":"November 19, 2012 at 5:15 pm","url":"https://shroudstory.com/2012/11/18/i-certainly-have-real-reservations-about-petrus-soons-3d-work-any-comments-now/","cat":"image_theory","id":"comment-19221","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"I certainly have real reservations about Petrus Soons’ 3D work. Any comments now?","post":"Typo: nearly standing out\n\n","date":"November 19, 2012 at 5:17 pm","url":"https://shroudstory.com/2012/11/18/i-certainly-have-real-reservations-about-petrus-soons-3d-work-any-comments-now/","cat":"image_theory","id":"comment-19223","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"I certainly have real reservations about Petrus Soons’ 3D work. Any comments now?","post":"I think the Shroud image is unique in terms of 3D data it encodes. You can certainly create a 3D anaglyph version of the black and white negative Shroud image (the Enrie version at least) in a way that is very easy (just two “composite” commands) and unique (no need to create a depth map by hand, only the Enrie negative photograph is used as input). The Shroud Scope has now a 3D anaglyph version of the Enrie (vertical) photograph (see http://www.sindonology.org/shroudScope/shroudScope.shtml?zl=7&image=7&lon=909&lat=3605) and the way it was created is described at  http://www.sindonology.org/shroudScope/shroudScopeHelp.shtml#3D.\n\n","date":"January 3, 2013 at 3:27 am","url":"https://shroudstory.com/2012/11/18/i-certainly-have-real-reservations-about-petrus-soons-3d-work-any-comments-now/","cat":"image_theory","id":"comment-21520","author":"latendre","site":"shroudstory"},{"title":"I certainly have real reservations about Petrus Soons’ 3D work. Any comments now?","post":"The Shroud is a code cunstruction set, nou doubt about it, and this photograph is a flat produced image by Bernardo Galmarini. Ray Downing is the only one who made it by numbers and is a expert.\n\n","date":"April 12, 2014 at 3:53 am","url":"https://shroudstory.com/2012/11/18/i-certainly-have-real-reservations-about-petrus-soons-3d-work-any-comments-now/","cat":"image_theory","id":"comment-98607","author":"Angel Wynton","site":"shroudstory"}]
