[{"title":"Is the non-fluorescent body image on the Shroud of Turin a valid indicator?","post":"Do you know what? Sometimes, just sometimes, Colin Berry talks sense.\nThen he comes up with some ridiculous theories and thoughts that destroy any credibility he might have claimed.\nHis latest nonsense concerns the 1516 Lire copy. He presents an argument along the following lines. The Lire copy shows minimal blood stains, only discrete ones on the palms of both hands and the side wound. He presents an argument that essentially the blood stains were added to the shroud over time, and the Lire copy showing discrete wounds consistent with the Bible was an early stage in the progressive re-interpretation of the shroud to incrementally show more blood wounds. He even throws up his bizarre Lirey Badge theory again, arguing because we can’t see blood wounds on what amounts to a tiny metal crafted badge that there was no blood on the shroud in the 1300s. This is nonsense, because the scale is too small to reasonably show bloods wound, although it does show the blood across the bottom of the back of Jesus, which Berry inventively (I’ll always give him points for creating novel theories, even if they are nonsense) calls a chain. \nMr Berry needs to get himself to a decent university library and educate himself in art history.\nThere are at least two examples of epitaphios from 1200, and the 1300s respectively, that show Jesus with body wide wounds and flagrum marks (I might add very consistent with the positioning of marks on the Shroud, one of these even shows a wound on the wrist on the top hand, and none on the other), being laid out on a herringbone weave shroud. These provide very compelling evidence that the Shroud was in existence AT LEAST as early as 1200 (personally I believe the shroud goes back to the time of Christ, but for now let’s just deal with the middle ages)    \nIn my opinion, an explanation for the differences in the Lirey copy from the shroud that is FAR more likely is that the Lirey copy’s differences are due to the artist wanting to show the hand wounds in accordance with conventional artistic depiction. Similarly representations of Jesus through the 1500s / 1600s  were typically non-gory, hence the very limited and discrete depictions of key (in the sense of the Gospel accounts) bloody wounds. As I have stated here before, there is a limited period in German art from about the late 1300s to the late 1400s that shows Christ’s body heavily wounded, and one or two other curious examples, such as the epitaphios I mention above. Otherwise minimal and discrete wounds are the norm\n\n","date":"July 29, 2012 at 4:55 am","url":"https://shroudstory.com/2012/07/28/is-the-non-fluorescent-body-image-on-the-shroud-of-turin-a-valid-indicator/","cat":"image_theory","id":"comment-14289","author":"Matt","site":"shroudstory"},{"title":"Is the non-fluorescent body image on the Shroud of Turin a valid indicator?","post":"Indeed other copies demonstrate “reinterpretation” of the shroud to suit their audience. For example, most copies show Jesus wearing a loin cloth, to protect His modesty. Obviously, His image on the shroud does not include a loin cloth\n\n","date":"July 29, 2012 at 5:19 am","url":"https://shroudstory.com/2012/07/28/is-the-non-fluorescent-body-image-on-the-shroud-of-turin-a-valid-indicator/","cat":"image_theory","id":"comment-14291","author":"Matt","site":"shroudstory"},{"title":"Is the non-fluorescent body image on the Shroud of Turin a valid indicator?","post":"Matt:\nA Colin Berry le sobra SAGACIDAD……pero le falta CONOCIMIENTO.\nEn 1534 el Papa Clemente VII ordenó al cardenal Luis de Gorrevod que verificara el estado de la Sábana Santa tras el incendio de 4-XII-1532.\nLa verificación se celebró el 15-IV-1534. Se abrió la caja-relicario que contenía la Sábana ( desde el incendio NO se había abierto al parecer por temor de que se hubiera destruído), se extendió sobre una mesa y 12 testigos que conocían bien la Sábana Santa, la habían tocado y mostrado al público antes del incendio, testificaron que era la misma Sábana que ellos conocían con anterioridad al incendio.\nY esa Sábana anterior al incendio de 1532 ( la copia de Lier es de 1516) ya MOSTRABA las manchas de sangre que nosotros conocemos.\nExiste un precioso documento escrito por la Abadesa del convento de las clarisas de Chambéry, Louise de Vargin en que se relatan los hechos de la reparación de la Sábana y su descripción e incluso la interpretación de lo observado. Las monjas clarisas estuvieron en contacto permanente con la Sábana durante 15 días, si bien sólo 4 monjas podían tocar y remendar la Sábana ( entre ellas Louise de Vargin).\nEste documento demuestra 2 cosas:\n1.- La enorme IMPORTANCIA que tenía la Sábana Santa como RELIQUIA para la Iglesia Católica.\n2.- La presencia de las MANCHAS de sangre en los sitios en que hoy las conocemos.\nEl precioso y extenso documento escrito por la  madre Abadesa Louise de Vargin :\nhttp://www.shroud.it/CLARISSE.PDF\nhttp://www.shroud.it/CLARES.PDF\nCarlos.\n\n","date":"July 29, 2012 at 10:05 pm","url":"https://shroudstory.com/2012/07/28/is-the-non-fluorescent-body-image-on-the-shroud-of-turin-a-valid-indicator/","cat":"image_theory","id":"comment-14315","author":"corneliotel","site":"shroudstory"}]
