[{"title":"Running out of options?","post":"yep I still say none of the above too…I think there is every possibility that we will never know, that the Shroud is a miraculous by product of the resurrection, inexplicable to the human mind…but it’s fun theorising!!!\n\n","date":"November 25, 2013 at 7:01 am","url":"https://shroudstory.com/2013/11/25/running-out-of-options/","cat":"image_theory","id":"comment-52746","author":"Matthias","site":"shroudstory"},{"title":"Running out of options?","post":"Why do you say ‘none of the above’ rather than ‘one of the above’ or ‘all of the above’? Because if you phrase the question thus: which of these formation theories can we completely rule out? Now the answer could be “none of the above”.\nI see know why Colin was pressing hard for new C14 tests. At least if we can get a definitive date on the linen – one way or the other – it might cut the possible theories in half.\n\n","date":"November 25, 2013 at 8:24 am","url":"https://shroudstory.com/2013/11/25/running-out-of-options/","cat":"image_theory","id":"comment-52753","author":"David Goulet","site":"shroudstory"},{"title":"Running out of options?","post":"Perhaps a combination of the above might also represent a reasonable option to include. Could a Maillard reaction be considered in the context of a heated/warmed statue, coated with (dipped in?) an amine-containing substance? One particular aspect of a thermo-statue approach that I do agree with is that it could provide a mechanism for the rounded appearance of the buttocks & calves. An alternative of this for some, might be an energetic event involving a body, in combination with the Maiilard.  Maybe the answer lies in a combination of certain of the options. \nIf a statue were used, is it reasonable to speculate that it might it still exist out there somewhere?  Or is it more likely that it was melted down soon after use to cover one’s tracks?\n\n","date":"November 25, 2013 at 4:47 pm","url":"https://shroudstory.com/2013/11/25/running-out-of-options/","cat":"image_theory","id":"comment-52768","author":"Kelly Kearse","site":"shroudstory"},{"title":"Running out of options?","post":"An alternative of this for some, might be an energetic event involving a body, in combination with the Maiilard.\nYes I also thought about that. I think it is the only way to explain some of the alleged holographic properties of the Shroud, with properties at thread and fiber levels. Diffusion of some agent, activated by a mild radiation:\nIf a statue were used, is it reasonable to speculate that it might it still exist out there somewhere? Or is it more likely that it was melted down soon after use to cover one’s tracks?\nKelly, can you read (with a help of Google Translator, of course) the ending of my article (just above and below the final image)?\nhttp://ok.apologetyka.info/racjonalista/jak-nie-zosta-zrobiony-caun-turynski,473.htm\nBecause there is an answer to your question ;-) If you cannot, I can translate it to you, because it’s really funny!\n\n","date":"November 25, 2013 at 4:54 pm","url":"https://shroudstory.com/2013/11/25/running-out-of-options/","cat":"image_theory","id":"comment-52769","author":"O.K.","site":"shroudstory"},{"title":"Running out of options?","post":"\nO.K. :\nAn alternative of this for some, might be an energetic event involving a body, in combination with the Maiilard.\nYes I also thought about that. I think it is the only way to explain some of the alleged holographic properties of the Shroud, with properties at thread and fiber levels. Diffusion of some agent, activated by a mild radiation:\nIf a statue were used, is it reasonable to speculate that it might it still exist out there somewhere? Or is it more likely that it was melted down soon after use to cover one’s tracks?\nKelly, can you read (with a help of Google Translator, of course) the ending of my article (just above and below the final image)?\nhttp://ok.apologetyka.info/racjonalista/jak-nie-zosta-zrobiony-caun-turynski,473.htm\nBecause there is an answer to your question ;-) If you cannot, I can translate it to you, because it’s really funny!\n\nO.K. got it! Thanks\n\n","date":"November 25, 2013 at 5:48 pm","url":"https://shroudstory.com/2013/11/25/running-out-of-options/","cat":"image_theory","id":"comment-52772","author":"Kelly Kearse","site":"shroudstory"},{"title":"Running out of options?","post":"Dan, I asked Kelly that question because of his expertise and it was really in connection with the Jospice Mattress, not the TS. My point of view clashed with the bilirubin proposed by Dr. Frederick Zugibe and this is clear in the very first paragraph of my article on the topic posted on the HSG website. Can bilirubin produce some sort of vapour that can penetrate a pillow and reach a mattress?!\nYou know something? Father Francis O’Leary had a sort of spiritual explanation, with which I could not agree. I respected what he thought but did not press the question. He was always looking for funds which were difficult to obtain, in fact he clashed with the Bishops Conference in England ( he was not a diocesan priest, but a Mill Hill Missionary) when he got some from people who were controversial. Most important, these funds were for the hospital he ran — to look after poor terminal patients in the Liverpool area who had no place to die.\n\n","date":"November 25, 2013 at 8:27 pm","url":"https://shroudstory.com/2013/11/25/running-out-of-options/","cat":"image_theory","id":"comment-52775","author":"Louis","site":"shroudstory"},{"title":"Running out of options?","post":"Notwithstanding any shortcomings or incompleteness in their various written reports, Max Frei’s Dead Sea halophyte and Anatolian pollens, together with Nitowski’s aragonite limestone dust in key locations (knee, nose, elbow(?) ) the blood-flows (arms at 65 deg to vert), the pathology forensics, and so on, all argue too strongly for me even to consider the possibility that the T.S. is anything else other than what it appears to be.  You can add to that the unevenness of the bleaching of the fibres, suggesting an ancient age for the cloth. \nThen the only question I think worth pursuing is “What is the process whereby the image was formed from a dead body?”, assuming that a naturalistic explanation is available. Dan commented on Maillard plus “something else” mentioning earthquakes. This I take it is a ref to Giovanna De Liso’s 12 years with seismic experiments in Piedmont. Seismic variations in the geo-magnetic and electric fields, the release of radioactive radon gas, and the presence of iron-bearing rocks all seemed to have had some bearing on the matter, whenever she succeeded in obtaining an image. I know of no other natural process that has come anywhere near obtaining the successful images that she achieved, minor as they may seem. The gospel accounts all refer to seismic activity at the time of the crucifixion, and prior to the resurrection. Whatever the evangelists made of the event, I don’t believe it was intended as a mere literary device. \nI think it unfortunate, that apart from De Liso’s work that there appears to have been very little follow-through on this aspect of the image-forming process, as it may well provide the key to the answer. It may not attract the attention of scientists in seismic quiescent zones, totally unfamiliar with earthquakes. However, within the “ring of fire” they are all too familiar to us as a common enough occurrence. It may be of interest that the release of radon gas in USA apartment buildings has been implicated as a significant non-tobacco cause of cancer, it is that common! However radon is a chemically inert and invisible gas, and so it is generally unnoticed.\n\n","date":"November 25, 2013 at 11:58 pm","url":"https://shroudstory.com/2013/11/25/running-out-of-options/","cat":"image_theory","id":"comment-52790","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Running out of options?","post":"\ndaveb of wellington nz :\nNotwithstanding any shortcomings or incompleteness in their various written reports, Max Frei’s Dead Sea halophyte and Anatolian pollens, together with Nitowski’s aragonite\nlimestone dust in key locations (knee, nose, elbow(?) ) the blood-flows (arms at 65 deg to vert), the pathology forensics, and so on, all argue too strongly for me even to consider the possibility that the T.S. is anything else other than what it appears to be.  You can add to that the unevenness of the bleaching of the fibres, suggesting an ancient age for the cloth.\nThen the only question I think worth pursuing is “What is the process whereby the image was formed from a dead body?”, assuming that a naturalistic explanation is available. Dan commented on Maillard plus “something else” mentioning earthquakes. This I take it is a ref to Giovanna De Liso’s 12 years with seismic experiments in Piedmont. Seismic variations in the geo-magnetic and electric fields, the release of radioactive radon gas, and the presence of iron-bearing rocks all seemed to have had some bearing on the matter, whenever she succeeded in obtaining an image. I know of no other natural process that has come anywhere near obtaining the successful images that she achieved, minor as they may seem. The gospel accounts all refer to seismic activity at the time of the crucifixion, and prior to the resurrection. Whatever the evangelists made of the event, I don’t believe it was intended as a mere literary device.\nI think it unfortunate, that apart from De Liso’s work that there appears to have been very little follow-through on this aspect of the image-forming process, as it may well provide the key to the answer. It may not attract the attention of scientists in seismic quiescent zones, totally unfamiliar with earthquakes. However, within the “ring of fire” they are all too familiar to us as a common enough occurrence. It may be of interest that the release of radon gas in USA apartment buildings has been implicated as a significant non-tobacco cause of cancer, it is that common! However radon is a chemically inert and invisible gas, and so it is generally unnoticed.\n\nIs it a possibility then, that similar images might have been formed on the burial cloths of others during this/different seismic events-undetected because no one ever went back & looked and/or the putrifaction process subsequently erased the evidence in time.  The gospels mention that other graves were opened and many saints arose, appearing to witnesses in the town-my impression is that these individuals had been dead for some time, although maybe not-perhaps some were recently deceased relatives or friends.  With this model, could there have been other burial cloths that were imprinted during history?  Two quick questions: do you know if their superficiality is similar to the Shroud image; also, are the images formed in that system sensitive to treatment with a reducing agent (diiamide)?\n\n","date":"November 26, 2013 at 5:12 am","url":"https://shroudstory.com/2013/11/25/running-out-of-options/","cat":"image_theory","id":"comment-52802","author":"Kelly Kearse","site":"shroudstory"},{"title":"Running out of options?","post":"re: hot statue – QUESTION\nSurely if a hot statue was used we would see image on the top of the head? Colin?\nI’m stuck on the idea of dematerialization of Christ’s body for now ,as the basis for image creation. And no I am not proposing radiation. I am theorising that the instant act of dematerialization created some biological process that created the image. I don’t know if we can ever create a model for that process, given (ordinarily) bodies do not instantly dematerialize.\n\n","date":"November 26, 2013 at 8:06 am","url":"https://shroudstory.com/2013/11/25/running-out-of-options/","cat":"image_theory","id":"comment-52806","author":"Matthias","site":"shroudstory"},{"title":"Running out of options?","post":"\nKelly Kearse :\n  With this model, could there have been other burial cloths that were imprinted during history?  Two quick questions: do you know if their superficiality is similar to the Shroud image; also, are the images formed in that system sensitive to treatment with a reducing agent (diiamide)?\n\nThere were some instances where body (or rather parts of the body) images were recorded on burial cloths. But the scarce descriptions indicate they are usually not Shroud-like, and rarely superficial, most likely Volckringer patterns. The best example is now-lost Antinoe image, the face image on the burial napkin which penetrated three or four layers of the cloth, as descriptions claim\n\n","date":"November 26, 2013 at 9:09 am","url":"https://shroudstory.com/2013/11/25/running-out-of-options/","cat":"image_theory","id":"comment-52810","author":"O.K.","site":"shroudstory"},{"title":"Running out of options?","post":"\nO.K. :\n\nKelly Kearse :\n  With this model, could there have been other burial cloths that were imprinted during history?  Two quick questions: do you know if their superficiality is similar to the Shroud image; also, are the images formed in that system sensitive to treatment with a reducing agent (diiamide)?\n\nThere were some instances where body (or rather parts of the body) images were recorded on burial cloths. But the scarce descriptions indicate they are usually not Shroud-like, and rarely superficial, most likely Volckringer patterns. The best example is now-lost Antinoe image, the face image on the burial napkin which penetrated three or four layers of the cloth, as descriptions claim\n\nO.K. Thanks, in these previous burial cloths, is it known if aloe & myrrh were included? \nWas specifically wondering on the two quick questions if the more recently developed images (snake, etc.) done in the above studies had been evaluated for superficiality & treatment with a reducing agent.  I believe aloe was included as a part of that system?\n\n","date":"November 26, 2013 at 9:30 am","url":"https://shroudstory.com/2013/11/25/running-out-of-options/","cat":"image_theory","id":"comment-52812","author":"Kelly Kearse","site":"shroudstory"},{"title":"Running out of options?","post":"\nKelly Kearse :\nO.K. Thanks, in these previous burial cloths, is it known if aloe & myrrh were included?\nWas specifically wondering on the two quick questions if the more recently developed images (snake, etc.) done in the above studies had been evaluated for superficiality & treatment with a reducing agent.  I believe aloe was included as a part of that system?\n\nVeil of Antinoe? I don’t know. It was a veil used used to bury a Christian in Egypt circa 500 AD. The only informations I have are second-hand, however an article by A-M. Dubarle was presented in Shroud Spectrum International #26 , March 1988, see http://www.shroud.com/spectrum.htm  Several other instances of images on the burial cloths are briefly presented in  André Marion &, Anne-Laure Courage Nouvelles decouvertes sur le Suaire de Turin – Editions Albin Michel, Paris 1997, based on earlier work of Arthur Loth from 1910: La photographie du Saint Suaire.\nAs to Jospice Mattress Imprint, the full photograph is presented here: http://holyshroudguild.org/uploads/2/7/1/7/2717873/can_the_jospice_mattress_imprint.mht_2.pdf Definetly different from the Shroud.\nAs to images ofsnakes etc. developed during earthquakes, see http://www.acheiropoietos.info/proceedings/DeLisoWeb.pdf\n\n","date":"November 26, 2013 at 11:05 am","url":"https://shroudstory.com/2013/11/25/running-out-of-options/","cat":"image_theory","id":"comment-52818","author":"O.K.","site":"shroudstory"},{"title":"Running out of options?","post":"O.K. Glad you agree with the article on the mattress.\nMessage for Dan:\nRemember the petition and fresh hands-on Shroud examination. It is indeed a secondary matter, as commented before. Christians are being directed to life among the primitive Christians. Relics? They will come later, when Pope Francis will have time. Russian President Vladimir Putin presented him with an important icon in the Russian Orthodox Church yesterday. After he saw it and turned away, Putin asked him if he liked it. When he got the Pope’s positive reply, Putin went to the icon he had brought and kissed it, only then was he followed by Francis. \nhttp://news.yahoo.com/pope-issues-mission-statement-papacy-110148215.html\n\n","date":"November 26, 2013 at 11:29 am","url":"https://shroudstory.com/2013/11/25/running-out-of-options/","cat":"image_theory","id":"comment-52820","author":"Louis","site":"shroudstory"},{"title":"Running out of options?","post":"Louis, thanks for the link.  Report on Pope Francis’ Mission Statement was a fascinating read, revolutionary, and seems certain to have some old school prelates quaking in their boots.  Unfortunately for some techy reason the Francis-Putin video is unavailable beyond a certain geographical reach, and apparently NZ is a country too far.\n\n","date":"November 26, 2013 at 4:04 pm","url":"https://shroudstory.com/2013/11/25/running-out-of-options/","cat":"image_theory","id":"comment-52842","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Running out of options?","post":"David, try this link, which has some nice photographs:\nhttp://news.yahoo.com/putin-meets-pope-berlusconi-italy-224951402.html\nSince he is a practicing Russian Orthodox Christian, Vladimir Putin wears a cross given to him by his mother, is close to the Church’s Moscow Patriarch and has been photographed kissing icons on several occasions.\nIt is a shame that Western European leaders are not worried about the Christians being butchered in Egypt, Pakistan, Iraq etc and about the plight of this ancient community in the Middle East, including Syria. The French president turned a deaf year to the Maronite cardinal-patriarch Al-Rahi of Beirut. Putin’s visit to Francis was therefore timely and meant to discuss these issues.\n\n","date":"November 26, 2013 at 4:37 pm","url":"https://shroudstory.com/2013/11/25/running-out-of-options/","cat":"image_theory","id":"comment-52845","author":"Louis","site":"shroudstory"},{"title":"Running out of options?","post":"Since he is a practicing Russian Orthodox Christian, Vladimir Putin wears a cross given to him by his mother\nReminder for Louis and others: he was once a communist and a KGB agent.\n\n","date":"November 26, 2013 at 4:40 pm","url":"https://shroudstory.com/2013/11/25/running-out-of-options/","cat":"image_theory","id":"comment-52846","author":"O.K.","site":"shroudstory"},{"title":"Running out of options?","post":"So what, O.K.? Even the previous patriarchs were accused of collaborating with the Communists and this was done to save as much of the Church as possible. You cannot separate Russian history from the Russian Orthodox Church. More examples? Gorbachev publicly declared that he had been baptised, Yeltsin defended the Church with all his might, whether he had downed vodka or not.\n\n","date":"November 26, 2013 at 4:56 pm","url":"https://shroudstory.com/2013/11/25/running-out-of-options/","cat":"image_theory","id":"comment-52847","author":"Louis","site":"shroudstory"},{"title":"Running out of options?","post":"Just reminder, that one shouldn’t be naive in case of the politicians. If it pays off to them, they can be militant atheists very active in communist organizations, if otherwise, they can publically bend on their knees in the churches and kiss icons and crucifixes.\nYou cannot separate Russian history from the Russian Orthodox Church.\nAbsolutely agree!\n\n","date":"November 26, 2013 at 5:05 pm","url":"https://shroudstory.com/2013/11/25/running-out-of-options/","cat":"image_theory","id":"comment-52848","author":"O.K.","site":"shroudstory"},{"title":"Running out of options?","post":"It is evident that Vladimir Putin went to see Pope Francis and talk to him about the plight of Christians in the Middle East, an issue other “Christians” like Obama, Kerry, Rajoy and so on are not worried about. Remember: You cannot separate Russian history from the Russian Orthodox Church and that helps the people there to combat the butchers from Chechenia, who were responsible for the Boston attack, and go hand in hand as mercenaries with the A/Q terrorists to massacre Christians in Syria.\nPope John Paul II made a mistake by looking at the world from a Polish-made lens, influenced by Cardinal Stefan Wyszynski during the Communist regime there. It took him some time to realise that extreme right-wing regimes could promote massacres too. What happened to Archbishop Romero?\nWell, forget politics and politicians for a while, the discussion is about relics,icons and what they can mean to important figures.\n\n","date":"November 26, 2013 at 5:26 pm","url":"https://shroudstory.com/2013/11/25/running-out-of-options/","cat":"image_theory","id":"comment-52851","author":"Louis","site":"shroudstory"},{"title":"Running out of options?","post":"A few comments about my POV:\nIt is evident that Vladimir Putin went to see Pope Francis and talk to him about the plight of Christians in the Middle East, an issue other “Christians” like Obama, Kerry, Rajoy and so on are not worried about. \nI have absolutely no trust in tsar Putin. In the rest of the gentlemen mentioned -as well!\nRemember: You cannot separate Russian history from the Russian Orthodox Church\nAbsolutely you cannot! The Byzantine links between Russian Empire and Russian Orthodox Church, the alliance between throne and altar, use of religion as an instrument of politics, were something absolutely unparalleled in the West. Russia is not the West, naive Westerners usually do not understand this country and its imperial ambitions. That’s one must remember, before talking about butchers from Chechenia and other issues. That’s also why I disagree with another statement:\nPope John Paul II made a mistake by looking at the world from a Polish-made lens, influenced by Cardinal Stefan Wyszynski during the Communist regime there. It took him some time to realise that extreme right-wing regimes could promote massacres too. What happened to Archbishop Romero? \nIt’s not so simple, and its not about the Polish-made lens. It is not that he supported, or even turned the blind eye to the right wing regimes, he opposed them as well as left-wing. As to Russia, he wanted reconciliation -but Russians didn’t want it. Remember -he was from Poland. And Russian/Soviet Empire always considered Poland to be subjugated within their sphere of influence.\nBut absolutely agree with this:\nWell, forget politics and politicians for a while, the discussion is about relics,icons and what they can mean to important figures.\n\n","date":"November 26, 2013 at 5:47 pm","url":"https://shroudstory.com/2013/11/25/running-out-of-options/","cat":"image_theory","id":"comment-52852","author":"O.K.","site":"shroudstory"},{"title":"Running out of options?","post":"David, did you see the link? It is about icons, not about politics.\n\n","date":"November 26, 2013 at 6:04 pm","url":"https://shroudstory.com/2013/11/25/running-out-of-options/","cat":"image_theory","id":"comment-52855","author":"Louis","site":"shroudstory"},{"title":"Running out of options?","post":"Louis, thank you yes. I have forwarded the URL links with comments to several acquaintances I think will also be interested.  As for politicians, they are the princes of this world.  It is over 40 years since I first saw the film Dr Zhivago, but one memorable line has always stayed with me. Revolutionary: “There is no longer a czar in Russia!” Peasant: “There will always be a czar in Russia!” \nThe most successful politicians always act from the utilitarian principle of self-interest, as applied to their perception of their mandate of franchise, modified only by the art of what they percieve to be posssible. If that involves kissing icons and crossing themselves, then that is what they will do.  The unsuccessful ones act from unenlightened self-interest, hence the Berlosconis, the fanatics and others of various kinds. \nBoth Australian and NZ politicians ignored the Indonesian suppressions in East Tinor and in Western Papua because they considered it politically expedient; this is merely another local expression of the same old, same old! China & Tibet! Syria, Palestine, it is never-ending!\n\n","date":"November 26, 2013 at 7:52 pm","url":"https://shroudstory.com/2013/11/25/running-out-of-options/","cat":"image_theory","id":"comment-52866","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Running out of options?","post":"Good work, David. These are very interesting comments. It is easy to agree with what you have said and I would add that truly religious politicians can do some good work. Dr. Zhivago is a wonderful film and from the memorable line we learn that the peasant, unlike the revolutionary, understood the Russian soul. Putin would be closer to the peasant.\n\n","date":"November 26, 2013 at 8:25 pm","url":"https://shroudstory.com/2013/11/25/running-out-of-options/","cat":"image_theory","id":"comment-52871","author":"Louis","site":"shroudstory"},{"title":"Running out of options?","post":"Kelly, you wrote : \n“The gospels mention that other graves were opened and many saints arose, appearing to witnesses in the town-my impression is that these individuals had been dead for some time, although maybe not-perhaps some were recently deceased relatives or friends.”\nMethinks this is just wishful thinking resulting from alleged “religious scholars”‘s brain washing ; “religious scholars” who are miles and lightyears away from Second Temple period Judean ethnic cultural milieu.\n\n","date":"November 26, 2013 at 7:13 pm","url":"https://shroudstory.com/2013/11/25/running-out-of-options/","cat":"image_theory","id":"comment-52861","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Running out of options?","post":"In defence of practicing Orthodox Christian Vladimir Putin’s visit to Pope Francis to discuss Syria:\nhttp://news.yahoo.com/rights-watchdog-syrian-women-exploited-lebanon-165557436.html\n\n","date":"November 27, 2013 at 1:28 pm","url":"https://shroudstory.com/2013/11/25/running-out-of-options/","cat":"image_theory","id":"comment-52955","author":"Louis","site":"shroudstory"}]
