[{"title":"Schwortz: It is Worth Reviewing David Ford’s Noteworthy Blood or Paint Paper","post":"Thanks Barrie, the paper certainly puts the final nail in the coffin for McCrone’s dishonesty.\n\n","date":"May 13, 2014 at 5:13 am","url":"https://shroudstory.com/2014/05/13/schwortz-it-is-worth-reviewing-david-fords-noteworthy-blood-or-paint-paper/","cat":"image_theory","id":"comment-118457","author":"Annette Cloutier","site":"shroudstory"},{"title":"Schwortz: It is Worth Reviewing David Ford’s Noteworthy Blood or Paint Paper","post":"Meticulously written paper. Nice work addressing all angles of paint and (could be applied for) scorch theories.\n\n","date":"May 13, 2014 at 8:08 am","url":"https://shroudstory.com/2014/05/13/schwortz-it-is-worth-reviewing-david-fords-noteworthy-blood-or-paint-paper/","cat":"image_theory","id":"comment-118524","author":"jenx","site":"shroudstory"},{"title":"Schwortz: It is Worth Reviewing David Ford’s Noteworthy Blood or Paint Paper","post":"David Ford is not a blood specialist, neither am I. I put  all the Heller and Adler papers I could find to an Emeritus Professor of Physiology at London University and he found nothing to convince him there was human blood on the Shroud, so at least the issue is contested. The ‘wrong’ colour of the blood remains a major issue against its authenticity.\nIronically we are discussing testings made in 1978 while  science has moved on so fast that the issue of painting and blood could pobably be sorted either way in a few minutes nowadays. I am not sure of the wisdom of going over these old papers when they represent  the findings of hopelessly out- dated research methods. We wouldn’t do it in any other scientific context.\nIncidentally I am writing this about two hundred yards from the now vanished palace of the Byzantine emperors in/Constantinople where some contributors to this site believe that the Shroud  might once have been stored. I have just taken a tour around the surviving mosaics from the palace.\n\n","date":"May 13, 2014 at 10:04 am","url":"https://shroudstory.com/2014/05/13/schwortz-it-is-worth-reviewing-david-fords-noteworthy-blood-or-paint-paper/","cat":"image_theory","id":"comment-118574","author":"Charles Freeman","site":"shroudstory"},{"title":"Schwortz: It is Worth Reviewing David Ford’s Noteworthy Blood or Paint Paper","post":"Can anything scientifically positive come from London lab analysis?\n\n","date":"May 13, 2014 at 5:26 pm","url":"https://shroudstory.com/2014/05/13/schwortz-it-is-worth-reviewing-david-fords-noteworthy-blood-or-paint-paper/","cat":"image_theory","id":"comment-118772","author":"Annette Cloutier","site":"shroudstory"},{"title":"Schwortz: It is Worth Reviewing David Ford’s Noteworthy Blood or Paint Paper","post":"http://www.shroud.com/pdfs/thibault%20final%2001.pdf\n\n","date":"May 13, 2014 at 3:52 pm","url":"https://shroudstory.com/2014/05/13/schwortz-it-is-worth-reviewing-david-fords-noteworthy-blood-or-paint-paper/","cat":"image_theory","id":"comment-118733","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Schwortz: It is Worth Reviewing David Ford’s Noteworthy Blood or Paint Paper","post":"Thanks for reminding me Thibault! That is very helpful.\n\n","date":"May 13, 2014 at 6:36 pm","url":"https://shroudstory.com/2014/05/13/schwortz-it-is-worth-reviewing-david-fords-noteworthy-blood-or-paint-paper/","cat":"image_theory","id":"comment-118803","author":"Barrie Schwortz","site":"shroudstory"},{"title":"Schwortz: It is Worth Reviewing David Ford’s Noteworthy Blood or Paint Paper","post":"I’m sure there are still blood samples from the Shroud floating around out there. Couldn’t someone use a newer method of testing to determine whether the blood is real or pigment? Wasn’t there a scientist in the nineties(Dr. Tryon, I think) who determined that the blood on the Shroud was real and from a human male?\n\n","date":"May 13, 2014 at 6:04 pm","url":"https://shroudstory.com/2014/05/13/schwortz-it-is-worth-reviewing-david-fords-noteworthy-blood-or-paint-paper/","cat":"image_theory","id":"comment-118793","author":"Chesterbelloc","site":"shroudstory"},{"title":"Schwortz: It is Worth Reviewing David Ford’s Noteworthy Blood or Paint Paper","post":"Al Adler was in possession of all of Rogers’ blood tape samples when he died. Sadly, the Adler family packed up all his Shroud materials, including Rogers’ samples, and sent them back to Turin after Al’s death. Rogers wrote five letters to the Archbishop of Turin requesting their return but never received even one reply. In the end, Rogers considered those samples lost. So I am not so certain there are any credible Shroud blood samples  actually “floating around out there.”  Perhaps this issue is still open in the minds of some researchers, but the evidence shows McCrone was wrong. Remember, he never even saw the Shroud and based his conclusions solely on his visual examination of the tape samples. Watch for my article titled, “Answering a Skeptic” in our next website update in early June which deals with this in more detail.\n\n","date":"May 13, 2014 at 6:31 pm","url":"https://shroudstory.com/2014/05/13/schwortz-it-is-worth-reviewing-david-fords-noteworthy-blood-or-paint-paper/","cat":"image_theory","id":"comment-118802","author":"Barrie Schwortz","site":"shroudstory"},{"title":"Schwortz: It is Worth Reviewing David Ford’s Noteworthy Blood or Paint Paper","post":"I’m looking forward to your article. Thanks, Barrie!\n\n","date":"May 13, 2014 at 9:19 pm","url":"https://shroudstory.com/2014/05/13/schwortz-it-is-worth-reviewing-david-fords-noteworthy-blood-or-paint-paper/","cat":"image_theory","id":"comment-118875","author":"Chesterbelloc","site":"shroudstory"},{"title":"Schwortz: It is Worth Reviewing David Ford’s Noteworthy Blood or Paint Paper","post":"“Ironically we are discussing testings made in 1978 while science has moved on so fast that the issue of painting and blood could pobably be sorted either way in a few minutes nowadays. I am not sure of the wisdom of going over these old papers when they represent the findings of hopelessly out- dated research methods. We wouldn’t do it in any other scientific context.”\nExactly which research methods are hopelessly out-dated?  What are these new tests? These type of statements make great sound bytes, but how about a few specifics?  \nPresumptive tests for blood still involve detection of hemoglobin, Fe-bound heme.  Advances have been made to increase sensitivity, but the molecular basis for this type of test is the same. Extending from presumptive tests, non-heme constituents (serum proteins) are evaluated,  typically albumin & immunoglobulin. These latter two tests are used to help determine what species the blood may be from.  ABO typing may also be performed, using either immunological methods or DNA analysis.  \nAntibodies are now available in the form of being impregnated on cards, making on-site determinations quicker, as opposed to being added to slides back in the lab, but the molecular principles are still the same.  Some investigators still utilize older methods-it’s not as though such techniques have been ruled invalid.  Heating up tea on a fire, on a stove, in a microwave, from a basic standpoint, really that different?\n“I’m sure there are still blood samples from the Shroud floating around out there. Couldn’t someone use a newer method of testing to determine whether the blood is real or pigment? Wasn’t there a scientist in the nineties(Dr. Tryon, I think) who determined that the blood on the Shroud was real and from a human male?”\nIt cannot be concluded from these studies that the blood is real and from a human male-there is nothing in the results that is blood-specific.  All three genes (betaglobin, X, Y) are found in non-blood cells as well.  These results only show that human DNA is present, could just as easily be explained by contamination (touch DNA)\n\n","date":"May 13, 2014 at 6:56 pm","url":"https://shroudstory.com/2014/05/13/schwortz-it-is-worth-reviewing-david-fords-noteworthy-blood-or-paint-paper/","cat":"image_theory","id":"comment-118813","author":"Kelly Kearse","site":"shroudstory"},{"title":"Schwortz: It is Worth Reviewing David Ford’s Noteworthy Blood or Paint Paper","post":"The problem is not Walter McCrone, with his controversial Vinland Map dating and no one would doubt that Dr. Alan Adler was a very serious scientist. It is possible that Turin ignored Ray Rogers’ pleas because he was on one occasion not very polite when addressing Msgr. Giuseppe Ghiberti.\nWhatever, that leaves shroudies in a fix also because the DNA studies are useless due to contamination. Only another hands-on examination can solve the problem, but that is a dream.\n\n","date":"May 13, 2014 at 9:35 pm","url":"https://shroudstory.com/2014/05/13/schwortz-it-is-worth-reviewing-david-fords-noteworthy-blood-or-paint-paper/","cat":"image_theory","id":"comment-118879","author":"Louis","site":"shroudstory"},{"title":"Schwortz: It is Worth Reviewing David Ford’s Noteworthy Blood or Paint Paper","post":"Perhaps that Emeritus Professor of Physiology at London University did not pay much attention to what he read or has an anti authenticity Shroud agenda like the person who cited his conclusion.\nAny medical doctor after reading that paper or more recents like the ones of Dr. Thibault Heimburger ( with direct link in his previous May 13 comment) or Dr. Kelly Kearse ( on Immunological studies, and some wonderful comments he did on this blog), could draw no other conclusion than red stains being human blood.\nExcellent papers worthreading even by non Shroud enthusiasts I renew my appraisal to their authors.                                    \n                                                                                   regards\n                                                                   Antero de Frias Moreira\n                                                        (Centro Português de Sindonologia)\n\n","date":"May 14, 2014 at 10:01 am","url":"https://shroudstory.com/2014/05/13/schwortz-it-is-worth-reviewing-david-fords-noteworthy-blood-or-paint-paper/","cat":"image_theory","id":"comment-119218","author":"Antero de Frias Moreira","site":"shroudstory"}]
