[{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"For some reason, my system does not like the clickable article as presented in the beginning of the article.  It tells me to reset some of my settings and retry it. ?? I won’t do that.\n\n","date":"September 16, 2015 at 5:06 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210510","author":"ekmcmahon","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"I had to download and save/print as a pdf.\n\n","date":"September 16, 2015 at 6:30 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210514","author":"Russ Breault","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"Paolo and his ENEA chums must be pretty bereft of ideas re the TS if they have to look to a 17th century “precious” copy for inspiration. That would not have been necessary if they had realized that for all their esoteric ultraviolet laser pulse technology, a faint brown coloration implies CHEMISTRY, more specifically PHOTOCHEMISTRY, not physics, and then proceeded to recruit the appropriate specialists (photochemists, botanists and microscopists familiar with the ultrastructure of plant fibres, flax bast fibres especially).\nThe initial claim for ultra-superficiality (“200nm”) simply because the coloration was uv-induced was a total nonsense, as anyone who knows the first thing about suntans would have told them (melanocytes and their melanin respond to uv light despite having a proteinaceous keratin layer of at least 0.05mm on top – that’s 50 micrometres, or 50,000 nanometres – 250 times their “200nm” PCW thickness. Even if the uv had acted in the most superficial 200nm layer, a free-radical mechanism that is common in photochemistry could have resulted in propagation and chemical knock-on effects at a much greater depth.\nI am continuing to gather evidence for what I call the liquid capillary model for the TS image, and shall be posting some photomicrograph ‘movies’ to YouTube in the next week or so. In passing, they will allow me to show what happens when I make minor adjustments when  needed to the focus control in my microscope, and thus put paid to Paolo’s insulting suggestion that this retired science bod (14 years his senior), does not know how to focus a microscope. Repeat: mine is basic – with scarcely any depth of field.\nYou do not impress me Paolo Di Lazzaro with your ‘theo-physics’ , with your all-too-obvious blind spots for photochemistry and botany. You need to get away from laser beam pin-pointing, and seek  the bigger picture. You could try identifying the uv-sensitive chromophore for starters – and NO, it’s unlikely to be cellulose. Why do you persist in viewing linen fibres as if they were 100% cellulose? Why the blindspot for more reactive hemicelluloses and pectin, to say nothing of uv-absorbing lignins? As I say, you need a chemist on the team.\n\n","date":"September 16, 2015 at 9:06 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210521","author":"Colin Berry","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"This is intriguing on so many levels. We have a second Shroud – a copy – which we cannot discern the image formation mechanism. We do know some minor parts of it are painted.\nIf we discover the image mechanism on the copy, could it be the same mechanism for the original? Could this then suggest that the ‘original’ is itself a copy and that the original was lost at some point? If a man-made mechanism was designed in the 1600’s then it most certainly could have been designed in the 1400’s. \nIf I was a non-authentist I’d be most excited by the Shroud of Arquata.\nThere’s also the possibility that once the mechanism is discerned for the copy, that we then can cross-examine with the TS. If we are able to rule out that it is the same mechanism, this may strengthen the case for authenticity.\nIf I was an authentist I’d be most excited by the Shroud of Arquata.\n\n","date":"September 16, 2015 at 9:07 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210522","author":"David Goulet","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"Good points, DavidG. But you’re wasting your time where this death-to-fresh-thinking quagmire of a site is concerned. This blogger attempted to flag up the likely significance of the  Arquata back in January (“the TS was never regarded as a painting, but a sweat/blood imprint, real or more probably simulated”).One was hoping for a response, that could then have gone to consider possible new insights as to how the TS image or its look-alike copy was formed – whether 0, 13 or 16 centuries post the biblical era.\nhttps://shroudstory.com/2015/01/24/new-paper-on-the-shroud-of-arquata/\nResult: the usual sullen, stony silence. Off-message you see. \nThe blogosphere DESPERATELY needs a truly open- minded, non-agenda-driven TS site – and this one (sadly) ain’t it…\n\n","date":"September 16, 2015 at 9:49 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210526","author":"Colin Berry","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"It took less time than I imagined to show how a liquid (in this instance modelled with blue ink)  is able to quickly penetrate and migrate along the internal cores of linen fibres, and then  to upload the short video clip (approx 1min.15 secs) to YouTube. \nMaybe this embed code works. Maybe not.\n\nIf  not, I’ll give a link to my sciencebuzz site where the clip has been successfully installed.\nThe ink is merely a preliminary model for oil or maybe coloured decomposition products that exude from a flour/oil imprint from a human subject into the underlying weave of  linen, when lightly roasted in a hot (presumed medieval) oven.\n\n","date":"September 16, 2015 at 11:22 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210527","author":"Colin Berry","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"Oops. Appearances can be deceptive. Have just had to append this correction to the YouTube clip:\nThe initial title was “Dynamic penetration of ink into core of linen fibres etc etc”. That was based on the thread-like advance of the ink that one sees in the video clip AND the appearance of dark cut-ends to the individual fibres. But a follow-up experiment shows that initial interpretation to have been over-hasty and almost certainly in error. Why? Because it was not possible to see dye-advance when the thread was unspun to create a larger spacing between fibres. In other words, the capillary action is due to the narrow channels existing between the 5-7 sided polyhedral fibres, not to the channel(s) within the core of the fibres. Oh well, we live and we learn…","date":"September 17, 2015 at 4:19 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210575","author":"Colin Berry","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"Some individual fibres in the spaces between the threads also seem to become coloured though. Capillary action along the fibres?\n\n","date":"September 17, 2015 at 5:51 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210578","author":"Hugh Farey","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"Absolutely, Hugh, but due more to surface adsorption and migration maybe than capillarity? Having said that, I’m now working with single fibres, dipping one end in ink, and looking for coloration – anywhere. So far – nothing, but these are early days, and working at top magniifcation it is easy to miss things – or see things that aren’t there.\nWhile there’s no evidence as yet for an aqueous solution being able easily to penetrate the cores of the fibres, that still leaves open the possibility of oil or other apolar substances being able to get in, maybe via that lignified S1 layer reported by Day et al. That will be rather more tricky to test, especially if the oil etc needs to be hot.\n\n","date":"September 17, 2015 at 6:30 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210580","author":"Colin Berry","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"Colin,\nTry also to see what exactly happens using a natural linen (like the famous material by Kate Edgerton) and a “dewaxed linen” (…do you know “flax wax”?)…\nWhen are clean and dewaxed, flax fibres look lustrous and adsorb more liquids.\nDetails:\n>… The natural waxes were removed from some of\nthe raw fibers by extraction with alcohol and ether for 24 hours each.\n>These fibers are termed “dewaxed fibers.” …\nSource: an old paper (by Charles W. Hock),\npublished in:\n“Part of Journal of Research of the lXational Bureau of Standards”,\nVolume 29, July 1942\nLink:\nhttp://nvlpubs.nist.gov/nistpubs/jres/29/jresv29n1p41_A1b.pdf.\nBut, please,… don’t boil “the dewaxed material”\nwith “five percent sodium hydroxide until the fibers were practically free of intercellular sub-\nstance, and of much of the primary wall…” !!!\n-*-*-*-*-\nSo…\nIn other words, I am curious to observe\nthe true effects obtained from different levels of “dewaxing”…\n\n","date":"September 18, 2015 at 9:42 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210646","author":"piero","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"Forgive me if I don’t get overly concerned about wax coatings, piero.  My modern linen samples have threads that act like blotting paper towards water, and, surprisingly, oil as well, whether wax-coated or not (medievals would not have cared either way) but the individual fibres, while quickly adsorbing ink to become coloured on their surface, do not take up water or oil into their central cores, so there’s still some model development to be done.\nMy preoccupation at present is the claim, nay ‘received wisdom’, that the image layer on the TS is (a) a highly superficial layer on fibres and (b) approx 200nm thick.  The first seems based on little more than anecdotal evidence, much of it straining credulity, especially when based on viewing an assortment of ‘mechanically damaged’ fibres under the microscope.  The second seems to be complete fiction.\nAs far as one can tell there has been no systematic study to establish the location of image or coloration in either the TS or (laser-generated) model systems respectively, and certainly no data that would justify the bandying around of that 200nm figure either as if hard fact.\nSo much of ‘received wisdom’ in sindonology is complete bunkum.\n\n","date":"September 18, 2015 at 12:18 pm","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210653","author":"Colin Berry","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"We should know what were the intentions of the person who produced the Shroud of Arquata. He seemed to have believed that the Turin Shroud was artistically produced.\n\n","date":"September 17, 2015 at 9:45 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210585","author":"Louis","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"Have now got my eye in, so to speak, on single fibres Hugh. One has to focus ‘out’ (marginally increasing the distance between objective lens and specimen) to see the blue colour most easily, making it blurred. But with that proviso, a 4cm fibre became coloured blue along its entire length within minutes when one end was dipped in ink.There seemed to be little if any internal coloration. It would explain the celebrated ‘coolness” of linen clothes if they first wick away skin moisture and then offer a large surface area for it to evaporate.\nThe next experiment will be to heat a small drop of oil on a ceramic hob and repeat the end-dip experiment with a single fibre. Will the hot oil penetrate the core of the fibre? Would that penetration, if it happens, be visible under the microscope? We shall see,\n\n","date":"September 17, 2015 at 1:29 pm","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210592","author":"Colin Berry","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"What about the depth of the image on the Arquata shroud?\n\n","date":"September 17, 2015 at 1:49 pm","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210593","author":"Louis","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"What we seem to learn from the Arquata shroud is that the image is extremely faint, and that is because the artist certainly was trying to copy the Turin Shroud’s faint image back in the seventeenth century. Which goes to say that the relic preserved in Turin is not really a painting that was originally painted in vivid colours that gradually disappeared.\nA direct examination of the Turin Shroud fibres demonstrated that the image resides only on the crowns, it is said to occupy about 1% of each fibre. Those interested should read the response to question 6:\nhttps://www.academia.edu/11355553/Dr._Paolo_Di_Lazzaro_explains_his_research_on_image_formation_on_the_Shroud_of_Turin\n\n","date":"September 18, 2015 at 5:16 pm","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210667","author":"Louis","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"If you use Beldon Scott’s fine study of the display of the Shroud and supplement it with the many images in the catalogue of the exhibition of Shroud images of the Savoys in Turin 1998, there is no doubt that throughout the seventeenth century the images on the Shroud could be seen at a distance.\nPainted linens did not just fade.There was a layer of gesso on the surface of the linen and the paint was applied on top of this in the hope that the pigments would remain precise and not dissolve into the cloth. What tended to happen was the the painted surface disintegrated and fragmented with continual folding and refolding. Beldon Scott quotes a 1580 letter from Carlo Borromeo’s architect  (Borromeo was pushing for a chapel for the Shroud) that expressed concern that the Shroud should be ‘preserved and displayed without the danger  (sic) of folding and unfolding it.’ With lots of new work on painted linens coming out, we now have examples where microscopic analysis shows that the cracks in the paint were often painted over.\n  The discoloration of the present images may be the result of centuries of contact between the painted surface and the linen as buffered through the gesso.This is perhaps why the discoloration does not penetrate below the outside surface of the linen as there is no way that it could in these circumstances. It may also explain the fuzziness at the edges of the images ( such that one cannot even give a precise measurement of the height of the man on the Shroud). This is no more than a hypothesis that needs checking out with a more sophisticated technical examination of the Shroud with modern scanning equipment. Unlikely to happen so it remains no more than a hypothesis.\nThe alternative will be to exploit resent research on  painted linens whose images have deteriorated to see whether  comparisons can be made  with the Shroud images. I leave that to the conservationists but it means getting them interested in the study of the Shroud. At present I am getting sympathetic ‘Yes, this possible’ s but no one prepared to take it on!\n\n","date":"September 19, 2015 at 5:33 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210692","author":"Charles Freeman","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"There’s a certain historian on this site with a tendency to what might be termed  ‘de-selection bias’ (a novel and myopic variant on selection bias, like his quoting Bishop Henri de Poitiers of Troyes, immediately following the first mid-14th century Lirey exhibition of the “Shroud” as having said “painted” when in fact he said “cunningly painted”). \nHe puts one in mind of a child in a war zone, straying into unfamiliar territory, where he comes upon a shiny object sticking out the soil.\n “Oh look, a tiny pineapple, cast in metal. But what’s the ring-pull for, one wonders?”.\nNext instalment eagerly awaited with interest….\n\n","date":"September 19, 2015 at 9:37 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210705","author":"Colin Berry","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"I think we will have to wait till the paper is ready at the end of the year. Meanwhile there is something to ponder about:\nhttp://shroud.wikispaces.com/facts4\nIt is correct to say that more sophisticated technical examination of the Shroud is unlikely to happen, and even more so now with “Shroudie” presence at the Hampshire event, which was not necessary at all.\n\n","date":"September 19, 2015 at 8:30 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210701","author":"Louis","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"So the go- ahead for any new scientific examination of the Shroud ( which needs to go beyond  test results of 35 years ago that have never been replicated) depends on who did or did not attend a conference in Hampshire!\nWhat a crazy way of deciding scientific objectives!\nSo long as Colin sticks with flour, I doubt whether he will blow himself up.\nI prefer to stay with visual evidence that I can at least discuss with art historians and textile conservationists. I am increasingly convinced that comparative examples is the way forward. We must create a new narrative for Shroud research somehow!\n\n","date":"September 19, 2015 at 10:28 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210711","author":"Charles Freeman","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"Here is a comment I placed on a site called “Philosopy Forums” a few hours ago.\nhttp://forums.philosophyforums.com/threads/the-shroud-of-turin-is-it-just-all-in-our-minds-73055.html#lastpost\n It explains the rationale for imprinting with flour, as a proxy for sweat, as per the Francis de Sales interpretation of the Shroud body image, 1614.\nThere is a simple reason why there is no unanimous consensus on the so-called Shroud, despite (or because of) the radiocarbon dating. That’s because modern science has been supplied with no clues as to how the ‘relic’ was produced (materials, source of energy etc). Inconvenient though that is, it’s hardly surprising, is it, since the entire point of forging the ‘genuine’ articlewould have been to make it seem a one-off. so one cannot even have pilot R/D versions lying around, or the merest whisper as to how the result was achieved?\nThe starting point for science must surely be to get right what the intention of a 14th century forger was. Don’t at any costs buy into the pro-authenticity narrative that it was a burial shroud. That’s the thin edge of the wedge for tacking on a miraculous resurrection narrative (flashes of scorching-uv radiation etc, which frankly defy conventional physics). A more probable explanation is that a forger wanted to re-create a body imprint of Jesus left in blood AND sweat on Joseph of Arimathea’s linen en route from cross to tomb (that fabric being replaced at the tomb by the more specialized burial wrappings hinted at in the Gospel according to St.John).\nIn fact there’s the testimony of St.Francis de Sales, writing to his mother in 1614, for which a cut-and-paste seems legitimate, given the difficulty in accessing the original source:\nNote the numerous references to SWEAT:\nAnnecy, May 4, 1614.\nWhilst waiting to seeing you, my very dear Mother, my soul greets yours with a thousand greetings. May God fill your whole soul with the life and death of His Son Our Lord  !\nAt about this time, a year ago, I was in Turin, and, whilst displaying the Holy Shroud to such a great crowd of people, a few drops of sweat fell from my face on to this Holy Shroud itself. Whereupon, our heart made this wish  : May it please You, Saviour of my life, to mingle my unworthy sweat with Yours, and let my blood, my life, my affections merge with the merits of Your sacred sweat  !\nMy very dear Mother, the Prince Cardinal was somewhat annoyed that my sweat dripped onto the Holy Shroud of my Saviour  ; but it came to my heart to tell him that Our Lord was not so delicate, and that He only shed His sweat and His blood for them to be mingled with ours, in order to give us the price of eternal life. And so, may our sighs be joined with His, so that they may ascend in an odour of sweetness before the Eternal Father.\nBut what am I going to recall  ? I saw that when my brothers were ill in their childhood, my mother would make them sleep in a shirt of my father’s, saying that the sweat of fathers was salutary for children. Oh, may our heart sleep, on this holy day, in the Shroud of our divine Father, wrapped in His sweat and in His blood  ; and there, may it be, as if at the very death of this divine Saviour, buried in the sepulchre, with a constant resolution to remain always dead to itself until it rises again to eternal glory. We are buried, says the Apostle, with Jesus Christ in death here below, so that we may no more live according to the old life, but according to the new. Amen.\nFrancis Bishop of Geneva.\nMay 4, 1614.\n(Oeuvres complètes, édition d’Annecy, 1910, t. XVI, p. 177).\nSo one has a handle so to speak: ask oneself how a medieval artisan might have tried to simulate/mimic a sweat imprint, probably using materials and conditions that don’t require real sweat. e.g. organic-based substitutes, probably heat-assisted. Try to model that process (as this investigator has done by use of white flour as imprinting agent, followed by light oven-roasting). See my two most recent postings:\nshroudofturinwithoutallthe…mbra-flour-scientist-says/\ncolinb-sciencebuzz.blogspot…er-beam-really-needed.html\nThen, when an opportunity arises (if ever) for a second visit to Turin with hi-tech equipment ,the first by the STURP ensemble being 37 years ago, look for chemical signatures of one’s final short list of possible or likely modelling techniques.\nLess of the defeatism please… Where there’s a will there’s a way. \nThere’s a scant record of the early history of the so-called Shroud. The least that Shroud so-called historians can do is to recognize its existence, to address it, discuss it, and then, and only then dismiss it if they see fit. Under no circumstances should they ‘de-select’ it as unfavourable to their instant hunches. It’s the difference between sound scholarship and instant sloganizing (“just a painting”).\n\n","date":"September 19, 2015 at 10:42 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210712","author":"Colin Berry","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"What makes you think that this was the work of a forger? Most relics were made for some other purpose and then adopted as supposed relics.\n\n","date":"September 19, 2015 at 5:45 pm","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210746","author":"Charles Freeman","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"How about the d’Arcis memorandum for starters (which you somehow managed to ‘de-select’ from your article, except for a brief reference to the bishop’s predecessor (omitting the word “cunningly” that preceded “painted”)?\nSelection bias is bad enough. De-selection bias is the pits.\n\n","date":"September 20, 2015 at 2:09 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210773","author":"Colin Berry","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"Where you and I differ, Colin, is that I try actively to see advice and support from experts in the field as this is the only way to obtain credibility. So far as I can see you have a personal theory for the images for which there is no evidence  and you while away your time with a bowl of flour year after year trying to recreate the images as they are now when the real test is to recreate the images as they were originally.\nI am quite happy to be taking an alternative path  but see no reason why this should involve your personal abuse of myself and others.\n\n","date":"September 20, 2015 at 5:42 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210781","author":"Charles Freeman","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"Here’s another crucial historical asset that has been ‘de-selected’ by our simplistic  sloganizing so-called historian:\nApril 14, 1503 Good Friday:\n Exposition of the Shroud at Bourg-en-Bresse for Archduke Philip the Handsome, grand-master of Flanders, on his return from a journey to Spain. The Shroud, which has been specially brought from Chambéry, with great ceremony, by Duke Philibert of Savoy and Duchess Marguerite, is exposed on an altar in one of the great halls of the Duke’s palace. Savoy courtier Antoine de Lalaing records of the events of that day: “The day of the great and holy Friday, the Passion was preached in Monsignor’s chapel by his confessor, the duke and duchess attending. Then they went with great devotion to the market halls of the town, where a great number of people heard the Passion preached by a Cordeilier. After that three bishops showed to the public the Holy Shroud of Our Lord Jesus Christ, and after the service it was shown in Monsignor’s chapel.”  Lalaing adds that the Shroud’s authenticity has been confirmed by its having been tried by fire, boiled in oil, laundered many times ‘but it was not possible to efface or remove the imprint and image.’  \nNobody subjects an image to that kind of treatment, whether actually carried out or not, if there’s the slightest suspicion that it’s “just a painting”. However, it’s arguably what might be done, or suggested tongue-in-cheek might have been done,  in the case of  a mysterious and enigmatic image that is totally unlike a conventional painting.\nMy flour-imprinting model actually incorporates the kind of treatment alluded to above, namely a final vigorous washing step with soap and water to remove the encrusted Maillard product, leaving a ‘ghost image’, one  that is faint, fuzzy and Shroud- like (negative image, 3D properties).\nMr. Charles Freeman has become seriously boring, and is a dead loss as a historian. He should have stuck to his schoolteaching.\n\n","date":"September 20, 2015 at 6:11 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210783","author":"Colin Berry","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"Don’t shout too loud ,Coilin. Some of the people who emply me as a professional historian might hear you and I would lose my income!\n\n","date":"September 20, 2015 at 8:11 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210790","author":"Charles Freeman","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"Professional historian? You don’t say. I saw little or no evidence of that in your magazine article, best described as opinionated journalism. It’s little wonder that you rely so heavily on those “experts” to one day prove you correct (best not to enquire about time scale).\nScientific research is not about going cap in hand to “experts”. It’s about testing one’s own hypotheses, homing in gradually on the essentials. It has taken the best part of 4 years to develop my flour-imprinting/simulated sweat imprint theory. Experts? I was known in the flour milling and baking industry as an expert on the cornucopia of chemicals and biochemicals that exist in the humble wheat grain (proteins, starches, sugars, cell wall polysaccharides etc etc). I have no need to consult outside experts. White flour does the business. My results, published to the internet, and easily reproducible in people’s own homes, show the model cannot be lightly dismissed, least of all by scientifically-challenged so-called professional historians who look to others to pull their chestnuts out the fire.\n\n","date":"September 20, 2015 at 1:31 pm","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210804","author":"Colin Berry","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"I do wonder, then, why  my History Today article was first checked and passed by an Oxford Professor specialising in the medieval church, then got through the History (sic) Today board and then was welcomed by several professors and others as being a sensible and likely solution to the mystery of the Shroud.\nHowever, what do they know compared to a flour expert who can spot bogus history a mile off!\n In the end what matters is that someone finds a solution to the Shroud that gets widespread academic support. We differ in that I start from building from existing work on painted linens, medieval versus ancient weaves, and Passion iconography so that if I decide to publish I can quote academic support  for my views.\nYour approach is to work away in the flour bowl in your shed and, presumably,  hope that fellow scientists will eventually endorse what you have done.\nGood luck. I have  nothing against your approach. We are all after trying to get a plausible solution to an object that  is closed off from sophisticated scientific examination. The date and nature of the images could probably be sorted in a couple of hours with state of the art scanning equipment that picks up minute pigments.\nWhat I find difficult is your apparent view that the Shroud has remained with any degradation of images or linen so that what we have now is exactly what existed in1350. However, that is better than assuming that what exists now Is exactly what existed in AD 30 which appears to be the STURP approach. I have never seen any STURP paper which says ‘ we must start by working out how the present Shroud might have looked 2,000 years ago’. At least Giulio Fanti accepts that the Shroud has degraded over time although as yet he has not extended this insight to the images themselves.\nNow I have replied to you without any denigration  of yourself or your work. There is no need to do so. Where did your futile, unproductive, and, in my case, laughable, attempt to denigrate anyone who disagrees with you come from? Time for some soul searching perhaps- or it may be something they put in in the today’s flour!\nAmong the relics my study group will be visiting in Italy with me next week is the Holy Blood  of Christ in Mantua. It has a longer documented history than the Shroud but Christ’s blood was such a money spinner in the fourteenth century there were all kinds of incentives for finding some, perhaps ,though I doubt it in this case, adding some in to the Shroud.\n\n","date":"September 20, 2015 at 3:15 pm","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210811","author":"Charles Freeman","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"“Your approach is to work away in the flour bowl in your shed and, presumably, hope that fellow scientists will eventually endorse what you have done.”\nAnd your feeble attempts to talk down in your oh -so-smug, self-satisfied  superior toffee-nosed manner should fool no one here, Charles Freeman.The path from thinking how a medieval forger would have set about simulating a sweat imprint was a long and arduous one, requiring application of chemical know how every step of the way. It began with testing out Joe Accetta’s ideas with tannin dyes and their acidic impurities, notably alum mordants. It then moved to looking at sulphuric acid per se, and finding its etching action was insufficient to produce discoloration. The focus then switched to nitric acid, which had little effect on linen per se, but which produced strong yellow coloration on linen that was coated with proteinaceous substances. That led to testing out different protein sources, and finding white flour was remrkably effective as an imprinting agent, allied with nitric acid development. That then led to testing heat alone as a developing agent, dispensing with nitric acid. That put the focus first on Maillard reaction products and finally on the far more subtle ghost image and coloration that survived washing with soap and water.\n“Work away in the flour bowl in your shed”?\nis that your final attempt at trivializing months of detailed experimental investigation, Charles Freeman, or do you have more gems of that nature up your sleeve?\n\n","date":"September 20, 2015 at 3:45 pm","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210815","author":"Colin Berry","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"Quote.’i have nothing against your approach ‘. It may find the solution to the problem, it may not. I happen to think you are starting from false premises. Please prove me wrong.\nBut yet more personal denigration of myself…. If that is your way of living within the academic community so be it.\n\n","date":"September 21, 2015 at 1:14 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210840","author":"Charles Freeman","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"” I happen to think you are starting from false premises. Please prove me wrong.”\nMaybe that’s because I presently have a mere 15 matches between TS and model (see below). Give me time and I may be able to think of more. \nHow many matches does Charles Freeman have one wonders in his  “just a painting” dogma? Does our freewheeling ‘academic historian’ even bother about such minor details?\nMy model explains:\n1. Why it’s a negative image – it’s a contact imprint\n2. Why it’s a double-image, head to head – it’s a medieval attempt to model J of A’s linen deployed in dignity-preserving transport mode of a naked body between cross and tomb.\n3. Why it has 3D properties. Contact imprints off 3D subjects – in this instance a real person, probably live volunteer – typically have 3D properties.\n4. Why there is no paint pigment – it’s a simulated sweat imprint obtained by thermochemical reaction on the surface of the linen fibres.\n5. Why STURP found evidence for the presence of real blood, albeit somewhat degraded, the latter having been used to make the strategically-sited bloodstains.\n6. The fuzziness of the image – solid flour particles used for imprinting onto wet linen.\n7. The spectral characteristics of dehydrated carbohydrates, the model envisaging any number of ways in which the carbohydrates of flour, linen or both can become thermally altered at the oven-roasting stage (Maillard reactions with protein and/or simpler amines, caramelization etc).\n8.The ability to chemically bleach the image, indicative of organic (NOT inorganic) nature, i.e. carbon, not mineral-based as per typical artists’ pigments – iron ochre etc.\n9. The reported brittleness of image fibres, compared with non-image fibres. The fibres in direct contact with the flour-imprinting would be more thermally-degraded and chemically modified. \n10. Microscopic properties (half-tone effect, discontinuities, striations etc), that may ultimately be interpretable in terms of limited areas of hot-spot contact between linen fibres and thermally-degrading imprinting medium.\n11. Image superficiality: the roasting step can be controlled visually, allowing any desired degree of image intensity, with the added guarantee that the final washing step with soap and water will attenuate image intensity and image thickness still further.\n12. Alleged traces of starch: this is only to be expected of using flour as imprinting medium.\n13. No imaging of the wound sites per se – merely blood. A simulated sweat imprint would not capture an image of damaged skin if the latter were exuding blood. Even the “scourge marks” are said to be entirely blood, not imprints of body image.\n14. Minimal lateral distortion, despite being a contact imprint. The imprinting medium can be applied to selected relief, e.g. the highest, the flattest, avoiding the vertical sides. Manual pressure to linen is also restricted to the highest, flattest relief, avoiding the sides. \n15. No loin cloth, no crown of thorns – they would not register well in a simulated sweat imprint, even if still present.  The suggestionthat their images were there originally and have selectively crumbled away while leaving other features intact (blood, hair, nose, beard etc) simply defies common sense.\n\n","date":"September 21, 2015 at 2:50 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210849","author":"Colin Berry","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"Colin,When you have produced a formula that can be replicated by other scientists and which explains both the blood images and the other images ,I am sure you will be taken seriously. But you haven’t got there yet.\nI am working from an opposite approach – starting with existing research and seeing how it provides comparisons with the Shroud\nThe winner will be any person, perhaps neither of us two,who can achieve  a consensus of academic opinion on how the original images can be explained . I think that with the new research on painted linens and the way they disintegrate over time, it will happen naturally within ten years. We will wait and see.\nNo\nNeed to waste your energy on personal attacks before then.\n\n","date":"September 21, 2015 at 7:55 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210860","author":"Charles Freeman","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"What Charles Freeman describes as “personal attacks” are in fact a voicing of extreme disquiet regarding his internet persona and modus operandi, shown yet again in his last few comments. He demands one produces the evidence. One obliges, and what happens? He ignores completely the evidence one has taken time to assemble, and then blathers on about one having still to convince other scientists, despite there being no counter-claims as yet that I’m aware of.  Does he seriously imagine I am going to waste time with these pathetic attempts to undemine one’s research credentials? Mine were established in a lifetime of biomedical research, published in highly-regarded peer-reviewed scientific journals (not books and magazines).\nMy proposals regarding the TS body image are based on patient experimention, reported in real time to the internet which anyone with an hour or two to spare can check out for themselves. His claims, as stated earlier, are little more than opinionated journalism, and as such near-worthless in academic terms. If he thinks otherwise then let him try submitting his “just a painting” views to a  scholarly peer-reviewed journal.\n\n","date":"September 21, 2015 at 8:36 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210863","author":"Colin Berry","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"Surely the problem is,Colin, that no one has noticed your work and you can’t really claim that there are no counterclaims until you have published it. It is not my problem that you have failed to extend your researches into the academic community.\nI have published in a highly respectable history journal and have a lot of responses I have  been able to work from. My guess, and only a guess, is that with the accumulation of recent work on painted linens we will have within the next few years a number of formerly painted images that match the Shroud. I am not a linen conservationist so I won’t get the accolade but I may get a mention as having pointed some of my more academic readers with the relevant specialist skills in weaving, iconography and painting on linens towards taking the Shroud seriously. Of course, your imprint theory does not conflict with the solid evidence that this was a typical product of a medieval treadle loom and that the iconography fits well with the fourteenth century.\n\n","date":"September 21, 2015 at 3:24 pm","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210884","author":"Charles Freeman","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"“History Today” may be a respectable journal, the latter defined on the first site I checked as “a newspaper or magazine that deals with a particular subject or professional activity.”. But it’s not an academic journal. Academic journals do not pay for submissions, and indeed will impose an upfront charge  if one wants one’s paper to be available free online. Academic journals are not available over the counter at newsagents. “History Today” does not exist to further historical research, but to sell copies. “HistoryToday” will choose its articles primarily for their immediate impact when seen by the public on shelves, not for their perceived value to the academic research community in a year or 10 year’s time. One deludes oneself if one imagines that an article accepted for publication in “History Today” is the equivalent of having a paper accepted by a recognized academic research journal with a far higher level of peer-review scrutiny that goes way beyond mere editorial scrutiny for criteria like readability, impact etc.\nAll my own key findings are backed up by photographic evidence. It matters little to me if that evidence remains for now largely or indeed entirely within the blogosphere. But I will strenuously oppose attempts by those who attempt to question the honesty and objectivity of my shroud research, or to make light of my scientific credentials simply because unlike you Charles Freeman I am in no hurry to see my still-evolving ideas reported in the mass media. \nIt’s taken the best part of 4 years to arrive at the current flour-imprint model. A few more months or even years of relative anonymity won’t hurt. However, that might change if there were ever to be a repeat of the over-hyping of someone else’s model studies, comparable to the hullabaloo that accompanied Paolo Di Lazzaro’s laser coloration of linen in December 2011, trumpeting “unique superficiality”  when in fact there were no hard data on that aspect, and indeed still aren’t for that matter.  Rest assured that I would then throw my hat into the ring.\n\n","date":"September 21, 2015 at 4:23 pm","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210888","author":"Colin Berry","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"The point actually is that my article was read by a lot of academics and I have good contacts through it on which I have been able to build further research.\nOnce you have published your own work ,I am sure you will get many accolades. I will wait until then. Happy dough kneading!\n\n","date":"September 22, 2015 at 12:32 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210909","author":"Charles Freeman","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"Those final three words convey better than I can why it’s impossible to accept Charles Freeman as a bona fide academic. He is basically a WUM and self-publicist.\nIt is dry white flour – a fine powder – that is used in my current model as imprinting medium – sprinkling flour onto oil-coated skin, and then imprinting onto wet linen.  Who would have thought that homely white flour – as powder – not dough (yet another shameless attempt  on Freeman’s part to mislead and/or trivialize) is so amazingly effective as an imprinting medium? \nThe end-result is a very passable imitation of the TS image – faint, fuzzy, negative, 3D properties, half-tone characteritsics, image-discontinuities etc – at least after the final washing step. The image may even be highly superficial, though I frankly don’t set much store by anything that Paolo Di Lazzaro has written on the subject of image superficiality – all froth, no real substance, what I previously dubbed “Mickey Mouse science”. But Mickey Mouse science beats Charlie Chaplin history any day…\n\n","date":"September 22, 2015 at 12:53 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210910","author":"Colin Berry","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"It is only a matter of getting yourself published,Colin, so that your work can be openly evaluated by others. I have never in all my time working on relic cults come across your premise about the making of this kind of fake relic so I  am deeply sceptical especially as I have no evidence that you have ever studied relic cults and the way they work. Flour, well super-flour! , is your thing, radiation is di Lazzaro’s. Good luck to one and all. There is no one path to the truth as a critic of early Christianity once said.\nBut once again, get yourself published in a respected scholarly journal and you will be open to proper evaluation. Judging from the feedback I get my thesis has widespread approval in the wider academic community, was taken up by the Guardian’s chief art critic,  is up near the top of the Google list on the Shroud,etc,etc. and is being widely read. I am just waiting for someone with more specialist expertise than I to take it on.\n\n","date":"September 22, 2015 at 1:27 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210914","author":"Charles Freeman","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"I leave it to readers to judge about the distinction between good and bad history:\nhttps://www.academia.edu/7893085/The_Quest_for_Jesus_in_Shroud_research\nI have received support from people both in and out of the realm of Shroud studies and that is encouraging. I also do not think that Rome and Turin will appreciate what went on in Hampshire, given that the background showed no respect for the Christian faith or for an artefact that is considered to be a Christian relic.\nIt must also be remembered that relics are secondary issues for the Catholic Church, the emphasis being on canonisation.\nI also dislike sounding like a broken record and forced to mince words, but will now repeat what has been said before:\nObsesssion with monotheism can be dangerous and can get even more dangerous when it is repeated like a mantra in an increasingly dangerous world. The brighter minds realised that it simply does not work:\nhttps://www.academia.edu/15308857/Freuds_incomplete_speculation_on_monotheism\nand, more recently:\nhttps://www.academia.edu/12823419/Book_Review_Jesus_and_Yahveh_the_names_divine\nI can go further and discuss Peter Gay and his views about psychoanalysis and history and even Egyptologist Jan Assmann and his views. There is sufficient material to write volumes about them.\n\n","date":"September 19, 2015 at 5:07 pm","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210745","author":"Louis","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"Fortunately for us all, especially Louis, I am certain that “what went on in Hampshire” was not only not harmful to any prospect of further investigation into the Shroud, but positively beneficial. Those who have faith in the Resurrection from the Dead and believe that the Shroud is authentic have no fear that further investigation of the Holy Relic will destroy their faith by revealing that Christ was not dead after all, while those who have faith in the Resurrection and believe that the Shroud is medieval know that establishing that firmly will leave the question open for any religion to interpret in its own way. Louis’ interpretation of the meeting of minds at the Jalsa Salana, and his apparent suspicion of ecumenism in general, is wholly misguided, and his assumption of the views of “Rome and Turin” wholly incorrect. That’s good news, isn’t it?\n\n","date":"September 19, 2015 at 5:58 pm","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210748","author":"Hugh Farey","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"I have bad news for Hugh, and can understand why he feels the need to justify his presence in Hampshire. It is possible to understand that as editor of the BSTS newsletter  — also because it would be easy for him because he lives in England — it would be useful for him to hear a talk about the Shroud and also what people there had to say. What I think is not understandable is his distortion of the truth. There was no “ecumenism” there because what was trampled upon was Christian belief and a relic that is considered to be a Christian relic. I do not stand alone in my judgement, I am the only one who is speaking openly.\nFurther, there was also to be a talk where Mark Guscin’s work on the Sudarium of Oviedo would be used to further the sect’s claim that Jesus survived the crucifixion. If Jesus survived the crucifixion and went to India he would be the greatest liar, trickster or expert magician the world has ever known. The relic would not be the “Holy Shroud”, it would have to be sent to one of the places listed in the link below:\nhttps://en.wikipedia.org/wiki/List_of_magic_museums\nIt was very easy to hold this conference in England, where despite the fact that there is no separation of church and state, HM the Queen, also the head of the Church of England, has no voice and is little more than a rubber stamp. Would such a conference, “ecumenical” according to Hugh, have been held in the US or, say, Serbia of Armenia?  \nHugh’s statement, which I quote below, makes no sense at all:\n“Those who have faith in the Resurrection from the Dead and believe that the Shroud is authentic have no fear that further investigation of the Holy Relic will destroy their faith by revealing that Christ was not dead after all, while those who have faith in the Resurrection and believe that the Shroud is medieval know that establishing that firmly will leave the question open for any religion to interpret in its own way.”\nI would like to see Hugh signing a petition to Pope Francis or addressing another letter to the Chancellor of the Pontifical Academy of Sciences. He knows very well, although he will not admit it — just as he evades addressing the issues in my previous comment — that what he is justifying would mean that both pontiff and archbishop would lose their jobs overnight and would have to return to Argentina, from where they come, to perhaps dance  tango in order to forget decades of wasted time.\n\n","date":"September 19, 2015 at 7:09 pm","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210749","author":"Louis","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"“He knows very well [….]” Fortunately for us all, not a shred of what follows is true.\n\n","date":"September 19, 2015 at 7:43 pm","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210751","author":"Hugh Farey","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"“For us all” Really? Who exactly compose the “all”? I want to see coherence in what Hugh writes. He cannot refute what I am saying.\n\n","date":"September 19, 2015 at 7:49 pm","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210752","author":"Louis","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"Sorry, Louis, but there is nothing to refute. Your unsubstantiated opinion is not justified or explained. My opinion is explained in detail. The Catholic church has nothing to lose in determining whether the Shroud is authentic or not. Nor do individual Christians, unless their religion is determined more by a sheet of cloth than by the words and works of the founder of Christianity. Those who are convinced they know whether the Shroud is authentic or not will be delighted to be able to demonstrate that they were right all along, and those who are not convinced will be delighted that the truth has been discovered at last. I have no doubt that the Pontifical Academy of Sciences would agree. Their reluctance to permit further investigation is  not because they don’t want to know, but because of the difficulty of finding appropriate personnel to carry it out, to ensure that there was as little inherent bias as possible, which could either influence the results, or, even if the results were scrupulously scientific, be thought of as having influenced the results.\nLouis suggests that ecumenical conferences are not possible in certain countries, presumably where religious views of tolerance, generosity, compassion and magnanimity are less well developed as in the UK. He may be correct; I don’t see that it has any relevance.\nI do not believe this statement: “There was no “ecumenism” there because what was trampled upon was Christian belief and a relic that is considered to be a Christian relic. I do not stand alone in my judgement, I am the only one who is speaking openly.” Christian belief was not trampled upon. It was disagreed with, but in the most friendly and generous manner. Ecumenism (or, to give it a less specifically Christian focus, “religious pluralism”) is not an attempt to make people of different beliefs merge into a single tradition, but an attempt to show that it is possible to hold very different beliefs but still live in harmony. A Jew, a Hindu, and at least three different denominations of Christianity met in a tent with Ahmadiyya Moslems in just such a spirit at the Jalsa Salana, and there is no doubt whatever that God smiled on the occasion.\n\n","date":"September 19, 2015 at 8:39 pm","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210753","author":"Hugh Farey","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"Hugh, my faith does not depend on the Shroud’s authentication and what I see is non-Christians delighted with what is being written by some Shroud scholars to further their hidden agendas.\nThere is much indeed that you have not refuted and I invite you to read my previous comments. There is “ecumenism” and true ecumenism. You may have read something about the latter in England where even Hindus have taken part, and where they have never said anything against the creation account in the Bible and monotheism, although it goes against their religious beliefs and their cosmology corresponds to some extent with what science tells us today. On the other hand the “ecumenism” which you say you saw in Hampshire is pure fiction, a figment of your imagination. It was openly stated there that Mark Guscin’s work on the Sudarium of Oviedo would be used to promote the view that Jesus survived the crucifixion and I presume Holster Kersten’s “history”, which I refuted:\n  https://www.academia.edu/7893085/The_Quest_for_Jesus_in_Shroud_research\nwas also used because the intention was to promote the “Jesus in India” rubbish, which neither Hindus or Muslims in India and Pakistan believe.\nIt is of course possible for people with very different beliefs to live together in harmony and I count people of very different religious beliefs and agnostics and atheists as my friends.\nBut I do not thing God smiled at what he saw at Jalsa Salana. I think he frowned.\n\n","date":"September 20, 2015 at 10:38 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210796","author":"Louis","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"Well; for the benefit of my readers. I won’t go on. I was there; Barrie was there; Pam Moon was there; you weren’t. I missed all the hidden agendas. I met people who thought the Shroud was authentic and people who didn’t, people who thought Jesus was entombed alive and people who didn’t, people who believe Jesus walked to India and people who didn’t. I don’t think any of them changed their mind, but they were all able to explain their point of view with attention and respect.\n\n","date":"September 20, 2015 at 11:27 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210800","author":"Hugh Farey","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"Correct, I wasn’t there. For the rest, wait till my article is ready, where you will read about the agendas you missed.\n\n","date":"September 20, 2015 at 11:37 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210801","author":"Louis","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"Hugh says that for the “benefit of his readers” he can’t go on. If you look at my previous comments you will be able to see that he had no responses, therefore he didn’t wish to go on. I will wait to see what is the report on the Hampshire event in the BSTS newsletter and on any Shroud websites, in order to see if the whole story has been told, or if the shared agendas continue to be hidden.\nWhat the people in Hampshire did not realise is that science has progressed a lot ever since the Scriptures were written. Nobody can afford to cling to old notions about the creation of the universe.\nThe Christian point of view was appreciated by the Jewish-born agnostic scientist Stephen Jay Gould:  https://www.academia.edu/14727603/Why_Stephen_Jay_Gould_proposed_the_principle_of_Non-overlapping_Magisteria\nIt is part of a larger quest:\n https://www.academia.edu/5353803/God_science_and_religion_today\nSome hints about which, along with the latest in Shroud research can be found in:\nhttp://www.amazon.com/Coming-Quantum-Christ-Apocalypse-Selfishess/dp/1505468418/ref=sr_1_2?s=books&ie=UTF8&qid=1442774404&sr=1-2&keywords=quantum+christ\n\n","date":"September 20, 2015 at 2:16 pm","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210807","author":"Louis","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"I still remember well the Catholic Church of my childhood and early youth.  Essentially of a fortress mentality, and introspective, still reacting from the post-Reformation and Enlightenment periods of earlier ages, Pio Nono prisoner in the Vatican, through two global conflicts and economic Depression of the 1930s, to the post WWII period of Pius XII.  \nIn January 1959, Pope John XXIII announced his intention to summon a General Council, and this December 2015, will see the 50th anniversary of it being brought to fruition with its formal closure on December 7, 1965.  It heralded a new era of openness for the People of God, but it still seems that a few of us yet need to catch up. \nSignificant documents relating to the discussion above include: Lumen Gentium, Constitution of the Church, particularly the all-inclusive chapter 2 as to who comprise the People of God;  the Decree on Ecumenism, Unitatis Redintegratio;  Relationship of the Church to Non-Christian Religions, Nostra Aetate;  and the Declaration on Religious Freedom, Dignitatis Humanae.   It ought to be enlightening for the combatants in the above discussion to revisit and reread these important documents.  Perhaps they may thus be able to refresh their perspectives on the place and need for dialogue with others of different persuasions. \nIn the United Kingdom, Western Europe, the United States, and several countries enjoying a British heritage (Australia, New Zealand, Canada), Religious Freedom is now too easily taken for granted.  However even in those places it is a comparatively recent innovation, not much older than the 20th century, and even so it remains vulnerable and is frequently threatened by hostile forces.  In many other countries it is utterly unknown, and the concept is unfamiliar to their traditions.   \nThe world is rapidly evolving into societies of religious pluralism, and we need to learn how we may cope with this diversity of belief, and yet continue in our attempts to live peaceably with one another.  The alternative is unthinkable.    \nDuring his recent trip to Turin, Pope Francis with his visit to family in the Po Valley made a point of also visiting the Waldensian communities there.  His efforts at reaching out to other religious communities gives an example that ought to be emulated at the grass roots. \nThe recent conference at Hampshire would seem to have offered such an opportunity of dialogue with a particular non-christian group, and it would seem that attendance by some Christians there was entirely appropriate and in accord with the principles of dialogue, ecumenism and expressions of religious freedom enjoined by the Council and by Pope Francis.\n\n","date":"September 20, 2015 at 4:04 pm","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210816","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"I think that this just an attempt to contradict what I have commented, and devoid of any logic. The Waldensians are Christians, to compare them with the folks at Hampshire is absurd. Strangely, people with these notions are the very ones\nwho are demanding fresh testing of the Shroud, as though believing that the decision makers are blind and do not see what is going on.\n\n","date":"September 20, 2015 at 4:27 pm","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210817","author":"Louis","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"On the contrary its logic is clearly apparent, as it is a natural consequence of the four specific Vatican Council II documents that I mentioned.  It is also consistent with the general “reaching out” examples to those outside the Catholic Faith of Pope Francis.  His visit to the Waldensians is only one recent example of his conciliatory and all-inclusive approach.  Like it or not, we will all have to live in a pluralistic world, and we need to learn how best we may cope with this, while still being loyal to our own particular traditions.\n\n","date":"September 20, 2015 at 7:10 pm","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210825","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"Another argument, which is also illogical, because what I said has nothing to do religious pluralism. My previous comments have to be read in order to comment with reason. Or are you saying that Pope Francis would have approved of a group claiming that Jesus survived the crucifixion and went to India just as he approved the contentions of the Waldensians? I will not waste time with provocative comments that are irrational.\n\n","date":"September 20, 2015 at 8:00 pm","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210830","author":"Louis","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"There is clearly some confusion between what might be held as doctrinal beliefs by various groups, and those who hold such beliefs, human beings all made in the image of their Creator.  I am unaware of any papal approval of the doctrinal “contentions of the Waldensians”, a 12th century sect which later modeled its doctrines on a type of Swiss Protestantism.  In June, Pope Francis became the first pontiff to visit a Waldensian evangelical church, not to commend their doctrines, but to seek their forgiveness of his church’s historic brutal persecutions of their members.  \nLikewise, regardless of what beliefs the Ahmadiyah sect of Islam might hold, it is unlikely that any pontiff would subscribe to them, but he might well seek dialogue with those who in accordance with the teachings of Lumen Gentium, honestly seek God according to what they believe.  \nEarlier this evening, a newscast noted that Pope Francis spent some 40 cordial minutes with a frail and elderly Fidel Castro, the revolutionary communist leader who persecuted religion, isolated Cuba from the rest of the western hemisphere, and almost brought global catastrophe with the threat of nuclear war during the Bay of Pigs incident.  This coming Wednesday, Francis will visit the USA, no doubt with a message concerning that nation’s capitalist dominance, and I wonder if he will be received as cordially as he was in Cuba.  \nDespite the English persecution of Catholics such as Edmund Campion, execution of countless priests for their celebration of the Mass, and the later persecution of the national religion of Ireland,  I shall not be seeking the approval of any present correspondent for my sharing in any ecumenical celebrations with my neighbouring Anglican parishioners.\n\n","date":"September 21, 2015 at 2:44 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210847","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"It is becoming increasingly obvious that the above correspondent is unable to learn from mistakes, apparently the result of blind spots of which he is unaware, and continues to disrupt this blog by posting provocative comments aimed at other people who comment and deviate from the topic under discussion.\nFurther, he indulges in his usual scheming by trying to pit this correspondent against the blogmaster, who belongs to the Episcopal Church, by saying that “I shall not be seeking the approval of any present correspondent for my sharing in any ecumenical celebrations with my neighbouring Anglican parishioners.” It is also apparent that his experience in ecumenism does not go beyond his native New Zealand, from where he has never stepped out. He does not respect people who have been working professionally in the field for decades, with on-site experience in different religions, with international experience, with articles published in leading dailies, some of which are preserved in university and Church libraries for reference.\nWhat was being discussed was the Hampshire event, which has nothing to do with the Waldensians, with Edmund Campion, with Fidel Castro or with pluralism and the correspondent continues to ignore my previous comments because he has no responses. Anyone who has kept abreast with the news knows that Pope Francis is aware that Lumen Gentium simply does not apply to each and every group, so much so that he is even worried about what is happening just 250 miles off the coast of Sicily.\n\n","date":"September 21, 2015 at 9:11 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210865","author":"Louis","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"I’m sorry, but this tangent is becoming more and more incoherent. It is conjecture. There is no way to prove conjecture by simply providing more conjecture. Can we put aside the musings on what the RC hierarchy may or may not be thinking and refocus on the topic of the blog, which is the Shroud and NOT the current state of world religions.\n\n","date":"September 21, 2015 at 9:59 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210867","author":"David Goulet","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"The judgment of the editor of the BSTS newsletter has come under attack for his attendance at a conference relevant to its subject, and for his failure to discern hidden agendas, from a person who did not attend.  I have been accused of an inability to learn from mistakes, of having blind spots, of disrupting the blog, of provocative comments, indulging in scheming, together with an uninformed presumptuous comment about where I might or might not have been.  Neither of us have responded in kind, but have attempted to rationally address such issues as were raised by way of refutation.  Those who bother to read these exchanges, may draw what conclusions they will.\n\n","date":"September 22, 2015 at 3:14 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210919","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"This matter has now been referred to the site moderator.\n\n","date":"September 22, 2015 at 8:38 pm","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210964","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"I was a bit distracted with the unsolved\nproblem of mass spectrometry.\nI believe the editor of the BSTS newsletter\ncan be interested to publish a serious paper\non that argument. (B.T.W. : Have you a\nnew contribution, useful to solve that “conundrum”?)\nand now I read your exchanges that are going far\nfrom the subject (= Di Lazzaro, the Shroud\nof Arquata del Tronto and the non invasive analyses).\nSo..\nI (naively) ask:\nWhere we believe to go with these strange discussions?\nI think we have to be more exact in our approach.\nB.T.W.: Colin has shown the evidence:\nhe uses modern linen samples that (probably)\nare a bit different with respect the ancient material\n(but, here, I avoid the discussions around ancient\nretting treatments, “flax wax” location, “flax wax” detection\n[by coloration], etc. …).\nBut, at least, he (rightly, IMO) indicated the lack of\n“systematic study to establish the location of image\nor coloration in either the TS or (laser-generated)\nmodel systems respectively”.\nWell, this sort of “vacuum” (an empty “space of researches”)\ncan be a possible starting point to discuss\nwhat is the best analytical way to use, in order\nto produce a new, useful, work.\nAnd this, in short, should be done\navoiding to fail further scientific works…\nSo, we have to succeed in our communications,\navoiding [as well as possible, or as far as possible…]\n“sneezings” with useless or offensive words.\nBut …\nWhere is our true objective when we fall in the pitfall\nof reciprocal denigrations, leaving apart\npossible frutiful discussion on textile research?\nPerhaps (the bad objective) is the unconscious\n(reciprocal) attempt to destroy all the bloggers…\n\n","date":"September 22, 2015 at 10:40 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210938","author":"piero","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"Hi Piero. I will review Marco Bella’s paper, as I do with most scientific publications on the Shroud, in the next newsletter, but without any more access to the dozens of mass spectra Rogers says were carried out, I can do little more than point out anomalies and contradictions rather than offer a serious study of the evidence.\n\n","date":"September 22, 2015 at 1:21 pm","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210948","author":"Hugh Farey","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"Dear Hugh,\nI am doubtful that even with the full set of spectra anyone would be able to draw any conclusion. It is difficult to understand mass spectra. With pyrolysis mass spectra you warm up a sample, chemical compounds are broken down, you see only some fragments. You have to solve a complex puzzle, sometimes without all the pieces. It might be feasible if you have one or two compounds, but with several molecules hardly any conclusion can be drawn. \nConsider that pyrolysis mass spectra was a technique used in the eighties. Do you remember the technology at that time? How computers and mobile phones looked like?\nToday, mass spectrometry has completely different instrumentation, and can give totally different information. With those spectra done in the eighties, we can just conclude that one is contaminated with a compound bearing a long aliphatic chain and besides that, they are the same.\nI tried to answer to all your concerns in this forum because it might be useful also for others, but if you need additional information for your article, please feel free to contact me.\n\n","date":"September 22, 2015 at 3:31 pm","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210953","author":"Marco Bella","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":">…spectra done in the eighties, ???\nThis claim by prof. Bella seemed to be doubtful…\nbecause, to my knowledge, Rogers published the paper\n“Pyrolysis/Mass Spectrometry applied\nto the Shroud of Turin” after the year 2000 (and,\nto be exact, in 2004!)…\nThen my question is the following:\nWhen the samples were run?\nThe answer can come from the following excerpt:\n>…One of the analytical methods used during the STURP studies was pyrolysis mass spectrometry. The Midwest Center for Mass Spectrometry (MCMS) at the University of Nebraska, Lincoln, made dozens of scans on different samples in 1981. …\n1981!…\nHmmm…\nThen the possible consequent idea (but IMO, it’s a bad idea)\nis the following:\n“We require a new set of mass spectrometry analyses…”\n\n","date":"September 23, 2015 at 9:53 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210991","author":"piero","site":"shroudstory"},{"title":"Faint Images:  The Case of the Shroud of Arquata","post":"I want to better explain my thinking:\nI am not against the mass spectrometry\nin an absolute manner, but I prefer\nthe SPMs analyses (a non destructive way!).\nAm I wrong in my idea?\nSee also the other techniques:\nATR-FTIR, Raman, etc.\nATR-FTIR, Link:\nhttp://www.shimadzu.com/an/ftir/support/faq/2.html\nB.T.W. : in this International Year of Light we can try\nto deepen our discussion about the ATR-FTIR\nSee also the critical issues: “depth of penetration”\nand “calibrations” (as i previously wrote on\nthis blog we can compare “depth of penetration\ninto the sample” with “linen fibril diameter”)…\nI have just found a Workshop:\n“LIMS2015, Light, Imaging, Microscopy, Spectra of applications”\nOctober 15, 2015 – October 16, 2015  \nLink:\nhttp://www.light2015.org/Home/Event-Programme/2015/Workshop/Italy—LIMS2015.html\nUnfortunately this meeting hasn’t\nan international addressing:\n>Workshop (in Italian) related to the ENEA C.R. Frascati\nactivities and projects on light and photonic technologies,\ntheir applications and perspectives, opened to\nthe national scientific communities and to small\nand medium enterprises of Lazio regions.\n\n","date":"September 23, 2015 at 10:34 am","url":"https://shroudstory.com/2015/09/16/faint-images-the-case-of-the-shroud-of-arquata/","cat":"image_theory","id":"comment-210994","author":"piero","site":"shroudstory"}]
