[{"title":"Sciencebod and his experiments","post":"Some fibers have color while adjacent ones do not. Rogers, Adler and others have noted that the color luminosity doesn’t vary much, not by more than 2% according to micro-densitometer readings taken by Adler. But the thread’s apparent luminosity, the visual tone as we see it, varies significantly according to the concentration or pattern of color discontinuities.\nThat’s fascinating! I didn’t know about that! So the fibers in the darker parts of the Shroud image aren’t colored more darkly, or more deeply, than the fibers in the lighter parts. It’s just that colored fibers are in greater concentrations relative to uncolored fibers in the darker areas of the Shroud!\nOn the shroud, image color has formed on the back side of the cloth in the region of the hair. It is interesting to note that the image is superficial to both surfaces of the cloth and that there is no image within the many dozens of fibers that constitute the yarn.\nAnd don’t forget the much fainter image on the reverse side of the front image. Somehow it created an image on one side of the cloth, and a much fainter mirror image on the other side, but without “burning” (or whatever) the material in between.\n\n","date":"February 6, 2012 at 1:32 pm","url":"https://shroudstory.com/2012/02/06/sciencebod-and-his-experiments/","cat":"image_theory","id":"comment-7990","author":"The Deuce","site":"shroudstory"},{"title":"Sciencebod and his experiments","post":"Thanks Dan – what a (by and large) splendid post. But I’m in two minds, nay three or four, about how to respond to it. I would not be in my present dilemma (trilemma etc) if all your visitors were as measured, thoughtful and, most of all CIVIL as you are.\nAs I’ve said before –  I cannot abide ad hom in any shape or form – and no, I am not overly sensitive to  criticism – indeed I welcome it – at least on the nitty gritty science – only to snotty derisive putdowns.\nI’ll sleep on it, and maybe let you know in a day or two how I intend to address the numerous points you raise…\n\n","date":"February 6, 2012 at 1:36 pm","url":"https://shroudstory.com/2012/02/06/sciencebod-and-his-experiments/","cat":"image_theory","id":"comment-7991","author":"sciencebod","site":"shroudstory"},{"title":"Sciencebod and his experiments","post":"Bod, most of us here have been saying the same things to you for weeks now (and sometimes nicely). Point is; IT is not enough to just colour an image on to a cloth by whatever means, but that it must CONFORM to ALL the attributes we find on the Shroud….that means ‘understanding’ ALL the attributes and not just jumping in like a school kid. But you should be aware of this being a scientist,…right? So why all the comic routines? Take this amazing Shroud seriously and you won’t get scourned.\nIt actually would be nice to have someone here with the abilities/time/knowledge to ‘seriously’ put some experiments to the test….But of course with a ‘open’ and scientificly “unbiased” mind ;-)\nR\n\n","date":"February 6, 2012 at 1:54 pm","url":"https://shroudstory.com/2012/02/06/sciencebod-and-his-experiments/","cat":"image_theory","id":"comment-7994","author":"Ron","site":"shroudstory"},{"title":"Sciencebod and his experiments","post":"“Jumping in like a school kid” eh. Oh my-  you do have a delightful line in putdowns, don’t you? Fortunately I do not need your seal of approval, Ron, nor that off Paulette’s –  by which to judge my own worth as an experimentalist. The acid test is the response to one’s previous published work in the refereed scientific literature, to peer review, to citations, to conference invitations, to requests to examine PhD theses, to personal letters and emails etc. The only reason I use the internet as a medium of communication is because I have long since retired from external and precariously-funded chipping away at the coal face of science. I now have no alternative but to use the internet as a means of getting my findings and ideas into the public domain – no more, no less. Time will tell if I am right or not, but with my thoughts having crystallized these last few days,  I happen to believe I am right.\nI firmly believe the Shroud is a medieval fake – a very clever one, an interesting one too, but a fake all the same.\nI intend to put up just one more post on my own site that adds what I consider to be the last nail in the coffin, so to speak, where any “holy relic” idea of the Shroud is concerned. I will leave others to address the fine details, but for my part, the interest is in the science, i.e. in being reasonably certain that the image does not contravene any known scientific principles. The rest is arts & crafts as far as I am concerned, and “science buzz”  can get back to looking at other more important issues presently in the public domain.\nAny further communication will be on the Comments section of my own “science buzz” site. To those who mischievously suggest I am trying to steal custom from Dan’s (excellent) site, then I can only repeat – I have just one more post in the pipeline, so to speak, and thereafter anything I have to say in response to critique etc will be on the comments facility of my own site, with the ad hom blocked at source (all comments being pre-moderated). \nFarewell “Shroud of Turin blog”. I have nothing more to say here…\nColin Berry MSc PhD (Biochemistry)\nPreviously Head of Nutrition and Food Safety at the Flour Milling and Baking Research Association, Chorleywood, UK, previously  Wellcome Trust Interdisplinary-Linked Research Fellow and Honorary Lecturer at Royal Free Hospital School of Medicine, and Research Specialist, University of Pennsylvania Hospital School of Medicne.\nChief research areas: phototherapy of neonatal jaundice; membrane influences on hepatic glucuronidation of bilirubin and xenobiotics; resistant starch and dietary fibre.\n\n","date":"February 7, 2012 at 8:18 am","url":"https://shroudstory.com/2012/02/06/sciencebod-and-his-experiments/","cat":"image_theory","id":"comment-8017","author":"sciencebod","site":"shroudstory"},{"title":"Sciencebod and his experiments","post":"Link to my final post on the Turin Shroud:\n 3D imaging off thermal imprint\n\n","date":"February 7, 2012 at 9:40 am","url":"https://shroudstory.com/2012/02/06/sciencebod-and-his-experiments/","cat":"image_theory","id":"comment-8018","author":"sciencebod","site":"shroudstory"},{"title":"Sciencebod and his experiments","post":"Colin you misjudge my comment, it was not a putdown but simply an observation. You also misunderstand the true essence of the comment, which is simply; You do not respect the fact that people here take the Shroud seriously. Now for you to come on here with your, Yes, child-like experiments; offends the intelligence of most here…Now if you believe your ‘experiments’ are scientific, heck all the power to you, but remember the saying….You can fool some of the people some of the time….\nGood luck in your retirement.\nR\n\n","date":"February 7, 2012 at 4:02 pm","url":"https://shroudstory.com/2012/02/06/sciencebod-and-his-experiments/","cat":"image_theory","id":"comment-8030","author":"Ron","site":"shroudstory"},{"title":"Sciencebod and his experiments","post":"“Child-like experiments”. Yet more ad hom. Time will tell as to which of the two of us has the more mature judgement…\n\n","date":"February 7, 2012 at 6:06 pm","url":"https://shroudstory.com/2012/02/06/sciencebod-and-his-experiments/","cat":"image_theory","id":"comment-8034","author":"sciencebod","site":"shroudstory"},{"title":"Sciencebod and his experiments","post":"\nsciencebod :“Child-like experiments”. Yet more ad hom. Time will tell as to which of the two of us has the more mature judgement…\nI’m not worried, I’ve got lots of time ;-)\nR\n\n","date":"February 7, 2012 at 6:39 pm","url":"https://shroudstory.com/2012/02/06/sciencebod-and-his-experiments/","cat":"image_theory","id":"comment-8037","author":"Ron","site":"shroudstory"}]
