[{"title":"Dear Stephen E. Jones","post":"It may be, I think we can all agree, that Dan is deluding himself into denying the presence of coins over the eyes of the shroud image. Sadly, I’m afraid, I’m doing exactly the same, and I suspect so are a great many others. Vox populi is not necessarily vox die, of course, but Dan is not pursuing his obdurate course alone, by any means.\n\n","date":"May 12, 2013 at 2:24 pm","url":"https://shroudstory.com/2013/05/12/dear-stephen-e-jones/","cat":"image_theory","id":"comment-33560","author":"Hugh Farey","site":"shroudstory"},{"title":"Dear Stephen E. Jones","post":"Good blog. :-)\n\n","date":"May 12, 2013 at 2:28 pm","url":"https://shroudstory.com/2013/05/12/dear-stephen-e-jones/","cat":"image_theory","id":"comment-33562","author":"colinsberry","site":"shroudstory"},{"title":"Dear Stephen E. Jones","post":"Dan, your are right.\nI agree with Colin (surprise !!): “good blog”.\nBut looking again at the Ray Downing’s 3D Image, I ask: how is it possible ?\nToday, I visited the Cluny Museum in Paris.\nI saw many bas-relief and (small) seals from the 13-14 centuries  .\nI did not saw anything which could explain the TS image.\nThe TS image is definively unique.\n\n","date":"May 12, 2013 at 3:54 pm","url":"https://shroudstory.com/2013/05/12/dear-stephen-e-jones/","cat":"image_theory","id":"comment-33565","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Dear Stephen E. Jones","post":"Quote : “The TS image is definively unique.”\nComment :  In many ways, it’s true.  But that doesn’t mean this is a miraculous image.  For example, most of the properties of this image (including the 3D information) are roughly the same we see in images of plants and flowers caused by a Volckringer pattern effect…  So, in another way, maybe this is not an image so unique after all.\n\n","date":"May 12, 2013 at 6:06 pm","url":"https://shroudstory.com/2013/05/12/dear-stephen-e-jones/","cat":"image_theory","id":"comment-33570","author":"Yannick Clément","site":"shroudstory"},{"title":"Dear Stephen E. Jones","post":"Someone on this site a while back made an observation re the likely effect of entering a sunken feature like an eye socket into a 3D enhancement program.  It went something like this: at the deepest, most recessed part of the eye socket you have the eye itself, or eyelid, which is pale in the sepia as-is Shroud image, and is encircled by the darker ring representing the eye socket. When you work from the Enrie negative or any negative, that is reversed: you then have a dark eye, surrounded by lighter eye socket. Any 3D-enhancement program that reads image intensity, i.e. dark, as height above the xy plane is bound to elevate the eye above the surrounding eye socket. In other words,  one is bound to get a ‘protruding eye’ relative to its immediate surrounds.\nThat would hardly seem to warrant a bald statement that a real 3D ‘button’ like structure was placed on a closed eye, much less that having a size and shape matching ‘exactly’ a particular Roman-era coin means it must therefore, ipso facto, represent that coin. \nI have a holiday snapshot of a family member which appears to show a miniaturized Eifel tower growing out her head, but I happen to know, as the photographer, that she and the tower were several hundred yards apart.\n\n","date":"May 12, 2013 at 4:28 pm","url":"https://shroudstory.com/2013/05/12/dear-stephen-e-jones/","cat":"image_theory","id":"comment-33566","author":"colinsberry","site":"shroudstory"},{"title":"Dear Stephen E. Jones","post":"I believe It’s unique because of the TS image is imaged on a herringbone zigzag pattern. If the image was created on a more continuous tight uniform weave the image resolution would be sharper but the apparent edge sharpness would be lost. To me, the fact the image is on this specific weave is what makes it unique. To be honest I’m not so impressed about the 3D visual. Since the weave and the TS image both posses AM frequencies (dots) and screen angles converging onto itself, this pattern simulates the technology I use in printing for secured documents against counterfeiting. \nAs far as the Enrie photo, The photograph in question is very sharp. We don’t need to concern ourselves about the minuscule patterns that are captured in the print. If one observes very closely the first generation print of Enrie, you will see  the area of the threads that created the “so called lepton coin”.\n\n","date":"May 12, 2013 at 4:47 pm","url":"https://shroudstory.com/2013/05/12/dear-stephen-e-jones/","cat":"image_theory","id":"comment-33567","author":"Giorgio","site":"shroudstory"},{"title":"Dear Stephen E. Jones","post":"I agree with you, Colin. Good blog. Clear explanation of why there are no coin images.\n\n","date":"May 13, 2013 at 10:23 am","url":"https://shroudstory.com/2013/05/12/dear-stephen-e-jones/","cat":"image_theory","id":"comment-33598","author":"Fr. M.","site":"shroudstory"},{"title":"Dear Stephen E. Jones","post":"Plotting darkness as height seems to be the explanation as to why “buttons” appear to be over the eyes in the 3-D images. I also get the impression that the hair and beard (presumably darker than skin colours) are set forward of the face in the 3-D images maybe for a similar reason. \nThe Ray Downing image is fairly convincing that there are no coins.\nProcessing the Enrie photos with their orthochromatic film and their raking light through 5 successive generations of “enhancement” and one could see whatever one wanted. The need to remove “banding noise” is also an issue. Barrie makes the point that none of the STURP team were persuaded that there were coins. \nFor examples of leptons with lituus motif, said to be produced during governorship of Pontius Pilate go to:\nhttp://www.ancientresource.com/lots/holyland_artifacts/holy-land-biblical-coins/pontius-pilate-coins.html \nI’ve come to the view that they’re not just there on the Shroud!\n\n","date":"May 13, 2013 at 4:47 pm","url":"https://shroudstory.com/2013/05/12/dear-stephen-e-jones/","cat":"image_theory","id":"comment-33608","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Dear Stephen E. Jones","post":"“Processing the Enrie photos with their orthochromatic film and their raking light”\nNo issue there. The Pantone family that makes up the hues on the TS excluding the blood stains are almost linear to each other so all that is required is a small exposure compensation.  And the 33 degree lighting directed at each opposite corners of the TS is the correct lighting situation for museum art. Since the print that was used only captured the face area the raking wasn’t so much the issue rather the tensity of the cloth itself when photographed.   \n5 successive generations of “enhancement”\nThere’s the problem. (Resolving Power)  \nFr. Filas was mistaken if he thought by creating 5 generations he would reduce the banding making the coin more visible. His technique failed since it doesn’t  isolate banding from the rest of the image.\n\n","date":"May 13, 2013 at 11:32 pm","url":"https://shroudstory.com/2013/05/12/dear-stephen-e-jones/","cat":"image_theory","id":"comment-33631","author":"Giorgio","site":"shroudstory"},{"title":"Dear Stephen E. Jones","post":"For once I agree with Colin Berry. This myth of the coins must end.\n\n","date":"May 15, 2013 at 5:42 am","url":"https://shroudstory.com/2013/05/12/dear-stephen-e-jones/","cat":"image_theory","id":"comment-33699","author":"Paulette","site":"shroudstory"},{"title":"Dear Stephen E. Jones","post":"I think I must be seeing things   ;-)\n\n","date":"May 15, 2013 at 6:00 am","url":"https://shroudstory.com/2013/05/12/dear-stephen-e-jones/","cat":"image_theory","id":"comment-33700","author":"colinsberry","site":"shroudstory"},{"title":"Dear Stephen E. Jones","post":"A few days ago, I emailed Dan an illustrated comment entitled: coins over eyes, PART ONE: ARE ARCH-SCEPTICS THE VICTIMS OF THE ‘I THINK I SEE NOTHING BUT’ SYNDROME? and asked him to publish it.\n  Most obviously he hasn’t. Has he just trashed it because he most probably ‘thinks’ he is right on the basis of (non-initiated eye) consensus reality? The fact remains though I can prove (almost) beyond reasonable doubt there really are Pilate coin partial imprints on the TS Man’s eye areas and I will in PART TWO. Will Dan never publish it either?\n\n","date":"May 23, 2013 at 6:21 am","url":"https://shroudstory.com/2013/05/12/dear-stephen-e-jones/","cat":"image_theory","id":"comment-34424","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Dear Stephen E. Jones","post":"Max, send it again. I don’t see it. Perhaps it landed in the spam folder but I don’t see it there either. Thanks. Dan\n\n","date":"May 23, 2013 at 6:40 am","url":"https://shroudstory.com/2013/05/12/dear-stephen-e-jones/","cat":"image_theory","id":"comment-34428","author":"Dan","site":"shroudstory"},{"title":"Dear Stephen E. Jones","post":"Here my email to Dan: \n  Hi Dan,\n   By way of reply to a most unfortunate and desinformative posting of yours entitled “Dear Stephen E. Jones » (May 12, 2013) that triggered Paulette’s most vehement and blind criticism, (“The myth of the coin must end”) and a whole series of biased opinions by a few ‘gullible arch-sceptics’, please find here attached:\n “Coins over-eyes, PART ONE: \nARE ARCH-SCEPTICS THE VICTIMS\nOF THE ‘I THINK I SEE NOTHING BUT’ SYNDROME?\n  Although I don’t share Stephen Jones ‘half-blind’ arch-advocacy as far as the coin-over-eye issue is concerned, I must confess I just cannot buy into your ‘half-blind’ arch-scepticism either.\n    For the sake of good archaeology and fairness of debate, thank you therefore for publishing it in your blog.\n   All the best,\n   Max\n\n","date":"May 23, 2013 at 6:46 am","url":"https://shroudstory.com/2013/05/12/dear-stephen-e-jones/","cat":"image_theory","id":"comment-34431","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Dear Stephen E. Jones","post":"Max, \nI still don’t have it as an email with attachments. You might want to double check the email address you are using.\n\n","date":"May 23, 2013 at 9:25 am","url":"https://shroudstory.com/2013/05/12/dear-stephen-e-jones/","cat":"image_theory","id":"comment-34456","author":"Dan","site":"shroudstory"},{"title":"Dear Stephen E. Jones","post":"I think I got a PC to Mac compatibility problem…\n\n","date":"May 23, 2013 at 6:53 am","url":"https://shroudstory.com/2013/05/12/dear-stephen-e-jones/","cat":"image_theory","id":"comment-34434","author":"Max Patrick Hamon","site":"shroudstory"}]
