[{"title":"Sciencebod’s 3D Problem","post":"It may be appropriate to say that the effect of the process which created the image is 3D encoding even though we do not know the exact mechanism of image formation.\nDoes anyone know if tests were ever done with cadavers (morbid, I know) wrapped in shrouds (made like Ray Rogers had made)? I can’t find anything with regards to that. I don’t know how feasible such experiments would be but I’d be curious to see if by replicating the conditions of the burial with several specimens and examining the shrouds at different time intervals if anything might be learned.\n\n","date":"January 30, 2012 at 2:00 pm","url":"https://shroudstory.com/2012/01/30/sciencebods-3d-problem/","cat":"image_theory","id":"comment-7714","author":"Chris","site":"shroudstory"},{"title":"Sciencebod’s 3D Problem","post":"The resurrection is not a physical event, and this man is Catholic? \nThat is like saying one is Catholic, but that the Eucharist is a ham sandwich; in other words, it is an asinine statement to make.\n\n","date":"January 30, 2012 at 2:31 pm","url":"https://shroudstory.com/2012/01/30/sciencebods-3d-problem/","cat":"image_theory","id":"comment-7716","author":"Tim","site":"shroudstory"},{"title":"Sciencebod’s 3D Problem","post":"I can understand someone arguing that the 3D information in the image wasn’t created by an actual 3D body – ie, that the image was deliberately fabricated somehow to *seem* 3D by shading areas such that their hue would correspond with their depth on a real face. I don’t believe that, or think it’s even a tiny bit plausible given what we know about the Shroud, but at least it’s a logical statement. If, on the other hand, sciencebod is really trying to say that the 3D encoding is all an illusion, that it’s just pure luck that it has the appearance of depth and that plotting the depth based on hue with a computer produces such an accurate 3D image of a face, based on the fact that the burn holes produce a variation in hue as well, then he’s simply nuttier than a Snickers bar, and it’s amazing that anybody is wasting more than a single breath dismissing his idea as less than wrong.\n\n","date":"January 30, 2012 at 4:56 pm","url":"https://shroudstory.com/2012/01/30/sciencebods-3d-problem/","cat":"image_theory","id":"comment-7723","author":"The Deuce","site":"shroudstory"},{"title":"Sciencebod’s 3D Problem","post":">I am a Catholic much more in sympathy with progressive Catholic scholars like Crossan who interprets the resurrection as a statement of faith and not as a physical event in a … historic sense.\nCrossan believes that “Jesus’ body, far from being resurrected, was probably buried in a shallow grave and eaten by dogs.” That means Jesus is NOT “ascended into heaven, seated at the right hand of the Father, from where he will come to judge the living and the dead.” Crossan’s dead Jesus cannot save anyone or make intercession to the Father for their sins. According to St Paul, Crossan’s (and his ilk’s) faith is empty of content and he/they are of all men the most to be pitied (1Cor 15:14-19).\nIf this reader REALLY believes what Crossan believes (and I note that he/she does not actually state that), then he might be a Catholic (or a Baptist, or an Anglican, etc), but he/she is NOT a Christian. \nThere are people who believe the Shroud is authentic (like the late Rodney Hoare, a past Chairman of the British Society for the Turin Shroud, who even wrote books defending the Shroud’s authenticity, but who believed Jesus never died on the cross) but who are not Christians.\nThat is OK in Sindonology (“the scientific study of the Shroud of Turin“) but it is NOT OK in Christianity. There are Christians who don’t believe the Shroud is authentic (I was one for nearly 40 years), who are my brothers and sisters in Christ. There are non-Christians (like Barrie Schwortz-owner of Shroud.com) who are my brothers and sisters in the Shroud. But the two brotherhoods are NOT the same. And the brotherhood in Christ is INFINITELY more important than the brotherhood in the Shroud.\n\n","date":"January 30, 2012 at 8:05 pm","url":"https://shroudstory.com/2012/01/30/sciencebods-3d-problem/","cat":"image_theory","id":"comment-7728","author":"Stephen E. Jones","site":"shroudstory"},{"title":"Sciencebod’s 3D Problem","post":">”You can’t prove it,” he wrote back. “It could be pure coincidence and you don’t know for a fact that it isn’t. What is the threshold for perceiving an image? What are the criteria for saying that the image is of a man? Are you an expert on the human face?” .\nOn that basis it would be impossible to decide whether “the Face on Mars” was a representation of a real alien face, or just a rock formation that by coincidence happens to look like a human face.\nThe test, as Dan said, is in the level of detail. The Face on Mars only LOOKED like a face at a low level of resolution and from a certain angle in a 1976 Viking 1 photograph. It was later shown by NASA in 1998, when its Mars Global Surveyor “snapped a picture ten times sharper than the original Viking photos … the image first appeared on a JPL web site, revealing [the Face on Mars to be] a natural landform.” \nSo a fake only gets more and more unlike the real thing as the level of detailed scrutiny increases. The Shroud, on the other hand, has only become more and more like the real thing, as the level of scrutiny has increased. Members of the 1978 Shroud of Turin Research Project (STURP), like the late Ray Rogers and Barrie Schwortz, were confident that it would only take a short time of their detailed scientific scrutiny, for them to detect that the Shroud was a fake. Yet that that did not happen. After 5 days of the most intensive scientific scrutiny, none of the STURP team, were able to conclude that the Shroud was a fake. \nAnd today, a third of a century later, the Shroud continues to only look more and more like the real thing, the very burial sheet of Jesus, bearing the imprint of His crucified, dead, and resurrected body, and less and less like a fake.\nThe only reasonable (and consistent if one believes the Face on Mars is just a rock formation) conclusion, is that the the Shroud is NOT a fake, but is in fact JESUS’ and its image is “a literal `snapshot’ of the Resurrection” (Wilson, I., “The Turin Shroud,” 1978, p.210).\n\n","date":"January 30, 2012 at 8:55 pm","url":"https://shroudstory.com/2012/01/30/sciencebods-3d-problem/","cat":"image_theory","id":"comment-7730","author":"Stephen E. Jones","site":"shroudstory"}]
