[{"title":"Corona Discharge for Shroud of Turin to be presented at COMSOL Europe","post":"I think there is a long way between electrostatic fields of 49 V/m and the electrostatic field needed for a corona discharge. Certainly, no corona discharge could be obtained with a such a small voltage difference.\nHowever, I think Fanti is chosing -at least in this occasion- the right path to proof his hypothesis. Scientific work with state-of-the-art tools like COMSOL and presentation at a Conference…….\nAT this point, I say the same that with the work by Di Lazzaro et al. Let them work and let’s evaluate where they reach. Their works -like that by Rogers or any other- must go through criticism and scrutinization by the scientifc community. They still have a long way ahead.\n\n","date":"September 4, 2012 at 2:12 pm","url":"https://shroudstory.com/2012/09/04/corona-discharge-for-shroud-of-turin-to-be-presented-at-comsol-europe/","cat":"image_theory","id":"comment-15846","author":"Gabriel","site":"shroudstory"},{"title":"Corona Discharge for Shroud of Turin to be presented at COMSOL Europe","post":"Well said Gabriel! I think it prudent that everyone keep an open mind to all studies being done, or all hypothesis raised, whether it be to your liking or not. As if one looks at the history of scientific study, one cannot forget ‘most’ important of findings have been found whilst looking for something quite different. Personally, although I have strong convictions to the causation of the image, I can honestly say I still try to keep an open mind to all possible scenarios. Also as I find the whole study fascinating.\nR\n\n","date":"September 4, 2012 at 3:07 pm","url":"https://shroudstory.com/2012/09/04/corona-discharge-for-shroud-of-turin-to-be-presented-at-comsol-europe/","cat":"image_theory","id":"comment-15849","author":"Ron","site":"shroudstory"},{"title":"Corona Discharge for Shroud of Turin to be presented at COMSOL Europe","post":"And that open mind should include colin berry’s decent scorch theory\n\n","date":"September 5, 2012 at 5:55 am","url":"https://shroudstory.com/2012/09/04/corona-discharge-for-shroud-of-turin-to-be-presented-at-comsol-europe/","cat":"image_theory","id":"comment-15870","author":"matthias","site":"shroudstory"},{"title":"Corona Discharge for Shroud of Turin to be presented at COMSOL Europe","post":"I concur with both Gabriel’s and Ron’s comments.  While Chemistry issues have been extensively investigated, notably by Ray Rogers, and those who came after him, relatively few investigations have harnessed the discipline of Physics.  I personally find it intriguing that “ionisation induced by radon …”  is mentioned.  This would seem to relate to Giovanna de Liso’s paper;  she spent 12 years investigating seismic effects in her home region of Piedmont, and produced some persuasive (to me) images as a result.\n\n","date":"September 4, 2012 at 4:56 pm","url":"https://shroudstory.com/2012/09/04/corona-discharge-for-shroud-of-turin-to-be-presented-at-comsol-europe/","cat":"image_theory","id":"comment-15852","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Corona Discharge for Shroud of Turin to be presented at COMSOL Europe","post":"\nmatthias :And that open mind should include colin berry’s decent scorch theory\nI approached Colin’s scorch theory with an open mind! But I don’t think his attempt was very scientific, especially since he never showed any proper results. As I believe I commented back then; “anyone can scorch a linen cloth, but doing so AND replicating the exact attributes of the image we find on the Shroud is two different things”. Colin never produced results at all, except some scorched images on cloth.\nR\n\n","date":"September 5, 2012 at 6:45 am","url":"https://shroudstory.com/2012/09/04/corona-discharge-for-shroud-of-turin-to-be-presented-at-comsol-europe/","cat":"image_theory","id":"comment-15873","author":"Ron","site":"shroudstory"},{"title":"Corona Discharge for Shroud of Turin to be presented at COMSOL Europe","post":"Yes, I am certainly not convinced of Berry’s view, the theory is certainly interesting but as you say replication of the shroud is another story. He also proposes some rather weird theories at times too which IMHO undermines his credibility. Nevertheless the scorch theory has its place and I For one wouldn’t rule it out.\n\n","date":"September 5, 2012 at 7:22 am","url":"https://shroudstory.com/2012/09/04/corona-discharge-for-shroud-of-turin-to-be-presented-at-comsol-europe/","cat":"image_theory","id":"comment-15875","author":"matthias","site":"shroudstory"},{"title":"Corona Discharge for Shroud of Turin to be presented at COMSOL Europe","post":"Well the fact that STURP scientists have ‘concluded’, quite unanimously, the image was not a scorch and many attempts over the years at producing the superficial image properties by scorching have all failed should also be kept in mind.\nR\n\n","date":"September 8, 2012 at 9:45 pm","url":"https://shroudstory.com/2012/09/04/corona-discharge-for-shroud-of-turin-to-be-presented-at-comsol-europe/","cat":"image_theory","id":"comment-16030","author":"Ron","site":"shroudstory"}]
