[{"title":"Scorched by God? A Hymn for this Sunday.","post":"“You can shovel up a pile of dirt but not show how a mountain was made.”\nActually, you can. There are convection currents in the Earth’s mantle which on reaching the solidified surface crust produce fissures, then magma infill, then seafloor spreading, which in turns drives plate tectonics. That then accounts for continental drift, collision between oceanic and continental plates, subduction at plate boundaries, fold and mountain formation, and much else besides.  All those ‘natural disasters’  used to be ascribed to acts of God (earthquakes, volcanoes etc) and they still are in some parts of the world, leading to witch-hunts for supposed offenders against the Almighty.\nSo what drives the convection currents? It’s thought to be the heat produced from the decay of heavy radioactive isotopes concentrated by gravity at the Earth’s core.\nScience beats obscurantist mumbo jumbo any day (while still leaving room for those mysterious religious experiences).\n\n","date":"August 17, 2014 at 10:42 am","url":"https://shroudstory.com/2014/08/17/scorched-by-god-a-hymn-for-this-sunday/","cat":"image_theory","id":"comment-144372","author":"Colin Berry","site":"shroudstory"},{"title":"Scorched by God? A Hymn for this Sunday.","post":"Colin, I think Cowper reflected the general view at a time when Archbishop Ussher’s calculations on the date of the Creation of the World held sway.  Nevertheless, Cowper postdates Niklaus Steno 1638-1686. \nAs a break from your experimental work, and if you haven’t already done so, I suggest you might read and enjoy “The Seashell on the Mountaintop”; by Alan Cutler; Heinemann London 2003; Science biography: 228 pages. Story of Nicolaus Steno, Danish scientist 1638 ~ 25-Nov-1686; beatified 23-Oct-1988.  Anatomist, founder of geology; Main work De Solido (stratigraphy).  I’ve commented on Steno’s work previously.  Steno’s theories found considerable antagonism from the scientific establishment of his time.  The only support for his views were from Gottfried Leibnitz, and the Catholic Curch was also sympathetic.  The best line in the book in my view is at the end: “”The summit of Mount Everest is marine limestone.” \nDisillusioned by the back-biting and rivalries among scientists, Steno abandoned science and turned to religion and was appointed as the Pope’s envoy to Germany and Scandinavia.  Pope John Paul II beatified him in 1992, somewhat ironically on October 23 the same date that Archbishop Ussher had set for the creation of the world.\n\n","date":"August 17, 2014 at 5:08 pm","url":"https://shroudstory.com/2014/08/17/scorched-by-god-a-hymn-for-this-sunday/","cat":"image_theory","id":"comment-144400","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Scorched by God? A Hymn for this Sunday.","post":"Er, forgive my asking, but what possible link can there be between a 17th century Danish scientist and fossil-containing limestone at the top of Mt. Everest?  Did Steno predict that fossils would be found at the top of the world’s highest mountain? I doubt it somehow.\nIn any case, I’m not sure why you have introduced Steno or any other individual scientist, into the discussion, whether Catholic, Jewish or Protestant. So Steno’s unconventional ideas, now regarded as fact, were initially accepted by some but not others. What’s so unusual about that? Or are we supposed to attach some significance to your mention of the Catholic Church (and Liebnitz) being “sympathetic”. Is your thesis that the Catholic Church can be relied upon to have sounder instincts than others in matters to do with ground-breaking science? If so, we seem to be straying off the point, namely that folk who challenge those they label as ‘godless’ to explain this or that natural phenomenon all too often have not taken the trouble to acquaint themselves with progress to date, whether by Catholic or non-Catholic scientists. \nAnyone who thinks that mountain-building remains a total mystery cannot have heard of plate tectonic theory.  Instead of scoring points against science he is simply advertising his apparent ignorance of one of the triumphs of 20th century science (while recognizing that geology and stratigraphy have a much longer history).\n\n","date":"August 17, 2014 at 6:59 pm","url":"https://shroudstory.com/2014/08/17/scorched-by-god-a-hymn-for-this-sunday/","cat":"image_theory","id":"comment-144420","author":"Colin Berry","site":"shroudstory"},{"title":"Scorched by God? A Hymn for this Sunday.","post":"As I understood it, your thesis was that science beats religion every time for getting to the facts of actuality.  That was not the case with Steno’s work.  Opposition to his ideas came not from the religious establishment but from contemporary men of science.  Steno was Danish with a Lutheran background. \nHis early training was as an anatomist, and he contributed major discoveries in that field including the discovery of the parotid salivary duct.  In 1665 he went to Florence, where he was appointed physician to the grand duke Ferdinand II.  He travelled extensively in Italy and had his first opportunity to observe the layered geology of limestone there.   \nHis seminal work on geology “De Solido …” is a pioneering milestone in the literature of geology, and laid the foundations for crystallography.  In addition he proposed the revolutionary idea that fossils are the remains of ancient living organisms and that many rocks are the result of sedimentation.\nSteno was the first to realize that the Earth’s crust contains a chronological history of geologic events and that the history may be deciphered by careful study of the strata and fossils. He rejected the idea that mountains grow like trees, proposing instead that they are formed by alterations of the Earth’s crust. Steno put forth still another idea—that layered rocks were likely to be deposited horizontally. Therefore, even though the strata of Tuscany were (and still are) displayed in anything but simple geometries, Steno’s elucidation of these fundamental principles relating to the formation of stratified rock made it possible to work out not only superpositional relationships within rock sequences but also the relative age of each layer. \nThe prevalent idea among eminent men of science, was the view that these fossil shells grew in the rocks, or that they were relics from Noah’s flood, certainly well into the 18th century – and their insistence that the world was only 6000 years old.  \nWhat Galileo did to Aristotle’s Physics, Steno did to Galen’s Anatomy, theories we find peculiar today.  Coming from the featureless landscape of Denmark, he became fascinated with the petrified shells in the mountains of Florence and the Swiss Alps.  His “De Solido” outlines his theories of stratigraphy; He had promised a more comprehensive work but this does not seemed to have happened.  \nMy point is that the case of Steno is a classic instance where men of science exposed to a revolutionary idea, can themselves obstruct the propagation of truth by adherence to old fixed dogma, that this appears to be a human failing, and is certainly not an exclusive failing of religious adherents.  The back-biting within science is what drove Steno away from it, and to adopt an almost eremetical lifestyle.  What else might he have achieved, had he found the scientific environment rather more open-minded and sympathetic to his ideas?\n\n","date":"August 17, 2014 at 8:29 pm","url":"https://shroudstory.com/2014/08/17/scorched-by-god-a-hymn-for-this-sunday/","cat":"image_theory","id":"comment-144435","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Scorched by God? A Hymn for this Sunday.","post":"Another scenario.\n“The atheistic scientist declares to God that he can make a man and allows God to go first in the demonstration. \nGod scoops up a handful of dirt and in a few minutes produces a perfect human being. \nThe scientist then scoops up a handful of dirt, but God interrupts him: “Get your own dirt.”\nhttp://www.partialobserver.com/article.cfm?id=2808\n\n","date":"August 17, 2014 at 5:28 pm","url":"https://shroudstory.com/2014/08/17/scorched-by-god-a-hymn-for-this-sunday/","cat":"image_theory","id":"comment-144408","author":"Angel","site":"shroudstory"},{"title":"Scorched by God? A Hymn for this Sunday.","post":"“As I understood it, your thesis was that science beats religion every time for getting to the facts of actuality.”\nNope. That wasn’t what I said, daveB. It wasn’t religion I was criticizing. It was the obscurantist mumbo jumbo employed by those who attempt to belittle science by resorting to the tedious God of the gaps argument.  My prime target was “reader”, who seems to think that science has been unable to account for mountain building. My reference to ‘obscurantist mumbo jumbo’ was directed partly at “reader” but also at the sentiments expressed in the quoted “God moves in a mysterious way” extract (broadly speaking correct) but  attempting to sneak-in the child-friendly sentiments of  “All Things Bright and Beautiful” (a hugely one-sided representation of the natural world if ever there was, given earthquakes, volcanoes, hurricanes, Ebola etc etc). In no way was my comment addressed to religion in general. \nI hope you’ll forgive my saying that you do tend on occasions  to read into my comments more than is actually there, and then proceed to dazzle us with your erudition and scholarship in disposing of the ‘fallacious’ arguments. The internet lingo for that is  “setting up a straw man”. I am not anti-religion. I am anti the phoney science that is used either to promote religion or to belittle science (i.e a single OR twin agenda).\n What makes the TS so potent a symbol is that the TWIN agenda does indeed appear to be operating. The scales fell from my eyes when reading the email correspondence between Paolo Di Lazzaro and Tom Chivers back in December 2012, with the first of those prefacing his remarks with “speaking as a scientist” and then proceeding to drive a coach and horses through all the precepts of science I learned at school and University. \nAny charitable doubts I may have had re our friend Paolo were dispelled when he came onto this site to relate his “clincher” hot coin experiment, which he accompanied with a woefully naive lecture on radiation physics, one that displayed a total blind spot for the First Law of Photochemistry (“no nett absorption, no chemical reaction”) and then went on to imply that microscopic complexity requires divine intervention. (Does God have to be in attendance each time it  snows?)  You just can’t get the physicists these days (i.e. ones prepared to learn a little chemistry, about spontaneous molecular self-organization that results in microscopic complexity). \nOne cannot begin to understand the natural word, far less induced man-made physical or chemical changes, if one has no understanding of molecular self-organization that needs no divine entity in constant attendance. Spontaneous change with isolated pockets  of organization at both microscopic and macroscopic levels is what links the TS image with mountain building. Those here with a little scientific background will now that is free energy, a composite of enthalpy and entropy terms with a crucial temperature factor that is the driving force for thermodynamically-feasible processes, with an additional temperature factor being needed in the real world as a kinetic kick start (the Arrhenius ‘energy of activation’). \nAnybody wishing to research the TS image would be well advised to brush up on both  chemical thermodynamics and kinetics before going to press with their first press release (or pdf). BOTH  are needed if one’s to understand why some reactions are easier to initiate than others, but also why some, once started  are runaway, while OTHERS ARE NOT, usually as a consequence of an absorption or dissipation of thermal energy.\nBoth scorching of linen and mountain building are heat-driven processes. Both are self-limiting, due to absorption or dissipation of that vital input of heat and, more importantly, the associated temperature change. But then I’m sure I don’t need to tell an engineer the difference between heat (an extensive property) and temperature (an intensive one), risking the charge of having set up a straw man argument. Wouldn’t want to do that now, would we?\n\n","date":"August 18, 2014 at 2:52 am","url":"https://shroudstory.com/2014/08/17/scorched-by-god-a-hymn-for-this-sunday/","cat":"image_theory","id":"comment-144494","author":"Colin Berry","site":"shroudstory"},{"title":"Scorched by God? A Hymn for this Sunday.","post":"There have been a few comments recently expressing sentiments similar to the “God works in mysterious ways” hymn above which I think confuse two interpretations of science. The debate is not whether mankind can explain everything, or even whether it ever will be able to, but whether everything is intrinsically rational or not.\nThe ‘reader’ above, saying “There are limits to what science can know and explain,” does not say whether these limits are pragmatic or intrinsic. If the first, then he is perfectly correct: irrecoverability of data, lack of resources, even sheer intellectual complexity may all be insurmountable obstacles to our ability to “know and explain” something. But is the second, thenI couldn’t disagree more. The universe and all that it contains are intrinsically rational, and there are no limits to its explicability. If God scorched his ‘bright design’ onto a piece of cloth, he did it within his own laws, and if we work on it enough, we will be able to find out how.\n\n","date":"August 18, 2014 at 3:46 am","url":"https://shroudstory.com/2014/08/17/scorched-by-god-a-hymn-for-this-sunday/","cat":"image_theory","id":"comment-144499","author":"Hugh Farey","site":"shroudstory"},{"title":"Scorched by God? A Hymn for this Sunday.","post":"Hugh your exceedingly interesting and fascinating idea as to whether the limits of scientific knowledge are merely pragmatic or intrinsic has I believe the potential to generate an extremely learned debate which could go on ad infinitum with no end at all in sight.  Even the assertion as to whether the universe is rational or not, say in the light of quantum physics, may not be accepted by otherwise rational persons.  In their fascinating text “The Mathematical Experience” authors Davis & Hersh present mathematical examples of how whether one starts with chaos or order, models can still be constructed of how it is still possible to generate chaos or order out of either.\nRef: “The Mathematical Experience” by Philip J Davis, Ruben Hersch, Pengion 1981, ch 4, Inner Issues; Pattern, Order, and Chaos, p. 172-179.\n\n","date":"August 18, 2014 at 4:27 am","url":"https://shroudstory.com/2014/08/17/scorched-by-god-a-hymn-for-this-sunday/","cat":"image_theory","id":"comment-144502","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Scorched by God? A Hymn for this Sunday.","post":"Hi Hugh,\n               I have been reading your comments and views concerning the shroud of Turin since two or three years and my personal feeling is that the only thing that refrains you from calling “shroudies” theories and reasoning  inept is that in the first place  you actually believe in Jesus’ resurrection, and this “point de depart” makes you put water in the wine.\n\n","date":"August 19, 2014 at 3:31 am","url":"https://shroudstory.com/2014/08/17/scorched-by-god-a-hymn-for-this-sunday/","cat":"image_theory","id":"comment-144689","author":"PHPL","site":"shroudstory"},{"title":"Scorched by God? A Hymn for this Sunday.","post":"Hugh Farey:\n“The universe and all that it contains are intrinsically rational, and there are no limits to its explicability. If God scorched his ‘bright design’ onto a piece of cloth, he did it within his own laws, and if we work on it enough, we will be able to find out how.”\nPHPL:\n“you [Hugh] actually believe in Jesus’ resurrection.”\nI guess this is a limit to explicability.\n\n","date":"August 19, 2014 at 5:24 am","url":"https://shroudstory.com/2014/08/17/scorched-by-god-a-hymn-for-this-sunday/","cat":"image_theory","id":"comment-144707","author":"anoxie","site":"shroudstory"},{"title":"Scorched by God? A Hymn for this Sunday.","post":"No doubt some reasoning is inept (blinded by confirmation bias for example) but some of the reasoning I’ve seen on display here is anything but inept. Doesn’t mean it’s accurate (we can’t know for sure) but it’s not inept.\nAs for believing in Jesus resurrection – greater minds than you and I have believed in it so I don’t think taking it under consideration (vis a vis the Shroud) is watering the wine. More like sniffing the cork.\n\n","date":"August 19, 2014 at 9:27 am","url":"https://shroudstory.com/2014/08/17/scorched-by-god-a-hymn-for-this-sunday/","cat":"image_theory","id":"comment-144748","author":"David Goulet","site":"shroudstory"}]
