[{"title":"First Annual Bertrand Russell Award in Sindonology","post":"“… this strange hybrid method, through which a literary genre convinces itself it is a science..”\nBertrand Russell had his faults, a somewhat simplistic brand of philosophy being one of them, but to debunk his interest and analysis of JFK’s assassination, where probably a minority  to this day believe Lee Harvey Oswald acted alone – has to be one of the most bizarre and mindless pieces of journalism I have read in a long time.\nI would also suggest folk here read Mario Latendresse’s introduction to those curiously symmetrical  sedillis marks on the “butts”. \nhttp://www.sindonology.org/papers/bloodMarksButts.shtml\n They should then ask who is pushing the agenda, which while not a full blown conspiracy theory displays arguably some of its elements, like an attempt to demonize those who question what to them is received wisdom (or in the case of the Shroud, holy writ despite being curiously overlooked in the New Testament account of events between the crucifixion and resurrection).\nFolk may also notice that I did not attack Mario for expressing his opinion, despite disliking the partisan introduction. I addressed the facts regarding those markings, and proposed an alternative explanation for those who, like myself, had never even heard of those sedillis. and doubt whether they were precisely as described by Mario anyway.\nIt’s disappointing to say the least that my proposals are not being judged on their practical merits or otherwise, but are being summarily written off as another “a strange hybrid method”, and placed alongside an equally grotesque description of Russell’s analytical approach to the events of ’63. It is lesser men and women, aping Russell’s style, who created the conspiracy theory industry, mainly in the USA I hasten to add,  in which every tiny detail, significant or otherwise, is mustered to assemble a damning  indictment. Whilst not having read Russell’s thesis, I strongly suspect there was anything there that was trivia dressed up as crucial evidence. \nAnd why the reference to science? Russell was not a scientist, and never to the best of my knowledge claimed to be one.  He was a philosopher, logician, mathematician, historian, social activist and lots of other things besides. So why the crass reference to a hybrid of “science and literary genre”.  Is that code for an atheist who expressed himself well?  Is he seen in some quarters as an early prototype for the demonic Richard Dawkins, also an atheist who expresses himself well.  Oooh look, they are both Brits !!!!!   That means we can say what we really think (in code of course).  Can no one Stateside especially (though not exclusively) be bothered to do their homework these days before writing that kind of manure about them Godless Brits – or giving it an airing here as yet another snide putdown, same old, same old. Give it a rest Dan Porter. I can’t see you winning much in the way of kudos any way with this style of feline blogging, even among the ardent of authenticists here, whom I suspect  prefer dossiers to your corrosive drip drip of carefully-crafted put downs.. \nBut I will make lots of allowances for Mark Latendresse. His Shroud Scope continues as a magnificent resource for those of us interested purely in the detail of what’s there. How strange it gets so little mention here on this site. Did it not get the Barrie $chwortz. seal of approval?  Is the blood not red enough? How many folk here can truthfully say they had spotted those markings for themselves before reading Mario’s views?\n\n","date":"November 22, 2013 at 8:40 pm","url":"https://shroudstory.com/2013/11/22/first-annual-bertrand-russell-award-in-sindonology/","cat":"image_theory","id":"comment-52456","author":"colinsberry","site":"shroudstory"},{"title":"First Annual Bertrand Russell Award in Sindonology","post":"I actually took Dan’s poke as a backhanded compliment with a bit of wink,wink nudge,nudge. A good conspiracy theory (one that has real plausibility) is something to be savored. Mysteries are good for the soul. So come on dear friends,once more into the breach!\n\n","date":"November 22, 2013 at 9:12 pm","url":"https://shroudstory.com/2013/11/22/first-annual-bertrand-russell-award-in-sindonology/","cat":"image_theory","id":"comment-52458","author":"David Goulet","site":"shroudstory"},{"title":"First Annual Bertrand Russell Award in Sindonology","post":"Colin, you wrote\n“Folk may also notice that I did not attack Mario for expressing his opinion, despite disliking the partisan introduction. I addressed the facts regarding those markings, and proposed an alternative explanation for those who, like myself, had never even heard of those sedillis. and doubt whether they were precisely as described by Mario anyway.”\n1) Indeed you may dislike the introduction of that Web page (http://www.sindonology.org/papers/bloodMarksButts.shtml) which is in favor of the authenticity of the Shroud. Certainly, simply stating your dislike is no harm, but it would simply mean that you do not consider the Shroud authentic. In which case you can simply state that you do not believe, even as a possibility, that the Shroud might be authentic. I certainly find no harm in that, but it would also be an extreme position.\n2) You wrote “like myself, had never even heard of those sedillis”. \nI am surprised. This is a common statement made by many writers of the time of Jesus and over many centuries. In fact, it is most likely that there was a sedillis on Jesus’s cross because Seneca, who is a contemporary of Jesus, describes the crucifixion (in general) and insists on the presence of the sedillis. Sedillis had many different forms, but is likely sharp, and more specifically described by Seneca as a “sharp pointed cross”. This might simply be a three-point prongs as we see the effect on the Shroud. Granted, there will be two of these on Jesus’s cross.\nIf the Shroud is authentic, these three stains we see on both butts appear to be caused by such sedillis. It is the most likely reason corresponding to historical facts.\nif the Shroud is not authentic, made by a forger, he/she happens to have created the most resembling wounds for such a sedillis. A coincidence?\n3) You wrote “and doubt whether they were precisely as described by Mario anyway”. What are the doubts? The sedillis is described variously as a sharp seat, a horn, etc., and as “sharp pointed cross” by Seneca (again a contemporary of Jesus). You consider that the literature on the subject does not support the possibility of a sedillis as a “sharp pointed cross”? Any references?\n\n","date":"November 23, 2013 at 8:05 pm","url":"https://shroudstory.com/2013/11/22/first-annual-bertrand-russell-award-in-sindonology/","cat":"image_theory","id":"comment-52576","author":"Mario Latendresse","site":"shroudstory"},{"title":"First Annual Bertrand Russell Award in Sindonology","post":"Wherever one sees blood trails on the Shroud, there is a biblically-correct presumption as to the location of a wound (poorly imaged, if at all) whence the blood emanated. Trails on the head and hair – from the crown of thorns. Trails of the forearms – from the nail wound in the hand or wrist. Trail in the side – from the lance wound. Now turn that around and one can say that wherever there’s a wound site, visible or otherwise, there’s a blood trail.\nBut that’s not the case where your sedillis is concerned. There is NO blood trail, merely a reddish or brown circle that may or may not be blood (Yannick thinks they are burns, not blood, judging he says by colour). You are on somewhat weak ground if you can’t say for certain there is blood making those 6 markings visible, but would  still to have to explain why they differ from all other “puncture” wounds in not producing a trail of blood.\nBelieving as I do in the radiocarbon dating (there will have to be re-dating to make me think otherwise) I feel entitled to look for entirely different explanations for those sedillis, and NO, it is not crazy thinking. It is logical, rational and scientific thinking.  Having ridicule heaped on me (by others) for seeking out non-crucifixion scenarios won’t deflect me from my self-imposed task to get to the truth.\n\n","date":"November 24, 2013 at 3:52 am","url":"https://shroudstory.com/2013/11/22/first-annual-bertrand-russell-award-in-sindonology/","cat":"image_theory","id":"comment-52627","author":"colinsberry","site":"shroudstory"},{"title":"First Annual Bertrand Russell Award in Sindonology","post":"Actually Colin, the analogy between the JFK assassination and the Shroud, is the manner in which the mainstream press attacked, and still attack, those who believe that LHO was not a lone gunmen. The fact is that the Shroud is continually debunked by reference to the carbon 14 teats which have considerably less credibility  than the magic bullet theory.\nThe US media and government circles can not cope with the fact that a conspiracy was involved in JFK’s murder (and the conspirators nearly got what they wanted, an invasion of Cuba, I believe) Johnson frustrated them on that,\nJohnson resisted the hawks about Cuba but he gave them Vietnam. The order to begin planning pulling out of Vietnam had already been drafted for Kennedy’s signature\nThere are two possibly apocryphal quotations.\nLBJ, the “peace” candidate in 1964: “I’ll give them their damn war, but first I have to be elected.”\nJCK a month before the assassination: “I’ll pull out of Vietnam, but first I have to get elected.”(I  “JFK and the Unspeakable”\n20 years ago I did a lengthy Op-Ed for Newsday which was picked-up by the Washington Post news wire. I was optimistic hat the collapse of the Warren Commission story would pave the way for a hard look at the assassination. I was wrong.\nhttp://www.johnklotz.com/new-jfk.htm\n\n","date":"November 23, 2013 at 12:36 am","url":"https://shroudstory.com/2013/11/22/first-annual-bertrand-russell-award-in-sindonology/","cat":"image_theory","id":"comment-52470","author":"John Klotz","site":"shroudstory"},{"title":"First Annual Bertrand Russell Award in Sindonology","post":"Russell at least wrote in clear terms and was frank. What is the point in reading philosophers who make their writings difficult to understand, with interpreters breaking their heads trying to understand what they meant. No wonder philosophy is said to be heading towards nihilism.\n\n","date":"November 23, 2013 at 7:04 pm","url":"https://shroudstory.com/2013/11/22/first-annual-bertrand-russell-award-in-sindonology/","cat":"image_theory","id":"comment-52569","author":"Louis","site":"shroudstory"},{"title":"First Annual Bertrand Russell Award in Sindonology","post":"Pierre Barbet, “Doctor at Calvary”, pp 42-43, thought the sedile unlikely in the case of Jesus. He refers to the same Seneca quotations and also draws on Justin, Irenaeus and Tertullian. The sole purpose of the sedile was to prolong the death agony, and it was extra work for the carpenters to provide it. It is seldom shown in crucifixion art work, but that of course can be discounted as not significant. The gospel accounts all have Jesus dying within three hours of being crucufied, and Pilate expressed surprise that he had died so soon. This would argue against the use of the sedile. I suggest another explanation needs to be sought for the buttock marks. The idea of a spike to discourage sitting might have merit, and might account for the rapid death.\n\n","date":"November 23, 2013 at 9:34 pm","url":"https://shroudstory.com/2013/11/22/first-annual-bertrand-russell-award-in-sindonology/","cat":"image_theory","id":"comment-52582","author":"daveb of wellington nz","site":"shroudstory"},{"title":"First Annual Bertrand Russell Award in Sindonology","post":"Daveb wrote \n“Pierre Barbet, “Doctor at Calvary”, pp 42-43, thought the sedile unlikely in the case of Jesus. He refers to the same Seneca quotations and also draws on Justin, Irenaeus and Tertullian. The sole purpose of the sedile was to prolong the death agony, and it was extra work for the carpenters to provide it.” \nSeneca describes the sedile as an added humiliation not as a mean to prolong death, so the sedile’s purpose was not “solely” (your word) to prolong death. Did it indeed prolong death? As far as know, no contemporary of crucifixion practices described it for that purpose. This appears unlikely if the sedile creates even more pain and no respite can be obtained from it.\nYou wrote “The gospel accounts all have Jesus dying within three hours of being crucufied, and Pilate expressed surprise that he had died so soon. This would argue against the use of the sedile”\nThe opposite conclusion is reached if we assume that a sedile prolongs death. Pilate was surprised because he expected Jesus’s to live (suffer) longer. Not having a sedile would have shortened his life (according to your supposition) therefore it is more likely that Jesus’s cross had a sedile (again supposing that it prolongs life).\n\n","date":"November 23, 2013 at 10:53 pm","url":"https://shroudstory.com/2013/11/22/first-annual-bertrand-russell-award-in-sindonology/","cat":"image_theory","id":"comment-52596","author":"latendre","site":"shroudstory"},{"title":"First Annual Bertrand Russell Award in Sindonology","post":"Correction: Last paragraph, first sentence, “… if we assume that a sedile prolongs life” (not death!).\n\n","date":"November 23, 2013 at 10:58 pm","url":"https://shroudstory.com/2013/11/22/first-annual-bertrand-russell-award-in-sindonology/","cat":"image_theory","id":"comment-52598","author":"latendre","site":"shroudstory"},{"title":"First Annual Bertrand Russell Award in Sindonology","post":"Colin, another interesting theory re: the butt marks, but on one of the butts the two circles seem rather too close to the edge of the butt to suggest they are the product of bolts (ie. one would expect them to be more centred)\n\n","date":"November 24, 2013 at 5:20 am","url":"https://shroudstory.com/2013/11/22/first-annual-bertrand-russell-award-in-sindonology/","cat":"image_theory","id":"comment-52631","author":"Matthias","site":"shroudstory"},{"title":"First Annual Bertrand Russell Award in Sindonology","post":"“…remember that for awhile Colin was championing something to do with Jacques de Molay, the last Grand Master of the Knights Templar. Now it is a remodeled crucifix: “\nThat’s presumably an attempt to portray me as some kind of butterfly, deserting one fancy and going to another. If Dan Porter had taken the trouble to read what I have proposed regarding the de Molay he would realize that the re-modelled crucifix makes a crucial link between de Molay’s initial torture by crucifixion and his final execution by slow-roasting over charcoal  and to a specially commissioned  memorial Shroud in the form of a Christ-like thermal imprint..\nBut there’s a bigger issue at stake here, namely that I have been drip-feeding detailed scientific proposals to this site for some weeks now, making points that no one before has made, and what do I get for my trouble? I get an invidious comparison with Bertrand Russell, who was himself also being hung out to dry in the US press by a journalist with the intellect of a tadpole.\nWhat we see here in truth is yet another of those carefully-crafted sneers from the site’s host, attempting to diminish my SCIENCE, indeed, by linking it to the smear on Russell, by attempting to portray as just so much  verbiage posturing as science. Those who think I have judged Dan Porter too harshly should look at the dumb conclusion from that dud journalist to which he has given pride of place:\n“…this strange hybrid method, through which a literary genre convinces itself it is a science.”\nI hold no special brief for Russell, neither his brand of philosophy nor his politics, but I can tell you this. If that statement above had appeared in a UK newspaper, i would be seriously considered a formal letter to our Press Complaints Commission, stating that it totally misrepresented and defamed the memory of one of Britain’s most able thinkers (and that’s without the ludicrous claim that Russell was the father of modern-day conspiracy theories – quite the most repugnant and pig-ignorant journalism I’ve encountered in quite a while. . ). Yet the site’s host takes that as his text, so to speak, basically to mock my science by proxy – and others here say it’s just good humour.\nOh no it’s not. i recognize a genteel smear campaign when I see one, and what we see above is just one of a long stream of Mr.Porter’s postings in which I have become featured in this manner as someone out of his depth, an amateur, a wild fantasist.\nI am none of those things. I am a deadly serious scientist with time on his hands determined to expose the pseudo-science that is used to promote Shroud authenticity (Barrie Schwortz’s pitch on red blood and bilirubin being a recent case in point).\nIt’s time to remove the gloves. All further comment will be on my own site, not here. Please don’t address remarks to me here and expect a reply . \nMy first task will be to assemble the comments I have placed here these last few months  into a single archive – so that folk will quickly see that I am not the lightweight that some here seem to think I am (or wish to portray me as). I don’t claim to be a heavyweight either. I’m just someone who detests seeing science corrupted to fit a narrative or agenda.\n\n","date":"November 24, 2013 at 5:54 am","url":"https://shroudstory.com/2013/11/22/first-annual-bertrand-russell-award-in-sindonology/","cat":"image_theory","id":"comment-52635","author":"colinsberry","site":"shroudstory"},{"title":"First Annual Bertrand Russell Award in Sindonology","post":"If one reflects one of the “sedile” triplets over the other, we notice that: a) they are exactly in synch; b) one set is bigger and darker than the other. I think that this is another occasion when marks were made when the shroud was folded in two. All three marks have very pronounced “serum” or “water stain” rings around them, much wider than any of the other marks, which suggests they are not similar to the other “blood marks” or “puncture wounds.”\n\n","date":"November 24, 2013 at 6:26 am","url":"https://shroudstory.com/2013/11/22/first-annual-bertrand-russell-award-in-sindonology/","cat":"image_theory","id":"comment-52640","author":"Hugh Farey","site":"shroudstory"},{"title":"First Annual Bertrand Russell Award in Sindonology","post":"yep think you are right Hugh\n\n","date":"November 24, 2013 at 6:46 am","url":"https://shroudstory.com/2013/11/22/first-annual-bertrand-russell-award-in-sindonology/","cat":"image_theory","id":"comment-52644","author":"Matthias","site":"shroudstory"},{"title":"First Annual Bertrand Russell Award in Sindonology","post":"Re: Knights Templar. Philippe le Bel decided who could be saint or sinner but he was more worried about his empty coffers and had Jacques de Molay arrested when he came to France to discuss plans for a new crusade with the Pope. The Grand Master was eager to regain morale after the fall of Acre. Would that be the behaviour of a heretic?\nIt is very easy to trace beliefs to just about anything under the sun, examples being the Jehovah’s Winesses tracing their origin, not to Charles Taze Russell, but to Abel. Picknett/Prince, Baigent et al have their agendas, trying to establish fictitious links to convince the gullible.\n\n","date":"November 24, 2013 at 9:31 am","url":"https://shroudstory.com/2013/11/22/first-annual-bertrand-russell-award-in-sindonology/","cat":"image_theory","id":"comment-52657","author":"Louis","site":"shroudstory"},{"title":"First Annual Bertrand Russell Award in Sindonology","post":"There is a general misconception that typically exists regarding the significance of “removing the gloves” in reference to boxing.  True, gloves do minimize facial damage when hit.  However, the main reason that boxers wear gloves is to protect their own hands.  Boxing gloves are specifically designed to support a fighter’s wrists and pad the knuckles.  If you are skeptical, try punching a heavy bag while not wearing gloves, or even wraps.\n\n","date":"November 24, 2013 at 9:41 am","url":"https://shroudstory.com/2013/11/22/first-annual-bertrand-russell-award-in-sindonology/","cat":"image_theory","id":"comment-52660","author":"Kelly Kearse","site":"shroudstory"},{"title":"First Annual Bertrand Russell Award in Sindonology","post":"Kelly, do you think bilirubin can form images of a human body?\n\n","date":"November 24, 2013 at 10:10 am","url":"https://shroudstory.com/2013/11/22/first-annual-bertrand-russell-award-in-sindonology/","cat":"image_theory","id":"comment-52670","author":"Louis","site":"shroudstory"},{"title":"First Annual Bertrand Russell Award in Sindonology","post":"\nLouis :\nKelly, do you think bilirubin can form images of a human body?\n\nI am presuming this is unrelated to boxing.\nIn all sincerity, I simply do not know.\n\n","date":"November 24, 2013 at 10:30 am","url":"https://shroudstory.com/2013/11/22/first-annual-bertrand-russell-award-in-sindonology/","cat":"image_theory","id":"comment-52675","author":"Kelly Kearse","site":"shroudstory"},{"title":"First Annual Bertrand Russell Award in Sindonology","post":"That’s true and the discussion about bilirubin in which you took part was brought into this thread just to catch your attention and get an answer.\n\n","date":"November 24, 2013 at 10:36 am","url":"https://shroudstory.com/2013/11/22/first-annual-bertrand-russell-award-in-sindonology/","cat":"image_theory","id":"comment-52676","author":"Louis","site":"shroudstory"},{"title":"First Annual Bertrand Russell Award in Sindonology","post":"Can someone help me here?  I happen to believe the Shroud is authentic, so I discount any explanations of the marks due to statues.  However, when I see marks on a piece of cloth that are as symmetric as these, the only sensible explanation that leaps to mind is staining while the cloth was folded–I don’t mean necessarily folded for storage but folded nonetheless for some reason.  The circular marks would then not be serum (something in any event not associated with statues) but water.  I suppose, at the outside, it could be that one set of marks could have been formed by contact with the other, but this is not likely given the water marks.  I discount too the explanation of a sedillis because of the near perfect symmetry and also because it would seem reasonable to expect more tearing or at least scraping in that area.  And, while we’re at it, is it too much to expect anyone discussing this to spell out the word “buttocks”, given respect for the person under discussion whatever you may think of the Shroud?\nSo is there any relevant evidence I am not aware of that would argue against my take on this?\n\n","date":"November 27, 2013 at 11:44 am","url":"https://shroudstory.com/2013/11/22/first-annual-bertrand-russell-award-in-sindonology/","cat":"image_theory","id":"comment-52940","author":"R. H. Cahall","site":"shroudstory"},{"title":"First Annual Bertrand Russell Award in Sindonology","post":"Very sensible. I’m not clear what help you would like. I too discount the sedile hypothesis. (‘sedile’, not ‘sedillis’, which is a misspelt form of the genitive of sedile).\n\n","date":"November 27, 2013 at 2:19 pm","url":"https://shroudstory.com/2013/11/22/first-annual-bertrand-russell-award-in-sindonology/","cat":"image_theory","id":"comment-52961","author":"Hugh Farey","site":"shroudstory"},{"title":"First Annual Bertrand Russell Award in Sindonology","post":"I took Latin in high school, somewhat nearer the time of the Roman Empire, so grammatical niceties are pretty much lost on me now.  I just copied the word from the original post.\nAs for the help I want, it is basically to know whether my reasoning holds up in light of facts I may not be taking into account.  If you find what I said “very sensible”, then I assume you are apprised of no facts to the contrary.\nThanks.\n\n","date":"November 27, 2013 at 2:40 pm","url":"https://shroudstory.com/2013/11/22/first-annual-bertrand-russell-award-in-sindonology/","cat":"image_theory","id":"comment-52963","author":"R. H. Cahall","site":"shroudstory"}]
