[{"title":"Scorched Image by the Resurrection","post":"From Yannick’s paper two quotes should suffice…\nDarker-appearing, pure image areas did not penetrate significantly more deeply into the cloth than did lighter areas. The effect was much more different than that produced by scorching a cloth with a hot statue\n– Raymond N. Rogers and Anna Arnoldi, Scientific method applied to the Shroud of Turin – A Review, 2002 (http://www.shroud.com/pdfs/rogers2.pdf)\nMicroscopy proves that image fibers and scorch fibers are quite different in structure and composition. The distribution of color is different, even at the level of single fibers. The image was not formed by scorching the linen fibers. When viewed in parallel light under a microscope, a scorched fiber is colored through its entire diameter, and the medulla (a tubular void down the middle of the fiber) usually appears to be darker than the mass of the fiber as a result of reactions at its surface and its shorter radius of curvature. The medullas of image fibers do not show any coloration or charring. The medullas are usually clean and colorless. Fibers that were scorched in a fire in AD 1532 show some scorching in the medullas .\n– Raymond N. Rogers, A chemist’s perspective on the Shroud of Turin, Barrie Schwortz Editor and Publisher, July 2008\n\n","date":"January 14, 2013 at 9:22 am","url":"https://shroudstory.com/2013/01/14/scorched-image-by-the-resurrection/","cat":"image_theory","id":"comment-21989","author":"Andy Weiss","site":"shroudstory"},{"title":"Scorched Image by the Resurrection","post":"It was of huge benefit to have actual shroud fibres to compare experimental ones with, and I would never attempt to dismiss Rogers’s observations out of hand. Nevertheless I am not convinced by some rather sweeping statements that do not, to my mind, correctly describe the nuances of what is actually seen under a microscope. I have yet to see a photo that demonstrates that a shroud image fibre is not coloured throughout its diameter. Indeed, I would aver that Rogers’s Figure VI-2 in his Chemist’s Perspective book demonstrates exactly the opposite. “An unusually deeply coloured image fibre” he captions it.\nI am also intrigued by the “scorching in the medullas.” As the medullas (Does he mean lumens?) are essentially hollow tubes, what precisely is scorched? Having spent weeks now looking at scorched firbres under a microscope myself, I think those black lines may in fact be on the surface of the fibres, not in the middle. The lumen is usually wider than those black lines, and indeed, if I magnify his Figure VI-1 till it fills the screen (I have the online version of his book) I can see what I think are the sides of the interior, uncoloured, lumen, on either side of the black line supposedly marking the ‘medulla.’\nIt is the business of the scientist to attempt to falsify hypotheses, and the business of the hypothesis to defend itself. Sadly, Ray Rogers is no longer able to answer my observations on his observations, which perhaps he could have done with other photomicrographs. However, as it stands, I still cannot consider the case against scorching proven.\n\n","date":"January 14, 2013 at 11:12 am","url":"https://shroudstory.com/2013/01/14/scorched-image-by-the-resurrection/","cat":"image_theory","id":"comment-21998","author":"Hugh Farey","site":"shroudstory"},{"title":"Scorched Image by the Resurrection","post":"Hugh, could you hang somewhere those photos?\n\n","date":"January 14, 2013 at 12:17 pm","url":"https://shroudstory.com/2013/01/14/scorched-image-by-the-resurrection/","cat":"image_theory","id":"comment-22000","author":"Gabriel","site":"shroudstory"},{"title":"Scorched Image by the Resurrection","post":"If you want I can post them. Just email them to me with captions.\n\n","date":"January 14, 2013 at 12:36 pm","url":"https://shroudstory.com/2013/01/14/scorched-image-by-the-resurrection/","cat":"image_theory","id":"comment-22002","author":"Dan","site":"shroudstory"},{"title":"Scorched Image by the Resurrection","post":"I mean the photos corresponding to your observations.\n\n","date":"January 14, 2013 at 12:18 pm","url":"https://shroudstory.com/2013/01/14/scorched-image-by-the-resurrection/","cat":"image_theory","id":"comment-22001","author":"Gabriel","site":"shroudstory"},{"title":"Scorched Image by the Resurrection","post":"Dear Hugh,\nYou might find photos showing that the colored fibers are not colored under their surface in Fanti’s photos in the “superficiality paper”.\nFig. VI-2 shows an “unusually deeply colored image fiber”. In fact, in some cases the medulla (the lumen) is empty, in some cases there is some amorphous material in it.\nIn any case, as Rogers wrote: ” the medulla [of a scorched fiber ] appears to be darker than the mass of the fiber as a result of the reactions at its surface and its shorter radius of curvature”.\nThe fact that this strongly colored image fiber has a “completely colorless lumen” while all the scorched fibers (even a “lightly scorched fiber, Fig.VI-1) have a colored lumen is strong evidence against a scorch. \nRegarding your observations through the microscope, please be careful. There are so many traps! Myself (I am not at all an expert in microscopy), I saw several “black lines” in the middle of my lightly scorched fibers but never wrote that they were colored medullas because they should have been at the surface of the fiber or the result of a misinterpretation However, remember that Rogers was fully aware of the traps of microscopy and you can be sure that he was right. \nThibault.\n\n","date":"January 14, 2013 at 4:50 pm","url":"https://shroudstory.com/2013/01/14/scorched-image-by-the-resurrection/","cat":"image_theory","id":"comment-22018","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Scorched Image by the Resurrection","post":"Hi Thibault,\nyou wrote: “You might find photos showing that the colored fibers are not colored under their surface in Fanti’s photos in the “superficiality paper””.\nWhich paper are you referring to? This cannot be the paper “The double superficiality of the frontal image of the Turin Shroud” by Fanti and Maggiolo since no such photos exist in that paper.\nBest,\nMario\n\n","date":"January 14, 2013 at 6:47 pm","url":"https://shroudstory.com/2013/01/14/scorched-image-by-the-resurrection/","cat":"image_theory","id":"comment-22021","author":"Mario Latendresse","site":"shroudstory"},{"title":"Scorched Image by the Resurrection","post":"We do not know what the Resurrection process was, nor do we yet know how the image was formed – it may have been a naturalstic process or it may have been some by-product of the Resurrection process.  Nothing is proven, and nothing is disproven.  Colin’s and Hugh’s experiments may lead one way or another.  Any attempt to penetrate the secret of the Shroud is to be commended.  To date the best work on the Shroud would seem to be confined to its forensic aspects – Vignon, Delage, Barbet, Willis etc, all of which is at least consistent.  We need to know more.\n\n","date":"January 14, 2013 at 3:44 pm","url":"https://shroudstory.com/2013/01/14/scorched-image-by-the-resurrection/","cat":"image_theory","id":"comment-22014","author":"daveb of wellington nz","site":"shroudstory"}]
