[{"title":"Free the HAL 9000","post":"Question :  What is the Archdiocese of Turin afraid of?  \nAnswer :  All the crackpots in this world of the Shroud…  And they are numerous !!!  Some of them see coins on the shroud…  Some others say see flowers…  Some others see writtings…   Some others see the crown of thorns…  The list goes on and on and on and on…\nImagine what those people would see with those high definition photos ?  Maybe, they would see the 4 Horsemen of the Apocalypse ! ;-)\nSeriously, without chemical analysis, those photos are better where they are…  Far away from those crackpots.\n\n","date":"October 12, 2011 at 4:44 pm","url":"https://shroudstory.com/2011/10/12/free-the-hal-9000/","cat":"image_theory","id":"comment-4181","author":"Yannick Clément","site":"shroudstory"},{"title":"Free the HAL 9000","post":"this will go on until the apocalypse. i see writing in italian which proves Jesus was italian.\n\n","date":"October 12, 2011 at 5:35 pm","url":"https://shroudstory.com/2011/10/12/free-the-hal-9000/","cat":"image_theory","id":"comment-4182","author":"MouseInTheHouse","site":"shroudstory"},{"title":"Free the HAL 9000","post":"I on the other hand agree 100% with the reader from Chicago. Has anyone thought that maybe these clearer more defined pictures can possibly clear the whole question of the so-called ‘artifacts’ supposedly seen on the Shroud? Furthermore, YES, what is the Archdiocese afraid of? Personally I question much of what they have done in the past and still do today. They are partially at fault for the catastrophy of the 1988 carbon dating, taking a ‘single’ sample from a most definitely ‘known’ contaminated area. They would have had to been idiots not to have known about it with all the images and information at their disposal for months beforehand. Then there is the ‘secret’ restoration in 2002 without even approaching real experts on the issue. They have apparently vacuumed the complete Shroud, cut out all charred areas etc, etc; …So why not offer this material for study? It really makes you wonder what is up with them? I say make the HD photos of the Shroud available to everyone, if for nothing else but for everyone to admire the beauty of this amazing icon. On another note; If the Shroud is the actual burial Shroud of Jesus, would not the Church be working against our Lord’s wishes by not openly allowing access to all people? Wouldn’t that be exactly what Jesus would want? …I think yes.\nRon\n\n","date":"October 13, 2011 at 7:46 am","url":"https://shroudstory.com/2011/10/12/free-the-hal-9000/","cat":"image_theory","id":"comment-4183","author":"Ron","site":"shroudstory"}]
