[{"title":"Is the Shroud of Turin a Medieval Photograph?","post":"What happened to Walter McCrone?  I thought the esteemed chemist determined it was nothing more than iron oxide suspended in a thin binder to create a jewelers rouge?  And of course the paint was nothing more than vermilion.  Why would anyone give notice to other theories when the founder of the McCrone Institute has already issued his decree?  Didn’t he debunk the Vinland Map?  Why consider other theories?  Just saying…\n\n","date":"October 23, 2013 at 4:38 pm","url":"https://shroudstory.com/2013/10/23/is-the-shroud-of-turin-a-medieval-photograph/","cat":"image_theory","id":"comment-48554","author":"Russ Breault","site":"shroudstory"},{"title":"Is the Shroud of Turin a Medieval Photograph?","post":"Paint…I meant blood.  McCrone says its vermilion.\n\n","date":"October 23, 2013 at 4:42 pm","url":"https://shroudstory.com/2013/10/23/is-the-shroud-of-turin-a-medieval-photograph/","cat":"image_theory","id":"comment-48555","author":"Shroud Encounter","site":"shroudstory"},{"title":"Is the Shroud of Turin a Medieval Photograph?","post":"Oh Lord, does someone really have to say it again?  Anytime a painting, picture, or such image is made, the painting appliance or instrument used to apply pigment ALWAYS leaves telltale stroke-marks indicating the way the pigments or pigment was applied. This is called directionality. No directionality on the Shroud, not a painting. Yes,  vermillion was found but in medieval times paintings of the SOT were placed against the Shroud itself, “sanctifying” the copy. This was done to many relics because some people just could not make the long pilgrimages required to fulfill a vow.  Mercuric Sulfide (vermillion) is bright red; if the Image of the Man is made of vermillion why isn’t it red?  And why does 90% of the information on the SOT only appear as a photographic negative?  And if it IS a photographic negative, on cloth, why can’t modern science replicate it ??  If it is a painting, why didn’t state of the art equipment used by NASA find this out in the 1970’s STRP team investigation?  Not exactly primitive equipment even by today’s lofty standards.  It is NOT a painting. We consider other theories because the painting theory is humbug, not possible,  unless someone found a way to paint microscopic fibers, sometimes every other one, with a teeny tiny itty bitty little paintbrush. Replicate that, and the painting theory is back on the table. Until then, the mystery endures, and probably always will.\n\n","date":"October 24, 2013 at 10:38 pm","url":"https://shroudstory.com/2013/10/23/is-the-shroud-of-turin-a-medieval-photograph/","cat":"image_theory","id":"comment-48643","author":"Josie L. Tyner","site":"shroudstory"},{"title":"Is the Shroud of Turin a Medieval Photograph?","post":"I don’t think anybody claims that any alleged pigment was applied with a paintbrush. For many years now, “paint hypothesis” people have suggested assorted rubbing or dabbing techniques that have no directionality.\nVermillion, I think, is a bit of red herring. Only tiny amounts were found by Heller and Adler, and even McCrone missed it completely to start with.\nIt is not true that 90% of the information on the shroud only appears as a negative. A negative photo contains exactly the same information as the positive.\nWhy can’t modern science reproduce it? Mostly because modern science doesn’t know enough about it. A collection of photos of various kinds from 20 years ago isn’t enough to go on – and that’s all there is for most people.\nNevertheless, it is important to realise that the following three statements are all equally untrue.\n“We can’t reproduce the painting, so it must be naturally made.”\n“We can’t reproduce it naturally, so it must be a painting.”\n“We can’t reproduce it at all, so it must be a miracle.”\nPart of Josie’s concluding sentence – “the mystery endures” – is perfectly true. What fun!\n\n","date":"October 25, 2013 at 7:06 am","url":"https://shroudstory.com/2013/10/23/is-the-shroud-of-turin-a-medieval-photograph/","cat":"image_theory","id":"comment-48657","author":"Hugh Farey","site":"shroudstory"},{"title":"Is the Shroud of Turin a Medieval Photograph?","post":"Mr. Farey, I have done tomb-stone rubbings in Virginia and West Virginia.  “Rubbing” and”dabbing” techniques have as much directionality as a paint brush, believe it. You have to apply dry pigment in a series of strokes, and even if you used your bare hand, the application process still would indicate the direction of the strokes.  Not to the naked eye, perhaps.  A visual inspection of the SOT show some information, yest but  the negative of the photograph taken by Secondo Pia,  exposed the incredibly detailed information available in the SOT,  You CANNOT see, on a cursory and unaided examination, the abundance of amazing information available on the negative. Yes, of course you can see some of it. But a visual comparison of the two images is astounding, is it not?  Why has no one ever seriously TRIED to reproduce the effects on the Shroud? Calotyping is a primitive process using paper, LINEN paper. The Camara Obscura was known to artists and scientists of the Renaissance-why no attempts? Sir, there are people in this world who would give ten years of their lives to prove the SOT a fabulous fraud.  We can put men on the moon and vehicles on Mars, why can we not ape the (putatively) “fraudulent” product of relic monger? One with no modern laboratory, chemicals, or even the anatomical or archeological knowledge to perpetrate a convincing fraud..we have no answers. What fun? Much more than a matter of “fun” to some of us, sir. No laughing matter to the billions of us who call Him King and Savior. If some unknown medieval forger has mocked our faith by counterfeiting the burial cloth of the Son of God, I would like to know how it was done. And if not, the possibilities for those of use who desire life everlasting, the reunion with our loved and lost, and the drying of every tear, are wonderful indeed.\n\n","date":"October 25, 2013 at 10:50 am","url":"https://shroudstory.com/2013/10/23/is-the-shroud-of-turin-a-medieval-photograph/","cat":"image_theory","id":"comment-48666","author":"Josie L. Tyner","site":"shroudstory"},{"title":"Is the Shroud of Turin a Medieval Photograph?","post":"I cannot but appreciate your sincerity, Josie, but to me the authenticity of the shroud or not is nothing more than a forensic game. The Christian faith does not depend in the slightest on any relics, real or forged, and can survive the most ardent attempts at mockery without turning a hair. Your chance of everlasting life will not be diminished by a successful attempt to reproduce the shroud using medieval art, nor enhanced by the discovery of a natural if morbid process emanating from a dead body.\nOn a more scientific note, tomb rubbings are usually done using a hard wax, which has to be pushed hard across the paper, and certainly demonstrates directionality. Using a pad of cloth or a sponge dipped in a powder or a gel, and simply dabbing the cloth vertically with it, produces none. You need not apply any ‘strokes’ at all.\nNow it seems counter-intuitive, but there really is nothing on a negative of a photograph that is not there in the positive. The negative of the shroud matches our own perception of a ‘normal’ face, with shadows between the hair and skin, down the sides of the nose and in the eyes, which it why it seems so impressive, but it carries no more information than the positive.\n\n","date":"October 25, 2013 at 11:40 am","url":"https://shroudstory.com/2013/10/23/is-the-shroud-of-turin-a-medieval-photograph/","cat":"image_theory","id":"comment-48671","author":"Hugh Farey","site":"shroudstory"}]
