[{"title":"From out of the strong came forth the sweet?","post":"About 2 years ago I found this blog at which time I made my initial statement saying that I understand how the image was formed. I come back to it from time to time to see if anyone else has even alluded to certain aspects of the shroud necessary to understanding it. I’ve yet to see even one. The closest anyone has come is the theory held by Isabel Piczek. However, through no fault of her own it is a very far cry from being a total explanation. In fact, just a few months ago I inadvertently found her theory one day on line and was pretty much taken aback by what she said. If you read what she said and what I wrote in my book, Thirteenth Apostle: The Coming Transubstantiation 14 years BEFORE she even developed an interest in the Shroud it would raise some eyebrows. I am NOT saying that she knowingly or unknowingly took what I wrote and expounded on it in her own way but it would be hard NOT to at least entertain the idea. Except for the placement of one or two words, literally, our explanations, at first blush, are identical. However this placement of words makes a difference that is immeasurable………………[contact information removed]\n\n","date":"August 15, 2015 at 5:00 am","url":"https://shroudstory.com/2015/08/15/from-out-of-the-strong-came-forth-the-sweet/","cat":"image_theory","id":"comment-208303","author":"Michael Jude","site":"shroudstory"},{"title":"From out of the strong came forth the sweet?","post":"The relentless seeker after truth, in whatever its guises, speaks…\nIt appears possible to buy The Thirteenth Disciple; The Coming Transubstantiation, directly by Paypal, from Michael Jude’s site: http://shownamystery.com. However, although it is not mentioned by name, clicking on the Pay Now button leads directly to a PayPal request for $15  (presumably including postage?). I am reluctant to pursue this, as I am not convinced the book actually exists. Although it has an ISBN number, and a publisher, it is not available only from any booksellers, new or used, or ebay. The publisher is Dimi Press, of Oregon, many of whose other works are readily available. The book is mentioned on Google Books, as by Michael J. Felock, published by Morris Books, but it never appears to have been printed, and an application by Michael J. Felock to have “13th Apostle” trademarked has been abandoned.\nThe book appears to have been published in 1997, which is not 14 years before Isobel Pikzek “developed an interest in the Shroud”, but considerably later. I think it unlikely that she could have copied Mr Felock’s work since it seems so extraordinarily hard to find anyway.\nIn a more recent YouTube plug for his book, ‘Michael Jude’ claims that while exploring Freemasonry he discovered, by chance, that “the book, once again, contained, complemented and answered, certain Masonic teachings that dramatically effect the general understanding of the physical origins of man and other aspects of his being such as the ability of sight, memory and consciousness, for Masons and non-Masons alike.” \nWell, Michael, that’s as far as I’m prepared to go. If you want a little more recognition for your revelation, you need to make it available. Forget the money, it was never going to make your fortune anyway. Put the whole text of the book on your website and we’ll give it the same generous consideration that we do for the papers of Louis, di Lazzaro, Fanti, Hines and anybody else who cares to write one.\n\n","date":"August 15, 2015 at 7:57 am","url":"https://shroudstory.com/2015/08/15/from-out-of-the-strong-came-forth-the-sweet/","cat":"image_theory","id":"comment-208314","author":"Hugh Farey","site":"shroudstory"},{"title":"From out of the strong came forth the sweet?","post":"And they could not in three days declare the riddle. So he said to them, Out of the eater came something to eat, And out of the strong came something sweet.\n\n","date":"September 2, 2015 at 11:20 am","url":"https://shroudstory.com/2015/08/15/from-out-of-the-strong-came-forth-the-sweet/","cat":"image_theory","id":"comment-209485","author":"Miquel Madueno","site":"shroudstory"}]
