[{"title":"Scorching Onion Skins","post":"If you consider oignon is mainly made of starch and sugars, it looks like the suggested hoax recipe based on a thin external layer :\n\nRogers :\n\nUsing a cloth washed in a low-surface-tension solution containing pentose sugars (e.g., a Saponaria solution) and dried in the sun, a non-metallic statue at a temperature above 100C might have worked.A thin oignon layer doesn’t absord much heat, it protects only very slightly and briefly the linen. It is just more sensitive to lower temperature.\n\n","date":"March 9, 2014 at 7:22 am","url":"https://shroudstory.com/2014/03/09/scorching-onion-skins/","cat":"image_theory","id":"comment-86510","author":"anoxie","site":"shroudstory"},{"title":"Scorching Onion Skins","post":"I don’t get it? We have linen, why experiment on onions. Or is it claimed that the whole shroud was covered in onion? This is what happens when you perform experiments in the kitchen.\n\n","date":"March 9, 2014 at 8:23 am","url":"https://shroudstory.com/2014/03/09/scorching-onion-skins/","cat":"image_theory","id":"comment-86526","author":"Mike M","site":"shroudstory"},{"title":"Scorching Onion Skins","post":"\nMike M :\nI don’t get it? We have linen, why experiment on onions. Or is it claimed that the whole shroud was covered in onion? This is what happens when you perform experiments in the kitchen.Mike M :\nI guess a 4.4×1.1m linen cloth can be produced today not manually woven but I don’t think the weaving whether manual or automatic makes a difference in the image. What’s your point?\n\nThe point is modern linen can’t be directly compared to the shroud.\n\n","date":"March 9, 2014 at 8:58 am","url":"https://shroudstory.com/2014/03/09/scorching-onion-skins/","cat":"image_theory","id":"comment-86539","author":"anoxie","site":"shroudstory"},{"title":"Scorching Onion Skins","post":"Sorry Anoxie, I still can’t get it. what your saying would make sense if Colin is talking about scorching an impurity layer (like Rogers postulated) but he is talking about primary cell wall. What is the difference between primary cell wall of antient linen and modern linen?\n\n","date":"March 9, 2014 at 9:34 am","url":"https://shroudstory.com/2014/03/09/scorching-onion-skins/","cat":"image_theory","id":"comment-86549","author":"Mike M","site":"shroudstory"},{"title":"Scorching Onion Skins","post":"I’ve just pointed the similarities, meaning he’s got a degraded idea of what Rogers suggested years ago.\n\n","date":"March 9, 2014 at 9:42 am","url":"https://shroudstory.com/2014/03/09/scorching-onion-skins/","cat":"image_theory","id":"comment-86553","author":"anoxie","site":"shroudstory"},{"title":"Scorching Onion Skins","post":"But I don’t understand any heat hypothesis when Barrie Schwortz has stated over and over again that the Image doesn’t fluoresce that means it wasn’t heat induced.\n\n","date":"March 9, 2014 at 8:55 am","url":"https://shroudstory.com/2014/03/09/scorching-onion-skins/","cat":"image_theory","id":"comment-86538","author":"clublu22014","site":"shroudstory"},{"title":"Scorching Onion Skins","post":"Clublu22014; I totally agree, not only that but scorched linen show up in transmitted light photography while the shroud image doesn’t. And the lumen of the fibres are discoloured while the shroud image doesn’t show any lumen discolouration. This is a prime example of how the anti authenticity camp would go to any length (not supported by science) to discredit the shroud. With the hacking hypothesis we have been seeing both extremes of the spectrum.\n\n","date":"March 9, 2014 at 9:39 am","url":"https://shroudstory.com/2014/03/09/scorching-onion-skins/","cat":"image_theory","id":"comment-86552","author":"Mike M","site":"shroudstory"},{"title":"Scorching Onion Skins","post":"Mike,\n I have a theory, where and how could it be discussed? Or how could I open a new thread?\n\n","date":"March 9, 2014 at 11:27 am","url":"https://shroudstory.com/2014/03/09/scorching-onion-skins/","cat":"image_theory","id":"comment-86576","author":"jenx","site":"shroudstory"},{"title":"Scorching Onion Skins","post":"Hi Jenx, email your thoughts to Dan’s email (listed after his comment on the sidebar) and he will open the thread.\n\n","date":"March 9, 2014 at 11:35 am","url":"https://shroudstory.com/2014/03/09/scorching-onion-skins/","cat":"image_theory","id":"comment-86579","author":"Mike M","site":"shroudstory"},{"title":"Scorching Onion Skins","post":"Thanks! I will do that!  Now don’t tear me up too bad guys. Ha!\n\n","date":"March 9, 2014 at 11:38 am","url":"https://shroudstory.com/2014/03/09/scorching-onion-skins/","cat":"image_theory","id":"comment-86580","author":"jenx","site":"shroudstory"},{"title":"Scorching Onion Skins","post":"LOL. I am not a pro myself, just speak your heart & cross your fingers.\n\n","date":"March 9, 2014 at 12:06 pm","url":"https://shroudstory.com/2014/03/09/scorching-onion-skins/","cat":"image_theory","id":"comment-86586","author":"Mike M","site":"shroudstory"},{"title":"Scorching Onion Skins","post":"Mike this is a most excellent insight!  Thank You!  \n(However I am having a bit of a quandary as to just exactly what the identification of the lumen is regarding the fibril of the linen… It seems obvious that it is the outside molecules of the fibril’s tubing not necessarily the inside.  Perhaps you could clarify this for me?)\n\n","date":"March 9, 2014 at 12:58 pm","url":"https://shroudstory.com/2014/03/09/scorching-onion-skins/","cat":"image_theory","id":"comment-86599","author":"clublu22014","site":"shroudstory"},{"title":"Scorching Onion Skins","post":"Thanks clublu22014, the lumen is actually the innermost, hollow part of the fibre. In the image fibres the colour is only on the outermost layer(there is debate whether that layer is the primary cell wall or an impurity layer) but the lumen appears colourless as demonstrated by Rogers. In the scorched fibres the discoloration penetrates both the primary cell wall and the secondary cell wall which shows as a discolored lumen under the microscope. There is a nice image taken by Rogers that Thibault have in the paper linked below it show the difference between the image fibre and the scorched fibre with regards to the lumen discoloration.\n https://www.shroud.com/pdfs/thibault%20final%2001.pdf\n\n","date":"March 9, 2014 at 1:50 pm","url":"https://shroudstory.com/2014/03/09/scorching-onion-skins/","cat":"image_theory","id":"comment-86612","author":"Mike M","site":"shroudstory"},{"title":"Scorching Onion Skins","post":"Mike M… You’re Magnificent!  This clears everything up for me so very well.  Imagine just a few coherent molecules on the outer surface of the linen fibril receiving the information!  Spectacular!  So I guess the debate is about whether or not soap wart is the culprit or the actual first cells of the linen are. Could be both in cahoots with Image formation?\n\n","date":"March 9, 2014 at 4:56 pm","url":"https://shroudstory.com/2014/03/09/scorching-onion-skins/","cat":"image_theory","id":"comment-86665","author":"clublu22014","site":"shroudstory"},{"title":"Scorching Onion Skins","post":"Thanks again clublu22014, the credit goes to Barrie (whose website gave us access to this information) Rogers (who did the research and took the photographs), Jackson (who assembled STURP and continues to be an icon in shroud research) or Thibault (who assembled the information in that beautiful paper) We are standing on the shoulders of giants looking at this amazing mystery. Jesus left us a high resolution, picture quality image of his passion etched on a piece of linen cloth,  that science (despite 100s of thousands of hours of research) still can’t explain. It’s an amazing thing that has been a source of deep joy in my life. It’s very difficult to keep that joy for yourself it’s only natural to try to share it with others.\n\n","date":"March 9, 2014 at 10:38 pm","url":"https://shroudstory.com/2014/03/09/scorching-onion-skins/","cat":"image_theory","id":"comment-86750","author":"Mike M","site":"shroudstory"},{"title":"Scorching Onion Skins","post":"….and Dan for giving is the platform for discussing these things openly.\n\n","date":"March 9, 2014 at 10:41 pm","url":"https://shroudstory.com/2014/03/09/scorching-onion-skins/","cat":"image_theory","id":"comment-86752","author":"Mike M","site":"shroudstory"},{"title":"Scorching Onion Skins","post":"I’m with you, Mike!  Magnificent! Majestic! Mighty!\n\n","date":"March 9, 2014 at 11:18 pm","url":"https://shroudstory.com/2014/03/09/scorching-onion-skins/","cat":"image_theory","id":"comment-86763","author":"clublu22014","site":"shroudstory"},{"title":"Scorching Onion Skins","post":"Just wanted to add kudos to Colin too. His experiments are, whether you agree with his conclusions, brilliant stuff. And they are triggering excellent discussions. Whether he’s your favourite person or not you have to admit he’s advancing Shroud knowledge and the value of kitchen science. His site does deserve more google traffic.\n\n","date":"March 10, 2014 at 9:54 am","url":"https://shroudstory.com/2014/03/09/scorching-onion-skins/","cat":"image_theory","id":"comment-86934","author":"David Goulet","site":"shroudstory"},{"title":"Scorching Onion Skins","post":"Thank you David. Out of courtesy I cannot let your comment go unacknowledged, even if this site is now a no-go area for this bruised investigator.\nI’m what you might call slow but methodical, mainly slow. There are things I wish I had spotted two years ago. Never mind.Tomorrow’s posting will attempt to explain why the Shroud image has fooled not just me, but STURP and many others as well. The answer lies in a phenomenon that is one of the most basic principles of the natural world, underpinning physics, chemistry and biology. It’s called entropy, aka natural attrition, read wear-and-tear,  best explored with a time machine, but failing that, imagination has to be called into play. Stay tuned.\n\n","date":"March 10, 2014 at 2:46 pm","url":"https://shroudstory.com/2014/03/09/scorching-onion-skins/","cat":"image_theory","id":"comment-87015","author":"colinsberry","site":"shroudstory"},{"title":"Scorching Onion Skins","post":"Which is exactly why I called attention to the discussion on Colin’s site. Surely, there will be more.\n\n","date":"March 11, 2014 at 6:08 am","url":"https://shroudstory.com/2014/03/09/scorching-onion-skins/","cat":"image_theory","id":"comment-87296","author":"Dan","site":"shroudstory"}]
