[{"title":"Scorching Theory: Pseudoscience or Miracle?","post":"“But fantastical speculations of life-size scorching statues, blood leaches and conspiracy theory from souvenir medals is pseudoscience in full flower”\n.\nBut it IS science, since the ideas re imaging and blood are both testable, at least in principle. \nLife size scorchable statues?  All in good time, but there is little incentive to go scaling up when one’s findings with small scale models are totally ignored or dismissed, sometimes on the basis of rigged or clumsy experiments, designed to give the desired result, like excessive scorching, or “excessive contrast” (don’t ask!). \nThat’s despite my scorches from sensibly-selected bas-relief templates with gentle gradations of relief reproducing:\n1. the Shroud image’s peculiar, somehat unattractive, negative character:\n2. its dramatic response/improvement after tone inversion, accentuated no doubt by the non-directional character of imprinted shadow-free scorches,\n3. its ‘profoundly mysterious’ ability to respond to 3D-enhancement in programs that interpret image density as height on a third imaginary z axis, i.e. dimension, \n4. its ability to produce mechanically-weakened fibres, \n5. to produce obverse-side imaging if excessive temperature is employed, \n6.  its ability to produce weak imaging across air gaps – probably via convection currents – unlike radiation models that simply don’t work in practice (due to boring old conventional physics that says that radiation reflects off white surfaces)  \n Give me more time (and inclination) and the list could probably be extended. But why bother, here on this site, where it’s so much simpler and satisying for folk to win brownie points at my expense, by ridiculing or attempting to trash the science than it is to address the specific details. In fact, the only reason I’m here now, responding to the stand-up comedy, is because it’s light relief from the extraordinarily hard and thankless work of trying to track down the supposed scientific basis of all the playing to the pro-authenticity gallery.  (All one finds, after hours of googling, is one dissolving perspective after another.   But is that really so surprising, given that patient peeling away of the trappings of science rarely reveals anything of substance, merely agenda driven theofiziks, theochemystery, theofizziology, aka posturing, pretentious puffed-up pseudoscience).\nBlood leeches? Here’s what said to a regular on my own site – just this morning: \n“That’s why my narrative has been so consistent and unchanging over the months – not because I am unwilling to change my views, but because my ideas have already gone through a long process of critical reflection before they ever appear on this site, and even the ‘wackier’ ones like leech blood can account for several otherwise explained oddities re Shroud blood (lack of potassium, atypical porphyrin, no sign of blood clots, presence of a marker for connective tissue (leech?), ability to be applied as a non-coagulating paint, possible the “permanent red colour” due to exotic haem species generated from having spent weeks or months exposed to digestive juices, bacteria etc.”\nHaven’t we forgotten something. I have placed my head on the block here, since it’s a fairly straightforward matter to test Shroud blood for intact collagen, or antigens to the contents of a leech gut. Did Adler bother to test his wacky bilirubin narrative for the peculiar longevity of the red colour of Shroud blood? Answer on a postcard please (and be reflecting on why my blood theory gets immediate flak while the same critics remain silent of Adler’s wild authencity-promoting flights of fancy  that have since acquired the status of received wisdom, some might say holy writ) . \nAs for the Lirey “conspiracy”, nobody in 14th century  France ever got poor from underestimating the gullibility of medieval pilgrims, the latter proto-tourists desperate to visit the latest ‘holy icon’ to be ‘brought back’ from Constantinople or the Holy Land by returning Crusaders. \nThe local bishop was not taken in, needless to say, no doubt noting the periodic “improvements” in medallions on display in the souvenir shop. Google (machy mould) for evidence for fine tuning of the authenticity message.\nSee also this account  from Ian Wilson of the Shroud’s first recorded history in the second half of the 14th century: there is plenty here to sustain a ‘conspiracy theory’ (my bolding)\n  April 10 (or 16), 1349: The Hundred Year War had been raging between France and England for over eleven years and the Black Death had just finished ravaging most of Europe when Geoffrey de Charny, a French knight, writes to Pope Clement VI reporting his intention to build a church at Lirey, France. It is said he builds St. Mary of Lirey church to honor the Holy Trinity who answered his prayers for a miraculous escape while a prisoner of the English. He is also already in possession of the Shroud, which some believe he acquired in Constantinople.\n1355: According to the “D’Arcis Memorandum”, written more than thirty years later, the first known expositions of the Shroud are held in Lirey at around this time. Large crowds of pilgrims are attracted and special souvenir medallions are struck. A unique surviving specimen can still be found today at the Cluny Museum in Paris. Reportedly, Bishop Henri refused to believe the Shroud could be genuine and ordered the expositions halted. The Shroud was then hidden away.\nSeptember 19, 1356: Geoffrey de Charny is killed by the English at the Battle of Poitiers, during a last stand in which he valiantly defends his king. Within a month his widow, Jeanne de Vergy, appeals to the Regent of France to pass the financial grants, formerly made to Geoffrey, on to his son, Geoffrey II. This is approved a month later. The Shroud remains in the de Charny family’s possession.\nAugust 4, 1389: A letter signed by King Charles VI of France orders the bailiff of Troyes to seize the Shroud at Lirey and deposit it in another of Troyes’ churches pending his further decision about its disposition.\nAugust 15, 1389: The bailiff of Troyes reports that on his going to the Lirey church, the dean protested that he did not have the key to the treasury where the Shroud was kept. After a prolonged argument, the bailiff seals the treasury’s doors so that the Shroud cannot be spirited away.\nSeptember 5, 1389: The king’s First Sergeant reports to the bailiff of Troyes that he has informed the dean and canons of the Lirey church that “the cloth was now verbally put into the hands of our lord the king. The decision has also been conveyed to a squire of the de Charny household for conveyance to his master”.\nNovember (?) 1389: Bishop Pierre d’Arcis of Troyes appeals to anti-pope Clement VII at Avignon concerning the exhibiting of the Shroud at Lirey. He describes the cloth as bearing the double imprint of a crucified man and that  it is being claimed as the true Shroud in which Jesus’ body was wrapped, attracting crowds of pilgrims.\nJanuary 6, 1390: Clement VII writes to Bishop d’Arcis, ordering him to keep silent on the Shroud, under threat of excommunication. On the same date Clement writes a letter to Geoffrey II de Charny apparently restating the conditions under which expositions could be allowed. That day he also writes to other relevant individuals, asking them to ensure that his orders are obeyed.\nJune 1390: A Papal bull grants new indulgences to those who visit St. Mary of Lirey and its relics.\nMay 22, 1398: Death of Geoffrey II de Charny. He is buried at the Abbey of Froidmont, near Beauvais, his tomb decorated with his effigy as a knight in armour.\n…………………………………..\nNotice anything? At no stage is there any indication that Geoffroi de Charny made any attempt himself to convince the local bishop of the Shroud’s authenticity prior to public display. Instead he left a will stating that the Shroud was to be displayed AFTER his death (putting his wife in danger?) although interestingly his widow wasted no time in acting upon her husband’s  directives, and quickly running into opposition from the Church. But then there was no husband around who could be subjected to inquisition and/or torture, extracting the real story (although we are told that an unnamed artisan did confess to having forged the Shroud).\nThere is no need to entertain conspiracy theories here – the recorded history speaks for itself. The Shroud evinced incredulity from the word go that it was or might be the genuine burial cloth of Christ, and its first recorded owner postponed display until he was safely beyond the reach of the hooded men with the hot tongs, the thumb screws, the hammered wedges, the finger/toe nail extractors, your bigger-than-average barbecue etc etc.\n\n","date":"March 17, 2013 at 9:20 am","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","id":"comment-27534","author":"colinsberry","site":"shroudstory"},{"title":"Scorching Theory: Pseudoscience or Miracle?","post":"CB’s comments need a detailed complete answer.\nI am writing it but .. be patient.\n\n","date":"March 22, 2013 at 5:52 pm","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","id":"comment-28106","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Scorching Theory: Pseudoscience or Miracle?","post":"Scorching has never been shown to have all the properties the image on the Shroud has.  Perhaps someone like Colin should do so if it is possible.\n\n","date":"March 17, 2013 at 10:52 am","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","id":"comment-27541","author":"Andy Weiss","site":"shroudstory"},{"title":"Scorching Theory: Pseudoscience or Miracle?","post":"Andy,\nI do not believe that the “scorching” if that is the answer by any transfer method that we can presently establish with certainty although it certainly points a  towards a process involved in the Resurrection. That’s what drives the pseudo-skeptics to their inanities.\nOn page 139 of his memoir (“Report on he Shroud of Turin”), John Heller made the following observation about Roger Gilbert’s presentation at Santa Barbara conference concerning the spectrometer  findings:\n“There was too much information for us to digest at one sitting, but one fact did become clear: the color of the lightest scorch area was similar to the color of the images of the man. What his meant, I had no idea.”\nWhen I read in an article about the taking of the Shroud samples for C-14 testing, that the Turin authority objected to the bright lights because of the potential for damage to the Shroud, the thought occurred to me that a scorch by light may be a solution. Can light scorch? In the Boy Scouts we learned you could  start a fire by using a magnifying glass to capture the sun’s rays.\nHowever, identifying the the image as akin to a scorch doesn’t answer the question, because any light based process doesn’t allow for the high definition of the image except one  – the laser. OMG\n\n","date":"March 17, 2013 at 11:17 am","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","id":"comment-27544","author":"John Klotz","site":"shroudstory"},{"title":"Scorching Theory: Pseudoscience or Miracle?","post":"“In the Boy Scouts we learned you could start a fire by using a magnifying glass to capture the sun’s rays.”\nYes, but that is not a valid model for the imaging of the Man on the TS, unless you imagine that the subject being imaged suddenly became incandescent – in which case the hair would have burned off, and probably much else besides (it’s also unclear how a converging lens could suddenly  materialize out of thin air to produce a real image).\nBut why bother? I can think of very few occasions on this site where commentators have been willing to put aside their disdain and preconceptions long enough for anyone to calmly articulate the case for a medieval provenance. Lacking  at least a temporary truce,it is well-nigh impossible to focus purely on the science, even the kind of science one acquires at school, like the three methods of heat transfer, without being placed under duress.\nBut where the science is concerned, there’s a clue: that concentrated spot of solar radiation, mainly infrared and visible white light, with a minor uv component, usually has to be focused down to the smallest possible spot a real inverted image of the Sun in fact, apparent if viewed through dark glasses,  for the paper or cloth to scorch and then char or catch fire. That’s because white surfaces tend to reflect/scatter most of the incident radiation – both heat and light. Repeat the experiment with black paper or cloth, and it’s an entirely different story. With greater absorption, less scattering and reflection, there is much faster pyrolysis, or even combustion.\n  The mechanism by which the Shroud, initially pristine white linen, acquired its negative image could NOT have involved radiation –  certainly not that from radiant energy sources comparable to sunlight. Without an intense source of radiation, the kind that is emitted from an incandescent body at thousands of degrees Celsius, that leaves conduction and convection.  But please don’t tell anyone I said so, at least not here, or elsewhere in the public domain. I can’t afford to be branded a pseudoscientist, not at my time of life. The grandchildren would be so terribly upset and disillusioned, having been told their grandad was a real scientist, as no doubt John Klotz’s grandchildren think he’s a real lawyer. It’s the self-image thing you know…\n\n","date":"March 17, 2013 at 12:46 pm","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","id":"comment-27550","author":"colinsberry","site":"shroudstory"},{"title":"Scorching Theory: Pseudoscience or Miracle?","post":"In his analysis of the Shroud, Ray Rogers was clear :  The blood on the Shroud was NEVER heated to a high temperature (except, of course, for the parts that were burned in the fire of 1532).\nThe image is not a scorch (whether it would come from a forger or from an Hollywoodish Resurrection scenario).  \nQuestion for Colin Berry :  Don’t you realize that if someone would have had in mind to create a false Shroud of Christ in the 14th century in Europe, the outcome of it would never had been close to what we see on the Shroud?  Jesus’ buttocks would NEVER had been shown totally naked and the scourge marks would NEVER had been shown in so many places (and it is highly doubtful that our forger would have thought to place a lot of them in front of the body as well as in the back).\nSeriously Colin, if you really think the Shroud is a forgery, I have absolutely no problem with that, but please, try to be rational and propose us a credible scenario that will take all the data and observations into account, including the history of Christian art and the socio-cultural and religious mentality of ancient time.  \nHere’s an advice for you :  I think you should try to build a scenario involving a Christian forger who did his masterpiece after the discovery of the so-called “true cross” in Jerusalem around 326 A.D. (which lead to the first golden era of Christian relics) and before the first appearence of the first known Pantocrator-like painting in Ravenna, Italy around 500 A.D. and who would have created his false relic by using the body of a real victim of a Roman-style scourging and crucifixion (tortures that he would have probably done himself with the aid of some collaborators).  In this kind of scenario, the body image would certainly have been left on the cloth by accident and would have come from a natural process involving an interraction between the dead and tortured body and the surface of the cloth.\nI think it would be very interesting if some skeptic out there could build such a forgery scenario in details because, in my mind, this is the only one that can have some chances (very very small I have to say) to be able to explain the Shroud rationally without involving the dead body of Jesus of Nazareth, while taking into account ALL THE KNOWN DATA concerning this cloth.  \nThen we could have a serious exchange you and me…\n\n","date":"March 17, 2013 at 5:00 pm","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","id":"comment-27564","author":"Yannick Clément","site":"shroudstory"},{"title":"Scorching Theory: Pseudoscience or Miracle?","post":"There is one glaring historical error or assumption in CB’s latest screed. Now he ASSUMES that  “its first recorded owner postponed display until he was safely beyond the reach of the hooded men with the hot tongs, the thumb screws, the hammered wedges, the finger/toe nail extractors, your bigger-than-average barbecue etc etc.”\nWould Colin care to enlighten is as to when the Inquisition ended? Before 1350? The Templars were safe to come out of hiding by then? It was blessed by the Church that the canons of Lirey could honor the relic of a man burned at the stake a scant four decades before. The objections to the Shroud from the hierarchy, in so far as their were objections was not that it was the relic of Jacques de Molay but that from the very beginning it was being pedaled as THE burial cloth of Christ.\nThe claim that it was EVER anywhere publicly proclaimed to be  a relic of deMolay and that a medallion was forged in his honor for public display is hog wash. No speculation please, names dates places documents connecting the Shroud to de Molay and that someone in 1350 who sought to honor a relic of de Molay would, among other things, be honored to carry the standard of the King of France into battle. I believe the fact is clear that after the King Phillip purge of the Templars, the Templars as Templars were not seen or heard from again. Unless you want to count the Masons who claimed to be their progeny.\nThere was a youth organization in the Masons called the Order of deMolay that I first encountered in college when an acquaintance was wearing a lapel pin for that organization. That was circa 1956. (And it didn’t look a bit by like the Lirey Medallion, as I recall.)  In fact, all I learned was that he was a martyr to the Catholic Church’s suppression of freedom. (My acquaintance’s  words, not mine.)\nA pseudo-skeptic is one who does not seek truth but merely to debunk anything that threatens his or her unshakable beliefs, a pseudo-scientist is one who seeks to dress his prejudices and bias in a scientific veneer. A pseudo-historian is one who engages in elaborate, inane speculation unfettered by facts.  \nThere now, I’ve wasted a good 25 minutes replying our pseudo-skeptic-scientist-historian’s latest inanity.\n\n","date":"March 17, 2013 at 10:52 am","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","id":"comment-27542","author":"John Klotz","site":"shroudstory"},{"title":"Scorching Theory: Pseudoscience or Miracle?","post":"I see desperation from both sides. One side with malliard reaction theory, a thin layer of gas diffusion between body and cloth. IMPOSSIBLE to do especially when the whole cloth is anatomically perfect. The other side, a combination of scorch and painting, yeah sure, I guess the artist knew what the photographic image would look like 800 years later. Absurd theories and a waste of time.\n\n","date":"March 17, 2013 at 5:02 pm","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","id":"comment-27565","author":"Donn Reile","site":"shroudstory"},{"title":"Scorching Theory: Pseudoscience or Miracle?","post":"There are some natural formation hypotheses (including the one proposed by Rogers) that are far from being dumb…  I think you should read my paper about Rogers quotes (http://shroudnm.com/docs/2013-01-10-Yannick-Clément-Reflections-on-Ray-Rogers-Shroud-Work.pdf).  This is a pretty good summary of Rogers’ observations and conclusions about the image and it’s hard to come out of that reading thinking that the image can be anything else than a natural image due to some kind of chemical interraction between a dead and tortured body and the surface of the cloth…\n\n","date":"March 17, 2013 at 5:19 pm","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","id":"comment-27568","author":"Yannick Clément","site":"shroudstory"},{"title":"Scorching Theory: Pseudoscience or Miracle?","post":"Of course the artist never knew what the inverted image would look like, what with that iconic luminous, serene and haunting quality. But it’s entirely an accident of modern photographic inversion. Yes, I know Secondo Pia’s inversion looks too good to be an accident, but it is, and there are experiments one can do to demonstrate it is just that – a serendipitous accident.  \nProbably few folk have ever experimented with scorches, then with charcoal or pencil drawings of those scorches (or the Shroud image) , and then photographically inverted in ImageJ, and then given a little 3D enhancement. I have!\nYes ,if you really want to understand the nature of the Shroud image, I urge you to repeat my experiments. The crudest, most amateur charcoal drawings, say of the Shroud face, show a near-miraculous transformation. Why should that be?\nThere are probably two main factors. The first is that light/dark reversal suppresses the harshness of one’s charcoal, relegating it to white space (similarly for the Shroud and model scorches)  Conversely, what is originally white space, without harshness, become promoted to image density. Already one has a marked enhancement, a hint of that distinctive haunting quality, an ability to endow a charcoal sketch with a soft-focus photographic quality – but as I say – a happy accident.  A medieval artisan producing an image by scorching off a template (‘pyrography’ aka branding) could have had no inkling that an amazing and entirely fortuitous transformation would be possible with 20th century technology,\nThere’s probably a second factor at work, a little more subtle. A scorch has no directional quality – matching a key feature of the Shroud image. That means no shadows. If one simulates that lack of directional shadowing with charcoal, the inverted image has a peculiar other-worldly look about it, as well it might, since shadows are part of our real world, so its hardly surprising that photographic inversion of a shadowless image creates a  unique combination of pseudo-positive and lack of directionality resulting in a slightly strange and unique viewing experience.\nIn short, one starts with a non-directional negative, and converts to a similarly non-directional positive, something that photographers would not normally attempt, perhaps explaining why the Shroud image is so poorly understood unless one adopts one’s own hands– a  scientific stepwise approach.\nIf anyone needs advice in using ImageJ software (freely downloadable) I’ll happily give advice.\n\n","date":"March 17, 2013 at 5:51 pm","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","id":"comment-27571","author":"colinsberry","site":"shroudstory"},{"title":"Scorching Theory: Pseudoscience or Miracle?","post":"All you say about the image don’t seem to take the blood and serum stains into account.  How can you account for these biological stains that are a sure proof that the Shroud is a real burial cloth of a real scourged and crucified man?  It’s simply impossible for someone from Antiquity or Medieval time to realize the kind of complete body image we see the Shroud (back and frontal image), starting with a bloodstained burial shroud of someone!  Why?  Because we know for a fact that the bloodstains came into the cloth before the body image and we also know that the body image is in a near perfect synchro with those bloodstains, which clearly indicate that it also come from a real corpse, just like the bloodstains.  If we want to be rational, there’s no other possibility here…  Sorry!\n\n","date":"March 17, 2013 at 6:28 pm","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","id":"comment-27572","author":"Yannick Clément","site":"shroudstory"},{"title":"Scorching Theory: Pseudoscience or Miracle?","post":"(1) The picture at the head of this posting is a coloured version of the famous Flammarion engraving, of uncertain origin and date, but is usually attributed to Camille Flammarion. Its first documented appearance is in his 1888 book  “L’atmosphère: météorologie populaire” (“The Atmosphere: Popular Meteorology”). The engraving has often, but erroneously, been referred to as a woodcut. It has been used to represent a supposedly medieval cosmology, including a flat earth bounded by a solid and opaque sky, or firmament, and also as a metaphorical illustration of either the scientific or the mystical quests for knowledge. Not all the elements of the original are clearly shown here. In particular the “wheel within a wheel” is not clear, and which seems to be a reference to a passage in Ezekiel. The pilgrim pushing his staff through the edge of the firmament may be a reference to Simplicius’ commentary on Aristotle’s Physics.  Copies of the picture quite commonly appear on the covers of certain books and magazines. \n(2) Wilson’s narrative of the D’Arcis memorandum is not the last word on this matter.  The myth of this memorandum seems to be a concoction by a liberal wing within the Catholic Church around 1905, which sought to discredit the authenticity of the Shroud, following Secondo Pia’s photography which seemed to lend support to the conservative orthodox belief that Jesus of Nazareth was a real historical person, rather than merely a mythical legend. It is unlikely that the memorandum proceeded past the draft stage, and Pope Clement is unlikely ever to have seen it. If there is any truth at all in the matter, it is quite likely that the cloth the subject of the D’Arcis complaint was in fact a painted copy commissioned by Jeanne de Vergy to replace the original Shroud which she rescued from the church at Besancon and kept before the church’s destruction by fire, and orginally placed there by her ancestor Othon de la Roche after plundering it from Constantinople and taking it to Athens. \nRe D’Arcis memorandum: “THE CONSPIRACY AGAINST THE SHROUD”; By Jack Markwardt; Copyright 2001; Examines Chevalier & Thurston’s attempt to misrepresent D’Arcis memorandum.\n http://www.shroud.com/pdfs/n55part3.pdf \nRe Shroud & Besancon:  “BESANÇON AND OTHER HYPOTHESES FOR THE\nMISSING YEARS: THE SHROUD FROM 1200 TO 1400” by Daniel Scavone, University of Southern Indiana, 2008;\nhttp://ohioshroudconference.com/papers.htm\n\n","date":"March 17, 2013 at 5:23 pm","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","id":"comment-27569","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Scorching Theory: Pseudoscience or Miracle?","post":"@comment 10:\n“All you say about the image don’t seem to take the blood and serum stains into account. How can you account for these biological stains that are a sure proof that the Shroud is a real burial cloth of a real scourged and crucified man?”\nAdler was a clever man, maybe too clever  when he tried to kill two birds with one stone – i.e. to explain away the absence of red blood cells and potassium AND the ability of dried clotted blood to transfer so efficiently behaving for all the world as though it were freshly-shed blood. \nSo we have his “serum exudate from retracted blood clots”  story which frankly I consider scarcely credible.  Close scrutiny of the Durante 2002 HD images (Shroud Scope)  suggests the red stains are far closer in their appearance to blood than to serum (and strangely gooey blood at that). They seem far too intensely pigmented and localised to be serum, or even serum from partially lysed red blood cells. The serum idea was essentially an hypothesis, not fact, so it was a huge liberty indeed unscientific, to go substituting the term “serum” for blood.  \nSo when Adler and Heller did their experiments with ‘serum-coated fibres’, adding pronase enzyme, and concluding that the “blood arrived first”, ahead of the image, one is entitled to ask precisely what was done, what was seen, what could be safely concluded, if anything \nDid they use red-coloured fibres with concentrated haemoglobin –   recognizable as “blood”?  Or were they content to use fibres that were paler in colour, more “serum-like”, whatever that means in the context of the Shroud?  How can their descriptions make any sense when the semantics are so compromised and uncertain? \nThen there’s the small matter of Adler and  Heller having strangely failed  to accompany the STURP team to Turin in ’78, so never getting to see the Shroud and its bloodstains with their own eyes.  But you could be forgiven for not appreciating that when you see their tabulations of different stained fibres and blood flakes as if seen in situ.\nPersonally, I don’t set much store by anything from Adler and Heller –  there’s simply too much mixing together of fact and hypothesis, too many liberties with terminology. You can never be sure what’s real, and what’s been assumed or even imagined. (And that’s without mentioning the bizarre ‘bilirubin story’)  So that crucial blood-first dogma of theirs needs to be checked out thoroughly.  It would hardly look good for authenticity if the image arrived  before the blood, would it?\n.\n\n","date":"March 17, 2013 at 8:50 pm","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","id":"comment-27576","author":"colinsberry","site":"shroudstory"},{"title":"Scorching Theory: Pseudoscience or Miracle?","post":"Colin, in your analysis, you seem to forget that Adler and Heller’s conclusion about the fact that the blood on the Shroud come from exudates of blood clots has been INDEPENDENTLY CONFIRMED by Baima Bollone in Italy.  And by the way, may I suggest you to read the very good book “A doctor at calvary” written during the 50s by the French Doctor Pierre Barbet?  In it, you’ll see that Adler never invented the idea that the blood on the Shroud came from exudates of humid blood clots!  Barbet was already claiming this in the 30s!  In sum, Adler and Heller (as well as Baima Bollone) only scientifically confirmed Barbet’s hypothesis!  That speaks very loud to me and I don’t see any good reason to doubt that particular conclusion.   And concerning the absence of an image under the blood and serum stains, all the skeptics are always putting this conclusion in doubt but I never saw any great argument that can really challenge it with some scientific credibility.  Of course, it would be nice to see some independent confirmation of that conclusion in the future but right now, mainly because of the great professionalism of someone like Adler concerning any blood issues, I don’t see any good reason to put this into serious doubt.\n\n","date":"March 18, 2013 at 1:06 pm","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","id":"comment-27663","author":"Yannick Clément","site":"shroudstory"},{"title":"Scorching Theory: Pseudoscience or Miracle?","post":"The willing suspension of disbelief is OK for those who are about to dip into a novel.  You seem to imagine that scientists can operate on that basis too. They can’t. The  general rule is “Take nobody’s word for it…”\nAdvice I used to give my PhD students: “If it looks too good to be true, then it probably isn’t…”\nI’m giving up on this site (again), and have just put up my first post on a site addressed specifically to Sir Paul Nurse, President of the UK’s Royal Society. I shall drop him a line in a week or two, alerting him and his Fellows to its existence.\n\n","date":"March 18, 2013 at 1:27 pm","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","id":"comment-27667","author":"colinsberry","site":"shroudstory"},{"title":"Scorching Theory: Pseudoscience or Miracle?","post":"Good points Yannick, although it falls on deaf ears. It should also be stressed that Dr Barbet had extensive ‘experience’ in battle field surgery, giving him extensive experience with blood soaked linens and in different time spans and conditions. So if he states the blood on the Shroud looks to him as exudates of blood, who in thier right mind can argue with him? …PLease let’s give these experts some due credit.\nR\n\n","date":"March 18, 2013 at 3:04 pm","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","id":"comment-27679","author":"Ron","site":"shroudstory"},{"title":"Scorching Theory: Pseudoscience or Miracle?","post":"On the other hand, Ron, you should also realize that this hypothesis of Barbet, as well as the conclusion of Adler concerning the very particular nature of the blood on the Shroud (i.e. exudates of blood clots) is in TOTAL CONTRADICTION with Zugibe’s own hypothesis concerning the transfer of the scourge marks that came, in his opinion, because of a partial washing of the body, which would have allowed some fresh oozing of post-mortem blood that would have stained the cloth.\nSorry but it’s one or the other! No one can hold both hypotheses together.  And because Adler tell us that the blood on the Shroud really show all the characteristics of exudates of blood clots, I don’t know why we should still consider Zugibe’s hypothesis as a plausible explanation for the transfer of the scourge marks.  By the way, if Zugibe was right about that, then can you explain to me why there are absolutely no smudges on the cloth, especially in the back region where a high pressure was present because of the weight of the body?  Seriously, that just doesn’t sound right at all and, also, such an hypothesis doesn’t even consider Adler’s solid conclusions about the blood.  So, I think it’s time to say:  goodbye to Zugibe’s hypothesis of a partial washing of the body!\nAll the data and observation coming from the Shroud really seem to indicate that the corpse was rapidly laid down in the cloth and that it was still covered of blood clots and dirt, while there was probably enough time between the death and the entombment for a complete drying of the sweat on the skin and in the hair…  These data and observation are TOTALLY CONSISTENT with the Gospel accounts.  That’s pretty amazing to note.\n\n","date":"March 18, 2013 at 3:43 pm","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","id":"comment-27682","author":"Yannick Clément","site":"shroudstory"},{"title":"Scorching Theory: Pseudoscience or Miracle?","post":"Dear CB,\nHeller while an undergraduate at Yale, was advised by Einstein at Princeton. One or twice a year year he would travel from New Haven to Princeton to be counseled. In his book, Report on the Shroud of Turin (have you ever bothered to read it) he tells how he and Adler adopted the technique he learned from Einstein of the Gedenkenexperiment (thought experiment). Thinking the problem through as to what a forger must have known and done to create the Shroud, they concluded that it was not a forgery.\nTell me CB, how many  Nobel Prize winners mentored you while an undergraduate? They might have had a problem since you your head seems be permanently stuck where the sun don’t shine.\n\n","date":"March 18, 2013 at 9:23 am","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","id":"comment-27639","author":"John Klotz","site":"shroudstory"},{"title":"Scorching Theory: Pseudoscience or Miracle?","post":"While the site owner continues to allow this kind of comment I shall (yet again) absent myself.\n\n","date":"March 18, 2013 at 9:31 am","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","id":"comment-27640","author":"colinsberry","site":"shroudstory"},{"title":"Scorching Theory: Pseudoscience or Miracle?","post":"\nYannick Clément :On the other hand, Ron, you should also realize that this hypothesis of Barbet, as well as the conclusion of Adler concerning the very particular nature of the blood on the Shroud (i.e. exudates of blood clots) is in TOTAL CONTRADICTION with Zugibe’s own hypothesis concerning the transfer of the scourge marks that came, in his opinion, because of a partial washing of the body, which would have allowed some fresh oozing of post-mortem blood that would have stained the cloth.\nSorry but it’s one or the other! No one can hold both hypotheses together. And because Adler tell us that the blood on the Shroud really show all the characteristics of exudates of blood clots, I don’t know why we should still consider Zugibe’s hypothesis as a plausible explanation for the transfer of the scourge marks. By the way, if Zugibe was right about that, then can you explain to me why there are absolutely no smudges on the cloth, especially in the back region where a high pressure was present because of the weight of the body? Seriously, that just doesn’t sound right at all and, also, such an hypothesis doesn’t even consider Adler’s solid conclusions about the blood. So, I think it’s time to say: goodbye to Zugibe’s hypothesis of a partial washing of the body!\nAll the data and observation coming from the Shroud really seem to indicate that the corpse was rapidly laid down in the cloth and that it was still covered of blood clots and dirt, while there was probably enough time between the death and the entombment for a complete drying of the sweat on the skin and in the hair… These data and observation are TOTALLY CONSISTENT with the Gospel accounts. That’s pretty amazing to note.\nI have no issue with that. My position has always been that Zugibe is only partially right in his assurtions. I believe the body may have been only partially washed and a clue is the fact there is no dirt on the body, except for a few well known areas; heel of the foot, knees and nose; Where is all the dirt?. Jewish customs did not allow ‘life-blood’ to be washed off the body, that is where I believe Zugibe makes his error. But even a partially washed body, carefully avoiding any lifeblood areas, and immediately encased in a Shroud could possibly re-moisten the main blood encrustations.\nR\n\n","date":"March 18, 2013 at 3:58 pm","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","id":"comment-27686","author":"Ron","site":"shroudstory"},{"title":"Scorching Theory: Pseudoscience or Miracle?","post":"Ron, you must understand one important thing about Zugibe’s hypothesis versus the reality of the bloodstains on the Shroud, which is this : the absence of any smudges of blood on the cloth doesn’t fit at all with his hypothesis!  As far as I know, Zugibe never addressed that problem in his writings and, more than that, he never tried to reproduce the kind of blood transfer he proposed with a real adult body and a linen cloth. That’s crucial because if he would have done this, it is EVIDENT that he would have obtained some important smudges on his cloth! There is no way he could have obtained the perfectly bordered wounds we see on the Shroud that correspond to the scourge wounds, especially in the back region where there was an intense pressure present because of the weight of the body.  The fresh oozing of post-mortem blood in a liquid form that he proposed and that would have come from a vigorous washing of the wounds would never have been able to cause the perfect mirror images of the scourge wounds we see everywhere on the cloth. PERIOD. As Barbet wrote in his book, when there is a transfer of liquid blood on a fabric, the blood tend to follow the weave pattern of the cloth and, because of this, cause a stain that is not perfectly bordered like the ones on the Shroud. Like Barbet said, the only way we can obtain such a perfect mirror image of a wound on a cloth is by a transfer process involving exudates of blood that come from a humidified (or a re-humidified) blood clot.  And that’s the reason Barbet conclude that there was only one part of the Shroud that has been stained with liquid blood and that’s in the region of the feet (because of a post-mortem bleeding of the crucifixion wounds AFTER the body had been laid down in the Shroud). Note that it is also possible that there was some staining of the cloth in the lower back region with post-mortem blood in a liquid form but it’s hard to be sure because these stains can also have been caused by some very fresh clots that were still very humid. And there is another very important fact that indicate that Barbet was most probably right about the blood transfer coming from exudates of blood clots, which is the particular characteristic of the bloodstains analyzed by Adler and Heller that really fits with the idea of an exudate of a blood clot (incomplete blood, which can offer a scientific and rational explanation for the absence of potassium) instead of a complete post-mortem blood.  Finally, there is one more very important reason to accept the hypothesis of Barbet concerning a staining of the cloth with an exudate of blood clots and that’s the presence of a halo of serum around almost every bloodstains (including all the scourge wounds), which is a very strong indicator of that particular kind of transfer on a cloth. Note that the presence of these serum stains has been scientifically confirmed by Pellicori and Miller when they did a good study of the UV fluorescence photos of the Shroud. On that subject, it’s crucial to understand that the fresh oozing of liquid blood after an intense washing of the wounds, as it was proposed by Zugibe, would never have left such halos around the bloodstains because when a liquid blood is drying on a horizontal surface, the clot retraction is not able to create the halos of serum we see on the Shroud and that has been scientifically proven by Lavoie in the 1980s when he did some blood transfer experiments. Effectively, to get the good serum halos around the bloodstains like we see on the Shroud, Lavoie said that the clotting must come when the body is in a vertical position, which is totally consistent with the idea that most of the blood drying on the Shroud man’s body happened when he was still on the cross (before and after his death). For all these reasons, I think Zugibe’s hypothesis concerning a partial washing of the Shroud man’s body must be set aside for good.\n\n","date":"March 19, 2013 at 8:30 am","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","id":"comment-27781","author":"Yannick Clément","site":"shroudstory"},{"title":"Scorching Theory: Pseudoscience or Miracle?","post":"Yannick,\ndid you read Zugibe’s book: ” The crucifixion of Jesus. A Forensic Inquiry” Second Edition?\nPlease, remember that Zugibe is probably the most important expert in forensic science involved in TS studies: Chief Medical examiner of Rockland County, New-York, from 1969-2003, adjunct Professor at Columbia University College of Physicians and Surgeons and President of the Association of Scientists and Scholars International for the Shroud of Turin.\nYou can not rule out his opinion so easily.\nThere are too many things to discuss regarding your post above.\nBut before that, please answer to my question.\nThibault.\n\n","date":"March 22, 2013 at 4:59 pm","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","id":"comment-28090","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Scorching Theory: Pseudoscience or Miracle?","post":"Nope with YC, his mind is set the wrong way around. When there is compelling evidence  the Turin Sindon heamatic cartography is clean and neat, he just cannot care less and just dismisses the idea of even a speedy purification/washing ritual.\nAnd what does YC make of the 3 different conjugated koine Greek verbs used by the 4 evangelists meaning bind/fasten – compress/wrap up – wind/encircle and the koine Greek word for ‘shorter shrouds/pieces of linen’ (othonia). Nothing. He just cannot care less and still claim the body was just draped over… beside he cannot read koine Greek. What does he make of the fact it is written Yeshua was buried according to the JUDEAN burial custom? Nothing again. He just cannot care less. The burial time frame between Yeshua’s death on the cross and the apparition of the 3rd star heralding Shabbath is 4 hours. No problem, he keeps claiming Yeshua’s burial was dispatched in less than half an hour. Nope.\n\n","date":"March 18, 2013 at 4:44 pm","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","id":"comment-27693","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Scorching Theory: Pseudoscience or Miracle?","post":"Max, don’t mix thing up please!  I was talking about the many pieces of evidence of a hasty burial that come from the Shroud and put these in relation with the many pieces of evidences taken from the Gospels that strongly suggest that Jesus’ burial was done in haste.  I wasn’t talking about the question of whether or not the Shroud was tied up around the body, which is a totally different question that has nothing to do with the question of whether or not the burial of Jesus was done in haste.  Tying up an enshrouded body with linen strips just take a few seconds, so if it is really what was done to the body (I seriously doubt that, but let’s presume for a second), then this could well have been done during an hasty burial…\nAnd concerning your 4 hours gap between the death of Christ and the beginning of the Sabbath, you forget to consider that the body was most certainly kept on the cross for a few hours before Joseph could get to Pilatus and get permission to remove the body.  And even then, he wasn’t allowed to take it right away just like that.  The Romans wanted to make sure he was dead by stabbing the corpse in the chest region and only then, Joseph was allowed to take down the corpse. We don’t know if this procedure was done really fast or if Joseph had to wait again several minutes or hours before they did it.  I’m not sure there was a lot of time after the body was taking down from the cross…  Also, if the Sudarium of Oviedo is genuine and if the study done by the Spanish team is correct, then that mean the body only reached the tomb several hours after the death of Christ…  In that context, there was not a lot of time left to do the burial.\n\n","date":"March 19, 2013 at 10:52 am","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","id":"comment-27794","author":"Yannick Clément","site":"shroudstory"},{"title":"Scorching Theory: Pseudoscience or Miracle?","post":"YC you wrote: “In that context, there was not a lot of time left to do the burial.” In all likelihood (re Hebrew time markers + Second Temple period Jerusalem topology + PessaH haste), the time frame left for Yeshua’s burial is 2 hours-2 hours and a half. This is enough for 5-6 buriers to perform three of the four core procedures (wrapping in shroudS, speedy purifying and drying).\n\n","date":"March 19, 2013 at 1:10 pm","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","id":"comment-27806","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Scorching Theory: Pseudoscience or Miracle?","post":"That’s not what the Gospels told us…\n\n","date":"March 19, 2013 at 3:58 pm","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","id":"comment-27826","author":"Yannick Clément","site":"shroudstory"},{"title":"Scorching Theory: Pseudoscience or Miracle?","post":"YC; “Tying up an enshrouded body with linen strips just take a few seconds,…” Partially washing/dabbing the body, excluding ‘lifeblood” areas would also only takes a few minutes. Yannick you ignore the HUGE fact that there is no dirt found anywhere on the shroud/body image except for what as previuosly been mentioned…How do you account for this? The burial may have been hasty but not so much that certain customs according to Jewish burial law were not performed. If one studies the timing concluded by the Edices in Spain on the Sudarium “closely”, one would understand that there was plenty of time, to accomplish the burial. Remember the Sabbath did not start till sunset.\n\n","date":"March 19, 2013 at 4:07 pm","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","id":"comment-27830","author":"Ron","site":"shroudstory"},{"title":"Scorching Theory: Pseudoscience or Miracle?","post":"YC wrote: “that’s not what the Gospels told us…”. Do you really mean the Gospels tell us the long burial cloth was just draped over  Yeshua’s body? Do you really mean, Joseph of Arimathea waited to the very last minute to buy a burial cloth and then ask Pilate for his master’s body just before sunset? Are you kidding? If you only rely on Mark, the beloved disciple is absent from the empty tomb scene… If you rely on John, both Peter and the beloved disciple are present etc. Can you tell me exactly how many buriers were in attendance  on Yeshua’s burial, two, three, four, five six or more? How many buriers do you think were needed then?\n\n","date":"March 19, 2013 at 5:15 pm","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","id":"comment-27835","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Scorching Theory: Pseudoscience or Miracle?","post":"Typo: meaning bound/fastened – compressed/wrapped up – wound/encircled\n\n","date":"March 18, 2013 at 4:51 pm","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","id":"comment-27694","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Scorching Theory: Pseudoscience or Miracle?","post":"+ typo (sorry): the large CLOTH was just draped over the bdy\n\n","date":"March 18, 2013 at 4:55 pm","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","id":"comment-27695","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Scorching Theory: Pseudoscience or Miracle?","post":"\nMax Patrick Hamon :YC you wrote: “In that context, there was not a lot of time left to do the burial.” In all likelihood (re Hebrew time markers + Second Temple period Jerusalem topology + PessaH haste), the time frame left for Yeshua’s burial is 2 hours-2 hours and a half. This is enough for 5-6 buriers to perform three of the four core procedures (wrapping in shroudS, speedy purifying and drying).\nMax, I’m not sure what ‘markers’ you may be speaking about. (can you elaborate?) Have you studied the findings by the Edices on the Sudarium?. Now assuming the sudarium is what it is claimed to be and was the actual ‘napkin’ as purported by John, then we have a very close timing to the events. This timing would place the arrival at the tomb sometime around 6pm, give or take. This is assuming the 9th hour was 3pm of course. This would leave, depending on what date one agrees with approximatley 40-50 minutes to complete the burial, as far as I can discern.\nR\n\n","date":"March 19, 2013 at 4:22 pm","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","id":"comment-27832","author":"Ron","site":"shroudstory"},{"title":"Scorching Theory: Pseudoscience or Miracle?","post":"Ron, I already commented at length on it (Hebrew time markers and Yeshua’s most likely burial time-frame) on this very blog. Please check. Thank you.\n\n","date":"March 19, 2013 at 5:19 pm","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","id":"comment-27837","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Scorching Theory: Pseudoscience or Miracle?","post":"Sorry Max, I may have missed it. Can you point me to your comment(s), I am interested in what pointers you speak of.\nThanks,\nR\n\n","date":"March 19, 2013 at 6:03 pm","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","id":"comment-27840","author":"Ron","site":"shroudstory"},{"title":"Scorching Theory: Pseudoscience or Miracle?","post":"\nMax Patrick Hamon :YC wrote: “that’s not what the Gospels told us…”. Do you really mean the Gospels tell us the long burial cloth was just draped over Yeshua’s body? Do you really mean, Joseph of Arimathea waited to the very last minute to buy a burial cloth and then ask Pilate for his master’s body just before sunset? Are you kidding? If you only rely on Mark, the beloved disciple is absent from the empty tomb scene… If you rely on John, both Peter and the beloved disciple are present etc. Can you tell me exactly how many buriers were in attendance on Yeshua’s burial, two, three, four, five six or more? How many buriers do you think were needed then?\nAgain pointing to the Edices’ conclusions; we could state quite reasonably ‘atleast’ 3 people were present, as there would have been two persons needed to carry the body, and one tagging along clutching the sudarium to the nose/mouth of the victim’s face. It is very unlikely one could manage the burden of carrying and clutching simultaneously, hense three persons for sure. Most likely Joseph, Nichodemus and John. Whether Mary, the mother of Jesus or Mary Magdalene were present at the tomb is questionable. It would certainly be expected but obviously not stated. One could easily accept they were several people present to help in the burial proceedings. Making it quite plausible a hasty but mostly complete burial ritual was concluded in time.\nR\n\n","date":"March 19, 2013 at 6:25 pm","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","id":"comment-27844","author":"Ron","site":"shroudstory"},{"title":"Scorching Theory: Pseudoscience or Miracle?","post":"On March 17, 2012 (that is more than one year ago) I wrote: “(YC) currently keeps rehashing Rabbi Yeshua’s burial was made in haste after sunset (that is within about half an hour or so) and his shroud just draped about his body or loosely bound for the women to wash and anoint his body at the first morning hour of the first day of the Hebrew week, that is just after the Shabbat, on the third day of Yeshua’s death. Such a view (or should I better say “preaching”) presupposes:\n1/Yossef Ha-Ramathayim (both a member of the Sanhedrin/Judean Supreme Court and a secret disciple of Rabbi Yeshua), waited until shqiya/sunset (18:08/18:38 p.m.) that is a minimum of 3 hours AFTER his master’s violent death on the Golgotha (at 15:04/15:34 p.m.) BEFORE he actually went to Pilate’s and ask him for Yeshua’s body and then bought a linen shroud to bury him. Are you serious? Do you really think Yossef Ha-Ramatayim would have also run the risk not to abide by Deuteronomy 21: 22-23 and wait to the very last minute for taking down himself or having Rabbi Yeshua’s body be taken down from the cross and buried?\nIt does seem you totally overlook “one little circumstantial fact”: in the Second Temple period, any working activity was to stop at midday “on preparation day” that is on the very eve of the great Shabbat of PessaH/Passover (PessaH 4, V). How then could possibly Joseph of Aramathia have bought a shroud after sunset and before dusk on that specific day when Jerusalem weavers’ workshops, stores and shops had all been closed for more than 6-6½ hours? This is a total exegetical non sense.\nUnless one is ignorant of the ethnic milieu and thinks a Judean of the Second Temple period would have waited until sunset on “preparation day” and go and buy a shroud long after all the weaver’s workshops and linen shops had closed, this reconstruction of the event chronology is most unlikely. In all likelihood, Yossef Ha-Ramathaym had already bought a fine linen shroud for himself in anticipation of his own death and used it to wrap Yeshua’s body “with his shed innocent blood”. As a disciple of Yeshua, didn’t Yossef go as far as using his own recently hewn garden-tomb near-by to bury his master executed as a criminal and thus to both abide by Sanhedrin 6: 46b and spare some precious time to proceed to his burial?\n[Precision: the women bought the spices not just BEFORE but just AFTER the sabbatical rest. Mark (16: 1) raises the ambiguity which could result from the chronologically biased relation/presentation of the same fact in Luke (23: 56).]\n2/ Modern time markers such as ‘evening’, ‘sunset’, ‘twilight dusk’ philologically cover the same realities for a Judean of the Second Temple period. Far from it!\nWith respect to the time frame for Yeshua’s burial, here are the ancient biblical Hebrew words & expressions for the time markers from noon to night used in the Second Temple period yet currently overlooked by Shroud researchers/old students and exegetes:\n1/Tsot ha-yom (or “midday”) refers to that time of the day at equal distance between sunset and sunrise.\n2/Tsohorayim (dual form of Tsohar, “dazzling light” or “zenith”) literally means “two dazzling lights” or “two zeniths” and refers to ‘both morning and evening lights’ merging into ‘noon’.\n3/Erev (“evening”) may indifferently refer to the 1st or the 2nd evening. Rabbi Yeshua died exactly between the first and the second evening (at the 9th hour).\n4/Beyn ha-arbayim literally means “between the two evenings,” —- arbayim being the dual form of erev, “evening.” The afternoon was divided into two halves: from noon to mid afternoon and from mid afternoon to sunset or put in other words from early to late evening (See Exodus 29:38-41, “They shall slaughter it [the paschal lamb]… beyn ha-arbayim”). For the covenant people, the entire day revolved around the offering of the two Tamid lambs: that of the morning and that of the evening. “In a paper entitled « En Vue de la Solution Archéologique de l’Énigme » I presented in Turin in 1998, I wrote: « Le deuxième sacrifice quotidien du Temple (Numbers 28: 4-8) dit sacrifice du “soir” (evening sacrifice) se déroulait vers le milieu de l’après-midi (mid afternoon) et pouvait être avancé d’une heure (une veille de Pâque) voire même de deux heures (lorsque cette grande fête tombait un Shabbat) (PessaH 5:1). le premier sacrifice avait lieu le matin. Ainsi “le premier soir” allait-il du milieu du jour (from midday) jusqu’à la deuxième immolation en milieu d’après-midi (until mid afternoon) et, « le deuxième soir », de la deuxième immolation du milieu d’après-midi (from mid afternoon) jusqu’au crépuscule du soir (until twilight/dusk)».”.\n5/Shqiya, “sunset”; the sun set at 18:38 p.m. on April 7th 30CE and 18:08 p.m. on April 3rd 33 CE.\n6/Beyn ha-shemashot which literally means “between the suns” is an expression for “dusk” or “twilight” between the setting sun and the rising moon (which reflects the light of the sun).\n7/Layla, “night”; typically layla is taken to be when you can see three stars in the sky in reference to tset ha-kokhavim, the first “three stars coming out” to announce a new day (here the great Shabbat of PessaH). The 3rd star respectively appeared at 19:38 p.m. on April 7th 30CE and19:08 p.m. on April 3rd 33 CE. Owing to a lunar eclipse or the Ruah Qadīm, “east wind” (Khamsin/Sharav); a wind blowing from the desert of Judea, the whole city of Jerusalem was plunged into darkness from tsohorayim (“noon”) to beyn ha-arbayim (“between the two evenings” that is the 9th hour of the day; 15.34 p.m. on April 7 30 CE/ 15.04 p.m. on April 3 33 CE). In other words, for 3h34/3h04, on the very day Rabbi Yeshua died on the cross, it was also night, “layla” on that very day in the eye of a Judean of the Second Temple period.\nHence, the actual maximum time-frame for Rabbi Yeshua’s burial was 4h04. If we now take off 30-45mn to Pilate’s and back + 30-45mn to take down Yeshua’s body from the cross and carry it to the garden tomb near-by, we are left with a minimum time-frame of about 2h30. It totally rules out the pseudo “0h30” left for Yeshua’s burial time-frame burial as the very notions of ‘evening’, ‘sunset’ ‘twilight dusk’ and ‘night’ as time markers, do not philologically cover the same realities for a Judean as they do for a 20th-21st reader relatively or totally unfamiliar with the Judean ethnic milieu of the Second Temple period.\nWithin a minimum of 2h30, Rabbi Yeshua’s buriers had enough time to pre-wash his body (i.e. to re-dampen most of his wounds – to the sole exception of those likely to flow so as to keep his blood with his body as much as possible), purify his shed innocent blood via his lengthy inner shroud (Gr. sindôn/Heb. sadin) soaked with a watery solution (ashes of the Red Heifer?) and tightly wrap it up, with fresh aromatic medical insect repellent plants, in linen clothes and strips.\nIn the Judean ethnic milieu of the time, the tradition was to visit the deceased on the three days immediately following his burial. Anointment was part and parcel of the Judean burial rite as it allowed preventing bad smells on those subsequent visits. Because this part of the rite was not done, the women had to buy and prepare spicy oils to anoint Rabbi Yeshua after the Sabbath and come back to the tomb very early on the third day. They definitely had not to wash the deceased’s naked body at all but just to anoint his linen wrappings. Hence, to the sole exception of the anointment ritual, Rabbi Yeshua’s “primary” burial rite according to the Judean funerary custom of the Second Temple period might well have been duly completed within a minimum of a two-hours-and-a-half time-frame.”\n\n","date":"March 20, 2013 at 6:05 am","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","id":"comment-27882","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Scorching Theory: Pseudoscience or Miracle?","post":"On March 24, 2012, I also wrote: “Both historically and archaeoastronomically speaking, here is the best alternative to account for the darkening of the sun on Yeshua’s death on the cross:\n-Either it did actually happen one “April 7th of 30 CE” and if so, the “black breath” of the Ruah qâdim (“east wind”, also called Sharav/Khamsin), blowing from the desert of Judea, is the most likely phenomenon to have occurred to account for the darkening of the sun.\n-Or it did actually happen one “April 3rd of 33 CE” and if so, the same “black breath” or dust tempest has been followed by the rising of a moon already bloody/in eclipse that evening/second evening, thus fulfilling Joel’s prophetical “blood moon” vision (Joel 2:31).”\n\n","date":"March 20, 2013 at 6:17 am","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","id":"comment-27884","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Scorching Theory: Pseudoscience or Miracle?","post":"A few days ago, Ron wrote this: “I believe the body may have been only partially washed and a clue is the fact there is no dirt on the body, except for a few well known areas; heel of the foot, knees and nose; Where is all the dirt?”\nMy answer:  Obviously, most of the dirt that stained the Shroud had been lost a long time ago due to the vicissitude that piece of cloth endured all over the years (including a lot of folding/unfolding and many rolling on a stick).  Nevertheless, if we believe the report written by Nitowski in the 1980s about the analysis she and Kohlbeck did on many samples taken from the Shroud by Ray Rogers, there is still many microscopic particles of aragonite dirt scattered all over the cloth and what is the most important thing to note (beside the very good chemical match between that aragonite and the one found in a 1st century tomb near the reported Golgotha) is the FACT that there is a very good correlation between the amount of aragonite particles and the most probable configuration of the enshrouded body inside the tomb, which mean that there are more particles stuck inside the weave of the dorsal part of the Shroud than the frontal part of the Shroud.\nThe fact that there were only some very specific areas (foot, knees and nose) where that dirt was truly visible with the naked eyes is a pretty clear indication that there were the most stained body parts of the Shroud man.  \nAll this surely doesn’t exclude an hasty burial done without any washing of the Shroud man before he was put inside the Shroud…\n\n","date":"March 21, 2013 at 3:42 pm","url":"https://shroudstory.com/2013/03/17/scorching-theory-pseudoscience-or-miracle/","cat":"image_theory","id":"comment-27991","author":"Yannick Clément","site":"shroudstory"}]
