[{"title":"Secret Image Made With Invisible Ink","post":"I like this avenue of thought very much. I wonder if the human body might excrete a bodily fluid that mimics ‘invisible ink’ (i.e. lemon juice). Might a crucified victim’s sweat have been naturally altered somehow to become more acidic? If a person can sweat blood (a medically documented phenomenon) what other unusual sweats might occur? Or did the sour wine mix with the sweat on the body (or after being consumed).\nAnd what then was the heat source that carbonizes the image? Light? Radiation?\nWhat if, as has been speculated before, the linen contained no discernible image at first (but was still kept because of the blood stains). Then the linen was held close to lamps or candles to be shown and the heat carbonized the image. This might have occurred months, perhaps years, later.\nThese are authentist avenues, of course Colin will be more interested in the artisan avenues. Either way it’s a fascinating path to tread.\n\n","date":"September 29, 2014 at 2:11 pm","url":"https://shroudstory.com/2014/09/29/secret-image-made-with-invisible-ink/","cat":"image_theory","id":"comment-157738","author":"David Goulet","site":"shroudstory"},{"title":"Secret Image Made With Invisible Ink","post":"Wouldn’t the relative uniformity of the image represent a challenge to the possibility that the image was created by any sweat by-product?\nThe density of sweat glands is hardly uniform, even if the subject was sweating so profusely that he was literally covered from head to toes in sweat that hypothesis would still face the same issues of the MR and other “natural reaction” theories. You can’t disregard the fact that the back was supposed to be lying directly on a flat surface and the distribution of liquid/gases/et al. would not be uniform.\n\n","date":"September 30, 2014 at 7:25 am","url":"https://shroudstory.com/2014/09/29/secret-image-made-with-invisible-ink/","cat":"image_theory","id":"comment-157959","author":"Eric","site":"shroudstory"},{"title":"Secret Image Made With Invisible Ink","post":"I should have used “fluids” instead of “liquids”, but you get the idea.\n\n","date":"September 30, 2014 at 7:29 am","url":"https://shroudstory.com/2014/09/29/secret-image-made-with-invisible-ink/","cat":"image_theory","id":"comment-157961","author":"Eric","site":"shroudstory"},{"title":"Secret Image Made With Invisible Ink","post":"A very valid point.\n\n","date":"September 30, 2014 at 12:44 pm","url":"https://shroudstory.com/2014/09/29/secret-image-made-with-invisible-ink/","cat":"image_theory","id":"comment-158021","author":"David Goulet","site":"shroudstory"},{"title":"Secret Image Made With Invisible Ink","post":"That’s a lot of lemons to spread over a cloth of 8m^2.  However it seems we may be tracking back to a chemical origin of the image.  I’m sure I read recently, that quasi-crucifixion victims during the Nazi era were found to sweat profusely, more so if they had been previously traumatised.  Would that do it?\n\n","date":"September 29, 2014 at 3:44 pm","url":"https://shroudstory.com/2014/09/29/secret-image-made-with-invisible-ink/","cat":"image_theory","id":"comment-157759","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Secret Image Made With Invisible Ink","post":"Typo, I nodded:  cloth area ~ 4.73 m^2 …\n\n","date":"September 29, 2014 at 4:49 pm","url":"https://shroudstory.com/2014/09/29/secret-image-made-with-invisible-ink/","cat":"image_theory","id":"comment-157775","author":"daveb of wellington nz","site":"shroudstory"}]
