[{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Good, responsive, right- on- the- ball posting, Dan. All it lacks is labelling  (but we’ll forgive you that). All you need to do is take the top row of Hugh’s graphics and read them across as (1) Image 1,  (2) Image 2 (Shroud)  then (3) Image 1 (post 3D enhancement in ImageJ) then  (4) Image 2 (Shroud, in case you forgot) after 3D enhancement. \nThen do the same for the second row.\nThen do the same for the third row.\nWell, I leave it to others to decide whether the Shroud 3D- enhancement gives a better result that that applied to modern photos.Personally I see no reason why it should (entirely different image-capture technology, one 19th century, the other, er, 14th or 1st century).\nBut Dan never took up my challenge to supply his own chosen B/W photo, and then allow this iconoclastic  ImageJ aficionado play around with it, to see what he could achieve (like turning  it into a soft-focus, luminous, ghostly, Secondo Pia-copyright protected awe-inspiring image). \nBut it’s still a good blog. Keep them coming Dan.\n\n","date":"November 3, 2013 at 2:21 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49779","author":"colinsberry","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"It seems to me that nothing is clear about the 3-D characteristics of the TS.\nThe images provided by Hugh show that. Look at them carefully.\nYou will see that J Image does not work like the VP8, except for the first image (top left) and its “3D” counterpart.\nI’ll try to explain that later but have a look here (in French, sorry):\nhttp://www.suaire-science.com/documents/3D_mignot.pdf\nIt is a document made by an expert showing why the TS image do have true 3D properties while 2 different pseudo-shroud images are very different \nThis can help.\n\n","date":"November 3, 2013 at 4:49 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49800","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Do we need to discuss VP8? Are there grounds for thinking that it is any more valid as a 3D-enhancement tool than the free-downloadable ImageJ?  What is the meaning of valid anyway, given that the best 3D-enhancements are still 2D, viewed on a page or screen, no matter which criteria are applied. The best 3D is simply 2D that deceives the eye, so there must inevitably be subjective factors at play in discussing the merits of one method against another, even if deploying additional tools like layered colour to compare “3D-ness” as in the paper you cite (which incidentally I found almost unintelligible in parts, despite being able to call on my wife’s language skills – and she too said she could extract little meaning from the final conclusions).\nIf we are to restrict ourselves to objective scientific as distinct from subjective aesthetic ones, then what we need is an agreed standard for assessing the 3D-ness of a 2D image. That could take the form, as I suggested earlier (and have previously experimented with) of starting with an agreed 3D object, converting to 2D images by different means, and then seeing which software programs do the best job of re-creating the “look” of the original. What we cannot do is take the Shroud image as our standard, since we don’t know how well it resembled the subject whose image was imprinted,\n\n","date":"November 3, 2013 at 8:29 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49811","author":"colinsberry","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"A naive comment, perhaps, but if you analyze these additional photographs with the VP-8, are the results similar?  I’m guessing that analysis with modern software is based on similar principles, but is this the exact equivalent?  \nDuring a visit with Kevin Moran last year, I took the starkest black & white photo I could find (Meet the Beatles cover) and looked at it with the VP-8 side by side with some Shroud photograph-wasn’t very similar at all-imaging of the Fab Four was similar to the distortion of William Ercoline (normal) photo shown in Heller’s book.\nBTW, is there some information missing in that Nixon photograph?\n\n","date":"November 3, 2013 at 2:22 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49780","author":"Kelly Kearse","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"I think the 3D properties are indeed a bit of a red herring. But here’s a question that will show my ignorance but I’ll ask anyway: The 3D properties teased from the Shroud, were they drawn from the Shroud itself or only photographs of it? I mean the examples provided in this post are of two types: photos of real 3D people and one (the Shroud) of a picture of a 2D piece of linen. Or a picture of a picture if you will. Apples and oranges,no?\n\n","date":"November 3, 2013 at 2:24 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49781","author":"David Goulet","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Hi David, I don’t know if you can do it directly from the Shroud because it would produce a moiré pattern unless you reduce the optical resolving power. Capturing the Shroud on a photo inherently reduces the resolving power, which will eliminate the moiré pattern. However, I believe the photograph is a registered image in a sense that the image frequencies are in register to the convergent screen lines produced from the herringbone twill pattern. So I would conclude that the photo does accurately produces the 3 D affect that is inherent from the original source.\n\n","date":"November 3, 2013 at 2:47 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49785","author":"Giorgio","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Wait, I see one the photos is also a picture of a picture.as i see fingers (so that would be closer to apple to apple). But what this actually drives home for me is just how unique the Shroud (whatever century it was formed in) is. It shows as well or better than most of these modern pics. We’re talking about a micron-thick image on a piece of linen created before photography exists — yet it has the exact same qualities of a modern pic-of-a-oic. Wow.\n\n","date":"November 3, 2013 at 2:32 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49783","author":"David Goulet","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"“We’re talking about a micron-thick image on a piece of linen created before photography exists — yet it has the exact same qualities of a modern pic-of-a-oic. Wow.”\nBut one gives an image on a light-sensitive silver-salt emulsion, relatively sophisticated 19th century technology, but needing a lens to produce a sharp inverted image,  while the other needs only linen as a thermosensitive layer of fragile carbohydrate, susceptible to scorching, with no need for a converging lens. In other words, branding, as applied to cattle rumps. Wow  ;-)\n\n","date":"November 3, 2013 at 2:46 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49784","author":"colinsberry","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Can you provide examples, as Hugh has, of the 3D properties of this ‘cattle branding’ method. That would be great for comparison too.\n\n","date":"November 3, 2013 at 3:30 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49792","author":"David Goulet","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"I could do that David, once I’ve searched my own cobweb-festooned archive. Better still – do it for yourself. Get a piece of metal or brass that has some rounded contours to it – even a coin would do-  or better still a medal or medallion (I used to know the difference). Heat it on a cooker ring  until it scorches a test scrap of fabric. Then press against cloth, preferably linen or cotton to get a scorch. Take a photograph on your digital camera or phone. Then download ImageJ onto your laptop. I’ll tell you which keys to press, but it’s basically about entering into its 3D enhancement program. \nSee it with your own eyes. Thermal imprints from 3D or flattened semi-3D (bas relief) templates, aka cattle brands, respond magnificently to 3D programs  – but so they should, since scorch intensity is in proportion to 3D relief. If it’s raised, it leaves a good imprint. If it’s lower down in the relief,  less raised, it does not. \nYes, I could give links to my own postings, but it’s better that folks find these things out for themselves.Then they realize it’s not trickery – just a reading of image density as height above a base plane.\n\n","date":"November 3, 2013 at 3:47 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49794","author":"colinsberry","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Spatial information does not depend on the image but on the mechanism.\nLight is not attenuated by distance (unless you consider an experiment like Jackson ´s), the contrast depends on the lightning.\nPictures from ok except (maybe) the shroud, have no spatial information.\n\n","date":"November 3, 2013 at 2:57 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49787","author":"anoxie","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Is there a difference in  spatial information between a scan from an offset print to a continuous tone photograph?\n\n","date":"November 3, 2013 at 3:10 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49788","author":"Giorgio","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"This is an important point.\nThere is no easy spatial information in a photograph because contrast of an image point depends on the amount of reflected light, from a point of the object, reaching the lens. This amount of reflected light mainly depends on the lightning, the properties of the object but not on the spatial configuration.\nConcerning the shroud VP 8 image is related to spatial information only if you think of an underlying mechanism linking closely distance and contrast.\n\n","date":"November 3, 2013 at 4:21 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49798","author":"anoxie","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"I think you would have to compare the 3D properties of 14th century works or earlier to determine how special the 3D on the Shroud is.\n\n","date":"November 3, 2013 at 3:43 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49793","author":"ChrisB","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Images have no memory as to their origins. Suspecting an image to have medieval or earlier origins confers no special characteristics to that image. So find the special characteristics first, and if you cannot explain them by knowledge gained from modern images, then and only then seek special features shown only in earlier images.\n It’s important to get the order right – start with the hypothesis that the properties are understandable in terms of known science. Don’t start with the hypothesis that the properties are unknown to modern science. That is not a hypothesis, It is an  a priori untested, unsupported  supposition. \nScience exists, indeed thrives on, the testing of  a priori untested, unsupported suppositions. It’s the way it operates. Sounds negative, I know, and apologies for that, but no one has yet come up with a more effective modus operandi\n\n","date":"November 3, 2013 at 3:58 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49796","author":"colinsberry","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"\ncolinsberry :\nI could do that David, once I’ve searched my own cobweb-festooned archive. Better still – do it for yourself. Get a piece of metal or brass that has some rounded contours to it – even a coin would do-  or better still a medal or medallion (I used to know the difference). Heat it on a cooker ring  until it scorches a test scrap of fabric. Then press against cloth, preferably linen or cotton to get a scorch. Take a photograph on your digital camera or phone. Then download ImageJ onto your laptop. I’ll tell you which keys to press, but it’s basically about entering into its 3D enhancement program.\nSee it with your own eyes. Thermal imprints from 3D or flattened semi-3D (bas relief) templates, aka cattle brands, respond magnificently to 3D programs  – but so they should, since scorch intensity is in proportion to 3D relief. If it’s raised, it leaves a good imprint. If it’s lower down in the relief,  less raised, it does not.\nYes, I could give links to my own postings, but it’s better that folks find these things out for themselves.Then they realize it’s not trickery – just a reading of image density as height above a base plane.\n\nI don’t know that I’d know how to brand something as fine as the micron level. But surely you’re not the only person to have experimented or used scorches to create portraits of people. Would there be other existing examples out there to draw from? I’m more philosopher than backyard scientist, I can cook alright — just not Templars. ;).\n\n","date":"November 3, 2013 at 4:09 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49797","author":"David Goulet","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"“I’m more philosopher than backyard scientist”\nI confess to being more your backyard scientist than philosopher.  By way of defence, one can usually be certain that the backyard is on terra firma, few backyards these days being up in the clouds.\nPhilosophy has its role, certainly, and should be part of every scientist’s education, but it can also be used as a hiding place for people who can’t be bothered with the factual detail. \nIt’s the factual detail that allows science to advance, while philosophers, well, Homo philosophus interneticus at any rate, continues to debate how many angels can dance on the head of a pin. (It all depends what you mean by angel, or head, or dance etc etc “).\nLet’s try and keep Shroud science in the backyard a while longer, shall we, before incorporating it into Philosophy 101?\n\n","date":"November 3, 2013 at 4:30 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49799","author":"colinsberry","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Agreed. That’s why I’m interested in seeing other examples of scorched facial portraits with which to compare 3D properties. Nothing philosophical about that. And it’s theologians who debate the angels dancing, philosophers tend to stick to questions like ‘how do we know the pin is even there?’\n\n","date":"November 3, 2013 at 8:55 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49813","author":"David Goulet","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Dan, can you post my quick response to Hugh Farey that I have sent to you, please?\nRegards, and thanks in advance.\n\n","date":"November 3, 2013 at 5:18 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49801","author":"O.K.","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"\n\n","date":"November 3, 2013 at 5:49 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49802","author":"Dan","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Nice, thanks, but I think that posting a scalable pdf which I sent, would be a better solution.\n\n","date":"November 3, 2013 at 6:21 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49803","author":"O.K.","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"\nDavid Goulet :\nAgreed. That’s why I’m interested in seeing other examples of scorched facial portraits with which to compare 3D properties. Nothing philosophical about that. And it’s theologians who debate the angels dancing, philosophers tend to stick to questions like ‘how do we know the pin is even there?’\n\nThe best I can do is show what happened when starting with a rather shallow bas relief (a horse brass with King George VI – he of the speech impairment). While not a challenging template, the settings that gave the best match between scorch and original then worked very nicely when applied to the Shroud – or at any rate, I thought so.\nhttp://strawshredder.wordpress.com/2012/03/18/there-is-something-rather-special-and-unusual-about-this-image-of-the-man-on-the-shroud/\n\n","date":"November 3, 2013 at 9:18 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49815","author":"colinsberry","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"The scorch technique seems such a promising theory in this experiment. Have you attempted it with a deeper face? Are there medieval examples of this type of imaging (even simple ones)? If not, at what time in history do we see scorching used as an artistic or copy/reproduction method? Where was it first used? Sorry for the barrage of questions. If there is a scorching 101 site, do tell.\n\n","date":"November 4, 2013 at 12:01 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49823","author":"David Goulet","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Does a tiny trinket count as a model template, David? While its diameter is small, it has a lot more curvature, more “3D-ness”  than the horse  brass. I used it to make the series of pictures in my blog banner. Here’s a link to the graphic only (which spares you from having to read all my seditious content)\n\nThe sequence, left to right, is :\n1. TS after 3D (that iconic green picture purloined from the internet)\n2. Trinket and its scorch imprint\n3. Close-up of scorch imprint\n4. As above after tone inversion in ImageJ (pseudo-negative to positive)\n5. As above after 3D-enhancement in ImageJ, and with addition of green colour to provide comparison with the TS at left. (Howls of derision from off).\nAll my own work – but I’ve since discovered that lots of folk have done this sort of thing in the past with bas-relief template, also to be told that their end-result is vastly inferior to the Shroud 3D image, the latter having subtleties of 3D-ness that we mere mortals can never hope to emulate. ;-)\n\n","date":"November 4, 2013 at 2:57 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49838","author":"colinsberry","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"The scorches in the example given are way to strong to compare to the Turin Shroud, you dont really need a microscope to tell. How long do you need to expose a full body hot statue ( or bas relief) to a cloth back and forth to get the subtlety and superficiality consistent throughout the whole image of the Shroud of Turin. Without even over burning or under-burning any spots. Was the blood there first? If yes why wasn’t it burned too? It doesn’t make sense to me as a viable theory to explain the shroud. Any promoter of such a theory should be able to produce a complete shroud with such a technique not a coin size scorch, then maybe he will begin to make sense.\n\n","date":"November 4, 2013 at 12:43 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49827","author":"Mike Morcous","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"It depends what question is being asked, Mike. My interest in the Shroud image is a response to those who say it has properties that cannot be reproduced. When you look at the scant evidence for so-called unique properties, you could understand many not bothering to rise to the challenge. I do, but not with a view to reproducing  the entire image – see Luigi Garlaschelli for a creditable result (in my view) using his “frottage” technique. I’m content to use small templates that demonstrate pseudo-negative image, non-directionality, 3D-enhancibility in ImageJ, superficiality (right down to the limit of visibillity but no actual measurements – either from me or anyone else for that matter – just guesstimates). What my paltry efforts in the kitchen lack is that certain fuzziness, and according to Hugh Farey, they are fluorescent under uv and shouldn’t be, but Luigi’s tick those two boxes.\nI’m not sure why so many react so strongly to the term “scorch”, given that the STURP summary described the image as resembling one chemically, even if avoiding the term. The real dichotomy, read parting of the ways, is how one interprets the mechanism of image acquisition. I say that radiation is simply not credible, on a whole number of grounds, and Ray Rogers said the same.The obvious mechanism to get a negative image that lacks directionality, that does not require inventing whole new branches of physics, like self-collimated radiation that defies Newton’s Inverse Square Law (or would, in a vacuum), is to imagine scorching by direct contact between a heated inanimate template (directly or indirectly modelled on a real person), possibly with some secondary effects from superheated air or steam acting across small air gaps.\nBut I’m not here to push my model, being more interested in exposing the bad science that underpins claims for authenticity that are being pushed, year in, year out, with no attempts whatsoever to have the despised and so-called “discredited” radiocarbon dating repeated. That is the real scandal, because it prolongs the damage that has already been done to the reputation of science and scientists, especially when one gets headlines, like those in Nov./Dec 2011 stating that scientists believe the Shroud was produced by a miraculous flash of light. By all means believe there was a Resurrection involving a miraculous flash of light, but don’t claim that a length of linen presently locked away in Turin was ever subject to “miraculous”  image-imprinting sources of radiation. We are supposed to have moved on from that kind of medieval claptrap, and it’s only dodgy, compromised so-called science that keeps the ridiculous show on the road. Shame on the Vatican for failing to commission a second round of radiocarbon dating, allowing conspiracy theories to take root. Shame on you I say.\nIf a task is once begun\nNever leave it till it’s done\nBe the labour great or small\nDo it well or not at all.\n\n","date":"November 4, 2013 at 8:18 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49885","author":"colinsberry","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Ironic that we should move on from “that medieval claptrap” yet you would have us put our faith in medieval scorchtraps. ;)\n\n","date":"November 4, 2013 at 11:14 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49902","author":"David Goulet","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"I think that the presence of 3D data in the Shroud image is simple and can be mathematically explained in a simple way. I also think that the anaglyph is a very simple transformation of that data into a 3D encoding that can be visually perceived. That very simple process leaves no doubt that 3D data exist in the Shroud image. And there is no subjectivity involved as far as this process is completely independent of the Shroud and has been used to generate millions of other anaglyphs. Sorry to repeat this reference, but for a short presentation of how such 3D data is encoded and an anaglyph version of the entire Shroud image can be generated, please see:\nhttp://sindonology.org/shroudScope/shroudScopeHelp.shtml#3D. \nIn a few words, the composite software simply (based on a linear transformation) shift horizontally, based on the luminosity of the pixels, some of the pixels of the Enrie photograph and then combined them with the original photograph using two different colors, one for the original image and a different color for the shifted pixels. It is therefore a very simple process that can be described by a simple linear transformation of pixel locations. It can’t get much simpler.\nThe Shroud Scope has the full Enrie photograph transformed as an anaglyph where you can zoom-in and -out (back and front of the man of the Shroud). For example, please see (you will need color filtered glasses):\nhttp://www.dshroud.com/shroudScope/shroudScope.shtml?zl=3&image=7&lon=323&lat=1417\n(Again, absolutely no artistic or subjective transformation was applied to generate that image, but only the transformation described in the previous reference was applied.)\nNotice the various details of the realistic 3D image, for example the belly, the front feet where we have a perception of the tip (toes?) of the feet, and of course the various 3D details of the face. The back is also quite interesting in terms of 3D realistic representation. \nWhat is not complete clear yet, is the effect of the cloth wrapping the body versus this 3D data. But what appears almost certain to me is that the image was formed while it loosely wrapped a 3D form, and clues to that are numerous, such as parts of hair appears at the same level as the cheeks which means that the cloth was very closed to the hair when the image was formed. But a complete clarification of the relation of the wrapping vs the cloth body distance can be done by doing a computer simulation. Not very complex to do, but quite tedious to do in details.\n\n","date":"November 4, 2013 at 2:02 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49833","author":"Mario Latendresse","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Interesting, Mario, if a bit techie. But those anaglyphs need cinema-style 3D glasses to be viewed, so I don’t see how they assist in telling whether one bit of regular software is intrinsically better than another (regular in the sense that glasses are not needed), or whether the Shroud’s “encoded” 3D is superior to that of our tacky imitations. But I shall still be recommending to Her Maj, next time our paths cross, that One includes you in her Birthday Honours List for your ShroudScope. (I tried at Hitchin railway station last year, but there were too many schoolchildren in the way, waving little flags).\n\n","date":"November 4, 2013 at 3:21 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49840","author":"colinsberry","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Colin, I think I understand your points. Yes, you are right, that page explaining how the Shroud Scope 3D image was generated looks techie, but for a good cause: reproducibility. As far as I know, I have never seen a concrete complete explanation how these 3D Shroud images populating the web had been generated. I thought this would fulfill that aspect in its most simplest form. Hopefully, it also give one clear recipe on how to generate a form of 3D images using the Shroud image.\nAs for the comparison between the various software generating these 3D images, “regular” or not, I would rather focus on the reproducibility aspect. If someone using such a software cannot explain in an explicit matter how the 3D image was generated, I would refrain from trusting these images. On that aspect, I think that the VP8 is good only as an historical reference and not as a reproducible experiment.\nAnd I am pretty sure that working hard on it, you will be able to reproduce a very good quality image of the most exquisite 3D quality even comparable to the Shroud, using, say, scorching. I see no particular reason why that would not be possible. But the recipe looks pretty complicated and I am afraid that it will only be a partial answer to your detractors who will dutifully remind you, and everybody, that it does not have other physical characteristics found on the Shroud. But, honestly, I might be wrong, and you will find the right recipe able to achieve  what nobody else has been able to achieve.\nAs for the Birthday Honours List, the honour is too great and I trust that you will honor the advise from the Cabinet Office that “You shouldn’t tell the person that you’ve nominated them for an honour in case they’re not awarded it.”\n\n","date":"November 4, 2013 at 8:13 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49961","author":"latendre","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Mario, I’m sorry to say I’m a bit lost. Is the image on the Shroud itself encoded and the  substrate plays no roll in the 3D characteristics? If so, would you agree Divisionism or Pointillism will alway produce a better 3D than compared to a continuous tone?\n\n","date":"November 4, 2013 at 7:50 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49881","author":"Giorgio","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Giorgio, in the case of the Shroud, the substrate plays no major role in the 3D data encoded in it. That 3D data, for the Shroud, is simply the “luminosity” (i.e. the white content) of the “pixels” when using the negative photographs. As a matter of fact, I think that removing the herringbone weave pattern increases the 3D quality (for the Shroud). That does not mean that you cannot create very good 3D effects based on the substrate (like pointillism). Although, this is a very different way of encoding 3D data that can be perceived by the human brain. See for example the (almost unbelievable) autostrereograms at the following Web page \nhttp://www.pakin.org/~scott/stereograms/   \nNote that a particular procedure should be followed to perceive the 3D effect of these images. This is explained in details at\nhttp://en.wikipedia.org/wiki/Autostereogram\nAfter some practice, it is an easy procedure to follow, but it is not natural at first because the eyes must cross to get the 3D effects. In particular, try the minimalist 3D image:\n\nThere is indeed 3D data encoded in that image, but obviously it is not based on the luminosity; it is based on the differential horizontal distances between the cents. When using the right procedure (without using any special glasses), one of your eye will pick up (focus on) some of the cents that are horizontally closer to their neighbors, and the other eye focuses on (most) other cents. You then perceive the smaller set of cents as elevated. \nBut obviously, this is completely different on the Shroud where luminosity is the major encoding of the 3D data and the substrate plays no role.\n\n","date":"November 4, 2013 at 12:50 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49912","author":"latendre","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"\nDavid Goulet :\nIronic that we should move on from “that medieval claptrap” yet you would have us put our faith in medieval scorchtraps. ;)\n\nI’m willing to put my faith in a re-run of the radiocarbon dating returning a medieval answer, and would like to see it done as a matter of urgency (please Pope Francis).  And you, David? Does your confidence (faith?) that the initial estimates are out by 1300 years extend to total confidence in a re-run yielding the “correct” answer, second time around?\nThat’s provided of course that those devilishly-difficult to detect “invisibly-mended” regions are detected and avoided. Or will the presumed zone of re-mending need to be extended to accommodate still more erroneous answers?\n\n","date":"November 4, 2013 at 11:38 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49905","author":"colinsberry","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Why the urgency? Need to know before your time is up? Need to rub it in the face of those pseudo-scientists before you join the void? As many others here have said, my ‘faith’ does not (nor should it) require the Shroud to be authentic. It’s gravy, total gravy. If it is authentic I’ll take no satisfaction in shoving it any skeptics face. If it is medieval I’ll still admire it has an amazing icon. I’ve mentioned in another post somewhere that Pope Francis just might be the guy to allow/encourage new tests. He has the Jesuit mindset of following Truth wherever it leads – and he is willing to engage the atheist/agnostic in public discussion. What a great project this would make to further that dialogue.\n\n","date":"November 4, 2013 at 12:24 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49910","author":"David Goulet","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"\ncolinsberry :\nMy interest in the Shroud image is a response to those who say it has properties that cannot be reproduced. When you look at the scant evidence for so-called unique properties, you could understand many not bothering to rise to the challenge.\n\n1- I thought Scientific interest should be with the goal of finding the truth rather than countering others?. I think, only then we may agree with others if we are wrong. Unlike in a boxing match, a good scientist may agree with the other side if the evidence leads there.\n2- 30 scientists from different backgrounds and faiths including Jews, agnostics..etc, spent thousands of hours studying the shroud collected thousands of data (photographs, microphotographs, chemical analysis, spectrophotometry, UV Fluorescence, x-rays…etc), published 30 papers in credible peer reviewed scientific journals and came up with the conclusion that it is unique (not a work of art and cannot be explained at this time). I don’t know exactly what you mean by scant evidence.\n3- Not bothering is not the word to describe why people can’t reproduce it. As you can see, a or can’t see, any credible attempt to replicate the shroud immediately attracts media attention. Lack of interest is not the true reason, The reason no body rises up to the challenge is very simple…no one can reproduce it.\n4- To me, Luigi’s body image doesn’t look life-like to the eye if the shroud looked like this people would have no problem refuting it. It also doesn’t match the shroud under the microscope. The blood stains look childish at best. Pigments don’t just disappear overtime, so simulating ageing by heating and then washing the cloth is not a logical sequence of events.\n\n","date":"November 4, 2013 at 12:56 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49914","author":"Mike Morcous","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Comment noted, but, unusually for me, I feel not the slightest inclination to address any of your numerous points and observations – there being a certain all-pervading ‘flatness’. It’s like looking out over a barren landscape, with nothing in particular to engage the eye or make one want to explore further. Sorry, but I’d rather be somewhere else right now.\n\n","date":"November 4, 2013 at 1:26 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49919","author":"colinsberry","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Mario, I understand that luminosity is playing a roll in the  3D encoding data on the Shroud. Where I’m lost is through my observation, the Enrie’s image is formed by lensing that’s because I believe is due to the image being imposed on  the twill pattern. Suppose the image was imposed on smooth pattern? Would you expect as good of a 3D affect as we see today?\n\n","date":"November 4, 2013 at 3:09 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49929","author":"Giorgio","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Giorgio, the twill pattern has no positive effect on the 3D data. As I mentioned previously, if you digitally remove the twill (using a Fourier transform for example, and this has been done by many) you get a slightly *better* 3D effect. So, with or without the twill pattern, the 3D data is there in the Shroud image.\n\n","date":"November 4, 2013 at 5:09 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49938","author":"latendre","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"By the way, it is exactly the same thing for the natural images of plants or flowers throught the process known as the Volckringer pattern effect!  But around here, nobody seem to be willing to accept the fact that there is other known natural process that can produce an image on an object (in this case, it is a sheet of paper) with good 3D data, which came from a natural (but still not fully determined yet) interaction between a biological thing (in this case, it is vegetal) and the sheet (of paper).\n\n","date":"November 4, 2013 at 5:41 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49942","author":"Anonymous","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Bon soir, Mario.\nI guess I’m still lost, please be patient. \nMaybe the misunderstanding is steamed to the fact  you may not  agree with my assertion that the image is lensing during the image process because the image was imposed on a twill pattern. Because it is lensing the image resembles dot frequency that is very similar in AM printing screens. Removing the twill pattern after the fact (Fourier transform) doesn’t change the initial mechanics of the image. Allow me to rephrase my question, do you agree that the twill pattern did affect the mechanics of the image when formed?\n\n","date":"November 4, 2013 at 9:53 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49966","author":"Giorgio","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"\ncolinsberry :\nDo we need to discuss VP8? Are there grounds for thinking that it is any more valid as a 3D-enhancement tool than the free-downloadable ImageJ?  What is the meaning of valid anyway, given that the best 3D-enhancements are still 2D, viewed on a page or screen, no matter which criteria are applied. The best 3D is simply 2D that deceives the eye, so there must inevitably be subjective factors at play in discussing the merits of one method against another, even if deploying additional tools like layered colour to compare “3D-ness” as in the paper you cite (which incidentally I found almost unintelligible in parts, despite being able to call on my wife’s language skills – and she too said she could extract little meaning from the final conclusions).\nIf we are to restrict ourselves to objective scientific as distinct from subjective aesthetic ones, then what we need is an agreed standard for assessing the 3D-ness of a 2D image. That could take the form, as I suggested earlier (and have previously experimented with) of starting with an agreed 3D object, converting to 2D images by different means, and then seeing which software programs do the best job of re-creating the “look” of the original. What we cannot do is take the Shroud image as our standard, since we don’t know how well it resembled the subject whose image was imprinted,\n\nI fully agree.\nWhat do you have in mind ?\n\n","date":"November 4, 2013 at 5:01 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49936","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"What? You agree? Quelle horreur!  I’m not sure I know how to handle agreement, Thibault. It’s so much easier to deal with polarised opposition.  ;-)\nHere’s a hastily composed answer that attempts to address what I consider the key issues in deciding whether (a) the Shroud image  has “better” 3D-ness than anything that could be produced today and (b) whether superior 3d-ness, if found, is telling us anything about the mechanism  by which it was formed.\nHere’s then is a cut-and-paste of what I have been busy on these last 30 minutes. \n********************************************************************************\nLet’s start with a proposition – that other things being equal, a negative image is a better starting point than a positive, provided it is first converted to a positive.\n(That may not be immediately obvious unless or until one has experimented, as I have, and shown how the crudest of charcoal drawings can give luminous ghostly end-results  with some of the character of the Shroud image .The transformation can be rationalized in scientific terms through realizing that tonal inversion reduces degrees of harshness to degrees of white space, and degrees of white space are conversely promoted to degrees of image intensity).\nNow the Shroud negative image – a good starting point in principle – could have been produced by two entirely different mechanisms that result in approximately the same end-result, one by old physics (Method A), mainly by contact/conduction (my preferred scenario) and one by new physics (Method B)  i.e. by collimated radiation. \nIn both cases a nose, say, would imprint as an area of higher intensity on our negative. In Method A it’s because it’s touching the linen and scorching it through atom-to-atom contact. In method B, it also produces a more intense image, not because it is touching, but because it is closer to the linen, and some kind of inverse distance/intensity relationship is operating, but which cannot be Newton’s inverse square law (see a comment I made here yesterday re collimated radiation in response to anoxie as I recall)\nWhat’s more, both mechanisms produce an image without directionality (i.e. no differences in apparent “illumination” on opposite sides of a face, which is another contributor to the unusual quality of the Shroud image, but that’s by the way.\nBut while the extremities like the nose will imprint with roughly the same intensity by both mechanisms, the same is not true for the sides of the nose. In Method A, they do not imprint well, because there is little pressure of contact due to oblique angle of presentation. In Method B the intensity will be almost as good as the tip of the nose, assuming collimated rays are travelling to meet the linen along the perpendicular meeting the linen at right angles, but slightly less.\nSo which mechanism will give the best ‘scalability’?  I would guess Method B, being a function simply of distance, whereas Method A is far more complex, given image intensity responds to small and subtle changes in facial contours.\nIf we judge the quality of a Shroud image purely in terms of scalability – as I believe you did recently – of smooth gradations in 3D-ness – then Method B will seem to be indicated. But suppose “subjective 3D-ness” is a better criterion. Then that would indicate that the radiation model was not operating, that the imprinting method depended on contact,\nSo we have to find software image-analysis programs that can discriminate between Method A and Method B imprinting – by looking at the way they respond to distance gradients AND contour angles starting with the same template. (It may need to be hollow with slits and illuminated from inside to model  Method B collimation). The nose – tip and sides – would seem a promising place to starting looking for clues to imprinting mechanism. \nAnd here I must stop while I think about it some more, and await your reaction to my initial ramblings.\n\n","date":"November 4, 2013 at 6:12 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49943","author":"colinsberry","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"PS: have just taken another look (the 1001st) at the Shroud image and suddenly realized two things: first, the eye sockets make a much better test of Method A v Method B, and second, the answer is staring us in the face as to which is operating! (Clue – one can still have deep shadow, even when there’s no directionality, due to one of those two models operating – and NOT the other).\n\n","date":"November 4, 2013 at 6:35 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49945","author":"colinsberry","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Sorry, this is not why I had in mind.\nYour answer is based on the (supposed) mechanisms (Method A vs Method B).\nThis is not the question. \nIn any scientific work, as you know, the first step is to define the question.\nHere, the question is: ” does the 3-D VP8 Shroud image have 3-D SPECIFIC  properties (I called them “true 3-D”), that are not found in any kind of man-made 2D artifacts by any mean (including scorch)”?\nMy answer is yes.\nI’ll try to show that as soon as possible.\n\n","date":"November 5, 2013 at 4:27 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-50083","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Hello Thibault,  on the contrary VP8 is operator dependent. Contact Deacon Peter he’s a great resource for VP-8.\n\n","date":"November 4, 2013 at 10:19 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49969","author":"Giorgio","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Based on this S.O.P.  NASA states “The interpreter or VP-8 machine operator selects the color assignments for different densities and also determines, in part, the spatial distribution\nof density levels”. \n If you read on you will notice that prints are made from positive film that has no intragal mask so not only will the image be reversed but it will reduce the tonal range considerably. This in affect will also limit the amount of interpretation the operator has. (Excellent  idea for continuity between different technicians interpitation.)\nHere is the excerpt from the document I found from the HSG archive.  \n“Can we consider this as a possible working solution to landuse\nmapping? I believe so but with reserved optimism. First, consider the\nways in which we analyze imagery. The human interpreter basically looks\nat tonal variations in terms of light or dark signatures to interpret\nblack and white ERTS imagery. Tonal variations reflect densities which\ncan be measured, sorted, and displayed by the VP-8 system. Thus, the\nVP-8 distinguishes between light, gray, or dark toned areas and displays\nmappable areas to which we assign landuse interpretation. The VP-8 can\nonly reconstitute and sort density levels for us. We must interpret\nthose levels in terms of landuse categories. The interpretation can only\nbe as good as the interpreter. His subjective and objective knowledge\nof the area enters a bias which the VP-8 cannot override.\nThe interpreter or VP-8 machine operator selects the color assignments\nfor different densities and also determines, in part, the spatial distribution\nof density levels. He can combine density levels into a common color unit\nand thus obliterate detailed information. Conversely, the interpreter\ncan display up to 8 density color slices and combinations with highly\n“The simplification of the imagery from hundreds of shades and tones\ninto only a few dark tones on the light toned surface simplify the\ninterpretation of the image. However, not all imagery should be used\nwith the black and white negative print technique. Imagery for which\nsubtle differences between intervening shades of gray must be interpreted\nis not usually suited to the technique. The technique operates best in\nhigh contrast situations. For example, the better contrasts are exhibited\nby light toned cultural features on dark forested backgrounds such as may\nbe found in the humid, eastern United States and in areas where dark toned\nirrigated farms appear on light colored desert surfaces such as the arid\nwestern United States”.\n\n","date":"November 4, 2013 at 11:40 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49975","author":"Giorgio","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"(Excellent idea for continuity between different technicians interpretation.)  Interpretation\n\n","date":"November 5, 2013 at 12:17 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49976","author":"Giorgio","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Question, the images posted by Hugh Farey,  the TS show image in ‘raise relief’ because it is 3D encoded? The others does not show raise relief, why?\n\n","date":"November 4, 2013 at 5:27 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49941","author":"Donn Reile","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Hi Don, I would like to answer your question, but I don’t understand it. Can you say what you mean by the ‘raised relief’ and how the shroud is different from the others?\n\n","date":"November 4, 2013 at 6:23 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49944","author":"Hugh Farey","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Hugh: The Shroud is definetly different from the others. I sent to Dan my response to your work, he posted it but only in the form of picture, not pdf I sent. The faces you analyzed look clearly distorted under ImageJ, even if it is not so clear with monochromatic output. That’s why I use thermal scale.\nTo Anonymous: By the way, it is exactly the same thing for the natural images of plants or flowers throught the process known as the Volckringer pattern effect! But around here, nobody seem to be willing to accept the fact that there is other known natural process that can produce an image on an object (in this case, it is a sheet of paper) with good 3D data, which came from a natural (but still not fully determined yet) interaction between a biological thing (in this case, it is vegetal) and the sheet (of paper)\nVolckringer pattern is mostly a contact process, and hence different from the image on the Shroud, were non-contact areas were also imprinted. Plants, leaves and flowers are mostly flattened inside the book (so they are in contact with the paper) the corpse is not.\n\n","date":"November 4, 2013 at 7:06 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49947","author":"O.K.","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"You didn’t understood the point I wanted to make, which is this: there is absolutely no single characteristic taken from the Shroud image that can be taken as a serious piece of evidence in favor of a supernatural process or of a man made process, not even the 3D data present in it for the simple and good reason that 3D characteristics like this can be produced naturally by biological things (vegetal in this case).  I don’t say that the images of plants produced by a Volckringer pattern effect are showing exactly the same characteristics as the image on the Shroud but it is possible that the Shroud image can have been the result of a similar biological and chemical interaction (very complex obviously) between the dead body and the cloth, which would have acted both by direct contact and by a molecular diffusion at a very short distance (close proximity if you will).\nIn other words, the fact that there are images of biological things that are showing the same kind of good resolution and 3D data as the Shroud image cannot allowed anyone presently to discard the possibility (which is the most probable in my mind) that the Shroud image can be the result of a natural interaction between the dead body of the Shroud man and the surface of the cloth.\n\n","date":"November 5, 2013 at 11:44 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-50050","author":"Anonymous","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"I don’t see how the shroud is different from the others, sorry. They all show distortions and none of them look like 3D heads. Can you be a bit more specific?\n\n","date":"November 4, 2013 at 7:52 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49954","author":"Hugh Farey","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"See Dan’s post , #20 I guess. Look at this black lady on bottom right. Do the humans have foreheadsso extended in front of the face? And next look at gentleman in the center left. The right side of his face is much more in front than the left. And so on. Contrary to the Shroud, when if one takes into account a correlating function describing how the linen was laying on the head (and body in general) everything is quite fine, only bloodmarks are making some mess.\n\n","date":"November 4, 2013 at 8:08 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49959","author":"O.K.","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Yes, that image of the black lady shows graphically what a mess that 3D enhancement can make of a black-and-white photograph when all it can read is tonal contrast, enhancing regions that reflected most light over those that did not. See how she has acquired a grotesque kind of necklace simply through taut sinews in the neck being enhanced!\nAll that this is telling one, which  hardly need repeating, is the the Shroud image is not a photograph. Information on relief and contour has been captured by an entirely different mechanism from that which depends on reflection from a angled light source, and importantly, ImageJ can handle the resulting tonal contrasts with far greater finesse, avoiding the horrors of that particular photograph. (Hugh has done science a favour by selecting it!). Now back to discussing precisely how the Shroud image was able to record an image so exquisitely sensitive to the contours of a 3D “subject”, one that that did not confuse ImageJ  or our own eyes – just the opposite in fact…but created a different kind of shadow that while unusual is not unpleasing to the eye (and indeed intrigues). That new kind of shadow might usefully compared with the stippling one sees on certain maps to enhance relief over and above those contour lines linking points of equal height.\n\n","date":"November 5, 2013 at 2:49 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49982","author":"colinsberry","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"For Hugh Farey from what I understand about raise relief: In addition, the scientists had confirmed a startling new earlier finding that the image had 3-d information encoded on it. The clumping of degraded fibers was so uniform and precise that a computer could translate the lighter and darker groupings into mathematically precise values. Which enabled STURP members Dr John Jackson and Dr Eric Jumper to make a 3-dimensional model of the man in the shroud. They did this by feeding the encoded values of the various groupings into a VP-8 image analyzer, a device normally used by NASA to make raised relief maps from non traditional, electronic photos of distant planets. Because the distances were so far, such photos were not taken by conventional cameras using traditional light sensitive film, but by cameras tabulating emitted light photons.\nWith the encoded information, a computer could plot exactly how the shroud lay over the figure; where it touched and didn’t touch. The computer did this by revealing minute but precise distances between the man and the cloth. Where the shroud touched his body, the degraded fibers were clumped the most; less so where there was space between the cloth and body. The lightest parts of the image had the least number of clumped fibers. In this way, the computer plotted the peaks and valleys on the head, torso, arms, and other aspects  of frontal, dorsal, and side images.\nJackson said that relief 3-d image on the analyzer’s screen looked anatomically plausible, even down to the subtle details of the face. No known paintings or traditional photographs have ever yet yielded such encoded values and do not produce 3-d images. “Eyes protrude, nose sink, and other distortions graphically testify to the uniqueness of the shroud image,”  quoted by Kenneth Stevenson and Gary Habernas in their book-Verdict on the Shroud.\nThe 3-d encoding also appeared to negate the image being like a conventional photograph. Traditional cameras  reflections of light (more light causing brightness, less causing shadows) to make an image. But the shroud images didn’t depend on light (unless light had caused the precision degrading of the fibers grouped like pixels together determining lightness or darkness and hereby etching the image. The image just happened to look like a photographic negative. In reality, it was a mathematically precise map of how the body contacted the cloth.\n\n","date":"November 4, 2013 at 9:40 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49965","author":"Donn Reile","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Agree\n\n","date":"November 4, 2013 at 10:10 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49967","author":"Giorgio","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Agree to #39\n\n","date":"November 4, 2013 at 10:11 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49968","author":"Giorgio","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"\ncolinsberry :\nYes, that image of the black lady shows graphically what a mess that 3D enhancement can make of a black-and-white photograph when all it can read is tonal contrast, enhancing regions that reflected most light over those that did not. See how she has acquired a grotesque kind of necklace simply through taut sinews in the neck being enhanced!\nAll that this is telling one, which  hardly need repeating, is the the Shroud image is not a photograph. Information on relief and contour has been captured by an entirely different mechanism from that which depends on reflection from a angled light source, and importantly, ImageJ can handle the resulting tonal contrasts with far greater finesse, avoiding the horrors of that particular photograph. (Hugh has done science a favour by selecting it!). Now back to discussing precisely how the Shroud image was able to record an image so exquisitely sensitive to the contours of a 3D “subject”, one that that did not confuse ImageJ  or our own eyes – just the opposite in fact…but created a different kind of shadow that while unusual is not unpleasing to the eye (and indeed intrigues). That new kind of shadow might usefully compared with the stippling one sees on certain maps to enhance relief over and above those contour lines linking points of equal height.\n\nP.S. Apologies once again for the postcript but the Shroud image is almost certainly a “tactilograph”. Think of it like a brass rubbing, and then see Luigi Garlaschelli’s landmark paper for how his light-touch frottage (rubbing) can be combined with pyrography (he described his final oven-baking stage as needed to give an aged look to the linen,  which in my opinion served a far more important purpose, i.e. to “etch” his iron oxide pigment onto linen, aided perhaps by acidic impurities). For Luigi’s “etching” read thermochemical scorching. Apologies for deploying what for some is the dyspepsia-inducing s word so early in day.\n\n","date":"November 5, 2013 at 3:25 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49986","author":"colinsberry","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"I’m sorry but the 3D theory is a soap bubble. You can see this without sophisticated equipment or complex mathematical calculations.\n1. Let us suppose that the Shroud was supported by the body as Jumper, Jackson or Latendresse imagine. The fabric weight would make some parts, small or large, would adhere to the skin, producing zones of distance 0 and, therefore, intense coloration. In addition, the cloth should present some wrinkles well visible when it would be extended. This is so even in Latendresse’s forcibly reconstruction where the fabric is unnaturally stretched out.\nNone of these things are visible in the image of the shroud. Or it is impossible the shorud was laying on the corpse or the 3D theory is false.  \n2. Let us suppose that the Shroud was flat (an additional mysterious force is needed, but this is not the topic here). Some parts of the body would be farther than 5cm. from the fabric (calves and abdomen, for example) and would be invisible. Or the Shroud was not flat or the 3D theory is impossible. \nJumper and Jackson image here: https://lh6.googleusercontent.com/-Qvl8Rzw4Cjo/UP-aikFIJzI/AAAAAAAABNg/UnmqfSDmd-4/s400/jacjumperret.jpg \nLetendresse: http://www.sindonology.org/papers/latendresse2005a.pdf , fig. 6.\nI’m not a « shroudie » or similar, but I advise to sindonists to abandon the three-dimensional theory because it is logically untenable. It is a friendly advice.\n\n","date":"November 5, 2013 at 3:27 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49987","author":"David Mo","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"“I’m sorry but the 3D theory is a soap bubble”\nCan you be a little more specific as to what is meant there David?  If it means simply  that 3D information could not have been captured by some kind of radiation being projected onto a sheet – whether stretched or loosely draped – certainly not some new-to-physics collimated radiation that scorches cloth but not hair – then I would agree, and like you advise the sindonologists to look for a different imaging mechanism for capturing and imprinting 3D information. \nBut maybe I have misinterpreted and been too quick to detect a kindred spirit, and maybe you meant something more, or even entirely different… (?)\nOh, and could you explain the significance of that “5cm”, and indicate whether or not it has some accreditation in conventional as distinct from sindonological physics…\n\n","date":"November 5, 2013 at 3:42 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49988","author":"colinsberry","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"3D theory is sustained on two hypotheses. \n1. Radiation or vapour there was once an orthogonal (vertical) projection from body to image.\n2. Different colour intensities are produced by distance between body and cloth. 5 cm is the standard distance at which the image disappears (sindonist say). \n“3D information could not have been captured by some kind of radiation that is projected onto a sheet.” That’s what I think, for reasons given above.\nBut the 3D information could not have been caused by some kind of contact with the shroud, because large deformations would be visible.\nThen we have just an alternative: Or the Shroud was manufactured with a process we don’t exactly know (paint or heating or some degradation due to time) or we are in front a miracle. \nAbout miracles you can see what I think in my blog (if you read Spanish or you have a good translator on line): Here: http://sombraenelsudario.wordpress.com/2013/01/17/milagro/ , and here http://sombraenelsudario.wordpress.com/2013/09/03/que-es-un-milagro/ and following entries. \nAs Rogers I’m not favourable to recourse to miracles as explanations. If miracle is done everything is possible and “scientific” explanations are irrelevant. Sindonology would be irrelevant because  in front to “Dieu le veult!” reason go out.\n\n","date":"November 5, 2013 at 4:24 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49991","author":"David Mo","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"The 3D reconstruction of the Shroud only proves two things: \n1. The Shroud is not a photo. In photos the volume is obtained by light gradation. Photos usually are done with more than a single focus. This implies some kind of lateral shadow and chiaroscuro. The volume of the Shroud is represented by the colour intensity in terms of a closeness or distance to an imaginary plane. There are different concepts. Perhaps a good photographer could obtain a similar effect with a central focus and sieving light. \nSome painted images are lately done with similar results to the Shroud. Differences were due to the best or worse artistic skill of the painters. \n2. Mr. Schumacher is a good scientist, I don’t doubt this. But to compare the Shroud with a Leonardo’s drawing, as I have seen he did in a documentary, is a great absurd. It is a monumental conceptual mistake. Maybe Mr. Schumacher is a good scientist, but not so good art historian.\n\n","date":"November 5, 2013 at 3:58 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49989","author":"David Mo","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Yes, if it were a photo, then it would not respond nearly so well in ImageJ etc, (And how many times are we told that the Shroud has encoded 3D properties that cannot be matched by any medieval or even modern-day means?).\nBut any mechanism proposed that uses radiation, whether conventional or new-to-science, is still a kind of photography, even of different in detail, so one is entitled to look closely at the kind of  science and technology envisaged that can produce a negative image, lacking directionality, lots of encoded 3D information etc etc,.\nI hadn’t realized until recently that the collimated radiation proposed cannot obey Newton’s inverse square law, given the absence of beam divergence to produce progressively small illumination per unit area of screen at different distances. Back came the answer that a different principle was operating  to create a different kind of beam-weakening effect for generating cloth-body distance information. Apparently there’s a mysterious radio-opaque substance in the air  (let’s call it Factor X) that attenuates the beam. \nBut is has since occurred to me that this ingenious mechanism, aka cop-out, while imaginative, the stuff of Nobel prizes if confirmed, would sadly be self-destroying. You see, if the radiant energy of the beam is to be progressively trapped en route from subject to linen (and needs to be for successful 3D imaging) then the energy has to be converted to another form – it cannot just disappear. That almost certainly means thermal energy, presumably infrared, but that would energize the air molecules to give them extra kinetic energy (increased temperature) which would in turn cause the air to expand, thereby diluting and/or removing Factor X that is needed for beam attenuation. As I say, a self-destructive mechanism, like choosing a bad place to sit on a tree branch that one is attacking with a chain saw.\nRIP Factor X?  RIP shiny new radiation physics?    :-)\n\n","date":"November 5, 2013 at 4:36 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49994","author":"colinsberry","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"I’m afraid I’m writing too fast and making a lot of spelling mistakes. I hope this may be understood and I will give a pause to myself.\n\n","date":"November 5, 2013 at 4:28 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49992","author":"David Mo","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"David Mo: You are not making a lot of spelling mistakes, your claims to discredit the Shroud are simply wrong.\n1. Let us suppose that the Shroud was supported by the body as Jumper, Jackson or Latendresse imagine. The fabric weight would make some parts, small or large, would adhere to the skin, producing zones of distance 0 and, therefore, intense coloration. In addition, the cloth should present some wrinkles well visible when it would be extended. This is so even in Latendresse’s forcibly reconstruction where the fabric is unnaturally stretched out.\nNone of these things are visible in the image of the shroud. Or it is impossible the shorud was laying on the corpse or the 3D theory is false. \nThey are visible http://ok.apologetyka.info/upload/ap_upload/articles/15/2013/06/rysunekxxii.jpg\n\n Let us suppose that the Shroud was flat (an additional mysterious force is needed, but this is not the topic here). Some parts of the body would be farther than 5cm. from the fabric (calves and abdomen, for example) and would be invisible. Or the Shroud was not flat or the 3D theory is impossible.\nThe Shroud was not flat, I support Mario in this case.\n1. Radiation or vapour there was once an orthogonal (vertical) projection from body to image.\nSo orthogonal or vertical? Because there are at least four hypotheses: \n\n2. Different colour intensities are produced by distance between body and cloth. 5 cm is the standard distance at which the image disappears (sindonist say).\nSome say 5 cm, some 4 cm, others 2-3 cm, we don’t know precisely.\nBut the 3D information could not have been caused by some kind of contact with the shroud, because large deformations would be visible. \nMario showed that’s not true.\n\n","date":"November 5, 2013 at 5:09 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-50001","author":"O.K.","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Some interesting comments, but on the whole I think they illustrate the similarities rather than the differences between the shroud (which I agree is clearly not a photograph) and an actual photograph. There are actually very few specific comparisons, but here they are\n1) “Look at this black lady on bottom right. Do the humans have foreheads so extended in front of the face.” No, indeed they don’t. But compare her forehead to that of the shroud image. The shroud shows the eyebrows, nose, moustache and one cheek on the same horizontal plane. Is that anatomically accurate?\n2) “And next look at gentleman in the center left. The right side of his face is much more in front than the left.” Quite so. Remarkably, the shroud image shows exactly the same.\n3) “The image of the black lady shows graphically what a mess that 3D enhancement can make of a black-and-white photograph when all it can read is tonal contrast, enhancing regions that reflected most light over those that did not. See how she has acquired a grotesque kind of necklace simply through taut sinews in the neck being enhanced!” The sinews of her neck do indeed resemble a kind of necklace, being prominent parts of the photo. But they are also prominent parts of her anatomy. They may not be as grotesque as this on real life, but the sinews of a nect really do stand out from the body. This is one of the more realistic parts of this image, not one of the least.\nIt would be silly to say that any of these images carries accurate relief data: that was never my point. What I do claim is that the shroud carries no more 3D information than any other such picture, and I don’t think my claim has been demonstrated false yet.\n\n","date":"November 5, 2013 at 4:33 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49993","author":"Hugh Farey","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Hugh: \n\nYellow line -flat reference surface.\nRed line -linen in strict contact with the body\nBlue line -linen how it approximately wrapped the body in reality.\nIt would be silly to say that any of these images carries accurate relief data: that was never my point. What I do claim is that the shroud carries no more 3D information than any other such picture, and I don’t think my claim has been demonstrated false yet.\nYes Hugh, the amount of data in the Shroud and normal photographs is the same; X,Y coordinates and Intensity or Luminosity as the third dimension. The problem is that Shroud offers much better correlation with distance to the cloth than any photo with distance to camera. And remember distance to the cloth, and distance to the flat photographic plate are two different things (the latter much easier to obtain than the first)!\n\n","date":"November 5, 2013 at 5:16 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-50003","author":"O.K.","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"A good comment. But there is, as yet, no objective evidence that the shroud shows any “better correlation with distance to the cloth than any photo with distance to camera.” I think that Mario Latendresse’s next bit of digital manipulation (see the blog entry after this one), which I gather is designed to subtract your red line from your blue line, will provide some more objective evidence one way or the other.\n\n","date":"November 5, 2013 at 6:17 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-50017","author":"Hugh Farey","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"” This is one of the more realistic parts of this image, not one of the least.”\nIt’s rare, indeed virtually unknown, for me to find myself in profound disagreement with you Hugh, but this sadly is one such occasion.\nI stand by my choice of “grotesque” to describe what ImageJ did to those sinews…\n\n","date":"November 5, 2013 at 4:56 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-49997","author":"colinsberry","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Try: http://www.jupiterimages.com/Image/DetailPrint/200027928-001\nor: http://ru.depositphotos.com/4303990/stock-photo-Woman-with-hand-at-neck.html\nor: http://www.istockphoto.com/stock-photo-9455096-woman-s-neck.php\nOr put “woman” “neck” into Google images. Those sinews look like a necklace in the photo because they look like a necklace in real life, although I admit the woman in question shows more accentuated ones than usual, and ImageJ certainly distorts them more.\n\n","date":"November 5, 2013 at 6:02 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-50015","author":"Hugh Farey","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Sorry, still not on the same wavelength Hugh. The sinews do not look like a necklace on your photograph. They look like sinews – prominent as they tend to be is some people, but still sinews (OK, prominent, but then so are the collar bones).\nThe reason they are grotesque in ImageJ is because they look as if they have become detached from the body – so one’s first thought is not that they are sinews, but some kind of necklace or even collar. I’ve no doubt one would also recoil if more could be seen of what ImageJ has done to the collar bones, that now look like some kind of pelmet.\nBut it’s the principle that matters. Regardless what one thinks of the “quality” (?) of theShroud image versus modern photographs in ImageJ, everyone is surely agreed that the first lacks directionality, the second usually DOES have directionality, and that makes for a big vulnerability in modern photographs – namely that ImageJ will target those parts of the image with most reflected light and produce results that are or can be either outlandish, or heavily asymmetrical, due to lateral lighting, or both. That cannot happen with the Durante 2002 or other “as is” Shroud images, so while one may still find fault with this or that detail, it won’t be on account of directionality which is not there. What’s more, when we put our Durante image into ImageJ, the first thing we do (well, me at any rate) is perform a tone inversion so what the software is doing is applying 3D enhancement to what was at the lighter, more subtle end of the grayscale – helping to achieve a soft-focus result that is superior (sorry, superior) to what one can hope to achieve with a normal photograph. The end -result does not necessarily match the starting subject (see the banner on my blog) but then who can say that the Shroud image is an exact match of the original subject anyway? \nSTURP was too quick (keen?) to dismiss a medieval provenance, and image-formation mechanisms based on contact, thermochemistry etc. For most of the team, including  Rogers, Adler, Jackson and others, there is clear resort to the Biblical narrative as a presupposition, as distinct from proposition-to-be-tesetd (thus starch impurity coatings/putrefaction amines, thus bilirubin and blood clot exudates. thus miraculous bursts of radiation onto collapsing cloths etc etc.\nSTURP has done science no favours whatsoever. But then, look who initiated STURP and recruited its members. It wasn’t the US Academy of Sciences…\n\n","date":"November 5, 2013 at 6:39 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-50019","author":"colinsberry","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Yes I agree with all that. The point is that if even a photograph, which has no genuine correlation between intensity and distance (one of the men’s noses is actually darker than the cheeks, so looks sunken in, and a shadow of some hair on another man produces a huge pit in the forehead) if even a photograph can come up with as good a 3D image as the shroud, then anyone who deliberately set out to produce such an image, such as Garlaschelli or a medieval dabber, could do even better. The 3D effect is often touted as evidence that the image must be a) miraculous, b) 1st century or c) at the least ‘natural’ or derived from an original body covered with an original cloth, when in fact it doesn’t. It is not inconsistent with such hypotheses, but then it is not inconsistent with a number of others either.\n\n","date":"November 5, 2013 at 6:56 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-50025","author":"Hugh Farey","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Yes, Hugh, but the Shroud is a) miraculous, b) 1st century or c) at the least ‘natural’ or derived from an original body covered with an original cloth not just only because 3D effect, or negativity, or non-directionality, lack of pigment etc. alone It is a combination of unique traits that makes it likely to be a) and/or b) and/or  c)\nEven though some simplified statements are presented in popular media.\n\n","date":"November 5, 2013 at 7:03 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-50028","author":"O.K.","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"What’s so unique about that combination of features? A thermal imprint (“scorch”) from direct contact with a template is also a negative, non-directional, 3D-enhancible, lacking in applied pigment…  sorry, what else did you say?\n\n","date":"November 5, 2013 at 7:16 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-50031","author":"colinsberry","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"\nDavid Mo :\n3D theory is sustained on two hypotheses.\n1. Radiation or vapour there was once an orthogonal (vertical) projection from body to image.\n2. Different colour intensities are produced by distance between body and cloth. 5 cm is the standard distance at which the image disappears (sindonist say).\n“3D information could not have been captured by some kind of radiation that is projected onto a sheet.” That’s what I think, for reasons given above.\nBut the 3D information could not have been caused by some kind of contact with the shroud, because large deformations would be visible.\nThen we have just an alternative: Or the Shroud was manufactured with a process we don’t exactly know (paint or heating or some degradation due to time) or we are in front a miracle.\nAbout miracles you can see what I think in my blog (if you read Spanish or you have a good translator on line): Here: http://sombraenelsudario.wordpress.com/2013/01/17/milagro/ , and here http://sombraenelsudario.wordpress.com/2013/09/03/que-es-un-milagro/ and following entries.\nAs Rogers I’m not favourable to recourse to miracles as explanations. If miracle is done everything is possible and “scientific” explanations are irrelevant. Sindonology would be irrelevant because  in front to “Dieu le veult!” reason go out.\n\n Wow, Thank you David excellent explanation. In your opinion could this be an  attempted by an artist to produce a plate  or historical cartoon  barring of coarse this image is truly a miracle?\n\n","date":"November 5, 2013 at 7:28 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-50033","author":"Giorgio","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"“3D information could not have been caused by some kind of contact with the shroud, because large deformations would be visible.” Although I’m sometimes guilty of it myself, we need to be very careful when we say that something “would” happen, especially if we have no evidence to justify our statement. What sort of “large deformations” would have occurred if the shroud had been in contact with a heated bas relief, for example?\nIt is sometimes assumed that the contact hypothesis “would” always result in a simple on/off sort of colour, with no graduation of intensity. This is demonstrably untrue in all sorts of ways. As pressure on a coloured artefact in contact with cloth increases, more and more pigment/scorch/degradation/whatever occurs in particular places, and the intensity gradient is created.\n\n","date":"November 5, 2013 at 8:53 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-50036","author":"Hugh Farey","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Hugh, I like the assertion David makes and I quote, “manufactured with a process we don’t exactly know (paint or heating or some degradation due to time) or we are in front a miracle”. \nIf the 3D image of the Shroud is measured between body and cloth, I would conclude that the likelihood that a natural occurrence created the image without  obstructions or contaminates to distort the 3D isn’t likely. \nLast year I discussed with Deacon Pete, (Schumacher) how uncomfortable I was with the explanation of Jackson and other Sindonolgist claiming that the 3D characteristics are like no other image and supports the authenticity of the Shroud. For me it was the contrary.; it supports a controlled environment that even included the substrate that the image was imposed on.\n\n","date":"November 5, 2013 at 9:46 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-50038","author":"Primary66","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Hugh, I like the assertion David makes and I quote, “manufactured with a process we don’t exactly know (paint or heating or some degradation due to time) or we are in front a miracle”. \nIf the 3D image of the Shroud is measured between body and cloth, I would conclude that the likelihood that a natural occurrence created the image without  obstructions or contaminates to distort the 3D isn’t likely. \nLast year I discussed with Deacon Pete, (Schumacher) how uncomfortable I was with the explanation of Jackson and other Sindonolgist claiming that the 3D characteristics are like no other image and supports the authenticity of the Shroud. For me it was the contrary.; it supports a controlled environment that even included the substrate that the image was imposed on.\n\n","date":"November 5, 2013 at 10:35 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-50042","author":"Giorgio","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"\nThibault HEIMBURGER :\nSorry, this is not why I had in mind.\nYour answer is based on the (supposed) mechanisms (Method A vs Method B).\nThis is not the question.\nIn any scientific work, as you know, the first step is to define the question.\nHere, the question is: ” does the 3-D VP8 Shroud image have 3-D SPECIFIC  properties (I called them “true 3-D”), that are not found in any kind of man-made 2D artifacts by any mean (including scorch)”?\nMy answer is yes.\nI’ll try to show that as soon as possible.\n\nThe mere fact that you make a comparison between the Shroud image and what you revealingly describe as “man made 2D artefacts” shows beyond any shadow of doubt that you are not one to lecture me on what you call “scientific work” Thibault. \nKindly stop lording it over us Twith your ex cathedra  unchallengeable pdfs.. Your so-called science is fatally compromised by your (presumably) religious preconceptions. You are attempting to dress up your investigations as science.\n They are nothing of the sort. If you knew the first thing about science, with its detached, objective agenda-free scientific method  you would realize that. But you don’t.\nI’m sure you are a very good physician, Thibault. But even I recognize that there’s a lot more to being a good physician than cold detached science, which is why you make a good physician, and I would not.\nMy careers master at school urged me to take up medicine. I declined. I prefer the detachment of science – which can lead to entirely different conclusions.You rid people of their afflictions. I rid people of  their misconceptions (or try to).\n\n","date":"November 5, 2013 at 4:49 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-50087","author":"colinsberry","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"O.K.\nI do not see how I could discredit the shroud or any other similar object. Neither Jehoash Tablet nor Tutankhamen mummy can be “discredited”. In any case you can discredit a theory about an object as the tablet authenticity or the mummy malediction are. I think I’ve refuted (not “discredited”) some theories about the shroud, but the shroud is for me a mysterious object worthy of study yet.\nThe images you have put here have nothing to do with my criticism. I don’t see on them the wrinkles that are clearly visible in Latendresse’s and Jackson’s simulations. For example, the wrinkles between nose and chest in Latendresse’s photo. Neither the contact areas of the fabric that I pointed out are visible.\nYour diagrams are absolutely idealistic and not realistic simulations. They need ulterior explanation and correction but I suppose that the red oval is the head and the blue line is the shroud. I don’t know in what orientation. Both in the simulations of Jackson and Latendresse the head is laying on the ground. So the head and the cloth would be in full contact and a big area coloured must be appearing in the image. Obviously it doesn’t occur.\nInstead of stylized diagrams, the attempt should be made with a real head. So we would see clearly the deformations produced by stretching the fabric (see ulterior comment). They inevitably are produced when the fabric is not flat and then is stretched. So, just the image 1 is credible, vertical projection (i.e. orthogonal) but with the shroud flat. But other problems will arise for this alternative that I have stated in my previous comment.\nIf the distances required for the image was vanished are lower than 5 cm my objection is reinforced. \nI have read some Latendresse’s papers and I haven’t seen any explanation to my objections. I think he cannot do it. So, I think I have refuted his hypothesis.\n\n","date":"November 6, 2013 at 3:48 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-50138","author":"David Mo","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"About miracles:\nI’m humean in this: I will accept miracles only and only if an alternative explanation is more miraculous. This is not the case now.\nI again agree with Raymond Rogers: “We don’t know how” is not sufficient evidence for miracle claims. \nOnly a feature of the Shroud is actually mysterious: superficiality of image. An interesting approach has been done by Luigi Garlaschelli, but he acknowledges that it is not definitive. (http://luigigarlaschelli.wix.com/luigigarlaschelli#!sindone-/c1n58 ).\nI think that the unique way to solve this problem (if possible) is an interdisciplinary independent team working on the Shroud. Art historians, chemists, textile experts and scientific archaeologists between others must compound this team. Absolute independence for churches, sindonologists, anti-sindonologists, sceptics and so on!\nA failure is not disposable. Finally, science cannot answer about all of everything and we don’t need claim miracles when this happens.\nAbout distortions of images:\nThis http://www.pensar.org/images/shroudfig6.jpg or this http://sindone.weebly.com/uploads/1/2/2/0/1220953/8859260.jpg . This is what occurs when you stretched out a cloth that was wrapping a body. A bas relief is different. You can also take references on a body and reworking on the cloth with these references. This is Garlaschelli’s way. The Shroud is similar to a photo in that is a frontal view of a body. Yes. Similar three-dimensional images can be done with frontal photos. You have done a good work Hugh. But I continue thinking that a professional photographer would obtain better performances with frontal light. And a good realistic painter, of course (as Andrea di Buonaiuto called “Da Firenze”, for instance). \nColinsberry: My opinion about your hypothesis has little value for I’m not familiar with chemistry and physics. What you say seems to me hypothetically feasible. But… hypotheses are not evidences. Some additional historical involvements should be studied.  For instance: you can obtain an image very similar to the Shroud by using opaque glasses… but it is uncertain that these big glasses could be made in the Middle Ages.\n\n","date":"November 6, 2013 at 3:51 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-50139","author":"David Mo","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Here is my personal sindone. It is a memory drawing done in less than half an hour with pencil (HB) and fingers. It needs more blurring, but the paper did not allow it and drawing is too small (approx 9x6cm). With more blurring could be fine three-dimensionality and superficiality. I’m not an artist. I drew comics when I was younger and I did this on my notebook in a moment of idleness , but a true artist could do wonders.\nhttps://picasaweb.google.com/lh/photo/fgM5yPy7S3TPmV89ntrS-9MTjNZETYmyPJy0liipFm0?feat=directlink\n\n","date":"November 6, 2013 at 4:26 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-50143","author":"David Mo","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":" My opinion about your hypothesis has little value for I’m not familiar with chemistry and physics. What you say seems to me hypothetically feasible. But… hypotheses are not evidences. Some additional historical involvements should be studied. For instance: you can obtain an image very similar to the Shroud by using opaque glasses… but it is uncertain that these big glasses could be made in the Middle Ages.\nMy one concern is the proposition that the Shroud image has properties that defy science. What are these properties that defy science? I would really like to know. You mention superficiality above. What is so unusual about a superficial image? Has anyone measured the minimum thickness of a scorch, for example, required for it to be visible at different distances (but recalling that one has to stand well back from the Shroud, 2 or more metres it is said, to identify the very faint image as that of a man). What seems fairly certain, as Garlaschelli has pointed out, is that the image would have been more intense centuries ago than the one we see now, and possibly less superficial if the original had comprised an adherent layer of sensitizing solid like ochre pigment, one that has subsequently flaked off leaving just a faint etch on the fabric.\nThe STURP team described the Shroud image a modification of the carbohydrates of starch by chemical dehydration, oxidation etc. similar to that which results from contact with heat of acid. What is so unusual about that? Why the mystique? Again, to return to Garlaschelli, he suggested that the original Shroud was made by a combination of frottage (dabbing) and painting with dry or moist ochre, and that the latter if made by heating green vitriol (hydrated iron(II)sulphate) could well have been contaminated with sulphuric acid (the earliest preparations of sulphuric acid were made by destructive distillation of green vitriol, where the evolved fumes of SO2 and SO3 are trapped in a water bath.\nSorry to land you with the chemistry, but the medievals too had no idea what they were doing in chemical terms. All they knew was that a certain green mineral that occurs in nature could give a high quality form of red ochre on heating, but they had no litmus paper with which to test each batch for acidic impurities that could be there on account of its method of production.\nYes, the Shroud is a one-off, which is what makes it so interesting, but that means one is NOT obliged to look for parallels as would be he case if viewing it primarily as a work of art, which I do not. I see it as a clever and original piece of visual graffiti, probably with a political message that would have been instantly understood by its first viewers – probably a highly select group. The added post-weaving raised side seam on the reverse side (later hidden by the Holland cloth) was probably there from the start, either as a finger grip for manual display, or for slotting into a horizontal groove for more permanent display, perhaps as a scroll-type set up that could be rolled to fold away.\nYes. It’s all hypothesis. So is the claim that it is the burial shroud of Jesus Christ. It’s a question as to who has the better supporting evidence. I have the radiocarbon dating on my side, and I reject the dubious claim that the three labs were all working on a repair. If they don’t like that rejection, then they know what they have to do (in cooperation with the Shroud’s custodians). One can only work from the available evidence.\n\n","date":"November 6, 2013 at 4:51 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-50148","author":"colinsberry","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Freudian slip (one that Rogers would have approved of): replace “starch” with “linen”.\n\n","date":"November 6, 2013 at 5:04 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-50149","author":"colinsberry","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"\ncolinsberry :\n\nThibault HEIMBURGER :\nSorry, this is not why I had in mind.\nYour answer is based on the (supposed) mechanisms (Method A vs Method B).\nThis is not the question.\nIn any scientific work, as you know, the first step is to define the question.\nHere, the question is: ” does the 3-D VP8 Shroud image have 3-D SPECIFIC  properties (I called them “true 3-D”), that are not found in any kind of man-made 2D artifacts by any mean (including scorch)”?\nMy answer is yes.\nI’ll try to show that as soon as possible.\n\nThe mere fact that you make a comparison between the Shroud image and what you revealingly describe as “man made 2D artefacts” shows beyond any shadow of doubt that you are not one to lecture me on what you call “scientific work” Thibault.\nKindly stop lording it over us Twith your ex cathedra  unchallengeable pdfs.. Your so-called science is fatally compromised by your (presumably) religious preconceptions. You are attempting to dress up your investigations as science.\n They are nothing of the sort. If you knew the first thing about science, with its detached, objective agenda-free scientific method  you would realize that. But you don’t.\nI’m sure you are a very good physician, Thibault. But even I recognize that there’s a lot more to being a good physician than cold detached science, which is why you make a good physician, and I would not.\nMy careers master at school urged me to take up medicine. I declined. I prefer the detachment of science – which can lead to entirely different conclusions.You rid people of their afflictions. I rid people of  their misconceptions (or try to).\n\nThe question is “should we be reassessing the VP8 result ?”\nIn my mind, this means (following Hugh photos): ” does the 3-D VP8 Shroud image have 3-D SPECIFIC properties (I called them “true 3-D”), that are not found in any kind of man-made 2D artifacts by any mean (including scorch)”?\nNo more, no less.\nAs I wrote it is is the first step in any scientific work. Does anybody disagree ?\nCB seems to disagree (??) and his answer is full of insults.. Is it truly a scientific approach?\nAnd then some words about my “ex cathedra unchallenged pdfs” and my “religious preconceptions”\nIncredible ! What does CB know about my “religious preconceptions”. What are the relationships between my pdfs and my religious preconceptions” ??\nThe main FACTS:\nIn my pdfs, I have shown ( through true experiments and microscopy) that:\n– There is no mean to obtain a SUPERFICIAL discoloration of a linen fabric similar to that of the TS image color\n– scorch imprint is NOT consistent withe the half-tone effect\n– scorch imprint is NOT consistent with the surface distribution of the TS image\n– etc…(just read my PDFs)\nCB’s only criticism is that I did not use a valid  template.\nCB simply does not understand that  my main purpose was to study all kinds of scorch imprints at small scale, i.e through the microscope.\nThe template I used was perfect to study the different kinds of scorches.\nCB is simply incapable of showing any kind of scorch imprint showing the properties of the TS image.\nBut of course, CB is the only one able to understand what true science is.\n\n","date":"November 6, 2013 at 6:19 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-50235","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Should we be reassessing the VP-8 results (Continues Previous Post)","post":"Final sentence of TH’s permanently-on-dislpay “scorch hypothesis revisited” pdf (see sidebar)\n“The TS image is not a scorch, even a light scorch. In fact, this old hypothesis is very easy to rule out definitively as the body image formation mechanism with some basic experiments and a microscope.”\nNothing can be ruled out if you experiment with a totally inappropriate template, lacking bas-relief character, consisting merely of two stepped planes, and even then, going into, not out of the metal. That final sentence has to be one of the most arrogant I have ever encountered in a supposedly scientific paper.\nPreceding sentence\n“All these differences are related to the fundamental properties of color distribution resulting from the scorching of any linen fabric, i.e. the fact that a scorch is a contact-only mechanism associated with the very low heat conductivity of linen and the spatial geometry of the fabric. This is inevitable.”\nWho said anything about the scorch being “contact-only”? What gives TH that idea?\nThere are three methods of heat transfer – conduction, convection and radiation.\n My main reason for doing my kind of experiment was to create a negative image, superficial, lacking angled directionality, having encoded 3D etc etc. All those have been achieved at least in principle (quantification still required)  and I can be fairly confident now that radiation models are simply wrong and  (in all probability I suspect) agenda-driven. At no stage have I ever said my experiments rely purely for their action on  conduction, and have in fact written at length on the fact that some convection will always accompany conduction. In other words, as soon as presses hot solid against fabric, hot enough, that is, to cause instant pyrolysis of carbohydrates, one is producing superheated steam and air and other gases that can have knock-on effects that affect fabric at points that are not in immediate contact, e.g. into the interstices of the weave, (Yes, tenting effects are problematical, and there is still work to be done, but the Shroud literature is similarly unclear on the question of cloth-body distances too, e.g. with reference to claims that radiation does not work at cloth-body distances greater than 5cm. Why 5cm? What’s so special about that distance?  Since when have radiation effects had sudden cut-offs?)\nWith his stepped template and his description of scorching as purely a contact process TH has resorted to what I believe are called “straw man”arguments in an attempt to knock down my ideas.But since he couldn’t even be bothered to acknowledge either my existence or make reference to any of my numerous experiments, then I don’t need to feel personally offended.\n If he wishes to treat a retired scientist on this blog, the “scorch man” as a non-person, then so be it, but he can hardly complain if I in turn give short shrift to his own inadequate experimental designs, to his sweeping overblown conclusions and above all his pdf exclusivity and standoffishness.\n\n","date":"November 6, 2013 at 7:07 pm","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","id":"comment-50240","author":"colinsberry","site":"shroudstory"}]
