[{"title":"Shroud Question 1 from David Goulet: it’s to do with the testability of my 14th century flour-imprinting model.","post":"Oh, that’s right, it was a bas relief. I recall now the theory. It’s been so long since I’ve been on a Shroud site, I’ve rather lost track of some of the backstory. I miss Dan’s site, though I’m more productive at work these days with its absence. It’s too bad a new investigation on the Shroud can’t be organized (dare to dream) – knowing better today what to look for I’m certain that even without another C-14 round definitive evidence could be obtained as to age of provenance. But what would we do with our time then?\n","date":"August 4, 2016 at 8:50 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/04/shroud-question-1-from-david-goulet-its-to-do-with-the-testability-or-otherwise-of-that-seemingly-shunned-14th-century-flour-imprinting-model-mine/","cat":"new_theory","id":"comment-7566","author":"David Goulet","site":"colinberry"},{"title":"Shroud Question 1 from David Goulet: it’s to do with the testability of my 14th century flour-imprinting model.","post":"I seem to recall Dan saying I had placed over 2000 comments on his site. In retrospect I now regret every single one. When Dan did his instant covers on my postings, invariably inserting his own pro-authenticity spin, and all too often I’m loath to say, attempting to ‘infantilize’, I should have responded here on my site, and my site only. Dan to put it mildly was ‘feeding’ off mine and other people’s content, though the polite term I believe is “curating”. But he said appreciative things about me in his final 2 postings, which helps to prevent too much grinding of teeth…\n","date":"August 4, 2016 at 9:30 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/04/shroud-question-1-from-david-goulet-its-to-do-with-the-testability-or-otherwise-of-that-seemingly-shunned-14th-century-flour-imprinting-model-mine/","cat":"new_theory","id":"comment-7567","author":"Colin Berry","site":"colinberry"},{"title":"Shroud Question 1 from David Goulet: it’s to do with the testability of my 14th century flour-imprinting model.","post":"Hello again David\nOne of my greatest regrets in well over 4 years of this voyage of discovery was in referring to my “Hot Templar” theory.  The Templar in question was Jacques de Molay, Grand Master of the Order, burned at the stake in 1314, or maybe his lieutenant, Geoffroi de Charney (with an e in the surname), Preceptor of Normandy who was burned, or rather slow-roasted alongside de Molay, and said to be uncle of the better known Geoffroi de Charny, Lord of Lirey, first known owner of the Shroud. It was  nephew (?) de Charny (no e)  who commissioned the Lirey Pilgrim’s badge for the 1355 display (or maybe his wife/widow, Jeanne de Vergy).\nNope. I never imagined for a moment that the roasted or semi-roasted Tempalrs were used directly to produce a scorch imprint on linen. They were probably reduced to ashes, ase some contemporary accounts would lead us to believe. \nNo, what I suggested was that his presumed nephew sought a means of commemorating his uncle, and commissioned someone to make  a bronze statue or bas relief of Geoffroi de Charney .that was then heated up to make a scorch imprint, the latter serving as a visual metaphor for the manner in which he went to meet his Maker.\nThat theory was based on some peculiar details on the Lirey Pilgrim’s badge, notably the presence of what looks like a coiled rope or chain around the waist which has no obvious role in crucifixion but features in lithographs etc of burnings at the stake, de Molay’s included.\nTo cut a long story short, I dropped the (disastrously named) “hot Templar” theory on becoming acquainted with the Mark 2 version of the Lirey Badge, or rather the Machy mould for one, with its inset image of the Veil of Veronica. I’ll spare you and other the details of why that led to dropping the ‘hot Templar’ hypothesis, and my switching instead to the notion that the TS was designed from the word go to be a whole body version of a Veronica-like imprint in sweat and blood, but whole body, not just face, and post-, as distinct from pre-mortem.\nThe suggestion that something other than flour might have served as the imprinting medium was simply  to cover myself, there being an abundance of different cereal and other solid powdered foodstuffs that have both reducing sugars and proteins, ones that can be relied upon to give yellow or brown melanoidins (Maillard reaction products).\nMy money’s on wheaten white flour. Incidentally,  I’ve found that a pinch of sodium bicarbonate to the flour, or use of alkali limewater to wet the linen, greatly speeds up the browning of flour imprints in the oven, making it almost certain that one is looking at Maillard products (alkali being known to facilitate their formation).\n","date":"August 4, 2016 at 8:13 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/04/shroud-question-1-from-david-goulet-its-to-do-with-the-testability-or-otherwise-of-that-seemingly-shunned-14th-century-flour-imprinting-model-mine/","cat":"new_theory","id":"comment-7565","author":"Colin Berry","site":"colinberry"},{"title":"Shroud Question 1 from David Goulet: it’s to do with the testability of my 14th century flour-imprinting model.","post":"Hi Colin,\nThanks for answering my question. Your theory continues to hold up well. As I’ve said before, and I believe Thibault agrees, of all the medieval provenance theories yours is the most promising.\nI have a follow up question spurred by part of your answer, “there might have been a different flour or other food source that supplied the necessary protein and reducing sugar for a Maillard reaction”.\nI recall your earlier musing about the image being of a roasted Templar. Was part of the thinking then that a roasted human body could produce a contact imprint because of the Maillard reaction of the roasted human proteins?\nJust curious as to what other food candidates might work, besides flour (which understandably is the more obvious candidate).\n","date":"August 4, 2016 at 6:47 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2016/08/04/shroud-question-1-from-david-goulet-its-to-do-with-the-testability-or-otherwise-of-that-seemingly-shunned-14th-century-flour-imprinting-model-mine/","cat":"new_theory","id":"comment-7562","author":"David Goulet","site":"colinberry"}]
