[{"title":"So is Ray Rogers’ Hypothesis Out the Window by Consensus?","post":"It is a bad idea to refer to a ‘consensus’ when making a scientific point. One should not try to add weight to a statement by referring to an underlying ‘consensus’. Truth has nothing to do with ‘consensus’ and the expression ‘scientific consensus’ is, at the bottom, simply a contradictio in terminis. ‘Group think’ cannot be; thinking & judging is, by its very nature, an individual activity.\n\n","date":"May 3, 2012 at 12:00 pm","url":"https://shroudstory.com/2012/05/03/so-is-ray-rogers-hypothesis-out-the-window-by-consensus/","cat":"image_theory","id":"comment-11094","author":"Jos Verhulst","site":"shroudstory"},{"title":"So is Ray Rogers’ Hypothesis Out the Window by Consensus?","post":"It’s amazing to see a “consensus” like that being approved by a so-called panel of Shroud scientists.  What is easy to see is that the point #1 is far from being proven.  And since the time Rogers proposed his hypothesis about the thin layer of impurities, there’s at least one solid hypothesis that is out there to challenge seriously this point #1.  I’m sorry but Rogers hypothesis regarding the chromophore of the image is far from being dead !  No scientist have been able to show solid proofs that can completely discard this hypothesis.  That’s why I’m a bit surprise that they choose to stick with only one hypothesis, i.e. that the color come from a molecular change in the linen itself (hypothesis that come directly from STURP papers), since it is not proven yet.\nAlso, I have to say that I’m not impressed by this list of facts that can challenge any hypothesis regarding a medieval forger.  I’m far from being a scientist myself, but nevertheless, I think the arguments I brought in the other day about the evidence of the bloodstains (see my recent open letter) are much better when it comes to challenge any medieval forgery hypothesis.  \nBesides having point out the most solid fact (the blood is really blood) we know for sure about the Shroud that can permit to reject any forgery hypothesis involving any artistic technique, they choose to point out some facts (far from being an exhaustive list) about the body image and, in this list, there’s even one or two facts that are still disputed among Shroud experts !!!!\nPersonally, I think this list is pretty weak and should at least have included the fact that the blood on the Shroud is real blood that comes from exudates of traumatic blood clots, proving that there was a real crucified men that was buried into that cloth, leading to one evident conclusion : The Shroud cannot be the work of a forger that used any form of artistic technique.  This conclusion is sure at about 99.9 % and the list don’t even mention this important fact !!!  It’s like they didn’t considered that fact has something important while it is THE most sure and solid scientific fact we have regarding the Shroud !  INCREDIBLE !!!\n\n","date":"May 3, 2012 at 3:46 pm","url":"https://shroudstory.com/2012/05/03/so-is-ray-rogers-hypothesis-out-the-window-by-consensus/","cat":"image_theory","id":"comment-11099","author":"Yannick Clément","site":"shroudstory"},{"title":"So is Ray Rogers’ Hypothesis Out the Window by Consensus?","post":"I made an error in the beginning of the phrase : Besides having point out the most solid fact (the blood is really blood) we know for sure about the Shroud that can permit to reject any forgery hypothesis involving any artistic technique, they choose to point out some facts (far from being an exhaustive list) about the body image and, in this list, there’s even one or two facts that are still disputed among Shroud experts !!!!\nYou should read “Instead” in the place of “Besides”.  That will make more sense…  Sorry !\n\n","date":"May 3, 2012 at 4:52 pm","url":"https://shroudstory.com/2012/05/03/so-is-ray-rogers-hypothesis-out-the-window-by-consensus/","cat":"image_theory","id":"comment-11101","author":"Yannick Clément","site":"shroudstory"},{"title":"So is Ray Rogers’ Hypothesis Out the Window by Consensus?","post":"I may be wrong but I thought that Barrie who seemengly supports this consensus also supported Roger`s hypothesis……\n\n","date":"May 4, 2012 at 6:57 am","url":"https://shroudstory.com/2012/05/03/so-is-ray-rogers-hypothesis-out-the-window-by-consensus/","cat":"image_theory","id":"comment-11110","author":"Gabriel","site":"shroudstory"},{"title":"So is Ray Rogers’ Hypothesis Out the Window by Consensus?","post":"Are you sure Barrie support this consensus ?  Really, I would be VERY SURPRISE !  In fact, when I heard this news yesterday, I thought immediately of him being there and being forced to hear that thing !!!  Can someone tell us if Barrie did or not support (or even signed) that concensus ?  Like I said, I would be VERY suprise because I know that the hypothesis of image formation he favored the most is the one of Rogers…\n\n","date":"May 4, 2012 at 8:29 am","url":"https://shroudstory.com/2012/05/03/so-is-ray-rogers-hypothesis-out-the-window-by-consensus/","cat":"image_theory","id":"comment-11115","author":"Yannick Clément","site":"shroudstory"}]
