[{"title":"So Maybe it is a Painting After All","post":"In my view, this comes close to poisoning the well, by raising a needless doubt. \nCheck Barrie Schwortz photo record of STURP project.\nhttp://www.shroud.com/pdfs/schwortz2p.pdf   \nSlide 69 shows Prof Riggi’s endoscopic camera focusing on forehead bloodstain, and also slide 70, showing full Shroud cloth with back-lighting. \nOn both slides, the only objects visible on the cloth with such back-lighting are the blood-stain marks. The image itself is utterly translucent. \nNot only did this medieval artist have all the other knowledge attributed to him, it would seem that he had discovered a mysterious pigment, which not only reflected light, so that the image could be visible, but it also completely transmitted the light as well.  I imagine there is probably some theorem of continuity of light particles which states that this cannot happen in the real physical world!\n\n","date":"September 24, 2014 at 6:05 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-154865","author":"daveb of wellington nz","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Myrrh resin in thin layers is translucent.   Starch and Pectin were identified as making up that “translucent image”   By coincidence starch and pectin and myrrh and aloes all share the same chemical properties. Same sugars, same acids.  Dr. Baima Ballone found myrrh and aloes in the blood of The Shroud my antibody antigen testing.   McCrone said the iron oxide/blood was “suspended in gum arabic”   Gospel of John says that myrrh and aloes was used in the burial.   Myrrh is a caramel, sepia color.  Is light reflective.\nThat is all I am going to say today.\n\n","date":"September 25, 2014 at 5:52 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-156112","author":"Dave HInes","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"No, no, no well poisoning, I assure you. Not only was the existence of pigment only one possibility in my comprehensive overview of what a painting might have left on the shroud, but McCrone got his friend Walter Sandford to paint a Shroud face using “10 parts per million of red ochre in a 1% gelatin [collagen] solution” (Judgment Day for the Turin Shroud, p.142). It is not perfectly clear to me exactly what this means, or whether it was necessary to paint several layers of this ‘paint’ on the cloth for an image to be visible, but as it stands, it is extremely doubtful if Barrie’s fairly simple and fairly small scale backlit photographs, or even the more detailed X-ray photos of Mottern et all, would have detected it. The hypothesis cannot be refuted on these grounds alone.\n\n","date":"September 24, 2014 at 8:05 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-154955","author":"Hugh Farey","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"McCrone did not publish quantitative data on the amount of pigments he has found on the sticky tapes. He remains vague on the subject.This is a major shortcoming. Hugh, did you notice that? \nHow come he never published a clear table where each sticky tape is listed with the amount of pigments found? Actually, from the vague data that he published, you can see that there is no clear relation between the sticky tapes that have pigments and the image. It could as well be a relation between the amount of pigments and the blood and water stains. \nThe claim that there is a perfect correlation between iron oxide found on the sticky tapes and the blood/image areas is clearly faulty. McCrone writes (p. 92) that after studying the tapes,\nfour tapes were misclassified.  He reanalyzed carefully only these four tapes to search for some iron oxide, and do find some.  But he never reanalyzed the non-image area sticky tapes.  This is a clear faulty methodology: if he had given the same amount of scrutiny to the\nnon image area tapes he could have found some iron oxide (red ocher). In essence, his methodology is biased towards a preset conclusion.  He even contradicted himself and made a circular reasoning in the same paragraph (last paragraph on p. 92): he could now write that all sticky tapes that were in the image area have a significant amount of red ocher but at the same time saying that these four tapes had small amounts of red ocher.\nDid he really know how much pigment he found? This looks doubtful.\nWith no quantitative data published, McCrone speculates on the amount of pigments that could be on the Shroud and try to prove that with a small amount of pigment you could paint an image on a cloth. But the result of the paintings are not analyzed to show that they are like the Shroud.\n\n","date":"September 24, 2014 at 12:40 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155115","author":"Mario Latendresse","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"I agree with all of that, Mario. I’m not championing McCrone’s methodology nor his findings. Nor do I know what a significant quantity of iron oxide is. I am disputing that the possibility that the image could have been formed as a result of applying some kind of paint to the shroud can be definitely ruled out.\nThe fact that the image is transparent to transmitted light and X-rays, the fact that McCrone’s work was faulty, even the fact that his own experiments with water colour both soaked through to the back and were visible thereon, do not of themselves refute such a possibility.\n\n","date":"September 24, 2014 at 1:18 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155139","author":"Hugh Farey","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Hugh, you wrote:\n“McCrone thought there were, and produced at least one experiment which appeared to demonstrate it. I do not know if it was challenged by any counter-experiments showing the opposite.” \nMcCrone did not produce such an experiment because it did not appear to demonstrate that it was a painting at all. That’s my point. I do not see how by citing McCrone’s work you support your assertion that a painting was not definitely ruled out.\nIt appears that you are extending the meaning of painting or “definitely ruled out” or both.\nWhat does “definitely ruled out” mean to you?\nHow do you define “a painting”?\nTo state that the Shroud could be a painting you have to show that at least one form of painting makes it possible. Otherwise, you are stating that some unknown form of painting makes it possible that it is a painting, which is meaningless to me because it no longer gives any clear meaning to the word “painting”. Are you using a mechanical device not involving a painter? No brush or some brush? How do you define “your” painting medium? \nLet’s put it this way: I do not know any painting techniques that could have produced the Shroud.\nHugh, do you know any?\n\n","date":"September 24, 2014 at 3:40 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155208","author":"Mario Latendresse","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"“It appears that you are extending the meaning of painting or “definitely ruled out” or both.”\nDon’t be too picky… Scorching or painting or chemical scorch paint, what difference?\n\n","date":"September 24, 2014 at 4:25 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155233","author":"anoxie","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"“To state that the Shroud could be a painting you have to show that at least one form of painting makes it possible.” No. That’s not how Science works. A hypothesis is not established by demonstrating its possibility; it is refuted by demonstrating its impossiblity. See Thibaut’s comment below, where he demonstrates that a 10ppm iron oxide/water mixture does not result in a visible image. That’s a real challenge to McCrone’s work. If your statement were correct, it would be equally true to say that unless at least one form of biological/physical formation were demonstrated it cannot be hypothesised that the Shroud formed naturally in a tomb. Which is of course untrue.\nHowever, it would not be sensible not to have some idea of how a painting might have come about. Another experiment currently underway but not yet completed involves a cloth bag containing a thick paste of iron oxide, water, egg white and sulphuric acid. This is dabbed vertically downwards onto a piece of linen. A very visible reddish disc of iron oxide is formed, denser in the middle than the outside, without edges or directionality, and which does not seep through to the other side of the cloth. The linen is left to dry, then washed thoroughly to try to remove everything. After redrying again, the idea is that we have nothing more than a sulphuric acid “scorch” to show where the “paint-bag” was pressed to the linen.\nSo far, results have been poor. My iron oxide is so fine it comes through the cloth bag too readily, and the thick paste tends to dry up too quickly. The acid does not produce a visible “chemical scorch” unless the linen is placed in an oven, and even then the results are rather erratic. However, there are clearly many permutations to be tried, and I have hopes that something respectably supportive of the painting hypothesis will emerge eventually!\n\n","date":"September 24, 2014 at 5:37 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155275","author":"Hugh Farey","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"McCrone’s work was shoddy at best and quite unscientific.  That’s it?\n\n","date":"September 24, 2014 at 8:18 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-154964","author":"Andy","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"A scientist nor artist am I. The image I see here does not does not have anything but same shape and resemblance of what I have seen on the internet of The Shroud.\n\n","date":"September 24, 2014 at 9:13 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155001","author":"ekmcmahon","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"That’s OK. I think it is a creation of a commercial picture-from-photograph application which Dan has mentioned before. It is not intended to be any kind of accurate rendition of the actual image.\n\n","date":"September 24, 2014 at 1:00 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155128","author":"Hugh Farey","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"That’s right. Think of it like a cartoon. I simply took a picture of the shroud and added “electronic” Photoshopped in some brush strokes.\n\n","date":"September 24, 2014 at 1:34 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155147","author":"Dan","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"It seems that very little can be ruled out: radiation, scorches, paint, lasers, etc. But in each case the method that was ‘used’ is beyond 21st century backward engineering. Whoever is responsible for that image is a genius for the ages.\n\n","date":"September 24, 2014 at 9:56 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155029","author":"David Goulet","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"McCrone’s copy created by his artist friend was examined by others including Dr. Gilbert Lavoie who debated McCrone on Chicago radio.  Following McCrone’s instructions, the image soaked all the way through the cloth and was visible on the other side,  STURP has already determined there is no evidence of capillary action.  No liquids were applied to create the image.\n\n","date":"September 24, 2014 at 10:03 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155035","author":"Russ Breault","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Thanks, Russ, for that clarification. There is much of McCrone’s work that I don’t accept, including his determination that the image was a water colour (iron oxide in a 1% gelatin solution) and painted on, which would probably have left the very “snow-fences” he objected to on page 143 of his book. However, the specific reference in my comment above was about whether a paint layer of “one part per million” of iron oxide would be visible at all either by reflectance (just looking at it), transmission (Barrie’s backlight) or X-ray. The illustrations in his book appear to show reflectance (and were apparenty visible on the other side of the cloth too), but as I say, may have been formed by several layers of “paint.” If not, then, as I said above, it may be that the “pigment” was too attenuated to be detectable via either backlight or X-ray.\n\n","date":"September 24, 2014 at 1:01 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155129","author":"Hugh Farey","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Sorry, “10 parts per million,” of course.\n\n","date":"September 24, 2014 at 1:09 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155133","author":"Hugh Farey","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Super relativism, super illisionism, super skepticism…\n\n","date":"September 24, 2014 at 11:37 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155080","author":"anoxie","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"This is so stupid. Science has advanced to a stage that it is possible to pick up paint, in any form. Spectrometers are capable of many things. Also if this is so sophisticated, how did they know about it so long ago. Why can’t people accept the fact that Jesus left that cloth so we would know about his resurrection and his promise of coming back to judge the living and the dead. The lack of faith in people is astonishing\n\n","date":"September 24, 2014 at 12:52 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155123","author":"Rosalie Giansante","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"It is unfortunate that Hugh cannot see his way to dedicating more of his remarkable scientific talents to corroborating the authenticity of the sacred burial cloths of his Lord and Saviour instead of persistently debasing them by proposing outlandish methods of forgery. \nThe small traces of iron oxide on the cloth are readily attributable to the retting process of extracting the linen from the flax, and have no relationship towards any attempt at painting.  Any small residues of paint particles discovered are readily attributable to contamination from flakes of paint of painted works brought into contact with the cloth (= contagious magic) or else from the debris of old masters in its surrounds.  Not one single member of the STURP team could agree with the unscientific allegations of the late unlamented Walter McCrone.\n\n","date":"September 24, 2014 at 3:55 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155219","author":"daveb of wellington nz","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"STURP never explained the ‘large’ quantities of calcium carbonate they found on the Shroud and were apparently unaware that in the medieval period and right up to today it is a major component of gesso that was applied to the outer fibrils of linen to seal it before painting. I agree with Hugh that painting cannot be ruled out.\n\n","date":"September 24, 2014 at 4:29 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155235","author":"Charles Freeman","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"What would it take to rule painting out?\n\n","date":"September 24, 2014 at 4:36 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155239","author":"David Goulet","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Seeing how far microscopy and the analysis of pigments has progressed sine 1978, I would happily accept the findings of a conservation lab that had experience of dealing with painted cloths.\n\n","date":"September 24, 2014 at 4:58 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155250","author":"Charles Freeman","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Hi David this is a comment made by P, Schumacher on the subject.\n “Iron pigment is simply not possible for image formation. Iron pigment, no matter how\nthin the mixture, will produce a specific spectral signature that is not present on the\nShroud in the image areas, or anywhere else on the Shroud, in sufficient total area of\npresence to cause formation of the image. Iron pigment, when evenly surface-illuminated,\nwould produce the same reflectance response, thus producing a flat elevation on the VP-8\nisometric display. This result is not observed on the Shroud.\nIron pigment is more reflective than transparent. When an iron pigment is exposed to\nlight, more photons will be reflected than will pass through the iron pigment to the other\nside. Some photons will be absorbed. Therefore, if an iron pigment image is lit from\nbehind, it will “block” (absorb and reflect) more of the light than it will allow to pass to\nthe other side. This would result in a much higher contrast photograph of the iron\npigment image.  However, when illuminated from behind, the Shroud\nimage is not clearly visible. It is not discernable.\nThe “dabbing process”, and the “iron pigment theory”, are posed together as a definitive\nconclusion on the “trickery” side of the “explanations pile”. Simple results of simple\ntests, such as back-lighting the image, prove such theories are incorrect. More complex\ntests also prove they are incorrect. Microscope examinations of the threads shows no\npigment, no binders, no “bleeding of chemicals” between fibers, and no fiber\ndiscoloration to match iron pigment. Spectral response tests prove there is no “signature”\nat the appropriate wavelengths for iron pigment reflection. And, density-slicing tests do\nnot show large areas of even illumination indicating pigments and binders in the Shroud\nimage area. Yet, such “theories” are published as fact, in spite of the many test results\nproving it cannot be so.\n\n","date":"September 27, 2014 at 10:42 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157340","author":"Dave Hines","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"This is another note able quote on the subject. \nIf one considers the Shroud image to be “a work of art” of some type, then one must\nconsider how and why an artist would embed three-dimensional information in the gray\nshading of an image. In fact, no means of viewing this property of the image would be\navailable for at least 650 years after it was done. One would have to ask, (assuming this is\na “natural result” in some style or type of art), “Why isn’t this result obtained in the\nanalysis of other works?” Or, if this is a unique work, “Why would the artist make only\none such work requiring such special skills and talent, and not pass the technique along to\nothers?” How could the artist control the quality of the work when the artist could not\n“see” gray scale as elevation? Did the artist predict the outcome before the outcome could\nbe defined? Would an artist produce this work before the device to show the results was\ninvented?\n\n","date":"September 27, 2014 at 10:48 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157341","author":"Dave Hines","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Likely as not, any Calcium Carbonate that STURP found on the Shroud was from contact with the aragonite limestone typical of Jerusalem geology, when the burial cloth was laid in the tomb.\nFor an article on Calcite vs Aragonite, see:\nhttp://geology.about.com/od/minerals/fl/calcite-vs-aragonite.htm\n\n","date":"September 24, 2014 at 5:12 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155259","author":"daveb of wellington nz","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"I don’t think that would explain the ‘large’ quantities that STURP found . One has to remember that with dramatic unfurlings almost every year in the seventeenth century ,any smaller fragments would have fallen off but calcium carbonate as part of a gesso would be more likely to have kept on – as ,of course, it was intended to. I could not believe my eyes when I read in the STURP report that they had not examined any medieval paintings on linen for comparison or apparently even consulted conservationists who specialised in such things.  Surely you approach every avenue before you rule out such things.  The question of painting must be left open – but at least get an conservation expert in these things on the case !\n\n","date":"September 25, 2014 at 2:38 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155545","author":"Charles Freeman","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Hugh,\n“and the scientists involved in the Shroud showed little evidence of knowing much about painting.”\nNo. Before 1978 STURP did know that the Shroud could be a paint. They studied in depth the history of painting, the pigments that could have been used for the Shroud and much more.\nIn fact, the main goal of STURP in 1978 was to look at the Shroud  to find evidence of painting. They found none of them.\n“McCrone got his friend Walter Standford to paint a Shroud face using “10 parts per million of red ochre in a 1% gelatin [collagen] solution” (Judgment Day for the Turin Shroud, p.142). It is not perfectly clear to me exactly what this means, or whether it was necessary to paint several layers of this ‘paint’ on the cloth for an image to be visible..”\n“10 parts per million of red ochre in a 1% gelatin [collagen] solution”\nIn 2011, a friend of mine, did use red ochre in gelatin using the proportions given by McCrone.\nThe result: nothing: no color. Only a large waterstain on both sides of the fabric.\nI wonder how Standford (the McCrone’s painter) had been able to obtain his Shroud-like image ??\n\n","date":"September 24, 2014 at 4:54 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155246","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"That is not correct, Thibault. In their physics and chemistry article STURP specifically  stated that they had not examined any paintings on linen. There is nothing in their article about how linens were prepared for painting and how the painting was actually done despite medieval treatises on the subject. They failed to explain the presence of calcium carbonate that many would see as a possible indication of gesso. In short, this area remains open for further research especially through seeking expert opinion as to why the calcium might have been on the cloth in ‘large’ quantities.\n\n","date":"September 24, 2014 at 5:07 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155256","author":"Charles Freeman","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Discussing this is a waste of time.\nGentlemen, it cannot be ruled out that the world is ruled by Martians, who mind-control all the goverments, and faked all the footage of Mars from all the probes that surveyed it, to cover a presence of their civilization. Just like it cannot be ruled out that Shroud is a painting, made by completely unknown technique, that leaves no traces of pigment, no brush strokes, no directionality, outlines, etc.\nThis is the same way of paranoid thinking, having nothing in common with scientific inquiry.\nAnother aspect comes to my mind. We can rule out in practice that the Shroud is a painting. But thinking about another artifact claimed to be acheiropoietos, The Manoppello Image.\nCan we, based on our present knowledge, hi-res scans, UV fluoroscence, transparency of the Veil, etc. rule out that Manoppello Image is a painting?\nOr is still, perhaps a theoretical way to paint it somehow? With such quality: http://manoppello.eu/eng/gfx/oblicze14.jpg\nBTW: Mario, I haven’t heard a voice from you, since I gave you that Manoppello photographs to be installed in Shroud Scope. What is your decision, do you want to install it or not?\n\n","date":"September 24, 2014 at 5:32 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155272","author":"O.K.","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Thank you, Thibault, for being the only reply to the problems I expressed, without inventing new ones as a kind of smoke screen. Your description of a 10ppm iron oxide/water mixture not being visible when painted on linen is a definite counter-example to Walter Sandford’s experiments. Unless he or McCrone was an out-and-out liar, which I do not believe, I think he must have painted over and over his image until finally the areal density was sufficient to be visible. The question now arises of what the minimum areal density of iron oxide for visibility is, and whether an image of such a density is visible by transmitted light. I feel another exeriment coming on, which has the advantage of being sufficiently simple for me not to have to do it myself, but to delegate it to a willing volunteer! Watch this space…\nAnd Daveb, I now have linen, dextrin, saponin and corpses, and during half term, a few weeks away, I shall be unleashing putrescine and cadaverine on various preparations. I shall publish my findings in the December Newsletter of the BSTS, but will be sure to let you all know how I fared as soon as the experiments are complete.\n\n","date":"September 24, 2014 at 5:49 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155284","author":"Hugh Farey","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Gratified to know there’s some progress.  But I shan’t build my hopes too high.  For all anyone knows, it probably also requires some sychronous emissions of radon gas, and variations in the magnetic and electric fields as well.  But it will be interesting, no doubt regardless.\n\n","date":"September 24, 2014 at 6:50 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155317","author":"daveb of wellington nz","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"For all anyone knows, putrescine and cadaverine are not involved.\n\n","date":"September 25, 2014 at 1:02 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155498","author":"anoxie","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"But if present they can be identified and tested; if absent they would fail the test.\n\n","date":"September 25, 2014 at 3:04 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155558","author":"daveb of wellington nz","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"And I thought roasting the chicken with the linen cloth on top was daring of me.  You are a brave, brave man in the cause of Science.  We will be waiting for the results.\n\n","date":"September 26, 2014 at 7:40 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157074","author":"Josie Tyner","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Charles : In short, this area remains open for further research especially through seeking expert opinion as to why the calcium might have been on the cloth in ‘large’ quantities.\nHigh quantity of Calcium –  Most probably this could have occured as a result of the radiation of the body (read Skurka hypothesis). Ca would have come as a residue from the bones of the body.\n\n","date":"September 24, 2014 at 7:24 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155334","author":"Sampath Fernando","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"A copy of Kohlbeck & Nitowski’s paper on Calcium Carbonate found on the Shroud  can be found in the BSTS newsletter NO. 14 Pt 3:\nJoseph A. Kohlbeck & Eugenia L. Nitowski, “New Evidence May Explain Image on Shroud\nof Turin: Chemical Tests Link Shroud to Jerusalem” Biblical Archaeology Review, vol 12 no.\n4, July/August 1986, pp.18-29. \nCharles can skip over Ian Wilson’s  review of Rex Morgan’s book, and the Kohlbeck & Nitowski paper follows.  It is available on the shroud.com site at:\nhttp://www.shroud.com/pdfs/n14part3.pdf  \nIt adequately explains and identify the source of the CaCO3 there.  It has nothing to do with gesso or any other painting medium.\n\n","date":"September 24, 2014 at 8:54 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155377","author":"daveb of wellington nz","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Hugh you wrote: “That’s not how Science works. A hypothesis is not established by demonstrating its possibility; it is refuted by demonstrating its impossiblity.”\nFirst, at a minimum, an hypothesis has to be clearly stated with appropriate definitions. To quote Wikipedia: “A hypothesis is a proposed explanation for a phenomenon. For a hypothesis to be a scientific hypothesis, the scientific method requires that one can test it.” Notice the “can test it”. So a rather good description of the hypothesis has to be given. That’s how you avoid going into a circle discussing imprecise hypotheses or claims.\nEssentially, I was pointing out that you seem to extend the meaning of “painting” and it is so, because the method you described above, which involves “a thick paste of iron oxide, water, egg white and sulphuric acid”, is not what most people would consider a painting. The technique is, ideally, intended not to leave any pigments. \nIn any case, the fact is that McCrone tried to prove that it was a painting, and he failed. It is very unlikely that it is a painting for all the reasons already mentioned.\n\n","date":"September 24, 2014 at 11:46 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155465","author":"latendre","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Absolutely. I couldn’t agree more.\nHypothesis One: The Shroud image could have been produced by the application of pigment, binder and medium, which at the time of application was visible as an image by virtue of the pigment, but which may now only be visible by virtue of the degradation of the substrate. This can be tested by various experiments involving different possible substances in different quantities upon different preparations of cloth. It cannot be refuted (definitely ruled out) except by demonstrating that it is impossible.\nHypothesis Two. The Shroud image could have been produced by the decomposition of a human body within which it was wrapped, the products of which, chemical, electromagnetic, or nuclear reacted with the cloth in such a way that an image was formed. This can be tested by various experiments involving different possible emanations in different quantitiies upon different preparations of cloth. It cannot be refuted (definitely ruled out) except by demonstrating that it is impossible.\nIn both these cases some emphasis should be placed on the word “possible.” A painting technique involving azo dyes could be considered impossible unless some evidence could be found to suggest that such compounds existed 500 years ago. A decomposition technique involving collimated radiation could be considered impossible unless some evidence could be found to suggest that such radiation can emerge from a body.\nHypothesis Three. The Shroud image could have been produced by a miracle. This cannot be tested. It cannot be refuted. It is not a scientific hypothesis.\nThe only thing I would add to Mario’s “It is very unlikely that it is a painting for all the reasons already mentioned,” is, as you will have guessed “It is very unlikely that it is a natural formation for all the reasons already mentioned.” The juxtaposition of these two statements weakens the term “very unlikely” somewhat.\n\n","date":"September 25, 2014 at 2:43 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155548","author":"Hugh Farey","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Hugh Farey’s so-called “medieval forger” was “painting” with stuctural colour (see the TS fairly transluscent volumetric body image),  limestone-dust (Jerusalem/meleke or malky/royal limestone?), a crucifixion victim’s sweat (see the TS body image straw yellow coloration) and blood (as if shed from yesterday)… HOOOOOOOOw clever!  Hugh methinks you just cannot discriminate between crucifixion and crucifiction…\n\n","date":"September 25, 2014 at 4:16 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155618","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"McCrone was wrong (or it seems to me). I think he imagined the Shroud image was painted with the faint aspect we now see. This hypothesis has some conflictive (chemical) implications that I am not qualified to discuss and seems contradictory with direct testimonies from the past. But there is an alternative hypothesis that obviates these problems. Garlaschelli has shown how some main features of the image can be explained by a degradation process of ancient pigments.  See here a short report in English: https://sites.google.com/site/luigigarlaschelli/shroudreproduction . It is only a hypothesis as the same author says (time cannot be simulated in a laboratory, he said), but it is coherent and more explanatory that the direct painting hypothesis.\n\n","date":"September 25, 2014 at 5:09 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155649","author":"David Mo","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Garlaschelli totally failed to reproduce the TS fairly translucent volumetric structural colour and the straw-yellow coloration superficiality. Besides he totally messed up the blood image/heamatic cartography (palaeoanatomopathologically speaking G’s so-called “shroud blood image” is totally unrealistic. It just could not deceive the eye of an  expert worth his salt).\n\n","date":"September 25, 2014 at 5:24 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155662","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Typo: the TS fairly translucent volumetric structural colour BODY IMAGE\n\n","date":"September 25, 2014 at 5:27 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155668","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"“In particular, the image is a pseudo-negative, is fuzzy with half-tones, resides on the topmost fibers of the cloth, has some 3D embedded properties and does not fluoresce (…) We believe that our attempts represent – more than a reproduction – an interesting addition to the ongoing debate on the origin of this maybe-not-so-impossible image.”. (Luigi Garlaschelli)\n“Translucent volumetric structural colour?  Garlaschelli’s experiment only shows that an image like the Shroud of Turin can be produced by a degradation of pigments. Proofs and refutations of the painting hypothesis based on the current aspect of the image are misguided. I agree with Hugh on this point: A survey by a team of conservative textile experts (and scientific archaeologists, I add) is needed. This is a big hole in the studies on the Shroud.\n\n","date":"September 26, 2014 at 3:04 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-156458","author":"David Mo","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"“Conservator”, not “conservative”, of course.\n\n","date":"September 26, 2014 at 3:08 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-156459","author":"David Mo","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"David MO wrote: “Garlaschelli’s experiment only shows that an image like the Shroud of Turin can be produced by a degradation of pigments.”\nActually (to the initiated’ eye) it doesn’t at all… G’s  “shroud blood & body image” is neither translucent nor even volumetric nor even full length nor even haematic nor even straw yellow etc. G’s attempt is a scientific and archaeological FAILURE.\n\n","date":"September 26, 2014 at 6:05 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-156604","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"“The initiated’ eye” is very inconstant. There is not a clear consensus on what are the main features of the Shroud. From seven to a hundred. For the most part they are very debatable. It seems as you are speaking of some of them.\n\n","date":"September 26, 2014 at 12:13 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-156953","author":"David Mo","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"I’m sorry but I’m not a fetishist of the peer-review. Furthermore, your question is out of place. The features you marked are not in other sindonists lists that don’t matched between them neither. This implies that they are debatable questions. \nPS: Do you think everything is published in a “peer-reviewed” journal is not debatable? Really?\n\n","date":"September 29, 2014 at 10:55 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157694","author":"David Mo","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"David MO wrote: “The initiated’ eye” is very inconstant. There is not a clear consensus on what are the main features of the Shroud. From seven to a hundred. For the most part they are very debatable. It seems as you are speaking of some of them.\nThe haematic quality of the TSis not debatable (it is not made of red\n ochre as you want us to believe!)\n\n","date":"September 27, 2014 at 6:52 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157182","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Addition: The body image is fairly translucent(structural colour) and straw yellow. This is not debatable either. What is REALLY more debatable (and even wrong) is your assertion  “Garlaschelli’s experiment only shows that an image like the Shroud of Turin can be produced by a degradation of pigments”. This is crap.\n\n","date":"September 27, 2014 at 6:59 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157185","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Typo: the haematic quality of the TS man’s image. Besides it does stand bloodstain pattern analysis too, which Garlaschelli’s will fail from the very outset.\n\n","date":"September 27, 2014 at 7:24 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157189","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"If the qualities you propose were not debatable ,they  would appear in the list of 12 proposed by  Manuel Carreira or the 7essential features consensuated in the Congress in Valencia. If not, it is because they are debatable even within the sindonist field itself. Others have been discussed by no sindonist authors. They are debatable.\n\n","date":"September 28, 2014 at 10:52 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157469","author":"David Mo","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"David Mo wrote: “If the qualities you propose were not debatable ,they would appear in the list of 12 proposed by Manuel Carreira or the 7essential features consensuated in the Congress in Valencia. If not, it is because they are debatable even within the sindonist field itself. Others have been discussed by no sindonist authors. They are debatable.”\nCould you refer me to peer-reviewed papers NEGATING the very reality of  the TS body image/imprint relative tranlucency and straw-yellow colour + the ventral &  dorsal views of a full length body image/imprint + the haematic quality of the TS body & blood image/imprint, please? Do you really think experts worth their salt can  mistake (ghostly?) red ochre pigment for blood (whether animal or human blood)? Are you not mixing apples with oranges? Methinks archsceptics  can negate the TS image/imprint most obvious realities… whether consciously or in bad faith.\n\n","date":"September 29, 2014 at 5:52 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157626","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"My last comment has to be placed here. Sorry\n\n","date":"September 29, 2014 at 10:57 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157696","author":"David Mo","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"David Mo,\nSo you just cannot refer me/us to any peer-reviewed paper NEGATING the very reality of the TS body image/imprint relative tranlucency and straw-yellow colour, the ventral & dorsal views of a full length body image/imprint and the haematic quality of the TS body & blood image/imprint.\nCould you then AT LEAST refer me to NON peer-reviewed papers NEGATING the TS image/imprint most obvious realities on solid grounds?\n\n","date":"September 29, 2014 at 11:11 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157701","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Of course, You can see an extensive bibliography (peer-reviewed or not) in my blog.  Click on my avatar, if you like. I recommend you the works of Italian authors: Nicolotti, Rinaldi, Lombatti and others. Unfortunately they are not always in English and you the English-speaking  are not very gifted for foreign languages. Joe Nickell’s  “Inquest on the Shroud of Turin” is a bit old, but on many issues is indispensable. Have you read it?\n\n","date":"September 30, 2014 at 3:35 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157892","author":"David Mo","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Max Patrick: Be more carefull when quoting me, please. I haven’t said this:\n“So you just cannot refer me/us to any peer-reviewed paper NEGATING the very reality of the TS body image/imprint relative tranlucency and straw-yellow colour, the ventral & dorsal views of a full length body image/imprint and the haematic quality of the TS body & blood image/imprint.”\n\n","date":"September 30, 2014 at 3:44 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157894","author":"David Mo","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"So where is Colin Berry in all this?\n\n","date":"September 25, 2014 at 6:02 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155693","author":"Paulette","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"\n\n","date":"September 25, 2014 at 6:21 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155709","author":"Colin Berry","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"And where is Paulette, could the image be a painting?\n\n","date":"September 25, 2014 at 11:22 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155890","author":"anoxie","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Why not just use sweat? Dan, that’s an intriguing insight. If I was trying to make something look like a sweat imprint the first thing I’d try is exactly that. Take a person who looks like Jesus, get them nice and sweaty, oily too, and very dirty — and then press a linen over them. Blood could be added on afterward or some self-flagellation could be done.\nWhat would the resulting image look like? This is testable, no? It could be that the resulting image is rather disappointing and thus this method was abandoned. What does a sweat imprint actually look like?\n\n","date":"September 25, 2014 at 9:24 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155826","author":"David Goulet","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"But D. isn’t the image on the shroud a negative? The Man of the Shroud has amazing anatomical detail when seen as a “positive,” so much more than pressing someone’s face against a cloth could achieve (had an art class as a child where we did a similar thing with tempera paint; it’s fairly gross and the end result was that each person’s face was fairly indistinguishable from his neighbor’s )   And any linen or such pressed over  a person’s face would give the Mask of Agamemnon effect (super big cheeks) that the man of the Shroud does not have.\n\n","date":"September 26, 2014 at 9:24 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157095","author":"Josie Tyner","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Colin……Your Revolver reply to Paulette is hilarious.  I’m a big Beatle fan and particularly enjoy John Lennon’s take of this song.  Though I most often don’t share your views on the Shroud, your response here has provided some much needed light-hearted relief to the far-too-often negative responses sadly given in this increasingly acrimonious debate.  Thanks!\n\n","date":"September 25, 2014 at 11:06 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155887","author":"David O.","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Thanks David O. One doesn’t like to boast, but …","date":"September 25, 2014 at 11:26 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-155891","author":"Colin Berry","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"How would the forger know to apply just the right amount of pigment for it not to soak through to the reverse side, but to occupy the very pinnacle of the fabric?\n\n","date":"September 25, 2014 at 3:01 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-156021","author":"ChrisB","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Painters of linen to this day made/make sure the painting did not seep through by creating a layer of gesso onto which the pigments were painted. If you google around ‘painting on linen’ you will find out how to do it .\n\n","date":"September 25, 2014 at 3:29 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-156041","author":"Charles Freeman","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Unbelievable you would proffer that up and it’s very revealing what you don’t say.  If you know of such a painting that sits on the top one-five-hundredth of an inch of the linen, show us where to find it!  You cannot!  If you don’t like that measurement, pick your own, as long as it is somewhere close to that.\n\n","date":"September 25, 2014 at 4:53 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-156083","author":"Nabber","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Nabber is confusing the penetration of the deterioration into each fibre with the penetration of the deterioration into each thread, which seems to be a few fibres deep. See Giulio Fanti’s “Microscopic and Macroscopic Characteristics of theShroud of Turin Image Superﬁciality.” Given the remarkable density of the Shroud, this seems quite a reasonable possible deterioration scheme, whether caused by natural or artificial means.\n\n","date":"September 25, 2014 at 5:57 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-156115","author":"Hugh Farey","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Hugh, if you think the Shroud could be a painting, you should publish your work in the next newsletter of the BSTS.\n\n","date":"September 26, 2014 at 8:20 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-156733","author":"anoxie","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Mr. Freeman many of us here are artists, and we have used both acrylic gesso and the gesso proper for oil paints.  The fact is, gesso makes the entire linen very stiff and the constant folding and unfolding would crack the dried gesso, if would flake off in little bits and eventually be gone entirely.  The whole point of gesso is that the pigment adheres to it, not to the linen.  Many of the ancient guilds of Florence and Sienna and other places had very closely guarded secrets that involved dying, tinting, etc, secrets that may be lost to us today. Even so, one would think that this knowledge would be retrievable by the best scientific equipment the world has to offer?  If the craftsmen and burgers of nearly a thousand years ago can baffle doctors of organic chemistry, scientists who have more letters after their name than Carter’s has little liver pills, than I doubt a simple explanation like ‘gesso’ would go unnoticed.  An unidentified genius who created a Medieval masterpiece is often called the “Master of the Annunciation (or the deposition, or the Assumption, or whatever he painted).  The Master of the Shroud of Turin, whoever he was, apparently turned down every other commission he was offered to create a similar masterpiece, or he died, or he quit painting (or dying or tinting or whatever) . Weird, right? Not coming to any conclusions here, but weird.  IF-and I say IF-the Shroud of Turin is not actually the Shroud of the Man here depicted, then my hypothesis is that it is the world’s first photograph, because it is a NEGATIVE.  Alchemy was a secret science guarded more closely than any guild secrets, because it was very suspect and allied to the practice of magic.  I don’t know how a photographic reagent could have been applied to the cloth without destroying it.  And I don’t know how such a thing could have been discovered and then forgotten.  I suspect we will do no more than wonder about the SOT, for a long time to come, and perhaps forever.  But one this is certain, ANYONE who claims to know exactly what the SOT must be taken with more than a grain of salt.\n\n","date":"September 26, 2014 at 9:52 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157103","author":"Josie Tyner","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"O.K., Josie So why not join me in leaving the question open?\n\n","date":"September 27, 2014 at 1:03 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157135","author":"Charles Freeman","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"It is simply because gesso does stiffen the linen that Cennini advises putting it on the outer fibrils only. It was clearly a very skilled operation to get it right but the number of painted linen flags fluttering in medieval paintings shows that they could do it.\n\n","date":"September 27, 2014 at 1:43 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157148","author":"Charles Freeman","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Summary of the Kohlbeck & Nitowski paper can be found at:\nhttp://holyshroudguild.org/ceacutesar-barta.html   \nIt seems that calcium and strontium were more or less evenly spread over the Shroud, but there were heavy concentrations on the image’s feet, nose and elbow.  \nOne explanation of the evenly spread calcium offered by the authors is that it was likely due to the retting process.  The process involves steeping the flax in water reservoirs for a long period of time, until fermentation and other bacterial activity consumes the pith when the linen fibres can then be recovered.  If the water contains calcium salts then this would likely show up in the final linen. \nThe concentrations around the feet were analysed, and were identified as aragonite, distinct from the more common calcite.  Essentially it is Jerusalem road dust.  \nThe holyshroudguild summary above shows a comparison match of the resulting spectrographs obtained by Kohlbeck of the Shroud tape samples and of the Jerusalem limestone samples obtained and submitted to him by Nitowski.\n\n","date":"September 25, 2014 at 4:26 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-156065","author":"daveb of wellington nz","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"“The concentrations around the feet were analysed, and were identified as aragonite, distinct from the more common calcite. Essentially it is Jerusalem road dust.” Isotopic analysis of minerals can in some cases pinpoint an area of origin extremely accurately. Spectroscopic observation can’t. While aragonite is indeed less common than calcite, it is nevertheless quite abundant around the world, including Europe. The identification of any spectroscopically determined aragonite with “essentially Jerusalem road dust” is wholly unjustified. The holyshroudguild summary cleverly superimposes spectra from samples from the shroud and Jerusalem in such away that while the qualitative similarities are easy to see, the quantitative differences, which are numerous, are not. Separating out the two graphs shows clearly how different the two spectra actually are.\n\n","date":"September 25, 2014 at 6:05 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-156120","author":"Hugh Farey","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"What other explanation do you propose for the concentration of travertine aragonite limestone around the feet, the nose and the elbow?  Do you propose that it is not road dust from walking in bare feet, and that is not evidence of a fall while carrying a heavy patibulum and landing on the nose and that Charles’ artist using gesso was anxious to highlight these particularly important features of feet, nose and elbow?\n\n","date":"September 25, 2014 at 7:18 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-156149","author":"daveb of wellington nz","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"As STURP did not even bother to consult an expert on painting in medieval linen the question of whether a layer of gesso was applied on the outer fibrils must be left open. Medieval painted flags were sealed on the ultra fibrils only so that they could flutter in the breeze.\n\n","date":"September 26, 2014 at 1:22 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-156366","author":"Charles Freeman","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Hi Hugh:  Sorry to get off topic.  Just a quick question.  Do you know where the highest resolution images of the Shroud can be obtained?  Do you have any?  I have photos that I got from Barry S.  Great quality, no complaints, but wondering it there is anything with higher resolution.  I need them ASAP.. Let me know when you have time. Thanks.\n\n","date":"September 29, 2014 at 7:10 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157794","author":"Dave Hines","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"The best overall coverage of the Shroud easily avaialble is Shroud 2.0, which is an app for iPad, and not downloadable onto computers, but you can take screen shots and send them across.\n\n","date":"September 30, 2014 at 2:28 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157877","author":"Hugh Farey","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Occam’s Razor.  There are too many assumptions one would have make about the genius of the artist and physical findings on the cloth.  The Shroud is what is purports to be….a cloth that wrapped a dead body.\n\n","date":"September 25, 2014 at 8:13 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-156177","author":"Mordecai D Boone","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"I am only saying that there tests that should have been done by STURP or submitted to experts in this field that were never done and to this extent ,as with the study of the weave, the STURP report was limited and cannot be treated as conclusive of anything much. Anyway it is so hopelessly dated by now that it is becoming increasingly irrelevant for any serious student of the Shroud.\n\n","date":"September 26, 2014 at 2:27 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-156418","author":"Charles Freeman","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"“Anyway it is so hopelessly dated by now that it is becoming increasingly irrelevant for any serious student of the Shroud.”\nI realize this is just your opinion, but it is, frankly, ridiculous.\n\n","date":"September 26, 2014 at 9:25 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-156799","author":"David Goulet","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Not at all ridiculous to suggest that tests undertaken in 1978 in virtually every area of scientific  research will be very dated and will need redoing from scratch with modern equipment- unless David Goulet is prepared to go and see his doctor and say that he does not want any tests done that were not in place before 1978.\nI have no problem with someone who believes on the balance of evidence that they believe the Shroud is oauthentic; that is up to their own judgement of the very limited evidence we have.\nI do have a serious problem with anyone who is not prepared to consider that a great deal more would be known about the Shroud if it was given a proper examination in a conservation lab specialising in ancient textiles, painted and otherwise. We also need an in-depth analysis of the weave – thanks to the quality of the photographs this can largely be done from these.\n\n","date":"September 26, 2014 at 11:10 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-156902","author":"Charles Freeman","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Charles, I don’t disagree that new tests are needed, indeed they are a must for progress on this debate. But I take umbrage with your assertion that what science has been done is irrelevant. There may be insights yet to be mined from the existing STURP work, if we are creative about it. Naturally, I’d love to see a new round of investigations, but as that does not seem to be forthcoming, let’s not discount what we do have just yet.\nWould you also assert that the C-14 studies are now irrelevant, after all science has progressed beyond those primitive tests too.\nI’m willing to see my doctor if you’ll see yours.\n\n","date":"September 26, 2014 at 11:20 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-156912","author":"David Goulet","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"I am happy to re do the C14 tests again though unconvinced as I am by the reweaving and contamination claims I do not expect them to be much different. But we must redo them to try and settle the matter.\nI shall insist on 2014 testing from my doctor. I understand that blood rests in particular have advanced enormously in the last twenty years and the advances are of great importance so far as the Shroud is concerned.\n\n","date":"September 26, 2014 at 11:50 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-156932","author":"Charles Freeman","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"There is no concentration of aragonite. A single crystal was found on a sticky tape slide from the heel. Gerard Lucotte identified 20 microscopic particles from among 5000 identified bits and pieces hoovered up from around the Shroud. No slides were taken from the nose or elbows in 1978.\n\n","date":"September 26, 2014 at 2:48 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-156441","author":"Hugh Farey","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Roger & Marty Gilbert were founders of Oriel Corporation, the leading spectroscopy company in the USA as at 1978.  Their task in 1978 was a complete spectroscopic examination of the Shroud.  Anomalous readings were found under the sole of the foot image.  Sam Pellicori examining the area under his microscope identified it as dirt. \nSubsequently it was also found at the tip of the nose and the knee-cap (not the elbow).  Rogers took sticky tape samples and later referred them to Dr Joseph Kohlbeck, an optical crystallographer for Hercules Aerospace in Utah.  Kohlbeck noticed the limestone particles among other material on the tapes.  He persuaded archaeologist Eugenia Nitowski to send him samples of limestone from Jerusalem.  Kohlbeck identified the limestone as travertine aragonite, deposited from springs and is formed under much rarer conditions than ordinary calcite.  Kohlbeck selected a Shroud sample from the foot as it had the greatest concentration of limestone (This sounds like more than just a single crystal).  Kohlbeck identified the sample as the same aragonite as sent from Jerusalem, with the same concentrations of strontium and iron.  \nKohlbeck took both samples to Dr Ricrdo Levi-Setti of the University of Chicago’s Enrico Fermi Institute. Levi-Setti’s equipment included a then state-of-the-art scanning ion microprobe.  There was an unusually close match.  Some disparity was due to flax particles embedded in the Shroud’s limestone.  \nIan Wilson viewed the Shroud in 1973 and also in 2000 under much more favourable conditions in clear daylight.  He reports that in 2000, even with the unaided eye, significantly more dirt was clearly visible at the sole of the foot than anywhere else on the cloth, and furthermore the dirt convincingly underlay the serum-haloed bloodstains that otherwise coat the same soles.   \nIt would seem that this notional artist using a gesso base, not only had the remarkable insight to give his subject dirty feet, muddy his knee-cap as if from a fall, and give him a dirty nose as well, he had the prescience to select travertine aragonite for the purpose, from somewhere in Europe of a similar variety that by happenstance coincided with that at Jerusalem.  Remarkable!\n\n","date":"September 26, 2014 at 6:40 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-156630","author":"daveb of wellington nz","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"“Subsequently it was also found at the tip of the nose.” Really? By whom, and using which slide?\n“Rogers took sticky tape samples and later referred them to Dr Joseph Kohlbeck, an optical crystallographer for Hercules Aerospace in Utah. Kohlbeck noticed the limestone particles among other material on the tapes.” Really? try this:\n“in 1982, Ray Rogers sent a sticky tape microscope slide with a speck of an undetermined composition from the heel area to Dr. Joseph Kohlbeck, an Optical Crystallographer at the Hercules Aerospace Centre in Utah for analysis to determine if there was anything interesting in the slide. Dr. Kohlbeck identified the speck as Travertine Aragonite, a rare form of calcite. Dr. Kohlbeck completed his analyis and his results were received with great interest. He eventually passed the slide with the speck to Dr. Ricardo Levi-Setti, Scientist at the Enrico Fermi Institute at the University of Chicago. His analysis also showed that the speck was aragonite.” (A New Look at the Validity of the Carbon-14 Dating of the Shroud, Roberto and Roberta Villarreal, 2012)\n“Kohlbeck identified the limestone as travertine aragonite, deposited from springs and is formed under much rarer conditions than ordinary calcite.” Rarer, yes. Much rarer depends on your definition of rare. It is found all over the world.\n“Kohlbeck selected a Shroud sample from the foot as it had the greatest concentration of limestone (This sounds like more than just a single crystal). ” It does; but it disagrees with the Villarreals’ statement above.\n“There was an unusually close match.” No. There was a good qualitative match, but as a glance at the graphs Levi-Setti provided will show, there was a wide quantitative discrepancy.\n\n","date":"September 26, 2014 at 7:55 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-156706","author":"Hugh Farey","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"I wrote and said what happened.  You draw your own conclusions.\n\n","date":"September 26, 2014 at 6:15 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157061","author":"daveb of wellington nz","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"“I wrote and said what happened.” No. You gave an account of what happened similar to that at holyshroudguild by Cesar Barta (who twice says that aragonite is ‘widespread and common’), which is a review of a book. I gave an account of what happened by one of the main actors in the spectrograhic analysis of the STuRP tapes. The two accounts are contradictory. One of them is wrong.\n\n","date":"September 27, 2014 at 3:32 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157159","author":"Hugh Farey","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"I analysed the Levi-Setti graphs in “Stephen Jones adds another part to his series” (shroudstory, 23 March 2013).\n\n","date":"September 26, 2014 at 8:01 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-156713","author":"Hugh Farey","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Reading the past dialogue David Goulet – Charles Freeman (the question of painting, etc.\n= September 24, 2014 at 4:29 pm, at 4:36 pm and at 4:58 pm) emerges the trivial fact that they completely disregarded the study by Paolo di Lazzaro about the false shroud of Arquata del Tronto. A painted copy of 1650 (painting on linen)…\nRef.: Multidisciplinary study of the Shroud of Arquata, “extractum ab originali” (ATSI 2014).\nThern, see for example : the point n. 7 = Summary of the results (= LIF [UV-induced fluorescence], IR ITR, etc.) …\nWhy ?\nWere the controls by Di Lazzaro (and others) too scarce (f.e.: LIF\n“poor spatial resolution” = 0.5 cm) as scientific analyses to consider\nduring our conversations?\nSo…\nThis seems to be an example of superficiality about the “scientific discussions” (and connections with recent studies).\nI hope that discussions will be more interesting during the next Saint Louis Conference, but I have several doubts …\nconsidering your (frequent) passive behavior after the provocations of my “AFM anger” (and thus as a sort of “scientific antagonism”) …\n— — —\nNow …\nI beg your pardon, I was a bit paranoid in my remark. Perhaps UV-induced fluorescence and IR ITR controls\nare useless in order to show the complete truth about the Shroud, a presumed strange “ancient painting”…\nThus gossiping disregarding a serious discussion [see the lack of replies about the intervention by daveb\nin that question of presumed painting or retting residuals] on linen treatment : retting and the trivial apparent\nlack of useful data [or simple experiments and controls (on Iron levels before and after retting!)]…\n— — —\nHere another particular observation regarding the “body-painting”:\nWhere are the experiments with the famous CaO ?\n[See the strange idea of CaCo3 as coming from Ca(OH)2 turned in CaCO3, after years …and centuries…\n]\nThree days ago I captured a beautiful and stunned/dazed mouse (poisoned ?),\nit was too hairy perhaps this can be a problem when we want to obtain a\ndecent image resolution.\nIn any case I had nothing at hand in order to do an experiment\nor something of interest…\nWhat a pity!\nHave you obtained an interesting proof using CaO and mice?\n\n","date":"September 26, 2014 at 8:52 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-156768","author":"piero","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"This discussion on the Shroud being a painting or not can be summarized thusly: it is possible (because there is no evidence that proves it is impossible), but it is not probable (because there is no evidence that proves otherwise). The weight one gives to the possible vs. the not probable depends on one’s predisposition.\n\n","date":"September 26, 2014 at 9:30 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-156805","author":"David Goulet","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Firsto of all :\nErrata corrige = \n“Then, see for example : the point n. 7 …”\ninstead of\n“Thern, see for example : the point n. 7 …”\n— — — *** — — —\nNotes:\n1 – FeOx and quantity of Iron (measurements).\nThe iron oxide present on the Shroud is also present in non-image areas as well …\nFirst of all, we have to show what is the level of iron (Fe)\nbefore and after an ancient retting system…\nI have found :\n>Jeweler’s rouge is a red to reddish-brown powder composed of ferric oxide that is used as a polishing compound.  It has been used by silversmiths for hundreds of years.  \nSource :\nhttp://www.mccroneatlas.com/viewer/overview.asp?PARTICLE_ID=1140\n(McCrone ! … Walter McCrone, a microanalyst and long time detractor of the Shroud !!)\nSo, in my opinion, there are othe rreference to explore…\n2 – Mice have been used in biomedical research since the 16th Century …\nBut I want to clarify that I am not at all happy with the idea of sacrificing animals to do experiments on the BIF.\nI prefer to think at the improvement of the analysis on the samples from the experiments\nand from the materials coming from the Shroud …\n3 – control freakery\nPerhaps I have an obsessive need to be in control of what is happening in the field of the SPM (= AFM, CFM, etc.) …\n\n","date":"September 26, 2014 at 9:59 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-156834","author":"piero","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Typos:\n– Firsto of all :\nInstead of\nFirst of all :\n– there are othe rreference to explore…\nInstead of\nthere are other references to explore…\n— — — *** — —\nUnfortunately there are too many failures in my “English Writings” …\nI beg your pardon. I was disturbed by the question of the exact amount of iron\n(I didn’t found the exact reference for that problem) and so my hands faltered …\nI felt tired also because I am in a convalescence period (after a surgery intervention\nfor hernia repair) …\nPerhaps you can find an example of results obtained\nfrom gentle micro sampling method,\nwhich does not leave any visible trace on ancient textiles\n(samples exhibited in museums, etc.).\nSee also the argument :\nArchaeological fibres and levels of FeOx\nThen I have found a book :\nInfrared and Raman Spectroscopy in Forensic Science\nJohn M. Chalmers, Howell G. M. Edwards, Michael D. Hargreaves\nJohn Wiley & Sons,\n05/mar/2012 – 618 pages\n>This book will provide a survey of the major areas in which information derived from vibrational spectroscopy investigations and studies have contributed to the benefit of forensic science, either in a complementary or a unique way …\n— — —\nIn any case I want to remember what Petrus Soons underlined\n(Link: http://evidencetobelieve.net/failed-attempt-to-duplicate-shroud/) :\n>Adler reports that there is no correspondence of the body-only images to the concentration of iron oxide since the spectral characteristics of the body-only image are different from those of iron oxide.\n— — *** *** — —\nDavid Goulet wrote:\n>the weight one gives to the possible vs. the not probable depends on one’s predisposition\nFirst of all: what is your definition for “painting” ?\nSecond : I don’t believe in “personal ideas” when we have to show the truth\n(like when you are in a process and you have to give a clear demonstration !).\nSo…\nWhere is the useful linen sample in order to discuss about the probability in a good manner ?\nSorry. I don’t believe in the samples obtained by Garlaschelli, but we can try to do something starting from the adequate comparisons …\nAre useful (also) the ancient mummy wrappings ?\nWhat is your opinion ?\n\n","date":"September 26, 2014 at 10:56 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-156890","author":"piero","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"I wrote: “Hugh [wrote],\n“and the scientists involved in the Shroud showed little evidence of knowing much about painting.”\nNo. Before 1978 STURP did know that the Shroud could be a paint. They studied in depth the history of painting, the pigments that could have been used for the Shroud and much more.\nIn fact, the main goal of STURP in 1978 was to look at the Shroud to find evidence of painting. They found none of them.”\nCharles answered:” That is not correct, Thibault. In their physics and chemistry article STURP specifically stated that they had not examined any paintings on linen. There is nothing in their article about how linens were prepared for painting and how the painting was actually done despite medieval treatises on the subject.”\nIt is wrong, Charles.\nThey probably did not examine paintings on linen but, before 1978, they made many researches on the history of painting, looking at the medieval treatises on the subject and at all of the possible materials used in the Middle-ages and they even performed many experiments.   \nRogers wrote: ” Before going to Turin in 1978, we did many experiments on the stability of the painting materials [here, Rogers is speaking about the effect of the 1532 fire that “provided an excellent chemical test on all of the materials of the Shroud”]. ALL of the pigments and vehicles that we could identify in HISTORICAL DOCUMENTS were tested by applying them to linen and subjecting the samples to different kinds of heating”\nJust look at Rogers, “A Chemist perspective …”, p.10 and 11. Do you have this book?\nI am disappointed by this kind of comments which seem to imply that the STURP team was a team of amateurs !!!\nThe Shroud image is not a painting (in the common sense).\nI do not understand what Hugh wrote in his comment quoted at the beginning of this post.\nHugh, what do you exactly have in mind?\n\n","date":"September 26, 2014 at 3:51 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157039","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"If they had read Cennino Cennino’s  fifteenth century treatise on painting on linen they would have discovered that he recommended applying a layer of gesso to the outer fibrils of the cloth with a knife so that the excess could be wiped off. This would explain an image just on the outer fibrils without brush marks. I have been trying to persuade one of my contacts in the documentary world to have a go at commissioning such a sealed linen.\nI have been saying all along ere are enough unresolved issues , especially with the calcium carbonate that is the main element in most gessos that the question should be left open. I do not have much time for people who say it should remain closed and if I were home I would quote you the paragraph in the STURP report that says they did not examine any painted linens. – perhaps Hugh has it to hand.\nMeanwhile I have been assured by my local guide that the bones of John the Baptist they have here in Genoa have been dated to two thousand years ago. I have, of course, told her that you must never trust carbon- 14 dates and that they are probably medieval.\n\n","date":"September 26, 2014 at 5:31 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157051","author":"Charles Freeman","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Physics and Chemistry of the Shroud of Turin, Schwalbe & Rogers, 1981. Page 30.\n“Shroud-image forgeries, and most likely very good ones, existed. Eastlake noted that tempera and watercolour paintings on linen were common in England and Germany in the 14th century. Unfortunately, we have not examined any of these and have no basis for comparison with the Shroud image.”\n\n","date":"September 26, 2014 at 5:50 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157056","author":"Hugh Farey","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Thanks,Hugh. STURP were professionals in their own fields but  their knowledge of medieval iconography, methods of painting on linen and techniques and looms used in ancient and medieval weaving appears non- existent. And as this quotation suggest they did not even bother to inform themselves.\nHow can you reject the idea of this being a painted linen if you have never even examined an example- presumably anyone following Cennini would have sealed the linen on the outer fibrils and then put the paint on top. One can hardly paint linen without sealing it although I understand this might be possible with modern paints . Medieval pigments mixed with tempera would have gone through into the cloth and then it would have been impossible to paint ,say, a flag with different images on each side and the paint would have made it impossible to flutter freely. That is why priming /sealing is essential but it has to be confined to the very outer layer of the linen.\nLots to think about for those prepared to think.\n\n","date":"September 26, 2014 at 6:01 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157059","author":"Charles Freeman","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Charles,\nI have all of the STURP papers including “Physics and Chemistry…”\nIncidentally Hugh’s quotation confirms that STURP did look at many books about medieval paintings before 1978.\nThis was my point. \nYou wrote: ”  If they had read Cennino Cennino’s fifteenth century treatise on painting on linen they would have discovered that he recommended applying a layer of gesso to the outer fibrils of the cloth with a knife so that the excess could be wiped off.”\nDo you have this book?\nI have found this link:\nhttp://books.google.fr/books?id=MU68AQAAQBAJ&pg=PA32&lpg=PA32&dq=medieval+gesso&source=bl&ots=8SRgVGNPT9&sig=4wLLZ3XMMGpaZuKCmIpi673Mor0&hl=en&sa=X&ei=2OcmVKLYJMnjaoyAgqgC&ved=0CFIQ6AEwCg#v=onepage&q=medieval%20gesso&f=false\nSee p.32 to 40, in which Cennino’s book is cited.\nEverybody is asked to look at it and decide if there is any kind of relationship with the TS as a 14th century French painting on linen. \nYou wrote: “I have been saying all along ere are enough unresolved issues , especially with the calcium carbonate that is the main element in most gessos that the question should be left open”.\nNo. If some kind of “Calcium carbonate” gesso had been  involved in the TS image painting, we should expect more calcium in the image area.\nThis is not the case.\nFrom “X-Ray Fluorescence Investigation of the Shroud ot Turin” by Morris, Schwalbe and London\n(X-Ray Spectrometry, Vol.9, N°2, 1980), we read:\n“The Calcium and Strontium appear as uniform background distributions”.\nThe following link is also interesting:\n http://www.shroud.com/piczek.htm\n\n","date":"September 27, 2014 at 2:26 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157258","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"I have the full Cennini text. The whole point is to cover the whole cloth with gesso and then you can apply the image wherever you need to. The gesso also acts as a preservative. If the calcium carbonate is uniform and you are the one who has provided a quotation in support of this, this is a point in  favour of an original priming and thus keeps open the possibility of an original painting that may have decayed with time.\n\n","date":"September 29, 2014 at 11:14 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157703","author":"Charles Freeman","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Hi Thibault. In the early days (I don’t think it carries so much weight now), it was suggested that any paint would necessarily seep through to the back, that all paintings necessarily show brush strokes, that it was impossible to paint a portrait without showing some form of light direction, and that portraits were never painted without first tracing an outline. None of these is necessarily true. The density of the shroud is easily sufficient to prevent pigment soaking through, many watercolours are painting using ‘dabs’ of brush rather than any strokes, and an indication of light direction is not a necessary part of portrait painting, although frequently present. I wonder if some of the STuRP team – and their predecessors –  didn’t spend too much time researching pigments and binders and so on, and not enough actually looking at the process of painting. Charles is correct that there is virtually no mention of any priming of the material, for instance, which should surely have informed part of ther investigation. However, as I went on to discuss in my posting reproduced at the top of the page, the physical aspects of painting are only a small part of the discussion. The scientists were on much stronger ground in their investigation into the chemical possibilities, although these too are still unresolved in some cases.\n\n","date":"September 26, 2014 at 4:42 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157049","author":"Hugh Farey","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"This is an ancient Tempra on linen painting. If the shroud was a painting it would’ve looked like this, enlarge the image to see the weave where the paint has flaked off\nhttps://www.flickr.com/photos/mharrsch/599782624/player/08e125f9d4\n\n","date":"September 26, 2014 at 10:27 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157110","author":"Mike M","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"If all the paint flaked off what would you be left with? I am sure a professional conservationist would be able to advise on this\n\n","date":"September 27, 2014 at 2:42 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157152","author":"Charles Freeman","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Pursuing a painting hypothesis is an exercise in futility, a waste of precious time resources which could be put to better use, will lead nowhere, and has its only basis a minor residue of calcium and iron contamination, which any number of shroud.com papers attribute to the retting process.  Practically all medieval painting pigments contain elements of significant atomic weight which would have been detected in 1978 but were not.   Its protagonists are too narrowly focused on this one aspect, and set aside all other evidence demonstrating that there was inadequate knowledge in medieval times to produce the salient features of the Shroud image.  They’re chasing gnats and swallowing camels.  But, oh it’s such fun! Huh??!!\n\n","date":"September 27, 2014 at 4:39 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157167","author":"daveb of wellington nz","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Tut! What nonsense. Daveb is well aware of the width of my investigations into every aspect of the Shroud, and of my absolute refusal to set aside any evidence which contributes to a better understanding of it. If he will allow me, I will make my own decisions as to how precious my time is and how best it can be put to use. Although pigment tends to be atomically dense, it is not established how much is needed to produce an image and whether such an image would necessarily be visible by transmitted light or X-rays. It is also not established whether an image could remain even if all the pigment was washed or flaked away. Neither the anatomical and medical ignorance of medieval artists, nor the anatomical and medical accuracy of the Shroud have been conclusively demonstrated, and until they are, a correlation betwen the two cannot be dismissed out of hand. So far, it is true, I do not think a satisfactory artistic or religious context for an artificial production has been found, but tantalising glimpses of medieval Christianity suggest that an attempt to discover one is not a waste of time. I have never swallowed a camel.\nMy version of an exercise in futility is an enquiry into how many neutrons are emitted by a resurrecting body, or an insistence that complete invisibility is positive evidence of something completely invisible.\n\n","date":"September 27, 2014 at 5:41 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157173","author":"Hugh Farey","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"The previous haphazard reading of the blog by Dan produced my hasty interventions …\nSorry.\nA more ordered intervention should have been the consideration of a careful study about the question of aragonite “of Jerusalem” because (if I am right in my reading) HF rejected that specific identification as a sort of fanciful claim…\nRead the mocking words by HFabot the travertine aragonite :\n>Rarer, yes. Much rarer depends on your definition of rare. It is found all over  the world.\nWhy Hugh Farey disregarded the presumed Ca and Sr fingerprinting about travertine aragonite ?\nI am curious to read the inherent answer …\nHere I referred to the reply by HF to “daveb of wellington”\nIMHO without a clarification about that point the words by HF are too rough.\nHere a presumed fact:\n>Limestone samples taken from other tombs at nine different test sites in Israel were\nalso analyzed by Levi-Setti, but only the sample taken from the Jerusalem tomb\nmatched the limestone on the TS.\nAnd now the question:\nWhy?\nThen the claim was the following :\nonly in Jerusalem there are aragonite crystals with the same exact\nchemical signature as that found in the dirt of the Shroud.\nUnfortunately I have also read another source that denied this finding…\nSo…\nWhere is the truth ?\n— — —\nOther questions :\nWhere are the photographic proofs about the claimed aragonite crystals over the Holy Shroud in year 2000 (Ian Wilson) ?\nWhere are the high resolution images ?\nWhere are the AFM controls on these crystals ?\nHow is possible that aragonite crystals are adherent on linen (and visible at naked eye) after 2000 years ?\nWhat are the result of experiments on adhesion (included AFM experiments) ?\nWhat was the exact amount of visible crystals before the vacuuming operation ?\nWhat was the exact amount of visible crystals after the ostensions ?\nWhere are the inherent proofs ?\nThere is another question that we have already considered.\nThe hypothesis of CaO turned in CaCo3\nand then one can affirm that a slow precipitate of carbonate,\nat low temperature (evaporation) around\nan organic fibre (cellulose) in presence of salt (sweat) must take\nthe orthorhombic form (aragonite).\n[Is it true that the usual carbonate, crystallizing around stalactites\nin caves, is essentially Aragonite ?]\nIs that a possible alternative explanation or not ?\nThe pathway to consider is the following:\nCaO —>  Ca(OH)2  —> CaCO3 —> CaCO3 precipitate —> aragonite\nSorry.\nThe previous scheme is a bit rough…\nIs it true that aragonite was only found on the sole of the feet\nand perhaps on nose and knees, but it was not detected elsewhere?\nMy opinion about the right answer was the following :\nthe useful answer cannot be reached using microanalysis\nwith electronic microprobe (EMP) or microanalysis with\nlaser ablation microprobe (LAM ICP-MS) [= micro-destructive control]…\nInstead I believed in AFM and AFM-Raman controls,\nbecause laser ablation microprobe (LAM ICP-MS) is destructive\nand AFM not…\n— — —\nI have read that :\n>Isotopic compositions of geological material are a kind of ‘DNA’ that has been widely used in geochemistry to identify various sources of rocks and processes that have shaped our Earth. …\n>During the past few decades, in situ LA-(MC) -ICP-MS techniques have developed rapidly, and have been widely applied in geochemistry, including measurements of trace elements …\nBut I don’t believe in that way.\nSo. What is your remark ?\n\n","date":"September 27, 2014 at 9:35 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157219","author":"piero","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Hugh’s too-good-to-be-true camel consists in believing the TS is “a 1260-1390 c CE image”. Irrespective for instance of the fact Benecdictine monks depicted the relic via steganography as ealy as late 8th-late 12th c. CE, I’d just like him to tell me which sindon/relic precisely is here referred to prior to the radiocarbon-dating timespan:\n“[In the church of My Lady Saint Mary of the Pharos (“lighthouse”) in the Golden Imperial Palace of the Boucoleon in Constantinople and another church called My Lady Saint Mary of Blachernae], Christ ‘rise[d] again’ [then], and the sindon(1) with the burial linens [was] the clear proof. [This sindon] as white as snow from antiquity, [was] of linen, of easily obtainable material, remained uncorrupted and smell[ed] fragrant of myrrh. [It] def[ied] decay because, after the Passion, it [had] wrapped the elusive(2) dead naked body. \n[When] raised upright, not only the image of the glorious features of the Saviour’s face with dripping drops of blood shine[d] out but also the form and most noble stature of his entire body hanging down from the cross and embellished with drops of blood and water that make the liquid flow from his own side, could be plainly seen. This [was] not the art of the painter and the various beautiful colours, which provide a door for the mind to consider the original and depict images [that could possibly have depicted] the reflection of his appearance and size imprinted on [his sindon]. [So much so] the ‘not-made-by-hand’ image of Christ and G-od, draped with a white/pure linen cloth he had worn, was sufficiently in lieu of the vision of the Lord coming into the flesh to those who had not corporally seen him.\nAfter the city was taken, the French partitioned the relics of the saints and the most sacred of all, the sindon in which our Lord Jesus Christ was wrapped after his death and before his resurrection. We know the sacred sindon in Athens. [In this city] we saw with our own eyes the burial linen cloths found in the sepulchre.”\nIs that description not good enough to be true?\nNotes: (1). – Also called sydoine and synne1 in old French; the latter for “sign” (Latin signum; Greek symbulos). (2). – Greek aperilepton, i.e. consistent both on one hand with G-od’s “un-circumscribed”, non coercive and loving, divine nature that has no shapes, is beyond description and the binds of Death cannot contain and, on the other hand, Yeshua’s “un-outlined”, evanescent nature of his own image on his sindon.\n\n","date":"September 27, 2014 at 11:49 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157234","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Reminder for Hugh: Two giants of Byzantine Art History (namely Ernst Kitzinger and Hans Belting) claimed the 11th-12th c. CE threnoi epitaphioi were ‘(Turin)Shroud-inspired’ and more lately, British medieval historian, David de Wesslow recently pointed out the TS image is no medieval forgery at all. Methinks Hugh want us to swallow his camel.\n\n","date":"September 27, 2014 at 12:47 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157246","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Typo: and British medieval art historian, David de Wesslow recently pointed out the TS image is no medieval forgery at all.\n\n","date":"September 27, 2014 at 12:52 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157247","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Ye-es. Ernst Kitzinger admitted that he is one of “a very small group of experts around the world” who believed in the authenticity of the Shroud, but “it is difficult to find any published works where he elaborates on this issue.” And Hans Belting, one of Kitzinger’s students “expressed some agreement that the Constantinople and Turin shrouds were the same, but has made little effort to continue this development.” “Today almost all main line historians, fortified by the 1988 C14 dating results, apparently believe the pre-14th century historical issue is closed.” All quotations from http://www.biblearchaeology.org/post/2013/03/28/The-Shroud-of-Turins-Earlier-History-Part-Three-The-Shroud-of-Constantinople.aspx. Thomas de Wesselow is a third Shroud supporter among distinguished art historians, and their views should be respected, even if one disagrees with them, in common with most of their peers. De Wesselow impressed me with his illustration in a lecture that “Technically, conceptually, and stylistically the shroud makes no sense as a medieval artwork,” but I would like to discuss with him, and more particularly Hans Belting, the evolution of the epitaphios in rather more detail.\n\n","date":"September 27, 2014 at 1:55 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157254","author":"Hugh Farey","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Hugh, on September 27, 2014 at 11:49, I wrote: Hugh’s too-good-to-be-true camel he has swallowed consists in adamantly believing the TS is “1260-1390” CE. Irrespective for instance of the fact Benecdictine monks depicted the relic via (icono)steganography as early as late 8th-late 12th c. CE, I’d just like him very  much to tell me then which sindon/relic precisely is referred to in the following literay piecing together of several corroborating 944-1207 CE testimonies and eyewitness descriptions – from Gregory Referendarius’ (Archdeacon of Hagia Sophia), to Nicholas Mesarites’ (overseer of the treasuries in the Pharos Chapel of the Boucoleon Palace of the emperors) via Robert de Clari’s (Fourth Crusade Picard knight), and a few others:\n“[In the church of My Lady Saint Mary of the Pharos (“lighthouse”) in the Golden Imperial Palace of the Boucoleon in Constantinople and another church called My Lady Saint Mary of Blachernae], Christ ‘rise[d] again’ [then], and the sindon(1) with the burial linens [was] the clear proof. [This sindon] as white as snow from antiquity, [was] of linen, of easily obtainable material, remained uncorrupted and smell[ed] fragrant of myrrh. [It] def[ied] decay because, after the Passion, it [had] wrapped the elusive(2) dead naked body. \n[When] raised upright, not only the image of the glorious features of the Saviour’s face with dripping drops of blood shine[d] out but also the form and most noble stature of his entire body hanging down from the cross and embellished with drops of blood and water that make the liquid flow from his own side, could be plainly seen. This [was] not the art of the painter and the various beautiful colours, which provide a door for the mind to consider the original and depict images [that could possibly have depicted] the reflection of his appearance and size imprinted on [his sindon]. [So much so] the ‘not-made-by-hand’ image of Christ and G-od, draped with a white/pure linen cloth he had worn, was sufficiently in lieu of the vision of the Lord coming into the flesh to those who had not corporally seen him.\nAfter the city was taken, the French partitioned the relics of the saints and the most sacred of all, the sindon in which our Lord Jesus Christ was wrapped after his death and before his resurrection. We know the sacred sindon in Athens. [In this city] we saw with our own eyes the burial linen cloths found in the sepulchre.”\nNotes: (1). – Also called sydoine and synne in old French; the latter for “sign” (Latin signum; Greek symbulos). (2). – Greek aperilepton, i.e. consistent both on one hand with G-od’s “un-circumscribed”, non coercive and loving, divine nature that has no shapes, is beyond description and the binds of Death cannot contain and, on the other hand, Yeshua’s “un-outlined”, evanescent nature of his own image on his sindon.\nAGAIN I am asking you: which sindon/relic is precisely referred to in the above literay piecing together of several corroborating 944-1207 CE testimonies and eyewitness descriptions? Hugh, could you just answer my question please? Thank you.\n\n","date":"September 28, 2014 at 4:11 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157397","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Brief response to Piero at Sep 27, 9:35am:\nThe formal paper by Kohlbeck & Nitowski was published in: Joseph A. Kohlbeck & Eugenia L. Nitowski, “New Evidence May Explain Image on Shroud of Turin: Chemical Tests Link Shroud to Jerusalem” Biblical Archaeology Review, vol 12 no. 4, July/August 1986, pp.18-29.\nThe paper is apparently available at the BAR web-site, if you are prepared to register on the site with a pass-word.  I was not, but was content to summarise the findings available from the other summary sources from the BSTS newsletter and the holyshroudguild site: http://holyshroudguild.org/ceacutesar-barta.html  summary by César Barta & Giorgio Bracaglia, and other well-known published sources.  \nBAR publications are apparently not necessarily peer-reviewed, and like many other papers on scientific studies on the Shroud, are sometimes criticised because they lack the corroboration of such reviews.  They are therefore not perfect, but I consider them to be more than merely persuasive, considering the scientific status of those involved. \nI described the circumstances leading up to the discovery, at my comment above on Sept 26, 6:40am.  The limestone crystals were found embedded as part of the dirt around the soles of the feet image during the 1978 spectroscopy examination by Roger & Marty Gilbert, as I’ve described.  Apparently at some time, similar dirt was also found at the tip of the nose and on the knee-cap, as if from a fall.  I am unaware if this dirt was analysed in the same way as was the foot dirt by Kohlbeck & Levi-Setti.  But it would be surprising if it were any different. \nAs also noted elsewhere, Eugenia Nitowski sent some nine or so limestone samples from around Jerusalem to Kohlbeck.  A close match was obtained from the limestone tomb site, including similar concentrations of iron and strontium.  The matching was not exact, partly because the Shroud samples were also contaminated by flax.  The spectrographs are reproduced in the Barta & Bracaglia summary on the holyshroudguild site.    \nYou would be aware that aragonite form of CaCO3 is quite distinct from the calcite form, is rarer, and is apparently precipitated from springs.  The similarity of the Fe and Sr concentrations may be considered a persuasive marker for a geographic site match compared to other possible locations of aragonite.\n\n","date":"September 27, 2014 at 3:55 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157278","author":"daveb of wellington nz","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"I, on the other hand, have shelled out the necessary to become a member of the BAR lending library, and can read the original article. It takes the form of a conversation, alternating between Joseph A. Kohlbeck, optical crystallographer, and Eugenia L. Nitowski, archaeologist, both with impeccable credentials.\nFirst. What, precisely, did Kohlbeck examine? In his own words:\n“Ray Rogers, asked me to take some quality photomicrographs and to microscopically examine some shroud fibers.” ” I began to focus on particles of calcium carbonate on the fiber samples.” “We then examined a calcium sample from the shroud taken from the area known as the “bloody foot” because this showed a larger concentration of calcium carbonate than other areas.” (Footnote: “Mylar tape sample JAB” – I think he means 1-AB, which was taken from the dribble of blood emanating sideways from the heel of the big footprint)\nThis certainly sounds more than Villarreal’s speck. On the other hand there is no mention of the knee or nose.\nSecond. What, precisely, did Kohlbeck find on the Shroud? In his own words:\n“This calcium carbonate turned out to be aragonite, not the more common calcite – and exhibited small amounts of strontium and iron.” (Footnote  – “Little could be done to examine the few small particles microscopically in the environment of the Mylar tape used to lift the sample because the tape had crystalline properties which interfered with obtaining optical information from the particles. Thus the risk was taken to recover these few crystals and remount them in a 1.680nD Cargille immersion oil. The intermediate or b [beta] index of aragonite is 1.680, and a match at specific orientations would be a good indication of the possibility of aragonite. In one orientation there was a match for the 1.680 index oil. An interference figure at 1250× having a small 2V angle estimated 18–20 optically negative was observed. These optical properties would be expected from aragonite and this is a strong suggestion that these fragments, particularly when compared with the Jerusalem samples, are aragonite.”)\nMeanwhile Nitowski was collecting samples from Jerusalem to be analysed as well. There is no mention of the number or whereabouts of the samples collected, except that they were “from inside tombs in the general vicinity of Jerusalem”. Kohlbeck says: “This particular limestone was primarily travertine aragonite deposited from springs, rather than the more common calcite.” “In addition to the aragonite, our Jerusalem samples also contained small quantities of iron and strontium but no lead.” A footnote says that the STuRP team did detect lead in the Shroud, but that Levi-Setti did not.\nThey conclude this part of their article: “Of course, this doesn’t prove that the aragonite on the shroud came from Jerusalem, but this could be a reasonable explanation. Nevertheless, aragonite with these traces can no doubt be found elsewhere in the world as well as in Jerusalem.” A footnote hopes that further investigation will identify rare trace elements on both samples that will clearly distinguish them from aragonite samples elsewhere in the world. Then they go on to discuss blood specks also found on the fibres.\nI also have a copy of UV-Visible Reflectance and Fluorescence Spectra of the Shroud of Turin, by Roger and Marion Gilbert, and for good measure, Spectral Properties of the Shroud of Turin, by S.F. Pellicori, both in Applied Optics, June 1980. Neither of them contain any mention of dirt on the heel or anywhere else.\nPrimary Sources, hey! Don’t ya just love ’em!\n\n","date":"September 27, 2014 at 5:12 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157292","author":"Hugh Farey","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Dear “daveb of wellington nz “,\nHere the words:\n>… From as close as 30 miles from Jerusalem, the limestone changes\nand does not match either Jerusalem or the Shroud of Turin. Therefore,\nthe match between Jerusalem and the shroud is a valid one. The Shroud\nof Turin was indeed in Jerusalem at one time during its history.\n>Sister Damian of the Cross, OCD\n(Dr. Eugenia Nitowski)\nSource :\nhttp://holyshroudguild.org/ceacutesar-barta.html\nand this is the same link that previously you have indicated\nin your message …\n—- —- —-\nSo …\nWhat shall we do ?\nThe argument to develop is the following :\nMg/Ca, Ba/Ca and Sr/Ca ratios (into the crystals of Aragonite)\nand …\nthe variability of trace elements (into the crystals of Aragonite)…\nIMO You had better go to the inherent references…\n\n","date":"September 29, 2014 at 9:50 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157680","author":"piero","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Here an example about aragonite and the variability of trace elements …\nTrace and minor element ratios inHalimeda aragonite from the Great Barrier Reef\nM. L. Delaney, L. J. Linn, P. J. Davies\n1996, Volume 15, Issue 3, pp 181-189 \nSee under the address:\nhttp://link.springer.com/article/10.1007%2FBF01145890\nWe can read :\n>… …We successfully adapted and applied sample treatment protocols developed for measuring trace elements in coral aragonite (generally less than 500 y old) toHalimeda aragonite (modern to approximately 5000 y old in this study). ModernHalimeda aragonite from John Brewer Reef in the Central GBR had mean Cd/Ca ratios of 5.19 ± 1.68 nmol/mol (±2σ/n  √ )  forHalimeda micronesica and 2.35 ± 0.38 nmol/mol for three closely related species important in bioherm accumulationHalimeda copiosa, Halimeda hederacea, andHalimeda opuntia.\n>Mn/Ca ratios, with means from 89–239 nmol/mol for these four species, showed both intra-and inter-specific variability. Sr/Ca ratios (10.9 ± O.1 mmol/mol) and Mg/Ca ratios (1.35 ± 0.26 mmol/mol) were similar for all samples. HoloceneHalimeda aragonite samples from cores of two bioherms in the northern GBR seemed well preserved on the basis of mineralogy and Sr/Ca and Mg/Ca ratios similar to those in modernHalimeda aragonite. Cd/Ca ratios (overall mean 0.96 ± 0.15 nmol/mol) were lower than those measured in the modernHalimeda from the central GBR location.\n>However, Mn/Ca ratios in both cores were substantially higher than in modernHalimeda aragonite.\n>While it may be possible to extract paleoceanographic information fromHalimeda aragonite, substantial care is needed to evaluate and avoid the effects of post-depositional alteration.\n— —\nWhat is your opinion ?\n\n","date":"September 29, 2014 at 9:58 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157682","author":"piero","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Here other material about aragonite and trace element concentration:\n>The calcium carbonate polymorphs aragonite and calcite have distinct trace element concentrations because their structures allow for preferential incorporation of different cations (Deer et al., 1992). The mineralogy of the Site 1256 carbonate veins is therefore determined from their Sr/Ca and Mg/Ca ratios, which reveal two distinct groups (Fig. F1; Table T1). The compact calcite structure can incorporate the small Mg cation, whereas aragonite has a larger cation site and favors accommodation of the larger Sr cation (Deer et al., 1992). Samples with Sr/Ca ratios less than ~0.2 mmol/mol are classified as calcite, and those with Mg/Ca ratios of less than ~2.5 mmol/mol are classified as aragonite (Table T1; Fig. F1). The remaining samples, with intermediate compositions (Sr/Ca >0.2 mmol/mol and Mg/Ca >2.5 mmol/mol), are interpreted to be aragonite-calcite mixtures, which were homogenized during hand-picking. \n>Fe and Mn are similar in diameter to Mg and are therefore also preferentially incorporated into calcite, with Fe/Ca ranging from ~3 to ~35 mmol/mol and Mn/Ca ratios up to ~80 mmol/mol (Fig. F1). The aragonite veins have lower Fe/Ca ratios (The carbonate veins have 87Sr/86Sr ratios ranging from ~0.70804 to 0.70872. The majority of the aragonite veins have Sr isotopic compositions between ~0.7087 and ~0.7086, whereas the calcite veins precipitated from fluids with 87Sr/86Sr ranging from ~0.7086 to ~0.7080. The strontium isotopic composition of the oceans ~15 m.y. ago was ~0.70875 (Hodell et al., 1991), and it has increased progressively since then. All the carbonate veins precipitated from fluids with 87Sr/86Sr ratios lower than the seawater 87Sr/86Sr ratio has been since the eruption of the host basalt. The veins therefore all contain a discernible component of basalt-derived Sr (87Sr/86Sr ~0.7027). The carbonate 13C and 18O compositions range from –3 to 4VPDB (Vienna Peede belemnite) and 20 to 32VSMOW (Vienna standard mean ocean water), respectively, within the range previously established for hydrothermally altered mid-ocean-ridge basalt–hosted calcite breccia cements and veins (Stakes and O’Neil, 1982). \nLink:\nhttp://www-odp.tamu.edu/publications/206_SR/002/002_3.htm\n— —\nSo… the question is the following:\nHow to work with the sample of the Holy Shroud ?\n— —\nI don’t believe in that kind of analyses for the Shroud and the dust …\nAnd you ?\n\n","date":"September 29, 2014 at 11:15 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157704","author":"piero","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Dirt on kneecap and nose.  I recall it being raised on this site previously, and being discussed in some depth.  I have spent the last hour or so attempting to retrace the source.  I did not find it in Wilson who describes the Gilbert-Pellicori-Kohlbeck-Nitowski chain of events in his 2010 book.  I do have access to an informed quote that Marty Gilbert on discovering the spectral anomaly during her examination retraced her steps and identified the three locations: heel, nose and kneecap.  I am not presently at liberty to identify that source.  I may attempt to get a better fix on it. But I do recall that it has been discussed here previously.\n\n","date":"September 27, 2014 at 6:51 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157304","author":"daveb of wellington nz","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"My record shows that I was looking into this matter last November 2013.  The assertion that the Gilberts discovered dirt on the knee-cap as well as the elbow, was on at least two web-sites that I had discovered.  One particular site was a freechristianteaching web-site, which I’ve checked out and the assertions are still there:\nhttp://www.freechristianteaching.org/modules/smartsection/item.php?itemid=156#ixzz1pyd9l6CG   \nThis web-site appears to be an evangelical site run by an ordained evangelical minister, however he doesn’t provide a corroborating reference. \nI’ve just googled “shroud dirt on nose” and came up with several web-pages, which make the same assertion.  The most worthwhile of these would seem to be a Youtube video in about five parts, which also features Eugenia Nitowski.\n  \nHowever there are any number of other web-pages which assert as much, and I see no good reason as to why there would not be a factual basis to the assertion.  Those who want to challenge it may follow it up if they are so inclined.\n\n","date":"September 27, 2014 at 9:49 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157330","author":"daveb of wellington nz","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Pathetic! \nCennini’s “gesso” is not a carbonate of calcium.\n \nCennini’s “gesso” is is a calcium sulfate mineral (CaSO4·2H2O).\nThe gesso was traditionally composed by sulfate of mineral calcium mixed to an animal tail (leather tail). Fragile, it was reserved for the boards and it was revealed little adapted for the painting on fabric.\n“Modern “acrylic gesso” is a widely used ground[ that is a combination of calcium carbonate with an acrylic polymer medium latex, a pigment and other chemicals that ensure flexibility, and increase archival life. It is technically notgesso at all and its non-absorbent acrylic polymer base makes it incompatible with media that require traditional gesso such as egg tempera.”\nCarlos\n\n","date":"September 28, 2014 at 2:00 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157372","author":"Carlos","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"The hemi-hydrate of calcium sulfate is Plaster of Paris.  The di-hydrate occurs naturally as gypsum.  Thanks Carlos for the clarification,  The anhydrite is used as a desiccant.  It may also be used as a food coagulant.  In its natural state the rock may be coloured by cobalt ions, and its changes in colour are useful as a moisture indicator.\n\n","date":"September 28, 2014 at 2:52 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157382","author":"daveb of wellington nz","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"As I noted elsewhere, south if the Alps they used calcium sulphate , north of the Alps calcium carbonate. So if this was indeed a  uniform primer on the Shroud ,it was likely to have been applied north if of the Alps.\n\n","date":"September 29, 2014 at 11:20 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157706","author":"Charles Freeman","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"You’re right, daveb. Following your lead I’ve found “More on the Dirt of the Shroud of Turin” from 16 September 2011, which quotes extensively from Ian Wilson and Barrie Schwortz’s book ” “The Turin Shroud: The Illustrated Evidence.” It is largely anaecdotal, and it is a shame that Wilson does not give his source for the conversation related – perhaps it was Barrie – but it is even more a shame that none of the enthusiastic identifiers of “dirt” saw fit to memtion it in their published papers. Not even the printed spectra of the heel show any any indication of the markedly different appearance of the heel than anywhere else. Still, as far as it goes, you remember correctly.\n\n","date":"September 28, 2014 at 3:15 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157385","author":"Hugh Farey","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"And I would say that furthermore it is also a shame that samples from the knee and nose were also not taken and tested.  However the foot sole of course is from the dorsal image whereas the others are on the ventral.  There always seemed to have been a tendency for samples from the dorsal image to have been considered less intrusive than from the ventral.  In particular, Max Frei was positively prevented from taking any of his samples from the face.  Consequently, nobody would have been prepared to sample the nose dirt, but would have to be satisfied with the Gilbert’s spectroscopic evidence.\n\n","date":"September 28, 2014 at 3:49 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157395","author":"daveb of wellington nz","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Hugh wrote: “Ernst Kitzinger admitted that he is one of “a very small group of experts around the world” who believed in the authenticity of the Shroud, but “it is difficult to find any published works where he elaborates on this issue.” And Hans Belting, one of Kitzinger’s students “expressed some agreement that the Constantinople and Turin shrouds were the same, but has made little effort to continue this development.”\nBelting (who is now 91 year’s old) and Kitzinger (who died in 2003) are/were no mere Byzantine Art HIstorians or “students” as you want us to believe. Both of them are/were giants in their field… and claimed the TS was authentic and the threnoi epitaphoi were “(Turin) Shroud inspired”. The official C14 dating diktat in the late 80s- and in the 90s, had them kept silent on this issue.\nHugh, just in case you have missed it, I ask you AGAIN to answer the following question: WHICH SINDON/RELIC is most precisely referred to in my literay piecing together of several corroborating 944-1207 CE testimonies and eyewitness descriptions – from Gregory Referendarius’ (Archdeacon of Hagia Sophia), to Nicholas Mesarites’ (overseer of the treasuries in the Pharos Chapel of the Boucoleon Palace of the emperors) via Robert de Clari’s (Fourth Crusade Picard knight), and a few others?\n\n","date":"September 28, 2014 at 4:31 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157401","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Reminder for Hugh (third time):\n“[In the church of My Lady Saint Mary of the Pharos (“lighthouse”) in the Golden Imperial Palace of the Boucoleon in Constantinople and another church called My Lady Saint Mary of Blachernae], Christ ‘rise[d] again’ [then], and the sindon(1) with the burial linens [was] the clear proof. [This sindon] as white as snow from antiquity, [was] of linen, of easily obtainable material, remained uncorrupted and smell[ed] fragrant of myrrh. [It] def[ied] decay because, after the Passion, it [had] wrapped the elusive(2) dead naked body. \n[When] raised upright, not only the image of the glorious features of the Saviour’s face with dripping drops of blood shine[d] out but also the form and most noble stature of his entire body hanging down from the cross and embellished with drops of blood and water that make the liquid flow from his own side, could be plainly seen. This [was] not the art of the painter and the various beautiful colours, which provide a door for the mind to consider the original and depict images [that could possibly have depicted] the reflection of his appearance and size imprinted on [his sindon]. [So much so] the ‘not-made-by-hand’ image of Christ and G-od, draped with a white/pure linen cloth he had worn, was sufficiently in lieu of the vision of the Lord coming into the flesh to those who had not corporally seen him.\nAfter the city was taken, the French partitioned the relics of the saints and the most sacred of all, the sindon in which our Lord Jesus Christ was wrapped after his death and before his resurrection. We know the sacred sindon in Athens. [In this city] we saw with our own eyes the burial linen cloths found in the sepulchre.”\nDoesn’t that ring any bell?\nNotes: (1). – Also called sydoine and synne in old French; the latter for “sign” (Latin signum; Greek symbulos). (2). – Greek aperilepton, i.e. consistent both on one hand with G-od’s “un-circumscribed”, non coercive and loving, divine nature that has no shapes, is beyond description and the binds of Death cannot contain and, on the other hand, Yeshua’s “un-outlined”, evanescent nature of his own image on his sindon.\n\n","date":"September 28, 2014 at 4:42 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157404","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Max, you mustn’t overegg your pudding. Both Kitzinger and Belting, distinguished though they were/are, were well aware that their consideration that the Shroud was authentic was very much a minority view, and neither seems to have made much effort to defend it. I agree that they are giants in their field, but that doesn’t make them infallible, and, as they readily admit, their opinion has not acquired widespread credence. “Giants in their field” are not cowed into silence by contrary opinions unless they acknowledge them to be powerful counter-arguments.\nAs for your question, the answer is I have no idea. There seem to have been at least two ‘geniune’ shrouds in Constantinople, and the famous mandylion and probably a couple of Veronicas as well. Adherents either tried to claim that theirs was the real one and all the others fakes or copies, or tried to reconcile the numerous versions by claiming that Christ was washed, wiped or covered with all of them either successively or together. Some were full body, some just faces; none, I think, showed a back view. Probably not a shred survives, although if I had to put money on one I’d go for one of the Veronicas (still being argued about which is ‘genuine’) or the Manoppello veil.\n\n","date":"September 28, 2014 at 5:01 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157410","author":"Hugh Farey","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Hugh, re the Constantinople Sindon/Sydoine,  you wrote you have no idea of what the Constantinople Sindon refers to? Are you kidding or in bad faith? What do you make of the literay synthesis of its corroborating 944-1207 CE testimonies and eyewitness descriptions?\n\n","date":"September 28, 2014 at 6:25 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157424","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"None showed a back view?  Now that’s a big call. Certainly there is no specific reference to a dorsal image but that does not preclude the possibility that this image was bound within the description of the full form of Christ’s figure.\n\n","date":"September 30, 2014 at 3:18 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157888","author":"Thomas","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"You may be right, Thomas; I don’t know any of the texts well enough. However, I don’t think that ‘not precluding’ something is any kind of evidence of its presence.\n\n","date":"September 30, 2014 at 4:05 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157900","author":"Hugh Farey","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Hugh, now if you believe body & soul in the 1988 official C14 dating (1260-1390!)(i.e. in the camel you swallow as diktat), the TS should be then “a medieval copy” of an earlier image ‘apparently’ venerated in Byzantium as Christ’s burial cloth. The only snag is “technically, conceptually, and stylistically the shroud makes no sense as a medieval artwork,” (just ask Thomas De Wesselow). Methinks you still cannot discriminate between an original and its copies.\n\n","date":"September 28, 2014 at 6:11 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157422","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Are there any paintings out there from medieval times that show no brushstroke whatever?\n\n","date":"September 28, 2014 at 9:28 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157456","author":"Don","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"correction: whatsoever\n\n","date":"September 28, 2014 at 9:31 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157458","author":"Don","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"http://www.shroud.com/pdfs/fantiveng.pdf\nA paper that mentions both Charles Calcium (described here as Calcium Carbonate (CaCO3) encrustations – see page 8-9) and Davebs mineral particles from Jerusalem (a focus on “red particles” in this case – see page 12-15).\n\n","date":"September 28, 2014 at 10:36 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157465","author":"Henrik","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Thanks Henrik, a fascinating paper.  There is much there that could be commented on.  I thought the paper most informative when it came to reporting the data discovered and its analysis and seemed reasonably fair.  I thought it unfortunate that the introduction seemed to be loaded with the authors’ own peculiar preferences for an explanation of image formation, specifically that of Prof Fanti, which I believe is over-stated and remains contentious.  There also seems to be a sort of Italian reluctance to admit the possibility of an invisible repair at the C14 sample site and to prefer more unlikely explanations, and make more out of the statistical gradient of the C14 results across the site than may be warranted.  The reluctance to accept the repair hypothesis may be due to the local on-site influence of the views of Mme Flury-Lemburg, who may be inadequately informed on the matter.  Otherwise the data discovered and its analysis is certainly interesting.\n\n","date":"September 28, 2014 at 3:59 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157510","author":"daveb of wellington nz","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Charles,\nYou wrote:\n“I have the full Cennini text. The whole point is to cover the whole cloth with gesso and then you can apply the image wherever you need to. The gesso also acts as a preservative. If the calcium carbonate is uniform and you are the one who has provided a quotation in support of this, this is a point in favour of an original priming and thus keeps open the possibility of an original painting that may have decayed with time.”\nOK. I answered to quickly. The whole cloth might have been entirely covered with gesso.\nTherefore the  more or less uniform distribution of Calcium.\nBut knowing what gesso is/was (“fluid white coating, composed of plaster of Paris, chalk, gypsum, or other whiting mixed with glue, applied to smooth surfaces such as wood panels, plaster, stone, or canvas”, from the Encyclopedia Britannica), how do you explain:\n– the observed fact that the fibers (image fibers as well as background fibers) are not glued together. Do you really think that it is possible with any kind of gesso ground ? \n– the observed fact that there is no protein binder on the image fibers.It seems that gesso always contains glue which necessarily contains proteins. \nIf I understand well, the more or less uniform calcium distribution on the cloth (which can be explained by the retting process) and the superficial image “explained” by the method described by Cennini are enough to keep open the “possibility of an original painting”.\nYes, but only if you forget all of the other observed facts that definitely rule out a painting (with or without gesso).\n\n","date":"September 29, 2014 at 4:01 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157763","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"One must never forget the rough handling the Shroud had especially in the public expositions of the seventeenth century. The gesso surface would have fragmented with time leaving only the evidence of calcium carbonate on the outer fibrils. So I would ask Mr.Jackson to place this possibility among the other hypotheses to be tested. Only closed minds would rule it out from the start and it would be an easy test to do.\n\n","date":"September 30, 2014 at 2:25 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157876","author":"Charles Freeman","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"One view a professor of physiology suggested to me was that what STURP thought was the remnants of blood was in fact collagen from the glue( probably boiled up rabbit skins ) that mixed with the calcium to form the gesso. His was after reading some if the STURP papers. As I keep on saying there is lots of further research to be done by those whose minds are not already closed.\n\n","date":"September 30, 2014 at 2:31 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157878","author":"Charles Freeman","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"And presumably this same professor of physiology had read all the evidence and the results of the several experiments and tests, which conclusively demonstrated that it was human blood, and had a ready explanation as to why the pattern of the glue collagen should coincidentally manifest itself only in the forensic pathology of a crucifixion victim but not otherwise.  Or not??!!  There’s a name for it, and it’s not an “open mind”!\n\n","date":"September 30, 2014 at 4:31 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157903","author":"daveb of wellington nz","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Well I  sent him every STURP paper I could find and he simply said ‘totally unconvincing’ as to the existence of human blood. What is extraordinary is that I keep on saying that further testing is needed to sort out these issues one way or the other . If you refuse to countenance such tests I am entitled to say you have a closed mind. They may rule out the remnants of a gesso applied with a knife altogether just as a doctor might rule out a suspicious lump  being cancer but he still does the tests. I shall be very interested to see if Dr. Jackson is prepared to include tests that might prove conclusively that the Shroud is fourteenth century.\n\n","date":"September 30, 2014 at 12:39 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-158020","author":"Charles Freeman","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Why would the “degraded collagen” remain only on the -very strategic- locations (and patterns) of the stains? It makes no sense.\n\n","date":"September 30, 2014 at 8:33 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-158178","author":"Eric","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Following the 1973 taking of samples during Cardinal Pellegrino’s Commission the Italian blood specialists were quite unsuccessful at obtaining any positive results using the conventional tests as they were unable to dissolve the granules using the standard solvents, probably due to the age of the stains.  Perhaps your professor was expecting to see this type of result which is unattainable.  By 1978 Adler and others had developed spectrographic tests that did not require a solute.  The 1978 STURP blood and forensic specialists included:  John Heller (New England), Al Adler (W. Connecticut U), Joseph Gambescia (St Agnes Med). \nTheir investigations passed 11 tests as true blood; constituents included: proteins, albumen, haem products, bile pigment bilirubin; no image under bloodstains, implies blood stained the cloth before image formation. \nConcerning future testing, a major problem would seem to be finance.  The Americans were able to raise the sum of $US2 million in 1978 values to finance STURP,  Practically all reputable and rigorous science research nowadays requires institutional funding, either University, Research Houses, Drug Corporates, or Philanthropic Foundations and who generally expect to see a tangible return on their investment.  Otherwise any future research is dependent on volunteers, bound to be amateurish, and almost certainly will remain inconclusive.  Any financial return on such funding would seem minimal. \nUntil a solution to this question of funding is found and given some attention, I doubt whether it is realistic for any formal programme of testing to move forward and produce any conclusive results.\n\n","date":"September 30, 2014 at 3:45 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-158124","author":"daveb of wellington nz","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"There are wealthy Catholics who could fund this in a heartbeat, but of course the results would always be seen as ‘biased’ because of who was backing it. I’m sure there are also wealthy atheists who likewise could fund it, with the same problem of optics as above.\nCrowd-funding might be an option – more and more charitable endeavors are done that way. It would offer some form of funding neutrality.\n\n","date":"September 30, 2014 at 4:18 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-158133","author":"David Goulet","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Cennini’s “gesso” is to CALCIUM mineral SULFATE (CaSO4 · 2H2O). It seems that the correct information is not valid for you, Charles.\n Cennini’s “gesso” is NOT a carbonate of calcium.\nCarlos\n\n","date":"September 30, 2014 at 4:29 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-157902","author":"Carlos","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"Charles,\nThe more I read your “gesso hypothesis”, the less I understand.\nYou did not answer clearly to my last post.\nOr do you seriously think that with the handling of the Shroud ”  The gesso surface would have fragmented with time leaving only the evidence of calcium carbonate on the outer fibrils” without leaving any kind of protein binder (no protein at the nano to picogram level on image fibers), without any kind of cracks in the image, without any kind of cementation between the fibers etc…\n“One view a professor of physiology suggested to me was that what STURP thought was the remnants of blood was in fact collagen from the glue( probably boiled up rabbit skins ) that mixed with the calcium to form the gesso. His was after reading some if the STURP papers.”\nEureka.\nNo doubt that collagen mixed with calcium can explain the red color, the presence of porphyrin, the many positive tests for blood (hemochromagen ..), the albumin, the immunio-chemical tests etc.\nMore seriously, I agree that new tests are needed.\nBut we already have strong data that can rule out a painting, at least in its common sense, with or without gesso.\n\n","date":"September 30, 2014 at 4:17 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-158132","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"So Maybe it is a Painting After All","post":"I am glad we can agree on the need for new testing but I don’t think the 1078 tests should stand as conclusive of there being no paint. However, new testing will give an opportunity to resolve the matter.\nMy professor worked from what STURP reports were available and he found them unconvincing and I have no doubt that it is another area that needs new work on it. By the fourteenth century there were many cults involving the blood of Jesus, some of it coming from bleeding consecrated hosts- the real blood of Jesus, of course , so later blood may have been added as we know the extensive blood marks were the first thing the fifteenth and sixteenth century observers noted, far more dominant than they are today.\nI always find it strange that Shroud researchers assume that the Shroud today as as it always has been but with the passage of time one would expect major changes to have taken place on the surface. Plotting what these may have been from early descriptions and depictions needs to\nBe added to Dr. Jackson’s list.  Belsdon Scott made a good start but much more archival research needs to be done in Turin.\n\n","date":"October 1, 2014 at 1:10 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","id":"comment-158241","author":"Charles Freeman","site":"shroudstory"}]
