[{"title":"Something Colin Berry wrote this morning reminded me of this","post":"As I wrote earlier, the Resurrection, being a supernatural event, could not be subject to direct observation. If it can be indirectly observed on the Shroud is another question.\n\n","date":"November 13, 2014 at 6:16 am","url":"https://shroudstory.com/2014/11/13/something-colin-berry-wrote-this-morning-reminded-me-of-this/","cat":"image_theory","id":"comment-171013","author":"Louis","site":"shroudstory"},{"title":"Something Colin Berry wrote this morning reminded me of this","post":"At some point, many of us will part company with fundamentalists who insist on the “inerrancy of scripture.” The extreme position are those that believe “creation” as set forth in Genesis occurred a scant 6,000 years ago, give or take a millennium.\nI find Genesis revealing and relevant not as history of creation but as the history of humanities grappling with the mystery of its own existence. Even St. Augustine regarded it as metaphor.\nAs you advance through scripture from Genesis, however, it becomes clear that the metaphorical gets mixed in with actual historical events. Disentangling the metaphor from the actual history becomes a complex process. \nI think it is quite clear that the authors of the New Testament by and large did not believe they were writing metaphor but compiling history from pre-existing traditions or lost original texts.\nIf there is one thing an authentic Shroud does, it is to confirm in great detail, the four Gospel accounts of Christ’s death and point towards his Resurrection.\nHowever,we must be careful in our scriptural exegesis to not take wild assumptions and leaps of faith and disguise them as revealed truth.\nSome fundamentalists do that and the construction of “Jesus took the Shroud with him” is one of those constructs that is actually a theory. Added to the problem are the apocryphal writings that were rejected when the current canon of the New Testament took it present form.\nOne example of biblical exegesis run wild are the recurring apocalyptic prophesies of impending doom. Some Christians at the end of the first millennium were convinced that 1000 AD [CE] would be the year of the Apocalypse. Repeated claims of Apocalypse have been made throughout history since that time.\nOf course, I must confess that I am now a believer in an approaching Apocalypse but it is based not on Scripture but science. The Apocalypse we face is not necessarily an act out of the blue of the judgment of God. It is the result of humanity’s selfishness. And there is one prophet of the Apocalypse of  Selfishness that has been quite outspoken. He recently moved to Rome and his name is now Francis. \n” If we destroy creation, creation will destroy us.”*\n*As quoted in Chapter 17 of the “Coming of the Quantum Christ.”\n\n","date":"November 13, 2014 at 6:55 am","url":"https://shroudstory.com/2014/11/13/something-colin-berry-wrote-this-morning-reminded-me-of-this/","cat":"image_theory","id":"comment-171020","author":"John Klotz","site":"shroudstory"},{"title":"Something Colin Berry wrote this morning reminded me of this","post":"Ftom Posting header:\n“… That would explain everything, wouldn’t it.” \nBesançon has a tradition of housing the true Shroud, and the original St Stephen’s church there was burnt down in the 14th century.  The subsequent Besançon Shroud is clearly a painting and it shows only a ventral image.  Daniel Scavone in a paper with the title “The Missing Years” covering the 13th & 14th centuries, notes that Besançon in Burgundy was then a target for the German Empire, with its pro-Roman pontiff sympathies.  The Vergy-De Charnay families were French and preferred the claims of the anti-pope in Avignon.  He proposes that Jeanne de Vergy rescued the Shroud from Besançon to save it for France.  When St Stephen’s church was restored after the fire, the Besançon clergy sought to retrieve  their Shroud, but by then there had been a succession of bishops and no-one there recalled the original.  Jeanne de Vergy arranged to replace it with a copy, and this may have been the basis of the confusion of Bishop Pierre D’Arcis in his complaints that the Lirey Shroud had been painted and was not the true Shroud.  The theory seems to be an attractive one but cannot be supported by hard documentation, as so many church records were deliberately destroyed during the French Revolution and its Reign of Terror.  \n“BESANÇON AND OTHER HYPOTHESES FOR THE MISSING YEARS: THE SHROUD FROM 1200 TO 1400”  by Daniel Scavone, University of Southern Indiana, Evansville;\nOhio Conference 2008.\nhttp://ohioshroudconference.com/papers.htm\n\n","date":"November 13, 2014 at 3:15 pm","url":"https://shroudstory.com/2014/11/13/something-colin-berry-wrote-this-morning-reminded-me-of-this/","cat":"image_theory","id":"comment-171092","author":"daveb of wellington nz","site":"shroudstory"}]
