[{"title":"Is the Shroud of Turin a Fake?","post":"Hi\nI agree with everything shroud scholar Russ Breault stated in this excellent post but nonetheless I´d like to focus on some particular aspects of Shroud image.\nIt does not surprises me at all that as Shroud Exhibit is approaching skeptics posit theories and make alleged scientific experiences do discredit the Shroud.The same has happened on Lents with the Gospel of Jude, Talpiot Tombs and all that sort of stuff after da Vinci Code…\nActually italian chemistry professor Luigi Garlaschelli claims a medieval forger could have easilly accessed to materials like a linen cloth and red ocher to fake the Shroud. THIS SOUNDS LIKE A DÉJA-VU\nIt is a well known fact that red ocher is not responsible for the image on the Shroud and we have a reliable «corpus of evidence» to stste that:\n-Red ocher is mainly natural iron oxide with impurities such as Mn Ni and Co ; Shroud iron oxide appears in a pure form and results from oxidation of Fe bound to cellulose linen fibers in water stains and in scorch areas from charred blood.\nX-Ray Fluorescence and microchemical tests discarded the presence of such metallic contaminants so it turns out red ocher does not make the image neither does iron oxide and why?\nX -ray fluorescence concluded that iron concentration is not increased in image areas but as expected is actually increased in bloodstained areas due to hemoglobin iron\nSo beeing neither red ocher nor iron oxide are responsible for image color and iron oxide does not disappear from the fabric like a touch of magic as professor Garlaschelli tries make us to believe.\nIt is also an established fact that the chromophore of image fibers is a conjugated carbonyl.\nIf we remember the backlit photograph of the Shroud the image is no longer discernible so iron cannot be there in sufficient concentration to form the image.\n-Another aspect I´d like to focus is 3 D encoding\nNo doubt at first sight photogaphic negative of Garlaschelli´s shroud face looks like the real one but if we watch carefully it is not so.\nProfessor Giulio Fanti has already analized the alleged 3 D encoding and results are quite elucidative THE IMAGE APPEARS DISTORTED AND WITHOUT REAL 3D ENCODING.\nSo beeing I guess it will not have holographic encoding as the true Shroud image does.\nWe cannot take seriously a claim that instead of resulting from a research published in a peer reviewed scientific journal appears in a press release\nNo doubt we have to admit that Garlaschelli´s shroud was a clever experiment and him and his team cunningly produced a shroud with some similarities to the real one but I utterly disagree from CNN news stating «Scientist re-creates Turin Shroud to show it´s fake» it should rather state Scientist tries to fake the real Shroud of Turin.\nBut there is just one real SHROUD OF TURIN AND IT WAS NOT MAN MADE\n           best regards\n Maria da Glória\nCENTRO PORTUGUÊS DE SINDONOLOGIA http://www.santosudariodeturim.blogspot.com\n\n","date":"October 17, 2009 at 11:08 am","url":"https://shroudstory.com/2009/10/16/is-the-shroud-of-turin-a-fake/","cat":"image_theory","id":"comment-826","author":"Maria da Glória Gonçalves Barroso","site":"shroudstory"},{"title":"Is the Shroud of Turin a Fake?","post":"To Maria da Gloria: I belong to the CES (Centro Español de Sindonología) and EDICES (the branch working on the study of the Oviedo Sudarium). As a group, we would like to have contacts with the Center in Portugal. And as a long time student of the Shroud (and lecturer at several Congresses, in Spain, Peru and Rome) I would be glad to share some writings on the subject.  My e-mail:  ecarreira@res.upcomillas.es\nWith my best regards and Happy New Year 2011.  Manuel M. carreira, S.J. from Madrid\n\n","date":"January 2, 2011 at 1:54 pm","url":"https://shroudstory.com/2009/10/16/is-the-shroud-of-turin-a-fake/","cat":"image_theory","id":"comment-2077","author":"MANUEL M. CARREIRA, S.J.","site":"shroudstory"}]
