[{"title":"Struggling with Naturalist Explanations","post":"Maybe we should recognize that everything is “natural” but there are some things that we simply can not understand and that science can’t explain yet. Science has been creeping-up on phenomena that have previosly been beyond our ability to rationalize. The sublime issue is the nature of our consciouness and does it have a capacity to function beyond time and space. If it is a quantum phenomena that it most likely does.\nThe paranormal will ultimately be explained. In the meantime, I agree with the proposition that the simplest explanation of the Shroud image is the Resurrection. Some day, probably not in my life time, science will explain it.\nI am not kidding. See http://vimeo.com/39982578\n\n","date":"May 22, 2013 at 2:16 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34354","author":"John Klotz","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"Hullo John\nNice to see someone recognise that the paranormal (genuine phenomena) will ultimately be explained and not dismissed as they are now by sceptics.\n\n","date":"May 22, 2013 at 4:08 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34363","author":"Louis","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"This reasoning sounds like the reasoning of men in Antiquity who were watching a tornado or an earthquake and, because they were not able to find a rational explanation for those events, they believed it was a miraculous intervention of God.  This type of reasoning is called « The God of the breaches » (a convenient God who fill the gaps of our understanding of the natural world if you prefer) and can be ok in a religious discourse but not in a scientific one.  Science is VERY FAR from having come full circle concerning the testing of the numerous potentially good natural explanations concerning the image.  And think about that :  If the bloodstains on the cloth came from a completelly natural phenomenon (transfer of exudates of humid blood clots), then why science would have to start searching elsewhere than in a natural direction for the image?  Because it is the reported Shroud of Jesus-Christ?  Science has (or at least should have) nothing to say and nothing to do concerning Christness…  Final comment :  You can bet your house that Ray Rogers was not at all thinking about a miraculous event when he told Barrie that something else was at work with the Maillard reaction.  Personally, I’m a bit disappointed that Barrie report this quote from Ray without saying more about it because, as it is written, it is very easy for a member of the supernatural fringe to replace « something else » by « miraculous intervention », while it’s far from being the case concerning Rogers opinion about the image on the cloth.  I hope my comment will help people to not start putting « miraculous » words in Rogers’ mouth…\nLast thing.  Jason said « . We don’t just need to explain how the image could have been produced, but also why it happened with Jesus in particular and not with other individuals… »  Comment from me :  What make you think Jesus is the only crucified person to have left an image on his burial cloth?  How can we be certain about that since the Shroud of Turin is the ONLY intact burial cloth we have today that have contained for a short period of time the body of a crucified man?  How can we be so sure that there were not images like that at the surface of other shrouds of crucified criminals after 72 hours?  It’s impossible to know if the image on the Shroud is unusual or not in the context of the Jewish burial of a crucified man because the Shroud of Turin is the only one we have.  All the others have decayed with the corpse!  Sorry but this is not a scientific argument.\nThis is just my personal opinion and, of course, anyone else is free to believe the image on the Shroud is miraculous…\n\n","date":"May 22, 2013 at 2:50 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34355","author":"Yannick Clément","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"One last thing.  I repeat myself but I think it’s crucial to understand this truth (especially if you believe in the Resurrection of Christ and if you believe the Shroud is the authentic burial cloth of Christ) : IF THE IMAGE REALLY COME FROM A NATURAL PROCESS (OR PROCESSES) THAT DOESN’T MEAN THE SHROUD MAN WAS SOMEONE ELSE THAN JESUS AND/OR THAT JESUS RESURRECTION NEVER HAPPEN.  In other words, there would be nothing to fear for the Christian faithful if the image on the cloth is proven natural one day…  Unfortunatelly, I don’t think every faithful interested in the Shroud think that way.\n\n","date":"May 22, 2013 at 3:41 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34360","author":"Yannick Clément","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"I thin you are mistaken. The reality of the Shroud has nothing to do with the faith.\n\n","date":"May 22, 2013 at 4:45 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34366","author":"jesterof","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"Ditto.\n\n","date":"May 22, 2013 at 5:21 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34370","author":"Louis","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"Yannick,\nYou’ve made some good points that I agree with. Belief in Jesus’ resurrection doesn’t depend on the Shroud. And I didn’t intend to imply that Ray Rogers was thinking of a miracle when he referred to more than a Maillard reaction being involved. I agree that it would be unreasonable to interpret Rogers that way. I don’t think Barrie Schwortz did anything wrong in mentioning Rogers’ comments in the way he did, and I don’t think I misrepresented anything in my post. Just after I quoted Schwortz’s comments, I mentioned how significant the Shroud would be even if it weren’t best explained by Jesus’ resurrection.\nI disagree with your comments about a God-of-the-gaps appeal, however. Naturalism-of-the-gaps is no substitute for God-of-the-gaps. We’re under no obligation to endlessly suspend judgment until a naturalistic explanation comes along. Why assume that everything has a naturalistic explanation? You refer to what’s appropriate in “a scientific [discourse]”. But judgments about the Shroud, like judgments about many other matters in life, involve more than science. Philosophy, history, and other fields are involved as well. And the nature of science is itself a disputed issue. If there is a God, and he acts in history, why think that science wouldn’t be able to discern some aspects of that activity? Yes, more than science would be involved, but science wouldn’t be excluded. Similarly, science can discern some aspects of the activity of non-supernatural agents, like humans, even though more than science is involved in analyzing human activity.\nWe have good evidence for Jesus’ resurrection and its surrounding context independent of the Shroud. I’m not appealing to ignorance. I’m not appealing to some sort of God-of-the-gaps. Rather, I’m appealing to something, the resurrection, that we have good reason to believe occurred at a time in Jesus’ life that seems to align with the timing of the Shroud image. I’m appealing to an event (the resurrection) that would involve the removal of the body from the Shroud in an unusual way, which aligns well with the unusual intact condition of the cloth and bloodstains. I’m appealing to the supernatural and unique nature of an event (the resurrection), which aligns well with the failure of naturalistic explanations for the Shroud and the Shroud’s apparent uniqueness. In other words, I’m appealing to a series of close alignments between an event we have good evidence for, Jesus’ resurrection, and the Shroud characteristics. That’s not an appeal to a God-of-the-gaps. And it’s preferable to an appeal to multiple naturalistic alternatives, at least one of which has yet to be identified. An appeal to a known resurrection seems preferable to an appeal to a largely unknown naturalism-of-the-gaps. I’m not impressed by the unpaid IOUs of naturalists.\nYou ask how we can be “certain” and “sure” about my conclusions. We don’t need certainty. Probability is enough. And that probability is revisable. If a better naturalistic explanation becomes available in the future, then we can adopt it at that point in time. At the present, however, Jesus’ resurrection is a better explanation.\nYou also ask, “What make you think Jesus is the only crucified person to have left an image on his burial cloth?” I see no reason to think that only crucifixion victims would meet the criteria.\nEven if we limited our analysis to such individuals, I doubt that no other historical references would have been made to such images if they occurred commonly or even if they occurred more than a tiny percentage of the time. What we have access to today isn’t all that’s relevant. We also have to consider the lack of such cloths mentioned in the historical record. Did people in the ancient world act as though seeing such images on burial cloths was a common thing? How did people in late antiquity and the early medieval era get the notion that such an image would be miraculous if they had been seeing it happen regularly for centuries in non-miraculous contexts?\nKeep in mind, too, that crucifixions and other such executions continue to occur in the modern world. It’s not just a matter of what ancient or medieval sources tell us about burial cloths or equivalent objects. It seems to me that there have been many opportunities for the Shroud image to be duplicated under such scenarios. It hasn’t happened.\nAnd I didn’t just appeal to the image on the cloth. I also appealed to the condition of the cloth and what it suggests about how the body was removed. Even if it were common for images like the Shroud image to form, the image isn’t all that needs to be explained.\n\n","date":"May 22, 2013 at 7:09 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34381","author":"Jason Engwer","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"Your discourse is obviously driven by your faith in Christ.  You got the right to believe this and you also got the right to share it with others, but be certain that no credible scientist that is INDEPENDENT OF MIND on the subject would ever agree with you if he would study all the available data and observations coming from the Shroud.  That’s why I said that your opinion on the Shroud is much more a religious one than a scientific one.  But in the end, that doesn’t mean you’re wrong after all.  Until the image can be proven to be 100% natural, the supernatural explanation is still possible but, as a faithful Catholic, I wouldn’t bet by house on this.  Also, I would like you to realize that the belief in a supernatural explanation concerning the image on the Shroud mostly appeared in modern time, after that STURP wasn’t able to give us one definitve explanation for the formation of the image.  But the thing is this :  the fact that STURP came up empty doesn’t mean at all that the image is due to a supernatural event linked with the Resurrection of Christ.  That’s not at all the right way to read STURP final conclusions.  It’s mainly the same thing concerning Rogers « something else » quote given by Barrie.  I know that you never read his quote has meaning “supernatural event”, but I’m sure some will do and they will be wrong to do so.  I will conclude with this great quote from Carl Sagan that fits very well in the case of the Shroud image, absence of evidence (for the moment) is not the same thing as evidence of absence…\n\n","date":"May 23, 2013 at 9:46 am","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34461","author":"Yannick Clément","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"Small correction in my previous comment :  Read:  I wouldn’t bet MY house on this.  Sorry for the spelling mistake…\n\n","date":"May 23, 2013 at 9:48 am","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34462","author":"Yannick Clément","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"Yannick wrote:\n“You got the right to believe this and you also got the right to share it with others, but be certain that no credible scientist that is INDEPENDENT OF MIND on the subject would ever agree with you if he would study all the available data and observations coming from the Shroud.” \nThose “credible” and “independent of mind” qualifiers are ambiguous and debatable.\nBut what’s the significance of your objection, even if I grant your premises? As I explained in my last reply to you, I’m not limiting myself to scientific conclusions, and I’ve been open about how my Christian beliefs affect what I conclude. All you seem to be saying above is that my conclusions wouldn’t be reached by somebody who’s limiting himself to science and meets your criteria for being “credible” and “independent of mind”. So what? I don’t deny that my conclusions would be different if I applied different standards. And you aren’t giving us any reason to adopt your alternative standards. If a scientist doesn’t believe in Jesus’ resurrection based on the good evidence we have for it that’s independent of the Shroud, then so much the worse for that scientist. He’s wrong. I’m not obligated to follow him in his error.\nYou wrote:\n“That’s why I said that your opinion on the Shroud is much more a religious one than a scientific one.” \nThose aren’t the only two categories we should be concerned with. And a religion like Christianity, which bases itself on historical claims and appeals to objective evidence, involves fields of knowledge that are of an evidential nature, such as history. Furthermore, science is likewise associated with other fields of knowledge, such as philosophy and history. Your arguments about science in this thread are philosophical arguments. It’s not as though we can place your arguments in a beaker and test them in a laboratory. (Even if we could, as soon as somebody would report what happened in that experiment, the report would involve historical claims.) None of us rely strictly on science for our conclusions about the Shroud. All of us are bringing philosophical views, historical beliefs, and other non-scientific perspectives to the table.\nYou wrote:\n“But the thing is this : the fact that STURP came up empty doesn’t mean at all that the image is due to a supernatural event linked with the Resurrection of Christ.” \nI agree. But I didn’t base my argument on STURP’s failure to find a naturalistic explanation. I didn’t even mention STURP. The long train of failed naturalistic explanations goes well beyond STURP.\nYou wrote:\n“I will conclude with this great quote from Carl Sagan that fits very well in the case of the Shroud image, absence of evidence (for the moment) is not the same thing as evidence of absence…” \nSee what I said earlier about the evidence for the resurrection theory (not just an absence of evidence for an alternative), as well as what I said about naturalism-of-the-gaps, endlessly suspending judgment, etc.\nYannick, I agree with you on a lot of the issues that come up on this blog, probably the large majority. When I’m posting on Shroud topics at my blog, I often point people to your comments here. But I’ve never understood why you’re so adamant in opposing supernatural views of the Shroud, given how good the evidence is for such a view.\n\n","date":"May 23, 2013 at 7:00 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34520","author":"Jason Engwer","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"Quote: “If a scientist doesn’t believe in Jesus’ resurrection based on the good evidence we have for it that’s independent of the Shroud, then so much the worse for that scientist. He’s wrong. I’m not obligated to follow him in his error.”\nMy comment: In my previous post, all I said is the fact that any credible scientist must  remain independent of mind versus the dogma of the Resurrection of Christ when he wants to study this cloth and the image that we see on it.  The concept of Resurrection is a religious concept that should not create any bias in the scientific study of any credible scientist who wants to study this piece of cloth.  That’s all I said and I think we can agree on that.\nQuote : “Furthermore, science is likewise associated with other fields of knowledge, such as philosophy and history. Your arguments about science in this thread are philosophical arguments. It’s not as though we can place your arguments in a beaker and test them in a laboratory. (Even if we could, as soon as somebody would report what happened in that experiment, the report would involve historical claims.) None of us rely strictly on science for our conclusions about the Shroud. All of us are bringing philosophical views, historical beliefs, and other non-scientific perspectives to the table.”\nMy comment:  Ok.  But what I was refering to is the fact that if a scientist wants to explain the image on the cloth, he should try to evaluate and even test all the possible natural explanations before even thinking about a supernatural cause for the image.  Such a scientist must leave his faith in his back-pocket while doing his research because if don’t act like this, sure he will get biased by his faith and his science has great chances to go off-track versus the reality of the Shroud.\nQuote: “The long train of failed naturalistic explanations goes well beyond STURP.”\nMy comment: Since science is far from having come full circle in the study of potentially good and natural explanation for the image, I think you should remain prudent before putting the tag “failed” over these hypotheses.  Much more study remain to be done before we can definitively put them aside.  And even if you don’t base your supernatural judgement on the failing of STURP to find a scientific explanation (which should be understand, by the way, as a synonymous of “natural explanation”), be certain that many people from the supernatural fringe does and that kind of thinking is just wrong!\nQuote: “Yannick, I agree with you on a lot of the issues that come up on this blog, probably the large majority. When I’m posting on Shroud topics at my blog, I often point people to your comments here. But I’ve never understood why you’re so adamant in opposing supernatural views of the Shroud, given how good the evidence is for such a view.”\nMy comment: If the image would be caused by a substance that would be unknown to us or that would defy the known laws of nature (like the Guadalupe Tilma by the way), I would agree with you but because I never seen any proven data or observation coming from the Shroud that seem to contradict the known laws of nature (even though the exact process of image formation remains to be resolved), I continue to think that any credible scientist should keep on searching in the direction of a natural process that has nothing to do with the Resurrection of Christ, except maybe for the possibility that the disappearence of the body from inside the cloth could have happened at the best possible time in order to leave the very high resolution image we see on the cloth.  I think you should read the great paper written in 2011 by 2 Italian scientists about the image on the Shroud called “Stochastic distribution of the fibrils that yielded the Shroud of Turin body image”.  In this paper, the Italians wrote that even the 3D and the negative  characteristics of the image are not at all hard to explain naturally.  Only the exact process of image formation remains to be define exactly.\n\n","date":"May 24, 2013 at 1:03 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34645","author":"Yannick Clément","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"I consider Jason’s explanation, excellent, well-reasoned, and clear. My personal view is that the image is very lkely naturalistic, perhaps Maillard with something else (such as radon). I am open to the possibility of it being miraculous. Perhaps it is what might be called a secondary miracle, in that the specific environmental conditions were such as to allow the image to form. However there are at least two other known cases where a person’s death has resulted in apparently similar images, one being the Jospice mattress. \nI find myself in fundamental disagreement with Jesterof and Louis, when they say that the Shroud image has nothing to do with faith. Faith is to be based on a belief that has some rational basis, otherwise it may be classed as fanatacism. The Shroud image can provide one such basis for a rational faith, in that here is a burial cloth but without a body, and with an image that corresponds to the gospel accounts of Christ’s crucfixion, and yet with no signs of corruption. The Shroud need not to be essential to one’s faith, but it can provide a rational bssis for belief in the Resurrection, particularly with the modern mind-set inclined to dismiss the supernatural as mere superstition.\n\n","date":"May 23, 2013 at 1:30 am","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34396","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"Not everybody who has faith even knows about the Shroud. I can understand that for some ” the proof” is necessary, but their existence does not preclude the existence of those, for whom it is not essential.\n\n","date":"May 23, 2013 at 9:31 am","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34457","author":"jesterof","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"I was aware of the Jospice Mattress, but I wasn’t including it as a similar image. Even if we were to include it, the phenomenon would still be tremendously rare. Barrie Schwortz has described the sort of Maillard reaction that would produce something like the Shroud as “astronomically” unlikely as a natural occurrence. See minute 36 of the second hour of the July 21, 2012 program linked here.\nIt could be suggested, as daveb has above, that “a secondary miracle” occurred, but that would still be distinct from what’s normally classified as a naturalistic explanation. An event, such as an apparent answer to prayer, is often considered miraculous because of its timing or some other aspect of its surrounding context, even if the event wouldn’t be considered miraculous independent of that context. If somebody wants to suggest that the Shroud image was produced by a Maillard reaction that was miraculous in that sense or was produced by some other miracle similar to a Maillard reaction, that’s not what would usually be classified as a naturalistic explanation.\nOne of the questions here is whether we should prefer a series of naturalistic and/or secondary miraculous explanations over a single miraculous explanation (the resurrection). The latter is simpler, we have good evidence independent of the Shroud that it occurred, and it seems to have occurred in a way that’s consistent with the Shroud characteristics. The state of the body image on the Shroud seems consistent with the timing of Jesus’ resurrection, the failure of naturalistic explanations of the Shroud is consistent with the supernatural nature of the resurrection, and the uniqueness of the image is consistent with the uniqueness of the resurrection. Even if it would be argued that the resurrection produced a Maillard reaction or something similar, which in turn resulted in the image we see, the resurrection would still be behind those secondary causes as a root cause.\nOnce you add the other characteristics of the Shroud, like the intact condition of the cloth and bloodstains, it becomes even more untenable to maintain that the Shroud is the result of a series of naturalistic and/or secondary miraculous causes. And the characteristics I’m highlighting here, namely the cloth image and the intact nature of the cloth and bloodstains, make sense as characteristics that an intelligent agent would want to produce. They aren’t just odd occurrences that don’t seem to serve any significant purpose. Rather, the Shroud image is highly significant in multiple contexts, such as in serving as evidence for the events surrounding Jesus’ death. And supernaturally removing the individual from the Shroud (as implied by the intact nature of the cloth and bloodstains) makes sense insomuch that a resurrected individual would have to somehow be removed from the cloths binding him, and that manner of removing the body is more effective in preserving the cloth. Less significantly, but still worth noting, removing the body that way is more dignified. Just as Jesus surely was provided with clothing supernaturally after the resurrection, instead of having to leave the tomb naked and having to find clothing somewhere, it makes sense for him to be removed from his burial cloths in a similar manner. The significance of these characteristics of the Shroud (the image and the intact nature of the cloth and bloodstains) serves as further evidence against the conclusion that the characteristics are just the results of a blind, aimless, purposeless naturalistic process, such as a non-miraculous Maillard reaction.\n\n","date":"May 23, 2013 at 6:21 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34517","author":"Jason Engwer","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"Recent newspaper reports on cosmic research suggest that the first evidence of other universes is now coming to light. These are based on the observation of how matter is distributed in our own universe and suggests that other universes may be interacting with our own. If this proves to be correct, then there is still a long scientific journey ahead.  \nConcerning the “something else” besides Maillard. I have frequently referred to the possibility of radon gas released during earthquakes as being that “something else”. But I shall spare myself and other readers the bother of constant repetition.\n\n","date":"May 22, 2013 at 5:05 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34368","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"If Rogers was right about the chromophore of the image (i.e. a coloration of a thin layer of carbohydrate impurities), then it is evident that a radiation of radon is not at all the “something else” that Rogers was searching.  It is clear in the writings of Rogers that if the chromophore is really a thin layer of impurities on-top of the fibers and not the fibers themselves, then any energetic radiation must be exclude as a cause of the image…  So, in my mind, mixing radon radiations and a Maillard reaction is most probably a bad idea.\nBy the way, in Rogers book and writings, he NEVER said that a Maillard reaction alone cannot explain the image.  I think much more researches need to be done to fully test his hypothesis before claiming that there was surely “something else” at work.  It’s truly possible that there was something else, but it’s also possible that a Maillard reaction alone (in a very unusual context which need to be fully determined) could have given the result we see on the Shroud\n\n","date":"May 23, 2013 at 1:01 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34482","author":"Yannick Clément","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"Maillard reaction is not a definite answer. But Rogers’ views concerning a gas diffusion mechanism and an auto-catalytical gas-solid reaction are the two major parameters explaining image formation/contrast, scientifically.\n\n","date":"May 23, 2013 at 1:42 am","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34399","author":"anoxie","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"Along with De Salvo’s hypothesis, I consider Rogers’ hypothesis as the most promising by far to explain the image.  More testing need to be done for sure to test these two natural hypotheses !\n\n","date":"May 23, 2013 at 8:28 am","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34447","author":"Yannick Clément","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"YC wrote: “Along with De Salvo’s hypothesis, I consider Rogers’ hypothesis as the most promising by far to explain the image.” Far from it!\n1/The true fact is Salvo wrote: “My theory does not answer all the questions. Some problems are that the Shroud body image is a surface phenomena but the Volckringer patterns are not. They penetrate into the paper. Also calculations using diffusion of lactic acid would not produce the high resolution of the image we see on the Shroud. Thus my theory does not explain all the characteristics of the Shroud and more research needs to be done.”\n2/ The true fact is a Maillard reaction with a loosely draped burial cloth (according to YC), that is with no collimation, just cannot work either.\n\n","date":"May 23, 2013 at 2:01 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34493","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"De Salvo never truly test his hypothesis under proper lab conditions.  Who knows what can be obtained if the right conditions are reunited ?\nAnd concerning Rogers hypothesis, Jackson, Ercoline and Jumper of STURP (and also Latendresse later on) showed that an untied draping of the Shroud is the most probable configuration at the time of image formation (or else, there would have been serious distortions, especially lateral ones, of the image) and I don’t think it comes in contradiction with Rogers hypothesis since it is a scientific proposal that is supposed to work as much as in direct contact as at short distance, which is exactly how the Shroud man’s body was versus the cloth…\n\n","date":"May 23, 2013 at 2:10 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34496","author":"Yannick Clément","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"Yannick, you wrote: “And concerning Rogers hypothesis, Jackson, Ercoline and Jumper of STURP (and also Latendresse later on) showed that an untied draping of the Shroud is the most probable configuration at the time of image formation (or else, there would have been serious distortions, especially lateral ones, of the image).”\nWithout getting into all the details of Jackson’s totally biased reconstruction, just allow me to mention 2 most striking errors that show how amateurish his alleged ‘reconstruction’ is:\n– the Turin Shroud blood image and body image imply at least TWO different configurations of the long burial cloth in conjunction with the corpse, not just one.\n–  the side-strip mistakingly is left on the Shroud for this demonstration. It just means he used TWICE the side-strip i.e. both as part of the main clothe AND as a bandage that would have been cut off from the said clothe!). \n Now you advocate Jackson’s pseudo-reconstruction of the TS Man’s wrapping “showed that an untied draping of the Shroud is the most probable configuration at the time of image formation” and it is “a scientific proposal”!!!\n How “scientific”! IHow archaeological! \n  Do you really think you’re speaking in the name of “science” and “truth” when it comes to the Turin Shroud? Most sadly, you really do…\n\n","date":"May 23, 2013 at 5:29 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34512","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"Additional reminder for YC: In his reconstruction, Jackson totally overlooks or ignores the TS Man’s head was tilted forward and his back was curved. He is also totally unaware of the folding of his burial cloth at the buttock level… More?\n\n","date":"May 23, 2013 at 6:07 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34516","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"BTW YC, have you ever tried to reconstruct the TS man’s wrapping in shrouds? I tried twice in 1994 and 1997.\n\n","date":"May 23, 2013 at 6:25 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34519","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"Max you wrote : “- the Turin Shroud blood image and body image imply at least TWO different configurations of the long burial cloth in conjunction with the corpse, not just one.”\nI TOTALLY AGREE WITH YOU AND THAT’S SOMETHING I TRIED HARD OVER THE YEARS TO ENTER INTO MARIO LATENDRESSE’S HEAD!  He still believe that there was absolutely no change of configuration of the Shroud and that a single configuration of the cloth can explain everything, i.e. the bloodstains as well as the body image, which is, in my mind, ridiculous…\n\n","date":"May 24, 2013 at 3:46 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34662","author":"Yannick Clément","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"Oh by the way Max… Who knows if what happened in a rock tomb of Jerusalem 2000 years ago was not an interesting mix of Rogers and De Salvo’s hypotheses?  Who knows if a skin covered with deposits of urea and lactic acid coming from the dried sweat is not the solution?  Who can be sure about that since no one has ever tested this kind of combined hypothesis properly?\n\n","date":"May 23, 2013 at 2:13 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34497","author":"Yannick Clément","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"May I ask an uneducated( from Shroudology point) question here? :-)\nCan anybody explain to me why are some substances singled out – lactate, or urea, or anything else. Human blood is full of carbohydrate complexes and it is also full of proteins, amino acids, fats and metabolites of all of  those. It is a milieu of different substances and substrates which all can produce the reaction of caramelization or else. Given the stress the tortured Man of the Shroud was subjected to one can also assume that the level of plain glucose ( and fructose) in His blood was also very high. Plus the levels of hormones and their metabolites etc.\nThe pH, the electrolyte content was also out of the wack and those factors also can contribute to the possibility of different types of reactions.\nSo why are the researchers singling out ONE ( or two-three) substances for their hypothesis? I’ve seen that already in the “blood threads” and it is continuing here as well.\n\n","date":"May 23, 2013 at 5:01 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34509","author":"jesterof","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"YC is entitled to his views that radon is not part of the solution. However there remains a gaseous diffusion problem in a purely chemical explanation. Clearly there has to be some kind of collimation mechanism on the gaseous particles to produce such a reasonably well-defined image. Radon with its alpha particles, and possibly the subsequent gamma radiation from its decay products, may have been part of that mechanism. They would be fairly small quantities and would not necessarily have a strong penetrating effect on the cloth. The answer might well be revealed in due time, possibly sooner than he imagines. Perhaps YC’s main objection to the possible role of radon, is because it did not occur to his hero. The plain fact is that no-one has ever produced a persuasive image experiment by Maillard alone!\n\n","date":"May 23, 2013 at 5:35 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34513","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"What can I say other than what I said before :  If the thin layer of impurties proposed by Rogers is correct, then you can forget Radon as a possible explanation.  And if we believe Rogers analyses of the colored fibers, the structure of those fibers doesn’t allowed any kind of energetic radiation as a possible explanation for the image formation.  I believe Rogers’ conclusions about this because he was definately the best expert who ever analysed the Shroud image in deep at first hand.\n\n","date":"May 24, 2013 at 10:42 am","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34624","author":"Yannick Clément","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"David # 10 etc. I don’t believe you leave your brain at the church door before entering for Mass. Surely you will agree that being Christian is not synonymous with being irrational. No one needs to read Jung to know that. And, again, the need arises to ask: What if there was no Turin Shroud? Would that signify that Dawkins, Harris, Pinker and the rest are right and having faith means being irrational?\nWe are led to the Jospice Mattress once again in this discussion, so one is obliged to say that you yourself have described your impressions about what you think about the TS. Now you have to say what you think about the process that generated the Jospice M. Imprint. Only don’t come with that old story about bilirubin…\n\n","date":"May 23, 2013 at 7:03 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34521","author":"Louis","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"Now, about that mattress from the hospice.\nIt’s a plastic cover for the mattress, let us be clear, not a linen cloth. This is important because components from the plastic( especially dye) react with other chemical components more easy than linen would. \nI don’t know how was it produced and it is connected to death, but plastic can and will react with chemical substances..\nI witnessed something resembling this myself. I used to work in the pediatric intensive care unit and we were treating kids a lot of kids with different poisonings. Well, there were some admitted with intoxication by antihelmintal products for the big animals and those were deadly – kids were dying from acute liver failure and nothing could be done ( no liver transplants existed).\none of the patients (2 years old) was admitted and he needed the central line placement for fluid resuscitation. This was usually done in a separate room, since anesthesia needed to be provided and the procedure required sterile equipment.\nAfter the procedure, when the kid was taken to his bed from the OR table, the plastic blue cover of the OR table had bright discoloration in a form of contours of the child’s body as he was lying there…. he wasn’t dying at the moment, he passed away several days later, but the chemical reactions in his body and perspiration from the skin produced such a reaction on a plastic cover. He was not laying on the bare plastic, there was a thin cotton sheet, but the chemical reaction was so strong that it just went through the cotton.\nThere were no visible manifestations then – it was basically upon admission, so the child was yet in very stable condition and even conscious.\n\n","date":"May 23, 2013 at 8:57 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34541","author":"jesterof","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"Fascinating and tragic anecdote! Where did this occur and what large venomous animals were common there.\n\n","date":"May 23, 2013 at 9:05 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34543","author":"looneytombs","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"#27 See the article entitled “Can the Jospice Mattress Imprint be compared to the Image on the Shroud?” on the HSG website, particularly the part where the image penetrated the pillow, with no plastic involved.\n\n","date":"May 23, 2013 at 9:21 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34547","author":"Louis","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"\nlooneytombs :\nFascinating and tragic anecdote! Where did this occur and what large venomous animals were common there.\n\nit was ~ 15 years ago in Eastern Europe. Animals have nothing to do with this and they weren’t venomous at all, quite to the contrary – those were cows.\n But animals have parasites called helminths in their digestive tracts( people do, too). To kill those parasites the veterinary pharmacies were distributing some chemicals in the form of big tablets. Parents not being careful were leaving those tablets in the reach of children and those were often chewing them ( at least 1-2 kid per year for a ~ 3 million population).\n\n","date":"May 23, 2013 at 10:29 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34552","author":"jesterof","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"Sorry I missed that distinction in the original post. Accidental poisoning is no less heartbreaking of course.\n\n","date":"May 24, 2013 at 10:52 am","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34629","author":"looneytombs","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"\nLouis :\n#27 See the article entitled “Can the Jospice Mattress Imprint be compared to the Image on the Shroud?” on the HSG website, particularly the part where the image penetrated the\npillow, with no plastic involved.\n\nI searched the web on the issue – the image was on a plastic(or nylon which is still not linen) mattress cover. So there was a synthetic cover involved.\nYes, it did penetrate through the pillow.\nhttp://www.shroud.com/pdfs/mattress.pdf\n\n","date":"May 23, 2013 at 10:34 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34553","author":"jesterof","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"Just to add – the mattress cover IS NOT a sheet over the mattress – it is a special plastic or nylon or other synthetic shield to protect the mattress from bodily fluids. The sheet goes on top of the cover.\nIt HAS to be plastic in order not to wet the mattresses.\n\n","date":"May 23, 2013 at 10:38 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34555","author":"jesterof","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"Re the TS image formation process: wetness, watery solution and drying out are key words along with cloth-to-body back and front tight pressure/compression, cloth-to-body back and front pressure/compression slight release, collimation, external heating source as thermal energy (+maybe  internal heating source in terms of hyperthermia), shrouds (in the plural form) and stiff rigid body wrapped up in extra height. It shall be studied in the light of a Second Temple Judean burial, the Gospels, Judea desert dust and ancient textiles, which means besides body fluids other substances are involved. Plastic or nylon were still to be invented at the time of the TS Man’s burial.\n\n","date":"May 24, 2013 at 5:51 am","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34577","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"In other words, a naturalistic-ritualistic theory to explain the Turin Shroud shall take over.\n\n","date":"May 24, 2013 at 5:58 am","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34580","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"\njesterof :\nMay I ask an uneducated( from Shroudology point) question here? :-)\nCan anybody explain to me why are some substances singled out – lactate, or urea, or anything else. Human blood is full of carbohydrate complexes and it is also full of proteins, amino acids, fats and metabolites of all of  those. It is a milieu of different substances and substrates which all can produce the reaction of caramelization or else. Given the stress the tortured Man of the Shroud was subjected to one can also assume that the level of plain glucose ( and fructose) in His blood was also very high. Plus the levels of hormones and their metabolites etc.\nThe pH, the electrolyte content was also out of the wack and those factors also can contribute to the possibility of different types of reactions.\nSo why are the researchers singling out ONE ( or two-three) substances for their hypothesis? I’ve seen that already in the “blood threads” and it is continuing here as well.\n\nI’ll offer a few my own thoughts, but not sure I quite understand all of this.\nI believe certain substances tend to be singled out because 1) some data exists regarding their presence or absence-as the Shroud data set is relatively limited, so to speak, that is, in the past, not ongoing, these are the results that exist and the ones that tend to be talked about and 2) people tend to discuss what they are most interested in.  \nNot sure exactly what is meant by “high levels of plain glucose (and fructose) in HIs blood”.  Not that it couldn’t be high, just wondering where this would fit in.  \nThe Maillard reaction, as I’m sure you know, occurs between an amine group and a reducing sugar (carbohydrate).  Relative to the Shroud, the carbohydrates are believed to be present on the cloth, more specifically on the surface originating from starch residue or one of the glycosides (Saponin products).  It sound as though you are suggesting that the carmelization reaction might be taking place within the blood (high glucose, fructose) and then diffusing out to be deposited on the Shroud?  That it is independent of a direct reaction with the carbohydrates on the cloth?\nOf course there are many amine-containing compounds in the body, but the discussion typically focuses on volatile substances that are existing/produced at/immediately after the time of death.  I don’t think certain ones are intentionally preferentially excluded relative to others-not really sure what is meant by a”possibility of different types of reactions”-are you referring to other than the Maillard reaction here (that could diffuse out and react with the cloth, resulting in conjugated double bonds?), or the Maillard reaction involving amines + reducing sugars in the blood? Are all of the different substances and substrates in the milleu volatile and would diffuse out similar to those that are typically discussed?   Just trying to understand what you mean.\n\n","date":"May 24, 2013 at 9:16 am","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34611","author":"Kelly Kearse","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"Thank you, Kelly.\nWhen a person is under the stress the release of epinephrine leads to subsequent breakdown of the glucose storage – the body uses glucose ( a carbohydrate which can be used in the Maillard reaction) as a fuel and upon stress will use everything availale.\nSo just the high amount of glucose in the blood might serve as a substrate for the Maillard reaction, not necessarily lactate, which will be there, as a result of rhabdomyolysis and tissue hypoxia.\nWhy does the discussion center only on volatile substances created after death is my main objection – all substances available should be taken into consideration, not just postmortem volatile ones\n\n","date":"May 24, 2013 at 10:00 am","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34621","author":"jesterof","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"Precisely, in his point 3, Rogers considered gas diffusion AND direct contact. Different reactants must be considered, limited wound patterns illustrate a contact mechanism.\nThe discussion focuses on gas diffusion because the distant mechanism and its resolution is what gives the image its 3D properties.\n\n","date":"May 25, 2013 at 4:36 am","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34705","author":"anoxie","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"“The Maillard reaction, as I’m sure you know, occurs between an amine group and a reducing sugar (carbohydrate). Relative to the Shroud, the carbohydrates are believed to be present on the cloth, more specifically on the surface originating from starch residue or one of the glycosides (Saponin products). It sound as though you are suggesting that the carmelization reaction might be taking place within the blood (high glucose, fructose) and then diffusing out to be deposited on the Shroud? That it is independent of a direct reaction with the carbohydrates on the cloth?”\ncaramelization reaction is not going in the blood, it is using the products from the blood, which soaked the cloth. as blood here I mean not only red thick fluid, because all the products will be in plasma, sweat, tears and other bodily fluids which were in excess on the body, so the cloth could have been soaked with them easily.\nThere is no need to have saponaria at all.\n\n","date":"May 24, 2013 at 10:50 am","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34628","author":"jesterof","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"Louis #27 See the article entitled “Can the Jospice Mattress Imprint be compared to the Image on the Shroud?” on the HSG website, particularly the part where the image penetrated the pillow, with no plastic involved.\nJesterof: I searched the web on the issue – the image was on a plastic(or nylon which is still not linen) mattress cover. So there was a synthetic cover involved.\nYes, it did penetrate through the pillow.\nhttp://www.shroud.com/pdfs/mattress.pdf\njesterof\nMay 23, 2013 at 10:38 pm | #32\nReply | Quote\nJust to add – the mattress cover IS NOT a sheet over the mattress – it is a special plastic or nylon or other synthetic shield to protect the mattress from bodily fluids. The sheet goes on top of the cover.\nIt HAS to be plastic in order not to wet the mattresses.77\nReply: It is quite clear that the reference was to the article “Can the Jospice Mattress Imprint be compared to the Image on the Shroud?”,pdf on the HOLY SHROUD GUILD website, not the one on shroud.com.  \nThe reference to the wrong article had led to the discussion going off the track. The emphasis is on what can be observed: the moving head imprinted itself on the mattress THROUGH THE PILLOW, there having been NO CONTACT WITH THE POLYPROPYLENE (PLASTIC) MATTRESS. Therefore it can be said that no bilirubin and no plastic was involved in this case, paving he way to attribute the phenomenon to psycho-physical energy, or telergy.\n\n","date":"May 24, 2013 at 10:52 am","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34630","author":"Louis","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"Jesterof wrote: “There is no need to have saponaria at all.” Right. Waters of the Red Heifer mixed with sebum residues can also make up for it.\n\n","date":"May 24, 2013 at 11:08 am","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34634","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"Louis, it does not matter was there a direct contact or not. The cover is plastic. In the case I’ve observed there were no direct conatact as well – there were sheets, some special bumping under the shoulders of the child ( not a pillow, more like a towe, bumping needed for the positioning for central line placementl) and still the contours were not interrupted, which means the vapors from the skin of the child were so strong, they penetrated the sheets and towel ( and a pillow in a jospice case) without a problem.\nYou article does state that the mattress cover was nylon ( which is synthetic material) as well. \nIf I hear “bilirubin” one more time – I’lll scream :-) What does bilirubin have to do here? Maybe it is amines evaporating through the skin, and reacting with the plastic causes the reaction?\nThe point is – you can not compare linen cloth to the plastic, but plastic is a very good way to demonstrate that chemical reactions from the evaporating substances the body produces ( during life or postmortem) with the substances on the covers can produce an image\n\n","date":"May 24, 2013 at 11:08 am","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34635","author":"jesterof","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"Jesterof, The discussion is going off the track again.\nYou said that imprints can be formed on plastic because you saw such things in a hospital, so that is OK. My point is that the Jospice Mattress Imprint is not similar to what you have seen and in fact what has been stressed (in my article) is that which Father Francis O’Leary found difficult to explain and also what the BBC team neglected to take into account. And what is that? How was the the head image imprinted on the mattress by penetrating the pillow. The point is that plastic (brought into the discussion by you) and bilirubin (brought into the discussion by the author of the first article you read, and by two prominent bloggers here), have nothing to do with the imprint formation in this case, so if you want to scream, go ahead, but not at me — at them.\nThere is an easy way to avoid screaming. As you are a newcomer on the scene, read the literature on the topic available on the Internet to be able able to understand what exactly the discussion is about and then come to your conclusions. OK?\n\n","date":"May 24, 2013 at 11:50 am","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34636","author":"Louis","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"\nLouis :\nJesterof, The discussion is going off the track again.\nYou said that imprints can be formed on plastic because you saw such things in a hospital, so that is OK. My point is that the Jospice Mattress Imprint is not similar to what you have seen and in fact what has been stressed (in my article) is that which Father Francis O’Leary found difficult to explain and also what the BBC team neglected to take into account. And what is that? How was the the head image imprinted on the mattress by penetrating the pillow. The point is that plastic (brought into the discussion by you) and bilirubin (brought into the discussion by the author of the first article you read, and by two prominent bloggers here), have nothing to do with the imprint formation in this case, so if you want to scream, go ahead, but not at me — at them.\nThere is an easy way to avoid screaming. As you are a newcomer on the scene, read the literature on the topic available on the Internet to be able able to understand what exactly the discussion is about and then come to your conclusions. OK?\n\nLouis, I think we are talking in parallel here. The possibility of the imprint on the plastic cover of the mattress might be connected to any of the compounds in the body, which the body can perspirate. Making it through the pillow does not seem anything special for me as I have seen the similar type of reaction and it is not impossible, neither has it  to be connected to any supernatural phenomena. Singling out bilirubin is only because the same compound was previously singled out in connection with th Shroud( IMHO). Bilirubin is neither stable, nor is it very reactive with other media, so making it the main compound is not the best way to explain the imprints.\nBut the body is producing not only bilirubin and in a failing state there are many more aggressive compounds found in the plasma as well. Maybe it was bilirubin, maybe it was not, but the possibility of chemical reaction and leaving traces on covers is not supernatural even if it is penetrating through the pillow or tightly rolled up towel and sheets.\noh, and one more thing – being here a long time does not make a blogger infallible in their opinion. Including bilirubin :-)\n\n","date":"May 24, 2013 at 12:59 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34641","author":"jesterof","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"Because of a known process called the evaporation-concentration phenomenon that occurs during the drying of the final cloth in open air.  Rogers talked about that in his book…\n\n","date":"May 24, 2013 at 1:00 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34642","author":"Yannick Clément","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"\nOkay, I see, but I am unsure as to how the reaction would be so uniformly restricted to the very superficial, top portion of the microfibers if the cloth was soaked with them.\n\nThat is totally the other question. And that is something which is unique to the Shroud and has nothing to do with the jospice cover0\n\n","date":"May 24, 2013 at 1:01 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34643","author":"jesterof","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"Jason, you wrote: “Jesus surely was provided with clothing supernaturally after the resurrection, instead of having to leave the tomb naked and having to find clothing somewhere, it makes sense for him to be removed from his burial cloths in a similar manner.” Really? \nReminder: Second Temple period gardeners used to wear a sindon (or achiton/hemation) next to the skin as workwear…  Hence Yeshua’ long (inner) burial or sindon was not even left behind in the cave tomb as most likely he was draped in it when he appeared to Mary of Magdalene. Augustine of Hippo’s exegesis is also a clue to a better understanding of the famous scene. Unfortunately, the exegesis bias came in with John Chrysostom who most probably saw the shroud and included it into the empty tomb scene for liturgical purpose.\n\n","date":"May 24, 2013 at 1:35 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34646","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"Max Patrick Hamon,\nI don’t know much about the clothing of ancient Jewish gardeners. But when John 20 refers to “the linen wrappings” remaining in the tomb, the more natural reading seems to be to see the passage as referring to all of the wrappings, not just some. And I’ve tended to think of Jesus’ post-resurrection clothing as more extensive than what you seem to be suggesting, perhaps including some sort of head covering. That would help explain why some people didn’t recognize him. That’s not much of an argument, but I think it carries a little weight.\nWe don’t have much to go by here. You could be right.\nIf you are right, then I’d just shift my illustration from the risen Jesus to somebody else. The angels God sometimes sends to earth in the Bible, for example, seem to be supernaturally provided with clothing. When angels visit earth in human form, it’s doubtful that they had to go search for clothing. It would have been provided for them in some supernatural manner, I would think. The same seems likely with the risen saints in Matthew 27:52-53.\n\n","date":"May 24, 2013 at 9:55 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34694","author":"Jason Engwer","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"Jason, as a cryptologist, I did study Yeshu’a’s trial, violent death, burial and post-mortem apparitions. \nHere is roughly my personal exegesis re “the gardener”: Second Temple period gardeners used to wear  a sindon next to the skin or inner cloth as workwear. They were hairless (beardless, moustacheless and partially or totally bald  so as to be easily recognizable by priests for the sake of keeping the latter’s ritual cleanliness as gardeners used to be in contact with manure (cf Joachim Jeremias, Jerusalem zur Zeit Jesu, 1923).\nNow most likely Yeshua’s post-psychologically-and-physically-traumatic-death physical resuscitation/Resurrection could have resulted in acute alopecia/hairloss (or alopecia universalis or alopecia areata universalis as autoimmune disorder). \nThe two put together within the context of a garden cave tomb could account for Mary of Magdalene with her eyes full of tears mistaking him for the gardener as he appeared in bright sunlight. If Yeshua used to wear long hair, beard and moustache that could explain the reason why not only Mary Magadalene but also several other disciples  just were not able to recognize him (he might well have  grown hair again afterwards).\n\n","date":"May 25, 2013 at 12:08 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34751","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"Re  clothing Yeshua was wearing on that morning, you wrote: “It (clothing) would have been provided for them angels) in some supernatural manner, I would think. The same seems likely with the risen saints in Matthew 27:52-53.”\nI already gave my personal exegesis of Matthew on this very blog. Most obviously you are totally off the mark. Put everything to the test…\n\n","date":"May 25, 2013 at 12:31 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34755","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"Jason, you should study Yeshua’s hemation/sindon Byzantine and Medieval iconography in conjunction with the empty tomb scene, Yeshua’s descension to hell to free those held captive by sin and ascension to heaven.\n\n","date":"May 24, 2013 at 1:45 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34648","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"+ Yeshua’s apparition to Mary Magdalene on ‘that morning’ of course.\n\n","date":"May 24, 2013 at 1:47 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34649","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"Hullo Jesterof\nIt was not me but Father O’Leary who appeared to be talking about supernatural phenomena and my approach had everything to do with the paranormal, as you should have gauged from the article I wrote.\nYour hospital experience makes you a welcome addition to the scene, however you would need to provide photographs to substantiate your statement that you have seen head images making it through  pillows to be  imprinted on mattresses. If you do have such things my suggestion is that you write a paper and make it available for consideration.\nBest.\n\n","date":"May 24, 2013 at 1:51 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34650","author":"Louis","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"\nYannick Clément :\nBecause of a known process called the evaporation-concentration phenomenon that occurs during the drying of the final cloth in open air.  Rogers talked about that in his book…\n\nI think you might be confusing things here.  This isn’t talking about treatment of the final cloth with Saponaria and drying in air, which leaves a thin film of carbohydrate residues on the surface-that’s what Rogers referenced in his book.  This proposal is suggesting that ALL of the substances necessary for the Maillard reaction originate from the blood/bodily fluids and simply soak into the cloth.  In Roger’s model, the body provided the amino reactants, which, in turn, reacted with the glycosidic residues coated onto the surface of the cloth.\n\n","date":"May 24, 2013 at 1:51 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34651","author":"Kelly Kearse","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"I don’t know if I’m off-track because I can’t retrace your previous post, so I can’t read again what you said!  Anyway, if we’re talking about Rogers hypothesis, he never wrote that the reacting substance had soak through the cloth in liquid form since he thought it was just post-mortem gases.  And since, in his mind, the chromophore of the image was ONLY a thin layer of impurities that were concentrated on the 2 surfaces of the cloth because of the drying in open air of the final cloth, this would explain very well why the image is only present at the top-most surface of the cloth (and maybe also on the back side of the cloth for the hair, beard and mustache).  But maybe you were talking about another hypothesis related to a Maillard reaction?  As I say, I cannot retrace your previous post!  One thing’s for sure:  There is nothing that I’m aware of in Rogers hypothesis that has been totally discarded since by some credible scientists…  Every points of Roger hypothesis are still valid, theoritically.\n\n","date":"May 24, 2013 at 3:43 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34661","author":"Yannick Clément","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"\nLouis :\nHullo Jesterof\nIt was not me but Father O’Leary who appeared to be talking about supernatural\nphenomena and my approach had everything to do with the paranormal, as you should have gauged from the article I wrote.\n\nI understand. I read about the mattress cover a while ago and recalled the incident with the child while reading it.\nIt might have been supernatural( I mean the mattress cover imprint).\nI simply think that before executing that argument one has to go through all other possibilities.\nI have more important things to do than writing a paper on a possibility of something happening more than 15 years ago. :-)\nWe are just discussing the different phenomena and it is only natural that something seemingly supernatural to one person might seem totally normal to the other.\nOn the issue of the image making it through the pillow – it is not the image which makes it through the pillow, but vapors. If you never have experienced anything pungent like formalin or ammonia, it will be difficult to explain that vaporized substances can penetrate a lot of covers. I mentioned those two because they are pungent and one can smell them even with a lot of covers over one’s face, but others can penetrate through different layers as well.\nThat’s why I do not see anything unusual with the possibility of vaporized substances slowly penetrating through the pillow to chemically react with the mattress cover.\n\n","date":"May 24, 2013 at 5:24 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34676","author":"jesterof","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"Jesterof # 56\nIt might have been supernatural( I mean the mattress cover imprint).\nI simply think that before executing that argument one has to go through all other possibilities.\nOn the issue of the image making it through the pillow – it is not the image which makes it through the pillow, but vapors. If you never have experienced anything pungent like formalin or ammonia, it will be difficult to explain that vaporized substances can penetrate a lot of covers. I mentioned those two because they are pungent and one can smell them even with a lot of covers over one’s face, but others can penetrate through different layers as well.\nThat’s why I do not see anything unusual with the possibility of vaporized substances slowly penetrating through the pillow to chemically react with the mattress cover.\n__________________________________________\nJesterof\nThe supernatural explanation was the original hypothesis proposed, but not by the Church, however it was apparently not taken seriously. As you know by now, one paper attributed the phenomenon to bilirubin, another one to something to do with physics, but with spiritualist connotations, while my own paper dwelt on paranormal phenomena, based to a certain extent on the experiments made by Ochorowicz.and other studies.\nIt is easy to understand what you are saying, the only problem being that there is no evidence of vaporized substances emanating from the body (including the head) to form the imprint. Given the report about the events leading to the imprint, including psychological processes, the psychophysical explanation is very likely, and that is the reason why paranormal phenomena have to be considered. If you have read enough of Freud you must have noticed that even he did have interest in psi and wrote an essay on the topic and this appears to have been prompted by personal experience. Many of his files are still not unavailable and there is the possibility that he might have realised that Jung was right up to a certain point but hesitated to admit this on account of his having previously told the Swiss psychologist to stop dabbling in the occult!     \nUnfortunately parapsychology is often dismissed as humbug, although it is recognised by the UN, and the fact that genuine parapsychological phenomena are spontaneous, and as a result can not be tested in a laboratory, is taken as ammunition by sceptics to poke fun at those who come with well-based propositions. Another mistake has been to confuse Parapsychology with Spiritualism. Parapsychology is neutral.\n\n","date":"May 25, 2013 at 9:28 am","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34730","author":"Louis","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"\njesterof :\nThank you, Kelly.\nWhen a person is under the stress the release of epinephrine leads to subsequent breakdown of the glucose storage – the body uses glucose ( a carbohydrate which can be used in the Maillard reaction) as a fuel and upon stress will use everything availale.\nSo just the high amount of glucose in the blood might serve as a substrate for the Maillard reaction, not necessarily lactate, which will be there, as a result of rhabdomyolysis and tissue hypoxia.\nWhy does the discussion center only on volatile substances created after death is my main objection – all substances available should be taken into consideration, not just postmortem volatile onesanoxie :\nPrecisely, in his point 3, Rogers considered gas diffusion AND direct contact. Different reactants must be considered, limited wound patterns illustrate a contact mechanism.\nThe discussion focuses on gas diffusion because the distant mechanism and its resolution is what gives the image its 3D properties.\n\nI agree with both of you in that: all substances available should be considered and both contact and diffusion should be considered.  \nHere’s the part I would like some help with to understand more fully: the mention of glucose (or fructose) in the blood, or participation of other reducing sugars from bodily fluids in the Maillard reaction -> image formation.\nThis is not meant to be a badgering exercise, would earnestly like to know how this would work.  \nIt is believed that the cloth was bleached, treated with starch paste, then washed in Saponaria, and laid out to dry.  Rogers has suggested this combination resulted in a coating of starch & Saponaria residues on the surface.  I am away from the book right now, but if memory serves correctly, there are 4-6 glycosidic products of Saponaria, none of which are amino-containing sugars.  The soaking, etc. of the cloth leaves a fine coating of carbohydrate residues at the surface, a type of Scotch guard, if you will, or we could call it Shroud guard.\nThe residue hypothesis (Scotch/Shroud guard) has always had a certain appeal to me because, in my thinking, it helps provide a means of uniformity throughout the cloth, for the ventral & dorsal image in the Maillard reaction scenario.  \njesterof, you mentioned previously that there is no need for Saponaria at all.  Can you help me to understand how this might work-are you suggesting that the carbohydrate contribution of the Maiilard reaction is not coming from any residue left on the cloth, but rather, from blood components that have soaked into the cloth, and that amino groups from bodily compounds (any you wish to consider, the list can be long) are reacting with these?  Any role at all for starch treatment here?  Where do the glucose/fructose (other reducing sugars) from the body fit in?\nCan you give me some insight about the free glucose/fructose regarding:\nHow would this work for portions of the cloth that are not in contact with the body?\nWould such soaking in of products be equivalent/relatively uniform throughout the cloth? \nControversial, etc., but if the body had been washed, could this still work? \nHow would this apply to the image being restricted to the superficial portion of the cloth?\nWould appreciate any thoughts/comments.\nThanks for your time\n\n","date":"May 25, 2013 at 9:57 am","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34733","author":"Kelly Kearse","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"\ndaveb of wellington nz :\nYC is entitled to his views that radon is not part of the solution. However there remains a gaseous diffusion problem in a purely chemical explanation. Clearly there has to be some kind of collimation mechanism on the gaseous particles to produce such a reasonably well-defined image. Radon with its alpha particles, and possibly the subsequent gamma radiation from its decay products, may have been part of that mechanism. They would be fairly small quantities and would not necessarily have a strong penetrating effect on the cloth. The answer might well be revealed in due time, possibly sooner than he imagines. Perhaps YC’s main objection to the possible role of radon, is because it did not occur to his hero. The plain fact is that no-one has ever produced a persuasive image experiment by Maillard alone!\n\ndaveb,\nI’d also like to hear more about how the radon idea would work.  Can you help me out with this one?  \nThe body is in the tomb, on a slab or stone niche in the wall, wrapped in the Shroud, an earthquake occurs, radon is produced, can you pick it up from there for me, especially as related to:\nIs the radon solely external to the cloth and then diffuses in? \nHow would this work for portions of the body that are in contact with the cloth, particularly the back of the shoulders, buttocks that are pressed down onto the cloth?\nAlpha particles are relatively weak, yet didn’t Rogers object to the idea of any type of radiation because even alpha emitters show characteristic track patterns among fibers, which were not observed in samples taken from the Shroud (I think I have this correct)?\nIn the radon scenario, would any detectable, relatively stable products (isotopes) be created (on the cloth, surrounding areas-rock, rock walls, etc.)? \nWould appreciate any thought/comments.\nThanks for your time.\n\n","date":"May 25, 2013 at 10:21 am","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34738","author":"Kelly Kearse","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"The problem with all these theories about gaseous diffusion, Maillard reaction and what more is that they simple do not explain the image, as David said. Rogers may have been a good scientist, but there was one problem, and that was what appears to have been an aversion to anything that smacked of the supernatural. There was lack of objectivity at times, as in the case of one paper he co-authored on evolution, giving the reader to understand that it was some sort of automatic process, with no rationality involved. It is doubtful that even a sceptic as well known as Spinoza(!) would have agreed with such a view.  \nRadon had already been proposed by one Shroud scientist ( see the interview-article, “Science and Religion meet in Shroud research” on the Holy Shroud Guild website by clicking on documents) and Barrie’s timely explanation about what exactly Rogers thought about Maillard is a very useful tip.\n\n","date":"May 25, 2013 at 11:09 am","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34743","author":"Louis","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"2 Kelly Kearse\nThe blood and plasma rich in glucose/fructose in high concentration will make the other bodily fluids contain them as well – one can assume that the body is basically wet with “sweet” fluids. If it was covered with the linen tightly first, it might have been soaked with high-glucose concentration bodily fluids. This, however, does not explain uniformity of the image being only very superficial.\n\n","date":"May 25, 2013 at 11:24 am","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34746","author":"jesterof","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"The superficiality of the image (if it’s depth is the same all over the Shroud) makes naturalistic explanation extremely difficult\n\n","date":"May 25, 2013 at 11:27 am","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34748","author":"jesterof","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"In fact, it’s all the contrary…  Read carefully Rogers explanation concerning the superficial nature of the image and when you also consider the stochastic (discontinuous, non-homogeneous and unpredictable) distribution of colored fibers in the image areas and the fact that the crystalline structure of a colored fiber doesn’t show any more damage than a non-colored fiber, any credible and UNBIASED (that’s the most important word here) scientist will tell you that there is only a VERY MILD PROCESS that can achieve such a result.  For example, any form of energetic radiation (including a burst of UV light) is too strong to yield a result like that.  On the contrary, a low-temperature chemical process (Maillard reaction for example) and/or thermal radiation coming from the fresh body can theoretically produce such a result IF, AND ONLY IF, the linen cloth have been manufactured with an ancient method that would left a very thin film of carbohydrate impurities on the two surfaces (which is probably the kind of method that was used to make the Shroud of Turin).\nSorry but when it comes to find the best sort of hypothesis to explain the image (whether it’s a natural one, an artistic one or a supernatural one related to a burst of energy at the time of Resurrection), you must consider ALL THE PERTINENT DATA AND OBSERVATION coming from the Shroud and not only picking those that can confort your preconcieve ideas.  In his book, Rogers is very clear about that and this is at the heart of the good scientific method.\n\n","date":"May 25, 2013 at 2:03 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34766","author":"Yannick Clément","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"Yannick, that is not what I meant. If one considers cloth to have only superficial film of carbohydrate due to pretreatment of the cloth – the image formation on that superficial film might be explained ( plus-minus) by chemical or waveform reactions – since the reagent is superficial the image can’t be deeper than that is spread of the reacting medium.\nBut if the reacting carbohydrate would be from the body – there is no way it will soak the cloth uniformly everywhere – therefore I actually agreed with Kelly Kearse on his objection.\nBut one has to take into consideration that the cloth was not around the body inflated like a balloon( or was it? ;-)  )  with the even distance from the body parts and without any interruption of it’s surface when the reaction was evolving, it was wrapped and therefore creases, folds, bumps even of the uniformly impregnated cloth should have a difference of the depth of image formation due to the physical obstacles on the way of gases or other particles\n Unless as I said, the cloth formed a balloon around the body at the moment of image formation and then it HAS TO be connected to the Resurrection\n\n","date":"May 25, 2013 at 6:05 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34784","author":"jesterof","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"Jesterof,\nOk-thanks\n\n","date":"May 25, 2013 at 1:37 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34764","author":"Kelly Kearse","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"I have experimented quite extensively with evaporation concentration, and have never achieved the wholly superficial “few-fibres-only” effect demonstrated in Rogers’s “Frequently Asked Questions” (on shroud.com). His own picture of a Maillard reaction on the upper surface of an ‘evaporation-concentrated’ cloth looks nothing like it, and not much like the image on the shroud. The darkest parts of his reaction are in the creases between the threads, where, because of the evaporation concentration funnily enough, much of the solute has ended up. This is very different from the shroud image.\n\n","date":"May 25, 2013 at 6:12 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34787","author":"Hugh Farey","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"Incredible how people don’t want to see the reality…  The evaporation-concentration phenomenon is well known in science.  In his book, Rogers specifically wrote that he succeed to achieve a very good concentration with a food dye.  He tested the phenomenon, and it works all right, removing almost all the blue dye from inside the threads and concentrating it on the top-surface on each side of his sample of cloth.  Also, the coloration result he obtained after he baked a linen sample (made with the ancient method) that was in contact for some time with ammonia gas is probably the most similar result of coloration ever obtained by a scientist versus the image on the Shroud.  Rogers was very specific when he reported the result that the nature of the coloration he obtained (this was a stain and nothing close to a body image) was very close to what he did see in the image area.  Remember folks that Rogers, unlike you and me, have seen the image directly in Turin at a very close range.  Don’t you think that if he said the coloration he obtained was very close to what’s on the Shroud, that surely mean that IT’S TRUE???  Or else, you’re meaning that Rogers was a liar…\n\n","date":"May 25, 2013 at 6:32 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34788","author":"Yannick Clément","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"Yannick Clement : Rogers was very specific when he reported the result that the nature of the coloration he obtained (this was a stain and nothing close to a body image) was very close to what he did see in the image area. \nThat is THE MOST important part of the statement – this was a stain and nothing close to the body image!\nOne can achieve stains in experiment but we have yet to see the uniform image not from the body – just from the angled object with the uniform depth of coloration not dependent on turns, angles and bumps of the object\n\n","date":"May 25, 2013 at 8:22 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34809","author":"jesterof","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"“UNBIASED-that’s the most important word here”\nAnd this, of course, is itself not an overly biased response?\nAnd it is certainly not biased to ridicule anyone  who chooses to be open to any other possibilities-if they do, they must not be credible.  Their scientific integrity must certainly be questioned.\nI believe the Shroud could have been formed by totally natural means, but I don’t think it had to be.  I also believe the Shroud could have been formed by supernatural means, but I don’t think it had to be.  I don’t know one way or the other-I could see it either way.  So I ask a lot of questions. I’d like to learn more about it.  I try to keep the questions relatively focused. \nI also am willing to consider the possibility that the Shroud could be a fake.  I don’t think it is, but for me the possibility still exists.  I think it’s a small one, but still there.  Dan Porter has expressed the belief I hold to perfectly: Is the Shroud real?  Probably.\nThere is a lot of talk about what good and honest science is, but it is framed in a very defensive manner-as if anyone who raises questions to deepen their understanding or has an alternative opinion must not be honest or must be biased.  This is telling of someone who themself has a very small and relatively limited comfort zone, and therefore must set everyone else straight.  Good and honest science?  Good and honest science does not mandate that all contrary opinions are, of course, foolish. \n The good scientific method?  At the heart of the good scientific method is objectivity.  Trying to view & understand the data from as many angles as possible.  Even first year science students recognize the value of the illustration of blind men describing what an elephant is.  Those who grab the trunk swear it’s long, relatively thin, and wriggles about, like a snake.  Those who grab the leg argue it’s round and thick like a tree, and hardly moves at all.\n Discard objectivity and you’ll move further & further away from what good & honest science really is.  If someone believes differently, consider that they may be at least of limited intelligence, it’s possible that you might learn something.  The  continuous need to proselytize one’s viewpoint at the expense of devaluing all other ideas is a sign of insecurity.  There is no single theory that explains image formation-they all have their issues.  But I believe all should be respected, even if one completely disagrees.\n\n","date":"May 25, 2013 at 7:43 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34805","author":"Kelly Kearse","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"The problem Mr. Kearse is this:  When someone who pretend to be a real scientist open widely the door to supernatural phenomenons in order to explain something material that still wait to be fully explained (as you do obviously), that’s exactly when I become somewhat furious, especially when this touch religion.  As a Catholic believer and someone interested by scientific discoveries, I know that when a scientist goes on to mix both domains, he enter in a very dangerous zone and I don’t think this kind of thinking is even worthy of a scientist…  Everytime this situation occurred, it’s evident that the independence of mind that any scientist should have on a subject like the supposed Shroud of Christ just go away.  In fact, science is no place to back-up religious concepts.  \nI think you should read again what Rogers had to say about that in the first portion of his great book.  Remember that Rogers was as pissed off as me when he saw so-called scientist becoming some kind of religious alchemists in face of the Shroud!\nYour religious faith obviously leads you to open the door widely to the possibility that the Resurrection of Christ can have something to do with the image on the Shroud.  After exchanging emails with you and reading many posts of you on the blog, this is evident and you should acknowledge that I’m right about that.  \nI’ll ask you just one question about that:  What kind of totally agnostic or atheist scientist would even think of looking into the supernatural field if we would ask him to find a solution to the image on the cloth?  No one would do this!  Only a faithful scientist could fall into this very dangerous path…  This simple fact show you that this can of supernatural thinking (I also call this “the magical thinking”) is not worthy to be call scientific.  It’s just worthy to be called “religiously driven”.  That’s what I think.\n\n","date":"May 26, 2013 at 8:49 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34952","author":"Yannick Clément","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"My last sentence should read : “This simple fact show you that this KIND of supernatural thinking (I also call this “the magical thinking”) is not worthy to be call scientific. It’s just worthy to be called “religiously driven”. That’s what I think.”\n\n","date":"May 26, 2013 at 8:51 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34955","author":"Yannick Clément","site":"shroudstory"},{"title":"Struggling with Naturalist Explanations","post":"Well we’ve all got pieces of cloth, and many of us have got food dye. If that’s all we need to demonstrate an evaporation-concentration gradient that looks like Rogers’s, let’s go for it. The essence of science is that an experiment is repeatable. I have tried to repeat Roger’s experiment and failed. Has anybody else succeeded, or does the eminence of a scientist (which I don’t dispute for a moment) mean that whatever he does can be taken as Gospel? (Oops!). Of course I don’t think Rogers was a liar, but the physical composition of a weak solution of food dye is very different from a solution of carbohydrate sufficiently strong enough to produce the Maillard coloration of his ‘drops of ammonia’ experiment, and surely nobody thinks that the yellow colouration of the Maillard photograph resembles the blue colouration of the food-dye photograph in any way. Do they?\n\n","date":"May 26, 2013 at 5:11 am","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","id":"comment-34859","author":"Hugh Farey","site":"shroudstory"}]
