[{"title":"Surprising Live Poll on the Shroud of Turin","post":"Those poll results are better than I expected. If 80% think it’s either a holy relic or an unsolved mystery (leaving the door open)… those are phenomenal results IMO.  Shows how the New Atheists may be loud and disruptive but they’re not anywhere close to being a majority. \nOf course, I am “assuming” that the 14% are mostly people who are prejudiced against Christian religion. I might be wrong about that.\n\n","date":"December 23, 2011 at 12:18 pm","url":"https://shroudstory.com/2011/12/23/surprising-live-poll-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-6033","author":"AnnieCee","site":"shroudstory"},{"title":"Surprising Live Poll on the Shroud of Turin","post":"Very surprising indeed. I just wonder about the 3% (none of the above) and what else could they be thinking? \nR.\n\n","date":"December 23, 2011 at 1:44 pm","url":"https://shroudstory.com/2011/12/23/surprising-live-poll-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-6036","author":"Ron","site":"shroudstory"},{"title":"Surprising Live Poll on the Shroud of Turin","post":"Sorry I must add; I’m completely surprised that almost 40% believe the Shroud is a holy relic! …I wouldn’t have quessed that many.\n\n","date":"December 24, 2011 at 8:52 am","url":"https://shroudstory.com/2011/12/23/surprising-live-poll-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-6085","author":"Ron","site":"shroudstory"},{"title":"Surprising Live Poll on the Shroud of Turin","post":"Those results are intersting but it’s important to understand that “Unresolved mystery” doesn’t mean that a supernatural phenomenon created this image.  \nAnd for Di Lazaaro comment, when he wrote : “”By the way, Nickell will be interested to know that using VUV photons we obtained this shallow coloration thickness.”  I would reply this to him :  Rogers obtain also this result with an old fashion piece of linen exposed 10 minutes to ammoniac gas !  You obtained that result by coloring the primary cell wall of a modern fiber.  That’s not the most probable way the coloration was produced on the Shroud of Turin !  The most probable way, despite of what you believe, is that a thin layer of impurity was colored and not the primary cell wall.  Fanti, you and other guys published a paper in 2010 to make believe it was really the primary cell wall that was colored on the Shroud.  That’s very far from being proven even if it was a peer-review paper.  In fact, that was Fanti’s INTERPRETATION.  It was not Rogers interpretation.  To be sure on this issue, it would take some more Shroud samples to analyse chemically to know the real chromophore of the image (the support for the coloration).\nSo, for the moment, your experiment and Rogers experiment produced results very similar.  So, what conclusion can we draw from this ?  That there’s not only UV lights that can produced a surface coloration on linen that is very thin.\nAnd what I want to say about those experiments is this :  Before Di Lazzaro and his team did those experiments, the probability for a medieval fake (the one I once talk about : a guy who would have crucified some person to produce a relic) was about 0.1%  After those experiments, it is STILL 0.1%  \nThose experiments changed nothing at all regarding the possibility of a medieval fake…  It was very low before they were done.  It is still very low today.\nThe problem with this kind of experiment is that it serve to confort BY EXTRAPOLATION the views of those who have an agenda behind the head (and the agenda is this : proving the resurrection with the Shroud).  Here I want to be clear :  I don’t say M. Di Lazzaro fits into that category…  I don’t know him that much, so I can’t tell.  But anyway, that’s not what matter here.  What’s REALLY important here is the word “Extrapolation”.  Those agenda driven people (I don’t name anyone.  They know who they are) take a fact “A” (i.e., that UV lights can color linen close to what we see on the Shroud), then they do an extrapolation “B” (i.e., that the Shroud body images were surely produced by those UV lights), all this in order to produce a conclusion “C” (i.e., that those UV light are a clear PROOF that the Shroud body images are a by product of the resurrection).  In science, using an extrapolation like that is ALWAYS walking into a VERY dangerous zone !  The risk of mistakes is very high when you do this…  Those agenda driven people think that “A” + “B” SURELY = “C”, but that’s wrong !  A lot of times, when you do extrapolations like that “A” + “B” don’t = “C” at all, except in the dreams of those people ! ;-)\nAnd unfortunatelly, in the Shroud world, we see many supposed scientists do extrapolations like that ALL THE TIME !  Again, I don’t want to mention any name but I’m sure those who know the Shroud world enough knows who I’m talking about.  Even more than the present media crazyness, it’s precisely this aspect of the Shroud science that REALLY bugs me.  And I’m not alone.  Even Ray Rogers was pissed off by this kind of pseudo-science !  And I’m sure there’s a lot of people today who still think like Rogers…  But unfortunatelly, those who keep a cool head are normally not the ones who gets the attention of the media.\nThe bottom line is this :  The results of Di Lazzaro and his team just show (and that would be a very good thing that those results can be confirmed by independent researchers) that UV lights can colored a linen surface in a very superficial way, close to what we can see on the Shroud (without penetrate into the cloth).  That’s only one aspect of all the physical and chemical aspects of the Shroud body images.  So, please people, just take the Di Lazzaro’s results for what it really is (i.e., no proof of anything relate to the Shroud beside what I just wrote) and don’t do any EXTRAPOLATION at all from these results.  From my perspective, that’s the proper way to see those results…\n\n","date":"December 23, 2011 at 7:17 pm","url":"https://shroudstory.com/2011/12/23/surprising-live-poll-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-6064","author":"Yannick Clément","site":"shroudstory"},{"title":"Surprising Live Poll on the Shroud of Turin","post":"¡Me resulta muy curioso el empeño de Yannick en que el cuerpo de Jesús de Nazaret sufriera la PUTREFACCION !\nNo es esa la opinión de casi todos los expertos en la Sábana……con la excepción de Rogers, magnífico químico pero poco conocedor de los aspectos medico-forenses.\nLa putrefaccion ( y el desprendimiento de amoniaco es signo de putrefacción) no se inicia hasta la desaparición del rigor mortis (llamada Ley de Brouardel), y la imagen de la Sábana no muestra ningún signo de descomposicion incluida la difusion gaseosa.\nMe parecen muy DESAFORTUNADOS los comentarios sobre Di Lazzaro, Fanti y “other guys”, que incluye entre otros a su “amigo” el Dr. Heimburger, colega mío.\n\n","date":"December 23, 2011 at 11:10 pm","url":"https://shroudstory.com/2011/12/23/surprising-live-poll-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-6069","author":"co","site":"shroudstory"},{"title":"Surprising Live Poll on the Shroud of Turin","post":"Google Translation:\nI find it very curious Yannick commitment that the body of Jesus of Nazareth suffered the ROT!\nThat is not the opinion of most experts on the Shroud … … with the exception of Rogers, great chemistry but little familiar with medical and forensic aspects.\nThe decay (and the release of ammonia is a sign of putrefaction) does not start until the disappearance of rigor mortis (called Brouardel Act), and the image of the Shroud shows no signs of decomposition, including gaseous diffusion.\nI find very unfortunate comments on Di Lazzaro, Fanti and “other guys”, which includes among others, his “friend” Dr. Heimburger, a colleague of mine.\n\n","date":"December 24, 2011 at 7:33 am","url":"https://shroudstory.com/2011/12/23/surprising-live-poll-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-6078","author":"episcopalian","site":"shroudstory"},{"title":"Surprising Live Poll on the Shroud of Turin","post":"In my opinion, this is an agenda driven comment (CO surely believe the images on the Shroud are a by-product of the resurrection and desperately wanted to make believe science can prove that) but I’ll respond to it anyway.\nThibault Heimburger, Di Lazarro and even Fanti are not specialists in chemistry and still, they co-wrote a paper to try to invalidate Rogers opinion on the shroud (particularly about the chromophore for the color) !  I just don’t buy this kind of stuff and I made Thibault aware of it as soon as the paper was published.  \nAnd by the way, were you there inside the tomb ?  How can you be so sure about the fact that in some abnormal conditions (remember that we deal with a tortured and crucified body here), ammonia could not came out of a body before the rotting process ?  And if Jesus died from ASPHYXIA like Barbet and others thought, don’t you think there are more chances from a fast released of ammonia from the lungs before the rotting process took place ???  The body stayed maybe some 36 hours inside the Shroud.  So, how can you be so sure that there was no ammonia at all released ?  Are you a specialist ?  If not, please bring me the scientific paper where it is written.  I’ll wait for this.  Even Thibault wrote a paper about Rogers hypothesis some years ago and found out medical references that proved that a tortured body like Jesus who surely produced a lot a sweating before dying could leave high amounts of urea on his skin.  This urea then could have produced fairly rapidly (maybe after 24 hours or so) a released of some ammoniac gas…  So, you see ?  Ammoniac could have came from inside the body (who can be 100% sure it’s not possible before the rotting process start ?) or from the skin !\nI don’t know how you can be so sure about the fact that there was 0 ammoniac released before the resurrection !  Are you so close-minded to not accept that there’s still some possibilities for this to happen ?  There’s so much data we don’t know about the corpse conditions, the tomb conditions, the environmental conditions, etc.  How can you be so sure that there was no ammoniacal release at all my friend ???  The fact that you’re so sure about something like that make me think that you’re agenda driven a bit.  Excuse me if I’m wrong.\nHere’s what we can read on wikipedia about the decomposition process : “Oxygen present in the body is quickly depleted by the aerobic organisms found within. This creates an ideal environment for the proliferation of anaerobic organisms. Anaerobic organisms, originating in the gastrointestinal tract and respiratory system, begin to transform carbohydrates, lipids, and proteins, to yield organic acids (propionic acid, lactic acid) and gases (methane, hydrogen sulphide, AMMONIA). The process of microbial proliferation within a body is referred to as putrefaction and leads to the second stage of decomposition, known as bloat.”\nYou see ?  It’s not me who wrote that !  Ammonia gas release is a normal part of the very first stage of the decomposition process…  BEFORE THE SECOND STAGE CALLED BLOAT WHERE YOU CAN SEE THE FIRST CLEAR SIGNS OF DECOMPOSITION.  What’s the problem with the possibility that the body of Jesus could have took part of the first stage of decomposition ?  Maybe it hurts your theological concept of the resurrection ?  I remember you once quote the psalm 16 where we can read : “For you will not abandon my soul to Sheol, or let your holy one see corruption.”  Hey, don’t you understand that this particular part of the bible is not an historical fact ???  It’s just an image.  The writer knew that God will not leave him in the void after death.  It was a hope cry !  But for Jesus resurrection, there’s nothing in catholic theology against the possibility that his human body could have experiment the first stage of decomposition before the resurrection…  What’s the problem with this possibility ???  Don’t you believe that Jesus was human like you and me ?  The Shroud is the biggest proof that he had a corpse like you and everyone else !  So, for me, I don’t see one good reason he could not have emit some ammoniac gas before his resurrection that could have happened 36 hours or more after his death !!!  \nHaving said that, I want to state that there’s no proof that Rogers hypothesis is 100% correct regarding the Shroud, but there’s a fairly good possibility that at least some parts of the image could have come from ammonia gas released by the corpse before the resurrection.  Scientifically, I don’t think nobody can be 100% sure that this possibility is completely incorrect…\n\n","date":"December 24, 2011 at 12:11 am","url":"https://shroudstory.com/2011/12/23/surprising-live-poll-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-6071","author":"Yannick Clément","site":"shroudstory"},{"title":"Surprising Live Poll on the Shroud of Turin","post":"We need a forensic expert on here to confirm alot of what has been said, but in saying that I have to agree ‘mostly’ with Yannick on BOTH his comments above. For the second comment the point that ‘hit home’ was the fact that urea could have been present on the body, due to the conditions mentioned. I’ve read this also in some paper. At work we use synthetic ‘urea’, which is exceptionally close to real urea. Anyways in that limited experience, I have to say it ‘will’ effect clothing and has quite an odour. Secondly I must admit, although I don’t believe in the ‘diffusion’ hypothesis, I cannot believe there would be no release of toxins from the body. I think it stems from reason that there would be, even before putrefaction. But one question; wouldn’t traces of this be detected under the microscope?…just wondering.\nR\n\n","date":"December 24, 2011 at 8:00 am","url":"https://shroudstory.com/2011/12/23/surprising-live-poll-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-6081","author":"Ron","site":"shroudstory"},{"title":"Surprising Live Poll on the Shroud of Turin","post":"Forgot to mention, and this is aimed toward CO’s comment; We must remember this body, which the sheet covered, went thru some ‘extreme’ conditions of torture, probably never witnessed by any forensic scientist in our era. The full conditions are ‘unkown’ of the state of the body or of it’s entombment, atleast not ‘completely’. We can only understand so much from an image.\nR\n\n","date":"December 24, 2011 at 8:09 am","url":"https://shroudstory.com/2011/12/23/surprising-live-poll-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-6082","author":"Ron","site":"shroudstory"},{"title":"Surprising Live Poll on the Shroud of Turin","post":"Sorry, also to Co, a question, and please remember I am a complete uberlaymen when it comes to forensic topics! Could it be possible for ‘fumes’ to eminate from the body before the commencement of rot, if conditions are right? ….just wondering, thanks.\nR\n\n","date":"December 24, 2011 at 8:20 am","url":"https://shroudstory.com/2011/12/23/surprising-live-poll-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-6083","author":"Ron","site":"shroudstory"},{"title":"Surprising Live Poll on the Shroud of Turin","post":"Comenté hace días que las elevadas cifras de ácido láctico que se mantienen mientras dura el rigor mortis impiden la proliferación de las bacterias responsables de las primeras fases de la putrefacción.\nLa teoría de los vapores de amoniaco a partir de la UREA contenida en las diversas secreciones, sudor, sangre de las heridas, etc, etc, fue la PRIMERA estudiada durante años por Paul Vignon (biólogo), desde el 1900:\n“Thus M.Vignon´s idea, to which I completely subscribe, is that the body…..was covered with a febrile sweat rich in urea; that the urea formed ammonium carbonate which, in a calm atmosphere, emited vapours more and more diluted as they were farther from the emitting surface;that the shroud was soaked in a emulsion of aloes which became brown under the influence of these alkaline vapours and formed a tint the more intense the nearer this surface; whence the negative image whose characteristics I described before”. Delage 1902.\nPaul Vignon realizó muchos experimentos bajo muy diversas condiciones, las improntas de la imagen tenían graves deformaciones y no habrían resistido el estudio microscópico moderno.\nYa entonces fue rechazada la teoría AMONIACAL por varios especialistas, en base a que los fermentos orgánicos en la superficie del cuerpo serían INSUFICIENTES para transformar la UREA, entre ellos Dezani, profesor de Farmacología de la Universidad de Turín. La presencia de aloe añadiría más obstáculos a la fermentación de la urea.\nOtros muchos han experimentado a lo largo del siglo con muy diversas combinaciones, Judica-Cordiglia, Rodante, Caruso, etc. pero los resultados son similares, graves deformaciones macroscópicas y ninguna semejanza microscópica…… \nAunque se hubiera utilizado en todas esas experiencias lino tratado con Saponaria, los resultados macroscópicos hubieran sido similares.\nRespecto de los microscópicos el propio Rogers admite:\n “However, identification of a probable chemical process does not explain one of the most perplexing observations on the Shroud, the discontinuous distribution of the color on the topmost parts of the weave.”\nSi a ello se añade el que la imagen de la Sábana NO presenta signos de esa difusión gaseosa, sería necesaria una DIFUSION GASEOSA SOBRENATURAL para formar la imagen de la Sábana.\n¿Dónde queda pues el mecanismo NATURAL mantenido por Rogers?\nNo pudiendo explicar la formación de la IMAGEN ni Rogers ni Di Lazzaro, veamos lo que precisan las teorías de ambos para justificar el COLOR:\nRogers :     REACCIÓN DE MAILLARD+CAPA DE IMPUREZAS (residuos de Saponaria) + PUTREFACCIÓN JESÚS \nDi Lazzaro:  RADIACIÓN ULTRAVIOLETA\n…….así que por aquello de seguir la “navaja de Occam” prefiero a Di Lazzaro.\n[Desde el punto de vista teológico la Iglesia Católica NO admitiría la PUTREFACCIÓN del cuerpo de Jesús. Las palabras del Salmo: “…..ni permitirás que tu Santo vea la corrupción” SE HACEN HISTÓRICAS en el discurso de Pedro que es TESTIGO de Jesús resucitado, Hechos: 2, 31-32.]\nFeliz Navidad\n\n","date":"December 24, 2011 at 7:40 pm","url":"https://shroudstory.com/2011/12/23/surprising-live-poll-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-6096","author":"co","site":"shroudstory"},{"title":"Surprising Live Poll on the Shroud of Turin","post":"Dan, could you please tranlate co’s comment? I can’t seem to get my Google Chrome to do so.\nThanks, much appreciated,\nRon\n\n","date":"December 25, 2011 at 11:49 pm","url":"https://shroudstory.com/2011/12/23/surprising-live-poll-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-6124","author":"Ron","site":"shroudstory"},{"title":"Surprising Live Poll on the Shroud of Turin","post":"The translator from spanish to french work pretty good.  Maybe you could try to first translate the text in french and then, translate the french translation in english ???  Or maybe, if you’re a good Canadian (like P-E Trudeau thought a Canadian should be), you should know a fairly good base of french !!!! ;-)  So, if you do, just translate the text in french !!! :-)\n\n","date":"December 26, 2011 at 12:09 am","url":"https://shroudstory.com/2011/12/23/surprising-live-poll-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-6126","author":"Yannick Clément","site":"shroudstory"},{"title":"Surprising Live Poll on the Shroud of Turin","post":"Peter was not present in the tomb before the resurrection and was not a medical expert for sure, so how in the world can he know something about the fact Jesus did or not experiment the very first stage of decomposition before he resurrect ?  If you believe Jesus was a real mortal human being like anyone else (I think there’s enough proofs of that on the Shroud), then why his corpse could not have underwent  And also, Rogers never claim Jesus corpse needed to have been in a rotting state for his hypothesis to work.  The first stage of decomposition CAN logically imply some gas emission (including ammonia) from the body and maybe the skin (if their was a lot of sweating done prior to death) BEFORE the rotting process begin.\nAnyway, from a rationalist point of view only (forgetting the faith question), it is evident that the probability is higher that some ammonia or other gas were involved in the image formation process than UV lights or other form of energy like that, just because we deal with a human DEAD body in a material Shroud and not M. Spock in some distant galaxy (remember the call “beam me up Scotty !”).  \nAgain, I want to make it clear :  that some gas coming from the corpse or the skin COULD have been involved in the image formation process doesn’t imply at all that it was the only product involved in the image formation process…  Many processes COULD have been acting at the same time or simultaneously.  The fact is :  We don’t know for the moment what exactly was really involved in the image formation process and there’s even 2 possible chromophore for the coloration !  So, I think we should leave many doors open for the moment and be open-minded, especially about the possibility that some natural process could have been involved (in we want to stay scientifically correct).  So, I don’t think anybody who wants to stay prudent and logic cannot claim that Rogers Maillard reaction hypothesis has to be thrown into the garbage for the moment…  It’s important to understand that, for the moment, this is a POSSIBILITY (highly hard to quantify) and not a sure fact.\nI think it’s normal that different people favored different hypothesis about the image formation process but please, let’s stay open for other possible explanation than what we believe, because for the moment, nobody knows the solution to this mystery.  But again, we have to remember that words like “mystery” or “unexplained” doesn’t necessarily equal “supernatural”…  Thinking that way is an extrapolation that is not based on scientific facts.\n\n","date":"December 26, 2011 at 12:07 am","url":"https://shroudstory.com/2011/12/23/surprising-live-poll-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-6125","author":"Yannick Clément","site":"shroudstory"},{"title":"Surprising Live Poll on the Shroud of Turin","post":"Sorry, I have to write again my last comment in reaction to CO because it was incomplete. \nHere it is again (and sorry for the lenght of this comment) :\nPeter was not present in the tomb before the resurrection and was not a medical expert for sure, so how in the world can he know something about the fact Jesus did or not experiment the very first stage of decomposition before he resurrect ? If you believe Jesus was a real mortal human being like anyone else (I think there’s enough proofs of that on the Shroud and that’s one important aspect of our catholic credo), then why his corpse could not have underwent the very first stage of decomposition before the resurrection ???  I have, like most catholics I guess, absolutely no problem at all with this scenario…  But, at the same time, we have to make a clear difference between “decomposition” and “putrefaction”.  The very first stage of decomposition doesn’t imply any rotting of the body organs or tissues.  Read again the Wikipedia definition of the first stage of decomposition to understand what I mean.  And also, Rogers never claim Jesus corpse needed to have been in a rotting state for his hypothesis to work. The first stage of decomposition CAN logically imply some gas emission (including ammonia) from the body and maybe the skin (if their was a lot of sweating done prior to death) BEFORE the rotting process begin.\nAnyway, from a rationalist point of view only (forgetting the faith question), it is evident that the probability is higher that some ammonia or other gas were involved in the image formation process than UV lights or other form of energy like that, just because we deal with a human DEAD body in a material Shroud and not M. Spock in some distant galaxy (remember the call “beam me up Scotty !”). \nAgain, I want to make it clear : that some gas coming from the corpse or the skin COULD have been involved in the image formation process doesn’t imply at all that it was the only product involved in the image formation process… Many processes COULD have been acting at the same time or simultaneously. The fact is : We don’t know for the moment what exactly was really involved in the image formation process and there’s even 2 possible chromophore for the coloration ! So, I think we should leave many doors open for the moment and be open-minded, especially about the possibility that some natural process could have been involved (in we want to stay scientifically correct). So, I don’t think anybody who wants to stay prudent and logic cannot claim that Rogers Maillard reaction hypothesis has to be thrown into the garbage for the moment… It’s important to understand that, for the moment, this is a POSSIBILITY (highly hard to quantify) and not a sure fact.\nI think it’s normal that different people favored different hypothesis about the image formation process but please, let’s stay open for other possible explanation than what we believe, because for the moment, nobody knows the solution to this mystery. But again, we have to remember that words like “mystery” or “unexplained” doesn’t necessarily equal “supernatural”… Thinking that way is an extrapolation that is not based on scientific facts.\nLast thing :  If the thin layer of impurity proposed by Rogers is really the chromophore for the body image, then I don’t see any good reason why the color should have been totally homogeneous.  The thin layer would have been formed by a mix of natural and technical processes involved in the fabrication of the cloth.  In this context, why we cannot postulate that the thin layer was effectively present in a discontinuous form on the top part of the weave on the Shroud ?  My comprehension of the formation of the thin layer of sugar and carbohydrates on the top part of the weave, has described by Rogers in his book, fits pretty well with the observation made by STURP (especially in the paper published by Evans and Pellicori) that the coloration is present on the Shroud in a discontinuous form (and present mostly on the top crown of the thread and not much in the region where a surface thread start to go down before passing under another thread.  \nIn other words, the color reside mainly on the part of the thread that was exposed the most and his thickness was estimate at about 200 to 600 nanometers (ref. : Rogers).  Note : this is the correct estimation.  Anyone who state only 200 nanometers on the nose is not scientifically correct because it’s almost impossible to be so precise in the case of a tiny layer like that).  Also, the coloration is discontinuous, meaning that some fiber were colored beside other non colored fibers.  So, if there really is a thin layer of impurity at the surface of the cloth (and it look like there’s one because STURP found starch traces in their samples and Adler found also pectin traces that could have come from the retting process of the flax plant) and if that thin layer would have been deposited there by a natural process called “evaporation-concentration”, don’t you think that there’s some chances that the thin layer could have been present on some fibers and not at all on some other fibers located nearby ???  I’m not a chemist but I think this scenario sound very logical…  I don’t see why this evaporation-concentration phenomenon should have deposited a totally homogeneous layer of impurity on every single fibers located at the surface of the cloth…  The way I see this is precisely the opposite : I think it is logical to assume that the amount of impurity created by this process, since it’s a natural process, would have been very fluctuant and it’s not difficult for me to think that some fibers could have been left without any impurity at all.  Again, I’m not an expert in this field and I’ve don’t think Rogers even talk precisely on this aspect of the question in his book.  So, I would like to ear the thoughts of a chemist about that possibility ! \nBut, again, the finding of STURP that the color reside mostly on the top-crown of the exposed threads and start to disappear when this thread start to go down to pass under another thread is consistent with my understanding of an evaporation-concentration phenomenon that would have created an impurity layer at the surface of the cloth…  I hope you understand what I try to explain here !  All I say is that the STURP finding about the coloration at thread and fiber level is pretty consistent (from what I understand) with the impurity layer as proposed by Ray Rogers.  \nI know Fanti, Di Lazzaro, Heimburger, Svensson, Schneider and Botella have signed a paper that was highly critical about the thin layer of impurity proposed by Rogers…  But even they did so, they left this possibility open, even if they didn’t favored it.  Personally, I think Rogers was better qualified than those guys to answer the question of the exact nature of the body images.  Of course, that doesn’t necessarily mean he was 100% right about that but, for the moment, on this particular question, until new direct research could be done on the Shroud, I have a strong tendency to believe more in his conclusions than on the conclusions reached by the group cited below (they think the body images lies on the primary cell wall of the linen fiber instead of a thin layer of impurity).  And IF Rogers was right, then I think a thin layer of impurity like he proposed can explain many parts (not every parts of course) of the mystery of the Shroud.  The greatest one would be to explain why the color reside only on the extreme surface of the Shroud.  Note :  On the contrary, the conclusions reached by the group cited below (especially the one that state the chromophore is the primary cell wall of the linen fiber) cannot give any rational explantation for why the coloration was confined to the extreme surface of the Shroud…\nSorry again for the lenght of my comment but I think some people will find it interesting.\n\n","date":"December 26, 2011 at 1:16 am","url":"https://shroudstory.com/2011/12/23/surprising-live-poll-on-the-shroud-of-turin/","cat":"image_theory","id":"comment-6127","author":"Yannick Clément","site":"shroudstory"}]
