[{"title":"Teeth Reconsidered","post":"unconvinced, sorry\n\n","date":"July 11, 2014 at 5:55 am","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","id":"comment-137028","author":"Thomas","site":"shroudstory"},{"title":"Teeth Reconsidered","post":"I don’t know what would make you convinced.\nThe fact that alleged teeth are in propoer place and proper size?\nPlausible explanation of their visibility?\n\n","date":"July 11, 2014 at 6:03 am","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","id":"comment-137032","author":"O.K.","site":"shroudstory"},{"title":"Teeth Reconsidered","post":"Joke No.2\nWhat’s the difference between the Man on the TS and your typical farmyard hen?\nAnswer: The hen probably has the better dentition of the two,.\n\n","date":"July 11, 2014 at 6:03 am","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","id":"comment-137034","author":"Colin Berry","site":"shroudstory"},{"title":"Teeth Reconsidered","post":"And both have better than Colin…\n\n","date":"July 11, 2014 at 6:06 am","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","id":"comment-137036","author":"O.K.","site":"shroudstory"},{"title":"Teeth Reconsidered","post":"\nIs the blue rectangle centered ? What can people see ?\n\n","date":"July 11, 2014 at 11:00 am","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","id":"comment-137108","author":"anoxie","site":"shroudstory"},{"title":"Teeth Reconsidered","post":"I think it’s Leonardo da Vinci’s signature.\n\n","date":"July 11, 2014 at 11:43 am","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","id":"comment-137117","author":"Hugh Farey","site":"shroudstory"},{"title":"Teeth Reconsidered","post":"Troll anoxie is referring to a post I did almost 2 months ago, one that was never picked up on this site. Troll anoxie might have the decency to provide some context, and say why he/she considers it relevant to the present post.\nIn the meantime, I shall provide this link, and go back and remind myself what I said.\nhttp://colinb-sciencebuzz.blogspot.fr/2014/05/the-feet-of-man-on-ts-are-not-obscured.html\n\n","date":"July 11, 2014 at 12:30 pm","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","id":"comment-137134","author":"Colin Berry","site":"shroudstory"},{"title":"Teeth Reconsidered","post":"“why he/she considers it relevant to the present post.”\nHugh as already answered, it’s all about an artifact of the banding.\n\n","date":"July 11, 2014 at 4:29 pm","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","id":"comment-137185","author":"anoxie","site":"shroudstory"},{"title":"Teeth Reconsidered","post":"PS: the Shroud Scope picture you chose to pull out of my posting, the one with the blue rectangle,  was No.6 of 17. If you look at No.10 of 17, you will see why the blue rectangle was not centred. \nNo.10 is an identical picture, but instead of a blue rectangle, enclosing what I consider to be tips of toes (NO, NOT BANDING!) it has a black dashed line, one that delineates the water stain that Pam Moon considered was responsible for diffuse staining, a view that I decided to investigate in that posting, and found it wanting.It was to ensure that the entire water stain was in the field of view AND to show that the “tips of toes’ were imaged outside the zone of the water stain, that the blue rectangle came to be shown off-centre.\n  If I’m correct, and the tips of toes were imaged, then what price the received wisdom that one foot is missing through overlapping the other as a result of allegedly crossed feet? More importantly, what price “imaging by orthogonally-projected (!) radiation across air gaps (max 3-4cm!),” if in reality it is imaging by direct contact only (with imaging across air gaps a fanciful illusion).\n\n","date":"July 12, 2014 at 4:22 pm","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","id":"comment-137416","author":"Colin Berry","site":"shroudstory"},{"title":"Teeth Reconsidered","post":"“Troll anoxie is referring to a post I did almost 2 months ago, one that was never picked up on this site.”\nhttps://shroudstory.com/2014/05/18/colin-berry-its-not-douse-water-its-the-feet-being-orthogonal-to-the-longitudinal-plane-during-scorching/\n\n","date":"July 14, 2014 at 8:18 am","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","id":"comment-138077","author":"anoxie","site":"shroudstory"},{"title":"Teeth Reconsidered","post":"My mistake. It’s one I had missed, or maybe forgotten about, probably because it attracted no comments.\nConsider yourself misjudged.\n\n","date":"July 14, 2014 at 8:24 am","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","id":"comment-138079","author":"Colin Berry","site":"shroudstory"},{"title":"Teeth Reconsidered","post":"The Holy Face of Manoppello seems to be involved in that speculation…\nLink:\n\n— —\nDo you know the composition of an ancient potion (“posca”)?\nI ask because I have read the abstract from the study:\n“Polyacetylenes from Sardinian Oenanthe fistulosa:\nA Molecular Clue to risus sardonicus”\nJ Nat Prod. May 22, 2009; 72(5): 962–965.\nPublished online Feb 26, 2009. doi:  10.1021/np8007717\nLink:\nhttp://www.ncbi.nlm.nih.gov/pmc/articles/PMC2685611/\nSee also :\nhttp://en.wikipedia.org/wiki/Oenanthotoxin\nand\nI know that:\nHemlock Water Dropwort\n(Oenanthe crocata)\nThe generic name, Oenanthe, is derived from the\nGreek ainos (wine) and anthos (a flower), from the\nwine-like scent of the flowers.\nThe toxic principle is oenathetoxin, a polyunsaturated\nhigher alcohol. It is a convulsant poison that is not affected by drying or storage (therefore remains toxic after cutting and chemical control). Very small amounts are sufficient to cause death. Poisoning of farm stock usually occurs with out any warning signs…\nOther “information” about Oenanthotoxin or Enanthotoxin:\n>oenanthotoxin is still unknown, and little information on the molecular details of its neurotoxic activity has been reported …\nHave you found other interesting informations ?\n\n","date":"July 11, 2014 at 6:15 am","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","id":"comment-137038","author":"Piero","site":"shroudstory"},{"title":"Teeth Reconsidered","post":"I am a bit doubtful about that “poisonous idea”…\nFor example,\nI have read (“Meyer’s NT Commentary”):\n>According to Matthew, then, Jesus rejected the potion because the taste of gall made it undrinkable.\n>A later view than that embodied in Mark 15:23, from which passage it would appear that Jesus does not even taste the drink, but declines it altogether, because He has no desire to be stupefied before death.\nSee also (Ellicott’s Commentary for English Readers):\n– In Mark 15:23, “wine mingled with myrrh.” The animal secretion known as “gall” is clearly out of the question, and the meaning of the word is determined by its use in the Greek version of the Old Testament, where it stands for the “wormwood” of Proverbs 5:4, for the poisonous herb joined with “wormwood” in Deuteronomy 29:18. \nLink:\nhttp://biblehub.com/commentaries/matthew/27-34.htm\n\n","date":"July 11, 2014 at 6:22 am","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","id":"comment-137042","author":"Piero","site":"shroudstory"},{"title":"Teeth Reconsidered","post":"I don’t think any teeth are visible on the shroud. I don’t think the mouth is open. I think the ‘lip’ that is visible below the ‘moustache’ is the man’s lower lip. The ‘teeth’ are below the lower lip, which means that they would only be visible by some sort of X-ray effect through the skin. I do not believe the Shroud is an X-ray of any sort. I think the ‘teeth’ are an artifact of the banding due to differences in the warp yarn which can be seen throughout the Shroud.\n\n","date":"July 11, 2014 at 7:59 am","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","id":"comment-137063","author":"Hugh Farey","site":"shroudstory"},{"title":"Teeth Reconsidered","post":"Piero: thanks , interesting links.\nAs to the reason of sardonic smile, hard to determine. I thought about some infection, particularly of tetanus (see http://en.wikipedia.org/wiki/Tetanus ), but it seems that it would take too much time for symptoms to develop fully. Hynek, as I said, claimed that symptoms similar to that of tetanus may develop simply from exertion of crucified, but I don’t know. We need an opinion of qualified physician.\nPoison? Maybe. It seems that Jesus drank a little while on the cross, particularly in the last moments of His life (see Matthew 27:48, Mark 15:36, Luke 23:36, and particularly John 19:28-30 )\n\n","date":"July 11, 2014 at 8:23 am","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","id":"comment-137067","author":"O.K.","site":"shroudstory"},{"title":"Teeth Reconsidered","post":"I have found the following articles:\n– the first by Charles Q. Choi, titled “Killer Smile” :\n>A toxin that forces a condemned victim to smile really seems to exist. The Greek bard Homer coined the term “sardonic grin” after ceremonial killings that supposedly took place in Sardinia, where Phoenician colonists gave to elderly people who could no longer take care of themselves and to criminals an intoxicating potion that put a smile on their face. (They were then dropped from a high rock or beaten to death.) Scientists at the University of Eastern Piedmont in Italy and their colleagues think they now have identified the herb responsible: hemlock water dropwort (Oenanthe crocata), which is common on Sardinia, where it is popularly known as “water celery.” Their analysis revealed the presence of highly toxic chemicals in the plant that could make facial muscles contract into a grimace, or rictus. The finding appears in the May 22 Journal of Natural Products.  \b—Charles Q. Choi\nSource:\nhttp://www.scientificamerican.com/article/in-brief-aug-09/\n—\nthe second article:\n>Hemlock poisoning may refer to poisoning by either poison hemlock (Conium maculatum) or water hemlock family (Cicuta species and Oenanthe crocata L.). Historically, poison hemlock was reportedly used to execute Socrates and the Old Testament describes rhabdomyolysis in Israelites who consumed quail fed on hemlock.\nLink:\nhttp://emedicine.medscape.com/article/821362-overview\nand\nthe third under the address:\nww.telegraph.co.uk/science/science-news/5344257/Mystery-of-the-sardonic-grin-solved.html\nHere an excerpt:\n>… The Greek poet Homer first used the word ‘sardonic’ after learning that the Punic people who settled Sardinia gave condemned men or elderly people the grimace-inducing potion.\n>”The Punics were convinced that death was the start of new life, to be greeted with a smile,” Dr Ballero told Italy’s Ansa news agency.\n>The plant, which is common on the Mediterranean island, is known in Latin as Oenanthe crocata but to Sardinians as water celery. It is distantly related to carrots and parsnips but is highly poisonous.\n— —\nI repeaty : this strange idea is very interesting,\nbut I have some doubts…\nWhere are the true proofs about the poisonous composition of\nthe ancient potion (posca)?\nI hope top read the inherent news from Thibault Heimburger …\nor from other medical doctors.\n————————-\nHere the last words:\n>In ancient times, assassins and murderers have used\nthe hemlock water-dropwort (Oenanthe crocata) plant\nto incapacitate their victims slowly through the poisonous\nBotox-like effect of the extract and then do their heinous deed.\nThe result are corpses with a smile on their face…\nSource: http://www.pinterest.com/northwitch/b-identify/\n\n","date":"July 11, 2014 at 12:25 pm","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","id":"comment-137132","author":"piero","site":"shroudstory"},{"title":"Teeth Reconsidered","post":"Errata corrige :\n“I repeat”\ninstead of\n“I repeaty” …\n— — —\nHowever, the question of the book published by UTET seems more important (= resolution obtainable from the photo and inherent graphical representation … in order to better understand – and perhaps solve – the problem !).\n\n","date":"July 11, 2014 at 12:32 pm","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","id":"comment-137136","author":"piero","site":"shroudstory"},{"title":"Teeth Reconsidered","post":"Hugh:\nI don’t think any teeth are visible on the shroud. I don’t think the mouth is open.\nConfront it with Sudarium data. \nI think the ‘lip’ that is visible below the ‘moustache’ is the man’s lower lip. The ‘teeth’ are below the lower lip, which means that they would only be visible by some sort of X-ray effect through the skin.\nYou think this, you think that… Have you performed any measurements, Hugh (like I have)? Do it -you will see that alleged teeth are exactly where they suppose to be.\n I do not believe the Shroud is an X-ray of any sort.\nNor do I.\n I think the ‘teeth’ are an artifact of the banding due to differences in the warp yarn which can be seen throughout the Shroud.\nAnd this banding strangely produces structures which are in the proper place, and proper size for teeth. Another strange coincidence… ?\n\n","date":"July 11, 2014 at 8:29 am","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","id":"comment-137070","author":"O.K.","site":"shroudstory"},{"title":"Teeth Reconsidered","post":"Yes, I’ve done that. The lower lip coincides almost exactly with my own. And I do not agree that the teeth are in the proper place. Would you like to post a photo of the shroud with all the teeth that are visible outlined instead of just pointed to? To me it seems that the brightest one (presumably an incisor) is in the exact centre of the mouth (you have no arrow to that one). There are darker patches on either side, one of which (the other incisor? why should it be darker than the other?) has two arrows to it, and the other side nothing. I get lost after that. The warp imperfections, on the other hand, are easily traceable further up and down the shroud, particularly on Shroud 2.0\n\n","date":"July 11, 2014 at 10:53 am","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","id":"comment-137104","author":"Hugh Farey","site":"shroudstory"},{"title":"Teeth Reconsidered","post":"I am a bit ‘lazy…\nI am more inclined to agree with Hugh and rather than discuss the question in a scientific manner (considering “banding phenomenon” and inherent resolution) I prefer to ask the help about your idea of image resolution in this area!\nI believe that a better graphic scheme can solve the problem.\nThen, try to work using the image of the Face visible under :\nhttp://www.ebay.it/itm/Edizione-di-pregio-Sindone-Utet-edizione-limitata-/181459462044?pt=IT_Libri_Romanzi_Narrativa&hash=item2a3fd3a79c#ht_177wt_1235\n(… using that image is it possible a good attempt ?)\nEdizione di pregio “Sindone” Utet, edizione limitata (Starting price: 2.500,00 euros)\nPrecious volume “Shroud” UTET editions, limited edition.\nIt has a particular value for both contents, that the images of the Shroud, made for the first\nOnce high-resolution Haltadefinizione (Hal9000), the only company authorized to shooting\nby Papal Custodian of the Shroud, Archbishop of Turin, Cardinal Severino Poletto.\nBrand new item, properly taken care of, absolutely like new … …\nTime left: 2 days and 23 h …\n\n","date":"July 11, 2014 at 8:43 am","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","id":"comment-137079","author":"Piero","site":"shroudstory"},{"title":"Teeth Reconsidered","post":"Hugh:\nApproximate distance from the tip of the nose to the upper row of teeth:\nhttp://www.sindonology.org/shroudScope/shroudScope.shtml?zl=11&image=2&lon=1444.1&lat=6073.0&ms=10,146,23.0,1448,6078,1446,6024\nApproximate distance from the chin to the lower row of teeth:\nhttp://www.sindonology.org/shroudScope/shroudScope.shtml?zl=11&image=2&lon=1444.1&lat=6073.0&ms=10,146,35.4,1464,6103,1463,6186\nTeeth height:\nhttp://www.sindonology.org/shroudScope/shroudScope.shtml?zl=11&image=2&lon=1445.0&lat=6073.0&ms=10,146,14.9,1450,6076,1451,6111\nTeeth width:\nhttp://www.sindonology.org/shroudScope/shroudScope.shtml?zl=11&image=2&lon=1445.0&lat=6073.0&ms=10,146,49.4,1387,6098,1503,6096\nHere is approximate sketch of the teeth: \n\nIn fact only two right-bottom premolars (?) are clearly visible in their whole outlook. the rest needs to be guessed, mainlyon breaks between them, and in particular the one long break between upper and down rows of teeth. \nTo me it seems that the brightest one (presumably an incisor) is in the exact centre of the mouth (you have no arrow to that one). There are darker patches on either side, one of which (the other incisor? why should it be darker than the other?)\nYou aremaking a mistake. The brighest “tooth” is not an incisor, but simply a blood mark flowing down through mouth area. All teeth should have comparable brightness.\nGenerally there are two options. Either:\nA: The mouth is closed, and teeth should not be visible.\nB: The mouth is open, and teeth should be visible.\nI see no serious obstacles against accepting option B. Particularly as it is in agreement with both Sudarium of Oviedo, and Manoppello Veil data.\n\n","date":"July 11, 2014 at 12:07 pm","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","id":"comment-137125","author":"O.K.","site":"shroudstory"},{"title":"Teeth Reconsidered","post":"So what Dan (and others), still not convinced?\n\n","date":"July 11, 2014 at 3:46 pm","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","id":"comment-137176","author":"O.K.","site":"shroudstory"},{"title":"Teeth Reconsidered","post":"Fair enough. I find both the measurements and the tooth sketch wholly unconvincing, but you’re welcome to your opinion, of course.\n\n","date":"July 11, 2014 at 5:58 pm","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","id":"comment-137212","author":"Hugh Farey","site":"shroudstory"},{"title":"Teeth Reconsidered","post":"Like usual, Hugh ;-)\nI just add that those teeth are well visualised on some 3D representations. See this: https://shroudofturin.files.wordpress.com/2014/06/image42.png\n\n","date":"July 11, 2014 at 6:20 pm","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","id":"comment-137219","author":"O.K.","site":"shroudstory"},{"title":"Teeth Reconsidered","post":"O.K.\nI don’t really have the time to look at this in detail.\nLet’s step back ….who really cares?\nI imagine, however, the “teeth” would be significant, if true, because that would be almost categorical demonstration that the “Shroud Man” was a real person rather than a statue, bas relief etc.\n\n","date":"July 11, 2014 at 4:19 pm","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","id":"comment-137182","author":"Thomas","site":"shroudstory"},{"title":"Teeth Reconsidered","post":"Let’s step back ….who really cares?\nTrue. Absolutely true.\n\n","date":"July 11, 2014 at 4:28 pm","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","id":"comment-137183","author":"O.K.","site":"shroudstory"},{"title":"Teeth Reconsidered","post":"Piero’s comments on “sardonic smile” caused by use of poison:  There is no mention of the use of poison in the gospel accounts.  The evangelists may have been unaware of it, even if the soldiers had spiked the potion they gave to Jesus.  A little bit of research should discover whether it was in fact a Roman execution practice in 1st century Palestine (a long way from Sardinia).  \nAlternative explanations:  Any suggestion of visibility of teeth may be due to a simple death rictus, a not uncommon occurrence at death, but usually corrected by attendants at the time, as it’s not a pretty sight for the mourners.  The mouth and lips could be drawn tightly over the teeth so that it might not be an X-ray effect, but merely the shape of the teeth pressed tightly against the lips.  Or possibly just a simple banding effect in the weave of the cloth.  \nIf teeth are in fact visible, regardless of cause, it would seem to reduce the likelihood of the use of a bas-relief forgery model.\n\n","date":"July 11, 2014 at 4:53 pm","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","id":"comment-137193","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Teeth Reconsidered","post":"I think it’s very difficult to prove or disprove the presence of teeth. The following factors make it very difficult to distinguish:\n1- the background weave with all the irregularities of manual weaving.\n2- Vertical and horizontal banding.\n3- dirt,blood,serum…etc\nI think OK’s work is an indication that it might be there, and I applaud him for it, but it’s almost like trying to look through a thick veil. So many distortions prevents making a firm conclusion.\n\n","date":"July 11, 2014 at 11:02 pm","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","id":"comment-137258","author":"Mike M","site":"shroudstory"},{"title":"Teeth Reconsidered","post":"Well put Mike.\n\n","date":"July 11, 2014 at 11:25 pm","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","id":"comment-137261","author":"Thomas","site":"shroudstory"},{"title":"Teeth Reconsidered","post":"I have seen teeth since we had a radiologist in the museum who pointed them out.\n\n","date":"July 20, 2014 at 3:08 pm","url":"https://shroudstory.com/2014/07/11/teeth-reconsidered/","cat":"image_theory","id":"comment-139503","author":"Andy","site":"shroudstory"}]
