[{"title":"That doesn’t make sense …","post":"Homo sapiens originated from early hominids in Africa, perhaps 150,000 years ago, although there were local variations in the timing of this development in different populations, and some have asserted that some of our species might possibly go back even 400,000 years.  I recall reading some years ago, probably in a NZ Bob Brockie science column, that research had shown that those with blue eyes and other blonde features in present populations, were all descendants of one specific Scandinavian woman perhaps 10,000 years ago.   I presume that this was shown by some kind of DNA marker in a large sample of those with the traits.  \nHowever if this variation occurred once, I suppose it might just be possible for it also to have occurred elsewhere,  Dispersal of Scandinavian populations was extensive, certainly throughout Europe.  Did any of their early descendants get as far as the Middle East to pass on the trait?  I suppose it’s possible.  \nBlonde traits were also occasionally observed even in Polynesian populations by the early explorers.  The Polynesians have been shown to have originated from a particular region in China, although doubtless there may well have been some occasional interbreeding with a few other unrelated populations.   Did the variation occur only once, and then get passed on by descendants interbreeding with other populations?  Or did it occur it more often?  Are all blondes descended from a common blonde ancestor or from different blonde ancestors who incurred this particular variation?  Time and further research may eventually provide the answer.\n\n","date":"October 18, 2015 at 2:19 pm","url":"https://shroudstory.com/2015/10/18/that-doesnt-make-sense/","cat":"image_theory","id":"comment-212917","author":"daveb of wellington nz","site":"shroudstory"},{"title":"That doesn’t make sense …","post":"Two nights ago I fantasized about the\npossible (…or impossible) connection\nbetween studies of Mario Pincherle and\nstrange Nazi expedition to Tibet (led\nby German zoologist and SS officer Ernst Schäfer)….\nHimmler was fascinated by Asian mysticism\nand therefore wished to send such an expedition\nunder the auspices of the SS Ahnenerbe\n(SS Ancestral Heritage Society), and desired\nthat Schäfer perform research based on Hans\nHörbiger’s pseudo-scientific theory of\n“Glacial Cosmogony” promoted by the Ahnenerbe…\nAs you see it is easy to fly with the strange hypotheses\nof fantasy…\nThe Aryan race was described as native to\nthe area next to the Gobi Desert …and then\nthey migrated towards the Europe.\nThis presumed ancient migration perhaps was\ndue to some catastrophe that happened in Asia\n in an ancient epoch…\nPincherle (now this writer is dead, too) said that\nthe antediluvian tower (= “the immense granite\nmonoliths hidden inside the Pyramid of Khufu”)\nhidden inside the Great Pyramid of Giza comes\n through a long journey from China, through India\nand Mesopotamia to finally reach the top of the\nstep pyramid at Saqqara. Then from there this\nancient tower was moved to be hidden (inside\nthe building of the Great Pyramid …).\nIt seems to be in front of a particular vision,\nan alternative to the known History …\n>…In 2007 the Chinese government allowed\na National Geographic Society team headed\nby Spencer Wells to examine the mummies’ DNA.\n>Wells was able to extract undegraded DNA\nfrom the internal tissues.\n>The scientists extracted enough material\nto suggest the Tarim Basin was continually\ninhabited from 2000 BCE to 300 BCE …\nLink:\nhttps://en.wikipedia.org/wiki/Tarim_mummies\nThen see also the old tests\n(by Paolo Francalacci Univ. of Sassari)…\nOther links:\nhttp://blog.world-mysteries.com/strange-artifacts/the-tarim-mummies/\nhttp://rarehistoricalphotos.com/german-expedition-tibet-led-ernst-schafer-1938-1939/\nhttp://www.mariopincherle.it/method-of-short-cubic-woods-cheopes-pyramid.html\nIn any case it seems to be very easy to verify\nwhat kind of ancient stone (= the presumed\nremains from the “ancient tower”) there was\nover the “step pyramid” of Saqqara (and this\ncan be done using a petrographic microscope,\nor another kind of useful microscopy, etc.)…\nLink:\nhttps://en.wikipedia.org/wiki/Pyramid_of_Djoser\nHave you tried to investigate these questions?\n\n","date":"October 19, 2015 at 11:29 am","url":"https://shroudstory.com/2015/10/18/that-doesnt-make-sense/","cat":"image_theory","id":"comment-212993","author":"piero","site":"shroudstory"},{"title":"That doesn’t make sense …","post":"Here an example of what was the strange\nthinking of Mario Pincherle (about the Great Pyramid):\n>…But the womb of the pyramid hides another\nmystery: those immense monoliths, what\nwere they for?\n>In other words: what is the pyramid of Khufu really hiding?\n\n","date":"October 20, 2015 at 11:38 am","url":"https://shroudstory.com/2015/10/18/that-doesnt-make-sense/","cat":"image_theory","id":"comment-213154","author":"piero","site":"shroudstory"},{"title":"That doesn’t make sense …","post":"I have forgotten to write\nthe link:\nhttp://www.gizapyramid.com/pincherle.htm\nIn 1969 Pincherle tried to put “a sort of bell for the academic world” with a study published by the Lincei, where he argued that the pyramid of Cheops is not a monument, but an astronomical monument (a sort of “reference” for the future mankind…).\n\n","date":"October 20, 2015 at 11:46 am","url":"https://shroudstory.com/2015/10/18/that-doesnt-make-sense/","cat":"image_theory","id":"comment-213156","author":"piero","site":"shroudstory"},{"title":"That doesn’t make sense …","post":"Pincherle, in his book, “Il Gesù proibito” (= “The Forbidden Jesus”) wrote things somewhat  “shocking”…\nHe tells how the apostle Paul speaks of Jesus without knowing him at all.\nHere the opinion by Pincherle: “Unfortunately, the image of Jesus that we have now is very much based on what Paul wrote, but the reality does not match the phenomenon Jesus Christ…”\nI don’t believe in the “Christ” of the “New Age” and it was not in my intention the idea to transform your blog in a sort of collection of “New Age” claims…\nI wanted only to describe the particular ideas by Pincherle about the Gospel of Thomas and the figure of Jesus, etc.\nThe book by Mario Pincherle and Luigi Palazzini Finetti : “Il Primo LIbro del Mondo (Enoch)”, Filelfo Ancona 1979, was taken as “book of reference” by\nthe bortherhood/organization/sect “VitaNova” (an italian movement born in 1951).\nThe figure of Jesus in this organization has been transformed in thet of the Last Master of Essenes.\nVitaNova was characterized by a doctrine in his own way also linked to significant works of Edmond Bordeaux Szekely (1905-1979) and to the activities of Italian “Unione Cristiani Bionaturisti”…\nIs it really true the idea (= level of historic consistence) that Jesus passed a series of years with the Essenes?\n\n","date":"October 21, 2015 at 10:57 am","url":"https://shroudstory.com/2015/10/18/that-doesnt-make-sense/","cat":"image_theory","id":"comment-213254","author":"piero","site":"shroudstory"},{"title":"That doesn’t make sense …","post":"Errata corrige:\n>…transformed in that of “Last Master of the movement of the Essenes”.\nInstead of:\n>… transformed in thet of the Last Master of Essenes.\n— — —\nAnother particular statements about the Essenes:\n>”…For the Essenes averred that Moses had created them as a secret fraternity within Judaism, with Aaron and his descendants at their head.”\n>”The prophet Jeremiah was a Master of the Essenes…”\n>”…Isaiah and Saint John the Baptist were also Masters of the Essenes. …”\nLink:\nhttp://ocoy.org/original-christianity/the-christ-of-india/\nOther Links:\nhttps://en.wikipedia.org/wiki/Menahem_the_Essene\nhttps://en.wikipedia.org/wiki/Zugot\nhttps://en.wikipedia.org/wiki/Av_Beit_Din\n— — —\nI have read that:\n>The historical context of the Dead Sea area itself, and its extraordinary natural resources, as well as the archaeology of Qumran, confirm the Essenes’ patronage by Herod, and indicate that they harnessed the medicinal material the Dead Sea zone provides to this day.\nSource:\n“The Essenes, the Scrolls, and the Dead Sea”,\nJoan E. Taylor,\nOUP Oxford, Nov 2012\n— — —\nBut…\nWhere is the true and interesting connection Essenes-India ?\nIs it true that idea by Taylor?\n\n","date":"October 21, 2015 at 11:16 am","url":"https://shroudstory.com/2015/10/18/that-doesnt-make-sense/","cat":"image_theory","id":"comment-213258","author":"piero","site":"shroudstory"},{"title":"That doesn’t make sense …","post":"Another mistake.\nSorry!\nI reversed the position of the two sentences at the end of my message …\nErrata corrige:\n>Is it true that idea by Taylor?\n— —\n>But…\n>Where is the true and interesting connection Essenes-India ?\nInstead of:\n>But…\n>Where is the true and interesting connection Essenes-India ?\n>Is it true that idea by Taylor?\n— —\n… And (probably), at the end, we have to try to solve the following historical problems:\n1) Was the movement of Essenes influenced from the Buddhism?\n2) Did Christianity emerged from the Essenism?\n\n","date":"October 21, 2015 at 11:26 am","url":"https://shroudstory.com/2015/10/18/that-doesnt-make-sense/","cat":"image_theory","id":"comment-213260","author":"piero","site":"shroudstory"},{"title":"That doesn’t make sense …","post":"So…\nI have moved my position very far from the initial question around the little problem:\n… does Jesus have blond or white hair?  \nand then I have forgotten to ask :\nHad blond or black hair\nthe ancient Essene persons ?\nWhat is the situation about the scientific controls\nabout the DNA of the Essenes?\nHere a vague information:\n>…With funds from the State of Schleswig-Holstein, a new, state-of-the-art aDNA facility is being built that will expand the range of the analytical toolkit and research potential even further.\nlink:\nhttp://www.ikmb.uni-kiel.de/resources/ancient-dna-laboratory\n\n","date":"October 21, 2015 at 11:38 am","url":"https://shroudstory.com/2015/10/18/that-doesnt-make-sense/","cat":"image_theory","id":"comment-213262","author":"piero","site":"shroudstory"},{"title":"That doesn’t make sense …","post":"I believe that DNA of Dead Sea Scrolls are more studied (= the DNA of the scroll parchments)\nwith respect human DNA…\nLink:\nhttp://orion.mscc.huji.ac.il/orion/news/GolbRecent2007.pdf\n\n","date":"October 21, 2015 at 11:48 am","url":"https://shroudstory.com/2015/10/18/that-doesnt-make-sense/","cat":"image_theory","id":"comment-213264","author":"piero","site":"shroudstory"},{"title":"That doesn’t make sense …","post":"Here an interesting case:\nThe Mysterious European Mummies of China…\nLink:\nhttp://mysteriousuniverse.org/2014/10/the-mysterious-european-mummies-of-china/\n\n","date":"October 19, 2015 at 11:47 am","url":"https://shroudstory.com/2015/10/18/that-doesnt-make-sense/","cat":"image_theory","id":"comment-212996","author":"piero","site":"shroudstory"},{"title":"That doesn’t make sense …","post":"And here another migration (from Earth to Mars),\nafter the presumed “ancient migration” from\nAsia to Europe (and strange archaeological findings.\nSee also: ancient DNA !)…\n“Elon Musk, First Martian?\nA Serious Conversation About the Future in Space”…\nLinks:\nhttp://www.bloomberg.com/news/articles/2015-06-24/elon-musk-first-martian-a-serious-conversation-about-the-future-in-space\nhttp://www.bloomberg.com/graphics/2015-elon-musk-spacex/\nhttp://articles.economictimes.indiatimes.com/2015-05-15/news/62192342_1_elon-musk-orbital-sciences-moscow\n\n","date":"October 19, 2015 at 12:00 pm","url":"https://shroudstory.com/2015/10/18/that-doesnt-make-sense/","cat":"image_theory","id":"comment-212999","author":"piero","site":"shroudstory"},{"title":"That doesn’t make sense …","post":"The miracle happened in Fatima\nin 1917 seem to be very impressive:\n>… The sun “spun around in a mad whirl”\naccording to one observer. It began to\nshine in different colors, which in turn\ncast purple, yellow and other hues\nacross the entire landscape.\n>Occasionally it would seem to lunge\ntowards the earth, causing people to cry\nout in fear. In one of these photos, taken\nat the scene, you can clearly see the\nsun very close to the ground, far\nfrom where it was supposed to be at solar noon. …\nUnfortunately we are not sure about the exact\nmeaning of this vision, that scene can be\nthe end of our old planet Earth and then the hope\nto save the humanity is an interesting question,\nbecause in future our star (the Sun) will burn all\nin our planet:\n>In a few billion years, the sun will become\na red giant so large that it will engulf our planet.\n>But the Earth will become uninhabitable much\nsooner than that.\n>After about a billion years the sun will become\nhot enough to boil our oceans. … …\n>… it seems likely that we have no more than\na billion years left for life to thrive on our planet.\nLink:\nhttp://m.space.com/28553-don-t-panic-but-the-sun-will-far-outlive-earth.html\nThen the change of the location for\nthe “habitable zone” around our star\nwill be a problem to solve reserved\nto our descendants in a far future,\neven if (now) we can vaguely try to\nalready sketch something …\nAt present we can only try to think to escape\non Mars (and then: we can try to judge\nthe inherent efforts made by Elon Musk) and\nin a far future in other places, like:\nTitan, Europa and perhaps there’ll be no\nmore true future chances for this poor\nhumanity on this solar system…\nPerhaps whose who believe in the expectations\nfor what might happen in Medjugorje are\nmuch many, but we can not stop thinking\nto imagine emergency solutions for this\nhumanity (full of sins).\nFor example: try to save a small portion\nof our mankind on Mars (… and then I wonder\nhow will be the religious celebrations on Mars …\nand when [and where, in what place?] the\ncelebration of the Holy Mass on Mars will happen?).\nObviously all these speculations about\nthe Future (near future or distant future) of\nmankind are far from “simple analytical works”\non the precious materials of the Holy Shroud\nof Turin, a problem so not too difficult to solve (IMO)…\n\n","date":"October 20, 2015 at 11:32 am","url":"https://shroudstory.com/2015/10/18/that-doesnt-make-sense/","cat":"image_theory","id":"comment-213152","author":"piero","site":"shroudstory"}]
