[{"title":"The 3D images on the Shroud of Turin are not unique","post":"Good morning Dan.\nBy way of a holding comment, how about this:\n“The photograph of the Shroud is the only known two dimensional image on Planet Earth that displays this amazing property”.\nhttp://www.freechristianteaching.org/modules/smartsection/item.php?itemid=158#axzz1jcUekRQH\nI don’t claim that site I cite ;-) is the ultimate authority, but perception, especially by the (over?) impressionable can be every bit as important as hard verifiable fact in the wacky world of the Shroud, would you not agree? Indeed, the history of supposedly “hard science” itself is littered, I need hardly remind you, with the mirages of vivid imaginations that others too profess to see, at least until the enchanted spell becomes lifted (“cold fusion” etc).\nNote incidentally that the 1532 burn marks also show up in glorious 3D on the graphics which accompany the above article (featuring the 1976 work of Jackson and his NASA imaging project team). The authors remain silent on that little source of potential embarrassment …\nOn a different matter: what do you and others think about the trustees of Chambery having folded the Shroud from head to foot down the midline for storage, as is evident from the symmetry of the 1532 burn holes? What kind of way was that to treat a Holy Relic? Shamebery?\nhttp://colinb-sciencebuzz.blogspot.com/2012/01/why-cavalier-treatment-of-theturin.html\n\n","date":"January 16, 2012 at 8:06 am","url":"https://shroudstory.com/2012/01/16/the-3d-images-on-the-shroud-of-turin-are-not-unique/","cat":"image_theory","id":"comment-7038","author":"sciencebod","site":"shroudstory"},{"title":"The 3D images on the Shroud of Turin are not unique","post":"agree with sciencebod that it is a poor article. it was folded to fit in a silver reliquary. agree too with first comment that burn marks should look 3d. explainable. but body 3d is still mystery\n\n","date":"January 16, 2012 at 9:39 am","url":"https://shroudstory.com/2012/01/16/the-3d-images-on-the-shroud-of-turin-are-not-unique/","cat":"image_theory","id":"comment-7042","author":"MouseInTheHouse","site":"shroudstory"},{"title":"The 3D images on the Shroud of Turin are not unique","post":"The Jospice mattress partial body image is also a superficial 3D image. I do agree with Rogers: the recording of a true 3D superficial body image DOES NOT NEED a supernatural image formation process to accidentally or providentially happen.\n\n","date":"January 16, 2012 at 10:15 am","url":"https://shroudstory.com/2012/01/16/the-3d-images-on-the-shroud-of-turin-are-not-unique/","cat":"image_theory","id":"comment-7045","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The 3D images on the Shroud of Turin are not unique","post":"Go to this page from the website of John De Salvo : http://gizapyramid.com/LECTURE-SHROUD3.htm\nLook at the slides 19 and 20 !!!  You’ll see that the Volckringer pattern can produce natural images of flowers and leaves that contains distance informations incoded in them.  So, yeah, Rogers assumption has some good chances to be correct because natural phenomenon like the Volckringer pattern CAN produce images with this “3D” property.  \nIT IS A PROVEN FACT THAT SOME YET-TO-BE-FULLY-EXPLAINED CHEMICAL INTERACTION BETWEEN A DEAD BIOLOGIC BEING (IN THIS CASE, IT’S FLOWERS AND LEAVES) AND A MATERIAL SUPPORT (IN THIS CASE, IT’S A PAPER PAGE) CAN PRODUCE IMAGES WITH SOME DISTANCE INFORMATIONS (SO-CALLED 3D INFORMATIONS) INCODED IN THEM  !\nNow, I don’t pretend that the body images on the Shroud were surely produced by the same chemical phenomenon, but it is a good possibility that would need to be explored more deeply.\n\n","date":"January 16, 2012 at 11:51 am","url":"https://shroudstory.com/2012/01/16/the-3d-images-on-the-shroud-of-turin-are-not-unique/","cat":"image_theory","id":"comment-7051","author":"Yannick Clément","site":"shroudstory"},{"title":"The 3D images on the Shroud of Turin are not unique","post":"Actually,the image-formation process is not only CHEMICAL but also PHYSICAL(direct contact followed by gradual incomplete pressure release). Both aspects are equally important.\n\n","date":"January 16, 2012 at 1:16 pm","url":"https://shroudstory.com/2012/01/16/the-3d-images-on-the-shroud-of-turin-are-not-unique/","cat":"image_theory","id":"comment-7057","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The 3D images on the Shroud of Turin are not unique","post":"Anyway you want Max.  But if the process is natural, it surely need some chemical reaction(s) to produced the oxydation of the thin layer of impurities or of the primary cell wall of the linen fibers…\n\n","date":"January 16, 2012 at 1:58 pm","url":"https://shroudstory.com/2012/01/16/the-3d-images-on-the-shroud-of-turin-are-not-unique/","cat":"image_theory","id":"comment-7059","author":"Yannick Clément","site":"shroudstory"},{"title":"The 3D images on the Shroud of Turin are not unique","post":"We are talking about the interpretation of experiments carried out and made public decades ago. Those who are in charge  of the Shroud now -and perhaps have carried out secret tests these years-think that probably it is authentic and host exhibitions and studies in cathedrals worldwide http://elcabildo.org/noticias/malaga/item/1080-exposici%C3%B3n-en-la-catedral-sobre-la-sabana-santa.html\nTo me this is also a very strong indicator of authenticity, because the cult and interest on most of the relics has been  abandonned. Why not in this case?\n\n","date":"January 17, 2012 at 3:33 am","url":"https://shroudstory.com/2012/01/16/the-3d-images-on-the-shroud-of-turin-are-not-unique/","cat":"image_theory","id":"comment-7081","author":"Gabriel","site":"shroudstory"},{"title":"The 3D images on the Shroud of Turin are not unique","post":"Your comment is interesting Gabriel and it could be true to a certain extend.  But don’t forget one important thing about the Vatican :  They will NEVER proclaim the Shroud authentic before the scientific community will reach this conclusion !  And it’s very prudent and intelligent on their part.  Imagine the Church proclaiming the Shroud to be real and 10 years after, a new carbon dating show the cloth is really medieval !  They would look like fools.  I really don’t believe the cloth is medieval, but you get the point…\n\n","date":"January 18, 2012 at 9:32 am","url":"https://shroudstory.com/2012/01/16/the-3d-images-on-the-shroud-of-turin-are-not-unique/","cat":"image_theory","id":"comment-7131","author":"Yannick Clément","site":"shroudstory"},{"title":"The 3D images on the Shroud of Turin are not unique","post":"For sure it  ALSO needs some chemical reaction not unlike to that of a “mordant” (remoistened sweat and blood + water mixed with ashes + impurety layer + external  heat source + possible post mortem hyperthermia).\n\n","date":"January 18, 2012 at 2:04 pm","url":"https://shroudstory.com/2012/01/16/the-3d-images-on-the-shroud-of-turin-are-not-unique/","cat":"image_theory","id":"comment-7139","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The 3D images on the Shroud of Turin are not unique","post":"Typo errot: read “gradual pressure release & incomplete loss fo conact via drying-up”\n\n","date":"January 16, 2012 at 1:20 pm","url":"https://shroudstory.com/2012/01/16/the-3d-images-on-the-shroud-of-turin-are-not-unique/","cat":"image_theory","id":"comment-7058","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The 3D images on the Shroud of Turin are not unique","post":"“It might also help to know what software Dr. Sciencebod was referring to when he wrote, “I take it you are aware of the way the computer was programmed, i.e. to treat light and dark areas on the shroud as being closer to or further from a 3D object that was emitting some kind of radiation.”  No software, that I am aware of, was written specifically for such analysis on the shroud.  Can Dr. Sciencebod produce evidence of this.”\nWell, I don’t blame you for trying to pin me down on the detail, given I have come to your site wearing my science hat (I’m ‘newsjunkie’ btw on current affairs sites). At the risk of seeming evasive, I have to say that the interest in the Shroud for me is not just to do with the verifiable science (of which there is little, given there has been only rare and sporadic access to the material) but also with the manner in which the science, such as it is, is interpreted – or as often as not misinterpreted- in the media. So like everyone else, I peruse various sites that I come across, usually through googling, and hoover up the comments that seem to be the ones that are fixed in people’s minds, and which are rarely if ever challenged, even if this is “internet received wisdom!” so to speak and a far cry from standard textbook science. \nSo in reply to your question, i won’t even attempt to track down authoritatative sources, even assuming they exist – or that I would be personally capable of hudging their credibility. I will simply quote some words that are certainly close to the ones I expressed re the assumptions made in setting up a computer to detect the alleged “encoded 3D information”.\nExample:\n“3D INFORMATION. The image on the Shroud varies inversely with the cloth-to-body-distance. This means that the darker the image the closer this part of the body was to the Shroud and the lighter the image the further away these parts of the body were from the Shroud when the image-processing occurred. This means that every pixel in the gray-scale of the Shroud-image carries a cloth-to-body-distance relationship. This particular quality was used to create the Holograms of the Shroud-image.”\nhttp://shroud3d.com/home-page/introduction-image-qualities-of-the-shroud-of-turin\nSo what do you make of that, Dan and others?  I know what I make of it, but then maybe I’m a cynic (and have already given too much away). Yes, I know that the writer is ostensibly referring to the supposed formation of the original image, as distinct from the 20th century relief-mapping – but I say “ostensibly”. Is there not a conflation of the two, such that it’s virtually impossible to distinguish Shroud and processed image, or between established fact, and prior assumption? The assumptions feed on the end-result of the analysis, yet the end-result of the analysis feeds inevitably on the assumptions. If one wanted a simile, it’s like a snake that is swallowing its own tail….\n\n","date":"January 16, 2012 at 6:25 pm","url":"https://shroudstory.com/2012/01/16/the-3d-images-on-the-shroud-of-turin-are-not-unique/","cat":"image_theory","id":"comment-7069","author":"sciencebod","site":"shroudstory"},{"title":"The 3D images on the Shroud of Turin are not unique","post":"Have you forgotten that we’re talking about an image that was created over 2000 years ago??\n\n","date":"January 16, 2012 at 6:46 pm","url":"https://shroudstory.com/2012/01/16/the-3d-images-on-the-shroud-of-turin-are-not-unique/","cat":"image_theory","id":"comment-7070","author":"Wally Zambrano","site":"shroudstory"},{"title":"The 3D images on the Shroud of Turin are not unique","post":"Well, if you are correct, WallyZ, then maybe Cambridge University needs to supplement its Natural Sciences Tripos with a Supernatural Sciences Tripos. But the first task of any curriculum-developer would be to separate the tripe from the Tripos, given that so much of what one reads on the internet is not just problematical, but dare one say, er, shrouded in mystery…?\n\n","date":"January 17, 2012 at 3:31 am","url":"https://shroudstory.com/2012/01/16/the-3d-images-on-the-shroud-of-turin-are-not-unique/","cat":"image_theory","id":"comment-7080","author":"sciencebod","site":"shroudstory"},{"title":"The 3D images on the Shroud of Turin are not unique","post":"Dan, ¿cree usted que esa bella imagen fetal que muestra contiene información 3D codificada?\nMe atrevo a asegurarle ( no tengo software al respecto) que NO la contiene, no hay relación de proporcionalidad en sus “puntos” entre distancia e intensidad de la imagen.\nA partir de esa imagen, coherente en 2D, creo que NO podría obtenerse una imagen coherente en 3D…….\n\n","date":"January 17, 2012 at 8:34 am","url":"https://shroudstory.com/2012/01/16/the-3d-images-on-the-shroud-of-turin-are-not-unique/","cat":"image_theory","id":"comment-7087","author":"co","site":"shroudstory"},{"title":"The 3D images on the Shroud of Turin are not unique","post":"co, you wrote:\n“Dan, do you think that this beautiful image of the fetus shows 3D contains information encrypted?\n“I dare say (I have no software on this) that it does not, there is no relationship of proportionality in its “points” between distance and intensity of the image.\n“From that image, coherent 2D, I think it could get a consistent image in 3D … …”\nIt is my understanding that this picture is the 3D representation or plot of the ultrasound spatial data, which like the shroud data is relative distance that might have been stored in grayscale values. The picture of the fetus might be less confusing if it was green like the VP-8 output of the shroud image.\n\n","date":"January 17, 2012 at 4:25 pm","url":"https://shroudstory.com/2012/01/16/the-3d-images-on-the-shroud-of-turin-are-not-unique/","cat":"image_theory","id":"comment-7113","author":"episcopalian","site":"shroudstory"},{"title":"The 3D images on the Shroud of Turin are not unique","post":"What is called 3D regarding the shroud images is in fact an error of interpretation.  The body images of the Shroud are not real 3D images, they are images that contains distance informations relative to what was the real cloth-body distance during the image formation process (because of the variants in the proportion of colored fibers per square inches or square centimeter).  It’s much more precise to say this than to say that the body images are real 3D images.\n\n","date":"January 17, 2012 at 12:22 pm","url":"https://shroudstory.com/2012/01/16/the-3d-images-on-the-shroud-of-turin-are-not-unique/","cat":"image_theory","id":"comment-7095","author":"Yannick Clément","site":"shroudstory"},{"title":"The 3D images on the Shroud of Turin are not unique","post":"“Note incidentally that the 1532 burn marks also show up in glorious 3D on the graphics which accompany the above article (featuring the 1976 work of Jackson and his NASA imaging project team). The authors remain silent on that little source of potential embarrassment …”\nLos “autores” (authors) SI ENTIENDEN cómo funcionaba el VP-8…….otros NO lo entienden.\nEl VP-8 al asignar altura o bajura a las distintas densidades de una imagen fotográfica proporciona una FALSA 3D por lo que NO se utilizaba para estudiar la OROGRAFIA planetaria:\n“The purpose of the isometric display was to make it easier to follow patterns of changes in shades of gray within an image. Particularly, the light pattern changes in reflection of light from soils and vegetation near a fault line were of interest. Following patterns of soil types and vegetation types was also of interest. But in no case was there ever any indication on the isometric display of how high or low, how tall or short something was.” Peter M. Schumacher ( el ingeniero que programaba los VP-8).\n1-En un soporte gráfico (la película fotográfica que contiene la imagen planetaria o cualquier otra imagen) no existe información sobre las DISTANCIAS entre el soporte gráfico y la imagen real, y al someterla al VP-8 y transformar las intensidades en distancias NO PUEDE existir COHERENCIA entre esa imagen y la imagen REAL:\n“The isometric display was never intended to produce a “real-three-dimensional” display.\nA snow-covered peak would look like a high, flat surface, while a rock sitting on top of the snow would look like a deep hole in the high surface. Light reflecting from a stream at the bottom of a valley would appear to be a high elevation, perhaps even higher than the snow on the peak of the mountains. Dull rocks and dark vegetation would appear to be lower than the water of the stream. In other words, objects are not as tall or short, high or low, as their reflectance of light might indicate. There is no correlation between reflectance and altitude.” Peter M. Schumacher (el ingeniero que programaba los VP-8).\n2-Artefactos en la Sábana:\nCuando el VP-8 proporciona una FALSA 3-D a la imagen fotográfica de las marcas del incendio de 1532 ( u a otros ARTEFACTOS sin relación con la IMAGEN CORPORAL) , está funcionando correctamente, ES LO ESPERADO del VP-8.\nAl transformar el VP-8 las intensidades en distancias NO existe COHERENCIA entre la imagen del ARTEFACTO (marca de la quemadura) y la marca de la quemadura REAL.\n3-Imagen Corporal en la Sábana:\nCuando una fotografía de la Sábana (soporte gráfico de la impresión de un cuerpo) es sometida al VP-8 se produce en la imagen corporal lo NO ESPERADO del VP-8.\nAl transformar el VP-8 las intensidades en distancias SI existe COHERENCIA entre la imagen CORPORAL del soporte gráfico (Sábana) y el cuerpo de un HOMBRE REAL.\n4-Demostrandose que INTENSIDADES y DISTANCIAS guardan en la Sábana relación de proporcionalidad, y generando el VP-8 una VERDADERA 3-D\nEn ese soporte gráfico (Sábana) las densidades de la imagen corporal tienen proporcionalidad con las distancias en cada punto SOPORTE-HOMBRE, cada punto del soporte (Sábana) tiene información codificada sobre su distancia al punto REAL CORPORAL que quedó impreso, a eso se le llama TRIDIMENSIONALIDAD, 3D. \n[ esa 3D, tridimensionalidad fue enunciada por Delage y Vignon en 1902, estudiada por Gabriel Quidor en 1913 con un densitómetro mecánico, estudiada por Paul Gastineau en 1974 que realizó el primer bajo-relieve del rostro a partir de la fotografía de la Sábana mediante un estilete acoplado sobre un sistema óptico, estilete que actuaba sobre una materia maleable. En 1976 es demostrada mediante el VP-8 por Jackson, Jumper, Stevenson, Charter y Schumacher.]\nLa mejor o peor DECODIFICACIÓN de esa dimensión (distancia) para obtener un modelo volumétrico es un tema intimamente relacionado pero DIFERENTE, dependiente del avance de las tecnologías al respecto.\n\n","date":"January 17, 2012 at 2:10 pm","url":"https://shroudstory.com/2012/01/16/the-3d-images-on-the-shroud-of-turin-are-not-unique/","cat":"image_theory","id":"comment-7102","author":"co","site":"shroudstory"},{"title":"The 3D images on the Shroud of Turin are not unique","post":"Google translation of co’s comment:\nThe “authors” (authors) if you understand how the VP-8 … …. Others do not understand.\nThe VP-8 in height or inshore assign different densities of a photographic image provides a 3D FALSE so NOT used to study the topography planetary\n“The purpose of the isometric display WAS to make it Easier to follow patterns of Changes in shades of gray Within an image. Particularly, the light pattern of light reflection Changes in soils and vegetation from near a fault line of interest Were. Following patterns of soil types and vegetation types of interest Also WAS. But in no case ever Was There Any indication on the isometric display of how high or low, how tall or short something was. “Peter M. Schumacher (the engineer who programmed the VP-8).\n1-in graphics support (photographic film containing the image planetary or any other image) there is no information about the distance between the support and the actual image graphic, and submit it to the VP-8 and transforming the intensities in distance can not be consistency between the image and the image REAL\n“The isometric display WAS never Intended to produce a” real-three-dimensional “display.\n A snow-covered peak Would look like a high, flat surface, while a rock sitting on top of the snow Would look like a deep hole in the high surface. Reflecting Light from a stream at the bottom of a valley Would Appear to be a high elevation, Perhaps Even Higher Than the snow on the peak of the mountains. Dull dark rocks and vegetation Would Appear to Be Lower Than the water of the stream. In other words, objects are not as tall or short, high or low, as Their reflectance of light Might indicated. There is no correlation Between reflectance and altitude. “Peter M. Schumacher (the engineer who programmed the VP-8).\n2-Artifacts in the Shroud:\nWhen the VP-8 provides a false 3-D photographic image of the marks of fire 1532 (or others APPLIANCES unrelated to body image) is working properly, is to be expected of the VP-8.\nBy transforming the VP-8 intensities at distances there is no consistency between the image of the artifact (burn mark) and the burn mark REAL.\n3-Body Image on the Shroud:\nWhen a photograph of the Shroud (print graphic support of a body) is submitted to the VP-8 is produced in body image and unexpectedness of the VP-8.\nBy transforming the VP-8 SI intensities over distances there is coherence between body image of graphic support (Shroud) and the body of a REAL MAN.\n4-Demonstrating that intensity and epicentral distance relationship stored in the Shroud of proportionality, and generating a REAL VP-8 3-D\nIn this graphic support (Shroud) the densities of body image are proportional to the distances at each point SUPPORT MAN, each point of support (Shroud) has encoded information about its distance from the point that was printed REAL BODY, about you THREE-DIMENSIONAL called 3D.\n[That 3D, three-dimensionality was enunciated by Delage and Vignon in 1902, studied by Gabriel chydorids in 1913 with a suitable mechanical studied by Paul Gastineau in 1974 that made the first bas-relief of the face from the photograph of the Shroud by attached stylus on an optical system, acting on a stylus malleable material. In 1976 is demonstrated by the VP-8 by Jackson, Jumper, Stevenson, Charter and Schumacher.]\nThe DECODE better or worse that dimension (distance) to obtain a volumetric model is an issue closely related but different, depending on the advancement of technologies in this regard.\n\n","date":"January 17, 2012 at 4:17 pm","url":"https://shroudstory.com/2012/01/16/the-3d-images-on-the-shroud-of-turin-are-not-unique/","cat":"image_theory","id":"comment-7112","author":"episcopalian","site":"shroudstory"},{"title":"The 3D images on the Shroud of Turin are not unique","post":"Nice comment Co, especially about the FACT that Jackson and Jumper only confirmed what many european scientists had said well before (since 1902 in fact), i.e. that the Shroud image have distance informations between the cloth and the body that was enveloped in it.  And as you point out, even some scientists like Gastineau were able to show some proofs of the spatial informations that were incoded in the Shroud images, well before Jackson and Jumper…  This important aspect of the Shroud history remain unknown to many people, because TV documentaries and books often talk only about the VP-8 analysis done by Jackson and Jumper in 1976…  The fact is that many scientists were well aware that the Shroud images contains distance informations well before Jackson and Jumper made their analysis.  All they did was to confirmed their assumption, which was an important step of course.\n\n","date":"January 17, 2012 at 4:27 pm","url":"https://shroudstory.com/2012/01/16/the-3d-images-on-the-shroud-of-turin-are-not-unique/","cat":"image_theory","id":"comment-7114","author":"Yannick Clément","site":"shroudstory"},{"title":"The 3D images on the Shroud of Turin are not unique","post":"Maybe I will not make too many friends by saying this, but I’ll do anyway because it burn my lips !!!  Very often (attention, I don’t say always), Americans have a bad tendency (just like the Romans in Christ time) to believe that all the universe turn around their navel and it’s true also in the Shroud world.  In other word, many Americans involved in the Shroud world (I don’t mention any name here, and, of course, I don’t think about Dan) are too much focused on the science that come from the USA and not enough about the science that come from Europe.  Of course, that doesn’t mean that this european science is always good.  But it’s a fact that many Shroud scientists (and their science) from Europe are not so well known in the Shroud world than most american scientists.  And it’s also very true that, for many Americans, the science history of the Shroud start with the STURP, which is a very great mistake !  A lot of good science was done WELL BEFORE the STURP team was formed (mainly in Europe by the way) but this science was often put in the shadows because of the STURP investigation.  Of course, I consider the STURP investigation has the most important that has ever been done on the Shroud.  But that doesn’t mean that there was not some good things done prior to that, or even after.  But unfortunatelly, many of this European science has not receive the same amount of publicity here than the American science.  Of course, you’ll understand that I’m not thinking about the ENEA’s experiments here ! :-)\n\n","date":"January 17, 2012 at 4:41 pm","url":"https://shroudstory.com/2012/01/16/the-3d-images-on-the-shroud-of-turin-are-not-unique/","cat":"image_theory","id":"comment-7116","author":"Yannick Clément","site":"shroudstory"},{"title":"The 3D images on the Shroud of Turin are not unique","post":"Typing error.  You should read : “that the Shroud image have distance informations ABOUT the cloth and the body that was enveloped in it.”\n\n","date":"January 17, 2012 at 4:29 pm","url":"https://shroudstory.com/2012/01/16/the-3d-images-on-the-shroud-of-turin-are-not-unique/","cat":"image_theory","id":"comment-7115","author":"Yannick Clément","site":"shroudstory"}]
