[{"title":"The Beat Goes On: Shroud of Turin and the Laser Experiments","post":"Quote from Dan :  “I must admit, I am not ready to easily accept, “But the implication of their work was that the enigmatic marks on the cloth were created at the moment of Christ’s Resurrection by some sort of miracle.”\nI’m glad you don’t because that would be very imprudent.  To do this kind of stretch, I say it again, someone MUST used EXTRAPOLATION.\n\n","date":"December 29, 2011 at 6:22 pm","url":"https://shroudstory.com/2011/12/29/the-beat-goes-on-shroud-of-turin-and-the-laser-experiments/","cat":"image_theory","id":"comment-6264","author":"Yannick Clément","site":"shroudstory"},{"title":"The Beat Goes On: Shroud of Turin and the Laser Experiments","post":"Does anyone get the “feeling”, the Vatican is trying to tell us something without actually coming out and saying it? ;-)\n I don’t find the article very well written actually. It still implies the findings in this experiment can disprove a medieval forgery or that present science cannot reproduce the Shroud and in so saying proves the previous statement.\nThis latest experiment proves only 2 things: That a linen cloth can be ‘imprinted’, ‘superficially’ in close relation to the images seen on the Shroud, using UV light. Also that to create a full image, as seen on the Shroud, we cannot create the ‘enviroment’ to do so with our present technology!…Simple, entising, not to be taken lightly, YES, but still proves little. Although it may have some striking ‘implications’, in actually it does not say much as there may be other methods in which the image was created. This study does not show in ‘anyway’ these other methods can be counted out.\nI think the Vatican, or whomever is responsible for this relic, have a huge responsibility here. It is up to them whether ‘proper’ further research can be done on the Shroud! I say to them, Let’s get going! Put together a ‘Team’ of our best scientists, bring together the Shroud and Sudarium, ‘make a plan’ on how this testing should be implemented with open and unbiased exposure. Use all means possible, aslong as the relic is not damaged, to answer the many questions out there aready.\nThey could start by commissioning someone to produce some linen material, in the ancient fashion as closely as we know how.\nR\n\n","date":"December 29, 2011 at 7:10 pm","url":"https://shroudstory.com/2011/12/29/the-beat-goes-on-shroud-of-turin-and-the-laser-experiments/","cat":"image_theory","id":"comment-6266","author":"Ron","site":"shroudstory"},{"title":"The Beat Goes On: Shroud of Turin and the Laser Experiments","post":"Very fine comment Ron !  I agree mostly with all you said.  There’s just the second thing you consider a “proof”.  Since we don’t know the exact image formation mechanism, how can we be so sure we cannot create the proper environment to do so with our present technology ?  I think we must be prudent here.  MAYBE it was a natural process that formed the images and we could produce it right now but MAYBE we didn’t do it yet just because we didn’t find out the proper chemical recipe it must take to do it ?  I think you can agree with me about this possibility…  Of course, it is just a possibility and not a certainty.   But, if we want to stay honest, we have to left the door open for this possibility.\n\n","date":"December 29, 2011 at 7:32 pm","url":"https://shroudstory.com/2011/12/29/the-beat-goes-on-shroud-of-turin-and-the-laser-experiments/","cat":"image_theory","id":"comment-6267","author":"Yannick Clément","site":"shroudstory"},{"title":"The Beat Goes On: Shroud of Turin and the Laser Experiments","post":"Sorry Yannick, my mistake, in my second comment I meant it as in; creating the full image using UV light, the enviroment cannot be created with our present technology. In them saying they would need a gazillion watt multi-laser.\nR\n\n","date":"December 30, 2011 at 2:46 pm","url":"https://shroudstory.com/2011/12/29/the-beat-goes-on-shroud-of-turin-and-the-laser-experiments/","cat":"image_theory","id":"comment-6306","author":"Ron","site":"shroudstory"},{"title":"The Beat Goes On: Shroud of Turin and the Laser Experiments","post":"Ok Ron.  I see my comment was on the target !!! ;-)  I understand what you say and I remember that M. Di Lazzaro state something like that in 2008 at the Columbus conference on the Shroud…  I think we’re VERY far from the day he and his team will be able to produce a body image with real 3D properties like we found on the Shroud !\nAnd until that day could come, the link between their experiments and the Shroud of Turin will ALWAYS need some extrapolations to be made…\n\n","date":"December 30, 2011 at 8:30 pm","url":"https://shroudstory.com/2011/12/29/the-beat-goes-on-shroud-of-turin-and-the-laser-experiments/","cat":"image_theory","id":"comment-6333","author":"Yannick Clément","site":"shroudstory"}]
