[{"title":"Is Time the Secret Ingredient We Need to Consider?","post":"First of all, I don’t think the primary cell wall is the most probable chromophore for the image.  Not at all.  Rogers was so clear about the fact that the fibers themselves were not affected that I still think he was correct about that.\nAnd secondly, to follow the title of this page, I don’t believe that time is the most important factor to consider when it comes to understand the Shroud image.  Instead, I prefer to follow the opinion of Fazio and Mandaglio in Italy who stated that the most important “ingredient” that lead to the formation of the Shroud image is the minimal amount of energy (still undetermined), which is probably responsible (at least partially) for the non-homogeneous aspect of the colored fibers in the image area.  In other words, I still think the answer for the image lies in a very mild process that was active at normal temperature…\n\n","date":"March 11, 2014 at 10:51 am","url":"https://shroudstory.com/2014/03/11/is-time-the-secret-ingredient-we-need-to-consider/","cat":"image_theory","id":"comment-87369","author":"Yannick Clément","site":"shroudstory"},{"title":"Is Time the Secret Ingredient We Need to Consider?","post":"Whether the image was formed on the outer surfaces of the fibres of the cloth, as per Adler, Heller and Schwalbe, or on a surface coating, as per Rogers, there is a good possibility that some of it has been rubbed away. Mark Evan’s photos clearly show what look like bushes of fibres sticking out from many of the interstices of the threads, which I take to be the remains of fibres which have at least broken, and quite possibly broken off. As these are all “surface” fibres, there is a good chance that they carried the image with them.\n\n","date":"March 11, 2014 at 11:50 am","url":"https://shroudstory.com/2014/03/11/is-time-the-secret-ingredient-we-need-to-consider/","cat":"image_theory","id":"comment-87379","author":"Hugh Farey","site":"shroudstory"},{"title":"Is Time the Secret Ingredient We Need to Consider?","post":"Alan Adler was clear in his book about the Shroud that his own analyses of Shroud samples showed that the image on the Shroud is much more stable and hard to damaged than the bloodstains because he was able to find some blood particles everywhere (even in samples that were taken in non-bloodstained areas), while it was all the contrary for the color that compose the image.  Having said that, it’s true that the members of STURP noted that the image fibers were more fragile and easier to break (surely due to the chemical reaction – probably a dehydration process – that occured inside or over those fibers, which lead to the image formation), but the fact that Adler doesn’t seem to have found any image fibers in samples that were taken in non-image areas seem to indicate that the original image on the Shroud (this original image can well have become fully visible only after several years or even decades) do not appear to have been damaged signigicantly over the centuries. In fact, the only thing that can give us a clue that the image was easier to distinguish in its early days is the fact that the non-image fibers of the cloth have certainly gotten more yellowed over time, because of all the vicissitude of the cloth (including several fire incidents) and, more importantly, because of the natural oxydative action of natural radiations.  Considering this most certain fact, it’s easy to guess the non-image portions of the cloth were much whiter in its early days, thus causing a more intense contrast versus the body image.\n\n","date":"March 11, 2014 at 1:30 pm","url":"https://shroudstory.com/2014/03/11/is-time-the-secret-ingredient-we-need-to-consider/","cat":"image_theory","id":"comment-87398","author":"Yannick Clément","site":"shroudstory"},{"title":"Is Time the Secret Ingredient We Need to Consider?","post":"I, and I think Colin, was not thinking of reacting the image away, but literally rubbing away the entire image-carrying fibre by attrition. There was anecdotal evidence to suggest that the tapes stuck over image area came away more easily than the tapes stuck over non-image areas, which suggests that they were more friable and more likely literally to crumble off.\n\n","date":"March 11, 2014 at 4:07 pm","url":"https://shroudstory.com/2014/03/11/is-time-the-secret-ingredient-we-need-to-consider/","cat":"image_theory","id":"comment-87439","author":"Hugh Farey","site":"shroudstory"},{"title":"Is Time the Secret Ingredient We Need to Consider?","post":"Quote: “There was anecdotal evidence to suggest that the tapes stuck over image area came away more easily than the tapes stuck over non-image areas, which suggests that they were more friable and more likely literally to crumble off.”\nI also read this and this is what I said in my previous comment.  BUT…  It’s one thing for a image fiber to be more fragile than a non-image fiber and it’s another thing to conclude that such a image fiber can be broken very easily!  If that was the case, Adler would have noticed tiny fragment of color fibers in each one of his samples, no matter if they were taken in image area or not.  Reading his book, it doesn’t appear this was the case.\n\n","date":"March 11, 2014 at 4:35 pm","url":"https://shroudstory.com/2014/03/11/is-time-the-secret-ingredient-we-need-to-consider/","cat":"image_theory","id":"comment-87442","author":"Yannick Clément","site":"shroudstory"},{"title":"Is Time the Secret Ingredient We Need to Consider?","post":"Addtion :  The image is so stable and hard to damage in fact that Adler was only able to dissolve it using very powerful chemical compounds like diimide…  Such a data is important, especially when we consider the fact (as Rogers did) that the resulting fiber was undamaged (which is a very important point in favor of a color residing not in the PCW of the fiber but in a thin layer of impurities that was coating the fiber.\n\n","date":"March 11, 2014 at 1:46 pm","url":"https://shroudstory.com/2014/03/11/is-time-the-secret-ingredient-we-need-to-consider/","cat":"image_theory","id":"comment-87407","author":"Yannick Clément","site":"shroudstory"},{"title":"Is Time the Secret Ingredient We Need to Consider?","post":"Last note : Concerning the bloodstains, Adler said that traces of abrasion of the surface of most of these biological stains were easy to see under a microscope (these surface abrasion are responsible for the fact that he found many blood particles in samples that were taken in non-bloodstained areas), which is totally consistent with real bloodstains made of blood material coming from moistened blood clots that have stained a linen cloth, which was manipulated, folded and unfolded a lot of times through its history.  And this is why a medical expert like Barbet was amaze to note that all the major bloodstains on the Shroud do not seem to show evident holes and missing parts, which would have been natural in the context of an enshrouded corpse that is taken out of the cloth after the blood had time to completely dry (which is pretty evident that this was the case because of the image formation that happened some time after the blood transfers).\n\n","date":"March 11, 2014 at 2:36 pm","url":"https://shroudstory.com/2014/03/11/is-time-the-secret-ingredient-we-need-to-consider/","cat":"image_theory","id":"comment-87418","author":"Yannick Clément","site":"shroudstory"},{"title":"Is Time the Secret Ingredient We Need to Consider?","post":"“OK, so it’s a tall order (maybe) to create a 200nm thick scorch that never goes deeper into the weave. But it’s not a tall order if one is then allowed to come back a few centuries later when all the more deeply scorched fibres have broken off, leaving just those with the PCW scorched.”\n… that never goes deeper into individual linen fibers.\nNext.\n\n","date":"March 11, 2014 at 3:10 pm","url":"https://shroudstory.com/2014/03/11/is-time-the-secret-ingredient-we-need-to-consider/","cat":"image_theory","id":"comment-87424","author":"anoxie","site":"shroudstory"},{"title":"Is Time the Secret Ingredient We Need to Consider?","post":"And, again, we’re not even talking about the question of the bloodstains evidence… ;-)  I agree 100%.  Unless we’re talking about an image formation that came from a real crucified corpse, it is a waste of time to debate about the probability of such and such forgery hypothesis…\n\n","date":"March 11, 2014 at 3:20 pm","url":"https://shroudstory.com/2014/03/11/is-time-the-secret-ingredient-we-need-to-consider/","cat":"image_theory","id":"comment-87425","author":"Yannick Clément","site":"shroudstory"},{"title":"Is Time the Secret Ingredient We Need to Consider?","post":"Agree, I can’t believe we are still stuck here. A full team of scientists, multidisciplinary spent 5 full days, directly poking and probing the cloth and concluded\n “We can conclude for now that the Shroud image is that of a REAL HUMAN form of a scourged, crucified man. It is not the product of an artist. The blood stains are composed of hemoglobin and also give a positive test for serum albumin. The image is an ongoing mystery and until further chemical studies are made, perhaps by this group of scientists, or perhaps by some scientists in the future, the problem remains unsolved.”\n\n","date":"March 11, 2014 at 9:28 pm","url":"https://shroudstory.com/2014/03/11/is-time-the-secret-ingredient-we-need-to-consider/","cat":"image_theory","id":"comment-87530","author":"Mike M","site":"shroudstory"},{"title":"Is Time the Secret Ingredient We Need to Consider?","post":"That’s true.\nTo work seriously one has to consider the differences between fiber, thread and fabric levels.\n\n","date":"March 11, 2014 at 4:53 pm","url":"https://shroudstory.com/2014/03/11/is-time-the-secret-ingredient-we-need-to-consider/","cat":"image_theory","id":"comment-87447","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Is Time the Secret Ingredient We Need to Consider?","post":"I think what comes out of CB post is simply an implied admission that his scorch hypothesis can’t replicate the superficiality at the fibre level… So it must be time (i.e. don’t ask me to replicate it because it happened over hundreds of years and I can’t replicate that) what about the real scorches on the shroud? Why are those still there, after the same time has passed and all the foldong and unfolding why are they still there, Full with Lumen discoloration, UV Fluorescence and transmitted light presence?\n\n","date":"March 11, 2014 at 6:18 pm","url":"https://shroudstory.com/2014/03/11/is-time-the-secret-ingredient-we-need-to-consider/","cat":"image_theory","id":"comment-87467","author":"Mike M","site":"shroudstory"},{"title":"Is Time the Secret Ingredient We Need to Consider?","post":"They’re not still there, are they? In fact, so much of them was being crumbled away that it was thought there was a danger of the charred fragments damaging the rest of the shroud, hence the 2000 restoration.\nThat is to say, of course, that there are degrees of discolouration, from the lightest image colour to the blackest char, and quite possibly the most friable parts of all of it have been crumbled off. The darkest burns have been rubbed away to nothing – hence the enlargment of the ‘burn holes,’ and the lightest discolourations have been excoriated the least. Possibly the non-image areas haven’t been rubbed away at all. All the remaining marks, from burns to faint image, are what remains, not the original undamaged surface. Doesn’t that make sense?\n\n","date":"March 11, 2014 at 7:23 pm","url":"https://shroudstory.com/2014/03/11/is-time-the-secret-ingredient-we-need-to-consider/","cat":"image_theory","id":"comment-87484","author":"Hugh Farey","site":"shroudstory"},{"title":"Is Time the Secret Ingredient We Need to Consider?","post":"Sorry Hugh, Again, another claim without any evidence. If Colin can demonstrate a scorch that only penetrates the PCW without discolor the lumen over a large surface area of a linen cloth  (even after removing the very scorched top fibers I would be more than happy to listen. STURP investigation has clearly distinguished scorches from image. Scorches fluoresce in UV light and show up in transmitted light. Either of these observations is enough empiric evidence that they are not the same. The image is a full front and back body image that is consistently 1-2 fibre deep, Pressure insensitive and superficial at fibre level. Where are the evidence that you so much seek in any other hypothesis?\n\n","date":"March 11, 2014 at 9:02 pm","url":"https://shroudstory.com/2014/03/11/is-time-the-secret-ingredient-we-need-to-consider/","cat":"image_theory","id":"comment-87521","author":"Mike M","site":"shroudstory"},{"title":"Is Time the Secret Ingredient We Need to Consider?","post":"Thank you Hugh. You put things so much better than me, which is perhaps why I rely a lot on diagrams. In fact you have given me an idea for today’s posting, which will show diagramatically the effect of that great equalizer – mechanical attrition – at the thread as well as the fibre level. It will plagiarize the cable-like portrayal of threads in cross-section from that splendid paper of Fanti, Di Lazzaro, Heimburger et al on Macroscopic v Microscopic Aspects.\n\n","date":"March 12, 2014 at 2:26 am","url":"https://shroudstory.com/2014/03/11/is-time-the-secret-ingredient-we-need-to-consider/","cat":"image_theory","id":"comment-87624","author":"colinsberry","site":"shroudstory"},{"title":"Is Time the Secret Ingredient We Need to Consider?","post":"Is there anywhere on the Shroud where the image penetrates deeper into the linen than in other spots? Is it not logical to assume that if the image is a man-made scorch it would have penetrated deeper in some areas — undetectable at the time but not so today. Are we sure the image is uniform in its depth across the linen?\n\n","date":"March 12, 2014 at 7:53 am","url":"https://shroudstory.com/2014/03/11/is-time-the-secret-ingredient-we-need-to-consider/","cat":"image_theory","id":"comment-87728","author":"David Goulet","site":"shroudstory"},{"title":"Is Time the Secret Ingredient We Need to Consider?","post":"Quote: “Are we sure the image is uniform in its depth across the linen?”\nThat’s the conclusion of the STURP team.  The ultra-superficiality is present not only in areas very faint but also in most probable zones of direct-contact where the image is the darkest like the nose area for example…  This simple fact, along with the bloodstains evidence, is enough to discard any hypothesis involving a man-made forgery.  Can we move forward please?\n\n","date":"March 12, 2014 at 10:53 am","url":"https://shroudstory.com/2014/03/11/is-time-the-secret-ingredient-we-need-to-consider/","cat":"image_theory","id":"comment-87781","author":"Yannick Clément","site":"shroudstory"},{"title":"Is Time the Secret Ingredient We Need to Consider?","post":"The only way to move forward, given the lack of new data/tests, is to question and re-examine what we already think we know. I don’t expect Colin is going to find conclusive evidence to validate the scorch theory, but his experiments and thought exploration could lead to other insights. He may ‘accidently’ hit upon something revelatory that does move us forward. This is certainly better than standing pat waiting for Turin to allow new tests.\n\n","date":"March 12, 2014 at 12:18 pm","url":"https://shroudstory.com/2014/03/11/is-time-the-secret-ingredient-we-need-to-consider/","cat":"image_theory","id":"comment-87811","author":"David Goulet","site":"shroudstory"},{"title":"Is Time the Secret Ingredient We Need to Consider?","post":"Unless a CSI type of expert comes into the picture to examine the potential validity of all the natural hypotheses that have been proposed over the years involving a crucified corpse, I don’t expect much movement forward versus the image formation question…\n\n","date":"March 12, 2014 at 1:01 pm","url":"https://shroudstory.com/2014/03/11/is-time-the-secret-ingredient-we-need-to-consider/","cat":"image_theory","id":"comment-87824","author":"Yannick Clément","site":"shroudstory"},{"title":"Is Time the Secret Ingredient We Need to Consider?","post":"Good point, Mike; evidence is indeed all, as far as I’m concerned!\nAnd, as with other ideas about possible image forming mechanisms, the fluorescence is a serious and valid objection, so far, to the scorch hypothesis.\nHowever, when did a single objection stop us from exploring a hypothesis in a hypothetical way? Supposing both the burn marks from the fire and the image are caused by thermal energy, part conduction, part radiation, and a little convection. In that case all the marks lie along a spectrum of intensity, from a slight discolouration of the top few fibres to the total carbonisation of whole areas of cloth. Along that spectrum, fibres become increasingly friable.\nLooking at all Mark Evans’s photomicrographs, some areas appear heavily “tufted” and others rather less, as if different handling in different parts of the shroud has resulted in more or less actual breakage. His photo of a burnt edge is very interesting, as it appears to show no tufting – i.e. no breakage of the threads – while his blood photos seem to show quite a lot. I’m not sure what, if anything, all this means, yet!\n\n","date":"March 12, 2014 at 8:01 am","url":"https://shroudstory.com/2014/03/11/is-time-the-secret-ingredient-we-need-to-consider/","cat":"image_theory","id":"comment-87732","author":"Hugh Farey","site":"shroudstory"},{"title":"Is Time the Secret Ingredient We Need to Consider?","post":"Hugh, I agree. looking at the Evan’s photomicrographs. I find ME-09 to be very interesting ( I think that’s the one you were referring to) you can see the whole spectrum of heavily burnt fibres (around the edge of a hole in the cloth) to completely white, background fibres with minimal signs of breakage. I think this image illustrates how tough and resistant linen fibres are, even when burned. I looked at all the blood images and the one titled ME-06 does show more tufting than the other images, I think it could be because the blood was glued to the fibres and with mechanical wear and tear the fibres get pulled out, away from the cloth, with the blood.\n\n","date":"March 12, 2014 at 7:41 pm","url":"https://shroudstory.com/2014/03/11/is-time-the-secret-ingredient-we-need-to-consider/","cat":"image_theory","id":"comment-87930","author":"Mike M","site":"shroudstory"},{"title":"Is Time the Secret Ingredient We Need to Consider?","post":"Get major funding from a mega-corporate or generous philanthropist, a team of reputable scientists together from several disciplines and specialties, and start up an intense programme of well-disciplined experiments.  You’ll want a supply of flax and some know-how on manufacture of ancient linens, oh, and some time-expired lab animals.  Maybe you also need a few earthquakes so California, Tokyo or Christchurch would be good.  They have earthquakes in Piedmont but they’re inclined to be somewhat provincial in their outlook and intruders beyond their borders could be disadvantaged. now\n\n","date":"March 12, 2014 at 10:36 pm","url":"https://shroudstory.com/2014/03/11/is-time-the-secret-ingredient-we-need-to-consider/","cat":"image_theory","id":"comment-87987","author":"daveb of wellington nz","site":"shroudstory"}]
