[{"title":"The Devolution and Evolution of a Maillard Reaction Image Hypothesis","post":"Just thought I’d get in a word or two before the flak pours in.\nThat’s one very fair piece of reporting of another’s blog, Dan Porter, especially as you had to plough your way through to the end of a somewhat self-indulgent ‘thinking-aloud’ spiel-by-instalments to get to the punch line.\nSo my revised thinking re the TS image arguably ticks a few more boxes (notably as regards image-strippability as demonstrated by Rogers with his Mylar adhesive tape, maybe fuzziness too, and also allows for blood-before-image). \nBut I don’t imagine for one moment that it ticks all the numerous boxes. What the model does do is to find a role for a mechanism that can be seen as a half-and-half mix of the purely thermal vs purely chemical, i.e. a thermochemical provenance.\n One has to have the right chemicals present (of foreign origin in this sadly anti-authenticity model – namely exogenous ingredients for a Maillard reaction) and that essential  supply of Arrhenius activation energy that Rogers tried to downplay, namely elevated temperature, way, way above that which could be achieved by a cadaver resting on a slab in a 1st century rock tomb.  His reference to beer-making overlooked one tiny detail – namely that germinated barley is kilned before it’s fermented.  It’s the high-temperature kilning that makes the yellow-brown-coloured Maillard reaction products (“amber-nectar”)\n For me, it’s not about religion. It’s about science (the testable, model-building variety that is).\n\n","date":"October 3, 2014 at 8:24 am","url":"https://shroudstory.com/2014/10/03/the-devolution-and-evolution-of-a-maillard-reaction-image-hypothesis/","cat":"image_theory","id":"comment-158862","author":"Colin Berry","site":"shroudstory"},{"title":"The Devolution and Evolution of a Maillard Reaction Image Hypothesis","post":"Fascinating stuff! Keep following the science of course. Your theory may seem on the surface to preclude an authentist image formation, but then again it may not. If there was a resurrection event (versus simply a natural image formation resulting from decomposition on a cold slab) I would expect some form of energy activity (light/heat) to be in play.\nIn the medieval artisan model it’s conceivable that a combination of specific fluids were combined with a heat source to generate the image. In the authentist model it’s conceivable that bio-fluids and ritual materials combined with a yet unknown energy source (by product of a resurrection event) to produce the image.\nSadly, for now, whatever a resurrection event might entail is beyond our ability to scientifically investigate via model building. But your experiments may at least provide clues (for those of us so inclined to muse in that direction).\nOnward!\n\n","date":"October 3, 2014 at 9:54 am","url":"https://shroudstory.com/2014/10/03/the-devolution-and-evolution-of-a-maillard-reaction-image-hypothesis/","cat":"image_theory","id":"comment-158876","author":"David Goulet","site":"shroudstory"},{"title":"The Devolution and Evolution of a Maillard Reaction Image Hypothesis","post":"I am intrigued by the assumption seemingly common to all Shroud researchers that the images on the Shroud are as they have always been. Perhaps it is because I worked as an archaeologist where one assumed that what one dug up was not how it originally was and so one tried to find evidence of earlier examples to start work on. So far as I can see it is only in the past fifteen years that there has been serious work on textiles with images on them (of which thousands are documented in medieval church inventories, not least to cover everything up at Lent but also in all kinds of hangings) and often conservationists seem to be working on decayed images as there is only a handful of medieval images that are still in pristine condition. Of course, as STURP admitted that they had done no research on these, the area is still open but sadly none of these untouched areas of research seem to be represented at the coming conference.\n\n","date":"October 3, 2014 at 11:05 am","url":"https://shroudstory.com/2014/10/03/the-devolution-and-evolution-of-a-maillard-reaction-image-hypothesis/","cat":"image_theory","id":"comment-158894","author":"Charles Freeman","site":"shroudstory"},{"title":"The Devolution and Evolution of a Maillard Reaction Image Hypothesis","post":"An excellent point Charles. It’s an avenue sorely underserved currently.\n\n","date":"October 3, 2014 at 11:51 am","url":"https://shroudstory.com/2014/10/03/the-devolution-and-evolution-of-a-maillard-reaction-image-hypothesis/","cat":"image_theory","id":"comment-158902","author":"David Goulet","site":"shroudstory"},{"title":"The Devolution and Evolution of a Maillard Reaction Image Hypothesis","post":"“The assumption seemingly common to all Shroud researchers that the images on the Shroud are as they have always been.” Oh, hardly. Many of the ‘painting’ people think the pigment now may be considerably less than when first applied, and contrarily, many of the authenticists think the image as we see it may have taken dozens of years, or a period of intense heat, to appear at all. Only the ‘scorchers’ and the ‘radiationists’ are trying to find a mechanism that will reproduce the shroud as is.\n\n","date":"October 3, 2014 at 4:06 pm","url":"https://shroudstory.com/2014/10/03/the-devolution-and-evolution-of-a-maillard-reaction-image-hypothesis/","cat":"image_theory","id":"comment-158986","author":"Hugh Farey","site":"shroudstory"},{"title":"The Devolution and Evolution of a Maillard Reaction Image Hypothesis","post":"Point taken,Hugh. Yes, it would go without saying that if you take ‘ the Shroud is a  painting ‘ route, it makes sense that you have a decayed image with the pigment largely or wholly lost.\nI must have missed the theory about the image being formed over dozens of years. Even so,if that takes you up to, say, AD 150 you still have many centuries without change.\n\n","date":"October 3, 2014 at 5:22 pm","url":"https://shroudstory.com/2014/10/03/the-devolution-and-evolution-of-a-maillard-reaction-image-hypothesis/","cat":"image_theory","id":"comment-159009","author":"Charles Freeman","site":"shroudstory"},{"title":"The Devolution and Evolution of a Maillard Reaction Image Hypothesis","post":"An analogy is with Volkringer patterns.  The patterns may take several months, even more than a year to form.  Rogers treated bleached Edgerton linen with saponaria and dextrin, no colour.  After evaporation, he exposed it to ammonia for 10 minutes.  A light yellowish colour formed on the surface after about 24 hours.  It might take time or no time, we don’t know.  John’s gospel hints that there may have been something about the burial cloths in the tomb that caused the disciple to believe.  Absence of a specific scriptural text might suggest that the image might have taken decades, or not?!  Not enough adequate experimentation!\n\n","date":"October 3, 2014 at 7:09 pm","url":"https://shroudstory.com/2014/10/03/the-devolution-and-evolution-of-a-maillard-reaction-image-hypothesis/","cat":"image_theory","id":"comment-159040","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Devolution and Evolution of a Maillard Reaction Image Hypothesis","post":"My first query would be concerning the size of the image and how an artist would keep track of the areas that were previously worked while dealing with an acidic liquid that would leave a very faint stain before being heated. The shroud does not appear to have any pre-image outlines. \nI am assuming that the “heating” would be done at once. Otherwise I would expect to see some sort of systemic transition between “sections”.\n\n","date":"October 3, 2014 at 11:40 am","url":"https://shroudstory.com/2014/10/03/the-devolution-and-evolution-of-a-maillard-reaction-image-hypothesis/","cat":"image_theory","id":"comment-158900","author":"Eric","site":"shroudstory"},{"title":"The Devolution and Evolution of a Maillard Reaction Image Hypothesis","post":"Note that I use the term “stain” loosely, since AA is a bleaching agent.\n\n","date":"October 3, 2014 at 12:03 pm","url":"https://shroudstory.com/2014/10/03/the-devolution-and-evolution-of-a-maillard-reaction-image-hypothesis/","cat":"image_theory","id":"comment-158906","author":"Eric","site":"shroudstory"},{"title":"The Devolution and Evolution of a Maillard Reaction Image Hypothesis","post":"Interesting, Colin.\n\n","date":"October 3, 2014 at 12:35 pm","url":"https://shroudstory.com/2014/10/03/the-devolution-and-evolution-of-a-maillard-reaction-image-hypothesis/","cat":"image_theory","id":"comment-158913","author":"Andy","site":"shroudstory"},{"title":"The Devolution and Evolution of a Maillard Reaction Image Hypothesis","post":"Fuzziness.\nLet’s wait another 30 months or more and you’ll think to another box: temperature.\n\n","date":"October 3, 2014 at 12:39 pm","url":"https://shroudstory.com/2014/10/03/the-devolution-and-evolution-of-a-maillard-reaction-image-hypothesis/","cat":"image_theory","id":"comment-158919","author":"anoxie","site":"shroudstory"},{"title":"The Devolution and Evolution of a Maillard Reaction Image Hypothesis","post":"I think I read recently that there have been cases where dead bodies have been known to experience a spontaneous increase in temperature under certain conditions.  It may have been due to some internal chemistry reactions.  If true, a resurrection event wouldn’t be required as a source of heat, which I’d doubt anyway.  I think it’s a mistake to connect resurrection with natural phenomena, it’s supra-normal.  A reputable medical comment might shed further light on whether this natural heating can occur or not.\n\n","date":"October 3, 2014 at 3:12 pm","url":"https://shroudstory.com/2014/10/03/the-devolution-and-evolution-of-a-maillard-reaction-image-hypothesis/","cat":"image_theory","id":"comment-158969","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Devolution and Evolution of a Maillard Reaction Image Hypothesis","post":"But if one does believe in the resurrection one has to consider the possibility that whatever it was, it may have involved energy — in a way we may not currently be able to understand. Of course resurrection may involve time continuums, Star Trek-type dematerialization, angels, or biogenetic mutation. It’s all conjecture and so, yes, we must focus on what we can measure and observe. But as the subtitle of the post notes – you can’t use up creativity.\n\n","date":"October 3, 2014 at 3:25 pm","url":"https://shroudstory.com/2014/10/03/the-devolution-and-evolution-of-a-maillard-reaction-image-hypothesis/","cat":"image_theory","id":"comment-158974","author":"David Goulet","site":"shroudstory"},{"title":"The Devolution and Evolution of a Maillard Reaction Image Hypothesis","post":"Update: following up on a lead from another site, I’ve been able to confirm that milk alone is a substitute for lemon juice/protein for demonstrating the invisible ink effect. It’s because milk has both of the two ingredients needed for a Maillard reaction, i.e  lots of  reducing sugar (lactose) as well as soluble casein and other proteins, at least some of which have lysine side-chains with free -NH2 groups not in peptide linkage.\nMilk is interesting from a technological standpoint too, given it’s ability to form a skin of denatured protein, as happens sometimes when one boils it in a saucepan.\n\n","date":"October 3, 2014 at 4:03 pm","url":"https://shroudstory.com/2014/10/03/the-devolution-and-evolution-of-a-maillard-reaction-image-hypothesis/","cat":"image_theory","id":"comment-158983","author":"Colin Berry","site":"shroudstory"},{"title":"The Devolution and Evolution of a Maillard Reaction Image Hypothesis","post":"It is impossible to understand how a picture has been done without an enquiry carried out by a team of specialists. A team of specialists cannot work without direct and unrestrained access to the picture. Chemists, physicists and similar are not experts in textile conservationism or scientific study of works of art, even though they had read a dozen of books about the subject. This is valid for the Gioconda, Las Meninas or the Shroud of Turin (if ever it was painted or similar).\n\n","date":"October 4, 2014 at 4:33 am","url":"https://shroudstory.com/2014/10/03/the-devolution-and-evolution-of-a-maillard-reaction-image-hypothesis/","cat":"image_theory","id":"comment-159164","author":"David Mo","site":"shroudstory"},{"title":"The Devolution and Evolution of a Maillard Reaction Image Hypothesis","post":"David Mo. Hear,hear. As readers on this site will know, I have long advocated an intensive examination of the Shroud in a conservation lab with experience in dealing with ancient textiles. No one on the STURP team seems to have had any experience in this central, and, as yet, little explored area of Shroud research so the opportunity to carry out even a preliminary examination of these issues when STURP had the Shroud under their noses was missed. Perhaps Dr. Jackson can make it a priority – there are such labs whose impartiality and professionalism is beyond doubt.\n\n","date":"October 4, 2014 at 6:22 am","url":"https://shroudstory.com/2014/10/03/the-devolution-and-evolution-of-a-maillard-reaction-image-hypothesis/","cat":"image_theory","id":"comment-159188","author":"Charles Freeman","site":"shroudstory"},{"title":"The Devolution and Evolution of a Maillard Reaction Image Hypothesis","post":"I know your stance and I agree. I think many sindonists have an exceedingly broad insight on what an expert is. I have discussed this point in my blog in several entries.\n\n","date":"October 4, 2014 at 12:10 pm","url":"https://shroudstory.com/2014/10/03/the-devolution-and-evolution-of-a-maillard-reaction-image-hypothesis/","cat":"image_theory","id":"comment-159262","author":"David Mo","site":"shroudstory"}]
