[{"title":"The pig experiment was not Barrie’s experiment","post":"I consider the most persuasive explanation of the Shroud’s whereabouts during the so-called missing years, 1200 – 1400, is the 2008 paper by Daniel Scavone, who cites sources and documents: “BESANÇON AND OTHER HYPOTHESES FOR THE MISSING YEARS: THE SHROUD FROM 1200 TO 1400”; Daniel Scavone, University of Southern Indiana, Evansville. \nHe provides strong arguments that Othon de la Roche, Seigneur of Athens acquired the Shroud, that it was in Athens during Roche’s seigneurship, and that it would have been returned to his home province of Burgundy, and kept in the cathedral of Besancon, the capital of Burgundy. This independent province was the target of both German and French ambitions for its acquisition. The de Vergy family, descendants of de la Roche had French sympathies, and Scavone makes a good case for Jeanne de Vergy rescuing the Shroud before it was lost in the fire that destroyed the cathedral, and then took it to Lirey in France, where it became part of her dowry as second wife to Geoffray de Charnay. De Charnay himself never said how the Shroud came into his possession, and the Smyrna theory has little substance. \nScavone also suggests that one explanation for the infamous D’Arcy memorandum, is that when the cathedral was rebuilt, Jeanne arranged for a copy of the Shroud to be sent to Besancon to replace the original she had rescued. The relic was after all her family’s property acquired by her ancestor. D’Arcy may have mistakenly believed that the true Shroud was in Besancon, may have heard about the copy being made, and was perhaps confused by all this business.   \nIt is a difficult matter getting all the facts correct in any TV documentary, but deadlines have to be met, and as Barrie apparently commented to Dan, producers have sometimes to fall back on “creative editing”. Unfortunately the power of the media is such that the viewing public are inevitably left with false impressions.\n\n","date":"May 21, 2013 at 8:15 am","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34195","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"Here’s a part of Rogers book that the producers of the TV program must have read carefully before doing their test with the pig.  It is a description of a coloration experiment done by Rogers himself with a linen sample made with the ancient method of making linen cloths that he obtained from Kate Edgerton, a linen expert):\n“A sample of Edgerton’s bleached linen was placed on four drops of dextrin solution on a plastic plate (note: this was done to simulate crude starch that could have been used to protect the threads during the original weaving of the Shroud and traces of it could have been part of the thin layer of carbohydrate impurities that could have been colored by a Maillard reaction).  A round spot was obtained.  The water was allowed to evaporate from the cloth.  No color could be seen on either surface.  The middle of the same sample was placed on four drops of Saponaria solution.  The wet spot expanded radially through the cloth.  The water was allowed to evaporate, and no color could be observed.  The sample was then treated at room temperature for 10 minutes with ammonia vapor.  A VERY LIGHT COLOR could be observed on the top surface after standing 24 hours at room temperature.  \nTHE SAME EFFECT AS AGING CAN BE OBTAINED BY HEATING MAILLARD REACTIONS.  The reaction rates are determined by the Arrhenius activation energies and pre-exponentials of the processes, and the rate is an exponential function of the temperature.  REACTIONS THAT REQUIRE YEARS AT NORMAL TEMPERATURES CAN BE ONTAINED IN MINUTES AT ELEVATED TEMPERATURES.  The rates of different Maillard reactions increase by factors between two and three for each 10C (18F) increase in temperature.  This indicates that they have relatively low activation energies; rates will be significant at lower temperatures.  The color shown in figure XI-4 (note: the picture we see in Rogers book show a very distinct yellow coloration of the linen sample, pretty much like the body image we see in the more dense parts of the Shroud’s body image) DEVELOPED AFTER A FEW MINUTES OF HEATING AT 66C (150F).  This temperature is far too low to scorch cellulose.  \nFigure XI-4 shows that the most intense color appear in the ring on top.  Some color appears around the ring on the back surface; however, the center of the back is nearly colorless.\nExperimental manipulations of concentrations and one-dimensional migration of solutions, as in a large cloth, could produce the same front-to-back color separation and color density as observed on the Shroud.\nThe fibers on the top-most surface are the most colored when observed under a microscope, and the color is a golden yellow similar to that on the Shroud (figure XI-5 / note under the picture : “Medullas are clear”).  The coating of Maillard products is too thin to be resolved with a light microscope, and it as all on the outside of the fibers.  There is no coloration in the medullas: The color formed without scorching the cellulose.\nThere is a very little color on fibers from the middle of the back surface (figure XI-6 / note under the picture : “A nearly colorless fiber from the middle of the back surface of figure XI-4.  Reactants were concentrated at the evaporating surface.”).  The color-producing saccharides had concentrated on the evaporating surface.\nWater-stained image areas on the Shroud showed that image color does not dissolve or migrate in water.  Maillard products are not water soluble, and they do not move when wetted.\nAs a peripheral, non-scientific comment, several Shroud researchers have wondered why there is no mention of an image on the “cloths” reportedly found in Jesus’ tomb.  Assuming historical validity in the accounts, SUCH A SITUATION COULD BE EXPLAINED BY THE DELAY IN THE DEVELOPMENT OF THE MAILLARD REACTIONS’ COLORS AT MODERATE TEMPERATURES.  NO MIRACLE WOULD BE REQUIRED.”\nFinal comment from me: If the TV producers had read carefully this section of Rogers book, they would have come easily to the conclusion that a heating of the linen sample after he had been in contact with the pig’s body was truly needed in order to see some clear coloration on the cloth.  Unfortunately, they did nothing of that nature and that’s most certainly why there was no image at all on the cloth after the experiment…  But, as I said before, the simple fact that there was already some colored fibers pretty much like the ones we see in the image area on the Shroud is a proof that a Maillard reaction was already in place and was slowly developing at room temperature.  In the case of the Shroud, this is probably what also happened, which explain why no Gospel writer has made any mention of an image on Jesus’ burial cloth.  In any case, it is safe to assume that if the image on the Shroud is a product of a natural phenomenon, this type of image was surely a latent image that took months, years, decades or even centuries to fully develop.  And if there really is a thin layer of carbohydrate impurities at the surface of the Shroud and if the Shroud man’s body stayed inside the cloth for more than 24 hours, it is also safe to assume that a Maillard reaction was already in place on the cloth at the time the cloth became empty and this reaction most probably took part (in what proportion?) in the formation of the final image…\n\n","date":"May 21, 2013 at 8:27 am","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34196","author":"Yannick Clément","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"The Shroud lives!\nThe most interesting thing about this controversy seems to be the FACT that the militant atheists can’t escape the Shroud and so must destroy its authenticty. They can not accept a world (or esistence) in which the Shroud of Turin proves not only that Christ existed, but that in three days his body parted company with his burial cloth.\nI have a lot more to say about the Shroud and the media but becasue it goes off topic I posted it on my Quantum Christ blog: http://quantumchrist-jck.blogspot.com/\n\n","date":"May 21, 2013 at 9:15 am","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34203","author":"John Klotz","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"I started a  comment on this but felt I was going a stray from the main piece. It’s dels with how the Main Stream Sceientific Community (the MSSC) must marginalize those who support the Shroud authenticity – at least those parts who find the Shroud’s authenticity incompatible with their atheism/agnosticism. See http://quantumchrist-jck.blogspot.com/\n It’s called The Shroud, Dr. Pangloss and Sammy Glick.\n\n","date":"May 21, 2013 at 9:24 am","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34204","author":"John Klotz","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"Why is there no mention of the Knights Templar? Scavone did indeed make a lot of studies on the whereabouts of the TS after the Fourth Crusade, which are worthy of appreciation,  but as far as I know his paper was rejected at one Shroud congress in Italy. If de la Roche was such a devout Catholic why didn’t he inform Rome about what he had in his  possession? In this regard, one question I asked Daniel Raffard de Brienne did not receive a satisfactory answer. He insisted that the Templar “head” was a sculpture, basing his opinion, in my view, on the depositions, with “confessions” extracted under torture. There are gaps waiting to be filled.\nRegarding the documentary, it is not all surprising that Barrie had nothing to do with the experiment with the pig and it reminds one of what was done to Professor François Bovon during the production of the “Jesus family tomb” documentary.\n\n","date":"May 21, 2013 at 3:53 pm","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34232","author":"Louis","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"Any evidence supporting the hypothesis that the Templars held the Shroud after its disappearance in Constantinople is scant and tends to be speculative. It rests on few assertions: 1) An earlier namesake of Geoffray de Charnay was burnt at the stake with Jaques de Molay, the last principal of the Templars; the latter Geoffray, bearer of the oriflamme, seemed keen to restore French knighthood to the former chivalrous standards of the Templars; (2) The accusations that the Templars worshipped a “head”; this was only ever admitted by Templar menials under torture who would not have been privy to the “inner circle” secrets; the inquisitors had earlier made the same accusation in their persecution of the Cathars – the “head” accusation would seem to have been intruded into the enquiries by the inquisitors themselves; 3) Barbara Frale has claimed that there was evidence in Vatican archives supporting the Templar custody of the Shroud, but seems to have ignored Ian Wilson’s requests for information to substantiate her assertions – Wilson now seems to be of the view that Frale does not have such evidence. \nOthon de la Roche was Burgundian, probably wth French sympathies as were his descendants. He may have seen no reason to inform the Roman Pope of his questionable acquisition, even though the Patriarch of Constantinople had written the Pope complaining of the Frankish theft. The Avignon Papacy proper was 1309-77; There followed the Great Western Schism 1378-1417. The French of course supported the Avignon anti-popes. The first of these was Clement VII who enjoined on Bishop D’Arcis perpetual silence on the matter under pain of excommunication. Maybe Clement VII knew more about the matter than history records.  \nScavone’s paper had already been presented at the Ohio Shroud conference in 2008, I have no idea why it was not accepted at an Italian conference, perhaps it was seen merely as a repeat, or one might speculate on other reasons. One can never know what drives such agendas. The paper should stand on its own merits and can be found at:\nhttp://ohioshroudconference.com/papers.htm\n\n","date":"May 21, 2013 at 5:59 pm","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34245","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"What is meant by “he may have seen no reason to inform the Roman Pope of his questionable acquisition”? Did or didn’t he know what was in his possession? This has to be explained further.\nIf the paper was not accepted at the conference in Italy it was surely because there were yawning gaps that had not been filled. \nMy research, part of it on-site, will have to await further consultation with experts before an article is published,and there is another lead, relating to the face of Jesus, and the government organ has asked me to wait till a more detailed report is obtained, after which I can publish what I want to.\n\n","date":"May 21, 2013 at 6:48 pm","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34248","author":"Louis","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"As mentioned in a previous posting, without the inclusion of a control group(s) in the pig experiment, any meaningful interpretation related to image formation is weak at best.  This is putting it kindly.  I understand that it wasn’t Barrie’s experiment-will wait for the next shroud.com update for any related information about the program/details.    \nA general comment: Is the Maiilard reaction, in of itself, sufficient to explain the (uniform) degree of resolution of a collimated image?  I think the Maillard could be part of it, but I am not so sure it could explain everything.  If involved, I would have to go Maillard plus.  What the plus is/could be, I don’t have a clue.  \nFor me, the Maillard reaction makes sense, but by itself has some issues-why the calves, buttocks don’t appear more flattened, differentially resolute in certain areas?  Relative to the skin, what about the hair?  With multiple surface area(s) of matted hair, would the image be expected to appear more resolute in areas?  more blurry in others?  \nThe coloration of fabric has been demonstrated by application of reagents important in the Maillard reaction, baking the cloth to simulate aging, okay, the color is there-but has anyone shown the resolution/detail of an image from an underlying object with the reaction?\n\n","date":"May 21, 2013 at 8:23 pm","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34254","author":"Kelly Kearse","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"Hi Kelly, \nRay Rogers told me personally that he believed, “Something else was at work with the Maillard reaction,” but he didn’t know what that was and didn’t live long enough to explore it.\n\n","date":"May 21, 2013 at 11:53 pm","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34276","author":"Barrie Schwortz","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"I think a very good possibility to explore in deep would be the hypothesis described by John De Salvo concerning the Volckringer pattern effect that came from plants that were put in direct contact with paper.  De Salvo thought that lactic acid was the substance that could create images of plants on paper and that lactic acid was also probably present all over the Shroud man’s body via his sweat…  I think this could be the “something else” of Rogers…  In truth, that’s a good possibility to explore.\n\n","date":"May 22, 2013 at 8:30 am","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34316","author":"Yannick Clément","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"Mr. Kearse, I really think you should read Rogers book because he address all the issues you describe…  Personally, I would say this :  Since we know that the Shroud is a real burial cloth that contained for less than 72 hours the dead body of a tortured and crucified man, I can’t imagine that a Maillard reaction is not, at the very least, part of the solution concerning the body image on the Shroud.\n\n","date":"May 22, 2013 at 10:56 am","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34330","author":"Yannick Clément","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"These are good questions because it looks like the Maillard reaction will not explain everything.\n\n","date":"May 21, 2013 at 9:30 pm","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34260","author":"Louis","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"Before being so definitive in your statement, I think you should wait for more experiments to be done in order to fully test the hypothesis of Rogers.  Personally, I still wait for a CSI expert or someone like that to take over Rogers preliminary work on the Maillard reaction hypothesis and push it further (and maybe complete it with a parallel process that could have been active at the same time in order to give the image a so high resolution).  More testing should be done before we can draw any definitive conclusion regarding Rogers very interesting hypothesis.\n\n","date":"May 22, 2013 at 10:35 am","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34325","author":"Yannick Clément","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"Louis’ queries re Scavone’s paper: I think they are dealt with in the paper which should be referred to in the URL reference I have given. \n“…no reason to inform the Roman Pope…”; pp4-5, “Theodore Angelos, brother of Michael, Despot of Epirus, wrote to Pope Innocent III, complaining that the Shroud of Jesus had been taken to Athens.” … “In 1205 Pope Innocent III was still threatening to excommunicate the leaders of the western crusading forces for the looting of Christian Constantinople.” Etc. I should be interested to learn if any Crusader leader provided a Pope with inventories of the several relics looted from Constantinople. \n“…there were yawning gaps that had not been filled …”: Scavone makes it clear that this is sadly inevitable, due to the destruction of records. We can only proceed by intelligent speculation based on what evidence still remains. St Stephen’s Cathedral in Besancon was destroyed by fire in 1349. See p.13: “… local scholar Chifflet in 1624 knew nothing of Othon” – clearly the records if still surviving would have mentioned him. Concerning the destruction by French Revolutionaries in Besancon, archivist Gauthier wrote in 1901: “And when . . . the delegates of the departmental directory of Doubs\nthrew to the fire or shredded . . . all the administrative records of the diocese over four centuries . . . this destruction . . . reduced by about nine-tenths the sources of the Archbishopric . . . . [Now] all together they form only 534 articles . . . from 1412 to 1790.” \nThe lack of material clearly allows open speculation on what may have happened, and inhibits any dogmatic assertions. However such evidence there is, clearly points to Besancon, Othon and Jeanne de Vergy. \nI do not know what to make of Louis’ cryptic 3rd paragraph, and would prefer he provided some enlightenment by way of an appropriate reference or else be more explicit.\n\n","date":"May 21, 2013 at 11:28 pm","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34273","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"Re pig experiment and Maillard: Kelly Kearse again makes some excellent points. If Maillard is the principal action, then it clearly requires something else as well, specific environmental conditions and possibly some mechanism to collimate the gas particles such as radon seismic exhalations. \nRadon (Rn): 7.5 x heavier than air, decay product of radium. Rn-222 has a 3.823 day half-life, and emits alpha particles. Tubes of radon gas are used clinically as a source of penetrating gamma radiation resulting from decay product Bisthmuth-214.\nBy the late 1980s, naturally occurring radon gas had come to be recognized as a potentially serious health hazard. The gas, arising from soil and rocks, seeps through the foundations, basements, or piping of buildings and can accumulate in the air of houses that are poorly ventilated. Exposure to high concentrations of this radon over the course of many years can greatly increase the risk of developing lung cancer. Indeed, radon is now thought to be the single most important cause of lung cancer among nonsmokers in the United States. Radon levels are highest in homes built over geological formations that contain uranium mineral deposits. The gas is commonly released during seismic activity. Gospel accounts relate that an earthquake occurred soon after the crucifxion.\n\n","date":"May 21, 2013 at 11:51 pm","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34275","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"Lactate will be abundant in the blood of the person tortured, beaten and under the stress condition described by the Gospels. Lactate level is a marker in certain conditions since it is a  common substrate an product of metabolic reactions\n\n","date":"May 22, 2013 at 8:50 am","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34317","author":"jesterof","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"TO BE OR NO TO BE ARCHAEOLOGICALLY AWARE\n YC wrote: “And it’s important to understand that such researches will need to be done in the future with some baking of the linen samples to simulate ageing and to clearly see an\nimage at the surface of the linen cloth.”\n   When will YC et al seriously consider the burial sheet being first moistened or in-soaked with aqueous alkaline solution (e.g. ashes, Jerusalem limestone dust and/or urea residues mixed with pure living water/collected rainwater), could have been then subjected to a low temperature accidental/providential thermal imprinting process (e.g. ritual fumigation and/or corpse hyperthermia). Reminder 1: Dead kings’ cave tombs and corpse could be fumigated (see 2 Chronicles 16:14 – 21:19 Targum). Hence, in the hypothesis the Turin Shroud is Yeshu’a’s, the body could have been subjected to a specific purifying/drying out ancient Judean ritual in the shape of fumigation/burning aromatic woods/spices and at least one incense pan to hold burning charcoal could have been used. Most likely the body image only affected a superficial thin layer of impurities made of starch, lignin, pectin, saponin, hemicellulose deposits and/or flax wax. 2: Jerusalem limestone dust mixed with water can gelatinize starch at 55°-85°C and act as as a extremely fine printing paste.\n  Then Kelly asked: “Is the Maillard reaction, in of itself, sufficient to explain the (uniform) degree of resolution of a collimated image?”\n   Not at all! Adhesion of water insoluble (e.g. iron oxyde and/or other “opaques”/silica particles present in the desert of Judea dust) onto the blood-covered body skin and/or receiving flax surface are most needed so as to collimate the TS man’s image, which implies a tightly wrapped up body and then the long shroud used as inner shroud, gradually loosening somehow back and front though shrinking up. Reminder: the Sharaf (the biblical RuHa Qâdim or East Wind) is an Israel dust wind more commonly known as Khamsin or the Dark Breath of the desert of Judea.\n  Then Kelly asked: “For me, the Maillard reaction makes sense, but by itself has some issues-why the calves, buttocks don’t appear more flattened, differentially resolute in certain areas?”\n  When will Kelly et al seriously consider the TS man’s stiff rigid corpse could have been first wrapped up and then laid out IN EXTRA HEIGHT on two raised stones to be subjected to a ritual myrrhic aloetic fumigation in the antechamber. Reminder: this implies the presence of 5-6 buriers. Also note:  A resin such as that of the fragrant myrrh has always been associated with fumigation and purification rituals. As a ‘funeral’ herb, myrrh is said to ease grief and heal emotional wounds, bringing peace and calm. Besides it has anti-microbial properties. When burned with moistening rotten aloe wood chips (moistening helps produce more smoke), some carbon monoxide is liberated along with smoke.\n  According to my thesis, the Sindon Image is a cryptovolumetric bloody-body-cloth-CONTACT-AND-GRADUAL-LOSS-OF-CONTACT 2D to 3D IMAGE resulting from a collimated/auto-regulated light (or pre-)mordanting of a thin carbohydrate layer of impurities. My thesis neither include nor preclude the TSM’s resurrection or coming back to life.\n  Final reminder: A full body silicone medical mannequin realistic replica of the Sindon Man with water chamber (to be filled with heated water to simulate body and body hyperthermia temperatures) and fully jointed neck, shoulders, elbows, wrists, knees, and ankles (to provide a deathlike range of similar rigor mortis positions) + 3-4 sets of ad hoc linen cloths (both medieval and late antique replicas) are most needed so that the Sindon’s Man specific burial could be reconstructed.\n\n","date":"May 22, 2013 at 9:20 am","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34319","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"Re # 13 Barrie categorically (# 9) states that Rogers told him “that something else was at work with the Maillard reaction” and that was what I was stressing before he wrote this and it is therefore a very welcome comment which I’m sure will be taken seriously by the scientists involved in this topic. Barrie wisely also distanced himself from the pig experiment, in which he had, not surprisingly, no part, presumably also nipping in the bud calls — by way of comments on this blog — for more blood sacrifices, something that would tarnish the image of those involved in Shroud studies.     \nRe #14 Here are the replies to David’s comments:\n1) “I should be interested to learn if any Crusader leader provided a Pope with inventories of the several relics looted from Constantinople. ” The answer is in the comment itself. Naturally no crusader would provide any Pope with inventories because the relics were looted. Further, who said all those who took part in the Fourth Crusade were crusaders? If one refrains from researching by appealing to wikipedia or other search engines, studying what historians wrote in books, even though that means hours before anything can be posted in reply, it becomes clear that mercenaries were involved and they were financed by the Doge of Venice. If de la Roche had the Shroud, it follows, he, too, was one of the looters, but as he is said to have been a devout Catholic the question that arises is Why did he not inform the Pope? He could have written a “confession” and told the pontiff that his intention was to keep the relic in safe hands. Destruction of documents in France? OK. But there should have been some document in Rome, so then comes the readymade answer that it could have been inside the archives looted by Napoleon?!   \n2) There were no dogmatic statements on my part. On the contrary, it was clearly stated, more than once, that gaps had to be filled.  \n3)   There are absolutely no cryptic remarks in my third paragraph, so any attempt to know in advance what I am obliged to keep quiet about, not least because of ethics, will fail. It is clear that there is no dependence on search engines and the matter is being dealt with in a professional manner, with results not to be announced in a blog but written in a paper. After  the in-depth research leaves no room for doubt.\n\n","date":"May 22, 2013 at 12:38 pm","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34342","author":"Louis","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"Thank you Louis for your response to my comments. \n1) My recollection from reading is that the Patriarch’s complaint to the Pope was that the Venetians took the gold and it was the Franks who took the relics. It seems that Pope Innocent III was still threatening the looters with excommunication. Othon de la Roche may have been a good Catholic, but perhaps he had stronger loyalties to Burgundy and France. Any failure in not informing the Pope of what he had in his possession, for safe-keepinig or otherwise, I do not see as a strong argument against his possession of the Shroud. I do not follow Louis’ reference to wikipedia. Scavone’s paper has stronger citations than that.  \n2) “dogmatic assertions”: I was not implying any accusation against Louis. The comment was intended to convey that because of the loss of records, definite positive historical assertions were impossible to make, that only intelligent speculations could be made, based on such evidence that is available. I have only maintained the position that Scavone’s explanation is the most persuasive that I’ve seen to date. If further evidence should ever come to enlighten us further, that would be so much the better to reach the truth of the matter.   \n3) “cryptic remarks”: My comment was intended to be honest, as I did not understand your drift. You indicated some of your research was “on-site” and I was hoping for a reference to that at least. You only hint that you are privy to some other information to throw a different perspective on the matter, with no indication what that might be. I shall look forward to reading it when it comes to the light of day.\n\n","date":"May 22, 2013 at 4:44 pm","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34365","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"Reminder for YC: There are myrrhic-aloetic particles in the threads not on the surface (Baima-Bollone) of the Shroud and on the surface of the Sudariumf of Oviedo. These observations are still to be  independently confirmed though.\n\n","date":"May 22, 2013 at 12:56 pm","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34344","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"Since Rogers looked for these particular substances and came up empty, I am very doubtful concerning Baima Bollone’s claim concerning the presence of aloes and myrrh (on the Shroud at least)…  This independent analysis of Rogers have produce a different result, that’s why I’m so doubtful.\n\n","date":"May 22, 2013 at 1:05 pm","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34346","author":"Yannick Clément","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"Did Ray only examine the surface?\n\n","date":"May 22, 2013 at 1:57 pm","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34348","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":".for myrrhic-aloetic particles\n\n","date":"May 22, 2013 at 1:59 pm","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34349","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"If aloetic-myrrhic substances are neither on the surface and neither in the threads, that could mean the shroud was not in direct contact with the fumigation but shorter outer shrouds also wrapped up the corpse and acted as a screen.\n\n","date":"May 22, 2013 at 2:08 pm","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34351","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"…. shorter outer shrouds AND/OR a longer outer shroud\n\n","date":"May 22, 2013 at 2:11 pm","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34352","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"\nYannick Clément :\nSince Rogers looked for these particular substances and came up empty, I am very doubtful concerning Baima Bollone’s claim concerning the presence of aloes and myrrh (on\nthe Shroud at least)…  This independent analysis of Rogers have produce a different result, that’s why I’m so doubtful.\n\nCompletely different techniques used in each case-tough to say\nSamples from the same areas would need to be analyzed by the same method(s) to really know where this stands\n\n","date":"May 22, 2013 at 3:16 pm","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34356","author":"Kelly Kearse","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"Mr. Kearse, if you read Rogers book, you’ll see how confident he was on the fact that there is nothing of that nature on the Shroud.  In fact, on this subject, Rogers seemed in his writting to be as confident about that as the fact that the main body of the Shroud is made of 100% linen…  I found it hard to convince myself that Rogers could have miss something he was definately looking for.  By the way, it’s the same thing concerning the lack of proof of the presence of saponaria on the cloth.  Rogers search hard to find traces of this product but he never was able to succeed.  Of course, in this case, as well as in the case of aloes and myrrh, it is possible to think that all traces of these substances could have been “washed away” with time, but Occam’s razor would tell us that it’s easier to think they were never used on the Shroud.\n\n","date":"May 22, 2013 at 3:41 pm","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34359","author":"Yannick Clément","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"Just a quick correction for the last sentence of the last point (#7) I wrote in the comment that is published as the main topic on-top of this page.  You should read this instead : “…THAT DOESN’T MEAN THE SHROUD MAN IS SOMEONE ELSE THAN JESUS AND/OR THAT JESUS RESURRECTION NEVER HAPPEN.”  Now, it’s easier to understand that way.\n\n","date":"May 22, 2013 at 3:44 pm","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34361","author":"Yannick Clément","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"\nYannick Clément :\nMr. Kearse, I really think you should read Rogers book because he address all the issues you describe…  Personally, I would say this :  Since we know that the Shroud is a real burial cloth that contained for less than 72 hours the dead body of a tortured and crucified man, I can’t imagine that a Maillard reaction is not, at the very least, part of the solution concerning the body image on the Shroud.\n\nM. Clement,\nI really think you should read my comments more carefully.  Personally, I would say this: I have read Rogers book.\n\n","date":"May 22, 2013 at 4:54 pm","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34367","author":"Kelly Kearse","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"it does not seem at all to me…  He address properly and in details all the question you asked.\n\n","date":"May 23, 2013 at 8:31 am","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34448","author":"Yannick Clément","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"\nYannick Clément :\nMr. Kearse, if you read Rogers book, you’ll see how confident he was on the fact that there is nothing of that nature on the Shroud.  In fact, on this subject, Rogers seemed in his writting to be as confident about that as the fact that the main body of the Shroud is made of 100% linen…  I found it hard to convince myself that Rogers could have miss something he was definately looking for.\n\nSee comment #29-I have read the book!  \nIt is not a matter of missing something or being confident-it is possible that both sets of studies are correct, you know.  Different methods can yield different results-it’s not a novel idea.  It seems biased to accept results that one wishes to and discard those that may disagree-I would keep both possibilities open-many bench scientists have experienced a situation where different results were obtained by different investigators-the issue becomes magnified when completely different techniques are used.  The only way to truly sort it out is to go side by side.\n“By the way, it’s the same thing concerning the lack of proof of the presence of saponaria on the cloth.  Rogers search hard to find traces of this product but he was never able to suceed”  \nSo, if an alternative method was used to evaluate the carbohydrate profile (using labeled probes, for example), and traces of glycosidic residues (Saponaria products) were found, would this be accepted because it fits the results you’d like to see or dismissed because it wasn’t previously found (even by Rogers)?  Quoting results without consideration of different methods that may have been used is an oversimplification of the findings.  It can become apples and oranges relatively quickly.\n\n","date":"May 22, 2013 at 5:24 pm","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34372","author":"Kelly Kearse","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"If another test conclude in the future that there is traces of saponaria, I would not be willing to accept it blindly because I always try to follow this good reasoning :  Until one finding can be independently confirmed, it’s better to be prudent regarding that finding.  I’m also very prudent regarding conflicting analyses like the ones done by Rogers and Baima Bollone concerning aloes and myrrh.  Until a new independent analysis could prove that there are really traces of these substances on the Shroud, I’m not ready to accept Baima’s claim, sorry.  Neither did Rogers by the way!\n\n","date":"May 23, 2013 at 8:36 am","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34449","author":"Yannick Clément","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"David\nThanks for the clarification, only it will apparently not lead to any agreement because, I have to reiterate, gaps have to be filled. There is the chest kept in the de la Roche castle, the Templecombe image, psalm 57 sung during the Templar Masses, and the fact that both Othon and some Knights Templar came from noble families. There must have been more contact between him and the Templars, who were lodged in heavily guarded monastery-fortresses, safe places to preserve any very important relic, making it a strong possibility that Othon only made sure the relic was transferred safely from Athens to France. Further, although the knights did not take part in the Fourth Crusade they were known to have sent spies to Constantinople.There is nothing in my comments to suggest that it was Scavone who was consulting wikipedia; you yourself refer to this source quite frequently, but there is always the need to go deeper, although that takes a lot more time… and research.\n\n","date":"May 22, 2013 at 5:57 pm","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34374","author":"Louis","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"Have Dave et all ever heard of the De Molay De Vergy family? If not see Acta Templarorium ou la prosopographie des templiers de Jean-luc Alias,\n\n","date":"May 22, 2013 at 6:26 pm","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34376","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"Perhaps from Nantes you could go to other regions in France and contribute more to Shroud research.\n\n","date":"May 22, 2013 at 9:12 pm","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34387","author":"Louis","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"This is the first indication I have had that there may have been a known family connection between the De Molay and De Vergy families. As both families seem to have been prominent with somewhat similar sympathies, it is perhaps not so surprising. It may give traction to the view that Jeanne De Vergy had rather more to do with ownership of the Shroud than did Geoffray de Charnay, although here again, there may have also been other family links.\n\n","date":"May 23, 2013 at 1:41 am","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34398","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"Re “saponaria”. The word comes from Latin saponis, soap. Now soap requires alkaline bases, like wood ashes and fat. The latter can be replaced by human sebum/tallow residues…\n\n","date":"May 22, 2013 at 6:36 pm","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34378","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"Re starch, reminder: starch as carbohydrate is the main provider of energy to most living things.\n\n","date":"May 22, 2013 at 6:51 pm","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34379","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"The fact is no medieval historian really know Jacques de Molay’s place of birth. There are 3 possibilities…\n\n","date":"May 23, 2013 at 5:02 am","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34409","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"…and one of them is directly linked with the De Molay De Vergy family.\n\n","date":"May 23, 2013 at 5:07 am","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34411","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"\nYannick Clément :\nit does not seem at all to me…  He address properly and in details all the question you asked.\nOkay, here’s the main question I asked (from previous post # 8):\n“The coloration of fabric has been demonstrated by application of reagents important in the Maillard reaction-but has anyone shown the resolution/detail of an image from an underlying object with the reaction?\nGive me the page number(s) or experiment(s) for this-I have the printed e-version of the book, perhaps I am missing some pages?\nRegarding the paper mâché hand & bolt experiments, in my opinion if you didn’t know what the template was, one would be hard pressed to identify what the resulting images were based on.  The experiments show coloration, yes, of course; resolution, detail-not there for me.  Rotate the hand image 90 degrees, evaluate it, rotate again another 90 degrees, evaluate it-it could be anything-the diffuseness of the image does not allow a clear identification-if sufficient detail were there, viewing at different angles would not really matter that much.\nI think Ray Rogers was an excellent, knowledgable scientist-I have great respect for his work-I also think he would grow impatient with repetitive parroting of his findings without the goal of extending them and exploring the science behind them in more detail.  Otherwise, one becomes entangled in the parrotic fringe.  I believe that good work such as his will stand the test of time-and because of its soundness & scientific integrity, it will also be refined and reconsidered as work progresses.  It does injustice to the work to oversimplify  and overextend it as such.\n\n","date":"May 23, 2013 at 8:43 pm","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34536","author":"Kelly Kearse","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"The paper maché hand and bolt are the answer to your question but, of course, these were PRELIMINARY experiments done by Rogers and they only had one purpose :  to see if a Maillard reaction could produce an image with a good level of resolution.  And with these preliminary results, Rogers in his book was able to answer “yes”.  Of course, much more testing need to be done with various environmental, biological and linen cloth conditions in order to see if a better result than the one obtained by Rogers with his preliminary tests can be achieved. And be certain of one thing :  if Rogers would not have been satisfied with his preliminary tests, he would never have showed them in his book in order to back-up his hypothesis.  What is the most important thing to remember here is the fact that these were just preliminary tests and never intended to reproduced an image of the same quality as the one on the Shroud.  People are much to critical versus the result obtained by Rogers because they tend to forget this important aspect of his work.\n\n","date":"May 24, 2013 at 10:49 am","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-34626","author":"Yannick Clément","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"Dear Sir\nI would like all references to me removed from this site. \nI am a serious scientist and not some fringe person\nI was also ill advised to appear on this recent Smithsonian Channel documentary which claimed that a real scientist was going to evaluate my findings!!!\nAlso, I explained back in 1992 about the stigmata issue and if one actually bothers to do their homework instead of wasting their time on mindless speculation, they will soon discover that I have written about this and many other issues repeately over the past twenty or so years.\nThe blood (or blood-like reagent) was painted by brush onto the shroud after the body image was created photographically. Please note that all blood “flows” on the shroud contain acute angled kinks isomewhere along their supposed flow. This is caused by an artiistic flick of the wrist during painting. Also, all blood flows, regardless of where they supposedly emanate from, exhibit the same thickness and consistency. \nPlease take me off your site and refrain from misquoting me as this just confuses your reader further.\nProf Dr NPL Allen\n\n","date":"April 23, 2014 at 9:00 am","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-102746","author":"Prof Dr Nicholas Peter Legh Allen","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"Dear Prof Allen,\nI regret to inform you that the Shroud of Turin Blog does not make exceptions for serious scientists. And though it pains us to do so, we occasionally discuss the work of non-fringe people such as you.\nI am sorry to hear that you were ill advised to appear on this recent Smithsonian Channel documentary which claimed that a real scientist was going to evaluate your findings. If you would care to submit a guest posting to this blog, I promise you that it will be discussed by a real scientist. \nApparently, you are more than a scientist. According to your profile at Freelanced, “Prof Dr NPL Allen has been lecturing both Fine Art and Art History since 1981. From 1985 – 2007 he worked at the Faculty of Art and Design (PE Technikon) where he was the Head of the Fine Art Department (1995) and Dean of Faculty (1996 – 2007). Qualifications: Dip. F.A., M.F.A., M.A., D. Phil., D.Laur. Tech. \nThis is great news but regrettably makes it even more difficult to make an exception for you.  How can we do so and still discuss your theory “that all blood ‘flows’ on the shroud contain acute angled kinks somewhere along their supposed flow. This is caused by an artistic flick of the wrist during painting. Also, all blood flows, regardless of where they supposedly emanate from, exhibit the same thickness and consistency.” All of this contradicts the conclusion of other real scientists. \nThank you for commenting in the fringe.\n\n","date":"April 24, 2014 at 8:56 am","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-103196","author":"Dan","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"\nProf Dr Nicholas Peter Legh Allen :\nthe body image was created photographically.\n\nWe can say it’s absurd, it’s an anachronism.\nMore basically, among other critical points, a single optical system can’t reproduce the fluctuations of resolution (obviously missing in your reproduction).\n\n","date":"April 24, 2014 at 12:46 pm","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-103280","author":"anoxie","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"Oh really? I wish I could also detect Pr. Dr. Allen’s artistic flick of the wrist (during his painting the blood or blood-like reagent) on his Turin shroud replica. How come he just forgot to paint the blood on it?!\n\n","date":"April 24, 2014 at 9:47 am","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-103217","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The pig experiment was not Barrie’s experiment","post":"Dan, even today, 24th April, 2014 no one can say what is fringe and what is non-fringe. Absolute truth lies with God.\n\n","date":"April 24, 2014 at 1:07 pm","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","id":"comment-103283","author":"Louis","site":"shroudstory"}]
