[{"title":"The Shroud is a Holograph?","post":"Very interesting.\n\n","date":"July 22, 2015 at 7:17 am","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-206313","author":"Dcn Andy","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"“I can affirm without fear of being proven wrong … ” Ho ho. Almost nothing of Dave’s video or his comments above shows any knowledge of either the Shroud or holography, and some of it is simply untrue. “I’m willing to hear more from Dave and anyone else,” says Dan. Well, you asked for it.\nOf his first 8 similarities, some apply to any photograph, some are irrelevant to holography, and some are simply untrue.\n1) The image on the Shroud is perhaps 20nm thick. The image of a hologram is captured in emulsion about 8000nm thick.\n2) Almost any picture has ‘good resolution.’\n3) The 3D quality of the Shroud is qualitatively different from the 3D quality of a hologram, which does not record any information about distance by means of image intensity.\n4) Very few pictures can be seen from the back side.\n5) “Both have light coming from only 1 direction to form image.” If this statement means anything, it is untrue. It may be referring to the Shroud as a result of collimated radiation from a dead body, in which case the light rays would be parallel, but a a hologram relies on light coming from two directions in order to create an interference pattern, which is what a hologram is. One way of making a hologram is to have a single source, and the interference pattern is created by the reflection from the object coming back in the other direction. This requires a transparent film, which the Shroud is not.\n6) “Both images fade and or vanish when tilted to the far right or far left.” The Shroud does no such thing.\n7) Any monochrome picture is ‘single colour.’\n8) “Both images involve subject close to film plate to capture image (past 5cm there is no image formation on a reflection hologram) (I know because I tried it).” If the Shroud was created by light emanating from a body, then it would not be attenuated to zero over 5cm. If the Shroud image demonstrates such attenuation, then it is definitely not due to light. A hologram made using a single light source and transparent film works best if the object is very close to the film. However the Shroud is not transparent. A hologram made by a split beam and opaque film does not require the object to be as close as 5cm.\nThe comment from YouTube is non-sense. Dave is hopelessly confused as to how a hologram is made, and none of his statements is true. Such ‘forensic evidence’ as we have, abundantly provided by the STuRP team, clearly demonstrates that the Shroud cannot be a hologram of any kind. I recommend that anyone interested buys one on ebay and compares it.\n\n","date":"July 22, 2015 at 8:36 am","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-206320","author":"Hugh Farey","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"Hugh Carey says:… “but a a hologram relies on light coming from two directions in order to create an interference pattern, which is what a hologram is. One way of making a hologram is to have a single source, and the interference pattern is created by the reflection from the object coming back in the other direction. This requires a transparent film, which the Shroud is not.”\n***Angel says:  Hi, Hugh!\nQuestion”  How about a double light source or light coming from two directions, highlighting  the “Event Horizon theory of Dr. Isabel Piczek?\nIf Jesus were suspended between the top and bottom halves of the linen, the front of His body would have emitted light vertically upward, producing the frontal image on the Shroud and the back of His body would have emitted light vertically downward, producing the dorsal image.  \nWould there then have been a hologram created under such conditions?\n\n","date":"July 26, 2015 at 12:53 am","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-206570","author":"Angel","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"Sadly no, Angel. A hologram is an interference pattern made when rays from two light sources meet in the same plane. The light rays in your scenario are going in opposite directions and do not meet. Furthermore, a source of light the size of a body (imagine, if you like, a hollow model with a light inside, or a model completely covered with luminous paint) cannot produce a photograph as the light emerges from every point on the surface in every direction, and produces a meaningless blur. Light does not travel vertically upwards or downwards.\n\n","date":"July 26, 2015 at 2:55 am","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-206574","author":"Hugh Farey","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"Good afternoon Hugh but for me it is morning\nI am not a expert in holography, but with the equipment I am using a reflection hologram requires the object being replicated extremely close to film plate.  Light source comes from an angle from above and goes through film plate 1st.  Object is behind film plate.\nA transmission hologram is different.  Light hits object 1st then the film plate. Direction of light is not at a angle but straight on in a transmission hologram.    The laser beam is split/expanded because the lens is removed illuminating both object and film plate.   Could DNA emit a expanded beam of laser light that would result in diffraction when being emitted from human body resulting in a interference pattern? Possible. \nIf we aspire to be great forensic detectives we need to have expansive thinking and consider all possibilities \nIn a transmission hologram object can be further away film plate and still record a interference pattern.  I am not sure why that is so. \nAll that would be required to create a interference on the linen would be for the laser light coming from DNA to be diffracted.   \nThis is another case where the forensic evidence tells a highly improbable incredible story, very difficult to accept or believe.   This has never been observed in Science.  For one to not to accept it, is completely understandable. I am not anticipating many will. \nAlso noteworthy in a hologram is that you cannot over expose the film that I am using.   It takes about 5 minutes to create a hologram with my equipment.   If I over expose the object to the light, it makes no difference. I could leave it on for 1 hour if I wanted.  In fact it can even help make a better image. But unlike photography there is no danger of over exposure. \nOf course in a hologram a laser is bounced off the object, but in the case of the Man in the shroud, he becomes the laser eliminating the need to bounce a laser off him from another  source   \nTo offer a theory that laser light coming from DNA is diffracted and a interference pattern is created as a result is certainly not stretching the imagination that far.  DNA does emit laser like light in the UV Range. That is a scientific fact, not a theory.\nBut that process would need to be amplified and controlled.  It would require the original creator of the DNA  to be involved in The Shroud image process to pull off such an incredible feat. one who has detailed knowledge of what DNA is capable of doing.  I would describe such a person as a “Higher Power Intelligence/God”\n\n","date":"July 26, 2015 at 10:24 am","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-206598","author":"Dave Hines","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"Well, I very much look forward to your production of a hologram on an opaque surface. As for DNS acting as a laser, that is more of a hypothesis than a theory as yet, let alone a fact. The whole field of biophotons is still very much on the fringe of mainstream physics.\n\n","date":"July 26, 2015 at 12:30 pm","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-206605","author":"Hugh Farey","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"Good Evening Hugh,  It is afternoon here in Playa Grande.  A good place to take a vacation if you like a deserted type beach town, a lot of wide open space. Nature trails. A lot of privacy. Monkeys and lizards.   Let me know if you are coming down and I’ll get you a nice poolside cabina.\nAs low as $20 a night.  Room with AC a little higher.\nFree WI FI, you can work from here too.\nVery laid back here, nothing to worry about. \nBear in mind when myrrh resin dries it becomes light reflective and glossy. But of course there other types of myrrh resin that when it dries is opaque.  Many different types of commiphora plants in the world,  Myrrh is one of the key ingredients involved in the image process, making it possible to convert a opaque surface into a light reflective surface.\nYou are one of the fastest responders on the Blog Site.  A sign of good character. Responsiveness.\nA good time now to pause and reflect on things we are grateful for as the sun goes sets over Great Britain.   Enjoy the evening!\n\n","date":"July 26, 2015 at 1:00 pm","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-206606","author":"Dave Hines","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"Hugh Carey says:\n“Light does not travel vertically upwards or downwards.”\n***Angel says:  Thanks, Hugh. \nI comprehend the first part of your reply regarding holograms; however, with respect to light not traveling vertically upwards or downwards, I was referring to spin-orbital coupling relating the transition metals. \nNew research indicates the direction of light can be manipulated.\nSee the following:\nScientists have discovered a new fundamental property of light\nhttp://www.independent.co.uk/news/science/scientists-have-discovered-fundamental-property-of-light-150-years-after-maxwells-famous-theory-10367078.html\nNanoparticles Allows Physicists to Select the Direction of Light\nhttp://scitechdaily.com/nanoparticles-allows-physicists-select-direction-light/\n\n","date":"July 26, 2015 at 6:07 pm","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-206620","author":"Angel","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"Hi Angel\nLaser light can travel in any direction.  Laser light will travel in the direction the laser is pointed at.   A single wavelength, a single color.  Shroud is a single color.  When one tries to imagine a artist doing a painting, at the very least one would think to at least color the hair brown, not straw yellow. \nHaving myself done no less than 100 portraits I cannot in my wildest imagination ever conceive of myself or any artist doing a 14′ Jesus painting and use only 1 color?!\n Extremely out of place. \nYou wrote\n“If Jesus were suspended between the top and bottom halves of the linen, the front of His body would have emitted light vertically upward, producing the frontal image on the Shroud and the back of His body would have emitted light vertically downward, producing the dorsal image”\nYes, laser light could produce that effect.  Not only vertically, or horizontally, but any direction, any angle.\nI will add a scientific fact to this that may shed some light (no pun intended) to how the Shroud image was formed.\nDNA produces a weak laser like light in the UV range.  A few billion cycles per second.  With each contraction a photon of light is produced.  What if that process was amplified…  Could it result in laser like light coming out of a body?\nYes, it could,  it is possible, however improbable as that might sound, it is possible. . \nIn the same way a painting is not done in a single moment we cannot assume the Shroud image occurred in a single moment just because light is involved.\nImage could have been formed in sections, one part at a time.  Not lasers firing off all at the same moment, but in systematic sequence.  Starting from one point of the body until the entire body was replicated on both film plates, the Shroud linen in this case. \nI have a hologram machine set up in my room right now.\nI can make either\nA.  A transmission hologram\nB. A reflection hologram\nThere is another called a white light transmission hologram which I am not set up to make. \nIn a reflection hologram the object is behind the film plate, in a transmission hologram the object is in front of the film plate.\nShroud image would be more of a white light transmission type hologram  \nOnly a single laser was used to make the hologram in this video with the beam expanded.    No mirrors, no beam splitter.   A single laser can serve both to illuminate the object and the film plate at the same time.\nIt is not as complex as a procedure as one might think.\nWhen one thinks of a making a hologram they think of needing a beam splitter and use of mirrors.  It is not true. \nWhen a hologram is made it records a microscopic pattern of bright and dark lines due to the interference pattern of light.\n When light is passed through the hologram the light diffracts off the captured pattern, bending the light to look like the original object. \nWhen a laser beam is expanded and the light is seen on a solid black surface it appears as tiny dots of light, not unlike the tiny dots on a television screen. \nA hologram records the intensity of light and the direction it was traveling when it hit the film plate.  Object must be extremely close to film plate to record a interference pattern.  At least with the equipment I am using.   I am not a expert in holography but I do know how to make one and have observed and watched  the film plate in a dark room during the image process and have experimented with object being replicated close to film plate and farther away.  After object being replicated is even a  short distance from film plate there is longer image formation.  Object must be close to film plate, which in the case of the Shroud would be body of Jesus\nWhen 2 waves come together, such as 2 waves from 2 beams of laser light or a single laser with the beam expanded the combine to make one wave pattern.  If the peak of one wave combines with the peak of another you get a wave twice as big, this is called constructive interference.  If the peak of one wave combines with the valley of another you get no wave at all.  This is called destructive interference. \nIf this same process occurred on The Shroud linen it would result in some fibers colored and others.   This is exactly what we see on the Shroud of Turin.  Some fibers colored others not.  A interference pattern. Colored vs uncolored fibers.\nThe colored and uncolored fibers on the Shroud show up in a VP 8 analyzer as accurate 3D info,  To offer a theory this happened by random happenstance or coincidence is not logical.  It would be not unlike a person wining the lottery every time they play and one saying it is just random good luck and incredible coincidence.   “No higher power intelligence was involved or advance into was given to that person”   “Just incredibly lucky”\n\n","date":"July 26, 2015 at 8:16 am","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-206592","author":"Dave Hines","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"Oh dear. I’m afraid that I can’t agree with any of this at all.The idea that the DNA of a body would emit laser light all of which travelled vertically upwards or downwards is wholly incredible, and even if it did, it could not, as such produce an image of any kind, let alone a hologram. If Dave wants to make a hologram resembling the Shroud, both his light source and the object acting as the body must be on the same side. This is a reflection hologram, not a transmission hologram. Although the laser light can emanate from a single source, the light beam must be split so that the light reaches the film from two directions, in order to form an interference pattern. As one of these beams must reflect off the object, it must be further way from the film than the distance required for a transmission hologram. I very much look forward to Dave’s next experiment.\n\n","date":"July 26, 2015 at 9:03 am","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-206594","author":"Hugh Farey","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"Hi Dave,\nYes, I also believed laser light could travel in any direction. \nThe properties of laser light are quite different from that of ordinary white light. And it is known irradiation with a laser beam will disassociate Cooper pairs.\nYet, I’m not 100% certain Hugh is incorrect, regarding holograms.  I’m not a physicist and have just just recently began researching the Higgs Boson and superconductors in relation to the transition metals.\nReferencing DNA, I would think there is more of a relationship to bioluminescence in the human body and Cooper pairing.\nThere is a publication online (pdf) titled “Fields in Electromagnetic Spectrum Emitted from Human Body:Applications in Medicine, Journal of Health, Medicine and Nursing, Volume 7, 2014 that highlights superconductors, Cooper pairing and bioluminescence.\nThe only reason I continue to trumpet superconductors and Cooper pairs (transition metals) is there would be a relationship to levitation, antigravity, image formation and, as you state, possibly a hologram.  Just a thought though.\nBest,\n\n","date":"July 26, 2015 at 7:32 pm","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-206624","author":"Angel","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"Hi Angel.  I believe you are on the right path.  No doubt further investigation is needed.  thanks for the links you posted, I’ll be looking at them.   Just moved to Central America trying to get settled in.\n\n","date":"July 27, 2015 at 12:54 pm","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-206685","author":"Dave Hines","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"Hi Dave,\nGood luck with your move to Central America.\nA friend of mine married a woman from El Salvador and moved there approximately five months ago.  Last week  I saw him at the juice bar and he informed me he had moved back to the U.S.   No reason given.   :)\nI’m fairly certain the connection to the Shroud image is related to the metal transition state superconductors.\nWith the Bose-Einstein condensates (BECs), superconductivity usually occurs at temperatures approaching absolute zero on the Kelvin scale.  These are the low temperature superconductors.\nNow scientists have isolated high temp superconductors and recently room temperature superconductors (graphene).\nPlease note, there is a difference between ionizing radiation (electron-positron annihilation) and non-ionizing radiation (laser light).  Both forms of radiation are harmfulI, since they are carcinogenic and can damage the DNA chain.  However, laser light (small doses/pulses) can also be helpful too, since it is used to repair skin and/or eye damage. And while ionizing radiation is highly radioactive, non-ionizing radiation is not, but there are other side-effects.\nI did see something on the internet referencing DNA and holograms; however, there was nothing scientific to verify the findings.\nKeep up with your work on image formation.  Anything is welcome after  the Garlaschelli painting.\nBest,\n\n","date":"July 27, 2015 at 10:36 pm","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-206710","author":"Angel","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"Hi Angel\nEverything is going fantastic here in Central America!\nI’m lounging in a poolside cabina underneath the palms in a tropical paradise doing Shroud Research,\nAlong with my holography experiments I am also studying numerology.  I will be continuing with holography experiments, but in the meantime\nthis thought just came to me and I just typed it in on a English Gematria Calculator, less than 5 minutes ago. \nGENUINE ANCIENT RELIC =1128\nThere has been criticism of me presenting this as evidence that supports the “Shroud is Genuine” (1128)\nand that’s alright.  Let them say what they want.\n I am in good company when I present mathematical evidence the Shroud is authentic\n1.Galileo  “Mathematics is the language that God wrote the universe in.”\n 2.Plato ” Numbers are the highest degree of knowledge, it is knowledge itself.”\n3.Saint Augustine  “Numbers are the thoughts of God.” \nMy Math display at first seems coincidental but when you add 99 more coincidences to this evidence all saying the same thing and pointing to the same person it starts getting very powerful and compelling.  At some point  one must conclude,  “these cannot all be coincidences”\nand I am not talking just about this English Gematria Display. This is just one display,  I am talking about the whole case file.\n Look at how these names, phrases and words all fit in with each other and all equal the same number. \nGENUINE ANCIENT RELIC= 1128\n SHROUD OF TURIN=1128\nSHROUD IS GENUINE=1128\nSHROUD OF THE LORD=1128\nNAMED JESUS CHRIST=1128\n JESUS OF NAZARETH=1128\nSON OF GOD 3D HOLOGRAM=1128\nA SACRED WINDING SHEET=1128\nJESUS INSIDE A GRAVE=1128\nCLOTH IMAGE OF JESUS=1128\n A PICTURE OF JESUS=1128\n RISEN LORD JESUS=1128\nThe following 12 words/phrases  listed could be referred to as DATA,  In philosophy data is defined as\n“things known or assumed as facts, making the basis of reasoning or calculation”\nThat said I will add one more phrase to the list.\nDATA IS NOT A COINCIDENCE=1128\nI can add another dozen to this list equally compelling.  \nThe English Gematria Calculator is definitely not lingering in  doubt in regards to the authenticity of the Shroud.\n  The greatest thing about this witness is that he does not respond negatively to character assassination and could care less what one thinks of his testimony, has no emotions, no feelings and could care less whether The Shroud is authentic or not.   Rock Solid Truthful Testimony.\nWe’ll close this post with a quote from Pythagoras\n“ALL IS NUMBER”\n\n","date":"August 13, 2015 at 1:56 am","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-208125","author":"Dave Hines","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"As far as I’m concerned, Hugh Farey amply demonstrated that there is no basis whatsoever to Gematria when it comes to the Shroud of Turin. Thanks, Hugh.\n\n","date":"August 13, 2015 at 4:48 am","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-208137","author":"Dan","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"Hi Hugh:  I do know how a hologram is made because I made these images with a hologram machine.  I set up the laser and did it. \nI sat and watched and observed like any good scientist.  Made images with object up close to film plate and farther away and made notes. \nYou do not need to 2 lasers or a beam splitter to create a hologram.  No mirrors, nothing like that.  Only 1 laser is needed  with the beam expanded.   that is all.   The one beam lights the subject and film plate at the same time. \nBoth a transmission hologram and a reflection hologram can be made with a single laser, without use of a beam splitter or any mirrors.  I know because I did it and saw it.  The images in this video were created without use of mirrors or beam splitter, only a single laser with expanded beam. \nHologram images in this video are 1/50th the thickness of a human hair.  \nThere are different types of emulsions used to coat a holographic film plate.  One of them is tri acetate, (cellulose acetate)    \nOther types of emulsions could result in a image thicker than 1/50th thickness of a human hair. \nMyrrh and aloes have the same chemical properties as cellulose  acetate.\nAcetate fabric could be used to record an interference pattern.    I just bought some.  Only a place in the world I could find still makes it.\nI just moved to Central America or I would write more. \nMay the Spirit of good cheer, good health and good fortune be with you in the great country of Great Britain!\n\n","date":"July 22, 2015 at 10:05 am","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-206326","author":"Dave Hines","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"Yes, as I outlined above, a single laser source can be used to make a hologram by shining through a transparent plate coated with appropriate emulsion, and the interference pattern is made by the light shining through interfering with the light reflected off the object. You appear to have done this with a small figurine of Christ’s head. Needless to say, the Shroud does not resemble your hologram in any way.\nCellulose acetate is not a photographic emulsion. It is what the base of the film is made of.\nThe thickness of a thick human hair is about 160um, the thickness of the enamel on a hologram about 8um, the thickness of the image on the Shroud is about 0.002um.\nMyrhh and aloes have very few properties in common with cellulose acetate. You may be suggesting that they are photosensitive, like photographic emulsion, but unlike cellulose acetate, and for all I know you might be correct.\nAcetate fabric certainly can’t be used to make holograms unless it is photochemically treated. There are several sources online, mostly for making ‘sunprints’, but the easiest way is to buy photo emulsion and paint it on yourself. Alternatively you can make up your own, as I did myself some years ago, demonstrating that whatever the failings of Picknett and Prince, their assertion that the chemicals and technology necessary for photography were available in the 14th century was broadly correct, even if it does not seem to have been used at all at that time, let alone for making the Shroud.\nKeep up the experimentation. Even if it does not demonstrate, or even lead to, any kind of proof, it often has the most interesting spin-offs which may, one day, make sense of the Shroud.\n\n","date":"July 22, 2015 at 10:56 am","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-206333","author":"Hugh Farey","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"Good Evening Hugh,  I read your reply.  Interesting. Thanks for taking your personal time to write that reply.  One’s Time is valuable gift.  thanks for the gift of your time.\nI am going to go off topic for a second then we’ll get back to the match points/similarities  I made between a holographic image and the Shroud Image.\nI estimate your IQ on a low end to be 120, on a high end 140.   Best Estimate 130.  Let me know how close I came.\nMy point.  You are to smart to believe The Shroud is a painting.  It is completely out of place with your character.   It does not fit.  If you owned a car lot, it would likely be full of Jaguars, Mercedes, BMW’s, Lamborghini’s and Ferrari’s.    Your stating you believe The Shroud is a faded painting would be like you having a old beat up Ford Pinto in the midst of your luxury cars for sale.  It doesn’t fit.  Sometimes I think you are paid to plant seeds of doubt into the authenticity of The Shroud.  Like a paid job.   I also believe in innocent until proven guilty.  Please correct if I am wrong.  Are you paid to plant seeds of doubt into the authenticity of the Shroud?\nIf I was in a high authority position with a lot to lose in a financial sense if the Shroud was authenticated  I would be looking for someone like you to put stumbling blocks in front of people and steer them in the opposite direction.  \n“to keep business as usual”\nYou can take the  5th amendment on that question.   I am not asking this in a disrespectful manner.\nAs a defense lawyer for my client, The Man In The Shroud/Jesus, it is my job to do this and ask these types of questions.  In order to defend my client I have to gain empathy with those who set out to scourge and crucify him again.   If I don’t ask these types of questions I do my client a dis service.   No offense to you was intended.  It is my job.\nI am not paid to do it.  Pro bono work.  \nLets go back to the beginning.\n1. Holographic info on the film plate is 1/50th the thickness of a human hair.   That info comes from the corporation that made the holography equipment.  I did not just make that up. \nYou wrote\n“The thickness of a thick human hair is about 160um, the thickness of the enamel on a hologram about 8um, the thickness of the image on the Shroud is about 0.002um”\nHolographic images fade over time and lose some of their holographic qualities.    So has the Shroud.   So the Shroud image at one time was 8um and now it is only .002um.\nThat is what one would expect after almost 2000 years.\n2. Resolution of a Holographic Image and The Shroud image are very close.  Nothing out of place there. \n3. Laser light diffracted will have constructive and deconstructive waves.  Colored and uncolored areas on film plate/linen would be the result.   What is actually only 3D information could be falsely perceived as being distance information when it is actually not. \n4.  Holographic image on linen when viewed  from the back would not be visible. Shroud image is not visible from back. Ray Rodgers believed the image was within the thin coating on the fabric, not on the fabric.  I believe he was right. \n5. The body of Jesus is the light source, eliminating the need to bounce a laser beam off the object.  The object is the laser beam.  Laser light was expanded & diffracted, interference pattern was recorded on linen .  Subject was close to linen.  \n6. Eye witness testimony states the image does fade and vanish when viewed from the far left and far right.  Photos and paintings and simple contact images do not do that. \n7. Shroud image is a single color, Laser light is a single color, and a interference pattern of laser light would result in leaving some areas colored and others not.  Match again .\n8. Exactly how close body was to cloth at time of image formation is not known.   I noted that when the object being replicated was past 5cm there was no image formation.  I do not believe that was another coincidental match. \nIn the early centuries the Shroud was called “the Image of Edessa, the image not made by human hands”  \nThen then there is the famous quote from Constantinople,   “The image is extremely faint, more like a moist secretion, without pigment or the painters art”\nWhy were they so convinced this was not a painting?\nWhat made it stand out so much apart from all other images?\nAn English Gematria Calculator is my corroborating witness that will answer that question.\nFirst 3D Hologram Made = 1128\n3D Hologram on a Mantle=1128\nSon of God 3D Hologram=1128\nShroud of Turin = 1128\nJesus of Nazareth= 1128\nBehold the Image of Edessa =1128\nIts not a painting=1128\nNo one had ever seen a hologram on linen before.\nIt has not even been done in this day and age…yet.\n\n","date":"July 23, 2015 at 1:12 am","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-206352","author":"Dave Hines","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"Dear Dave Hines\nI utterly agree with the first part of your comment.\nActually persons like the one you mentioned are quite intelligent and try to «poison the well» to mislead people interested on the honest study of the Shroud, nevertheless a careful reading of their writtings will find contradictions and hidden fallacies.\nYour hypothesis is quite interesting and your assertions make sense, they seem to fit admitted Shroud image properties.\nDr. Petrus Soons, the leading expert on holography applied to the Shroud wrote in his website http://shroud3d.com/home-page/introduction-holographic-observations-in-the-shroud-image-holographic-theory  interesting ideas that match your point of view.\nPerhaps Jesus body was the source of a laser radiation emission- I recall eexperiences by Professor  Paolo Di Lazzaro who obtained superficial discoloration of linen fibers exposed to bursts of U.V. laser irradiation within narrow parameters of wavelength power anf time.\nAlthough science will never prove this scenario it’s not absurd to think that God granted mankind a unique image of His Son Jesus Christ.\n                                             regards\n                               Antero de Frias Moreira\n                    (Centro Português de Sindonologia)\n\n","date":"July 24, 2015 at 7:03 am","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-206456","author":"Antero de Frias Moreira","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"Death mask or Holography?\nWas the Shroud a sort of death mask of Jesus\ncreated by Roman intelligence officials as a proof of his death?\nLinks:\nhttps://en.wikipedia.org/wiki/Death_mask\nhttp://itthing.com/life-and-death-masks-of-famous-people\nhttps://www.flickr.com/photos/thais_leticia_olivo/13996891891\n>The Dante death mask plays a key role in Dan Brown’s Inferno novel.\n>This precious object is preserved in the Palazzo Vecchio in Florence,\nmost specifically in a small andito (hallway) on the first floor,\nbetween the Apartments of Eleanor and the Halls of Priors…\nLink:\nhttp://www.florenceinferno.com/dante-death-mask/\n— — —\nWhen taken from a living subject,\nsuch a cast is called a life mask…\nDeath mask and life mask (only an easy analogy):\nDeath mask = Holy Shroud\nLife mask = Manoppello’s Veil\n— — —\nNow I admit that I am certainly not been accurate\nin my very short presentation, but the argument seems\nto be a little difficult to develop…\nCan you help me with proper comparisons?\nFor example:\nHave you tried  to compare the Holy Face\nof the Shroud with a replica of the death mask\nmade for Dante?\nPerhaps (at least) Charles Freeman,\nstudying Dante’s death mask, can improve\nhis own theories…\n\n","date":"July 22, 2015 at 11:45 am","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-206334","author":"piero","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"Muy buenas tardes Antero de Frias Moreira!\n¿Puede hablar a español? Apenas llegué aquí en mi casa de vacaciones en costa rica, ¿qué país provienen?\nNo dude en escribirme en Español Si quieres.\nYa que escribo mejor en ingles y también tiene buen inglés permite probar ese idioma.\nAnother coincidence that is noteworthy is that human DNA oscillates at a few billion cycles per second and emits a weak laser like light in the UV range, each time it contracts, it releases 1 photon of UV Light.  That is appx a few billion photons per second.  \nWhat if that process was amplified by someone who knew how to manipulate it?\nLike The Creator of DNA for example. \nI would like to see the Shroud myself on a flat piece of glass standing upright in a dark room with light coming from only 1 direction straight on and then tilt the image to the far left and then far right, up and down.   \nAccording to the person who examined The Shroud in a similar manner, he stated the image vanished when going to the far left or far right and at one angle it appeared as if the body/image came out of the sheet.\nThat is exactly what a hologram does.  There is a specific angle when titled to the right or left where the object appears to come right up out of the glass.  A extremely unique optical illusion.  It is a very specific angle this occurs at and is very hard to hold the moment.  The slightest shift or movement  any way and it will vanish.   I filmed such a moment in this video.\nThanks for the link you provided, I will read it again.  I have seen it.  \nLets make a list of “coincidences”\n1. Shroud image is extremely superficial.  Hologram image extremely superficial\n2. Shroud image not visible back lit.   Hologram image not visible from back side\n3. Shroud image is one color     Hologram image is one color\n4. Shroud image consists of colored fibers and uncolored   Hologram image is the same\nLaser light diffracted off an object will result in constructive and destructive wave patterns,  on a piece of linen this  would result in coloration of some fibers and others not.  This could only be observed to be true only when viewing the interference pattern under a microscope or put under a VP analyzer.  Shroud of Turin has such info encoded into the linen.\n5. Shroud image becomes vague or vanishes when viewed from far left or far right\nHologram image is the same.  (According to eye witness testimony, not myself personally)\n6. Shroud image at a specific angle appears to come out of the sheet.  Hologram is the same\n7. Shroud image has very good resolution.  Hologram image has very good resolution.\n8. Shroud image is faded and getting weaker.  Hologram image fades over time. \nIt is not illogical to conclude Shroud image is the result of a interference patter of light.  Very focused light of a single wave length.  \nWhere the theory starts going south is when it is explained the body is the light source.\nThis has never been observed in Science.   \nAlso during the process of making a hologram there can be no sound vibration.  Object must be 100% static.  Cloth must also be 100% static.\nInterference pattern is easily disrupted resulting in no image at all. \nThose are things I cannot explain other than to say the person/intelligent force in charge image making process has the ability to place a electromagnetic field around a cloth and body and hold it in place and or create a zero gravity environment during image process.\nand make sure there are no sound interruptions during the image process. \nA tall order, only a “Higher Power Intelligence/God would be capable of filling. \nGracias por responder a mi post.\nPuede el espíritu de la buena fortuna, buena salud y buen ánimo con ustedes. Amén\n\n","date":"July 24, 2015 at 6:07 pm","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-206491","author":"Dave Hines","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"Buenos dias David\nI understand spoken spanish language nevertheless I cannot write correctly so I prefer to comment in english.\nI praise your interest on Shroud image study and what you wrote makes a lot of sense in my humble opinion.\nYou made an interesting point «Also during the process of making a hologram there can be no sound vibration. Object must be 100% static. Cloth must also be 100% static.»\nThis is exactly the conclusion drawn by Professor Latendresse http://www.academia.edu/9063899/The_Turin_Shroud_Was_Not_Flattened_Before_the_Images_Formed_and_no_Major_Image        and     http://www.sindonology.org/papers/latendresse2005aSlides.pdf\n   Go on with your research you have all my support\nP.S.: can you tell me your fireld of expertise?\n                                                              regards\n                                                 Antero de Frias Moreira\n                                                                Antero\n\n","date":"July 25, 2015 at 4:39 am","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-206507","author":"Antero de Frias Moreira","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"Buen Dia Antero de Frias Moreira!\nHoping this day finds you with a spirit of good cheer and good will toward others!\nI cannot call myself a expert in anything,  (although I might want to)\nI aspire to be an expert but I am not one.  \nI am one of those kind of people who fail their way to success, the kind of person who would try to take the short cut in getting the cross up the hill and end up making it 3 times more difficult than it had to be.\nA bit impractical  and impatient.  The kind of person who underestimates how difficult the journey is to the other side but  plunges ahead anyway, boldly/foolishly ( walking that fine line and stepping into both at times)   then find myself in the middle of the jungle and having it dawn on me “this is much harder than I thought”  but having gone so far that turning back is no longer a option.  \nThat is where I am today.  In the middle of the Jungle wrapped up in the Shroud, attempting to unravel its mystery.   All we can do is “enjoy the journey” and take time “to stop and smell the roses along the way” \nThanks for the rose you put in my path.  I can see that it is genuine, not a paper rose.  I’ll keep it in a memory bouquet.    Thanks also for the links you posted.\n\n","date":"July 27, 2015 at 1:24 pm","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-206687","author":"Dave Hines","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"Buen Dia Antero de Frias Moreira\nThese are things I am not a expert in, but are my primary research areas/ fields of interest\n1. ELF wave Research since 2010.  Over 1000 hours logged in on actual field research in dozens of locations.  Some would consider this paranormal research. I believe it is possible to use ELF (extremely low frequency waves) as a means of communicating with a Higher Power Intelligence and or to detect presence of a life form that is non material, spirit.\nI am a life after death researcher.\n(My equipment set off the security alarms at the airport and I was questioned by airport security, I told them I was a Shroud of Turin and a paranormal researcher,  can you believe they did not know what the Shroud of Turin was?   I had to give a brief seminar explaining it. \n2. I am a published author and portrait artist.  I like to do replicas of famous paintings,     Van Gogh, Caravaggio, Botticelli, Da Vinci, Thomas Gainsborough, El Greco,\n3. Shroud of Turin Research\n4. Holography\n5. Making Films \nSpiritual Talents\n1. Automatic Writing: Ability to write messages with guidance from a Higher Power.  (Average skill level)\n2. Clairsentience Ability to pick up energies and emotions from people, places and things,\n( High Skill level. )\n3. Channeling  Ability to receive message from Higher Power.  (Above Average Skill)\n4..Psychometry: Involves being able to pick up vibrations left on an object by someone connected to it.  To receive information from photographs, places.  Also known as object reading.   (Average skill level)\nEverybody has talents like this whether they know it or not.  The FBI takes these talents seriously,  seriously enough to use physics in  unsolved murder cases.\nSome of the results obtained from physics astonished forensic detectives and have solved many cases.\nWhat are your talents/field of research?\n\n","date":"July 29, 2015 at 11:48 pm","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-206922","author":"Dave Hines","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"Holograph? Why not? Nobody’s found anything remotely authoritative in terms of explanation, yet\n\n","date":"July 23, 2015 at 1:41 am","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-206353","author":"Thomas","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"Yes, why not?   Hologram image and Shroud image qualities are extremely similar.   I forgot to add another thing.  Myrrh resin was used as a UV protectant in ancient times.  This would help prevent ablation from occurring on the fabric during image process.  It does say Nicodemus purchased an abnormally excessive amount of it.  Easily enough to cover the body of Jesus and the entire 14′ cloth.  A pre-resurrection covering, the Spirit of God knowing in advance there would be some strong UV light involved in the resurrection process  he did not want the cloth or his Son to get “burned” but to get a  good sun tan.\nA caramel color not a red burn color.   A maillard reaction, browning effect on the cloth.\n\n","date":"July 24, 2015 at 6:33 pm","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-206493","author":"Dave Hines","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"“Actually persons like the one you mentioned are quite intelligent and try to «poison the well» to mislead people interested on the honest study of the Shroud, nevertheless a careful reading of their writings will find contradictions and hidden fallacies.”\nWhat an appalling comment. Snide, untrue, and malicious. I rarely respond to personal attacks personally, but when I do, it is usually to say that with friends like this, the Shroud’s rejection as anything more than an extremist shibboleth is assured, and any consideration of it as a unique and valuable icon of Christianity more or less doomed. I see no reason to respond any differently in this case.\n\n","date":"July 24, 2015 at 7:42 am","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-206458","author":"Hugh Farey","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"Hello Hugh:\nI did not accuse of you anything.  I asked a question.  It is my job to do that.\nI could be wrong.  I am open to that possibility.  In the same way I was open to the possibility that the Shroud of Turn actually made contact with the body of Jesus and is physical evidence of his resurrection.  Of which when I 1st saw the Shroud I thought the odds of probability and chance the Turin Shroud actually made contact with the body of Jesus was at best a 1% chance of being possible.  But I will still open to the possibility.  Extremely improbable and unlikely, but possible. \nMy investigation started at that point in 2009.  “not convinced”\nI wrote “I estimate your IQ on a low end to be 120, on a high end 140. Best Estimate 130”\nThat is a compliment.  Only about 2.3% of the population scores 130 or more on a IQ test.  I put you in the range of “extremely gifted, talented, above average intelligence”\n Einstein scored 150 or 160, I cannot recall which is the correct figure, but it was high.\nYou are in his range.\nBased on your extremely high level of intelligence it is out of place for you to believe The Shroud is a painting.  It is in complete disagreement with the forensic evidence.  \nI have many times been accused of trying to cash in on the Lord’s sacrifice because I wrote a book. When asked if money is the motive behind my work, I answer the question.  Because this happened so frequently  I stopped promoting my book.  Never include it in my videos even though I reach 500 to 1000 people a day.   That is like committing professional suicide.  My publisher thinks I am insane not to capitalize on it.   When I am asked about my book I give it away for free at my own cost.  Spirit of God rewards me in ways that words cannot adequately describe.  Gifts more valuable than gold.\n Your posts are Extremely informative.  Thoughtful, intelligent.  Well written.   On a closing note I suggest only that you be more open minded to the possibility that the Shroud is genuine.  If I was not 100% convinced the Shroud was authentic I would not bother posting or ever make any statement regarding the Shroud.   Convinced or not, there is no in between.  At some point a decision needs to be made, “to cut off from any other possibility”\nSpirit of Gods needs a person without doubt, bold and fearless to represent him. Like Paul of Tarsus.  Without fear and without doubt.   I have no doubt in my heart, mind, body or soul in regards to the authenticity of the Shroud.  100% convinced.  It was in 2012 when that happened.  After 3 years of study.  3 is a number of completeness.\nNo offense was meant to you by my question.   I am only doing the job the Spirit of God requires of me.\n\n","date":"July 24, 2015 at 12:30 pm","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-206472","author":"Dave Hines","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"Read Hugh’s comment again, David, and the quoted passage at the start. His comment was not addressed to you.\n\n","date":"July 24, 2015 at 12:48 pm","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-206473","author":"Colin Berry","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"I missed that.  Thanks for clarifying. Much appreciated.\n\n","date":"July 24, 2015 at 5:04 pm","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-206484","author":"Dave Hines","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"Thank you, Dave. It was, of course, not your post that I commented on, but that of Antero below. I am a little interested in that your job is to ask me questions. What kind of job is that?\nAnyway, for what it’s worth, my sindonological activities are entirely for my own interests; I do not work for anybody, and nobody pays me to plant seeds of doubt. I have nothing to gain or lose whether, or if, the Shroud is proved authentic or medieval.\nYou suggest that I be more open-minded to the possibility that the Shroud is genuine, although I gather that for me to suggest the reverse – that you be more open-minded to the possiiblity that it might not be –  would be intolerable to you. Never mind, let me simply assure you that I am extremely open minded to the possibility of authenticity. I am far from 100% convinced that the Shroud is medieval, as I repeat at intervals on this blog. At present, I feel that on balance the evidence tips in favour of a medieval origin, but I am well aware of all the evidence to the contrary.\nI commend your endeavours to understand more about this astonishing artefact.\n\n","date":"July 24, 2015 at 12:58 pm","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-206474","author":"Hugh Farey","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"Well put. And it is indeed astonishing defying understanding in a world where we have so much scientific resource and knowledge at our fingertips.\n\n","date":"July 24, 2015 at 8:55 pm","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-206496","author":"Thomas","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"Good evening Hugh, It is actually 2:30AM your time but 6:30PM my time.  Good middle of the night is perhaps more appropriate?\nI was more than open minded was the Shroud was not authentic. At the beginning I was 99% convinced it was not a cloth that made contact with Jesus.  My idea of the burial cloth of Jesus would be more like a very old fabric in poor condition with only blood stains on it and nothing else. No image.  How I got convinced the other way?  That is a long story.\nFor the last 7 years I have been getting up every morning and saying the same prayer.\nA scientific experiment to find out this,  “Is there a Higher Power/God or not?”  \nPart of it goes something like this  “Lord grant me that I am not so much seeking to be loved, consoled or understood, but to love, console and understand others.  Lord your will be done, not mine, guide me in thought and action toward that, and grant me the power to carry it through today”\nThe results of this on going experiment have been astounding.  I would be writing for next month straight to make a list of all the events that have occurred over this time.  Many were documented and put into a book I wrote.   I am not author, I never wanted to be one. I sold real estate and I was a percussionist in a rock band. I was a personal trainer.  Heavy into bodybuilding and going to night clubs and drinking every night.   The Shroud of Turin was about the last thing on this Earth I saw myself ever getting involved with. Many times over these last 7 years  I have seen up close and personal physical evidence of the Spirit of God in my life.  It has been proven to me beyond any doubt such a “Higher Power/God” does indeed exist.  I am convinced and I am not easily convinced.     \nIt is a requirement of the Spirit of God that I attempt to gain empathy with others. That involves having to ask questions to  so that I can gain that understanding and empathy with that person.  It is my duty/job/obligation to do so.  I did not say I was good at it.\nI believe if one aspires to be a true scientist that person must be open minded to the possibility that Jesus rose from the dead and the Shroud is physical evidence of that event,  if not, it would be not unlike a defendant walking into a courtroom and the possibility that he or she is innocent is not even considered a possibility.  God forbid anyone be guilty of that.\nWe have all seen unsolved murder cases where the forensic evidence told a highly improbable unbelievable story.   One that comes to mind is a case where the forensic evidence and the pathologists report told a story of 2 parents that held down their daughter and stabbed her to death.   The parents story  was that their daughter demanded $5,000 and attacked them with a knife.  It would be very difficult for a jury to accept the forensic evidence side of the story.  Difficult for one to imagine holding down your own daughter and plunging a knife into her chest cavity 7 times.  It turned out the FBI suspected one of the parents was a terrorist and the house was wired.   They went back and listened to the tape.  The entire event was caught on audio   The unbelievable story turned out to be exactly what the forensic evidence says happened.  The Parents held down their daughter and plunged a knife into her while she begged and screamed for them to spare her life. They did not like the boy she was dating. He was black.  That was the reason.  She never demanded any money, never had any weapon.  The parents even stabbed themselves to make it look like they were in a fight  \nPerhaps not a good comparison story that relates to the Shroud, but the point is the forensic evidence on the Shroud tells a tale of a extremely improbable event, one many people would have difficulty accepting or believing.  \nWhat is the forensic evidence on the Shroud telling us? \nWhat does the pathologists report say happened?\nWhat is the VP 8 analyzer telling us?\n\n","date":"July 25, 2015 at 9:29 pm","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-206563","author":"Dave Hines","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"The video was unable to persuade me that it’s a holograph, but then I have a hearing problem and wasn’t able to follow the commentary very well.  However I’m intrigued that the image only appears on the crowns of the threads, and if the image was created by something like UV radiation, then it starts to look like some kind of interference pattern.  But “look like” doesn’t necessarily mean that it is.  Although the crowns have an approximate regularity in a two dimensional sense, it won’t be exact and there will be be some randomness in their distribution, unlike the exact regularity of interference patterns.  Dave HInes is to be commended for his novel experimental approach, but I would say ‘Take the lesson from Colin’s now apparently discarded scorch hypothesis, don’t jump to conclusions too soon, and be prepared to revise your ideas as your investigation develops further.’  All the best with your work, and I hope that you’re able to persist with your efforts.\n\n","date":"July 25, 2015 at 3:24 pm","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-206540","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"Hello Daveb of Wellington:  I always enjoy reading your posts.  I really think you should write a book.  It would be a shame if all your knowledge of the Shroud and comments you have posted over the years could not be somehow documented and put into writing.\nMany people would benefit by it.\nI don’t think there is any trouble with your hearing, it is more my northern U.S. Accent that is to blame here.  Bottom Line:  I need to produce the image on linen.  Show it.  Until that is accomplished it all just speculation, talk and theories.  It does not matter what I believe only what I can prove.  I made this video because I wanted to document where I am at this time.  I felt a strong need to do so.  “If life is worth living it is worth recording”\nTo say the Shroud image is the result of a interference pattern of laser like light is not a complete explanation.  I believe in part, that is how the image was formed.  But there is more to it than that.  One step at a time.   Get the image on linen then move ahead after that.  See what a interference pattern looks like on linen. 1st things 1st.\n\n","date":"July 25, 2015 at 7:57 pm","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-206559","author":"Dave Hines","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"Colin explained the reason why the gematria works in terms of the numbers of letters in the alphabet and how they were distributed. But here is a little guide as to how to do it in practice.\nTake an incomplete phrase and enter it into gematrix.org: DAVE HINES IS = 690.\nChoose a target number: 1128\nSubtract the phrase from the target number to find what number you need: 1128-690=438.\nEnter the missing value into gematrix.org, and choose what you like from the result:\nPERFECT: 438\nCRAZY: 438\nSEXY: 438\nBIPOLAR: 438\nThen try without the word IS. DAVE HINES = 522. Number needed = 606.\nDARTH VADER: 606\nIMMORTAL: 606\nDEMONIC FIEND: 606\nIsn’t this fun?\nLet’s try HUGH FAREY, HUGH FAREY IS, and HUGH FAREY IS A\nThat’s 594, 762 and 768, respectively, needing 534, 366 and 360 to make 1128.\nHUGH FAREY – GIFT OF GOD = 1128\nHUGH FAREY IS – EL ADONAI = 1128\nHUGH FAREY IS A – TEACHER = 1128\nCOLIN BERRY – THE ONE = 1128\nDAN PORTER – Oh my goodness – 666!\nSadly, gematrix.org is mostly compiled by people whose interests are mostly connected to the Hebrew and English Bible, Star Wars and American Politics, so one’s choices are fairly limited. Presumably someone has compiled an entire dictionary of gematric values, when it would be easy to make almost anything come to almost anything you want. Why, I wonder, does the English Gematria multiply the simple alphabetical numbers A=1, B=2 etc, by 6. Why not 3, or 7? And why is it only English or Hebrew which defines the fate of the world? Why not Swahili or Norwegian? In fact, of course, within Colin’s statistical constraints, it would be perfectly easy to demonstrate that black means white in anything from Albanian to Zulu, with Klingon and Elvish thrown in for good measure,\nAnd I ought to know: HUGH FAREY THE WISE (1128)\n\n","date":"August 13, 2015 at 3:14 am","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-208129","author":"Hugh Farey","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"Hello Hugh:  Bear in mind all the things I listed when typed into a google search all go Jesus or the Shroud of Turin.   All of them.      \nWhen typing in the word “perfect” in a google search does it go to crazy, sexy or bi polar?\nNO.\nThose are 4 unrelated things that coincidentally have the  same number,\nThe acid test to make this determination is to put the word/phrase in a google search and see where it goes.   Do they all go the same thing/subject?    \nWhen A body of evidence is collected at a crime scene it also goes through a process of scrutiny to determine what items collected are related to the crime and what is not related.\nTo separate “the wheat from the tares”  \nA good example is the one you listed\nWhich of the following does not fit in with the rest of the group?\n1.Mark of Beast\n2. Demonic Evil\n3.The Eden Snake\n4.Satan’s Seal\n5. Dan Porter\nWhen typing in the name Dan Porter on a google search does it go to Satan or things relating to the Devil?  No.\nWhat about the others?  mark of beast, demonic evil, satan’s seal,  Are they related?  Yes. \nThere is nothing in the character of Dan that would suggest any connection to a supernatural evil force. His name is obviously out of place.\nThus that piece of evidence collected is not part of the “main body of evidence”  and is put aside and disregarded.  \nAnother example: Evidence collected at a crime scene\nWhich of the following pieces of evidence collected a crime scene in which the victim was shot and stabbed to death does not fit in with the rest of the group.\na. Gun\nb knife\nc. Bloody clothes\nd Shell casings\ne Deck of playing cards   (no prints found or DNA collected from cards)\nThe acid test to know if there is a connection  are things with the same number that are also related to each other.  Past 7 matches is where it gets a little attention.  Past 12 (A number of completeness) is where it get’s more compelling. \nMany of the matches I found were done on the 1st try.\n“Genuine Ancient Relic” is one of many among that list. “Shroud is Genuine” is another,  There are over 50 words/phrases that relate to the Shroud and Jesus with the same number.  Each one of them when typed into a google search go directly to Jesus or the Shroud or both.  You would be hard pressed to find  12 words/phrases with the same number that directly relate to the chosen person, place or thing.  Jesus and The Shroud and words/phrases relating to Jesus and The Shroud at 1128 may have the most match points of any word in the English language.  Over 50! I believe is noteworthy.     Messages/clues left behind by the Spirit of God, \nSpirit of God will let one know and help each person seeking his will to be able to make clear distinction between what is genuine and what is falsely perceived.  To know intuitively and or by sight, feel, or touch, or smell what is genuine or not.  What is a paper rose and what is a genuine rose.  Who is lying and who is not.  What is a good purchase and what is not.  A guide, and counselor.  Spirit of God tells me these match points are not a coincidence. \nMy Point Is:  This is not just about finding things with the same number, but things with the same number that are related to each other. \nBy itself this Gematria display does not hold much weight, it belongs with the rest of the body of evidence.  Just another “coincidence”  among many that link the Shroud to Jesus.\n\n","date":"August 13, 2015 at 12:09 pm","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-208169","author":"Dave Hines","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"And thus it is like some mental Ouija board. I’m sorry, Dave, but I completely disagree with you. I see Gematria as nothing more than a parlor trick.\n\n","date":"August 14, 2015 at 1:26 am","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-208217","author":"Dan","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"Comparing my email inbox with recent Comments suggests that a certain contributor is being pre-moderated, possibly blocked. Might that be because he’s not content with wallpapering the site with his endlessly repeating pattern of anti-science post hoc rationalization, that he feels it has to be repapered, one layer on top of another, at regular intervals? If so, then good move oh site proprietor. No one should be allowed to use someone else’s site as if it were his own – to harrass and cajole others into submission.\nThis blogger has his own site, to which he’s posted some 220 times these last 3 years or more (not counting the scores on sciencebuzz either). \nI’ve just this minute posted “Topic3” on the current Week 33 posting, possibly my most important to date. Time will tell\nhttps://shroudofturinwithoutallthehype.wordpress.com/2015/08/13/is-the-shroud-of-turin-really-just-18-years-short-of-its-2000th-birthday-see-this-blog-for-a-daily-acerbic-overview-of-current-wrangling-currently-2015-week-33/\n. It provides a temporary solution at any rate to the image problem. Attention can now turn to that other gent’s fixation – the “proof” of authenticity provided by the blood. Scientists (as distinct from an all-too prevalent sub-species of sindonologist) use that term “proof” very sparingly, if at all. It’s the weight of evidence that matters, including the evidence we do not yet possess (see famous Quotations, Donald Rumsfeld).\n\n","date":"August 14, 2015 at 2:23 am","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-208223","author":"Colin Berry","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"thanks Dan. That’s alright. Its just one display.  It was not meant to take up so much space on your blog site.  I hate to see space wasted on the same topic.  there are many other aspects of the case file that are so much more important.  Sorry if this got a bit out of hand. Feel free to delete my posts to free up space.  I do it all the time. I would not be offended.  Thanks for having me on the site and allowing me to post.  You are doing a really good job.  Very informative site.  I am kind of a oddball character.  I don’t fit in very well with the rest of the regular crowd that posts.  An outsider.  May The Good Lord Place his Holy Spirit upon you.  A spirit of power and love eternal, a spirit of good fortune, good health and good cheer!  Amen.\n\n","date":"August 14, 2015 at 5:00 am","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-208232","author":"Dave Hines","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"Hello Hugh:  An example of debunking Gematria and replicating “my painting of words” would involve choosing a famous person, place, or thing with a rich source of words associated/related to it.\nAs rich a source of words that could possibly be.  \nFor Example Led Zeppelin is a famous group with many words associated to them.\nLed Zeppelin =744\nPeter Grant=744\nIf I type in Peter Grant on google, Led Zeppelin will also come up, they are related.\nThose are 2.   12 are needed.  Only 10 more needed to debunk my evidence as not genuine.  How hard can that be?  Should be easy to do.  Yet it is not. \nI could not find any more. If I tried harder I think I could come up with a few more.   If this was random good luck and coincidence I should be able to type in names of the group, songs they wrote and at least one of  them should come to 744 by random happenstance.\nI am sure there is a better example than Led Zeppelin.\nI am sure you get the idea.    It is not as easy as you would think.\nIn a unsolved murder case there is often coincidental evidence that links a suspect to a crime.  In the cases where there are only a few coincidences that link a suspect to the crime it often turns out the suspect is not guilty and was not involved.  However, in cases where coincidences add up past 7 things,  I have never seen a case where that suspect was actually not involved and the 7 coincidences linking the suspect to the crime were coincidence only.  Numbers that repeat themselves over and over again always get the attention of a good forensic detective and or a professional handicapper.\nIf I claimed to be a mind reader and asked a person to pull a random card out of the deck and repeat that card to themselves in silence and I told that person what card they were thinking of on the 1st try, does that mean I am a mind reader?   No, that could happen by random coincidence,  a lucky guess.  A coincidence.   Yes there are coincidences.\nBut what if I did it 7 times in a row?   People would think I am receiving information either by trickery or by a higher power intelligence.\nThese phrases and words relating to Jesus and The Shroud all being the same number, 1128 repeat themselves so many times I cannot pass it off as just coincidence.\n\n","date":"August 13, 2015 at 4:22 pm","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-208188","author":"Dave Hines","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"As far as I’m concerned, Hugh Farey amply demonstrated that there is no basis whatsoever to Gematria when it comes to the Shroud of Turin. Thanks, Hugh.\n\n","date":"August 13, 2015 at 4:54 am","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-208138","author":"Dan","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"Hugh demonstrated that he can find words with the same number not related to each other.  Anyone can do that.   He has failed to come up with the name of a person, place or thing and then find 12 other words/phrases directly relating to it with the same number.   What ever list one comes up with, each word/phrase when typed in a google search must all go to the same person, place or thing.\nThat has not been done.\n\n","date":"August 13, 2015 at 12:25 pm","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-208172","author":"Dave Hines","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"Hello Dan:  In a comparison analogy,  “I made a painting of words”   I am not asking one to explain how that was done, but to make a replica of my painting.    One that matches all of it’s unique characteristics.   If my evidence is only a “painting”  it should be easy to make another “painting”  that looks just like it, even a shortened version.  Just the Face.\n12 matches instead of 50.\nLike The Shroud of Turin, one can explain it is simply a painting or contact image but then when asked to produce the replica in the way explained it does not match the replica?!  To debunk something or provide compelling evidence that something is genuine or not,  one must present evidence in a visual sense, a genuine demonstrated reality,   I want to see a replica of my “painting”    Not a explanation of how I painted it.\n\n","date":"August 13, 2015 at 1:41 pm","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-208175","author":"Dave Hines","site":"shroudstory"},{"title":"The Shroud is a Holograph?","post":"Well, why not? My contention is that a collection of phrases adding up to the same number is wholly random, and does not necessarily demonstrate a truth. Dave thinks that if 12 phrases on the same subject add to the same number, then this is evidence of their veracity. So, let’s start with a person – President Abraham Lincoln – and show that he was, in fact, a rabbit.\nPRESIDENT ABRAHAM LINCOLN = 1398\nABRAHAM LINCOLN – FATHER RABBIT = 1398\nFLOPPY EARS OF LINCOLN = 1398\nLINCOLN ATE FINE CARROTS = 1398\nSAD WHITE HOUSE BUNNY = 1398\nAMAZING PRESIDENT RABBIT = 1398\nCRUEL BOOTH SHOT RABBIT = 1398\nABE LIVED IN A BIG DARK BURROW = 1398\nTASTY LETTUCE NIBBLER = 1398\nFAT ABE LOVES BUGS BUNNY = 1398\nLINCOLN, A COTTONTAIL ODE = 1398\nTHUMPER, ABE’S BAREFOOT FRIEND =1398\nABRAHAM LINCOLN – FINE BUNNY = 1398\nYup, that’s done it. Anything else you’d like confirmed?\n\n","date":"August 13, 2015 at 6:12 pm","url":"https://shroudstory.com/2015/07/22/the-shroud-is-a-holograph/","cat":"image_theory","id":"comment-208198","author":"Hugh Farey","site":"shroudstory"}]
