[{"title":"The Turin Shroud as “Decus et Tutamen” – an Ornament and a Protection?","post":"Here’s a comment from Thomas that’s just appeared (22 Dec am) on the winding-down shroudstory site. It dovetails neatly with the ‘ornament’ view of the TS as a 14th century innovation, and takes a pop at the dreary repetitive dogma coming from a certain quarter. It’s from the generally pro-authenticity Thomas, but there you go… You can’t have everything…\nThomas commented on Thank You, Everyone.\nin response to Charles Freeman:\n    I agree with Hugh. The Quem Queritis ceremony early on Christmas morning required a burial cloth to be held up to show Christ had risen. Some were known to have been painted though we don’t know exactly how. In a large church and in the dim early light the priority must have been impact and […]\nCharles I have to say you have a quite nice theory but I am afraid to say it falls down on many counts, in my opinion. So where do I start?\n‘The Quem Queritis ceremony…required a burial cloth to be held up to show Christ had risen’\nProblems:\n– the Shroud image is not one of a glorified risen Christ\n– people such as yourself argue that the silence of history in describing an imaged shroud is a problem for the authenticist’s case. But then you argue for an imaged (front and back for good measure) shroud to be held up in a ceremony as opposed to say a non imaged but bloodied shroud. I think this is logically inconsistent. Why show an imaged burial shroud ‘to show Christ had risen’ if there was no tradition of a full body imaged shroud?\n– the Shroud itself is of such length as to be quite a nuisance to ‘hold up’\n– why ‘manufacture’ a front and back image? A frontal image would have been enough and a lot easier to manage. Your theory suggests a purely ceremonial origin for the shroud but the ultra realistic front and back image flies in the face of this.\n– the nude image goes against the art history grain….yes yes there were one or two rare exceptions but they were discrete images not things for widespread public display. And sorry I don’t buy your argument at all that there was originally a loin cloth on the image that wore off.\n– I just don’t buy your argument that the image is the product of a faded painted image. For many reasons. A painted shroud makes sense for an Quem Queritis object, a novel and as of yet inadequately explained image does not (when a painted image would be all that was required for an abstract and symbolic ceremonial use)\n","date":"December 22, 2015 at 9:32 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/21/the-turin-shroud-as-decus-et-tutamen-an-ornament-and-a-protection/","cat":"contact_imprint","id":"comment-6586","author":"Colin Berry","site":"colinberry"},{"title":"The Turin Shroud as “Decus et Tutamen” – an Ornament and a Protection?","post":"Why, one might ask, would those college chaplains at Lirey (all 5 or 6 of them!) choose to place their wooden statue on a ‘mock-up’ of a shroud (whether Joseph of Arimathea’s transport shroud, or final burial shroud, assuming the two were different)? It’s not as if there’s an imperative to do so, there being no biblical record of any image imprints on linen.\nBut there is a practical rationale in the context of what was on display, whether one calls it a “liturgical illustration” or “ornament/protection” or – as an afterthought – a visual aid.  A wooden statue will always look like wood, unless very  expertly painted to look like real human flesh (which might be too much given the naked state of the subject and medieval sensibilities). If it looks like wood, then there’s no point in carefully applying blood in all the right locations, in an attempt to show it’s not just any naked male, but a particular one who had been scourged, crucified etc etc.\nThat’s where the shroud comes in. One can paint one’s blood onto the basal body image – the latter modelled as ‘sweat’ – making the shroud as realistic-looking as one wishes.  Being a completely independent artefact from the wood means there isn’t then the same illusion-destroying clash as would be the case if blood had been painted on wood. The apposition of 3D statue with 2D imprint in the same field of view makes for a visual feast, with main course (statue) and afters (image) albeit a somewhat stomach-churning one for finer sensibilities. Clever,  those chaplains. But then they must have had a lot of time on their hands.\n","date":"December 21, 2015 at 5:08 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2015/12/21/the-turin-shroud-as-decus-et-tutamen-an-ornament-and-a-protection/","cat":"contact_imprint","id":"comment-6583","author":"Colin Berry","site":"colinberry"}]
