[{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"I have a question here: has ANYONE here (except me) actually read Barbara Frale’s books?\nBecause Jones is not even citing them, just some press reports. To criticize someone’s theory one should at least familiarize with the work, and not just dismiss it basing on what is wrtiten in the media and (perhaps primary) on prejudices.\nI don’t claim Frale must be right. Just to be fair.\n\n","date":"June 4, 2013 at 4:48 pm","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36107","author":"O.K.","site":"shroudstory"},{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"Actually, most shamelessly B. Frale  made her own French Shroud scholar, Marcel Alonso’s highly speculative hypothesis + italian paleographer, Aldo Marastoni’s, and French optic engineer, late André Marion’s findings, the latter’s partial misreading included!\n\n","date":"June 4, 2013 at 5:44 pm","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36115","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"I don’t say she is completely truly… just asking whether anyone here (except some Italian sceptics whose opinion is obvious) actually read her books.  I know that hypothesis is not her original invention -she only further developed previous conceptions -but that’s not the point. The presence of the letters cannot be either proved nor disproved currently and rejecting Frale’s interpretation a priori seems not to be quite fair.\n\n","date":"June 4, 2013 at 5:53 pm","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36117","author":"O.K.","site":"shroudstory"},{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"How do you prove a negative (there is no writing on the Shroud)?\n\n","date":"June 4, 2013 at 8:23 pm","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36128","author":"Andy Weiss","site":"shroudstory"},{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"There is SOMETHING, that MAY be considered as writing. Whether it actually is, or not, we are not sure yet.\n\n","date":"June 5, 2013 at 3:46 am","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36145","author":"O.K.","site":"shroudstory"},{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"In order to be able to correctly discrimnate between falsely negative and falsely positive perception, just ask an optic engineer, a Late Antique and Medieval paleographer and an archaeological image cryptanalyst worth their salt to work hand in hand.\n\n","date":"June 5, 2013 at 7:09 am","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36158","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"In 1994, I studied the presence or absence of ghost writings around the TS face. \nMy conclusion: there are indeed latent decals of a linen/papyrus small strip (with writings both in Latin and Greek) and three wooden pieces (sawn off the Yeshua’s trilingual titulus damnationis to make a small ‘jawbox’: two placed underneath on each side of the head and the shorter one on top under the chin and used in conjunction with a small face cloth and a skull cap (fastened on top of the long inner burial cloth so as to tightly shut the long burial sheet at head level) \n+ from 1978 Schwortz Turin Sindon face photograph, a short portion decal of a text in Nestorian type of Syriac script can be detected on the digitally enhanced area just under the beard (the same faint almost iligible writing is most unfortunately misinterpreted by Puesch et al as square Hebrew script!). This faint writing should be futher investigated in the light of Rabbi Yeshua’s/the Christ’s apocryphal letter to King Abgar.\n\n","date":"June 5, 2013 at 7:30 am","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36159","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"Correction: In 1994 AND 1997.\n\n","date":"June 5, 2013 at 7:44 am","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36161","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"AND also 2010 (for the Nestorian type of Syriac) from Thierry Castex’s digital image processing from a Schwortz 1978 Turin Shroud face photograph.\n\n","date":"June 5, 2013 at 7:52 am","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36163","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"Sorry, but the article of Jones about writing, with all respect, is nothing but a PURE NONSENSE.\nHas Jones even read Marion and Courage’s  “New discoveries on the Shroud of Turin” , or Barbara Frale’s books (which I have on my bookshelf)? I presume he has not, because he is citing them in his publication. So how can he reliably assess the validity of their claims? Based on prejudiced opinion of sceptics? On some news articles? What about Castex and his results: http://thierrycastex.blogspot.fr/  ? Jones didn’t write a word about it.\n\n","date":"June 5, 2013 at 3:45 am","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36144","author":"O.K.","site":"shroudstory"},{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"I meant to say:”he is NOT citing them in his publication”.\n\n","date":"June 5, 2013 at 3:47 am","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36146","author":"O.K.","site":"shroudstory"},{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"Max, re: #7, could you please explain further what you meant by Nestorian type of Syriac script? Could it be old Aramaic? Can you also provide the letters that, according to you, Puech interpreted as Hebrew? Thanks.\n\n","date":"June 5, 2013 at 10:02 am","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36173","author":"Louis","site":"shroudstory"},{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"Max, I’m still waiting to see the letters.\n\n","date":"June 5, 2013 at 1:40 pm","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36204","author":"Louis","site":"shroudstory"},{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"Louis see Thierry Castex’s website for the faint writing. Don’t you rely on the square Hebrew transcription (Puesch’s). Most obviously this is a misreading. I read it as a short portion decal of a text/letter in Nestorian type Syriac script. See e.g. a chart that illustrates all three types of Syriac scripts, Estrangela, Serto, and Nestorian.\n\n","date":"June 6, 2013 at 6:21 am","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36260","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"I have not read Frale’s books, and notwwithstanding comments above, I’m not persuaded that I ought. Jones’ account of the frustrating attempts by Ian Wilson to obtain the corroboration he sought, matches the account by Wilson himself. I fear that she ought to have demonstrated rather better bona fide than she seems to have managed to date. Neither would I trust her assertion of an account of a Templar initiate being required to kiss the feet of a linen depiction of Christ. The allegations that the Templars “worshipped a head” seems to be based on an invention of the inquisitors who had levelled the same charge against the Cathars. Any admissions that they did so were by relatively lowly ranked Templars and were extracted by threatened or actual torture. \nOne enlightening comment I became reminded of, was that the hood over the head was very likely placed there after death, probably for the portage to the tomb, as the gospel accounts refer to Jesus looking down at his mother Mary and disciple John, which would not have been so recorded if he had been hooded. \nAnother interesting facet I thought, was that if there is anything in the assertions of writing at all, it may well be from the imprints on parchments placed on the cloth at the time of writing. These may have occurred at any time during the cloth’s history, consonant with the language of any actual lettering that may possibly be present, and would account for it being so barely discernible, if it is indeed present at all.\n\n","date":"June 5, 2013 at 9:30 pm","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36244","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"\ndaveb of wellington nz :\n Jones’ account of the frustrating attempts by Ian Wilson to obtain the corroboration he sought, matches the account by Wilson himself.\n\nBecause it is simply based on Wilson’s account, is it so really hard to check the footnotes?\n\ndaveb of wellington nz :\nI fear that she ought to have demonstrated rather better bona fide than she seems to have managed to date.\n\nYes, she was not particularly honest, but skilfull at promoting her books. Nevertheless, I have no heart to condemm her so strongly. She didn’t make any breakthrought, but nevertheless her opinion is worthy to be analyzed.\n\ndaveb of wellington nz :\nOne enlightening comment I became reminded of, was that the hood over the head was very likely placed there after death, probably for the portage to the tomb, as the gospel accounts refer to Jesus looking down at his mother Mary and disciple John, which would not have been so recorded if he had been hooded. \nI don’t see any connection between placing the hood, and Gospel episode.\nThe problem is that, contrary to Jones, presumably Schwortz, Dan, and others, I have read Marion-Courage and Frale’s books. I know their arguments, while being under impression that critics are in fact TOTALLLY ignorant of them. And for me, the Jones article, based mainly on press reports, opinions of anti-authenticity, and of Guscin (negative on assumption!), is totally UNRELIABLE, BIASED and MISLEADING. That frustrates me a lot! The critics are not even interested what Marion, or Castex, or Frale have to say -they ASSUME IN ADVANCE that they MUST be duped! Where is the respect here?\n\n","date":"June 6, 2013 at 5:37 am","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36257","author":"O.K.","site":"shroudstory"},{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"O.K., don’t you worry too much about Dave’s opinion/prose, his sight-and-brain coordination system is definitely NOT trained AT ALL to correctly detect, extract and identify Late Antique and/or Medieval ghost writings. Besides, he is ‘poles apart’ from being an experimental archaeologist.\n\n","date":"June 6, 2013 at 7:27 am","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36273","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"Besides, Dave is neither a Templar historian nor a Templar archaeologist. His opinion is not reliable at all in such matters.\n\n","date":"June 6, 2013 at 7:30 am","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36274","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"BTW Stephen Jones is not reliable either. He is just a Shroud scholar who keeps compiling what others have said or written to make his own opinion, he is definitely NOT a Shroud researcher.\n\n","date":"June 6, 2013 at 7:37 am","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36275","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"Max: I find this bad-mouthing of others’ (including myself) honest attempts at comments in very bad taste, discourteous and downright offensive. I may have my own opinions about the personality traits of others blogging on this site, including yourself, but I endeavour to keep them out of print! This is not the way to win support for any ideas you may have, but perhaps you are more interested only in messing with honest persons’ minds, rather than giving a coherent account of whatever special knowledge you may claim to have!\n\n","date":"June 6, 2013 at 8:25 am","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36280","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"Dave, \nOne true fact is I keep trying sticking to facts or most likely facts to reconstruct the TS image formation process, fill in the historical gap  and freely share my findings. \nOther true fact is oftentimes ‘an idle old Black men on pension’ who never studied the TS in depth as I did, keep ‘bad-mouthing of me and my research work with recurrent discourteous comments and do seem ‘more interested in messing with an honest person’ mind than sticking to facts or most likely facts to solve the enigma and fill in the historical gap as far as the TS  is concerned.\n\n","date":"June 6, 2013 at 10:32 am","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36291","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"Dave, the fact is I don’t like hypocrites.\n\n","date":"June 6, 2013 at 10:43 am","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36292","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"Dave, please don’t you mistake your prose with a Shroud researcher’s opinion.\n\n","date":"June 6, 2013 at 10:46 am","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36293","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"‘Measure for measure’ is not only a play (by Shakespeare?).\n\n","date":"June 6, 2013 at 1:33 pm","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36305","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"\nMax Patrick Hamon :\nBTW Stephen Jones is not reliable either. He is just a Shroud scholar who keeps compiling what others have said or written to make his own opinion, he is definitely NOT a Shroud researcher.\n\nThe problem is that opinions of non anglophone scholars (like Marion, Castex, Frale and others) are usually IGNORED in English-speaking world. Their books or articles have not been published in English -so they don’t exist, or MUST be unreliable. \nI am from Poland, outside of any major Shroud-research centers. And I can see clearly that there is strong national bias in Shroud-research: mainly some mad rivalry between American and Italian scholars, but also with others. And I think that the major problem with Ugolotti/Marion/Castex and others is not Enrie’s pictures, not bandings, not numerical artifacts, not even pareidolia. The main problem is THAT THEY ARE FRENCH (OR ITALIAN)! So, not being OURS, they MUST be WRONG!\n\n","date":"June 6, 2013 at 7:49 am","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36277","author":"O.K.","site":"shroudstory"},{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"\nO.K. :\n The main problem is THAT THEY ARE FRENCH (OR ITALIAN)! So, not being OURS, they MUST be WRONG!\n\nSo had they been American, or British or Australian, I hardly believe there would be ANY problem with accepting their claims.\n\n","date":"June 6, 2013 at 7:50 am","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36278","author":"O.K.","site":"shroudstory"},{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"1) Frale picked up Wilson’s hypothesis of about 1978 that between the years 1204 and about 1355 that the Shroud taken by Crusaders from Constantinople in 1204 was kept in secret by the Templars until 1314 when the Grand Master and the Order’s master of Normandy were burnt at the stake on a charge of heresy by orders of Philip the Fair, and the Shroud was then supposed to have passed into the de Charny family, until its first appearance at Lirey. Wilson had only two main arguments for this hypothesis: a) that the Master of Normandy was an earlier namesake of Geoffray de Charny, and b) the rumours (promoted by the inquisitors) that the Templars worshipped a head. Frale picked up Wilson’s hypothesis, claimed that she had discovered supporting evidence in her archival role at the Vatican, and made press statements to that effect. She appears to have badly misrepresented what she had claimed, and was quite unable to corroborate her claims when the matter was quite properly queried by Wilson who had first originated the idea. This is not the only time that Frale has demonstrated that she is unreliable in such matters, and I am a little perplexed that anyone can think she may have anything useful to say about any topic because of such unreliability. As it happens there are now other hypotheses, with more credible support, for the so-called missing years 1204-1355, involving Othon de la Roche and Jeanne de Vergy. \n2) The “Sudarium of Oviedo” is widely believed to have been the “cloth over the head rolled up in a separate place by itself” referred to in John 20:7-8. As the facial image on the Shroud is no less clear than the rest of the image, it would not seem to have been included in the burial. There has been discussion on this site as to what role it may have had. One idea had been that it served to conceal the face during the crucifixion to spare passers-by from witnessing the facial grimaces of the agony of the execution. However in view of the verses in John 19:25-30, it would seem unlikely to have been in place before death. Immediately before his death, He speaks to his mother and to John, and is offered vinegar. A more likely explanation seemed to me that it served to conceal the death rictus from passers-by during the portage to the tomb. However I recall that there has also been some comment on the differences in the blood stains which may shed more light on the matter, if it can be shown that the blood on the head cloth occurred before death or not.\n\n","date":"June 6, 2013 at 8:05 am","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36279","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"Actually Dave if one reads the conclusions made in the study of the Sudarium, it is pretty clear that the sudarium was placed about the face/head, AFTER death and has actually been estimated to have been placed approximately one hour after death. It was then removed once they entered the tomb.\nR\n\n","date":"June 6, 2013 at 3:09 pm","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36317","author":"Ron","site":"shroudstory"},{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"\ndaveb of wellington nz :\n1) Frale picked up Wilson’s hypothesis of about 1978…\n\nDave, I have read Wilson’s book, I have read Frale’s book, I have read Wilson’s objections to Sabbatier testimony. You don’t have to retell me it again. I don’t consider Sabbatier’s testimony as a solid proof o fTemplar’s possesion of the Shroud, just another hint, that MAY support it (ligneum/lineum -what is the difference in the mouth of tortured man with poor command of latin?)\nBesides, the topic of writing has nothing in common with supposed wirtings on the Shroud. And Sudarium of Oviedo also.\n\ndaveb of wellington nz :\n2) The “Sudarium of Oviedo” is widely believed to have been the “cloth over the head rolled up in a separate place by itself” referred to in John 20:7-8.\n\nDave, look at those websites:\nhttp://manoppello.eu/eng/index.php?go=sudarium\nhttp://www.sudariumchristi.com/uk/tomb/byssus.htm\nThe one thing I disagree is that Sudarium was left on the face.\n\n","date":"June 6, 2013 at 8:28 am","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36281","author":"O.K.","site":"shroudstory"},{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"The topic of Templars has nothing in common with supposed writings, of course.\n\n","date":"June 6, 2013 at 8:45 am","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36284","author":"O.K.","site":"shroudstory"},{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"O.K., in the kingdom of France, the true fact is the 127 articles were first read in Latin then in French and the Templars bouts of interrogation by the commissioners mostly held in French onwards and the prisoners’ replies directly translated and recorded into Latin, hence a high risk of mistranslations each time correlated with mishearings to say nothing of possible  mistranscriptions.\n\n","date":"June 6, 2013 at 2:12 pm","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36308","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"Othon de la Roche was possibly the person who took the Shroud to Athens, there being only Templar spies in Constantinople in 1204, the knights not having taken part in the Fourth Crusade. It was then probably in the hands of the Templars in one of their heavily guarded monastery-fortresses. It must be remembered that Philip the fair’s treasury was empty and he cunningly arrested de Molay when the Grand Master was there, called as he  was by the Pope from Cyprus to France to discuss plans for a new crusade. It was in the interest of the knights to regain morale after the fall of Acre.\nThe knights seem to have had conducted some sort of ritual with copies of the Shroud face, like the one found in Templecombe, and it is possible that there other means of depicting the face. When discussing the matter with the late Daniel Raffard de Brienne he insisted that the Face worshipped by the Templars was a sculpture and that was all, but I had to tell him that this was only part of the story.\n\n","date":"June 6, 2013 at 9:27 am","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36285","author":"Louis","site":"shroudstory"},{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"Louis, 100% agreed.\n\n","date":"June 6, 2013 at 10:14 am","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36288","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"Reminder for Louis et al: the Templars were in Athens after the fall of Acre in 1291.\n\n","date":"June 6, 2013 at 10:59 am","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36294","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"Right Max, It looks like de Brienne, who was a very respectable person, and also a descendant of Walter V de Brienne, Duke of Athens, shunned the idea of Templars owning the Shroud also because he felt his ancestor may have known something and we would have some family documentation from this side.\n\n","date":"June 6, 2013 at 11:19 am","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36297","author":"Louis","site":"shroudstory"},{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"The true fact is de Brienne was an ultraconservative right wing catholic (though a very respectable person I do agree). I met him twice and even had somewhat sporadic epistolary exchanges 1994-1997). He just could not bear the very idea of the TS being related to the Templars he most wrongly considered as heretics.\n\n","date":"June 6, 2013 at 1:29 pm","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36304","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"No wonder Dave cannot either;\n\n","date":"June 6, 2013 at 2:19 pm","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36310","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"\ndaveb of wellington nz :\n1) Frale picked up Wilson’s hypothesis of about 1978 that …\n\nDave, I have read Wilson’s book, I have read Frale’s book, I have read Wilson’s objections to Sabbatier testimony. You don’t have to retell me it again. I don’t consider Sabbatier’s testimony as a solid proof o fTemplar’s possesion of the Shroud, just another hint, that MAY support it (ligneum/lineum -what is the difference in the mouth of tortured man with poor command of latin?)\nBesides, the topic of Templars has nothing in common with supposed wirtings on the Shroud. And Sudarium of Oviedo also\n\ndaveb of wellington nz :\n2) The “Sudarium of Oviedo” is widely believed to have been the “cloth over the head rolled up in a separate place by itself” referred to in John 20:7-8. As the facial image on the Shroud is no less clear than the rest of the image, it would not seem to have been included in the burial. There has been discussion on this site as to what role it may have had. One idea had been that it served to conceal the face during the crucifixion to spare passers-by from witnessing the facial grimaces of the agony of the execution. However in view of the verses in John 19:25-30, it would seem unlikely to have been in place before death. Immediately before his death, He speaks to his mother and to John, and is offered vinegar. A more likely explanation seemed to me that it served to conceal the death rictus from passers-by during the portage to the tomb. However I recall that there has also been some comment on the differences in the blood stains which may shed more light on the matter, if it can be shown that the blood on the head cloth occurred before death or not.\n\nDave, look at those websites:\nhttp://manoppello.eu/eng/index.php?go=sudarium\nhttp://www.sudariumchristi.com/uk/tomb/byssus.htm\nThe one thing I disagree is that Sudarium was left on the face.\n\n","date":"June 6, 2013 at 9:30 am","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36286","author":"O.K.","site":"shroudstory"},{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"O.K.: “Besides, the topic of Templars has nothing in common with supposed wirtings on the Shroud. And Sudarium of Oviedo also”\nNotwithstanding the header on both Dan’s and Stephen’s postings, both topics were included in Jones’ original posting and so are legitimate topics for further comment.\nO.K.: “The one thing I disagree is that Sudarium was left on the face.”\nI don’t know that anyone claimed that it was left on the face. It was part of my original comment that it wasn’t, because of the consistency of the facial image with the other image aspects. I don’t know what you’re disagreeing with!\n\n","date":"June 7, 2013 at 4:04 am","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36342","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"Max, that’s right, de Brienne was very right wing, and that could be understood, given his background. The Chinon Parchment and books by authors like Piers Paul Read and some others, clearly demonstrate that the Templars were not heretics. If there was one chief heretic it was Philippe le Bel himself, when one considers his treatment of Boniface VII, and he had de Molay and Charnay led to the stake the fastest possible when word that Clement V had issued the document relating to Chinon got around. It was too late for Clement to do anything about the Templars, now that the Order was quashed after pressure from Philippe, but John XXII agreed with the idea of “successors” like the Knights of Christ, in Portugal.\n\n","date":"June 6, 2013 at 1:50 pm","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36307","author":"Louis","site":"shroudstory"},{"title":"The Writing on the Shroud:  A Stephen Jones Update","post":"Dave.:”Notwithstanding the header on both Dan’s and Stephen’s postings, both topics were included in Jones’ original posting and so are legitimate topics for further comment.”\nSudarium was not mentioned in Jones article. And the only thing that connects Templars with supposed wrtings on the Shroud is controversial persona of Barbara Frale. Jones, who is completely ignorant about her attempts to interpretate Marion-Courage and Castex findings, is simply attackng her ad persona, for her dishonesty. But all the sins of Frale do not imply that her interpretation is wrong!\nO.K.: “The one thing I disagree is that Sudarium was left on the face.”\nDave.:I don’t know that anyone claimed that it was left on the face.[..] I don’t know what you’re disagreeing with!\nSister Blandina Paschalis Schlömer claims it was left on the face, look at her reconstruction of burial cloths layout: http://www.sudariumchristi.com/uk/tomb/byssus.htm\nand here: http://manoppello.eu/eng/index.php?go=sudarium \nBesides, there is another relic which is claimed to be the hood placed over Jesus’ head after His death. It is Holy Cap of Cahors. It has supposed bloodstains. Robert Babinet claimed that those alleged bloodstains match the head wounds of the Man of the Shroud\n\n","date":"June 7, 2013 at 5:25 am","url":"https://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/","cat":"image_theory","id":"comment-36346","author":"O.K.","site":"shroudstory"}]
