[{"title":"There is another reason Charles Freeman is wrong","post":"And also my small guest posting in this topic:\nhttps://shroudstory.com/2014/11/10/guest-posting-by-o-k-on-the-shroud-as-a-negative/\n\n","date":"January 15, 2015 at 5:30 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183458","author":"O.K.","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"It is very easy to make a negative image both now and at anytime in history. All you need to do is create a positive image, preferably monochrome, but not essentially. You then place it on a frame with a plain backing and hang it somewhere where it catches the sun. Over time, and depending on just how much light it is exposed to, a perfect negative of the original will be created on the backing.  I have seen a very impressive example made by an etching hanging in a Cotswold cottage south-facing hallway for several years. When the engraving was sent for reframing the backing parchment had become a negative as perfect as anything Mr. Eastman at Kodak could have created. Not least, because it was a contact image and no lens was required.\n\n","date":"January 15, 2015 at 5:57 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183465","author":"David Rolfe","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"And thus can I imagine that the shroud might be an “accidental” negative created from a positive painting, maybe even something from Constantinople? Chemistry? Is this possibly a sun bleaching of an image not completely unlike the sun bleaching experiments of Nathan Wilson.\n\n","date":"January 15, 2015 at 6:26 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183469","author":"Dan","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"Here you have Giulio Fant’s paper about experiments with Nathan Wilson theory:\nhttp://www.dii.unipd.it/-giulio.fanti/research/Sindone/PresWILSON.pdf\nAlthough of course a kind of photography, it still lacks certain attributes of the Shroud. Essencially it is a photograph of a painting, with almost all its drawbacks. \nAnd thus can I imagine that the shroud might be an “accidental” negative created from a positive painting, maybe even something from Constantinople? Chemistry?\nTheoretically, it is possible that the body image is in fact negative residual image of painted positive image, due to some chemical agent reacting with linen. That’s the favorite (and completely unverifiable) postulate of the sceptics (Schafersmann, Nickell, Garlaschelli), to explain presence of the image and absence of the pigment at the same time. Yet, in practice, such scenario seems totally implausible. And no such mythical agent has been found so far.\n\n","date":"January 15, 2015 at 8:19 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183488","author":"O.K.","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"“Theoretically, it is possible that the body image is in fact negative residual image of painted positive image, due to some chemical agent reacting with linen.” \nFor that to happen, linen would need to be heavily pigmented (“dark”), and the overlay of paint pigment would need to bleach it sufficiently to cause tonal inversion. Last time I looked, linen was white, or approximately so.\nThat’s my thinking anyway, but then, what do I know, me being a Johnny Come Lately?  ;-)\n\n","date":"January 15, 2015 at 8:29 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183490","author":"Colin Berry","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"Nathan Wilson writes:  “The first linen image created by Beauchamp’s window, exposed for ten days generally parallel to the sun’s path. The linen bears a negative image, dark on light (left), which becomes positive, light on dark (right), in a true photonegative.”  Unlike Freeman, Wilson understood what a negative was. \nIt should be noted that Wilson used unbleached linen which is not quite so white.","date":"January 15, 2015 at 10:08 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183512","author":"Dan","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"In fact, OK, you have it wrong re Garlaschelli’s proposed mechanism. It’s not positive to negative at all. His imprinting of the prominences of a real human being via powder frottage etc creates a negative immediately, because the parts that are brightest in a photograph (nose, brow ridge etc) are imprinted most heavily, and thus tone-reversed on the imprint. If the attached pigment were chemically to etch the linen (“acid impurities etc”)  and s subsequently drop off with ageing, wear and tear etc, one still has the same tone-reversed, i.e. negative image.\nIn short, it’s template to imprinted negative image in a single step, with the ‘negativity’ being conserved via chemical etching despite shedding of imprinting-medium.\nIt’s an ingenious mechanism, and one that needs serious consideration.  Claims that it it fails to reproduce each and every single characteristic of the TS are mean-sprited. I know how the Mona Lisa was produced, but given canvas, brushes and paint would not be able to reproduce it in every single detail.\n\n","date":"January 15, 2015 at 8:47 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183494","author":"Colin Berry","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"From memory, and given that the the backing card was ivory, the tonal quality of the image was very similar to the Shroud.  The only factor was the inverse bleaching by the sun.\n\n","date":"January 15, 2015 at 9:41 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183507","author":"shroudenigma","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"Here’s a suggestion: Among the many readers of this blog and their friends, somewhere there must be an engraving that has hung for a long time in a fairly well-lit space.  Could they examine the backing? We may find another example of a naturally produced perfect negative.\n\n","date":"January 15, 2015 at 9:44 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183508","author":"shroudenigma","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"David,\nWith all due respect, and I do mean respect, your response begs several serious questions. One of those is the fineness of the detail of the image. Assuming arguendo a block print, or a painting, the image is too fine for any known method of reproduction. Also, there is the blood problem. \nIt did not go negative and is shown in all its red glory, preserved according to Adler by the presence of bilirubin.\nA quick look at recent studies on the Internet confirm that stress does in fact increase bilirubin. Those studies were of mental stress that was used to excite the production of bilirubin. Can you imagine the stress of torture and crucifixion?\nAs one correspondent to this blog has pointed out its the combination of the blood (image???) and the body image that refute any painting or block printing theory.\nIt isn’t one factor that determines the legitimacy of the image as being created by an as yet unknown process. It’s an accumulation of circumstances. \nI know some people sneer at circumstantial evidence but ALL evidence concerning the Shroud, including the carbon dating is circumstantial. Among the foremost advocates of using necessity and reliability of circumstantial evidence in studying ancient materials is (gasp) Richard Dawkins.See  Dawkins, Richard , Greatest Show on Earth , p. 106. (Kindle Edition)\nOne of the humorous anecdotes in John Hellers’ book on STURP was when he and Addler conducted  what Einstein called  a “gededenkenexperiment,” – thought experiment – to determine if the Shroud image  could be forged.. Their conclusion: it couldn’t be done. See John Heller, Report on the Shroud of Turin, p. 201.\nWhile their concentration was on painting McCrone was still attempting to debunk the Shroud, as to the fineness of the image, It stands to refute printing the image as well. Show us  a medieval block image of the fineness of the Shroud image.\n\n","date":"January 15, 2015 at 7:10 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183477","author":"John Klotz","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"I was only addressing the issue of the creation of a negative image in medieval times. It is a fallacy that such a thing was impossible. However, the myriad characteristics of the Shroud image defy understanding as a medieval – or modern- creation.\n\n","date":"January 15, 2015 at 7:23 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183480","author":"shroudenigma","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"That’s the best agenda-driven comment I’ve read so far today, David. Keep ’em coming. All grist to the mill…   ;-)\n\n","date":"January 15, 2015 at 7:46 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183482","author":"Colin Berry","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"Colin, what’s driving the comment is an open-minded critical approach to the subject over a forty year period. You will always be a johnny-come-lately but you could at least try the open-minded and critical approach.\n\n","date":"January 15, 2015 at 8:03 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183484","author":"shroudenigma","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"You’ve certainly left no one here in any doubt as to your exclusivity-seeking ‘shroudie’ mindset, David, when you trot out those kinds of sentiments. Thanks for confirming all my preconceptions about David Rolfe Inc.\n\n","date":"January 15, 2015 at 8:14 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183487","author":"Colin Berry","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"The artist was imagining the imprint on a cloth of a body. He knew that the convention since the sixth century ( despite any gospel evidence to support it) was to represent the wound (reported only in the latest of the gospels, John) on the side on the right, so the artist placed it on the left to make the point that he was reproducing a negative impression as left by the body. We see the same on the Besancon Shroud ( which is independent of the Shroud as one can see from the iconography) so the Turin Shroud is not unique in this respect.\nI suspect that some of the so-called copies of the Shroud in Spain may well be independent creations ( e.g. those made after 1532 without the fire marks). It will be interesting to see if they also show the wound on the left. if they do and are not direct copies of the Shroud, this suggests that this became as conventional for these Quem Queritis and other liturgical grave clothes as showing the wound on the right was in conventional Crucifixion scenes.\nCertainly the artist of the Shroud INTENDED it to be a negative as shown by the placing of the wound. How far he succeeded and what other aspects of a negative image he achieved  I leave it to others to determine.\n\n","date":"January 15, 2015 at 6:49 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183473","author":"Charles Freeman","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"Charles, are you confusing the notion of a mirror image for a negative image? You keep talking about left and right.  You even wrote, “For a more sophisticated negative image look at the mirror on the famous Arnolfini portrait by Van Eyck in the National Galley, London ( 1434).”  That is no negative image in that painting. No, really!\n\n","date":"January 15, 2015 at 7:13 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183478","author":"Dan","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"Charles, you have the facts wrong: on the Suaire de Besançon, the side wound was painted on the “wrong” side and this is described at length in manuscript Ms 826 of the Besançon archives. Not only that, this manuscript points out that the artist who made the Besançon “shroud” did not understand how it was supposed to be made (e.g., imprint) and that the Turin Shroud has it right. Have you ever consulted that manuscript?\n\n","date":"January 15, 2015 at 8:33 pm","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183612","author":"Mario Latendresse","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"In fact, OK, you have it wrong re Garlaschelli’s proposed mechanism. It’s not positive to negative at all. His imprinting of the prominences of a real human being via powder frottage etc creates a negative immediately, because the parts that are brightest in a photograph (nose, brow ridge etc) are imprinted most heavily, and thus tone-reversed on the imprint. If the attached pigment were chemically to etch the linen (“acid impurities etc”) and s subsequently drop off with ageing, wear and tear etc, one still has the same tone-reversed, i.e. negative image\nYes, Colin, you are right about Garlaschelli. Yet I can imagine (in theory) similar mechanism with tone-inversal, so the original image would be positive -which is much easier to make. But of course in it still seems entirely implausible in practice.\n In http://www.acheiropoietos.info/proceedings/HeimburgerWeb.pdf uou have following quote (pg. 2-3):\n” LG wrote [8]: “Of course, the results do not look like the\nactual Shroud of Turin: rather, they look the way the\nShroud must have looked shortly after it was made. The\nimage is much more visible, the pigment is still there and\nthere are no water stains and burn marks”.\nLG found that the only way to obtain a “fuzzy image”\nmore or less similar to the TS image was to use a dry\npowder rather than a liquid:\n“it is nearly impossible, when “painting”with slurry, to\nobtain the soft tones and the shading effect which are\ngenerated almost automatically when rubbing with a dry\npowder. Also, it is very difficult to spread a thin, even\nlayer of slurry over large areas like the chest”.\nFollowing LG complete hypothesis, the TS man was\nactually “painted” using this way (the only mean to obtain a rather fuzzy image like that of the TS).\nBecause, according to LG, natural red ochre is necessarily\ncontaminated by traces of acidic materials (like humic acids, organic impurities, various salts…), this foreign “reacting” material might be responsible for the\ndegradation of cellulose. Meanwhile the pigment itself fell\ndown with time. In order to test this hypothesis, LG had to find some kind\nof solid non-neutral “sensitizer” which, once rubbed onto\nthe cloth and artificially aged, could slightly discolor the\ncellulose. After testing dozen of salts and solid acids,\neither mixed with a pigment or even pure, “none of them “left any trace on the linen after heating and final washing.  (boldings mine -O.K.)  LG recognizes that it is “\na major drawback in this kind of reproduction attempt”.\nBecause the presence of water “seems to be” necessary for the chemical sensitizer to come in contact with the fibers, LG performed then another experiment described below. \n\n","date":"January 15, 2015 at 8:58 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183498","author":"O.K.","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"In fact, OK, Luigi Garlaschelli out-of-the-blue, thoughtfully  sent me his paper quite a while ago, like years, not months, despite my being a Johnny Come Lately, which needless to say II scrutinized in minute detail,. \nThe point I made in my return email (sadly no response) was that he seemed to be missing something. He was describing his oven-heating step as a means of accelerating an aged appearance, while overlooking that the elevated temperature was in fact a scorching step, provided the scorching was confined to the area of linen immediately under the solid ochre pigment  or at any rate more advanced there than non-ochre areas. \nIn fact his (or rather Joe Nickell’s) acid impurity hunch fitted well with that localized effect. If the ochre had indeed been contaminated with dilute sulphuric acid due to method of manufacture (calcining of green vitriol, i.e. ferrous sulphate heptahydrate, FeSO4.7H2O) that became steadily more concentrated on heating and evaporation of water then etching/scorching might well have been confined to the parts that were immediately under the linen and not elsewhere. Conc. sulphuric as we know is a powerful chemical dehydrating agent. Once it’s abstracted any free water, it then goes removing hydrogen and oxygen atoms from linen and other carbohydrates in a  2:1 ratio, i.e. the so-called “elements of water” producing an appearance that at least initially looks for all intents and purposes like pyrolysis, i.e. thermal discoloration. Charring is a much later stage.\nI have enormous respect for that Garlaschelli paper. That man and his team kept feet firmly on the ground from start to finish, and described their chemical thinking in amazingly good English.\n\n","date":"January 15, 2015 at 9:23 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183502","author":"Colin Berry","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"Hello Colin\nLuigi Garleschelli did not address the microscopic image. We still have a long way to go, and my next Shroud article, expected to be online in February, will dwell on the image formation process.\nYour comments can be useful.\n\n","date":"January 15, 2015 at 10:42 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183517","author":"Louis","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"“Luigi Garleschelli did not address the microscopic image.” \nNo, but then who has, Louis, beyond a few comments here and there based on Mark Evans photomicrographs, where the latter,  while useful (the best we’ve got) show for the most part bundles of faint yellow fibres with only a few isolated ones?  That’s the basis of the “half tone effect”, striation, discontinuities  etc which frankly is not a lot to go on. So I for one will be interested to see what you’ve been able to come up with Louis re  the “microscopic” image.\n\n","date":"January 15, 2015 at 11:07 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183527","author":"Colin Berry","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"Here are 3D enhanced results of Wilson’s experiments, compared to the actual Shroud. It is obvious that they are hardly the same quality. The large distortions of Wilson-Beauchamp image are evident:\n\nHere you have the original Beauchamp template. It should be noted that it has no bloodmarks that distort 3D effect in the original Shroud (yet can be removed).\nhttp://www.shadowshroud.com/images.htm\n\n","date":"January 15, 2015 at 10:43 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183518","author":"O.K.","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"Here’s a brief and  unsolicited chemistry lesson from the Johnny-Come-Lately:\nIf one’s attempting to produce a negative from a positive without benefit of a photographic emulsion, i.e. with paper or similar, then one’s using the natural phenolics (lignin) as one’s light-absorbing chromophore. One’s looking for a pre-yellowed paper to bleach, or, alternatively, one’s looking for an initially white paper to become yellow.\nBefore setting out, it’s as well to know that “light”, using the term in its broadest sense, can cause paper, linen and other lignin-containing material to bleach OR yellow, and indeed the two processes can occur simultaneously!\nhttp://cool.conservation-us.org/coolaic/sg/bpg/annual/v01/bp01-11.html\nWhy? Well, it’s complex, but arises because the chemistry of lignin yellowing is different from that of lignin bleaching, i.e. not just a reversal. But here’s a clue:\nYellowing of lignins is best achieved with sunlight containing wavelengths that are in the near uv, i.e. 360-390nm\nBleaching of paper on the other hand is best done using daylight fluorescent lamps with ample wavelengths in the blue end of visible spectrum, i.e. 420 -510nm.\nWhy the difference? Uv light has energy sufficient to break chemical bonds that then initiates oxidation and yellowing reactions. \nBleaching? Blue visible light, when absorbed by the yellowed lignin products, causes self-sensitization with production of active singlet-state oxygen, still molecular but a peculiar electronic configuration, different from ground state triplet oxygen. Singlet oxygen has a tendency to add across the conjugated double bond systems that are responsible for yellow colour causing bleaching.\nDon’t let anyone tell you that bleaching or yellowing of linen, paper etc is a simple predictable process, or that it would have been mastered by our medieval forbears. Yes, they left newly woven linen out in the fields, exposed to sun, in order to bleach until chlorine bleaches were discovered, but that’s about the extent of it. Primitive photo-photography?  More moonshine than sunshine if you ask me.\n\n","date":"January 15, 2015 at 10:46 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183521","author":"Colin Berry","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"Yellowing of lignins is best achieved with sunlight containing wavelengths that are in the near uv, i.e. 360-390nm\nBleaching of paper on the other hand is best done using daylight fluorescent lamps with ample wavelengths in the blue end of visible spectrum, i.e. 420 -510nm.\nWhy the difference? Uv light has energy sufficient to break chemical bonds that then initiates oxidation and yellowing reactions.\nBleaching? Blue visible light, when absorbed by the yellowed lignin products, causes self-sensitization with production of active singlet-state oxygen, still molecular but a peculiar electronic configuration, different from ground state triplet oxygen. Singlet oxygen has a tendency to add across the conjugated double bond systems that are responsible for yellow colour causing bleaching.\nDon’t let anyone tell you that bleaching or yellowing of linen, paper etc is a simple predictable process, or that it would have been mastered by our medieval forbears. Yes, they left newly woven linen out in the fields, exposed to sun, in order to bleach until chlorine bleaches were discovered, but that’s about the extent of it. Primitive photo-photography? More moonshine than sunshine if you ask me.\nYes, Colin, especially interesting is where you can get enough blue, or UV light in the medieval. The Sun? See this:","date":"January 15, 2015 at 10:59 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183525","author":"O.K.","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"As I expect you know OK, the Netherlands was the country that specialized in sun- bleaching of linen. Vast areas of good agricultural land were appropriated for the purpose!  I seem to recall reading somewhere that thorough bleaching required not just weeks but MONTHS! Might that have been something to do with the composition of the sunlight: lots of white/blue visible light – good? Too much uv light – bad! Maybe they should have used greenhouses (glass filters off uv).\n\n","date":"January 15, 2015 at 11:15 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183528","author":"Colin Berry","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"I am unable to reply in the appropriate box, but thanks to Stan and Thibault, both medical practitioners.\n\n","date":"January 15, 2015 at 10:52 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183523","author":"Louis","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"The artist was trying to his best to show that this is how he imagined a body would leave its imprint on a cloth and this would inevitably give some impression of being a negative. He may or may not have succeeded but this is what he would have been required to do if producing a grave cloth.\nAs my photography teacher always tell me ‘A photograph is not reality’.\nThe real image is the image on the real Shroud, not photographs of it, and this should be the centre of debate.\nThe least mysterious thing about it is the superficiality as this is exactly an image on a cloth should be if the cloth is properly sized and we have lots of similar examples ( see Villers, ‘The Fabric of Images’).\nThe Shroud may be unique only in its particular combination of features each of which have comparisons elsewhere and in the fact that it MAY be the only survivor of the Quem Queritis ceremony.\nAs Hugh pointed out in his quotation from The Fabric of Images, to an expert such as Villers (who died tragically young from cancer), a faded linen like the Shroud is run of the mill, worth just a passing mention. The few surviving highly sophisticated painted linens, with extraordinarily complex use of pigment layers and mixes are what fascinated her and her colleagues. The fact that she, as an expert, did not think the Shroud was anything special as a an artefact or work of art is significant .\nI don’t think anyone on this site has ever argued as consistently as I have that we should bring in experts in these specialist areas. Far too much time in far too many crucial areas  is wasted going over the same ground without a single input from a specialist. No wonder everyone wanders around in a fog of mystery!\n\n","date":"January 15, 2015 at 11:43 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183531","author":"Charles Freeman","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"“The fact that she, as an expert, did not think the Shroud was anything special as a an artefact or work of art is significant .”    \nSignificant indeed, but not how you imply. It demonstrates how the Shroud is so easily dismissed by art experts who have not taken the time to actually study beyond what they’ve seen in articles. I’m afraid Villers dismissal of the Shroud as insignificant damages her legacy as a serious art historian. I say that with all respect to the deceased.\n\n","date":"January 15, 2015 at 12:39 pm","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183537","author":"David Goulet","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"“The fact that she, as an expert, did not think the Shroud was anything special as a an artefact or work of art is significant .” \nInsignificant? Expert? Anything special? This is madness.\nAuthenticity question aside, I would like to point one interesting observation.\nHere we have Wikipedia’s article ‘History of photography’ http://en.wikipedia.org/wiki/History_of_photography\nIt goes as follows:\nThe history of photography has roots in remote antiquity with the discovery of the principle of the camera obscura and the observation that some substances are visibly altered by exposure to light. As far as is known, nobody thought of bringing these two phenomena together to capture camera images in permanent form until around 1800, when Thomas Wedgwood made the first reliably documented although unsuccessful attempt. In the mid-1820s, Nicéphore Niépce succeeded, but several days of exposure in the camera were required and the earliest results were very crude. Niépce’s associate Louis Daguerre went on to develop the daguerreotype process, the first publicly announced photographic process, which required only minutes of exposure in the camera and produced clear, finely detailed results. It was commercially introduced in 1839, a date generally accepted as the birth year of practical photography.[1]\nWe have also another Wikipedia article ‘Timeline of photography technology’: http://en.wikipedia.org/wiki/Timeline_of_photography_technology\n* 1725 (circa) – Johann Heinrich Schulze makes fleeting “photographs” of words by using stencils, sunlight, and a bottled solution of chalk and silver nitrate, simply as an interesting way to demonstrate that the mixture inside the bottle darkens where it is exposed to light.\n* 1800 (circa) – Thomas Wedgwood conceives of making permanent pictures of camera images by using a durable surface coated with a light-sensitive chemical. He succeeds only in producing silhouettes and other shadow images, and is unable to make them permanent.\n* 1816 – Nicéphore Niépce succeeds in making negative photographs of camera images on paper coated with silver chloride, but cannot adequately “fix” them to stop them from darkening all over when exposed to light for viewing.\nand so on.\nThere is one crucial omission here:\n30 (circa) -1350 (circa) -The Shroud of Turin, the first photographic negative ever is created.\nBecuase, no matter the question authenticity, the Shroud of Turin is the first photography ever created, several centuries before Schulze, Wedgwood and Niépce. That’s a fact. And just due to its primacy, it deserves  appropriate mention in the annals of photography -but what’s strange it is completely absent there! Why? Isn’t it just because it is the Shroud of Turin?\n\n","date":"January 15, 2015 at 2:07 pm","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183545","author":"O.K.","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"“The artist was trying to his best to show that this is how he imagined a body would leave its imprint on a cloth and this would inevitably give some impression of being a negative. He may or may not have succeeded but this is what he would have been required to do if producing a grave cloth.”\nThis is the main problem with your hypothesis.\nAs a medieval forger/painter, I have absolutely no knowledge of negative vs positive in the modern sense.\nI “only” have, probably for the first time in history, to imagine the imprint left by a body on a grave cloth. Not vague stains but the precise imprint of the nose, the eyes, the fingers etc…\nI am a medieval forger. But I understand that I can’t paint the image like a normal painting, an albedo.\nI am thinking about this problem. \nI have the solution. To paint the most prominent parts of the body (nose..) more heavily than the other parts. In other words, to correlate the image intensity with the body/shroud distance or with the body/shroud contact pressure. Eureka !!\nThis hypothesis has been tested many years ago by Jackson, Jumper and Ercoline\n( “Three dimensional characteristics of the Shroud image”, IEEE Proceedings, October 1982 and “Correlation of image intensity on the Turin Shroud with 3-D structure of a human body shape”, Applied Optics, Vol.23, N° 14, 15 July 1984).\n” Four our experiment, we secured the assistance of two certified criminal artists …compose realistic, monotone imagery, qualities found in the shroud image. In one set of experiments, we asked the artists to “freehand” shade an image of a given reference face ..in proportion to relief. In a second set, we provided the artists with relief data at 15 specific ‘anchor’ points on the face.. The artists then constructed an encoder by which they could convert distance information into shading. This encoder was a continuum of shades which correspond to various relief distances”.\nThe result? None of the pictures do show the 3D characteristics of the shroud body image.\nTo summarize:\n1) There is no example of a “negative” image in the history of painting\n2) Even modern artists failed to produce the characteristics of the TS body image (particularly the 3D characteristics) \nHow could your medieval painter produce a negative image with the 3D characteristics of the TS body image?\nYour medieval painter was not only a genius but a magician.\n\n","date":"January 15, 2015 at 3:47 pm","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183563","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"Excellent post Thibault, but this is getting tiresome. Freeman is the epitome of pseudo critic,  (as defined in the US) he feigns honest skepticism while his actions reveal an unalterable doubt of authenticity. The more outrageous his s[speculations, the more clearly he marginalizes himself.\nThere are many people who simply can not fit an authentic  Shroud into their world view.\n\n","date":"January 15, 2015 at 3:54 pm","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183564","author":"John Klotz","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"I would believe that a space alien made the shroud before believing that a positive painting decayed into a negative image.\n\n","date":"January 16, 2015 at 1:07 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183656","author":"Paul","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"“I asked Kitzinger the following question: \n‘Can you show me some works of artists who have painted of Turin.’ His response was: ‘The Shroud of Turin is unique in art. It doesn’t fall into any artistic category. For us, a very small group of experts around the world, we believe that the Shroud of Turin is really the Shroud of Constantinople. You know that the crusaders took many treasures back to Europe during the 13th century and we believe that the Shroud was one of them. As for the bloodmarks done by artists, there are no paintings that have blood marks like those of the Shroud. You are free to look as you please, but you won’t find any.’ ” .G.Lavoie\n[Ernst Kitzinger (1912-2003)]\nCarlos\n\n","date":"January 15, 2015 at 3:21 pm","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183558","author":"Carlos","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"The Shroud was never intended to deceive. No one in the Middle Ages would  been taken in by a cloth with images on it when there were none mentioned in the gospels or seen on any depiction of the burial of Christ. This is why the Church was so easily able to prevent it becoming a medieval cult of an authentic relic – but they were outwitted by a secular ruler- the Savoys – who realised they had the space and influence to claim it was the real thing.\nIn his study of the Quem Queritis ceremonies , Karl Young in the 1930s found four hundred accounts of these ceremonies all involving the display of the grave clothes before the congregation ( so there must have been very many more). So we know that at one time hundreds of these clothes existed. But the attrition rate is high. We know of hundreds of documented painted linen cloths in medieval England- we do not have a single survivor. So the painter of the Shroud would have had lots of models to draw on. It is is a major mistake to think that because the Shroud is a unique survivor tHat it was the only one ever made!! The painter would have lots of models, perhaps even a template to copy from. He may even have been making a replacement of one that had decayed.\nWe are very much at tHe same stage as research on the Egyptian pyramids were in the 1880s. They were so ‘ unique’ all kinds of stories went on about them, with their measurements even being thought to be the source of British weights and measures. Gradually serious research began, they got dated and gradually they were given a context. Work is still going on. There are still lots of ‘ mysteries’ about the pyramids but we have lotS of solid interlocking evidence that explains most but not all of them. Yet there are still people who think they were built 12,000 years ago, were linked to Peru and even Mars.\nAgain the Anti- Kythera mechanism. Vast amounts still to learn from another unique survival and an example of the Greeks being far more advanced that we ever expected them to be. But, of  course, we recognise that what we have now is not what was originally made and the Shroud must be assumed to be the same unless it was miraculously preserved outside the real world of physical change.\nSo you can see why we are in tHe same place as tHe pyramids were in the 1880s.\nAnd haunting though the photographic negatives of the negatives are( as photographic negatives often are) ,you still have to explain why the squiggles of blood on the head are almost identical to those on the Holkham Bible of 1330  (‘remarkably so’ says Paul Lay, History Today Editor when we were looking at them together when he was interviewing me for my podcast).\nAnd crucially you have to explain why Christ’s head is that of a man standing upright with his hair falling to his shoulder- in fact the conventional pose from as early as 300 AD in Rome  but why copied here and not adjusted to show a man lying down. That is one of the mysteries still to be solved- or perhaps the artist was just going through the motions for a commission for a church that needed a new grave cloth in a hurry. We shall never know but this should not stop us bringing in independent experts as I have long advocated.\n\n","date":"January 16, 2015 at 2:59 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183668","author":"Charles Freeman","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"Charles:\n¡Estoy realmente sorprendido de las “barbaridades” que está usted escribiendo!\n“In his study of the Quem Queritis ceremonies , Karl Young in the 1930s found four hundred accounts of these ceremonies all involving the display of the grave clothes before the congregation ( so there must have been very many more). So we know that at one time hundreds of these clothes existed. But the attrition rate is high. We know of hundreds of documented painted linen cloths in medieval England- we do not have a single survivor. So the painter of the Shroud would have had lots of models to draw on. It is is a major mistake to think that because the Shroud is a unique survivor tHat it was the only one ever made!! The painter would have lots of models, perhaps even a template to copy from. He may even have been making a replacement of one that had decayed.”\nVendas, vendas (Clothes, clothes)…..o es que cree que las vendas y las sábanas con imagen (clothes and shrouds) son la misma cosa.\nImagino la sorpresa y estupefacción de las asistentes a “su” Quem Queritis”:\nAngel: “He is not here, He has arisen as He foretold: Go, announce that He has arisen from the grave.”…y el ángel muestra una sábana con la imagen del CUERPO MUERTO DE JESÚS…….\n[unas vendas (clothes) sugiere AUSENCIA, una sábana (shroud) SIN imagen sugiere AUSENCIA, pero una sábana (shroud) CON imagen sugiere PRESENCIA ]\nSu propuesta parece más propia de Woody Allen que de Charles Freeman, y creo que está “jugando” con su prestigio.\nCarlos\n\n","date":"January 16, 2015 at 5:50 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183707","author":"Carlos","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"Carlos, por favor:  “Clothes” no significa vendas. “Clothes”, según el diccionario de Oxford es un tejido que sirve para cubrir el cuerpo (“Items worn to cover the body”), usualmente un vestido o prenda de vestir.  Charles ha usado ese término  como “grave clothes”, literalmente “vestiduras funerarias”, o sea mortaja (Word Reference). En todo caso, no he encontrado ningún diccionario, y he consultado varios, que diga que “clothes” significa vendas. ¿De dónde te lo has sacado?\nAntes de ponerse irónico hay que saber de lo que se está hablando. \nTranslation\nI beg your pardon, Carlos: “Clothes” does not mean bandages. “Clothes,” according to the Oxford Dictionary is a fabric used to cover the body (“Items worn to cover the body”), usually a dress or garment. Charles used the term as “grave clothes”, literally “funeral garments” or shroud (Word Reference). In any case, I have not found any dictionary, and I have consulted several, that says that “clothes” means bandages. Where did you get it? Google Translator?\nBefore putting ironic you must know what is being said.\n\n","date":"January 17, 2015 at 4:12 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183982","author":"David Mo","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"David:\nComo sé de lo que estoy hablando estuve tentado de “ampliar” el comentario para explicarlo mejor…….. pero\nseguiría siendo inútil.\nEl traductor automático de Google Chrome a veces da signos de “inteligencia”, se opone al “desvarío” de Charles Freeman, y tradujo “vendas”. \n“En su estudio de las ceremonias Quem Queritis, Karl Young en la década de 1930 encontró cuatrocientos cuentas de estas ceremonias todos los que implican el despliegue de las vendas antes de la congregación (lo que debe haber sido muy muchos más). Así que sabemos que en algún momento existieron cientos de estas prendas. Pero la tasa de deserción es alta. Sabemos de cientos de documentados lienzos pintados en Inglaterra- medieval no tenemos un solo sobreviviente. Así que el pintor de la Sábana Santa habría tenido un montón de modelos para dibujar. Es es un gran error pensar que debido a que la Sábana Santa es un sobreviviente único que era el único que jamás se ha hecho !! El pintor tendría un montón de modelos, incluso una plantilla tal vez para copiar. Puede que incluso han estado haciendo un reemplazo de uno que había decaído.” Freeman\n“The International Standard Bible Encyclopedia”  expresa:\n“Greek othonion (diminutive of othone) refers to a linen cloth or bandage used in preparing a corpse for burial (John 19:40; 20:5-7).\n(deja claro que acepta como correcta la interpretación de “vendas”, bandage)\nLas Biblias en idioma inglés traducen el giego ὀθόνια  del Evangelio de Juan como “linen clothes”.\nLas Biblias en español traducen generalmente como “lienzos”\nPero la “Biblia de Jerusalén”, creo que con excelente criterio, lo traduce como “VENDAS”:\n(19:40)”Tomaron el cuerpo de Jesús y lo envolvieron en vendas, con los aromas, conforme a la costumbre judía de sepultar”.\n (20:5)”Se inclinó y vió que estaban las vendas en el suelo; pero no entró”. (6)”Llega tras él Simón Pedro, entra en el sepulcro y ve las vendas en el suelo,(7) y plegado en un lugar aparte, no junto a las vendas, el sudario que cubrió su cabeza”.\nSiendo tanto en inglés como en español términos plurales (“linen clothes”, “lienzos”, “vendas”) me sorprende que usted, notable escéptico, acepte la interpretación de que las  “linen clothes” del Evangelio de Juan fueran piezas de lino alguna al menos con un tamaño suficientemente grande como para contener la doble impronta de Cristo (frontal y dorsal), puesto que Charles Freeman nos cuenta el montón de modelos que el pintor de la Sábana Santa podía haber tenido como modelo.\nYo acepto la traducción de vendas, y aunque “el sudario que cubrió su cabeza” pudiera ser una “vaga” referencia a la Sábana Santa, creo que no son precisos 2 milagros (“Resurrección” y “Vestimenta del resucitado”) cuando con 1 milagro es suficiente.\nJesús resucitado cubrió su desnudez con la Sábana hasta devolverla al “criado del sacerdote” como traduce San Jerónimo (342-420 d.C):\n“17. También el evangelio llamado según los Hebreos, traducido recientemente por mí al griego y al latín, del que Orígenes se sirve con frecuencia, después de la resurrección refiere los siguiente: Mas el Señor, depués de haber dado la sábana al criado del sacerdote, se fue hacia Santiago y se le apareció. (Pues es de saber que éste había hecho voto de no comer pan desde aquella hora en que bebió el cáliz del Señor hasta tanto que le fuera dado verle resucitado de entre los muertos). Y poco después: Traed, dijo el Señor, la mesa y el pan. Y a continuación se añade: Tomó un poco de pan, lo\nbendijo, lo partió y se lo dio a Santiago el Justo, diciéndole:\nhermano mío, come tu pan, porque el Hijo del hombre ha\n resucitado de entre los muertos. (De viris ill. 2).”\nCarlos\n\n","date":"January 17, 2015 at 9:25 pm","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-184159","author":"Carlos","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"Carlos: \nIt is absurd that you prefer the translation of Google Translator to the rest of English Dictionaries, including the Oxford dictionary. Everybody knows the limitations of Google Translator… except you.\nBut you got into a discussion about what is the correct translation of ὀθόνια (othonia) in John’s gospel and this is more absurd yet. This is not the issue! Your “sarcastic” comment was started by your incorrect translation of Charles’ expression “grave clothes” to Spanish. Charles meant by that “mortaja” in Spanish (WordReferece), that is to say the cloth in form of a sheet or an altar cloth which was used in the medieval ceremonies of the Quem Queritis.\n\n","date":"January 18, 2015 at 3:23 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-184217","author":"David Mo","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"Quote from Karl Young, The Drama of the Medieval Church, Oxford, 1933, pp. 134-5. Young was aware of some four hundred different accounts of these Easter ceremonies and the following is based on that:\n‘ The dramatic ceremonies at the sepulchre followed the Gospel traditions with considerable freedom, using sometimes a single cloth, called sindo or linteum,sometimes a cloth called sudarium, sometimes several pieces called linteamina, and again both a sudarium and linteamina. These dramatic images may have been in part responsible for the production of painted sudaria which have sometimes been mistaken for authentic relics of the Passion.’\n\n","date":"January 18, 2015 at 4:19 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-184233","author":"Charles Freeman","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"David:\nYo conozco perfectamente el Evangelio de Juan, y por lo tanto que la traducción como vendas era la correcta. \nUstedes, los escépticos, han repetido hasta la saciedad la inexistente mención de una Sábana en ese Evangelio, manteniendo que eran VENDAS lo que Juan refería.\n¿Lo ignora o ha cambiado de opinión para atenerse a la traducción inglesa que proporciona el diccionario de Oxford?.\nCarlos\n\n","date":"January 18, 2015 at 5:57 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-184248","author":"Carlos","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"Charles :\n“Quote from Karl Young, The Drama of the Medieval Church, Oxford, 1933, pp. 134-5. Young was aware of some four hundred different accounts of these Easter ceremonies and the following is based on that:\n‘ The dramatic ceremonies at the sepulchre followed the Gospel traditions with considerable freedom, using sometimes a single cloth, called sindo or linteum,sometimes a cloth called sudarium, sometimes several pieces called linteamina, and again both a sudarium and linteamina. These dramatic images may have been in part responsible for the production of painted sudaria which have sometimes been mistaken for authentic relics of the Passion.’”\nUsted ha interpretado con mucho “exceso” las palabras de Karl Young…..\nMostrar un lienzo mortuorio con la imagen de Jesús en el drama-litúrgico “Quem Quaeritis”, como usted mantiene, sería el MEJOR TESTIMONIO de que se conocía y aceptaba la existencia de una auténtica Sábana mortuoria con la imagen de Jesús…….\nCarlos\n\n","date":"January 18, 2015 at 7:46 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-184266","author":"Carlos","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"There are some things about this thread that I don’t understand, and some that I don’t agree with. There’s a surprise! I don’t think anybody here thinks that a medieval artist set out to create an image which could only be properly appreciated when intensity-inverted like a negative. And the various photographic hypotheses have not gained general acceptance, probably because no one can believe that having invented or discovered the technique, it would not have been used on lots of other things, surely some of which would survive to this day. Arguments (above) against such ideas are largely unnecessary.\nAlso, I don’t think anyone disputes that the Shroud is unique (with the possible exception of some other Shrouds – see below). However, the fact that there are no other comparable 13th century images can be contrasted with the fact that there are no other comparable 1st century images either. Uniqueness by itself is no proof of anything.\nThomas de Wesselow and others have rightly pointed out that there was no need nor tradition for a “miraculous” relic to bear such a realistic imprint; a point neatly set aside by Charles’s suggestion that the Shroud was never intended either as a relic or as witness to a miracle. Carlos is incorrect to suppose that a congregation would be confused between the ‘negative’, monochrome, “realistic” image left on the Shroud as a witness to death, and the positive vision of the risen Christ himself. The whole point of the image being as it is was to emphasise its unmiraculous nature. It was designed to look like the contact image left by a body beginning to decay, not like a the residue of a supernatural resurrection.\nThere must have been very little requirement for this kind of image. Making Christian shrouds may have been the only occasion when it was thought necessary. Even today it is extremely rare, and mostly more of an exercise than an artistic endeavour. Google ‘Brian Lai’ for a modern example. Nevertheless, that does not mean it was untried, or impossible. It is difficult to reconstruct the Shroud of Besançon from such images as remain, but it too appears to have had ‘negative’ characteristics, and its provenance precedes that of the shroud. (It is surely special pleading to say that the real Shroud of Besançon was in fact the Shroud of Turin, taken there after a fire, and that the next Shroud of Besançon was just a rough copy. Besançon and Lirey are only about 200km apart. I think someone would have noticed.)\nNor is the image particularly clear. I don’t understand John Klotz’s statement above, about “the fineness of the detail of the image. Assuming arguendo a block print, or a painting, the image is too fine for any known method of reproduction.” The shroud image shows no eyelashes, eyebrows, nostrils, collarbones, nipples or navel, all of which could be perfectly clearly indicated on a fairly average block print. As for the experiment carried out by Jackson, as described by Thibault Heimburger above, perhaps we should be allowed to check its accuracy for ourselves.\nI am lucky enough to have videotaped, in 1982, a BBC programme of the QED series shown in 1983 called “Shroud of Jesus: Fact or Fake?” At one point the presenter, Anthony Clare, says: “Jackson called in the police to do another test. These artists are trained to compile pictures using shades of light and dark. Jackson got them to paint a Shroud-like bust, but only in terms of shade equals height. There was a lot of cursing and swearing, but the result was quite interesting. What do you think? Almost as good as the Shroud? Not according to Jackson.” We see a couple of artists trying to sketch a face from two identical busts, placed at right angles to each other so that one is face on and one in profile. The “quite interesting” result (and only one of them) was not shown as it was drawn, but only as a negative. I have inverted it here so that we can see the original result, followed by the negative, and then the VP-8 image:\n\nThibault, above, says: “The result? None of the pictures do show the 3D characteristics of the shroud body image.” And Jackson, in the programme, says: “In my opinion the degree of comparison between those police artists’ attempts is not as good as what we see on the Shroud”. I disagree. I think the VP-8 transformation is at least as good as the Shroud’s, if not better.\nFurther on in the programme the BBC commissioned its own replica shroud from Dr Brian Sagar of the Shirley Institute, specially woven for the programme and painted by Susan Hilton. Remarkably, although the making of the fabric was noted by the BSTS (search for Brian Sagar on the shroud.com website), the success or otherwise of the painting was ignored. That is a pity, because there was a concerted effort to duplicate all the characteristics of the the Shroud, in as simple a medieval way as possible.\nBrian Sagar: “Our problem was to find something that would reproduce this, leaving no traces, because we find no evidence of materials like protein or pigments of any kind, or metal ions, with the possible exception of some calcium, which was there in quite large quantities. We tried several materials that we know from past experience degrade cellulose in this way, and in the end we settled for alum, a material widely used by artists in medieval times.”\nNarrator: “Having settled on alum to degrade the cloth, Susan [Hilton, the artist] had to find a pigment, so she could see what she was painting. She chose brazil wood, often used with alum, and so popular in the middle ages that they even named a country after it. … For a canvas she used modern linen cloth that was specially woven to be like the real Shroud. That was sized with gum arabic, which contains calcium. … Finally a mixture of more gum arabic and alum was the medium to take the brazil wood pigment. The rest was up to Susan’s artistic skill.\n…\nAnd the finished product goes off for a bit of aging. [Cloth placed in an oven at 190°C for an unspecified time] We know that in the 15th century the Shroud was washed, in order, they believed, to test its authenticity. They probably used soda ash to get rid of those stubborn stains, like alum and brazil wood. [Cloth boiled in a large beaker]\n…\nWell, there’s the result. Looks good at a distance, and the closer you get, the less you see. [Close up] Tests showed that chemically everything was washed away except calcium and iron, and under the microscope the effect is strictly on the surface. It’s all very like the real Shroud. But the 3D test still has to be passed. Viewed from this side [The side with the epsilon blood mark], the real Shroud looks a bit better than Susan’s painting, but turn the other cheek [Image rotated slowly through about 100°] and there’s very little difference. All in all it looks as though our fake is extraordinarily like the real thing.”\nSo. No gesso, but a sizing of gum arabic. Would that show up in a protein test?\n\n","date":"January 16, 2015 at 1:27 pm","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183761","author":"Hugh Farey","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"There’s some very interesting observations and anecdotal material there Hugh, though it will take me a while to digest the wealth of detail. I especially like the 3D rendering from a contrived ‘relief  map’ (though few artists would choose to paint like that unless, like the ones here, they were specifically instructed to do so, it being more natural to assume lateral illumination to create asymmetrical light and shade). I see it as further evidence that the TS image is an imprint that creates its own slave ‘relief map’ requiring no further effort, beyond that needed to create the master template, be it 3D or bas relief (but then I would say that, wouldn’t I?)\nIn passing, is it true there’s a BSTS  Newsletter, Issue No.80 (December 2014)? (See latest parish magazine from the Bishop of Beaconsfield). If so, can we expect to see it on the usual portal (shroud.com) shortly?\n\n","date":"January 16, 2015 at 2:48 pm","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183780","author":"Colin Berry","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"Dear Hugh,\nI am very surprised.\nYou’ll find the original paper here:\nhttps://app.box.com/s/m0uhcjdn9m40ao95pky8p7iomtfcnx8c\nThe reference face is obviously the same as in your BBC report.\nUnfortunately, there is no picture of the positive or negative paintings in the above paper.\nHowever, none of the VP8 pictures (Fig.12 to Fig.17 in the paper) is similar to your BBC VP8 image. \nThere must be an explanation.\nCan you give us more details and pictures from this BBC report?\nThanks.\n\n","date":"January 16, 2015 at 4:25 pm","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183793","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"PS: in order to download the paper, you have to click on the arrow (top right): “telecharger”=download.\n\n","date":"January 16, 2015 at 4:31 pm","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183794","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"https://app.box.com/s/z50fhlbmlqss4cyq9xqa\nThe JImage 3D rendering of Hugh’s picture.\n\n","date":"January 16, 2015 at 4:46 pm","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183798","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"Hugh:  “Three dimensional characteristics of the Shroud image”, IEEE Proceedings, October 1982 and “Correlation of image intensity on the Turin Shroud with 3-D structure of a human body shape”, Applied Optics, Vol.23, N° 14, 15 July 1984 are absolute MUST READ about 3D features.\nA quote from the latter (pg. 2252):\nFigure 12-17 show contrast enhanced artist attempts and VP-8 reliefs of experimental images. Generally, all images exhibit some correlation with facial relief, showing that an artist is capable of producing shaded images that contain some degree of distance correlation. However, all VP-8 images are different from each other, although they were all generated from the same facial shape. This implies that an artist, when viewed as an information transfer process (for distance), is to some extent stochastic in nature. This is in contrast to other mechanisms discussed below, which are capable of repeatabilty in producing shading structures. Figures 12-15 show the rigorous and freehand attempts of artists A and B. These images, when compared to the Shroud VP-8 reliefs, do not seem particularly convincing  and in general have masklike quality. Each image posseses relief deformities, for example in the lip regions.  The VP-8 reliefs of the rigorous compositions do not show significant improvement over the freehand versions, which suggests that the artist mechanism has a limit as to the precision  by which distance information can be transferred. In Figs 16 and 17 the VP-8  reliefs are noticeably improved and in our opinion approach somewhat   the quality of the Shroud image.  However, these images are the result of the artist copying a distance encoded  photograph with  the contrast restrictions removed.  \nHere you have 3D enhancment of the video clip you posted. Of course in thermal scale , which is the most objective:\n\nThis is certain failure.\n\n","date":"January 16, 2015 at 5:52 pm","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183812","author":"O.K.","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"Dear Hugh,\nI understand your point of view: to look carefully at previous experiments.\nBut what about this BBC report?  \n“Brian Sagar: “Our problem was to find something that would reproduce this, leaving no traces, because we find no evidence of materials like protein or pigments of any kind, or metal ions, with the possible exception of some calcium, which was there in quite large quantities. We tried several materials that we know from past experience degrade cellulose in this way, and in the end we settled for alum, a material widely used by artists in medieval times.”\nThey tried to find some painting medium that degrades cellulose without living any trace.\n(The sentence about calcium is meaningless since calcium is present everywhere on the shroud).\nAlum ?\nhttp://en.wikipedia.org/wiki/Alum\nWhat kind of Alum ?\nAlum (or more exactly Alums) is a complex class of chemical compounds.\nNone of the numerous trivalent metals found in Alums has been found in the body image.\nIt seems that Alums are soluble in water. This is not the case for the body image.\n““Having settled on alum to degrade the cloth, Susan [Hilton, the artist] had to find a pigment, so she could see what she was painting. She chose brazil wood, often used with alum, and so popular in the middle ages that they even named a country after it. … For a canvas she used modern linen cloth that was specially woven to be like the real Shroud. That was sized with gum arabic, which contains calcium. … Finally a mixture of more gum arabic and alum was the medium to take the brazil wood pigment. The rest was up to Susan’s artistic skill.”\nBrazil Wood ?\n  “Starting in the 16th centuries, brazilwood became highly valued in Europe and quite difficult to get. A related wood Sappanwood coming from Asia was traded in powder form and used as a red dye in the manufacture of luxury textiles, such as velvet, in high demand during the Renaissance. When Portuguese navigators discovered present-day Brazil, on April 22, 1500, they immediately saw that brazilwood was extremely abundant along the coast and in its hinterland, along the rivers”\nGum Arabic?\nhttp://en.wikipedia.org/wiki/Gum_arabic\n“Gum arabic is used as a binder for watercolor painting because it dissolves easily in water. Pigment of any color is suspended within the acacia gum in varying amounts, resulting in watercolor paint.”\nIt dissolves easily in water…\n“And the finished product goes off for a bit of aging. [Cloth placed in an oven at 190°C for an unspecified time] We know that in the 15th century the Shroud was washed, in order, they believed, to test its authenticity. They probably used soda ash to get rid of those stubborn stains, like alum and brazil wood. [Cloth boiled in a large beaker]”. \nSomewhere, there is an historical reference to this event (Colin?)\nBut the Shroud show absolutely no evidence of this event.\nTo the contrary, there are no clue of this (alleged) event and there are many proofs of the contrary. Do you really think that the Shroud was boiled, without living any trace of this violent event?\n” Well, there’s the result. Looks good at a distance, and the closer you get, the less you see. [Close up] Tests showed that chemically everything was washed away except calcium and iron, and under the microscope the effect is strictly on the surface. It’s all very like the real Shroud. But the 3D test still has to be passed. Viewed from this side [The side with the epsilon blood mark], the real Shroud looks a bit better than Susan’s painting, but turn the other cheek [Image rotated slowly through about 100°] and there’s very little difference. All in all it looks as though our fake is extraordinarily like the real thing.”\nDo you have the pictures ?\n\n","date":"January 17, 2015 at 5:19 pm","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-184111","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"Here’s the relevant quote from the history section of shroud.com TH (see final sentence).\nApril 14, 1503 Good Friday: Exposition of the Shroud at Bourg-en-Bresse for Archduke Philip the Handsome, grand-master of Flanders, on his return from a journey to Spain. The Shroud, which has been specially brought from Chambéry, with great ceremony, by Duke Philibert of Savoy and Duchess Marguerite, is exposed on an altar in one of the great halls of the Duke’s palace. Savoy courtier Antoine de Lalaing records of the events of that day: “The day of the great and holy Friday, the Passion was preached in Monsignor’s chapel by his confessor, the duke and duchess attending. Then they went with great devotion to the market halls of the town, where a great number of people heard the Passion preached by a Cordeilier. After that three bishops showed to the public the Holy Shroud of Our Lord Jesus Christ, and after the service it was shown in Monsignor’s chapel.” Lalaing adds that the Shroud’s authenticity has been confirmed by its having been tried by fire, boiled in oil, laundered many times ‘but it was not possible to efface or remove the imprint and image.’ \nI leave it to others to judge whether the TS body and/or blood  image we see today could have survived that kind of treatment. What caught my eye on re-reading it was the reference to the “imprint and image” (final 3 words). What was meant by “imprint”? Maybe the blood alone? If so, here’s a late 15th/early 16th century commentator,  a well-connected courtier no less, almost certainly well-informed, who clearly didn’t see the blood (or “blood”) as simply daubed on vermilion or other artist’s pigment. He saw it as … blood!\n\n","date":"January 17, 2015 at 5:47 pm","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-184116","author":"Colin Berry","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"Colin:\nEl texto francés es:\n“C´est la rice syndont et noble Suaire acheté par Joseph d´Arimathie, long de seize à dixsept pieds, large de sept pieds ou environ, où il l´ensepvelist avec Nycodesme quand ils le eurent ostet de la croix. On le voidt clérement ensanglenté du trés précieux sang de Jhesus, nostre Rédempteur, comme se la chose avoit esté faicte aujourd´hui. On y voidt l´imprimure de tout son trés sainct corpz, teste, viaire, bouce, yeulx, nez, corps, mains, pieds et ses chinq playes: espécialement celle du costé, longue environ d´ung bon demi piedt, est fort ensanglentée; et de l´autre part, comme il estoit couvert et redoublé dudict linchoel, on voidt le vestige et figure de son dos, teste, chevelure, coronne et espaules. Et pour esprouver se c´est la mesme, on l´a boulit en huile, bouté en feu et buet par pluseurs fois; mais on n´a peut affachier ne oster la dicte imprimure et figure.” (Texto tomado de La Sábana Santa de Turín. Estudio científico-histórico-crítico. Modesto Hernández Villaescusa. Ed: Imprenta de Henrich y Ca. Barcelona, 1903. Págs. 229-230)\nCarlos\n\n","date":"January 17, 2015 at 10:11 pm","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-184167","author":"Carlos","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"Thanks Carlos. I doubt if everyone here will be able to cope with the original archaic French, sections of which Google Translate simply gives up on. \nAs it happens my wife of 44 years did a postgrad diploma in medieval French. I shall show her the fruits of your research later. For now, the key words are the final ones: “… mais on n´a peut affachier ne oster la dicte imprimure et figure.” . \nIf I’m not mistaken, imprimureand figure make the essential distinction between imprint and body image, the one that we routinely make today when wishing to distinguish  between the prominent blood, which some say is still bright red, and thus questionable re authenticity, Adler’s bilirubin notwithstanding, as distinct from the still mysterious sepia body image (but we Johnny Come Latelys are working on it),\n Would Lalaing have used those words if the TS he was viewing looked as if it had simply been painted with a brush onto linen with the standard artist’s pigments of the day? Would the earlier Shroud have been submitted to all those hair-raising treatments if there had been the slightest hint or suspicion that it was simply a painting? Answers on a postcard please.\n\n","date":"January 18, 2015 at 4:01 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-184230","author":"Colin Berry","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"Thanks Carlos and Colin,\n” Lalaing adds that the Shroud’s authenticity has been confirmed by its having been tried by fire, boiled in oil, laundered many times ‘but it was not possible to efface or remove the imprint and image.’\nLooking at the old original text this translation of the final part is true.\nIn the text, we find the terms: “syndont”, suaire and linchoel (linceul) which are 3 words referring to the same object: the shroud.\nI have been unable to find the word “imprimure” in the dictionaries of medieval French. I found “emprimure” which means model or shape.\n“On y voidt l´imprimure de tout son trés sainct corpz, teste, viaire, bouce, yeulx, nez, corps, mains, pieds et ses chinq playes: …”\nMy translation:\nWe see the shape of his whole holy body, head, face, mouth, eyes, nose, body, hands, feet and the five wounds…\n“On le voidt clérement ensanglenté du trés précieux sang de Jhesus, nostre Rédempteur, comme se la chose avoit esté faicte aujourd´hui. ”\nMy translation:\nWe see it [the shroud] clearly stained with the very precious blood of Jesus, our redeemer, as if this was done today.\nThe term “figure” is found here:\n“on voidt le vestige et figure de son dos, teste, chevelure, coronne et espaules.”\nWhich means, describing the back side:\nWe see the vestige and the “figure” of his back, head, hair, crown and shoulders.\nIn other words, I don’t think we can do any kind of difference between “figure” and “imprimure”. Both terms mean the body image which is described as some kind of imprint.\nThe five wounds (blood) are included into the  “imprimure”.\nIt seems that the medieval witnesses could not understand the difference between the (positive) blood marks and the (negative) body image.\nFor them, both “imprints” were the result of the same process (some kind of imprint).\nWe now know that it is not true. \nAccording to Lalaing: ” the Shroud’s authenticity has been confirmed by its having been tried by fire, boiled in oil, laundered many times ‘but it was not possible to efface or remove the imprint and image”\nHugh, you wrote: “Antoine de Lalaing records that Shroud has often been thoroughly washed.\nThe BBC’s research was better than you might think…”\nLalaing wrote exactly: ” Et pour esprouver se c´est la mesme, on l´a boulit en huile, bouté en feu et buet par pluseurs fois; mais on n´a peut affachier ne oster la dicte imprimure et figure.”\nwhich means: “that the Shroud’s authenticity has been confirmed by its having been tried by fire, boiled in oil, laundered many times ‘but it was not possible to efface or remove the imprint and image.’\nNot only washed.\nDo you really think that the Turin Shroud has been ‘tried by fire” and “boiled in oil” without leaving any trace of these dramatic events?\nI can see only 2 explanations:\n1) Lalaing lied.\n2) These “experiments” were performed only on a tiny part of the shroud image which are perhaps not visible today because of the 1532 fire (??).\n\n","date":"January 18, 2015 at 3:28 pm","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-184317","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"Yes Colin, Barrie has the Newletter and will publish it in his next update.\nBut sorry, Thibault, all I have is this ancient video. There is a site devoted to old BBC programmes, which gives the date as 3 November 1982 and 22 August 1983. I don’t know when I taped it. The narrator was Anthony Clare, the editor Mick Rhodes and the producer John Lynch. It’s half an hour long. I’ll provide a synopsis tomorrow, if you like.\n\n","date":"January 16, 2015 at 5:23 pm","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183806","author":"Hugh Farey","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"Any chance of a sneak preview, Hugh, if only a Table of Contents?\n\n","date":"January 16, 2015 at 5:45 pm","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-183811","author":"Colin Berry","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"Here is a description of the programme described above.\nMinutes\n0          Introduction.\n1          Prof. J.M. Cameron demonstrates the forensic aspects of the shroud using a full size positive reproduction.\n2          The current site and post 14th century history of the Shroud.\n3          Illustrations of other medieval relics, and the letter of d’Arcis.\n4          The STuRP investigation.\n            Quotes from Jackson, McCrone, Adler, Heller.\n5          The negative and a 3D bust.\n6          John Jackson and the VP-8 analyser.\n8          The police artists.\n9          Dr Cameron’s illustrates wrist nailing with a skeleton, and scourgemarks with a photo.\n10        Medieval paintings similar to the Shroud.\n11        NASA’s image enhancements fail to show wounds. Other STuRP imaging results. Only two useful ones. Fluorescence denies the possibility of a scorch. X-ray fluorescence shows calcium and iron.\n12         Walter McCrone’s findings, followed by him painting his own Shroud.\n14         Adler denies the possibiity of painting all the individual threads. He and Heller explore the chemistry. There has been nothing added to the cloth.\n              Heller: “The image of the man is composed of nothing but dehydrated oxidised cellulose. There has been nothing added in the way of any pigment, stain or coloured material of any type.”\n              As for the blood:\n              Adler: “All right John, I’m going to add the hydrazine. It’s giving a positive haemochromagen test.”\n              Heller: “OK, so that’s blood.”\n              Adler: There’s absolutely no doubt in my mind that this is blood; B.L.U.D. blood!”\n17          Demonstration of electrical discharge from a living hand and a heated brass facemask covered with a cloth. Neither experiment looks good.\n18           Sam Pellicori and Vern Miller try to produce a shroud using a living, sweaty man anointed with oil, spices and embalming olives. He is covered with a sheet which is then given two hours at 300°C for aging. The result is chemically good and the image is only on the surface, but it is too much of a contact print with no image from non-contact areas.\n20          Susan Hilton and Brian Sagar make their own shroud, as described above. “It’s all very like the real shroud.”\n24          Could it be a miracle? Teddy Hall: “I don’t think a scientist is able to add anything to the knowledge of miracles. He is in the same realm as anybody else. If you believe in miracles you can believe in anything.”\n              Demonstration of how radiocarbon dating works. Description of the upcoming tests.\n26         Tour around an AMS radiocarbon dating lab. Quotes by Pellicori, Adler, McCrone, Heller, Jackson.\n28         “The labs are preparing for the test [in 1982!] and the world awaits the Church’s permission to do it. One day soon, we’ll know the date of the Shroud…”\nQED wishes to thank:\nShirley Instiute for Textile Research\nResearch Laboratory for Archaeology, Oxford\nNASA Jet Propulsion Laboratory\nBrooks Institute for Photography\nBarrie Schwortz Photography\nLog E Tronics Inc\nShroud of Turin Research Project\nScreen Pro Films\nIan Wilson\n\n","date":"January 17, 2015 at 10:17 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-184049","author":"Hugh Farey","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"Yes, alum dissolves in water; that’s the point. After degrading the cellulose it can be washed completely away.\nThe calcium “all over the Shroud” is explained by the gum arabic size.\nBrazil wood is first recorded in use in 1321.\nAntoine de Lalaing records that Shroud has often been thoroughly washed.\nThe BBC’s research was better than you might think…\n\n","date":"January 17, 2015 at 7:29 pm","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-184137","author":"Hugh Farey","site":"shroudstory"},{"title":"There is another reason Charles Freeman is wrong","post":"I can see only 2 explanations:\n1) Lalaing lied.\n2) These “experiments” were performed only on a tiny part of the shroud image which are perhaps not visible today because of the 1532 fire (??).\nOr perhaps those are slightly exaggerated descriptions of Shroud damages prior to 1532 fire. The presence of ancient watermarks and poker holes might have created the story about trials by fire and water.\n\n","date":"January 18, 2015 at 3:53 pm","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","id":"comment-184320","author":"O.K.","site":"shroudstory"}]
