[{"title":"There should be some kind of reaction at the upcoming BSTS meeting.","post":"I will repost here the comment I’ve made yesterday because it was a direct reaction to Thibault’s comment and I think my comment deserve some thoughts.  Here it is : \nIn normal conditions, maybe the amount of heavy amines seems inadequate in Rogers hypothesis. But who can say if Jesus case was “normal” ??? Who was there 2000 years ago to take measurements about the amount of amines released by the corpse ??? I think we should be very prudent before claiming “Maillard reaction was very likely not possible in the first days after the death of the TSM simply because the necessary heavy amines postulated by Rogers (Putrescine and Cadaverine) were missing.”\nI truly think this is a very bad statement, scientifically speaking. Normality is not always at work everywhere, everytime and any good scientist SHOULD know this basic FACT !\nBefore someone crucified me for this critic versus Thibault’s comment, I should add that I take good note of the words “likely not possible” he wrote. But in my opinion, it’s the same as saying “highly unlikely” and it’s not correct, for the simple reason nobody know what was the exact conditions inside the tomb and inside the Shroud. In this context of darkness, nobody can be sure if there was not some “special” conditions that could have contributed to a release of more amines than “normal”. I don’t think there are enough studied in that matter to be so sure about that. So, can we keep an open-mind about the possibility that Rogers hypothesis can be correct IN THE STATE he wrote it ? Who really knows ? One data that is always neglect versus the production of amines is the FACT that we’re dealing with a corpse that is FAR FROM BEING NORMAL !!! It is a tortured, scourged, crucified corpse that was on the cross for at least 3 hours !!!!!! Do you know one single scientific study that have measured the amount of heavy amines postulated by Rogers that could have been released by an “abnormal” corpse like that ? There is none ! So please, can we avoid words like “highly unlikely” or “likely not possible” please, because in the present state of our knowledge, NOBODY CAN BE SO SURE ABOUT THAT !!!!\nOne truly scientific truth is this :  THERE CAN BE EXCEPTIONS TO THE RULE, ESPECIALLY IF “SPECIAL” CONDITIONS EXISTS !!!  Personally, unless someone can show me a good scientific study published in a well-respected peer-reviewed journal that can PROVE that a dead body who suffered similar tortures like the ones suffered by Jesus is not able to emit enough putrecines and cadaverines to produce a Maillard reaction at the surface of an ancient linen cloth, I will still leave the door wide open for the possibility that Rogers hypothesis can be “generally” correct IN THE STATE HE WROTE IT.\nAnd before ending my present comment, here’s a message for Ron :  You wrote some days ago that Rogers once wrote this : “Even Rogers made statement to this in his paper! He was well aware that diffusion (alone) COULD NOT HAVE CREATED THE IMAGE.”\nSorry Ron but I have finish the reading of the very interesting paper recently published by Thibault in which we found all the known comment made by Rogers on the SSG concerning his hypothesis of the Maillard reaction.  I have also read all the papers and the book published by Rogers concerning the Shroud.  And in all these public and private writings of Rogers, I NEVER WAS ABLE TO FIND SOMETHING WRITTEN BY ROGERS HIMSELF THAT CAN BE CONSIDERED CLOSE TO WHAT YOU PRETEND…  Of course Rogers, in some written comments he made, was leaving the door open (as it should) to the possibility that some other process(es) could have been going on inside the Shroud during the image formation process, along with the gaseous diffusion he proposed.  There’s no doubt that there is a pretty good probability for this and Rogers was not fool enough to deny it.\nBUT… from my reading of Rogers writings, I can state with confidence that he NEVER wrote something definitive and without appeal such as : “diffusion alone could not have created the image.”  I ask the question :  Today, in the present state of our knowledge, who can really pretend without any doubt that Rogers hypothesis alone, in the form he wrote it, is SURELY unable to explain the image on the Shroud ???  I don’t think science as reach that point yet…Honestly, because of all the unknowns that exist concerning Jesus burial conditions and the exact amount of heavy amines his tortured corpse could have produced in the first 36 hours after death, I think we should be very prudent before even thinking that Rogers hypothesis can really be inadequate to explain the body image on the Shroud.  Let’s wait for more researches please !!!\n\n","date":"August 18, 2012 at 8:03 pm","url":"https://shroudstory.com/2012/08/18/there-should-be-some-kind-of-reaction-at-the-upcoming-bsts-meeting/","cat":"image_theory","id":"comment-15195","author":"Yannick Clément","site":"shroudstory"},{"title":"There should be some kind of reaction at the upcoming BSTS meeting.","post":"In order to complete my thoughts on the subject of the level of heavy amines that can be released by a tortured and crucified corpse during the first 36-72 hours after death, I would simply say these 2 things :\n1- In his 2007 paper on the subject, Thibault Heimburger made some references concerning studies that were done showing that a corpse would not produced enough heavy amines to account for the kind of Maillard reaction hypothesis proposed by Rogers. It’s interesting BUT we have to be very cautious here because none of these studies have been done with fresh corpses that were tortured in a similar way than what happen to the man of the Shroud.  It’s evident that the studies cited by Thibault were done on “normal” corpse who didn’t suffered intensely like the man of the Shroud prior to their death, and consequently, we can consider them as “not representative” of the kind of dead body that has been the primary source of the image formation process.   \n2- We’re almost sure about the fact that the type of intense suffering endured by the man of the Shroud would have produced, prior to his death, a high rising of the body temperature, accompanied by much more sweating than normal, along with a high rising of many toxic substances in the blood and/or in the body and/or on the skin like bilirubin (scientifically confirmed), CO2, urea, lactic acid, etc., in levels much higher than normal, and the probable apparition of many important biological problems like metabolic acidity, respiratory acidosis, respiratory problem, dehydration, ionic trouble, renal failure, tachycardia, etc.  We’re also almost sure that the body of the man of the Shroud suffered rigor mortis much faster than normal after death. Consequently, in this context of “abnormality”, how can we be so sure that a tortured and crucified corpse like the man of the Shroud would have released the same amount of heavy amines like putrescine and cadaverine than a “normal” corpse during the first 36-72 hours after death ???  On the contrary, how can we be so sure that the very traumatic state of the corpse of the man of the Shroud just prior to his death would not have caused a important and “abnormal” increase in the release of a heavy amines like putrescine and cadaverine during the 36-72 hours after death ???\nTaking all this into account, how can someone conclude that it is “likely not possible” that the released of heavy amines like putrescine and cadaverine would not have been sufficient in the case of the man of the Shroud in order to start the Maillard reaction as proposed by Rogers ???  How can we be so sure about that, while there is absolutely no scientific study concerning the amount of heavy amines that a tortured corpse can emit in the first 36-72 hours after death ???  I’ll say it again because this fact is way too much neglected in the Shroud world :  The corpse that was the source of the body image on the Shroud was NOT a normal corpse !!!  It was a tortured, scourged and crucified corpse who had suffered intensely for many hours just prior to his death and who could well have react very differently in comparison of any “normal” corpse !!!  I hope you’ll get the point… Until new scientific studies can be done concerning the amount of heavy amines that can be released by a corpse that has been severely tortured for a long period of time prior to his death, I think GREAT PRUDENCE is needed before making any kind of conclusion versus this important aspect of the Maillard reaction hypothesis as proposed by Rogers.  Much more researches are needed !\n\n","date":"August 19, 2012 at 6:56 pm","url":"https://shroudstory.com/2012/08/18/there-should-be-some-kind-of-reaction-at-the-upcoming-bsts-meeting/","cat":"image_theory","id":"comment-15226","author":"Yannick Clément","site":"shroudstory"},{"title":"There should be some kind of reaction at the upcoming BSTS meeting.","post":"Actually it seems i’ve missed the Valencia meeting and ENEA’s work. No comment.\nConcerning the quoted words, they have not been removed, you have to click on “load more post” at the end of comments.\nAnd you can see other words which worth quoting :\n\nDavid Rolfe :\nThe fondness that everyone, me included, has for Ray’s memory is the only thing that has kept the theory alive for as long as it has.\n\nThat is almost an insult to Rogers’ work. I don’t know what David understands to Rogers’ hypothesis, but it is based on very solid scientific arguments.\n\n","date":"August 25, 2012 at 1:43 pm","url":"https://shroudstory.com/2012/08/18/there-should-be-some-kind-of-reaction-at-the-upcoming-bsts-meeting/","cat":"image_theory","id":"comment-15472","author":"anoxie","site":"shroudstory"},{"title":"There should be some kind of reaction at the upcoming BSTS meeting.","post":"I think M. Rolfe prefer to believe in Jackson’s “theory” of a body of light.  He’s free to do so of course, but you’re completely right about the fact that his quote is an insult to the profesionalism and honesty of Rogers.  In the light of all that was written on this blog since a few months regarding Rogers interesting hypotheses concerning not only the image formation but also the chromophore of the image, I think M. Rolfe should reconsider the whole issue and start to be more open-minded about Rogers work.  When the supernatural fringe will read this, they will surely think that I should apply this reflection to my way of looking at the supernatural hypotheses regarding the Shroud.  In a way, it’s true that I could be more “open” about these kind of hypotheses but at least, if you look again at the four possible scenarios that I described in my recent paper, you’ll note that I stayed open about that possibility.  I don’t think we can say the same concerning the openess of M. Rolfe (or many other people in the Shroud world) versus the possibility of a totally natural image formation process that could explain the Shroud…  Last thing :  If I look so close-minded versus the possibility of a by-product of the Resurrection that has left an imprint of the body on the cloth, this is mainly due to the fact that I prefer (at least for the moment) to stay completely within the realm of science, simply because science is not able yet to state categorically that the image on the Shroud was not caused by some natural process(es).  If this happen one day, maybe I’ll start to be more open-minded about the possibility of some miraculous process linked with the Resurrection.  But not before !  I have too much respect for the capacity of science to constantly evolve and while doing so, to make new discoveries that help us more and more to understand our material Universe and all the processes that are going on inside it.\n\n","date":"August 25, 2012 at 6:01 pm","url":"https://shroudstory.com/2012/08/18/there-should-be-some-kind-of-reaction-at-the-upcoming-bsts-meeting/","cat":"image_theory","id":"comment-15473","author":"Yannick Clément","site":"shroudstory"}]
