[{"title":"Thermo-Stenciling the Shroud of Turin?","post":"This is why I hope Dilazzaro goes ahead with his experiments. He has been able to colour the fibers using a radiation and yet without affecting them the way Rogers predicted radiation would do.\n\n","date":"January 2, 2012 at 6:16 am","url":"https://shroudstory.com/2012/01/02/thermo-stenciling-the-shroud-of-turin/","cat":"image_theory","id":"comment-6455","author":"Gabriel","site":"shroudstory"},{"title":"Thermo-Stenciling the Shroud of Turin?","post":"wait a minute that is not a negative and it can;t produce3D data, no it can;t. it can;t be doubly superficial or pixelated like the shroud.i;ll bet thermal stencil images fluoresce under UV light. try it. shroud images do not. major fail.\n\n","date":"January 2, 2012 at 7:02 am","url":"https://shroudstory.com/2012/01/02/thermo-stenciling-the-shroud-of-turin/","cat":"image_theory","id":"comment-6457","author":"MouseInTheHouse","site":"shroudstory"},{"title":"Thermo-Stenciling the Shroud of Turin?","post":"writing for sciencebod who said… \nThanks Mouse. I just tried responding to your same comments over on Dan’s site, but WordPress does not seem to accept my login and the commenst has not appeared.\nHere it is:\n“MouseInTheHouse is absolutely correct when he says that a thermal stencil image is a positive, not a negative, since dark charcoal-covered areas become dark scorched areas. I thank him for the opportunity to back-track a little on what I may have said previously, or at any rate to qualify it.\nTo produce a Turin-Shroud like negative, one that becomes a positive on the photographic negative, then the hypothetical sketched image would have had to be drawn as a negative, with a reversal of light and shade, which is admittedly unconventional. \nBut there may be strong practical reasons for doing so given the proposed technique: in a well-illuminated subject there will be a predominance of light reflective areas over ones that are in shade (eye sockets and the like). That would tend to give a scorch pattern with just a little scorch, but an awful lot of white space. By reversing lighjt and dark in the sketch, one ends up with something that makes a much bolder image but one that is still recognizable as a man, despite the reversal of light and shade.\nI hope that makes sense…”\nCould you oblige by cutting and pasting into Dan’s blog. I’ll try and sort out the WordPress thing later. Odd, because I am able to post comments to another WordPress blog without being pre-registered for that site… \nJanuary 2, 2012 3:36 AM\n\n","date":"January 2, 2012 at 8:29 am","url":"https://shroudstory.com/2012/01/02/thermo-stenciling-the-shroud-of-turin/","cat":"image_theory","id":"comment-6463","author":"MouseInTheHouse","site":"shroudstory"},{"title":"Thermo-Stenciling the Shroud of Turin?","post":"Ah yes, Arrhenius, one of my favourite scientists (shame however about his politics with the racial eugenics etc etc).\nIt’s that exponential equation that is of coure the basis of the rule of thumb that a 10 degree Celsius rise in temperature doubles the rate of most chemical reactions. That would include scorching of cellulosic carbohydrates to make progressively more aromatised structures with conjugated double bond system.\nI’m reserving judgement on that evidence that scorching played no part in forming the image on the Shroud (and not just because scorching is easily faked as I described yesterday). Let’s just say I’m highly sceptical. The devil as ever is in the detail.\nWill stop now to see whether my new registration with WordPress works here…\nColinB aka sciencebod\n\n","date":"January 2, 2012 at 1:37 pm","url":"https://shroudstory.com/2012/01/02/thermo-stenciling-the-shroud-of-turin/","cat":"image_theory","id":"comment-6475","author":"sciencebod","site":"shroudstory"},{"title":"Thermo-Stenciling the Shroud of Turin?","post":"I overlooked to thank MouseintheHouse earlier for agreeing to transplant a comment from my own blog prior to my (re)registering with WordPress, to say nothing of Dan Porter for responding to an email almost instantly with this post. Many thanks to you both.\nIt seems somewhat uncharitable then, to say the least, to immediately take issue on the details, but hey ho, that’s science for you.\nWhile my knowledge on many of the issues is patchy, there is one apparent discrepancy that strikes the newbie quite quickly. On the one hand we read that the image is exceedingly superficial, scarcely penetrating into the fibres, yet above we read that if scorching were the mechanism then we would expect to see changes in the structure of the flax fibres. I do not see the latter as in any way self-evident, far less obligatory, if one supposes that scorching affects the most superficial top surface only. Indeed, if  a sketched image in charcoal or a similar black pigment were used to absorb radiant heat, as I have suggested, that might also tend to restrict scorching to a very small depth of penetration, such that fibrils look relatively intact immediately below the scorched layer… In other words, the carbon particles serve to protect deeper layers.\nThere is also a recent paper on cellulose pyrolysis that starts by listing the initial depolymerisation products – levoglucosan, furfurals etc – and then makes the interesting observation that char is formed by re-polymerisation of the decomposition products (rather than stripping out of volatiles, say, to leave a C-skeleton).\nhttp://pubs.acs.org/doi/abs/10.1021/jp906702p\nGiven that the monomers for the secondary polymerisation are small molecules and volatile, at elevated temperatures they will tend to diffuse rapidly from their sites of formation into the surrounding air.  So there are further grounds, albeit theoretical ones, for thinking that the scorched zone could be very superficial indeed, resulting in minimal damage to fibrils at a gross level observed by light microsocopy or possibly even SEM.\n\n","date":"January 2, 2012 at 8:02 pm","url":"https://shroudstory.com/2012/01/02/thermo-stenciling-the-shroud-of-turin/","cat":"image_theory","id":"comment-6481","author":"sciencebod","site":"shroudstory"},{"title":"Thermo-Stenciling the Shroud of Turin?","post":"how about the partial image on the reverse surface of the cloth with nothing in between? how about the halftone that causes only apparent saturation effects?\n\n","date":"January 3, 2012 at 7:11 am","url":"https://shroudstory.com/2012/01/02/thermo-stenciling-the-shroud-of-turin/","cat":"image_theory","id":"comment-6491","author":"MouseInTheHouse","site":"shroudstory"},{"title":"Thermo-Stenciling the Shroud of Turin?","post":"Hello again oh murine friend\nImagine if you will that one of your furry relatives from say, a faraway cheeseless country,  were to come down the gangplank of a ship that had berthed in Southhampton, and were to discover the delights of English cheese in an ancient discarded sandwich. Said mouse, if intelligent like you, might want to discover how and where the cheese had been made. But before trying to reproduce Cheddar, or Stilton or Wensleydale, with all their individual character, the first priority would be to discover the likely  starting ingredients, and how they were treated to make a generic cheese – say, one that was merely hard or soft to start with. Understanding the finer distinctions would come later. The first task is to produce something that is recognizable as cheese… ;-)\n\n","date":"January 3, 2012 at 11:33 am","url":"https://shroudstory.com/2012/01/02/thermo-stenciling-the-shroud-of-turin/","cat":"image_theory","id":"comment-6501","author":"sciencebod","site":"shroudstory"},{"title":"Thermo-Stenciling the Shroud of Turin?","post":"The FACT that the blood on the Shroud is real human blood that come from direct contact transfer between the cloth and exsudates from still humid blood clots on a corpse AND the FACT that this blood was transferred to the cloth BEFORE the body images were formed are the 2 best clues that tells me that the Shroud is first of all genuine and also that the body images were not formed by human hands, i.e. they were formed by a natural or a supernatural (I let this door open even if I don’t believe it) process.  I just can’t imagine an artist or a forger taking a tortured corpse, putting it in a Shroud first in order to get real blood stains, and then, after this first “natural” operation, artificially create the body images by a mechanism that we still don’t know, all this while reproducing accurately all the forensic details of a beaten, scourged and crucified body with no great distorsions between the blood images and the body images !  In addition, this forger would need to know all the precise details of a Roman execution, while many of them were unknown to every artists that ever depicted Jesus on the cross before the time the Shroud of Turin was put on public display in the Middle Ages.  Even the most early artistic depictions we have of the crucifixion (made in the 4th or 5th century) always put the nails in the palms of the hands !  I simply cannot believe that the scenario I just describe can have one chance to be true !!!  It’s just too extreme that we have to discard it.  But, nevertheless, this is the only possible scenario that I can imagine if the body images on the Shroud were made by human hands !  That’s why I always consider the blood images on the Shroud (and not the body images) as the most evident proof of authenticity !  It’s just outside the realistic realm of possibility.  So here’s an advice for you folks :  Forget about it !  The body images on the Shroud were surely (at 99.9 % of chances and even more) made by the interaction of a Shroud prepared with the ancient method of making linen cloths and a crucified body.  And, personally, basing my judgement from all the data we know about the Shroud, I think the chances that this interraction was chemical in nature (and then, completely natural in essence) rank VERY HIGH, despite what M. Fanti, Di Lazzaro, Jackson, Rinaudo, Moran, Whanger, etc, might believe.\n\n","date":"January 3, 2012 at 8:13 pm","url":"https://shroudstory.com/2012/01/02/thermo-stenciling-the-shroud-of-turin/","cat":"image_theory","id":"comment-6523","author":"Yannick Clément","site":"shroudstory"},{"title":"Thermo-Stenciling the Shroud of Turin?","post":"“Even the most early artistic depictions we have of the crucifixion (made in the 4th or 5th century) always put the nails in the palms of the hands”\nBut am I not correct in thinking that every biblical reference to the crucified Christ refers to his hands bearing the evidence of his ordeal, rather than wrists?  \nIn fact,it  was not until the Sunday Times ran a big feature on the Shroud back in the 70s (as I recall) that I had met the idea that wrists rather than palms would have had to be used for nails. The reasoning seemed sound at the time, but have others apart from me not found themselves questioning this new bit of scientific orthodoxy – one that makes the Shroud appear genuine but at the expense of the Bible? \nSure, slender nails would not support a man’s weight if driven through the palms. But maybe they were thick spikes with a large area of metal in contact with flesh, with less pressure per unit area, less tendency for tearing. And am I not right in thinking that the feet were nailed to wedges, rather than the cross itself, which offer at least some support for body weight (if you recall your vectors in physics). Indeed, I seem to recall references to a particularly nasty detail of crucifixion – that it quite deliberately exposed the victim to slow suffocation through difficulty in inflating the lungs – forcing him to constantly “push-and-pull himself” upwards using nailed feet and hands respectively. (That was why the ordeal ended with breaking the legs – to prevent the pushing up that was preventing rapid suffocation and death, prolonging the ordeal).Trauma aside, “pushing up” would have been difficult, perhaps impossible,unless the feet had not been well supported and secured through provision of a wedge as well as nails.\nIn other words, I think the palms may well have been the standard site for Roman crucifixion, and that while the wrist location on the Shroud is an interesting feature, it does not really have much to offer re the claim that it was Christ’s burial shroud. And I need hardly remind you or anyone else for that matter that the latter too differs markedly from the biblical account, which indicated a wind-around cloth, with a separate cover for the face etc., that bodies were usually washed before burial etc that would remove blood, oily sweat etc etc. There is to my mind something terribly contrived about the Shroud of Turin – it is simply “too good to be true”, but that’s mere gut-feeling I grant you. the main interest for this retired science bod is in knowing how the image was created.\nApologies if this newbie is covering ground endlessly debating here and elsewhere…\n\n","date":"January 4, 2012 at 5:17 am","url":"https://shroudstory.com/2012/01/02/thermo-stenciling-the-shroud-of-turin/","cat":"image_theory","id":"comment-6531","author":"sciencebod","site":"shroudstory"},{"title":"Thermo-Stenciling the Shroud of Turin?","post":"Sciencebod, there is no reference to the nails thru the palms in scriptures. There was a term, a specific word used; (It escapes me now), but the term could mean the (hands, wrists or lower forearms). So it is not so clear of the exact point of entry. But in saying that I think people have used this “depiction of early art” mistakingly in Shroud science to prove it’s worth. Although the depiction on the Shroud does show an anatomically correct EXIT point of the nail wounds, it does not eliminate the entry in the palms or the depiction of such in early psintings. As it is quite possible the nails were placed into the palms on an angle which would exit where we see so on the Shroud.(Zugibe). The entry of the nails into the palms would have undoubtably been brought down by word of mouth thru the ages as that is what was ‘seen’, as no one could see the backs of the wrists or the wound exits…So the depictions were not in error, quite the opposite they were correct in what was ‘seen’ by onlookers of the crucifixion. That does not take anything away from the undeniable anatomical truth shown on the Shroud of the exit wounds, but only strengthens it’s claim to authenticity.\nAs for the feet, it is in ‘my opinion’ while taking close observation of the feet/ankle/leg ‘angles’ seen on the Shroud and in taking into account the observance that the body is in extreme rigor: The feet could not have been placed flat on the verticle beam of the cross! Therefore it is most likely that a footrest of sorts is evident. This would also make sense in that the victim would have something to push against when raising himself to breath, otherwise the force of such raising would undoubtably be very difficult without!…Again the Shroud details shine in it’s authenticity.\nYour last paragraph is full of misconceptions; The Shroud most definitely does not go against biblical scriptures accounts when it comes to the what you state; for one the scriptures do not mention a “wound around cloth”, it states a linen was ‘BOUND’ or to bind, not neccessarily wound around. The separate cloth over the face has been delt with many times and is simple to grasp; The head was originally covered by a Sudarium, this Sudarium was removed in the tomb, then the complete body was bound in the Shroud as depicted by the image on the Shroud…You must read up on the Sudarium of Oviedo and read the scriptures more closely as John does state; :”the cloth that HAD BEEN about his head”…As for the washing; it would have been against Jewish custom to wash the body of a ‘victim of violence’ or of a ‘criminal’, as stated in the burial laws of the Jews.\nSomeone once stated to Barrie Schwortz; “But the Shroud is too perfect to be true”, Barrie responded; “If it was anyless perfect would you accept it?” the person responded with a resounding “No”… ;-)\nR\n\n","date":"January 7, 2012 at 1:49 pm","url":"https://shroudstory.com/2012/01/02/thermo-stenciling-the-shroud-of-turin/","cat":"image_theory","id":"comment-6649","author":"Ron","site":"shroudstory"}]
