[{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"TO ALL : you can now read my “paper” : ” Roger’s Maillard reaction hypothesis explained in detail by Rogers himself” (top right of this page). Thank you Dan.\nFor those interested, I will answer to Colin directly on his blog.\n\n","date":"August 12, 2012 at 4:30 pm","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14838","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"I appreciate that Thibault’s posting is a response to counter CB’s assertions, and he’s made it clear enough, to this non-chemist anyway.  However it is one matter to colour pieces of cloth by various types of Maillard reactions under various conditions.  It is another matter entirely to produce a coherent image, well-defined, of high resolution, with 3D encoding, and that matches a credible geometrical projection of an object, by such means.  Perhaps I need to do more seaching, but to date I have yet to be apprised of any experiments that have produced any convincing images by a purely chemical Maillard reaction, that is not one of CB’s notorious scorches, \nThe only persuasive set of images I have seen so far are those produced by Giovanna de Liso in her 12 years of experimenting and modelling in relation to seismic activity near Piedmont.  They seem to satisfy most of the requirements of the Shroud image.  Her paper “Shroud-like image formation during seismic activity”; Giovanna de Liso; ENEA Frascati Conference May 2010″, can be found at: http://www.acheiropoietos.info/proceedings/DeLisoWeb.pdf\nI have yet to see any peer-reviewed or other competent scientific commentary on her paper, although it was casually cited in another recently published paper: “Piezonuclear neutrons from earthquakes as a hypothesis for the image formation and the radiocarbon dating of the Turin Shroud”; A. Carpinteri, G. Lacidogna, A. Manuello and O. Borla; within the last month or two. \nIs anyone able to point me towards any other set of images, wrought by a purely chemical Maillard reaction, that can compete with the de Liso images, for clarity, definition, and geometrical coherence?\n\n","date":"August 12, 2012 at 6:31 pm","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14847","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Hi Dave !\nI just post a reply to your comment of the other day that include a mention of DeLiso’s paper.  I hope you’ll take time to read this comment of mine that you can find here : https://shroudofturin.wordpress.com/2012/08/09/off-topic-is-consciousness-fundamental/#comment-14841\nAmong other very interesting topics, you’ll see a section (point #3) where I talk about this particular image formation hypothesis and where I describe some potential problems related to it versus the real nature of the body image on the Shroud.\nHope to hear your reaction versus this particular section of my comment and all the rest too !!!\n\n","date":"August 12, 2012 at 8:14 pm","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14852","author":"Yannick Clément","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"This does not answer my question: “Is anyone able to point me towards any other set of images, wrought by a purely chemical Maillard reaction, that can compete with the de Liso images, for clarity, definition, and geometrical coherence?”\nWhen I see some credible competing images that comply with the Shroud image properties as well as de Liso’s, then that may be the time when I can show some interest in chromophores, Maillard, cleansing rituals or other speculative process that might have caused the Shroud image.\n\n","date":"August 12, 2012 at 10:02 pm","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14858","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"This is one thing to create a good quality of image on linen; this is another to produce an image with the very same physical and chemical characteristics than the image on the Shroud…  The study made by DeLiso was totally incomplete and couldn’t show if the properties of his image can be considered as a close match with the Shroud’s image.  Remember all the objections that comes from Rogers about these kind of images…  And remember also that if the chromophore of the image is really what Rogers proposed, this particular hypothesis would most probably be off-track versus the reality of the Shroud’s image, simply because these kind of images cannot normally and in all logic be restricted to a thin layer of impurities without affecting at all the primary cell wall of the fiber located under the impurities…\n\n","date":"August 12, 2012 at 10:16 pm","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14862","author":"Yannick Clément","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Why all these papers, containing much that is theoretical? A thorough examination of the relic is needed and at the rate things are going it is very unlikely that a tough Bavarian intellectual like Benedict XVI will allow that. Did anyone listen to his message to Shroudies, read out by Bishop Kevin Vann of Forth Worth, Texas at the last Dallas Conference?\n\n","date":"August 12, 2012 at 6:32 pm","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14848","author":"Louis","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Too bad Ray wasn’t alive to address Berry directly in the present.\n\n","date":"August 12, 2012 at 9:58 pm","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14857","author":"Andy Weiss","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"I agree totally with you, except for one thing :  I’m not so sure Rogers would have lost 2 minutes of his precious time talking with someone like Colin Berry… ;-)\n\n","date":"August 12, 2012 at 10:11 pm","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14861","author":"Yannick Clément","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"\nYannick Clément :This is one thing to create a good quality of image on linen; this is another to produce an image with the very same physical and chemical characteristics than the image on the Shroud… The study made by DeLiso was totally incomplete and couldn’t show if the properties of his image can be considered as a close match with the Shroud’s image. Remember all the objections that comes from Rogers about these kind of images… And remember also that if the chromophore of the image is really what Rogers proposed, this particular hypothesis would most probably be off-track versus the reality of the Shroud’s image, simply because these kind of images cannot normally and in all logic be restricted to a thin layer of impurities without affecting at all the primary cell wall of the fiber located under the impurities…\nThen where can we find better images than de Liso’s???!!  I’m still waiting!! I don’t think you can tell me of any!!\n\n","date":"August 12, 2012 at 11:29 pm","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14865","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Here’s a reflection about that (this was also included in my long comment) :  When someone (DeLiso or another) will be able, with his hypothesis of image formation or another involving an electric discharge (like Fanti’s corona discharge), to produce an image of a wig (made of human hair) that would be similar to the Shroud, I will start to consider this hypothesis as credible versus the Shroud.  Did you noticed that almost all the images of DeLiso are made from metallic objects ???  We’re far from a biological thing !!!\n\n","date":"August 13, 2012 at 8:31 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14884","author":"Yannick Clément","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Arch-miraculists, arch-atheists and arch-sceptics just keep falsifying Science and Archaeology. Good old experimental Archaeology (the Sindon Man’s specific burial reconstruction) is the surest way to “the real thing”.\n\n","date":"August 13, 2012 at 8:55 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14885","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"I very much doubt Daveb WNZ or any other arch-miraculists would ever financially contibute to make a full body silicone medical mannequin realistic replica of the Sindon Man with water chamber (to be filled with heated water to simulate body and body hyperthermia temperatures) and fully jointed neck, shoulders, elbows, wrists, knees, and ankles (to provide a deathlike range of similar rigor mortis positions) + 3-4 sets of ad hoc linen cloths (both medieval and late antique replicas) so that the Sindon’s Man specific burial could be reconstructed. \nThey just would FEAR they could be proved totally wrong as arch-miraculists while still claiming they are good will people in quest of the scientific and archaeological truth….\n\n","date":"August 13, 2012 at 9:06 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14887","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Good point, Yannick!\n\n","date":"August 13, 2012 at 9:19 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14889","author":"Gabriel","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Message to Max and Gabriel :  We must compare apples and apples !!!  I agree with Max that the best research avenue concerning the body image formation is to do a replica of a real burial shroud (made with ancient method describe by Pliny the Elder) and to submit it to many different biological or chemical products that could be put on a dummy.  These kind of realistic experiments have almost never been done so far.  But there’s some interesting news concerning a realistic experiment a bit like this, which was done for an upcoming BBC documentary about the Shroud.  Barrie Schwortz told me some things about that recently and it will be very interesting, you’ll see !  It concern mainly the hypothesis of Ray Rogers versus the image chromophore (related to the probable ancient way to make linen cloths) and the Maillard reaction…\n\n","date":"August 13, 2012 at 10:44 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14894","author":"Yannick Clément","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"There was an image of a snake in de Liso’s paper.  [Snakes are known to be non-metallic.  But I don’t think it had MPH stamped on it.]  Still no word from Y on any alternative images.  Never mind, I’ll go search for myself.\n\n","date":"August 13, 2012 at 4:55 pm","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14908","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"To DWNZ, is ill-rancor one of your best Christian virtues?\n\n","date":"August 14, 2012 at 6:29 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14925","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"In the Bible, the Brass Snake is a symbol of Salvation and…Yeshua (“Salvation” in Hebrew)…. I really do think DWNZ is a just another pseudo Bible scholar.\n\n","date":"August 14, 2012 at 6:34 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14926","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Again, it should be noted that the gist of the argument offered by Colin Berry is this one:\n“However, one can always fall back on first principles, and write the  Rogers reaction as follows:\nPutrefaction amines (gases)  +  reducing sugars from starch etc (solid)  —->   Maillard reaction products (solid)\nStraightaway one sees that the entropy change is in principle unfavourable, since it involves a disordered gas reacting to form a more ordered solid.”\nThis seems to be wrong, as far as I can see, because there will be small  gaseous products that should appear on the right side of this reaction scheme.\n\n","date":"August 13, 2012 at 2:50 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14867","author":"Jos Verhulst","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Thibault: In the first place, thank you for putting all this together in your paper. In my view, after reading it I think that further research regarding Rogers hypothesis is definitively needed. Some of the difficulties we have been discussing here can also be found in your paper, now expressed in his own words.\nOn the one hand, Rogers proposes a mechanism for image formation based on concentration gradients of amines due to diffusion. I have some difficulties with this but I also admit, that perhaps after all it could be possible. After all when he says that  Concentration gradients are also formed by depletion of reactant(s) as a result of chemical reactions. When reactants hit the cloth and react, they are not free to diffuse parallel to the cloth. They produce products only where they hit the cloth. The adjoining areas must be hit by other columns of reactants to produce a color. Remember, diffusion from a surface occurs as a front not as a growing hemispherical volume. You can have collimation normal to the emitting surface these columnns seem to me very close to a laminar flow model.\nHowever, if we admit diffusion as the major mechanism, we cannot admit that The image of the hair was probably largely a result of ammonia from the lungs as we read in page 13 and as a result,  Increased concentrations result in increased reaction rates. Did you ever wonder why the hair showed so much color? (page 7).\nThis would imply that while in the rest of the body, as amines are produced, a gradient appears and a reaction takes place, in the area of the face, amines first move from the lungs through mouth and nose and then react. That model implies a different behaviour for the area of the face (two steps: motion to the hair first followed by diffusion and subsequent reaction) and the rest of the body (only reaction due to diffusion).\nIf that were the case, it could be expected that the trail of preferential paths of those amines throughout the face could be detected. It is understood that the mechanism for this initial motion is gravity (we have heavy amines) so apart from those paths I would also expect a gradient between the different areas of the hair, since it is widely admitted that the head was not lying horizontally.\nFinally, I would also say that all the time Rogers assumes a maximum period of 36 hours for his reactions and he ignores how all these chemical reactions evolved after that.\nHowever, as a whole, I would say that Rogers hypothesis is in a good position in the ranking of explanations for the image fomation mechanism. Nevertheless, further research is needed to address some difficulties.\n\n","date":"August 13, 2012 at 6:58 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14879","author":"Gabriel","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Did I miss something here ?  What is the paper you mention Gabriel ???  Where can I read this paper ?  Is it the one I talked about recently that was written by Thibault in 2007 (I think) ???  Give me more info about that please !\n\n","date":"August 13, 2012 at 10:49 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14895","author":"Yannick Clément","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Yannick, please read the first comment of this post by Thibault\n\n","date":"August 13, 2012 at 12:30 pm","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14897","author":"Gabriel","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Thanks !  I’ll read this with great interest…\n\n","date":"August 13, 2012 at 1:24 pm","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14899","author":"Yannick Clément","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Gabriel:  “reactants moving in a front, … collimation normal to the emitting surface”.  How do you propose the disposition of the cloth (draped or wrapped?) to produce the geometric figure of the image that we have, with little apparent lateral distension of the figure?\n\n","date":"August 13, 2012 at 5:06 pm","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14909","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Daveb, honestly I don’t know and I also have difficulties with that quote by ROGERS regarding the diffusion mechanism\n\n","date":"August 13, 2012 at 7:16 pm","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14913","author":"Gabriel","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"To me, the geometry of the image creates a major objection to any kind of gaseous diffusion process.  A: If the body was wrapped, then both the dorsal and frontal images would be distorted width-wise, the rate of distortion increasing from the central axis.  That is not what we see.  B: If the cloth was merely draped over the body, then the diffusion paths need to be distorted to produce the near orthogonal image, the gases would probably escape, we would see attenuation of the image towards the centre. C: I conclude that a diffusion process cannot satisfactorily explain the image.\n\n","date":"August 13, 2012 at 8:22 pm","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14916","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Correction: B: …. we would see attentuation of the image towards the EDGES ..\n\n","date":"August 13, 2012 at 8:25 pm","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14917","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"If the body was wrapped, then the image on the cloth would show the unwrapped development of a more-or-less cylindrical surface.  If the edges of the body were packed with herbs and spices so that the cloth was more or less flat on aginst the frontal and dorsal aspects, then there would still be distortion of either the image or the diffusion paths, or both.  I can’t see how diffusion can be a satisfactory explanation.\n\n","date":"August 13, 2012 at 8:42 pm","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14918","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Daveb, that sounds reasonable\n\n","date":"August 14, 2012 at 6:13 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14923","author":"Gabriel","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"This is to totally ignore the mechanical return force of the woven 3/1 herringbone reversing twill of the long linen burial cloth when the latter is in-soaked with alkaline waters, taut lenghtwise, and tighly wrapped around (see the Gospel Greek terminology) a corpse of which  rigor mortis is counteracted  \nActually the very stiff rigid body thus tighly wrapped up when subjected to a drying-up ritual.acts as a collimator as the receiving surface (the cloth) gradually seperate from the source object (the corpse).\n\n","date":"August 14, 2012 at 6:56 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14927","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Correction: and tightly wrapped widthwise around a corpse of which rigor mortis is counteracted\n\n","date":"August 14, 2012 at 7:05 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14928","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Mistyping: tightly\n\n","date":"August 14, 2012 at 7:09 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14929","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Creo que llamar temperatura ambiente ( room temperature) a la temperatura de 37C es un EXCESO.\nEn Wikipedia en español se lee para “Temperatura ambiente”:\n“Para cálculos científicos, la temperatura ambiente es usualmente tomada como 25 grados Celsius (293 o 298 Kelvin, 68 o 77 grados Fahrenheit).Por conveniencia numérica, 300.00 K (26.85 °C, 80.33 °F) es utilizado ocasionalmente, sin ser especificada como “temperatura ambiente”. Sin embargo, la temperatura ambiente no es un término científico uniformemente definido, a diferencia de la Temperatura y Presión Estándar, o TPE, que tiene definiciones ligeramente diferentes.\nLa temperatura media anual en Jerusalén es de 16 C, la media del mes de Enero es en torno a los 10 C y en Agosto en torno a 27 C.\nLas casas-cueva, arquitectura “troglodítica”, en España mantienen temperaturas entre 17-23 C ( son muy famosas entre otras las cuevas del Sacromonte en Granada, España).\nEn pleno desierto de Tabernas, Almería, España, la Casa-cueva Calatrava, mantiene la temperatura en torno a los 20 C.\nParece que la cueva en que fue sepultado Jesús no debiera tener temperatura ambiente por encima de estas cifras…….\nCarlos Otal\n\n","date":"August 13, 2012 at 8:57 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14886","author":"corneliotel","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"The fact is this Carlos :  Science will NEVER be able to know the exact conditions that were present inside the tomb and inside the Shroud at the time of the image formation process.  All we have is probabilities (and not so high after all).  The fact is this :  It is not impossible to think that some very particular (and rare) natural conditions could have been present at the moment of the image formation process (whatever it could be).  There are a very wide range of possible things that could have happened and that we’ll probably never know for sure or with good precision.  The incomplete burial rite done on friday could also have been part of the “special” conditions inside the tomb and/or the Shroud.  For the moment, we can’t say for sure and that mean we must stay open-minded for the possibility of some very particular and rare natural conditions that could have favored the natural formation of the image on the cloth.\n\n","date":"August 13, 2012 at 4:40 pm","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14907","author":"Yannick Clément","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"What’s  the use to taking into account the 1st c. CE Jerusalem cave-tomb temperature early in Spring if the Sindon Man’s specific burial rite is not as accurately reconstructed as possible (Purifying ritual implying the use of a fumigation? Body still in hyperthermia?).\n\n","date":"August 13, 2012 at 9:19 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14888","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Ray Rogers totally overlooked the last two possible archaeological parameters\n\n","date":"August 13, 2012 at 3:02 pm","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14902","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Mistyyping: “What’s the use of taking into account”\n\n","date":"August 13, 2012 at 9:24 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14890","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Concerning the Maillard reaction of Rogers, I need to say one important thing :  The cornerstone of all his hypothesis is really the chromophore of the image he proposed (namely the thin layer of carbohydrate impurities).  That’s why the actual Shroud science should do testings to verify (and possibly confirm) this hypothesis of Rogers because if he was correct about that, then, the probability that the Maillard reaction was at least part of the image formation procees would be VERY HIGH, no matter what Carlos and Colin Berry think.  Effectively, if the chromophore is really a thin layer of impurities on-top of the fibers, then we have to assume that there was not gaseous emission at all inside the Shroud during the possible 36 hours the corpse was present there !!!  Remember what Roger said in his book :  If carbohydrate impurities and amines come into contact with each other, THERE WILL BE A MAILLARD REACTION !  And Rogers emphasize this by saying :  This is not an hypothesis, this is a FACT !!!  So, I really think the priority of Shroud science should be to verify this hypothesis of Rogers in deep.  And this can be done (at least partially) while we wait for another series of direct testings on the relic !  Many very interesting lab experiments (possibly backed-up by some computer analyses) could be done right now to verify scientifically the hypothesis of Rogers concerning the chromophore of the image on the Shroud (that is linked with the probable ancient way of making linen cloths, including the most important part called the retting of the flax plant) and I wonder why these kind of important experiment (as long as the nature of the image is concerned) has not been done so far !!!  I think it’s probably because most of the Shroud researchers are way too much focussed only on the question of the image formation process.  I know it seem redudant to hear me constantly say this but I will keep on because I really think this reflection of mine is very important and should be heard by some scientists interested to learn the truth about the real nature of the image on the cloth !!!\n\n","date":"August 13, 2012 at 3:49 pm","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14906","author":"Yannick Clément","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"As I already noted elsewhere, the Maillard hypothesis implies that the image came into existence accidently. It could have been produced as well in some other grave, if only the required physical and chemical conditions by chance were present. There is no special reason why an image thus produced should have formed on the very shroud that envelopped the body of Christ. Neither is there any special reason why the image should be so complete, front & back, although the physico-chemical conditions would have been somewhat different at both sides of the body. There is no second example of such an image; not even an image of one single hand or finger is known. Nevertheless, we are supposed to accept that the only one image that came into existence in this natural and accidental way happens to be both a *complete* body image that concerns, moreover, not  some random person, but  Christ himself. All this is extremely unlikely. A rational explanation should also explain why this unique image is connected with Christ, and why this image is so ‘well done’ (ie why it is so complete).\n\n","date":"August 14, 2012 at 5:16 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14921","author":"Jos Verhulst","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Well said Jos! A very important point that many seem to forget in all their chemical ramblings ;-)\n\n","date":"August 14, 2012 at 6:05 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14922","author":"Ron","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"\nMax Patrick Hamon :I very much doubt Daveb WNZ or any other arch-miraculists would ever financially contibute to make a full body silicone medical mannequin realistic replica of the Sindon Man with water chamber (to be filled with heated water to simulate body and body hyperthermia temperatures) and fully jointed neck, shoulders, elbows, wrists, knees, and ankles (to provide a deathlike range of similar rigor mortis positions) + 3-4 sets of ad hoc linen cloths (both medieval and late antique replicas) so that the Sindon’s Man specific burial could be reconstructed.\nThey just would FEAR they could be proved totally wrong as arch-miraculists while still claiming they are good will people in quest of the scientific and archaeological truth….\nI AM NOT AN ARCH-MIRACULIST!!! I FEAR NOUGHT!!  MPH may believe that the weed may enhance his perceptive powers,but it shows up in his arrogant, obsessive, contemptous behaviour.  He should seek help while he still can.\n\n","date":"August 13, 2012 at 5:11 pm","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14910","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Help yourself!\n\n","date":"August 14, 2012 at 7:13 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14930","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Most obviously you don’t need weed to enhance your ad hominen attack power…\n\n","date":"August 14, 2012 at 10:30 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14942","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Mistyping: ad hominem\n\n","date":"August 14, 2012 at 10:32 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14943","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Ad hominem? Who accuses me of being an arch-miraculist? Who accuses me of fear?  Who fails to respond to the valid geometrical objections I have raised?  MPH!!!\n\n","date":"August 14, 2012 at 4:53 pm","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14959","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"\nMax Patrick Hamon :Arch-miraculists, arch-atheists and arch-sceptics just keep falsifying Science and Archaeology. Good old experimental Archaeology (the Sindon Man’s specific burial reconstruction) is the surest way to “the real thing”.\nI may be mistaken here but how is this archaeology? We don’t have a tomb or bones or anything to study but a Shroud with an image. We are dealing with Jewish burial rights/laws written atleast centuries after the fact, so we are NOT 100% sure they pertain exactly too the actual laws followed in 1st century Judea. Also for the most part still ‘questionable’ translations of scriptures and more precisely stated the translation of specific words. All we have to work with here actually, is the image and the cloth it is on, which comes down to strictly physics, chemistry and other sciences, if you really think about it.\nR\n\n","date":"August 13, 2012 at 7:32 pm","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14915","author":"Ron","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Sorry I should have added, I understand your point Max about experimental burial reconstruction, although I think it would be ‘almost ‘ fruitless, as we know very little about the conditions and there are countless variables to deal with, as you are very much aware….I also hope you agree with my statement on Jewish burial customs and our actual lack of precise knowledge of them in 1st century palestine.\nR\n\n","date":"August 14, 2012 at 6:14 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14924","author":"Ron","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Ron, \nIn the most likely hypothesis the Sindon is Yeshua’s burial cloth, the more I studied and did research on the latter, the more I just could not help thinking the Sindon’s Man specific burial rite is most likely THE VERY KEY to the image formation process. \n“This unknown” must be explored through state of the art experimental archaeology (if this word has a meaning to you) before any other avenue lest “Shroud Science and Archaeology” get off track from the start (actually it already had hence the present research dead-end).\n\n","date":"August 14, 2012 at 7:39 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14931","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Ron, how can you really be so sure that the exploration of 3-4 possible archaeological scenarios (fumigation of a tightly wrapped up corpse; corpse in hyperthermia; corpse fumigation associated with hyperthermia) through state of the art experimental archaeology is doomed to be ‘almost’ fruitless? Actually, the ritualistic approach is the only one left totally unexplored so far.\n\n","date":"August 14, 2012 at 9:23 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14938","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Here, I would like to say “thank you” to Thibault Heimburger for giving us, the general public, the opportunity to read these private messages written by Ray Rogers on the SSG !  Your paper Thibault is a great gift for someone like me !  Thanks again !\nI’ve already read more than half of the document and I’ve already found a GREAT QUOTE from Rogers in page 10 that PROVE without any serious doubt that he knew about the less stable nature of the primary cell wall (versus the inner part of the fiber that is more stable and hard to colored) and, nevertheless, he NEVER thought of this part of the fiber as being the real chromophore of the image !!!\nHere’s the quote (let’s never forget it because it speaks real loud !!!) :  “For the ones that like to defend the Shroud image as a « byproduct » of the resurrection, the only thing needed is a kind of energy emanating from the body and able to induced rearrangement of the sugar molecules in the same way that heat does but without affecting the cellulose of the linen at the same time.  Does anyone have suggestions of a kind of energy (not infrared, apparently) that could produce a CARAMELIZATION (note : This process mentioned by Rogers refers here to a coloration of a thin layer of impurities) WITHOUT ANY EFFECT ON THE POLYSACCHARIDE STRUCTURE OF FLAX FIBER.”\nHere, not only did we have a great objection from Rogers against any kind of energetic radiation (UV light, corona discharge, protons, neutrons, near-infrared, electromagnetic or electrostatic discharges, etc.), but we also have an incredible piece of evidence that he was well aware of the whole polysaccharide structure of the linen fiber, including necessarily the primary cell wall, since it is this part of the fiber that gets the most polysaccharides elements (hemicelluloses, pectines, etc.) that are less stable (in other words, that can be chemically colored more easily) than cellulose.  No way Rogers was only talking about cellulose here !!!  This particular quote from Rogers proves without any serious doubt that he never thought that the primary cell wall could offer a good solution for the chromophore of the body image.  On the contrary, for Rogers, if any colored sample that is claimed to be “similar” to the image on the Shroud (like the samples obtained by Di Lazzaro with UV lasers or the samples obtained by Rinaudo with protons or the samples obtained by DeLiso with electromagnetic discharges) present any kind of defect on the linen fiber itself (even if it would be just minor defects in the primary cell wall), this result SHOULD BE CONSIDERED AS INCONSISTENT WITH THE IMAGE ON THE SHROUD !!! PERIOD !!!\nI hope anyone understand perfectly Rogers point of view now !!!  That’s why I ask sindonology to verify more deeply Rogers hypothesis for the image chromophore, because if it could be confirmed without any serious doubt, that would mean all these supernatural hypotheses involving any kind of energetic radiation WOULD HAVE TO BE SET ASIDE…  In the very same way than any artistic hypothesis (scorch, robbing, painting, medieval photograph, etc.) have been set aside by science long ago !!!  \nThis would be the case for all these supernatural hypotheses, unless some people would just wanted to seek their own truth instead of the real scientific truth regarding the image on the Shroud.  I know we’re not there yet, but I really feel we’re pretty close… no matter what many Shroud scientists can say in order to disprove Rogers science.  All we need now is a confirmation of the image chromophore hypothesis of Rogers and Shroud science would make a HUGE STEP forward in his quest for truth about the Shroud and his image.  That’s what I truly believe.\nSome months ago, I wrote on this blog that I wasn’t 100% sure if it is only the thin layer of impurities proposed by Rogers that have been colored on the surface of the Shroud or if it is possible that, at least in some places, the primary cell wall too could have been colored.  Last night, I received the answer from Rogers himself and his response is “NO WAY” !!!  It’s now clear that, in Rogers mind, the coloration only affected a thin layer of impurities and nothing else and that a result like that CANNOT be obtain with the use of any known form of energetic radiation, because they would ALSO produced easily discernible defects in the primary cell wall of the fiber…  And the fact is this :  Such defect simply don’t exist on the Shroud and the proof of this come especially from the observations made concerning the ghosts of coloration and the use of diimide that has left a COLORLESS, UNDAMAGED CELLULOSE FIBERS BEHIND, in both cases (showing that the color has not affected at all the linen fiber, including the primary cell wall). \nAll these things really seem to point toward the fact that Rogers was right concerning the chromophore.  All we need is a scientific and independent confirmation of this…  And if this could be done one day (the “if” is important here), then I truly think that there would not be much room for anything else than natural hypotheses of image formation (whether it be the Maillard reaction proposed by Rogers and/or another process), probably chemical in nature coming from the corpse itself and/or from some products that were on the corpse while he was enveloped in the Shroud. \nI think this is a very good time to use another time the great quote from Francisco Alconchel-Pecino : “Probably the controversy arose because, once more, HUMAN INNOCENCE WAS SURPRISED BY THE SUBTELTIES OF MOTHER NATURE.”  Meditate on that my friends !!!\nImportant note to all of you who wants the image on the Shroud to be a by-product of the Resurrection or a pure miraculous act of God :  If all I said in the comment is true (again, the “if” is important here), that wouldn’t mean at all that the Shroud is not the genuine Shroud of Jesus or that he never resurrected !  That would just mean the image on it is another masterpiece of Mother Nature (one more !), which is itself a pure masterpiece of God !!! But while I say that, I’m fully aware of the fact that the interest in the Shroud would dramatically dropped if what I said above if true (and could be scientifically proven one day).  Yes, it’s a sad fact that a lot of people are only interested in the supposed “marvellous” aspect of the body image and nothing else.  That remind me of the crowds who were following Jesus in the Gospel not because of who he was, but simply because they were looking for some mighty deeds from him !!!  It’s a shame that the attention concerning the Shroud is almost only focussed on the “mysterious” aspect of the body image (and this attention would surely dropped dramatically if it would be proved that it was formed by Mother Nature), instead of a seeking of the profound message of redemption, forgiveness and love contain IN this image (no matter if this image was effectively formed by Mother Nature)…  That’s part of human nature and nobody will change that.  It was the same thing 2000 years ago and it will probably be the same thing 2000 years from now.\n\n","date":"August 14, 2012 at 8:27 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14936","author":"Yannick Clément","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"\nMax Patrick Hamon :Ron, how can you really be so sure that the exploration of 3-4 possible archaeological scenarios (fumigation of a tightly wrapped up corpse; corpse in hyperthermia; corpse fumigation associated with hyperthermia) through state of the art experimental archaeology is doomed to be ‘almost’ fruitless? Actually, the ritualistic approach is the only one left totally unexplored so far.\nMax maybe my choice of the words “almost fruitless” was a little pessimistic. But if you’ve studied as you say you have, then you are quite aware that the variables are seriously daunting. 3 or 4 possible scenarios? …I don’t know Max….We just don’t know what exactly occurred or what or what not was actually accomplished at the burial. This leaves us starting an ‘almost’ completely blank page. We could start from a point of assumptions and hope it brings us in the right direction, but even then; If we manage to replicate the image in all it’s glory, could science actually say; “That is the way it happened”…I’m not too sure about that.\nR\n\n","date":"August 14, 2012 at 10:29 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14941","author":"Ron","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Ron, Although as professional archaeocryptologist I may have my own idea about the most likely scenario to account for the Sindon Image formation process, I have to check the 3-4 main archaeological scenarios as far as the ritualistic approach is concerned. Actually the Gospel Greek terminology, the Hebrew time markers, Archaeoastronomy,  Archaeobotany, Archaeological Palynology, Ancient Textiles, Archaeological Blood  Pattern Analysis, Image Analysis, Paleopathology, Thanatology, Second Temple period Archaeology and History, Rabbinic literature, the Bible etc can really help to reconstruct in its very details the Shroud Man’s burial rite.\n\n","date":"August 14, 2012 at 11:12 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14946","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Mistyping: although as an  archaeocryptologist\n\n","date":"August 14, 2012 at 11:14 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14947","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"More theoretical speculations from the Arch-Arcanist!  Geometry of the image fails to support any kind of chemical process in a tightly wrapped corpse! Or loosely wrapped corpse! With or without herbs and spices! Wet or dry!\n\n","date":"August 14, 2012 at 5:02 pm","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14960","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Because of Davelish WNZ’s stubborn ignorarrogance (and stupid harbouring of an ill-rancour against me), shall I repeat: \nIn the most likely hypothesis the Sindon is Yeshua’s, the use of both theoretical and state of the art experimental archaeology to reconstruct the burial rite and solve the archaeological enigma is the RIGHT/BEST PATH to follow when it comes to the Sindon Image formation  process?\nHow long will DWZN deliberately ignores (out of his ill-rancour and stubborn ignorarrogance) the mechanic return force of a linen fabric soaked with warm alkaline waters (spring waters mixed with ashes of the Red heifer or rainwater collected in water reservoir hewn out in malky rock stone) as possible archaeological parameters to be taken into account within the Sindon Man ritual burial’s reconstruction?\nHow long will he ignore (still out of his ill-rancour and stubborn ignorarrogance ) the possibility for such  a long in-soaked inner linen burial cloth to have been first taut lengthwise and then tightly wrapped up width wise around a corpse (to counteract its rigor mortis)? Such a specific wrapping of the corpse might well accoutn for the inner long cloth while shrinking to sort of get taut again during a purifying and drying-up ritual (myrrhic aloetic fumigation of the corpse resting in extra height on two stones, first on its left and then right side). \nCan he refer us to any previous archaeological attempt to SERIOULY reconstruct the Sindon Man’s burial and proving beyond the shadow of a doubt my theory cannot experimentally work ? I suspect we shall have AGAIN to wait on and on and for ages to get such a link!\nCan DWNZ really read me when my theory is the Sindon Image is a cryptovolumetric bloody body 2D CONTACT-AND-GRADUAL-LOSS-OF-CONTACT IMAGE  resulting from a collimated mordanting of a thin carbohydrate layer of impurities? I very much doubt so!\n\n","date":"August 15, 2012 at 6:29 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14977","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Mistyping: the Sindon Image is a cryptovolumetric bloody body-cloth CONTACT-AND-GRADUAL-LOSS-OF-CONTACT 2D IMAGE resulting from a collimated mordanting of a thin carbohydrate layer of impurities\n\n","date":"August 15, 2012 at 6:45 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14979","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"DWZN (who most obviously is neither a Biblical nor a Gospel scholar) should better study the Gospel Greek terminology used to describe Yeshu’s burial before asserting Yeshua’s sindon and other burial linens were neither tightly nor loosely wrapped around his corpse.\n\n","date":"August 15, 2012 at 7:36 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14980","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"I can assure MPH and any others reading this, that any scepticism I have towards his proposal does not arise from any ill-rancour towards him.  Further, if there is any such ill-rancour which I may or may not harbour, he himself has given me ample cause to provoke, with his frequent put-downs of me and anyone else who may differ from his favourite hypotheses.  Perhaps I ought to have drawn on Christian grace, and merely turned the other cheek.  I might have practised such heroic virtue if I had put my mind to it.  \nI feel I have made it clear enough, that my reservations concerning chemical and other such similar processes, arise from considerations of projective geometry, as I endeavoured to elucidate in comments #23 to #28 above in dialogue with Gabriel.  As I understand from hypothesis of MPH (and he may correct me if I have it wrong), he is claiming (1) the 3:1 twill was stretched when tightly wrapped and wet; (2) the amount of stretch was exactly sufficient to compensate in every respect for the distortion I have mentioned; (3) the base process of forming the image occurred at sometime when the linen was in this taut state; (4) when the linen was eventually freed from the corpse, it returned to its original unstretched state (possibly from drying?).  Consequently this yielded an undistorted image which has the approximate form which we might expect from an ordinary orthogonal aspect such as a photograph.  \nIf this is his hypothesis, he is welcome to it.  My personal views are that this is a very long shot indeed.  The cloth would need to stretch by about 40%, very roughly something just less than (pi/2 – 1), although a better calculation could be made by considering a roughly elliptical body section.  The cloth would then need to shrink back from this ~40% distension close to its original shape.  Further, assuming a constant strain rate within the cloth, distortion would still be apparent because of the variable angle of incidence or contact. \nI can suggest a very simple pilot experiment MPH could try if he is so-minded.  It requires a deformable metal barrel of whatever size suits him, which he can form into the rough cross-section of the model of a human torso.  He can then paint different coloured stripes equally spaced around the barrel (He could use a mannequin if he wants).  He can then wet his cloth however he may, then endeavour to stretch it to the required 40%, and wrap it around the barrel while the paint is still wet.  Carefully remove the cloth, wait until it returns to its original shape, (assuming it’s not permanently stretched) and see what pattern gets imprinted on the cloth.  If he is correct in his hypothesis, then an orthogonal projection of the pattern on the barrel (say a photograph) should conform closely to the imprinted pattern on the cloth!  I rather hope for his sake that he might have some success with it if he does attempt it, but I rather fear that he may well be disappointed!  I also fear that he may discover some obscure objections to this somewhat simple experiment.\n\n","date":"August 15, 2012 at 7:42 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14981","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"One thing DWNZ should better have remembered before passing all his previous comments:\n« Don’t knock it until you’ve tried it ». \nMost obviously his last post shows he is not ready to financially contribute for a realistic medical replica of the Sindon Man and explore the enigma in the state of art of experimental archeaology. Nope.\n\n","date":"August 15, 2012 at 8:52 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14982","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"MPH has yet to make a sound financial case for his proposition, before anyone would consider contributing to it.  He might like to approach an interested corporate to fund his project, as there are those who would fund soundly based proposals, as a tax break.  But he needs to be advised that he will have to present his case much more convincingly than he has to date before he will be able to persuade such a sponsor.  The elementary experiment I have described above, (if surprisingly it turns out more successful than I expect), could be part of his presentation.  The downside is, that if his project fails, he stands to lose credibility.\n\n","date":"August 15, 2012 at 5:01 pm","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-15026","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Most obviously DWNZ is not the kind of person to take any risk to reach the scientific and archeaological truth when it comes to the Sindon Image. \nA  searcher worth his salt  doesn’t really mind about putting his credibility at stake; all that matters to him is reaching and sharing with open minded people the scientific and archeaological truth.\n“To do is hard, to judge is easy.”\n\n","date":"August 16, 2012 at 7:01 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-15053","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"As a footnote to my suggested experiment at #57, here is what I expect the results would be:\nA: Photograph of the barrel (or mannequin):  The equally-spaced stripes around the simulated torso will appear in the photograph to be more closely spaced at both outer edges due to a simple principle of projective geometry, which any Tech Drawing 101 student can understand.\nB: The imprint of the stripes on the cloth however will I expect show a different picture.  If by some freak of textile elasticity, it should happen to return to its original width, then it may be that the distance of the outermost stripes might match the lateral distance on the torso.  However I would expect that the spacing between the stripes will be very roughly uniform across the cloth, but with some minor variation due to random permanent non-elastic strains within the cloth,\nC:  The experiment could only claim to be a success, if on the cloth, the outermost stripes were more closely spaced than the inner-most stripes, corresponding to the apparent spacing of the stripes in the photograph.\nThe only way that there can be strict correspondence between the residual stripes on the cloth, and the picture of the stripes on the torso, is if the dorsal and frontal models of the torso are each contained in ideal flat planes; But no real body has such a configuration.\nI hope this makes it clear why I consider there are valid objections to any kinds of chemical or contact process as an explanation of the Shroud image.  All done with no rancour whatsoever!\n\n","date":"August 16, 2012 at 6:16 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-15047","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Bless you!\n\n","date":"August 16, 2012 at 7:03 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-15054","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Message to Daveb and Ron (in particular) and to all the other fans of the “energetic radiation” hypotheses of image formation :  I hope you have taken good note of the comment I put here yesterday and that received no reply : https://shroudofturin.wordpress.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/#comment-14936\nI truly hope that all the energetic fans out there will take very good note of this comment of mine because it contain one of the most important quote in all Rogers writings about the question of the chromophore linked with the question of the image formation process…  Don’t miss it !\n\n","date":"August 15, 2012 at 10:48 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-14990","author":"Yannick Clément","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"YC should read my comments at #23 to #28 in dialogue with Gabriel, and also my response to MPH at #57, so that he may be aware of my projective geometry reservations concerning a chemical process.  I also invite him to consider a suitable variation of the elementary experiment I have proposed to MPH in my last paragraph at #57.  He might like to try out something similar so that he may have a visual understanding of the problem.\n\n","date":"August 15, 2012 at 5:09 pm","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-15029","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"I have no problem with the fact that you favored some energetic hypotheses over the one of Rogers Dave.  I just hope that, at least, you stay open-minded about the possibility that the image on the Shroud was produced naturally.  If you read well the document prepared by Thibault, along all the other public writings of Rogers, I hope you can agree with me that there is nothing in the data from the Shroud right now that can be used to completely reject Rogers hypothesis.  That’s the reason why you should stay open-minded versus his hypothesis of the Maillard reaction in particular and also versus the possibility of a natural formation of the image  at a more general level (that can be related to Rogers hypothesis partially or not)…\n\n","date":"August 16, 2012 at 10:47 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-15066","author":"Yannick Clément","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"I want to react to the very interesting comment of Joe Verhulst that you can find at #38 upper in this page.  In his comment, Joe Verhulst concluded that it is extremely unlikely that the Shroud of Turin can be the one of Jesus if the body image on it was formed naturally.  I think Joe Verhulst forgot many basic facts in his reflection.  Here they are :\n1-            Jesus of Nazareth is an historical Jew who lived in the 1st century.  He was a real human being with a real body like anyone of us and right after his death, it is obvious that Jesus corpse was no different than any other crucified corpse.  In other words, his Incarnation didn’t stopped when he died on the cross !!!  In consequence, if the body image on the Shroud is the product of a natural process between a corpse and a linen cloth, I don’t see any good reason to doubt the possibility that it is his own dead body that have really take part in this natural process (probably chemical in nature).\n2-Despite the C14 dating result of 1988, there’s many good reason to think that the Shroud is much older than the medieval time and can well come from the 1st century.  In consequence, since the C14 result has been scientifically proven problematic because the dating was done on a non-representative sample from the Shroud and because there’s a vast amount of data from the Shroud that seem to indicate that this cloth is probably antique, I don’t see any good reason to doubt the possibility that the burial shroud that “received” the natural process of image formation at his surface can really be the shroud of Jesus, especially in the light of Ray Rogers hypothesis concerning the chromophore of the image, i.e. a thin layer of carbohydrates impurities found almost only on the top-most fibers of the cloth (on both sides) and that would have been caused by the ancient method of making linen cloths.  On this subject, remember that, so far, starch fractions and pectin deposits have already been found on the Shroud of Turin.\n3-Jesus was scourged, he was crowned with thorns, he carried his own cross beam and then, he died by crucifixion. Since the Shroud of Turin show a body image and bloodstains that are totally consistent with the Gospels accounts of what happen to Jesus prior to his death on the cross, I don’t see any good reason to doubt the possibility that the body image and the bloodstains that we see on the cloth were caused by the corpse of Jesus and not another.\n4-On the contrary to Joe Verhulst comment (and other similar comments we often see here or elsewhere), there are a few examples of cloths that bears at least a partial body image on them.  The Jospine mattress being the most known.  In his paper about the Shroud’s ancient history, Maurus Green reports some other examples of burial garments that showed some body images on them.  Because we can assume that these examples (especially concerning the mattress) are all natural occurring body images on cloth, I don’t see any good reason to doubt the possibility that the body image and the bloodstains that we see on the cloth were caused naturally by the corpse of Jesus.  And here’s an additional note about a very interesting similarity that exist between the Shroud and the mattress :  In both cases, the dead bodies who caused the images on the cloths had a high level of bilirubin in their blood prior to their death, which is a fact that can be important if these body images were made naturally.  The high level of bilirubin indicates that, in both case, the bodies of these persons were in a very bad physical state, which could have increased dramatically the production of certain biological substances in the body, in the blood, in the sweat and/or on the skin (like the urea level, the acid lactic level, etc., etc.).  It’s truly possible to think that this probable increase of toxic biological substances could have formed some very particular (and rare) conditions that hallowed a the formation of a body image on a cloth that was in close proximity with these corpse, shortly after death.  Here, I don’t pretend that both body images were necessarily caused by the very same exact chemical process (or processes), but I say that at least part of the image formation process could well be similar in both cases. And if I’m right about this aspect of the question of the body image, that might offer a good rational answer to the speculative remark made by Joe Verhulst that “there is no special reason why an image thus produced should have formed on the very shroud that envelopped the body of Christ.”  I say “speculative remark” for the simple and good reason that the Shroud of Turin is the ONLY archaeological remain of an authentic and complete burial shroud of someone who’ve been scourged and crucified (probably under Roman law).  In this context, who can say if the very bad state of the tortured body that was enveloped in the Shroud cannot be that “special reason” why a body image has formed on the cloth ?  If the very bad state of the body was really a factor in the image formation, then there will be effectively a “special reason” why the Shroud of Christ would bears the image of his tortured corpse…\n5-Jesus was buried in a clean linen shroud according to the Gospels, which his, historically, a very rare fact for a man who died of crucifixion.  Because of the historical fact that most crucified victims were not even put in a burial shroud after their death on the cross, I think it’s fair to estimate the probability that the Shroud is really Jesus burial cloth as excellent.\n6-The shroud of Jesus was found empty roughly 36 hours after his body was put in it, which is the ONLY historical account that reports such a finding.  In history, we have no other historical account that the burial shroud of a crucified man would have been found empty shortly after his death.  In that context, I think it’s fair to estimate the probability that the Shroud is really Jesus burial cloth as excellent.\n7-Concerning the idea that someone would have taken, kept and preserved with great care a burial shroud like that (full of bloodstains), this idea seems to be completely irrational (especially if the Shroud is antique, because we know that most people of that era, not only the Jews, were horrified to touch or kept such stained burial cloths) except for the case of Jesus-Christ, because of the context surrounding his Resurrection (i.e. the founding of the empty tomb and the empty shroud on Easter morning, the claim that Jesus was now living a different life that has conquered death, etc.).  I truly think that it’s only in the context of the Resurrection of Christ that we can understand why a stained burial shroud like that could have pass through the centuries and still be venerated today !!!\nBecause of all these FACTS that created a favorable context, I think the scientific PROBABILITY is PRETTY GOOD that :\n1-The Shroud of Turin is really the shroud of Jesus of Nazareth.\n2-The image on the Shroud is really the image of Jesus corpse after his death (and before his Resurrection).  Here, we must never forget the FACT that the image is that of a dead man !\n3-The image on the Shroud, just like it is for the blood and serum stains, was formed on the cloth naturally with the help, in the case of the image, of some chemical interaction between the corpse (the tortured state of the corpse might be one crucial factor for the formation of the image) and the top-surface of the linen cloth (that might well be coated with a thin layer of carbohydrates impurities that were the only thing colored furing the image formation process).\nAnd I truly and honestly think that this good probability is much better than what can exist for any other man (known or unknown) in history, especially when we consider the question of the preservation of such a bloodstained burial cloth.  \nFinally, I want to react to this statement made by Joe Verhulst : “Nevertheless, we are supposed to accept that the only one image that came into existence in this natural and accidental way happens to be both a *complete* body image that concerns, moreover, not some random person, but Christ himself. All this is extremely unlikely.”\nMy answer to that is this :  From a strict scientific point of view, it is simply impossible to be so categorical as to state that there is only one image (like the complete image on the Shroud) that came into existence.  In fact, we don’t know anything about that for 2 very good reasons that I already described : 1- There is only one burial shroud in all documented history that was found empty shortly after his used for burial and that’s the one of Jesus.  In this context, it is highly unlikely that there were many other shrouds that have been separated from the corpse before the liquid phase of putrefaction had begun and that could have been well preserved until this day.  And 2- We know for a fact that the dead bodies of most criminal from the Roman period (especially those who died of crucifixion) were not hallowed to be placed in a burial shroud.\nSo, in this context, mainly because of these 2 good reasons, it is impossible to know if other linen shrouds (especially shrouds of crucified victims) could not have bears a body image on them after 36 hours !!!!  On this question, I think Joe Verhulst should read the excellent article published by Dan Porter on his website entitled “The Shroud of Caiphas”.  Here’s the link : \nIt shows how a body image like the one on the Shroud could have been formed (or at least, the chemical “seeds” would have been planted for a later formation) on the surface of his shroud after the first few days in the tomb, but would have been destroyed shortly after because of putrefaction.  How can we be so sure that this hypothetical case would not have been the norm (and not an accident) in the context of a corpse enveloped in a shroud made with a similar antique method as the one kept in Turin (especially in the context of the few shrouds that could have been used to enveloped the corpse of crucified victims) ?   \nAnd finally, concerning the very high quality of the body image and the fact that it is almost complete, I would say that it might well be due to a possible separation of the cloth and the corpse at the “right” (or optimum) time in order that the body image would reach a level of definition and completion very high.  This could be seen as a pure hasard, but with the eyes of faith, if we believe (as I do) that the Shroud is really the genuine shroud of Christ, we can see more than hasard and see some “Will” of God behind that (note that it’s very different than an “Act” of God)…\nNote :  For the question of the identity of the man of the Shroud, that’s exactly the subject of my upcoming paper that will follow the recent paper I published on shroudnm.com !  I will try my best to analyzed the probabilities for and against this idea that the image on the Shroud is the image of Jesus of Nazareth and I think I will be able to show that it is most probably the case (even if it’s very hard to give the exact level of this probability).  I expect to be able to publish it during the Fall…  Stay tuned !!!\n\n","date":"August 16, 2012 at 10:47 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-15068","author":"Yannick Clément","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"I just forgot to give you the link to the article The Shroud of Caiphas.  I have found the text here : http://www.freerepublic.com/focus/f-religion/1172000/posts\nIt worth reading !\n\n","date":"August 16, 2012 at 1:01 pm","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-15074","author":"Yannick Clément","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"\nThibault Heimburger\n I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.\n\nThibault, you know people will still claim the shroud is a hoax, a painting, a schorching or whatever. What is important is patience and a well-argued answer.\n\n","date":"August 17, 2012 at 5:01 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-15106","author":"anoxie","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"And an authentic quest for truth and not for backed-up some agenda driven ideas…\n\n","date":"August 17, 2012 at 8:26 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-15111","author":"Yannick Clément","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Dear all,\nSome weeks ago, you could read an old paper from me in which I concluded that the Maillard reaction was very likely not possible in the first days after the death of the TSM simply because the necessary heavy amines postulated by Rogers (Putrescine and Cadaverine) were missing.\nMore recent papers fully confirm that. BUT for reasons I’ll explain later, i know think that it is not impossible that other heavy amines (not known by Rogers) may work.\nI’ll also will try to answer to some of your comments.  \nMore later.\n\n","date":"August 17, 2012 at 3:15 pm","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-15132","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Changing your idea while new facts comes to you :  That’s the way good science should work.  Rogers was just like that.\n\n","date":"August 17, 2012 at 3:49 pm","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-15136","author":"Yannick Clément","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"One more thing :  In normal conditions, maybe the amount of heavy amines seems inadequate in Rogers hypothesis.  But who can say if Jesus case was “normal” ???  Who was there 2000 years ago to take measurements about the amount of amines released by the corpse ???  I think we should be very prudent before claiming “Maillard reaction was very likely not possible in the first days after the death of the TSM simply because the necessary heavy amines postulated by Rogers (Putrescine and Cadaverine) were missing.”\nI truly think this is a very bad statement, scientifically speaking.  Normality is not always at work everywhere, everytime and any good scientist SHOULD know this basic FACT !\n\n","date":"August 17, 2012 at 3:52 pm","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-15137","author":"Yannick Clément","site":"shroudstory"},{"title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature.","post":"Before someone crucified me for this critic versus Thibault’s comment, I should add that I take good note of the words “likely not possible” he wrote.  But in my opinion, it’s the same as saying “highly unlikely” and it’s not correct, for the simple reason nobody know what was the exact conditions inside the tomb and inside the Shroud.  In this context of darkness, nobody can be sure if there was not some “special” conditions that could have contributed to a release of more amines than “normal”.  I don’t think there are enough studied in that matter to be so sure about that.  So, can we keep an open-mind about the possibility that Rogers hypothesis can be correct IN THE STATE he wrote it ?  Who really knows ?  One data that is always neglect versus the production of amines is the FACT that we’re dealing with a corpse that is FAR FROM BEING NORMAL !!!  It is a tortured, scourged, crucified corpse that was on the cross for at least 3 hours !!!!!!  Do you know one single scientific study that have measured the amount of heavy amines postulated by Rogers that could have been released by an “abnormal” corpse like that ?  There is none !  So please, can we avoid words like “highly unlikely” or “likely not possible” please, because in the present state of our knowledge, NOBODY CAN BE SO SURE ABOUT THAT !!!!\n\n","date":"August 17, 2012 at 4:03 pm","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","id":"comment-15139","author":"Yannick Clément","site":"shroudstory"}]
