[{"title":"It is really, really time to rethink what we think about 3D","post":"This blogger could weep (or spit blood) when reading what’s still being said in the name of “science” (or digital image processing) in 2015.\nBest leave it at that. Have resumed experimentation and am now addressing the “microscopic” properties of the “Shroud” image, a  misnomer if ever there was, compared with the flour imprint model. The so-called microscopic properties in the 8 cited Mark Evans pix reveal no new distinctive microstructure, merely enlargements of macrostructure that from model studies would be easily visible with a x10 hand lens, the latter determined by an obligatory contact-only image capture mechanism. “Half-tone effect”? Pull the other one… The intensely pigmented “striations” would not be possible if there were a half-tone effect.\nhttps://shroudofturinwithoutallthehype.wordpress.com/2015/08/03/is-the-shroud-of-turin-really-just-18-years-short-of-its-2000th-birthday-see-this-blog-for-a-daily-acerbic-overview-of-current-wrangling-currently-2015-week-32/\n(Topic 13)\n\n","date":"August 10, 2015 at 7:26 am","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","id":"comment-207856","author":"Colin Berry","site":"shroudstory"},{"title":"It is really, really time to rethink what we think about 3D","post":"This whole 3D properties from 2D images process, did interest in the phenomenon originate with the Shroud? I’m curious as to whether anyone was exploring this prior to the observations made about the Shroud’s 3D properties. I do find it fascinating how people exploring the icon have discovered things that have application beyond it. Whether the icon is divinely made or divinely inspired, it continues to be a gift to human curiosity.\n\n","date":"August 10, 2015 at 8:29 am","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","id":"comment-207861","author":"David Goulet","site":"shroudstory"},{"title":"It is really, really time to rethink what we think about 3D","post":"La propiedad 3D fue ya descrita por Yves Delage (con Vignon y Colson) en 1902.\n« Un examen attentif de l’image du linceul permet de reconnaître la loi de sa formation. La voici : l’image est une projection à peu près orthogonale, un peu diffuse, et l’intensité de la teinte en chaque point varie en sens inverse de la distance de ce point au point du cadavre correspondant ; cette intensité décroît très rapidement à mesure que la distance augmente et devient nulle quand celle-ci atteint quelques centimètres. \n« Lettre à M. Charles Richet  »\n“Revue scientifique”, n° 22 du 31 mai 1902, pp. 683-687\nhttp://blog-dominique.autie.intexte.net/blogs/index.php/2006/04/21/lettre_d_yves_delage_a_charles_richet\nCarlos\n\n","date":"August 10, 2015 at 11:15 pm","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","id":"comment-207928","author":"Carlos","site":"shroudstory"},{"title":"It is really, really time to rethink what we think about 3D","post":"Ordinary photographs may have some 3d information, but it is distorted by the directionality of the light source.  The relatively undistorted 3d information found on the shroud can be duplicated by photographing a white statue immersed in colored water, but the fact remains that the shroud image is different from most photographs.  One might describe it it as resembling a perfectly “light balanced” photo. Or perhaps similar to an expertly drawn NEGATIVE charcoal sketch in which the artist masterfully faded the boundaries of the figure.  I understand why Colin Berry wants to pursue contact theories, but everything he has suggested so far was tried and abandoned long ago by other researchers.\n\n","date":"August 10, 2015 at 5:22 pm","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","id":"comment-207911","author":"Matt Kowalski","site":"shroudstory"},{"title":"It is really, really time to rethink what we think about 3D","post":"It would be easy if the image was formed just by contact and we know that it is not the case.\n\n","date":"August 10, 2015 at 6:09 pm","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","id":"comment-207916","author":"Louis","site":"shroudstory"},{"title":"It is really, really time to rethink what we think about 3D","post":"Since Barrie Schwortz is an expert in images and photography and Dcn. Pete Schumacher is an expert in remote sensing and the VP8 that revealed the brightness to 3D relation, I’ll rely on the experts in these areas.\n\n","date":"August 10, 2015 at 6:02 pm","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","id":"comment-207913","author":"Dcn Andy","site":"shroudstory"},{"title":"It is really, really time to rethink what we think about 3D","post":"I recomend scientists to study remote sensing and also images and photography before they comment anything on the properties of the Shroud of Turin\n\n","date":"August 10, 2015 at 6:33 pm","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","id":"comment-207918","author":"Sampath Fernando","site":"shroudstory"},{"title":"It is really, really time to rethink what we think about 3D","post":"La imagen del post es ABERRANTE, un FALSO 3D.\nParece que la experiencia acumulada sea INÚTIL.\nThibaul Heimburger ya publicó  en 2005 el magnífico trabajo del ingeniero C.Mignot sobre la verdadera y la falsa 3D.\n“De l’aspect tridimensionnel comparé du Linceul de Turin et des faux suaires réalisés expérimentalement”\nAuteur: Christophe Mignot (ingénieur en sciences physiques, spécialiste du traitement d’image et analyse tridimensionnelle) Date : 22 Août 2005 \n“L’image du Linceul est une vraie image tridimensionnelle, les deux faux expérimentaux analysés ne le sont quasiment pas. L’image du Linceul de Turin est une vraie image tridimensionnelle. Sa qualité apparaît naturellement, et sans manipulation sur les hauteurs, pour peu qu’on se donne les moyens de supprimer localement les taches, et qu’on retire la trame du tissu par les filtrages linéaires appropriés. \nAu contraire, les deux faux élaborés présentent une grande pauvreté de niveaux, car leur procédé de fabrication est basé à un moment donné sur une information binaire : soleil OU ombre, contact de la toile OU absence de contact de la toile. \nDans le cas de Science et Vie, l’exemple est même navrant. On se donne les moyens de créer un bas-relief, c’est à dire une vraie représentation tridimensionnelle, pour en tirer une image qui ne l’est quasiment plus (voir image en 3D composée presque exclusivement de deux niveaux). \nToutefois, CELA NE PROUVE RIEN quand à la capacité de faire un faux 3D. Le fait que le Linceul soit un vrai 3D, et les imitations des 3D médiocres ne prouve rien. \nIl reste tout à fait possible de faire une VRAIE représentation 3D à partir d’un bas-relief. Il suffit pour cela que l’impression réalisée sur le tissu ne contienne pas une information binaire (contact/absence de contact avec le tissu) mais la distance réelle entre le bas-relief et le tissu, une condition qu’ont oublié nos deux faussaires. \nhttp://www.suaire-science.com/documents/3D_mignot.pdf\nCarlos\n\n","date":"August 10, 2015 at 6:41 pm","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","id":"comment-207919","author":"Carlos","site":"shroudstory"},{"title":"It is really, really time to rethink what we think about 3D","post":"“Il reste tout à fait possible de faire une VRAIE représentation 3D à partir d’un bas-relief.”\nThis basic 3D analysis was pointed back in 2005.\nSo, when Dan wrote in 2011 : “the 3D encoding (height field data) of the image is unexplained by science and controverts ancient forgery” and  is now considering to “rethink the 3D”, it is a personnal statement.\n\n","date":"August 11, 2015 at 4:31 am","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","id":"comment-207950","author":"anoxie","site":"shroudstory"},{"title":"It is really, really time to rethink what we think about 3D","post":"Fair enough. I’m always open to new thinking. Joe Accetta’s suggestion that photographs of death masks might yield 3D data with the right lighting conditions and Colin’s demonstration of (weak) 3D effect from scorches must be taken into account.  I’m as convinced as ever that the shroud is real, more so than even a year ago. But I have come to realize that the 3D data is not well understood and I won’t use it to try to convince anyone about authenticity. I very much appreciated the letter from the reader that called out the specifics of the issue.  1) The adage that regular photographs and painting never have/can’t have/don’t have 3D information is inaccurate. 2) The assumption that image density/brightness/grayscale value represents cloth to body distance is just that, an assumption. There are other options. 3) The notion that the image is derived by an interaction between a body and a cloth depends on a cloth-body assumption being true. Is that not a form of begging the question?  \nI have never seen controls for the VP8.  That would be easy.  Hint to the folks in New Mexico. Get your best 3D projection.  Now without touching the VP8 dials and switches AND without touching the camera, particularly the lens (leave aperture and focus settings untouched) do a 3D projection of a card with calibrated grayscale values and precision line-width cross-hairs so we can estimated linearity of the calculated height and the amount of smoothing that takes place in the calculation.  Does the VP8 have a built-in, electronic smoothing/Gaussian blurring function or is it achieved with an out of focus lens.  Let’s have a do over.  Then let’s do the same with the best new higher definition tools out there like ImageJ. \nThe 3D is very mysterious. Let’s stop pushing the mystery and try to understand the mystery with data. Maybe it is all about cloth to body distance. Let’s find out instead of assuming.\n\n","date":"August 11, 2015 at 5:12 am","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","id":"comment-207951","author":"Dan","site":"shroudstory"},{"title":"It is really, really time to rethink what we think about 3D","post":"You can get 3D with scorching, water stains, frottage, painting, photographs…. the question is which model is the best fit for the 3D properties of the Shroud.\nYou can ask for more data on the 3D to choose between different models, but are we there yet? Has the preliminary work been done?\n\n","date":"August 12, 2015 at 12:25 am","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","id":"comment-208015","author":"anoxie","site":"shroudstory"},{"title":"It is really, really time to rethink what we think about 3D","post":"This ‘medieval modeller’ won’t even try to respond to all the flak we see here, seeing it for what it is – flak. Scientific modelling requires an attention span of months, years even, not the minutes or at most hours we see on this site.\nEliciting 3D responses from 2D images, many with no 3D history, has been this blogger’s speciality, the subject of literally dozens of postings, which cannot be easily or quickly summarized here in just a few words. Any attempt to do that would lay one open to those looking to score points at one’s expense. However, I’d just say this about 3D  and image edges in the context of the flour-imprinting model. 3D effects are most realistic when there’s a smooth gradient in image intensity. A medieval modeller would not have known or cared about that, but might still have deployed a technique that unwittingly generated smooth gradients. Why? How? Maybe it was through trying to achieve that other criterion – the fuzzy edge – for that ghostly quality? How? Lay the subject flat and apply flour paste thickly  to the highest contours of the body. Then take a second brush, maybe wetted with water, and spread the paste laterally to the sides of the body, with progressive thinning from centre to sides. That process is likely to generate the required gradients of image intensity, as well as ensuring a tapering off of image intensity to a fuzzy indistinct edge.\nThough reluctant to accept that the “fuzzy” edge is a scientific criterion worthy of a place on the enigmatic/iconic checklist, there is a possible scientific angle that springs to mind. Use of a wet flour paste means there is always an air/water meniscus at the edge which tends to result in excessive contrast. The way to avoid that is to deploy the flour as a solid. How? One way is to use it for Garlaschelli-style frottage, sprinkling it on top of the linen (making no direct contact with body) and moulding to contours. Another way is to rub the flour onto the subject first, and then drape over a sheet of wet linen (with no continuous unbroken air/water meniscus) and proceed to mould to contours. Any meniscus is between single flour particle(s) and linen.\nInitial results with microscopy look promising, though the match has to be with how the “Shroud” image might have looked centuries ago, or with the Mark Evans pictures photo-enhanced to improve contrast. Note that my scrutiny of those 8 photomicrogaphs showed before-and-after added contrast. No one is forced to use the high-contrast pictures. If they can see the alleged half-tone effect in the ‘before’ pictures, then I say bully for them, but don’t expect this scientist to nod vigorously in agreement. Indeed, any oscillatory motion  is lateral, not vertical.\n\n","date":"August 11, 2015 at 1:18 am","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","id":"comment-207937","author":"Colin Berry","site":"shroudstory"},{"title":"It is really, really time to rethink what we think about 3D","post":"Have just tested out (twice!) that new variant of flour-imprinting technology – ie, coating one’s hand with dry flour, then overlaying with wet linen and moulding to contours. The resulting flour imprint was then (a) dried (b) placed in oven to develop yellow/brown colour, then (c) attenuated by rinsing in soap and water.  Results? Magnificent! Fuzzy “Shroud” like image, very passable 3D properties (certainly better than than the VP-8 plate in Heller’s book) and an amazingly good match with the Evans photomicrographs (I think so at any rate).\nI’ll test the procedure a 3rd time tomorrow, and if all goes according  to plan will put up a posting on my specialist Shroud site (click on blue monicker)  Thursday pm at the latest. Will then need to think about how the blood was incorporated, but ideas are finally starting to gel. “Re-moistening” of clotted blood even gets a look-in, but in an alternative model that, er,  matches the C-14 dating.\n\n","date":"August 11, 2015 at 12:29 pm","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","id":"comment-207980","author":"Colin Berry","site":"shroudstory"},{"title":"It is really, really time to rethink what we think about 3D","post":"Got it, Fixed it. Thanks to a reader for spotting my mistake; I added the word NOT. My last two sentences before the notes should have read, “I still think the data is real 3D data.  I’m just NOT persuaded that cloth to body distance is a valid assumption.”\n\n","date":"August 11, 2015 at 2:37 am","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","id":"comment-207941","author":"Dan","site":"shroudstory"},{"title":"It is really, really time to rethink what we think about 3D","post":"Dan: “Cloth to body assumption” is a dead end. There is not a position of the sheet that allows  making the image according to the distance from the body. I challenge to show a consistent picture (not words) with any position.\n\n","date":"August 11, 2015 at 2:53 am","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","id":"comment-207942","author":"David Mo","site":"shroudstory"},{"title":"It is really, really time to rethink what we think about 3D","post":"David:\nTotalmente de acuerdo.\nLas manchas de la sangre y la imagen del Hombre corresponden a 2 eventos diferentes en los que la Sábana estaba en 2 posiciones muy diferentes.\nPor ello la imagen de la Sábana es IRREPRODUCIBLE, porque a nivel de lo sobrenatural las puertas de la Ciencia están cerradas.\nEl Dr.Gilbert Lavoie lo mostró de manera muy fácil y sencilla:\n\nhttp://www.shroud.com/pdfs/ssi20part4.pdf\nCarlos\n\n","date":"August 11, 2015 at 6:37 am","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","id":"comment-207957","author":"Carlos","site":"shroudstory"},{"title":"It is really, really time to rethink what we think about 3D","post":"As mentioned yesterday, this intrepid  (foolhardy?) blogger will shortly be unveiling a new variant of his flour-imprinting model. This might be a good moment to flag up a new concept that will be proposed – or as some might say, inflicted –  on the body politic of sindonology, namely the  ‘shelf effect’. \nYesterday, following a stinging rebuke from a certain medical gentleman, I decided to move from a wet paste model to a dry powder one, conceived while grinding teeth in the wee small hours. The subject is first coated liberally with white flour, and then covered in wet linen to get the negative imprint. In this model, the best 3D effect is not from the highest relief as might be predicted  but from the flattest – the most shelf-like. Result: a tendency for 3D imaging to promote the level planes of presentation to linen over the vertical or angled ones, rather than – or in addition to – elevated over lower relief. Why? Because the flour sprinkled and spread out onto a flat shelf-like area of the anatomy stays put, whereas flour applied to the vertical planes tends to quickly drop off under gravity. I believe the ‘shelf effect’ can explain some anomalies re the way the “Shroud” responds in 3D-rendering programs, notably ImageJ, including those bony fingers.  It’s something I flagged up a while ago, having spotted a peculiar two-tone colour distribution in the Halta image that appeared on the BBC site in 2010 (increased contrast in my photoediting program causing the ‘shelf-like’ features of the anatomy to acquire an unexpected rosy hue).\nOh, and I’m starting to think Hugh Farey was right at the tail end of 2012 regarding the chromophore. He suggested lignin, not carbohydrate as is generally presumed. The lignin of linen, while a minor component (3%)  is said to be a lot more dispersed than might be assumed from comparison with the literature on wood. Paolo Di Lazzaro (and Louis, his representative on Earth) please note.\n\n","date":"August 12, 2015 at 2:07 am","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","id":"comment-208021","author":"Colin Berry","site":"shroudstory"},{"title":"It is really, really time to rethink what we think about 3D","post":"Colin:\nDr.Judica Cordiglia\n \nProf.Ruggero Romanese\n\nDr.Sebastiano Rodante\n \nFather Gaetano Intriguillo\n\nEl POLVO (de aloe y de mirra) fue utilizado por Judica Cordiglia, Ruggero Romanese y Sebastiano Rodante (todos autenticistas), pero al parecer el POLVO bloquea la transferencia de los coágulos de sangre, por lo que Rodante se decidió por utilizar “cloths soaked in a watery aloe and myrrh solution” obteniendo mejores resultados con la sangre.\nhttp://www.sindone.org/the_holy_shroud__english_/science/00024815_Contact_theory.html\nCarlos\nPD: Sebastiano Rodante terminó optando por el flash de luz. Trata en este video el tema de la sangre y es probable que su experiencia te sea interesante, yo no(negación) entiendo el inglés hablado.","date":"August 12, 2015 at 5:19 am","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","id":"comment-208030","author":"Carlos","site":"shroudstory"},{"title":"It is really, really time to rethink what we think about 3D","post":"Google Translate:\nPOWDER ( aloe and myrrh ) it was used by Judica Cordiglia , Ruggero Romanese and Sebastiano Rodante (all authenticists ) , but apparently the dust blocks the transfer of blood clots , so Rolling decided to use ” cloths soaked in a watery aloe and myrrh solution ” getting better results with blood.\nhttp://www.sindone.org/the_holy_shroud__english_/science/00024815_Contact_theory.html\nSebastiano Rodante ended opting for the flash of light. Try in this video the issue of blood and probably will make your experience interesting , I do not understand spoken English\nHi Carlos\nIf powder blocked the transfer of blood, then they were doing it wrong. Blood has to be imprinted before image (Adler/Heller).\nApologies, but am not ready quite yet to propose a sequence of operations that achieves the desired goal of our medieval artisan, whether or not he was real or imaginary.. The principles are not the problem. It’s getting the details right that is tricky. However the use of a real cooperative human as 3D template,  at least for the trunk and limbs, and the ability to imprint with solid particulate flour (yes, it works!)  makes for a range of options, each of which requires careful evaluation.\n\n","date":"August 12, 2015 at 7:56 am","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","id":"comment-208045","author":"Colin Berry","site":"shroudstory"},{"title":"It is really, really time to rethink what we think about 3D","post":"Colin, tengo una curiosidad.\nCrees que podrías realizar tus experimentos sin tener como “muestras” (que te permiten hacer las correcciones oportunas) las fotografías del positivo y negativo de la Sábana Santa?\nCarlos\n\n","date":"August 12, 2015 at 9:58 am","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","id":"comment-208063","author":"Carlos","site":"shroudstory"},{"title":"It is really, really time to rethink what we think about 3D","post":"The Google Translate is somewhat difficult to make sense of, Carlos:\nColin , I have a curiosity.\nYou think you could make your experiments without as “samples” ( that allow you to make corrections ) photographs of the positive and negative of the Shroud ?\nCarlos\nHowever, if I understand you correctly, you are asking if the current model matches the “Shroud” image  – and maybe whether one is having to struggle to achieve that match?\nMy latest model with the flour as powder gives a very fuzzy outline. Hopefully it should satisfy a certain individual on this site who demands precisely the right degree of fuzziness. It also gives a splendid 3D result (arguably as good as if not better than the “Shroud”), AND gives a better demonstration of the half-tone effect at least (in some photomicrographs, not others) than the ‘official’ Mark Evans pictures. But the technique of oven-baking for second stage development (not necessarily the best one given  the existence of other options) is highly sensitive to organic material, not just flour, but one’s own skin secretions, so I have to be cautious. Am running  controls at the moment to make sure that effects are mainly or entirely due to the flour imprinting medium (though it doesn’t detract greatly from the model if there’s some assistance from tiny amounts of skin oil, perspiration etc). Who’d be a scientist, when every test needs half a dozen or more controls, some easy to overlook, to be certain that what one’s looking at is a real effect?\n\n","date":"August 12, 2015 at 10:37 am","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","id":"comment-208066","author":"Colin Berry","site":"shroudstory"},{"title":"It is really, really time to rethink what we think about 3D","post":"There seems to be much confusion about what is meant by 3D information, a convenient label  which needs careful unpacking to see if it means anything. After all, almost every picture contains 3D information, in some ways. A car in a photo appears smaller than a child – we immediately recognise that the child is much closer than the car. The child is partially obscured by the teddy he is carrying – we know that the teddy is in front of the child. And so on. Our familiarity with faces is such that any picture of a face, however crude, implies that the nose protrudes and the eyes are deeper set, and we tend to see that simply as a matter of cultural experience. This has to be extracted from the claim that the 3D information on the shroud is a result of a relationship between the darkness of the image and the vertical distance between a hypothetical body and a hypothetical sheet, which in the VP-8 and ImageJ is horizontal. Extracting the cultural bias is, however, extraordinarily difficult, and has led people looking at the VP-8 graphics as if they were a great deal more realistic than they actually are. A man’s cheeks and eyebrows are not in the same plane as his nose, (as appears in the Shroud and in the image above), but we unconsciously forgive the images that show them to be so because we know what they ‘ought’ to look like. To attempt to rectify this, here are a couple of images, the Shroud and one which really does have a darkness/distance relationship, tilted slowly sideways until we can see them in profile. It would be wrong to say that the Shroud has no such relationship at all, but it really isn’t very good, and certainly not evidence either of a miracle or of some kind of radiation attenuation from a real body-shaped body.","date":"August 12, 2015 at 5:48 am","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","id":"comment-208032","author":"Hugh Farey","site":"shroudstory"},{"title":"It is really, really time to rethink what we think about 3D","post":"Hugh:\n¿Utiliza el mismo software para la Sábana y para la máscara?\nCarlos\n\n","date":"August 12, 2015 at 6:22 am","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","id":"comment-208035","author":"Carlos","site":"shroudstory"},{"title":"It is really, really time to rethink what we think about 3D","post":"Claro que si! The image I used for the right hand series of pictures did not reproduce well. It is darker than shown above. ","date":"August 12, 2015 at 6:51 am","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","id":"comment-208040","author":"Hugh Farey","site":"shroudstory"},{"title":"It is really, really time to rethink what we think about 3D","post":"Folk might like to see my latest 3D rendering of the TSM face. This one has eyes and lips!\n\nAnyone care to guess how it was obtained (Shroud Scope with added contrast, and MINIMAL change from default settings in ImageJ)?\n\n","date":"August 15, 2015 at 3:47 am","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","id":"comment-208299","author":"Colin Berry","site":"shroudstory"},{"title":"It is really, really time to rethink what we think about 3D","post":"¡Excelente imagen, Colin!\n\n","date":"August 15, 2015 at 4:00 am","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","id":"comment-208301","author":"Carlos","site":"shroudstory"},{"title":"It is really, really time to rethink what we think about 3D","post":"Thanks Carlos. Care to guess what one has to do in ImageJ to get it?  (I’m kicking myself for not having spotted it sooner – but at least that self-administerd kicking will probably stop soon, unlike that from some others one could mention with their hobnail boots ;-)\n\n","date":"August 15, 2015 at 4:15 am","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","id":"comment-208302","author":"Colin Berry","site":"shroudstory"}]
