[{"title":"Those Dark Specks in the Mark Evan’s Photographs","post":"It wold be nice if before he comments that Colin acquaint himself with the breadth of of the STURP study. Dark spot anomalies were discovered among on the the foot and kneww. They have been subsequently analysed as limestone consistent with limestone found in Jerusalem. \nI recall that Berry’s expertise and career involved analysis of issues related to nutrition? If so, I would suggest that he get his head out of his  …oven.\nIt would be nice if Colin has a sense of humor but he will probably have a snit about my analogy.\n\n","date":"October 31, 2014 at 5:35 am","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","id":"comment-167153","author":"John Klotz","site":"shroudstory"},{"title":"Those Dark Specks in the Mark Evan’s Photographs","post":"kneww = knee.\n\n","date":"October 31, 2014 at 5:36 am","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","id":"comment-167155","author":"John Klotz","site":"shroudstory"},{"title":"Those Dark Specks in the Mark Evan’s Photographs","post":"And another thing.\nhttp://johnklotz.blogspot.com/2013/01/clumsy-me-and-shroud-of-turin.html\nI note in that post that limestone dirt speck as found on the Shroud were “exclusive” to Jerusalem. There may be some controversy about that but there is no question that the limestone variety was found in Jerusalem particularly along the Via De la Rosa – the Way of the Cross.\nAnd by the way, they have been subject to spectrographic analysis.\n\n","date":"October 31, 2014 at 5:48 am","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","id":"comment-167161","author":"John Klotz","site":"shroudstory"},{"title":"Those Dark Specks in the Mark Evan’s Photographs","post":"“It would be nice if before he comments that [insert appropriate name] acquaint himself with the breadth of the STURP study.” Wouldn’t it just.\n – The photomicrograph Colin refers to is from the left eyelid of the man in the Shroud, not the foot or the knee.\n– Various specks from all over the Shroud have been analysed as all sorts of stuff from gold flakes to washing powder. The proportion of calcium carbonate found as aragonite is very small.\n– Aragonite is common and widespread throughout the world. Although isotopic analysis could identify the origin of a specific mineral more precisely, no such analysis has been carried out. The suggestion that the aragonite found on the shroud can be identified exclusively as that found in Jerusalem is wholly unsubstantiated.\n\n","date":"October 31, 2014 at 7:39 am","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","id":"comment-167192","author":"Hugh Farey","site":"shroudstory"},{"title":"Those Dark Specks in the Mark Evan’s Photographs","post":"The Aragonite found in 1978 from spectroscopic “hits” were found also in the nose area — close enough to the eyelid, so what are you fussing about.  I thought I had read that the 9  Aragonite samples from parts of Israel (from Dr. Nitowski) had a match with the Shroud Aragonite only in the case of the 1  sample from Jerusalem, and I thought the Dr. Levi-Setti examination (from Fermi Institute) had resulted in an unusually close match between the two above.  Exclusive match, maybe not, but the fact that the other 8 Nitowski samples did not match, has to account for a pretty positive indicator.  And, as Dr. Kohlbeck stated, skeptics have to account for Aragonite being on the Shroud at all, and then, on such indicative places, feet, knee, nose.\n\n","date":"October 31, 2014 at 8:44 am","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","id":"comment-167210","author":"Nabber","site":"shroudstory"},{"title":"Those Dark Specks in the Mark Evan’s Photographs","post":"Hugh sez:  “The suggestion that the aragonite found on the shroud can be identified exclusively as that found in Jerusalem is wholly unsubstantiated.”  \nTearing down strawmen, are you?  Who maintains that the evidence shows or has-to-show exclusive identification? What, no one has ever gone to prison based on circumstantial evidence?  It’s the preponderance of evidence we’re looking for here, not exclusivity.  1 out of 9 aragonite samples from Israel match the Shroud aragonite, and it is the sample from Jerusalem.  You are the editor of a journal that looks at evidence, and your standard is exclusivity?\n\n","date":"October 31, 2014 at 11:32 am","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","id":"comment-167264","author":"Nabber","site":"shroudstory"},{"title":"Those Dark Specks in the Mark Evan’s Photographs","post":"Thank you Hugh.\nOne is reminded of the man on his hands and knees scratching around in the dirt. A passing policeman asks, “What are you doing?”\n“I am looking for my key.” \n“Where did you lose it?” the policeman asked. \n“Up there near the house.” \n“Then why are you looking for it down here?” \n“The light’s better down here!”\nAt the risk of inserting mischievous allegory, it scarcely matters in the present context whether or not that dirt on the hands and knees contained particles of travertine aragonite!\nWhile I can’t speak for the legal profession, both you and I know that the important thing in scientific research is  never to restrict one’s search radius to “where the light is” …\nAny indications of success yet with your half-term project?\n\n","date":"October 31, 2014 at 8:48 am","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","id":"comment-167213","author":"Colin Berry","site":"shroudstory"},{"title":"Those Dark Specks in the Mark Evan’s Photographs","post":"For me it’s 50.009 to 49.991 it’s the real deal, but that switches day to day. Now how it was cuased it another question. I believe it was a natural event and not Jesus coming back to life. \nHaving wrote that I ask this question again, how can we be sure of what we find on the shroud? We don’t know who touched it or how many people didor what they have on them that could have gotten on the shroud.  Do we how how it was handled? Do we have a complete history of where it was for maybe hundreds of years? Could have it been created in the 13 hundreds and at one point traveled to Jerusalem after that?   \nI was watching a program, “Secrets of the Dead” on our local PBS station and they were trying to test some DNA in the bones that were 30,000 years old and they found that even just touching them with unprotected hand caused the handlers DNA to get into the bones. \nI just don’t see how you can be sure that all the stuff we find on the shroud was there when it was created if we don’t have a compete history and a chain of custody\n\n","date":"October 31, 2014 at 10:33 am","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","id":"comment-167247","author":"John Green","site":"shroudstory"},{"title":"Those Dark Specks in the Mark Evan’s Photographs","post":"The natural event hypothesis is also viable, but then it raises the question, Why should it have happened only on Jesus’ shroud?\nDNA contamination is a big problem. That is why it was ruled out by experts in the case of the Talpiot tomb. You can find some details about Shroud DNA in the following interview, however it must be pointed out that the study cited there needs some “fine tuning”, the range is very broad.\n https://www.academia.edu/8841978/Professor_Giulio_Fanti_discusses_the_controversies_in_the_realm_of_Shroud_studies\n\n","date":"October 31, 2014 at 10:47 am","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","id":"comment-167252","author":"Louis","site":"shroudstory"},{"title":"Those Dark Specks in the Mark Evan’s Photographs","post":"Louis\nI agree that there are also problems with the natural event hypothesis. Where’s the body? If it decayed I’m sure there would be more than blood on the shroud.\n\n","date":"October 31, 2014 at 10:55 am","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","id":"comment-167255","author":"John Green","site":"shroudstory"},{"title":"Those Dark Specks in the Mark Evan’s Photographs","post":"John G., there are no signs of body decay on the Shroud and that is one of the reasons why the Resurrection hypothesis has been proferred. I did try to do some “fine tuning” of my own, asking scientists to try to find out how long the image-formation process took. Guided by the New Testament narratives I do believe that Jesus’ healing and curing miracles were instantaneous. The suggestion is at the end of the interview-article cited above.\nI also know that not everyone accepts the miracle stories in the Gospels. The scepticism began with Bultmann, who walked hand in hand with Heidegger. Their unbelief also led them to a vacuum they could not fill, making Bultmann remain in the Lutheran Church and Heidegger request his parish priest for a Catholic burial.\nWe must remember that the miracle stories were not rejected by Jesus’ enemies, it was in fact the reason why the religious establishment feared and hated him. He was considered to be a threat to the Temple, with its blood sacrifices and exploitation of the poor, and according to Father Raymond Brown, because half of it was a kind of “Central Bank”. That put even the fiercely anti-Roman Jewish rebel group sicarii on the list of the enemies of the Sadducees who controlled the Temple.\nThe best Jewish scholars do not deny Jesus’ miracles. One Israeli archaeologist was of the opinion that he learn a different kind of medicine somewhere. If that is true, where was this secret school of medicine? In Egypt, in the Judaean desert? Why was the knowledge lost?\n\n","date":"October 31, 2014 at 12:19 pm","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","id":"comment-167276","author":"Louis","site":"shroudstory"},{"title":"Those Dark Specks in the Mark Evan’s Photographs","post":"Take up your arguments with Ian Wilson. See “The Shroud” pp 66-68. Among the individual scientists who examined the limestone were  Roger and Mary Gilbert, Sam Pellicori,, Dr. Joseph Kohlbeck and Dr. RiRicardo Levi-Setti.\nThe Gilberts were pioneers in spectrographic analysis. During the 120 hours of the STURP examination, that analyzed every millimeter of the Shroud. They were stumped by anomalies in certain areas beginning with the feet. The anomalies were examined under high powered magnification and found to be “dirt.” That dirt was then analysed and found to aragonite. \nNo one found black cookie or bread crumbs.\nIt as absurd a hypothesis as Berry’s early hypothesis that the man in eh Shroud was Jacques de Millay.\nIt is easy to hypothesize when you do not know the facts. Unfortunately the facts get in the way.\n\n","date":"October 31, 2014 at 8:56 am","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","id":"comment-167214","author":"John Klotz","site":"shroudstory"},{"title":"Those Dark Specks in the Mark Evan’s Photographs","post":"Was flour even white in that time period? And why flour…perhaps it is oatmeal…a much heartier base for artwork.\n\n","date":"October 31, 2014 at 9:36 am","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","id":"comment-167225","author":"David Goulet","site":"shroudstory"},{"title":"Those Dark Specks in the Mark Evan’s Photographs","post":"In the lines of Colin’s blog there is also a brief mention of the atomic force microscopy\n(= AFM):\n>It’s been suggested  elsewhere that there is no way of telling whether the Shroud image is on the PCW or on a more superficial impurity coating. Admittedly that may be difficult using classical microscopy (atomic force microscopy is another matter). But it’s not impossible using chemical means, though access to Shroud samples in the quantities required is as problematical as ever.\nlink:\nhttp://colinb-sciencebuzz.blogspot.it/2014_04_01_archive.html\n— — —\nAragonite.\n>Dust of aragonite was found at the location of the nose, knees and feet.\nLink.\nhttp://editionsassailly.com/books/The%20Shroud.pdf\nand here a few words about SIMS and aragonite:\n>… conclusion:\n>we have the SIMS of the Shroud and the SIMS of the Jerusalem sample included in the BAR paper. They were performed by Dr. Levi-Setti. Most of the spectral lines are in both samples. To asses if the matching is enough to conclude is common origin, it would be necessary to compare these spectra with those of other tombs samples and with other linen cloth samples. Dr. Levi-Setti has spectra from Egyptian mummylinen cloths but he has not spectra from other tombs of Israel. To follow these studies, we should use the same SIMS technique for new TS dusts and limestone of other origins samples.\n>There are other methods to detect the traces (Strontium, Iron…) that make up the finger print: X-ray fluorescence. But, maybe, they are not accurate enough.\nLink:\nhttp://www.holyshroudguild.org/cesar3.html\nUnfortunately I have not received any response about the use of the Super-SIMS for research on “fingerprinting” of aragonite …\nLinks:\nhttps://shroudstory.com/2014/09/28/searching-stephen-jones-quotation-archives/\nhttps://www.hzdr.de/db/Cms?pNid=2809\nHow does Super-SIMS work?\n>A sputter source is used to focus a Cs+-beam onto a as smooth as possible sample surface. The extracted negative ions (elements or molecules) of keV-energy are electrostatically and magnetically separated leading to a mass resolution (m/Δm) of about 5000. A first isobar suppression is gained right in the ion source, if these do not form any negative ions (e.g. no formation of Mg- when analysing Al).\n>Selected ions with the correct energy, mass and charge are  injected into the 6 MV accelerator and accelerated to the positively charged high-voltage terminal. Negative ions are passing an area filled with argon gas, thus, loosing electrons from the outer shell. Thereby, all existing molecules are destroyed. The henceforth multiple-positively charged ions (e.g. Al3+) are accelerated a second time in the direction of the other end of the accelerator, which is on ground potential\n>At the so-called high-energy site all ions are again magnetically and electrostatically separated before they are finally detected by Faraday-Cups (major elements) and gas ionisations detectors (trace elements, respectively)\n— —\nIn any case I believe that we need very precise work on this topic …\nand even more accurate than what we have already seen.\n\n","date":"October 31, 2014 at 10:51 am","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","id":"comment-167254","author":"piero","site":"shroudstory"},{"title":"Those Dark Specks in the Mark Evan’s Photographs","post":"“The Gilberts were pioneers in spectrographic analysis. During the 120 hours of the STURP examination, that analyzed every millimeter of the Shroud. They were stumped by anomalies in certain areas beginning with the feet. The anomalies were examined under high powered magnification and found to be “dirt.” That dirt was then analysed and found to aragonite.”\nSome of the above is partially true.\nThe Gilberts’ paper ‘Ultraviolet-Visible Reflectance and Fluorescence Spectra of the Shroud of Turin’ contains a diagram showing the 26 places on the Shroud that they examined. It says nothing about any anomalies, nothing about dirt, nothing about being stumped. This story comes from John Heller’s book ‘Report on the Shroud of Turin.’ As he was not present at Turin, he must have got it from another source, possibly Eric Jumper or Sam Pellicori. The story has at least been slightly embroidered. The dirt on the feet is evident from a casual inspection, it did not need either a microscope or spectrographic analysis to discover it. \nKohlbeck and Nitowski’s discoveries were discussed a few weeks ago at “So Maybe it is a Painting After All” on this site. All else is further embroidery.\n\n","date":"October 31, 2014 at 11:17 am","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","id":"comment-167259","author":"Hugh Farey","site":"shroudstory"},{"title":"Those Dark Specks in the Mark Evan’s Photographs","post":"Hugh sez:  “As he was not present at Turin, he must have got it from another source, possibly Eric Jumper or Sam Pellicori. THE STORY HAS BEEN AT LEAST SLIGHTLY EMBROIDERED.”  \nNon-sequitur.  Judgmental.  Absolutist.  Unsubstantiated.\n\n","date":"October 31, 2014 at 11:36 am","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","id":"comment-167265","author":"Nabber","site":"shroudstory"},{"title":"Those Dark Specks in the Mark Evan’s Photographs","post":"No, Nabber. Have you read Heller’s account? “Once they [the Gilberts] obtained the initial series of spectra on the heel, they began slowly to move up the leg … by the time the Gilberts had reached one knee, all the spectra were alike, except for the heel.” Not according to their published paper, they didn’t. They did no measurements at all on either the front or the back of the knees. In fact they made scans of “seven clear areas on the Shroud, eight body image areas, six scorched areas, five bloodstained areas, and on a magnesium oxide reference surface.” The positions of these scans are clearly marked on the plan. The graphs of the relative spectral reflectance and the spectral fluorescence with excitation at 365nm of the heel are shown in comparison with three other body parts. The heel is the darkest in each case, but there is otherwise little difference in shape from the other parts.\nHeller’s book is by a long way the best on the STuRP expedition, and gives a wonderful flavour of the atmosphere in Turin and the excitement of everybody involved. I have no doubt that the presence of dirt on the heel was discovered during it. It is no disrespect to Heller to say that his book should not necessarily be taken as a literally factual account of every action performed or every word spoken.\n\n","date":"October 31, 2014 at 12:19 pm","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","id":"comment-167275","author":"Hugh Farey","site":"shroudstory"},{"title":"Those Dark Specks in the Mark Evan’s Photographs","post":"CB\n“I have thought and written a great deal about the huge temperature response (in relative terms) of Maillard reactions in the region of 50-55 degrees Celsius”\nSeriously?\nYou’re totally discredited about Maillard reaction for a long, long time, since we had to fight to explain it actually occured below 100°C, you answered:\n“Not even slightly toasted. The Maillard reaction is simply not THERMODYNAMICALLY FEASIBLE at 100 degrees Celsius, even if other chemical reactions are occuring at multiples of their normal room-temperature rate.”\nWe’ve been bored for weeks with your “thermodynamically not feasible Maillard reaction under 100°C”, and now we should read your posts about “the huge temperature response of Maillard reaction around 50°C” and flour particules???\nYou don’t have to be a rocket scientist to understand he does not know what he is talking about.\n\n","date":"October 31, 2014 at 12:24 pm","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","id":"comment-167278","author":"anoxie","site":"shroudstory"},{"title":"Those Dark Specks in the Mark Evan’s Photographs","post":"The context was the toasting of bread. I said one could never hope to be able to toast bread at 100 degrees C, not even slowly. It has little or nothing to do with chemical kinetics. It’s  to do with the thermodynamics. Thermodynamics is to do with feasibility in principle in both energetic and entropy terms (“uphill” or “downhill”). It’s to do with the sign (+ or -) of the Gibbs free energy change for a system that’s had time to reach chemical equilibrium. It’s nothing to do with rates of reaction. \nBut then what’s a little quoting out of context between friends? \nDid you not get a holiday this year, anoxie?\n\n","date":"October 31, 2014 at 1:13 pm","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","id":"comment-167286","author":"Colin Berry","site":"shroudstory"},{"title":"Those Dark Specks in the Mark Evan’s Photographs","post":"PS.Anyone who thinks that Maillard reactions can be conducted with ease, with predictable outcome,  at low temperatures should consult this recent (2010) paper by M.A.J.S. van Boekel.\nhttp://pubs.acs.org/doi/full/10.1021/bk-2010-1042.ch001\nHe and I sing from the same hymn sheet. At low temperatures, say 50-55 degrees C for Maillard reactions, one is into the realm of thermodynamic control (as distinct from the much simpler and more predictable kinetic control).\nMaybe anoxie would care to state her own credentials in chemistry before dismissing mine as worthless. Maybe anoxie would care to come out from behind her pseudonym before rubbishing the credentials of those of us who blog under our real names.\n\n","date":"October 31, 2014 at 1:46 pm","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","id":"comment-167296","author":"Colin Berry","site":"shroudstory"},{"title":"Those Dark Specks in the Mark Evan’s Photographs","post":"Context:\nhttps://shroudstory.com/2012/08/11/colin-berry-so-how-could-ray-rogers-have-got-it-so-wrong/\nDiscredited.\n\n","date":"November 1, 2014 at 5:34 am","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","id":"comment-167567","author":"anoxie","site":"shroudstory"},{"title":"Those Dark Specks in the Mark Evan’s Photographs","post":"So, we’ve moved on from one-liners to one-worders. Good. That’s progress. Keep slimming down…\n\n","date":"November 1, 2014 at 5:46 am","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","id":"comment-167572","author":"Colin Berry","site":"shroudstory"},{"title":"Those Dark Specks in the Mark Evan’s Photographs","post":"“The Maillard reaction is simply not THERMODYNAMICALLY FEASIBLE at 100 degrees Celsius”\nIronically, you claimed so, to insult Ray Rogers’ credentials.\nResult is: you’ve definitely discredited yourself.\n\n","date":"November 2, 2014 at 5:51 am","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","id":"comment-167872","author":"anoxie","site":"shroudstory"},{"title":"Those Dark Specks in the Mark Evan’s Photographs","post":"Eh bien, personne est parfait, sauf Anoxie…\nFin\n\n","date":"November 2, 2014 at 6:11 am","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","id":"comment-167874","author":"Colin Berry","site":"shroudstory"},{"title":"Those Dark Specks in the Mark Evan’s Photographs","post":"Sorry Nabber, I may have missed this: “1 out of 9 aragonite samples from Israel match the Shroud aragonite, and it is the sample from Jerusalem.” Is this true? Have you read Kohlbeck and Nitowski? If you have any evidence for it all, give me a hint and I’ll try to follow it up. If there were any truth in it at all it would indeed be significant, but I’m afraid it’s wishful thinking on the part of someone.\n\n","date":"October 31, 2014 at 1:23 pm","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","id":"comment-167289","author":"Hugh Farey","site":"shroudstory"},{"title":"Those Dark Specks in the Mark Evan’s Photographs","post":"Of the various particulates vacuumed off the Shroud by Professor Riggi during the STURP project were the following:\nPower station fly ash;    [Turin Fiat motor industry]\n Particles of iron, bronze, iron, gold;[From storage caskets]\n Wire fragments;[Unknown source]\n Fabrics: red silk, blue linen, plain cotton, plain wool, pink nylon;[Possible sources – the red silk coverlets, blue fabric frame, cotton gloves (STURP), clerical vestments]\n Pollen grains, as investigated by Max Frei; \nThe aragonite limestone particles discovered by the GIlberts were on the feet, nose and knee.  These matched one set of the Nitowski samples sent from Jerusalem, from a known tomb area.  Identification by Kohlbeck and others. \nNo mention of toast or cookie crumbs!\n\n","date":"October 31, 2014 at 2:27 pm","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","id":"comment-167325","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Those Dark Specks in the Mark Evan’s Photographs","post":"“The aragonite limestone particles discovered by the GIlberts were on the feet, nose and knee. These matched one set of the Nitowski samples sent from Jerusalem, from a known tomb area. Identification by Kohlbeck and others.”\nAny sources for any of that? Just askin’…\n“No mention of toast or cookie crumbs!”\nSo who said this? “Walter also stated that he had found wheat starch on the Shroud. We confirmed this by microchemical testing with aqueous iodine, supporting an hypothesis that the cloth had been made by ancient methods.” Yes indeed, Saint Ray himself thought that the image on the Shroud was made of toast!\n\n","date":"October 31, 2014 at 7:14 pm","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","id":"comment-167394","author":"Hugh Farey","site":"shroudstory"},{"title":"Those Dark Specks in the Mark Evan’s Photographs","post":"We have discussed the matter of aragonite previously.\nThe references I recorded were:\nhttp://www.factsplusfacts.com/travertine.htm\nhttp://holyshroudguild.org/ceacutesar-barta.html\nThere are also other references I previously canvassed.\nThe holyshroudguid site includes extracts from a letter from Nitowski to Fr Otterbein.  She refers to a tomb, another ref says from the Damascus Gate area, likely they refer to the same site.\nThe spectra by Kohlbeck show some slight variation, but it seems that one of the Shroud tapes used was also contaminated by Shroud fibres which could not be removed from the sample.\nThe Gilberts identified the Shroud image sites as soles of both feet, nose, left knee-cap.\n\n","date":"October 31, 2014 at 11:27 pm","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","id":"comment-167449","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Those Dark Specks in the Mark Evan’s Photographs","post":"Thanks, Daveb. The reason I asked was simply because I too have these sources. The original Kohlbeck/Nitowski article does not refer to any other limestone samples than “from inside tombs in the general vicinity of Jerusalem.” The letter to Fr Otterbein says: “Limestone samples were collected from as far south as 30 miles from Jerusalem to as far north as the Galilee and Mt. Carmel … From as close as 30 miles from Jerusalem, the limestone changes and does not match either Jerusalem or the Shroud of Turin.” Later, she does indeed list nine different samples sites, and says that the other eight are all different from the Jerusalem/Shroud samples. She does not say if they were tested, but a geological map of Israel shows the extent of the Turonian limestone upon which Jerusalem is built, and her inference is fair enough. Turonian limestone is, however, fairly common throughout the world.\nI don’t know where you got the Gilberts identification from. Their sample plan shows that they did not look at either of the knee-caps, and only the instep of one foot. They did look at the nose. Kohlbeck says his sample came from Rogers tape sample 1AB (which is actually slightly to the side of the heel). The STuRP team did take samples from the right heel (1DB) and right kneecap (2CF), but not the left heel, left kneecap or nose. The plan of the sample sites can be found on the internet, but I’m taking this from the photos on the dustjacket of McCrone’s Judgment Day for the Shroud of Turin.\n\n","date":"November 1, 2014 at 6:09 am","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","id":"comment-167579","author":"Hugh Farey","site":"shroudstory"},{"title":"Those Dark Specks in the Mark Evan’s Photographs","post":"Methinks  it’s now time to keep my own counsel where current lines of investigation are concerned. I shall now be reporting at more infrequent intervals.\nPlease don’t be offended if your further comments receive no answer.\n\n","date":"October 31, 2014 at 2:45 pm","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","id":"comment-167336","author":"Colin Berry","site":"shroudstory"},{"title":"Those Dark Specks in the Mark Evan’s Photographs","post":"Here’s a quick experiment anyone can do. Set your fan oven at home to 150 degrees Celsius, with circulating air but no grill settings. When it’s come up to temperature, insert a slice of white bread. Come back 15 or 20 minutes later. The slice will be crisp and stiff as a board but will NOT be toasted.\nNow repeat my mistake, which was to place the ‘board’ in one of your electric toaster slots and a control slice in the other. Go away for a few minutes, become preoccupied with other matters. Then hear your smoke alarm go off, return to your kitchen where you will find nicely-golden-brown toast in the control slot, and a slab of charcoal in the other (assuming you can see through the dense smoke).\nNo kinetics or thermodynamics are needed to understand this system. Maillard reactions at or close to ordinary environmental temperature are an entirely different matter. \nWhat one cannot do (anoxie please note) is to extrapolate back from ‘high temperature’ toasting to low-temperature yellowing, i.e. the sort  that takes days or weeks to become visible, and expect things to be much the same, just a bit slower.The reaction pathways are not the same, and the system is highly influenced by thermodynamic as well as kinetic considerations. See the Dutch paper cited earlier where he warns that the reaction can turn back on itself, regenerating the amino groups, and then fail to produce ANY yellowing. \nNope, it’s not rocket science,  s already pointed out, but is the kind this science bod once taught as Head of Chemistry up to University entrance level. (having two years earlier  introduced the Nuffield A-Level Chemistry course to the first cohort of sixth-formers at a new and rapidly growing independent school in NW London). There’s a certain old saying about grandmothers and eggs that springs to mind.\n\n","date":"November 1, 2014 at 7:26 am","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","id":"comment-167600","author":"Colin Berry","site":"shroudstory"},{"title":"Those Dark Specks in the Mark Evan’s Photographs","post":"The geology of Jerusalem is mapped at http://www.geology-israel.co.il/WEB%20PAGE/JERUSALEM-SE.HTML, with a key at http://www.geology-israel.co.il/WEB%20PAGE/MAP-21.HTML. The Dome of the Rock and Holy Sepulchre are situated on a ridge of Turonian limestone (calcium carbonate). The geology of Lirey is mapped at http://eusoils.jrc.ec.europa.eu/EuDASM/FR/fran_x1.jpg. It is situated on a band of Turonian chalk (calcium carbonate). The Turonian stratum is named after Touraine, an area south of Paris. Less than 30km from Lirey to the east are the Jurassic limestones caves of Champagne. A page in the website of the Speleo Club Aubois (Troyes Caving Club: http://www.sport-troyes.com/associations/speleo-club-aubois,125.html?&page=3), says: “Caves are the result of chemical attack on limestone. Rainwater, which has added carbon dioxide from the atmosphere … becomes corrosive. By seeping into fractures in the rock, the water creates conduits … The saturated water then releases its excess carbon dioxide as it seeps from the ceiling or walls of the caves. Carbonates precipitate as calcite or aragonite stalactites to produce stalactites, stalagmites and other shapes.”\nIt’s all very suggestive. Here’s a hypothesis for Kohlbeck and Nitowski to test: The aragonite found on the Shroud is identical to aragonite found in abundance within 50km of the place where the Shroud is first known to have been exhibited!\n\n","date":"November 1, 2014 at 10:20 am","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","id":"comment-167634","author":"Hugh Farey","site":"shroudstory"},{"title":"Those Dark Specks in the Mark Evan’s Photographs","post":"Reblogged this on Best of Shroud Story.\n\n","date":"November 6, 2014 at 3:18 pm","url":"https://shroudstory.com/2014/10/31/those-dark-specks-in-the-mark-evans-photographs/","cat":"image_theory","id":"comment-169328","author":"Dan","site":"shroudstory"}]
