[{"title":"Those Gee Whizz Radiation Models","post":"In the last paragraph quoted above, is it possible that Colin may have dropped a hint unlocking the key? \n“Intense sources, e.g from a laser, may simply target a trace component that wouldn’t normally  be sufficiently energized to produce  coloration. Trace components of linen that come to mind as normally overlooked  chromophores, but more readily energized molecule for molecule than cellulose, would be lignin and other phenolics with aromatic ring structures, absorbing moderately in the blue end of the visible spectrum and the near UV.” \nWas it not UV that Di Lazzaro et al used to produce their coloration?  \nThe main components of linen are cellulose and hemi-cellulose.  About 4% is lignin and 2% other components.  For a comprehensive paper on the chemistry of linen see: “Linen Most Useful: Perspectives on Structure, Chemistry, and Enzymes for Retting Flax”  by Danny E. Akin:\nhttp://www.hindawi.com/journals/isrn/2013/186534/\nHowever I saw nothing there mentioning vanillin, another possible UV target. \nAdd in a few comments from a recent post on 3D scanning, on light interference with reinforcment / cancellation of individual waves, and we might just about be there.  But why are only the crowns affected?\n\n","date":"July 18, 2015 at 3:48 pm","url":"https://shroudstory.com/2015/07/18/those-gee-whizz-radiation-models/","cat":"image_theory","id":"comment-206098","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Those Gee Whizz Radiation Models","post":"‘But why are only the crowns affected?’\nThere is a good clue in the STURP Physics and Chemistry Report of 1982. As is well known there was no art historian on the STURP team but they did ask one, J. Drusik of the Los Angeles County Museum of Art, for advice:\n‘He suggested that if the large calcium concentrations [ as found by STURP] had been present in the cloth before the image was formed, it might be expected that it would have buffered certain types of reactions and, thereby, assisted in confining the discoloration to the tops of the thread crowns.’ \nThis makes good sense. The discoloration of the linen took place underneath the calcium carbonate. I wish Drusik had been questioned further as he probably had the solution to the image formation. N.B. Calcium carbonate is the main ingredient of the gesso with which a linen cloth is sealed before painting is placed on top.\n\n","date":"July 19, 2015 at 2:33 am","url":"https://shroudstory.com/2015/07/18/those-gee-whizz-radiation-models/","cat":"image_theory","id":"comment-206127","author":"Charles Freeman","site":"shroudstory"},{"title":"Those Gee Whizz Radiation Models","post":"Charles\nI’m not convinced either way that there is real blood on the Shroud so lets assume for a minute is was painted like the rest of the image as per your proposal. If it is paint than why didn’t it fade like it rest of the paint? Isn’t one of the problem is that it’s a lot brighter than what real blood would be? How do you explain that?\n\n","date":"July 19, 2015 at 7:16 am","url":"https://shroudstory.com/2015/07/18/those-gee-whizz-radiation-models/","cat":"image_theory","id":"comment-206142","author":"John Green","site":"shroudstory"},{"title":"Those Gee Whizz Radiation Models","post":"Wh at you havE now, as Drusik suggested, is discolouration (and this is the best way to describe the images) on the top fibrils. One piece of evidence for this is that the limits of the discolouration are not clear which is why you have problems in taking measurements of the body. So you have to explain how the linen became discoloured. The best hypothesis is that This is not a question of paint fading but disintegrating  leaving  the discolouration behind where the painted and gessoed surface once covered it. There is s nothing in the STURP paper that disagrees with this- unlike Drusik, doubtless a professional in his own field, they did not imagine that there was a painted surface which had once been there but which had now vanished. It does pay to have an art historian – but having said that De Wesselow did not spot it either!\n\n","date":"July 19, 2015 at 8:11 am","url":"https://shroudstory.com/2015/07/18/those-gee-whizz-radiation-models/","cat":"image_theory","id":"comment-206147","author":"Charles Freeman","site":"shroudstory"},{"title":"Those Gee Whizz Radiation Models","post":"“it’s a lot brighter than what real blood would be?” We must avoid being led astray by inaccurate descriptions. The blood on the Shroud is not bright at all. It has mostly disappeared and is not easily distinguishable from the rest of the image. Under close scrutiny, it appears pink rather than pale sepia, which is what we might expect old, flaked off, bloodstains to look like.\n\n","date":"July 19, 2015 at 8:39 am","url":"https://shroudstory.com/2015/07/18/those-gee-whizz-radiation-models/","cat":"image_theory","id":"comment-206150","author":"Hugh Farey","site":"shroudstory"},{"title":"Those Gee Whizz Radiation Models","post":"Ok, I believe there was a debate here on that issue, but I believe you saw it in person so that solves that issue for me.\n\n","date":"July 19, 2015 at 9:05 am","url":"https://shroudstory.com/2015/07/18/those-gee-whizz-radiation-models/","cat":"image_theory","id":"comment-206153","author":"John Green","site":"shroudstory"},{"title":"Those Gee Whizz Radiation Models","post":"Extract from “THE SHROUD FABRIC AND THE BODY IMAGE: CHEMICAL AND PHYSICAL CHARACTERISTICS” by ALAN D. ADLER\nhttp://www.shroud.com/pdfs/ssi43part11.pdf  p.120 … \n“Twenty-two different types of microchemical spot tests for 17 different common metallic elements that could be conjectured to be involved in the formation of images on the Shroud were checked against chemical controls and also checked for possible interferences and then applied to the sample objects and any appropriate linen controls as well. All the types of Shroud fibers gave positive tests for only two elements, calcium and iron. However, these elements do not derive from the presence of iron oxides or calcium carbonates on the fibers in a binder, as positive tests are obtained without the need for prior acidic digestion. Therefore these elements can be considered as being coordinately covalently bound to the linen’s cellulosic structure. Other samples of old linens (and even modern “craft” linens) show the same type of results. Therefore the presence of these elements can be ascribed to chemistry arising during the manufacture of linen from flax, e.g., the retting process being carried out in naturally occurring ‘hard’ waters. Since these tests are ubiquitous and uniform for both body image and non-body image fibers, it demonstrates that the body image chromophore cannot be ascribed to the presence of a metallic element. It should be noted that none of the trace elements associated with iron of a mineral origin were detected.”  \nConclusive proof that the calcium present has nothing whatsoever to do with an applied gesso coating, but is directly associated with the retting process during extraction of the linen from the flax! \nGIVE IT UP, CHARLES!!\n\n","date":"July 19, 2015 at 3:13 am","url":"https://shroudstory.com/2015/07/18/those-gee-whizz-radiation-models/","cat":"image_theory","id":"comment-206130","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Those Gee Whizz Radiation Models","post":"No one has argued that the calcium carbonate was a binder- as the medieval manuals made clear you needed just to lay it on top of the fibres. This seems to be where STURP found the calcium. It fits the medieval manual instructions.\nIf STURP wants to be taken seriously it needs to show that the tests can be replicated. That is the basis for all science and explains why STURP has never been taken seriously by the wider academic community.\nHas anyone ever produced an old linen that has t he same pattern of iron oxide as the shroud has? I doubt it but I am ready to be convinced!\n\n","date":"July 19, 2015 at 8:17 am","url":"https://shroudstory.com/2015/07/18/those-gee-whizz-radiation-models/","cat":"image_theory","id":"comment-206148","author":"Charles Freeman","site":"shroudstory"},{"title":"Those Gee Whizz Radiation Models","post":"“… you needed just to lay it on top of the fibres. This seems to be where STURP found the calcium. … ”  Absolutely False!  Adler makes it clear enough!  Thus: “Therefore these elements ( Ca & Fe) can be considered as being coordinately covalently bound to the linen’s cellulosic structure.”   \nAnyone who has a smidgeon of elementary chemistry knows what “coordinately covalently bound” means.  The Ca and Fe was chemically bound to the cellulose.  It could only have occurred through hydration during the retting process, because apparently the retting pools must have had significant concentrations of calcium.  No evidence of free calcium as a residue of gesso has been noted as found anywhere in the interstices of the weave.  \nWe have yet to see an explanation of Charles, or from any of his elusive chemistry acquaintances, how his notional paint can penetrate a layer of his notional gesso, leaving nought but an image stain, oxidising the fibres, but with no observable residue of its metallic components.  The obvious answer is that there never was any such paint!   \nAny such small residues of calcium dust or other debris that might be present, can easily be explained as either from laying the cloth on a limestone slab, or from falling ceiling fragments while the cloth was exposed in a room, or from painted copies during their “sanctification” by contact with the original, of which Adler says some four dozen are known.  Alternatively, as previously noted, the presumably human template made contact with a limestone environment such as by a fall.\n\n","date":"July 19, 2015 at 9:11 pm","url":"https://shroudstory.com/2015/07/18/those-gee-whizz-radiation-models/","cat":"image_theory","id":"comment-206183","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Those Gee Whizz Radiation Models","post":"I think daveb may be right, but it’s only fair to point out that John Heller, Walter McCrone Roger Morris, and Gerald Lucotte reported finding limestone ‘dust’ on the Shroud tapes (or hoovering) taken from the 1978 sampling. Being fairly loose, it was not collected in the preparations of the fibrils for microscopic testing (any more than the insect fragments or flyash), and therefore not specifically tested. If the Shroud has spent any time lying between a body and a limestone shelf, it’s hardly surprising it’s got limestone on it, so finding it is not in itself justification of Charles’s gesso, but I don’t think daveb’s conclusive proof is quite as conclusive as he says.\n\n","date":"July 19, 2015 at 4:16 am","url":"https://shroudstory.com/2015/07/18/those-gee-whizz-radiation-models/","cat":"image_theory","id":"comment-206133","author":"Hugh Farey","site":"shroudstory"},{"title":"Those Gee Whizz Radiation Models","post":"Tell Alan Adler that it’s not conclusive, Hugh.  I’ve already just commented on your recent remarks concerning McCrone’s findings elsewhere.  By the way, check out McCrone’s work on the Vinland map!  Yes there is calcium dust present on the cloth, specifically on the soles of the feet, the nose, and a knee;  it’s called “travertine aragonite limestone” and Colin’s model coated with flour paste and whatever else didn’t pick it up wandering through the Troyes caves on his way to the artist’s studio!\n\n","date":"July 19, 2015 at 5:13 am","url":"https://shroudstory.com/2015/07/18/those-gee-whizz-radiation-models/","cat":"image_theory","id":"comment-206137","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Those Gee Whizz Radiation Models","post":"I’m certain Al Adler would agree with me, as I agree with him, if he were able to respond. Any limestone dust associated with the Shroud is sufficiently disassociated with the fibres themselves not to have been included in the careful preparations of individual fibres he and Heller made. Their finding of calcium integral to the manufacture of the Shroud neither supports nor refutes the presence of other limestone elsewhere. The tiny fraction of the limestone which is aragonite is irrelevant in this context.\n\n","date":"July 19, 2015 at 7:01 am","url":"https://shroudstory.com/2015/07/18/those-gee-whizz-radiation-models/","cat":"image_theory","id":"comment-206140","author":"Hugh Farey","site":"shroudstory"},{"title":"Those Gee Whizz Radiation Models","post":"Off topic, Dan, if you go to a website earthfiles.com and scroll down until you see a picture of a very complex, beautiful crop circle that was just recently formed outside of Torino, Italy. Its the second crop circle, not the first one as you scroll down. The article mentioned the Shroud of Turin.  I thought maybe there’s a correlation between the shroud and the crop circles. Laser? Radiation? Plasma?  I just find it interesting. No one has been able figure out how the circles were form. Same as the shroud.\n\n","date":"July 19, 2015 at 8:34 am","url":"https://shroudstory.com/2015/07/18/those-gee-whizz-radiation-models/","cat":"image_theory","id":"comment-206149","author":"don","site":"shroudstory"},{"title":"Those Gee Whizz Radiation Models","post":"“No one has been able figure out how the circles were formed.” Er. No.\n\n","date":"July 19, 2015 at 8:46 am","url":"https://shroudstory.com/2015/07/18/those-gee-whizz-radiation-models/","cat":"image_theory","id":"comment-206151","author":"Hugh Farey","site":"shroudstory"},{"title":"Those Gee Whizz Radiation Models","post":"typo Hugh, sheesh\n\n","date":"July 19, 2015 at 9:01 am","url":"https://shroudstory.com/2015/07/18/those-gee-whizz-radiation-models/","cat":"image_theory","id":"comment-206152","author":"don","site":"shroudstory"},{"title":"Those Gee Whizz Radiation Models","post":"“The First Law of Photochemistry states that light must be absorbed for photochemistry to occur. This is a simple concept, but it is the basis for performing photochemical and photobiological experiments correctly. If light of a particular wavelength is not absorbed by a system, no photochemistry will occur, and no photobiological effects will be observed, no matter how long one irradiates with that wavelength of light.\nAnyone proposing a radiation-based theory MUST  (a) state the wavelength of the radiation and (b) the chemical species (chromophore) that is capable of absorbing that particular wavelength.”\n – God is not bound by the “Laws of Nature”, he created them. So simply said, the Laws do not or may not  apply and if so science cannot replicate the image formation.\nJust a thought. : )\nRon\n\n","date":"July 19, 2015 at 10:53 am","url":"https://shroudstory.com/2015/07/18/those-gee-whizz-radiation-models/","cat":"image_theory","id":"comment-206157","author":"Ron","site":"shroudstory"},{"title":"Those Gee Whizz Radiation Models","post":"I see that here people talk about the Laws of Light.\nHowever it seems that after that you don’t take seriously into account\nthe proper Laws of Physics and Chemistry with respect the problems\nof Photochemistry and Applied Spectroscopy…\nBut now I want to digress a bit to lighten my sad severity …\n>We can obtain valuable information about the structural formula\nof an unknown compound by inspecting its molecular formula.\n>In addition to learning the number of atoms of C, H, N, and so forth\nin a molecule of the compound, we can determine what is called\nits Index of Hydrogen Deficiency (IHD), which is the sum of the number\nof rings and pi bonds in a molecule. …\nIndex of hydrogen deficiency = (H reference – H molecule) / 2\nSo, the Index of hydrogen deficiency (IHD) is the sum\nof the number of the rings and pi bonds in a molecule\nthat can be determined comparing the number of hydrogens\nin the molecular formula of a compound of unknown\nstructure with the number of hydrogens in a reference\ncompound with the same number of carbons atoms\nand with no rings or pi bonds.\nSee also the IR spectra (and ATR-FTIR spectra) and\nthe molecular formulas.\nWell, now we can guess something more about what can be\nan “Index of knowledge deficiency”…\n>… From the time of Rome’s establishment, it was customary to create death masks, taking wax impressions of the faces of Rome’s deceased elite. The Greek historian Polybius wrote of Roman funeral rites, so singular to the Hellenic eye, in which the death masks, carefully preserved for generations, would be paraded by descendants in the funeral procession. It was perilously close to ancestor worship and fraught with political meaning for in honoring a lineage of virtuous public service, the funeral procession served to remind Romans of an inheritance that made one fit to govern. It is significant that the masks preserved how a person really looked rather than how he wished to be seen. In that manner, “the brittle creaturality” of the human person, with all his flaws and imperfections, was preserved. …\nLink:\nhttp://www.classicist.org/programs/collections/historic-plaster-cast/catalogue/roman/030-010-003/\n>Chicago – Some 2,000 years ago, elite Roman families stuffed their closets with wax masks made in the likeness of their male ancestors so that during funeral processions actors could fill in for the missing links of the genealogical line.\n>Scholars know about the strange practice from ancient sources, such as the Greek historian Polybius, though none of the masks themselves survive.\n>Recently, however, a team of researchers at Cornell University made life-cast molds of their own faces to recreate these imagines maiorum, and they found that the wax masks were indeed uncannily lifelike.\n[See Images of the Roman Wax Masks]\nLinks:\nhttp://www.livescience.com/42334-lifelike-roman-wax-masks-recreated.html\nhttp://www.livescience.com/42335-photos-lost-roman-masks-recreated.html\nTherefore I suggest to Charles and Colin to run (as a possible\nand useful entertainment) some experiments starting from\nthe proper use of wax masks…\n\n","date":"July 21, 2015 at 11:45 am","url":"https://shroudstory.com/2015/07/18/those-gee-whizz-radiation-models/","cat":"image_theory","id":"comment-206287","author":"piero","site":"shroudstory"}]
