[{"title":"Thoughts for a Sunday Morning: “If I am right, then . . . I am right.”","post":"The mystery wrapping the Holy shroud is multi-dimensional. As debated, it can be either man-made or natural. Any theory which attempts to untie the knots should invariably explain all the unique characteristics hitherto identified by scientists like photographic negativity, 3-dimensional encryption of light intensity, anatomical exactitude etc. If the hands of a faker are assumed, then such theories should unequivocally explain how  could the faker have envisioned the idea of ‘negative image’ or a painting with reverse shade, and executed it as back as in the 14th century? How could he have incorporated the image intensity versus distance correlation into the Shroud image? How could he have ensured that the impression of the image did not penetrate a depth less than 1/100th of a hair?   How could he have been able to bring in the X-ray effect amazingly in the case of hands, where one could easily observe metacarpal bones and phalange bones of each finger?  What could have made the pollens grains, endemic to Palestine region, appear on the Shroud? Who could have brought the samples of limestone on the Shroud from Jerusalem? And, as Stevenson commented, if the Shroud was a creation of the Middle Ages, then its forger must have ordered the mites to go with it!\n    The painting theory of McCrone may be, as he believes, able to prove that the bloodstains on the Shroud do not relate to human or that they are not blood at all. But he should not close his eyes to other perspectives of the problem. It requires a holistic view, comprehensive analysis and a complete package of solutions. Any attempt to pick out a single characteristics and to solve it without considering the connected facts will not be good. It is like the description of an elephant by four blind men. One grasps the trunk and concludes it is a snake. Another explores one of the elephant’s legs and describes it as a tree. Third finds the elephant’s tail and announces it is a rope. And the fourth blind man, after discovering the elephant’s side, concludes that it is, after all, a wall!\n\n","date":"February 6, 2011 at 1:10 pm","url":"https://shroudstory.com/2011/02/06/thoughts-for-a-sunday-morning-if-i-am-right-then-i-am-right/","cat":"image_theory","id":"comment-2402","author":"Chidambaram Ramesh","site":"shroudstory"},{"title":"Thoughts for a Sunday Morning: “If I am right, then . . . I am right.”","post":"Prof. McCrone claims to be familiar “with pigments, media and artist’s paintings”.\nHe is a real expert unlike all others.\nAt this point why do not recall that in 1997 McCrone declared “100 percent unadulterated Rembrandt” some chips from paintings that after subsequent tests were found as fakes?\nhttp://pqasb.pqarchiver.com/bostonherald/access/18373418.html?FMT=ABS&FMTS=ABS:FT&date=Oct+15%2C+1997&author=Tom+Mashberg&pub=Boston+Herald&edition=&startpage=004&desc=Art+expert+says+paint+chips+are+Rembrandt%27s+-+Analysis+could+aid+return+of+Gardner+paintings\nhttp://articles.latimes.com/1997/dec/06/news/mn-61112\n\n","date":"February 7, 2011 at 3:17 am","url":"https://shroudstory.com/2011/02/06/thoughts-for-a-sunday-morning-if-i-am-right-then-i-am-right/","cat":"image_theory","id":"comment-2406","author":"domenico","site":"shroudstory"},{"title":"Thoughts for a Sunday Morning: “If I am right, then . . . I am right.”","post":"The world needs people like McCrone to remind us that science is not an exact science.\n\n","date":"February 7, 2011 at 6:57 am","url":"https://shroudstory.com/2011/02/06/thoughts-for-a-sunday-morning-if-i-am-right-then-i-am-right/","cat":"image_theory","id":"comment-2407","author":"B&B","site":"shroudstory"},{"title":"Thoughts for a Sunday Morning: “If I am right, then . . . I am right.”","post":"– It seems to me that\n1. The “DIRECT” evidence – the unofficial, but highly probable, history of the Shroud, as well as the vast majority of scientific testing that’s been done on the Shroud – greatly supports Shroud authenticity…\n2. The evidence against (as illustrated(?) by McCrone’s attitude/approach in his emails to Marino) is actually much weaker than the “ANALYTIC” — but casual — reader will generally assume.\n3. It is the “INDIRECT” evidence that causes the analytic reader to insist that the Shroud is fake.\n4. (Ironically enough, analytic readers tend to place too much FAITH in Sherlock Holmes. They believe that they have “eliminated the impossible” (the supernatural), and consequently believe that we are stuck with fakery — “however improbable” such a conclusion is, given the DIRECT evidence. See what I mean?)\n5. I have a way to expose these analytic, but wrong-headed, readers to the world, and SHOW the world that the Shroud probably is the authentic burial cloth of Jesus.\n6. This would be a very good thing.\n– If I can get anyone interested, I’ll be happy to go on.\n\n","date":"February 7, 2011 at 10:35 am","url":"https://shroudstory.com/2011/02/06/thoughts-for-a-sunday-morning-if-i-am-right-then-i-am-right/","cat":"image_theory","id":"comment-2408","author":"Jabba","site":"shroudstory"},{"title":"Thoughts for a Sunday Morning: “If I am right, then . . . I am right.”","post":"– I still don’t understand this blogging stuff, but apparently SOMEone (I assume Epscopalian?) was interested in what I had to say, so I’ll continue. (I probably would have continued anyway…)\n– Anyway, I think that I know how to set this particular record straight on a world-wide basis, and that that would be a very good thing.\n– I’m not sure that the Shroud is authentic, but I sure THINK that it is, and that the VAST PREPONDERANCE of evidence supports that authenticity.  I think that all the skeptics have to offer is highly suspect: Walter McCrone, Joe Nickell, the radio carbon dating and misled elimination of the supernatural. (Not that the supernatural is necessarily involved (or even real), just that the skeptics aren’t taking any chances.)\n– Anyway, what we need in order to set this record straight on a world-wide basis is VERY public and EFFECTIVE debate between 2 leaders of the field.\n– This of course, would be on-going, on-line and written (certainly, not oral).\n– By my calculations, there are two real ‘tricks’ involved in doing this:\n1) Getting a leading skeptic to participate. And even more difficult,\n2) Making the debate EFFECTIVE! (When was the last time you read or listened to an effective debate?)\n– This will sound rather foolish, but … I THINK THAT I HAVE A WAY TO ACCOMPLISH BOTH.\n– I’ll be back.\n\n","date":"February 8, 2011 at 12:23 pm","url":"https://shroudstory.com/2011/02/06/thoughts-for-a-sunday-morning-if-i-am-right-then-i-am-right/","cat":"image_theory","id":"comment-2418","author":"Jabba","site":"shroudstory"},{"title":"Thoughts for a Sunday Morning: “If I am right, then . . . I am right.”","post":"– I’m coming here because I need help with my plan.\n\n","date":"February 8, 2011 at 12:25 pm","url":"https://shroudstory.com/2011/02/06/thoughts-for-a-sunday-morning-if-i-am-right-then-i-am-right/","cat":"image_theory","id":"comment-2419","author":"Jabba","site":"shroudstory"},{"title":"Thoughts for a Sunday Morning: “If I am right, then . . . I am right.”","post":"– However improbable this may sound … I think that I have a way to expose the foolishness of Shroud skeptics to the world.\n– And again, I think that would be a very good thing.\n– Since I think that the vast preponderance of evidence favors Shroud authenticity, I think that all we need do is develop EFFECTIVE and VERY public debate with one (or more) members of the skeptical leadership.\n– But then, actually effective debate hardly ever happens…\n– I claim that there are two basic reasons for the typical ineffectiveness of debate:\n1) We humans are not nearly as smart, as objective or as conscious as we think we are.  And,\n2) Controversial issues tend to be “exponential.”\n– Put these together and we humans are almost always given to going in circles when debating.\n– (I’ve written several (unpublished) treatises on this problem.  To see one of them, you can go to http://messiahornot.com/Treatise.php.)\n– Luckily, I think that we can ignore the first problem for now, and focus exclusively on how to deal with the complexity of our controversies. \n– By “exponential,” I’m referring to the tendency for\n1) The basic controversial issue to have multiple sub-issues.  For,\n2) Each sub-issue to have multiple sub-sub-issues.  And,\n3) Etc.\n– And then, human reflexes simply were not designed to deal with this complexity.\n– Once into a debate, we “zone out” and slip into a fight/flight mode, where our awareness and objectivity go to Hell.  Consequently, we need to extract debate from our natural reflexive handling of it…\n– In other words, we need to “wake up.”  We need to slow down and “zoom in.”  We need to muster our patience and keep narrowing our foci.\n– The rest is easy – albeit, possibly quite tedious.\n– If anyone else is still reading this crap (just kidding), I should probably give you a breather.\n– But, I’ll be back.\n\n","date":"February 9, 2011 at 11:25 am","url":"https://shroudstory.com/2011/02/06/thoughts-for-a-sunday-morning-if-i-am-right-then-i-am-right/","cat":"image_theory","id":"comment-2424","author":"Jabba","site":"shroudstory"},{"title":"Thoughts for a Sunday Morning: “If I am right, then . . . I am right.”","post":"– That was a long breather.\n– Sorry — it took me awhile to figure out where I could find my last post (above).  I’m an old dog and a slow learner.\n– Anyway, the basic idea is to try to get Joe Nickell, or someone else representing the Skeptical Enquirer, to debate with you (and the rest of us) on line, in writing, in real time.\n– If you know of other prominent “shroudoclasts,” we could try them — if Joe and the Enquirer didn’t accept our invitations.\n– We would have just one spokesperson, but a lot of knowledgable consultants. And consequently, out of our antagonist we should knock the crap.  (Sorry about my language.)\n– As you know, I think that their side of the story is really very weak, and showing just how weak it is should be a cinch — GIVEN AN ACTUALLY EFFECTIVE DEBATE.  Then, whatever website (or blog) would host this debate would soon become where parties interested in hearing both sides of the Shroud controversy would be sent.  And soon, the whole world would know the truth (IMO).\n– We could start with just a small piece of the controversy — say, “Is there real blood in all the right places?” \n– Again, I’ve written several unpublished treatises on this debate idea.  You can find one of those at http://messiahornot.com/Treatise.php.\n– Please make a comment, or ask a question.\n– Thanks, again.\n\n","date":"February 14, 2011 at 12:46 pm","url":"https://shroudstory.com/2011/02/06/thoughts-for-a-sunday-morning-if-i-am-right-then-i-am-right/","cat":"image_theory","id":"comment-2459","author":"Jabba","site":"shroudstory"}]
