[{"title":"Thoughts on the thoughts on the newly published paper by Ray Rogers","post":"HAS ANYONE, WILL ANYONE CONSIDER THAT THE IMAGE WAS MADE BY: E=MC2  ???\n   MATTER BEING TRANSFERRED BACK INTO ‘ENERGY’??????\n\n","date":"September 6, 2013 at 12:57 am","url":"https://shroudstory.com/2013/09/05/thoughts-on-the-thoughts-on-the-newly-published-paper-by-ray-rogers/","cat":"image_theory","id":"comment-43048","author":"Henry Engelhart","site":"shroudstory"},{"title":"Thoughts on the thoughts on the newly published paper by Ray Rogers","post":"The problem with E = M.c^2 is the enormous amount of energy it releases. In nuclear power plants I understand that the rate of the reaction is controlled such as by inserting carbon rods into the reactor, and avoids the onset of the chain reaction which occurs in an uncontrolled nuclear explosion. So matter is only slowly converted into energy over the long life of the power plant. If we postulate that the mass of Christ’s human body was completly converted into energy over the brief interval of time during the Resurrection event, then a large amount of energy would have been released.  The suggestion has been raised on this site before by another correspondent. I don’t recall how many Giga- or Tera-Joules were calculated exactly, but it seems it would have devastated the city of Jerusalem and a fair bit of Palestine. Such an event would not have gone unnoticed at the time, but no-one seems to have recorded it, not even Josephus nor the evangelists. \nNow as it is a scientific doctrine that matter = energy can neither be created nor destroyed, we must look for another explanation. My personal preference, is that Resurrection comprises translocating the matter into a parallel universe, which might under special circumstances occasionally intersect our own.  This would seem to be in accord with the theological doctrine that Christ’s resurrection included not only his spirit but also his body, in whatever form that body might have been.  This also seems to be in accord with St Paul’s teaching on the general resurrection at the end of time. “We will be changed!”  \nProfessor Fanti has suggested from his trials with lasers, that the image may have been formed by some kind of corona discharge.  However it seems that very few others of his professional colleagues are prepared to agree with this theory.\n\n","date":"September 6, 2013 at 7:00 am","url":"https://shroudstory.com/2013/09/05/thoughts-on-the-thoughts-on-the-newly-published-paper-by-ray-rogers/","cat":"image_theory","id":"comment-43062","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Thoughts on the thoughts on the newly published paper by Ray Rogers","post":"“I believe in the God of Spinoza…”Einstein wrote to the rabbi in New York who wanted to know if he believed in a deity. But Spinoza’s god was not the God of the Bible, therefore he was excommunicated by the synagogue. Spinoza’s god was all the energy and matter in the universe, the substance underlying all of existence. Actually the Portuguese Jewish philosopher was not that original and may have read something of the sort in ancient literature but gave it a different slant.\n\n","date":"September 6, 2013 at 5:14 pm","url":"https://shroudstory.com/2013/09/05/thoughts-on-the-thoughts-on-the-newly-published-paper-by-ray-rogers/","cat":"image_theory","id":"comment-43095","author":"Louis","site":"shroudstory"},{"title":"Thoughts on the thoughts on the newly published paper by Ray Rogers","post":"Louis, I’m not sure about the accuracy of some of your conclusions here. I’d be inclined to think that Einstein’s specific beliefs in God were seldom ever well-formed and may have been subject to some flux. Possibly in his letter to the rabbi it was only his particular belief at the particular time, or perhaps he was merely seeking to be provocative. In his questioning comments on Quantum Mechanics, he refers to God as “The Old One”, and said that “God does not play dice!” which considering the probalistic nature of quantum mechaincs, is probably incorrect. Nevertheless it is suggestive of some kind of belief in a personal God. \nSpinoza was excommunicated from the Amsterdam synagogue in 1656, at about age 23, well before his philosophical ideas had fully developed. The reason for this dismissal seems to have been his generally unorthodox views. There was then in the 17th century a tendency and general mood for revolt against tradition and authority. Jewish leaders in Amsterdam were fearful that “heresies” might give offence in a country that did not yet regard the Jews as citizens. Spinoza had certainly not wanted a break from the synagogue. \nHe was then much influenced by Descartes, had a number of close Christian acquaintances, and is said to have been influenced by neo-scholasticism. It was not until the 1660s that he set to work on his “Ethics” and in 1670 he published his “Tractatus Theologico Politicus”. \nIf as you say Spinoza’s God comprised all the matter and energy in the universe, it would seem to be a particular type of pantheism.\n\n","date":"September 6, 2013 at 9:29 pm","url":"https://shroudstory.com/2013/09/05/thoughts-on-the-thoughts-on-the-newly-published-paper-by-ray-rogers/","cat":"image_theory","id":"comment-43117","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Thoughts on the thoughts on the newly published paper by Ray Rogers","post":"David, on my part I am not sure whether you understood my comments. The same can be said about your understanding of Einstein and Spinoza. Einstein knew what he was saying when he replied to Rabbi Herbert Goldstein and if he did not say “god” it was only because it was Hitchens who made this popular. Mind you, Einstein was totally against monotheism and believed that Buddhism was the religion of the future.  \nSpinoza denied personality and consciousness to God, he was a determinist, there was no room for a loving God caring for humanity, that being one of the reasons why he was admired by Nietzsche — who proclaimed the death of God. It does not matter when Spinoza was excommunicated by the synagogue because the community knew what was to come before he wrote his books, after reading ancient literature and rubbing shoulders with Christians who rejected traditional beliefs. He was no fool, he knew what would be the outcome of his views within the community, therefore his burial in a Christian cemetery, although he was neither Jew nor Christian.\nIf Einstein and Spinoza were here with us today and were inclined to pray they would, perhaps, join hands with Lüdemann — to pray to the universe.\n\n","date":"September 7, 2013 at 2:19 pm","url":"https://shroudstory.com/2013/09/05/thoughts-on-the-thoughts-on-the-newly-published-paper-by-ray-rogers/","cat":"image_theory","id":"comment-43188","author":"Louis","site":"shroudstory"},{"title":"Thoughts on the thoughts on the newly published paper by Ray Rogers","post":"This particular paper is one of the most infamous paper about the Shroud I have ever read because it is evident that the main goal of it is to support the personal supernatural hypotheses of image formation of Di Lazzaro and Fanti and that’s why they pushed the idea that the image chromophore was located in the primary cell wall of the linen fiber itself instead of being located in a thin layer of impurities located ON TOP of the fiber (including on top of the primary cell wall).  And why do they push this hypothesis, which is totally unable to offer a rational explanation for the very superficial aspect of the image, since there is a primary cell wall around each linen fiber of the cloth, no matter if this fiber is located on the top-most part of the cloth or more deeper inside it, and there is no good reason to assume that a particular primary cell wall should show a very different degree of thickness versus another one (which is a probable fact that seem to be, at first sight, much less able to explain the discontinous aspect of the body image than the uneven layer of impurities proposed by Rogers.\nThis particular paper is, in fact, an attempt made by Di Lazzaro, Fanti and others from the SSG to back-up their supernatural hypotheses, while they were perfectly aware of the fact described by Rogers, who sais that such high energetic processes are completely unable to produce a only color a thin layer of impurities that would be located on-top of the linen fibers without, at the same time, affecting the underlying linen fiber in a way that would be easy to detect for a specialist.  \nAnd here’s the most important thing to note:  Di Lazzaro and Fanti had already proposed their supernatural hypotheses regarding the Shroud many years before they wrote this paper to back-up their preconceived ideas with an attempt to make believe that the color would resides not the thin layer of impurities proposed by Rogers but in the primary cell wall of the linen fibers, which is something that goes against some of the most important observations coming from the Shroud (i.e. the ghosts of color extracted from the image fiber that left a clean and UNAFFECTED linen fiber behind along with the banding effect on the Shroud, which is most probably due to the fact that various batch of yarns had been bleached separately, thus leaving a various average amount of impurities on top of the fiber, including on top of the primary cell wall).  Finally, I don’t think this particular paper have considered the finding of some starch fractions on Shroud samples by McCrone (which were independently confirmed by Rogers later on) with enough care, because this is a very important finding that strongly support the impurity hypothesis of Rogers for the image chromophore against the primary cell wall hypothesis of Di Lazzaro, Fanti et al…\nTruly, the first time I read this paper, my blood boiled because it was easy for me to detect a high level of scientific dishonesty in it, linked with the high desire of Di Lazzaro and Fanti to make believe that their supernatural hypotheses could truly offer a valid explanation for the Shroud image.\n\n","date":"September 7, 2013 at 5:12 pm","url":"https://shroudstory.com/2013/09/05/thoughts-on-the-thoughts-on-the-newly-published-paper-by-ray-rogers/","cat":"image_theory","id":"comment-43193","author":"Yannick Clément","site":"shroudstory"},{"title":"Thoughts on the thoughts on the newly published paper by Ray Rogers","post":"I need to write again the first paragraph of my previous comment:\nAnd it should be noted that this hypothesis is totally unable to offer a rational explanation for the very superficial aspect of the image, since there is a primary cell wall around each linen fiber of the cloth, no matter if this fiber is located on the top-most part of the cloth or more deeper inside it, and there is no good reason to assume that a particular primary cell wall should show a very different degree of thickness versus another one (which is a probable fact that seem to be, at first sight, much less able to explain the discontinous aspect of the body image than the uneven layer of impurities proposed by Rogers).\nThat’s much better…\n\n","date":"September 7, 2013 at 7:09 pm","url":"https://shroudstory.com/2013/09/05/thoughts-on-the-thoughts-on-the-newly-published-paper-by-ray-rogers/","cat":"image_theory","id":"comment-43206","author":"Yannick Clément","site":"shroudstory"},{"title":"Thoughts on the thoughts on the newly published paper by Ray Rogers","post":"I’m tempted, Yannick style, to repost my final comment to “Thoughts on the newly published paper by Ray Rogers (REVISED),” which he has yet to reply to, but I will restrict myself here to saying that although I do not concur with di Lazzaro’s conclusions, I do not find his paper infamous or dishonest. What seems to boil Yannick’s blood is that di Lazzaro sees no evidence for a starch coating in discrete patches on the outermost fibres of one surface of the cloth, nor any reason why or how such a coating should have arrived there;  in contrast to St Raymond’s somewhat ill-explored idea that it might be due to an evaporation gradient, the shroud having been washed in some sort of starchy liquid for which there is neither historical evidence nor reason. In an earlier comment Yannick mentioned that Walter McCrone had identified starch on the shroud. I can’t find a reference to this in McCrone’s 1980 ‘Microscope’ Article, his 1990 ‘Accounts of Chemical Research’ paper, nor his book ‘Judgement Day for the Shroud of Turin.’ Oddly, Adrie Van der Heuven (in ‘Internal Selvedge in Starched and Dyed Temple Mantle’) does find a confirmation that McCrone found starch – but only in an article by Rogers!\n\n","date":"September 7, 2013 at 7:06 pm","url":"https://shroudstory.com/2013/09/05/thoughts-on-the-thoughts-on-the-newly-published-paper-by-ray-rogers/","cat":"image_theory","id":"comment-43205","author":"Hugh Farey","site":"shroudstory"},{"title":"Thoughts on the thoughts on the newly published paper by Ray Rogers","post":"Please read this Hugh: https://shroudstory.com/2013/09/04/thoughts-on-the-newly-published-paper-by-ray-rogers/#comment-43202\nI don’t think this will be enough to convince you, but anyway, I know I’m right about that.  I also know that this 2010 paper of Di Lazzaro and Fanti was done in a complete dishonest and unscientifc way.  Why?  Very simple:  remember what I said in my guess posting about the fact that Rogers, on the contrary to those guys, followed the correct steps of scientific research concerning the image by first looking to explain the image chromophore, while taking into account for this all the pertinent data and observations (that’s when he proposed his “impurity” hypothesis) and then (AND ONLY THEN), did he tried hard to find the most probable “catalytic compounds” that could have produced the very subtle, superficial and discontinuous coloration of the image. That’s when he first came out with the idea developed first by Pellicori of sweat and/or skin secretions and then, probably when he realized that the body of the Shroud man was most probably dry when he was laid in the cloth, he changed his mind and proposed a new hypothesis involving post-mortem gases (including ammonia gas) and probably a release of heat by the corpse, which would have produced a Maillard reaction (instead of a caramelization reaction) in the thin layer of impurities.\nOn the contrary to Rogers, Di Lazzaro and Fanti did exactly the opposite by first proposing a supernatural image formation based on their preconceive notion that the Resurrection of Christ must have release some form of energetic radiation and then (AND SADLY ONLY THEN), they proposed an hypothesis for the image chromophore that could fit with the testing they did on linen samples, while trying hard to discredit the “impurity” hypothesis of Rogers, for the evident reason that they became aware (most probably through their coloration tests on linen) that Rogers was right about the fact that they (or anyone else) would never be able to only color such a very thin layer of unstable impurities without affecting in an evident way the structure of the underlying linen fiber.\nThat’s why I consider their 2010 paper as being totally scandalous…  It’s like if Rogers would have obtained some interesting color results through coloration tests he would have done with post-mortem gases and a layer of impurities located on top of a sample of linen, and then, after he was sure of his result, he would have written a paper to back-up the idea that the image on the Shroud must be located in the same place than the chromophore of his coloration results.  If he would have done something like this, you can be sure that I would have criticize Rogers in the same way than I criticize Di Lazzaro and Fanti, because this would have been the wrong way to do Shroud research (or any other scientific research).\n\n","date":"September 7, 2013 at 7:28 pm","url":"https://shroudstory.com/2013/09/05/thoughts-on-the-thoughts-on-the-newly-published-paper-by-ray-rogers/","cat":"image_theory","id":"comment-43209","author":"Yannick Clément","site":"shroudstory"},{"title":"Thoughts on the thoughts on the newly published paper by Ray Rogers","post":"Ah, my apologies. Yannick has replied, while I was composing the above. However, I would still like to see whether McCrone actually found any starch or not, as I can find not reference to his doing so, and I would like to know what Heller and Adler used the iodine test for starch for, if they were not specifically looking for starch.\n\n","date":"September 7, 2013 at 7:13 pm","url":"https://shroudstory.com/2013/09/05/thoughts-on-the-thoughts-on-the-newly-published-paper-by-ray-rogers/","cat":"image_theory","id":"comment-43207","author":"Hugh Farey","site":"shroudstory"},{"title":"Thoughts on the thoughts on the newly published paper by Ray Rogers","post":"The reference for McCrone detection can be found in Rogers book and I even gave you a quote about that the other day:  “A search for carbohydrate impurities on the Shroud confirmed McCrone’s detection of some starch fractions. Starch and low-molecular weight carbohydrates from crude startch would color much more easily than would cellulose as a result of either thermal dehydration or chemical reactions.”  I don’t see any good reason to doubt Rogers’ honesty about that.\nConcerning Heller and Adler test, here’s my non expert guess:  They probably did a iodine test on colored fibers to detect if this coloration could have been produced by a starch-based painting media and they were not able to detect the presence of starch most probably because, in color area, the starch residues have been chemically changed by the image formation process.  If they would have done the same chemical test with some non-image fibers, we have to assume that they would have detect the same traces of starch that were detected by Rogers after 2000, while using the same kind of iodine test. \nIt’s too bad Rogers is not here to set the record straight on this question of starch detection but I would be surprise if I’m very far from truth.\n\n","date":"September 7, 2013 at 7:39 pm","url":"https://shroudstory.com/2013/09/05/thoughts-on-the-thoughts-on-the-newly-published-paper-by-ray-rogers/","cat":"image_theory","id":"comment-43212","author":"Yannick Clément","site":"shroudstory"},{"title":"Thoughts on the thoughts on the newly published paper by Ray Rogers","post":"One final and quite important comment on the whole issue of the paper published by Fanti et al. in 2010:  \nPeople should know this fact (believe me, I’m not making this up. It’s real and it’s very telling of the dishonesty of some Shroud researchers):  At the time this 2010 paper was published, I learned from a very reliable source (which I won’t tell the name) that Fanti (especially him while I don’t know for the other authors) was not willing at all to even mention Rogers’ impurity hypothesis as a possible explanation for the image chromophore and other authors of the paper (which I won’t tell the names) had to make some pressures on Fanti so that he finally was somehow “forced” to recognize Rogers’ hypothesis as being one possible solution for the image chromophore by including statements like these ones in the paper, while making sure to clearly put their personal hypothesis of the primary cell wall well ahead of Rogers’ hypothesis as the most probable solution for the image chromophore:\n1- Page 4: “According to Rogers, the body image color resides on a thin impurity layer. This layer could be made of residues (starch, détergents) used during the textile making process that concentrated on both surfaces according to an evaporation-concentration process. Alternatively AND PERHAPS PREFERRED, this thin layer may simply be interpreted as the primary cell wall of the fibers.”  Note: the first question that came to mind when you read this is: On which scientific and solid basis do the primary cell wall hypothesis should be “preferred” to the one proposed by Rogers, at the exception of Fanti and others will to back-up at all cost their supernatural hypotheses and the kind of coloration results they got after doing some coloration test on linen samples?\n2- Page 7: “Phase-contrast photomicrographs show that there is a very thin layer on all the TS fibers, characterize as “ghosts” by Rogers (SIC – this term originally came from Adler if I’m right), which MAY CORRESPOND TO THE PRIMARY CELL WALL; this is the external thin colored layer pulled from a linen fiber by the adhesive in the TS STRUP sampling.”  Note: the first question that came to mind when you read this is: why only speaking of the primary cell wall hypothesis here, while completely avoiding to mention the impurity hypothesis of Rogers, which has probably more chances to explain these “ghosts” with 100% satisfaction (especially when we also consider another important data concerning the fact that the color can be reduce with diimide leaving an UNDAMAGED linen fiber behind)?  \nAgain, believe me, what I said earlier about Fanti’s will to completely reject Rogers’ hypothesis regarding the chromophore question is completely true and, consequently, it is very telling of the motivation of this guy.  I hope people (especially those who defend the idea of a supernatural process for the image formation) will finally open their eyes about “scientists” like him (and some others) and will never trust anything that could come from them in the future.  Effectively, how can you trust someone who is willing to totally reject the very pertinent hypothesis of another researcher for the evident and sole reason that such a hypothesis goes totally against his personal image formation hypothesis (in this case, we’re talking about the corona discharge, but please note that it is the same thing concerning Di Lazzaro’s own hypothesis regarding a flash of UV light)?  I will let you answer this question by yourself…\n\n","date":"September 7, 2013 at 9:46 pm","url":"https://shroudstory.com/2013/09/05/thoughts-on-the-thoughts-on-the-newly-published-paper-by-ray-rogers/","cat":"image_theory","id":"comment-43223","author":"Yannick Clément","site":"shroudstory"},{"title":"Thoughts on the thoughts on the newly published paper by Ray Rogers","post":"Complementary note:\nWhen I said in my previous comment that “in this case, we’re talking about the corona discharge, but please note that it is the same thing concerning Di Lazzaro’s own hypothesis regarding a flash of UV light”, I just wanted to say that Rogers’ impurity hypothesis was also truly problematic for the viability of Di Lazzaro’s UV hypothesis and nothing else.  I just don’t want people to extrapolate to much from this particular section of my previous comment.\n\n","date":"September 7, 2013 at 9:50 pm","url":"https://shroudstory.com/2013/09/05/thoughts-on-the-thoughts-on-the-newly-published-paper-by-ray-rogers/","cat":"image_theory","id":"comment-43224","author":"Yannick Clément","site":"shroudstory"},{"title":"Thoughts on the thoughts on the newly published paper by Ray Rogers","post":"I have to write my complementary note again:\nWhen I said in my previous comment that “in this case, we’re talking about the corona discharge, but please note that it is the same thing concerning Di Lazzaro’s own hypothesis regarding a flash of UV light”, I just wanted to say that Rogers’ impurity hypothesis IS also truly problematic for the viability of Di Lazzaro’s UV hypothesis and nothing else. I just don’t want people to extrapolate to much from this particular section of my previous comment.\nBetter…\n\n","date":"September 7, 2013 at 9:51 pm","url":"https://shroudstory.com/2013/09/05/thoughts-on-the-thoughts-on-the-newly-published-paper-by-ray-rogers/","cat":"image_theory","id":"comment-43225","author":"Yannick Clément","site":"shroudstory"},{"title":"Thoughts on the thoughts on the newly published paper by Ray Rogers","post":"Thanks, Yannick, but I’m afraid I still can’t agree with you.\n1) Can anyone find a reference to McCrone finding starch on the shroud except what is mentioned by Rogers himself?\n2) Can anyone (Colin, perhaps, if he’s ever on board these days) say whether the ‘ghost’ coloration on the Mylar tape could be due to the detachment of the primary cell wall of fibres rather than an ‘impurity layer’?\n3) Although Heller and Adler failed to report finding any starch on the shroud, do we “have to assume” that they did find it but failed to report it?\n4) Can Thibault Heimburger, one of the authors of the paper, and who does read this blog from time to time, confirm that Fanti was “was not willing at all to even mention Rogers’ impurity hypothesis” until forced to do so?\n\n","date":"September 8, 2013 at 4:59 am","url":"https://shroudstory.com/2013/09/05/thoughts-on-the-thoughts-on-the-newly-published-paper-by-ray-rogers/","cat":"image_theory","id":"comment-43252","author":"Hugh Farey","site":"shroudstory"},{"title":"Thoughts on the thoughts on the newly published paper by Ray Rogers","post":"Aha! Answering my own question, I find a mention of starch by McCrone after all. It’s in Judgement Day for the Shroud of Turin, and as usual, the context is worth quoting as well:\n“Since the extraneous but rare particles may be of interest, I will list them: silk, wool, linen and cotton fibres of various colours, wax spatters, bird feather fibres, rodent hairs, mica, limestone (calcite), quartz, aragonite, starch grains (corn and wheat), pollen (average less than 2-3 pollen grains per tape), mould spores, trichomes (leaf hairs). flash (oil soot, power plant, incinerator trash burning), Jeweller’s rouge, paper fibres, pigments (madder, orpiment, yellow ochre), plant and insect parts, charred linen fibres, etc.”\nNot, to my mind, evidence of a starch coating at all…\n\n","date":"September 8, 2013 at 8:59 am","url":"https://shroudstory.com/2013/09/05/thoughts-on-the-thoughts-on-the-newly-published-paper-by-ray-rogers/","cat":"image_theory","id":"comment-43286","author":"Hugh Farey","site":"shroudstory"},{"title":"Thoughts on the thoughts on the newly published paper by Ray Rogers","post":"Question 1: Already answered by Hugh himself.\nQuestion 2: If the coloration would have been located in the primary cell wall, then the resulting fiber after the reduction of the color with diimide would not have been “undamaged” (quote from Rogers’ Shroud of Turin FAQ paper) and this must be the same thing for the resulting fiber that became free of its coloration coach after it remained in the sticky tapes. For me, if the color would have been found in the primary cell wall and it would have been “extracted” by the sticky tapes or “reduced” by the diimide solvant, no way the resulting fiber could be described as “undamaged”.  On this subject of the primary cell wall hypothesis for the image chromophore, I hope you will read carefully a long comment that I’m about to post in a moment…  Just check for it Under the comment I wrote September 8, 2013 at 5:10 pm.\nQuestion 3: I think only these 2 persons (now dead) could have answered this question with a high level of certainty. I’m also pretty sure that Ray Rogers, because he knew very well Adler’s researches about the Shroud, could have given us a sure answer to this question… My guess here is the same I told you yesterday: I really think they never found any confirmation of the presence of starch on the Shroud because looking for traces of this product on non-image fibers was not part of the STURP test plan (this info is coming from the 2001 paper of Rogers), or else, they would surely have found some traces of it because, later on, as we can read in Rogers’ book, new microchemical tests were made again with iodine (most probably on non-image fibers) and, this time, traces of starch were found. In sum, I’m almost sure that Heller and Adler only did their test with iodine on colored fibers, which is probably why they didn’t found anything since the starch on those fibers would have been modified chemically during the image formation process. And why I’m almost sure of this? Simply because it was part of the STURP test plan to verify the presence of a possible starch-base painting media that could have formed the body image on the cloth, while it wasn’t part of the same test plan to verify the presence of polysaccharides on the Shroud fibers that would have been left there because of the ancient method of making linen cloths (as Rogers said in his 2001 paper, they should have check for these kinds of impurities but the fact is that they didn’t). With such a test plan (mainly designed to verify in deep the medieval painting theory regarding the Shroud image), there was no reason at all for Heller and Adler to start checking for traces of starch on non-image fibers.\nQuestion 4: Here, it’s a bit disappointing to note that you don’t trust my words! I repeat it: the info I gave you concerning Fanti’s antics regarding the impurity hypothesis of Rogers versus his personal hypothesis regarding the primary cell wall is completely true and I can say this with insurance because of the very good and reliable source who told it to me. Important note about that source: he’s an official Shroud researcher that has a very good reputation, so when he said something about someone, we can be sure that it is the truth…  And if Thibault should answer to your question, I just hope he will be honest enough to say that it’s true that if this has been only for Fanti, their 2010 paper would not have made any mention of the impurity hypothesis proposed by Rogers as being a possible answer for the image chromophore of the Shroud’s body image and they would only have talked about the primary cell wall hypothesis, as if it would have been a fully accepted theory!!! I know this sound incredible coming from someone who consider himself as an authentic scientist, but it’s the sad reality!  And here’s a very good clue for you to understand that this is true: in 2005, many Shroud researchers from the SSG (among them was Fanti) published a paper at a Shroud conference in Dallas entitled “Evidences for Testing Hypotheses About the Body Image Formation of the Turin Shroud” (link: http://www.shroud.com/pdfs/doclist.pdf) in which they recognized as an “unquestionable observation” this observation: “Body image color resides on a thin impurity layer of outer surfaces of the fibers” (note that this is a pretty good summary of Rogers’ hypothesis concerning the image chromophore) and then, in 2008, after the ENEA did their first coloration tests with UV (which showed that it was possible to color only the primary cell wall of a linen fiber), Fanti and a few others members of the SSG (among them were many of those who first signed the 2005 paper) published a new list of facts about the Shroud (which I personaly call “The list of Fanti”) in a paper entitled “List of Évidences of the Turin Shroud” that was presented at the Frascati Shroud conference in Italy (link: http://www.acheiropoietos.info/proceedings/FantiListWeb.pdf) in which they dared to change the previous “unquestionable observation” for the primary cell wall hypothesis WITHOUT ANY SOLID PROOF that this hypothesis could be more relevant versus the image chromophore on the Shroud and without have the decency to at least keep Rogers’ hypothesis as another true possibility that can explain the image chromophore! Here’s the new “unquestionable fact” (SIC) regarding the chromophore of the Shroud that we can find in this 2008 paper: “Body image color resides only on the thin layer that is probably the primary cell wall (SIC – they call this an unquestionable fact, while they use the term “probably” to talk about it!) (pcw) of outer surfaces of the fibers.”  Noticed how they kept a very similar formulation and changed the term “impurity layer” for “primary cell wall”!  Such a change WITHOUT SOLID PROOF is truly unscientific and biased in my mind, because it is pretty evident that it was mainly done as a try to back-up Fanti and Di Lazzaro’s image formation hypotheses involving a corona discharge and UV laser (which cannot colored just a thin layer of impurities without affecting the underlying fiber, but which could truly colored the primary cell wall of a fiber without affecting its core)… In sum, in 2008, Fanti already did what he was about to do in his 2010 paper!!!\n\n","date":"September 8, 2013 at 6:22 pm","url":"https://shroudstory.com/2013/09/05/thoughts-on-the-thoughts-on-the-newly-published-paper-by-ray-rogers/","cat":"image_theory","id":"comment-43346","author":"Yannick Clément","site":"shroudstory"},{"title":"Thoughts on the thoughts on the newly published paper by Ray Rogers","post":"Dear Hugh,\nYes I read this blog from time to time.\nAbout your question 4), no it is not true to state that Fanti   “was not willing at all to even mention Rogers’ impurity hypothesis” until forced to do so?”\nI repeat : this paper was not mainly about the chromophore but an attempt to explain what is the superficiality of the TS image at fabric, thread and fiber level.\n\n","date":"September 9, 2013 at 3:52 pm","url":"https://shroudstory.com/2013/09/05/thoughts-on-the-thoughts-on-the-newly-published-paper-by-ray-rogers/","cat":"image_theory","id":"comment-43502","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Thoughts on the thoughts on the newly published paper by Ray Rogers","post":"Thanks, Thibault. I’m never happy with unsubstantiated rumours.\n\n","date":"September 9, 2013 at 4:50 pm","url":"https://shroudstory.com/2013/09/05/thoughts-on-the-thoughts-on-the-newly-published-paper-by-ray-rogers/","cat":"image_theory","id":"comment-43510","author":"Hugh Farey","site":"shroudstory"},{"title":"Thoughts on the thoughts on the newly published paper by Ray Rogers","post":"Hunting for starch has become a fetish with me. There doesn’t seem to be any! Well, almost none. McCrone detected a few “grains” which do not imply any kind of coating. Surprisingly, I cannot find that Rogers actually found any starch himself. The newly published paper does not mention any tests for starch carried out by Rogers. There is a mention in another paper, which is often quoted: “Microchemical spot tests with aqueous iodine indicated the presence of some starch fractions on Shroud fibres,” but the references given for this evidence do not back this up. They are: A Comprehensive Examination of the Various Stains and Images on the Shroud of Turin (Jumper, Jackson et al.), Physics and Chemistry of the Shroud of Turin – A Summary of the 1978 Investigations (Schwalbe and Rogers), and A Chemical Investigation of the Shroud of Turin (Heller and Adler). The first does not mention starch at all, the second specifically denies the presence of starch, and the third mentions that an iodine starch test was carried out, but does not report on it being present. So where, twenty years later, did Rogers’s evidence emerge from?\n\n","date":"September 8, 2013 at 12:49 pm","url":"https://shroudstory.com/2013/09/05/thoughts-on-the-thoughts-on-the-newly-published-paper-by-ray-rogers/","cat":"image_theory","id":"comment-43307","author":"Hugh Farey","site":"shroudstory"},{"title":"Thoughts on the thoughts on the newly published paper by Ray Rogers","post":"Quote: “Surprisingly, I cannot find that Rogers actually found any starch himself.”\nMy answer:  Again Hugh, you should read again the quotes I gave you the other, which can be found in my paper about Rogers’ conclusions and observations versus the Shroud image.  Here they are again:\n35- The fact that the color resides only on the fiber surfaces leads to the hypothesis that the color formed as a result of chemical reactions involving impurities on the surface. The spectra strongly suggest that the impurities were carbohydrates that dehydrated as a result of image-formation process. The hypothesis of carbohydrates impurities is supported by observations of traces of some starch fractions on image fibers. (Reference for this particular quote: Raymond N. Rogers and Anna Arnoldi, Scientific method applied to the Shroud of Turin – A Review, 2002).\n36- Microchemical tests with iodine detected the presence of starch impurities on the surfaces of linen fibers from the Shroud. Impurities were detected that could take part in color-producing Maillard reactions.\n37- A search for carbohydrate impurities on the Shroud confirmed McCrone’s detection of some starch fractions. Starch and low-molecular weight carbohydrates from crude startch would color much more easily than would cellulose as a result of either thermal dehydration or chemical reactions. (Reference for the two last quotes: Raymond N. Rogers, A Chemist’s Perspective on the Shroud of Turin, Barrie Schwortz Editor and Publisher, July 2008).\nComplementary comment versus these 3 quotes:  All these quotes from Rogers’ writings proved that there really are some traces of starch on his old STURP samples (no matter what Fanti think or what Adler thought), which confirmed McCrone detection (which he did only via a microscopic analysis on the contrary to Rogers who also did find traces of starch via a microchemical analysis) and which also strongly support two important hypothèses proposed by Rogers: 1- His hypothesis concerning the image chromophore (which would only be located in a thin and uneven layer of carbohydrate impurities and nothing else) and 2- His hypothesis that starch had been used to protect the threads during the weaving of the cloth, which can also be seen as a strong indicator in favor of a much older age for the cloth, because this is consistent with the ancient method of making linen cloths during Antiquity.   \nQuote from Hugh: “The newly published paper does not mention any tests for starch carried out by Rogers.”\nMy comment:  Effectively!  At that moment in time, it seems that Rogers had not made any new microchemical analyses to verify if McCrone’s claim could be confirmed.  The quotes I just give you strongly suggest that he finally did some microchemical analyses on his old STURP samples and was able to detect traces of starch.  I will go in Rogers’ book to look at the context of those quotes in order to confirm that Rogers himself did those tests that were able to confirm McCrone’s claim and I will share the info with you tomorrow.\nQuote from Hugh : “There is a mention in another paper, which is often quoted: “Microchemical spot tests with aqueous iodine indicated the presence of some starch fractions on Shroud fibres,” but the references given for this evidence do not back this up.”\nMy comment: Look at quote #36 that I just gave you and you’ll noticed that it is the very same quote! I found it in Rogers’ book about the Shroud.  Can you tell me where did you find it yourself (in which paper)?  I would be very surprise to learn that this particular claim that we can find in Rogers’ book doesn’t come from a microchemical test he did himself after the writing of his 2001 paper…  Again, later tonight, I will check the context in which we find this quote from Rogers in his book and I will tell you more about that tomorrow. \nBut seriously, if Rogers made all those statements in his later writings about the fact that deposits of starch were find after the detection made by McCrone, I don’t see why we should seriously doubt such a fact.\nLast thing:  Thank you very much for having shared this quote from McCrone’s book. I don’t have this book, so this was new information for me and I hope it will help you to trust Rogers statement #37 that I just gave you in this present comment… Note: Rogers was truly an honest scientist and I don’t understand why people in the Shroud world are constantly putting his statements and conclusion in question just like we had serious reasons to believe in his dishonesty!  I don’t understand at all. Anyway, concerning the quote you mentioned concerning the supposed finding of starch residues made with a microchemical test with iodine, I will try to find some confirmation in Rogers’ book.\n\n","date":"September 8, 2013 at 5:10 pm","url":"https://shroudstory.com/2013/09/05/thoughts-on-the-thoughts-on-the-newly-published-paper-by-ray-rogers/","cat":"image_theory","id":"comment-43339","author":"Yannick Clément","site":"shroudstory"},{"title":"Thoughts on the thoughts on the newly published paper by Ray Rogers","post":"In this comment, I would like to expose you some crucial facts that, I hope, will make you realize the big difference between the way Fanti and Di Lazzaro are doing their research on the Shroud image and the way Rogers did his own.\nFact 1: For years now, Fanti has been convinced that the image on the Shroud must have come directly from a burst of energy that was released at the time of the Resurrection of Christ.\nFact 2: Then, Fanti made some coloration experiments with a corona discharge and thought it could offer a good solution for the Shroud image.\nFact 3: Then, Ray Rogers tested the hypothesis proposed by Fanti by making some coloration experiments on linen with a corona discharge and noted that the coloration result he obtained (see figure X-7 in page 86 of the PDF version of his book about the Shroud for an example of such result) was not at all the same as what he saw on the Shroud. And guess what? The result he obtained was showing a coloration confined to the primary cell wall of the linen fiber! The crucial thing to remember is the fact that, for Roger, this kind of result WAS DIFFERENT from the color of the body image on the Shroud that he analyzed for so long, most probably because a coloration obtained with a corona discharge did some evident damages to the linen fibers, which cannot be seen in image fibers taken from the Shroud. Right then, Fanti must have forget about his corona discharge hypothesis and also about the idea that the body image color on the Shroud could be located in the primary cell wall of the linen fiber.\nFact 4: Some time after this rebuttal of Fanti’s hypothesis by Rogers, he turn to Di Lazzaro and the ENEA team and convinced him to performed some new coloration tests, but this time with a UV laser instead of a corona discharge, while, at the same time, he still proposed publicly his corona discharge as the best solution for the “mystery” of the Shroud image formation.\nFact 5: Di Lazzaro and his team did some coloration tests on linen with their UV laser obtained pretty much the same kind of result that was obtained years before by Rogers when he did his testing of the corona discharge hypothesis, i.e. a coloration confined to the primary cell wall of the linen fiber. At that moment in time, Fanti and Di Lazzaro should have recognized with humility that this kind of result is different than what Rogers saw at microscopic level during his analysis of the Shroud image and therefore, they should have forget about the idea that a burst of UV could have been the cause of the body image on the Shroud. But this is not at all what happened!\nFact 6: What really happened is this: instead of recognizing with humility that the coloration results they obtained with a corona discharge or with a UV laser was DIFFERENT from what Rogers noticed during his close examination of the Shroud image fibers, Di Lazzaro choosed to keep on making new experiments with UV laser, while keeping on pushing hard in favor of this particular hypothesis in order to explain the Shroud image and Fanti did the very same thing with his corona discharge hypothesis!\nFact 7: Then, both Fanti and Di Lazzaro, being obviously unable to recognize the negative judgement of an expert like Rogers versus the kind of coloration results they both obtained with a corona discharge and also with UV lasers (i.e. a coloration confined to the primary cell wall, which obviously for Rogers, produced some damages to the linen fibers that are not at all present on the Shroud image fibers), decided to wrote a paper (the 2010 paper that is mentioned on top of this page) in order to push the primary cell wall hypothesis for the image chromophore (knowing very well now that this is the only kind of coloration results they could get with a corona discharge and a UV laser), while, at the same time, making believe (with some subtlety) that Rogers’ own hypothesis for the image chromophore (i.e. color located only in a thin layer of carbohydrate impurities that doesn’t affect in any way the underlying linen fiber) is most probably incorrect. And in order to discredit Rogers’ impurity hypothesis, they used these few arguments that are completely false (at least, in the present state of our knowledge): 1- This impurity hypothesis would be unable to explain the discontinuous distribution of the colored fibers in the image area (note that the “new” paper of Rogers that was recently published on shroud.com offer some pretty solid reasons to reject such an argument, especially when we note the kind of result Rogers obtained after an evaporation-concentration experiment he made with a cotton nap and a dye solution, which show that, normally, this kind of natural process happening inside a cloth will produced an uneven layer of “impurity”, thus offering a simple and rational explanation for the discontinuous aspect of the Shroud image). 2- There would be no reference stating that starch was used in Antiquity to produce linen cloths (note that this argument is completely contradicted by the expert opinion of Anna Maria Donadoni, which was the conservator at the Turin’s Museum of Egyptology, who clearly mentioned to Rogers that starch was often used in Antiquity to protect the threads during the weaving of the cloths).  3- This impurity hypothesis would be unable to explain the fact that the color is found all around the circumference of a colored fiber (note that this argument is truly misleading because it gives the wrong impression that every colored fibers on the Shroud are showing a coloration all around their surface in a homogeneous way, which has been proven by Rogers to be completely false. Effectively, Rogers showed to the SSG (which I’ve been able to see for myself) a very high-resolution close-up of a colored fiber taken from his STURP samples (here’s a link to see a small version of this photo: http://www.shroud.com/gallery/pages/Rogers%20DISCONTINUOUS%20YELLOW.htm) and we can easily see that the distribution of the color on this fiber is not even at all in every part. In fact, we can see a certain amount (thickness) of color in some areas and even more color (more thickness) in other areas, while no color at all can be found in some other areas of the same fiber. In sum, from this photo showed by Rogers, we can conclude that the distribution of the color at fiber level is almost as much discontinuous and non homogeneous than what it is at thread level when we compared all the fibers of one colored thread, which is a very particular characteristic that really seems to agree with Rogers’ hypothesis of a very thin and UNEVEN layer of impurities that is probably forming the image chromophore. In fact, the only correct thing we can find in this argument saying that the color is found all around the circumference of a colored fiber is the fact that the color CAN be present in any area of a colored fiber, whether it be “over it”, “under it” or “on both sides of it”, and this cannot be taken as a characteristic that goes against Rogers’ impurity hypothesis, especially when we consider the high-resolution photo he show in page 105 of his book about the Shroud, which is called “figure XI-5”, that is showing the result, at microscopic level, of a coloration test he did on a linen sample prepared with the ancient method of making linen cloths in order to verify the kind of coloration he could get with his image formation hypothesis that include a Maillard reaction on the impurity layer. On this photo, we can clearly see that the color is present all around the colored fiber but not in a homogeneous way (we can see a degree of thickness that is stronger in some areas than in others, while there seem to be some areas where there is absolutely no color at all), which is very similar to the high-resolution photo of a Shroud image fiber that I just mentioned and therefore, can be seen as a pretty strong indicator of the validity of the impurity hypothesis proposed by Rogers versus the reality of the colored fibers on the Shroud. In the end, we can say that Rogers’ hypothesis for image formation is able to produce a coloration that can be located anywhere on a particular fiber but not in a homogenuous way (in other words, we can say that the coloration is discontinuous even at fiber level), which is exactly what he was able to see on the surface of the colored fibers from the Shroud that he analyzed with his microscope. Final note: on the contrary to Rogers’ image formation hypothesis, I really doubt that a corona discharge or a burst of UV light can produce a very evident non homogeneous coloration on the surface of one particular colored fiber in the same way than we see on the high-resolution photo showed by Rogers, especially when we think that such high-energy processes always colored the primary cell wall of the fiber, which can be found in roughly the same amount (thickness) all around every linen fibers, i.e. more or less 200 nanometers, and which is totally different from the very uneven layer (even at fiber level) of impurities proposed by Rogers. Note also that we can also strongly question the capacity of those high-energy processes to produce a discontinuous distribution of colored fibers in one particular colored thread (which is the very bad argument #1 they used against Rogers’ hypothesis).  \nFact 8: To this day, Fanti and Di Lazzaro still maintain publicly (and also in their official writings) that the image chromophore is located in the primary cell wall of the linen fibers (again, we must note that this is the best they can get when they try to color some linen fibers with a corona discharge or a UV laser), while keeping on pushing in favor of their “pet theories”, while knowing full well that the kind of result they can obtained from such hypotheses was completely rejected by Rogers as a possible explanation for the formation of the Shroud image because it was showing an obviously (for him anyway) different kind of coloration result, especially concerning the microscopic aspect of the colored fibers. Here, it’s crucial to note that Rogers knew what he was talking about when it comes to the microscopic appearance of a Shroud image fiber. And it’s also important to note that we’re not even talking here about the theoretical incapacity of such high-energy hypotheses to produce an image on linen that would ALWAYS be discontinuous and extremely superficial like the Shroud image, no matter if the source of energy is located in direct contact with the linen sample or at 4 cm or so of the same linen sample. On this subject, it should be noted that Fazio and Mandaglio (who are two Italian scientists who analyzed these kind of high-energy hypotheses) were very specific about this FACT.  \nFact 9: On the other side, you got a very professional scientist like Rogers who had no preconceive notion about the cause of the body image on the Shroud who did his own research in a completely different manner than Fanti and Di Lazzaro. Effectively, Rogers started, as it should, by trying to understand and describe the image chromophore of the body image on the Shroud by taking into account ALL the pertinent data and observations related to it (especially the discontinuous and very superficial aspect of it, as well as the presence of “ghosts” of color in the sticky tapes, the reduction of the color with diimide, which left an UNDAMAGED and CLEAN linen fiber behind, the banding effect that we see everywhere on the Shroud and the most probable method that was used in ancient time to produce linen cloths). After analyzing all these data, he came to the conclusion that the image chromophore was most probably located in a very thin and uneven layer of carbohydrate impurities that would be more unstable than the linen fiber itself (including the primary cell wall) and therefore, which could become dehydrated (colored) much more easily and even at normal temperature. Then (AND ONLY THEN), he tried hard to find a viable hypothesis to explain the process that lead to the formation of the body image on the cloth. As we can see in the 2001 paper that was recently published on shroud.com, he first proposed, on the basis of the results obtained by Pellicori of STURP, that skin perspiration (sweat) and/or skin secretions, along with possibly a certain release of heat by the corpse could have been the “catalytic compounds” that produced a caramelization (coloration) of the thin and uneven layer of impurities on the top surface of the Shroud through a mix process that would have acted by direct contact, as well as by diffusion. Then, after he became convinced that the body of the Shroud man was most probably dry at the time he was placed inside the Shroud (this imply that there was a certain delay of time between the time of death and the time of the entombment to allow the most probable intense sweat that was covering the Shroud man’s body and hair to dry completely, which is truly possible, especially in the light of the Gospel accounts of Joseph being forced to go to Pilate to ask permission to take the body and buried it in a normal tomb), Rogers was somehow forced to search elsewhere for a better solution (which is something that Fanti and Di Lazzaro where unable to do when they noticed that they couldn’t get anything better with corona discharge or UV laser than the coloration of the primary cell wall of the linen fibers). That’s when he started to take much more seriously the “vaporographic” hypothesis that was proposed by Vignon at the beginning of the 20th Century and ultimately found out that some crucial elements in it could well be valid versus the reality of the Shroud image, which lead him to elaborate a new image formation hypothesis involving primarily a diffusion of post-mortem gases that would have caused, along with a probable release of heat from the corpse, a Maillard reaction in the thin layer of carbohydrate impurities (made primarily of starch that was found by McCrone with a microscopic analysis and also by a later microchemical test with iodine done by the STURP team) that resides on the top-most fibers of the cloth. Noticed that on the contrary to Fanti and Di Lazzaro, Rogers built his image formation hypothesis AFTER he analyzed and understood correctly the image chromophore and then (and only then) he made sure that his image formation hypothesis would be able to produce the same kind of image chromophore by doing some preliminary test of coloration on linen samples that were made with the ancient method of making linen cloths. The results of his preliminary tests were good enough for Rogers (especially the one we can see the result in figure XI-4 in page 104 of his book about the Shroud) to convince him that he was on the right track and that his image formation hypothesis deserved to be well described and well defended publicly. In sum, Rogers was convinced that his hypothesis was really able to produce a yellow coloration on linen fibers that is showing very similar characteristics than the Shroud image at microscopic level (much more in Rogers’ opinion than what can be seen after a coloration test done with a corona discharge and certainly also after a test done with UV laser, since it present roughly the same characteristics, especially when it comes to the location of the color in the primary cell wall and most probably also when it comes to the kind of damage it can do to the structure of the linen fiber). He was also convinced that it could theoretically produced the same kind of full-length body image (which contain some 3D properties) that we see on the Shroud if all the right conditions (still undetermined for most of them) could be reunited, but unfortunately, he died before being able to performed more complex imaging tests to see what kind of result he could obtain under different textile, environmental and biologicial conditions.  \nAll that I said in this comment is, I believe, the truth or at least very close to the truth. Of course, I can be wrong on some minor aspects of the whole issue but I’m certainly not wrong on the most important ones, which is that Rogers and the Fanti-Di Lazzaro tandem have not followed the different steps of research in the same order. Now it’s up to you to decide who followed the correct steps in his research about the Shroud image (Fanti and Di Lazzaro or Ray Rogers) and consequently, who has more chances to be close to the truth regarding the kind of image formation process that occurred on the Shroud (at least when it comes to determine the nature of this image formation process, which can be natural or supernatural)…\n\n","date":"September 8, 2013 at 6:32 pm","url":"https://shroudstory.com/2013/09/05/thoughts-on-the-thoughts-on-the-newly-published-paper-by-ray-rogers/","cat":"image_theory","id":"comment-43348","author":"Yannick Clément","site":"shroudstory"},{"title":"Thoughts on the thoughts on the newly published paper by Ray Rogers","post":"Here’s a small erratum concerning my previous long comment: \nIn fact #9, I wrote this: “a Maillard reaction in the thin layer of carbohydrate impurities (made primarily of starch that was found by McCrone with a microscopic analysis and also by a later microchemical test with iodine done by the STURP team).\nErratum: instead of reading that the iodine test was done by the STURP team, you should read that this test was performed by Rogers (most probably circa 2002).\n\n","date":"September 8, 2013 at 6:40 pm","url":"https://shroudstory.com/2013/09/05/thoughts-on-the-thoughts-on-the-newly-published-paper-by-ray-rogers/","cat":"image_theory","id":"comment-43349","author":"Yannick Clément","site":"shroudstory"},{"title":"Thoughts on the thoughts on the newly published paper by Ray Rogers","post":"Yannick, nowhere in any of his writings does Rogers say that he found starch on the shroud.\nHe does quote, many times, that “Microchemical spot tests with aqueous iodine indicated the presence of some starch fractions on Shroud fibres.” This sentence is not based on his own research, but is a reference to other researchers, whose published writings do not substantiate it. McCrone, it is true, found a few starch grains, not a layer.\nSimply repeating your previous posts does not, of itself, refute my criticisms of them. Your Quotes 36 and 37 refer to the alleged discovery of minute traces of starch by previous researchers, for which no evidence can be found, and Quote 38 refers to the McCrone statement about grains. Most remarkably, it is not clear that, after suspecting the presence of starch all over the shroud, Rogers never thought of testing one of his threads, or better still one of his ‘ghosts,’ with iodine, and showing the results in one of his copiously illustrated papers.\n\n","date":"September 8, 2013 at 5:59 pm","url":"https://shroudstory.com/2013/09/05/thoughts-on-the-thoughts-on-the-newly-published-paper-by-ray-rogers/","cat":"image_theory","id":"comment-43343","author":"Hugh Farey","site":"shroudstory"},{"title":"Thoughts on the thoughts on the newly published paper by Ray Rogers","post":"I think you made a little understandable mistake concerning this particular quote Hugh!  I have found the original paper in which Rogers mentioned the fact that microchemical tests (note: most probably done on non-image fibers) indicated the presence of some starch fraction and it is this one: Raymond N. Rogers and Anna Arnoldi, Scientific method applied to the Shroud of Turin – A Review, 2002.\nThe quote in question can be found in page 7 of the paper and it is found in the middle of this paragraph: “Image color does not appear under the blood stains when they are removed with a proteolytic enzime (reference:  “A Chemical Investigation of the Shroud of Turin” by Heller and Adler). Whatever process produced the image color must have occurred after the blood flowed onto the cloth, and the image-producing process did not destroy the blood (no reference for this sentence most probably because this was a brand new statement written by Rogers and Arnoldi for this particular paper). Here’s the quote in question: Microchemical spot tests with aqueous iodine indicated the presence of some starch fractions on Shroud fibers (again, no reference for this sentence most probably because this was a brand new statement written by Rogers and Arnoldi for this particular paper, which most probably means that this finding had been done around that time (2002) by Rogers himself with a new microchemical test with iodine, which was most probably performed on non-image fibers taken from his STURP samples). No proteins could be detected in either image or non-image areas; however, they were easy to detect in blood stains; however, they were easy to detect in blood stains (reference: “A Comprehensive Examination of the Various Stains and Images on the Shroud of Turin” by Jumper, Jackson et al. and “Physics and Chemistry of the Shroud of Turin – A Summary of the 1978 Investigations” by Schwalbe and Rogers and also “A Chemical Investigation of the Shroud of Turin” by Heller and Adler). We have recently found that some plant gum, mordants, and dye(s) coat the yarn of the sample which was taken by Gilbert Raes in 1973 for textile analysis (reference: “Rapport d’analyse” by Raes). These deposits are unique to the Raes sample; however, that area was in immediate contact with the radiocarbon sample that was removed for dating in 1988. This fact makes the validity of the radiocarbon sample questionable (no reference for this sentence most probably because this was a brand new statement written by Rogers and Arnoldi for this particular paper).\nSo Hugh, I hope this explanation of mine will help you to understand your mistake  regarding this particular and very important statement of Rogers! Again, this is quite understandable, because there was many references that were given by Rogers and Arnoldi for other sentences in the same paragraph.  In the end, I think we MUST consider as very sure the fact that Rogers was able to find some traces of starch on his old STURP samples with new microchemical spot tests done with aqueous iodine that he most probably did after the writing of his “new” 2001 paper and the writing of this 2002 paper entitled “Scientific method applied to the Shroud of Turin – A Review”. \nNote that it would have been very strange to see Rogers wrote in his 2001 paper that no STURP member (including himseld) was able to detect some traces of starch back then and then, one year later, in another paper, to see him wrote that microchemical tests with iodine were able to find some traces of this product, if these new tests would not have been made by himself, but would date back to the STURP days!\n\n","date":"September 8, 2013 at 7:29 pm","url":"https://shroudstory.com/2013/09/05/thoughts-on-the-thoughts-on-the-newly-published-paper-by-ray-rogers/","cat":"image_theory","id":"comment-43355","author":"Yannick Clément","site":"shroudstory"},{"title":"Thoughts on the thoughts on the newly published paper by Ray Rogers","post":"Thank you very much for taking the trouble to reply in such detail. Much to think about, as usual!\n\n","date":"September 8, 2013 at 7:07 pm","url":"https://shroudstory.com/2013/09/05/thoughts-on-the-thoughts-on-the-newly-published-paper-by-ray-rogers/","cat":"image_theory","id":"comment-43353","author":"Hugh Farey","site":"shroudstory"},{"title":"Thoughts on the thoughts on the newly published paper by Ray Rogers","post":"My pleasure.  I just want to share all the information I have with everyone as much interested by the Shroud as me!\n\n","date":"September 8, 2013 at 7:12 pm","url":"https://shroudstory.com/2013/09/05/thoughts-on-the-thoughts-on-the-newly-published-paper-by-ray-rogers/","cat":"image_theory","id":"comment-43354","author":"Yannick Clément","site":"shroudstory"}]
