[{"title":"To Yannick on Science and Philosophy","post":"I recall trading messages with Rogers on the SSG.  Dan is correct.  Although Rogers was looking for a natural explanation for the image, he acknowledged that the lack of decomposition stains supported the biblical claim of resurrection. He wasn’t trying to deny that a miracle occurred, only that the image itself was not miraculous.  While I personally don’t agree with the logic of his argument, that is where he was coming from.\n\n","date":"May 5, 2014 at 8:33 am","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","id":"comment-111738","author":"Russ Breault","site":"shroudstory"},{"title":"To Yannick on Science and Philosophy","post":"I think we have to discuss a particular argument :\n“The Shekhinah and the Shroud”.\nFor example, under the address :\nhttp://freestockphotos.com/COMING1/ShroudofTurin.htm\nI have found the following words :\n>There is a special kind of light that is unique to God Himself called the Shekinah. When Moses came down from Mt Sinai, his face glowed for a time from his encounter with God. The Shekinah Glory inhabited the Tabernacle and Temple and radiated from between the cherubim over the Ark of the Covenant. Ezekiel witnessed the Shekinah Glory as a rainbow-colored radiance that surrounded God on His throne. It is this unique, miraculous kind of light that must have burst forth from the body of Jesus to produce the image on the Shroud of Turin ….\nWell. …\nWas the Shroud the Dwelling Place of the Divine Presence ?\nThis is an enigma.\nThe other biblical enigma is the disparition of the Ark of Covenant…\n\n","date":"May 5, 2014 at 8:59 am","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","id":"comment-111747","author":"Piero","site":"shroudstory"},{"title":"To Yannick on Science and Philosophy","post":"Perio wrote: “Was the Shroud the Dwelling Place of the Divine Presence ?” In the hypothesis the TS is Yeshua’s:\nOn February 29, 2012 at 9:10 am I wrote:\n“In my opinion, the Book of Revelation can be read as a cryptic allusion to Yeshua’s Shroud not only as a symbolic substitute to the curtain or veil of separation that hung in the Tabernacle/Temple and divided the latter into the Holy and the Holy of Holies but also as a substitute to the Tabernacle/Temple itself as the symbolic place where G.d in His grace came down and met man.\nThe Temple/Tabernacle as “the dwelling-place of G.d” can be rendered in Hebrew by « Gar ‘El » (literally “G.d dwells” and “G.d shines forth” > old French « Graal ») and in latin by « Deus Habitet » (Tabernacle). In the eyes of early Christians, Yeshua’s Shroud might well have been the Tabernacle of Tabernacles as it had received the latter’s translucent straw-yellow flesh imprint and blood image.”\nIf the Shroud can be described as the Dwelling Place of the Divine Presence then it does equate to the Holy Graal/Grail no less.\n\n","date":"May 5, 2014 at 9:46 am","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","id":"comment-111777","author":"Max patrick Hamon","site":"shroudstory"},{"title":"To Yannick on Science and Philosophy","post":"I beg your pardon about :\n“The Ark of the Covenant” …\nSo …  the question can be the following :\nThe light from the Shekhinah was brighter than the sun and\nthe Image on linen fibrils was the work of the Shekhinah (of God).\nIs it really possible to give proof of that (miracle) ?\nOr …\nIs it possible to give a natural explanation for the Image ?\nIs the Shekhinah the source, the key, for that search of a\nsupernatural explanation for the Shroud ?\nDo you know the Solomon’s quarry ?\n>The quarry entrance is under the north wall of the Old City\nabout 500 feet to the east of the Damascus Gate. It was concealed\nduring the Ottoman Empire by Suleiman in 1540 for security reasons\nand was not rediscovered until 1854 when James Barclay found it\nand snuck in one night. Josephus mentions the “Royal Caverns”\n(War 5:147) in his discussion of the north wall and gate built\nby Herod Agrippa I in 41BC on the same location as today’s wall\nand Damascus Gate. This quarry became known as Zedekiah’s\nCave because 2 Kings 25 and Jeremiah 52 tell how Zedekiah\nfled the city of Jerusalem in 586 even though the Babylonian\narmy had encircled the city for 24 months and had even\nentered to city to pillage and burn …\n… This quarry is located under Mount Moriah. …\n…  the Ark was never seen by the Babylonians in 586 BC\nand would have remained hidden there even after the Jewish return\nfrom exile through the New Testament days up until today.\nThis hiding place would have been accessible through Solomon’s\nQuarry, which provides access to a variety of tunnels and\ncaves under the Temple Mount.  …\nLink :\nhttp://www.generationword.com/jerusalem101/23-solomon-quarries.html\n— —\nNow I ask :\nWhere is the true trace of the ancient earthquake ?\nSee also : prof. Carpinteri (… and the inherent interesting theories/proofs).\nLink :\nhttp://staff.polito.it/alberto.carpinteri/piezonuclear%20reactions%20conference/Carpinteri%20AIMETA%202013.pdf\nIs that ancient earthquake beyond the realm of science or not ?\n— —\nAt the end there are the possible analogies\n(… at least as useful symbols !) :\nHigh place = Calvary – the Holy of Holies (Temple)\nLow place = Holy Sepulchre – Solomon quarry (Zedekiah’s cave, beneath the Temple)\n— — —\nB.T.W. :\nHave you read the last news about a new conference (in London) ?\nLink :\nhttp://conference.flionline.org/images/Brochure-2014.pdf\n\n","date":"May 5, 2014 at 9:48 am","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","id":"comment-111781","author":"Piero","site":"shroudstory"},{"title":"To Yannick on Science and Philosophy","post":"I am be curious to see if some researcher will be able to work using\nCOMSOL Multiphysics and computed laminography on linen fibrils\nand COMSOL Mutiphysics on “Zedekiah’s grotto (Solomon’s Quarry) model”\nin order to explore the effect from the presumed ancient earthquake …\nSorry …\nWhat is your opinon ?\n\n","date":"May 5, 2014 at 9:59 am","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","id":"comment-111788","author":"Piero","site":"shroudstory"},{"title":"To Yannick on Science and Philosophy","post":"Iam and not I am be !!!\n\n","date":"May 5, 2014 at 9:59 am","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","id":"comment-111789","author":"Piero","site":"shroudstory"},{"title":"To Yannick on Science and Philosophy","post":"A Real Scientist Speaks… (oooh, rispek!)\nScientists are not in the business of dogmatism. (He said, dogmatically…)\nScientists weigh up evidence and assess probabilities. They suggest, they propose, they infer. Rogers was no exception. Although it is clear that he did not think much of religion in general, or particularly that the explanation for the image was miraculous, he was even clearer in his rejection of dogmatism. If the “Chapter One” referred to by Yannick is that of A Chemist’s Perspective, then a couple of quotes that will be familiar to him will illustrate the point.\n“Persons who believe in absolutes will be unhappy with science. Scientists will be unhappy with persons who demand that they “make up your minds.”\n“A scientist has no right to demand that a devout person withhold devotion of the Shroud until all of the scientific evidence is in. A devout person has no right to tell a scientist that he must stop all observations because everything that is needed is known from scriptures or feelings.”\nLater he even quotes Richard Feynman: “… if a thing is not scientific, if it cannot be subjected to the test of observation, this does not mean that it is dead, or wrong, or stupid.” “This does not mean that those things are unimportant. They are, in fact, in many ways the most important.” I think that’s quite generous from one whose instinct was to reject the supernatural altogether.\nFinally, to suggest that Rogers  “clearly say that searching a supernatural explanation for the Shroud (just like Jackson, Rinaudo, Moran, Fanti, DiLazzaro and a bunch of other researchers have done in recent years) is not at all a valid part of the true scientific method,” is not, in fact, true. I think that’s what Rogers thought, and I agree with him, but Yannick must be careful not to bolster his own convictions by misattributing them to his hero.\n\n","date":"May 5, 2014 at 10:40 am","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","id":"comment-111820","author":"Hugh Farey","site":"shroudstory"},{"title":"To Yannick on Science and Philosophy","post":"I hope you had sufficient time to observe the slides by prof. Carpinteri.\nWhat is your opinion about the neutron flux, etc. ?\n(… and not “opinon” !!! I beg your pardon …)\n— —\nI suggest that you can try to build a model using COMSOL or\nanother software (… if you are able to work in that field !) in order\nto observe (= earthquake’s simulations) the effects on stones …\nHow to start ?\nI have found the study :\nModelling of Seismoelectric Effects\nby B. Kroeger and other researchers … (FEM modelling)\nLink :\nhttp://www.comsol.asia/paper/download/37122/Kroeger.pdf\n— —\nKing Solomon’s Quarries\nJerusalem, Israel\nlink :\nhttp://www.mastermason.com/fmisrael/quarries.html\nAt the end you can read :\n>Legends tell that when the Roman legions, under the command\nof Titus, placed Jerusalem under siege, the priests of the Temple\nhid Holy Utensils and Instruments of the Temple deep down the cave.\nIf this is true, these treasures have yet to be discovered. …\n— —\nSo…\nyou cannot invoke a miraculous explanation about the model that can be built …\nYou have to work :\nhttp://www.iaa-conservation.org.il/Projects_Item_eng.asp?site_id=3&subject_id=8\n… perhaps using the Archaeological Map :\n>Zedekiah’s Cave, which today also serves as a pilgrimage site\nfor Freemasons from Israel and abroad, was mapped by archaeologists.\nIn recent years, it has been refurbished by the East Jerusalem Development\nCompany. Its visitors’ section has been renovated and outfitted with lighting.  … …\n>A number of historical sources claim that the cave\ncontinues southward to the Temple Mount area, yet\nwe now know that these claims have no basis in fact.\nA mapping of the cave undertaken by the Israel Antiquities Authority\n in recent years debunks this theory. \nSource :\nhttp://www.israelhayom.com/site/newsletter_article.php?id=4105\n— —\n5 May : Anniversary of Napoleon’s Death … !\nYannick, how are you ?\n\n","date":"May 5, 2014 at 10:51 am","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","id":"comment-111832","author":"Piero","site":"shroudstory"},{"title":"To Yannick on Science and Philosophy","post":"The main problem with Di Lazarro’s experiment is not its “highly unconventional hypothesis” (shroud collapsing into a radiating body – sci fi), but that it doesn’t meet the criteria of the shroud image.\nConcerning Rogers, critics sum up to the reactant. One should note Rogers thought reactant should come from the skin (SSG mail – no alternative for a diffusion mechanism), something is naive about gases coming from the orifices forming the image (wether it comes from Di Lazarro -cf his slide at the Valencia conference – or Rogers).\nI doubt it could be a post mortem change – hairs don’t decompose – it was slowly produced on the skin and hairs in the tomb. Looking foward to Thibault Heimburger’s candidates.\n\n","date":"May 5, 2014 at 2:28 pm","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","id":"comment-111996","author":"anoxie","site":"shroudstory"},{"title":"To Yannick on Science and Philosophy","post":"Here’s MY personal guess:\nProbably some biological substance left on the skin and hair by the drying sweat (like urea for example, which could have eventually produced some ammonia gases or like lactic acid) and/or some highly volatile and reactive burial product (or products), along with a probable release of heat from the fresh tortured corpse and also a possible release of water vapor, which could have contributed to a coloring reaction on parts of the Shroud that were at short distance from the corpse (less than 3.7 cm).\nAnd I must say that, on the contrary to Anoxie, I’m not ready to completely discard the possibility of a very  weak release of post-mortem gases by the whole corpse and, if I understand correctly Fazio and Mandaglio’s hypothesis concerning a stochastic process for image formation, I think such a very small amount of energy that could have been released by the dead body (which could well have been much lower than what Rogers thought) could well have been able to start the process of a latent image that would, some decades later, « develop » into the very faint image we can still see on the Shroud…  I think such a possibility should be investigate much further by a biochemist.  \nI have talked about that with Mr. Fazio and he said this to me: “I also think that is necessary to investigate on the decomposition gases as a possible source that could have triggered the stochastic process that lead to the image formation.\n\n","date":"May 9, 2014 at 8:37 am","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","id":"comment-115382","author":"Yannick Clément","site":"shroudstory"},{"title":"To Yannick on Science and Philosophy","post":"Ammonia is NH3, commonly hydrolises to NH4-OH.  Not to be confused with amines, complex organic compounds containing -NH2 groups. Rogers discounted ammonia as primary cause of image, as ammonia too light and would quickly disperse, although he claimed signs of ammonia were apparent around orifices of nose and mouth.  My comments below gives outline of Rogers’ theory from Thibault’s paper, (side-bar above). A strong argument in favour of Rogers’ hypothesis would seem to be that third phase of process involving amine products, is the production of melanoids.  Rogers claimed that spectral analysis of Shroud image showed presence of melanoids. \nThere has been little experimental follow-up to confirm or refute Rogers’ hypothesis, and I would concur with Yannick’s comment on Fazio note, that experimental work is required to investigate matter further.\n\n","date":"May 9, 2014 at 4:33 pm","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","id":"comment-115615","author":"daveb of wellington nz","site":"shroudstory"},{"title":"To Yannick on Science and Philosophy","post":"Rogers did used ammonia during a coloring experiment and got the best matching result anyone ever had versus the Shroud image in term of color, color penetration, etc.  So, I don’t think we should discard ammonia has the primary source of the image IF this is a result of a stochastic process involving FAR LESS ammonia than what Rogers thought.  Note that Rogers never thought the Shroud image was the result of a stochastic process, which requires much less energy than what he thought…\n\n","date":"May 9, 2014 at 4:36 pm","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","id":"comment-115618","author":"Yannick Clément","site":"shroudstory"},{"title":"To Yannick on Science and Philosophy","post":"Yannick, I already commented on this, see below, May 5, 5:13pm, first para, note 4):\nAlso from Thibault’s paper, quoting Rogers, pp.3-4:\n“Much has been made of ammonia being produced from sweat by hydrolysis of urea (H2NCONH2).\nCO2 (and some carbamates) is the other final product. I have not been able to find any sweat analyses that showed urea as a major component. In any case, the reaction would be over in a few hours. Ammonia would leave a fog of color on the cloth, because it diffuses quite rapidly. The image was not\nprimarily formed by ammonia. The fog around the nose and mouth looks to me like some ammonia was involved (“I think I see”).” \nAlthough Rogers used ammonia to obtain coloration of Edgerton linen treated with dextrin & saponaria, he apparently dismisses it as primary cause of image, presumably because of its volatility.\n\n","date":"May 10, 2014 at 4:39 am","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","id":"comment-115923","author":"daveb of wellington nz","site":"shroudstory"},{"title":"To Yannick on Science and Philosophy","post":"Last night I carefully reread the first part of Thibault’s paper on Rogers’ explanation of the Maillard reaction. A number of aspects struck me.  1) I felt the explanation was essentially speculative and theoretical but unsupported by any direct experimental evidence carried out by Rogers himself – he does not quote any experimental evidence to support his explanation.  2) Rogers clearly felt that there were many unknown aspects in the process he expounded, for example he seems to feel compromised by not knowing the density gradient of the amines between the skin and the cloth, although he believed the data was in possession of what he calls the “Body Farms”.  3) He comments that some of the amines are unstable, that image density was therefore dependent on path length, and so I get the impression that he probably thought that this was a factor in the 3D encoding of the image, which seems reasonable.  4) He dismisses ammonia as being a factor in the imaging process, saying that he is unaware of any ammoniac content in analysis of sweat. Nevertheless the only experiment I’m aware of that he carried out to produce coloration was by using ammonia. 5) He makes a most interesting observation on the spectral analysis of the image, which I feel gives the only present but strong evidence to date for his Maillard hypothesis. 6) He gives a credible explanation of why the hair and beard are imaged, although these do not yield corruption amines.   \nThe greatest weakness in the whole hypothesis I feel is the absence of any other kind of experimental evidence.  There are no experiments with any kind of dead body wrapped in any kind of treated linen, which has to be the crucible for the hypothesis. That is what is really needed, either to confirm it or reject it. I feel it is not enough for a scientist to hypothesise, he must provide the evidential proof, and that is what is lacking in Rogers’ various assertions, regardless of the theoretical soundness of his chemistry. \nBecause of the success of De Liso’s experiments, I continue to be of the view that seismic effects very likely have something to do with image production. Whether it is the effect of seismic mechanical shock, variations in geo-electro-magnetism, release of radon, presence of iron, or whatever, remains unknown. If they are relevant, they may still work in combination with Rogers’ Maillard explanation.   \nThere may or may not have been miraculous elements to it.  Whether these were merely the providential concomitant combination of essential environmental factors on a natural occurrence, or a more direct divine intervention, remains speculative.  Whatever, despite the time lag from Delage’s and Vignon’s first scientific investigations, this is not sufficient to assert a miraculist explanation as the only one viable. Why?  Because the naturalistic explanations still remain untested and much experimental work remains as yet undone.\n\n","date":"May 5, 2014 at 5:13 pm","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","id":"comment-112105","author":"daveb of wellington nz","site":"shroudstory"},{"title":"To Yannick on Science and Philosophy","post":"The empirical evidence to support a Maillard connection to the Shroud is in the blueprint stage at best.  The chemistry may or may not be in place for the production of a colored substrate.  There is a separate issue of resolution-achieving such definition throughout the length of the body, front & back.  At this stage, it’s an idea but that’s as far as it goes-no matter how emotionally attached YC is to it because it satisfies his criteria for being completely naturalistic without any contribution that may be undefined, the evidence for this is TBD.\n\n","date":"May 5, 2014 at 8:19 pm","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","id":"comment-112255","author":"Kelly Kearse","site":"shroudstory"},{"title":"To Yannick on Science and Philosophy","post":"I do not accept the Maillard theory primarily because it is based on gaseous emissions (of ammonia that somehow interacted with a carbohydrate layer.)  One of the key attributes of the Shroud image is the intensity of the image is uniform top to bottom and front to back. No difference in image intensity. To think that gaseous emissions could have created such a uniform image is beyond reason.  Gas does not escape a decaying corpse in any uniform manner.  Thicker parts of the torso would exhibit more decay and therefore more gas emissions. Natural orifices in the body would offer the path of least resistance and should also show more gas emissions.  This is not seen on the Shroud. Vignon proposed gas and was dismissed early in Shroud research.  Why this is any different is beyond me. Rogers has made important contributions, this is not one of them IMHO.\n\n","date":"May 5, 2014 at 8:52 pm","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","id":"comment-112284","author":"Russ Breault","site":"shroudstory"},{"title":"To Yannick on Science and Philosophy","post":"I think the body had been prepared before being wrapped in the shroud, that’s for the “uniform” part.\nOr you could say, “i do not think it’s real because i can’t see enough blood” or “bloodstains are too uniform top to bottom and front and back”, be systematic.\n\n","date":"May 6, 2014 at 10:59 am","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","id":"comment-112839","author":"anoxie","site":"shroudstory"},{"title":"To Yannick on Science and Philosophy","post":"With all due respect to Russ, I believe that Rogers’ Maillard hypothesis cannot be dismissed so easily.  Note that Rogers specifically excludes ammonia as the cause as it disperses too quickly.  I would agree that the theory at present is short on experimental evidence.  The theory is summarily set out on pp.1-2 of “ROGERS’ MAILLARD REACTION (etc)” by Thibault Heimburger in the side-panel link above.  To anyone unfamiliar with the workings of organic chemistry, even this summary can be heavy going.  \nRogers sees the Maillard reaction as a three-phase process. Essential to the theory is the slow formation of amines (staining vapours) of various sorts evolved from the surface of the body due to sweat and the initial decomposition.  The products are diverse and several. In the third phase of the reaction, the products undergo aldol condensation and polymerise into true melanoids.  I think that one of the strongest arguments favoring Rogers’ theory is that he can claim: “The spectral evidence from the Shroud indicates that the image is a complex mixture of melanoids.” If correct, I would see this as strong supporting evidence but would agree that it is insufficient by itself. Rogers claims: “The evidence supports a low-temperature image-color-formation process.”  He suggests that ammonia may have been involved in the areas around the nose and mouth.  \nI can only recommend a reading of the first few pages of Thibault’s paper to obtain some minimum understanding of what Rogers believed was the cause of the image.  Whether he was correct or not can only be proven by future experimentation. At this stage I couldn’t dismiss it as necessarily unlikely.\n\n","date":"May 5, 2014 at 10:02 pm","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","id":"comment-112351","author":"daveb of wellington nz","site":"shroudstory"},{"title":"To Yannick on Science and Philosophy","post":"I hope that controlling the material (using the SPM techniques)\nwe can find the truth about the (presumed) ancient technology …\nHeare an example of ancient technology :\nHave you read the recent news about the study on egyptian pyramids ?\nOne question that long puzzled scientists is how Egyptians\nmanaged to move those colossal pyramid stones – some\nof which weigh several tons !\nHere the reference :\nSliding Friction on Wet and Dry Sand\nPhys. Rev. Lett. 112, 175502 – Published 29 April 2014\nA. Fall, B. Weber, M. Pakpour, N. Lenoir, N. Shahidzadeh, J. Fiscina, C. Wagner, and D. Bonn \nHere the abstract :\n>We show experimentally that the sliding friction\non sand is greatly reduced by the addition of\nsome—but not too much—water. The formation\nof capillary water bridges increases the shear modulus\nof the sand, which facilitates the sliding. Too much\nwater, on the other hand, makes the capillary bridges\ncoalesce, resulting in a decrease of the modulus;\nin this case, we observe that the friction coefficient\nincreases again. Our results, therefore, show that\nthe friction coefficient is directly related to the shear\nmodulus; this has important repercussions for the\ntransport of granular materials. In addition, the polydispersity\nof the sand is shown to also have a large effect on\nthe friction coefficient.\nand,\nunder the address :\nhttp://www.csmonitor.com/Science/2014/0502/Ancient-Egyptians-used-wet-sand-to-drag-massive-pyramid-stones-say-scientists\nI have read :\n> …other researchers say that Egyptians also used desert clay\nas a lubricant. Mark Lehner, director of Ancient Egypt Research\nAssociates (AERA) says that thin tafla clay layers have been seen\nunder multi-ton blocks either left in place at the wall of a temple\nor other monument, or where workers left the blocks en-route,\nand not yet in their intended place in a building. …\n— —\nWell.\nWhat are your comments ?\n— — — —\nWarning : this is not a Gnostic story …\nand\nI believe that we have to work in the field of nanomechanics …\n\n","date":"May 6, 2014 at 8:58 am","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","id":"comment-112744","author":"Piero","site":"shroudstory"},{"title":"To Yannick on Science and Philosophy","post":"https://shroudofturin.files.wordpress.com/2012/06/maillard_i__my_paper.pdf\nPlease read again this paper.\nAnoxie wrote: “I doubt it could be a post mortem change – hairs don’t decompose – it was slowly produced on the skin and hairs in the tomb. Looking foward to Thibault Heimburger’s candidates”\nI’ll try to give you the results of my researches and thoughts in the next few days.\nThank you for your patience.\n\n","date":"May 6, 2014 at 4:09 pm","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","id":"comment-113089","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"To Yannick on Science and Philosophy","post":"In last para of my comment above, I said “I can only recommend a reading of the first few pages …” when I meant that the first few pages contained a succinct summary of Rogers’ theory adequate for those not familiar with advanced organic chemistry.  The entire paper is a ‘tour de force’ providing a comprehensive survey of Rogers’ thinking, but can be heavy going for those unfamiliar with the technical concepts involved. Thank you, to Thibault.\n\n","date":"May 6, 2014 at 5:15 pm","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","id":"comment-113122","author":"daveb of wellington nz","site":"shroudstory"},{"title":"To Yannick on Science and Philosophy","post":"Here’s a reply for Dan concerning the comments he made on-top of this page (I hope this will help people understand better the heart of what I tried to expressed):\nWhat I tried to express is the FACT that Rogers proved, at least to me, that the image on the Shroud CANNOT have been produced by a high amount of energy (whatever energy you can think of) but, on the contrary, come from a very mild process involving a low amount (and probably a VERY low amount) of energy that occurred at normal temperature.  Here, people MUST NOTE that this conclusion of Rogers (again, remember that he was one of the few scientist who was able to see the Shroud image up, close and personal in Turin and then, to analyze it in deep after that) has been fully accepted since by nuclear physicists like Fazio and Mandaglio in Italy who are true expert in questions related to high energetic radiations.\nConsequently, what I wanted to underline is the FACT that Rogers’ conclusion about the image formation on the Shroud goes TOTALLY AGAINST any image formation hypothesis involving some form of a high energetic radiation, whether it concern a burst of UV light (Jackson, DiLazzaro, etc.), a burst of electric discharge (Fanti, DeLiso, etc.), a burst of radiation (Moran, Rinaudo, etc.) or some other form of process involving a high amount of energy (like Colin Berry’s scorch hypothesis for example).  Therefore, Rogers’ conclusion is able (at least to me) to completely discard any image formation hypothesis involving a by-product of the Resurrection (or a manmade forgery involving a high amount of energy) and that’s why I said that Rogers was able to proved the image was not the result of a supernatural process.\nOf course, there is still a (very slim in my mind) possibility that this image was the result of a true miraculous process that did not involved any high energetic by-product of the Resurrection (but if that would be the case, then why on earth such a miraculous image would be incomplete with some missing parts like STURP saw behind the knees or in the feet area???)…  \nBut that was not what I had in mind when I wrote that he did proved that the image was not the result of a miraculous process.  You can understand now that what I had in mind was all the supernatural hypotheses that have been proposed over the years involving some form of a high energetic radiation, which are the most common hypotheses proposed by those who believe the Shroud image is directly related to the Resurrection…  I hope that, now, you understand better what I tried to express in my recent email to you.\n\n","date":"May 7, 2014 at 8:32 am","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","id":"comment-113698","author":"Yannick Clément","site":"shroudstory"},{"title":"To Yannick on Science and Philosophy","post":"I have read the interesting intervention and the wrong phrases\nwritten by Yannick :\n-I tried to expressed\nIn my opinion this is an incorrect English language instead of :\n“I tried to express”\n– to proved the image was not the result …\nIn my opinion this is an incorrect English language instead of :\n“to prove the image was not the result …”\n— —\nBut the ideas on energy of our dear friend Napo-Yannick\nare clearly expressed … (Sorry… I nicknamed Yannick-Napoleon\nbecause, often, several errors appear in my messages on this blog and then\nI tried to undramatize …). \nThen (in my opinion) a careful control about the heat transfer on linen fibrils\nis of paramount importance.\nAnd a COMSOL model will be useful.\nDo you agree on that very simple remark/suggestion ?\n— —\nIn any case I don’t believe that Rogers was able\nto prove the lack of supernatural process.\nHe had very few linen material at disposal…\nThe questions about the lack of image\nbehind the knees and feet area\nworth to be deepened.\nB.T.W. :\nWhat are the exact ideas about the linen draping\nover the corpse laid in rigor mortis ?\nWhere is the (presumed) heat flux discontinuity ?\nIf we have the human body model (like the remarkable sculpture by Mattei)\nat disposal these missing parts will be more simple\nto discuss and (perhasps) to understand …\nPost-mortem temperatures and Computer Model.\nThe bio-heat transfer problems can be solved\nusing the bio-heat transfer model.\nDo you know the bioheat equation, the Fourier’s law and the\ndifferent kind of thermal conductivity of tissues ?\nThermal infrared images obtained using a plastic\ndolly /mannikin (= corpse model) filled with relatively hot\nwater (20-14 Celsius ???) can be used to verify the\ninherent claims …\nThen see also the question about the improved\nbody segmentation (with detailed segments and temperature profiles).\nVerify what wrote Arpad Vass in the past about the decomposition\nchemistry and the bacterial metabolism (metabolic heat source in a dead body…\nhmmm … perhaps this is very low) and the possible news\n(measurements about the exact amount of heat transfer rate at skin surface\nexpressed as W/[squared m], evaporative heat transfer rate\nexpressed as W/[squared m], evaporative heat loss, etc. …) …\n— —\nAnd at the end …\nhere a vague reference :\nCOMSOL – Introduction to Heat Transfer Module (VERSION 4.3)\nCopyright 1998–2012 COMSOL\nThe Medical Technology section in the Model Library introduces the concept of bioheating…\nSee at page 9 (of 38) of that document.\nhttp://www.comsol.com/model/download/142935/IntroductionToHeatTransferModule.pdf\n>The Bioheat Transfer interface is a dedicated interface for heat transfer in living (!!!!) tissue. The bioheat model described in this interface has been verified for different types of living (!!!!) tissue..\n(at page 12 (of 38) of that document).\n\n","date":"May 8, 2014 at 7:59 am","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","id":"comment-114548","author":"piero as piezonuclear zealot","site":"shroudstory"},{"title":"To Yannick on Science and Philosophy","post":"Message for Daveb and anyone else interested by the subject of ammonia as a potential source for the image formation process.  I have made a quick survey of Ray Rogers writings and here’s what I have found concerning this topic:\n“Image characteristics indicate that AMMONIA diffused from the nose and mouth, suggesting that the body was wrapped fairly soon after death. The body image has good resolution, suggesting that heavy amines appeared slowly at lower temperature.” (quote from “A Chemist’s Perspective on the Shroud of Turin”).\n“The cloth was used to wrap a dead body. AMMONIA and other volatile amine decomposition products reacted rapidly with reducing saccharides on the cloth in Maillard reactions. The cloth was removed from the body before liquid decomposition products appeared. The color developed slowly as Maillard compounds decomposed into final colored compounds.” (quote from Scientific method applied to the Shroud of Turin – A Review).\n“Post-mortem body temperatures can reach 43°C (110°F), and steep temperature gradients would exist across the cloth as a result of the low thermal diffusivity of linen and the angular dependence of radiant heat flow from a nonmetallic surface. The temperature gradients will have a large effect on Maillard reaction rates and image resolution before the body cools, i.e., while AMMONIA is the predominant amine.” (quote from “A Chemist’s Perspective on the Shroud of Turin”).  Personal note: This particular quote clearly shows that, for Rogers, ammonia was the predominant substance involved in the first stage of the image formation on the Shroud (which would have been mostly restricted to the head area), before heavier amines could takes the lead and complete the process in order to form the full body image we see on the Shroud.\n“Most of the very volatile AMMONIA diffuses out through the nose and mouth soon after death. This fact may explain the darker image color between the nose and mouth and penetration of image color in the vicinity of the hair.” (quote from “A Chemist’s Perspective on the Shroud of Turin”).  \n“The ammonia and many of the decomposition amines are volative and basic (they increase the pH into a more favorable range for Maillard reactions), and they rapidly undergo Maillard reaction with any reducing saccharides they contact. The reactions are rapid at room temperature, or even lower. Such sugar-amines reactions offer a natural explanation for the color on the Shroud.” (quote from “A Chemist’s Perspective on the Shroud of Turin”).  \n“Experimental manipulations of concentrations and one-dimensional migration of solutions (of Saponaria), as in a large cloth, could produce the same front to back color separation and color density as observed on the Shroud. The fibers on the top-most surface are the most colored when observed under a microscope, and the color is a golden yellow similar to that on the Shroud. The coating of Maillard products is too thin to be resolved with a light microscope, and it is all on the outside of the fibers. There is no coloration in the medullas: The color formed without scorching the cellulose. There is very little color on fibers from the middle of the back surface. The color-producing saccharides had concentrated on the evaporating surface. Water-stained image areas on the Shroud showed that image color does not dissolve or migrate with water. Maillard products are not water soluble, and they do not move when wetted.” Personal note: This is the summary of the results obtained by Rogers after he did a preliminary coloration test with a “primitive-type” linen sample (i.e. made with the ancient technique used to manufacture linen cloths) that had been treated at room temperature for 10 minutes with AMMONIA vapor. As Rogers said: “A very light color could be observed on the top surface after standing 24 hours at room temperature.”  But, in order to obtain a similar coloration than what is observed on the Shroud, he had to heat his sample, which indicates that such coloration would only appear after a pretty long period of time (which could possibly be counted in years). That means the image on a linen cloth that can be obtained with a Maillard reaction is a latent image that can only become fully visible a long time after the initial reactions occurred.\nI hope Daveb that you now understand that, in Rogers mind, ammonia probably played a partial role in the global image formation, so it would be wrong, for any serious researcher, to discard this biological product as a potential source (alone or with other substances) for the process that lead to the formation of the image on the Shroud. \nNote that, in Rogers’ mind, the ammonia that could have taken part in the image formation was mostly coming from the lungs out of the nose and mouth, while there is also another possibility that was mentioned in Thibault’s paper, which is that the intense sweat of the Shroud man, because of the tortures he endured, had a very high content of urea and then, after a complete drying of that sweat (which was most certainly covering every part of his body, including the hair), part of this urea would have been left there and eventually turn itself into ammonia, which would have been released by every parts of the body.  This possible hypothesis has never been properly analysed by a chemist (not even Rogers!) and it would be nice if someone could do the work, while keeping in mind the conclusion of Fazio and Mandaglio in Italy, who think the image, because of its very unique characteristics, is the result of a natural stochastic process involving a dead body (note again that Rogers never thought about that possibility).  \nI said this because, for a stochastic process of that nature, it would probably not require as much amines as Rogers thought in order to achieve the image we see on the Shroud (which would have been a latent image that would have only become fully visible after maybe a few decades).  So, a good scientific inquiry would be to test the “urea left over the body and hair by the drying sweat” hypothesis in the light of the stochastic process proposed by Fazio and Mandaglio and see what could be the minimum amount of ammonia that would be required to achieve an image like we see on the Shroud and if this kind of very weak release of ammonia vapor could be able, under certain specific conditions and without the help of heavier amines or other biological substances, to produce a body image like the one we see on the Shroud.  I’m pretty sure the result concerning the first question (i.e. how much ammonia would be needed to produce the kind of body image we see on the Shroud if the image formation process was stochastic in nature) would be much lower than what Rogers had in mind concerning the minimum amount of amines (including ammonia) that would be needed to produce the kind of full body image of the Shroud (of course, this is only a personal guess, but which is nevertheless based on the work of Fazio and Mandaglio)…\n\n","date":"May 11, 2014 at 4:56 pm","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","id":"comment-117156","author":"Yannick Clément","site":"shroudstory"},{"title":"To Yannick on Science and Philosophy","post":"I can only think of two possibilities:\n1) Either you are misreading / misinterpreting Rogers; OR\n2) Rogers is contradicting himself.\nFor he says quite clearly (see previous quotes):\n“Much has been made of ammonia being produced from sweat by hydrolysis of urea (H2NCONH2).”\n“CO2 (and some carbamates) is the other final product. I have not been able to find any sweat analyses that showed urea as a major component. In any case, the reaction would be over in a few hours. Ammonia would leave a fog of color on the cloth, because it diffuses quite rapidly. The image was not primarily formed by ammonia. The fog around the nose and mouth looks to me like some ammonia was involved (“I think I see”).” \nI consider that in the absence of any proven experimental evidence, the question remains unfortunately quite academic, until such time as essential experimental research is carried out to prove the matter one way or the other.  The contradictions you have raised do little to build any kind of confidence in Rogers’ hypothesis regardless of any true merit that they might have. Clearly there is confusion, perhaps even in Rogers’ own mind, about these matters.\n\n","date":"May 12, 2014 at 3:07 am","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","id":"comment-117554","author":"daveb of wellington nz","site":"shroudstory"},{"title":"To Yannick on Science and Philosophy","post":"Or 3) Rogers changed his mind. Perhaps the dates of the various quotes are important.\n\n","date":"May 12, 2014 at 5:57 am","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","id":"comment-117648","author":"Hugh Farey","site":"shroudstory"},{"title":"To Yannick on Science and Philosophy","post":"I was drawing on Thibault’s paper of August 2012, “ROGERS’ MAILLARD REACTION HYPOTHESIS EXPLAINED IN DETAIL BY ROGERS HIMSELF.”  After noting that Roger’s hypothesis is well-known and stated in many papers, Thibault’s intention in compiling his paper is stated as: “However the many details of the thought of Rogers are generally not known but are available in several messages sent to the members of the private Shroud Science Group.\nI have gathered here most of them. My hope is that this could help to better understand the MRH and hopefully to discuss step by step all the aspects on a more sound basis.” \nUnfortunately no dates are given to trace any transition in the progress of his thought, but this paper seems entirely quite self-consistent.  I concede that Rogers allows that the images of hair and beard may have been driven by ammonia, but in more than one place he considers that the staining vapours are caused by heavy amines [compounds with -NH2 groups] from the skin, and discounts ammonia as the principal imaging agent elsewhere. \nAlthough Rogers formed his hypothesis on interpreting some factual observation, together with his detailed chemical knowledge, I feel that the theory leans rather too heavily on a theoretical basis, and not sufficient on proven experiment.  The most striking thing I consider supporting the hypothesis is that the image seems to be made up of melanoids (determined by spectral analysis), and this is the third phase of the process he outlines in the various amines reacting with the sugars (or starches?).\n\n","date":"May 12, 2014 at 6:33 am","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","id":"comment-117666","author":"daveb of wellington nz","site":"shroudstory"},{"title":"To Yannick on Science and Philosophy","post":"Ammonia is too light, that’s why he thought of temperature gradient and heavier molecules to explain the resolution.\nTemperature gradients required are unrealistic, remains heavier molecules, tbd as said Kelly Kearse.\n\n","date":"May 12, 2014 at 11:20 am","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","id":"comment-117843","author":"anoxie","site":"shroudstory"},{"title":"To Yannick on Science and Philosophy","post":"Many things to say concerning Hugh and Daveb’s recent comments:\n1- I will publish in a near future a new paper in which I express my thoughts about the very interesting “new” paper of Rogers (http://www.shroud.com/pdfs/rogers10.pdf) and one of the most interesting thing we can learn from this paper is the fact that, along the road, Rogers did changed his mind concerning the most probable “reactive agents” that started the Maillard reaction on the Shroud’s surface, while he first thought about Pellicori’s own hypothesis involving the sweat and/or some burial products that would have been present on the skin of the Shroud man and which would have reacted with the carbohydrates impurities on the Shroud’s surface. Then, later on in his inquiry, he concluded that the Shroud man’s skin was most probably dry at the time of his burial and that there was probably no burial product that were present on his skin, and that’s when he favored the release of post-mortem gases (including ammonia for the head region including the hair) and heavier amines for the whole body).\n2- While it is a proven fact that Rogers changed his mind about the most probable “reactive agents”, it seems to me (based on this paper written in 2001), that he already had came up back then with the impurity hypothesis for the image chromophore and stay with it up until his dead. Thiis fact is very telling to me when it comes to favored the most probable hypothesis concerning the image chromophore and that’s why I favored Rogers’ hypothesis about the impurities much more than Fanti’s PCW hypothesis…\n3- Based on this 2001 paper, it also seems that Rogers changed his mind concerning the exact nature of the image formation process, while he first thought of something involving a caramelization of the impurities and then, came up with the idea of a Maillard reaction, which happen at much lower temperature than what it takes to obtain a caramelization of carbohydrate impurities.\n4- I think Daveb misunderstand Rogers words concerning melanoid, which doesn’t exclude the presence of ammonia as part of the global Maillard reaction. What I understand personally is this: Once he changed his mind about the most probable “reactive agents” that would have contributed to the image formation (from skin secretion and/or burial products to post-mortem gases), he always kept ammonia as a possible source for the Maillard reaction, BUT ONLY for the head region (including the hair). The rest of the body image would have been formed, in Rogers mind, by heavier amines that would have been released by all the pores of the Shroud man’s skin. And, for Rogers, all those amines (including ammonia) would have taken part in the Maillard reaction that possibly occurred in a thin layer of carbohydrate impurities that was coating the topmost fibers of the cloth, which produce brown compounds called “melanoids” by chemists. So, the probable fact that the Shroud image “is a complex mixture of melanoids” (Rogers’ own words taken from Thibault’s paper) doesn’t exclude for one second the possibility that a certain amount of ammonia had taken part in the global image formation process. Now, the question that would be nice to determine is: in what kind of proportion did ammonia could have been part of the whole image formation process? As I said earlier, if we believe Fazio and Mandaglio’s hypothesis concerning a stochastic process, I don’t think we can discard completely the idea of an image totally produced by a very small release of ammonia from the skin and hair (which would have come from urea deposits that would have been left there after the drying of the intense sweat of the Shroud man; note that Thibault proposed this possible “alternative solution” in his paper and personally, this is the kind of solution that I consider very interesting and which deserve to be tested properly under good lab control).\nI also want to comment this recent quote from Anoxie: “Temperature gradients required (in order for Rogers’ hypothesis to work good) are unrealistic,”\nReply: I’m not sure this is 100% sure, especially if the image came from a stochastic process, as proposed by Fazio and Mandaglio, which would have needed a much low amount of energy released than what Rogers thought. Note that Fazio and Mandaglio both concluded that a weak release of heat by the fresh tortured corpse was the most probable source for the image, while Rogers only thought heat was a “secondary” source for the image (note again that he never had a stochastic process in mind for image formation).\nAnd concerning Fazio and Mandaglio’s hypothesis, I would like to say that even if they think heat coming out of the corpse is the most logical primary cause for the image on the Shroud, they never rejected a Maillard reaction coming from post-mortem gases released by the corpse as another good possibility (but at the difference that it would have happen, for them, in the context of a stochastic process, which could well have involved a much fewer amount of post-mortem gas than what Rogers thought).\nOne very interesting way to check out the validity of Fazio and Mandaglio’s stochastic hypothesis in regard of Rogers’ own hypothesis would be to take the very same kind of linen sample used by Rogers (made the ancient way) and, instead of submitting it for 10 minutes to ammonia vapor, submitting it to just 1 or 2 minutes of the same ammonia vapor and then, bake it a bit stronger than Rogers did to simulate more ageing (in the context of a latent image that would have taken decades to fully develop) and see if the coloring result could be similar to what Rogers get\n\n","date":"May 12, 2014 at 3:34 pm","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","id":"comment-118002","author":"Yannick Clément","site":"shroudstory"},{"title":"To Yannick on Science and Philosophy","post":"What exactly are these “heavier amine” substances and does their post-mortem release occur within the specific time frame, or later?\nWhat effect does swelling, edema of the skin have on this type of release, for example on the right side of the face, are the pores more constricted, more open?  Will diffusion be impeded, enhanced, or no effect? is this worth considering?\nIt’s one thing to get coloring from gaseous diffusion in an experiment; it’s another matter to achieve resolution & detail from a three dimensional substrate. The variables are numerous here-science doesn’t require or need to use such a large shoehorn to help it fit-it needs empirical data\n\n","date":"May 12, 2014 at 6:33 pm","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","id":"comment-118106","author":"Kelly Kearse","site":"shroudstory"},{"title":"To Yannick on Science and Philosophy","post":"There are so many possible (natural) factors that could have been at work in order to produce the image that it would be nice to see a biochemist taking the work of Rogers and others (like Fazio and Mandaglio’s work) and push this further through much more experiments than what Rogers had time to do before his death.  Note that Fazio and Mandaglio’s hypothesis has never been tested Under proper lab control (not even by them!), so it’s evident that much more work needs to be done before we can see more clearly if some form of diffusion from a dead body can eventually produce the kind of image we see on the Shroud…\n\n","date":"May 13, 2014 at 8:32 am","url":"https://shroudstory.com/2014/05/05/to-yannick-on-science-and-philosophy/","cat":"image_theory","id":"comment-118538","author":"Yannick Clément","site":"shroudstory"}]
