[{"title":"Today’s project – to produce a new chronological flow chart, proposing how a scorch image was ingeniously re-invented as a  whole body “sweat imprint”  (to suggest kinship with the Veil of Veronica).","post":"Correction: psychiatry, not psychology.\nhttp://psychiatry.yale.edu/people/james_charney.profile\n","date":"February 21, 2014 at 5:04 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2014/02/20/todays-project-to-produce-a-new-chronological-flow-chart-proposing-how-a-scorch-image-was-ingeniously-re-invented-as-a-whole-body-sweat-imprint-to-suggest-kinship-with-the-veil-of-veronica/","cat":"medieval_forgery","id":"comment-3097","author":"pelicancrest","site":"colinberry"},{"title":"Today’s project – to produce a new chronological flow chart, proposing how a scorch image was ingeniously re-invented as a  whole body “sweat imprint”  (to suggest kinship with the Veil of Veronica).","post":"You may want to consider the possibility of contacting art historian Noah Charney about your work.  There are many links on the Internet to articles about him/his publications.  His father Dr. James Charney is a psychologist in New Haven, Conn.  His mother Diane Joy Charney is a professor of French at Yale.  Noah, born 1979, has his own webpage and a Wikipedia entry. There are also a number of internet links about his mother.  Noah’s focus is on art crime, but I believe his areas of interest include forgeries.  I recently bought Noah Charney’s book about The Ghent Altarpiece/Mystic Lamb.\nI find the Templar member Charney to be an interesting coincidence.\nBest,\npelicancrest\nDistant great-granddaughter of the Rev. Thomas Hooker, founder of Hartford, Conn.\n","date":"February 21, 2014 at 3:49 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2014/02/20/todays-project-to-produce-a-new-chronological-flow-chart-proposing-how-a-scorch-image-was-ingeniously-re-invented-as-a-whole-body-sweat-imprint-to-suggest-kinship-with-the-veil-of-veronica/","cat":"medieval_forgery","id":"comment-3096","author":"pelicancrest","site":"colinberry"},{"title":"Today’s project – to produce a new chronological flow chart, proposing how a scorch image was ingeniously re-invented as a  whole body “sweat imprint”  (to suggest kinship with the Veil of Veronica).","post":"Hello again Pelican.  The trouble is that it’s not art in the usual sense of the word. Any art would have been in the making of a template from which to produce a representation of a roasted Templar, and the artisan and his commissioner would have known that a scorch imprint (a light/dark reversed negative in modern terminology) did not have to be exact, which is why I consider that a bronze crucifix or similar might have been used. (It’s only through relatively modern photography, i.e. Secondo Pia’s 1898 light/dark reversed image that I suspect that a crucifix was used, knowing that a beard. long hair etc were features shared by both Jesus and de Molay. The latter was much older of course, but many have remarked that the TS image is of a man much older than a 33 year old. Might a separate bas relief have been used as template for the face, as suggested by Luigi Garlaschelli?\nAs for the Lirey badge, there seems to be absolutely no attempt to portray a Christ-like figure. Itwas that which set me on the the route of thinking that the TS image was initially intended to represent someone other than Jesus, and if a scorch, to look around for anyone who was scorched in that era of French history. The de Charney/de Charny uncle/nephew relationship proposed by Noel Currer-Briggs was all the encouragement I needed to make the Templar connection, but that clearly was not the whole story. There would have been attempts to disguise that later (thus fooling generations of scholars who have assumed  that the present TS image was formed in a single step). I say it was formed in two steps- an initial, rather unsubtle scorch, that was then doctored until it could be marketed as a sweat imprint – big brother to the Veil of Veronica. That’s why there’s that little inset face of Jesus on the Machy mould for Mk 2 Lirey badge, – to push a connection with the Veronica (thoughtfully labelled SUAIRE) which is not only “SHROUD” in French, but face-cloth too, for the absorbing/imprinting of sweat, SUEUR in French, a word v. similar to SUAIRE.\n","date":"February 21, 2014 at 5:57 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2014/02/20/todays-project-to-produce-a-new-chronological-flow-chart-proposing-how-a-scorch-image-was-ingeniously-re-invented-as-a-whole-body-sweat-imprint-to-suggest-kinship-with-the-veil-of-veronica/","cat":"medieval_forgery","id":"comment-3098","author":"colinsberry","site":"colinberry"}]
