[{"title":"Use of Coins in Jewish Burial","post":"Finding a coin in the ossuary of someone buried with Caiphas is not something so surprising when you understand that Caiphas, like most high priest before the fall of Jerusalem in 70 AD, was a member of the Saducees, not the Pharisees.  The Suducees were mostly rich families well known for their Greco-roman way of life.  Many of them were Hellenistic Jews.   The skeptics who don’t believe me just have to go there : http://www.jewishvirtuallibrary.org/jsource/History/sadducees_pharisees_essenes.html and here’s what they’ll found about the Saducees :\n“The Sadducees\nThe Sadducees were elitists who wanted to maintain the priestly caste, but they were also liberal in their willingness to incorporate Hellenism into their lives, something the Pharisees opposed. The Sadducees rejected the idea of the Oral Law and insisted on a literal interpretation of the Written Law; consequently, they did not believe in an afterlife, since it is not mentioned in the Torah. The main focus of Sadducee life was rituals associated with the Temple.\nThe Sadducees disappeared around 70 A.D., after the destruction of the Second Temple (see below). None of the writings of the Sadducees survived, so the little we know about them comes from their Pharisaic opponents.\nThese two “parties” served in the Great Sanhedrin, a kind of Jewish Supreme Court made up of 71 members whose responsibility was to interpret civil and religious laws.”\nBack to my comment :  So, once you know this part of Jewish history, it’s not a surprise at all to find the sign of a pagan rite in the tomb of Caiphas, even if it was a close member of his family or even his wife.  Now, if this coin would have been found in the own skull of Caiphas, that would have been another story in regard of his function as a leader of the Jews.  But who knows ?  He wouldn’t have been the first one in history to not doing what he preached !!!   So, to me, this finding is not a proof at all that this Pagan rite was generalized among pious Jews of the time of Christ.  Was it so among Hellenistic Jews ?  Now, this is another story…  It’s hard to say.  But, I wouldn’t be so surprise that it was not so uncommon among them.  On the other hand, the fact that coins like that seemed not to have been found in great quantities in ancient jewish tombs is a sign that maybe it wasn’t a procedure so common, even for Hellenistic Jews.\n\n","date":"October 25, 2011 at 3:37 pm","url":"https://shroudstory.com/2011/10/24/use-of-coins-in-jewish-burial/","cat":"image_theory","id":"comment-4340","author":"Yannick Clément","site":"shroudstory"},{"title":"Use of Coins in Jewish Burial","post":"Yannick, I don’t think anyone here has claimed placing coins on the eyes of the deceased in that era was a ‘common’ practice, but that coins have periodically been found in Jewish tombs of that period and where one can say quite precisely, that it was practiced!. Enough so, so one may conjecture that coins may have been used on the man on the Shroud (if those protrusions are really coins).So the message is; it CANNOT BE RULED OUT COMPLETELY!….Pretty simple reasoning, to me. Now whether those artifacts are really coins, the argument is useless at the moment. I think everyone here has agreed that much more scientific study is needed. Until then this argument will just go in circles.\nRon\n\n","date":"October 26, 2011 at 7:04 am","url":"https://shroudstory.com/2011/10/24/use-of-coins-in-jewish-burial/","cat":"image_theory","id":"comment-4348","author":"Ron","site":"shroudstory"},{"title":"Use of Coins in Jewish Burial","post":"Ron you said : “it CANNOT BE RULED OUT COMPLETELY!”\nI agree with you !  But, if you take all the data and put it together to have a good overview of the situation, the probability for coins being put over the eyes of Christ is VERY VERY LOW.  We are in the probability domain here since science has not been able to prove the presence of those coins.  And the probability for their real presence is VERY VERY LOW.  That’s what I say.\n\n","date":"October 26, 2011 at 8:32 am","url":"https://shroudstory.com/2011/10/24/use-of-coins-in-jewish-burial/","cat":"image_theory","id":"comment-4355","author":"Yannick Clément","site":"shroudstory"},{"title":"Use of Coins in Jewish Burial","post":"And I say the probability is not “very, very low” but UNDECIDED, or even 50/50, nothing more. I think I personally have a pretty good ‘overview’ of the situation. I for one will not at this moment conclude either way on the supposed ‘artifacts’ or their probability of actually existing, as science to this day has basically told us very little about this Shroud and I am not ready to totally dismiss Dr Filas’s and others work on the matter!…Historically, we also cannot assume anything about the practices of first century Jewish burials, or of actions taken on that particular day by anyone present, as that is just plain speculation. We know very little, to nothing about those present at the burial or of thier  beliefs, (Did anyone on that day actually think Jesus was the messiah for instance?). So we cannot come to any conclusions whatsoever. There is always more then one way to look at things, and if keepin with science, all ways or avenues must be followed to make it true science.\n\n","date":"October 28, 2011 at 8:45 pm","url":"https://shroudstory.com/2011/10/24/use-of-coins-in-jewish-burial/","cat":"image_theory","id":"comment-4438","author":"Ron","site":"shroudstory"},{"title":"Use of Coins in Jewish Burial","post":"I am 100% with you Ron!\n\n","date":"October 31, 2011 at 12:53 pm","url":"https://shroudstory.com/2011/10/24/use-of-coins-in-jewish-burial/","cat":"image_theory","id":"comment-4493","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Use of Coins in Jewish Burial","post":"TO REALLY UNDERSTAND ONE THING IS TO BE ABLE TO SEE IT FROM SEVERAL DIFFERENT VIEWPOINTS AND PERSPECTIVES\n\n","date":"October 31, 2011 at 12:58 pm","url":"https://shroudstory.com/2011/10/24/use-of-coins-in-jewish-burial/","cat":"image_theory","id":"comment-4494","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Use of Coins in Jewish Burial","post":"Ron, looking at the facts we know from the ancient Jewish customs, it just doesn’t fit.  That’s all I say.  It is not logical in the context describe by the gospel.  Now, that doesn’t mean it is 100% that there wasn’t a coin over the eye, but the chances for this to happen are VERY VERY low regarding the context.  You can twist it all you want in your head but the FACT is that the burial rite wasn’t completed when they left the tomb in a hurry on friday night.  In this context, how in the world would people thought of putting pagan coins over the eyes ?  They knew they had to come back to finish the job (one of the job was an anointing of the body) on sunday.\nAgain, I’ll ask this to you :  go ahead and ask people around you (people who doesn’t care about the shroud and are not full of bias over the subject – here I’m not talking about you) :  Is it logical in this context to put coins over the eyes ???  Or you can ask them :  What are the chances for this (coins over the eyes) to happen in this context ???\nLike I said, since science isn’t able to prove or disprove those kind of images (not until a new series of direct researches will be done), we are left with PROBABILITIES.  And sorry to disagree (again) with you but the probabilities are way under the 50 mark !!!!\nAgain, before you explode against me, I’ll say it one more time :  That doesn’t mean the chances are 100% against the coins possibility.  But the chances that real coin images are really there seem to be low.  And in the end, if science prove one day that the images are there, how can you be sure that those are related to Jesus burial ???\n\n","date":"October 30, 2011 at 6:56 pm","url":"https://shroudstory.com/2011/10/24/use-of-coins-in-jewish-burial/","cat":"image_theory","id":"comment-4447","author":"Yannick Clément","site":"shroudstory"},{"title":"Use of Coins in Jewish Burial","post":"First Yannick I’ve never exploded on here yet, second I am not ‘twisting’ anything. Your conclusion that the chance of coins being placed on the eyes during the hasty burial is “Very, Very Low” is nonsence. Period. It is an unsubstantiated claim. Time is not an issue, it would take only moments to place coins over the eyes, so that argument is mute. Ancient Jewish customs? Fact; Most all scholars admit they know very little to 1st century Jewish burial customs. Their information comes from 2nd century writings after the fall of the Jewish revolts and the dispersion of the Jewish people. Alot may have been lost or changed due to this. Fact; Placing coins over the eyes was not substantiated as a ‘Pagan’ practice or stricly used by pagan cultures. Fact; Archeaological findings (many), from 1st century tombs prove it was a ‘practice’ to place coins on the eyes, notice I say practice, not a custom. Fact; The Talmud mentions the need to ‘close the eyes’ of the deceased at burial Fact; protrusions are seen on the 3D renderings of the Shroud over the eyes.\nSome have seen, after intense study what may be writings and symbols matching that of 1st century coins precisly where these protrusions are found….We here on this Blog have had no chance to study so intensly or closely these findings, so how can we make judgement on them? That is precisely why we should not make statements like the chances are ‘very, very low’, when we have no knowledge to such. To me, the whole issue is still open. From what we understand of Jewish burial customs and the circumstances of that particular day; I think I can say quite logically; The chance of coins being placed over Jesus’s eyes by someone at the tomb burial, is just as likely as it not being done….Pretty simple, and makes just as much sense to me.\nR\n\n","date":"November 5, 2011 at 4:24 am","url":"https://shroudstory.com/2011/10/24/use-of-coins-in-jewish-burial/","cat":"image_theory","id":"comment-4593","author":"Ron","site":"shroudstory"},{"title":"Use of Coins in Jewish Burial","post":"It kinda goes against what jesus taught his disciples,”render unto ceased what is ceases and to God’s what is God’s”.So would the disciples have put or let be put coins of the pagan dimensions on the eyes of jesus,I don’t think so.\n\n","date":"May 5, 2013 at 2:52 pm","url":"https://shroudstory.com/2011/10/24/use-of-coins-in-jewish-burial/","cat":"image_theory","id":"comment-32973","author":"Gerard maher","site":"shroudstory"}]
