[{"title":"Watertight Evidence","post":"Not even the Shroud of Arquata shows evidence of the presence of gesso.\n\n","date":"December 13, 2015 at 7:07 am","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216371","author":"Louis","site":"shroudstory"},{"title":"Watertight Evidence","post":"Quite. Gesso is/was needed as a base for paint on either canvas or fine herringbone linen, with the end-product then being stretched taut in a permanent frame for display. It’s hard to see why anyone would choose to use a gesso/paint combination for something that was to be folded or rolled up between intermittent displays, with the near certainty of shedding flakes of paint, though probably less of the weave-penetrating gesso.  One would seek some other means of creating the image, probably one that dispensed with both paint, as the term is normally understood, ie. some kind of ground solid pigment dispersed in a liquid vehicle AND gesso. Indeed, one might reasonably conclude that in the absence of analytical evidence for either calcium carbonate*i.e. chalk or limestone or calcium sulphate*, i.e. gypsum  there was no gesso, and logically no conventional paint either. \n(The well-known presence of abundant calcium ions, Ca++, on the TS is necessary but not sufficient to demonstrate conclusively the presence of gesso, especially as calcium pectate is an important component of flax bast fibres, a variable fraction of which survives the retting process, depending on the technology employed – pond, dew etc).\n\n","date":"December 13, 2015 at 7:30 am","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216373","author":"Colin Berry","site":"shroudstory"},{"title":"Watertight Evidence","post":"But Colin, welcome out from the shed! They actually did gesso painted linens and it was a very skilled job. How else do you think they managed to get paint onto flags, banners an veils that were such a prominent part of medieval life?\nIt is all well  documented so why not do some homework on this?\nWe do h ave a quotation from the 1570s ( in the bible Beldon Scott) with someone actually talking of the dangers of folding and unfolding the Shroud. This was common in the circumstances and we know of the very high attrition rate among painted linens. The few survivors we have today were usually pasted onto boards to stop the paint flaking. Of course in many cases the linens were painted for one big ceremonial occasion and were never designed to last.\nAll there to find out about if you start on your homework!!\n\n","date":"December 13, 2015 at 7:49 am","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216374","author":"Charles Freeman","site":"shroudstory"},{"title":"Watertight Evidence","post":"Charles, with most painted linens of the period, if the paint started to come off it was easily reapplied. Why in the case of the Shroud was this not done?\n\n","date":"December 13, 2015 at 12:36 pm","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216409","author":"David Goulet","site":"shroudstory"},{"title":"Watertight Evidence","post":"David. It will need careful examination of all the depictions of the Shroud over the centuries , not copies , to determine if it was repainted. The best bet would be in the 1570s when the loin cloth appears to have been added and possibly the legs repainted  further apart. This may have been to make the Shroud more visible to the large crowds now wanting to see it after its transfer to Turin. However, an enormous amount of research would need to be done on the depictions of expositions to see if this was the case .\nThe layers of any repainting  are easily detectable on surviving painted linens. Whether the latest scanners would be able to detect layers of pigments on the Shroud I don’t know\nOne more area where research needs to be done!\n\n","date":"December 14, 2015 at 1:49 am","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216456","author":"Charles Freeman","site":"shroudstory"},{"title":"Watertight Evidence","post":"I actually did some research to get to know if gesso was present on the shroud of Arquata since the allegation is that this material was used to paint the Turin Shroud. The answer was negative, no gesso was detected.\nI prefer to consult professionals in their fields as there are just too many amateurs around here and my field is not science.\nHopefully, another Shroud article should be ready by next week.\n\n","date":"December 13, 2015 at 7:50 am","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216375","author":"Louis","site":"shroudstory"},{"title":"Watertight Evidence","post":"The above comment was directed to CB.\n\n","date":"December 13, 2015 at 7:51 am","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216376","author":"Louis","site":"shroudstory"},{"title":"Watertight Evidence","post":"We will see- no rush. These things tend to reveal themselves in time. The speed of research is so quick, especially on these art history objects as so much money is involved – we just hope for spin-offs relating to the Shroud.\nAs yet I have seen nothing in any of Colin’s posts which refutes the once painted hypothesis. Hugh is clearly thinking about it  even if he does not agree with me. No doubt when Colin starts reopening his e-mails he can set out why he is so certain that this was never a painted linen but I have never seen any evidence that he has read up on them. I think he does need to know something about them and why they disintegrated so easily before he comments further. Villers (ed.) The Fabric of Images is such a good starting point.\nAnd I was hoping too whether Colin could confirm that aragonite, as apparently found on the Shroud, is related to calcium carbonate. Perhaps Hugh can stand in on this if Colin is still out in his shed with his flour.\nI also assume that Colin believes himself  to be the courier that everyone is keen to hear. I will leave others to judge that!\n\n","date":"December 13, 2015 at 7:21 am","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216372","author":"Charles Freeman","site":"shroudstory"},{"title":"Watertight Evidence","post":"It is important to get professionals to comment. Sometimes even top scholars leave their field to proffer opinions on topics on which they are not exactly qualified to comment. If one is an expert in NT (martyrdom, for instance) it does not exactly mean that that is a green school to comment on artefacts in the field of biblical archaeology. Sometimes it can even demonstrate that the scholar is not really that well qualified in his/her field either. Take, for instance:\nhttp://www.thedailybeast.com/articles/2015/12/13/is-this-stone-the-clue-to-why-jesus-was-killed.html\nThe best scholars and archaeologists are aware that Jesus was nailed to the cross because he dared to challenge the Sadducees who worked hand in hand with the Romans when it ws convenient to them. When Jesus threatened the existence of the Temple, and consequently the moneybags that the Sadducees had, it was a sign that he had gone beyond the limits in their view. Raymond E. Brown was clear about this point in his classic “The Death of the Messiah”.\nActually Jesus was not really tied to any monument, be it Temple or synagogue, as they were not essential to his message, which was purely spiritual. He could therefore preach in the fields, near the sea, on a mount and so on.\nJesus did not reveal everything he knew; he spoke in parables which are riddles. Developments in OT archaeology can provide us with clues about why he could be cryptic:  https://www.academia.edu/18994343/The_key_role_of_Biblical_Archaeology_in_Exegesis_An_Interview_with_Professor_Israel_Finkelstein\n\n","date":"December 13, 2015 at 8:23 am","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216378","author":"Louis","site":"shroudstory"},{"title":"Watertight Evidence","post":"Aragonite is one of the crystalline forms of calcium carbonate, less common and less stable than the more common calcite. Gerard Lucotte has identified numerous particles of calcite and a few of aragonite among the vacuumed debris of the Shroud.\n\n","date":"December 13, 2015 at 8:45 am","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216384","author":"Hugh Farey","site":"shroudstory"},{"title":"Watertight Evidence","post":"Colin could well use his considerable scientific knowledge to look at the analyses of the gesso that does survive on the medieval painted linens that have  been studied. I think it is from this that we know that calcium carbonate was used in gesso north of the Alps and calcium sulphate for gesso south of the Alps.\nAnyway there is no problem in locating  and analysing surviving medieval gesso and someone will eventually be able to tell us whether the calcium on the Shroud is sufficient evidence of an original gesso. Colin knows for certain that it is not but he will strengthen his case if he can provide some evidence that he has looked at the existing gesso from this period.\nI cannot see the relevance of the gesso not being on the Shroud of Arquata. We know from the medical treatises ,such as that of the Tuscan Cennino Cennini, that gesso was used to seal linen and he gives the instructions for it. Hard to know how you can paint on linen without selling it in some way- you will find lots of instructions in modern textbooks and calcium carbonate still features!\n\n","date":"December 13, 2015 at 9:10 am","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216389","author":"Charles Freeman","site":"shroudstory"},{"title":"Watertight Evidence","post":"Hugh. So are we justified in saying that there is calcium carbonate on the Shroud?\n\n","date":"December 13, 2015 at 10:09 am","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216396","author":"Charles Freeman","site":"shroudstory"},{"title":"Watertight Evidence","post":"Dolimetic Limestone is common in Jerusalem.\n\n","date":"December 13, 2015 at 10:11 am","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216397","author":"Louis","site":"shroudstory"},{"title":"Watertight Evidence","post":"Louis: “Dolimetic Limestone”. Probably you mean “dolomitic”, but dolomite (calcium nagnesium carbonate) is differente from both calcite and aragonite.\n\n","date":"December 13, 2015 at 11:28 am","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216405","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Watertight Evidence","post":"‘Aragonite gesso’ is worth googling.\n\n","date":"December 13, 2015 at 11:56 am","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216406","author":"Charles Freeman","site":"shroudstory"},{"title":"Watertight Evidence","post":"Hello Gian Marco\nHavê a look at http://www.jerusalemstoneusa.com\n\n","date":"December 13, 2015 at 12:29 pm","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216408","author":"Louis","site":"shroudstory"},{"title":"Watertight Evidence","post":"Kenneth Johnson has picked up another skeptic’s annoying habit of putting certain words in quotes when they shouldn’t be, like “The ‘scientists’ who refuted his work had no qualifications to perform the analyses on which they claimed to rely” and “One ‘scientist’ seriously theorized that holy radiation from the resurrection might have transferred the image of Jesus to the cloth.”  STURP had chemists, blood experts and experts in many other disciplines, including from some of the most prestigious scientific institutions in the U.S.  It’s highly improbable that McCrone’s judgments would be more accurate than the combined efforts of about 40 other highly scientists (without quotes).  If McCrone is extrapolated to the story of the blind man and the elephant, he would say that his perspective is the only one worth considering.\n\n","date":"December 13, 2015 at 9:05 am","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216387","author":"jmarino240","site":"shroudstory"},{"title":"Watertight Evidence","post":"Kenneth Johnson also says, “You might better ask how red ochre and vermillion particles get on a real burial cloth.”  Johnson is apparently unaware that many artists were allowed to touch their painted copies to the Shroud to sanctify them.  My guess is that Johnson has done very little reading about the Shroud.\n\n","date":"December 13, 2015 at 9:26 am","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216393","author":"jmarino240","site":"shroudstory"},{"title":"Watertight Evidence","post":"McCrone did the best scientific analysis available.  Looks like red ochre, must be red ochre.\n\n","date":"December 13, 2015 at 9:30 am","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216394","author":"Dcn Andy","site":"shroudstory"},{"title":"Watertight Evidence","post":"Exactly Dcn Andy, I was thinking the same thing -McCrone looked through a microscope, that’s it – and that is supposed to carry more weight than blood experts running actual chemical tests, who say it is blood.  If gesso and paint or iron powder made the image, why can’t we see any gesso in the imaged fibres or those adjacent? Why do close ups of the fibres show very fine coloring of the fibres as by dehydration (or is it proven, so I can leave out the word “as”?).  And I thought only ‘climate scientists ‘ were hacks…\n\n","date":"December 13, 2015 at 2:43 pm","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216413","author":"JGiordano","site":"shroudstory"},{"title":"Watertight Evidence","post":"It is obvious that as Kenneth Johnson trained with Dr. Walter McCrone he has to chant the red ochre mantra and ignore the research of dozens of other qualified scientists.\n\n","date":"December 13, 2015 at 9:39 am","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216395","author":"Louis","site":"shroudstory"},{"title":"Watertight Evidence","post":"I am rereading David Sox’s 1988 book “The Shroud Unmasked” (which incidentally was published and ready to go when the official announcement was made, despite the fact that the labs were supposed to have maintained confidentiality).  In his introduction he says, “There were times when I thought I would never live to see the day the Turin Shroud faced its obvious test.  The road to carbon dating has been long, contentious and convoluted.  There are those who will not appreciate mine and others’ effort to have this test.  That’s their problem.  When you open Pandora’s box, you have to be prepared for whatever comes out.  I have always wondered why many so fascinated with the Shroud mystery were afraid to see the end of the story.”  Sox is right about the dating having been contentious and convoluted, and it’s for that very reason that many people feel that the 1988 results are not the end of the story.\n\n","date":"December 13, 2015 at 4:36 pm","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216421","author":"jmarino240","site":"shroudstory"},{"title":"Watertight Evidence","post":"Pandora’s box could be closed, simply by asking the custodians of the TS to allow a return visit by one or more radiocarbon daters, using  more sensitive 21st century methods. The latter could use single excised t threads (the damage being scarcely visible) rather than disfiguring snipped-out rectangles ( I thank Hugh Farey for making that observation). \nThose tiny threads could be taken from central locations, closer to image areas, reducing the chance that the sampled areas (minimally handled by clerics, bishops etc,) had been ‘invisibly mended’  at some time in the distant past.\nPersonally speaking, I do not understand the failure of the Shroud’s custodians to commission a repeat C-14 dating, taking into consideration the controversy and accusations of there having been a “fix” as regards the first, despite three different labs having each done separate analyses by their preferred techniques. \nI think Turin, the Vatican etc owe it so science to put an end to all the dark whispers and accusations, having invited different teams of scientists in 3 independent  labs to give it their best shot in 1988.\nhttps://www.shroud.com/nature.htm\n\n","date":"December 13, 2015 at 5:06 pm","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216424","author":"Colin Berry","site":"shroudstory"},{"title":"Watertight Evidence","post":"+1 to Colin, I don’t understand the lack of new testing either – unless it is because, as Roy Rodgers stated in that documentary just before he died, the TS is now saturated in insecticide that was sprayed into its storage box.  If there is no way to reliably separate out all that extra C from that or from centuries of candle smoke, then maybe testing the charred bits of TS that were removed during that big ‘cleaning’in 2002.  Those bits from the big burn holes would also be subject to extra C from burning candles and CO2 flowing through it when exposed to the faithful. That would be from the time it was made (AD30+ or medieval ) to the time of the big fire.  After that I don’t think those pieces would be affected much by anything, so it would serve as a good indicator.  If it came out as 1290-1360, then all the labs really did a good job.  If it came out 1st century ….. But I have a feeling it might come out with something else, in between probably.  I’m saying that, having heard of a mummy that was 1000 years older than the linen wrappings – even though it doesn’t look like it was rewrapped since the blood and other decay fluids had penetrated it.  Anyways testing it is better than not testing it, and no one is going to miss a few threads from here and there (the 2002 cleaning did more damage…).  And labs should refuse to do the testing unless the proper protocols are followed.\nAside to Colin – do your images fluores (?) in UV?  If they do, do you see that as the end of the road for your experiments, or do you have a plan for more experiments to deal with that.\n\n","date":"December 13, 2015 at 9:38 pm","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216446","author":"JGiordano","site":"shroudstory"},{"title":"Watertight Evidence","post":"Insecticide? That’s presumably a reference to thymol – which in connection with radiocarbon dating was chemical scaremongering from someone who should have known better.\nI’ll update on the fluorescence and (maybe) future research priorities in the next week or two.\n\n","date":"December 14, 2015 at 6:13 am","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216467","author":"Colin Berry","site":"shroudstory"},{"title":"Watertight Evidence","post":"That’s it thymol.  But please save the attitude, and stick to the facts.  If you think the thymol would be easy to remove and new c14 tests can be done reliably, just state so and let us know why, adding to the body of knowledge. Rodgers, in the documentary revealing the re-weaving hypothesis and the dyed fibres, seemed to think the thymol kills any chance for new tests, other than on the removed charred pieces.\n\n","date":"December 14, 2015 at 9:02 am","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216475","author":"JGiordano","site":"shroudstory"},{"title":"Watertight Evidence","post":"I have nothing further to add to what I have said previously on this site re the thymol scaremongering. Google and ye may find.\n\n","date":"December 14, 2015 at 10:01 am","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216480","author":"Colin Berry","site":"shroudstory"},{"title":"Watertight Evidence","post":"I think Rogers was being overtheoretical here. I have mentioned “The Late Glacial and Holocene development of vegetation in the area of a fossil lake in the Skaliska Basin (north-eastern Poland) inferred from pollen analysis and radiocarbon dating”, by Piotr Kolaczek et al, in Acta Palaeobotanica, 53(1), in which the possible effects of thymol on radiocarbon dating are discussed but not found significant.\n\n","date":"December 14, 2015 at 10:16 am","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216482","author":"Hugh Farey","site":"shroudstory"},{"title":"Watertight Evidence","post":"Here’s a thought, and maybe it’s unfair, maybe not….perhaps the Church don’t want to retest, because if it gave another medieval age, it would essentially be “game over” for the authentic case. There is some benefit to only having been one test, because all sorts of conspiracies (credible or not) can be cast over the one carbon dating process. That preserves the hope of authenticity, and the associated mystique.\nOn balance, I slightly favor the authentic case. But I think another test needs to be done. I just want o know the truth. Either way, it doesn’t affect my faith.\n\n","date":"December 15, 2015 at 2:47 am","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216543","author":"Thomas","site":"shroudstory"},{"title":"Watertight Evidence","post":"Ian Wilson didn’t present the Rev. David Sox in favourable light when he was the BSTS newsletter editor. The reader was given to understand that he had something to do with the leaked results and it seems that he resigned from the society.\nAnyway, tell us about your views after you finish the book.\n\n","date":"December 13, 2015 at 5:05 pm","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216423","author":"Louis","site":"shroudstory"},{"title":"Watertight Evidence","post":"From the books by Sox and Gove, respectively, one learns what follows. Gove and his secretary Ms Brignall were in London from 15 to 19 June 1988 and met Sox. Immediately after they left, on 20 June, Sox went from London to Turin for informing Rinaldi about the result of the radiocarbon test. It is tempting to suppose that Sox was informed by Gove or Brignall or both. I would suspect of Brignall. Indeed Gove, without Brignall, had been in London on 12 May, and the following days, and had met Sox, but that time Sox did not travel to Turin. Therefore Gove, when alone, had not informed Sox. Of course all of this is only hypothetical but it seems to be an interesting clue.\n\n","date":"December 13, 2015 at 7:15 pm","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216433","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Watertight Evidence","post":"I got the impression that David Sox was up to mischief making after reading Ian Wilson’s report. The fact that he left the scène  leads to more mystery.\n\n","date":"December 13, 2015 at 7:25 pm","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216434","author":"Louis","site":"shroudstory"},{"title":"Watertight Evidence","post":"Regarding the C-14 controversy, I recommend the documentary “Night of the Shroud,” which includes interesting revelations from Gonella’s correspondence files.  It’s available at amazon.com for $13.38 but it won’t play on most DVDs sold in the U.S.  I think it will play on most computers.  The link is:  http://www.amazon.com/Shroud-Sindone-NON-USA-FORMAT-Import/dp/B00B67CFMC .  The description is:  SYNOPSIS: THE NEW INVESTIGATION-documentary THE NIGHT OF THE SHROUD produced by RAI and directed by Francesca Saracino, seeks to clarify, with new and unpublished documents, the mountain of doubt about the dating of the Shroud by the carbon 14. It was already known to the carelessness with which they were performed in the late 80s, but radiocarbon testing of this investigation brings to light, with the help of unpublished papers and interesting interviews in world premiere a voluntary controlled, almost fraudulent, in errors and approximations, To enrich the film, the presence of Rosalinda Celentano ( The Passion of the Christ) who read questions in search of answers. Lost among the columns of a medieval church, the actress stimulates the curiosity of the viewer less experienced, refresh his memory on one of the most fascinating topics of Christianity.\n\n","date":"December 13, 2015 at 6:19 pm","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216429","author":"jmarino240","site":"shroudstory"},{"title":"Watertight Evidence","post":"I think that Saracino’s is one of the worst documentaries ever produced. I have written a criticism here:\nhttp://sindone.weebly.com/uploads/1/2/2/0/1220953/notte_complottopart_1.pdf\nIt is a 67 pages pdf and I have considered only one aspect, the conspiracy theories. Sorry it is in Italian.\nMs Saracino, with whom I have been in contact by mail, has not attempted any reply.\n\n","date":"December 13, 2015 at 7:36 pm","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216438","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Watertight Evidence","post":"My computer accepts PAL SECAM and I’ll try to find out more about the production in Italy. One wonders just how many gaps were filled. The Church continues to be suspicious and that is evident in the last q/r in the interview with Professor Paolo Di Lázaro.\nThat was also what I gauged in my interviews with Daniel Raffard de Brienne and Father Heinrich Pfeiffer.\n\n","date":"December 13, 2015 at 7:34 pm","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216437","author":"Louis","site":"shroudstory"},{"title":"Watertight Evidence","post":"Dan’s blog from June 8, 2012 had the following:  “New York Film Academy graduate Francesca Saracino’s film, The Night of the Shroud, recently won Best Documentary, Best Director, and Best Visual Effects at the Los Angeles Movie Awards. The controversial documentary investigates the authenticity of the Shroud of Turin, a centuries-old linen cloth that bears the image of a crucified man, believed by some to be the cloth in which Jesus was buried. The investigation is hosted by Italian actress Rosalinda Celentano, known for her role as Satan in Mel Gibson’s The Passion of the Christ. It uncovers previously unseen research papers, audio files, videos, and correspondence from researchers, cardinals, and Pope Benedict XVI.\n\n","date":"December 13, 2015 at 8:15 pm","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216442","author":"jmarino240","site":"shroudstory"},{"title":"Watertight Evidence","post":"Yes, I remember now.\n\n","date":"December 14, 2015 at 4:43 am","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216462","author":"Louis","site":"shroudstory"},{"title":"Watertight Evidence","post":"Sorry…\nI want to remember what\nI have read:\nFriday, December 11th\nhas died in Madrid father Héctor Guerra LC,\npresident of “Othonia” and professor of\nthe Regina Apostolorum.\nBorn in 1953, Legionary of Christ priest,\nscholar of the Shroud, Father Guerra\nhad devoted the last decade of his life also\nto promote awareness of the Holy Cloth\nof Turin, as a relic and as an instrument\nof evangelization…\n\n","date":"December 16, 2015 at 12:49 pm","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216664","author":"piero","site":"shroudstory"},{"title":"Watertight Evidence","post":"… He with Father Rafael Pascual LC,\ndirector of the Institute on Religion and\nScience, founded in 2009 Othonia, an\ninternational NGO, non-profit organization,\nwhose objective is “to contribute to the\nimprovement, development, training,\npromotion and dissemination of knowledge\nrelated to Shroud between different\npeoples and cultures of the world. “…\n\n","date":"December 16, 2015 at 12:50 pm","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216665","author":"piero","site":"shroudstory"},{"title":"Watertight Evidence","post":"Here I try to return on the discussion with a strange problem.\nA madder treatment (see also the particular claims by Adrie van der Hoeven) can be scraped off or removed with adhesive or diimide.\nUnfortunately (until now) I never saw the inherent experiments…\nAnother particular problem linked to “Madder treatment”:\nI would be curious to know what is the result obtained from an experiment based on hemocyainin and Madder (see also the Biochemistry of metal – protein and Oxygen transport in molluscs). Perhaps another shade of red or violet ….?\n\n","date":"December 17, 2015 at 12:49 pm","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216727","author":"piero","site":"shroudstory"},{"title":"Watertight Evidence","post":"Final comment. Dan ends his post by saying that the ‘ watertight evidence ‘ might not be  what I hoped for. I have read this blog for some time and no one has come up with any satisfactory explanation for the images – certainly none that anyone outside the Shroud community would accept,\nThere is,I believe, a fundamental problem in assuming, by Colin and STURP and many others, that the Shroud is now as it was when it was made whether in the fourteenth century or earlier. This is extraordinarily unlikely unless the Shroud had been sealed in an Egyptian tomb. In fact, we know it has been exposed in the open air many many times. Fanti has got as far as accepting that linen degrades over time( although he has the bizarre idea that it degrades at a common rate- does a linen stored in a container really degrade at the same rate as one left out in the rain?) Yet Fanti and others, including Colin, never imagine that images in that linen will also degrade over time. Until this is recognised Shroud studies are in limbo.\nOne you look for alternative examples of images on linen, you find that painted images on linen were very common- thousands are recorded in inventories ,etc.yet the attrition rate of the images was very high especially if the linen is folded and unfolded. This is why most painted linens were thrown away after they had fulfilled an immediate purpose. The question remains whether a painted linen, sealed and painted according to the medieval treatises, left any discolouration of the linen just below where the sealant was, and thus only on the top fibres of the linen\nResearch on painted linens is comparatively recent as so few have survived but scanners are now able to analyse gessoes, pigments, repaintings, far beyond anything possible in 1978. At this point I have to hand over to conservationists who deal with these linens to see how far the Shroud fits as a once painted linen. I think it is promising and that with further research the Shroud will actually seem quite typical of the fourteenth century and while very rare of its type, not that much of a mystery at all. The iconography, with the pattern of bloodstains and the scourge marks both front and back, is certainly very typical of the fourteenth century. The Holkham Bible illustrations are helpful here.\nSo we shall see but it certainly will not be a historian but linen conservationists who will provide the solution, one way or the other. Good luck to them and to Dan in his retirement!\n\n","date":"December 20, 2015 at 11:11 am","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-216903","author":"Charles Freeman","site":"shroudstory"},{"title":"Watertight Evidence","post":"Reblogged this on Best of Shroud Story.\n\n","date":"December 27, 2015 at 1:29 pm","url":"https://shroudstory.com/2015/12/13/watertight-evidence/","cat":"image_theory","id":"comment-217288","author":"Dan","site":"shroudstory"}]
