[{"title":"Weakened image fibers","post":"“I was reading Colin Berry’s recent posting which makes an important claim, namely that it is impossible for the image to have been formed without heat.”\nDo you think Colin Berry is really going down this path?\nHe seems to be reluctant to take a definitive stand any longer for his scorch hypothesis.\n\n","date":"November 15, 2014 at 5:42 am","url":"https://shroudstory.com/2014/11/15/weakened-image-fibers/","cat":"image_theory","id":"comment-171360","author":"anoxie","site":"shroudstory"},{"title":"Weakened image fibers","post":"“It’s entirely impossible for the image to have been formed with no application of heat. ”\nThree minutes after posting that as a comment on my own site, I spotted the typo and posted this:\n    Correction: last paragraph above. “It’s NOT entirely impossible for the image to have been formed with no application of heat.”\nWithout that NOT, the section that followed on plant saps that leave a permanent stain without heat would not have made sense.\nIn fact, the correction makes little difference to the sense, namely that chemical imprinting, whether by scorching or external chemicals, benefits from a raising of temperature, as do all chemical reactions, or at any rate those that are under kinetic control at ordinary temperatures. Luigi Garlaschelli’s ochre ‘frottage’ has a heating step if one reads the small print, described as “artificial ageing”. Ray Rogers used 66 degrees C in his modelling of Maillard reactions with ammonia and dextrins.\nAlpha particles?  Sorry, not my scene. I believe the TS was fabricated in the 14th century to be seen as if it were a sweat imprint. No, not a conventional painting, CharlesF, and probably not made using actual sweat or other fluids, but something that merely looked as it it could be a dried-on sweat deposit , a bigger version of the Veil of Veronica ‘face-cloth’ of the same alleged bio-imprinting process.\nI must now get back to my own site, in order to tackle Giulio Fanti on the views he expressed re template-scorching in that interview with Louis, having only picked up on them yesterday. I may be gone a while. Methinks Associate Professor Fanti needs to theorize less, and get hands-on experimental data first.\n\n","date":"November 15, 2014 at 5:54 am","url":"https://shroudstory.com/2014/11/15/weakened-image-fibers/","cat":"image_theory","id":"comment-171364","author":"Colin Berry","site":"shroudstory"},{"title":"Weakened image fibers","post":"” Ray Rogers used 66 degrees C in his modelling of Maillard reactions”\nIt was to quicken the reaction, not because it was thermodynamically not feasible at ambiant temperature.\nRay Rogers theory was about a chemical reaction.\nYour theory was all about heat.\nThere is a lot of material on this blog, in your postings and comments, which prove how opposed you were to my arguments, and now, you’re talking about a “chemical imprint”.\nI’m glad to hear that, but I can’t see how you can justify such a flip flop, no way, ever. It’s science, not politics.\n\n","date":"November 15, 2014 at 6:50 am","url":"https://shroudstory.com/2014/11/15/weakened-image-fibers/","cat":"image_theory","id":"comment-171375","author":"anoxie","site":"shroudstory"},{"title":"Weakened image fibers","post":"Good afternoon,Colin. It was nice to see your comment above, where you said you will now tackle Professor Fanti on the views he expressed in the interview he gave me. I would love to see your objections and then it will be my turn to do some tackling together with some scientist, not necessarily one in the realm of Shroud studies. If Shroud scientists are interested in joining the discussion they know where to find me.\nBy the way, Professor Fanti also says he has changed his mind and in that sense he is like you and it is supposed to be good science to proceed that way. He switched from light to electric field when it comes to the image-formation process:   https://www.academia.edu/8841978/Professor_Giulio_Fanti_discusses_the_controversies_in_the_realm_of_Shroud_studies\n\n","date":"November 15, 2014 at 8:31 am","url":"https://shroudstory.com/2014/11/15/weakened-image-fibers/","cat":"image_theory","id":"comment-171397","author":"Louis","site":"shroudstory"}]
