[{"title":"What is Colin Berry talking about?","post":"Seems as if he means “I do science like Walter McCrone.  If it looks superficial, then it is superficial.  No microscopic examination necessary.  Yet we know the Shroud image is only on one side of the linen cell wall on the topmost fibers.\n\n","date":"September 7, 2012 at 10:48 am","url":"https://shroudstory.com/2012/09/07/what-is-colin-berry-talking-about/","cat":"image_theory","id":"comment-15989","author":"Andy Weiss","site":"shroudstory"},{"title":"What is Colin Berry talking about?","post":"What in the world is Colin thinking? Where are his measurements? Does he even know what superficiality means?\nThere are several aspect of the superficiality of the image that cannot be ignored. The first three are absolute superficiality characteristics of the image. The last three are likely consequences of that superficiality.\n1. The image does not penetrate below the topmost two or three fibrils of the yarn\n2. The discoloration of the fibrils themselves, presumably from dehydration and oxidation, is between 200 and 600 nanometers thick (billionths of a meter).\n3. The medulla of the fiber is clear in both image and non-image fibrils\n4. The image can be removed from a fibril with adhesive tape.\n5. The image doesn’t fluoresce in UV light.\n6. The halftone effect evident in the image is from striated color patterns.\n\n","date":"September 7, 2012 at 12:21 pm","url":"https://shroudstory.com/2012/09/07/what-is-colin-berry-talking-about/","cat":"image_theory","id":"comment-15995","author":"Paulette","site":"shroudstory"},{"title":"What is Colin Berry talking about?","post":"Paulette; please let’s not quibble about the details, Colin Berry has MANAGED to scourch linen here…. ;-)\nR\n\n","date":"September 7, 2012 at 5:16 pm","url":"https://shroudstory.com/2012/09/07/what-is-colin-berry-talking-about/","cat":"image_theory","id":"comment-16002","author":"Ron","site":"shroudstory"},{"title":"What is Colin Berry talking about?","post":"And a monumental scorching at that, Ron.  :o)\n\n","date":"September 8, 2012 at 2:11 pm","url":"https://shroudstory.com/2012/09/07/what-is-colin-berry-talking-about/","cat":"image_theory","id":"comment-16020","author":"Andy Weiss","site":"shroudstory"}]
