[{"title":"What’s in a linen fiber?","post":"When is a scorch a  scorch?\nI am beginning to think that the whole issue of a “scorch” is a tempest in a Oxonian tea pot. If the intent is to prove that that the Shroud could have been faked by a “scorch”, so what?\nSome hypothesize that the image was caused by a burst of energy or light. An Italian scientist claims to have come closer than anyone else through the use of a laser process. Essentially, a light scorch.\nLet me introduce you to a former neighbor of mine in Riverdale, the late Martin Tytell. Martin was a questioned document examiner and a forensic expert on typewriters. He was retained by the defense team of Alger Hiss to demonstrate that the stolen cables from the State Department that were retyped by his wife on an Woodstock typewriter could have been faked because it was possible to duplicate the attributes of the Underwood. The claim was the FBI framed Hiss by so doing. By God he did it, although it took two years and the Courts appear disinterested in the results of his labor. Because something can be forged, it doesn’t mean that the thing has been forged. In the case of the Shroud, there is yet no evidence of how the Shroud in toto could have been forged.\nPerhaps Collin Berry should adjust his goals. If his intent is to prove the Shroud is a fake because he can forge a copy, he has failed miserably. IF his intent to to come-up with a process explaining how the image was made, he should keep on, keeping on. There are many in the Shroud world who are ready to accept a “natural” explanation of the image. But then we arrive at a question: what is natural?\nNo one as yet come with in a country mile of duplicating the Shroud image by a natural process. We can get copies made to day that imitate he Shroud but they are copies of the Shroud. The creation process of  the image remains a mystery. No one has produced an original image from scratch that duplicates the Shroud.\nI think there is a corollary of sorts to Occam’s Razor. Exceptional events require exceptional explanations. The Shroud image is an exceptional event. All the frustrated labor that has gone into attempts to create an “original” duplicate have been in vain. By original duplicate I mean a double image of the body of a crucified man with his wounds in exquisite detail created with a maximum of 48 hours that is not a copy of the Shroud itself.  Hasn’t been done yet. \nIf you have to ask me why 48 hours, the answer is simple. The forensic pathologists who have reviewed in detail the Shroud have concluded that it shows evidence of rigor mortis and no evidence of putrefaction. Rigor mortis freezes the muscles soon after death but releases normally in 48 hours. Similarly, putrefaction begins to exude all kinds of nasty stuff after 48 hours. \nStrange coincidence: all four Gospels have Mary Magdalene discovering the empty tomb on Sunday morning at day break – roughly 6:00 AM, approximately 39 hours after Christ expired on the cross.\nI believe that mystery of the image will be finally be resolved, if ever, by reference to a process on the quantum level – the laser, for example,  being essential a quantum mechanical application.\nIs that way out? How about this quotation from a well known, screwball publication (now known as Bloomberg Business Week.)\n“Developing quantum theory was ‘the crowning intellectual achievement of the last century,’ says California Institute of Technology physicist John Preskill. It’s the underlying principle for many of today’s devices, from lasers to magnetic resonance imaging machines. And these may prove to be just the low-hanging fruit. Many scientists foresee revolutionary technologies based on the truly strange properties of the quantum world.”\nBusiness Week, March 15, 2004\nCited in: Rosenblum, Bruce; Kutter, Fred (2011-07-01). Quantum Enigma : Physics Encounters Consciousness (Kindle Locations 1862-1866). Oxford University Press. Kindle Edition.\n\n","date":"January 20, 2013 at 11:34 am","url":"https://shroudstory.com/2013/01/20/whats-in-a-linen-fi-ber/","cat":"image_theory","id":"comment-22302","author":"John Klotz","site":"shroudstory"},{"title":"What’s in a linen fiber?","post":"TYPO: I refer to the Hiss typewriter as an “Underwood” once. It was a Woodstock.”\n\n","date":"January 20, 2013 at 11:40 am","url":"https://shroudstory.com/2013/01/20/whats-in-a-linen-fi-ber/","cat":"image_theory","id":"comment-22304","author":"John Klotz","site":"shroudstory"},{"title":"What’s in a linen fiber?","post":"Good comment, John.\nAs a newish but unashamedly prolific commenter on both sites myself, I have been treating the scorch hypothesis more as way in to a closer understanding of the nature of linen degradation than as an obvious solution to the image formation problem. I have experimented at length with UV fluorescence, and am currently working on superficiality. I have dabbled in different possible coatings, and different possible reactants with them such as ammonia and urea. The 3D quality of the image is a more long term goal, as my software is currently not up to it.\nNeedless to say I have not made a shroud – I haven’t even made a face – but I have begun to understand the processes required to do so, and understood that very few people, including the sainted Ray Rogers, have managed to discolour linen at all, with anything, without also having to heat it up to temperatures that can be interpreted as scorching.\nI’m afraid I will not be exploring the quantum possibilities of the shroud. I have a school laboratory, a UV light and a microscope, but not a Large Hadron Collider. Not even a Small Hadron Collider, in fact. Sadly I suspect current speculation about quantum processes forming the image can scarcely be termed even a hypothesis. As the underlying principle for the whole of physics, it is, of course, behind lasers and MIR machines, but also candles, biscuits and butterflies, all of which were developed without any reference to their underlying principles.\nBack to the text. We should not get hung up on the 48 hours thing. If the shroud image was not created by a decomposing body, then there is no need for it to have taken any particular length of time. And just because all four Gospels agree on something is not of itself proof that it actually happened.\nBack to my microscope…\n\n","date":"January 20, 2013 at 1:24 pm","url":"https://shroudstory.com/2013/01/20/whats-in-a-linen-fi-ber/","cat":"image_theory","id":"comment-22311","author":"Hugh Farey","site":"shroudstory"},{"title":"What’s in a linen fiber?","post":"Colin has now a microscope.\nWhy does he not write a paper about his observations at fabric, thread and fiber level?\n\n","date":"January 20, 2013 at 3:48 pm","url":"https://shroudstory.com/2013/01/20/whats-in-a-linen-fi-ber/","cat":"image_theory","id":"comment-22313","author":"Thibault HEIMBURGER","site":"shroudstory"}]
