[{"title":"When is a Scorch NOT a Scorch?","post":"Oh Boy, As I have said before, the Shroud of Christ is a gift from God to us.  Believe in it if you will.  I hope that I am misconstruing what I am reading.  It kind of looks like some people have to know how the Shroud was made to look as it does.  They want to do it them selves. They, seem to me, to be wanting to mimic God.  Wasn’t that already attempted by the one we have named Satan ??  You have already determined it was not human made, accept that and don’t try to be a God and make one for yourselves…\n\n","date":"August 27, 2013 at 2:24 pm","url":"https://shroudstory.com/2013/08/27/when-is-a-scorch-not-a-scorch/","cat":"image_theory","id":"comment-42146","author":"Emmett McMahon","site":"shroudstory"},{"title":"When is a Scorch NOT a Scorch?","post":"If it were possible to mimic the Shroud of Turin, it would already have been done.  It is a thorn in the side to every atheist alive, because they cannot disprove it.  The more it has been studied, the more it points to its Divine origin.  He knew that the time would come when Christians would be hated, spat upon, and His name would be spoken without reverence and in great blasphemy. He left us, the Catholic and the Protestant.the Orthodox and the Coptic, those who must pray in silence out of fear, a postcard.  This postcard could only be read when the camera was invented, and only now, can the Postmark be confirmed thru diligent study.  He is telling us He is coming for his children soon, and very soon.  And the more it is maligned, mocked,  and ignored by the godless, the higher and brighter it will shine.  Even so, come Lord Jesus.\n\n","date":"August 28, 2013 at 6:49 pm","url":"https://shroudstory.com/2013/08/27/when-is-a-scorch-not-a-scorch/","cat":"image_theory","id":"comment-42254","author":"Josie L. Tyner","site":"shroudstory"},{"title":"When is a Scorch NOT a Scorch?","post":"Thank you Josie, you are a much more eloquent speaker than I am.  You hit it on the nail head.  It has taken until these days to really prove and accept what the Shroud really is.  It is not just an old shred of cloth from some dead guys grave.\n\n","date":"August 28, 2013 at 7:35 pm","url":"https://shroudstory.com/2013/08/27/when-is-a-scorch-not-a-scorch/","cat":"image_theory","id":"comment-42257","author":"Emmett McMahon","site":"shroudstory"},{"title":"When is a Scorch NOT a Scorch?","post":"Part of exploring the Shroud is looking at the clues.  Some of those clues come from science, others from history.  If the Shroud is authentic then there must be clues in the bible as well.\n\n","date":"August 27, 2013 at 8:27 pm","url":"https://shroudstory.com/2013/08/27/when-is-a-scorch-not-a-scorch/","cat":"image_theory","id":"comment-42170","author":"Russ Breault","site":"shroudstory"},{"title":"When is a Scorch NOT a Scorch?","post":"At first this may seem like a weird question, but did the disciples make any comments about the Lord’s dirty laundry or what ever it was referred to as in those days??  that was written about in the Bible??\n\n","date":"August 27, 2013 at 11:21 pm","url":"https://shroudstory.com/2013/08/27/when-is-a-scorch-not-a-scorch/","cat":"image_theory","id":"comment-42183","author":"Emmett McMahon","site":"shroudstory"},{"title":"When is a Scorch NOT a Scorch?","post":"Re possible/intriguing parallels in the Tanakh or Hebrew Bible as far as the Turin Shroud  is concerned: \n1/The Gospels of the) Hebrews relates that “[after his death on the cross] Yeshua ben Joseph (II) (betrayed by Judah for 30 pieces of silver, the price for a slave then) gave his shroud to “the servant of the priest”, went to Jacob and appeared to him”. \nHence the shroud that had been bought by Joseph (III) of Aramathia can be read in the bibical light of the Joseph ben Jacob and his half-brothers’ story:  \nJoseph (I) was sold as slave for 20 pieces of silver. The half-brothers then dipped his coat/garment into the blood of a slaughtered male goat and brought it back to Jacob as proof of his death. Jacob deeply mourned for his son, believing him dead though he was not. (Genesis 37:12-35)\n2/ In Jer. 34:18-19, Jeremiah  enters into a covenant with his people to free all their Hebrew slaves by cutting a “calf [of the year]” (= in Italian torellino = tor(ell)ino = torino = Turin) in twain (a word which, most curiously sounds like Turin!) and having “all the people of the land” passed between the halves of the calf/tor(ell)ino/turin. That ceremony created a ritual identification between the covenantors and the cut-up animal.\nNow if we take a look at the Tor(ell)ino/Turin Shroud, the faintly apparent frontal and dorsal bloody imprints of the crucifixion victim look divided on the inner side of the linen cloth and, symbolically speaking,  can be read as a sign of a convenant/sacrifice/man ‘cut in twain’…\nJust a thought…\n\n","date":"August 29, 2013 at 6:16 am","url":"https://shroudstory.com/2013/08/27/when-is-a-scorch-not-a-scorch/","cat":"image_theory","id":"comment-42296","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"When is a Scorch NOT a Scorch?","post":"It also works in French Taurillon/T(a)uri(llo)n = Turin = Torino, Tori(nell)o\n\n","date":"August 29, 2013 at 6:20 am","url":"https://shroudstory.com/2013/08/27/when-is-a-scorch-not-a-scorch/","cat":"image_theory","id":"comment-42297","author":"Max Patrick Hamon","site":"shroudstory"}]
